{
  "title": "5 sentenced to death for blasphemy by Rawalpindi court - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Rawalpindi court sentenced five men accused of blasphemy to death, life imprisonment and a total of 100 years in prison, according to the court’s orders issued on Tuesday.\n\nPer the copy of the first information report (FIR) seen by Dawn.com, the case was filed by the Federal Investigation Agency (FIA) under Sections 109 (punishment of abetment if the act abetted is committed in consequence and where no express provision is made for its punishment), 295A (deliberate and malicious acts intended to outrage religious feelings of any class by insulting its religion or religious beliefs), 295B (defiling, etc, of [a] copy of Holy Quran) and 295C (use of derogatory remarks, etc, in respect of the Holy Prophet) of the Pakistan Penal Code (PPC) and Section 11 (hate speech) of the Prevention of Electronic Crimes Act (Peca).\n\nThe complainant submitted an application alleging that blasphemous content was being shared on social media and WhatsApp.\n\n“[The suspect] is coming to Rawalpindi and if [a] timely raid is conducted, the alleged person could be caught with the mobile device in which he is using the alleged Facebook account being used in sharing blasphemous content online,” the FIR read.\n\nThe Deputy Director of the Anti-Blasphemy unit authorised a raid near Airport Chowk, where the police team identified one of the suspects and searched him, recovering his phone.\n\nA technical analysis of the phone’s data confirmed that the alleged Facebook account had been logged into, showing multiple blasphemous images, which, according to the FIR, were a “clear attempt to hurt the religious sentiments of Muslims”. Four other suspects were identified through the Facebook account.\n\nAccording to the court order, announced and issued on Tuesday by Rawalpindi Additional Sessions Judge Muhammad Tariq Ayub, the five accused were all sentenced to death under Section 295C, awarded life imprisonment under Section 295B, and awarded 10 years imprisonment and a fine of Rs100,000 under Section 295A.\n\nThe accused were additionally sentenced to three years imprisonment and handed a fine of Rs100,000 for violating Section 298A (use of derogatory remarks, etc, in respect of holy personages) of the PPC and awarded another seven years of imprisonment and a fine of Rs100,000 under Section 11 of Peca.\n\n“All the above-mentioned sentences of imprisonment shall run concurrently,” the judge ordered. “Benefit of the section 382B (period of detention to be considered while awarding sentence of imprisonment) of CrPC (Code of Criminal Procedure) is given to the accused persons, death sentence of the accused persons shall not be executed unless the same is confirmed by the Honourable Lahore High Court, Lahore.”\n\nBlasphemy is an incendiary charge in Pakistan, where even unsubstantiated accusations can incite public outrage and lead to lynchings.\n\nYouTuber Rajab Butt was booked under blasphemy and cybercrime laws due to a “religious stir” caused by the launch of his perfume brand that allegedly mocked Pakistan’s blasphemy law, it emerged on Tuesday.\n\nIn a recent video, since deleted from his social media accounts, Butt launched his “295” perfume which refers to the namesake blasphemy law in the PPC. He said it followed a case filed against him last year, over an earlier video deemed blasphemous by hardliners.\n\nHis perfume publicity sparked further ire, prompting a leader of the religiopolitical Tehreek-i-Labbaik Pakistan (TLP) party to file an FIR with Lahore’s Nishtar Colony Police Station on Monday under PPC Section 295A and Section 11 of Peca.\n\nEarlier this year, a Lahore sessions court sentenced a man to death for committing blasphemy against Islamic figures and religious rituals.\n\nAccording to the court order announced and issued today by Additional Sessions Judge Syed Shahzad Muzaffar Hamdani, the man was formally indicted on January 27, 2021. The judge sentenced the man to death by hanging and subject to a Rs500,000 fine for violating section 295C.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:27:43.912Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900468/5-sentenced-to-death-for-blasphemy-by-rawalpindi-court",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T13:33:48.000Z"
}
