{
  "title": "T-bills attract $1.14bn in 8MFY25 - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite declining returns, foreign investors parked over $1 billion in the Treasury Bills (T-bills) in the first eight months of FY25.\n\nHowever, 84 per cent of this inflow left the country during the same period, according to data released by the State Bank of Pakistan (SBP) on Tuesday.\n\nThe short-term T-bill tenors remained the key attraction, as most inflows came from the United Kingdom and the United Arab Emirates.\n\nFinancial experts believe that the inflows from the UK and UAE mostly belong to the overseas Pakistanis since the returns on T-bills were much higher than those countries.\n\nA large number of Pakistanis are living in these two countries. The returns on these countries are in the range of 3-5pc.\n\nForeign investors withdraw $969m\n\nThe returns on T-bills started falling in FY25 with a steep deceleration in inflation and, consequently, the interest rates.\n\nThe SBP policy rate dropped from 22pc to 12pc while the return on T-bill fell close to this rate.\n\nAccording to the SBP data, the T-bills attracted $1.147bn investment during July-February FY25. The month-to-month data showed the inflows remained high despite a fall in the returns. At the same time, the withdrawals were also high during the period.\n\nThe foreign investors took advantage of high-yield short-term T-bills while they abandoned the long-term Pakistan Investment Bonds.\n\nFinancial experts said the quick earnings from short-tenor T-bills would remain attractive since the returns are still much higher than the rates in the developed economies.\n\nThe T-bills attracted the highest $701m or 61pc of the total T-bills inflow from the UK, followed by $222m from the UAE in 8MFY25. Other significant inflows were $71m from Bahrain and $64m from Australia.\n\nSimilarly, the UK investors withdrew the highest amount of $552.5m, including profit and the principal during this period.\n\nThe second highest outflow of $137m was for the UAE and $41m for Australia.\n\nThe total outflows from the T-bills were $969m or 84.5pc of the total inflows during this period.\n\nHigh returns were offered to attract foreign investment in the government papers, but the pandemic in 2019 badly damaged this scheme.\n\nSince then, foreign investors have been unwilling to invest in longer tenors. This is why outflows remain close to the inflows in the T-bills.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e35dc50cd2b.gif",
  "retrievedAt": "2025-08-25T15:28:13.496Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900383/t-bills-attract-114bn-in-8mfy25",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:25.000Z"
}
