{
  "title": "Chickens coming home... - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE have been some recent posts on social media claiming that admission numbers in many colleges and universities across Punjab have gone down by as much as 25-30 per cent this year. This is a large number but not surprising: it is some of the chickens coming home to roost.\n\nHere are some changes that Pakistan has seen in the higher education sector lately. The number of universities has risen significantly. We have 270-odd universities now, with 160 or so in the public sector. There are several foreign and online programmes that have also entered the sector. And the expansion drive continues. Existing universities have been expanding enrolments and programmes as well.\n\nHigher education funding has either remained static or decreased, even in nominal terms. It has definitely gone down in real terms. Inflation has hit every person in recent years, but fee increases have also been going up in the higher education sector.\n\nThe regulator’s focus has been on expansion, encouraging universities to introduce more Master’s and doctoral programmes and faculty to produce more (not necessarily of higher quality) publications.\n\nHigher education funding has either remained static or decreased.\n\nSome of the consequences, intended and unintended, should have been expected. Generally, the quality of education delivered by most undergraduate programmes across Pakistan has never been very good. Expansion, with little planning for faculty availability, has exacerbated the problem.\n\nThe regulators’ focus on the Master’s and doctoral levels has hurt the quality of undergraduate programmes even more. Undergraduate programmes are seen by many universities and colleges as just a way of earning revenue. The pressure to expand programmes has meant that every university, whether or not it is ready for it, has launched every faculty and programme it could think of. Fewer resources and rising costs have worsened matters.\n\nThe pressure to publish and increase the number of publications has also shifted the focus from teaching in general and undergraduate teaching in particular. It has also led to increased gaming, fraud and plagiarism. More significantly for us, it has led to the neglect of undergraduate teaching, with most faculty wanting to teach graduate programmes, supervise theses and publish with their students to make research numbers impressive.\n\nIt should not come as a surprise then that parents do not want their children to enrol in programmes where perceived and real rates of return to undergraduate studies are low. The students themselves don’t want to enrol. If you were a student, would you do something different? If you were a parent, would you not suggest something different?\n\nDo bear in mind that there is plenty of evidence that universities, private and public, that offer good quality undergraduate education, have not seen any decline in the number of admissions or applications. Similarly, majors that are perceived to be in high demand in the job market have not seen any decline either.\n\nThere are issues that should be kept in mind though. There is a massive increase in demand for computer science, IT, data analytics and similar programmes. People feel, and rightly so, that job prospects in these areas are very bright. The buzz around AI makes this perception even stronger. So, it is not surprising that parents are asking students to enter these fields and many students are also shifting their sights to them. Most universities with relevant departments are expanding enrolments. Others are scrambling to start relevant departments and programmes. But there is a limit to how much expansion can take place in these programmes. And there should be too.\n\nGlobally, there is a fair bit of conversation going around the four-year undergraduate programmes. Is four years too long? Some argue that if people can do a few six-month or so courses, especially in computer- and IT-related fields, and enter the job market and get decent returns, why should they spend a lot of money on four-year degrees.\n\nOthers say that with online education becoming more accessible, undergraduate can move online. Others talk of micro-credentialing and argue that selected courses, rather than a four-year degree, which makes the student go through a broader curriculum and more diverse courses, is the need of the day.\n\nThere is some merit to many of these arguments, though the four-year undergraduate programme has a lot going for it too. Different routes will be better for different people. Education has time and money costs, and quality education tends to be quite expensive.\n\nUniversity education is not recognised as a right anywhere, though states might have functional reasons — human resource development, social and economic mobility, growth — to subsidise undergraduate and graduate education for a part of the population. Students will have to make careful choices about what suits them, what is possible for them and their families, and what is the best way forward.\n\nThe state has to carefully assess what it has been doing as well. Do we need to expand at this pace and make every university launch every department, or should we look for a more tiered approach amongst universities and greater specialisation? Should we incentivise some schools to improve undergraduate education (very needed)? And how do we improve the financing of higher education?\n\nWhen we moved from the University Grants Commission to the Higher Education Commission in the early 2000s, we went through a fairly thorough review of what needed to be done. Much has happened since then, including the passage of the 18th Constitutional Amendment.\n\nWe need a thorough review of the higher education sector and a resetting of priorities. Otherwise, this sector will continue to flounder and disappoint all stakeholders — students, parents, citizens and the state.\n\nThe government is in the process of hiring a new chair for the HEC, maybe it would serve everyone better if either a thorough review is done before the new chair comes in or her first task, post-appointment, is a thorough review of the higher education sector and what we need to do to make it function better and serve the needs of all stakeholders.\n\nThe writer is a senior research fellow at the Institute of Development and Economic Alternatives and an associate professor of economics at Lums.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689e9da8cb7a2.jpg",
  "retrievedAt": "2025-08-25T15:29:05.116Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931004/chickens-coming-home",
  "dateList": "2025-03-26",
  "date_published": "2025-08-15T02:40:46.000Z"
}
