{
  "title": "‘Unprecedented’ mass bleaching drains life from Australian reef - World - DAWN.COM",
  "author": null,
  "content": "An “unprecedented” mass bleaching event has been recorded off Australia’s western coast, scientists said on Wednesday, turning huge chunks of a celebrated reef system a sickly dull white.\n\nA months-long marine heatwave had “cooked” the sprawling Ningaloo Reef, ocean scientist Kate Quigley said, part of a world heritage-listed marine park renowned for vibrant corals and migrating whale sharks.\n\nAlthough environment officials were still verifying the scale of damage, data collected by Quigley and a team of scientists found it was on track to be the reef’s worst mass-bleaching event in years.\n\n“Warm oceans have just cooked the corals this year,” Quigley told AFP.\n\n“It wouldn’t be amiss to throw in the word ‘unprecedented’.\n\n“It has gone deep, it’s not just the top of the reef that is bleaching. Many different species of coral are bleaching.”\n\nBranching through shallow waters along Australia’s western coast, the 300-kilometre Ningaloo Reef is one of the largest “fringing reefs” in the world.\n\nThe unfolding mass bleaching looked to be the worst since 2011, Quigley said.\n\nOcean waters lapping Western Australia have been as much as three degrees warmer than average over recent summer months, the government weather bureau said.\n\nRising temperatures shot past the “bleaching threshold” sometime in mid-January, according to monitoring by the US National Oceanic and Atmospheric Administration.\n\nBleaching occurs when warm waters trigger a biological response forcing coral to expel the colourful algae embedded in their tissues.\n\n“Bleaching is a sickness, but it does not mean outright death,” said Quigley, a research scientist with environment-focused charity Minderoo Foundation.\n\n“But if it is bad enough, the corals will die.”\n\nGovernment data showed smaller patches of coral bleaching had also been spotted at the northern tip of the more famous Great Barrier Reef on Australia’s east coast.\n\nQuigley said the Ningaloo Reef and the Great Barrier Reef were shaped by different weather patterns — and it was rare to see bleaching on both at the same time.\n\n“What we’re seeing is the level of ocean warming is so great, it’s overriding the local conditions in some places.\n\n“It’s just shocking. When we take a national snapshot, it’s extremely concerning.”\n\nThe Great Barrier Reef, a popular tourist drawcard, has suffered five mass bleachings over the past eight years.\n\nQuigley said the extent of damage on the Great Barrier Reef was not currently widespread enough to be considered “mass bleaching”.\n\nGlobal average temperatures were the hottest on record in 2024, with prolonged heatwaves in many of the planet’s oceans causing alarm.\n\nA prolonged global episode of heat-related bleaching impacted almost 80 per cent of the world’s coral reefs between 2023 and 2024, a leading US science agency found in October.\n\nWarming seas, overfishing and pollution are threatening coral reef systems the world over, warned a major UN report in December.\n\nThe average sea surface temperature around Australia was the “highest on record” in 2024, an Australian National University study reported last week.\n\nAustralia sits on bulging deposits of coal, gas, metals and minerals, with mining and fossil fuels stoking decades of near-unbroken economic growth.\n\nBut it is increasingly suffering from more intense heatwaves, bushfires and drought, which scientists have linked to climate change.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/26170538d7acabf.jpg",
  "retrievedAt": "2025-08-25T15:27:43.938Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900463/unprecedented-mass-bleaching-drains-life-from-australian-reef",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T12:15:12.000Z"
}
