{
  "title": "Trump admin in ‘damage control mode’ over Yemen chat breach - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The Trump administration sought on Tuesday to contain the fallout after a magazine journalist disclosed he had been inadvertently included in a secret group discussion of highly sensitive war plans, while Democrats called on top officials to resign over the security incident.\n\nPresident Donald Trump dismissed the accidental addition of a journalist to a group chat about Yemen air strikes as a “glitch” and stood by his top national security team despite the stunning breach.\n\nTrump’s administration faces mounting pressure following a report on Monday by The Atlantic magazine’s editor-in-chief Jeffrey Goldberg about the conversation on the Signal messaging app.\n\nThe chat about attacks on Iran-backed Houthi rebels involved some of the administration’s most senior officials, including Defence Secretary Pete Hegseth, Vice President J.D. Vance and National Security Advisor Mike Waltz.\n\nPresident, Hegseth downplay sensitivity of issue; Democrats grill top security officials over ‘blunder’\n\nTrump told broadcaster NBC in a phone interview that the breach was “the only glitch in two months, and it turned out not to be a serious one.”\n\nThe president added that Waltz, his top security official in the White House, “has learned a lesson, and he’s a good man.”\n\nWhite House Press Secretary Karoline Leavitt said in a post on X on Tuesday that “no ‘war plans’ were discussed” and “no classified material was sent to the thread.”\n\nShe also attacked Goldberg as being “well-known for his sensationalist spin”.\n\nIn another statement on Tuesday, the White House criticised Democrats and the media for “a coordinated effort to distract from the successful actions” of the Trump administration “to make America’s enemies pay and keep Americans safe”.\n\nHegseth, a former Fox News host with no experience running a huge organisation like the Pentagon, said on Monday that “nobody was texting war plans.”\n\nGoldberg responded to Hegseth’s denial in an interview on CNN late on Monday by saying, “No, that’s a lie. He was texting war plans.”\n\nDemocrats grill officials\n\nBut top Democrats have condemned the breach, saying it was potentially illegal and calling for an investigation to find out why officials were using a commercially available app for sensitive discussions.\n\nDirector of National Intelligence Tulsi Gabbard and CIA Director John Ratcliffe — both of whom were in the chat — testified before the Senate Intelligence Committee that no classified material was shared in the group chat.\n\nBut Democratic senators voiced skepticism about that claim.\n\n“It’s hard for me to believe that targets and timing and weapons would not have been classified,” Senator Angus King, an independent who caucuses with Democrats, said at the hearing, a previously scheduled event to discuss global threats.\n\nDemocratic Senator Ron Wyden said there “ought to be resignations, starting with the national security adviser and the secretary of defense”.\n\nDemocratic Senator Michael Bennet pressed Ratcliffe on how Goldberg’s presence had escaped notice.\n\n“You’re the CIA director! Why did you not call out that he was present on the Signal chat?” Bennet shouted and said that Ratcliffe needed “to do better”.\n\nHouse of Representatives Speaker, a Republican, Mike Johnson, said he does not believe anyone should lose job over the leaked military plans, but he did concede that a journalist being added to a private group chat between national security officials was a blunder, NYT reported.\n\nSenator John Kennedy, Rep­ublican of Louisiana, also downplayed the incident, adding that most outside of Washington were “a lot more concerned about the cost of living.\n\n“I don’t think there is concern about war plans being discussed on a Signal group chat.”\n\nDemocratic Senator Elizabeth Warren said on X the use of Signal to discuss highly sensitive national security issues was “blatantly illegal and dangerous beyond belief.”\n\nThe report by The Atlantic did reveal details of what top White House officials think about key allies.\n\nA person identified as Vance expressed doubts about carrying out the strikes, saying he hated “bailing Europe out again”.\n\nAccording to screenshots of the chat reported by The Atlantic, officials in the group debated whether the US should carry out the strikes, and at one point Vance appeared to question whether US allies in Europe, more exposed to shipping disruption in the region, deserved US help.\n\n“@PeteHegseth if you think we should do it let’s go,” a person identified as Vance wrote. “I just hate bailing Europe out again,” the person wrote, adding: “Let’s just make sure our messaging is tight here.”\n\nA person identified as Hegseth replied: “VP: I fully share your loathing of European free-loading. It’s PATHETIC.”\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e334932d20e.jpg",
  "retrievedAt": "2025-08-25T15:28:26.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900310/trump-admin-in-damage-control-mode-over-yemen-chat-breach",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:13.000Z"
}
