{
  "title": "Half of Yemen’s under-fives acutely malnourished: UN - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: One in two children aged under five in Yemen are acutely malnourished, the United Nations said on Tuesday, with more than half a million of them suffering from potentially deadly wasting.\n\nThe UN children’s agency Unicef warned that a decade of conflict in Yemen had stolen childhoods and left an entire generation fighting to survive, even as the humanitarian crisis is escalating.\n\n“One in two children under five are acutely malnourished,” Unicef’s Yemen representative Peter Hawkins told a press briefing in Geneva, speaking from Sanaa.\n\n“Among them, over 537,000 suffer from severe acute malnutrition — a condition that is agonising, life-threatening, and entirely preventable,” he said. Hawkins pointed out that “malnutrition weakens immune systems, stunts growth, and robs children of their potential”.\n\n“In Yemen, it is not just a health crisis — it is a death sentence for thousands.” Yemen’s Houthi rebels control large swathes of the country. They have been at war with a Saudi-led coalition backing the internationally recognised government since 2015, a conflict that has triggered a major humanitarian crisis. Hawkins said severe acute malnutrition levels have reached 33 percent in some areas along the west coast, in “a catastrophe where thousands will die”.\n\nUS strikes, aid cuts\n\nOn March 15 the United States announced a new military offensive promising to use overwhelming force until the Houthi rebels stop firing on vessels in the key shipping routes in the Red Sea and Gulf of Aden. That day saw a wave of US air strikes that officials said killed senior Houthi leaders, and which the rebels’ health ministry said killed 53 people.\n\n“We’ve verified that eight children have been killed in these airstrikes,” said Hawkins. “All airstri­kes in Yemen diminish the infrastructure and increase the fear,” he added.\n\nUS President Donald Trump imposed a freeze on foreign aid in January pending a review, after which Washington announced the cancellation of 83 per cent of programmes at the US Agency for International Development (USAID).\n\n“The issue with the USAID cuts is that it’s diminished the capacity overall here in Yemen quite extensively,” said Hawkins. While Unicef has been able to continue nutritional programmes, he said these needed to be complemented by food and cash assistance for an optimum nutritional crisis response, with those areas now “compromised”. “And therefore it makes our job much more difficult,” he added.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:11:43.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900387/half-of-yemens-under-fives-acutely-malnourished-un",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:40.000Z"
}
