{
  "title": "Italy minister hopes Russians could join 2026 Olympics, after war - Sport - DAWN.COM",
  "author": null,
  "content": "CORTINA D’AMPEZZO: Italian deputy premier Matteo Salvini said on Tuesday he would like to see Russian and Ukrainian athletes compete at the Milan-Cortina Winter Olympics next year, if their countries have stopped fighting.\n\nThe leader of the far-right League party, a junior partner in Prime Minister Giorgia Mel­oni’s government who has respo­nsibility for infrastructure, was speaking at the inauguration of the Winter Olympics bobsleigh track in Cortina d’Ampezzo.\n\n“Given that there are peace talks (on the Ukraine war) going on at the moment, and that the Olympic spirit should be what brings people and athletes together, I hope… the Milan-Cortina Olympics 2026 will be the first Olympics which will see Ukrainian and Russian athletes take to the ski slopes,” Salvini said.\n\n“To see athletes from all over the world — once the war is over — run those 1,700 metres will mean that we have built a little piece of peace and that will be the most important thing.”\n\nRussia and its ally Belarus have been banned from holding international sporting competitions since Moscow’s February 2022 invasion of Ukraine, while their flags, anthems and officials are banned from most world events.\n\nOnly 15 Russian athletes took part in the Paris Olympics last year, under strict conditions — they competed under a neutral flag and had to prove they had no ties to the military or security services.\n\nA similar solution could be found for the Milan-Cortina Games, which take place in nort­hern Italy on Feb 6-22 next year.\n\nSalvini has in the past expressed admiration for Russian president Vladimir Putin, although he has distanced himself from this stance since the Ukraine war began.\n\nWhile Meloni has been a vocal supporter of Kyiv, Salvini has worked to curb Italy’s military aid, although he has not blocked it.\n\nEarlier this month, he called French President Emmanuel Macron “crazy” for proposing to send troops to ensure any peace deal in Ukraine was observed.\n\nHe stressed on Tuesday that “Europe should be a protagonist of peace”.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:28:12.437Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900336/italy-minister-hopes-russians-could-join-2026-olympics-after-war",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:31.000Z"
}
