{
  "title": "Shares at PSX surge 1,100 points after IMF agreement - Business - DAWN.COM",
  "author": null,
  "content": "Bulls dominated the trade floor on Wednesday as shares at the Pakistan Stock Exchange (PSX) surged more than 1,100 points after a successful review of the International Monetary Fund (IMF) bailout programme.\n\nThe benchmark KSE-100 index climbed 1,390.46 points, or 1.19 per cent to stand at 118,023.62 from the previous close of 116,633.16 at 9:22am.\n\nFinally, the index closed at 117,772.31, up by 1,139.15 or 0.98pc, from the last close.\n\nTopline Securities, a brokerage firm in Karachi, noted market gains were primarily driven by UBL, OGDC, PPL, MEBL, and MARI, which contributed 883 points to the index.\n\n“A total of 355m shares were traded, with a turnover of Rs 37bn,” it said, adding that PAEL led the volume chart, with 29m shares exchanged.\n\nSana Tawfik, head of research at Arif Habib Limited, stated that the “major trigger” behind the bull run was the federal government reaching a deal with the IMF for a new $1.3 billion arrangement, along with the first review of the ongoing 37-month bailout programme.\n\nAdditionally, she noted that the study conducted by Oil and Gas Development Company (OGDC) and Pakistan Petroleum Limited (PPL) over the feasibility of the Reko Diq project also contributed to the bullish momentum.\n\nYousuf M. Farooq, director research at Chase Securities, echoed the same sentiments.\n\nHe said, “While the agreement has been signed, market participants now await further details — particularly regarding IMF approval on revised tax targets, the circular debt resolution plan, and potential reductions in electricity prices.”\n\nHe highlighted that the economy remained in a “consolidation phase” — with government spending expected to stay subdued over the coming year.\n\n“Monetary policy is still tight, valuations remain attractive, and we believe the market will track earnings growth,” he said, adding that “with the risk of failing to secure an IMF agreement now significantly reduced, we expect the market to rerate upwards, pending further clarity and final board approval”.\n\nAwais Ashraf, director research at AKD Securities, said, “Investors turned bullish on reaching a staff-level agreement with the IMF for the disbursement of a $1.3bn tranche and accessing additional financing under the Resilience and Sustainability Facility (RSF).”\n\n“Additionally, the release of the revised feasibility study for Reko Diq by OGDC and PPL has renewed interest in their respective stocks,” he said, adding that energy stocks were expected to be the focus today amid progress “clearing circular debt and the updated feasibility study of Reko Diq”.\n\nAccording to an Arib Habib Limited report, OGDC and PPL had finalised the feasibility study for the Reko Diq project, which estimated a 37-year mine life.\n\nAs a formal feasibility study confirmed more than $60bn worth of copper and gold reserves at the Reko Diq project in Balochistan at prevailing prices, three state-owned energy sisters have more than doubled their funding commitment close to $1.9bn.\n\nThe feasibility study has also confirmed a lucrative 25pc rate of return on investment on one of the biggest copper-gold project, informed sources said, adding that the project operations would be run entirely on solar energy, thus becoming the only green project of the sort so far across the globe.\n\nFurthermore, the report highlighted that the project would be executed in two phases, with the first one set to be completed in 2028.\n\nPhase one, according to the report, involves $5.6bn capital outlay and $3bn “funded via limited-recourse project financing facility (negotiations ongoing), while the remainder will come from shareholder contributions”.\n\n“Phase-II, expected to conclude by 2034, will be funded through the project’s revenue, doubling the processing capacity to 90Mtpa,” the report said, adding that over its lifespan, Reko Diq “is projected to produce 13.1mn tons of copper and 17.9mn ounces of gold”.\n\nYesterday, the market had regained some ground, closing at 116,633.17, up 193.55 poi­nts or 0.17pc day-on-day. This volatility was attributed to the lack of clarity regarding the IMF review and the SLA, which had kept investor sentiment cautious.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/26103200c15870f.jpg",
  "retrievedAt": "2025-10-12T02:12:20.936Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900419/shares-at-psx-surge-1100-points-after-imf-agreement",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T04:31:22.000Z"
}
