{
  "title": "KP action plan to give civilian agencies lead role in counterterrorism efforts - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Envisions new recruitments, training, procurement of modern weapons\n• Database of terrorists, facilitators to be established\n\nPESHAWAR: The Khyber Pakhtunkhwa government on Tuesday unveiled an 84-point Provincial Action Plan against terrorism, assigning a lead role to the civil administration and law enforcement agencies in counterterrorism efforts.\n\nThe decision was finalised during a meeting chaired by KP Chief Minister Ali Amin Khan Gandapur. Sources said that the shift towards a civilian-led counterterrorism approach follows recommendations from the military, which seeks to redeploy personnel to other security hotspots.\n\nThe action plan is structured around seven key pillars, including counterterrorism measures, political and social initiatives, legal reforms, good governance, general administrative measures, monitoring, and public awareness campaigns.\n\n“It outlines 84 specific actions across 18 thematic areas, assigning responsibilities to relevant provincial departments and federal agencies with defined timelines,” said a statement from the office of the press secretary to the KP chief minister.\n\nThe statement said the action plan includes strengthening the state’s authority, restoring public confidence in the system through visible action against terrorists, continuation of kinetic operations against terrorists, strict enforcement of counterterrorism laws, improving public service delivery and incorporating community input in security and development matters.\n\nUnder the action plan, a comprehensive database of terrorists and their facilitators will be established, regular updates to Schedule IV and strict surveillance of individuals on the list and monthly reviews of bounty cases on wanted terrorists will be carried out. Strict disciplinary action will be taken against government employees found facilitating the terrorists.\n\n“Fast-track capacity enhancement of police and the Counter-Terrorism Department (CTD), including new recruitments, training and procurement of modern weapons and equipment, is also part of the action plan,” the statement said. “Priority projects for police infrastructure in southern and merged districts will be included in the Annual Development Programme.”\n\nThe action plan also emphasises the formulation of a policy to counter cross-border terrorism. “Furthermore, after the approval of Terms of Reference (TORs) by the federal government, a provincial delegation will engage with Afghan tribal elders for negotiations,” it said.\n\nThe federal government will also be urged to enhance diplomatic engagement with Afghanistan.\n\nA centralised intelligence collection and sharing system will be developed, integrating local intelligence databases with provincial and federal agencies. Regular meetings of Apex Committee, Steering Committee, and Intelligence Coordination Committees at the divisional and district levels. Public Liaison Committees at police station levels will be constituted to enhance community oversight of security threats.\n\nAction will be taken against illegal spectrum being used as funding sources for terrorism activities including smuggling of narcotics and weapons, etc. To curb smuggling of illegal items, advanced scanners and AI-based monitoring systems at transit points will be installed.\n\nSimilarly, profiling of non-custom-paid (NCP) vehicles will be completed by Aug 1, 2025, with GPS tracking for their movements.\n\nMoreover, audit of madressahs receiving foreign funding will be carried out to ensure transparency.\n\nSimilarly, digital tracking of chemical substances used in explosives, blockchain-based monitoring of explosive material transportation, collaboration with Nadra for oversight of explosive dealers, upgrading of arms licensing software to regulate weapons sales, electronic cargo tracking system for smuggled goods and joint checkpoints at key smuggling routes are some of the main points of implementation.\n\nUnder the socioeconomic domain, key measures to be taken under the action plan include job creation and alternative livelihoods for youth in terrorism-affected areas, skill development and vocational training to integrate youth into industries, District Economic Plans for merged districts, accelerating economic zone development, and promotion of high-value alternate cash crops in merged districts with financial incentives for farmers.\n\nThe action plan also features resettlement plans for temporarily displaced populations of merged areas ensuring basic amenities in their hometowns.\n\n“Legal reforms for effective counterterrorism include the strengthening of legal framework by reviving the Preventive Magistracy System, formulation of a coordinated system between police, judiciary, and district administration, strengthening the Alternative Dispute Resolution (ADR) mechanism, enactment of the KP Enforcement and Regulation Act, reforms in the criminal justice system, including special trials for terrorists in anti-terrorism courts, increasing prosecution staff in anti-terrorism courts as needed, and establishment of faceless courts for security-sensitive trials,” the statement said.\n\nAs another important pillar of the action plan, public awareness and communication strategy is to be developed for counter narrative and inform and educate the citizens about government efforts in counterterrorism and development initiatives.\n\nRegular security reviews at the district level to assess risks and propose countermeasures, developing political consensus on counterterrorism strategies and security measures are also the key features of the action plan.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/26075110440c9a4.png",
  "retrievedAt": "2025-08-25T15:28:30.428Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900316/kp-action-plan-to-give-civilian-agencies-lead-role-in-counterterrorism-efforts",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:08.000Z"
}
