{
  "title": "Chewing gum releases microplastics into mouth: researchers - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Chewing gum releases hundreds of tiny plastic pieces straight into people’s mouths, researchers said on Tuesday, also warning of the pollution created by the rubber-based sweet.\n\nThe small study comes as researchers have increasingly been finding small shards of plastic called microplastics throughout the world, from the tops of mountains to the bottom of the ocean — and even in the air we breathe.\n\nThey have also discovered microplastics riddled throughout human bodies — including inside our lungs, blood and brains — sparking fears about the potential effect this could be having on health. “I don’t want to alarm people,” Sanjay Mohanty, the lead researcher behind the new study which has not yet been peer-reviewed, said.\n\nThere is no evidence directly showing that microplastics are harmful to human health, said Mohanty of the University of California, Los Angeles (UCLA). The pilot study instead sought to illustrate yet another little-researched way that these mostly invisible plastic pieces enter our bodies — chewing gum.\n\nLisa Lowe, a PhD student at UCLA, chewed seven pieces each of 10 brands of gum, before the researchers then ran a chemical analysis on her saliva. They found that a gram (0.04 ounces) of gum released an average of 100 microplastic fragments, though some shed more than 600. The average weight of a stick of gum is around 1.5 grams. People who chew around 180 pieces of gum a year could be ingesting roughly 30,000 microplastics, the researchers said.\n\nThis pales in comparison to the many other ways that humans ingest microplastics, Mohanty emphasised. For example, other researchers estimated last year that a litre (34 fluid ounces) of water in a plastic bottle contained an average of 240,000 microplastics.\n\n‘Tyres, plastic bags and bottles’\n\nThe most common chewing gum sold in supermarkets is called synthetic gum, which contains petroleum-based polymers to get that chewy effect, the researchers said. However packaging does not list any plastics in the ingredients, simply using the words “gum-based”. “Nobody will tell you the ingredients,” Mohanty said.\n\nThe researchers tested five brands of synthetic gum and five of natural gum, which use plant-based polymers such as tree sap. “It was surprising that we found microplastics were abundant in both,” Lowe said.\n\nDavid Jones, a researcher at the UK’s University of Portsmouth not involved in the study, said he was surprised the researchers found certain plastics not known to be in gum, suggesting they could have come from another source in the lab. But the overall findings were “not at all surprising”, he said.\n\nPeople tend to “freak out a little bit” when told that the building blocks of chewing gum were similar to what is found “in car tyres, plastic bags and bottles”, Jones said.\n\nOliver Jones, a chemistry professor at Australia’s RMIT University, said that if the relatively small number of microplastics were swallowed, they “would likely pass straight through you with no impact”.\n\n“I don’t think you have to stop chewing gum just yet.”\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:28:12.036Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900396/chewing-gum-releases-microplastics-into-mouth-researchers",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:39.000Z"
}
