{
  "title": "LHC stays dog culling campaign - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court on Tuesday stayed dog culling campaign in Lahore division and sought a detailed reply from the Punjab government after Eid holidays.\n\nJustice Shahid Karim heard a petition filed by an animal rights activist, Iraj Hasan, challenging the practice of eliminating stray dogs through shooting instead of vaccination.\n\nThe petitioner’s lawyer argued that the district administration was illegally killing stray dogs, despite a policy mandating their elimination through vaccination.\n\nHe said instead of implementing the Animal Birth Control (Dogs) Policy 2021, the authorities were reportedly shooting the dogs.\n\nSeeks detailed reply from Punjab govt after Eid holiday\n\nThe lawyer further stated that over 1,000 dogs had been killed within two weeks through this cruel method. He sought the implementation of the 2021 policy to manage the stray dog population humanely.\n\nThe petitioner said the policy envisages measures to neuter and vaccinate stray dogs with a joint working by the livestock, local bodies and other departments concerned.\n\nIt says the stray dogs can be sold for security and screening purposes after providing training.\n\nThe policy also calls for the rehabilitation of stray dogs, their birth control, training and selling for security and screening purposes.\n\nIt says incurably ill and mortally wounded dogs, as diagnosed by a qualified veterinarian appointed by the tehsil implementation committees, shall be euthanised during specified hours in a humane manner by administering sodium pentothal for adult dogs and thiopental intraperitoneal for puppies by a qualified veterinarian or euthanised in any other humane manner approved by the provincial monitoring committee. contempt plea against DC: The Lahore High Court (LHC) has fixed the hearing of a contempt petition filed by the Pakistan Tehreek-i-Insaf (PTI) against the deputy commissioner for denying it permission to hold a public gathering at Minar-i-Pakistan.\n\nJustice Farooq Haider heard a miscellaneous application filed by PTI leader Akmal Khan Bari, seeking an early hearing of the contempt petition.\n\nThe judge directed that the contempt petition be presented for hearing after Eid on April 4.\n\nPetitioner’s counsel Khurram Khosa told the court that a contempt petition had been filed against the deputy commissioner for refusing permission for a PTI rally at Minar-i-Pakistan on March 22.\n\nThe petitioner urged the court to schedule the hearing at the earliest.\n\nSeparately, Justice Haider also fixed the hearing of another petition by Mr Bari against his possible arrest.\n\nThe petitioner alleged that he had filed a request for a rally at Minar-i-Pakistan, but was facing pressure to withdraw it.\n\nHe alleged that the police were harassing him and there was a risk of his arrest.\n\nThe petitioner asked the court to restrain the police, including the inspector general and other officials, from harassment and to prevent his possible arrest.\n\nThe judge will hear the petition on April 4.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:27:59.788Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900360/lhc-stays-dog-culling-campaign",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:53.000Z"
}
