{
  "title": "World Athletics approves swab test to determine female gender - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: World Athletics said on Tuesday it had approved the introduction of a cheek swab test to determine if an athlete is biologically female.\n\nSebastian Coe, the head of the international track and field federation, said the decision taken by the body’s decision-making council was a “really important” way of protecting the female category.\n\n“It’s important to do it because it maintains everything that we’ve been talking about, and particularly recently, about not just talking about the integrity of female women’s sport, but actually guaranteeing it,” Coe said in a press conference after the World Indoor Championships in Nanjing, China.\n\n“We feel this is a really important way of providing confidence and maintaining that absolute focus on the integrity of competition.”\n\nWorld Athletics added that it had not fixed a date for the introduction of the measure, “but it is expected to be in place for the World Championships in Tokyo this year”.\n\nCoe said the decision to introduce the swab testing was taken after a wide consultation on the proposal.\n\n“Overwhelmingly, the view has come back that this is absolutely the way to go,” although he added that the swab test was not considered to be overly intrusive.\n\nHe said he was confident that the policy could stand up to legal challenge, but added: “You accept the fact that that is the world we live in.\n\n“I would never have set off down this path to protect the female category in sport if I’d been anything other than prepared to take the challenge head on.\n\n“We’ve been to the Court of Arbitration on our DSD [difference of sex development] regulations.\n\n“They have been upheld, and they have again been upheld after appeal. So we will doggedly protect the female category, and we’ll do whatever is necessary to do it.”\n\nCoe announced the policy a week after finishing third in the race to be the new president of the International Olympic Committee, won by Kirsty Coventry, the former Olympic swimmer from Zimbabwe.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/261159469c88370.jpg",
  "retrievedAt": "2025-08-25T15:28:13.455Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900344/world-athletics-approves-swab-test-to-determine-female-gender",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:00:31.000Z"
}
