{
  "title": "UN experts demand release of detained Baloch activists, end to crackdown on protests - Pakistan - DAWN.COM",
  "author": null,
  "content": "Independent UN experts on Wednesday demanded that the Pakistani government release Baloch rights activists detained after recent protests and curb the crackdown on the demonstrations against alleged enforced disappearances and other human rights issues.\n\nOn Friday evening, police used tear gas, water cannons, and blank shots to disperse Baloch Yakjehti Committee (BYC) protesters staging a sit-in in Quetta, with both the provincial government and BYC reporting casualties — BYC claiming three dead and 13 injured, while police reported around 10 personnel hurt.\n\nThe arrest of BYC chief organiser Dr Mahrang Baloch under terror charges with 150 others sparked shutter-down strikes in various cities of Balochistan. In Karachi, BYC leader Sammi Baloch was detained for protesting and later held for disturbing public order despite a judicial magistrate ordering her release with four activists detained.\n\nIn a statement issued today, a group of independent human rights experts affiliated with the UN said the government “must immediately release detained Baloch human rights defenders and cease its crackdown on peaceful protesters”.\n\n“We have been monitoring with growing concern reports of alleged arrests and enforced disappearances of Baloch activists over the past number of months, and the violent incidents in the past few days have significantly increased our concerns,” the experts were quoted as saying in the joint statement.\n\nIt added that they expressed concern about the “escalating series of actions” against the BYC leadership in the wake of this month’s Jaffar Express train attack in Balochistan’s Bolan district, “after which several prominent Baloch human rights defenders from the BYC were allegedly arrested by Pakistan’s Counter Terrorism Department or forcibly disappeared”.\n\nReferring to last Friday’s events, the experts said they once again witnessed the use of excessive force as a first response by the authorities to peaceful protests.\n\n“We understand the deeply traumatic impact of the March 11 terrorist attack, and we express our deepest sympathy to the victims of this attacks, yet a response which relies on arbitrary detention, enforced disappearances and violent crackdowns on freedom of assembly cannot alleviate that trauma.”\n\nReferring to the circumstances of Mahrang and Sammi’s detentions, the experts said they were “extremely concerned” for their welfare and that of other human rights defenders detained for exercising their right to peaceful assembly.\n\n“We urge the Pakistani authorities to immediately release them and to refrain from abusing counter-terrorism or public safety measures against human rights defenders, and we call on the authorities to clarify without delay the fate and whereabouts of all those reportedly subjected to enforced disappearances,” the experts said.\n\nThe statement concluded by saying that the experts called on the government to address conditions conducive to terrorism, in line with the UN Global Counter-Terrorism Strategy, adding that they were already in contact with the authorities regarding their concerns.\n\nThe Foreign Office, in response to the UN experts’ statement, said that the comments were based on “selective and unverified media reports” and lacked “balance and proportionality.”\n\n“We have taken note of the press release issued by certain UN experts, which appears to be based on selective and unverified media reports. It is imperative that public statements of this nature adhere to principles of objectivity, avoid selective criticism, reflect factual accuracy, and acknowledge the full context of the situation,” the FO said in its statement, issued on Wednesday.\n\nIt added that the comments lacked “balance and proportionality” and downplayed civilian casualties inflicted by terrorist attacks while disregarding the crimes committed by miscreants who deliberately disrupt public services, obstruct freedom of movement, and create an atmosphere of insecurity.\n\n“Any credible assessment must recognise that these elements are not mere protesters but active participants in a broader campaign of lawlessness and violence. Their abuses of law and human rights violations cannot be ignored.\n\n“Hiding behind a façade of alleged grievances, these elements are operating in collusion with terrorists—evident from their coordinated efforts to obstruct State responses, including synchronised roadblocks facilitating terrorist attacks.”\n\nThe FO further said that the latest proof of their “nexus was their unlawful storming of the District Hospital in Quetta, where they forcibly seized the bodies of five terrorists eliminated during the Jaffar Express hostage rescue operation.”\n\n“Three of these bodies were retrieved from these violent protestors by the police.”\n\nIt said that international human rights law unequivocally prohibited individuals, entities, or groups from weaponising rights to infringe upon the rights and security of others, while firmly upholding the right of sovereign States to take lawful and necessary action to maintain public order and ensure the safety of their citizens.\n\n“The government is duty-bound to protect the lives and security of its people, particularly in areas where innocent civilians bear the brunt of foreign-sponsored terrorism. It has consistently pursued policies aimed at fostering social and economic development for all segments of society, regardless of ethnic or religious background.\n\n“However, the persistent threat posed by terrorists and their enablers—through heinous attacks on civilians, security forces, and vital public infrastructure—undermines these efforts.\n\nThe statement said that in this regard, the measures undertaken by the government were “fully consistent with international law, which categorically prohibits incitement to violence and terrorism. There can be no tolerance, let alone impunity, for terrorists, their facilitators, or their abettors.”\n\nInstitutional and legal mechanisms remain fully available for all citizens seeking redress in accordance with their constitutional rights, it said.\n\n“We maintain an open and constructive dialogue with UN Special Procedures Mandate Holders and will continue our engagement based on principles of mutual respect, objectivity, and adherence to facts.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/2623095981fe049.jpg",
  "retrievedAt": "2025-08-25T15:27:40.677Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900486/un-experts-demand-release-of-detained-baloch-activists-end-to-crackdown-on-protests",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T18:28:35.000Z"
}
