{
  "title": "Punjab PDMA says prepared to deal with possible drought due to lack of rainfall - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Punjab Provincial Disaster Management Authority (PDMA) on Wednesday said it was prepared to deal with a possible drought in parts of the province owing to a lack of rainfall.\n\nA day earlier, the PDMA issued an advisory for Punjab due to 40 per cent below normal rainfall in the province. The advisory, directed to all divisional and deputy commissioners, follo­wed a similar alert issued by the Pakistan Meteo­ro­logical Department’s Nat­ional Drought Monitoring Center (NDMC).\n\nThe NDMC advisory noted that from September 1, 2024 to March 21, 2025, the rainfall across Pakistan was 40 per cent below normal, with a reduction of 38pc in Punjab, 62pc in Sindh and 52pc in Balochistan.\n\nA handout issued by the PDMA today said: “There is a high possibility of drought in Bahawalpur, Bahawalnagar and Rahim Yar Khan.”\n\n“The rabi season crops may be affected due to a lack of rain. Farmers are afraid of losses due to affected rice production,” the handout said.\n\nPDMA Director General Irfan Ali Kathia said that farmers should be informed in advance about the possibility of a water shortage.\n\n“In view of the expected water shortage in Thal and Cholistan, advance arrangements have been completed and the administration remained alert,” the handout said.\n\nIt added that the School Education Department would also be involved in the awareness campaign and noted that crop damage can be prevented through precautionary measures.\n\nAccording to Monday’s NDMC advisory, drought conditions would persist in Sindh, southern parts of Balochistan and lower eastern plain areas of Punjab. This was despite the recent rainfall spells that have improved drought conditions in central and upper parts of the country.\n\nThe mean temperature during March 2025 in the lower half of the country was 2-3 degrees Celsius above normal. The consecutive dry days in some areas of the southern region even exceeded 200 days.\n\nThe current weather and seasonal climate outlook are likely to exacerbate and intensify the drought situation in the affected areas.\n\nThe emergence of flash drought — which intensifies rapidly due to changes in precipitation, temperature, wind, and radiation — is also anticipated in upcoming months due to the rainfall deficit and rising temperatures.\n\nKeeping in view the current weather situation and seasonal climate outlook, the drought situation is likely to exacerbate in Sindh and parts of Balochistan and Punjab.\n\nOverall rainfall from September 1, 2024, to March 21, 2025, was 40 per cent below normal.\n\nThe rainfall deficit across the country was Sindh (-62pc), Balochistan (-52pc), Punjab (-38pc), Khyber Pakhtunkhwa (-35pc), Azad Jammu and Kashmir (-29pc) and Gilgit-Baltistan (-2pc).\n\nAs per the PMD, there was an acute shortage of water in Tarbela and Ma­n­gla dams, and water flowing in different rivers was at an extremely low level.\n\nThe current level of Tarbela Dam is 1,402 feet and 1,061.75 feet in Mangla Dam. Both dams are at a dead level.\n\nIn a recent report, the NDMC said the average tem­perature recorded dur­ing the week from March 15 to 21 was 1 to 7 degrees above average, which could lead to decreased soil moisture levels.\n\n“This rise in temperature is expected to increase water demand, adversely affecting crops and putting extra pressure on already strained water resources,” it added.\n\nIt said that dry weather is expected in most parts of the country from March 24 to 30, with rain, wind/thunderstorms and snowfall on mountains likely in upper KP, GB, Azad Kashmir and north Balochistan on March 26.\n\nIsolated rain, windstorms, thunderstorms and hailstorms are expected in lower KP and upper/south Punjab.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:27:43.962Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900449/punjab-pdma-says-prepared-to-deal-with-possible-drought-due-to-lack-of-rainfall",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T10:49:15.000Z"
}
