{
  "title": "PM Shehbaz commends team, nation for unlocking IMF deal, new $1.3bn climate fund - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Wednesday commended his team for unlocking the new $1.3 billion arrangement with the International Monetary Fund (IMF), along with a successful first review of the ongoing 37-month bailout programme.\n\nThe announcement from the global money lender came early Wednesday morning, saying that it had reached a staff-level agreement (SLA) with the Pakistani authorities.\n\nSpeaking at a federal cabinet meeting today, the premier thanked the members of his team, saying it was through “day and night” efforts that led to the achievement of this milestone.\n\n“This was through teamwork, no doubt,” he said, adding that some had questioned whether the government would be able to achieve the feat without the mini-budget.\n\n“With God’s grace, the mini-budget did not come,” he said, adding that despite challenging circumstances, with terrorism prevalent in two provinces and inflation reaching historic highs amid other problems, the government as well as the nation persevered.\n\n“Particularly, the common people who faced difficulties, if their sacrifices weren’t there, the staff-level [agreement] would not have been possible as they face the burden of inflation,” he stressed and said that the salaried class and the provinces contributed to the milestone.\n\nHe went on to commend the provinces for passing the tax laws to meet the requirements of the Fund amid reluctance and concerns.\n\nIn February, in a rare show of unity, the Sindh provincial assembly had unanimously passed the Sindh Agricultural Income Tax Bill. Punjab and Khyber Pakhtunkhwa had already passed the amended agricultural income tax law that was a part of the federal government’s commitments under the IMF’s $7bn agreement spanning 37 months.\n\nEarlier today, the federal government reached a deal with the IMF for a new $1.3bn arrangement and also agreed on the first review of the ongoing 37-month bailout programme, the Fund had confirmed on Tuesday.\n\nPending board approval, the government can unlock the $1.3bn under a new climate resilience loan programme spanning 28 months.\n\nIt will also free $1bn for the country under the $7bn bailout programme, which would bring those disbursements to $2bn.\n\n“The IMF team has reached a staff-level agreement (SLA) with the Pakistani authorities on the first review of the 37-month extended arrangement under the Extended Fund Facility (EFF), and on a new 28-month arrangement under the IMF’s [Resilience and Sustainability Trust] with total access over the 28 months of around $1.3 billion,” Nathan Porter, mission chief to Pakistan, said in a statement by the Fund.\n\nPakistan had requested $1bn from the IMF’s RSF in October. The funding under RSF is made available to nations that commit to high-quality reforms to build resilience against climate catastrophes through adaptation. It is repayable over 30 years, including a 10-year grace, and is normally cheaper than terms for an EFF, such as the $7bn loan programme which is underway.\n\nThe programme, secured mid-year in 2024, has played a key role in stabilising the economy and the government has said the country is on course for a long-term recovery.\n\n“Over the past 18 months, Pakistan has made significant progress in restoring macroeconomic stability and rebuilding confidence despite a challenging global environment,” Porter said in the statement.\n\n“Upon approval (by the IMF board), Pakistan will have access to about $1bn under the EFF, bringing total disbursements under the programme to about $2bn,” he added.\n\n“While economic growth remains moderate, inflation has declined to its lowest level since 2015, financial conditions have improved, sovereign spreads have narrowed significantly, and external balances are stronger,” the IMF official said about Pakistan.\n\nAfter slowing to its lowest level in almost a decade last month, inflation is anticipated to increase slightly up to 3pc in April, the finance ministry said in its monthly economic outlook.\n\nInflation has been declining for several months, hitting 1.5pc in February, after it soared to around 40pc in May 2023.\n\nHowever, the statement also noted what it called elevated downside risks such as geopolitical shocks to commodity prices, tightening global financial conditions or rising protectionism.\n\nIt said such risks could undermine Pakistan’s “hard-won macroeconomic stability”.\n\nThe Fund further stressed, “Climate-related risks continue to pose a significant challenge for Pakistan, creating a need to build resilience, including through adaptation measures.”\n\n“In this regard, it is critical to stay the course and entrench the progress achieved over the past one and a half years, building resilience by further strengthening public finances, ensuring price stability, rebuilding external buffers and eliminating distortions in support of stronger, inclusive and sustained private sector-led growth,” it added.\n\nThe Fund noted that Pakistan reiterated its commitment to the EFF-supported programme and plans to supplement its efforts by advancing reforms under the RSF-supported deal.\n\nIt said the government’s policy priorities included: continued fiscal consolidation to reduce public debt while creating space for social and development spending; making further progress on fiscal structural reforms; maintaining appropriately tight monetary policy; continuing cost-reducing reforms in the energy sector to lower tariffs; and scaling up climate reform efforts.\n\nFinance Minister Muhammad Aurangzeb expressed optimism with the results of policies that the government has implemented in agreement with the IMF, Geo News reported.\n\n“We remain committed to stay the course and continue to execute structural reforms with respect to taxation, energy and SOEs to put our country on the trajectory of sustainable productivity and export-led growth,” Aurangzeb told Geo News from China.\n\nThe government says the $350bn economy has stabilised under the $7bn IMF bailout that had helped it stave off a default threat.\n\nThe government had been awaiting the IMF agreement on the first review of the bailout and disbursement of $1bn ahead of the annual budget, usually presented in June.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/261544545a57386.png",
  "retrievedAt": "2025-10-12T02:12:21.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900322/pm-shehbaz-commends-team-nation-for-unlocking-imf-deal-new-13bn-climate-fund",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T00:03:57.000Z"
}
