{
  "title": "Journalist Farhan Mallick remanded in FIA custody in fresh case - Pakistan - DAWN.COM",
  "author": null,
  "content": "A court in Karachi remanded journalist Farhan Mallick into the Federal Investigation Agency’s (FIA) custody for five days on Wednesday in a new case involving fraud.\n\nAccording to the first information report (FIR), the FIA conducted a raid on a call centre in Gulshan-i-Iqbal on March 25, arresting two suspects Atir Hussain and Hassan Najeeb in the process.\n\nThe FIR stated that the call centre was involved in fraudulent activities, including giving confidential data to foreigners through a software.\n\nAdditionally, the suspects confessed to working for Mallick, according to the FIR.\n\nMallick, the founder of media agency Raftar and a former news director at Samaa TV, was arrested on March 20 in Karachi and booked under the Prevention of Electronic Crimes Act (Peca) as well as the Pakistan Penal Code. The next day, he was handed into the Federal Investigation Agency’s (FIA) custody for four days.\n\nMeanwhile, Lawyer Abdul Moiz Jaferii, who is representing Mallick, condemned the new case.\n\nHe said: “After keeping him in custody in violation of court orders all of yesterday, the FIA sprung a surprise by presenting @FarhanGMallick in the Malir court with a new FIR.”\n\n“What they are trying to do is waste more days of his life,” Jaferii told Dawn.com. “It will probably take up five more days in clearing this process [the fresh case],” he added.\n\nEarlier, Mallick was booked by the FIA under sections 16 (unauthorised use of identity information), 20 (offences against dignity of a natural person) and 26-A of Peca 2016]2, as well as sections 500 (punishment for defamation) and 109 (abetment) of the Pakistan Penal Code (PPC).\n\nNotably, Section 26A is among the provisions recently added to the Peca laws, wherein fake news is defined as any information about which a person “knows or has reason to believe to be false or fake and likely to cause or create a sense of fear, panic or disorder or unrest”.\n\nAny person found guilty of spreading such information could be sentenced to up to three years in prison or fined up to Rs2 million, or both.\n\nThe criminalisation of alleged online disinformation has spread fear in Pakistan, with journalists among those worried about the potentially wide reach of the law.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/2612343337dde61.png",
  "retrievedAt": "2025-08-25T15:27:45.243Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900435/journalist-farhan-mallick-remanded-in-fia-custody-in-fresh-case",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T08:51:49.000Z"
}
