{
  "title": "Denmark’s $2bn investment to boost Pakistan’s port sector: maritime minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "Federal Minister for Maritime Affairs Junaid Anwaar Chaudhry on Wednesday revealed that Denmark’s $2 billion investment in Pakistan’s port sector was moving forward, with Danish investors actively collaborating with the government to accelerate the process.\n\nDenmark and Pakistan share strong economic ties, with a significant increase in bilateral trade of late. A 31 per cent surge was recorded in the first eight months of FY 2024-25, bringing the total trade volume to $285.99 million. According to government data, Pakistan’s exports to Denmark grew by 2pc to $207.40m, while imports from Denmark rose by 42pc to $78.59m, showcasing a balanced and expanding trade relationship.\n\nTalking to the media during his introductory visit to Port Qasim today, the minister highlighted that the port’s land will be allocated strictly for industrial purposes and sold transparently to genuine investors.\n\n“Real estate dealings on the port’s land will be discontinued, and any allottees failing to establish industries within the allotted time will have their allotments cancelled,” Chaudhry said, adding that a new assessment of Port Qasim’s land will be carried out according to regulations.\n\nThe minister further invited investors and the Sindh government to join hands with the Ministry of Maritime Affairs in improving Karachi’s infrastructure.\n\n“The ministry is committed to enhancing the city’s infrastructure, but such projects require the collaboration of the Sindh government,” he emphasised.\n\nChaudhry promised to expedite and improve the ministry’s projects and processes on a fast track, including establishing a clear policy for lands under Port Qasim, the Karachi Port Trust (KPT) and the Pakistan National Shipping Corporation (PNSC).\n\n“Promotion opportunities will be provided for lower-grade officers in the ministry, and external expertise will only be brought in when absolutely necessary,” he added.\n\n“PNSC ships, having completed their operational life, were sold and are now being replaced with relatively newer ships through better deals,” Chaudhry said. “The inclusion of these new ships is expected to enhance PNSC’s competitiveness.”\n\nChaudhry added that the ministry has sought plans from its subsidiaries with monthly progress reviews scheduled. Additionally, a special cell will be set up to fast-track maritime affairs related to Islamabad.\n\nLast November, Danish international container shipping company Maersk Line pledged to invest $2bn in Pakistan’s maritime sector, with the government expressing willingness to collaborate.\n\nDuring a meeting with the officials of the shipping giant, then-Minister for Maritime Affairs Qaiser Ahmed Shaikh described the investment as a significant achievement for Pakistan’s shipping and logistics industry, underscoring the potential for long-term economic benefits from enhanced cooperation.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/261946132a06b51.jpg",
  "retrievedAt": "2025-08-25T15:27:40.581Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900473/denmarks-2bn-investment-to-boost-pakistans-port-sector-maritime-minister",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T15:10:27.000Z"
}
