{
  "title": "Chinese doctors implant pig liver in human for first time - World - DAWN.COM",
  "author": null,
  "content": "Chinese doctors said on Wednesday that they had transplanted a liver from a genetically modified pig into a brain-dead human for the first time, raising hopes of a live-saving donor option for patients in the future.\n\nPigs have emerged as the best animal organ donors, with several living patients in the United States having received pig kidneys or hearts in the last few years.\n\nLivers have proved trickier — and had not previously been tested out inside a human body. But with a huge and growing demand for liver donations across the world, researchers hope that gene-edited pigs can offer at least temporary relief to seriously ill patients on long waiting lists.\n\nDoctors at the Fourth Military Medical University in Xi’an, China, announced the field’s latest breakthrough in a study in the journal Nature.\n\nA liver from a miniature pig, which had six edited genes to make it a better donor, was transplanted into a brain-dead adult at the hospital on March 10, 2024, according to the study.\n\nThe trial was terminated after 10 days at the request of the family, the doctors said, adding that they had followed strict ethical guidelines.\n\nThe patient, whose name, gender and other details were not revealed, still had their original liver, receiving what is called an auxiliary transplant.\n\nThe hope is that this kind of transplant can serve as a “bridge organ” to support the existing liver of sick people waiting on a human donor.\n\nOver the 10 days, the doctors monitored the liver’s blood flow, bile production, immune response and other key functions.\n\nThe pig liver “functioned really well” and “smoothly secreted bile” as well as producing the key protein albumin, study co-author Lin Wang of the Xi’an hospital told a press conference. “It’s a great achievement” that could help people with liver problems in the future, he added.\n\nOther researchers also hailed the breakthrough but emphasised that this early step could not confirm whether the pig organ would work as a replacement for human livers.\n\nTransplants of livers have proved difficult because they carry out several different functions — unlike hearts, for example, which simply pump blood, Lin said.\n\nLivers filter the body’s blood, breaking down things such as drugs and alcohol, as well as producing bile that carries away waste and breaks down fats.\n\n“The pig liver produced far smaller amounts of bile and albumin than a human liver could achieve,” Lin said. “More research is needed, including studying the pig liver for more than 10 days,” he added.\n\nNext, the doctors plan to trial the gene-edited pig liver in a living human.\n\nOxford University transplantation professor Peter Friend, who was not involved in the study, said the results were “valuable and impressive”.\n\nHowever, “this is not a replacement for liver transplantation from human donors [at least in the near-term],” he told AFP in an email.\n\n“This is a useful test of the compatibility of genetically modified livers with humans and points to a future in which such livers can provide support for patients in liver failure.”\n\nLin emphasised that collaboration with US researchers was crucial.\n\n“To be frank, we have learned quite a lot from all the research performed and investigated by the United States doctors,” he said.\n\nLast year, scientists at the University of Pennsylvania attached a pig liver to a brain-dead patient — but instead of being transplanted, the organ remained outside the body.\n\nBoth US recipients of pig heart transplants died.\n\nHowever, Towana Looney, 53, is back home in Alabama after receiving a pig kidney on November 25, 2024.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/2623390114988f7.jpg",
  "retrievedAt": "2025-08-25T15:27:40.576Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900487/chinese-doctors-implant-pig-liver-in-human-for-first-time",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T18:28:12.000Z"
}
