{
  "title": "Student killed in Bannu firing laid to rest amid protest - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: A student, who had lost his life to a warning shot fired by security personnel, was buried at a graveyard in Bharat area of Bannu district on Tuesday.\n\nMoving scenes were witnessed at his funeral prayer, which was attended by Provincial Minister Pakhtunyar, Jamaat-i-Islami leader Mohammad Ibrahim, Malik Adnan, district bar association president Shah Qiaz Bacha, Syed Baseer Ali Shah, Advocate Shaukat Ayaz, Pir Kamal Shah and thousands of locals from various parts of the district.\n\nMarwat Bittani Tehreek chairman Inamullah along with a delegation also attended the funeral prayer at the sports complex. Some locals said that on Monday, security personnel fired at two boys riding a motorcycle near police lines on Miramshah road when they violated the signal.\n\nLocals stage sit-in on Miramshah road\n\nAs a result, Waqas died instantly while his companion remained unhurt and he later told media that they had no knowledge of the restrictions on using the road. In a video clip that appeared on social media, he said when they crossed the barrier, security personnel blew a whistle but Waqas accelerated his motorbike.\n\nThere is no official word about the boy’s killing incident so far. After the twin suicide blasts in the cantonment on March 4, local authorities closed Miramshah road to all kinds of traffic due to security reasons.\n\nThe killing of the boy sparked protests as relatives, locals and traders gathered on Miramshah road and staged a sit-in there. Before the funeral prayer, local elder Inamullah from Lakki Marwat assured Bannu residents that Marwat and Bittani tribesmen stood by them in the time of distress.\n\n“If need arises, you will find the people of Lakki Marwat district in the front line,” he said. He asked elders of Lakki Marwat, Bannu, and North Waziristan districts to form a grand committee for a consensus action in case any untoward incident occurs in the future.\n\nOther elders expressed their concern over poor law and order in the region and said that incidents of targeting government officials, religious scholars and elders had become common.\n\n“On one hand people are not safe at the hands of terrorists of banned outfits while on the other they are being targeted by law enforcers on suspicion,” they said. They asked people to set aside their differences and forge unity so the student’s funeral would become the final one in the district.\n\nThe provincial minister told journalists that a joint investigation team comprising local administration and security officials and relatives of the deceased was constituted for an impartial and transparent investigation of the incident.\n\nHe said that efforts were under way to open the roads, which had been closed for security reasons.\n\nAlso on Tuesday, a jirga comprising elders met with Deputy Commissioner Abdul Hameed Khan at his office to discuss with him matters pertaining to law and order and the problems faced by people. Minister Pakhtunyar led the delegation.\n\nBoth sides agreed that joint efforts would be made for the restoration of peace and the resolution of people’s problems. The deputy commissioner asked elders to play their role in bringing sustainable development and prosperity to the region.\n\nPublished in Dawn, March 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e3329aa18d3.jpg",
  "retrievedAt": "2025-10-12T02:11:26.336Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900305/student-killed-in-bannu-firing-laid-to-rest-amid-protest",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T02:01:05.000Z"
}
