{
  "article_id": "2025-09-12_5701b47437d40d51efde03001fcf5ab2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nahe-celebrates-23-years-of-advancing-higher-education-in-pakistan/",
    "retrieved_at": "2025-09-19T16:51:18.441Z"
  },
  "metadata": {
    "title": "NAHE celebrates 23 years of advancing higher education in Pakistan",
    "author": null,
    "date_published": "2025-09-12T15:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 242,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 12 (APP):The National Academy of Higher Education (NAHE) of the Higher Education Commission (HEC) marked its 23rd founding anniversary, reaffirming its commitment to advance higher education in Pakistan. The graceful ceremony in this regard was held here, where Dr Syed Mahmood Raza, former advisor to HEC and a distinguished member of the founding team, was the chief guest. The event was also attended by 27 Interim Placement of Fresh PhDs (IPFP) fellows who joined in commemorating HEC's remarkable journey of over two decades in transforming higher education in Pakistan, said a press release on Friday. Speaking on the occasion, Dr Syed Mahmood Raza highlighted the pivotal role of the HEC in transforming Pakistan's higher education landscape since its inception. He acknowledged the collective contributions of universities, faculty, researchers and students in strengthening the sector and reaffirmed HEC's mission to promote quality, innovation and inclusivity in higher education. In her remarks, Dr Noor Amna Malik, Managing Director of NAHE, emphasized that as the institution marked its anniversary, it remained committed to expanding access to higher education, supporting cutting-edge research, strengthening governance and aligning academic programs with the evolving needs of society and the economy. The celebration featured a cake-cutting ceremony and special tributes to HEC's founders, leadership and partners whose vision and contributions have shaped its progress over the years. The ceremony concluded with a collective pledge by all participants to continue striving for the advancement of higher education in Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}