{
  "article_id": "2025-09-12_24ee0da73f293b409b07c286df2d4a75",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tika-scales-up-relief-efforts-in-punjab-to-support-50000-people/",
    "retrieved_at": "2025-09-19T16:50:29.961Z"
  },
  "metadata": {
    "title": "TIKA provides emergency relief to flood-affected communities in Punjab",
    "author": null,
    "date_published": "2025-09-12T22:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 184,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, September 13 (APP):The Turkish Cooperation and Coordination Agency (TIKA) has stepped up emergency relief operations in Punjab as devastating floods continue to inundate vast areas across Pakistan. According to TIKA, in the districts of Kasur, Jhang, Bahawalnagar, and Muzaffargarh, TIKA has been distributing hot meals and family hygiene kits to displaced families. At the same time, health camps organized through the TIKA mobile clinic have been serving vulnerable communities in Wazirabad/Sialkot, Kasur, and Multan, providing much-needed medical consultations and free medicines. Earlier in Khyber Pakhtunkhwa (KP), TIKA carried out similar interventions in Buner and Swat districts, where hot meals were distributed to flood-affected households. In addition, the TIKA Mobile Clinic delivered healthcare services in Buner, and family hygiene kits were provided to local families to improve sanitary conditions in temporary shelters. With its emergency response in both Punjab and KP, TIKA intends to reach a total of 50,000 people with hot meals, hygiene kits, and essential health services. These efforts underscore Turkiye's solidarity with Pakistan in the face of climate-induced disasters, and TIKA's commitment to stand with vulnerable communities in times of need.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}