{
  "article_id": "2025-09-12_bf2daa4a6331735102796f1a30cead8d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-committee-approves-bills-related-to-diya-women-rights/",
    "retrieved_at": "2025-09-19T16:50:32.581Z"
  },
  "metadata": {
    "title": "Senate Committee approves bills related to diya, women rights",
    "author": null,
    "date_published": "2025-09-12T18:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 492,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 12 (APP): The Senate Standing Committee on Law and Justice on Friday approved various legislative bills related to diyat women rights and public welfare. The Committee, under the leadership of Chairman Senator Farooq Hamid Naek, convened at Parliament House in continuation of its earlier session to consider pivotal reforms in criminal law, family law, and constitutional provisions. Demonstrating a strong commitment to public welfare and legislative responsiveness, the Committee unanimously passed significant public-centered reforms aimed at strengthening access to justice and promoting legal equity. The Committee approved crucial amendments to the Pakistan Penal Code (Amendment) Bill, 2025, tabled by Senator Samina Mumtaz Zehri, raising the minimum value of diyat from 30,663 grams to 45,000 grams of silver. The revised figure reflects changing economic realities and aims to standardize the financial component of compensation in light of inflation and public expectations. Senator Samina Mumtaz Zehri assured that the amendment strictly adheres to Islamic injunctions, reinforcing the Bill's alignment with Shariah principles. Despite this, Senator Kamran Murtaza recorded his dissent, citing concerns about the practical implications for financially underprivileged convicts. Senator Farooq H. Naek, Chairman Committee, commenting on the increase in the diyat amount, stated that the revision was essential to enhance deterrence, uphold the sanctity of life, and ensure fair compensation to the heirs of the deceased. He commended the Committee's members for their constructive input and reaffirmed the Committee's commitment to pursuing people-centric legal reforms that reflect evolving societal needs. In a landmark move to address the prolonged financial suffering of divorced women and their children, the Committee also adopted the sub-committee's report on the Family Courts (Amendment) Bill, 2024, also introduced by Senator Samina Mumtaz Zehri. The legislation mandates that maintenance allowances for a divorced woman and her children must be fixed at the first hearing. Furthermore, if the defendant fails to pay the maintenance by the 14th of each month, the defence will be struck off, and the case decreed based on the plaint and supporting evidence. Senator Zehri emphasized the dire need for this reform, stating that in Pakistan, divorce proceedings often drag on for years, disproportionately affecting women and children who lack financial independence. This amendment ensures timely relief and upholds the dignity of vulnerable families.\" Chairman Committee and all members vehemently supported pro-women and public interest legislation, emphasizing that \"laws that protect the vulnerable and ensure swift justice are the need of the hour.\" Senator Kamran Murtaza, however, submitted a dissenting note, expressing constitutional concerns under Article 10-A related to the right to a fair trial. Regarding the Constitution (Amendment) Bill, 2025, seeking changes to Article 27, introduced by Senator Mohammad Abdul Qadir, the mover withdrew the bill with the Committee's consent, acknowledging its redundancy in light of a recent Supreme Court judgment and the existing third proviso to Article 27(1) of the Constitution. The meeting was attended by Senators Shahadat Awan, Kamran Murtaza and Samina Mumtaz Zehri, along with officials from relevant government departments.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}