{
  "title": "PTI government introducing reforms to ensure transparency: Shibli Faraz",
  "link": "https://www.app.com.pk/national/pti-government-introducing-reforms-to-ensure-transparency-shibli-faraz/",
  "date_published": "2020-07-11T09:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP):Minister for Information and Broadcasting, Senator Shibli Faraz on Saturday said that the Pakistan Tehreek-e-Insaf government was introducing number of reforms in all national institutions to ensure transparency as promised in its manifesto.\nAddressing a joint press conference along with Chairman Prime Minister’s Inspection Commission Ahmed Yar Harraj here, he said Accountant General Pakistan Revenue (AGPR) was an important institution which made payments for all public sector procurements.\nHe said that it has been noticed that purchases made by the government are costlier than the similar purchases made by the private sector as AGPR had to be paid bribes for clearance of bills and issuance of cheques.\nHe said that the institutions add the amount paid to AGPR in the cost of the items purchased.\nHe said as per an estimate, every year Rs 1 trillion purchases were done by the federal government, and Rs 150 to 175 billions were paid as higher cost.\nHe said at provincial level similar purchases and procurements were done on higher cost resulting in loss to the national exchequer.\nThis, he said did not include public sector corporations and independent institutions like PIA, NHA and others.\nHe said that during the past 10 years the national exchequer suffered Rs 4 trillion loss due to malpractices in the AGPR and the then governments took no action to stop these practices as they were also receiving commission and kickbacks from the system.\nHe said that Prime Minister Imran Khan neither has any personal business, nor his family was in politics, so he had the moral courage and mandate to rectify these malpractices continuing since many decades.\nHe said that opposition parties were holding meetings to pressurise Imran Khan to stop the accountability process but he will never budge to their tactics.\nReplying to the questions of media persons, he said that PTI was the only party which expelled its members from the provincial assembly who violated party policy in Senate elections. He said that Imran Khan has been struggling against the corrupt system for 24 years and there was no place for corrupt elements in the party. He said that the PM has been keeping an eye on all ministers and anyone involved in malpractices would be taken to task.\nAppreciating the Chief Justice of Pakistan for allowing the constitution of 120 more accountability courts, he said that opposition parties were feeling the heat so they were organizing so-called all party conferences. To a question, he said that the opposition parties were divided, having no consensus on any issue.\nHe said that the PML- N and PPP had differences of opinion on many issues, they were only united when they feared the accountability process.\nAbout handling of coronavirus, he said that with the grace of Allah Almighty, Pakistan under the leadership and vision of Prime Minister Imran Khan had handled the situation much better than many advanced countries having strong economies and modern healthcare systems.\nHe said that now the entire world has appreciated the approach of the Pakistan government to control the spread of coronavirus but at the same time protect the people from hunger and unemployment.\nHe said that the strategy adopted by Prime Minister Imran Khan against coronavirus was spot on and the other countries were trying to replicate the same in their own countries.",
  "retrievedAt": "2025-08-11T19:28:40.088Z"
}
