{
  "title": "CM inspects OLMT progress during surprise visit",
  "link": "https://www.app.com.pk/national/cm-inspects-olmt-progress-during-surprise-visit/",
  "date_published": "2020-07-11T02:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 11 (APP):Punjab Chief Minister Sardar Usman Buzdar paid a surprise visit to Orange Line Metro Train (OLMT) at Dera Gujran station and reviewed preparations for the launch of the train service.\nThe chief minister also inspected the latest facilities, being provided in the Orange Line Metro Train, automatic equipment and different sections.\nManaging Director (MD) Punjab Mass Transit Authority gave a detailed briefing to chief minister about the current status of the project.\nUsman Buzdar, while directing the authorities concerned to make the Metro Train functional, said that the train was part of China-Pakistan Economic Corridor (CPEC) initiative, construction work of Metro Train has almost been completed and government was waiting for favourable conditions for its launch. The train service would be formally started soon after removal of hurdles caused due to COVID-19.\nThe CM said that by making the OLMT functional, the government would be ending the tradition of closure of previous government’s projects. Metro train was being made functional for the welfare of people and for their convenience. He said that the government was determined to provide the best transport facilities to citizens of the metropolis.\nHe said that it had been decided that the standard operating procedures (SOPs) to prevent passengers from COVID-19 would be strictly followed in the Orange Line Train.\nThe MD Mass Transit Authority apprised the CM about the progress on the initiatives taken for functioning OLMT.\nHe said that electrical, mechanical and civil works of the project had been completed. He said that services of officials and experts of Chinese companies including Norinco, GMG and Daewoo had been hired.\nSecretary Transport, DG LDA, Chief Engineer LDA, Deputy Commissioner Lahore Division, GM PMA, MD NESPAK, and others were present on the occasion.",
  "retrievedAt": "2025-08-11T19:28:44.715Z"
}
