{
  "title": "Govt takes notice against corrupt practices of AGPR, other institutions: Harraj",
  "link": "https://www.app.com.pk/national/govt-takes-notice-against-corrupt-practices-of-agpr-other-institutions-harraj/",
  "date_published": "2020-07-11T04:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP):Chairman Prime Minister’s Inspection Team, Ahmad Yar Hiraj said Saturday that the government was paying the cost of corrupt practices that have been committed by the employees of Accountant General Pakistan Revenue (AGPR) and other institutions.\nAddressing a joint press conference along with Minister for Information and Broadcasting Shibli Faraz, he said that reformation of these institutions was part of the vision of Prime MInister Imran Khan.\nAhmad Yar Hiraj said recommendations regarding reforms in Accountant General Pakistan Revenue were also being sent to the Prime\nMinister.\nHe said that his commission has recommended SOPs which matched the PM’s vision of digital Pakistan. He said that a system update has been proposed so that the amounts of the cheques to be issued to various institutions should directly go to the accounts like the salaries of the employees with no chance of corruption.\nMoreover the AGPR should issue the list containing details of the requirements for clearance of bills on its website, so that no objection should be raised to delay the payments.\nHe said it was unfortunate that the malpractices rampant in AGPR were now spread to other institutions as well. He said in AGPR postings of Grade 21 and 22 officers were being done without approval of the PM, which was also against the rules and would be stopped forthwith. He said that during past ten year the national exchequer lost Rs 4 trillion due to malpractices in AGPR which could have been saved if the then governments had taken action.\nHe said it was noticed by PMIC that government purchases were costing more than the similar procurements done by the private sector. He said that this was called speed money or corruption as no bill was cleared from AGPR easily as objections were raised to get a gratification amount. As the vendors had to bribe the AGPR staff,they showed an increase in prices of purchased items to adjust the amount, which proved an additional burden on national exchequer.\nHe said FIA has also been directed to take action against the employees of AGPR who were involved in malpractices after evaluating the details of their assets. He said that when he took charge, he realised that performance of almost all institutions was marred by malpractices.\nHe said that previous governments remained silent over the rampant malpractices and credit of taking this initiative goes to PTI regime He said under the reforms agenda of the government, the Inspection Commission has completed 24 inspections during 18 months.\nHe said reports of these inspections have been sent to the Prime Minister and actions are being taken against the culprits involved in corruption and embezzlement.",
  "retrievedAt": "2025-08-11T19:28:41.179Z"
}
