{
  "title": "PM to visit Diamer Basha Dam next week to review construction work",
  "link": "https://www.app.com.pk/national/pm-to-visit-diamer-basha-dam-next-week-to-review-construction-work/",
  "date_published": "2020-07-11T05:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 11 (APP):Prime Minister Imran Khan will visit strategically important Diamer Basha Dam Project next week to review construction activities, as work on the project has commenced in the wake of swift mobilization of the Contractor to the site.\nDiamer Basha Dam was marred with delay of decades due to various contributing factors. However, the incumbent government realigned the project while prioritizing the water and hydropower sectors in its development strategy, according to a WAPDA press release issued on Saturday.\nFollowing prompt decision making by the government and an innovative financial plan by WAPDA to arrange funds for construction of the project with meager burden on the national exchequer, Diamer Basha Dam is at last going to see light of the day.\nAfter Mohmand Dam which was started in 2019, Diamer Basha Dam is the second mega multi-purpose dam that has been commenced in about a year.\nDiamer Basha Dam, a vital project for water, food and energy security of Pakistan, is being constructed on River Indus, 315 Kilometer (Km) upstream of Tarbela Dam, 180 Km downstream of Gilgit, and 40 Km downstream of Chilas town. The project is scheduled to be completed in 2028-29.\nThe project has three core objectives namely water storage for agriculture, flood mitigation and hydel power generation. The dam will have a gross water storage capacity of 8.1 million acre feet (MAF) to irrigate 1.23 million acres of additional land. The project with installed power generation capacity of 4500 megawatt (MW) will provide more than 18 billion units per annum to the National Grid.\nIf this quantum of electricity is to be generated through expensive thermal source, the national kitty will have to spend Rs. 270 billion at the average generation cost of Rs. 15 per unit.\nConstruction of Diamer Basha Dam will also have a positive impact on the annual energy generation of the existing hydel power stations including Tarbela, Ghazi Barotha etc. that will increase by another 2.5 billion units. In addition, the life of Tarbela Dam, that has been playing a pivotal role for progress of the country since 1974, will also increase by another 35 years.\nIn view of its benefits, Diamer Basha Dam Project will go a long way in stabilizing the national economy.\nCommencement of Diamer Basha Dam has proved a good omen for the locals as Rs. 78.5 billion are being spent on various schemes as Confidence Building Measures (CBMs) in the project area. Employment opportunities will also be generated during construction as well as completion of the project.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:28:40.070Z"
}
