{
  "title": "CM Mahmood holds meeting of Peshawar Safe City Project",
  "link": "https://www.app.com.pk/national/cm-mahmood-holds-meeting-of-peshawar-safe-city-project/",
  "date_published": "2020-07-11T04:35:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 11 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan Saturday chaired meeting to review progress on the proposed Peshawar Safe City Project and was briefed in detail about various aspects of the project including timely completion of different processes, estimate cost, status, moods of implementation, plan of action etc.\nThe meeting was informed that 11 kanal of land had been allotted for the construction of Command and Control Centre of the project, survey of 31 police stations had been completed and 940 points had been identified for installation of 3500 cameras.\nThe meeting was further informed that PC-1 of the project had been finalized and submitted to the Provincial Development Working Party for approval, which would later be submitted to the Central Development Working party and Executive Committee of the National Economic Council for final approval.\nThe meeting was also given a cost comparison of Lahore, Islamabad and Peshawar Safe City Projects and informed that the Peshawar Safe City Project would be completed with an estimated cost of Rs.19 billions.\nBesides Inspector General of Police Dr. Sanauallah Abbassi, Principal Secretary to CM, Shahab Ali Shah, Secretary Planning and Development, Humayun Khan and Capital City Police Officer, Muhammad Ali, and officials from Police and Home department also attended the meeting.\nThe Chief Minister while expressing his satisfaction on the progress so far made, directed the concerned quarters for necessary steps to get the PC-1 of the project approved from all the competent forums as per the given timelines.\nMahmood Khan termed the proposed project as of highly importance for the all-time solution of the security issues of the provincial capital.\nHe directed all the relevant authorities to carry out a detailed study of the Lahore and Islamabad Safe City Projects before starting practical work on the Peshawar Safe City Project.\nHe said after carrying out a detailed study of Islamabad and Lahore projects, it would help in avoiding the repetition of the mistakes and faults once committed on those projects further directing that practical work on Peshawar Safe City Project be started after ensuring its feasibility in all respects.\nHe stressed the need of going for a suitable financing mood and operational module to make the project feasible and sustainable, and directed that a comprehensive strategy be devised to address all the possible technical issues, which may hinder the smooth implementation of the project.\n“Protection of the lives and properties of the citizen is the top priority and responsibility of his government and all available resources would be utilized to this end,” Mahmood Khan remarked.\nHe directed the concerned authorities to design the Peshawar Safe City Project in such a way that it should cater for the futuristic security needs of the metropolis.\nHe further directed all the relevant departments to fix realistic timelines to make progress on the project and to take all the required steps to ensure physical progress as per the fixed timelines.",
  "retrievedAt": "2025-08-11T19:28:43.136Z"
}
