{
  "title": "APHC expresses concern over continued killing spree in IIOJK",
  "link": "https://www.app.com.pk/national/aphc-expresses-concern-over-continued-killing-spree-in-iiojk/",
  "date_published": "2021-03-14T17:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): In Indian illegally occupied Jammu and Kashmir, the All Parties Hurriyat Conference (APHC) said that the incessant genocide, and the frequent use of draconian laws to incarcerate the innocent people, especially youth, have rendered the oppressed people of the territory vulnerable to a situation worst than the Apartheid in the history of the mankind.\nAccording to Kashmir Media Service, the APHC Working Vice Chairman, Ghulam Ahmed Gulzar, in a statement issued in Srinagar said, it is a matter of grave concern that the people of the territory have been left to the mercy of over one million Indian forces’ personnel, equipped with sophisticated and lethal weapons to deal with the common masses with impunity.\nTerming the current overall situation of the territory as most grim and volatile with respect to plight of religious, political, civil and human rights at the hands of Indian military and fascist regime, Ghulam Ahmed Gulzar condemned the barbaric attitude of the Indian imperialism towards the people of IIOJK who are demanding their inalienable right to self-determination since the partition of Indian sub-continent in 1947.\nHe urged the United Nations Secretary General to take cognizance of the prevailing deteriorating situation in the occupied territory and take serious steps to resolve the long pending dispute in accordance with the UN resolutions.\nGhulam Ahmed Gulzar also expressed deep concern over the well-thought ploys of India to divide the people of Kashmir on ethnic and sectarian basis to grind its own axes and urged the people of Kashmir to stand united to defeat the nefarious designs of India.\nThe APHC leader maintained that it was a sheer frustration of all the enemies of Islam whose teachings are reaching out to the darkest corners of the modern life and is spreading speedily irrespective of their venomous conspiracies. “Quran is a light to enlighten.\nNone can bar its way and Muslim Ummah must rise to the occasion and brave the challenges ahead as torch-bearers of the universal peace, justice and brotherhood in the contemporary world,” he added.",
  "retrievedAt": "2025-08-11T20:29:17.454Z"
}
