{
  "title": "Fawad advises PDM leaders to call off their long march decision",
  "link": "https://www.app.com.pk/national/fawad-advises-pdm-leaders-to-take-back-their-long-march-decision/",
  "date_published": "2021-03-14T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):Federal Minister for Science and Technology Chaudhry Fawad Hussain Sunday advised the PDM leaders to call off its long march decision and sit together with the electoral reforms committee to have their useful input accepted by the government.\nHe said that long march was unlawful under Charter of Democracy signed between Nawaz Sharif and Shaheed Benazir Bhutto and added, we can scarify our government for the sack of democracy.\nAddressing a press conference flanked by Minister for Information and Broadcasting Shibli Faraz at PID here Sunday, the Federal Minister said the ups and downs are part of politics and one should not have cross the red lines after defeating.\nJaved Latif is merely a puppet of his political masters. There would have no issue if Senate election were held through open balloting, he said and added that those who wanted to follow MQM founder must look into their fate.\nFawad Chaudhry said that PML-N leader Javed Latif’s anti-Pakistan statement was highly painful and condemnable, which was clear negation of PPP leader Asif Zardari’s popular slogan “Pakistan Khappay” after martyrdom of BB Shaheed.\nHe said that both Nawaz Sharif and Altaf Hussain were the gifts of 80s politics and they had no political principles when it was the matter of getting vested political interests for them. The minister added that it was a great unfortunate that the national politics was made hostage at the hands of politically immature leaders.\nCommending the NAB’s move of rejecting the bail application of Maryam Nawaz, the Federal Minister said the government has no control or influence over the National Accountability Bureau (NAB) and courts.\nMaryam’s willingness to leave for London would not be fulfilled, he said and added that Nawaz had to decide either he wants to return the public money or go to jail.\nFawad said the federal government has provided Rs 1600 billion to Sindh government but even then, he added, the Sindh Chief Minister says he is not answerable to the center nor he is under the federal government.",
  "retrievedAt": "2025-08-11T20:29:22.736Z"
}
