{
  "title": "Sanjrani to play constructive role in strengthening democracy: Swati",
  "link": "https://www.app.com.pk/national/sanjrani-to-play-constructive-role-in-strengthening-democracy-swati/",
  "date_published": "2021-03-14T17:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Minister for Railways Azam Khan Swati on Sunday said the newly elected Senate Chairman Sadiq Sanjrani would continue to play his constructive role in strengthening  the democracy, the rule of law and institutional reforms.\nSanjrani in his previous tenure had run the upper house as per the vision of Prime\nMinister Imran Khan to make the Senate dignified, he said while talking to journalists\nat the residence of Senate Chairman here.\nHe visited the Sanjrani residence to congratulate him on his re-election as\nChairman of the upper house of the parliament.\nSwati thanked all the House members for showing their confidence on Sanjrani\nby giving him vote in the Senate election.\n“The entire nation also deserves congratulations on this historic triumph,” he observed.\nRailways Minister said during the three years term of Sanjrani the government\nand the opposition, had enacted legislation on important national issues like FATF\nand for that, he deserves appreciation.\nHe appealed the opposition to work with government for effective legislation in both the houses while putting aside their differences and personal gains.\nReplying to a question, he said cracks have already been appeared in the opposition’s Pakistan Democratic Movement (PDM) and now they would face defeat in upcoming general elections of 2023.\nTo another query, Swati said PDM defeat in Senate elections had proved that there was no space for JUI-F chief Maulana Fazl-ur-Rehman in the opposition alliance.\nHumiliation and disgrace had become a fate of PML-N leader Javed Latif and his supremo Nawaz Sharif, he said adding that he should resign from the membership of the National Assembly.\nTaking a jibe over PML-N vice president Maryam Nawaz, he said the defeat of the opposition alliance in the Senate election was a defeat for her statements, and now she should seek repentance.",
  "retrievedAt": "2025-08-11T20:29:19.650Z"
}
