{
  "title": "CM attends Punjab Culture Day ceremony",
  "link": "https://www.app.com.pk/national/cm-attends-punjab-culture-day-ceremony/",
  "date_published": "2021-03-14T13:56:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 14 (APP):Punjab Chief Minister Sardar Usman Buzdar attended a special ceremony as the chief guest, held at the CM Office on Sunday in connection with the Punjab Culture Day celebrations.\nParticipants in the ceremony had donned traditional turbans. Provincial Minister for Culture Khayal Ahmed Kastro presented Punjab’s traditional turban to the chief minister who reciprocated the act. The CM also presented a turban to Advisor to PM Barrister Shehzad Akbar.\nThe CM said that the culture of Punjab was rich in traditions and famous all over the world as it has deep roots in the history. He said Punjabis have their own unique identity everywhere they live in the world.\nCelebrating and remembering culture and traditions was a sign of the living nations which take pride in their history as cultural festivals reflect the identity and individuality of each region, he added.\nUsman Buzdar said that the government was promoting cultural activities alongside observance of new coronavirus standard operating procedures (SOPs) for providing recreational activities to people, adding that Punjab was unique as it was the hub of multifaceted cultures.\nHe said that love, peace, brotherhood, unity and tolerance were the hallmarks of the culture of Punjab.\nThe chief minister said that the purpose of celebrating the Punjab Culture Day was to promote love, brotherhood and unity. He said that only those nations flourish which promote their culture.\nThe culture of Punjab has colours of affection, hospitality and kindness. He also lauded the role of Directorate General Public Relations for promoting the culture of Punjab.\nAdditional Chief Secretary Irum Bukhari, Secretary Information and Culture Raja Jahangir Anwar, DGPR Saman Rai, Director General Punjab Institute of Language, art and Culture (PILAC) Sughra Sadaf, Executive Director Alhamra Dr Aslam Dogar, Director Alhamra Arts Council Zulfiqar Zulfi, Executive Director Pukar Rizwan Sharif, Director Lahore Museum Ijaz Minhas and officials concerned participated in the programme.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T20:29:34.347Z"
}
