{
  "title": "Interior Minister Sheikh Rashid pays homage to martyrs of FC North",
  "link": "https://www.app.com.pk/national/sh-rashid-lauds-fc-role-for-maintaining-peace-in-kp/",
  "date_published": "2021-03-14T12:15:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Mar 14 (APP):Interior Minister Sheikh Rashid Ahmad on Sunday paid rich tribute to the martyrs of the armed forces including the cops of the Frontier Corps (North) for rendering their lives to restore peace in the region.\nHe said this while addressing the passing out parade of the 28th batch of FC recruits at the Scouts Training Academy, Warsak Peshawar. He also inspected the passing out parade of the 28th batch of FC recruits.\nInterior Minister Sheikh Rashid Ahmad paid homage to the performance of FC North and congratulated the newly trained soldiers for joining the Armed Forces of Pakistan. Sheikh Rashida said Pakistan Armed Forces have made immense sacrifices for peace in the country.\nHe said the officers and soldiers of Pakistan Armed Forces have narrated timeless stories of bravery. Sheikh Rashid Ahmed said that the efforts of the Frontier Corps for peace in Khyber Pakhtunkhwa were unforgettable.\nInspector General of FC Major General Adil Yaseen presented a memento to the Interior Minister Sheikh Rashid Ahmad.\nA large number of people from different walks of life attended the ceremony. Smartly turned out a contingent of passing out recruits presented the parade. Interior Minister Sheikh Rashid Ahmad and the Commandant Scouts Training Academy reviewed the parade.\nRecruiters took an oath of defending the motherland. The chief guest hoped that the new recruits would perform their duties with sheer dedication, loyalty and extreme hard work.\nSheikh Rashid Ahmad said the Frontier Corps (FC) had played a key role in the restoration of peace and FC’s history was full of sacrifices and bravery. He said the training would enable the soldiers to cope with the challenges in the line of duty.\nA special wreath laying ceremony was held at Yadgar-e-Shuhada. A smartly turned out contingent of FC presented salute to pay respect to the great heroes. Sheikh Rashid Ahmad said the nation was proud of the heroes who had stood fast in the hour of need.\nA large number of Shuhada families, political leadership, members of civil society and elders of the areas attended the ceremony.\nFC KP is a force with a long triumphed victorious history of over a century. FC KP is\nthe first responder to any kind of terrorism, natural calamity from Broghil Pass in the\nNorth to Gomal River in the south.\nFC KP is deployed along the Pak-Afghan border covering a vast area of approximately 1300 km. FC KP gives leverage and space to the Pak Army maintaining the law and order in the border and as well as the tribal areas.\nOur troops are well prepared for any kind of challenge to protect the dignity and\ngrace of the Nation.\nFC assists the government and civil law enforcement agencies against the enemies of the state and aiding in maintaining the writ of the government in the tribal areas and settled districts as well.\nBeing deployed along the Pak-Afghan border, our troops collect and disseminate the border intelligence and provide early warning of any impending hostilities.\nTroops recruited are from FC KP and local tribesmen, thus the force is composed of locals, thereby creating the spirit of patriotism in the far flung underdeveloped areas.\nAt the end, Minister for Interior Sheikh Rashid Ahmad distributed prizes to the best performing recruits during the training.",
  "retrievedAt": "2025-08-11T20:29:24.881Z"
}
