{
  "title": "NAHE to improve quality of teaching, research & governance in HEIs",
  "link": "https://www.app.com.pk/national/nahe-to-improve-quality-of-teaching-research-governance-in-heis/",
  "date_published": "2021-03-14T07:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):National Academy of Higher Education (NAHE), under Higher Education Commission (HEC) was making all-out efforts to improve the quality of teaching, research, and governance in Higher Education Institutions (HEIs) across Pakistan\nNAHE could provide support in three key areas, including individual-level capacity building, institution-level capacity enhancement and empowering higher education institutions to self-regulate and deliver quality learning for faculty, said Rector NAHE Dr Shaheen Sardar Ali while talking to APP.\nIt would also would help provide a platform for faculty development units across the country.\nShe said that the pandemic has its costs but also provides an opportunity to improve and innovate. She also shed light on the importance of collaboration for excellence in teaching and learning in the higher education sector.\nShe also emphasized the need to contextualize trainings to ensure fulfillment of the needs of universities to address their specific needs.\nShe pointed out the urgent need for equipping faculty with technological and teaching skills in this new context of online learning including the need to train faculty on effectively conducting assessments beyond final and midterm exams.\nThe Academy, Rector NAHE said, will provide multifaceted courses, workshops, certifications and degrees for Higher Education faculty and staff at different stages of their careers.\nWhether general, need-based or customised, these offerings will address teaching practice, research methodology, administrative and leadership skills, educational management, as well as socio-culturally-/linguistically-specific topics and conventional professional development domains within the ambit of higher education.\nConducting and promoting research on higher education will be an integral aspect of all NAHE’s activities so that it can function as a dynamic and reflexive institution, she said adding that this, in turn, will allow it to address the need to set benchmarks for quality across different spheres of academics and HEIs through evidence-based interventions and programmes.\nNAHE will also support the establishment of centres or programmes focusing on capacity building of faculty and management of HEIs by building strategic and sustainable partnerships with international HEIs, she added. These connections, Dr Shaheen said, will also strengthen educational technology capabilities, develop strong alumni networks and facilitate the formation and support of communities of practice for ongoing engagement and improvement.",
  "retrievedAt": "2025-08-11T20:29:27.170Z"
}
