{
  "title": "Capital embraces healthiest day of year amid record low air pollutants",
  "link": "https://www.app.com.pk/national/capital-embraces-healthiest-day-of-year-amid-record-low-air-pollutants/",
  "date_published": "2021-03-14T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):The federal capital for the first time embraced the most cleanest and healthiest day of the year on Sunday as the air pollutant ratio dropped to the lowest level in the atmosphere amid rainy weather.\nDirector General Pakistan Environmental Protection Agency (Pak-EPA) Farzana Altaf Shah told APP that the air pollutant ratio of hazardous ambient particle was recorded at its lowest ratio of 7/6ug/m3 (microgrammes per cubic meter or parameter to guage the air pollutant presence in the atmosphere).\nThe particulate matter of 2.5 microns or PM2.5 was recorded higher in the federal capital’s air since January due to the prevailing dry weather whereas the present day reading was surprisingly the lowest ratio ever recorded, he added.\nFarzana said the air quality was mainly poor due to increased vehicular emissions, garbage or waste burning, industrial emissions and also the dry weather that generates more atmospheric pollutants.\nShe added that apart from the pleasant weather that turned the air quality healthy, the Pak-EPA staff made extensive efforts to contain air pollution.\nThe field staff was making regular visits to industrial units in the federal capital for inspecting emissions level, the Pak-EPA Director General said.\nFarzana said public cooperation and participation in keeping the federal capital’s air clean and healthy was imperative as the environmental watchdog alone was unable to ensure complaince of environmental laws.\nHowever, despite limited staff the Pak-EPA team had ensured not only compliance rather assisted industrial units to switch over eco-friendly technology.\nA monthly data projection of air quality, for December, 2020, released by Pakistan Environmental Protection Agency (Pak-EPA), the particulate of 2.5 (PM2.5) microns which was a hazardous ambient air pollutant causing chronic respiratory diseases and premature deaths was recorded higher than permissible limits.\nThe PM2.5 was not only below National Environmental Quality Standards (NEQS) of 35 micrograms per cubic meter rather World Health Organization (WHO) standard of 20 micrograms per cubic meter.\nThe air quality data revealed that average PM2.5 was recorded 7.6 micrograms per cubic meter whereas sulphur dioxide was recorded 12.36 micrograms per meter cube and nitrogen dioxide was 8.1 against the NEQS of 120 micrograms per meter cube and 80 micrograms per meter cube respectively.\nThe air quality data was recorded through calibrated air quality monitors that were both fixed and mobile hence providing accurate air quality data.No other data from any private sources was verified by Pak-EPA.\nIt may be mentioned that PM2.5 was generated during combustion of waste either industrial, human or vehicular emissions from its engine.\nThe nitrogen and sulphur dioxide gases were released from various industrial combustion during its operations.",
  "retrievedAt": "2025-08-11T20:29:26.266Z"
}
