{
  "title": "Pakistan Pavilion for Expo 2020 Dubai ready; handed over to government",
  "link": "https://www.app.com.pk/national/pakistan-pavilion-for-expo-2020-dubai-ready-handed-over-to-government/",
  "date_published": "2021-03-14T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):The construction of Pakistan Pavilion’s building for Expo 2020 Dubai has been completed and handed over to the Government of Pakistan, after finalizing the civil works.\nThe building was handed over at a ceremony at the Expo’s venue, which was attended by Advisor to the Prime Minister on Commerce and Investment Abdul Razak Dawood, Secretary Commerce Muhammad Sualeh Ahmed Faruqui, Pakistan Ambassador to UAE Afzaal Mahmood, Secretary Trade Development Authority of Pakistan (TDAP) Ahsan Ali Mangi and other officers.\nChief International Participants Officer at Expo 2020 Dubai Omar Shehadeh, Chief Development and Delivery Officer at Expo-2020 Dubai Ahmed Al Khatib and Country Manager for Pakistan at Expo 2020 Dubai Ahmed Al Hamdan were also present.\nThe Expo 2020 is now scheduled to be held from 1st October 2021 to 31st March 2022 under the theme of “Connecting Minds, Creating the future”.\nThe Expo site is spread over an area of 4.38 square kilometres that would house more than 200 pavilions. Millions of the visitors from across the globe are expected to visit six-month long event. The area is divided into three main districts i.e. Opportunity, Mobility and Sustainability.\nThe Pakistan Pavilion is located in the Opportunity District with a total covered area of 35,000 square feet.\nThe inner journey of the pavilion is set under the theme ‘Pakistan: The Hidden Treasure’ with an aim to enhance tourism, commerce and investment in Pakistan. The pavilion will take visitors through a timeless journey from the world’s earliest recorded civilizations to the challenges of the new millennium.\nOn the occasion, Abdul Razak Dawood said that Pakistan was bestowed with natural beauty, historical and religious sites, highest peaks and calm deserts. It is the destination for mountaineers, historians, archaeologists, writers, photographers and many such tourists.\nHe said through the said theme at Expo 2020 Dubai, Pakistan planned to present and showcase the land of opportunities to promote tourism, commerce and investment in the country.\nOn the side-lines, the TDAP is also planning events for the six months duration of the Expo including trade and investment seminars and conferences, cultural shows and events.",
  "retrievedAt": "2025-08-11T20:29:20.340Z"
}
