{
  "title": "Food self-sufficiency a survival kit for nations in crisis-hit world: President",
  "link": "https://www.app.com.pk/national/food-self-sufficiency-a-survival-kit-for-nations-in-crisis-hit-world-president/",
  "date_published": "2020-04-29T08:49:00.000Z",
  "source": "APP",
  "content": "QUETTA, Apr 29 (APP):President Dr Arif Alvi Wednesday stressing need for self-sufficiency in agricultural produce said in a world where a crisis zero-valued a commodity like petroleum, the future belonged to nations surviving their own food requirements.\nAddressing media persons after chairing a high-level meeting to review the measures taken by Balochistan government to control coronavirus, he said it was extremely important for Pakistan to prepare to produce ample staple to fulfill needs of population in the time of global crisis.\nPresident Alvi stressed facilitating the agriculture sector to encourage more produce and ensure self-reliance in crop growing.\nHe said Pakistan was effectively fighting the challenge of coronavirus with coordination among the centre, provinces and bodies concerned including National Disaster Management Authority (NDMA) and National Command and Operation Centre (NCOC).\nHe said the government and provinces were cognizant of the financial impact of the coronavirus situation on poor segment, for which Ehsaas Social Welfare Programme was giving them a cover in difficult times.\nDr Alvi said strategy on imposition of lockdown in view of coronavirus was a global topic, with different opinions on its duration and magnitude besides relaxation for some essential sectors.\nHe said Chinese President Xi Jinping in their meeting last month in Beijing informed him that China changed its strategy on coronavirus seven times in one-and-a-half month.\nThe president said Pakistani nation was steadfast in braving the challenge of COVID-19 and expressed confidence that it would emerge stronger after winning over tough times.\nHe advised the public to observe the standard operating procedures (SOPs) and necessary precautions as suggested by the government. It would not only help develop herd immunity but would also prove effective in minimizing the coronavirus cases, he added.\nHe expressed satisfaction over the country’s enhanced capacity-building in testing facility and production of face masks as protection against coronavirus.\nEarlier, the president arrived in Quetta this morning to personally monitor the in-place system against the spread of COVID-19, where he was received by Governor Balochistan Justice (retd) Amanullah Khan Yasinzai and Chief Minister Jam Kamal Khan.\nHe chaired a high-level meeting on the situation pertaining to coronavirus, which was attended by Federal Minister for Interior Syed Ijaz Shah, Federal Minister for Religious Affairs Pir Noorul Haq Qadri, Chairman of National Disaster Management Authority General Muhammad Afzal, governor and chief minister of Balochistan, Commander Southern Command Lt Gen Waseem Ashraf and senior officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:37.462Z"
}
