{
  "title": "PM directs Establishment Division to proceed for implementation of new retirement rules",
  "link": "https://www.app.com.pk/national/pm-directs-establishment-division-to-proceed-for-implementation-of-new-retirement-rules/",
  "date_published": "2020-04-29T03:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP):Prime Minister Imran Khan on Wednesday directed the Establishment Division to proceed for the implementation of new rules and regulations notified by the present government regarding the retirement of civil servants.\nThe Establishment Division, through a letter issued from the PM Office, has been directed to circulate the new rules to all the ministries so that the process of implementation of new rules could be initiated.\nAccording to the PM Office letter, administrators of all cadres have been directed to finalise lists as per rule 6 of the new rules within one month so that the performance of government servants could be reviewed.\nFollowing is the text of PM Office Letter:-\n“The Civil Servants (Directory Retirement from Service) Rules, 2020 have been notified vide SRO 320(I)/2020 dated 15th April, 2020. Rule 6 of the rules ibid, inter alia, provides that each Division, Department or Office shall maintain a list of civil servants who have completed requisite length of service under Section 13 of Civil Service Act, 1973 and carry out a review of their performance.\n“Upon mandatory review, if requisite grounds of retirement are observed in light of rule 5 of rules ibid, such cases will then be referred by the cadre administrators to the respective Retirement Board or Retirement Committees, as the case may be.\n“Since, the rules have now come into force, the Prime Minister has been pleased to direct that Establishment Division, being custodian of the said rules, shall circulate necessary instructions to all Ministries / Divisions / Departments / Cadre Aministrators to proceed in accordance with the provisions of Civil Servants (Directory Retirement from Service) Rules, 2020.\n“Accordingly, the exercise required to be carried out by the Cadre Administrators, in terms of rule 6 of rules ibid shall be completed within a period of one month, positively.\n“Establishment Division shall proceed further accordingly. “\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:42.086Z"
}
