{
  "title": "IOJK situation deteriorating under Delhis’ imposed lockdown: AJK President:",
  "link": "https://www.app.com.pk/national/iojk-situation-deteriorating-under-delhis-imposed-lockdown-ajk-president/",
  "date_published": "2020-04-28T23:00:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Apr 29 (APP):Azad Jammu Kashmir President Sardar Masood Khan said on Wednesday that the situation in Indian Occupied Jammu and Kashmir (IOJK) was deteriorating under a lockdown imposed by the Indian government.\nHe made these remarks while speaking to leading national political leaders and influential members of the Diaspora community in the federal capital, AJK President secretariat said in a news release.\nThe president said that due to the coronavirus life around the world had come to a standstill and a strict lockdown too had been imposed in AJK to help contain the pandemic.\nDue to the effective implementation of a lockdown in AJK, the number of infected individuals was only around 60 and no deaths had been reported so far, he added.\nHe said that foreign travellers were traced and tracked so as to ensure that no victims were left out.\nPresident Masood Khan apprised that the situation in IOJK was fast deterring.\nHe said that under the cover of the coronavirus lockdown, young Kashmiris were being mercilessly killed.\nThe president said that recently under the so-called cordon and search operations, almost 80 Kashmiris had been martyred, adding that the exact number had yet to be known.\nOver 13,000 young Kashmiris, he said, some as young as 9 were incarcerated and were being tortured.\nThe Indian leadership had claimed that these boys had been sent to “de-radicalisation camps”, he added.\n“International human rights organisations have called for the release of prisoners, as the cramped prison cells are high-risk areas for the transmission of the coronavirus”, said Masood Khan.\nAdditionally, he said that the coronavirus patients in IOJK were not even given proper treatment and care.\nSardar Masood said that on April 02, the Indian government had imposed the New Domicile Rules under which anyone from all over India who had resided in Kashmir or Jammu for 15 years, or spent seven years studying in regional educational institutions and appeared in class 10 or 12 examinations become permanent residents. This will also include workers, civil servants.\nLarge tracks of lands, he said had been reserved for RSS operatives especially those that had been brought in after the imposition of the August 5 occupational lockdown.\nThese lands will give a foothold to these RSS pracharaks who will terrorise the local population.\nHuge hospital complexes and business zones are being made on the pretext of “ushering in a new era of development” These complexes are being established only to accommodate Hindus from all over India.\nThe president said that India had intensified attacks across the Line of Control and were targeting civilians and public infrastructure.\nAdditionally, he said, they had shifted their mortar guns and cannons into local villages of IOJK and were using the innocent Kashmiris as human shields.\n“All this is done to divert the attention of the world from the human rights violations taking place in the IOJK”, he said.\nThe president appealed to not let the Kashmir issue die-down in the international arena. He said that only the Organisation of Islamic Cooperation had till now condemned the New Domicile Rules.\nHe urged the political leaders and influential opinion-makers to reach out to their global counterparts in an enduring manner. He said that virtual-diplomacy was a tool that could not be ignored and we must continue to highlight the Kashmir issue.\n“Continue to reach out to to the world and the international media in order to raise the profile of the Kashmir issue”, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:09:44.865Z"
}
