{
  "title": "PM emphasizes Parliament’s supremacy, calls for legislation in national interest",
  "link": "https://www.app.com.pk/national/pm-emphasizes-parliaments-supremacy-calls-for-legislation-in-national-interest/",
  "date_published": "2024-09-14T18:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday highlighting the importance of legislative efforts in the national and public interest, said that Parliament was the supreme institution of the country.\nHe underscored that the sanctity of Parliament must always be upheld, adding that national issues should only be resolved through Parliament.\nHe was addressing a banquet, he hosted in honor of Parliamentarians here.\nThe prime minister said the incumbent government had steered the country away from the risk of default and towards stability.\n“Political stability is crucial for ensuring economic stability and advancing the country on the path of development,” he added.\nHe pointed out that the anti-state elements made every effort for the country to default.\nHe said there were attempts to drag constitutional institutions and non-political figures into politics and make them a party.\n“The Charter of Democracy was signed under the leadership of Mian Nawaz Sharif and the Shaheed Benazir Bhutto that permanently blocked the path for unconstitutional actions,” the prime minister said.\nHe added that politics will continue, but the continuity of policies was crucial to save the country.\nHe highlighted that the country was making significant progress before 2018 under the leadership of Mian Nawaz Sharif, however a well-planned conspiracy was executed to remove him from the political landscape.\n“This conspiracy proved to be very expensive for Pakistan and its people as within the next three years, an incompetent government brought the country at the verge of default,” he added.\nThe prime minister said “when Allah Almighty entrusted us with the responsibility of pulling Pakistan out of economic quagmire, all political parties sacrificed their politics to save the country”.\nHe expressed his satisfaction that today the country’s economy was stabilizing again due to the prudent policies of the government. He said inflation was gradually decreasing and the policy rates cut will boost business activities in the country, create new employment opportunities, and increase exports.\nHe said the increase in remittances reflected the trust of overseas Pakistanis in the government. However he said much more remained to be done for the country’s development.\n“Let us make a pledge today that we all will work tirelessly for the nation’s progress,” the prime minister said.\n“I have complete faith that the sacrifices we all, including myself, are making for Pakistan’s economic security will not go in vain,” he added.\nThe dinner was attended by the federal ministers and members of parliament from Pakistan Muslim League (Nawaz), Muttahida Qaumi Movement (MQM), Balochistan Awami Party, National Party and Pakistan Muslim League Zia.",
  "retrievedAt": "2025-08-10T21:04:52.990Z"
}
