{
  "title": "COMSATS inks cooperative agreements with DGST-KP & RIHS",
  "link": "https://www.app.com.pk/national/comsats-inks-cooperative-agreements-with-dgst-kp-rihs/",
  "date_published": "2023-11-22T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): The Commission on Science and Technology for Sustainable Development in the South (COMSATS) signed two separate cooperative agreements with the Directorate General of Science and Technology, Government of Khyber Pakhtunkhwa (DGST-KP) and Rawal Institute of Health Sciences (RIHS) on Wednesday to forge cooperation in areas of emerging technologies for tech-based solutions to developmental challenges.\nThe agreement between COMSATS and DGST-KP was inked by Ambassador Dr M. Nafees Zakaria, Executive Director of COMSATS, and Dr Sajid Hussain Shah, Director General of DGST-KP on behalf of their respective institutions.\nThe areas of cooperation, inter-alia, include information technology (IT) and digitalisation, climate change and environment, human resource development, skills development, electric vehicles, renewable energy, natural resources exploitation (gemstones and mines), micro hydro plants, and biomedicine.\nThe signing ceremony was witnessed by KP Minister for Science and Technology and Information Technology Dr Najeebullah Marwat, and ambassadors and diplomats of Azerbaijan, Ethiopia, Jordan, Kazakhstan, Morocco, Nigeria, Syria, Yemen, as well as heads and senior officials of government departments.\nThe agreement with RIHS was signed by Co-Chairperson Board of Directors, Mrs. Saleha Khaqan, on behalf of the Institute that formalized relations for cooperation in the field of health and education.\nCOMSATS and RIHS plan to cooperate in the areas related to health sector, inter-alia, including AI-based solutions, people’s health and environment, internationalization of medical education and facilities, human resource development, electric vehicles for persons with physical disabilities.\nDr Najeebullah Marwat announced that the KP government was creating a 100 million dollar venture fund to facilitate realignment of ‘research and development’ with the contemporary needs of the province and the country.\nHe said a research agenda for academia in the province was being launched soon that would allow for standardizing and establishing centralized and regional labs on the model of Innovate UK.\nThe Executive Director of COMSATS, in his remarks, said the institution had recently signed agreements with a number of government departments and private companies that were primarily focused on facilitating research and development, and technology transfer.\nThe RIHS co-chairperson said he looked forward to collaborating with COMSATS for strengthening of health sector in the country.",
  "retrievedAt": "2025-08-11T10:38:13.180Z"
}
