{
  "title": "Solangi, Kazakhstan envoy discuss strengthening of bilateral relations in diverse sectors",
  "link": "https://www.app.com.pk/national/solangi-kazakhstan-envoy-discuss-strengthening-of-bilateral-relations-in-diverse-sectors/",
  "date_published": "2023-11-22T09:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Wednesday said that Pakistan valued its relations with Kazakhstan and was working on strengthening them in diverse fields.\nDuring a meeting with Ambassador of Kazakhstan to Pakistan, Yerzhan Kistafin important issues including bilateral relations, strengthening cooperation in the media sector, promoting public relations and regional situation were\nMurtaza Solangi and the ambassador agreed to establish offices of state media organizations of both countries in Pakistan and Kazakhstan.\n“There is a need to promote public relations and exchange of cultural delegations between the two countries,” he said and stressed for further promoting the cooperation between state media institutions of two countries.\nHe said that the PTV and Radio Pakistan were the main source of access to information on both sides.\nThe issue of signing an memorandum of understanding between the Ministry of Information and Broadcasting of Pakistan and the Ministry of Information and Social Development of Kazakhstan was also discussed in the meeting.\nIn this regard, it was also agreed to hold a Zoom meeting between the Information Ministers of Pakistan and Kazakhstan.\nA memorandum of understanding for media cooperation was signed between Associated Press of Pakistan and Kazakh Information Agency in 2018, Murtaza Solangi said. A team from Lahore was leaving for Kazakhstan for film shooting, which was an important step towards promoting cultural relations between the two countries, he said.\nPakistan, he added, was a key member of Shanghai Cooperation Organization and Economic Cooperation Organization and next meeting of the SCO was being held in Kazakhstan.\nTerming SCO a dynamic platform for building relations with regional countries, Murtaza Solangi said Pakistan maintained deep, historical and cultural ties with members of the SCO as “Our interests and objectives are broadly intertwined”.\nThe Ambassador of Kazakhstan invited the minister to visit Kazakhstan to sign the Memorandum of  Cooperation between the Ministry of Information and Broadcasting of Pakistan and the Ministry of Information and Social Development of Kazakhstan. He said that the President of Kazakhstan profoundly loved Pakistan and the people of Pakistan.\nThe Ambassador said the President of Kazakhstan will visit Pakistan next year.\nThis visit of the President of Kazakhstan will be a milestone in terms of trade, which will further promote bilateral trade relations, the ambassador said. “We want to further strengthen the cooperation between the state media of the two countries”, he added.\nHe said Pakistan was an important country for access to warm waters in the Middle East.\nHe pointed out that Sialkot was a leading centre for manufacturing football and surgical instruments.\nMurtaza Solangi also highlighted the importance of promoting close economic ties, including increasing bilateral trade and investment opportunities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:38:08.409Z"
}
