{
  "title": "AIOU holds seminar on World Cities Day",
  "link": "https://www.app.com.pk/national/aiou-holds-seminar-on-world-cities-day/",
  "date_published": "2023-11-22T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): A one-day seminar titled “Financing Sustainable Urban Future for All” was held at Allama Iqbal Open University(AIOU) on World Cities Day 2023.\nExecutive Director of United Nations Habitat, Memona Sharif, was the keynote speaker.\nShe emphasized the crucial role of urban areas in accomplishing the United Nations’ Sustainable Development Goals.\nShe further explained that ensuring safe and stable cities is an integral part of achieving sustainable development goals.\nJaved Ali Khan, Country Program Manager of UN-Habitat Pakistan, congratulated Prof. Dr Nasir Mahmood, the Vice Chancellor of AIOU on the university’s 50th anniversary.\nHe praised the university’s educational services, stating that they are truly commendable.\nJaved Ali Khan and a consultant from the World Bank, Gul Najam Jami, delivered presentations that highlighted the facilities, opportunities, and problems faced in the urban areas.\nThey also shared valuable information about the services and financial assistance provided by the United Nations and the World Bank about urbanization.\nThe seminar was presided over by the Dean of the Faculty of Sciences, Prof Dr. Irshad Ahmed Arshad.\nHe explained that this seminar is a part of the series of events organized in connection with the Golden Jubilee celebrations of AIOU, and it aims to provide intellectual training and mental upbringing to the new generation.\nChairperson of the Department of Nutritional Sciences and Environmental Design, Prof. Dr. Hajra Ahmed, and Additional Director of the Office of Research Innovation and Commercialization (ORIC), Dr. Saima Nasir, also spoke at the event.\nThey discussed the objectives of the seminar and expressed their gratitude to the Vice Chancellor, Prof. Dr. Nasir Mahmood, for his support in organizing the event.",
  "retrievedAt": "2025-08-11T10:37:48.144Z"
}
