{
  "title": "Awarness for limited use of digital devices, timely detection keys to control rising number of eye cancer in Kids: Experts",
  "link": "https://www.app.com.pk/national/awarness-for-limited-use-of-digital-devises-timely-detection-keys-to-control-rising-number-of-eye-cancer-in-kids-experts/",
  "date_published": "2023-11-22T11:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): Health expert on Wednesday advised timely detection and media awarness drives for youngsters to limit digital devices use where parents should play their role to encourage kids for various indoor activities which can control rising number of eye cancer cases of kids in country.\nPediatric Oncologist Dr Tanzeela Farah while talking to PTV news channel, explained that retinoblastoma was the most common and life-threatening eye cancer which commonly affected young children, adding, awareness about retinoblastoma is low and early detection is crucial to give the best chance of saving the child’s life, eye, and vision.\nRetinoblastoma is cancer of the retina. The retina is the light-sensitive lining at the back of the eye, she further described the symptoms of disease.\nWhile expressing her serious concern, she mentioned that Pakistan was seeing an alarming rise in pediatric eye cancer cases when compared to other nations of the region where we need to play a collective responsibility to aware public.\nEarly detection and proper treatment will ensure 90 percent of the children diagnosed with RB are saved from death, she added.\nTo a query, she replied that with the use of digital devices’ trend among kids which was increasing day by day where parents need to restrict their young ones from not to expose to digital devices excessively.\nLimiting exposure to devices and encourage engagement in various indoor activities such as talking, reading etc can prevent your child from several eye problems, she added.\nChildren concentrate on digital devices for a prolonged time without blinking their eyes is dangerous not just for eyes but also for their mental health, she mentioned.\nShe said that treatment of eye cancer was a lengthy and very costly process, adding, eye cancer is mostly linked with genetic factors where cousin marriages should also be discouraged.\nThe majority of cancer cases occur in remote areas, where people lack financial resources and lack of awarness about cousin marriages, the\nexpert revealed.\nMost cases of retinoblastoma (nine out 10) are detected early and successfully treated before the cancer spreads outside the eyeball, she said, adding that if the cancer had spread beyond the eye, it would be more difficult to treat. This is rare as the condition is usually identified well before it reaches this stage. Nowadays, it is very necessary to manage the digital device timings in children to prevent them from many adverse effects on health, she concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:37:44.310Z"
}
