{
  "title": "Minister Culture Jamal Shah inaugurates mobile app, web portal of archaeological sites mapping project",
  "link": "https://www.app.com.pk/national/minister-culture-jamal-shah-inaugurates-mobile-app-web-portal-of-archaeological-sites-mapping-project/",
  "date_published": "2023-11-22T08:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 22 (APP): Interim Federal Minister for National Heritage and Culture, Jamal Shah, inaugurated the mobile app and web portal for the archaeological site mapping project in the Department of Archaeology and Museums (DOAM) on Wednesday.\nThe Federal Secretary, National Heritage and Culture Division, Humaira Ahmed; Adviser, National Heritage and Culture Division, Muhammad Kashif Irshad; and Director General, DOAM, Dr Azeem Khan, were also present on the occasion.\nPakistan’s cultural heritage is now accessible to the world, with 8,000 archaeological and religious sites now at your fingertips.\nA Gateway to Pakistan’s past new mobile app launched that will promote cultural exchange and boost tourism in the country\nAddressing the inauguration ceremony, the Minister said, “Under this project, over 8,000 archaeological and religious sites have been mapped, and all data is accessible through the website of the Department of Archaeology and Museums.”\nHe said, “Around 500 cultural and religious sites of tourism potential have been selected from all over Pakistan, adding that after physical examination of these sites, recommendations have been made to the concerned provincial authorities for their preservation and development as tourism destinations.”\nHe said, “The mobile app developed under this project is more than just a technological achievement. It is a gateway to our past, a treasure trove of knowledge, and a bridge that connects the present generation with the legacies of our ancestors.”\n“Through this app, users will have the power to explore the historical and religious sites of Pakistan with ease, learn about their significance, and plan their visits,” he added.\nJamal Shah said, “This mobile app will not only benefit researchers, historians, and archaeologists but also serve as an invaluable resource for tourists eager to explore the cultural diversity and historical richness of Pakistan.”\n“It will promote cultural exchange, boost tourism, and contribute to the socio-economic development of our nation,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:38:11.628Z"
}
