{
  "title": "Kashmir’s EU Week to begin in Brussels next month",
  "link": "https://www.app.com.pk/national/kashmirs-eu-week-to-begin-in-brussels-next-month/",
  "date_published": "2023-11-22T05:04:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Nov 22 (APP): Kashmir’s EU (European Union) Week is all set to begin in Brussels, the European headquarters early next month under the auspices of Kashmir Council Europe (KC-EU).\n“The scheduled Kashmir’s EU Week will commence from December 05-15 in the European Headquarters Brussels”, disclosed Chairman of KC-EU Ali Raza Syed while talking to APP over telephone from Brussels on Wednesday.\nThe events include seminars, conferences, a media conference, debates and a photo exhibition at European Press Club Brussels and the European parliament.\nThere would also be several meetings with the European officials, members of European parliament and representatives of civil society and human rights organizations during the Kashmir EU Week starting on December 5 (Tuesday).\nChairman Kashmir Council Europe Ali Raza Syed said, “The week long programs of Kashmir’s EU week are being organized by Kashmir Council EU for many years and purpose of such programs is to highlight Kashmir issue including miseries of oppressed Kashmiris and beauty of the Kashmir’s culture in Europe.”\nHe said, as currently people in all over the world stood against the state terrorism and atrocities on the common citizens, we hope world would also pay attention to prevent Indian brutalities on the Kashmiris.\nHe asked the international community especially European Union to put pressure on India to immediately end crimes of Indian security forces against people of India Illegally Occupied Jammu & Kashmir (IIOJ&K) and grant them right to self determination according the UN’s resolutions on Kashmir.\nHe said, “Since 1947, people of IIOJ&K are facing endless hardships as their miseries are being increased day by day.”\n“It is duty of international community including Europe Union to take immediate action in order to prevent the atrocities against the people of IIOJ&K.”\n“So that situation of the disputed land shall be normalized and people of IIOJ&K should be provided a peaceful atmosphere where they can use their right to self determination in accordance with their wishes and according to United Nations resolutions,” he added.",
  "retrievedAt": "2025-08-11T10:37:54.705Z"
}
