{
  "title": "Human, natural resources equally essential for socio-economic prosperity: President",
  "link": "https://www.app.com.pk/national/human-natural-resources-equally-essential-for-socio-economic-prosperity-president/",
  "date_published": "2023-01-30T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP): President Dr Arif Alvi on Monday said that both human as well natural resources were essential for the socio-economically prosperity of a country.\nThe president, addressing a ceremony, “GB Dream Road Show”, organized by Gilgit-Baltistan (GB) government, said that intellect, consistency in policies, avoiding confusion, and actively cooperating with each other would enable the country to tread the path of development.\nThe ceremony was attended by Governor of Gilgit-Baltistan Syed Mehdi Shah, GB Chief Minister Khalid Khurshid Khan, the GB ministers and others.\nThe president said that he always represented the Gilgit-Baltistan region as its ambassador for promoting its tourist attractions.\nThe tourists should be facilitated in the area and the biggest charm of tourism for a tourist was easy and shortest possible access to the destination, he added.\nPresident Alvi said that GB was rich in natural resources like minerals, gems, and fruits. He said using scientific methods for cutting and finishing gems and skills required for such work could be learned in a very short period of time.\nHighlighting the importance of IT skills for GB youth, the president said that people with IT skills could earn their livelihood by offering their services in other countries while living in Pakistan through online platforms.\nHe said that IT sector could also provide employment opportunities for women allowing them to work from their homes. 2.4 million people from different academic backgrounds had benefitted from the Prime Minister’s Digital Skills program, Digiskills, adding that such programs could be replicated to provide critical and marketable digital skills to the youth and women of the country.\nHe said that a GB student who got his training from Digiskills program was earning almost $100,000.\nPresident Alvi said that there were enormous opportunities for GB in the field of agriculture as well by using vertical farming and drip farming.\nHe said that GB could not only fulfill its own food requirements but it had the potential to export to the world like Netherlands which was 19 times smaller than Pakistan but the second-largest food producer in the world.\nPresident Alvi said that there was an abundance of ideas but it was high time now to translate these ideas into practical steps and execute them.\nHe said that indeed development was not possible without community participation and GB’s people should be fully and actively engaged in promoting development in the area.\nChief Minister of Gilgit-Baltistan Khalid Khurshid Khan said that the GB had been neglected in the past in terms of resource allocation and the funds which used to be given were mostly consumed in salary-related expenses.\nHe said that the GB government had been allocating more funds for development for the last two years.\nHe said that his government’s focus was on the development side, especially improving the road connectivity of GB with the rest of the country through different routes, revamping the education sector, boosting the agriculture sector to overcome food shortages, improving the health sector, and bringing reforms in the local government system.\nThe seasoned civil servant Shoaib Sultan also narrated his journey with the Agha Khan Rural Support Program for GB. He said that he worked for 40 years for the rural support program and it was the support of people and community which made it successful.\nEarlier, the President also visited the various stalls at the show.",
  "retrievedAt": "2025-08-11T05:51:53.566Z"
}
