{
  "title": "Marriyum Aurangzeb announces schedule of nationwide party organizational tours of Maryam Nawaz",
  "link": "https://www.app.com.pk/national/marriyum-aurangzeb-announces-schedule-of-nationwide-party-organizational-tours-of-maryam-nawaz/",
  "date_published": "2023-01-30T07:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Monday released the schedule of nationwide organizational tours of Pakistan Muslim League-Nawaz Senior Vice President and Chief Organizer Maryam Nawaz.\nIn a statement, the minister said that Maryam Nawaz will start her whirlwind organizational tours from February 1.\nMaryam Nawaz will address the workers’ convention in Bahawalpur on February 1, she said adding the organizational meeting of the party will be held on February 2 in Bahawalpur.\nOn February 5 the PML-N convention will be held in Multan whereas the organizational meeting of the party will be held on February 6.\nMarriyum Aurangzeb said that on February 9, Maryam Nawaz will address the party convention in Abbottabad. She said that the party’s organizational meeting will be held in Abbottabad on February 10.\nOn February 15, Maryam Nawaz will address a convention and rally in Dera Ghazi Khan, she said adding on February 16, she will preside over the organizational meeting of the party in the same city.\nMarriyum Aurangzeb said that the PML-N workers convention will be held in Rawalpindi on February 19 whereas the party organizational meeting will be held on February 20.\nOn February 23, Maryam Nawaz Sharif will address the workers’ convention in Sargodha and preside over the party organizational meeting on February 24.\nShe said that in Sahiwal workers convention will be held on February 27, and the party’s organizational meeting will be held on February 28.\nThe minister said that in Gujranwala, workers convention will be held on March 3 and party organizational meeting on March 4.\nIn Sheikhupura workers convention will be held on March 7, and party organizational meeting on March 8, she sais.\nThe minister said that in Faislabad workers convention will be held on March 11 and the organizational meeting of the party will be organised on March 12.\nIn Peshawar, there will be a workers convention on March 15 and an organizational meeting on March 16, she said.\nShe said that in Lahore Division workers convention will be held on March 19 and an organizational meeting on March 20.\nMaryam Nawaz will go to Quetta on March 23 and address the workers’ convention, she said and added that organizational meeting of PML-N will be held in Quetta on March 24.\nShe said that PML-N workers convention in Karachi will be held on March 27 and organizational meeting on March 28.",
  "retrievedAt": "2025-08-11T05:52:15.045Z"
}
