{
  "title": "Imran’s decision to contest 33 NA by-polls a ‘mockery of Constitution, democracy’: Irfan Siddiqui",
  "link": "https://www.app.com.pk/national/imrans-decision-to-contest-33-na-by-polls-a-mockery-of-constitution-democracy-irfan-siddiqui/",
  "date_published": "2023-01-30T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 30 (APP): Pakistan Muslim League-Nawaz’s Senator Irfan Siddiqui Monday said Pakistan Tehreek-e-Insaf Chairman Imran Khan’s announcement of contesting by-polls from 33 constituencies was tantamount to a mockery of the Constitution, law, and democracy.\nThe PML-N leader, in a statement, said there was no precedent of such “jokes” in any other democratic country. The poor nation’s money should not be allowed to be squandered on that count, particularly during an economic crisis.\nImran Khan, he said, had won six out of seven National Assembly constituencies in October 2022 by-elections, and he had neither taken the oath nor resigned from any of the seats. Consequently, by-elections on those six seats would also be held.\nThe PTI chief, he added, again announced to contest from all the 33 NA seats in the March by-election. If he won all the seats, then there would be re-election on 32 and he would once again be a candidate for all those seats.\nIrfan Siddiqui cited that in India no candidate could contest elections on more than two seats at a time. A proposal was nowadays under consideration that the entire expenditure (from the public exchequer) incurred on the election/by-election on the vacated seats should be charged from the candidates concerned, and he had also written a letter to Prime Minister Shehbaz Sharif in that regard.\nHe said the Election Commission of Pakistan spent some Rs 30 to 40 million on a by-election in one constituency.\n“If re-elections were to be held on 32 seats, it will cost about Rs 1 billion, which should be recovered from the candidate vacating the seats,” he added.\nIrfan Siddiqui said like the Election Commission of India, the ECP should also pay attention to the serious issue and take up the matter with the quarters concerned.\nHe said the judicial process was not a “joke”. If no remedial measures were taken, the mockery of the constitution and law would continue. The recovery of expenditure to be incurred on the by-polls on the vacated seats from the candidates concerned was the only way to stop the waste of the taxpayers money, he added.",
  "retrievedAt": "2025-08-11T05:52:07.248Z"
}
