{
  "title": "Prize distribution ceremony of Chughtai Arts Awards 2022 held in Adana",
  "link": "https://www.app.com.pk/national/prize-distribution-ceremony-of-chughtai-arts-awards-2022-held-in-adana/",
  "date_published": "2023-01-30T14:23:00.000Z",
  "source": "APP",
  "content": "ANKARA, Jan 30 (APP): Prize distribution ceremony of Chughtai Art Awards 2022 was held in Adana on Monday.Ambassador of Pakistan to Turkiye Dr. Yousaf Junaid and Governor Adana Dr. Suleyman Elban graced the occasion as chief guests. The event was attended by Pakistan Honorary Investment Advisor in Adana Erkan Aslan, officials from Pakistan embassy and Provincial Directorate of National Education, Adana, students , their parents and teachers.\nNamed after renowned Pakistani artist Abdul Rahman Chughtai, Pakistan embassy has been organizing Chughtai Art Awards Competition among high school students in Turkiye since 2011. In 2022, the competition was held in Adana under the theme ’75 years of Pakistan Turkiye Diplomatic Relations’, as both countries celebrated 75 years of diplomatic ties on November 30, 2022. Previously, the competition was successfully organized in the provinces of Ankara, Konya, Bursa and Biltis.\nSpeaking on the occasion, ambassador of Pakistan to Turkiye Dr.Yousaf Junaid stated that Pakistan Turkiye’s special relationship was embedded in common cultural, religious and spiritual heritage, transcending boundaries of time, geography and politics. There are countless accounts, when the two countries have stood for each other. Whether it was Pakistan’s political, diplomatic and moral support for Turkish Cypriots or Turkiye raising its voice at the global fora in support of Kashmiris, the list is long and reflective of our brotherhood.\nWhile admiring the creativity, talent and hard work of participating students, ambassador Junaid said that he was glad to see the impressive depiction of Pakistan Turkiye brotherhood by the students in their paintings. ’I am very delighted to see that our younger generation values this exemplary friendship, as they should. The paintings displayed here, say it all’, he added.\nThe painting by Heja Inci of Ismail Safa Ozler Anadolu Lisesi won the first prize. Yil Anadolu Lisesi stood second and Cagla Zengin of Karsiyaka Orhan Çobanoglu Mesleki ve Teknik Anadolu Lisesi grabbed the third position. Busra Haktan Acis, Zerda Pehlivan and Ayda Ozturk won ‘Emerging Artist’ positions.",
  "retrievedAt": "2025-08-11T05:51:52.469Z"
}
