{
  "title": "Old faces win most of Bahawalpur seats",
  "link": "https://www.app.com.pk/national/old-faces-win-most-of-bahawalpur-seats/",
  "date_published": "2024-02-09T19:38:00.000Z",
  "source": "APP",
  "content": "BAHAWALPUR, Feb 09 (APP): The old faces have won most of the National Assembly and Punjab Assembly seats in Bahawalpur Division.\nFormer federal minister and Pakistan Muslim League-Q General Secretary Chaudhary Tariq Basheer Cheema, who had won elections from NA-165 Bahawalpur many times, has once again returned won from the constituency by securing 116,554 votes.\nHis political rival Chaudhary Saud Majeed, who fought the election as an independent candidate, secured 105,313 votes, while another independent candidate Basharat Ali managed 50,339 votes.\nThere were 15 candidates in the filed, five of them contested on the tickets of their political parties.\nChaudhary Saud Majeed is also an old political leader, who had contested several elections from this constituency.\nPrince Bahawal Abbas Abbasi, a scion of the royal Abbasi family of former princely state of Bahawalpur, was defeated by old politician Makhdoom Syed Sami Ul Hassan Gilani in NA-166.\nGilani, who contested the election on the ticket of Pakistan Muslim League-N, secured 62,148 votes, while Prince Abbasi manged to get 48,599 votes and Makhdoom Syed Ali Hassan Gilani of the Pakistan Peoples Party Parliamentarians, got 48,375 votes.\nIn NA-167 Bahwalpur, PML-N’s Muhammad Usman Awaisi won the election by securing 88,503 votes. His father Najeeb Awaisi had also been elected from the constituency for several times.\nHis rival candidate Malik Aamir Yar Waran, who is also an ex-parliamentarian, managed to secure 63,670 votes.\nLikewise, several other old politicians, some of them also remained members of Punjab Assembly in previous regimes from Bahawalpur, again tried their luck.\nKhalid Mahmood Jajja, who contested the election as a PML-N candidate, again won from PP-247 by securing 61,116 votes.\nSimilarly, Sahibzada Gazzen Abbasi, who had contested several elections, was elected from PP-249 by getting 42,484 votes.\nAnother old politician, Muhammad Shoaib Awaisi, got victory from PP-252 by securing 41,290 votes. He contested the election on the PML-N ticket.\nEx-parliamentarian Zaheer Iqbal Channar, who is the son of former minister Malik Iqbal Channar, was once again elected from PP-253 on the PML-N ticket by securing 45,607 votes.",
  "retrievedAt": "2025-08-11T00:32:18.956Z"
}
