{
  "title": "Shahid Afridi praises NHMP for initiating campaign “No More” violations",
  "link": "https://www.app.com.pk/national/shahid-afridi-praises-nhmp-for-initiating-campaign-no-more-violations/",
  "date_published": "2022-06-30T09:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 30 (APP): National Highways and Motorway Police (NH&MP), under its massive campaign to educate vehiculars about traffic rules, has started disseminating video messages of national stars amid slogan of ‘No More Violations.’\nFormer Pakistan star-all-rounder Shahid Khan Afridi and former captain of National Women Cricket team, Sana Mir have praised the NHMP for initiating this exclusive campaign.\nIn a video message, Shahid Khan Afridi said for safety, all road users, should avoid over-speeding and maintain lane discipline.\n“This is our collective responsibility to obey traffic laws and make our and other people’s travelling safe and sound,” he said in a message.\nSimilarly, in her video message, Sana Mir lauded the NH&MP for the said initiative, saying that people should follow instructions of NH&MP to make sure safety of everyone, including their own families.\nActor Usman Pirzada also spoke high about the particular campaign, hoping awareness about hazards of over-speeding on highways and motorways would largely benefit the road users.\nIt may be mentioned here that on direction of Inspector General Khalid Mahmood, NH&MP has recently launched a new campaign called ‘No More Violations to aware public about new initiatives and tools being deployed to ensure commuter safety and enforcement of law.\nA pilot project using technological innovations and an enforcement regime with zero tolerance has been launched on select motorways.\nThese initiatives aim to plug the technological gap in the existing and desired infrastructure.\nOver speeding motorists will face heavy fines and patrol cars had been instructed to chase and apprehend violators, if required.\nViolators will be identified by using intelligently deployed spotters, next-generation speed cameras, and drone cameras.\nAll Motorway Police field officers are also equipped with body-worn cameras that transmit live footage to a state-of-the-art command center, ensuring transparency and confidence.",
  "retrievedAt": "2025-08-11T15:10:44.835Z"
}
