{
  "title": "PM welcomes China-based NORINCO’s interest to invest in Pakistan’s renewable energy sector",
  "link": "https://www.app.com.pk/national/pm-welcomes-china-based-norincos-interest-to-invest-in-pakistans-renewable-energy-sector/",
  "date_published": "2022-06-30T08:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 30 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday welcomed the Chinese company NORINCO for showing interest to invest in Pakistan’s huge potential for renewable energy.\nHe expressed these views while talking to a high-powered delegation of Chinese state-owned Company NORINCO (China North Industries Corporation) led by its vice-president Wang Xiaobing and CEO (Pakistan) Li Chen.\nThe NORINCO delegation showed keen interest in investing in the wide spectrum of renewable energy projects in Pakistan, especially in the wind corridor in Thatha whereby a 100 MW wind power project was proposed.\nThe company also highlighted the potential venues for investment in fiber optic along the railway lines, copper and iron ore mining at proven reserves, and infrastructure development in big cities.\nThe prime minister said deepening economic cooperation with China was critical to Pakistan’s socio-economic uplift.\nHe highlighted the significance of China Pakistan Economic Corridor (CPEC) as a transformational project for the mutual benefit and development of both the friendly countries.\nThe Prime Minister also appreciated the company for its role in the Lahore Orange Line Metro Train project, which, he said, is facilitating hundreds of thousands of commuters in Lahore on a daily basis.\nHe recalled that it was for the first time that open bidding took place in a government-to-government project i.e. Lahore Orange Line.\nHe stated that further negotiations were held with the lowest bidder, leading to a saving of USD 600 million, adding that it was certainly a milestone in the development history of Pakistan.\nThe prime minister stated that Pakistan was open to investment and that his government was taking steps to remove all impediments for further facilitation of the investors.\nHe also thanked Chinese President Xi Jinping and H.E. Premier Li Keqiang for their consistent and unwavering support to Pakistan, particularly in current economic situation in Pakistan.\nThe delegation praised Prime Minister Shehbaz Sharif for his untiring efforts to steer Pakistan out of the current economic crisis.\nIt noted that PM Shehbaz Sharif was a great friend of China whose business-friendly policies have deepened economic cooperation and facilitated foreign direct investment in the country.\nFederal Ministers Khawaja Saad Rafique, Syed Naveed Qamar, Chauhdary Salik Hussain, Advisor to PM Ahad Cheema, SAPMs Syed Tariq Fatemi, Mohammad Jahanzeb Khan, Zafar-Ud-Din Mahmood and officials from concerned ministries were also present in the meeting.",
  "retrievedAt": "2025-08-11T15:10:45.844Z"
}
