{
  "title": "Sanjrani for regional collaboration by trade, energy, agriculture cooperation",
  "link": "https://www.app.com.pk/national/sanjrani-for-regional-collaboration-by-trade-energy-agriculture-cooperation/",
  "date_published": "2022-06-30T14:20:00.000Z",
  "source": "APP",
  "content": "Leading a parliamentary delegation to Azerbaijan, he participated in the Conference of Non-Aligned Movement Parliamentary Network and spent a busy day while interacting with Azerbaijani President Ilham Aliyev, and Speaker of the Milli Mejlis Sahiba Gafarova and dignitaries from different Parliaments, said a press release issued here.\nISLAMABAD, Jun 30 (APP): Senate Chairman Muhammad Sadiq Sanjrani Thursday called for regional collaboration to expedite the process of regional growth and prosperity through cooperation in trade, energy, agriculture besides other diverse sectors.\nHe said Pakistan and Azerbaijan enjoyed close brotherly relations based on shared religious and cultural bonds.\n“Our continued high-level bilateral exchanges are proof of a strong and cordial partnership,” he observed.\nHe hoped to continue to uphold these cordial relations to effectively align all our common interests and shared prosperity.\nSharing his thoughts with the Azerbaijani president, the Senate chairman said Pakistan highly valued its bilateral relations with Azerbaijan and these relations were based mutual trust, respect and love.\nHe called for expending these ties through enhanced interactions at government and business levels.\nHe said there was huge scope for investment in Pakistan and investors from Azerbaijan could explore opportunities through mutual collaboration with Pakistani counterparts.\nHe also highlighted the importance of Gwadar port and said the new emerging port would provide Central Asia a short route to connect with other continents for business and trade.\nPakistan would welcome Azerbaijani investors to invest in different projects for mutual benefits of the two sides, he added.\nDuring his meetings with president and speaker separately, the Senate chairman congratulated Azerbaijan for the successful hosting of the conference of the NAM Parliamentary Network and acknowledged the leading role played by Azerbaijan in making this network promising and effective.\nHe expressed the confidence for tangible outcomes from the deliberations.\n“This NAM conference also aligns with 30 years of independence for Azerbaijan, and also 30 years of bilateral relations with Pakistan. On behalf of the parliament and the people of Pakistan, I extend to you our warmest sentiments of goodwill on this milestone” Sanjrani observed.\nAddressing the reception hosted in honor of the delegates, he said Pakistan also wished to enhance ties between the two countries on all political and economic fronts.\nHe also acknowledged Azerbaijan’s support to Pakistan on critical geopolitical issues, and Pakistan is honoured to reciprocate its full support to Azerbaijan across own challenges.\nHe said Pakistan and Azerbaijan have great expertise to share and trade in the fields of energy, defense, agriculture, natural resources, transport, and health.\nHe termed the much-needed resumption of direct flights between the two countries as fruitful and said the step would help enhance people to people and business to business connections.\nThe Senate chairman said Pakistani delegation was amazed by the hospitality of Azerbaijani government.\nBoth the president and speaker of Azerbaijan thanked the Senate Chairman and delegation for participating in such an important conference.\nThey were of the view that active participation of Pakistani delegation in the conference showed that Pakistan was keen to promote regional growth, peace and prosperity. They also called for enhanced cooperation at all levels.",
  "retrievedAt": "2025-08-11T15:10:36.414Z"
}
