{
  "title": "Pakistan committed to promotion of peace, stability in S. Asia",
  "link": "https://www.app.com.pk/national/pakistan-committed-to-promotion-of-peace-stability-in-s-asia/",
  "date_published": "2022-05-28T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP): Spokesperson Ministry of Foreign Affairs Saturday said that Pakistan was committed to promotion of environment of peace and stability in South Asia while preserving its capability to ward off aggression or adventurism in any form.\n“It is a partner in international efforts to strengthen the global non-proliferation regime based on the principles of non-discrimination and equal security for all states. It adheres to the latest international standards on export controls and maintains the highest standards of nuclear safety and security,” the spokesperson said in a press release as the nation is observing 24th anniversary of Pakistan’s nuclear tests conducted in 1998 in response to testing of nuclear weapons by India.\nThe tests not only demonstrated the resolve of the Pakistani nation to safeguard Pakistan’s territorial integrity, independence and sovereignty, but also the desire to preserve strategic balance in South Asia.\nThe spokesperson further said that threats to strategic stability in South Asia underscored the importance of Pakistan’s proposal for Strategic Restraint Regime (SRR) which provides for measures for: (i) resolution of outstanding issues, including the core issue of Jammu and Kashmir; (ii) nuclear and missile restraints; and (iii) conventional balance.\n“In paying tribute to its scientists, engineers and technicians in ensuring Pakistan’s security, the nation also deeply appreciates the contributions of Pakistan’s nuclear programme to the country’s socio-economic development,” it was added.\nPakistan is employing nuclear technology in pursuit of Sustainable Development Goals (SDGs), ranging from energy, water and food security, education, health, agriculture and industry.\nNuclear power generation as a source of reliable, clean and affordable alternative to fossil fuels constitutes an important element of Pakistan’s energy security plans.\nThis year, operationalization of second 1100 MWe K-3 Nuclear Power Plant in Karachi marks another milestone, which signifies the role of nuclear science and technology for the socio-economic development and welfare of the people of Pakistan.\nIn the health domain, twenty cancer hospitals being operated across the country by Pakistan Atomic Energy Commission (PAEC) bear the bulk of cancer burden in Pakistan. In the field of agriculture, the contributions of nuclear research centers in Pakistan to the development of high-yield climate change-resistant varieties of crops has been recognized internationally.\nThe Pakistan Center of Excellence in Nuclear Security (PCENS) is an IAEA-recognized Center of Excellence imparting international trainings in nuclear security. Pakistan also offers fellowships under the IAEA Marie Curie Fellowship programme and has seconded experts to the IAEA in various fields.\n“Pakistan looks forward to further expanding its international collaborations in the peaceful uses of nuclear technology and sharing its expertise with other countries including in nuclear regulatory matters,” the spokesperson said.",
  "retrievedAt": "2025-08-11T14:59:07.170Z"
}
