{
  "title": "Over 500,000 illicit cigarettes, 600 hookah destroyed",
  "link": "https://www.app.com.pk/national/over-500000-illicit-cigarettes-600-hookah-destroyed/",
  "date_published": "2022-05-28T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP):Islamabad Excise and Taxation department on Saturday destroyed over 5,00,000 illicit cigarettes and 600 hookah, sheesha during a ceremony held here in connection with World No Tobacco Day.\nDeputy Commissioner Islamabad Irfan Nawaz Memon, Director Excise and Taxation Bilal Ahmed, Additional Deputy Commissioner (East) Shehryar Arif and officers of Islamabad Capital Territory administration and Ministry of National Health Services Regulation were present during the ceremony.\nTalking to media, the DC Islamabad vowed to make the federal capital a smoke-free city. He said some 537 public places including hotels highrise buildings and parks in Islamabad had been declared a smoke-free zone.\nHe said to implement the Tobacco Vendor Act in letter and spirit, a vigorous campaign is underway which bound the retailers to get license and follow a number of conditions, including not selling tobacco products to teenagers or near educational institutions. The civil administration, he said is ensuring the ban on sale of cigarettes within 500 meter periphery from schools.\nSimilarly, accords were signed with 12 universities operating in the federal capital to reduce smoking among students, said DC.\nMemon said around 7.4 million fines were imposed over different violations under the Tobacco Vendors Act during the last four years.\nHe lauded the efforts of Director Excise for taking inclusive measures to control illegal sale of cigarettes, besides sensitizing the masses on harmful effects of tobacco consumption.Bilal Azam said over 987 licenses were issued to retailers to control, regulate and discourage the sale of illicit tobacco.\nApart from this, he said the excise teams were conducting regular raids at markets, shops and other places to confiscate sheesha products, hookah and other banned items.\nHe noted that the World Health Organization had also recognized anti-tobacco steps taken by Islamabad administration.\nThe online registration of tobacco vendors was also started in the capital to curb the practice of tobacco selling to the youth below the age of 18 years.\n“We want to save our youth from tobacco and the registration will help us monitor the practice of selling the same to the youth,” he observed.Later, certificates of appreciation were also given to the excise inspectors.",
  "retrievedAt": "2025-08-11T14:59:04.339Z"
}
