{
  "title": "President for skillsets development of IT freelancers",
  "link": "https://www.app.com.pk/national/president-urges-for-skillsets-development-of-it-freelancers/",
  "date_published": "2022-05-28T08:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP): President Dr Arif Alvi Saturday said that the global information and technology business embodied huge opportunities for the country’s freelancers and stressed upon enhancement of their skillsets to capture the huge global market.\nIn a virtual address at the ‘Freelance Fest’, the president said that the new opportunities in the IT sector were more rewarding than the brick-and-mortar business setups.\nHe said there were reports about Pakistani freelancers grabbing the third global position and noted that there were about 3 million IT freelancers working in the country.\nThe president stressed that there should be a gradual increase in the number of IT freelancers each year by 100 percent as the global market was craving for the skilled people in this field.\nHe said Pakistan could progress in this sector and strengthen its revenues by luring foreign investment through freelancing in the IT sector.\nHe said the IT returns were immediate and underlined the need to mobilize the human resources.\nThe president said during the ‘California Gold Rush’, people used to head towards California, US to try their luck. He likened the existing opportunities in the IT sector to that of the ‘gold rush’.\n“It is like a gold rush for which they will have to improve skillsets of the people,” he said, adding that the latest gadgets and tools like smartphones should be utilized and stressed upon making access of such facilities to freelancers easy.\nLauding efforts of the ministry of information and technology, he said the government had not imposed any tax on such businesses so that the freelancers could bring the foreign investment and enhance their businesses and the national economy.\nHe also appreciated role of Pakistan Software Board and suggested that it could bring further innovative mechanisms to help people increase their freelancing outreach.\nThe president said the field could help create jobs opportunities for the youth and bolster the national economy.\nThe president said that though there were elements of uncertainty for the freelancing business, but it possessed the reliability to generate income. He said there were about 450 million freelancers across the world.\nHe said IT skills could be improved without the requirement of any sophisticated knowledge.\nThe president said the freelancing business also possessed huge opportunities for the womenfolk.",
  "retrievedAt": "2025-08-11T14:58:52.948Z"
}
