{
  "title": "Govt to announce wide-ranging reforms for relief of masses: AJK PM",
  "link": "https://www.app.com.pk/national/govt-to-announce-wide-ranging-reforms-for-relief-of-masses-ajk-pm/",
  "date_published": "2022-05-28T16:09:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK ) May 28 (APP): AJK’s Prime Minister Sardar Tanvir Ilyas Khan has said that wide-ranging reforms to be introduced soon to provide all possible facilities to the people of Azad Jammu & Kashmir.\nThe PM said this while addressing a public gathering in Poonch on Saturday.\nThe gathering was attended by the PTI workers, union councilors and a large number of people hailing from different walks of life.\nThe PM said that besides promoting tourism in the state the present government was keen to lift IT sector, improve the quality of education and promote small scale industries to create employment opportunities for the educated youth.\nAlong with promoting tourism. We will focus on small-scale industries to provide employment to women,” the PM said adding that the role and efficiency of Technical Educational and Vocational Training Authority (TEVTA) would be further enhanced.\nAbout the upgradation of schools, the PM said, “High schools having enough land for building required infrastructure will be given the status of a degree college”.\nThe PM said that modern information offices will be set up at all divisional headquarters. “Without Government approval no construction whatsoever will be allowed whether in rural or urban areas”, he added.\nThe curriculum for the madrassas (religious seminaries) will be prepared as per the recommendations of eminent scholars to make it in consonance with present-day demands.\nThe PM said that the agriculture is one of the important sectors that plays key role in boosting economy. He assured the people that his government will meet their expectations.\n“We will start a new era of construction and development in Azad Kashmir and make it a model state”, he said adding that serving masses with honesty was his government’s sole mission.\nTanveer Illyas said that work on the construction of road up to Darbar Pir Bhola Badshah and reconditioning of dilapidated roads will be started soon to improve travelling facility.\nHe said that road safety commission would be set up to minimize road accidents. The prime minister said that despite various challenges related department were playing an important role.\nAppreciating the party workers’ contribution, the PM said that no one would be allowed to hurt the self-esteem of the party workers. He asked the party activists to gear up for the upcoming local body elections so that the power could be transferred to gross roots level in larger interests of the people.\nMinister for Higher Education Zafar Iqbal Malik, Minister TEVTA, Elementary and Secondary Education Dewan Ali Chughtai, Minister for Food Chaudhry Ali Shan Soni, Sardar Ahmed Saghir and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T14:58:59.403Z"
}
