{
  "title": "Pakistan observes Youm-e-Takbeer with national spirit; says Amir Muqam",
  "link": "https://www.app.com.pk/national/pakistan-observes-youm-e-takbeer-with-national-spirit-says-amir-muqam/",
  "date_published": "2022-05-28T10:54:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, May 28 (APP): Adviser to the Prime Minister Engr. Amir Muqam has said that Youm-e-Takbeer was being observed with national zeal and fervor to commemorate the day of historic nuclear tests at Chagai in 1998.\nTalking to media persons here on Saturday, Engr. Amir Muqam said, the Ministry of Information and Broadcasting has also released a national song in connection with the ‘Youm-e-Takbeer’ to highlight its importance. He said that Prime Minister Muhammad Shehbaz Sharif had already announced ten-day celebrations on the completion of 24 years of nuclear explosions by the then Prime Minister Mian Muhammad Nawaz Sharif.\nEngr. Amir Muqam said 28th May is the day of pride for the nation as Pakistan officially became a nuclear power and achieved a unique position among Muslim Ummah and the world.\nThis day reminds us the services rendered by civilian and military leaders to make Pakistan a nuclear power, and this was the day when the then Prime Minister Nawaz Sharif led the nation and Pakistan to become the 7th Nuclear Power in the world, he added.\nEngr. Amir Muqam also congratulated the nation on Youm-e-Takbeer saying that Pakistan achieved the status of nuclear state by detonating six nuclear bombs in reply of India’s five explosions. “Pakistan has the honor of becoming the first nuclear state in the Islamic world,” Engr. Amir Muqam added.\n“This power made Pakistan’s defence invincible,” he said and applauded the hero of the nation late Dr Abdul Qadeer Khan who, with his unflinching resolve and commitment, made Pakistan a nuclear power. He said, this year the theme is “Na Jhuky Thay, Na Jhuken Gay”.\nThe explosions were carried out in Rasko hills of Chaghi district Balochistan and the reason was to give a response to a total of five nuclear explosions by India, said Adviser to the Prime Minister Engr. Amir Muqam.\nYoum-e-Takbeer, he said, is also known as the National Science Day and celebrated because Pakistan successfully demonstrated its scientific capability and brought balance of power to the region by effectively responding to the Indian nuclear explosions.\nDespite external pressure, Nawaz Sharif detonated nuclear bomb, Engineer Amir Muqam said, adding, Nawaz Sharif’s government endured tough decisions at that time.\nHe said Imran Khan is sitting in KP CM House and using government resources and tasked all the deputy commissioners to bring vehicles for his long march. Imran came to Islamabad for what purpose, Engineer Amir Muqam questioned.\nAnswering a question, he said that the previous government was responsible for the rise in prices of petroleum products and other food items due to lack of planning and misuse of power.\nHe said despite the critical economic situation, Prime Minister Shahbaz Sharif announced a package to provide relief to people when prices of petroleum products go up.\nThe present government, he said, would fulfill its constitutional term, said Engineer Amir Muqam. The Director General NAB should take notice that the ex-Prime Minister Imran is using KP government’s helicopter like a rickshaw.\nHe asked that Imran remained in power for four years but no increase was made in the net hydel profit for the Khyber Pakhtunkhwa.\nThe Dera Ismail Khan Motorway is being executed by the center, Engineer Amir Muqam said, adding the previous government failed to announce a single project in four years.\nHe said the tall claims of bringing 2 to 3 million people to Islamabad failed miserably as only 3000 people reached Islamabad due to which the PTI chief called off the Long March.\nTo a question, Amir Muqam said this is up to Nawaz Sharif whenever he wants to visit Pakistan. He said negotiations with the IMF are necessary because if the government does not negotiate, they will take back billions of dollars and the country might default. He said if Imran Khan was in power in this situation, the dollar would have touched the mark of Rs. 250.\nHe said efforts would be made to control the load shedding as many power plants were shut down in the previous government. The PTI has been in power in Khyber Pakhtunkhwa for the last eight years but did nothing in the power sectors.\nAPP/ijz/1445\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:59:07.106Z"
}
