{
  "title": "Court grants capital police two-day remand of Gill",
  "link": "https://www.app.com.pk/national/court-grants-capital-police-two-day-remand-of-gill/",
  "date_published": "2022-08-10T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): A lower court here on Wednesday granted the police a two-day physical remand of Pakistan Tehreek e Insaf (PTI)’s Leader Shahbaz Gill in FIR pertaining charges of sedition and inciting the public against the state institutions.\nIn a written order, the court said it was necessary to grant the physical remand of the accused due to the seriousness of the allegations.\nThe court further said that it was also mandatory to conduct forensic test of the recorded voice of the accused.\nThe judge also ordered the police to conduct a medical analysis of Shahbaz Gill.\nThe court instructed the police to produce the accused again after completing investigation within two days.\nEarlier, the Islamabad Police produced the accused before the court of duty magistrate Umar Bashir and requested the judge to grant a fourteen-day physical remand.\nThe police adopted the stance that it had to recover the relevant draft from the accused and investigate the matter pertaining to his controversial statement.\nHowever, Gill’s advocate Faisal Chaudhry opposed the request of physical remand.\nHe said that his client had not spoken during the TV program on the consent of anyone else.\nThe court, however, granted the police a two day physical remand of Shahbaz Gill.\nIt may be mentioned here that the Kohsar Police Station had registered first information reports (FIRs) against Shahbaz Gill for allegedly giving controversial remarks against sensitive institutions of the country.\nThe case has been registered under Sections 124-A (sedition), 505 (statements conducing to public mischief), and of the Pakistan Penal Code. Gill has been accused of spreading chaos, inciting people against the state along with other serious allegations.\nThe accused was arrested on Tuesday by the Islamabad Police.",
  "retrievedAt": "2025-08-11T15:22:11.144Z"
}
