{
  "title": "Huawei ICT competition 2023-24 Regional Final to commence from Dec 19",
  "link": "https://www.app.com.pk/national/huawei-ict-competition-2023-24-regional-final-to-commence-from-dec-19/",
  "date_published": "2023-12-15T15:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): The Regional Final of Huawei ICT Competition 2023-2024 Middle East and Central Asia is set to commence in the Kingdom of Bahrain, in collaboration with Bahrain Polytechnic and the University of Bahrain, from 19th to 21st December.\nThe event aimed to bring together outstanding young talents from the region, inspiring them to embrace digital technology and become future industry leaders in the rapidly evolving digital landscape, said a news release on Friday.\nThe competition also aimed to bridge the digital gap and pave the way for vibrant digital economies in participating countries.\nIn its seventh edition, Huawei’s flagship ICT talent development initiative will host 22 teams from 11 Middle Eastern and Central Asian countries, including Pakistan, Iraq, UAE, Bahrain, Saudi Arabia, Lebanon, Jordan, Kazakhstan, Qatar, Kuwait, and Oman.\nSince its inception in 2017, Huawei’s ME and CA ICT Competition has become the largest and most influential initiative in the region, playing a crucial role in cultivating ICT talent and improving national competitiveness in the participating countries.\nOver 100,000 college students have participated in the first six competitions.\nShunli Wang, Vice President of Huawei Middle East and Central Asia, emphasized the importance of ICT talents in driving the region’s digital economy.\n“Huawei is committed to providing students with a platform for knowledge transfer, healthy competition, and the exchange of innovative ideas. The competition focuses on enhancing students’ ICT knowledge and practical skills, serving as a focal platform that brings together government leaders, academia, and enthusiastic students” he said.\nThe Huawei ICT Competition 2023-2024 Middle East & Central Asia chapter commenced in August, covering 21 countries in the region.\nWith the support of UNESCO and more than 20 ministries, operators, and industry partners, Huawei attracted over 27,500 students from over 600 universities across the region.\nThe current edition achieved the highest level of participation in the competition’s history.\nThe regional final features 22 teams that emerged victorious from intense national-level contests held across 11 markets.\nThese teams, comprising 66 students and 20 tutors, will compete in Bahrain to be crowned ME & CA winners and advance to the global finals scheduled for May 2024 in China. Each team consists of three students.",
  "retrievedAt": "2025-08-11T11:02:10.217Z"
}
