{
  "title": "Nilofar for enhanced media role in in raising awareness on child marriage & gender-based violence",
  "link": "https://www.app.com.pk/national/nilofar-for-enhanced-media-role-in-in-raising-awareness-on-child-marriage-gender-based-violence/",
  "date_published": "2023-12-15T14:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): National Commission on the Status of Women (NCSW) Chairperson Nilofar Bakhtiar on Friday stressed on strengthening the role of the media in raising awareness on issues related to child marriage and gender-based violence.\nShe was speaking on the inaugural day of the Journalist Refresher Training Workshop on “Social Norms, Gender, Prevention and Health Consequences related to Child Marriage”.\nThe workshop has been organized by the NCSW in collaboration with the United Nations International Children’s Emergency Fund (UNICEF) and the United Nations Population Fund (UNFPA).\nSome 45 journalists from across Pakistan are being trained on different aspects and dimensions of the issue of child marriage.\nThey are part of the National Media Fellowship (NMF), a flagship project of NCSW, that sensitizes the media on responsible reporting for the prevention and elimination of child marriage and gender-based violence (GBV).\nSo far, two cohorts of 40 journalists each have been trained in two fellowship programmes in 2022 and 2023. Under the first programme, held in 2022, 162 media stories and two documentaries were produced on GBV, child marriage and impact of climate change on women.These stories were published through leading media houses and digital platforms in the country.\nAfter the completion of second round of NMF, more than 180 stories focusing GBV, and girls’ and women rights are expected to be produced in 2024.\nThe NCSW chairperson said the media had a vital role to play in the efforts to curb violence against women and to create awareness on the issue of child marriage. The dream of a society embracing equality, inclusivity and empowering women could be realized with active participation of the media, she added.\nShe urged journalists to focus more on responsible and research-based reporting, and enhance their interest in learning and working on those ideas and concepts that might be a reason for positive change, human improvement and social reforms.\nThe workshop was also addressed by Mahwish Saeed Syed, Farzana Yasmin, Huma Khan, Fahmida Khan and Attiya Qazi from UNICEF.",
  "retrievedAt": "2025-08-11T11:02:07.620Z"
}
