{
  "title": "Army Chief calls on key US govt, military officials during ongoing visit",
  "link": "https://www.app.com.pk/national/army-chief-calls-on-key-us-govt-military-officials-during-ongoing-visit/",
  "date_published": "2023-12-15T09:15:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 15 (APP): Chief of Army Staff (COAS), General Syed Asim Munir has called on key US Government and Military officials during his ongoing visit to the US including, Secretary of State, Antony J. Blinken, Secretary of Defence, General (R) Llyod J. Austin, Deputy Secretary of State, Victoria Nuland, Deputy National Security Adviser, Jonathan Finer and US Chairman of Joint Chiefs of Staff, General Charles Q Brown.\nAccording to the Inter Services Public Relations (ISPR) news release, matters of bilateral interests, global and regional security issues, and ongoing conflicts were discussed during the meetings.\nBoth sides agreed to continue engagement for exploring potential avenues of bilateral collaboration in pursuit of shared interests.\nDuring the meetings with defence officials, counter terrorism cooperation and defence collaboration were identified as core areas of cooperation. Both sides reiterated the intent to increase interaction and explore ways to expand the scope of mutually beneficial engagements.\nThe COAS underscored the importance of understanding each other’s perspectives on regional security issues and developments affecting strategic stability in South Asia.\nIn this context, the COAS especially highlighted the importance of resolving the Kashmir Issue in accordance with international law and relevant UNSC resolutions.\nThe Army Chief also interacted with the Pakistani overseas community. In a reception hosted by Embassy of Pakistan, the COAS met members of the Pakistani community.\nThe COAS appreciated the positive role being played by Pakistani overseas community towards the country’s progress and development.\nDuring the interaction, topics of varying dimensions were discussed and the COAS appreciated the efforts of Pakistani Diaspora.\nHe also welcomed and encouraged the diaspora to invest through SIFC which is already yielding success in various dimensions.\nCOAS also highlighted that the US is the largest export market for Pakistan constituting 21.5 % of our total exports and dispelled rumours about special screening, denial of visas and detentions.\nArmy Chief said “Pakistani diaspora anywhere around the world is held in high regard as they are ambassadors of Pakistan and contribute significantly to Pakistan in varying domains.\nMembers of the Pakistani community expressed their pride in the role and contributions of the Pakistan Army towards\nwell-being of Pakistan.\nCOAS extended good wishes to the complete Pakistani community in their efforts. He also met Tanweer Ahmed who graciously donated $ 9 million for NUST in the field of IT development in Pakistan. COAS appreciated him and said, “Pakistan is proud of heroes like him.”",
  "retrievedAt": "2025-08-11T11:02:22.545Z"
}
