{
  "title": "Indian court  verdict has no legal worth in presence of UN resolutions on Kashmir:  AJK LA Speaker",
  "link": "https://www.app.com.pk/national/indian-court-verdict-has-no-legal-worth-in-presence-of-un-resolutions-on-kashmir-ajk-la-speaker/",
  "date_published": "2023-12-15T10:45:00.000Z",
  "source": "APP",
  "content": "MIRPUR  ( AJK): Dec 15 (APP) :: Commenting on the Indian supreme court’s verdict, Azad Jammu Kashmir Legislative Assembly Speaker Ch\nLatif Akbar said that the politically motivated verdict was actually a continuation of the August 5, 2019 move that led to the revocation of Kashmir’s special status of the internationally acknowledged disputed occupied state.\nHe was addressing an extraordinary session of the Azad Jammu and Kashmir Legislative Assembly the other day.\nThe session was chaired by Speaker AJK Legislative Assembly Ch Latif Akbar and was specially attended and addressed by caretaker Prime Minister of Pakistan Anwar ul Haq Kakar, Prime Minister Azad Kashmir Chaudhry Anwarul Haq, Leader of the Opposition Khawaja Farooq Ahmed and others, said the AJK government’s official statement issued here late Thursday.\nPertinently, the special session of the Legislative Assembly was convened against the backdrop of the Indian Supreme Court verdict that validated key decisions the Modi government had taken on and after 5th August 2019.\nIn his opening remarks, the Speaker Chaudhry Latif Akbar, while welcoming the Prime Minister of Pakistan, said that his arrival in the august House has boosted the morale of Kashmiris on both sides of the ceasefire line, especially those who were engaged in a freedom struggle on the other side of dividing line.\nCommenting on the Indian supreme court’s verdict, Akbar said that the politically motivated verdict was actually a continuation of the August 5, 2019 move that led to the revocation of Kashmir’s special status and dissolution of the state.\nHe said that this lopsided decision was a clear violation of the United Nations resolutions. He said that in the presence of United Nations resolutions this decision has no legal standing.\nHe said that the decision cannot supersede the UNSC’s resolutions.\nAddressing the session, Leader of Opposition Khawaja Farooq Ahmed said that it was expected that the Supreme Court of India would endorse and put a seal of approval on government’s decision.\nHe said that Pakistan was the sole advocate of the Kashmiri people. “We wish the Government of Pakistan should take up the issue aggressively at the international level and adopt a cogent and convincing approach to galvanize world support in favour of the Kashmiris’ right to self determination”, he said.\nHe said that the Prime Minister should work along with the leadership of all the political parties of Azad Kashmir and the Hurriyat leadership to prepare proposals regarding the resolution of the Kashmir problem.\nPresident Pakistan People’s Party Azad Kashmir Chaudhry Muhammad Yasin said that in the presence of UN resolutions, the Indian Supreme Court’s judgment has no moral or legal standing. He said that the Kashmiris were already aware of Narendra Modi’s nefarious designs. Yasin also expressed his deep concern over the international community’s indifference towards the plight of Kashmiris and its double standards.\nHe said that a robust and proactive Kashmir policy was direly needed to foil Indian designs.\nHe said that delegations consisting of members of the National Assembly of Pakistan, Azad Kashmir and APHC should be sent abroad to sensitize the world about early and amicable settlement of the Kashmiri dispute.\nPresident Muslim League-N AJK chapter Shah Ghulam Qadir while addressing the session highlighted the Kashmiris’ vital role and contribution in the security and economic development of Pakistan.\nOn the Indian court ruling, the pml-n chief said that Indian Judiciary has never been fair to Kashmiris.\nHe said that the Indian government has unleashed a reign of terror in the occupied Kashmir.\n“India on the one hand is hectically engaged in its efforts to alter the region’s demography, while on the other innocent civilians are being killed by the Indian occupation forces day in and day out”, he said. He said that retired soldiers of the Indian army were being settled along the Line of Control.\nHe said that the Government of Pakistan should formulate a comprehensive policy such machinations. He stressed the need for including Kashmiris in the policy making process.\nFormer PM Sardar Abdul Qayoum Niazi said that the purpose of establishing the government of Azad Kashmir was to liberate the rest part of the state that is still reeling under the India’s occupation. “It is our duty to realize this as our prime responsibility and use all our energies to raise the issue of Kashmir at every forum”, he said.\nThe session was also addressed by President Muslim Conference Sardar Atique Ahmad Khan, former premier Raja Farooq Hyder Khan, Sardar Hassan Ibrahim Khan of Jammu and Kashmir People’s Party and others.\nThey said that a strong and stable Pakistan could play an important role to seek a settlement of the dispute in line with the wishes and aspirations of the Kashmiri people.\nHe stressed the need for convening a joint sitting of the Kashmiri representatives hailing from both sides of the line of control and members of the diaspora community to chalk out an effective strategy and plan of action to counter Indian false and fabricated narrative on Kashmir.\nRaja Mohammad Farooq Haider Khan said that holding of referendum in the region was the Kashmiris’ only demand.\nHe said that the government of Azad Kashmir should be recognized as the representative government of the erstwhile state of Jammu and Kashmir until the Kashmiris get their right of self-determination guaranteed to them by the United Nations.\nPakistan, he said, should allow Kashmiris to present their case at the international level by themselves. “We won’t disappoint Pakistan”, he added.\nSardar Hasan Ibrahim said that the Kashmiris’ ongoing struggle was all about the right of self-determination.\nHe said that Kashmiris had decided to align their fate with Pakistan months before the emergence of India and Pakistan as sovereign states. The historic resolution known as the accession to Pakistan resolution, he said was adopted at the residence of his grandfather Sardar Muhammad Ibrahim Khan and then the revolutionary government of Azad Kashmir was established under his leadership on 24 October 1947.\nHe said that, the government of Pakistan should adopt a clear cut policy on Kashmir.\nThe assembly session was also attended by the representatives of All Parties Hurriyat Conference.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:02:15.860Z"
}
