{
  "title": "Commemorative ceremony held in Ankara for martyrs of APS Peshawar attack",
  "link": "https://www.app.com.pk/national/commemorative-ceremony-held-in-ankara-for-martyrs-of-aps-peshawar-attack/",
  "date_published": "2023-12-15T13:38:00.000Z",
  "source": "APP",
  "content": "ANKARA, Dec 15 (APP): A commemorative ceremony was held on Friday at Keçiören, Ankara to pay homage to the school children and staff martyred in the brutal terrorist attack on Army Public School (APS) Peshawar in 2014.\nAmbassador of Pakistan Dr. Yousaf Junaid, Keçiören Municipality Mayor Turgut Altinok, officials from Justice and Development Party (AKP), Keçiören Municipality and Pakistan embassy attended the event.\nReaffirming strong solidarity of Turkiye with Pakistan, Mayor of Keçiören Turgut Altinok, condemned APS terrorist attack and stated that the people of Turkiye would continue to stand by their Pakistani brothers in all aspects of life particularly in fight against terrorism.\nThe mayor reiterated Turkish support to the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) for realization of their inalienable right to self-determination.\nWhile expressing heartfelt gratitude to Turkish brethren for solidarity and keeping the memory of precious lives lost to terrorism alive, Ambassador Junaid stated that these 144 trees reflected strong resolve of 300 million people of Pakistan and Turkiye to fight terrorism, as both countries had faced innumerable losses at the hands of terrorism.\nReferring to the recent verdict of Indian Supreme Court on the status of Indian Illegally Occupied Jammu and Kashmir, the ambassador stated that the judgement was manifestation of yet another form of terrorism. Jammu and Kashmir is an internationally recognized dispute, he added.\nThe ambassador said that the final disposition of Jammu and Kashmir was to be made in accordance with the relevant United Nations Security Council resolutions and as per aspirations of the Kashmiri people. There is no supremacy of Indian constitution and Indian courts over UN resolutions, he added.\nThe ambassador thanked President Recep Tayyip Erdogan for his principled stance on Kashmir and reiterated that Pakistan would continue to extend its full political, diplomatic and moral support to legitimate Kashmiri cause of self-determination.\nLater, the ambassador along with Mayor Kecioren and other dignitaries laid wreath at the memorial of the APS martyrs. These trees were planted in the memory of martyred children by the Kecioren Muncipality and Youth Wing members of Justice and Development Party (AKP) in collaboration with Embassy of Pakistan in January 2015.",
  "retrievedAt": "2025-08-11T11:02:09.359Z"
}
