{
  "title": "Kashmir issue to be raised internationally with renewed vigour: PM",
  "link": "https://www.app.com.pk/national/kashmir-issue-to-be-raised-internationally-with-renewed-vigour-pm/",
  "date_published": "2023-12-15T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar Friday said that the government in consultation with the Kashmiri leadership would raise the Kashmir issue at the international forums with renewed vigour.\nThe prime minister, in an interview with the AJK PTV, said the Kashmiri diaspora had a vital role to play in raising the Kashmir dispute, and it should come forward and work with the Pakistani leadership to help take the issue issue to its logical conclusion.\nHe said he was inspired by the courage of the Kashmiri leadership which was confronting the brutality of Indian forces with bravery and fortitude.\nThe Kashmiris’ desire for freedom was very much alive and the whole Pakistani nation stood shoulder to shoulder with them, he added.\nThe prime minister said during his address to the United Nations General Assembly he presented the viewpoint of Kashmiris.\nHe stressed that Pakistan would continue to extend moral, political and diplomatic support to the Kashmiris.\nHe said in his address to the AJK Legislative Assembly he represented the State of Pakistan and reiterated its seven decades old stand on the Kashmir issue.\n“I was honoured to address the Assembly in the presence of Kashmiri leaders who are the heirs of the martyrs of Kashmir, including the martyrs of 1947 and Burhan Wani.\n“I held consultation with the Kashmiri leadership to forge a strategy to effectively raise the Kashmir issue at the diplomatic level and at international forums,” he added.\nThe debate on Kashmir was again brought to the mainstream by the Government of Pakistan, he pointed out.\nHe said Pakistan was not complete without the freedom of Kashmir and grant of right to self-determination to its people.\nPM Kakar said Kashmir was a internationally recognized disputed territory and had been on the agenda of the United Nations as an unresolved issue for over seven decades which could only be settled through a plebiscite.\nWithout the participation of Kashmiris, no unilateral action by India, including any action of a sham court or an assembly could change reality of Kashmir, he asserted.\nTalking about the Kashmiri leadership, he said Mir Waiz and his forefathers had demonstrated impeccable leadership which was known to the whole world.\nHe was of the view that Kashmir had an indigenous movement which would always come up with a new leadership in the next generation. India was mistaken that the Kashmir movement could be undermined with incarceration of its leaders, he added.\nPM Kakar assured that the Federal Government would resolve issues faced by the Government of Kashmir.",
  "retrievedAt": "2025-08-11T11:02:11.505Z"
}
