{
  "title": "FGRF provides over 41,000 hot meals to people of Gaza",
  "link": "https://www.app.com.pk/national/fgrf-provides-over-41000-hot-meals-to-people-of-gaza/",
  "date_published": "2023-12-15T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 15 (APP): The Faizan Global Relief Foundation (FGRF) has so far provided over 41,000 hot meals to the people of Gaza and has been supporting the relief efforts on the ground.\nThe FGRF is working on the ground, responding to disasters, whether it be the Pakistan Floods in 2022, Earthquake in Turkiye and Syria in early 2023, the Earthquake in Morocco and other disasters to serve Muslim Ummah across the globe, a news release said.\nA team of FGRF is recently in Egypt which includes Syed Muhammad Faisal Sami (Head of FGRF UK), accompanied by representatives from Birmingham, Burton and Leicester.\nThe foundation has sent three containers from Turkiye via the Rafah Border Crossing which includes over 1,000 ration boxes each which is sufficient for more than 3000 families for a month.\nIt added that another two containers from Egypt are being sent which have more than 800 mattresses and 1300 blankets as well as items to protect people from the cold weather.\nWith the devastating Earthquake in Turkiye and Syria earlier this year, the FGRF responded immediately whereas its team was in Turkiye and Syria last week to review the relief efforts. The Foundation has distributed food to hundreds of thousands of people in quake-hit Turkiye and provided over 100 container homes to affected families till date.\nIn Syria, 96 homes are being built and due to be completed by end of this month which included a bedroom and a living room. In January 2024, the keys will be distributed to the new owners. The team during this journey planned another project which is due to begin next month to build 100 more homes, 2 new schools and an education centre.\nIn October 2023, the FGRF team were in Pakistan to overlook the efforts since the devastating floods. During the Pakistan floods FGRF provided essentials and cooked meals to millions of people and set up 117 camps where over 37,000 people were treated. For animals, FGRF set up 44 camps across the country where 77,000+ livestock were treated.\nCurrently FGRF is constructing homes. So far, 5000+ homes have been constructed and a target of 20,000 homes has been set in this regard.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:02:29.031Z"
}
