{
  "title": "Governor agrees over constitution of steering committee to streamline trade with Afghanistan",
  "link": "https://www.app.com.pk/national/governor-agrees-over-constitution-of-steering-committee-to-streamline-trade-with-afghanistan/",
  "date_published": "2023-12-15T09:37:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 15 (APP):Khyber Pakhtunkhwa Governor, Haji Ghulam Ali has expressed his consent over constitution of a steering committee with the task of streamlining of trade with Afghanistan both import, export and transit.\nThe agreement was reached during a meeting of Governor KP, Haji Ghulam Ali with a delegation of businessmen dealing in trade with Afghanistan.\nCoordinator Pak-Afghan Joint Chamber of Commerce and Industry (PAJCCI), Zia-ul-Haq Sarhadi and Vice President PAJCCI, Shuja Muhammad were leading the delegation and other members were Engr. Manzoor Elahi, Imtiaz Ahmad Ali (Director PAJCCI), Farooq Ahmad, Ammar Ansari and Mian Waheed Bacha.\nDuring the meeting, the delegation members apprised Governor KP about the problems they face daily in trade with Afghanistan including import, export and transit trade.\nAfter discussion over the issues creating hurdles in the smooth sailing of trade, it was agreed that a steering committee be constituted under the chairmanship of private sector stakeholders with representation from Frontier Corps, NLC, Afghan Consulate, DC Khyber and Custom Department as its members.\nThe committee should be notified by Governor KP and would meet on a weekly or monthly basis to take a review of issues about the Pak-Afghan trade.\nThe steering committee would work in the pattern of the Facilitation Committee formed at the Torkhem border for holding meetings of traders and stakeholders from Pakistan and Afghanistan sides every month.\nEarlier, the Coordinator of PAJCCI, Zia-ul-Haq Sarhadi apprised the Governor about the working of PAJCCI under the dynamic leadership of its Chairman, Zubair Motiwala and President, Junaid Makda.\nPAJCCI was formed around fourteen years earlier and has around 400 members. The Executive Body comprises of 22 members, 11 each from Pakistan and Afghanistan, Zia added.\nHe also informed Governor KP about the problems being faced by the business community in the wake of restrictions imposed on different items in the Afghan Transit Trade.\nZia Sarhadi said around twelve different departments are monitoring Pak-Afghan trade and the issue of smuggling can be resolved through enhancing vigilance and checking at borders.\nImposition of restriction on trade over the pretext of curbing smuggling of imported goods back to our country is not a wise approach, Zia opined.\nHe said smuggling should be stopped and not the trade to keep the momentum of commerce in the region stable and supportive for the people of both countries.\nApart from it, Zia continued, exporters are facing a lot of problems in sending their goods to Afghanistan as different departments are imposing different restrictions on the transportation of goods.\nHe said earlier Political Agent Khyber used to issue a permit to every truck after collection of around Rs. 5000 from exporter and no other department made any demand for money on its way to Torkhem.\nHowever, after the merger of FATA into settled area, the practice is not continued by the Deputy Commissioner and different departments ask for money under different heads, inflicting financial burden on businessmen, he continued.\nHe also demanded making Azakhel Dry port functional for export of goods through train. Zia said the Azakhel dry port was established around four years earlier for Rs. 600 million, but is not properly utilized yet.\nHe said exporters in Khyber Pakhtunkhwa have to send their goods to sea port in trucks on additional payment and the GD (Goods Document) is also prepared in Karachi, rendering hundreds of Custom Clearing Agents in the province jobless.\nSpeaking in response to issues raised by delegation members, Governor KP, Haji Ghulam Ali held out assurance of inviting officials of relevant departments for the resolution of problems.\nHe asked the business community to send their demands in written form and he will take up all the issues one by one with concerned officials.\nHe said the government’s priority is the promotion of commerce and trade and for this purpose, all possible steps would be taken for the facilitation of businessmen.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:02:43.192Z"
}
