{
  "article_id": "2025-04-15_be804792521bb97e05f52e0f215a463c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/overseas-pakistanis-shows-full-confidence-over-government-investment-friendly-policies/",
    "retrieved_at": "2025-08-27T14:30:42.980Z"
  },
  "metadata": {
    "title": "Overseas Pakistanis shows full confidence over government investment friendly policies",
    "author": null,
    "date_published": "2025-04-15T13:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 15 (APP):Overseas Pakistanis have shown full confidence and support over the government investment friendly policies and highly appreciated the steps which had taken by incumbent regime for the welfare and development of expatriates. Addressing at the four-day first Overseas Convention here, they said that it was the historic record of the country that last month in March 2025, Overseas Pakistan have sent over four billion dollars remittances to homeland. They thanked to the Prime Minister Shehbaz Sharif and Chief of Army Staff General Asim Munir for holding and prestigious event for expatriates and promised to address the possible issues as soon as possible on priority basis. A Overseas Pakistani Sajid Tarar from UK, he said around two million Pakistanis living in UK and wanted to invest in homeland as incumbent regime had introduces productive and friendly policies for Overseas Investors. Dr Nadeem from Saudi Arabia have suggested the government to introduce five years plans for skilled and unskilled workers and new destinations in the digital global world. He said that million of Pakistanis could get the jobs in the different countries through the latest technology. Nadeem said that as per the vision of KSA 2030 thousands of Pakistanis could get jobs. Ayesha Khan from USA also appreciated the policies of the incumbent regime and suggested that Overseas Pakistan should avoid the baseless and misinformation of social media. Lord Wajid from UK also hailed the role of Overseas Pakistan for strengthening the bilateral relationship of both nations and hardworking for their famalies and homeland. Sara Mehmood also acknowledged the services of Overseas Pakistanis Foundation and incumbent government. Asim Mehmood from Japan has donated some ambulances to the Armed forces and Asad Nawaz from Japan also donated some medical equipment for the treatment of soldiers Lord Habib, Sara Mehmood, Shahid Khan, Pervaiz Khokhar, Tahir Javeed, Saeed Sheikh and Asim Mehmood were also addressed to the participants.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}