{
  "title": "Cross border trade important for Pakistan to address food security challenges amid climate crisis: Speakers",
  "link": "https://www.app.com.pk/national/cross-border-trade-important-for-pakistan-to-address-food-security-challenges-amid-climate-crisis-speakers/",
  "date_published": "2023-10-20T15:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): The speakers at a webinar on food security and agriculture promotion through cross border trade on Friday said the Asia region had a tremendous agriculture potential and could help enhance resilience to environmental degradation food security challenges through cross border trade between the regional states.\nThe Sustainable Development Policy Institute (SDPI) organized the webinar titled “Innovation for Food Security and Regional Trade for Agriculture Promotion”, which was moderated by its Project Coordinator Abdullah Khalid.\nJames McNee, First Secretary of Canadian Embassy in Pakistan, in his opening remarks, said cooperation and coordination were instrumental in promoting and galvanizing the endeavours intended to address trade, food security and agriculture sector issues.\nHe said Canada had a long history of exporting grains, canola and other agricultural products to Pakistan, which, however, needed the political will to modify legislation on genetically modified organisms (GMOs) to transform its existing agricultural production.\nThe envoy underscored that linkages had been established between grain institutes in Canada and Punjab province to further study the GMOs that were being raised in Canada for their suitability to the soil of the region.\n“There is a need to develop sustainable agricultural solutions by Pakistan that address food security and climate change on priority. Canada has food security on its priority. Recently, I witnessed the 2022 floods devastation that washed away standing crops inundating acres of cultivated land in Punjab and other provinces,” he added.\nDr Vaqar Ahmed, SDPI Joint Executive Director,in his welcome remarks, informed the participants that the Institute had planned a hackathon for November 17-18 inviting teams from neighbouring countries to participate in the debate about food security, agriculture and trade.\n“Food security is an international issue where 9.2% of world population is facing hunger and malnourishment with 55% of that number existing in Asia region alone,” he said.\nHe added that many people in Asia were unable to afford daily healthy diet whereas food price inflation was also contributing to their health as well.\nDr Vaqar mentioned that there was a broad-based strategy required on the issue as Pakistan’s challenges in that regard were unavailability or poor-quality fertilizers, water scarcity, loss during harvest, lack of machinery and equipment and uncertain credit terms and lack of insurance to farmers.\nHe proposed that to promote agriculture through cross-border trade with the neighbouring countries reforms in trade sector was a low hanging fruit.\nDR Vaqar pointed out that the country had legislation on all the sectors ranging from National Food Security Policy, Water Policy, 5Es Framework of Planning division that also address water and agriculture, but the major issue was that of their implementation.\nPierre Bonthonneau, Senior Advisor, International Trade Center (ITC) said the Center was working on improving the countries’ capacities to indulge in healthy international trade.\nHe said the issues of food security and cross-border trade were very closely interconnected, whereas the trade of agriculture goods was the livelihood of millions of workforces.\nHe added,”During cross-border trade the prices of agricultural goods spike up in case of any delays during the transit, whereas those of perishable items drop by a whopping 70% in international trades.” The food security issue could be addressed by minimizing such delays.\nPierre Bonthonneau claimed that cross-border trade in the prevailing times required digitization and cutting-edge solutions that ensure well-regulated and uniform cross-border trade to ensure food security and healthy trade.\nAyma Hayat Tamman, CEO, Tamman Farms said climate change had been casting serious impacts on the agricultural sector as it was directly impacting the crop yields and cultivation lands.\nShe emphasized the need to focus on research and development to bring farmers to green fertilizer than the chemical-based pesticides and fertilizers detrimental to insect and bird lives.\nTamman believed that the country’s farmers needed education and training programmes along with efficient water management system to promote agriculture sector.\nProf. Dr. Bushra Yasmin, Professor of Economics, Fatima Jinnah Women University said the availability, accessibility and affordability of healthy food commodities to live a healthy life defined the concept of food security and was essential to achieve the goal of enhancing the food security.\nShe added that the overall climate change impacts demanded serious attention as more the adverse impacts of climate change the lower would be the food security.\nDr. Haroon Sarwar, Economic Consultant, Ministry of National Food Security & Research said food security was the outcome of agriculture sector and the latter was facing a lot of challenges in Pakistan.\nHe said the agriculture sector was not profitable as compared to non-agriculture sector, whereas profitable incentives to farmers could help yield good productivity.\nDr Sarwar noted that lack of farmers access to credit was also an issue whereas formal collateral free credit, profitable seed price and quality fertilizer could ensure proper availability of food at affordable prices.",
  "retrievedAt": "2025-08-11T10:09:45.421Z"
}
