{
  "title": "Dr. Nadeem visits infectious diseases hospital",
  "link": "https://www.app.com.pk/national/dr-nadeem-visits-infectious-diseases-hospital/",
  "date_published": "2023-10-20T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): Caretaker Federal Minister for Health Dr. Nadeem Jan on Friday visited Infectious Diseases Hospital in Chak Shahzad.\nThe purpose of the visit was to take stock of the facilities and performance in the hospital. The Infectious Diseases Hospital consists of 250 beds.\nDr. Nadeem took notice and expressed concern over the hospital not being functional for last two years.\nThe minister formed a three-member committee to make the hospital fully operational, which  would be headed by Dr. Muhammad Salman, Chief Executive Officer, National Institute of Health.\nThe committee will formulate an integrated strategy to make the hospital fully functional.\nThe minister directed the committee to submit its recommendations to him on urgent basis.\nLater, Dr Nadeem Jan visited Regional Blood Centre. More than forty staff members were absent from the Regional Blood Centre.\nHe took notice and instructed to issue explanation letters to the staff absent from duty.\nThe minister questioned as to why such a big safe blood donation center was non-functional, adding strict action would be taken against the responsible.\nThe minister ordered an immediate investigation into the non-functionality of the Regional Blood Center.\nThe minister said, “We are ensuring merit and transparency in the health sector,” adding salaries of Infectious Diseases Hospital and Regional Blood Centre staff should be paid without delay.\nHe said that implementation of the reform agenda was necessary for improvement in the health sector.\nHe directed to the officers to pay attention to their assigned duties, adding strict action would be taken for negligence in performance of duties.\nThe minister said efforts were being made to ensure the availability of the best medical facilities in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:09:31.061Z"
}
