{
  "title": "Govt. taking vigorous steps to provide maximum facilities to telecom sector: Secretary",
  "link": "https://www.app.com.pk/national/govt-taking-vigorous-steps-to-provide-maximum-facilities-to-telecom-sector-secretary/",
  "date_published": "2023-10-20T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): Federal Secretary for IT and Telecom Hassan Nasir Jamy on Friday said that the government was taking vigorous steps to provide maximum facilities to the telecom sector.\nCaretaker IT Minister Dr Umar Saif has special interest in promoting IT and Telecom sector in the country and recently approved infrastructure sharing framework and the proposed spectrum sharing mechanism are important milestones to reduce operational cost of telecom operators, he expressed while talking to Head of Asia Telenor Group Børre Furberg.\nThe Secretary further said that the country had 190 million cellphones, 127 million mobile broadband subscribers and 130 million broadband users, reflecting its potential in the sector.\nThey also discussed issues relating to upcoming IMT Spectrum Auction and business and investment opportunities in Pakistan.\nMr. Petter- Børre Furberg, EVP and Head of Asia, Telenor Group said, “We are proud of the contributions Telenor has made since 2004, through our investments in Telenor Pakistan and Telenor Microfinance Bank, in bringing connectivity and digital financial services to millions of customers, enabling them to live productive digital lives.\nThe business and investment environment in the telecom sector is challenging for some time and urgent policy reform is needed to ensure that connectivity continues to drive economic activity and digitalization in Pakistan.”\nThe meeting was attended by Additional Secretary IT Ms. Aisha Humera Moriani, Director General Telecom Faisal Ratyal, CEO Telenor Pakistan Khurrum Ashfaque, VP Public and Government Affairs Raza Zulfiqar Naqvi and VP Regulatory and Public Policy Telenor Shan-ul-Haq.",
  "retrievedAt": "2025-08-11T10:09:11.965Z"
}
