{
  "title": "Huawei ICT Competition 2023-2024 launched",
  "link": "https://www.app.com.pk/national/huawei-ict-competition-2023-2024-launched/",
  "date_published": "2023-10-20T11:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): The 2023-24 edition of the Huawei ICT Competition developed for university and college students globally to promote the healthy development of the ICT talent ecosystem and support the integration of industry and education has been launched.\nSome of Pakistan’s brightest young minds participated in the ICT Competition last year where students from Pakistan won the second and third prizes in the Network Track and third prize in the Innovation Track at the Huawei ICT Competition 2022-2023 Global Final concluded at Huawei Headquarters in Shenzhen, China, said a news release issued here on Friday.\nGlobally 120,000+ students and 2,200+ Colleges/Universities in 85 countries and regions have joined the Huawei ICT Competition in the four forward-looking competition tracks.\nWith an eye on the future, the Competition tracks are the Network track for IP technologies, Datacom, Security, and WLAN; the Cloud track focuses on IT technologies such as Cloud, Big Data, and AI; the Computing track for Software and OS such as openEuler, openGauss, and Kunpeng; and the Innovation track will look for innovative solutions using AI, harmony OS, IoT and Cloud and Big Data.\nHuawei is building a robust ICT talent ecosystem and accelerating the digitalization progress of the world by launching more Huawei ICT Academies, releasing talent white papers, and holding the Huawei ICT Competition.\nThe global platform offers the youth the opportunity to apply their tech knowledge, accelerate their learning, and network with their peers globally.\nTogether with the Huawei ICT Academy, the Huawei Innovation Competition, the Seeds for the Future program, joint university labs, and other initiatives, thousands of young people in the region benefit from an advanced skills development pipeline every year, equipping them with the necessary skills to lead digital transformation and development efforts within their countries.\nHuawei’s commitment to enhancing digital skills and Pakistan is evidenced in the numerous projects and initiatives underway in the country and the resounding success of Pakistani youth in the opportunities offered by Huawei.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:09:36.968Z"
}
