{
  "title": "Solangi dispels notion of any delay in election",
  "link": "https://www.app.com.pk/national/solangi-dispels-notion-of-any-delay-in-election/",
  "date_published": "2023-10-20T17:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 20 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi, dispelling the impression of a delay in election, said on Friday that the Election Commission of Pakistan (ECP) was performing its duties diligently to further electoral process in a responsible way.\nHe said the ECP had already announced that the election would be held by the end of January.\nThe minister was talking to private television channels in two separate programmes on current affairs.\n“The Election Commission will announce final dates for the election and it is our responsibility to provide financial, administrative, and security assistance to the ECP for the purpose,” he said.\nSolangi said the ECP was implementing its schedule and the political parties would be granted 54 days for conducting election campaign.\nHe said the caretaker government, which had limited powers and tenure, was bound by the Constitution and law. The ECP was responsible for holding the elections in a transparent, free and fair manner and the government which was a constitutional one would provide all-out assistance in that regard.\nTo a query, he said the Law Ministry would consult with the ECP on the petition seeking elections within 90 days and present its stance in the Supreme Court that had ultimate authority to decide on the matter.\nIt was prerogative of the court to decide whether an accused was innocent or guilty, the minister said in response to another query.\n“According to the Constitution, every individual has the right to defense,” Murtaza Solangi said, adding the constructive criticism was a hallmark of the democracy.\nEach political party had its own stance, said the minister, adding every citizen enjoyed right for the freedom of expression.\n“Nawaz Sharif is a senior politician and he is returning to his own country,” he said, adding the caretaker government was taking measures to ensure law and order.\n“No leader from the Pakistan Muslim League-Nawaz is in the cabinet,” Murtaza Solangi clarified.\nThe caretaker government had been performing its functions within the confines of the Constitution and the law, he said, adding it was its responsibility to complete the privatization process of those departments that were okayed by the previous government and the parliament.\nHe said the current minister for privatization had an excellent administrative experience.\n“The state media is providing equal coverage to all political parties,” he said.",
  "retrievedAt": "2025-08-11T10:09:38.709Z"
}
