{
  "title": "NDMA issues weather alerts for rain, urban flooding, glacial floods across Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jun 28 (APP):National Emergencies Operation Center (NEOC) of National Disaster Management Authority (NDMA) has issued impact-based weather alerts for multiple regions of Pakistan, warning of heavy rainfall, urban flooding, glacial lake outburst floods (GLOFs), and associated hazards over the next 24 to 48 hours.\nAccording to NEOC, intense rainfall and above-normal temperatures have significantly increased GLOF risks in northern districts of Khyber Pakhtunkhwa and Gilgit-Baltistan, including Upper Dir, Chitral, Swat,Reshun, Booni, Brep, Sardar Gol, Arkari, Dir Gol, Thalu l & 2, and Kumrat Valley.\nThese areas face threats of sudden flash floods, GLOF, infrastructure damage, and travel disruption.\nSimilarly, isolated rain and thunderstorms are expected in Chitral, Dir, Swat, Abbottabad, Mansehra, Haripur, Karak, Kohat, Kohistan, Khyber, Kurram, Mohmand, Nowshera, Malakand, Charsadda, Bannu, Buner, Hazara, Peshawar, Mardan, Swabi, and Waziristan.\nThunderstorms may cause damage to weak structures, reduce visibility, and result in temporary power outages.\nIn Gilgit-Baltistan, rapid glacier and snowmelt combined with rain has escalated the risk of GLOF in high-altitude valleys such as Badswat, Hinarchi, Tursat Hundur, Darkut, and Ishkoman. Rainfall is also likely in Hunza, Skardu, Astore, Chilas, and adjoining regions, which could lead to rising river levels, flash floods, and damage to transport and power infrastructure.\nIn Azad Jammu & Kashmir, rainfall is expected in Neelum Valley, Bagh, Kotli, Rawalakot, Muzaffarabad, and Haveli. The potential impacts include flooding in low-lying areas, transport disruption, and drainage system overload due to persistent downpours.\nIn Punjab, widespread rain and thunderstorms are forecasted in Murree, Galiyat, Rawalpindi, Attock, Chakwal, Jhelum, Mianwali, Mandi Bahauddin, Gujranwala, Gujrat, Hafizabad, Khushab, Sargodha, Narowal, Chiniot, Toba Tek Singh, Faisalabad, Lahore, Okara, and Kasur. The region faces risks of urban flooding, power outages, damage to fragile structures, and traffic disruption due to poor visibility during dust and rain spells.\nIslamabad will also witness the same weather conditions in next 24 to 48 hours.\nIn Balochistan, isolated rainfall is expected in Quetta, Zhob, Loralai, Ziarat, Kalat, Musakhel, Khuzdar, Awaran, Barkhan, Jaffarabad, Kohlu, Sibi, and Dera Bugti. Thunderstorms and strong winds may damage weak infrastructure, reduce visibility, and cause power interruptions.\nIn Sindh, widespread rain and thunderstorms are likely in Jacobabad, Sukkur, Larkana, Nawabshah, Khairpur, Kashmore, Hyderabad, Tharparkar, Mirpur Khas, Umerkot, Sanghar, Jamshoro, Tando Allahyar, Tando Muhammad Khan, Thatta, Badin, and Karachi.\nHeavy rainfall may result in urban flooding, traffic disruption and damage to vulnerable structures and electricity lines.\nNDMA urged all provincial and district administrations to remain on high alert, activate contingency plans, and ensure timely dissemination of warnings in local languages.\nCitizens, especially those in high-risk areas, are advised to stay updated through official advisories, avoid unnecessary travel near glacial streams, riverbanks, and flooded roads, and keep emergency kits ready.\nFor real-time alerts and preparedness guidelines, download the Pak NDMA Disaster Alert App and follow NDMA’s official communication channels.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:34:46.538Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ndma-issues-weather-alerts-for-rain-urban-flooding-glacial-floods-across-pakistan/",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T17:34:00.000Z"
}
