{
  "title": "Pakistan recognized globally as a responsible, peace-loving nation: Khalid Magsi",
  "author": null,
  "content": "ISLAMABAD, Jun 28 (APP):Federal Minister for Science and Technology, Khalid Hussain Magsi has said that the international community recognizes Pakistan as a responsible and peace-loving nation, committed to regional stability and global cooperation.\nHe expressed these views during a meeting with a high-level delegation from the British High Commission in Islamabad.\nThe delegation was led by Mr Cromac Dreelan, Head of Strategic Engagement and Understanding, and included Ms Huda Ikram, Senior Political Adviser, and Mr. Ismail Khan, Principal Adviser (Foreign Affairs).\nDuring the meeting, both sides exchanged views on enhancing mutual cooperation in science, technology, innovation, and education. Minister Magsi emphasized that the Pakistan-UK relationship is anchored in mutual respect and trust, and reaffirmed Pakistan’s commitment to working with the international community for peace and sustainable development.\nHighlighting Pakistan’s constructive diplomacy and growing global engagement, the Minister noted that the confidence of the world in Pakistan is strengthening, as the country’s peaceful stance and diplomatic approach gain appreciation on international platforms.\nAddressing ongoing international crises, Minister Magsi strongly condemned the brutal Israeli attacks on innocent civilians in Gaza.\nHe urged the United Kingdom to take a more active and principled stand in stopping these atrocities and ensuring respect for international humanitarian law. “The world cannot remain silent in the face of such grave human rights violations,” he said.\nOn regional tensions, particularly with India, the Minister reiterated that Pakistan’s sovereignty is non-negotiable. He affirmed that the armed forces of Pakistan are fully committed to defending the nation’s territorial integrity and responding resolutely to any external threats.\nReferring to the Kashmir dispute, Minister Magsi said the issue has once again gained prominence on global forums.\nHe stressed that Pakistan will continue to raise its voice for the Kashmiri people and work for lasting peace in the region in partnership with the international community.\nMr Cromac Dreelan appreciated Pakistan’s stabilizing role in the region and commended the country’s leadership for guiding it toward technological progress and constructive international engagement. He reaffirmed the United Kingdom’s commitment to strengthening scientific and educational ties with Pakistan.\nThe meeting concluded on a positive note, with both sides expressing their resolve to expand bilateral cooperation and work together on shared goals related to peace, innovation, and sustainable development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:34:49.831Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-recognized-globally-as-a-responsible-peace-loving-nation-khalid-magsi/",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T15:18:00.000Z"
}
