{
  "title": "13 security personnel martyred in North Waziristan",
  "author": null,
  "content": "RAWALPINDI, Jun 28 (APP):Thirteen security personnel were martyred in a suicide bombing in Khyber Pakhtunkhwa’s North Waziristan district, carried out by Indian proxy Fitna al Khwarij.\n“In a cowardly attack, planned and orchestrated by the terrorist state of India, and executed by its proxy Fitna al Khwarij, a Security Forces convoy was targeted today in the general area Mir Ali, North Waziristan District.\nA vehicle-borne suicide bomber attempted to explode himself on a security forces convoy, who was intercepted by the leading group, foiling his nefarious design. However, in their desperation, an explosive-laden vehicle was rammed by the Indian sponsored Kharjis into one of the vehicles of the leading group.\nResultantly, thirteen brave sons of soil embraced Shahadat. In this tragic and barbaric incident, three innocent civilians, including two children and a woman, also got severely injured”, said an ISPR news release.\nShuhada include Subedar Zahid Iqbal (age: 45 years, resident of District Karak), Havildar Sohrab Khan (age: 39 years, resident of District Naseerabad), Havildar Mian Yousaf (age: 41 years, resident of District Buner), Naik Khitab Shah (age: 34 years, resident of District Lower Dir), Lance Naik Ismail (age: 32 years, resident of District Naseerabad), Sepoy Rohail (age: 30 years, resident of District Mirpur Khas), Sepoy Muhammad Ramzan (age: 33 years, resident of Dera Ghazi Khan), Sepoy Nawab (age: 30 years, resident of District Quetta), Sepoy Zubair Ahmed (age: 24 years, resident of District Naseerabad), Sepoy Muhammad Sahki (age: 31 years, resident of District Dera Ghazi Khan), Sepoy Hashim Abbasi (age: 20 years, resident of District Abbotabad), Sepoy Muddasir Ejaz (age: 25 years, resident of District Layyah), Sepoy Manzar Ali (age: 23 years, resident of District Mardan).\nIn the ensuing sanitisation operations, khwarij were pursued and after an intense fire exchange, fourteen khwarij have been sent to hell by the security forces. The operations in the area would continue and perpetrators of this henious and cowardly act will be brought to justice.\nThe security forces of Pakistan, in step with nation, remain steadfast in their resolve to eradicate Indian sponsored terrorism from the country, and such sacrifices of our brave soldiers and innocent civilians further reinforce our unwavering commitment of safeguarding our nation at all costs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:34:46.539Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/13-security-personnel-martyred-in-north-waziristan/",
  "dateList": "2025-06-28",
  "date_published": "2025-06-28T17:41:00.000Z"
}
