{
  "title": "President for undoing Indian evils, portrayal of Pakistan’s true image",
  "link": "https://www.app.com.pk/national/president-for-undoing-indian-evils-portrayal-of-pakistans-true-image/",
  "date_published": "2021-02-06T19:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 06 (APP): President Dr Arif Alvi Saturday said that in order to seek a solution to Kashmir dispute, Pakistan would have to undo the Indian evils and portray true image of its own in the comity of nations.\n“We will have to undo the evils of India which labeled us for terrorism, opposed us in FATF and NSG. We have to undo that and also portray Pakistan’s true image in the world,” the president said in an interview with a private television channel.\nHe said that instead of morality, the world’s decisions were tilted towards financial interest, be it was the United Nations or other states.\nHe said morality could become a lead role of Pakistan and any good state as it had become extinct in international relations and among the governments.\nHe said the good leaders could change the destiny of nations quite fast and suggested Prime Minister Imran Khan, leadership from Turkey, Malaysia and Saudi Arabia to take a lead role to revive morality in international relations.\nThe president said Pakistan was about to emerge as a great nation citing the indicators like unique performance during COVID-19, booming construction industry and exports, balanced current account deficit, improved dollar reserves and remittances well performing stock market and growing IT exports.\nMoreover, he said the communication with the traders had increased, ease of doing business ranking was getting better, austerity measures were being taken besides running a strong anti-corruption drive and effectively raising the issue of Islamophobia in the world.\nTo a question, President Alvi said being an active political worker, he found out his areas of interest to work in while being president like population, information technology, artificial intelligence, women rights, health with prevention of diseases in particular.\nSimilarly, the First Lady Samina Alvi was also running a drive against breast cancer and for women empowerment.\nCalling presidency as public trust, the president said he personally bore the expenses incurred on his family and personal guests, be it is at his office or outside.\nHe also clarified that the expenses incurred on the events held at Aiwan-e-Sadr were borne by the ministries or organizations concerned.\nThough, he said traditionally, the government financed the president’s camp office, but he met the expenses of his house in Karachi what he had already been doing before becoming the president.\nCalling for implementation of anti-rape laws, the president said the fear of Allah and societal embarrassment, existence of law and its implementation and development of culture were key to purge the society of the crime.\nHe said the rape issues were very grave and found everywhere and the parents were also supposed to guide their children about good touch and bad touch.\nPresident Alvi said the law ministry was in process of estimation for setting up special courts for rape cases. The presidency had also held interactive sessions with the NGOs, Ulema and media to urge their role for awareness on the issue.\nTo a question about the opposition’s criticism of tainted accountability, the president said obviously the number of cases against the ruling parties since NAB’s creation would be more than the PTI which had just two-and-half year in rule.\nHe said most of the cases against the opposition leaders were old and said the corruption watchdog should investigate if there was any case against any ruling party member.\nReferring to the report of Transparency International, he said in the world history, it took centuries to fight down the corrupt elite. Similarly, Pakistan would also have to do more to purge the society of corruption, he added.\nTo a question, the president hoped that the government would continue gas supply on discounted rate to industries as consistency of policies was essential for a strong economy.\nHe said some industries had been fully relying on gas supply but the government had asked them to get power connection too as backup.\nAbout the fines imposed on Pakistan in international cases, the president said internationally, people had been objecting to the arbitrators’ judgment in Reko Diq case for imposing a fine by assessing a company’s profit during next thirty years.\nHe said judicial activism had inflicted huge loss to the country like Justice (Retd) Iftikhar Chaudhry’s decision on privatization of Pakistan Steel Mills and Reko Diq case.\nHe agreed to the proposal by the interviewer to withdraw the perks and privileges of Iftikhar Chaudhry,\nbut he said the amount of fine on the country was far bigger than his perks. However, he said it was the political government to take such a decision.",
  "retrievedAt": "2025-08-11T20:19:58.696Z"
}
