{
  "title": "KP CM directs facilitation of legal crush plants, riverbed mining",
  "link": "https://www.app.com.pk/national/kp-cm-directs-facilitation-of-legal-crush-plants-riverbed-mining/",
  "date_published": "2021-02-07T15:39:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 07 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan has directed all concerned authorities to start one-window service for issuance of licenses and no objection certificates (NOCs) to facilitate those who intend to install power crush plants and carry out river bed mining in a legal manner.\nHe issued these directives while chairing a meeting of Minerals and Mineral Development Department here the other day, said an official handout issued here Sunday.\nBeside, provincial ministers, Timur Saleem Jhagra, Akbar Ayub, Sultan Khan, Arif Ahmadzai and Chief Secretary Dr Kazim Niaz, the meeting was attended by concerend administrative secretaries and other relevant high ups.\nThe meeting discussed in details various matters related to regulate and streamline power crush plants, river bed mining and mining in urban and rural set ups with special focus on the effective implementation of rules framed to this end.\nThe meeting was also briefed in detail about various aspects of the proposed River Bed Mining Rules 2021 and it was informed that the proposed rules aimed at protection of rivers, its course and smooth water flow, protection of infrastructure on river beds, conservational mining of sands, gravels and stones to meet construction industry required and effective enforcement to promote safe mining in river beds.\nThe Chief Minister further directed them to ensure the issuance of such licenses and NoCs to the applicants in one week time so that legal river bed mining and power crushing in the province could be encouraged and illegal ones could be discouraged.\nHe has further directed the concerned authorities to work out an effective mechanism to ensure the implementation of safe distance as prescribed in the relevant rules for sand and gravel extraction from river beds and mining near urban and rural population so that losses to human lives and properties could be minimized in floods and other natural calamities.\nStressing the need to make all matters related to power crusher plants and river bed mining more people friendly, the Chief Minister said that by regulating power crusher plants and river bed mining in the province, not only the people associated with the business could be facilitated to the maximum but the losses to human lives and properties could also be minimized in natural calamities as well as natural environment could be preserved.\nA committee comprising of concerned authorities was constituted in the meeting to come up with recommendations for the approval of provincial cabinet to ensure effective implementation of relevant laws and streamline issues related to power crusher plants and river bed mining in the province.",
  "retrievedAt": "2025-08-11T20:19:53.210Z"
}
