{
  "title": "UN Secretary General special message on Human Rights Day",
  "link": "https://www.app.com.pk/national/un-secretary-general-special-message-on-human-rights-day/",
  "date_published": "2022-12-09T10:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 09 (APP):Secretary General United Nations António Guterres said that the world was faced with unprecedented and interlocking challenges to human rights.\nHunger and poverty are increasing–an affront to the economic and social rights of hundreds of millions of people.\nMedia freedom and the safety of journalists are in dangerous decline in almost every region of the world.\nHe said the trust in institutions is evaporating, especially among young people.\nThe COVID-19 pandemic has led to increased levels of violence against women and girls, besides rampant running of racism, intolerance and discrimination, he said in his message on the international Human Rights Day being observed in Pakistan and across the globe on Friday.\nThe UN Secretary General said that new human rights challenges were emerging from the triple planetary crisis of climate change, biodiversity loss and pollution.\nWe are only beginning to grasp the threat posed to human rights by some new technologies.\n“These trying times call for a reignition of our commitment to all human rights-civil, cultural, economic, political and social.\nThe Call to Action I launched in 2020 positions human rights at the centre of solutions to the challenges we face.\nThis vision is reflected in my report on Our Common Agenda, which calls for a renewed social contract, anchored in human rights”.\nThe 75th anniversary of the landmark Universal Declaration on Human Rights next year must be an opportunity for action.\n“I urge Member States, civil society, the private sector and others to put human rights at the heart of efforts to reverse today’s damaging trends.”\nHuman rights are the foundation for human dignity, and the cornerstone of peaceful, inclusive, fair, equal and prosperous societies, the Secretary General said and added that they were unifying force and a rallying cry, and the most fundamental thing we share was our common humanity.\nOn this Human Rights Day, he said we reaffirm the universality and indivisibility of all rights, as we stand up for human rights for all.\nThe world is facing unprecedented and interlocking challenges to human rights, he added.",
  "retrievedAt": "2025-08-11T15:59:31.526Z"
}
