{
  "title": "UNOPS organizes stakeholder consultation on TB, Malaria challenges affecting expansion",
  "link": "https://www.app.com.pk/national/unops-organizes-stakeholder-consultation-on-tb-malaria-challenges-affecting-expansion/",
  "date_published": "2022-12-09T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 9 (APP): United Nations Office for Project Services (UNOPS) Pakistan organized a day-long workshop on the stakeholder consultation on the challenges affecting expansion of Tuberculosis and Malaria responses at the provincial level.\nThe event was attended by senior officials from the Health Departments of the Government of Punjab, KP, Sindh and Balochistan.\nThe participants from the provincial health departments presented their findings, challenges and recommendations specifically in the context of TB and malaria.\nProvincial Disaster Management Authority representatives from all the provinces were also present and gave presentations on the post flood situation in their respective provinces, said a press release by UNOPS.\nIn Pakistan, a high burden of malarial disease has been reported in the provinces of Khyber Pakhtunkhwa, Balochistan and Sindh. Over 30% of live in high-risk zones for malaria. The province of Punjab is also classified as a medium to low-risk region for malaria.\nUnfortunately Pakistan is ranked as 5th in the world for reporting high cases of TB, with an estimated incidence of 263/100,000.\nAnnually, more than 580,000 cases appear, while over 44,000 people lose their lives to the disease.\nMultiDrug Resistant TB poses a great threat to our community with an estimated 27,000 cases reported per year.\nEarlier this year, Pakistan faced devastating floods which affected over 33 million people. As of October 11, over 94 districts were declared as “calamity hit”.\nThe majority were in the provinces of Balochistan, Sindh, and Khyber Pakhtunkhwa.\nA rise in reported malaria cases was also observed after the floods. The provinces of Sindh and Balochistan together account for 78% of all reported confirmed cases of malaria in Pakistan in 2022. Similarly TB diagnosis and treatment was compromised during the floods.\nAccording to the Post-Disaster Needs Assessment (PDNA) the recovery framework lies on a “Whole of Pakistan” approach.\nFaisal Fareed, Director General PDMA Punjab stressed for strong commitment from development partners and Government for developing disaster resilient cities and infrastructure.\nProvincial response to control TB and Malaria is in line with SDG 3 (Good health and well-being) targets and the provincial governments are committed to eliminate these deadly diseases from the country to achieve Sustainable Development Goals by 2030.\nIn the current scenario, stakeholder engagement is crucial for a sustainable and resilient recovery plan for the control of Malaria and TB.\nDr. Muhammad Ilyas, Director General Punjab Health Services in his closing remarks termed the workshop quite useful in better understanding of provincial responses, challenges and way forward to control TB and Malaria.\nHe applauded UNOPS for supporting the Government in arranging this workshop and stressed the need for more such events at the provincial level.\nUNOPS is already working in supporting the Sustainable Development Goals: 3 Good health and well-being, 4 Gender Equality, 6 Clean water and sanitation, 9 Industry Innovation & Infrastructure, 13 Climate action, 16 Peace Justice & Strong Institutions, and it is aligned with the Pakistan Government’s Vision 2025 and the United Nations Sustainable Development Framework for Pakistan 2023-2027.",
  "retrievedAt": "2025-08-11T15:59:27.390Z"
}
