{
  "title": "Rain, thunderstorm cause tripping, faults on multiple feeders: IESCO",
  "author": null,
  "content": "ISLAMABAD, May 18 (APP):Stormy winds, thunderstorm and rain on Sunday evening in jurisdiction of Islamabad Electric Supply Company (IESCO) caused tripping and faults on multiple feeders in various circles of the company.\nAccording to IESCO’s spokesperson, fault and tripping report, multiple feeders went offline due to the storm. Affected areas include Mumtaz Steel, Lohi Bhair, Mira Jafar, H-8 to I-9/4, I-8 Markaz, and Railway Road. Additional outages were reported in the Archer Scheme, Service Road, Chakra, Siam, New Race Course, Range Road, Jhingi Golra, C Block and Jail Park.\nPower supply was also disrupted to feeders in Gulistan Colony, Scheme III, Shahpur, and Askari 14 areas. A total of 42 feeders supplying electricity to the Attock Circle and its surrounding regions have also been affected.\nStrong winds led to the uprooting of trees in several locations, downed power lines, and damage to infrastructure.\nEmergency teams from IESCO’s operations and construction departments are actively working in the field to restore power as swiftly as possible. IESCO Chief Executive Mohammad Naeem Jan is personally overseeing the restoration process from the central control room.\nThe company has urged the public to maintain a safe distance from power lines, poles, transformers, and meters. Consumers are advised to report individual complaints to their local complaint offices or by calling the IESCO helpline at 118.\nThe IESCO management has expressed regret over the inconvenience caused and assures that all possible measures are being taken to restore normal power supply promptly.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:35:32.327Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rain-thunderstorm-cause-tripping-faults-on-multiple-feeders-iesco/",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T17:52:00.000Z"
}
