{
  "title": "Muhammad Ali Swati honored with PSL’s ‘Hamaray Hero’ for bravery, humanitarian service",
  "author": null,
  "content": "ISLAMABAD, May 18 (APP): Muhammad Ali Swati, a young humanitarian from Khyber Pakhtunkhwa’s Mansehra district, has been awarded with the prestigious ‘Hamaray Heroes’ title by the Pakistan Super League (PSL) in recognition of his outstanding bravery during the Battagram cable car and Naran flood rescue operations.\nThe award is part of the league’s initiative to spotlight individuals who have made significant contributions to society beyond cricket, including in fields such as education, health, environment, science, and humanitarian service.\nSwati first earned national acclaim in August 2023, when he played a pivotal role in rescuing schoolchildren trapped in a malfunctioning cable car suspended hundreds of feet above the ground in Battagram. The high-risk mission, broadcast across global media, was hailed as one of the most challenging rescue operations in the country’s history.\nHe later led a large-scale emergency response during the Naran flash floods, where over 700 people were stranded amid rising water and landslides. Swift mobilization of local volunteers and efficient coordination of resources were key to saving lives in the critical early hours.\nThe PSL honour followed a thorough review of Swati’s achievements and growing public support. “It’s not about being a hero,” Swati remarked after receiving the award. “It’s about stepping forward when lives are at risk. Every second counts.”\nSwati has also been acknowledged by ex-Prime Minister Anwaar-ul-Haq Kakar and was conferred with the Fakhre Hazara Award by the Commissioner Hazara Division. More recently, he received the Pride of Khyber Pakhtunkhwa Award by the provincial government in partnership with Metrix Pakistan.\nHe is also a young entrepreneur and founder of Heavens Way Adventure, an eco-tourism company operating in the Kaghan Valley. The organization launched South Asia’s highest and longest zipline, creating local jobs and promoting responsible tourism. Through this platform, he raises awareness about climate change and emergency preparedness.\nSwati continues to focus on training young volunteers and enhancing rescue capabilities in underserved areas.\nSwati’s message remains clear: “Ordinary citizens, if willing and equipped, can make an extraordinary difference”.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:36:07.456Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/muhammad-ali-swati-honored-with-psls-hamaray-hero-for-bravery-humanitarian-service/",
  "dateList": "2025-05-18",
  "date_published": "2025-05-18T07:15:00.000Z"
}
