{
  "article_id": "2025-01-07_1a78dcdcbcd61e14febb4585d3a452b9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/uae-rolls-over-2-billion-debt-for-pakistan-pm-tells-cabinet/",
    "retrieved_at": "2025-08-27T11:27:01.660Z"
  },
  "metadata": {
    "title": "UAE rolls over $2 billion debt for Pakistan: PM tells cabinet",
    "author": null,
    "date_published": "2025-01-07T09:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1057,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 7 (APP): Prime Minister Shehbaz Sharif on Tuesday told the federal cabinet that the United Arab Emirates (UAE) has announced to extend the $2 billion debt that was due to be paid back by Pakistan this month. The prime minister, in his televised opening remarks at the federal cabinet meeting chaired by him, apprised the members of his apositive and constructivea meeting with UAE President Sheikh Mohamed bin Zayed Al Nahyan in Rahim Yar Khan in which they discussed the ways to further strengthen bilateral ties and investment cooperation. He said that as the UAE president emphasised moving swiftly on the investment projects, and also expressed his countryas commitment to enhancing its longstanding partnership with Pakistan. He said in their one-on-one meeting, the UAE president announced to rollover $2 billion debt for which he thanked the visiting dignitary. Prime Minister Shehbaz said that as the national economy was put on a stability course, it required sweating blood to make Pakistan a prosperous nation and regain its lost grandeur. aDue to our collective efforts, the economy is stabilizing. We will continue to work hard with the same commitment and devotion. Time is not far from when we will become a prosperous nation and regain our stature. But this needs a journey of sacrifice, blood, and sweat and nothing short of that,a he remarked. He said that as the program on the homegrown economy has been unveiled, it required measures to reduce the cost of electricity calling it inevitable to improve exports and commerce. He said that he had chaired a meeting last week to mull reducing power prices, with the collaboration of provincial governments, and that a acomprehensivea meeting would be held this week on the subject. Highlighting the significance of SMEs for the national economy, he referred to a recent meeting to complete the SMEDA Board wherein some crucial decisions were also taken. Another meeting on the subject is scheduled to be held on January 15, he added. The prime minister told the cabinet members that the textile exports were on the rise and reiterated an enhanced focus on export-led growth and non-traditional exports. He said that Indonesian President Prabowo Subianto was due in Islamabad this month when the two sides would discuss strengthening and integration of bilateral cooperation. He said the government was formulating an agenda for cooperation in Halal meat and rice exports and the import of edible oil. Coming to a firing incident on a convoy in Lower Kurram injuring the deputy commissioner and others, Prime Minister Shebaz called it an attempt to sabotage the peace agreement. He prayed for the swift recovery of the deputy commissioner and others being treated in Peshawar. He said that the government was working in unison to curb the menace of human smuggling which has led to the death of hundreds of Pakistani citizens besides bringing defame to the country. He said that he was regularly holding meetings on the subject with the Interior Ministry and relevant departments also striving to rid the country of this issue. According to a press release issued by the PM Office, the federal cabinet, upon the recommendation of the Revenue Division, approved declaring the Federal Board of Revenueas (FBR) infrastructure as critical infrastructure under the Prevention of Electronic Crimes Act (PECA) 2016. The objective of this measure is to protect the FBRas highly sensitive data from cyberattacks such as hacking and any unlawful intervention. This step will help further safeguard the sensitive data of the FBR. The federal cabinet, upon the recommendation of the Aviation Division, approved the extension of the temporary operating permits for Fly Dubaias weekly flights from Lahore and Islamabad to Dubai and from Dubai to Lahore and Islamabad. The extension is granted from January 4, 2025, to February 3, 2025. The federal cabinet was briefed by the Ministry of Maritime Affairs regarding public sector imports and exports through the Gwadar Port by 11 federal ministries/divisions from March 2024 onward. The prime minister directed that all relevant ministriesa reports be included in the briefing, and a comprehensive report be submitted. The prime minister also instructed that 60% of all public sector imports and exports should be conducted through Gwadar Port. The federal cabinet was briefed by the Ministry of Information Technology and Telecommunication on the progress of implementing the e-Office system in federal ministries and divisions. The meeting was told that, for the first time, the government was implementing e-Office on such a large scale. It was further explained that, starting January 1, 2025, all communication between federal ministries and divisions will be paperless, with all file movements and correspondence being conducted solely through e-Office. It was also shared that e-Office has been fully implemented in 21 ministries/divisions. The implementation of e-Office will not only save time but also benefit the national exchequer through savings on stationery and fuel. With the introduction of e-Office, the processing time for summaries at the PMas Office has now been reduced to a maximum of just three days. The federal cabinet, upon the recommendation of the Cabinet Division, approved the purchase of refurbished Chromebooks for schools and colleges, granting an exemption under Section 21-A of the Public Procurement Regulatory Authority Ordinance. The prime minister directed that a third-party audit of the purchase be carried out. The federal cabinet approved the signing of a memorandum of understanding (MoU) between the Investment Board and Shandong Ruyi Group of China regarding the establishment of textile parks. The federal cabinet, on the recommendation of the Ministry of Foreign Affairs, approved the signing of a memorandum of understanding (MoU) between the Diplomatic Academy of the Ministry of Foreign Affairs of the Republic of Serbia and the Foreign Service Academy of the Ministry of Foreign Affairs of the Islamic Republic of Pakistan. The federal cabinet was presented with the recommendations of the Cabinet Committee on Private Hajj Operators Court Cases. The committee recommended that the current 46 operators manage the Hajj arrangements for 2025. The committee also suggested that a new Hajj policy be formulated for the upcoming years. The federal cabinet approved the committeeas recommendations and instructed that steps be taken to conclude all pending court cases concerning private Hajj operators. The federal cabinet also validated the decisions made during the Cabinet Committee on Legislative Cases meetings held on December 31, 2024, and January 1, 2025.",
    "summary": "The UAE has rolled over $2 billion in debt for Pakistan, according to Prime Minister Shehbaz Sharif. The prime minister briefed the federal cabinet on various initiatives and progress made in the country's development and economy.",
    "keywords": [
      "UAE",
      "Pakistan",
      "PM Shehbaz Sharif",
      "Bilateral Ties",
      "Investment Cooperation",
      "National Economy",
      "E-Office System"
    ]
  },
  "entities": {
    "people": [
      {
        "name": "Shehbaz Sharif",
        "wikidata_id": "Q23373635",
        "sentiment": "Positive"
      },
      {
        "name": "Prabowo Subianto",
        "wikidata_id": "Q2302583",
        "sentiment": "Neutral"
      }
    ],
    "organizations": [
      {
        "name": "UAE",
        "wikidata_id": "Q1425",
        "sentiment": "Positive"
      },
      {
        "name": "FBR",
        "wikidata_id": null,
        "sentiment": "Neutral"
      },
      {
        "name": "Fly Dubai",
        "wikidata_id": null,
        "sentiment": "Neutral"
      },
      {
        "name": "Gwadar Port",
        "wikidata_id": null,
        "sentiment": "Neutral"
      }
    ],
    "locations": [
      {
        "name": "Pakistan",
        "wikidata_id": "Q2158",
        "sentiment": "Positive"
      },
      {
        "name": "UAE",
        "wikidata_id": "Q1425",
        "sentiment": "Neutral"
      },
      {
        "name": "Lower Kurram",
        "wikidata_id": null,
        "sentiment": "Negative"
      }
    ]
  }
}