{
  "title": "Some progress - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE finalisation of a deal between Pakistan and the IMF on the first Extended Fund Facility programme review and a new arrangement that will enable Islamabad to access additional funds under the Resilience and Sustainability Facility is a much-needed shot in arm for a wobbly economy.\n\nIt should also put an end to speculations engendered by departure of the IMF team without signing the customary staff-level agreement. The statement issued by the IMF mission chief after the staff-level agreement shows that the lender is satisfied with the progress Pakistan has made on the benchmark programme targets.\n\n“Over the past 18 months, Pakistan has made significant progress in restoring macroeconomic stability and rebuilding confidence despite a challenging global environment. While economic growth remains moderate, inflation has declined to its lowest level since 2015, financial conditions have improved, sovereign spreads have narrowed significantly, and external balances are stronger,” the statement elaborates.\n\nIndeed, the previous short-term facility of $3bn and the ongoing 37-month funding programme have helped Pakistan stave off the threat of default and stabilise the economy. But are we on course for long-term recovery? Opinion is divided. The hard-won macroeconomic stability is only a short distance away from a deeper crisis. We have seen the economy make a recovery under the IMF’s oversight many times in the past only to collapse while still in remission due to the impatience for rapid growth.\n\nTherefore, it is more critical than ever to stay the course, as the lender has advised, to build resilience by strengthening public finances, ensuring price stability, rebuilding external buffers and eliminating distortions in support of inclusive and sustained private sector-led growth. This is especially crucial as the downside risks are still elevated. Besides, there are “potential macroeconomic policy slippages — driven by pressures to ease policies”, such as tax discounts for real estate, retailers and other parasitic sectors.\n\nThe government’s failure to broaden the tax base, its proposals to reduce transaction taxes on property and slash retail electricity tariffs seem to have prompted the lender’s warning.\n\nHowever, the macro slippages resulting from erratic policymaking are not the only risk. The need to stick to the reforms agenda becomes even more crucial given the emerging geopolitical shocks to commodity prices, tightening global financial conditions, and rising protectionism in addition to climate-related challenges; these factors could also undermine stability.\n\nAny push to achieve growth before sustainably controlling runaway fiscal deficit, keeping inflation in check, reducing power prices, creating an enabling environment for private investments, and building resilience against climate change challenges may prove counterproductive.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:12:45.531Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900579",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T03:00:19.000Z"
}
