{
  "title": "Women police squads to patrol Punjab markets - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government has formed a squad comprising policewomen for the protection of female shoppers and children visiting prominent markets in different cities and towns of the province ahead of Eid.\n\nOn the direction of Chief Minister Maryam Nawaz, the special ‘Women Police Squad’ will patrol the markets during the peak hours for the protection of women and children.\n\nThe squads will patrol the markets on foot, bicycles and motorbikes and prevent incidents of harassment of women coming for shopping in markets and bazaars and also monitor the activities of anti-social elements, an official handout says.\n\nIt says these squads will also help prevent incidents of mobile phones and wallets snatching and robberies etc.\n\nWomen police squads have started patrolling major commercial centres in Lahore, Rawalpindi, Sialkot, Faisalabad, Gujranwala, Chiniot, Burewala, Vehari, Khanewal and other cities, it says.\n\nBesides, special squads of Dolphin police had also been deployed in Lahore for the protection, and assistance of women and children in the markets and bazaars, it adds.\n\nAs per the handout, Dolphin’s ‘Quick Response Cycle Squad’ teams have been deployed at 65 major commercial centres in Lahore, including DHA Raya Club, Ichhra, Anarkali and Liberty Market.\n\nDolphin bicycle and PRU squad will also be deployed for patrolling, along with the quick response cycle squad, it adds.\n\n“More than 4,000 police personnel will be deployed on special squad duty across Lahore. The friendly unit of Dolphin police will patrol the markets after Iftar till the markets’ closure.The first women police squad has been fully mobilised in Okara as well.”\n\nThe handout quotes the CM as saying that protection of women and children was not only the foremost responsibility of the government, but also of society.\n\n“The protection of women in bazaars and streets will be ensured under any circumstance,” she says.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e4cc3a9284e.jpg",
  "retrievedAt": "2025-08-25T15:29:21.044Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900616/women-police-squads-to-patrol-punjab-markets",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T03:55:06.000Z"
}
