{
  "title": "5 of a family killed, 3 injured as jeep plunges into ravine in KP’s Shangla: officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least five members of a family were killed and three others were critically injured on Thursday when a jeep plunged into a ravine in the Kotkay area of Khyber Pakhtunkhwa’s Shangla district amid slippery conditions and heavy rain, according to officials.\n\nAlpuri Station House Officer (SHO) Mohammad Arif Khan told Dawn.com that a family was heading towards Peshawar to see off one of their relatives to Saudi Arabia.\n\n“When they reached the Kotkay area of Alpuri, their car skidded off the road and plunged into the ravine, resulting in five deaths and three injuries,” Arif said, adding that all eight casualties belonged to the same family.\n\nRasool Khan Sharif, a spokesperson for Rescue 1122, told Dawn.com that after receiving an emergency call, their team reached the location and moved three bodies and five injured to District Headquarters Hospital Alpuri.\n\nAccording to the SHO, two of them succumbed to their injuries on the way to the hospital.\n\nHe said a total of five were dead and three were injured in the incident, and the cause of the fatal accident seemed to be heavy rain and a slippery road.\n\nSHO Khan said that the family hailed from the Pishlor area of Martung Tehsil.\n\nHe identified the deceased as Mohammad Salman, Rehmatullah, Amir Sohail, Mohammad Faisal and Afzal Khan.\n\nHe said he was present at the district headquarters hospital and making arrangements to dispatch the bodies to Pishlor while the injured were taken to Swat’s Saidu Teaching Hopsital as their condition was critical.\n\nEarlier this month, Awami National Party (ANP) provincial deputy general secretary Mutawakil Khan was killed in a road accident and laid to rest at his ancestral graveyard in Barkana, Shahpur.\n\nHis funeral was attended by Federal Minister for Kashmir and Gilgit-Baltistan Affairs Amir Muqam, ANP provincial president Mian Iftikhar Hussain, ANP secretary general Saleem Khan, local leaders of PPP and other political parties, civil society and people from all walks of life.\n\nOfficials at the Karora police station said he was going home in a jeep after offering condolences to relatives of a deceased person when the vehicle’s brakes failed and it fell into a ravine in Sangrai area of Shangla. As a result, Mutawakil died on the spot.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/27210134ffa6aeb.jpg",
  "retrievedAt": "2025-08-25T15:29:18.204Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900681/5-of-a-family-killed-3-injured-as-jeep-plunges-into-ravine-in-kps-shangla-officials",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T17:54:33.000Z"
}
