{
  "title": "Govt has second thoughts on changes to solar policy - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After attracting flak for its move to reduce the buyback rate from Rs27 to Rs10 per unit, the government has decided to revisit its solar net metering policy by taking all stakeholders on board.\n\nIn the weekly cabinet meeting, chaired by Prime Minister Shehbaz Sharif on Wednesday, the federal cabinet decided to broaden the scope of consultations on solar net metering regulations recently approved by the Economic Coordination Committee (ECC) and asked for the recommendations to be re-submitted to the forum following feedback from all stakeholders.\n\nThe decision to review the changes to net metering regulations was taken amid strong reaction from consumers and the traders, who called out the government for its knee-jerk reaction to the growth of renewable energy.\n\nHowever, the government later clarified that the promotion of renewable energy was its top priority. The PM had also directed officials to address “confusion” surrounding the net metering policy through facts and figures.\n\nCabinet seeks new recommendations for changes to net metering policy after incorporating feedback from stakeholders\n\n“There is no change in the government’s solar energy policy and priority,” he had said.\n\nUnder the proposed chan­ges approved by the ECC earlier this month, power companies would purchase surplus solar electricity from consumers at Rs10 per unit during the day while selling grid electricity at Rs42 per unit (off-peak) and Rs48 per unit (peak) after sunset — excluding taxes and duties.\n\nAdditionally, consumers would no longer be allowed to install solar capacity exceeding their sanctioned load, except for a 10 per cent cushion, compared to the 50 per cent margin permitted under the previous policy. Existing consumers would gradually come under this new framework as their seven-year contracts expired.\n\nPower relief\n\nThe cabinet also decided to provide relief to power consumers after the government saved money by renegotiating its agreements with the Independent Power Producers and through the “cushion arising out of changes in international oil prices and other measures”.\n\nThe PM Office announced on March 15 that the premier had decided to maintain petroleum prices at the existing level against upto a Rs13 per litre cut, worked out by the oil regulator and the petroleum division.\n\nIt promised to transfer the financial impact to electricity consumers and the prime minister was supposed to announce this relief in his March 23 speech. However, the staff-level agreement with the International Monetary Fund had not been reached by that time, forcing him to put off the announcement.\n\nNow that the agreement with the IMF has been reached, the government will move to cut power tariffs. The quantum of the tariff cut approved by the federal cabinet was not publicly shared by the PM’s Office, but estimates suggest that a significant relief is expected, which will be announced by the premier in the next few days.\n\nDuring review talks with the IMF, a plan was shared with the staff mission for about Rs2 per unit tariff reduction on account of some savings through the renegotiation of contracts with the Independent Power Producers.\n\nAs an afterthought, the authorities were tempted to increase the petroleum levy on petrol and diesel by Rs10 to a maximum of Rs70 permissible under the Finance Act 2025 to divert the revenues towards maximising relief in power tariffs. This can have another impact of about Rs2-2.50 per unit.\n\nMeanwhile, the federal cabinet also permitted the Central Power Purchasing Agency to enter into new contracts with those IPPs that run on bagasse.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:29:22.356Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900571#:~:text=The%20cabinet%20also%20decided%20to%20provide%20relief%20to%20power%20consumers",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T01:12:56.000Z"
}
