{
  "title": "South Korea wildfires ‘largest on record’: disaster chief - World - DAWN.COM",
  "author": null,
  "content": "Wildfires in South Korea are now the largest and deadliest on record, having burned more forest and killed more people than any previous blaze, officials said on Thursday, as the death toll hit 27.\n\nMore than a dozen fires broke out over the weekend, scorching wide swathes of the southeast and forcing around 37,000 people to flee, with the fire cutting off roads and downing communications lines as residents escaped in panic.\n\nSouth Korea’s Ministry of Interior and Safety said that 27 people had been killed and dozens more injured, with the toll likely to rise. It is the highest number of deaths since the Korea Forest Service started records for wildfires in 1987.\n\nMore than 35,000 hectares (86,500 acres) of forest have been burned, Lee Han-kyung, disaster and safety division chief said, adding that the fire was still spreading “rapidly”.\n\n“I don’t know how to describe it. My heart feels like it’s going to burst even now speaking about it,” said Kim Mi-ja, an 84-year-old Andong resident whose home was burnt down.\n\nThe extent of damage makes it South Korea’s largest-ever wildfire, after an inferno in April 2000 that scorched 23,913 hectares across the east coast.\n\nAuthorities said changing wind patterns and dry weather had revealed the limitations of conventional firefighting methods.\n\n“I didn’t have the strength to put the fire out,” said resident Lee Sung-gu. “I didn’t have the courage to do it, I could only just watch,” the 79-year-old told AFP, describing how all houses in the area were destroyed.\n\nMany of those killed were residents — in particular the elderly.\n\nAt least three firefighters were killed, and a pilot in a firefighting helicopter died when his aircraft crashed in a mountain area, officials said.\n\nLast year was South Korea’s hottest year on record, although temperatures in the months running up to the blaze had been colder than last year, and in line with the country’s 30-year average, Korea Meteorological Administration data shows.\n\nBut the fire-hit region had been experiencing unusually dry weather with below-average precipitation, authorities said.\n\n“This wildfire has once again exposed the harsh reality of a climate crisis unlike anything we’ve experienced before,” disaster chief Lee said.\n\n“The affected areas have seen only half the average rainfall, coupled with unusually strong winds, which have drastically accelerated the spread of the fire and intensified the damage,” he said.\n\nSome types of extreme weather have a well-established link with climate change, such as heat waves or heavy rainfall.\n\nOther phenomena, such as forest fires, droughts, snowstorms and tropical storms can result from a combination of complex factors.\n\nYeh Sang-Wook, professor of climatology at Seoul’s Hanyang University, told AFP that the lack of rainfall had dried out the land “creating favourable conditions for wildfires”.\n\n“We can’t say that it’s only due to climate change, but climate change is directly [and] indirectly affecting the changes we are experiencing now. This is a sheer fact.”\n\nBut another expert, Professor Hong Suk-hwan at Pusan National University’s Department of Landscape Architecture, said the country’s forest management practices also took some blame.\n\nSouth Korea has prioritised the preservation of large pine trees — packed with oily resin — above allowing a variety of deciduous trees to thrive, he said.\n\n“If a fire breaks out, would it spread more easily on wet paper or on dry paper soaked in oil? Our forests are essentially covered in oil-soaked paper, creating an environment where wildfires can spread at an alarming speed,” he told AFP.\n\nWere South Korea to have cultivated more deciduous trees in a natural mixed forest it “would slow wildfire spread and prevent it from escalating”.\n\nA 200-year-old pine tree at Bongjeongsa temple in Andong — the oldest wooden structure in South Korea and a Unesco-listed site — was cut down in a bid to preserve the temple itself.\n\n“We had no choice but to cut it down … The fire is spreading rapidly from one pine tree to another,” the chief monk said.\n\nAt Unesco-listed Byeongsan Seowon, a former Confucian academy, AFP reporters saw a hazy sky, with fire trucks spraying water and fire retardants onto the historic site in a desperate bid to save it.\n\n“We are spraying three tonnes of water every day,” Lee Seung-myung from the Andong Fire Department told AFP.\n\nChoi Young-ho, a firefighter at the heritage site, said that they were at the mercy of the wind. “If there is a strong wind, it will carry flames from afar — a very worrisome situation,” he said.\n\nRain is forecast for late on Thursday, potentially giving authorities a much-needed window to extinguish the blazes.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/27195754eecdc54.jpg",
  "retrievedAt": "2025-08-25T15:29:18.276Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900679/south-korea-wildfires-largest-on-record-disaster-chief",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T15:08:21.000Z"
}
