{
  "title": "Economic growth almost steady in second quarter - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The country’s economy has shown a slow revival, with a modest growth of 1.73 per cent in the second quarter of the current fiscal year (October-December), marking a slight decline from the 1.77pc recorded during the same period last year.\n\nThe coalition government led by the PML-N claims that the economy is on the path to recovery. However, the figures from the second quarter reveal a contrasting narrative when compared to the growth achieved under the caretaker government last year, according to data released by the National Accounts Committee (NAC) on Wednesday.\n\nThe modest quarterly growth was primarily driven by a 2.57pc increase in the services sector and 1.10pc in agriculture. However, the industrial sector contracted by 0.18pc, which dragged down the overall economic performance.\n\nThe State Bank of Pakistan expects GDP growth to remain in the upper half of the 2.5-3.5pc range for FY25, while the IMF forecasts a growth rate of 3.2pc. The Asian Development Bank has recently revised its forecast for Pakistan’s GDP growth, raising it to 3pc from the previous estimate of 2.8pc.\n\nIndustrial sector contraction drags down overall performance\n\nThe 112th meeting of the NAC, chaired by the Planning Commission secretary, took place on Wednesday at the Pakistan Bureau of Statistics headquarters. The meeting approved the revised growth rate of GDP during Q1 at 1.34pc, compared to the previously estimated 0.92pc, and the provisional growth rate for Q2 of FY25.\n\nAgriculture\n\nDuring the second quarter of FY25, the agriculture sector experienced a modest growth rate of 1.10pc, a significant decline from the 5.80pc recorded in the same period the previous year.\n\nThe deceleration in the agriculture sector can be attributed mainly to negative growth in key crops such as cotton, rice, and maize. Cotton production saw a substantial decline of 30.7pc, with this year’s output recorded at 7.084 million bales, compared to 10.22m bales the previous year.\n\nRice production dropped by 1.4pc, totaling 9.72m tonnes, down from 9.86m tonnes the previous year. Similarly, maize production decreased by 15.4pc, with output falling to 8.24m tonnes from 9.74m tonnes the previous year.\n\nThe latest revised estimates indicate a 2.3pc decrease in sugarcane production, totaling 85.62m tonnes, down from 87.64m tonnes last year. The wheat area dropped by 6.8pc from last year, despite having no impact in Q1. Potatoes saw a 14.2pc increase, while other crops grew by 0.73pc.\n\nCotton ginning and miscellaneous components showed growth in FY24 due to excellent cotton output, but they declined in FY25 due to poor cotton production.\n\nLivestock grew by 6.51pc due to a low base of 2.96pc in Q2 last year, along with a drop in intermediate consumption of dry fodder (-6.7pc) and green fodder (-1.68pc). Due to expected productivity drops in Khyber Pakhtunkhwa, forestry has declined, while fishing has grown.\n\nIndustry\n\nIn the second quarter, the industrial sector, similar to Q1, experienced a decline, registering a negative growth of 0.18pc compared to the same period last year.\n\nThe mining and quarrying sector saw a decline of 3.29pc, attributed to reduced production in gas (down by 6.16pc), oil (down by 11.4pc), and coal (down by 6.34pc), among others.\n\nLarge-scale manufacturing experienced a decline of 2.86pc in Q2. The downturn is linked to poor performance in sectors such as sugar (-12.63pc), cement (-1.82pc), and iron & steel (-17.86pc), among others.\n\nThe small-scale sector and slaughtering operations experienced steady growth. The electricity, gas, and water supply sector showed notable growth of 7.71pC, driven by an uptick in gas industry output. The construction sector experienced a downturn of 7.14pc in Q2, attributed to reductions in cement production and iron and steel output.\n\nServices\n\nThe services industry showed a growth of 2.43pc in Q2 of FY25. A closer analysis of the industry reveals mixed trends.\n\nWholesale and retail trade recorded a negative growth of 1.13pc due to a decline in large-scale manufacturing output (-1.5pc) and imports (-3.5pc). The transport and storage industry increased by 1.15pc, reflecting growth in road transport, air transport and water transport.\n\nThe information and communication sector exhibited significant growth of 8.45pc, driven by an increase in mobile company outputs, a decline in inflation, and a low base effect.\n\nSimilarly, the finance and insurance industry grew by 10.21pc, public administration and social security grew by 9.10pc, and public sector education also showed improvement. Human health and social work grew by 6.60pc, and other private services grew by 3.14pc in Q2.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:13:47.930Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900589/economic-growth-almost-steady-in-second-quarter",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T03:15:42.000Z"
}
