{
  "title": "3 dead, 21 injured in blast near police vehicle in Quetta market - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three people were killed and 21 others injured after an explosion occurred near a police vehicle in the Barech Market area on Quetta’s Double Road, officials said.\n\nThe incident comes as Balochistan faces a spate of attacks targeting the police and security forces, and in some cases, civilians hailing from Punjab.\n\nPolice surgeon Dr Ayesha Faiz told Dawn.com, “Three bodies were moved to the Civil Hospital, while 21 people had been injured in the blast.”\n\n“Four of the injured are in critical condition, while four policemen are among the wounded,” she added.\n\nConfirming the deaths, Balochistan’s health department spokesperson Dr Waseem Baig said, “The injured have been moved to the trauma centre at Civil Hospital.”\n\nBalochistan Government Spokesperson Shahid Rind said in a statement that the explosion occurred near a police vehicle, adding that the nature of the blast was being determined.\n\nVideo footage circulating on social media, verified by Dawn.com, showed a crowd of people gathering at the scene of the blast, with the flaming wreckage of a motorcycle next to a charred police pickup truck. A damaged Suzuki Alto can also be seen in the frame.\n\nA man was also seen pulling the burning wreckage of the motorcycle away from the vehicle in the video, while sirens could be heard in the background.\n\nNo group has so far claimed responsibility for the blast.\n\nPrime Minister Shehbaz Sharif issued a statement condemning the Quetta blast in the strongest terms.\n\nAccording to the statement, shared by state broadcaster PTV on X, the PM expressed grief and offered prayers for the families of the deceased and injured. He also ordered that authorities “immediately investigate the incident, identify those responsible and bring them to justice”.\n\n“The elements spreading hatred in Balochistan are the enemies of development in Balochistan,” PM Shehbaz was quoted as saying. “We will never allow the evil intentions of miscreants to succeed.”\n\nThe statement added that the PM would “continue the war against the scourge of terrorism until it is completely eradicated from the country”.\n\nPresident Asif Ali Zardari condemned the blast and expressed “deep sorrow and regret over the precious loss of lives in the blast”, according to a statement issued by the PPP.\n\n“Such reprehensible actions during the blessed month of Ramadan reflect the sinister motives of terrorists,” the president was quoted as saying. The statement added that President Zardari was “praying for the speedy recovery of the injured”.\n\nInterior Minister Mohsin Naqvi condemned the blast in a statement from his office, expressing sorrow over the death of the two people who lost their lives.\n\n“We equally share in the grief of the families of the deceased,” Naqvi was quoted as saying.\n\n“The forces of the enemy are targeting Balochistan. We will thwart this heinous conspiracy meant to create instability,” the post added.\n\nLast week, a member of the Anti-Terrorist Force (ATF) was martyred and six others were injured —three of them critically— when a roadside bomb targeted a police vehicle on Quetta’s Brewery Road.\n\nThe security situation in Balochistan has deteriorated over the last few months, with separatist militants frequently attacking police and armed forces personnel.\n\nThe outlawed Balochistan Liberation Army (BLA), in particular, has adopted new tactics to cause higher casualties and directly target Pakistani security forces.\n\nLast year, the Interior Ministry noted a “significant rise in terrorism incidents and evolving terrorism patterns” since the Afghan Taliban seized control of Kabul in August 2021, especially in the Tehreek-i-Taliban Pakistan’s activities in KP, the Baloch nationalist insurgency in Balochistan, and ethno-nationalist violence in Sindh.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/27152204390c2fa.png",
  "retrievedAt": "2025-08-25T15:29:20.728Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900656/3-dead-21-injured-in-blast-near-police-vehicle-in-quetta-market",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T10:14:36.000Z"
}
