{
  "title": "Pakistan need time to make new approach work, says Salman - Sport - DAWN.COM",
  "author": null,
  "content": "WELLINGTON: Pakistan are looking to play white-ball cricket with a new approach and it will take some time before they start reaping the benefits of it, the team’s Twenty20 International captain Salman Ali Agha has said.\n\nSalman led an inexperienced side — barring the likes of a few seniors — against New Zealand in the five-match series, which ended with Pakistan’s eight-wicket loss in the final fixture on Wednesday.\n\nSalman and co. managed to win only one of the five matches, taking the third T20I by nine wickets, as the side chased down 205 with four overs to spare, thanks to young opener Hasan Nawaz’s blistering century.\n\nBut the ultra-attacking style of play did not work in the remaining fixtures as a second-string New Zealand team dominated throughout. Salman said the conditions were challenging for his young players, whom he expected to learn from their experiences.\n\n“The kind of cricket we are playing is fearless, but the key is to use our minds wisely with that fearless approach,” he told reporters after the match on Wednesday. “These are youngsters, and they’ll learn and gain experience.\n\n“We’re introducing a new way of playing cricket in Pakistan, and it will take some time, but we’ll back these youngsters.\n\nThe Pakistan batters failed to negotiate with the seam and bounce on offer on the New Zealand surfaces, which Salman observed were new for his subordinates.\n\n“… the conditions in New Zealand are challenging,” he said. “Any team from Asia that comes here struggles. These conditions take time to get used to, and you’ll see as the matches progress, the boys have started performing better.\n\n“But if you arrive just a couple of days before the match and play, there’s not enough time to adjust to these conditions.”\n\nFailing in New Zealand conditions may not be a point of concern for Pakistan, who Salman said had their sights on the upcoming Asia Cup and next year’s T20 World Cup.\n\n“… the goal is the Asia Cup and the World Cup,” the batter noted. “This series is helping us achieve that goal. Any upcoming series, we’ll use them for combination building or giving experience to the new players.”\n\nSalman believed that his young team will come good in both tournaments, with the T20 World Cup set to be held in India and Sri Lanka.\n\n“Bowling or batting in these conditions is tough,” said the all-rounder. “These are the same youngsters who, in the future, will give good performances for Pakistan.\n\n“This is a learning experience for them. If they learn from this, they will find it much easier in our home conditions.”\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:29:46.527Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900540/pakistan-need-time-to-make-new-approach-work-says-salman",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T01:13:21.000Z"
}
