{
  "title": "Bahawalnagar man gets life term for stepdaughter’s rape - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALNAGAR: A sessions court has sentenced a man to life imprisonment in a case pertaining to the rape of his stepdaughter in Haroonabad.\n\nA case was registered against the convict, Khubaib Abid of Qamarpura, on June 21, 2024, under Section 376 of the Pakistan Penal Code (PPC).\n\nAccording to the FIR lodged at Haroonabad city police station by the rape survivor’s mother, after her divorce she contracted second marriage with the convict around 12 years ago.\n\nShe said that she had a 15-year-old daughter from her first marriage, who lived with her.\n\nShe said on June 18, 2024, her second husband raped her daughter when she was away.\n\nHaroonabad Additional District and Sessions Judge, Special Anti-rape Court, Khizar Hayat Minhas, after recording evidence and hearing arguments from both sides, announced a guilty verdict against Khubaib.\n\nThe court also slapped Rs100,000 fine on the convict, to be paid to the victim, and ruled that in case of default on payment of fine, he shall serve an additional six-month imprisonment.\n\nCAPITAL PUNISHMENT: A sessions court on Wednesday handed down death sentence to a man in a murder case.\n\nThe convict, Mukhtiar, was found guilty of killing his brother-in-law Umar Farooq, an official at the district headquarters hospital, over a petty dispute at his house in Ghalla Mandi area about five months ago.\n\nAdditional District and Sessions Judge Ghulam Shabbir Gill read out the conviction order after recording evidence of witnesses and hearing concluding arguments from both sides.\n\nThe court also directed the convict to pay Rs1 million as compensation to the heirs of the murdered man.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:13:45.764Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900596/bahawalnagar-man-gets-life-term-for-stepdaughters-rape",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T03:23:08.000Z"
}
