{
  "title": "Armaghan earned Rs17bn through phishing scams in three years, NA body told - Pakistan - DAWN.COM",
  "author": null,
  "content": "• MNAs question police performance in Mustafa Amir murder probe\n• Ask ANF what action it has taken against courier services said to be involved in supplying drugs\n\nKARACHI: Armaghan Qureshi, the prime suspect in the Mustafa Amir murder case, had run phishing scams through his illegal call centre and made Rs17 billion over a period of three years, officials told members of a National Assembly committee on Wednesday.\n\nThe second meeting of the Sub-Committee of the NA’s Standing Committee on Interior was held at the Central Police Office (CPO) under the chairmanship of MNA Abdul Qadir Patel.\n\nCommittee members MNAs Syed Rafiullah, Nabeel Gabol and Khawaja Izharul Hassan, Inspector General of Police Ghulam Nabi Memon, city police chief, senior interior ministry officials and representatives of the Anti-Narcotics Force (ANF), Federal Investigation Agency (FIA), Excise Department and others attended the meeting.\n\nThey were given a detailed briefing on the murder case of Mustafa Amir, suspect’s alleged links to drug gangs, the role of police and other law enforcement agencies.\n\nMedia was not allowed to cover the proceedings of the committee.\n\nOfficial sources told Dawn that an FIA representative briefed the committee on the financial crimes committed by the suspect.\n\nHe informed the meeting participants that the suspect had been running an illegal call centre for the last three years and had earned Rs17bn during this period.\n\nHe said that the money was deposited in 40 bank accounts, which were opened in the names of his employees.\n\nRegarding his modus operandi, the official said that the suspect and his employees contacted foreign nationals over the phone, posing themselves as officials of American agencies. They deceitfully obtained information of their credit cards to steal their money.\n\nRegarding the recovery of a large number of laptops from the suspect’s home, the meeting was informed that the laptops did not contain “specific data” used by his employees; however, “all relevant specific data” had been obtained from the laptop used by Armaghan.\n\nThe committee members asked the FIA to submit a list of all call centres in Karachi at the next meeting.\n\nConcerns over law enforcers’ unsatisfactory performance\n\nThe committee members expressed concerns over the less-than-satisfactory performance of the police on several issues, including delays in the case, the raid on the suspect’s house, the case of a girl who was subjected to torture by the suspect and the failure to record his “confessional statement”.\n\nThe legislators also raised concerns about the alleged involvement of courier services in the supply of narcotics and wondered what action had been taken against them.\n\nIn response, an ANF official informed them that a report would be submitted in the next meeting.\n\nThe legislators also asked what action had been taken against an uncle of the suspect who is a serving police officer. They expressed surprise at how a lone individual had engaged the police for three hours during the raid.\n\nRegarding the torture on the girl, the police replied that she was tortured by the suspect, received treatment at a private hospital in DHA, but did not visit the Jinnah Postgraduate Medical Centre for a medical check-up or report to the police as she did not want to pursue the case.\n\nRegarding the presence of many weapons in the custody of the suspect, the police believed they were purchased online.\n\nAs for the “confessional statement,” the police contended that the accused had not “deviated” from his confession, but it would be presented as “evidence” in court. Moreover, the police argued that the accused had admitted to his “act.”\n\nA source privy to the meeting said that when a police officer claimed that a crackdown had been launched against narcotics, resulting in the sale of weed being stopped, Lyari MNA Nabeel Gabol intervened by asking the officer to accompany him and see that narcotics were still easily available in Lyari.\n\nThe legislators asked the excise department to enhance their capacity and increase recruitment to control the business of narcotics. They also asked it to submit a list of high-end vehicles of the suspect.\n\nA third and conclusive meeting of the NA body would be held after Eid.\n\nMeanwhile, a spokesperson for the IGP said in a statement that the committee members appreciated the joint work, collecting concrete evidence and the investigation progress by the police and other law enforcement agencies.\n\nThe lawmakers directed for completing the work on Mustafa Amir Murder case and submitting its report to the NA while saying that its findings would be shared with the media.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:29:34.924Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900522/armaghan-earned-rs17bn-through-phishing-scams-in-three-years-na-body-told",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T01:13:36.000Z"
}
