{
  "title": "Amnesty urges Pakistan not to expel Afghans - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As the returns and deportations of Afghans decreased significantly in March, mainly due to the border closure, Amnesty International has called on Pakistan to withdraw the opaque ‘illegal foreigners’ repatriation plan targeting Afghan refugees.\n\nIn a statement issued on Wednesday, Amnesty, ahead of the March 31 deadline, said that the “arbitrarily and forcibly expelling Afghan nationals, including refugees and asylum seekers, will only add to their plight”.\n\n“The Pakistani government’s unyielding and cruel deadline, which is less than a week away, to remove Afghan refugees and asylum seekers from two major cities, resulting in the deportation of many at risk, shows little respect for international human rights law, particularly the principle of non-refoulement,” Amnesty says in a strong-worded statement.\n\nThe exact content of the Pakistan government’s ‘Illegal Foreigners Repatriation Plan’ used for deportations has never been made public, but it comes amid a campaign to wrongfully demonise Afghan nationals as so-called criminals and terrorists.\n\nRights watchdog says repatriation plan for ‘illegal foreigners’ shows little respect for international law\n\n“The opaque orders contravene the government’s own promises and repeated calls by human rights organisations to uphold the rights of Afghan refugees and asylum seekers,” said deputy regional director for South Asia at Amnesty International, Isabelle Lassee.\n\n“It is disingenuous to frame Afghan refugees as a menace to the cities of Islamabad and Rawalpindi. The Government of Pakistan is only making a scapegoat of a community that has long been disenfranchised and fleeing persecution,” she said.\n\nSpeaking to Amnesty, human rights lawyer Moniza Kakar pointed out that forcing Afghan refugees to relocate even within Pakistan is devastating for families. “Many PoR card holders are people who’ve been here for decades, asking them to relocate means you’re asking them to leave homes, businesses, communities and lives they’ve built for years,” she said.\n\nMeanwhile, Afghan Citizen Card (ACC) holders are to be immediately and unlawfully deported to Afghanistan, along with other undocumented refugees and asylum seekers, in violation of the principle of non-refoulement as set out in international human rights law. Afghan refugees due to be resettled in a third country will also be moved outside the cities, far from foreign missions who had promised visas and travel documents, and risk deportation due to the increased difficulty in coordinating their relocation with missions such as the US.\n\nLawyer Umer Gillani, who has challenged the government’s decision to deport refugees at the Supreme Court and Islamabad High Court, said that “the official notification [for the 31 March deadline] has not been issued under any particular law, it is just an executive instruction. This is not just against fundamental rights, but also against plain black letter law.”\n\nSeparately, the International Organisation for Migration (IOM) has said that both returns and deportations of Afghans decreased significantly during the first fortnight of March.\n\nAs recorded in the data collection period for March 1-15, the decrease was 67 per cent in returns and 50 per cent in deportation, compared to the previous reporting period of February 16-28.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:13:03.258Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900544/amnesty-urges-pakistan-not-to-expel-afghans",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T01:13:03.000Z"
}
