{
  "title": "Rail services to & from Balochistan restart today - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Train services betw­een Quetta and the rest of the country will be restored from today (Thursday).\n\nThe announcement was made by Railways Minister Hanif Abbasi during a press conference on Wednesday.\n\nRail services were suspended after the hijacking of the Pesha­war-bound Jaffar Express in the Mashkaf area, earlier this month.\n\nMr Abbasi said the Jaffar Express would leave Peshawar on March 27, and depart from Quetta for its destination the next day. A special Eid train will also leave for Peshawar on March 29.\n\nThe minister was on a visit to Quetta along with Railways Chairman Mazhar Shah, ECO Amir Baloch and DS Quetta Imran Hayat.\n\nMr Abbasi also annou­nced that Bolan Mail, which ran twice a week between Quetta and Kara­chi, would operate on a daily basis, adding that all nine trains connecting Balochistan with the rest of the country will also be restored.\n\nHe said there were some security issues on train stations, but Pakistan Railways was taking steps to ensure safe journey.\n\nHe announced plans to recruit 500 personnel into railways police to strengthen security, adding that 70 per cent of the new appointments would be made from Balochistan in the first phase, while in the second phase 1,000 more people would be inducted into the force.\n\nReferring to the Jaffar Express incident, he said, “It was a big tragedy, which was condemned across the world.”\n\nMr Abbasi said, “We know Baloch are not against Punjab and the people of Punjab. Just a few elements have spread hatred. The politics of hatred will never succeed.”\n\nHe stated that no railway official was involved in terrorism or facilitating the terrorists, adding that railway police and other employees had sacrificed their lives in line of duty.\n\nHe said that the family of the railway policeman, who laid down his life while protecting passengers, would be paid Rs5.2 million as compensation.\n\nHe also said that efforts were underway to make security system more effective.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e4a10635632.jpg",
  "retrievedAt": "2025-10-12T02:13:02.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900566/rail-services-to-from-balochistan-restart-today",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T01:13:10.000Z"
}
