{
  "title": "Houthis say US carried out 19 strikes in Yemen - World - DAWN.COM",
  "author": null,
  "content": "SANAA: Houthi media said on Wednesday 19 strikes had hit rebel-held parts of Yemen, mostly Saada, blaming the United States, with the group later announcing they targeted a US warship and Israel.\n\nAl-Masirah TV reported that “the US aggression launched 17 raids on the Saada governorate during the night”, and earlier said two raids hit Amran.\n\nSaba, an Iran-backed news agency, said “the American aggression targeted the Oncology Hospital building in Saada”.\n\nThe hospital, which Houthi media said was under construction, was also hit last week.\n\nThe rebel health ministry said two civilians were wounded in the latest hospital attack, which they described as “a full-fledged war crime”.\n\nEarlier on Wednesday, a Houthi military spokesperson said the group targeted “enemy warships in the Red Sea, led by the US aircraft carrier Truman” blamed for the Yemen strikes.\n\nThe Houthis also claimed a drone attack on Tel Aviv, but did not specify when it occurred. Israel did not report such an attack.\n\nWashington announced a military offensive against the Houthis on March 15, promising to use overwhelming force until the group stopped firing on vessels in the key shipping routes of the Red Sea and Gulf of Aden.\n\nThat day saw a wave of US air strikes that officials said killed senior Houthi leaders, and which the Houthis said killed 53 people.\n\nSince then, Houthi-held parts of Yemen have witnessed near-daily attacks that the group has blamed on the United States, with the fighters announcing the targeting of US military ships and Israel.\n\nThe Houthis began targeting shipping vessels after the start of the Gaza conflict in Oct 2023, claiming solidarity with Palestinians, but paused their campaign when a ceasefire took effect in Gaza in January.\n\nEarlier this month, they threatened to renew attacks in the vital maritime trade route over Israel’s aid blockade on the Palestinian territory, triggering the first US strikes on Yemen since President Donald Trump took office in January.\n\nLast week, Trump threatened to annihilate the Houthis and warned Tehran against “continuing to aid the group”.\n\nPublished in Dawn, March 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/27103258439290a.jpg",
  "retrievedAt": "2025-08-25T15:29:35.950Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900554/houthis-say-us-carried-out-19-strikes-in-yemen",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T01:13:28.000Z"
}
