{
  "title": "HRCP, civil society urge govt to immediately address ‘human rights crises’ afflicting country - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Human Rights Commission of Pakistan (HRCP) and other civil society groups on Thursday urged the government to immediately address the prevalent “human rights crises” affecting the country, including the clampdowns on protesters and the misuse of blasphemy and cybercrime laws.\n\nThe demand came amid a recent crackdown on protesters of the Baloch Yakjehti Committee (BYC) demonstrating against enforced disappearances and arrests of its leadership in Karachi and Quetta, as well as a spate of other human rights issues from the targeting of journalists to an uptick in cases under the Prevention of Electronic Crimes Act, 2016, and blasphemy laws.\n\nThe HRCP and other civil society and rights groups held a press conference at the Karachi Press Club today to bring attention to the issues and called on the federal and provincial governments to urgently address the “multiple human rights crises across the country”, according to a press release issued after the media talk.\n\n“Increasing state authoritarianism, suppression of dissent by force, restrictions on press freedom and the rapidly growing influence of the establishment over governance have led to widespread discontent.”\n\n“The short-term enforced disappearance of journalists and rights activists is now significant cause for alarm,” the press release said.\n\nIt added that the establishment’s alleged role in politics had “snowballed at the cost of democratic governance” while allegations of political interference in the judiciary had also shaken public confidence in the legal system.\n\n“Religious extremism continues to be weaponised against marginalised groups, particularly in Punjab against the Ahmadi community. The growing influence of militants in Pakistan’s border regions, especially in Khyber Pakhtunkhwa, has left ordinary people increasingly vulnerable to violence and extortion, creating a climate of constant fear.\n\nIt said that in Balochistan, what began as a “struggle for fundamental rights” is now being labelled “terrorism” by the state.\n\n“Rather than initiating a political dialogue with stakeholders in the province, the authorities have continued to use disproportionate force against protestors, resorting to mass arrests.\n\n“At the same time, militant groups have begun to target civilians with alarming frequency. In Sindh, protests against the controversial construction of canals on the Indus have intensified, given that any such move would be a direct assault on people’s environmental rights,” the joint statement said.\n\nIt noted that both the federal government and political opposition had yet been unable to reach a “sorely needed consensus” on the country’s future and parliament’s role had receded, with laws passed “hastily and without deliberation”.\n\nIt pointed out that continued inflation, youth unemployment and labour rights violations remained rampant as minimum wage laws were not enforced, pensioners were denied their dues and employees in both the public and private sectors contended with delayed salaries.\n\nThe groups jointly demanded a political solution to the Balochistan crisis with an end to enforced disappearances and the unconditional release of all those detained after the recent protests.\n\nThey also called for the abolition of “oppressive laws”, including Peca, and a rollback of policies restricting civil liberties.\n\nAmong their other demands, the groups said there should be an immediate halt to the construction of canals on the Indus River and instead there should be a transparent water use policy that reflected the will of the people; there should be an end to “corporate land grabbing in the guise of ‘agricultural development’” and there should be the redistribution of government-owned land to landless farmers in Sindh and other regions.\n\nDuring the press conference, HRCP Chairperson Asad Iqbal Butt raised the issue of minimum wages as well and blamed inflation for the lack of law and order in the country.\n\nRiaz Shaikh, dean of arts at Szabist University, expressed grave concern about universities in Balochistan allegedly being forced to arrange anti-militant protests after the Jaffer Express attack, saying that such coercion would “create the foundations of hate and resentment” in the student body.\n\nMeanwhile, National Trade Union Federation Secretary General Nasir Mansoor said a “red line” had been crossed in how Baloch protesters and women were now being “treated by the authorities in response to exercising their rights to freedom of assembly and speech.”\n\n“If a journalist quotes this, the Peca Act will be applied to them,” he said, denouncing the use of the cybercrime law in such a way.\n\n“Whenever people try to take the democratic route, you send people from police and agencies to deal with them and other protesters on whom Section 144 doesn’t apply,” he said, urging the authorities to take heed from the lessons of the 1971 Bangladesh debacle.\n\nMahnaz Rahman, a member of the Women’s Action Forum, echoed Mansoor’s sentiments and said the Peca law had “snatched the freedom of speech from the people.”\n\nKhalique Junejo, chairman of the Jeay Sindh Mahaz, also agreed with Mansoor, pointing out how anti-BYC protests were seemingly supported by the authorities but Baloch rights protesters were arrested under Section 144.\n\nHe termed Sindh a “colony”, referring to the selective application of Section 144.\n\nBarrister Saluddin Ahmed also criticised the weaponisation of the country’s blasphemy and cybercrime laws, warning that the country was nearing a situation of a “ticking bomb.”\n\nHe suggested how the government could “tactfully” resolve the many issues of the country by not opening multiple adverserial fronts at the same time.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/271948096161430.jpg",
  "retrievedAt": "2025-08-25T15:29:18.259Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900673/hrcp-civil-society-urge-govt-to-immediately-address-human-rights-crises-afflicting-country",
  "dateList": "2025-03-27",
  "date_published": "2025-03-27T15:03:32.000Z"
}
