{
  "title": "PM Shehbaz Sharif forms high-level committee for tackling monsoon emergencies",
  "link": "https://www.app.com.pk/national/pm-shehbaz-sharif-forms-high-level-committee-for-tackling-monsoon-emergencies/",
  "date_published": "2024-07-02T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 2 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday formed a high-level committee to handle potential emergencies during the upcoming monsoon season.\nChairing a review meeting to address the monsoon forecast and potential emergencies, the prime minister decided to personally supervise the response to any flood situations during the monsoon.\nPrime Minister Shehbaz emphasized integrating advanced monsoon information into national broadcasts, stressing the regular dissemination of weather updates to farmers. He assured full support to farmers during emergencies, emphasizing the need for immediate assistance in such situations.\nHe instructed all relevant institutions to remain on high alert during the monsoon and directed the National Disaster Management Authority (NDMA) to support all provincial governments and related agencies.\nThe prime minister directed that advance information about the monsoon be disseminated to people in areas at risk of any emergency during the season. He emphasized that farmers and residents located near rivers and canals should be updated daily through the media and other information sources.\nDuring the meeting, the NDMA provided a detailed briefing on the monsoon forecast and the areas at risk. The forum was informed that heavy monsoon rains are expected in the four provinces during the first and second weeks of July.\nThe forum was informed that this year’s monsoon rains in Pakistan will move from the southeast to the north. Rainfall is expected in the Potohar region and the eastern part of Punjab during the first week of July.\nThe meeting was informed that in the second week of July, there is a possibility of heavy rains in Rawalpindi, Sargodha, Gujranwala, Lahore, and Faisalabad, with scattered rainfall anticipated in Bahawalpur, Multan, Sahiwal, and Dera Ghazi Khan divisions.\nAccording to the briefing, a flood situation is anticipated in the Sutlej, Chenab, and Ravi rivers during the first two weeks of August. Preparations for relocation and emergency response have been completed in the areas surrounding these rivers.\nIn Sindh, Karachi, Mirpur Khas, Nawabshah, Sukkur, and Hyderabad are expected to experience heavy rains in the second and fourth weeks of July. Additionally, monsoon showers are forecasted for Tharparkar, Badin, Thatta, and Umarkot in the third week of August.\nIn Khyber Pakhtunkhwa, heavy rains are expected in Hazara, Malakand, Mardan, Peshawar, Kohat, Bannu, and Dera Ismail Khan during July. The monsoon rains in the region are expected to persist until the third week of August.\nDuring the briefing, it was mentioned that in Balochistan, heavy rains are likely in the border areas with the Sindh coastal belt during the second and fourth weeks of July and the first two weeks of August. Additionally, significant rainfall is expected in Lasbela, Armada, Khuzdar, Barkhan, Sibi, and Zhob in the third week of August.\nThe meeting was told that partial rains are expected in July in Gilgit-Baltistan, while large-scale rains are anticipated in the first three weeks of August, in Skardu, Hunza, Chilas, and Ghizar.\nAccording to the briefing, Gilgit-Baltistan is expected to experience scattered rains in July, with substantial rainfall anticipated in the first three weeks of August. During this period, rain is expected in Skardu, Hunza, Chilas, and Ghizar.\nIt was stated that there is a possibility of heavy rains and landslides in Azad Kashmir during the first three weeks of July.\nThe meeting also received updates on preparations for rescue and relief efforts in case of emergencies affecting communities along the banks of the Sutlej and Chenab rivers.\nDuring the meeting, it was informed that adequate stocks of boats, tents, drainage pumps, medicines, and other essential items were available. Preparations for the monsoon started in January with emergency response exercises ongoing since March.\nThe forum was briefed that rescue agencies, Provincial Disaster Management Authorities (PDMAs), Pakistan Army troops, and NDMA remain on high alert in the areas at risk. NDMA has launched a mobile phone application for monsoon alerts, weather conditions, and advance information, which is actively utilized by the public.\nIt was explained that a National Monsoon Contingency Plan has been drafted and distributed to relevant institutions and provincial governments to manage any monsoon-related emergency situations.\nThe chief secretaries of the four provinces briefed the attendees on their respective action plans to manage the monsoon season and respond to any associated emergencies.\nFederal Minister for Economic Affairs Ahad Khan Cheema, Federal Minister for Information, Broadcasting, and National Heritage Attaullah Tarar, Minister for Industries and Production Rana Tanveer Hussain, Chairman NDMA Lt. Gen. Inam Haider Malik, and other senior officials attended the meeting. The chief secretaries of the four provinces joined the meeting via video link.",
  "retrievedAt": "2025-08-11T03:37:43.858Z"
}
