{
  "title": "Ulema’s role indispensable for promoting unity, brotherhood, peace in country: Salik",
  "link": "https://www.app.com.pk/national/ulemas-role-indispensable-for-promoting-unity-brotherhood-peace-in-country-salik/",
  "date_published": "2024-07-02T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 02 (APP): Minister for Religious Affairs and Interfaith Harmony Chaudhry Salik Hussain on Tuesday emphasized on the indispensable role of Islamic scholars in maintaining unity, brotherhood, and peace in the country, especially during Muharram-ul-Haram 1446 AH and the days ahead.\nHe said this during an address at a representative meeting of Pakistan’s leading scholars and religious leaders, held at the Council of Islamic Ideology (CII) under the chairmanship of Dr. Raghib Naeemi.\nMinister Salik highlighted that the remaining roots of extremism and radicalism in the country were close to being eradicated.\nCII Chairman, Dr. Raghib Naeemi, presented the consensus declaration of the meeting. He stated that the “Azm-e-Istihkam” initiative would not only strengthen the National Action Plan but also achieve the desired outcomes for peace. He emphasized the need to disseminate the Code of Conduct of the “Paigham-e-Pakistan” from the pulpit and niche, ensuring it reaches the very fabric of society.\nAdditionally, he said promoting a separate code of conduct specifically for Muharram-ul-Haram was crucial, a responsibility that rests with the religious scholars and leaders.\nDr. Raghib said the declaration underscored the importance of upholding the Constitution, respecting the basic rights of every citizen, venerating Islamic sanctities, and taking genuine steps to eradicate hate speech, violence, prejudice, sectarianism, and extremism.\nProminent participants of the meeting included Hafiz Tahir Ashrafi, Maulana Abdul Khabir Azad, Maulana Hamid-ul-Haq Haqqani, Maulana Ahmed Ludhianvi, Maulana Tayyab Qureshi, Allama Arif Wahidi, Allama Iftikhar Hussain Naqvi, Mufti Nauman Naeem, Allama Shabbir Maisami, Allama Hameed Imami, Pir Naqeeb-ur-Rehman, Maulana Imtiaz Siddiqui, Senator Hafiz Abdul Karim, and other esteemed scholars.",
  "retrievedAt": "2025-08-11T03:37:38.977Z"
}
