{
  "title": "ECP advises Political Parties to submit consolidated statements of accounts",
  "link": "https://www.app.com.pk/national/ecp-advises-political-parties-to-submit-consolidated-statements-of-accounts/",
  "date_published": "2024-07-02T13:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 2 (APP): The Election Commission of Pakistan (ECP) has advised the heads of political parties to file or submit their ‘Consolidated Statement of Accounts’ on (Form-D) for financial year, 2023-24 (ended on June 30th) on or before August 29.\nThe heads of political parties should submit their consolidated statement of accounts on (Form-D) in terms of section 210 of the Elections Act, 2017, said a press release on Tuesday.\nIt may be recalled that Section 210 of the Elections Act, 2017 provides that a political party would be liable to submit to the commission, within sixty days from the close of a financial year, a consolidated statement of its accounts audited by a Chartered Accountant on Form-D including annual income and expenses, sources of its funds, and assets and liabilities.\nThe Consolidated Statement of Accounts to be submitted to the Election Commission complete in all respect would include a report of a Chartered Accountant with regard to the audit of accounts of a political party and a certificate signed by an office-bearer authorized by the party Head stating that no funds were received by the party from any source prohibited under the Elections Act, 2017.\nThe statement of accounts contains an accurate picture of the financial position of the party.\nThe statement of accounts is to be submitted on Form-D as provided in the Elections Act, 2017. The printed forms were available, free of cost, in the Election Commission Secretariat, Islamabad and in the offices of the Provincial Election Commissioners, Punjab, Sindh, Khyber Pakhtunkhwa and Balochistan and also available on ECP’s Website.\nMoreover, the political parties’ leaders would also provide attested copy of Membership/Certificate issued by ICAP in respect of Auditor engaged with the Form-D along with last valid renewal certificate.",
  "retrievedAt": "2025-08-11T03:37:35.565Z"
}
