{
  "title": "Dhai Chaal leaves spectators proud on thrilling action, lively music based on real events",
  "link": "https://www.app.com.pk/national/dhai-chaal-leaves-spectators-proud-on-thrilling-action-lively-music-based-on-real-events/",
  "date_published": "2024-07-02T16:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 2 (APP):The thriller Dhai Chaal (The Knight’s Move) on Tuesday left spectators proud and excited on sensational action, drama, lively music and patriotic sentiments firing exclusive joy on watching the real events-based movie picturized on the arrest of Indian spy Kulbushan Jadhav.\nThe movie was screened here at the local Cinema in The Centaurus Mall which was watched by diplomat, senior journalists, and members of the civil society hailing from different walks of life.\nTalking to APP, Pakistan’s Ambassador to Oman, Imran Ali said the movie made him emotional out of the patriotic sentiments infused by the movie scenes, adding, “there was an element of Pakistani nationalism in the movie as it addressed different challenges of Pakistan like intellectual turmoil, youth confusion, fake narrative busting and debunked all false narratives.”\nHe commented that the movie was a labour of love that should be depicted in universities to apprise the youth.\nPolitical Activist, Commentator and Broadcaster, Reham Khan said that the movie was a very important initiative. Chief Minister Balochistan Sarfraz Bugti needed to take ownership of this initiative which was made for national service and reveal the true picture of the situation prevailing in Balochistan.\nShe commended the movie production for creating a heart touching movie that was full emotional content.\nDr Tahmina, a senior medical practitioner claimed that she did not know about the story content of the movie but it opened her mind as every scene of the movie connected dots on the issues based on fake hostile propaganda of the inimical forces on Balochistan. She added that the movie was a treat for all with a lot of learning and enjoyment.\nPeople from Balochistan termed the movie as an important content for educating the youth on the issues of Balochistan and improving their knowledge of the complex crises being perpetrated by the country enemies.\nProducer of the film Dr Irfan Ashraf said that the film “Dhai Chal” was a challenge, but with the help of local colleagues of Balochistan we fulfilled this dream.\nThe film, he said had different segments it opened up from Indian insurgency in Kashmir and leads the audience to Balochistan where the Indian hostile orchestrated liberation movements were scaled up to destabilise the country with only one aim to entangle it inside within its internal issues and keep Kashmir at bay.\n“The movie shows how India is involved in terrorism in Pakistan. India is misguiding the whole world through false films and propaganda. We, being Pakistanis, have exposed the real face of Pakistan and the lies of India to the world by making this film. The masses should watch it to reveal the facts,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:37:14.000Z"
}
