{
  "title": "Pakistan, China reaffirm resolve to further boost bilateral cooperation in various fields",
  "link": "https://www.app.com.pk/national/pakistan-china-reaffirm-resolve-to-further-boost-bilateral-cooperation-in-various-fields/",
  "date_published": "2021-08-09T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): Pakistan and China Monday reaffirmed their resolve to further boost bilateral cooperation in various fields for the mutual benefit of the two countries.\nBoth sides also emphasized the need for making collective efforts to promote peace, prosperity and development in the region.\nThis was discussed at a meeting between President Dr Arif Alvi and Ambassador of China to Pakistan Nong Rong, who called on him at Aiwan-e-Sadr.\nThe meeting also underlined the need to enhance cooperation in the field of Information Technology.\nTalking to the ambassador, the president said that China and Pakistan enjoyed excellent relations and the “All-weather Strategic Cooperative Partnership” between the two countries would further take the bilateral relationship to new heights.\nHe said that both time-tested friends had always stood by each other through thick and thin.\nThe president reiterated Pakistan’s commitment to “One-China Policy” and firm support to China on core issues of its national interest, such as Taiwan, Tibet, Hong Kong and the South China Sea.\nHe appreciated China’s support for Pakistan’s core national issues such as Jammu and Kashmir dispute, NSG & FATF.\nHe also thanked the Chinese government for providing support to Pakistan in containing the COVID-19 pandemic.\nThe president underlined that Pakistan was committed to the timely completion of the CPEC project that had huge potential to contribute to the socio-economic development of Pakistan.\nHe said that certain hostile players were not happy over the project and were trying to sabotage it but they would not succeed as both the iron brothers were strongly committed to implement the project.\nOffering condolences to the Government of China and the bereaved families who lost their dear ones in Dasu, the president underscored that the security of Chinese nationals, working in various projects in Pakistan, was the highest priority of Pakistan and the government was making all-out efforts for their protection and security.\nNong Rong said that Pakistan was the closest friend of China and his country wanted to further strengthen bilateral cooperation with Pakistan.\nHe said his country would share its experiences with Pakistan that would help in its social and economic prosperity.\nHe also lauded the steps taken by the government of Pakistan that successfully contained the COVID-19 pandemic.\nThe ambassador informed that China would provide 6 million vaccine doses this week while 100 million vaccine doses would be provided by the end of the year.\nHe also referred to the recently held strategic dialogue between the foreign ministers of the two countries in July 2021 and expressed the hope that the dialogue would further push forward the relations between the two brotherly countries.",
  "retrievedAt": "2025-08-11T21:03:39.298Z"
}
