{
  "title": "Experts urge UN, Int’l community to help end Indian war crimes, brutal fascist military-siege in IIOJK",
  "link": "https://www.app.com.pk/features/experts-urge-un-intl-community-to-help-end-indian-war-crimes-brutal-fascist-military-siege-in-iiojk/",
  "date_published": "2021-08-09T07:33:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 4 (APP): Atrocities of paramilitary troops in Indian Illegally Occupied Jammu & Kashmir (IIOJK) had witnessed an unprecedented surge, since the RSS-backed fascist Modi’s government had illegally abrogated the territory’s special status on August 5, 2019.\nKashmiris, on both sides of the Line of Control (LoC), and across the globe are all set to observe ‘Black Day’ on Thursday, August 5, as the Modi-government in India on this day had abrogated the special status of the Jammu and Kashmir by repealing Articles 370 and 35-A and imposing a military siege in the territory on this day.\nThe experts have urged UN and global Human Rights bodies in connection with this day to wake up of their deep slumbers and stop the ongoing mass killings of IIOJK people.\nIt may be mentioned here that India had illegally occupied Jammu and Kashmir violating international laws by dividing Jammu and Kashmir into so-called two union territories.\nAzad Jammu and Kashmir President Sardar Masood Khan while talking to APP telephonically said that Indian brutalities in Indian illegally Occupied Jammu Kashmir were increasing with each passing day.\nDefenseless Kashmiris are all-time on the battlefield, as youths are being killed and Indian military forces are snatching agricultural land from the local farmers.\nThe responsibility of Pakistani and Kashmiri people has soared manifold to raise voices against Indian atrocities to stop the genocide of innocent people in the valley, at every possible forum to expose the dirty face and designs of Modi.\nHe said India’s 800,000 plus paramilitary and armed personnel, unleashed on eight million Kashmiris, were killing women, children and youngsters in an organized manner, adding that IIOJK was an internationally recognized dispute under the United Nations Security Council’s relevant resolutions and international law.\nFormer Human Rights Commission of Pakistan (HRCP) Chairperson, Dr. Mehdi Hassan told APP that India’s illegal and unilateral actions of Aug 5, 2019 and other illegitimate measures including land ownership laws and the domicile-law, were aimed at changing the demographic structure of IIOJK to convert the Kashmiris into a minority.\nIndia had been violating all basic social, political, religious. and human rights of the oppressed Kashmiris for the last 73 years, he said and added despite the Indian brutalities and oppression, the people of IIOJK had dismissed the tyrannical actions of the Indian forces deployed there.\nChanging the demographic structure of the occupied territory is an open violation of the 4th Geneva Convention and constitutes a war crime, he said.\nHe said that Narendra Modi-led RSS government had broken previous records of atrocities on freedom-seeking Kashmiris, by blinding hundreds of youths with pellet guns, burying countless in mass graves after killing them in fake encounters and lodging thousands, mostly children and youngsters, in prisons.\nMushaal Hussein Mullick, Chairperson of the Peace and Culture Organization, wife of Chairman Jammu and Kashmir Liberation Front, Yasin Malik while talking to APP urged the United Nations (UN) and global HR forums to play their due role and constitute a result-oriented inquiry commission to probe the worst carnage of “Chota Bazaar” to bring the culprits to light as the bereaved families of the victim Kashmiri were still in painful wait for justice despite lapse of 30 years.\nShe said that the history of IIOJK was littered with heart-wrenching and horrifying incidents of massacres, but not a single Indian trooper was punished because they carried out these ‘carnages’ with complete impunity of Modi’s government.\nThe war crimes of India neither could be hidden from the world nor can discourage the oppressed Kashmiris, despite turning the occupied valley into a huge military garrison, she added.\nThe brave Kashmiri people would carry out their just and tireless struggle till realizing their dream for the right to self-determination, she vowed.\nWithout any legal trial, around 4500 Hurriyat leaders and activists had been made prisoners, which is a war crime and a brazen violation of prisoners’ rights as guaranteed by the United Nations Human Rights Charter (UNHRC), Mushaal said while replying to a query.\nDenouncing the arbitrary detentions of the innocent youth on fabricated and flimsy charges, Mullick said that the recent surge in the cordon and search operations and custodial killings should be a matter of grave concern for the UN Council for Human Rights, adding that UN must take serious cognizance of the prevailing-grim situation in IIOJK .\nMeanwhile, the All Parties Hurriyat Conference (APHC) in Indian illegally occupied Jammu and Kashmir (IIOJK) has expressed deep concern through issuing a statement on Monday, over the plight of detained Kashmiri leaders, languishing in different Indian jails.\nThe determination of Kashmiris amid the tight Indian military siege was sending a message to the world that the people of IIOJK had completely rejected the illegal, unconstitutional and unilateral moves of the Modi’s fascist regime in their territory.\nAPHC In-charge Human Rights, Advocate Zamrooda Habib, in a statement on Monday issued by Kashmir Media Service has said that the incarcerated leaders and activists of the Kashmir freedom moment are facing the worst kind of political and social vendetta at the hands of fascist authorities.\nLikewise, the Chairman of Pasban-e-Hurriyat Jammu and Kashmir, Uzair Ahmad Ghazali while condemning Indian actions on 5th August 2019, termed the day as darkest in the history of IIOJK.\nThe Indian government, on this day, had not only attacked the identity of Jammu and Kashmir but divided the territory into two unions while taking it in their direct control, he added.\nIndia has ignored the principles and ‘code of conduct’ of the United Nations and the global community regarding Jammu and Kashmir and imposed draconian laws in the territory which is the worst kind of state terrorism, he added.\nIn IIOJK, various parties and movements including Warseen-e-Shuhada, Tehreek-e-Azaadi Jammu and Kashmir, Jammu and Kashmir Political Resistance Movement (JKPRM), Sada-e-Muzloom,, Jammu and Kashmir Liberation Alliance have displayed the posters in favour of freedom highlighting their plights.",
  "retrievedAt": "2025-08-11T21:03:43.212Z"
}
