{
  "title": "Hafeez reiterates govt’s commitment to provide maximum relief to public",
  "link": "https://www.app.com.pk/national/hafeez-reiterates-govts-commitment-to-provide-maximum-relief-to-public/",
  "date_published": "2021-03-15T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):Federal Minister for Finance and Revenue, Dr. Abdul Hafeez Shaikh here on Monday reiterated government’s commitment to provide maximum relief to the general public through provision of basic commodities at fair prices.\nThe minister was chairing the weekly meeting of the National Price Monitoring Committee (NPMC), according to press statement issued by the Finance Ministry.\nThe minister appreciated the provision of basic items by the Utility Stores Corporation (USC) at subsidized rates and directed Managing Director Utility Stores Corporation (USC) to ensure availability of essential items at respective outlets across the country.\nAccording to the statement, he directed for ensuring smooth supply of wheat at affordable prices across the country, the statement added.\nHafeez Shaikh also directed provincial governments and other stakeholders to provide estimates regarding additional demand for sugar to the Ministry of Industries and Production for effective planning during the current year.\nEarlier, the NPMC reviewed the price trend of essential commodities especially wheat flour, sugar, tomatoes, vegetable ghee, chicken and eggs during the last week.\nIt observed that the weekly SPI recorded a decrease of 0.57% wherein prices of 07 basic items registered a decline and 18 commodities remained stable.\nThe overall release position of wheat was also reviewed during the meeting, the statement said adding that the Committee directed Secretary National Food Security and Research (NFS&R) to hold a meeting with Chief Ministers of all provinces to keep a check on the prices of wheat flour to avoid any artificial price hike.\nOn the occasion, the Ministry of Industries and Production updated the committee about end in sugarcane crushing season during which the overall production was recorded higher as compared to the last year.\nMinister for Industries and Production Hammad Azhar apprised that the Ministry was already working on various measures for provision of ghee/oil at reasonable price.\nMoreover, the Utility Stores Corporation would ensure availability of ghee at a subsidized price under “Ramadan Relief Package” through its chain of outlets during the holy month.\nAmong others was attended by Federal Minister for NFS&R, Syed Fakhar Imam; Federal Minister for Industries and Production, Hammad Azhar; SAPM on Revenue Dr. Waqar Masood; Provincial Chief Secretaries; Secretary Ministry of Industries and Production, Additional Secretary Ministry of NFS&R;\nMember Competition Commission of Pakistan (CCP), MD PASSCO, Member Pakistan Bueau of Statistics, MD Utility Stores Corporation and senior officials of the Finance Division participated in the meeting.",
  "retrievedAt": "2025-08-11T20:29:41.998Z"
}
