{
  "title": "World recognizing PM Imran Khan’s environment policies: Chinese scholar",
  "link": "https://www.app.com.pk/national/world-recognizing-pm-imran-khans-environment-policies-chinese-scholar/",
  "date_published": "2021-03-15T15:47:00.000Z",
  "source": "APP",
  "content": "BEIJING, March 15 (APP)::Prime Minister Imran Khan has said that environment policies of Pakistan government were being recognized globally.\n“Since the outbreak of novel coronavirus pneumonia, I have been following the pandemic spread and the measures taken by the governments and people to combat the pandemic in South Asian countries. My impression is that Pakistan has done the best.”\nThese views were expressed by Cheng Xizhong, Visiting Professor at Southwest University of Political Science and Law, Senior Fellow of the Charhar Institute, former Defense Attache in South Asian countries in a statement here on Monday.\nPakistan has adopted a very scientific “smart lockdown” in the prevention and control of the pandemic. Therefore, the pandemic has been quickly and effectively controlled, and the economic recovery is the fastest, which has been unanimously recognized and highly appreciated by the international community, he added.\nWhat is particularly commendable is that Pakistan government has launched green recovery programme from the Covid 19. According to the clean power generation target set by Pakistan government, the proportion of renewable will increase from the current 5% to 20% by 2025, and further increase to 30% by 2030. If hydropower is added, the proportion of renewables is expected to increase to 60% by 2030.\nHe said, another very important point is that Pakistan government has worked out the climate action plan. Pakistan has attracted 180 million United States dollars for green space and is working towards the creation of 15 new national parks.\nAt the same time, Pakistan government has launched “Billion Tree Honey Initiative” to promote tree plantation. Pakistan has also formulated afforestation plans to plant 10 billion trees all over the country. Recently, Pakistan government has proposed to build a green corridor, that is, to plant trees along the China-Pakistan Economic Corridor (CPEC), so as to build this corridor into a green corridor.\nGreen development is a way of economic growth and social development aiming at efficiency, harmony and sustainability. In today’s world, green development has become an important trend. Many countries take the development of green industry as an important measure to promote economic restructuring. Green development is consistent with sustainable development, and is the only choice to deal with the deterioration of global ecological environment.\nHe said, the outbreak of novel coronavirus pneumonia has brought hitherto unknown impact on world economic and social development. Green development is to establish the relations of harmonious coexistence between man and nature.\nPromoting green transformation is a systematic project, which requires long-term planning. Green development is to achieve economic growth in a resource-saving and environment-friendly way.\nThe promotion of green transformation is inseparable from the support of science and technology, and we need to accelerate the promotion of scientific and technological innovation.\nIn accordance with the green, circular and low-carbon requirements, we should accelerate scientific and technological innovation, reduce the use and waste of resources, improve the quality and efficiency of economic development, and effectively promote the comprehensive green transformation of economic and social development.\nTo promote green transformation, we should vigorously develop green industries. It is necessary to accelerate the formation of green development mode. In accordance with the principle of “reduction, reuse and recycling”, we should speed up the upgrading and green transformation of technology and equipment in traditional industries, and implement the green upgrading and transformation of industrial clusters.",
  "retrievedAt": "2025-08-11T20:29:41.847Z"
}
