{
  "title": "CM unveils Ramzan package worth Rs 7 bln",
  "link": "https://www.app.com.pk/national/cm-unveils-ramzan-package-worth-rs-7-bln/",
  "date_published": "2021-03-15T14:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 15 (APP):Punjab Chief Minister Sardar Usman Buzdar on Monday chairing the cabinet committee meeting, announced the Ramzan Package worth Rs 7 billion for providing relief to the masses in the holy month of Ramadan.\nGiving details, the CM said a total of 313 Ramzan bazaars would be set up across the province where a 10-kg flour bag would be available at Rs 300. The Punjab government would provide around Rs 3.50 billion subsidy for this, he added.\nMeanwhile, the implementation of corona SOPs, including observance of social distancing will be fully ensured, he added.\nAgriculture fair-price shops would also be established to provide fruits and vegetables at the rates of 2018. Similarly, gram flour, dates, dried chickpeas lentils (chana dal) and other items would also be available at the rates of the year 2018, he said.\nMeanwhile, sugar would be provided at Rs 60 per kg and ghee, chicken and eggs would be sold at Rs 10 to 15 less than the market price.\nThe CM directed to provide maximum relief to the citizens, adding that the scope of Sahulat bazaars would be expanded.\nHe further directed to establish Sahulat Bazaar Authority to provide permanent relief to the consumers from artificial price-hike. He directed to follow austerity measures while arranging Ramzan bazaars and saved money be utilized for providing relief to the masses.\nThe poor would be given economic relief at every cost, the CM assured and directed to start Ramzan bazaars from Shaaban 25. “I, provincial ministers and secretaries will also visit Ramzan bazaars” he announced.\nProvincial ministers Mian Aslam Iqbal, Syed Hussain Jahanian Gardezi, Sardar Hasnain Bahadur Dareshk, secretaries of industries, agriculture, food and livestock departments and others attended the meeting.",
  "retrievedAt": "2025-08-11T20:29:44.238Z"
}
