{
  "title": "COVID-19 claims 29 lives, infects 2,253 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-29-lives-infects-2253-more-people/",
  "date_published": "2021-03-15T06:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The national tally on Monday of total active COVID-19 cases was recorded 22,038 with 2,253 more people tested positive for the deadly virus and 1,307 people recovered from the disease during the last 24 hours.\nTwenty-nine corona patients have died during past 24 hours, 26 of whom were under treatment in hospital and three out of hospital in respective quarantine or home, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 29 deaths occured during last 24 hours, 16 of the deceased had died on ventilators during their treatment.\nThe maximum ventilators were occupied in four major areas including Multan 28 percent, Islamabad Capital Territory (ICT) 38 percent, Peshawar 23 percent and Lahore 34 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in Four major areas of Gujrat 59 percent, Peshawar 45 percent, ICT 36 percent and Lahore 30 percent.\nAround 245 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nSome 44,061 tests were conducted across the country on Sunday, including 8,036 in Sindh, 22,916 in Punjab, 6,931 in Khyber Pakhtunkhwa (KP), 4,773 in Islamabad Capital Territory (ICT), 483 in Balochistan, 312 in GB, and 610 in AJK.\nAround 571,878 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 607,453 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 11,017, Balochistan 19,220, GB 4,961, ICT 48,081, KP 76,104, Punjab 186,659 and Sindh 261,411.\nAbout 13,537 deaths were recorded in country since the eruption of the contagion. Around 4,458 perished in Sindh where five deaths occured in the hospitals during past 24 hours.\n5,769 in Punjab had died with 16 deaths occured in past 24 hours, 13 of them in the hospital and three out of the hospital. 2,159 in KP where six of them died in hospital on Sunday, 526 in ICT among two of them died in the hospital on Sunday, 202 in Balochistan, 103 in GB and 320 in AJK succumbed to the deadly virus.\nA total of 9,529,763 corona tests have been conducted so far, while 631 hospitals are equipped with COVID facilities. Some 2,329 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:29:50.667Z"
}
