{
  "title": "Shafqat asks CEC, ECP members to resign for not holding fair elections",
  "link": "https://www.app.com.pk/national/shafqat-asks-cec-ecp-members-to-resign-for-not-holding-fair-elections/",
  "date_published": "2021-03-15T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):Federal Minister for Education and Professional Training Shafqat Mehmood Monday asked the Chief Election Commissioner (CEC) Sikandar Sultan Raja and all ECP members to immediately tender their resignations for their failure to conduct fair and transparent elections in the country.\nAddressing a news press conference flanked by Senator Shibli Faraz and Minister for Science and Technology Chaudhry Fawad Hussain, he said the whole Election Commission of Pakistan (ECP) had lost the trust of all political parties.\nThe CEC and members should quit their offices in order to pave way for the Parliament to put a new trustworthy team in place to check corrupt practices in polling process, thus ensuring transparency in future elections.\n.:Shafqat Mahmood said Prime Minister Imran Khan from day one had been demanding the Senate election through open balloting to eradicate corrupt practices and despite political difference he even supported Nawaz Sharif when he gave a suggestion in 2013 to that effect.\nHe said the sale and purchase of assembly members was witnessed in the 2018 Senate election. The Pakistan Tehreek-i-Insaf (PTI) was the only party in the country’s history, which had taken action against its provincial assembly members for their involvement in corrupt practices.\nSame was the case in the recent Senate elections, where money was used to buy the loyalties of assembly members, he added.\nThe minister said the government approached the Supreme Court, which in its decision held that it was the responsibility of Election Commission to take all measures for ensuring fair and transparent Senate elections.\nA PTI delegation consisting of Chaudhry Fawad Hussain and him (Shafqat), he said, approached the Election Commission to request for taking steps in the light of SC decision. But unfortunately Yousuf Raza Gillani won the election for the Senate’s general seat from Islamabad despite having minority opposition members in the National Assembly while PTI’s candidate emerged successful on the women seat, he added.\nHe said after the apex court’s ruling, it was a good opportunity for the Election Commission to ensure fair and transparent Senate elections. The CEC and all the ECP members should resign as they did not fulfill their responsibilities despite the SC’s instructions, he added.\nThe government, however, would not file any reference against the Election Commission chief and members, he said.\nHe condemned the attack on Special Assistant to the PM Shehbaz Gill in the Lahore High Court premises, saying the Pakistan Muslim League-Nawaz had a ‘black history’ of such violence against its opponents. It was the PML-N, whose workers and leaders had attacked the Supreme Court, and had thrashed the workers of former prime minister Muhammad Khan Junejo with chairs.\nHe said the PML-N leaders were responsible for the unpleasant incident, who had intentionally addressed a press conference amid the PTI workers who had gathered outside the Parliament House to celebrate the vote of confidence taken by Prime Minister Imran Khan and provoked them.",
  "retrievedAt": "2025-08-11T20:29:47.363Z"
}
