{
  "title": "Speakers for Nanomedicine usage for COVID-19’s diagnosis, treatment",
  "link": "https://www.app.com.pk/national/speakers-for-nanomedicine-usage-for-covid-19s-diagnosis-treatment/",
  "date_published": "2021-03-15T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):Three-day International workshop on `Nanomedicine; Development and Challenges’ kicked off here Monday with the participation of a number of national and international experts calling for mutual efforts to make use of Nanomedicine possible for diagnosis and treatment of COVID-19 and other diseases.\nThe speakers highlighted that Covid-19 outbreak has made it clear that indigenous capacity in science and technology is critically important for every country, big or small while investment in scientific research relevant to national needs has the highest rate of return.\nThey observed that Nanotechnology offers new prospects of developing affordable, quick and scalable solutions in diagnoses and treatment of COVID-19 and other diseases and manufacturing of personal protective equipments.\nFederal secretary, Ministry of Science and Technology, Dr Arshad Mahmood inaugurated the event as chief guest.\nSpeaking on the occasion, he appreciated the efforts of COMSTECH to ensure the presence of international speakers and participants for this workshop.\nHe urged the experts of the meeting to formulate future directions for promoting the field of Nanomedicine in Pakistan.\nCoordinator General COMSTECH, Prof Dr Muhammad Iqbal Choudhary highlighted the role of COMSTECH promoting science and technology among different OIC member countries.\nThe ultimate aim of this institution is to build and nourish a scientific culture in addition to using Science and Technology as a major contributor to socioeconomic development and rapid industrialization.\nSpeaking on the occasion, Prof Dr N M Butt gave the key note lecture on the evolution of Nanomedicine. Director, Division of Pharmacy Services, Drug Regulatory Authority of Pakistan (DRAP) Dr Abdur Rashid shared plans of DRAP to harness the use of nanomedicine in the country.\nThis workshop will be delivered by 15 leading scientists from UK, USA, Germany, Switzerland, Saudi Arabia, Malaysia and Pakistan.\nDespite covid-19 related constrains several hundred participants from various countries are taking part in this important workshop. Apart from 100+ young scholars physically present in the venue, numerous international participants will be taking part virtually.\nThese virtual participants are from many countries like Egypt, UAE, Mauritius, Turkey, Azerbaijan, Cameroon, Niger, Iraq, Bangladesh, UK, China, Kyrgyzstan, Hong Kong and Saudi Arabia.\nAround 45 academic and research institutions from Pakistan and other OIC states are represented physically whereas more than 60 institutes are joining virtually from across the world.",
  "retrievedAt": "2025-08-11T20:29:47.634Z"
}
