{
  "title": "PM briefed on reforms in Railways, Green Initiative",
  "link": "https://www.app.com.pk/national/pm-briefed-on-reforms-in-railways-green-initiative/",
  "date_published": "2021-03-15T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):Prime Minister Imran Khan in a meeting on Monday was briefed about the ongoing reforms in Pakistan Railways, Karachi Circular Railways project and Prime Minister Railways Green Initiative.\nMinister for Railways Azam Swati, Minister for Planning Asad Umar, Adviser on Institutional Reforms Dr Ishrat Hussain, federal secretaries and senior officers attended the meeting.\nDuring the meeting, it was informed that a project was under consideration to build parallel to the Lahore Karachi track, a freight corridor specifically for freight trains. The corridor will connect Pipri with Karachi port making transportation easy and would help resolve issues of traffic in the city.\nIt was told that Pakistan Railways had prepared a build operate transfer (BOT) model for Karachi Circular Railways. The transport project will ensure better services for the passengers. A consultant had been appointed for the technical design and model of the project and he would give his recommendations within the next 30 days.\nIt was apprised that a comprehensive reforms programme was underway to bring down losses of Pakistan Railways and steer it out of crisis. Private sector was made part of the railways operations and automation was being introduced.\nIt was told that so far four trains were privatized and 15 more trains would be handed over to the private sector. In order to promote rail tourism, a safari train from Rawalpindi to Attock was launched and it would also be run by the private sector.\nThe prime minister was also briefed about the Main Line (ML-1) project. He was told that as part of the Clean and Green Pakistan campaign, land along 221 kilometer long track was identified for planting of trees.\nThe prime minister while talking about reforms in Railways, said it was imperative to ensure uninterrupted reforms in an institution like Railways to bring it out of deficit.\nHe said improved railways system would not only provide better transport service to the people but would also resolve issues of traffic and help achieve economic progress.\nThe prime minister instructed that he should be kept updated about the ongoing reforms in Railways.",
  "retrievedAt": "2025-08-11T20:29:38.705Z"
}
