{
  "title": "Gill says not afraid of anyone, to continue defending govt policies",
  "link": "https://www.app.com.pk/national/gill-says-not-afraid-of-anyone-to-continue-defending-govt-policies/",
  "date_published": "2021-03-15T15:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 15 (APP):Special Assistant to Prime Minister (SAPM) on Political Communication Dr Shahbaz Gill Monday said that he was not afraid of anyone and would keep defending the government policies and initiatives without caring about any criticism.\nReacting over the incident of throwing of an egg and ink on him allegedly by the Pakistan Muslim League-N (PML-N) supporters at the Lahore High Court (LHC) here, he gave a message to Maryam Nawaz that if such an act was repeated, he would do a press conference in front of her house the next time.\n“I was pelted with eggs and black ink. It was the color of the PML-N’s black deeds. They have now resorted to hooliganism,” Gill said while talking to the media at the LHC.\nHe said that he was a follower of Prime Minister Imran Khan and he would not step back, rather he would move forward in reaction to the acts of the PML-N.\nGill said that he was standing firm on his position despite the incident of egg and ink throwing and he would intensify his action “as you had provided me with a reason to fight with your hooliganism”.\nThe SAPM said that he appeared before the court on being summoned and he did not make any excuses like the PML-N leaders despite being a spokesperson for the prime minister.\nGill said that he was aware of their plan for today, but he reached the court to face any gundagardi. He said that he did not have any complaint of lack of security by police.\nThe police did their job. But the PML-N was a party of such people who had killed a pregnant women in Model Town, and whatever happened to him was insignificant compared to that incident, he added.\nHe said that the PML-N should remember that the PTI leaders and workers would not react in their (PML-N) style as they were followers of Prime Minister Imran Khan. “We will impart moral training to the PML-N workers if they abuse or torture us, besides taking steps in accordance with the law”, he added.\n“We respected the judiciary in the past and would continue respecting it in future as well. I would appear before the court on being summoned every time, and would not make any lame excuses,” he added.\nHe said that the PTI had an edge of 20 votes in the Senate election between Hafeez Sheikh and Yusuf Raza Gilani, but despite that, the opposition people claimed that the MNAs acted on the call of their conscience and gave votes to Gilani.\nThey claimed that that the PML-N ticket worked in the election and Gilani won the Senate seat, he said. The special assistant questioned why the same PML-N ticket did not work in the election of Gilani for the chairman Senate slot, and added sarcastically that the PML-N ticket worked again and eight of their votes were rejected in the election.\nWhile referring to a whatsapp call, he said now the opposition parties were fighting with each other and it was being claimed that the PML-N did not vote for the PPP candidate. He said that the opposition had gathered to save their theft; otherwise, they did not have any common grounds.\nHe claimed that the opposition would fight with each other in the coming days as Prime Minister Imran Khan had buried their politics with the defeat of Yusuf Raza Gilani in the Senate elections.\nHe claimed that Maryam Nawaz instigated the party workers for revenge and the present attack was made on him on he behest. However, he asked the PTI workers and supporters to observe restraint if they encounter any PML-N leader appearing in the courts or elsewhere as they were supporters of Imran Khan.\nHe said that PML-N leader Nawaz Sharif abused the country. “It was started by him (Nawaz) and now people like Javed Latif were giving statements against the country,” he said while criticising Javed Latif over his anti-country statement.\nGill said that he wanted to make it clear that Pakistan was not their property, as his forefathers migrated and sacrificed their lives for it.\n“Whether you raised a slogan in favour of Pakistan or not, every drop of our blood would raise a slogan in favour of Pakistan,” he added.\nHe said that the PML-N voters would also be ready to sacrifice their lives for Pakistan, adding that Pakistan would not be affected with anti-country statements of a few cheap people.\nHe advised the PML-N to do politics of decency, and added sarcastically that they did not know the alphabet of politics as they had been planted by the powers-that-be.\nHe said that he had been advised to get the case transferred to Rawalpindi, but he would not do so, as he had trust in the courts and challenged that he would appear despite hooliganism by the PML-N.\nWhile replying to a question about the incident of hurling a shoe on Ahsan Iqbal, he said that everyone knew that the PTI workers were gathering in Islamabad at D-Chowk, then why the PML-N went to the same spot. He said that his situation and the Islamabad incident should not be compared as he did not come to any gathering of the PML-N today.\nHe said that he had condemned the incident of show throwing on Ahsan Iqbal and his statement was also broadcast on television. He said that he condemned the incident even today and urged workers to abstain from throwing ink on any PML-N leader. He said that the PML-N was showing their real face and “we will show our training”.\nTo another question, he said that Nawaz Sharif would meet his destiny now as he had become Altaf Hussain-2 by speaking against the country.\nHe claimed that Nawaz Sharif and Maryam politics had ended in Pakistan and it was a message to workers of the PML-N to select right track and stand with the person who follow narrative of the country.\nHe would not nominate Maryam in the FIR over today’s incident, while replying to a question.\nEarlier, the SAPM appeared before Justice Malik Shahzad Ahmad Khan in connection with a petition, challenging a criminal case, registered by Islampura police on his complaint.\nThe court observed that the SAPM was not required to appear on the next date of hearing, March 30, and he could file his reply to the petition through the counsel.\nTahir Mobeen and others had filed the petition, wherein it was alleged that the SAPM got the case registered against them with mala fide intention.\nThe police registered the FIR on Jan 13, 2021 against the petitioners under sections 419, 420, 468 and 471 of Pakistan Penal Code on a complaint by the SAPM.\nThe petitioner had also launched a defamation suit against the SAPM and it was pending before a sessions court.\nSome supporters of the PML-N threw eggs and ink at the SAPM here on Monday at the LHC premises, ahead of his appearance in the court.\nLater, the police arrested them from the scene.",
  "retrievedAt": "2025-08-11T20:29:42.015Z"
}
