{
  "title": "Pakistan, Netherlands review bilateral economic, trade cooperation",
  "link": "https://www.app.com.pk/national/pakistan-netherlands-review-bilateral-economic-trade-cooperation/",
  "date_published": "2022-02-10T17:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD Feb 10, (APP): Pakistan and The Netherlands during the ninth round of Bilateral Political Consultations (BPC) here on Thursday reviewed bilateral cooperation in a range of areas including political, economic, trade,  investment, climate change, education, and culture.\nForeign Secretary Sohail Mahmood and Paul Huijts, Secretary General at the Ministry of Foreign Affairs of the Kingdom of The Netherlands, led the respective sides.\nThey also exchanged views on regional issues. Expressing satisfaction at the upward trajectory of bilateral relations, the two sides reaffirmed their commitment to sustain and further expand the positive momentum in diverse fields. It was also agreed to celebrate the 75 years of establishment of diplomatic relations between Pakistan and The Netherlands this year in a befitting manner.\nThe Foreign Secretary highlighted Pakistan’s emphasis on geo-economics. He stated that the Netherlands was a major trade partner of Pakistan in the European Union and hoped that the Dutch companies would take advantage of the investment opportunities created by business-friendly policies of the government.\nThe Foreign Secretary highlighted Pakistan’s facilitative role in evacuation operations from Afghanistan and reiterated Pakistan’s commitment in supporting the international community in its efforts to strengthen peace and stability in Afghanistan. He underlined the urgency to assist the Afghan people in order to avoid humanitarian crisis and economic meltdown.\nThe Foreign Secretary also briefed on India’s illegal and unilateral actions of 5 August 2019 and steps to alter the demographic structure of Indian Illegally Occupied Jammu and Kashmir (IIOJK). The Foreign Secretary underlined the importance of international community playing its part in addressing the dire human rights situation in IIOJK and resolving the Jammu and Kashmir dispute in accordance with relevant UNSC resolutions.\nThe Secretary General appreciated Pakistan’s assistance in its evacuation operations from Afghanistan and hoped for Pakistan’s continued support in this context.\nPakistan and The Netherlands enjoy cordial relations bilaterally as well as in the context of the EU. The Netherlands is an important trading partner and one of the largest investors in Pakistan.",
  "retrievedAt": "2025-08-11T14:18:05.839Z"
}
