{
  "title": "Pakistan ready to play role for deescalation in region: FO",
  "link": "https://www.app.com.pk/national/pakistan-ready-to-play-role-for-deescalation-in-region-fo/",
  "date_published": "2020-01-09T05:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP):Pakistan on Thursday expressed its readiness to contribute towards peace in the region, saying it would welcome any move by the United States and Iran to deescalate the current tense situation.\n“Any attempt by the concerned parties to diffuse tension and restore peace in the region will be welcomed by Pakistan,” Foreign Office spokesperson Aisha Farooqi said at a weekly press briefing.\nThe spokesperson said U.S President Donald Trump’s address to his nation carried a hint of peace following a retaliatory attack by Iran on its military bases in Iraq after assassination of its top military commander General Qassem Suleimani in an air strike by U.S. forces on January 3.\n“We believe there is an indication by President Donald Trump that peace must be given a chance,” she said, adding that Pakistan was evaluating the contours of his speech.\nSpokesperson Farooqi said there was always a room for engagement within the region and beyond, saying the upcoming visits of Foreign Minister Shah Mehmood Qureshi to Saudi Arabia, Iran and United States on direction of Prime Minister Imran Khan was aimed at delivering a message of peace.\n“War is in no one’s interest and the region cannot afford any more conflict. The collective wisdom demands that all must play their role towards peace, which Pakistan is certainly doing at the moment,” she said.\nThe spokesperson said since the developments of January 3, Pakistan reached out and contributed towards a collective objective of peace.\n“Pakistan has consistently emphasized the importance of restraint and diffusion of tensions. Pakistan will not be part of any conflict in the region and will always be partner to peace,” she added.\nAsked why U.S. State Secretary Mike Pompeo telephoned Army Chief General Qamar Javed Bajwa instead of his counterpart at the Foreign Office to discuss ongoing situation, she said: “Interactions between Pakistan and the U.S. take place at several levels and through several channels as the focus remains to build a stronger relationship”.\nAbout prospects of Afghan peace in the wake of Middle East crisis, she said Foreign Minister Qureshi during all his interactions with counterparts emphasized that the situation must not affect peace process in Afghanistan.\nAisha Farooqi termed the U.S. decision to revive International Military Education and Training Programme (IMET) for Pakistan “one more step in right direction” and said it was important for both countries for work for a broad-based and enduring relationship.\nShe said Ministry of Defence was in better position to inform about the number of military trainees.\nThe spokesperson confirmed that Prime Minister Imran Khan would pay a visit to Malaysia in near future and stressed that “Pakistan remained engaged closely with the brotherly country”.\nShe said Turkish president Recep Tayyip Erdogan would be visiting Pakistan in February, for which the dates were being finalized.\nOn reports of India arranging a visit of envoys to Jammu and Kashmir, she said Pakistan expected the exercise to be “open and transparent” allowing free interaction of diplomats with local Kashmiris and also the Hurriyat leaders.\nShe mentioned that India had unleashed a new reign of terror in Indian Occupied Jammu and Kashmir making the valley a ‘largest open air prison on earth’.\nThe spokesperson strongly rejected ‘speculative’ media reports portraying Foreign Secretary Sohail Mehmood as lacking capability to handle important challenges.\n“I have to make a strong statement on this. The current Foreign Secretary is one of the ablest, well-trained and an acclaimed diplomat who has been serving the country for last three decades. He has efficiently performed important tasks since he took charge,” she said.",
  "retrievedAt": "2025-08-11T18:36:06.263Z"
}
