{
  "title": "Rs 300 mln to be released for electricity projects in Chitral: NA told",
  "link": "https://www.app.com.pk/national/rs-300-mln-to-be-released-for-electricity-projects-in-chitral-na-told/",
  "date_published": "2020-01-09T00:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 9 (APP):Federal Minister for Energy Omar Ayub Thursday informed the National Assembly that Rs 300 million was allocated for upgradation of 132 kilowatt grid station and electrification of villages in Chitral.\nHe was responding to a calling attention notice of members of National Assembly Moulana Abdul Akbar Chitrali and Shahida Akhter Ali regarding delay in laying of electricity transmission lines to Union Councils Broze and Ayon and villages Kesu, Arsun, Ashreit and Arndu despite release of funds.\nThe minister told the house that Rs 150 million would be spent on upgradation of grid station and Rs 150 million on laying of transmission lines and electrification.\nThe finance ministry would soon release the allocated funds, he added.\nMNA Abdul Akbar Chitrali said the present power station in Chitral was inadequate to meet the power needs of the local population.\nOmar Ayub said the upgradation of power station would be carried out as the existing infrastructure was obsolete.\nHe said a plan was under consideration to get hydel electricity from Tajikistan for supply to areas of Chitral and Gilgit.\nWhile speaking on a point of order, MNA Shazia Sobia complained of the problem of overbilling at Parliament lodges.\nThe minister assured the house that National Electric Power Regulatory Authority (NEPRA) would announce new tariff to revise down electricity rates for community tube wells installed for purpose of supplying drinking water in different areas of Islamabad.\nHe was replying to a calling attention notice of MNAs Ali Nawaz Awan, Raja Khurram Shahzad and Nafeesa Inayatullah Khan Khattak regarding electricity connections for tube wells meant for community based supply schemes in Islamabad Capital Territory at the higher rate of A3 tariff instead of the lower DI tariff.\nHowever he said the reduction in tariff could not be done with retrospective effect.\nResponding to concerns of MNAs over a recent incident in Nankana Sahib, Omar said Pakistan was a peaceful country and every Pakistan was a free citizen and the government was bound to protect life and property of citizens.\nThe world was appreciating Pakistan while pointing fingers at India for its fascist mindset where minorities were being mistreated, he added.\nHe said Kashmir was turned into a jail and communication links were cut off.\nMinister for Religious Affairs Noorul Haq Qadri said the Nankana Sahib incident occurred when people were protesting against the local administration over the arrest of some persons.\nSome miscreants gave it a political colour and India used the incident to unleash propaganda against Pakistan, he said adding\nIndia was mistreating the minorities particularly the Muslims.\nHe said Pakistan was a safe and peaceful country and 5000 persons every month were allowed to visit Kartarpur corridor without any visa or travelling documents.\nReplying to a point of order, Parliamentary Secretary Aliya Hamza said the government was in the process of creating jobs in sectors of textile and power.",
  "retrievedAt": "2025-08-11T18:36:00.432Z"
}
