{
  "title": "Sultan Rahi was king of actions, expressions: Mustafa Qureshi",
  "link": "https://www.app.com.pk/culture-heritage/sultan-rahi-was-king-of-actions-expressions-mustafa-qureshi/",
  "date_published": "2020-01-08T23:35:00.000Z",
  "source": "APP",
  "content": "MULTAN, Jan 9 (APP)::Legend and pride of performance artist, Mustafa Qureshi, said on Thrusday that loudism of king of actions and expressions Sultan Rahi and his low tone in films was one of the main reasons for his super-hit movies.\nTalking to APP in connection with Sultan Rahi’s 24th death anniversary, Mustafa Qureshi said that Mr Rahi was liked home and abroad by his loud voice in action films.\nThe contrast of loud and low tones won them great appreciation from their fans.\nThe celebrated actor reminisced that though Rahi sahib was senior to him when he played against him in “Jailer tay Qaidi” the great artist extended complete cooperation with him.\n“Char khoon day piyase” was his first Punjabi film, he said and added that in the beginning of the carrier in film industry he acted in urdu films because Punjabi is not his mother tongue.\nSultan Rahi was not only a tremendous artist but a fine human being who worked free of charge for financially poor directors beside him, Mustafa Qureshi disclosed.\nRahi Sahib and he had much understanding in action films that’s why, non of them hurt each other while filming scenes.\nHowever, once he received injuries during director Hassan Askari’s film shooting, Sultan Rahi got much disturbed and hugged him instantly.\nAcclaimed actor recalled that Mr Rahi performed over 800 films, adding that the Nagar award winner actor used to start shooting at 7 am to 3 am next morning and he had to stand by him for it.\nMustafa Qureshi said that Sultan Rahi was a kind hearted and religious person who had performed several Umrah and hajj.\nPairing with Sultan Rahi was considered guarantee of super-hit Punjabi films, he added.\nScintillating performer Ghulam Mohiuddin said that Sultan Rahi won great place in the film industry with hard work and labour.\nHe said that change was the only constant thing in this universe, adding that Pakistani cinema witnessed these changes in Sultan Rahi’s era after acclaimed punjabi hero Lala Sudhir.\nReplying a question, he said that criticism on Sultan Rahi’s loudism was out of place because the critics themselves didn’t know how about it.\nLoudism is the part of performance of an actor, wherever, its required in the scenes.\nHe paid glowing tribute to Pakistan’s “Clint Eastwood” whose carrier spanned over four decades wherein he acted in 703 Punjabi and 100 Urdu films.\nSultan Rahi bagged 160 awards in his carrier for best performance.\nHis real name was Sultan Muhammad Khan. He was assassinated on\nJanuary 9, 1996 in Gujranwala.",
  "retrievedAt": "2025-08-11T18:36:02.203Z"
}
