{
  "title": "Crackdown against illegal cattle mandis launched; no leniency on SOPs compliance: NCOC",
  "link": "https://www.app.com.pk/national/crackdown-against-illegal-cattle-mandis-launched-no-leniency-on-sops-compliance-ncoc/",
  "date_published": "2020-07-23T22:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP):The National Command and Operation Centre (NCOC) on Friday announced the decision to initiate crackdown against illegal cattle mandis (markets) and violations of standard operating procedures (SOPs) reported in the cattle markets.\nThe decision was made as no illegal cattle market would be allowed to be established or operated whereas the district administrations were mobilized to enforce the Code of Conduct approved for cattle markets.\nMoreover, violations of health guidelines were being reported in cattle markets across the country, it added.\nThe NCOC noted that public health and safety was the top priority where the epidemic could only be controlled by adopting hygiene principles and precautionary measures against coronavirus.\nThe NCOC noted that massive crackdown of administrations in the federal capital, provinces including Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB) were initiated for implementation of SOPs and health guidelines.\nHowever, special monitoring teams in all provinces including AJK, GB and Islamabad would ensure implementation of SOPs whereas would result in fines and the closure of cattle markets.\n“It is important to keep wearing face masks and maintain social distance outdoors. If these precautions are not implemented, the epidemic will be difficult to control.”\nThe special monitoring team would enforce restrictions on working hours in cattle markets, limited entry of people and health guidelines in the mandis.\nThe Forum urged the masses to avoid mass gatherings on Eid as all recreational spots would be completely closed on Eid. The public was urged to refrain from going to bazaars and entertainment venues on Eid.\nIndividual safety was a guarantee of collective health and safety. As a responsible citizen, it should be realized that coronavirus could only be overcome with the cooperation of the people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:32:14.155Z"
}
