{
  "title": "Modi regime has crossed all limits in trampling human dignity in IOJK: Shibli",
  "link": "https://www.app.com.pk/national/nation-fully-alive-to-project-kashmir-at-intl-fora-shibli/",
  "date_published": "2020-07-24T05:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP):Minister for Information and Broadcasting Senator Shibli Faraz Friday said the nation, under the leadership of Prime Minister Imran Khan, had dedicated all efforts and energies to project the Kashmir issue at international fora. `”We shall continue to do so and we shall continue to extend our moral and ethical support to the Kashmiri brethren in their just struggle for the right to self-determination,” the minister said while addressing a seminar on “Kashmir under Siege” organized here by the Ministry of Information and Broadcasting. Shibli Faraz said the subjugation of Kashmiri Muslims had been going on for the last seven decades through military means, but the present Indian government had crossed all limits to trample human dignity on August 5, 2019 by unlawfully legitimizing its blatant acts of aggression in the Indian Occupied Jammu and Kashmir (IOJK).\nThe Modi government, he said, had surpassed all the previous regimes by abrogating articles 370 and 35 A of the Indian Constitution that conferred the special status on Occupied Kashmir, besides pledging not to change its demographic status.  He said the two articles, which were incorporated in the Indian Constitution soon after the partition of the Sub-continent, did create an impression in the world capitals that India was not trampling the solemn pledges made by its first Premier Jawaharlal Nehru made at international forums on Kashmir. “The soldiers can enter, rather break into, any house without a search warrant and take away any person on the pretext of ‘suspicious conduct’,” he maintained.\nA large number of Kashmiris picked up by the Indian troops and agencies, he added, never returned to their homes, leaving thousands of widows or half widows and orphans behind.\nThe discovery of mass graves in the Kashmir Valley, he said, spoke volumes of such atrocities, which were being camouflaged under the constitution with unjust and unjustified amendments made in it in sheer disregard for the universal principles of natural justice.\nMinister for National Food Security Syed Fakhar Imam, in his speech, said Prime Minister Imran Khan in his speech at the United Nations last year while challenging the Indian narrative had effectively advocated the cause of Kashmir.\nHe said time had changed now and “we should not expect from United States to play any big role in the settlement of Kashmir dispute.” Pakistan remained an ally of the US from 1960 to 2001 in the Afghan war, but Washington had never tried seriously to resolve the longstanding issue of Kashmir. Fakhar Imam said today the Kashmir dispute could lead to a war between two nuclear states. In the recent stand-off with China, India had been exposed that it was a bully. He said without Kashmir, Pakistan was not complete as a sovereign nation state. Like Kashmir, the Muslim majority areas of Hyderabad and Junagarh were also militarily occupied by India. It had also subjugated Goa.\nSpecial Assistant to the Prime Minister on National Security Dr Moeed Yousuf said the Indian narrative on Kashmir had been rejected by the civilized world after unilateral annexation of the disputed state by the Modi government.  He said that since August 5 last year there was not a single newspaper or news channel in the democratic world which had not called India a fascist power that had unleashed a reign of terror in the occupied Jammu and Kashmir. He said in the past, many prominent United States, United Kingdom and EU lawmakers used to follow the Indian narrative on the Kashmir issue. But after its annexation of held Kashmir last August, many world parliaments had passed resolutions condemning the human rights violations in the IOJK, which was a defeat of the Indian narrative.\nDr Moeed said Pakistan would continue its moral, diplomatic and political support to the Kashmiris’ just cause. Azad Jammu and Kashmir (AJK) President Sardar Masood Khan paid solemn tribute to the 10 million strong Kashmiri diaspora across the world for passionately highlighting the cause of Kashmiris. He warned of sinister designs of Indian leadership on Kashmir. India, he said, was conspiring to disintegrate Pakistan under its strategy of ‘Akhand Bharat’. “This is what Mohan Bhagwat says, this is what Narendra Modi says and this is what Rajnath Singh says,” he added. The Indian leaders in responsible positions, he said, were threatening Pakistan with disintegration through conventional warfare as they were pursuing the fascist policy of Hindutva.\nHe categorically stated that any attack on Azad Kashmir would eventually be deemed an attack on Pakistan. Sardar Masood said India had occupied Kashmir and its rulers were now bent on colonializing the disputed state. But Kashmir would ultimately become a part of Pakistan as per the Partition Plan of 1947. Had the voices of the people of Jammu and Kashmir were heeded to, it would have been included in Pakistan, he added. Secretary Information and Broadcasting Akbar Durrani said Pakistan would continue its efforts for highlighting the Kashmir issue at the international level. Due to the persistent efforts, now the people across the world had better knowledge about the Kashmir dispute.\nTerming it a very educative, informative and thought provoking seminar, he thanked the international media organizations for covering the event. Earlier, other speakers including Ahmed Barakat, Bureau Chief Al Jazeera, Prof Munawar Hussain, Area Study Centre, Quaid-e-Azam University, Professor Raja Qaiser Ahmad, Quaid-e-Azam University, former minister for social social welfare Azad Jammu and Kashmir Farzana Yaqub shed the light on the Kashmir dispute. They highly praised the Ministry of Information and Broadcasting for organizing the seminar to highlight the Kashmir dispute. They said people of Kashmir were facing atrocities of Indian forces and expressed the resolve that sooner or later they would get freedom. A photographic exhibition on Kashmir was also arranged on the sidelines of the main event.The seminar was attended by a large number of people from different walks of life.",
  "retrievedAt": "2025-08-11T19:32:06.180Z"
}
