{
  "title": "Senate body takes note of telecast of derogatory remarks against PM on PTV",
  "link": "https://www.app.com.pk/national/senate-body-takes-note-of-telecast-of-derogatory-remarks-against-pm-on-ptv/",
  "date_published": "2020-07-24T01:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP):The Senate’s Standing Committee on Information and Broadcasting on Friday took strong note of telecast of derogatory remarks against the prime minister on Pakistan Television (PTV) and sought an explanation from its managing director over the issue.  Senator Faisal Javed while chairing the meeting observed that the deleted words were being broadcast. The PTV was the mouthpiece of the state and proper coverage was everyone’s right but there was no moral justification for ridiculing anyone.\nRegarding the modernization of PTV, he asked which strategy was being adopted and what was the difference between the current management and the previous set-up. The news of resignation of many employees was also circulating which would be considered by the committee, he said.\nPTV MD Amer Manzoor informed the committee that steps were being taken to modernize all the channels of state telecaster. He said PTV Bolan had not been not closed.\nStressing the need to improve the coverage of PTV Parliament, Faisal Javaid said the Senate’s proceedings required to be properly aired. In the case of simultaneous sessions of the National Assembly and Senate, the people were deprived of the live coverage of the latter. An appropriate mechanism should be worked out to settle the issue.  The PTV managing director said manpower and technical capacity were needed so that a specific channel could be started for the purpose. Senator Faisal Javed assured that the committee would provide all possible assistance in that regard.\nSenator Pervaiz Rashid suggested that the parliament should have its own channel, which should continue broadcasts about the parliament and its committees. He said there was room to improve the PTV Parliament. Referring to the abduction and release of senior journalist Matiullah Jan, he said the journalist should be invited to present his views before the committee.  The committee deferred the PEMRA Amendment Bill 2020 presented by Senator Faisal Javed to its next meeting. It was unanimously decided that all aspects of the bill would be reviewed in the presence of all the members.  Senator Khushbakht Shujaat also attended the meeting. Secretary Information Akbar Durrani , Pakistan Electronic Regulatory Authority Chairman Saleem Baig and other senior officials were also present in the meeting.",
  "retrievedAt": "2025-08-11T19:32:13.869Z"
}
