{
  "title": "NDMA sounds alarm as torrential rains threaten widespread flooding",
  "author": null,
  "content": "ISLAMABAD, Aug 17 (APP):The National Disaster Management Authority’s (NDMA) National Emergency Operations Centre (NEOC) on Sunday issued an emergency alert following forecasts of heavy rainfall and potential flooding across multiple regions of the country over the next 24 hours.\nAccording to the alert, various areas in Punjab, Khyber Pakhtunkhwa, and Balochistan face the risk of flood-like conditions. Relevant institutions have been directed to take immediate precautionary measures.\nThe current weather system is active over the Pakistan region and may cause heavy to very heavy rainfall during the next 24 hours.\nHeavy to very heavy rainfall with thunderstorms is forecast for Islamabad over the next 24 hours, with intermittent breaks.\nWidespread rain is expected across Punjab, particularly in Potohar and northeastern districts including Rawalpindi, Attock, Jhelum, Chakwal, Lahore, Gujranwala, Sialkot, Gujrat, Narowal, Hafizabad, and Mandi Bahauddin, raising the risk of urban flooding.\nCentral and southern districts Multan, D.G. Khan, Rajanpur, Layyah, Bhakkar, and Sahiwal—are likely to see scattered thunderstorms. Light, isolated showers may occur in Bahawalpur, Bahawalnagar, and Rahim Yar Khan.\nNorthern and upper Khyber Pakhtunkhwa districts, including Swat, Buner, Shangla, Dir, Mansehra, Battagram, Abbottabad, and Malakand, are expected to receive heavy rainfall over the next 24 hours, with potential flash floods and landslides in hilly areas.\nScattered thunderstorms are forecast for the Peshawar valley—covering Peshawar, Charsadda, Nowshera, Mardan, and Swabi. Southern districts including D.I. Khan, Tank, Bannu, Lakki Marwat, Karak, and Kohat may experience scattered rain and thunderstorms, with occasional heavy falls.\nDistricts including Muzaffarabad, Rawalakot, Bagh, Haveli, Kotli, Mirpur, and Bhimber are likely to receive heavy rainfall and thunderstorms. The downpours may trigger landslides and flash flooding, especially in mountainous terrain.\nIsolated rainfall is expected in Gilgit, Skardu, Hunza, Ghizer, Diamer, Astore, Ghanche, and Shigar, with possible debris flows, landslides, and local flooding in valley areas.\nCoastal districts including Karachi, Thatta, Sujawal, Badin, and Tharparkar may see intermittent showers or thunderstorms.\nCentral and upper Sindh—Hyderabad, Nawabshah, Dadu, Khairpur, Sukkur, Ghotki, Larkana, Shikarpur, Jacobabad, and Kashmore—are likely to receive isolated to scattered moderate to heavy rainfall amid hot, humid conditions.\nEastern, southeastern, and coastal districts of Balochistan—Lasbela, Khuzdar, Awaran, Kalat, Gwadar, Turbat, and Panjgur—are expected to receive scattered rainfall and thunderstorms over the next 24 hours.\nNorthern and central districts including Quetta, Ziarat, Zhob, Loralai, Barkhan, Musa Khel, Dera Bugti, and Kohlu may see isolated light showers.\nNDMA has urged citizens to avoid non-essential travel and remain alert to changing weather conditions. People are advised to park vehicles in safe areas, away from trees, signboards, and weak structures, and to avoid movement near rivers, streams, and landslide-prone zones. Crossing submerged roads, bridges, or fast-flowing water channels is strongly discouraged. NDMA has instructed all relevant institutions to take precautionary measures, ensure machinery and pumps are ready for drainage in low-lying areas, and respond swiftly to any emerging threats. Citizens are urged to follow all official guidelines without delay.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-18T02:35:14.495Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ndma-sounds-alarm-as-torrential-rains-threaten-widespread-flooding/",
  "dateList": "2025-08-17",
  "date_published": "2025-08-18T03:45:00.000Z"
}
