{
  "title": "Telenor ensures seamless connectivity in flood-affected regions",
  "author": null,
  "content": "ISLAMABAD, Aug 17 (APP):In response to the devastating floods in Khyber Pakhtunkhwa (KP) and Gilgit-Baltistan (GB), Telenor Pakistan has taken urgent steps to keep its network running and ensure uninterrupted connectivity for affected communities.\nWith torrential rains creating severe challenges, the company mobilized its resources on priority to maintain seamless connectivity across its widest network in the affected areas during this difficult time.\nAs part of its relief efforts, Telenor Pakistan has also announced a special offer of free minutes for its subscribers in flood-hit areas of KP and GB, enabling them to stay connected with loved ones, emergency responders, and relief agencies during this critical time. The complimentary minutes, valid for three days, can be activated by dialing *345*29#.\nThis initiative focuses on the most severely impacted regions where heavy rains and flash floods have disrupted lives, livelihoods and strained essential communication infrastructure. By providing seamless connectivity and offering free minutes, Telenor Pakistan is helping facilitate immediate relief and coordination efforts on the ground.\nCommenting on the initiative, Khurrum Ashfaque, CEO, Telenor Pakistan, said: “Our teams are on the ground ensuring seamless connectivity in flood-affected regions, and by offering free calling we are helping people remain connected with their families and relief agencies when it matters the most.”\nTelenor Pakistan has a long-standing commitment to supporting communities in times of crisis by strengthening network resilience, enabling emergency connectivity solutions, and working closely with authorities to aid relief efforts. The company reaffirms its dedication to standing alongside the people of Pakistan in times of need.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-18T02:35:14.500Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/telenor-ensures-seamless-connectivity-in-flood-affected-regions/",
  "dateList": "2025-08-17",
  "date_published": "2025-08-18T03:06:00.000Z"
}
