{
  "title": "NHA chairman visits KP,oversees rehabilitation of roads affected by rains & floods",
  "author": null,
  "content": "ISLAMABAD, Aug 17 (APP):On the instructions of the Federal Minister for Communications, the National Highway Authority (NHA) has mobilized all resources for the rehabilitation of national highways damaged by recent rains in the country’s northern regions.\nAs part of this effort, NHA Chairman Shehryar Sultan has been personally present in the field over the past three days, leading relief and restoration operations, said a press release issued on Sunday.\nThe Chairman is overseeing rehabilitation activities in Khyber Pakhtunkhwa, where multiple roads have been affected by rain and flooding.\nThe Chairman of NHA on Sunday visited Bonair and held a meeting with the Deputy Commissioner Bonair in his office along with senior NHA officers. The Chairman extended full support of NHA in restoration work and directed NHA officers to mobilize more machinery to accelerate the pace of work.\nDuring his visit, he inspected the Nowshera–Chitral Highway (N-45) and issued on-site directives for its swift and complete restoration.\nHe also visited the Chakdara–Khwazakhela Highway (N-95), assessed the flood-affected sections, and instructed teams to expedite repair work.\nIn addition, he toured the Khwazakhela–Bisham Highway (N-90), reviewed the extent of damage, and issued immediate instructions for its full restoration.\nDuring his visit, the Chairman directed NHA teams to work day and night to ensure the timely rehabilitation of roads across Khyber Pakhtunkhwa.\nHe remained in close coordination with the Chief Secretary of Khyber Pakhtunkhwa and local administration officials throughout the visit.\nBeyond national highways, the Chairman also offered NHA’s assistance in restoring roads managed by the provincial government. To facilitate this, he formed a special committee, led by an NHA Member, to coordinate support for the rehabilitation of provincial roads.\nAs per the Chairman’s directive, the designated NHA Member will remain on-site in Buner and other affected areas until the restoration work is completed.\nThe Chairman is also continuously monitoring road rehabilitation efforts in other parts of the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-18T02:35:15.302Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nha-chairman-visits-kpoversees-rehabilitation-of-roads-affected-by-rains-floods/",
  "dateList": "2025-08-17",
  "date_published": "2025-08-18T03:04:00.000Z"
}
