{
  "title": "PPP KP chapter finalizes strategy for political activities",
  "link": "https://www.app.com.pk/national/ppp-kp-chapter-finalizes-strategy-for-political-activities/",
  "date_published": "2023-02-19T14:34:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 19 (APP): Pakistan Peoples’ Party (PPP), Khyber Pakhtunkhwa chapter has finalized a strategy regarding political activities in future and decided that the provincial cabinet would be taken on board on all important matters of the Party.\nIn this connection, a meeting of the PPP Khyber Pakhtunkhwa cabinet was held here Sunday with acting provincial president and Minister of State, Mohammad Ali Shah Bacha in the chair. Besides, Secretary Information, Amjad Khan Afridi, Syed Ayub Shah, Senator Robina Khalid, Saleem Khan, Malik Saeed Khan, Malik Tehmash Khan, Gohar Inqilabi, Shoaib Alam, Farzand Ali Khan, Yawar Naseer, Dr Zulfikar and Liaquat Shabab, other office bearers also attended the meeting.\nThe meeting discussed in detail the prevailing national and provincial level situation and took important decisions in that context.\nThe meeting was also given a detailed briefing regarding launching a mass public contact campaign and evolved strategy in that regard.\nAddressing the meeting, Mohammad Ali Shah Bacha said that the champions of court arrests (Jail Baharo Tehreek) are seeking pre-arrest bails, saying the PTI chief has bandaged his leg since last four months and is hiding in his Zaman Park residence.\nHe said that Imran Khan during his rule, registered fake cases against his political opponents and imprisoned them for a long time. He said that those who are making hue and cry over the agreement with the International Monetary Fund (IMF) themselves had reached an agreement with it.\nOn this occasion, Senator Robina Khalid accused the PTI chief Imran Khan of spreading anarchy in the country and called for an investigation against him in the Billion Tree Tsunami, Malam Jabba and recruitment scams of his era. She further demanded the National Accountability Bureau (NAB) and other agencies to initiate investigation against the PTI leadership.",
  "retrievedAt": "2025-08-11T06:07:34.593Z"
}
