{
  "title": "PUC celebrating 33 years of foundation with 10-day activism",
  "link": "https://www.app.com.pk/national/puc-celebrating-33-years-of-foundation-with-10-day-activism/",
  "date_published": "2023-02-19T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP): Pakistan Ulema Council (PUC) Chairman Hafiz Muhammad Tahir Mehmood Ashrafi on Sunday said the council was celebrating its 33 years of foundation with 10-day activism from February 18 to 28 across the country.\nAshrafi, who is also Special Representative of the Prime Minister on Interfaith Harmony and Middle East in an exclusive talk with APP, said the PUC, established in 1990, had organized a number of religious programmes including conventions and seminars and Paigham-e-Islam Conference would also be held in March in this connection.\nHe said the council was member of various national and international organizations and playing a vibrant role for inter-sect and inter-faith harmony on the globe.\nHe said it had set some targets to achieve in the year 2023 and 2024, and the system of Khilafat-e-Rashida was on its main agenda.\nHe said it would continue its efforts to establish the system of Khilafat-e-Rashida in the country as it was based on justice and equality.\nHe said these days, there was so much talk of holding elections at every nook and cranny of the country adding that the elections must be held as per law of the land.\nAshrafi further informed that the PUC had decided not to contest elections until and unless the misuse of huge money was strictly prohibited in it adding that it would extend its support to their like-minded people who would fight the elections in their respective constituencies across the country.\nCiting example of Nankana Sahib’s disappointing incident, he said there should be an effective mechanism to deal with increasing polarization and extremism in the society. Nobody would be allowed to use Mehrab-o-Mimber for death and destruction in the country anyway, he added.\nHe went to say that if someone was accused of desecration of the Holy Quran or blasphemy of the Holy Prophet Muhammad (Peace Be Upon Him) would be punished by the court of law, also adding that nobody would be given free hand to be complainant, judge and executioner.\nHe proposed that we had to mend our ways as such inhuman incidents were bringing bad names to Pakistan, Muslims and Islam across the world.",
  "retrievedAt": "2025-08-11T06:07:34.450Z"
}
