{
  "title": "Sehba Akhtar’s literary contributions remembered on his death anniversary",
  "link": "https://www.app.com.pk/national/sehba-akhtars-literary-contributions-remembered-on-his-death-anniversary/",
  "date_published": "2023-02-19T07:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP): Literary circles mark the 27th death anniversary of renowned poet and songwriter Sehba Akhtar who left a lasting impact on Urdu literature.\nAkhtar, who was born on 30 September 1931 in Jammu, spent most of his life in Bareilly and Aligarh, where he was brought up by his mother. Despite facing numerous challenges in his early life, Akhtar’s love for poetry never waned and he continued to write throughout his life.\nAkhtar’s early years were marked by financial hardships, which forced him to take on a number of short-term jobs. He eventually landed a job as an inspector in the government food department, where he was later promoted to the post of ration collector. During this time, he began writing poetry and published his work under the pen name, Sehba Akhtar.\nAkhtar’s literary career took off after he began working with radio and entered the world of films, where he composed songs that were both popular and enduring. He was also associated with the Herald for a period of seven years, where his Qataat were the highlight of Mashriq.\nIn addition to his work in poetry and songwriting, Akhtar was involved in many other aspects of literature and composed more nazms than ghazals. His patriotic songs and dohaas were particularly popular among readers and listeners.\nOn 19 February 1996, Akhtar passed away in Karachi, leaving behind a legacy that continues to inspire new generations of poets and writers. He was the author of several acclaimed collections, including Sarkasheeda, Iqr’aa, Samander, and Misha’I, and was awarded the President’s Medal for his contribution to literature.\nAs the literary community marks the 27th anniversary of Sehba Akhtar’s passing, his life and legacy and the many ways in which he enriched the Urdu literary tradition is being remembered. His poetry and songs continue to resonate with audiences around the world and remind them of the power of words to inspire, comfort, and bring literature lovers together.",
  "retrievedAt": "2025-08-11T06:07:45.040Z"
}
