{
  "title": "PM for more coordination over relief assistance to Turkiye, Syria",
  "link": "https://www.app.com.pk/national/pm-for-more-coordination-over-relief-assistance-to-turkiye-syria/",
  "date_published": "2023-02-19T10:06:00.000Z",
  "source": "APP",
  "content": "LAHORE, Feb 19 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said that for the purpose of coordination, all relief assistance to the earthquake-affected people of Turkiye and Syria should be dispatched through National Disaster Management Authority (NDMA).\nThe prime minister lauded the humanitarian and charity organizations for their ongoing relief work in the quake-hit areas of Turkiye and said that Pakistani humanitarian organizations were in the forefront to support their affected brethren and sisters in these countries.\nThe prime minister was chairing a high-level meeting to review the ongoing relief activities, on part of Pakistan, in the quake hit Turkiye and Syria.\nThe meeting was attended by representatives of Edhi, Saylani and Al-Khidmat Foundation, Minister for Planning Ahsan Iqbal, PM’s Special Assistant Syed Tariq Fatemi, ambassadors of Pakistan to Turkiye and Syria and other high officials, PM Office Media Wing said in a press release.\nThe prime minister, during the meeting, observed that relief assistance to these countries should be sent in accordance with the requirements of the earthquake-affected people and stressed upon ensuring of quality relief goods.\nThe prime minister also constituted a sub-committee to be headed by the minister for planning. The committee would be tasked to share information among the government and humanitarian organizations over the dispatch of relief goods.\nThe prime minister said through exchange of real-time information, the quake victims of Turkiye and Syria could be supported in a well-organized manner.\nThe meeting was apprised of the details of the relief assistance sent to these two countries through NDMA.\nChairman NDMA Lieutenant General Inam Haider Malik informed the meeting that under prime minister’s previous directive, the cost and preparation time for tents had been decided in consultation with the tent manufacturing industries.\nBy the end of next month, the government of Pakistan would send 1,00,000 winterized tents to Turkiye. These tents were being prepared keeping in view the weather requirements and in consultation with the Turkish Disaster and Emergency Management Presidency (AFAD).\nFaisal Edhi, Maulana Bashir Farooqi of Saylani Trust and Abdul Shakoor of Al Khidmat Foundation briefed the meeting about the details of relief consignments sent to the quake-affected countries which included tents, medicines, edible items, blankets and warm clothes. Besides, medical teams had also been sent to these countries.\nThe prime minister appreciated the working of the charity organizations and directed NDMA to keep constant coordination with them.\nHe also directed for further strengthening of supply chain of the relief items and asked for submission of a comprehensive mechanism for the next month in this regard.",
  "retrievedAt": "2025-08-11T06:07:42.230Z"
}
