{
  "title": "Electoral fairness hinges on ECP’s independence, says Justice Ayesha Malik - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Additional note explains SC verdict overturning de-seating of MNA Bazai\n• Justice Shah says Article 63A does not empower ECP to determine facts\n\nISLAMABAD: Justice Ayesha A. Malik of the Supreme Court has emphasised that the Election Commission of Pakistan (ECP) is an independent body entrusted with the responsibility of conducting free and fair elections, as well as ensuring that the representatives chosen by the people uphold their mandate in government.\n\n“The independence of ECP is a fundamental safeguard in a democratic system which maintains the integrity of the elections and ensures that the will of the people translates into their consent to be governed by the elected representatives,” Justice Malik observed on Monday in an additional note she authored to explain why the apex court had on Dec 12, 2024 set aside the Nov 21, 2024 de-seating of MNA Adil Khan Bazai by the ECP on alleged floor crossing.\n\nA three-judge SC bench, headed by Justice Syed Mansoor Ali Shah and consisting of Justice Ayesha Malik and Justice Aqeel Ahmed Abbasi, had taken up a set of appeals filed by Adil Bazai against the ECP’s decision in response to a Nov 1, 2024 reference by the National Assembly Speaker in terms of Article 63A of the Constitution on defection from the PML-N parliamentary party.\n\nThe bench had also restored Adil Bazai’s membership of the National Assembly from NA-262 constituency as an independent member, not as a member of the PML-N parliamentary party.\n\nThe additional note stated that ensuring the will of the people to form government was what gives legitimacy to the government because it was based on the choice of the people. “This is what builds public confidence, protects the rule of law and protects people from political manipulation.”\n\nThe Supreme Court has always reminded the ECP that elections were the lifeline to democracy and the commission was the guarantor of electoral integrity. The independence of the ECP is, therefore, fundamental to the election process without which the very foundation of democracy is undermined, the note said.\n\nIt added that the apex court also recognised and declared that the ECP should not become subservient to political influences, or political engineering, rather remain an impartial custodian of democracy as any leaning of ECP in favour of the government would compromise the legitimacy of the political system.\n\n“At the heart of protecting electoral integrity is the right to vote and the exercise of this right, by the people. The supremacy of the vote underscores the idea, that power and legitimacy in a democratic system derives its consent from the governed which is why an independent constitutional body is required to ensure that the will of the people by way of election is actualised.\n\n“It is unfortunate that despite clear pronouncements by the Supreme Court, ECP conducts itself in a manner that is not in line with its constitutional duty rather aligned with the notion that they have the constitutional power to disregard other constitutional institutions and the basic right of the vote,” the note regretted.\n\nECP jurisdiction\n\nMeanwhile, Justice Syed Mansoor Ali Shah in his judgement observed that Article 63A of the Constitution has never expressly conferred power on the ECP to determine facts before exercising its jurisdiction to confirm, or otherwise, declare defection of a member.\n\nIn the judgement, Justice Shah explained that Article 63A does not explicitly entrust the ECP with the power to determine preliminary or jurisdictional facts for the declaring defection done by the member.\n\n“The finding on a jurisdictional fact, such as whether a member belongs to the Parliamentary Party of a political party, is not conclusive; rather, it is subject to correction by the Supreme Court and ultimately to final determination by a Civil Court of plenary jurisdiction,” the judgement observed.\n\nJustice Shah stated that the PML-N’s party head failed to provide a single instance demonstrating that the appellant acted as a member of its parliamentary party in the National Assembly. Therefore, the commission’s findings on the genuineness and validity of the consent affidavit of Feb 16, 2024 are contrary to the weight of the material on record and, therefore, legally unsustainable, the verdict explained.\n\n“Since the appellant is not found to be a member of PML-N’s parliamentary party, the declarations made by PML-N’s party head regarding the appellant’s defection from that party, and the confirmation thereof by the co­­m­­mission were without jurisdiction,” the judgement said.\n\nBefore concluding, Justice Shah also clarified that the finding of the apex court regarding the genuineness and validity of Feb 16 consent affidavit was subject to final determination by the Civil Court.\n\n“Given the seriousness of the appellant’s allegations regarding the fabrication and use of a false consent affidavit against Muhammad Shehbaz Sharif, then president of PML-N and now the prime minister of Pakistan, we expect that the Civil Court, where the civil suit is sub judice, and the magistrate, before whom the criminal complaint is pending adjudication, will decide the matter as early as possible,” the judgement explained.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:51:12.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886649/electoral-fairness-hinges-on-ecps-independence-says-justice-ayesha-malik",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:00:36.000Z"
}
