{
  "title": "WHO seeks full Gaza access during truce - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: The World Health Organisation said on Sunday it was ready to pour much-needed aid into Gaza during the truce, but that it would need “systematic access” across the territory to do so.\n\nMuch of the Gaza Strip’s health infrastructure has been destroyed by the more than year-long conflict between Israel and Hamas before a ceasefire took hold on Sunday.\n\nWHO chief Tedros Adhanom Ghebreyesus welcomed the ceasefire, posting on social media that it would “bring great hope for millions of people whose lives have been ravaged by the conflict”. But he added that “addressing the massive health needs and restoring the health system in Gaza will be a complex and challenging task, given the scale of destruction, operational complexity and constraints involved”.\n\nWhile the United Nations’ health body was “ready to scale up the response” to address the territory’s critical needs, it said in a statement that “it is critical that the security obstacles hindering operations are removed”.\n\n12,000 people, out of over 110,000 wounded, need to be evacuated for treatment elsewhere\n\n“WHO will need conditions on the ground that allow systematic access to the population across Gaza, enabling the influx of aid via all possible borders and routes, and lifting restrictions on the entry of essential items,” the agency said in a statement.\n\nUntil the truce, Israel had complete control over the volume and nature of aid allowed into Gaza.\n\nWarning that the “health challenges ahead are immense”, the Geneva-based agency estimated the cost of rebuilding Gaza’s battered health system in the years to come at “billions in investment”. Last week the WHO put the figure at more than $10 billion.\n\n“Only half of Gaza’s 36 hospitals remain partially operational, nearly all hospitals are damaged or partly destroyed, and just 38 percent of primary health care centres are functional,” the WHO said.\n\nBasing its figures on those provided by the health ministry in the Hamas-run territory, which the UN considers reliable, the WHO put the conflict’s toll in Gaza at more than 46,600 people killed and over 110,000 wounded.\n\nA quarter of those wounded “face life-changing injuries and will need ongoing rehabilitation,” the UN body estimated.\n\nAround 12,000 people need to be evacuated for urgent treatment elsewhere, it added, while warning the destruction of health infrastructure had had knock-on effects.\n\nThe WHO also expressed concern over the “breakdown of public order, exacerbated by armed gangs” interfering with aid deliveries to Gaza.\n\nPlight of 2.4m displaced\n\nIn the tiny coastal territory, practically everyone knows at least one person from the tens of thousands killed in the conflict, or at the very least someone who lost a loved one.\n\nAnd nearly all of the besieged territory’s 2.4 million residents have been displaced at least once during the war, according to UN figures. Many have nowhere to return to with more than 60 percent of buildings across Gaza damaged by fighting, shelling or air strikes.\n\nIn central Gaza, pedestrians and drivers moved around freely on Monday along the main coastal road that hugs the Mediterranean Sea, a semblance of normal life save for the rows of hundreds of tents housing displaced families. Even those with a house — or mere walls — to return to must still guarantee basic conditions before proper rebuilding can begin.\n\nStill, some took to repainting a wall still standing, or searched through the rubble for any belongings the could still salvage.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678ef08d4173f.gif",
  "retrievedAt": "2025-10-12T00:56:47.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886682/who-seeks-full-gaza-access-during-truce",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T01:58:33.000Z"
}
