{
  "title": "Saudi’s Manara Minerals to buy 10 to 20pc stake in Pakistan’s Reko Diq gold project: report - Business - DAWN.COM",
  "author": null,
  "content": "Saudi Arabian mining fund Manara Minerals is set to buy a 10-20 per cent in the Reko Diq copper and gold project in Pakistan for proceeds of about $500 million to $1 billion, the Financial Times reported on Tuesday.\n\nManara Minerals would buy the equity stake from the government of Pakistan, which owns 25pc of the mine, in the project, which is being co-developed by Canada’s Barrick Gold, the FT said, citing sources close to the discussions.\n\nExecutives from Manara visited Pakistan in May last year for talks about buying a stake in the Reko Diq mine, considered one of the world’s largest underdeveloped copper-gold areas by global mining company Barrick Gold, which owns the project jointly with Pakistan.\n\nAccording to the report, Manara Minerals has planned to buy “between 10-20 pc of the $9bn complex, which is being developed by Barrick Gold, and secure an offtake agreement for future output”.\n\nBarrick Gold owns a 50pc stake in Pakistan’s Reko Diq mine, with the remaining 50pc owned by the governments of Pakistan and the province of Balochistan.\n\nBarrick considers the mine one of the world’s largest underdeveloped copper-gold areas.\n\nIn August 2024, Barrick Gold’s chief executive had said that the company was open to bringing in Saudi Arabia’s wealth fund as one of its partners in Pakistan’s Reko Diq gold and copper mine.\n\nAccording to FT, Saudi Arabia is “one of the biggest external creditors” to the country, “which it has lavished with loan rollovers, central bank deposits and oil facilities to help service the $9.2bn of debt”.\n\nThe report also noted that govt officials have been “aggressively courting Saudi investments in recent months” as the kingdom’s “appetite for financially propping it up is running thin”.\n\nThe history of Rekodiq has been marred by political turmoil, and judicial overreach, but as things are put in motion, as work progresses, the mine may start producing copper and gold by 2028 — right when the market for copper is at its tightest.\n\nBarrick Gold estimates that an initial capital expenditure of $5.5bn will be incurred to develop the first phase of the mine, which may be referred to as a starter mine, that can produce 200,000 tonnes of copper concentrate, and 250,000 ounces of gold annually.\n\nA subsequent expansion may call for capital expenditure of another $3.5bn, which would double the size of the mine to 400,000 tonnes of copper and 500,000 ounces of gold.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:50:42.309Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886746/saudis-manara-minerals-to-buy-10-to-20pc-stake-in-pakistans-reko-diq-gold-project-report",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T08:04:05.000Z"
}
