{
  "title": "SC constitutional bench likely to hear pleas against amendment in a week’s time - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court constitutional bench is likely to take up on Jan 27 a set of challenges to 26th Amendment as well as seeking an inquiry through a judicial commission to determine if required votes in favour of the package were voluntarily or any coercion or other unlawful inducement were at play.\n\nHeaded by Justice Aminuddin Khan, a seven-judge constitutional bench is expected to commence the hearing on Jan 27 in which the petitioners — high court bar associations as well as individuals — had also requested the SC for a full court hearing instead of a hearing by the constitutional bench, which was established under 26th Amendment.\n\nThe petitioners also challenged the constitutionality of the constitutional benches, arguing that the SC should declare invalid all amendments for which votes of such members, whose election disputes were pending, were necessary to achieve the prescribed numerical threshold in Article 239.\n\nThey requested the apex court to strike down the entire 26th Amendment on the grounds of procedural impropriety if determined that the requisite two thirds of the lawfully elected membership of each House did not freely exercise their right to vote in favour of the same as required under Article 239.\n\nSC urged to ascertain legal status of certain changes to Constitution\n\nIn the alternative, the petitioners pleaded, the court should strike down certain provisions of the 26th Amendment since they substantively undermine the independence of the judiciary which is a salient feature of the Constitution: namely the provisions for annual performance evaluation of judges of the high court by the Judicial Commission of Pakistan being inserted in Article 175A(1) and Articles 175A(18) to (20); the provisions relating to the appointment of the chief justice of Pakistan being the substitution to Article 175A(3) and the provisions for constitutional benches of the apex court and high courts.\n\nAs a consequence, the court should declare that the original Article 175A(3) holds the field and direct the federal government to notify SC’s senior most judge as CJP in accordance with the original Article 175A(3).\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2109434933d7a31.jpg",
  "retrievedAt": "2025-08-26T07:51:12.960Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886650/sc-constitutional-bench-likely-to-hear-pleas-against-amendment-in-a-weeks-time",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:00:36.000Z"
}
