{
  "title": "KP to engage with Afghan Taliban govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: Advocating for dialogue to settle disputes, Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur on Monday said that he would send a delegation to Afghanistan within two weeks to seek solutions to Pak-Afghan issues.\n\n“The federal government talked about negotiations with Afghanistan over bilateral issues, but there’s no success. Now, the dialogue with Kabul will be held at the provincial level. A delegation of our [KP] government will meet Afghan officials within two weeks,” Mr Gandapur told reporters after inaugurating his government’s ‘Sasti Roti’ initiative at the Kutchery Chowk Shelter Home here.\n\nThe chief minister also said that in the next phase, a delegation of tribal elders from the province would engage with the Afghan Taliban government. He expressed optimism that the Afghan government would cooperate with the provincial teams.\n\nMr Gandapur said that the issues with Afghanistan would be resolved through negotiations.\n\nCM says terrorism can’t be eliminated through operations, strikes\n\nHe said that he had suggested many times that terrorism couldn’t be eliminated through operations and strikes.\n\nThe chief minister criticised his Punjab counterpart Maryam Nawaz for diatribe against the PTI and complained about the inclusion of her and her mother’s information and images in the Pakistan Studies textbook of the province.\n\nHe sarcastically said that if there were ever a subject on make-up in Pakistan, Maryam Nawaz’s picture should be on the cover.\n\nMr Gandapur said that the Punjab chief minister could excel in a make-up competition only and she lacked competence in other areas.\n\nHe alleged that the PML-N-led federal government was booking political rivals, especially PTI leaders and workers, in false cases.\n\nThe chief minister insisted that PTI founder Imran Khan’s wife Bushra Bibi was being unfairly targeted over the Al-Qadir Trust affair.\n\nHe said that while the Al-Qadir Trust University offered free education to poor students, the PTI founder and his wife, who initiated that project, were targeted out of political revenge.\n\nMr Gandapur said those who looted money, illegally bought flats abroad and laundered money were roaming around freely.\n\nHe said those who handled the Al-Qadir Trust case should better manage their own institutions well.\n\nThe chief minister said that Imran and Bushra Bibi believed in the rule of law despite their “illegal” punishment in the Al-Qadir Trust case.\n\nHe said that the PTI was striving for the restoration of real democracy and the rule of law and the Constitution in the country.\n\nMr Gandapur said the party’s struggle for an independent judiciary and freedom of media would continue.\n\n“We demand protection of the people’s fundamental rights and will make no compromise on it,” he said.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:51:02.736Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886599/kp-to-engage-with-afghan-taliban-govt",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:01:22.000Z"
}
