{
  "title": "Rangers take up anti-power theft operation in Lesco - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan Rangers (Punjab) teams have been deployed in the Lahore Electric Supply Company (Lesco) region to launch major operations against power theft and recover dues from major chronic defaulters.\n\nThe Rangers teams will assist Lesco officials in carrying out raids along with Federal Investigation Agency (FIA) officials, according to an official source in Lesco.\n\n“Rangers and FIA are assisting Lesco teams following an approval from the Ministry of Interior, in light of a request from the Ministry of Energy (Power Division), to whom the Lesco administration had proposed the deployment for the launch of major and result-oriented operations,” the source explained.\n\nAlso, the Rangers carried out a flag march in the Cantonment area on Monday.\n\nAn official said Lesco decided to seek the help of Rangers after power thieves in troubled areas attacked its teams in various incidents following their operations.\n\nThe troubled/high-risk areas in Lesco include various parts of Kasur district, areas falling in Lesco’s Baghbanpura and Shalamar divisions in Lahore city, Kot Abdul Malik, Ferozewala, and Muridke divisions in Sheikhupura district, among others.\n\nKasur district reportedly ranked first among all districts in Punjab for power theft in 2023, with 10 of the total 26 highest loss-making grid stations, causing losses worth Rs17 billion annually to the exchequer.\n\nThe worst loss-making grid stations include Khudian, Kasur, Pattoki, Bhai Pheru, New Kasur, Kanganpur, Ellahbad, Chunian, and Laliani.\n\nThe other 18 high-loss grid stations include Shahdara (new), Shamke, Rustam, Haveli, Batapur, New Ghazi, Chuhng, Mominpura, Raiwind, Sharaqpur, Dipalpur, Kahna, Dinwali, Sabzazar, Johar Town, Bund Road, Shahdara Scarp, and Kot Radha Kishan.\n\nMoreover, there are a total of 103 high-loss feeders in all service areas of Lesco falling in Lahore, Kasur, Okara, Sheikhupura, and Nankana Sahib. Of these, 77 feeders are in Kasur alone, placing the district at the top of the 2023 list in power theft.\n\nINSPECTION: Ravi Assistant Commissioner Tariq Shabbir inspected development projects in union councils No 17 and 37.\n\nHe also visited the development scheme underway in Union Council No 22 and directed the acceleration of work.\n\nMeanwhile, a progress review meeting on the Lahore Development Plan was held in the Data Ganj Bakhsh Zone, chaired by City Assistant Commissioner Babar Ali Rai.\n\nThe meeting involved detailed discussions on ongoing projects, and contractors were instructed to expedite the pace of work.\n\nShalimar Assistant Commissioner Dr Anum Fatima reviewed the work in progress at Union Council No 154 and expressed satisfaction over the pace of development.\n\nMeanwhile, Deputy Commissioner Musa Raza, while inspecting project sites, said the LDP was a significant undertaking aimed at enhancing the city’s infrastructure and providing improved amenities to its residents.\n\nHe affirmed that no laxity in the project would be tolerated and that timely completion is a primary objective. He directed officials to maintain a strong field presence, monitor the work, and promptly address any obstacles.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:50:44.422Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886716/rangers-take-up-anti-power-theft-operation-in-lesco",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T03:09:41.000Z"
}
