{
  "title": "First flight lands at new Gwadar airport - Newspaper - DAWN.COM",
  "author": null,
  "content": "GWADAR: Pakistan’s largest airport, the Gwadar International Airport, became operational on Monday with the landing of the first PIA flight from Karachi carrying 46 passengers.\n\nDefence Minister Khawaja Asif and Balochistan Chief Minister Mir Sarfraz Bugti welcomed the passengers of the inaugural flight with flowers.\n\nAddressing the gathering at a grand ceremony on the occasion, the federal minister declared the new Gwadar International Airport as “not an end but a beginning”.\n\n“We have turned a dream into reality with the inauguration of an airport at Gwadar,” Mr Asif said.\n\n“The airport symbolises a new era of prosperity for the people of Gwadar and the rest of Balochistan. It will generate job opportunities and boost business,” the minister added.\n\nAsif calls new airport vital component of CPEC; CM Bugti boasts of employment opportunities for locals\n\nHe described the airport as a milestone in the country’s aviation history and thanked everyone who contributed to its completion, calling it a “beacon of hope for Pakistan’s future”.\n\nMr Asif said the new airport is a vital component of the China-Pakistan Economic Corridor. “The masterminds who envisioned CPEC prioritised the establishment of this state-of-the-art airport, recognising its potential to accelerate the region’s development,” he observed.\n\nThe defence minister held up the collaboration between Pakistan and China for building Gwadar airport as a testament to their “storied partnership”.\n\nHe acknowledged the tireless efforts and expertise of Pakistani and Chinese teams, whose dedication helped build an airport that conformed to international standards.\n\nMr Asif also expressed gratitude to the Chinese government for its assistance, calling the airport a gift that would benefit the people of Balochistan and the rest of Pakistan.\n\nThe new Gwadar International Airport, the minister said, would transform the region and the entire country. “It is more than just an airport — it is a gateway to progress and will play a crucial role in laying new infrastructure and spur trade and tourism.”\n\nThe airport would attract investors, improve the quality of life for the people of Gwadar and encourage cultural exchanges, Mr Asif added.\n\nBalochistan CM\n\nIn his speech at the ceremony, the Balochistan chief minister said that the inauguration of the Gwadar International Airport would turn out to be “a milestone for the speedy development of the province”.\n\n“This airport is a historic project not only for Balochistan but also for the entire country. It will open up new vistas of trade, investment and tourism,” CM Bugti said.\n\nGwadar Airport is equipped with the latest technology and capable of handling large aircraft.\n\nThe chief minister said the new airport would connect Balochistan with major cities of the world and bring about immense progress in the province.\n\nCM Bugti said this project would also provide employment opportunities to the locals.\n\n“The people of Gwadar have always played a key role in the development of Balochistan and the new airport will hopefully speed up this process.”\n\nMr Bugti said the airport project is an important initiative under the CPEC banner and would go a long way in transforming Balochistan.\n\nHe said he was determined to undertake more projects so that the people of the province could see a positive change in their lives.\n\n“Balochistan’s uplift is my priority and I will take all possible steps for this purpose.”\n\nFlight takes off from Karachi\n\nThe inaugural PIA flight for Gwadar, PK-503, took off from Karachi at 9:50am with 46 passengers and landed at 11:10am. Upon its arrival, the flight was greeted with a water cannon salute on the runway.\n\nAccording to a PIA spokesperson, the 3.6-kilometre-long runway of the Gwadar airport is suitable for large aircraft such as those belonging to Airbus and Boeing.\n\nBuilt at a cost of Rs66 billion, the airport is spread over 4,300 acres, making it the country’s largest by area.\n\nAs a flagship project of CPEC, it boasts modern security arrangements and facilities for passengers.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/211046083cca212.png",
  "retrievedAt": "2025-08-26T07:50:44.523Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886665",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:00:49.000Z"
}
