{
  "title": "GB, Balochistan people brave harsh weather - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT/QUETTA: Fresh spells of snowfall and rain in parts of Gilgit-Baltistan and Balochistan on Monday disrupted civic life as well as business activities with temperature in some areas falling to minus 14 degrees Celsius.\n\nThere will be little cha­nce of relief as both regi­ons are also expected to receive snowfall and sho­wers today (Wednesday).\n\nIn upper areas of Gilgit-Baltistan, transportation was suspended as roads became slippery. Traffic on Astore Valley Road, Karakoram Highway’s Hunza Nagar section, and Ghizer-Gilgit Road remained suspended for many hours.\n\nIn Balochistan, the local administration and personnel of NHA and Levies were making all-out efforts to keep the traffic flow normal at the Quetta-Chaman Highway by continuously removing snow from the Khojak Top, but a large amount of snow kept creating hurdles in their work.\n\nSnowfall, rain make life hard; prolong power outage adds to hardship\n\n“We have cleared Quetta-Chaman-Kanda­har Highway at Khojak Pass and traffic is continuing from Quetta to Kandahar,” NHA General Manager Agha Inayat Ullah claimed.\n\nAccording to the GB administration, the upper areas of Ghizer district including Phander and Yasin, and upper areas of Astore, Hunza, Nagar, Ghanche, Shigar, Babusar Pass as well as some areas in Diamer received fresh spell of snowfall on Monday.\n\nMany areas received up to six inches of snow, making the weather conditions even harsher.\n\nFor people of Gilgit-Baltistan, it was not weather alone that had upset their scheduled engagements because a prolonged electricity outage had played havoc with their lives.\n\nLocals said majority areas of Gilgit-Baltistan had been enduring 22 hours of power outage.\n\nIn absence of electricity and issues of road communication, people in upper areas were also facing difficulties in accessing health facilities.\n\nAll trade activities, including tourism, remained shut as hotels and tourist venues were unable to function in absence of electricity.\n\nIn a press release, the district administration said there was a possibility of landslides on the Astore Valley Road and advised passengers travelling to and from Astore to use safety chains on their vehicles tyres and avoid unnecessary travels through the road at night and during snowfall.\n\nThe district administration also said that people living in areas prone to snow avalanches should take precautionary measures to avoid any untoward incident.\n\nIn Balochistan, the rain and snowfall continued on the mountains around Quetta district and in Ziarat, Qila Abdullah, Khanozai, Muslim Bagh and Chaman areas.\n\nPeople in several affected areas faced disruption of power and gas supplies and roadblocks.\n\nHeavy rain continued to lash Quetta, Qila Abd­ullah, Chaman, Dalban­din, Nushki, Chagai, Kalat, Mastung, Muslim Bagh, Khanozai, Ziarat, etc. with reports the rainwater caused floods in streams and low-lying areas, creating difficulties in transportation.\n\nPower outages and gas load-shedding also brought inconvenience for the general public.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/678ee78dcf0c2.gif",
  "retrievedAt": "2025-10-12T00:57:05.718Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886663/gb-balochistan-people-brave-harsh-weather",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:00:50.000Z"
}
