{
  "title": "Repatriation of profit surges 114pc - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The outflow of profit and dividends on foreign investments surged 114 per cent during the first half of the current fiscal year.\n\nThe profit repatriation was primarily restricted in FY24 to contain the country’s fast-depleting foreign exchange reserves. Foreign investors widely criticised the government policy, and the International Monetary Fund (IMF), among other harsh conditions, asked Pakistan to ease the curbs on imports and outward remittances by multinational companies if it wanted to secure a new 37-month $7bn Extended Fund Facility.\n\nPakistan secured the first tranche of $1bn in September 2024 under the new bailout package.\n\nOn Monday, the State Bank’s data showed that the outflows surged to $1.215bn during July-Dec FY25 from $568m in the same period last year. While the new financial year witnessed an inflow from the IMF, remittances increased by 33pc in 1HFY25. It supported the State Bank in maintaining its foreign exchange reserves at around $11.5-$12bn. This amount provides import cover for 2.5 months, which is not a healthy sign, but it still helps the exchange rate remain stable.\n\nThe State Bank aims to improve its reserves to $13bn by the end of FY25.\n\nFinancial experts said the curb-free profit outflows would encourage foreign investors to re-enter Pakistan. The government is trying to persuade the investors, but no significant achievement has been witnessed.\n\nThe foreign direct investment (FDI) increased by 20pc to $1.3bn, up from $1.1bn during the same period last year. Despite this increase, the FDI inflow remains the lowest in the region and has stayed around this level for several years. The highest profit was repatriated to the United Kingdom, the oldest foreign economic player, while China remained Pakistan’s biggest investor for many years.\n\nThe profits outflow to the UK surged to $423.7 million in 1HFY25 against $72m in the same period of last fiscal year.\n\nChina comes in 4th place as it received $91m compared to $39m in the same period last year. Other significant outflows were $158.4m to the US, $145m to the UAE and $68m to Hong Kong.\n\nThe manufacturing sector repatriated $432.8m, followed by the wholesale and retail sector $239.2m, electricity, gas and other supplies $168.5m, finance and business $163.6m and transport and storage $91.5m in the first half of FY25.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:57:20.775Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886695/repatriation-of-profit-surges-114pc",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:29:54.000Z"
}
