{
  "title": "Academic activities suspended in universities across Sindh for third day - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Academic activities at public sector universities across the province remained suspended for the third consecutive day on Monday amid a stand-off between teachers and the Sindh government over the latter’s plan to appoint bureaucrats as vice chancellor.\n\nOn Jan 16, university teachers began their strike in protest against recent government decisions, including a plan to hire teachers on a contractual basis.\n\n“Since there is no progress on the matter, teachers will continue with their classes’ boycott on Tuesday [today],” said Federation of All Pakistan Universities Academic Staff Association (Fapuasa) head Dr Ikhtiar Ghumro.\n\nHe told Dawn that a meeting earlier scheduled for Monday would now be held on Tuesday to chalk-out a strategy for making the protest more impactful.\n\n“We believe that the grave issues plaguing Sindh’s universities can no longer be ignored. Our unity delivers a clear message to the government to come forward and address these critical issues.”\n\nTeachers’ boycott of classes to continue today\n\nEarlier in the day, Sindh Education Minister Sardar Shah expressed concerns over the ongoing boycott of classes and told the media that the appointment of VCs was solely an administrative decision that needed to be taken by the provincial government.\n\nReacting to his statement, the association stated: “It is important to clarify that vice chancellors are not only administrative heads but also chair critical academic bodies, such as the academic council, syndicate, senate, and the Board of Advanced Studies and Research, where MPhil and PhD degrees are awarded.\n\n“How can a non-PhD individual, who lacks any knowledge of research, MPhil, or PhD programmes, effectively promote research and academics in universities? Universities are institutions of higher learning and research, not mere management entities,” the statement reads.\n\nMeanwhile, a delegation of Karachi University Teachers’ Society (Kuts) visited the temporary headquarters of the Muttahida Qaumi Movement-Pakistan (MQM-P) and met MNA Aminul Haque, Leader of the Opposition in Sindh Assembly Ali Khurshidi and others.\n\n“The lawmakers endorsed all our demands including withdrawal of the proposed amendment, allowing appointment of bureaucrats as vice chancellors, and the move to appoint teachers on a contractual basis,” Dr Mohsin Ali of Kuts said, adding that the MQM-P assured the teachers that the matter would be raised in the upcoming assembly’s session followed by a presser along with Fapuasa team.\n\nThe Kuts delegation was comprised of Dr Maroof bin Rauf, Dr Nida Ali, Dr Moiz Khan, Dr Basit Ansari, Zeeshan Iqbal and Dr Shah Ali-ul-Qadr.\n\nPublished in Dawn, January 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:50:58.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1886647/academic-activities-suspended-in-universities-across-sindh-for-third-day",
  "dateList": "2025-01-21",
  "date_published": "2025-01-21T02:01:36.000Z"
}
