{
  "title": "President upholds Rs900,000 fine on a hospital, orders refund of Rs2.9 mn to citizen",
  "link": "https://www.app.com.pk/national/president-upholds-rs900000-fine-on-a-hospital-orders-refund-of-rs2-9-mn-to-citizen/",
  "date_published": "2023-01-28T09:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, January 28 (APP): President Dr Arif Alvi on Saturday directed the Islamabad Healthcare Regulatory Authority (IHRA) to issue instructions to Shifa International Hospital Islamabad (SHIFA) to refund an amount of Rs 2.9 million to the daughter of a patient who died due to the medical negligence, professional misconduct, and malpractice of the doctors of the hospital.\nThe president also upheld the imposition of fine of Rs 900,000 on SHIFA as maladministration and medical negligence had been proven against the hospital, President Secretariat Press Wing said in a press release on Saturday.\nThe president issued these directions while rejecting a representation filed by IHRA against the orders of the Wafaqi Mohtasib (WM) in which the Mohtasib had held that the complainant (deceased patient’s daughter) had been discriminated against as in a similar case in the past, IHRA had not only imposed a fine on SHIFA but had also issued the directions to the hospital to refund the amount in lieu of medical bills.\nHe ordered that the refund should be paid within a week to the complainant.\nWhile rejecting IHRA’s representation, the president observed that IHRA had investigated the complaints, found medical negligence and imposed fine of Rs. 900,000 upon SHIFA which had also been received by IHRA and thus medical negligence had been established upon the healthcare establishment.\nHe further said that IHRA did not direct the hospital to reimburse actual amount of medical bill incurred on the treatment of the complainant’s mother as per orders of the learned Wafaqi Mohtasib; whereas in another case namely Dr. Iqtidar Mehmood Dara Vs. Shifa International Hospital, Islamabad, IHRA had held that “The medical bill should be refunded to the complainant by SHIFA International Hospital”.\nThe president held that it was an established principle that similarly placed persons should be treated alike and equal treatment to all is the hallmark of our Constitution i.e., Article 4 and 25.\nHe said that the object and purpose of the law would be fulfilled only when the complainant was provided relief for any negligence by the hospital. “The Agency must have been more vigilant and watchful to fulfil its responsibilities”, he added.\nThe [resident further observed that the main purpose of the establishment of Islamabad Healthcare Regulatory Authority was “…to provide a regulatory framework to ensure provision of quality health care services, by implementing quality standards by the healthcare sector, to residents of the Islamabad Capital Territory”. He noted that IHRA was responsible to “exercise any powers and perform any functions as may be necessary for carrying out the purposes of its Act on the instruction of the Federal Government”, and since maladministration and negligence had been established and it had not been assailed by SHIFA, therefore, the orders had been rightly passed, and the representation deserved to be rejected.\nAs per details, Mst Farrukh Naeem Tahir (the complainant) had alleged that her mother was diagnosed with COVID-19 who died due to the negligence of the doctors of SHIFA and she lodged a complaint before IHRA against the hospital and IHRA imposed a fine of Rs. 900,000/- on the hospital for committing negligence but did not ask the hospital to refund the medical bill amounting to Rs. 2,979,637/- as per order of the Wafaqi Mohtasib.\nThereafter, she filed a review application and requested to re-open the case and re-visit its earlier decision with the direction to IHRA to issue instructions to the hospital to refund the medical bill.\nThe Mohtasib issued the orders in her favour, which were impugned by IHRA by filing a representation with the president.",
  "retrievedAt": "2025-08-11T05:50:57.668Z"
}
