{
  "title": "“GB Dream Road Show” to showcase reforms in various sectors on Monday",
  "link": "https://www.app.com.pk/national/gb-dream-road-show-to-showcase-reforms-in-various-sectors-on-monday/",
  "date_published": "2023-01-28T10:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 28 (APP): The mega event of “GB Dream Road Show” will be held at National Library of Pakistan on January 30 (Monday) to showcase the human development initiatives being taken in different sectors by the Gilgit-Baltistan government and their impacts.\nPresident of Pakistan, Arif Alvi is likely to grace the occasion as chief guest while Chief Minister, Gilgit Baltistan along with ministers will also be present on the occasion.\nThe reforms to be highlighted in this unique event include plastic free GB; Meal-a-Day Program; Tech-Fellow program; Computer Education and Entrepreneurship based upon SNC course guidelines by top-of-the-line trainers; Smart Schools Program; Blended Learning Technology Centres;  Solarization of Schools; KIPS Coaching Program; Taleem Finance Scheme; Pink Bus Project to mainstream females by providing them safe commute; National College of Arts Campus; Artificial Intelligence and Data Science Certification provided by the leading science universities.\nAccording to an official source, the event will showcase the projects designed by the students from public schools of the province under the STEM initiative which speaks volumes about the potential of the young minds. School kids from Grade XI-XIII will present their projects in this show.\nSome innovative projects created by the students studying in the public schools will be displayed in the category of “Computer education, STEM and Entrepreneurship” including technologically advanced projects of Vacuum Cleaner, Smart Dustbins, Smart Door with Audio, Laser Security Alarm System, Bluetooth Antenna, Hologram projector, clap-switch model, Electric Washing Machine, Vacuum cleaner, Bluetooth car, Magnetic Car, Hydro Power plant, Water Turbine, Wind Energy, Power plant, ATM Machine etc will be displayed during the event.\nThe development initiative taken by the Gilgit Baltistan government in the education sector included improving school ecosystems; establishing Smart schools to provide modern learning opportunities to students; arrangement of coding and artificial intelligence camps; establishment of 400 computer labs across province; promotion of libraries; partnership with KIPS to help students secure admission in top universities in Pakistan and abroad; Pink Buses initiative to mainstream females by providing them safe commute.\nThe health sector reforms included renovation and up-gradation of health infrastructure across the region, hiring of 66 medical professionals in collaboration with Shifa International to serve the locals, arranging free medical camps at remote locations as a regular feature, work on comprehensive health program with experts from Aga Khan University, engaging youth in meaningful education, sports and various festivals for mental and physical health.\nThe development initiatives in Sports and Tourism sectors include the development of the first of its kind tourism app to facilitate tourists, tourist police, pre-fabricated toilet facilities as well as beautification of the region from lightening of Konodas Bridge to installation of wooden sign boards all across the region, GB Sports Gala 2022, Sarfranga Summer Festival, Winter Sports Festival, Renovation of Gilgit Sports Complex and two-day cricket festival in Nagar with matches at the highest cricket ground in the world.\nThe initiatives taken in the environmental domain included cleanliness of cities and plastic free Gilgit initiative.\nWhile the developments took place in the Information Technology sector included establishment of Maker-Space Labs in schools with state-of-the-art facilities in accordance with the demands of the 21st century; GB Software Technology Park and IT Boot Camps etc.\nThe spending in education and health sectors in the province has registered a significant increase as a result of the impact of these human development initiatives taken since last year, making education, IT and health as top agenda priority of the provincial government.\nChiarman Rural Support Program Network in Pakistan, Shoaib Sultan Khan will be keynote guest speaker. Various scholars, politicians, diplomats, armed forces members, civil servants and other distinguished experts will participate in the event.\nEminent guest speakers including Ms. Umbreen Arif, Education Advisor, Waqas Ul Hassan, CEO Karandaaz, Ms. Khadija Shahper Bakhtiar, CEO Teach for Pakistan, Shahid Lone, Chairman Allah Walay Trust, Dr. Farid Panjwani, Dean Aga Khan University, Javed Ahmed Malik, Country Head, Malala Fund will be delivering talks in panel discussion session.",
  "retrievedAt": "2025-08-11T05:50:54.378Z"
}
