{
  "title": "Networks of academic campuses needs to be secured: Speakers",
  "link": "https://www.app.com.pk/national/networks-of-academic-campuses-needs-to-be-secured-speakers/",
  "date_published": "2021-07-16T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):Speakers at a five day hands-on training workshop emphasized that Networks of Academic Campuses needs to be secured and Network Access Control (NAC) must be used in academic campuses and enterprises to control illegitimate users’ access over the organization network.\nThe training and workshop was arranged for the faculty and Women Network Engineers of Women University of Azad, Jammu and Kashmir, Bagh.\nThe training workshop, held from July 12-16 at Department of Computer Science and Information Technology of the university, was arranged by Riphah Institute of Systems Engineering (RISE), Riphah International University (RIU) Islamabad.\nThe training was arranged in collaboration with Pakistan Education and Research Network (PERN) and support from the European Union, Asi@connect and TEIN Corporation Center\nThe lead resource persons, Ahmed Ifthikhar and Zain, discussed the use of Firewalls and Intrusion Detection and Prevention Systems for safety and security in detail, said a news release issued here.\nThey said that the objective of the project was to train the women network engineers of Pakistan in network security with a view to empower them to avail best job openings in the market.\nThe participants of the workshop were briefed about the vulnerabilities in protocols and their exploitation in-depth to provide students with a better understanding of how to secure their data on the internet from hackers. The participants were also guided about the use of public-key cryptography and infrastructure.\nThen speakers told that Cyber bullying “Cyber Harassment”, which happens online with women and children needs appropriate response requiring different approaches to support the victims being bullied as well as to cooperate with the departments concerned to initiate legal action against the bully to prevent and eliminate such criminal practices from our society.\nPointing out the effects of cyber bullying, the trainers said that cyber bullying causes depression, isolation, illness, anger, low self-esteemed, and suicide.\nIt was recommended to block the bully, save the evidence, share the incident with trusted person and do not reply.\nIt was also suggested not to use personal equipment like mobile phones, cameras, memory sticks or laptops, for school business.\nThe participants were told that in case of bullying there is a complaint cell for women dealing with women harassment issues all across the country named “NR3C at FIA”; besides a harassment case can also be filed, if the account of person being bullied is being misused. Discussing punishment on cyber harassment related crimes; the Resource Person said spreading false information about an individual is punishable up to three years\nimprisonment or up to one million rupees fine or both.\nMaking or spreading explicit images or videos of an individual is a crime actionable with imprisonment up to five years or up to PKR 5 million fine or both.\nCreating or spreading explicit images or videos of minor is also punishable up to seven years in prison or up to PKR 5 million penalty or both.\nThe law also clearly defines three years imprisonment or up to one million rupees fine for Cyber stalking hacking email or phone.\nThe crime of making videos and distributing without consent is punishable up to three years’ incarceration or up to one million rupees fine or both, the Resources Person said.\nThe workshop is the fifth  in series in the project “Network Security Training and Workshop across selected Women Universities in Pakistan” awarded to Riphah Institute of Systems Engineering (RISE) by the European Union via TEIN*CC 4th call of Asi@connect Program.\nThe project’s objective is to train the women network engineers of Pakistan in network security.\nAt the end Prof. Dr. Kamal (Dean of Science WUAJK, Bagh) and Dr. Tahira Batool (Treasurer WUAJK) and Ms. Syeda Uzma Gardazi (Coordinator CS&IT Department) thanked all the resource persons and distributes the certificates among the organizers and participants of the workshop.",
  "retrievedAt": "2025-08-11T20:58:40.588Z"
}
