{
  "title": "Govt to monitor implementation of SOPs at public places during Eid holidays: Nausheen Hamid",
  "link": "https://www.app.com.pk/national/govt-to-monitor-implementation-of-sops-at-public-places-during-eid-holidays-nausheen-hamid/",
  "date_published": "2021-07-16T05:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP): Federal Parliamentary Health Secretary Dr Nausheen Hamid Friday said that vaccination as well as precautionary measures were essential to ward off 4th wave of Coronavirus and during the Eid holidays government would monitor implementation of SOPs in public places.\nThe new strict SOPs are being issued in view of the recent uptick of Indian delta variant cases countrywide, she was speaking to a private news channel.\n“We are a strong nation and can defeat COVID-19 waves effectively, but for that cooperation from every citizen is imperative”, she added.\nNausheen Hamid said health teams were conducting random testing in cattle markets, which would proved to be a good exercise for checking the spread of the coronavirus among the people visiting for sacrificial animals.\n“Delta Indian variant is a deadly virus, but we can control it just as we controlled it by following the SoPs during the previous three waves”, she said.\nReplying to a question, she showed her serious concerns over rising Covid-19 cases and said the situation was worsening in the country with each passing day and citizens need to be more vigilant and take extra precautionary measures to control the situation.\nShe further said that special SOPs have been devised for hotels, restaurants and public places, adding that for next 10 days tourists would also be restricted to visit tourist spots.\nIn order to contain the spread of fourth wave of corona, government has also decided to issue strict standard operating procedures (SOPs) for Eid prayers and take strict measures for implementation of the precautions including wearing face masks and maintaining social distance, she mentioned.\nWorshipers would have to bring their own prayer mats and perform ablutions at home, she said, adding that everyone entering mosques has to wear a face mask.\nShe also requested the citizens to alter their social behaviour in terms of following the SoPs.\nReplying to a another question, she clarified that there was no shortage of COVID-19 vaccines in the country,\nadding that if any citizen not getting text message for second dose he/she should visit to their nearest vaccination centre and get second dose of vaccine after 6 weeks gap.",
  "retrievedAt": "2025-08-11T20:58:46.402Z"
}
