{
  "title": "Pak, Afghan can serve as bridge connecting Central Asia, Arabian Sea: FM",
  "link": "https://www.app.com.pk/national/pak-afghan-can-serve-as-bridge-connecting-central-asia-arabian-sea-fm/",
  "date_published": "2021-07-16T16:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 16 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Friday said as Pakistan had a vital interest in a peaceful, stable, united and prosperous Afghanistan, it would enable both countries to serve as a bridge connecting Central Asia and the Arabian Sea – and beyond.\n“There are numerous “shovel-ready” projects awaiting peace in Afghanistan, such as the TAPI gas pipeline from Turkmenistan, the CASA-1000 electricity grid from Tajikistan and the railway connecting Uzbekistan, Afghanistan and Pakistan,” he added.\nThe Foreign Minister was addressing through video-link the forum of Economic and Social Council (ECOSOC), the third Charter organ of the United Nations – on its 75th anniversary.\nHe further said that a just solution was essential for the Jammu and Kashmir dispute on the basis of the UN Charter, Security Council resolutions and the wishes of the Kashmiri people.\n“Positive steps reversing the cause of current tensions can open the way for dialogue and trade,” the Foreign Minister remarked.\nHe said as it was said that war was conceived “in the minds of men”. “Likewise, the desire for peace and cooperation can also emerge from the minds of men and women who, if inspired by reason, and aware of the momentous global challenges confronting humanity, cannot but opt for international cooperation rather than rivalry and confrontation,” he added.\nThe Foreign Minister said that the debates and discussions of the Economic and Social Council were an essential vehicle to promote such recognition of the imperative of cooperation to enable humanity build a shared future of peace and prosperity.\nHe said as the UN Charter had prescribed equal priority to peace and development, one cannot be realized without the other. “The Economic and Social Council is mandated, under the Charter, to promote “better standards of life in larger freedoms” through international economic cooperation,” he added.\nThe Foreign Minister said today ECOSOC’s role had become even more critical than it was 75 years ago. “The world is facing an unprecedented triple crisis – the COVID-19 pandemic, the worst economic recession in a century, and a looming climate and environmental calamity,” he added.\n​“The global response to this triple crisis must be simultaneous and synergetic. This coherent and coordinated response can be best promoted within the framework of the Economic and Social Council which sits at the apex of the UN system of Specialized Agencies, autonomous organizations and subsidiary bodies,” the Foreign Minister stressed.\nForeign Minister Qureshi said that ​Pakistan confronted the COVID crisis just as the present government had succeeded in achieving macro-economic stability in the country’s balance of payments and fiscal accounts.\n“Our Prime Minister opted a policy of selective, or smart, lockdowns to save lives without disrupting livelihoods. This was accompanied by the largest economic relief and social protection program in Pakistan’s history to ensure that the poorest and vulnerable segments of our population did not suffer and small businesses did not collapse,” he added.\nThe Foreign Minister said that employment was generated through support for construction, agriculture and reforestation programs.\n“​We have been fortunate in containing COVID-19 casualties, although restrictions remain in place to prevent a fourth wave from deadlier versions of the virus. Our economy is back on a healthy growth trajectory. And, Pakistan’s social protection program, Ehsaas (Compassion), is recognized as a global model,” he added.\nThe Foreign Minister further said the present government believed that, given the massive rise in poverty and vulnerability caused by the pandemic, it was essential to incorporate a sustained social protection program as an essential component of the response to the triple crisis they were facing.\n“Pakistan, Finland and Costa Rica, with the cooperation of the World Bank and UN DESA, have initiated a proposal for the universal adoption of social protection in development strategies,” he said, adding “​We need an agreed global strategy to address the triple crisis.”\nThe Foreign Minister said that Agenda 2030, the SDGs (Sustainable Development Goals), the Addis Ababa Action Agenda, the Paris Agreements and the Biodiversity Convention provided the blueprint for such an agreed global strategy.\n​He said that Prime Minister Imran Khan outlined the main elements of such a strategy on 13 July in his address to the High-Level Political Forum: early and universal access to the COVID-19 vaccines; adequate development finance; scaled up investment in SDG and climate relevant sectors, especially in sustainable infrastructure, and rectification of the deficiencies and inequities in the global financial, tax, trade and technology structures, including an end to illicit financial flows out of developing countries.\n“​Massive investment in sustainable infrastructure – energy, transportation, agriculture, and manufacturing – is indispensable to achieve the SDGs and the climate objectives,” he added.\nThe Foreign Minister said that ​Pakistan’s infrastructure development strategy was designed to take advantage of its large pool of young people and its geo-economic location at the crossroads of South Asia, Central Asia, West Asia and China.\nTo leverage private sector investments for sustainable development, he said, Pakistan was launching its first ever “SDG Investor Map”. The Map will identify Investment Opportunity Areas and business models that could advance private investment for the achievement of SDGs in Pakistan, he added.\n​The Foreign Minister further said that with the welcome support and cooperation of our partner, China, Pakistan was forging ahead with implementation of the China-Pakistan Economic Corridor (CPEC), a flagship project of the Belt and Road Initiative.\nThe first phase of CPEC was nearly complete and the second phase, envisaging the creation of several Special Economic Zones (SEZs), had been initiated, he said, adding, those SEZs were open to participation of third countries.\nThe Foreign Minister said that ​Pakistan greatly appreciated the intention of several fraternal and friendly countries, including Saudi Arabia, UAE, Turkey and others, to invest in Pakistan’s economy.\n“We have noted with interest the decision of the G7 countries to launch the “Build Back Better World” infrastructure initiative which can complement existing initiatives,” he maintained.",
  "retrievedAt": "2025-08-11T20:58:40.541Z"
}
