{
  "title": "Govt committed to accelerate policies, programmes to enhance social well-being of people, Senate informed",
  "link": "https://www.app.com.pk/national/govt-committed-to-accelerate-policies-programmes-to-enhance-social-well-being-of-people-senate-informed/",
  "date_published": "2021-07-16T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 16 (APP):The government was committed to accelerate policies and programmes to enhance social well-being of its people while ensuring that no one was left behind, Senate informed on Friday.\nIn a written reply to question, Minister for Planning, Development and Special Initiatives Asad Umar said that major thrust of public sector investment under the Federal Public Sector Development Programme (PSDP) after the 18th amendment to the Constitution is on the funding of large scale strategic projects of national interest, he said.\nThe minister said that these priorities were defined and determined by the National Economic Council (NEC) and other development planning fora. He said that the corner stone of the incumbent government’s policy is to invest in under developed regions to bring them at par with other, relatively developed areas of the country; reduce poverty and empower the marginalized segments of the society.\n“Accordingly, the entire premise of Ehsaas Programme was structured around social welfare of the people of the country and creation of a welfare state,” he said.\nThe minister said that the programme has restructured Benazir Income Support Programme (BISP_- Kifalat Tahafuz launched the regionally tested National Poverty Graduation Initiative which was one of the largest COVID-Emergency cash transfer programs globally, featured by the World Economic Forum.He said that Sehat Sahulat program was another initiative that has been launched to relieve the most vulnerable populations of the catastrophic out of pocket expenditure on health covering 14 million families living below the poverty line.\nHe said that it was including universal coverage of health protection in all districts of Gilgit Baltistan, Tharparkar and KM. The Kamyab Jawan Program, specifically, on human capital development, creating income generation/ employment opportunities for the 64 million youth of Pakistan through Hunarmand Jawan Skills development, Youth Entrepreneurship Schemes (YES) and several other supporting initiatives.\nAsad Umar said that federal government also initiated special regional development and equalization packages for Southern Balochistan, Gilgit Baltistan, 14 plus priority districts of Sindh and allocations for newly merged districts of Khyber Pakhtunkhwa under ten year accelerated plan and Annual Development Plan (ADP).\nThe minister said that the packages entail projects for education, health, social welfare, poverty alleviation and infrastructure development.",
  "retrievedAt": "2025-08-11T20:58:43.363Z"
}
