{
  "title": "Security forces kill 5 ‘Indian-sponsored’ terrorists in Khuzdar IBO: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces earlier this week killed five “Indian-sponsored terrorists” during an intelligence-based operation (IBO) in Balochistan’s Khuzdar district, the Inter-Services Public Relations (ISPR) said on Wednesday.\n\nThe state has designated Balochistan-based groups as Fitna-al-Hindustan to highlight India’s alleged role in terrorism and destabilisation across Pakistan.\n\nIn a press release, the ISPR said security forces conducted the IBO on the night of 14/15 September on the “reported presence of terrorists belonging to Indian proxy Fitna al Hindustan”.\n\n“During the conduct of operation, own forces effectively engaged the terrorists’ location, and after an intense fire exchange, five Indian sponsored terrorists were sent to hell,” the military’s media wing added.\n\n“Weapons, ammunition and explosives were also recovered from the terrorists, who remained actively involved in numerous terrorist activities in the area,” the ISPR noted.\n\nSanitisation operation was being conducted to eliminate any other terrorists found in the area, according to the ISPR.\n\n“Security forces of Pakistan are determined to wipe out the menace of Indian sponsored terrorism from the country, and reaffirm the nation’s unwavering resolve to bring the perpetrators of terrorism to justice,” the military reaffirmed.\n\nThe operation comes after five security personnel, including an officer, were martyred in an explosion in Balochistan’s Kech district on Monday.\n\nOver the weekend, security forces had killed 31 terrorists in two separate INOs in Khyber Pakhtunkhwa’s Lakki Marwat and Bannu districts, ISPR said.\n\nOn September 12, the ISPR said troops had also killed four “Indian-sponsored terrorists” during an IBO in Balochistan’s Mastung. On September 7, two people were seriously injured in Khuzdar’s Naal area when an improvised explosive device was detonated, police said.\n\nLast month, security forces gunned down 50 terrorists over a four-day operation, foiling an attempt by militants to cross over from Afghanistan into Balochistan.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:42:43.806Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942616/security-forces-kill-5-indian-sponsored-terrorists-in-khuzdar-ibo-ispr",
  "dateList": "2025-09-17",
  "date_published": "2025-09-17T07:32:44.000Z"
}
