{
  "title": "SHC suspends appointment of Irsa’s federal member for lacking Sindh domicile - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court on Tuesday suspended the appointment of Asjad Imtiaz as Indus River System Authority’s (Irsa) federal member from Sindh as he did not possess province’s domicile.\n\nA two-judge constitutional bench headed by Justice Muhammad Karim Khan Agha ruled that the ministry’s notification issued in 2022 to appoint Punjab-domiciled Mr Imtiaz as Irsa’s federal member for a period of three years was a flagrant violation of the SHC’s 2017 judgement that ruled that the executive order regarding appointment of the federal member from Sindh was protected under Article 270AA(2) of the Constitution and the federal government was bound to follow it.\n\nThe bench issued show-cause notices to the secretaries of establishment division and ministry of water resources for flouting an order of the bench issued last month.\n\nThe bench was hearing an application seeking contempt proceedings against both the secretaries for not complying with the judgement of SHC passed in 2017.\n\nIssues show cause notices to secretaries of water resources and establishment divisions\n\nAt the outset of hearing, the bench noted that the judgement was passed on May 12, 2017 and the matter had reached finality before the Supreme Court in 2021, but the same has still not been implemented.\n\nIt said like the last hearing, both the secretaries and Mr Imtiaz did not appear despite specific directives issued by the bench.\n\nThe bench also noted that the secretary ministry of water resources Syed Ali Murtaza was directed to appear and not to be busy elsewhere or otherwise on leave, but it was quite surprising that on Sept 10, he was allowed eight-day ex-Pakistan leave.\n\nIt further observed that prima facie, such period/leave was deliberately given to him in order to avoid his appearance before this court and the establishment division was well aware that he had to appear before the bench on Tuesday.\n\nThereafter, the bench issued show-cause notices to Mr Murtaza and Establishment Secretary Nabeel Ahmed Awan for violating the last order of the bench issued on Aug 18.\n\nIt noted that the water recourses secretary had sent a reply to the show-cause notice which clearly indicated that he was aware of the 2017 judgement, yet he has failed to take any action about compliance and relied on an interim stay order passed by the Islamabad High Court despite the fact that the matter had reached finality before the apex court in 2021.\n\nThe bench rejected the reply as unsatisfactory and stated in its order: “It is quite astonishing that the Government of Pakistan, Ministry of Water Resources, despite the judgement 12.05.2017 being in field and this matter having reached finality by the Hon’ble Supreme Court of Pakistan, by re-appointing Asjad Imtiaz as Member Irsa (Federal) for a period of three (03) years vide notification dated 08.12.2022.\n\n“We find this to be quite astonishing and flagrant violation of this Court’s orders. It appears that the Government of Pakistan, Ministry of Water Resources, has little interest in complying with this Court’s order as it is bound to do so. Accordingly, the notification dated 08.12.2022 of Asjad Imtiaz issued by the Government of Pakistan, Ministry of Water Resources, is suspended,” it added.\n\nThe bench warned if the 2017 judgement was not complied with by the next hearing, the court will have no option but to proceed in accordance with the law as the matter has attained finality before the apex court.\n\nAdjourning the hearing till Oct 22, the bench again directed Mr Murtaza and Mr Imtiaz to appear in person at the next hearing.\n\nPetitioner Ghulam Abbas Laghari had filed an application seeking contempt proceedings against the secretaries of establishment division and ministry of water resources for not complying with the court order passed in 2017.\n\nMeanwhile, another two-judge bench of SHC headed by Justice Muhammad Faisal Kamal Alam on Tuesday summoned the advocate general Sindh for Oct 14 in an identical matter.\n\nThe bench was hearing a petition filed by a grower of Sindh, Qurban Maitlo, through his lawyer Barrister Zameer Ghumro against the appointment Mr Imtiaz and also impugned the water availability certificate issued by Irsa for construction of canals on the Indus River. The SHC had already suspended the impugned water availability certificate.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:13:38.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942480/shc-suspends-appointment-of-irsas-federal-member-for-lacking-sindh-domicile",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:55.000Z"
}
