{
  "title": "SC explains security protocols for retired judges - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court has explained that though retired judges of the top court will remain entitled to lifetime security strictly in accordance with a presidential order, their widows are not covered.\n\nIn an announcement here on Tuesday, the Supreme Court clarified that a letter regarding provision of security to retired SC judges, which was addressed to the secretary interior, has revised its security protocols to the extent of widows of retired judges. The inclusion of the widows in the letter was inadvertent, the announcement clarified, adding that the reference to widows has accordingly been withdrawn since they were not covered under the Presidential Order No 7 of 2018.\n\nHowever, the apex court reaffirmed that retired SC judges remain entitled to lifetime security strictly in accordance with the presidential order and the applicable rules and protocols. This entitlement reflects the sensitive nature of their past office and the continuing security concerns that accompany it, the announcement explained.\n\nOn September 13, the court had announced that the SC, in a bid to streamline and rationalise the security of Chief Justice of Pakistan (CJP) Yahya Afridi, had scaled down the number of official vehicles from eight to two, resulting in the release of a considerable number of security personnel for routine policing duties.\n\nThe security regime for serving judges has also been regulated suitably, making it rational and aligned with the entitlements under the rules. In the same spirit, the security for retired SC judges has also been regulated in accordance with applicable rules, established security protocols, and entitlements, including the relevant presidential order that provides lifetime security to retired judges, considering the sensitive nature of their past office and continuing security concerns.\n\nIn order to operationalise these security protocols, without conferring any extraordinary benefit, added concession or privilege, a circular has been issued to scale down deployment of force in excess of entitlement, reaffirming compliance with rules, and to facilitate coordination between the Supreme Court, the Ministry of Interior, and provincial authorities for implementation.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:13:34.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942501/sc-explains-security-protocols-for-retired-judges",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:59:13.000Z"
}
