{
  "title": "Saudi Arabia, UK launch plan to boost maritime security off Yemen - World - DAWN.COM",
  "author": null,
  "content": "RIYADH/HODEIDA: Saudi Arabia and Britain launched a partnership on Tuesday to strengthen Yemen’s coastguard in the Red Sea and Gulf of Aden, where Houthi rebels have stepped up attacks on commercial shipping.\n\nUnder the agreement announced at a news conference in Riyadh, the coastguard of Yemen’s internationally recognised government would be trained and equipped to tackle threats that also include piracy, human-trafficking and smuggling.\n\nThe initiative received funding worth several million dollars from more than 35 countries, including Australia, Canada, Japan and the United States, as well as Gulf nations and the European Union, according to the British embassy.\n\nSaudi Arabia pledged $4 million, said its ambassador to Yemen, Mohammed Al Jaber.\n\nIsrael strikes Houthi-held port after evacuation warnings\n\nThe Iran-backed Hou­this, who control swa­thes of Yemen, have launched missiles and drones targeting Israel and Red Sea shipping throughout the Gaza war, saying they are acting in solidarity with Palestinians.\n\nJapan’s ambassador to Yemen, Yoichi Naka­shima, stressed the importance of the Yemeni government controlling its coastline, though he cautioned this would not necessarily reduce Houthi attacks.\n\n“We can see this as a first step, to be followed by others,” he said.\n\nIsraeli attacks\n\nIsrael struck Hodeida port on Tuesday, saying it targeted infrastructure used by the rebels, who reported a dozen strikes on the area.\n\nIsrael has stepped up attacks on the Houthis, killing their prime minister and nearly half of his cabinet last month and leaving dozens dead in strikes last week mainly targeting the rebels’ military media operation.\n\nThe rebels’ Al-Masirah television said “12 Israeli enemy air strikes targeted the port of Hodeida”.\n\nMilitary spokesman Yahya Saree said the group’s air defences were “cur­rently confronting Israeli enemy aircraft laun­ching an aggression against our country”.\n\nThe Israeli military said it struck “a military infrastructure site belonging to the Houthi terrorist regime at the Hodeida port in Yemen”.\n\nIt also accused the group of using the port “for the transfer of weapons supplied by the Iranian regime, in order to execute attacks against the State of Israel and its allies”.\n\nThe Israeli military’s Arabic-language spokesman, Avichay Adraee, had warned of the strikes earlier, saying they would be in response to Houthi military activity and urging “everyone in Hodeida port and the vessels anchored there to evacuate”.\n\nIn a statement on X, Israeli Defence Minister Israel Katz warned the Houthis would “continue to suffer blows and pay painful prices for any attempt to attack the State of Israel”. Since the Gaza war erupted in October 2023, the Houthis have launched repeated drone and missile attacks against Israel claiming solidarity with the Palestinians.\n\nIn response, Israel has carried out rounds of retaliatory strikes in Yemen, mainly targeting infrastructure such as ports, power stations and the international airport in Sanaa.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c9ea38ce61b.gif",
  "retrievedAt": "2025-09-19T14:42:57.619Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942549/saudi-arabia-uk-launch-plan-to-boost-maritime-security-off-yemen",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:49.000Z"
}
