{
  "title": "‘Nuclear arsenal keeps Indian designs in check’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A top adviser to the country’s nuclear command and control body believes that Pakistan’s nuclear arsenal is what is keeping Indian military designs in check.\n\nSpeaking at an event organised by the Islamabad Policy Research Institute (IPRI) on Tuesday, retired Lt Gen Khalid Ahmed Kidwai said that the country’s Full Spectrum Deterrence (FSD) — or minimum credible deterrence — was never compromised during the May standoff with India.\n\nLt Gen Kidwai, an adviser to the country’s National Command Authority (NCA), also noted that the newly-formed Army Rocket Force Command (ARFC) will raise the nuclear threshold by providing an additional layer of strategic deterrence between conventional operations and the potential employment of nuclear forces.\n\nHe explained that the ARFC has merely a response to modern battlefield needs, while the nuclear deterrent remains in place as the ultimate shield against India.\n\nA former head of the army’s Strategic Plans Division (SPD), Gen. Kidwai said that Pakistan’s FSD worked in both directions, east and west, and it was no ‘bluff’, according to a press release issued after the event.\n\nHe stressed that, unlike India, Pakistan has repeatedly demonstrated that restraint and responsibility are the key components of its nuclear policy.\n\n“The large size of the Indian army does not tell the entire story… quality, technology, and training are the force multipliers that determine the victor in an armed confrontation,” he remarked.\n\n“India not only failed to achieve any of its politico-strategic-military objectives, but it also suffered major military reverses, especially in the IAF,” he pointed out.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:42:44.740Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942537",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:26.000Z"
}
