{
  "title": "SC questions parliament’s power to slap super tax - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Jamal Khan Mandokhail, a member of the five-judge Supreme Court constitutional bench, on Tuesday questioned whether the National Assembly could be granted specific authority under the constitution to enact tax legislation that operates outside the financial year.\n\nHeaded by Justice Aminuddin Khan, the CB was hearing multiple petitions filed by taxpayers challenging the constitutional vires of the amen­ded Section 4C of the Income Tax Ordinance (ITO), 2001, applicable to the tax year 2023.\n\nHowever, senior counsel Hafiz Ehsaan Ahmad Khokhar, representing the Federal Board of Rev­e­nue (FBR), argued that the present case did not involve any question of the National Assembly’s legislative competence.\n\nDuring the hearing, Add­­i­­tional Attorney Gen­e­ral Chaudhry Aamir Reh­m­an informed the court that the federal governm­ent would submit a written response within a few days.\n\nOn April 4, 2024, a division bench of the IHC comprising then Chief Justice Aamer Farooq and Justice Tariq Mehmood Jahangiri while hearing intra-court appeals had directed one of the respondents to continue paying tax liability under Section 4C as amended by the Finance Act, 2023.\n\nThe super tax, introduced by the PML-N government in 2015, applies to wealthy individuals, associations of persons and companies earning above Rs500 million. It levies 4 per cent tax on the income of banking companies and 3pc on other sectors to fund rehabilitation of temporarily displaced persons.\n\nMr Khokhar defended the constitutionality of Sections 4B and 4C of the ITO, 2001, stressing that under Article 77, parliament has exclusive authority to levy taxes. He argued that the super tax, introduced through Finance Acts 2015 and 2022, was a lawful exercise of fiscal power.\n\nHe noted that Section 4B, which initially imposed super tax on high-income taxpayers, had already been upheld by all high courts. Issues such as double taxation, violation of Article 25 and legislative competence had been decided in favour of the federation.\n\nTurning to Section 4C, introduced in 2022, which extended the levy through progressive slabs and sector-specific categories, Mr Khokhar said the high courts erred by reconstructing the statutory scheme. This amou­nted to judicial legislation, he argued.\n\nUnder Article 199, he emphasized, courts may only strike down laws that clearly violate fundamental rights, not redesign tax schemes. By doing otherwise, the high courts committed judicial overreach and upset the balance of power between legislature and judiciary, he said.\n\nOn the claim that super tax constituted double taxation, he called the argument “wholly misconceived,” noting that under Article 77 and Entry 47 of the federal legislative List, parliament has plenary authority to levy taxes on income other than agricultural income.\n\nSection 2(63) of the Ordinance defines “tax” to inc­l­u­­de super tax, while Section 3 provides that income tax shall be charged for each tax year where expressly provided. Thus, super tax is not a separate levy but an additional component of income tax on high-income earners, comparable to a surcharge or advance tax, he explained.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:43:11.778Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942562/sc-questions-parliaments-power-to-slap-super-tax",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:10.000Z"
}
