{
  "title": "US House panel questions FBI’s Patel over Epstein investigation files - World - DAWN.COM",
  "author": null,
  "content": "FBI Director Kash Patel on Wednesday faced a second day of questioning by US lawmakers, defending his handling of investigative files on Jeffrey Epstein against claims from Democratic and one Republican lawmaker that the FBI is shielding information related to the late financier and sex offender.\n\nAppearing before a US House of Representatives panel, Patel offered a variety of explanations for the Trump administration’s about-face on releasing material on the Epstein investigations.\n\nHe argued that court orders prevented the release of some evidence and that in other areas the FBI had limited material in its possession.\n\n“We are releasing as much as legally allowed,” Patel told the House Judiciary Committee.\n\nThe Justice Department enraged many prominent supporters of President Donald Trump with its decision in July not to release additional documents from the investigation, after raising expectations for a full disclosure.\n\nMany in Trump’s political base believed his administration would implicate other wealthy and powerful people in Epstein’s alleged sex trafficking of underage girls.\n\nRepublican Representative Thomas Massie of Kentucky, a critic of the Trump administration’s handling of the Epstein probe and co-author of legislation to require more disclosures about it, said he had been told by alleged victims of Epstein that they had given the FBI information about others who had been involved in Epstein’s abuse.\n\n“We know these people exist in the FBI files, files that you control. I don’t know exactly who they are, but the FBI does. Have you launched any investigations into any of these people?” Massie asked.\n\nPatel replied that the FBI would investigate “credible information” but that he has not received any such information.\n\nPatel told a Senate panel on Tuesday that the FBI does not have credible evidence that Epstein, who died by suicide in 2019 while awaiting trial on sex trafficking charges, trafficked women and underage girls to anyone other than himself.\n\nThe issue has sparked a rare rift between Trump and his Make America Great Again movement. Trump, a one-time friend of Epstein, has urged his supporters to move on and dismissed the issue as a hoax pushed by his Democratic opponents.\n\nThree federal judges have rejected Justice Department requests to unseal material from grand juries that investigated Epstein and his former partner, Ghislaine Maxwell. Judges found, and prosecutors acknowledged, that the material contained little information that was not already public.\n\nPatel also suggested that other material, including reports of witness interviews, was protected from disclosure by court orders. He told lawmakers the FBI does not have videos that implicate others in Epstein’s alleged crimes.\n\nPatel had boosted claims about Epstein during appearances on conservative podcasts before Trump nominated him to lead the FBI. Democrats accused Patel of seeking to shield information about Trump, who has not been accused of misconduct related to Epstein.\n\n“How did you go from being a crusader for accountability and transparency to being a part of the conspiracy and cover-up?” asked Representative Jamie Raskin of Maryland, the top Democrat on the House Judiciary Committee.\n\nThe Justice Department has begun handing records to the House Oversight Committee, which has subpoenaed material related to Epstein.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/172201066c67e92.webp",
  "retrievedAt": "2025-09-19T14:42:46.046Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942718/us-house-panel-questions-fbis-patel-over-epstein-investigation-files",
  "dateList": "2025-09-17",
  "date_published": "2025-09-17T17:24:21.000Z"
}
