{
  "title": "Urban flooding linked to blocked drains, flawed city planning in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Natural watercourses replaced by townships and elevated roads, says Arif Hasan\n• Speakers urge restoration of drainage channels, adoption of long-term, people-friendly strategy\n\nKARACHI: The Urban Resource Centre (URC) on Tuesday organised talks by experts, architect and town planner Arif Hasan and NED Professor Dr Noman Ahmed, about the current flooding situation in big cities such as Karachi during the monsoon rains.\n\nIn his talk, titled ‘Understanding the impacts of monsoon rains and flooding in Pakistan’, professor Ahmed pointed out that the usual monsoon pattern has now changed, as the average rainfall recorded this year in major cities such as Karachi, Lahore, Sialkot, Faisalabad, Sargodha and Kasur was higher than usual.\n\n“The low-lying areas are flooded almost as soon as it rains and citizens find themselves surrounded by water, wondering how to save their belongings,” said Professor Ahmed.\n\n“Ironically, while the roads are inundated, the rainwater drains do not receive rainwater,” he pointed out. “It is because while building roads we left no margin or option for the water to flow out. New development projects have also blocked all drainage, as no one thinks about such things while planning construction,” he said.\n\n“During the heavy rain on August 19, even the vehicles brought in to clean or pump out the water from Sharea Faisal themselves stopped working as the water went into their engines,” he added.\n\nHe said that normally all the rainwater should channel out to the river or sea through storm-water drains, which does not happen. He showed, with the help of maps, how rivers such as the Sutlej and Ravi in Punjab overflowed into nearby settlements.\n\nProfessor Ahmed said that the government needs to have a comprehensive strategy to manage exceptional rain and flooding events. He also suggested that they restore natural drainage channels in and around the cities, and train, equip and mobilise a volunteer force for emergency services.\n\nMeanwhile, Mr Hasan said that water naturally flows down from the north or hilly areas to the sea in the south, but the areas it is supposed to flow through have townships now. One good example of this is Saadi Town and the other townships around it.\n\n“You don’t meddle with nature like that. The first thing before building a settlement somewhere is to see if it is not in the way of the flow of water,” he said. “Then even the roads here are built higher and higher, while not allowing the water to flow down,” he added.\n\n“The URC carried out a detailed survey of drains in 2020 and found that some 30 of the 34 smaller drains flowing into the big Mahmoodabad drain were blocked. The Mahmoodabad drain, too, has 18 points from where the water should flow out, though there only four happened to be open, as the remaining 14 were blocked. So the outflow is weak,” he said.\n\nHe also said that during the rains, water on the roofs of around 2.7 million houses and buildings in Karachi flows down onto the roads. But there has been no research or study carried out to see how to get this water to the Lyari or Malir rivers.\n\n“All one needs is some common sense here to come up with long-term solutions. Here we have rendered people homeless to clean the Gujjar, Orangi or Mahmoodabad nullahs and still the flooding issue could not be resolved,” he said.\n\n“When coming up with solutions, we should not ignore or lose sight of the people,” he reminded. “Come up with people-friendly solutions because with global warming the temperature in the mountains is rising, which means more water will flow down into the rivers while we here are senselessly settling down on floodplains,” he added.\n\nEarlier, Zahid Farooq, one of the organisers, mentioned the rain on August 19, which affected every citizen of Karachi, rich or poor, in the same way.\n\nMany people attending the talk also shared their bad experiences due to the urban flooding on that day.\n\nA one-minute latest video of flooding at main NIPA Chowrangi on Tuesday was also shared with the audience to show that the water has still not cleared in several areas.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c9c7ccdabe7.gif",
  "retrievedAt": "2025-10-12T04:13:17.300Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942478/urban-flooding-linked-to-blocked-drains-flawed-city-planning-in-karachi",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:55.000Z"
}
