{
  "title": "Floods devastate India’s breadbasket - Newspaper - DAWN.COM",
  "author": null,
  "content": "GURDASPUR: The fields are full but the paddy brown and wilted, and the air thick with the stench of rotting crops and livestock — the aftermath of record monsoon rains that have devastated India’s breadbasket.\n\nIn Punjab, often dubbed the country’s granary, the damage is unprecedented: floods have swallowed farmlands almost the size of London and New York City combined.\n\nIndia’s agriculture minister said in a recent visit to the state that “the crops have been destroyed and ruined”, and Indian Punjab chief minister called the deluge “one of the worst flood disasters in decades”.\n\nOld-timers agree. “The last time we saw such an all-consuming flood was in 1988,” said 70-year-old Balkar Singh in the village of Shehzada, 30km north of Amritsar.\n\nThe gushing waters have reduced Singh’s paddy field to marshland and opened ominous cracks in the walls of his house.\n\nFloods and landslides are common during the June-September monsoon season on the subcontinent, but experts say climate change, coupled with poorly planned development, is increasing their frequency, severity and impact.\n\nPunjab saw rainfall surge by almost two-thirds compared with the average rate for August, according to the national weather department, killing at least 52 people and affecting over 400,000.\n\nPrime Minister Narendra Modi has announced a relief package worth around $180 million for Punjab.\n\n‘10 feet high’\n\nThe village of Toor is in tatters — strewn with collapsing crops, livestock carcasses and destroyed homes.\n\n“The water came past midnight on August 26,” said farm worker Surjan Lal.\n\n“It rose up to at least 10 feet (three metres) in a matter of minutes.” Lal said the village in Punjab’s worst-affected Gurdaspur district was marooned for nearly a week.\n\n“We were all on rooftops,” he said. “We could do nothing as the water carried away everything from our animals and beds.”\n\nIn adjacent Lassia, the last Indian village before the frontier, farmer Rakesh Kumar counted his losses. “In addition to the land I own, I had taken some more on lease this year,” said the 37-year-old. “All my investment has just gone down the drain.” To make things worse, Kumar said, the future looked bleak. He said he feared his fields would not be ready in time to sow wheat, the winter crop of choice in Punjab.\n\n“All the muck has to first dry up and only then can the big machines clear up the silt,” he said.\n\nEven at the best of times, bringing heavy earth-movers into the area is a tall order, as a pontoon bridge connecting it to the mainland only operates in the lean months.\n\nFor landless labourers like 50-year-old Mandeep Kaur, the uncertainty is even greater.\n\n“We used to earn a living by working in the big landlords’ fields but now they are all gone,” said Kaur.\n\nHer house was washed away by the water, forcing her to sleep in the courtyard under a tarpaulin sheet — an arrangement fraught with danger as snakes slither all over the damp land.\n\nBasmati blues\n\nPunjab is the largest supplier of rice and wheat to India’s food security programme, which provides subsidised grain to more than 800 million people.\n\nAnalysts say this year’s losses are unlikely to threaten domestic supplies thanks to large buffer stocks, but exports of premium basmati rice are expected to suffer.\n\n“The main effect will be on basmati rice production, prices and exports because of lower output in Indian and Pakistan Punjab,” said Avinash Kishore of the International Food Policy Research Institute in New Delhi.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c9e9b8b0d74.jpg",
  "retrievedAt": "2025-09-19T14:42:43.629Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942545",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:18.000Z"
}
