{
  "title": "Mashreq Bank entry marks push towards digital economy: PM Shehbaz - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Tuesday stressed the urgent need to modernise Pakistan’s economy through digital tools, calling for a shift from conventional systems to a digitally driven model.\n\nSpeaking at the launch ceremony of UAE-based Mashreq Digital Retail Bank in Islamabad, the prime minister said transitioning to a digital economy would enhance efficiency and expand financial inclusion nationwide. “The launch of Mashreq Digital Bank is a major development that will promote a cashless, digital transaction culture in Pakistan,” he said.\n\nThe premier congratulated Mashreq Bank Chairman Abdul Aziz Al Ghurair on bringing the digital banking platform to Pakistan, and commended the Ghurair family’s contribution to strengthening economic ties between Pakistan and the United Arab Emirates.\n\nMr Sharif assured full government support for digital initiatives, adding that key economic sectors — including banking, agriculture, and investment — must embrace technological transformation to drive sustainable development. He also noted that Pakistan’s growing youth population could benefit from innovation in the financial sector.\n\nShehbaz says digital banking will boost efficiency, financial inclusion\n\nFinance Minister Muhammad Aurangzeb said the entry of Mashreq Bank would bring innovation and inclusivity to Pakistan’s financial ecosystem. He cited recent macroeconomic stability and said global credit agencies were acknowledging the country’s economic improvement. He stressed the need for consistent policies to maintain momentum.\n\nThe minister added that the digital bank could help document the informal economy by enabling access to formal financial services for millions of unb­anked citizens.\n\nChairman Abdul Aziz Al Ghurair expressed confidence in Pakistan’s economic direction, attributing the bank’s investment decision to improved stability and growth prospects. “Under the prime minister’s leadership, Pakistan is on the path to inclusive growth,” he said, describing the country as an emerging digital powerhouse in South Asia.\n\nMashreq Pakistan CEO Muhammad Hamayun Sajjad said digital transaction volumes had increased by 35pc, yet a large portion of the population remained unbanked. He announced the bank’s target to onboard 10 million new users.\n\nSeveral cabinet members and State Bank Governor Jameel Ahmad attended the event.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/17105514e52e0a1.webp",
  "retrievedAt": "2025-10-12T04:13:07.660Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942532/mashreq-bank-entry-marks-push-towards-digital-economy-pm-shehbaz",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:33.000Z"
}
