{
  "title": "Karachi girl found dead in home was raped, murdered - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A 10-year-old girl found hanging in her Surjani Town home on Monday was raped and murdered, it emerged on Tuesday.\n\nPolice Surgeon Dr Summaiya Syed said the body of the girl, identified as Asiya, was brought to the Abbasi Shaheed Hospital on Monday evening for a post-mortem examination.\n\nThe autopsy revealed she had been subjected to sexual violence and was strangled to death. The surgeon added that samples had been taken to check for intoxication.\n\nIn a statement on Tuesday, police confirmed that the medical officer’s report indicated the victim was strangled. Police also said the suicide was staged to hide the murder.\n\nResidents had initially informed Madadgar-15 police about the girl’s body hanging inside a home in Surjani Town’s Sector-5-A.\n\nThe victim’s father, Abdullah, told the police he had gone for work and left his daughter and son, Raheel, at home. He later received the news of his daughter’s death.\n\nA spokesperson for the West SSP said that because the family appeared reluctant to pursue the case, the police have decided to register a case on behalf of the state through a police officer.\n\nMeanwhile, a 40-year-old woman was killed for “honour” in Korangi on Tuesday, police said.\n\nThe Awami Colony added that Zeenat Bibi was killed with a hard and blunt instrument, allegedly by her husband, Qamber Ali, in Bilal Colony. Police said she was killed over so-called honour and that the suspect has been arrested. Her body was shifted to the Jinnah Postgraduate Medical Centre for medico-legal procedures.\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:13:13.972Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942477/karachi-girl-found-dead-in-home-was-raped-murdered",
  "dateList": "2025-09-17",
  "date_published": "2025-09-16T23:58:55.000Z"
}
