{
  "title": "PM announces significant incentives for highest tax payers",
  "link": "https://www.app.com.pk/national/pm-announces-significant-incentives-for-highest-tax-payers/",
  "date_published": "2024-03-26T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 25 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday while terming the highest tax payers as ‘heroes of the nation’ announced significant incentives including issuance of blue passport to them and conferring of Pakistan Honour Cards and honourary title of ambassadors of the country upon them.\nAddressing a ‘Tax Excellence Awards’ ceremony held here to acknowledge the highest tax payers, the prime minister said the highest tax payers and exporters would be treated as honourary ambassadors of the country abroad and the country’s embassies across the globe would be directed to fully coordinate in this regard.\nThe prime minister further said that the purpose of the today’s ceremony was to acknowledge the contributions of the heroes of the nation and those who honestly paid taxes and served the country through their talents, with setting up of small and medium businesses, women entrepreneurs and those who had spurred the non-traditional exports.\nThe prime minister said that about Rs65 billion refunds had been issued to exporters upon his direction and he had also directed for making it a routine matter without any leniency.\nWhile mentioning the country’s economic issues and challenges, he stressed that the government and private sector had to work closely to overcome them.\n“If we want to resolve these issues, like two wheels of a vehicle, the private sector and the government have to work closely and with the support of provincial governments, the federal government will address the issues faced by the private sector, end red tape with provision of enabling circumstances to them so that they can tread upon the development path,” the prime minister said.\nThe government’s role was not to do the businesses but it acted like a catalyst and through facilitation, consultative process and enactment of policies; they could lead Pakistan on path to progress, he added.\nThe prime minister said that a nation’s voice was heard among the comity of nations when it had sound economic health.\n“The time has arrived when all have to accept the challenge through best solutions,” he opined and stressed upon overcoming the past decades mistakes.\n“Implementation of policies with letter and spirit and under complete dedication is the strategy of the incumbent government to put country on path of progress,” he added.\nHe further reiterated that they should get rid of costly oil churning power units to provide comparative power supply to industries and said that he had directed the minister concerned and authorities to do away with such junk.\nAbout FBR, he said they were taking measures for its complete restructuring and informed that next month, a consultant would be appointed.\nThe prime minister opined that the government’s revenue target was set at Rs 9 trillion whereas tax amount of about Rs 2.7 trillion was under litigation.\nHe underscored the need of appointment of competent tribunal heads to expeditiously dispose of the pending litigation, adding that he had also appealed to the chief justice for speedy disposal of such cases at the upper tiers.\nHe said the country’s tax collection stood around 9 per cent of the total GDP which was lowest in the region while huge chuck of tax was siphoned off.\nHe said that if this massive leakage was not plugged, further imposition of taxes would not yield results and underlined the need to reduce tax slabs.\nHe said that they required innovative tax initiatives.\nHe also appreciated the tax collectors and the relevant departments who he said would also be given public recognition.\nThe prime minister referring to seeking of foreign debts said that it was grave matter and it was high time to indulge into self introspection.\nHe emphasized upon an exports led growth, boosting of IT and agriculture development.\nYouth bulge was a valuable asset for the country that should be imparted skilled education, he observed.\nThe prime minister also termed another IMF programme a requirement for the country’s economic stability.\nThe prime minister mentioned the functioning of Special Investment Facilitation Council (SIFC) which was accelerating investment prospects by removing all hurdles.\nHe said that Pakistan enjoyed excellent ties with China and said that the second phase of China Pakistan Economic Corridor (CPEC) would expedite the economic development.\nThe prime minister said that they were outsourcing airports besides expediting the privatization of PIA, and regretted that state owned enterprises were making billion of rupees losses annually.\nMinister for Finance Muhammad Aurangzeb, in his remarks, said that for development and growth, taxes on internal side and exports on external side were drivers for development.\nHe stressed upon end to end digitization to plug the loopholes and structured reforms.\nChairman FBR Malik Amjad Zubair Tiwana said the ceremony was held to acknowledge contributions of the tax payers for the national economy.\nHe highlighted different measures of FBR to increase tax net and revenue generation including facilities in payment and compliance of taxes by enhancing use of technology.\nPresident of Federation of Pakistan Chambers of Commerce and Industry and Chairman Pakistan Business Council also spoke on the occasion and mentioned proposals to increase tax net and reforms in the economic sector.\nThey said there were about 4.5 million tax filers in the country and a total of 90 percent taxes were paid by the three percent tax payers.",
  "retrievedAt": "2025-08-11T01:35:08.964Z"
}
