{
  "title": "Senator Talha joins PPP, envisions broader role in political trajectory",
  "link": "https://www.app.com.pk/national/senator-talha-joins-ppp-envisions-broader-role-in-political-trajectory/",
  "date_published": "2024-03-25T22:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP):Former Minister for Religious Affairs and Interfaith Harmony, Senator Muhammad Talha Mehmood, on Tuesday, announced to join the Pakistan Peoples Party (PPP) alongside his associates, envisioning a broader national role in his political trajectory.\nIn a press conference held here at the PPP Central Secretariat’s Media Cell, he informed that his allegiance to the PPP stemmed from invitations extended by President Asif Ali Zardari and PPP Chairman Bilawal Bhutto Zardari.\nSenator Talha, underscoring the significance of his move, said his previous affiliation solely with the Jamiat Ulema Islam-Fazl, marking this transition as the inaugural departure from his established political journey.\nHe emphasized his unblemished background, likening his life to an open book accessible to all. He asserted never having availed himself of any official benefits or remunerations, notwithstanding the numerous governmental positions during his political life.\nGiven the current challenges, Senator Talha urged everyone to do their part in helping the country overcome its current political and economic problems.\nHe commended the PPP as the singular political entity equipped to navigate the nation through the multifaceted challenges, whether political or economic, confronting it at the national level.\nMeanwhile, PPP stalwart Nayyar Hussain Bukhari welcomed Senator Talha in the party and expressing confidence in its leadership.\nHe said the PPP leadership had the insight to take the country out of the current crises. He said Senator Talha’s role would be prominent in PPP and the party would make full use of his abilities.\nPPP Information Secretary Faisal Karim Kundi, welcoming Senator Talha in the party, said PPP would benefit from his political insight.\nHe pointed out that the oath was not being administered on reserved seats in Khyber Pakhtunkhwa violating the Constitution and law.\nKundi said those seats did not belong to the Sunni Ittehad Council, as it did not submit any list about it.\nHe claimed that in Senate elections, PPP would give a surprise in Khyber Pakhtunkhwa. He said PPP believed that the entire nation should fight terrorism together.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:34:40.210Z"
}
