{
  "title": "Govt traces terrorists behind Gwadar, Quetta incidents: Sheikh",
  "link": "https://www.app.com.pk/national/govt-traces-terrorists-behind-gwadar-quetta-incidents-sheikh/",
  "date_published": "2021-09-06T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):Minister for Interior, Sheikh Rashid Ahmad on Monday said that the government had achieved a major success in tracing the origin of attackers behind Gwadar and Quetta terrorist incidents.\nAddressing a press conference, the minister said that suicide bombers in Gwadar blast, took place on August 20 and another explosion targeting FC convoy on Mastung Road in Quetta, had been identified adding he said that they had come from Afghanistan.\nHe said that two boys lost their lives while four others, including a Chinese national got injured when a suicide bomber blew himself up targeting a vehicle carrying Chinese nationals in Gwadar while four people died and 20 injured on Sunday in a suicide attack near a check post on Mastung Road in Quetta.\nReplying to a question, he said that the Taliban’s desire to become part of the China-Pakistan Economic Corridor (CPEC) project is a positive sign. “CPEC is the jugular vein of Pakistan, and the friendship between Pakistan and China is higher than the Himalayas.”\nHe reiterated that the Taliban leadership had assured that Afghan soil will not be used against Pakistan, maintaining that situation at the Torkham border is normal and the government had not established any refugee camp at Torkham border or any other part of the country.\nHe said that the whole world was well aware of India’s such bemoaning condition as it invested billions of dollars in establishing Afghanistan’s National Directorate of Security (NDS) and making 60 training camps in Afghanistan during last 40 years.\nHe said that the Indian intelligence agency, Research and Analysis Wing (RAW), and Afghanistan’s National Directorate of Security (NDS) were also in a state of stress after facing defeat in fulfillment of their nefarious designs.\nHe added long-lasting peace in Afghanistan was important for the region as well as for the international world. He said that Pakistan would continue playing its role in maintaining peace in Afghanistan and for a stable government.\nHe said that peace and progress in Afghanistan was a must for peace and progress in Pakistan and in the entire region and that Pakistan wants peace and stability in Afghanistan.\nHe claimed that Afghanistan was going to be the central point of world politics in the days to come. “We had sacrificed more than any country in the world with the loss of 80,000 lives and over 100,000 who received injuries and disabilities, but still our morals are high with having the world’s most professional and sound army.”\nSheikh Rashid said, “We expect great respect and honor from the international world of these sacrifices just for maintaining peace and stability of the entire world. We are the major contributor to maintaining peace in the region.”\nHe said that the Pakistan Army was proficiently accomplishing its responsibility to safeguard the country and performing duties on borders to protect every inch of the motherland. He said that Pakistan’s security agencies were vigilant to respond to any threat from enemies.\nHe said that armed forces were monitoring movement along the divide. The minister said that the whole nation should be proud of having such professional security agencies and their sincere contribution towards the country.\nCommenting on the opposition’s protest against the government, Sheikh Rashid said that the opposition will not successful in their motives as public had fully rejected the politics of both Pakistan Muslim League (N) and Pakistan Peoples Party (PPP).",
  "retrievedAt": "2025-08-11T21:10:46.494Z"
}
