{
  "title": "PM for reviewing existing anti-narcotics laws to tackle menace of drugs",
  "link": "https://www.app.com.pk/national/pm-for-reviewing-existing-anti-narcotics-laws-to-tackle-menace-of-drugs/",
  "date_published": "2021-09-06T18:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): Prime Minister Imran Khan on Monday directed to review the existing anti-narcotics laws and ensure their effective implementation to tackle the menace of drugs.\nHe expressed his deep concern over the trends of drugs in the society particularly youth and said the same posed severe dangers to the future of young generation.\nThe Prime Minister while presiding over the meeting of National Anti-Narcotic Council here said the data regarding drugs in the society depicted the fact that the current anti-narcotics efforts and measures were insufficient.\nFederal Ministers Murad Saeed, Shafqat Mehmood, Shaukat Tarin, Ch. Fawad Hussain, Dr. Farogh Naseem, Syed Ali Haider Zaidi, Brig ® Ejaz Ahmad Shah, Pir Noor-ul-Haq Qadri and Special Assistant to PM Dr. Faisal Sultan were in attendance.\nChief Minister Punjab Sardar Usman Buzdar, Chief Minister Sindh Syed Murad Ali Shah, Chief Minister Khyber Pakhtoonkhwa Mahmood Khan, Chief Minister Gilgit Baltistan Khalid Khursheed, Prime Minister Azad Jammu and Kashmir Sardar Abdul Qayyum Niazi and Director General Anti-Narcotics Force (ANF) Maj. Gen. Ghulam Shabbi and senior officers concerned also attended the meeting.\nThe Prime Minister directed to formulate a comprehensive and coordinated strategy to effectively check the production, sale and purchase as well as the use of narcotics.\nThe participants were unanimous of the view that the federal and provincial government will have to work jointly and through effective coordination.\nThe meeting decided that besides the utilization of modern technology measures will also be taken at the level of schools and colleges to check and discourage this menace.\nThe establishment of model treatment centers for the rehabilitation of people affected by narcotics will also be part of the strategy.\nIt was also decided in the meeting that for the formulation of a comprehensive strategy and coordination among the relevant federal and provincial departments, ANF will act as the leading institution.",
  "retrievedAt": "2025-08-11T21:10:44.687Z"
}
