{
  "title": "PM says, India will have to give Kashmiris their due right to self-determination; sooner the better",
  "link": "https://www.app.com.pk/national/pm-says-india-will-have-to-give-kashmiris-their-due-right-to-self-determination-sooner-the-better-3/",
  "date_published": "2021-09-05T19:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): Prime Minister Imran Khan has stated that India will have to give Kashmiris their due right to self-determination, under the UN Security Council resolutions; sooner the better.\n“On our part, we will continue to expose the real face of radicalized India”, Imran Khan said in his message on the occasion of Defence and Martyrs Day (September 6) .\nThe Prime Minister said that due to present government’s proactive diplomacy, the international community was now convinced that the persecution of minorities across India and the atrocities unleashed on innocent Kashmiris in Illegally Occupied Jammu and Kashmir must end forthwith.\n“The saner international elements do recognize our role for peace”, he added.\nThe Prime Minister, however, reiterated that, “our desire for peace must not be misconstrued as weakness rather it must be reciprocated for sake of economic wellbeing and peoples’ prosperity in the entire region.”\nImran Khan said that living nations came out stronger and harder in the face of challenges. Pakistani nation stood out too, strong and resolute when the enemy in 1965 War challenged our existence, he added.\nThe Prime Minister recalled that when India on 6 September initiated an undeclared war against Pakistan, the whole nation came out to the support of its defenders; many even started marching towards the border with bare hands.\nSuch a display of national unity galvanized the already spirited armed forces in their fearless fight against the enemy, which has no parallel in history, he remarked.\nThe Prime Minister said that the gallant soldiers and officers, pilots and sailors proved to the world that they were ever ready to defend every inch of the homeland at all costs.\nThey fought bravely and did not care for their own lives and defended the frontiers by offering supreme sacrifice, he mentioned .\n“This magnificent day, the 6th of September, comes each year to let us pay rich tributes in particular to our heroes, the Ghazis and Shuhada, and the gallant armed forces overall, who have always been nation’s hope and pride.”\n“We salute the valiant sons of soil for laying down their precious lives in defence of their country. We pay homage to the families of Shuhada for sacrificing their loved ones in the defence of motherland”, Imran Khan maintained.\nThe Prime Minister, however, added that “As we remember this day, the enemy hasn’t accepted peaceful coexistence since creation of Pakistan – be it 1948, 1965, 1971 wars, the two decades long war against terror, creating disturbances and doing sabotage activities inside Pakistan or new waves of unleashed propaganda through cyber warfare and spy software.”\nHe pointed out that unfortunately, in the past India constantly perpetrated terrorism against Pakistan, using Afghan soil to create unrest in Pakistan.\n“On this day we not only condemn those involved in such heinous acts but also pay special tributes to our valiant Armed Forces who have rendered invaluable sacrifices for our motherland”,  he said, adding, the world must hold India accountable for its rogue behavior.\n“We commend the proactive and timely response of our security forces; India today stands exposed before the world community for its bid to hamper peace in the region, especially with reference to Pakistan.”\n“My message on this day to the valiant Armed Forces is that together we have come a long way in the struggle for making Pakistan’s defence strong and impregnable”, he added.\nThe Prime Minister said that the resilient Pakistani nation and battle-hardened Armed Forces have time and again proved that they were fully capable of defending the country and ready to meet any kind of eventuality.\n“Let us always enliven the flame of September in our hearts and minds, which is enough to stand tall and triumphant in face of challenges in our way”, he added.\n“Let us pay homage to our Shuhada and ghazis and pledge anew to defend Pakistan, safeguard its security and sovereignty at all costs. Pakistan Armed Forces Zindabad. Pakistan Paindabad”, the Prime Minister maintained.",
  "retrievedAt": "2025-08-11T21:10:53.202Z"
}
