{
  "title": "India’s narrow outlook ostracized 8 mln Kashmiris: Imam",
  "link": "https://www.app.com.pk/national/indias-narrow-outlook-ostracized-8-mln-kashmiris-imam/",
  "date_published": "2021-09-06T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): Federal Minister for National Food and Security Syed Fakhar Imam Monday said that India’s narrow and myopic outlook had ostracized 8 million Kashmiris and called upon the world to immediately act to avoid any untoward incident since these two nuclear powers Pakistan and India were looking at each other eyeball to eyeball.\nHe was chairing a Seminar on Kashmir organized by Jammu Kashmir Self Determination Movement International on the Defence here along with President Azad Jammu and Kashmir Sultan Mehmood Chaudhary. The event was also attended by numerous MPs of United Kingdom, parliamentarians and civil rights activists.\nFakhar Imam praised the services of Syed Ali Geelani and reiterated that the decision of Quaid-e-Azam to create Pakistan had once again been validated by the Hindutva policy of Indian PM Narendra Modi regarding Kashmir.\nHe said that PM Modi was trying to change the demographics of Kashmir.\nThe minister said that United Nations had on numerous occasions discussed the issue of Kashmir in the aftermath of the illegal and unilateral action of India on 5th August 2019, which proved that Kashmir was a disputed territory.\nHe reiterated that the status of Kashmir was as a disputed territory.\nFakhar said that the world had started to open its eyes to the human rights violations in Kashmir which had been highlighted by international media such as NY Times, Washington Post, Wallstreet Journal etc.\nFakhar said that the emerging strategic partnership between USA, Japan, Australia and India had allowed India to expand its hegemonic designs in the region.\nHe said that India’s ethos had completely changed under the RSS ideology of the Modi government.\nThe minister said that Imran Khan had raised the plight of the Kashmiris on every forum and would continue to do so in the future.\nHe said that the government of PTI would continue to expose India as an oppressor and aggressor denying the Kashmiris their right of self-determination in violation of the resolutions of the United Nations Security Council.\nFakhar said that India had the highest civilian to military ratio (9:1) in Kashmir to suppress their freedom.\nIndia should know that the government of Pakistan and every Pakistani fully supported the people of Kashmir, he added.",
  "retrievedAt": "2025-08-11T21:10:46.741Z"
}
