{
  "title": "Govt strives for rule of law to attract foreign investment, tourism: PM",
  "link": "https://www.app.com.pk/national/govt-strives-for-rule-of-law-to-attract-foreign-investment-tourism-pm/",
  "date_published": "2021-09-06T06:52:00.000Z",
  "source": "APP",
  "content": "NATHIA GALI, Sep 6 (APP): Prime Minister Imran Khan said the government was struggling for establishment of rule of law in the country to attract foreign investment and promote tourism.\n“We are fighting a battle to reform system and establish rule of law. No country can prosper sans rule of law. Many countries with sufficient resources are suffering poverty just for absence of rule of law,” the prime minister said addressing the groundbreaking ceremony of a five star hotel here Sunday.\nFederal Ministers Shibli Faraz, Azam Swati, Ali Haider Zaidi, State Minister Farrukh Habib, Chairman Parliamentary Committee on Kashmir Shahryar Afridi and provincial ministers attended the ceremony.\nA subsidiary of international hotels chain Hilton Hotels, the Double Tree by Hilton hotel is being constructed as first ever five-star hotel in KP.\nThe prime minister, who earlier unveiled the plaque and also planted a sapling under his government’s 10 Billion Tree Tsunami, said the opposition leaders criticized the government as they did not want the establishment of rule of law. They take advantage of the corrupt system which does not let the foreign investment come to the country, he added.\nHe said the country was moving ahead with record sale of cars and growth of large scale manufacturing this year.\nThe prime minister said nine million overseas Pakistanis had income equaling 220 million population of the country but unfortunately their potential was never tapped. The previous governments only thought of their own benefits and survival instead of public welfare, he added.\nHe said the wealth creation was country’s dire need which would ultimately generate jobs, enhance tax collection and lead to the repayment of foreign debts.\nHe said in order to attract investment from overseas Pakistanis, it was essential to introduce incentives and ensure protection as they had earlier lost trust due to corrupt practices in the country.\nHe said Pakistan’s exports would reach $30 billion this year, while Singapore had touched $300 billion mark and Malaysia $200 billion.\nThe prime minister said efforts should be made to attract investment from overseas Pakistanis unless country’s exports reached to the desired level.\nHe said owing to Khyber Pakhtunkhwa government’s efforts for promotion of tourism, the poverty level declined the fastest among all provinces as had also been recognized by the United Nations.\nHe said the construction of multinational hotel in Nathia Gali would attract more investment and promote high end tourism and skiing.\nHe said the construction of hotels would follow the development of resorts and skiing facilities. He said Pakistan had also great potential for skiing owing to prolonged snowy conditions.\nThe prime minister said the KP government had introduced zoning regulations in the province to provide land for hotels and resorts on low cost comparing the private sector.\nMumtaz Muslim, an overseas Pakistani investor constructing the hotel, said he had left the country in 2004 following death threats but having impressed by Prime Minister Imran Khan’s dream of Naya Pakistan, he had decided to invest again in the country.\nHe said the Hilton company had returned to Pakistan after 42 years which would prove to be step forward for tourism promotion. He said the project would cost $25 million and take three years to complete besides creating around 600 jobs.\nHe also proposed the government to offer public lands for hotels and industries for an enhanced lease period of 99 years.",
  "retrievedAt": "2025-08-11T21:10:52.874Z"
}
