{
  "title": "We pay homage to our Shuhada, Ghazis for epic deeds of heroism, says Air Chief",
  "link": "https://www.app.com.pk/national/we-pay-homage-to-our-shuhada-ghazis-for-epic-deeds-of-heroism-says-air-chief/",
  "date_published": "2021-09-06T09:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP):Pakistan Air Force (PAF) Chief of the Air Staff Air Chief Marshal Zaheer Ahmed Babar Sidhu on Monday while celebrating the Defence and Martyrs’ Day said, “We pay homage to our ‘Shuhada and Ghazis’ for their epic deeds of heroism and owe them an eternal debt of gratitude.”\nIn his message on the Defence Day of Pakistan paid tribute to Shuhada (martyrs) and Ghazis (who returned from the battle with pride), he said the day holds a special significance in the nation’s history, said a PAF media release.\nIt symbolized the remarkable show of unity by the nation and was also a lasting reminder of professionalism, valour and sacrifice displayed by the Armed Forces of Pakistan, he added.\nThe Air Chief underlined, “Certainly, the aggressor challenged the very existence of a peaceful but resolute state. Undoubtedly, Pakistan Air Force, in unison with sister services, delivered a knock-out punch to the enemy and set a legacy of fighting outnumbered.”\nOn this day of national pride, he assured the nation that Pakistan Air Force was alive to the evolving situation in the region and remained fully prepared to defend sovereignty and territorial integrity of Pakistan.\nUpholding Quaid’s vision of being “Second to None”, PAF he said relentlessly pursued excellence in all domains.\n“On this special day, we also salute the generations of Kashmiris who have laid down their lives fighting for freedom. I assure our Kashmiri brothers and sisters of our resolute commitment and steadfast moral, political and diplomatic support,” he vowed.\nHe concluded with his prayers, “May Allah Almighty guide our efforts and give us strength to safeguard the aerial frontiers of Pakistan; a commitment to which PAF has always measured up and will continue to do so in the times ahead Insha-Allah!”\nIn his message, he also mentioned slogans of Pakistan Air Force Zindabad! Pakistan Paindabad!",
  "retrievedAt": "2025-08-11T21:10:51.425Z"
}
