{
  "title": "Global lenders’ climate finance hits record $137bn in 2024 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Global climate finance provided by multilateral development banks (MDBs) rose by 10 per cent in 2024, reaching a record $137 billion, with the bulk directed to low and middle-income economies, according to a new report.\n\nPrivate finance mobilised by MDBs for climate action also climbed sharply, reaching $134bn in 2024 — a 33pc increase from the previous year.\n\nHigh-income states got $51.5bn in support\n\nThe report, released by the Asian Infrastructure Investment Bank (AIIB), said climate finance remains central to MDBs’ efforts to advance sustainable development worldwide. By supporting investments in renewable energy, green cities, clean transport, water and food security, MDBs are helping countries move closer to achieving the Sustain­able Development Goals.\n\nOf the total climate finance last year, $85.1bn went to low and middle-income economies. Climate finance to these countries has more than doubled over the past five years and rose 14pc year-on-year. Of this, $58.8bn, or 69pc, was allocated for climate change mitigation, while $26.3bn, or 31pc, was directed to adaptation.\n\nMobilised private finance for climate investments in these economies amounted to $33bn.\n\nIn high-income countries, MDBs’ climate finance reached $51.5bn in 2024, of which $46.5bn (90pc) supported mitigation and $5bn (10pc) backed adaptation. Mobilised private finance for climate-related inves­t­ments in these countries stood at $101bn.\n\nThe 2024 climate finance data was compiled by the European Bank for Reconstruction and Deve­lo­pment and includes contributions from the Afr­ican Development Bank, Asian Development Bank, Council of Europe Develo­pment Bank, European Inve­stment Bank, Inter-American Development Bank Group, Islamic Development Bank, New Development Bank and World Bank Group.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:39:08.315Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941833/global-lenders-climate-finance-hits-record-137bn-in-2024",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:46.000Z"
}
