{
  "title": "Former world boxing champion Ricky Hatton dies at age 46 - Sport - DAWN.COM",
  "author": null,
  "content": "British boxer Ricky Hatton has died at the age of 46, the BBC reported on Sunday.\n\nFormer world champion Hatton won titles at light-welterweight and welterweight, before retiring in 2012. He had been due to make a comeback for an event in Dubai later this year.\n\nGreater Manchester Police said in a statement that a body had been found on Sunday morning at an address in Hyde in the northern English city.\n\nA police spokesman said: “Officers were called by a member of the public to attend Bowlacre Road, Hyde, Tameside, at 6:45am (0545 GMT) today (Sunday) where they found the body of a 46-year-old man. There are not currently believed to be any suspicious circumstances.”\n\nHatton had 45 wins in 48 bouts over his career but in the years after he retired he said he had tried to kill himself several times and had been open about his struggle with depression, drink and drugs.\n\n“I was coming off the rails with my drinking and that led to drugs. It was like a runaway train,” he told BBC radio in 2016.\n\nHatton’s best performance came in 2005 when he stopped Australian Kostya Tszyu to add the IBF light-welterweight title to the WBU belt he already held.\n\nHe had a perfect 43-0 record until he was floored by Floyd Mayweather Jr in Las Vegas in 2007 and was never the same again.\n\nBritain’s former world heavyweight champion Tyson Fury paid tribute to Hatton.\n\n“Rip to the legend Ricky Hatton may he rip,” Fury posted on Instagram.\n\n“There will only ever be 1 Ricky Hatton. Can’t believe this so young.”\n\nAnother former world champion, Britain’s Amir Khan, described Hatton on X as a “mentor, warrior and one of Britain’s greatest boxers”.\n\nKhan added: “As fighters, we tell ourselves we’re strong – we train, we sweat, we take hits, we get up. But sometimes the hardest fight happens in silence, in the mind.\n\n“Mental health isn’t weakness. It’s part of being human. And we must talk about it. We must reach out. We must lean on each other.\n\n“Ricky, thank you for everything. For your fights, your moments of glory, your grit. Thank you for pushing us, showing us what’s possible.\n\nMatchroom Boxing said: “(We are) saddened to hear the news of Ricky Hatton’s passing. Our thoughts and condolences are with Ricky’s friends and family at this tragic time. There’s only one Ricky Hatton.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/14173545c15f523.webp",
  "retrievedAt": "2025-09-19T14:38:39.050Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941943/former-world-boxing-champion-ricky-hatton-dies-at-age-46",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T12:38:36.000Z"
}
