{
  "title": "Commerce minister reaches Iran on three-day visit to boost economic ties - Business - DAWN.COM",
  "author": null,
  "content": "Federal Commerce Minister Jam Kamal Khan reached Tehran on Sunday for a three-day official visit to boost economic relations between Pakistan and Iran, according to a press release from the commerce ministry.\n\nPakistan and Iran share close ties and have signed multiple agreements across sectors such as energy and trade.\n\nAccording to the press release, Khan is expected to lead the Pakistan-Iran Joint Economic Commission and Business Forum during his visit.\n\n“He was received at Imam Khomeini International Airport by Mr Amin Tarfa’a, adviser to Iran’s Ministry of Roads and Urban Development,” the press release read.\n\n“During the visit, [Khan] will lead the 22nd Session of the Pakistan–Iran Joint Economic Commission and co-chair the Pakistan–Iran Joint Business Forum. He is also scheduled to hold meetings with key Iranian ministers and senior officials to strengthen bilateral trade and investment cooperation.”\n\nKhan’s visit aims to give fresh momentum to economic and commercial ties between the two nations through the Joint Economic Commission and the Business Forum, the commerce ministry stated.\n\nIn August, Iranian President Masoud Pezeshkian visited Pakistan, where 12 agreements and memorandums of understanding (MoUs) were signed.\n\nDuring the bilateral meeting both sides discussed the broad aspects of their bilateral ties, brotherly relations, religious and cultural ties, and held comprehensive talks to further boost them.\n\n“The agreements and MoUs included cooperation for plant protection and plant quarantine, joint use of Mirjaveh-Taftan border gate, collaboration in science, technology and innovation, cooperation in information and communications technology,” Radio Pakistan reported.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:38:40.082Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941939/commerce-minister-reaches-iran-on-three-day-visit-to-boost-economic-ties",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T11:53:47.000Z"
}
