{
  "title": "Pakistan seeks partners for digital future - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakis­tan Virtual Asset Regulatory Authority (PVARA) has invited Expressions of Interest (EoIs) from leading global exchanges and Virtual Asset Service Providers (VASPs) to participate in the country’s emerging digital economy.\n\nEstablished under the Virt­ual Assets Ordinance 2025 (Ordinance No. VII of 2025), PVARA is mandated to formalise and regulate virtual assets in line with international standards set by the Financial Action Task Force (FATF), IMF and World Bank.\n\nThe ordinance, promulgated on July 8 and published in the Gazette of Pakistan on July 9, empowers the authority to license, regulate and supervise VASPs, ensuring strong anti-money laundering (AML), counter-terrorism financing (CFT) and cybersecurity frameworks.\n\nThe finance ministry, in a statement issued on Saturday, said Pakistan’s virtual asset market already has more than 40 million users, with annual trading volumes estimated at over $300bn, making it one of the world’s largest untapped frontiers.\n\n“This EoI is our invitation to the world’s leading VASPs to partner in building a transparent and inclusive digital financial future for Pakistan,” said Bilal bin Saqib, chairman of PVARA and minister of state for crypto and blockchain.\n\nPVARA invites expressions of interest from global crypto exchanges\n\nEligibility has been restric­ted to VASPs and exchanges already licensed under recognised international regulators, including the US Securities and Exchange Commission, UK Financial Conduct Autho­rity, EU’s VASP framework, UAE’s Virtual Assets Regu­la­tory Authority and the Mone­tary Authority of Singapore. Applicants must demonstrate compliance with AML, CFT and know-your-customer standards.\n\nSubmissions are required to include company profiles, licensing details with jurisdictions and authorities, services offered — such as trading and custody — technology and security protocols, assets under management, revenue, and compliance history. Applicants must also outline proposed business models for operating in Pakistan.\n\nEoIs must be submitted in PDF format via email to info@pvara.gov.pk with the subject line marked “EoI VASP Lice­nsing — [Company Name]”. Applications will be accepted on a rolling basis.\n\nPVARA is an autonomous federal body governed by a multi-stakeholder board including the governor of the State Bank of Pakistan, the chairman of the Securities and Exchange Commission of Pakistan, and the chairman of the Federal Board of Revenue.\n\nIts mandate is to curb illicit finance, protect consumers and unlock opportunities in fintech, remittances and tokenised assets, while fostering Shariah-compliant innovation through regulatory sandboxes.­\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:09:14.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941811/pakistan-seeks-partners-for-digital-future",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:54.000Z"
}
