{
  "title": "Blasphemy accused in Chakwal diagnosed with bipolar disorder - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHAKWAL: A medical board of Benazir Bhutto Hospital, Rawalpindi, has declared a blasphemy accused suffering from bipolar disorder with recommendations to continue the psychotropic treatment, regular follow-ups, and continued monitoring, Dawn has learnt.\n\nThe accused, a 26-year-old young man, had been arrested on October 30 last year on blasphemy charges.\n\nDespite police taking permission from the court for the medical examination of the accused on November 4, 2024, official lethargy delayed the process, with the officials of the Jhelum Jail taking more than nine months to write to the medical superintendent (MS) of the hospital for the mental examination.\n\nAccording to the documents, the superintendent of the Jhelum Prison had written a letter to the MS of the hospital on July 23 seeking constitution of a medical board.\n\nThe three-member medical board, comprising a consultant psychiatrist, a senior clinical psychologist and a senior official of the institute, conducted mental examinations of the accused on August 5 and August 18.\n\nAccording to the medical report, the medical board examined the accused thoroughly and advised some lab tests, the results of which are still awaited.\n\nThe board stated that “the accused is suffering from Bipolar Disorder Type I, a remitting and relapsing psychiatric disorder characterised by multiple episodes of mania and depression with intervening periods of remission.”\n\nThe family of the accused man and some neighbours had claimed at the time of his arrest that the accused was mentally-retarded.\n\nThe poverty-stricken family couldn’t hire a lawyer, and a state-appointed lawyer has been assigned to the case. The family has also been struggling to visit the accused in Jhelum prison due to financial constraints.\n\nThe accused’s mother, who was in good health before her son’s arrest, is now confined to her bed with multiple health issues. The family is worried about the accused’s condition, which they believe is worsening, and are seeking proper treatment and care for him.\n\n“We have visited him [the accused man] in the prison hardly for four times as we could not afford to visit him on every Thursday due to our poor financial condition,” said the younger brother of the accused while talking to Dawn, adding that they paid last visit to the accused a month ago.\n\nWhen this correspondent inquired the woman about the condition of her jailed son, she started crying.\n\n“We do not know whether he is being treated and looked after as recommended by the medical board. We are not even aware of his medical report as I could not access it”, said the younger brother.\n\nThe state-appointed lawyer said he hadn’t visited the accused yet, and the trial couldn’t commence without the forensic report of the video, which is still pending.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:38:50.328Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941767/blasphemy-accused-in-chakwal-diagnosed-with-bipolar-disorder",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:23:30.000Z"
}
