{
  "title": "IAEA backs nuclear solutions for climate-hit agriculture in Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s agriculture sector could mitigate and adapt to climate change through the use of nuclear technology, according to a recent assessment mission under the Atoms4Food Initiative — the first of its kind in Asia and the Pacific, launched by the International Atomic Energy Agency (IAEA).\n\nThe mission noted that climate change — rising temperatures, erratic rainfall and more frequent extreme weather events — poses a threat to the production of staple crops such as wheat and rice, as well as cash crops including cotton.\n\nScarce irrigation water, soil degradation and growing pest populations are further straining food security for Pakistan’s 250 million inhabitants.\n\nPakistan was among the first in Asia and the Pacific region to commit to the Atoms4Food Initiative since its launch in October 2023.\n\nAtoms4Food initiative to help boost crop yields, food security\n\nFollowing a request from the government, an assessment mission was organised by the IAEA and the FAO last month and its goals were to consult stakeholders and analyse country-level data to better understand Pakistan’s food security and agricultural resilience needs before ultimately making data-driven, country-specific recommendations.\n\nThe Atoms4Food assessment mission found further potential to optimise and broaden the adoption of climate-smart agricultural practices in the country.\n\nThis includes capacity building in efficient nutrient and water use practices, to enhance soil fertility and health, as well as reducing the carbon footprint of fertilisation.\n\nFindings of the assessment mission will provide the basis for the development and implementation of a national Atoms4Food action plan, which will deliver support in the areas of research, transfer of technology and capacity building to empower national and local stakeholders for a more robust and resilient agri-food system, IAEA says in a bulletin.\n\nFuture cooperation with Pakistan through the ‘Atoms4Food’ initiative will focus on upgrading local capacities in the use of nuclear technologies for the detection, characterisation, and monitoring of animal diseases, zoonotic diseases and antibiotic resistance, and producing safe and effective vaccines against animal pathogens using irradiation.\n\n“Despite contributing less than one per cent of global greenhouse gas emissions, Pakistan is highly vulnerable to climate change, experiencing significant economic damage from extreme weather events,” said Secretary National Food Security, Amir Mohyuddin.\n\n“The agricultural sector, crucial to the Pakistani economy, faces dire consequences, with some projections indicating a potential substantial loss in production if current practices continue, due to increasing temperatures and erratic rainfall patterns,” he said.\n\nBuilding on Pakistan’s cooperation with the FAO and IAEA to produce new and improved plant varieties, the assessment mission highlighted opportunities to integrate advanced technologies such as speed breeding and biotechnology into mutation breeding programmes for priority crops in Pakistan.\n\n“Pakistan has used mutation breeding to create pest-resistant and drought-tolerant crops like chickpea, rice and cotton. We have employed nuclear techniques to improve soil fertility, we have reclaimed barren land, optimised fertiliser use for better yields and reduced costs, to give a few examples,” said Muhammad Yussouf Saleem, director general and chief scientist of the Agri & Biotech division of the Pakistan Atomic Energy Commission (PAEC) and the national focal point in Pakistan for Atoms4Food.\n\n“The initiative will further expand our cooperation by engaging new partners and breaking silos across sectors with a whole value-chain approach,” he said.\n\nRevitalising Pakistan’s seed system will also help capitalise on the improved plant varieties developed with FAO and IAEA support. The mission team recommended that national institutions and stakeholders across the value chain be trained to scale up the distribution and use of improved seeds, ensuring they reach farmers and translate into increased yields.\n\nSoil degradation and inefficient use of water and nutrients further limit crop production — however, decades of cooperation with the IAEA has supported Pakistan’s Nuclear Institute for Agriculture and Biology in transforming salt-affected soils into productive farmland.\n\nWithout an effective system to test and control food safety, the export of agricultural produce from Pakistan remains difficult. A dearth of accredited testing capacities for mycotoxins, veterinary drugs and microbes is a bottleneck in Pakistan’s efforts to improve the safety of food products for foreign markets.\n\nThe assessment mission recommended scaling up monitoring capabilities and establishing a national plan to ensure safety across the food value chain.\n\nA review of Pakistan’s analytical capacity for the application of stable isotope techniques in nutritional assessments revealed further opportunities to integrate nuclear technologies in informing evidence-based nutrition policymaking.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:09:34.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941834/iaea-backs-nuclear-solutions-for-climate-hit-agriculture-in-pakistan",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:46.000Z"
}
