{
  "title": "Policeman among eight ‘carjackers’ arrested in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A serving policeman and seven other suspects have been arrested for their alleged involvement in a series of carjacking incidents in the metropolis, said city police chief Javed Odho on Saturday.\n\nAddressing a press conference at his office, Mr Odho described the arrested individuals as members of an “organised and coordinated” inter-provincial gang of car lifters.\n\nHe said the suspects had set up a workshop in Baldia Town where they tampered with stolen vehicles and sold them as non-custom paid cars, not only in Karachi but also in Khyber Pakhtunkhwa and Balochistan.\n\nAmong those arrested is Ayaz Jameel, a serving policeman from Madadgar-15, who allegedly facilitated the gang by helping transport the stolen vehicles to other provinces.\n\nMr Odho also shared that five policemen have been shot dead in Karachi so far this year. Initial investigations suggest these killings were acts of terrorism, and the Counter Terrorism Department is currently investigating the cases.\n\nHe announced that in a bid to modernise enforcement, an e-challan system for traffic violations would be introduced from October 1. The initiative aims to bridge the gap between the police and the public.\n\nCommenting on the city’s crime situation, Mr Odho revealed that 53 people were killed by robbers during robberies this year. Of these cases, 70 per cent have been “solved”, with police arresting 52 suspects and killing 11 others in encounters.\n\nDuring the same period, 189 people were injured in robbery-related shootings. Police claim to have solved 65pc of these cases by arresting 158 suspects and killing five in encounters.\n\nAdmitting that street crime remains a major challenge, the Addl IG said there had been a significant decrease in violent incidents. Killings during robbery resistance have dropped by up to 45pc over the past year. Meanwhile, incidents of mobile phone snatching, carjacking, and motorcycle theft have also declined, he added.\n\nHe further claimed that kidnapping-for-ransom cases have dropped by 49pc, with 55 abducted victims recovered safely.\n\nMr Odho also shared that narcotics worth Rs11 billion had been seized in recent police operations.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:09:14.054Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941809/policeman-among-eight-carjackers-arrested-in-karachi",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:23:14.000Z"
}
