{
  "title": "Zardari calls for deeper Pak-China cultural ties - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Highlights art and culture as bridges of peace while addressing second Golden Panda Awards Forum in Chengdu\n• Meets CPC leader Li Shulei; conveys commitment to political, economic, and cultural cooperation.\n\nISLAMABAD: President Asif Ali Zardari on Saturday reaffirmed Pakistan’s readiness to work with China and other natio­­ns to expand cultural exchanges, strengthen creative industries and promote understanding and a culture of tolerance.\n\nHe said culture remained a vital bridge to peace, prosperity, and a shared future for humanity.\n\nThe president addressed the Second Golden Panda Awards International Culture Forum in Chengdu, Sichuan Province, China, where he highlighted the power of art and culture in uniting people and connecting civilisations.\n\nThe forum was attended by senior Chinese leaders, cultural representatives, artists and international delegates, President Secretariat Press Wing said in a press release.\n\nPresident Zardari underlined that the enduring Pakistan-China friendship stood as a model of mutual respect and cooperation.\n\nAs the two countries prepare to celebrate the 75th anniversary of diplomatic ties next year, he recalled that this partnership remained not only strategic but also a living testimony of the deep bonds of friendship between their peoples.\n\nHe reiterated Pakistan’s full support for China’s vision of civilisational exchange and mutual learning. He also emphasised the significance of the Global Development Initiative (GDI), the Global Security Initiative (GSI), and the Global Governance Initiative (GGI), noting their focus on sustainable development, regional stability, and inclusive international cooperation.\n\nThe president underscored the importance of the GGI, which promotes respect for the diversity of civilisations, equality among cultures, people-to-people exchan­ges, and cultural dialogue as a counter to narratives of a clash of civilisations.\n\nHe observed that the world was undergoing dramatic changes, and praised China under President Xi Jinping for offering a path of cooperation and win-win solutions instead of confrontation.\n\nHe said that he was immensely impressed by how these initiatives served the common values of humanity.\n\nPresident Zardari congratulated the award winners and appreciated their creativity, noting that such artistic endeavours transcend borders and bring people together through shared human values.\n\nMeanwhile, President Asif Ali Zardari held a meeting with Li Shulei, member of the Political Bureau and Secretariat of the Communist Party of China (CPC) Central Committee, and Minister of the Publicity Department of the CPC Central Committee in Chengdu, China.\n\nDuring the meeting, the president emphasised the importance of expanding cooperation betw­een Pakistan and China in political, economic and cultural fields, underlining Pakistan’s commitment to deepening people-to-people contacts and public diplomacy.\n\nHe thanked the CPC leader for hosting him in Sichuan and felicitated him and the organisers on the successful holding of the Second Golden Panda Awards International Culture Forum.\n\nMr Shulei said that President Xi Jinping had sent his best wishes and greetings to President Zardari and recalled their meeting during the president’s visit in February this year.\n\nHe also appreciated President Zardari’s recent article in China Daily, underlining the high regard in which Pakistan’s perspectives were held in China.\n\nHe further observed that both he and President Xi highly valued the leadership shown by President Zardari in strengthening the Pakistan-China partnership.\n\nThe world is changing, but China and Pakistan will remain iron-clad brothers.\n\n“Today, the world needs and deserves the fragrance of books rather than the smell of gunpowder,” he said.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1409423107f2292.webp",
  "retrievedAt": "2025-09-19T14:38:42.767Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941837/zardari-calls-for-deeper-pak-china-cultural-ties",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:45.000Z"
}
