{
  "title": "Chinese officials hold talks in Spain on trade irritants, TikTok deadline - World - DAWN.COM",
  "author": null,
  "content": "United States and Chinese officials began talks in Madrid on Sunday on their strained trade ties, a looming divestiture deadline for Chinese short video app TikTok and Washington’s demands that its allies place tariffs on China over its purchases of Russian oil.\n\nUS Treasury Secretary Scott Bessent and US Trade Representative Jamieson Greer arrived shortly before Chinese Vice Premier He Lifeng and China’s top trade negotiator, Li Chenggang, at the baroque Palacio de Santa Cruz, which houses Spain’s foreign ministry in the Spanish capital.\n\nThe talks mark the fourth time in four months that the delegations have met in European cities to try to keep a fractured US-China trade relationship from collapsing under US President Donald Trump’s tariffs.\n\nThe delegations last met in Stockholm in July, where they agreed in principle to extend for 90 days a trade truce that sharply reduced triple-digit retaliatory tariffs on both sides and restarted the flow of rare-earth minerals from China to the United States.\n\nTrump has approved the extension of current US tariff rates on Chinese goods, totalling about 55 per cent, until November 10.\n\nTrade experts said there was little likelihood of a substantial breakthrough in the talks hosted by Spain, which has sought to improve ties with Beijing in recent years.\n\nThe most likely result of the Madrid talks is seen as another extension of a deadline for the popular TikTok app’s Chinese owner, ByteDance, to divest its US operations by September 17 or face a US shutdown.\n\nA source familiar with the Trump administration’s discussions on TikTok’s future said that a deal was not expected, but that the deadline would be extended for a fourth time since Trump took office in January. Trump last month launched a TikTok account.\n\nTikTok has not been discussed in previous rounds of US-China trade talks in Geneva, London and Stockholm.\n\nBut the source said the issue’s public inclusion as an agenda item on the Treasury’s announcement of the talks gives the Trump administration political cover for another extension, which may annoy both Republicans and Democrats in Congress who mandated TikTok’s sale to a US entity to reduce national security risks.\n\nWendy Cutler, a former USTR trade negotiator and head of the Asia Society Policy Institute in Washington, said she expected more substantial “deliverables” to be saved for a potential meeting between Trump and Chinese President Xi Jinping later this year, perhaps at an Asia Pacific Economic Cooperation summit in Seoul at the end of October.\n\nThese may include a final deal to resolve US national security concerns over TikTok, and a lifting of restrictions on Chinese purchases of American soybeans and reduction of fentanyl-related tariffs on Chinese goods, and the Madrid discussions may help lay groundwork for such a meeting, Cutler said.\n\nBut she said resolving core US economic complaints about China, including its demands that China shift its economic model toward more domestic consumption and rely less on state-subsidised exports, could take years.\n\n“Frankly, I don’t think China is in any rush to do an agreement where they don’t get substantial concessions on export controls and lower tariffs, which are their key priorities,” Cutler said. “And I don’t see the United States in a position to make major concessions on either, unless there’s some breakthrough on its demands to China.”\n\nThe treasury has said the Madrid talks also would cover joint US-Chinese efforts to combat money laundering, a reference to its longstanding demands that China clamp down on illicit shipments of technology goods to Russia that aid its war in Ukraine.\n\nBessent urged Group of Seven (G7) allies on Friday to impose “meaningful tariffs” on imports from China and India to pressure them to stop buying Russian oil, a move aimed at bringing Moscow into Ukraine peace negotiations by curbing its oil revenues.\n\nThe G7 finance ministers said on Friday they discussed such measures and agreed to speed up discussions to use frozen Russian assets to aid Ukraine’s defence. Bessent and Greer said in a separate statement that G7 allies should join the United States in imposing tariffs on buyers of Russian oil.\n\n“Only with a unified effort that cuts off the revenues funding Putin’s war machine at the source will we be able to apply sufficient economic pressure to end the senseless killing,” Bessent and Greer said, referring to Russian President Vladimir Putin.\n\nThe US has imposed an extra 25pc tariff on Indian goods over the country’s purchases of Russian oil, but has so far refrained from imposing such punitive duties on Chinese goods.\n\nChina’s Ministry of Commerce has said the Madrid talks will cover economic and trade issues such as US tariffs, the “abuse” of export controls and TikTok.\n\nSpanish Foreign Minister Jos Manuel Albares publicly greeted the two delegations before the start of talks.\n\nA Spanish government source said the choice of Spain for the latest round of the “delicate” talks was evidence that Madrid was consolidating itself as a seat of high-level and strategic negotiations. Madrid has sought to be a venue for an international peace conference to resolve the Israel-Palestinian conflict.\n\nThe source said Spain’s government also takes advantage of the event to reinforce its own bilateral relations with the US following a series of tense engagements with the Trump administration.\n\nSpain has criticised Israel’s offensive in Gaza and refused to commit to spending 5pc of its budget on defence, along with other Nato members.\n\nBessent himself has also criticised Spain for declaring Beijing a “strategic partner” at the height of Trump’s tariff offensive in April, saying that a closer relationship with the Asian giant was akin to “cutting your own throat”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/141812543ff9c03.webp",
  "retrievedAt": "2025-09-19T14:38:39.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941947/chinese-officials-hold-talks-in-spain-on-trade-irritants-tiktok-deadline",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T13:42:12.000Z"
}
