{
  "title": "Rising floodwaters in Thatta riverine area force villagers to evacuate - Pakistan - DAWN.COM",
  "author": null,
  "content": "THATTA/LARKANA: Rising pressure of floodwaters on the Baghar Ochto protective dyke of Indus River has triggered fresh fears of flooding in Mangli area near Ghorabari as Chhachh Lake in the riverine area has already overflowed and submerged several villages.\n\nEntire settlements of Ramzan Mallah, Usman Khaskheli, Urs Mallah, Allah Dino Mallah, Haroon Mallah, Ghulam Mallah, Haji Shahdad Khaskheli, Haroon Khaskheli, and Suleman Mallah have been encircled by water, cutting off their road access to nearby towns. The villagers are now using boats to receive food and other essentials.\n\nAs the lake swells with Indus waters, reverse flow has begun, inundating vast tracts of the riverine belt. The Ghar Marhu canal, which irrigated hundreds of thousands of acres through Udero Lal Barrage on the river, was blocked near the GBU dyke last week in a desperate attempt to preempt damage from the rising floodwaters.\n\nBut preparedness on ground remained questionable. Near Isa Khaskheli village, the irrigation department has set up only a makeshift hut manned by a few junior staffers.\n\nA bulldozer stationed on-site stands idle for lack of fuel. During a visit by journalists, the dyke was found abandoned, with no senior irrigation officials in sight.\n\n“The bulldozer has just been parked here for show. It has no diesel,” said the machine’s operator, adding that repeated appeals for fuel had been ignored by the officers concerned.\n\nFor villagers in Isa Khaskheli, Basar Khaskheli, Ali Muhammad Khaskheli, and Gheel Mori town, anxiety grows by the day. With their homes under water and escape routes severed, they fear the dyke could collapse in the absence of urgent intervention.\n\nLocal communities demanded immediate action against negligent irrigation officials and deployment of trained staff and resources at the Baghar Ochto dyke to prevent what they warned could become a humanitarian disaster.\n\nIrrigation officials busy strengthening dykes\n\nIn Larkana, the officials had foc­us­ed on taking maximum possible measures to ensure the deluge safely passed under Sukkur Barrage and flowed down to the sea with minimum and no damage.\n\nPresently, Moria Loop Bund, New/Old Abad Loop Bund and Hakra Loop Bund managed by Northern Dadu division were declared highly sensitive where irrigation officials were vigilant and busy strengthening the existing structures.\n\nReports from Naudero on Saturday suggested that the Indus was continuously rising at Burira Ferry point forcing villagers in riverine area to shift to the dykes. As soon as water receded they would return to their dwellings.\n\nA number of few families, who had taken shelter on Larkana-Sehwan dyke near Dodo Sanhari village, complained to this reporter about lack of assistance from the district government.\n\nAt Larkana-Khairpur bridge alongside the ‘Palija bund’, floodwater was coming close to the dyke while the irrigation department had temporarily built huts manned with staff to keep an eye on the situation.\n\nA large number of dumpers and trucks loaded with stones were being unloaded at Moria Loop dyke where the river was striking with full force and mounting pressure.\n\nMPA Mir Nadir Magsi had on Friday said the New/Old Abad dyke was highly sensitive. Northern Dadu Division’s superintendent engineer Jamil Sangi, assistant engineer Riaz Abbasi and sub-engineer Nadeem Jaffery told journalists at the dyke on Saturday that work was going on to strengthen the dyke.\n\nThis dyke was located four kilometers upstream near the structure of Larkana-Khairpur bridge and was part of Larkana-Sehwan dyke, said Mr Sangi.\n\nThe river at this point had created an island and shifted its main current about one mile away from the main dyke while stagnant water was also staying there. The irrigation officials said that main current could at any moment shift, as it all depended on the behaviour of the river.\n\nSources in the irrigation department disclosed that Japan International Coope­ration Agency (JICA) had committed to strengthen the New/Old Abad dyke. The work would only start once the required studies as per JICA’s criteria were completed, said the sources, adding that two years had passed since the commitment.\n\nThe sources said that the dyke was not in good shape and a team of experts from JICA was due to arrive on Monday to visit the site along with the irrigation officials concerned.\n\nAlmost all depressions close to the dyke were filled with floodwater but surprisingly the dwellers were still reluctant to leave their houses and move up to the dyke or to safer place.\n\nAt Hakra Loop dyke six kilometers from Mohenjo Daro irrigation staff were posted in temporarily built huts. Work on apron and stone pitching was under way from 13/0 miles to 22/2 miles where floodwater struck the dyke. Presently 16/1 mile of Hakra dyke was risky, said the irrigation staff stationed there.\n\nThere are five spurs to protect the Hakra Loop dyke however it was seen that residents of riverine area were trying to reach the dyke after wading through stagnant water inundating their land, crops and houses.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c5e71bd08d1.jpg",
  "retrievedAt": "2025-09-19T14:38:54.580Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941800/rising-floodwaters-in-thatta-riverine-area-force-villagers-to-evacuate",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:23:14.000Z"
}
