{
  "title": "Salman Agha’s fearless aura signals new dawn for Pakistan cricket - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Salman Ali Agha didn’t flinch. He knew exactly what to say.\n\n“There’s no such message to the players,” he responded when asked at the Asia Cup captains’ press conference if he had instructed his men to keep their cool against India on Sunday — their first meeting since the brief armed conflict between the two countries in May.\n\n“My players are more than welcome to show aggression whenever they want,” Salman went on. “As far as it remains within the field.”\n\nIt was a breath of fresh air for Pakistan cricket fans — both casuals and diehards. Honesty, assertiveness and an unapologetic tone have defined Salman’s early days as Pakistan’s Twenty20 International captain. His arrival has coincided with Mike Hesson’s appointment as white-ball head coach, and together they’ve tried to instil a structure long missing from Pakistan cricket.\n\n“Salman’s appointment as Pakistan’s captain has raised expectations,” Ali Zaki, a 22-year-old fan, told Dawn on Saturday. “Although our team is inexperienced, the intent from the players is evident. Before this, I had no expectations from the team.”\n\nThe new vibe is fearless, loud, and unapologetic\n\nAs many as 15 matches into their partnership, Salman and Hesson may not have perfected their messaging, but both have been clear and consistent. Hesson has taken bold decisions — most notably moving on from Babar Azam and Mohammad Rizwan — and backed younger talent while stressing squad culture over individual reliance.\n\nSalman, meanwhile, has spoken with refreshing honesty. “You can’t make the Pakistan team without merit,” he reminded during a podcast recently. “You have to clear tough hurdles and perform consistently at every level.”\n\nThe contrast with the timid, hesitant era that preceded them is stark. Pakistan’s last year T20 World Cup campaign ended in a first-round exit, complete with an embarrassing loss to the USA, and exposed the costs of mediocrity. Even during brief spells of stability, there was reluctance to change and an unwillingness to match the approach of top sides.\n\nNow, the signs suggest something different. Emerging names like Saim Ayub, Sahibzada Farhan and Hasan Nawaz are encouraged to take on games without fear.\n\nFor Salman, the shift is about resetting Pakistan’s cricketing identity.\n\n“We can’t afford to play with fear anymore,” he said in the same podcast. “Our job is to take the game on, no matter who the opposition is.”\n\nThat confidence is trickling into how Pakistan carries itself. Media interactions have grown sharper, less about protecting reputations and more about clarity. The stump mics too, have captured Salman’s slip-field chatter — quips, sledges and the occasional harmless expletive — giving fans a glimpse of a dressing room no longer shy of character.\n\nFor once, Pakistan’s “aura”, as the Gen Z fans put it, feels like it belongs to the present, not the past.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/14110736644ccc3.webp",
  "retrievedAt": "2025-09-19T14:39:19.557Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941847/salman-aghas-fearless-aura-signals-new-dawn-for-pakistan-cricket",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:32.000Z"
}
