{
  "title": "Karachi police warn citizens against aerial firing amid Pak-India Asia Cup clash - Pakistan - DAWN.COM",
  "author": null,
  "content": "As excitement builds for Sunday’s highly anticipated Pakistan-India Asia Cup cricket match, law enforcement authorities in Karachi have issued a strong warning against celebratory aerial firing, citing concerns over public safety and law and order.\n\nKarachi Additional Inspector General of Police (AIG) Javed Alam Odho has directed all senior police officers across the city to implement strict measures to prevent such incidents. In a statement released by his office today, the AIG emphasised that aerial firing will not be tolerated under any circumstances.\n\n“Those found involved in this illegal act will be arrested immediately, face legal proceedings, and be prosecuted to the full extent of the law,” the police official added.\n\nThe Karachi police have appealed to citizens to celebrate responsibly and avoid any form of celebratory gunfire. Authorities warned that aerial firing is not only a criminal offence under the law but can also lead to tragic loss of life and injury.\n\nCitizens have been urged to report any instances of aerial firing by immediately calling the police helpline at 15.\n\n“The cooperation of the public is essential to maintaining peace and order in the city,” said a police spokesperson.\n\nAn India-Pakistan cricket match is always a blockbuster, but emotions will run even higher in today’s Asia Cup clash between the nuclear-armed neighbours, who engaged in a four-day military conflict earlier this year.\n\nEven before the clashes in May, which nearly escalated into a full-blown war, bilateral cricket ties had been suspended. The arch-rivals now play each other only in multi-team tournaments.\n\nPolitical relations have deteriorated further since the clashes, with several former Indian players urging the Board of Control for Cricket in India to boycott what will be the first meeting between the teams since the recent hostilities.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:38:39.935Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941952/karachi-police-warn-citizens-against-aerial-firing-amid-pak-india-asia-cup-clash",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T15:41:07.000Z"
}
