{
  "title": "Pakistan exude calm ahead of emotionally-charged India clash - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: An India-Pakistan cricket match is always a blockbuster but emotions will run even higher in Sunday’s Asia Cup clash between the nuclear-armed neighbours, who engaged in a four-day military conflict earlier this year.\n\nEven before the clashes in May, which nearly escalated into a full-blown war, bilateral cricket ties had been suspended. The arch-rivals now play each other only in multi-team tournaments.\n\nPolitical relations have deteriorated further since the clashes, with several former Indian players urging the Board of Control for Cricket in India to boycott what will be the first meeting between the teams since the recent hostilities.\n\nWhile the threat of a boycott is over, sparks may fly with India captain Suryakumar Yadav and his Pakistan counterpart Salman Agha ruling out dialling down aggression in the much-anticipated Group ‘A’ fixture.\n\nHowever, Pakistan opener Saim Ayub exuded calm in the pre-match news conference ahead of the geopolitically-charged clash.\n\n“It’s a big game but we aren’t thinking too much about it,” Saim told reporters on Friday. “We’re using the same processes and trying to improve things in our execution.”\n\nSaim was also not dwelling on the past encounters between the two teams, where India have enjoyed the upper hand.\n\nAsked about being on the sidelines for the 2024 T20 World Cup clash between the two sides, which India won, Saim said he “didn’t remember too much about that game”.\n\n“I think in the last three to four months, the message [from the team management] has been that we learn from the past and move forward,” he added. “It’s not about what happened yesterday but we will try to do things better tomorrow.\n\n“[Past] memories don’t matter. We’re not just looking forward to the match against India … we are looking to win the tournament.”\n\nPakistan have dropped former skippers and batting stalwarts Babar Azam and Mohammad Rizwan with new coach Mike Hesson trying to promote a fearless brand of cricket in the new-look side.\n\nAsked if the Pakistan team will do the same in the India clash, Saim said: “We try to play fearless cricket against everyone.”\n\nLike Saim, fellow batter Mohammad Haris — who shone in Pakistan’s tournament-opening win against Oman — wasn’t losing his sleep over the India fixture.\n\n“We are going to rest tomorrow and then we will see on Sunday,” he told reporters following the thumping 93-run victory on Friday.\n\nIndia, the reigning T20 world champions, enter the match as favourites and were ruthless in their nine-wicket demolition of the United Arab Emirates.\n\nIndia’s fielding coach Ryan ten Doeschate had no qualms in accepting his side’s status as the favourites. They have won 18 of their 21 T20Is since winning the world title in June last year and 10 of their 13 matches against Pakistan.\n\n“Our record is pretty incredible,” he told reporters on Saturday. “On recent form and how we’ve have played, India do start as favourites. But it is all about that particular day. The team who does well in the 240 deliveries will win.”\n\nBOYCOTT CALLS\n\nThere have been widespread calls in India to ban any sporting ties with Pakistan but Ten Doeschate said the team has been instructed to strictly follow the directives of the BCCI and the Indian government.\n\nNew Delhi only cleared the match in a recently announced sports policy, saying the Indian national team can play Pakistan in multi-national events but not in bilateral competitions.\n\nAsked how the Indian players will react, he termed it a “sensitive issue”.\n\n“The players share the compassion and the feeling of the vast majority of the Indian public,” he said. “Hopefully the way we play; the players represent how they feel about their country.”\n\nTen Doeschate added that head coach Gautam Gambhir has called for focus on the game.\n\n“Our thing is, you separate sports and politics,” he said. “I understand the sentiment but we are following directives of BCCI and government. We are going by what the government and BCCI told us.\n\n“The Asia Cup was in limbo for a long period of time and we didn’t think we’d be coming at one stage but obviously the Indian government stance in it and now you have to put the sentiment and emotions behind … it’s something we addressed in the team meeting today.”\n\n“Gambhir’s message is to not focus on things not in your control. Messaging is to focus on cricket.”\n\nIndia have reinforced themselves for the Asia Cup with the selection of pace spearhead Jasprit Bumrah and top order batter Shubman Gill.\n\nThe clash could be the first of three as both India and Pakistan are favourites to qualify for the Super Four stage and possibly for the September 28 final.\n\nTen Doeschate said India have done their homework against Pakistan. “Pakistan have decided to change their direction to how they play their cricket,” he said.\n\nPakistan, meanwhile, believe that they have the team that can win.\n\n“As a team, we trust each other,” the explosive Saim said, when asked about his lack of form with the bat. “It’s a long-term process of raising confidence so that anyone in the team can be a match-winner on his day. It’s about effort and we’re trying to give our all to give the best results.”\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/141115485578bc1.webp",
  "retrievedAt": "2025-10-12T04:09:33.215Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941881/pakistan-exude-calm-ahead-of-emotionally-charged-india-clash",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T03:41:49.000Z"
}
