{
  "title": "Asia Cup: Four key takeaways from Pakistan’s defeat against India - Sport - DAWN.COM",
  "author": null,
  "content": "Another Pakistan-India match, the gulf of quality between the two sides glaring yet again, and brighter than ever.\n\nFair to say Pakistan are a young side undergoing transition under a new captain and a newer team management, but there were enough instances throughout the fixture that highlighted a bigger problem: big-match nerves.\n\nOne of those few instances was Shaheen Shah Afridi’s late onslaught of 33 off 16, which included four clean hits for sixes. He and Sufiyan Muqeem added 43 off 22 balls — a strike-rate of 195-plus — to drag Pakistan to 127-9 when it looked like the team wouldn’t even get into three figures. If tailenders can do that, why not the specialist batters?\n\nTo put it simply, the pressure of the big occasion got the better of them before India, obviously a well-oiled T20 machine, faced no challenge whatsoever during the chase, which ended with 25 balls to spare.\n\nEarly wickets may be the unwanted consequence of attacking intent, but against quality oppositions, they pile pressure on the incoming batters, putting them in a shell — shouldn’t be an excuse for them, however.\n\nIt was Saim again who gave the opponents the sniff before they dug in to prey on Pakistan. The left-handed opener should now be worried. The “impact” he is expected to make early on has remained a mere expectation in most of his outings.\n\nCasually driving Jasprit Bumrah on the up didn’t look like a shot that should be played in such a big match after falling on a first-ball duck in the previous game against Oman as well.\n\nMohammad Haris followed suit not long after, trying to drag Hardik Pandya from outside the off-stump to get caught in the circle and failing to build on to his half-century against Oman.\n\nBumrah prevailed as one of, if not the best, exponents of yorkers in the world, but Sahibzada Farhan (40 off 44) came up to the task, taking on the right-armer whenever he erred even slightly.\n\nThat six, creamed over long-on, and the other, pulled with ease over square-leg, spoke volumes about Sahibzada’s quality — the batter coming into the national side after toiling in domestic cricket. But as wickets fell around him, the right-hander slowed down and the seniors faltered.\n\nThe seniors — Fakhar Zaman with his experience and Salman Ali Agha as captain — were two of six Pakistan batters who threw away their wickets thanks to horrendous shot selection.\n\nWhile Fakhar went after Axar Patel’s straighter one, Salman failed to execute a sweep shot against the left-arm spinner as both were out caught. Hasan Nawaz met the same fate, playing Kuldeep Yadav across, while Faheem Ashraf’s rash reverse-sweep gave Varun Chakravarthy a wicket.\n\nWhat Shaheen did towards the end was a big proof that the pitch offered value for genuine shot-making and Pakistan failed to capitalise.\n\nPakistan’s frailties were such that a team like India would punish brutally, and they did.\n\nSuryakumar Yadav’s men back their intent with superb skill level and Abhishek Sharma smashing Shaheen for a four on the first ball of their chase showed they meant business.\n\nSaim did make up for his poor batting once again with three big wickets with the ball, including that of Abhishek, Shubman Gill and Tilak Varma, whose 56-run partnership with Suryakumar took India over the line.\n\nEarlier, it was all about Kuldeep, who has haunted Pakistan with his left-arm wrist-spin over the past few years.\n\nDespite the thumping, it’s not completely over for Pakistan. They are likely to make it to the Super Four stage, where they will meet India again and will have another chance to make it 1-1.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1423532845c4102.webp",
  "retrievedAt": "2025-09-19T14:39:32.580Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941968/asia-cup-four-key-takeaways-from-pakistans-defeat-against-india",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T19:04:46.000Z"
}
