{
  "title": "Changing habits reshape food delivery baskets - Newspaper - DAWN.COM",
  "author": null,
  "content": "KARACHI: Inflation and changing consumption patterns are reshaping online food and grocery orders in Pakistan, according to foodpanda Pakistan CEO Muntaqa Peracha.\n\n“During Covid-19 we expanded rapidly, launching four verticals in 18 months instead of one in two years,” he recalled. “Impulse purchases defined that period — snacks, cigarettes, small-ticket items.”\n\nAverage order sizes have since increased. Grocery baskets have risen from Rs800-900 during the pandemic to Rs2,000-2,200, while food deliveries average Rs1,200. The blended average per order now stands at Rs1,400-1,500.\n\n“The pandemic was about habit creation. Now we’re working to shift customers from impulse buys to weekly grocery missions,” Mr Peracha said, adding that monthly shopping is still largely done offline.\n\nOnline orders move from impulse to grocery top-ups\n\nFood delivery continues to generate about 70pc of the platform’s topline, with groceries contributing the remainder.\n\nThe company is active in 35 cities for food deliveries and 12 for groceries, with dark stores operating in seven. Product assortments are tailored by locality.\n\nA subsidiary of Germany’s Delivery Hero, foodpanda entered Pakistan in 2016. An Economic Impact Assessment by Lahore University of Management Sciences estimates its investment at $100m over the past decade, including €2.3m in kitchen infrastructure. Tax contributions in FY24 amounted to Rs9.76bn.\n\nThe company plans to double business in three years by scaling up kitchens, expanding marts through owned and franchised outlets, and broadening its shops platform.\n\nEmployment & entrepreneurs\n\nfoodpanda’s operations rely on 50,000 registered riders, of whom 17,000-18,000 are active daily. Full-time riders earn Rs48,000-50,000 per month, though fuel and maintenance costs are borne by them. Compensation rates adjust with fuel price swings.\n\nFemale riders remain few, but Mr Peracha recounted examples such as a young woman commuting daily from Sheikhupura to Lahore on a 125cc bike.\n\nWomen, however, dominate the home-chef segment. The impact report notes over 7,000 home-based entrepreneurs on the platform, 75pc of them women, earning an average of Rs120,000 per month. About half are first-time earners.\n\nThin margins\n\nFoodpanda charges an average 25pc commission, with variations depending on order volumes. Restaurants also pay sales tax once revenue crosses the legal threshold. Only 15–20pc of eateries on the platform are currently GST-registered.\n\nProvincial governments have reduced service tax rates for home chefs — to 8pc in Sindh and 5pc in Punjab. Even so, commissions and taxes can consume around 30pc of revenue. With food costs at 30pc, about 40pc remains for other expenses and profit.\n\nDark kitchens, which share facilities, pay commissions plus rent or a revenue share, depending on volumes.\n\nCoping with internet shutdowns\n\nThe company faced a sharp setback in May 2023 when mobile internet was suspended for nearly three days. Foodpanda lost 70pc of its gross merchandise value.\n\n“It wasn’t just us — Daraz, Careem, everyone was hit,” the CEO said.\n\nTo adapt, foodpanda shared Wi-Fi passwords of partner restaurants with riders in major cities to keep deliveries going, though the absence of Google Maps made navigation difficult.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:38:42.489Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941812",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:54.000Z"
}
