{
  "title": "Brazil’s unusual 9/11 - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT has been a tumultuous week on the global stage, with tales of the unexpected ranging from a youthful uprising, massacre and swift regime change in Nepal to the death by shooting of a prominent young far-right activist in Utah.\n\nCharlie Kirk’s murder was weaponised by America’s ruling elite as a bludgeon against what it sees as the ‘radical left’, and the irony of targeting his posthumous critics, both domestic and foreign, is apparently lost even on those who elevate his (frankly hypocritical) commitment to free speech above his smorgasbord of obnoxious views on race, gender, immigration, gun violence, etc.\n\nAny expectation, though, that the orc­hestrated national mourning would drown out the clamour over Donald Trump’s close relationship with Jeffrey Epstein was dented by the dismissal of Britain’s ambassador to Washington on similar grounds. Unlike Trump, Peter Mandelson — an oleaginous, smarmy and allegedly corrupt survivor from the Blair administration — remained on close terms with Epstein even after the latter’s conviction over organised paedophilia. The increasingly unpopular Keir Starmer’s determination to stand by Mandelson until a few days ago has added to the British prime minister’s self-inflicted woes by raising fresh questions about his judgement among both friends and foes on the eve of Trump’s arrival in London for a second state visit.\n\nMeanwhile, continents away from the prospect of a new beginning for Nepal, another silver lining appeared in the skies above Brazil as former president Jair Bolsonaro was sentenced to 27 years in prison for attempting to orchestrate a coup he hoped would extend his disastrous rule after he lost the 2022 election to Luiz Inácio Lula da Silva.\n\n‘Tropical Trump’ got his comeuppance.\n\nThe decisive judicial blow came on Sept 11 — for many Latin Americans a day associated more with the 1973 military coup in Chile than the toppling of the twin towers in 2001. Four out of five supreme court judges found Bolsonaro and his co-conspirators guilty of seeking to pervert the course of democracy by assassinating Lula, his (conservative) vice president-elect, and Justice Alexandre de Moraes. The plan to effectively reconstitute the wretched military regime that governed Brazil for 21 years from 1964 floundered chiefly because the army and air force chiefs were unwilling to play ball in 2022. The then naval chief has been sentenced alongside Bolsonaro.\n\nThe backdrop to this scenario has been Trump’s efforts to intimidate South Ame­rica’s largest country into jettisoning its legal proprieties by permitting Bolsonaro — hailed (or, more convincingly, derided) as a ‘tropical Trump’ after winning the 2018 election — to go scot-free.\n\nThat timeline incidentally coincides with Imran Khan’s military-backed elevation to the top post, although his downfall and imprisonment were expedited, perhaps because the concept of due process carries more weight in Brazil than in Pakistan. The expensive efforts of Khan’s American fan club to nudge the incoming Trump administration towards insisting on his release failed to pay off, while the Bolsonaro lobby proved more efficacious, with Trump and his acolytes regularly decrying the ‘witch hunt’ in Brazil and imposing 50pc tariffs, despite America’s substantial trade surplus, alongside sanctions against the likes of Moraes.\n\n“It’s very much like what they tried to do with me, but they didn’t get away with it,” was Trump’s response to the sentencing of his soulmate. A couple of months ago, Lula was quoted as saying, “I’ve said to President Trump if what happened in the Capitol had happened in Brazil, he would be put on trial here.” He was referring to the Jan 6, 2021, att­empt by Trump supporters to overturn the result of the 2020 presidential election, which is what Bolsonaro backers sought to emulate on Jan 8, 2023.\n\nThe Jan 6 culprits were amnestied after Trump returned to power, and are now demanding compensation. In contrast, the masterminds behind Jan 8, who copied the US example after failing to arrange a military coup, are in the dock. It remains to be seen whether Bolsonaro, under house arrest, will serve time in prison. Last week’s verdict is bound to be appealed, and if that fails, there’s the prospect of a congressional amnesty. The former paratrooper’s belated comeuppance sparked jubilations across Brazil, but the country remains divided, and Bolsonaro’s delusional fans still number in the millions.\n\nWhatever happens in the next couple of months, next year’s presidential election — in which Bolsonaro cannot legally compete, and Lula, ailing and on the cusp of turning 80, may decide not to — will be a test case for Brazil. Neither has designated an heir so far. One can only hope that Lula’s model of a broad, barely ideological democracy, however flawed, will again trump the potentially rabid far-right alternative.\n\nmahir.dawn@gmail.com\n\nPublished in Dawn, September 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c9edc2f1b3c.png",
  "retrievedAt": "2025-10-12T04:09:58.697Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942575/brazils-unusual-911",
  "dateList": "2025-09-14",
  "date_published": "2025-09-16T23:59:26.000Z"
}
