{
  "title": "The words of the Chief Justice - Pakistan - DAWN.COM",
  "author": null,
  "content": "In 1817, Chief Justice John Marshall, one of America’s founding fathers, delivered what is often called the shortest judgment in judicial history: “The United States never pays costs.” This was the entirety of a unanimous majority decision in the Supreme Court case of United States v. Barker. Six words settled a complex question of law that had gone unanswered for twenty years, and solidified jurisprudence on sovereign immunity with clarity and precision.\n\nExactly 208 years later, the unthinkable happened. In a judgment authored by Chief Justice Sarfraz Dogar, the Islamabad High Court (IHC) ruled on the case of a journalist restricted from leaving the country with the following: “Office objection is sustained”. Move over Justice Marshall, that looks like four words and a newly broken world record to me.\n\nPakistan: 1, USA: 0.\n\nA stunning upset like this must be exactly the kind of judicial achievement the framers of the 26th Amendment dreamed of. So where are the balloons, the mass media coverage, the celebrations on the streets? Why is it only this writer who’s publicly noticed an achievement so grand?\n\nWell, it might have something to do with the difference between these two judgments. Brevity is the soul of wit, and that Shakespearean adage applies to both. But while the former sought to push the limits of how much you could accomplish with how few words, the latter took a different approach, by not seeking to accomplish anything at all.\n\nFor context, the journalist, Asad Ali Toor, had approached the court after he was stopped at an airport and prevented from leaving the country to attend a training program. He had been placed on the “Provisional National Identification List”, which exists under a 2018 standing order for the purposes of preventing fugitives of ‘heinous crimes’, like rape, murder, or terrorism, from fleeing abroad.\n\nThe only ‘heinous’ crime Toor has ever been accused of is irritating some very powerful people. Regardless, his name was on the list; he was not told this fact until he was packed up and ready to board his flight, and someone in a very high office likely took great pleasure in the deliberate act of causing him pain.\n\nCourts exist for the precise purpose of shielding regular citizens from thuggery like this. What happened to Toor was illegal in at least a dozen different ways: he was not even accused of anything that merited inclusion in the PNIL; no reasoning or show-cause notice was given; the Courts have consistently held that one must be informed when placed on such a list; an accused must be given the right to appeal; the Constitution guarantees freedom of movement; and the list goes on and on. Toor has a history of being targeted and punished for his journalism (even the people who sold him his parrots were not spared), and this cannot be ignored when judging his present mistreatment.\n\nFor a case like this to land before a judge is a ripe and easy opportunity to affirm that justice is not dead in this country — that some loose cog in our very large government machinery cannot arbitrarily decide that it does not like you, and therefore you must deal with a certain amount of misery as a prerequisite to your existence here. Confronted with a situation so transparently unjust, a judge has the chance to deliver a comprehensive verdict that strengthens individual liberties and at least attempts to ensure that no citizen of this country ever goes through such an indignity again.\n\nJustice Babar Sattar of this same court did just that in his excellent judgment on illegal phone tapping. If the chief justice so desired, he could have affirmed and strengthened the constitutional right to free movement in a way that made Pakistan a better place, with a stronger rule of law, for all of us.\n\nInstead, we got the world’s shortest judgment. Toor had been told by the registrar’s office that, before he comes to court, he must first go to the government department that is visibly intent on making his life miserable. The office objection was sustained. The training program went on without him. Now, it could happen to you, too. Whether you love him or hate him, agree with his opinions or not, or even know who he is, Toor has unravelled the extent of all our freedoms, and their lack thereof. For now, they’re worth a grand total of four words.\n\nLater, though, we got more words from the chief justice.\n\nIn another case about the freedom to leave the country, he castigated Imaan Mazari, the same lawyer who represented Toor, for critiquing his work. In open court, the chief justice reportedly threatened contempt proceedings, said “shut your mouth”, and then turned to another lawyer, who happened to be Mazari’s husband, to say “control her, one day if I catch her…”. There was no question that these remarks were sexist, threatening, and unacceptable. An apology was due.\n\nInstead, the following day, according to journalists in the courtroom, the chief justice stated: “Imaan Mazari is like my daughter. Yesterday, as a chief justice and as an elder, I was explaining things to her. My remarks were taken out of context”. Specifically, he denied having said he was going to “catch her” and stated (in contradiction of multiple journalists’ reports) that he had, in fact, only asked her husband to catch her (as if that was any better).\n\nThere’s an old saying that goes, ‘when you’re in a hole, stop digging’. But the Chief Justice still wasn’t done. “If I initiate contempt proceedings, the girl’s career will be ruined. I explained to her like my children, but she wasn’t understanding”. A shockingly inappropriate word was used to refer to a professional and accomplished lawyer — “bachi”. In doubling down on a worldview that sees women as lesser beings, devoid of agency and subject to the restraint, control, and unsolicited advice of the men around them, the chief justice revealed much. But he was clear during his castigation that one should critique the decisions, and not the person, so that is all I’ll do.\n\nThe Islamabad High Court Chief Justice’s decision to engage in textbook misogyny and belittle a female advocate for daring to stand up to him does not have much to commend itself. His decision to present a non-apology and further condescension disguised as benevolence only worsened his position. And his decision to still not provide an unconditional apology to all the women who appear in his court, despite multiple condemnations from bar associations and women’s groups, takes this matter to unacceptable levels of misconduct.\n\nApparently, there is a history to this behaviour. In an interview with Matiullah Jan, Mazari’s husband reported that Justice Dogar had been protested by the bar in Multan and ultimately transferred for referring to a lawyer as ‘ulloo ka patha’ in court. The Supreme Judicial Council is the sole body empowered to hold judges accountable for actions like this. At the very least, it should convene to take notice and release the minutes of the meeting to the public to let the country know that the entirety of its justice system does not condone misogyny.\n\nIt cannot be ignored that everything you have read about here is a direct result of the 26th Amendment. That is what allowed this chief justice to be transferred from number 15 in seniority at the Lahore High Court (LHC) to number one in Islamabad, leapfrogging over some of our country’s most brilliant jurists. No reasoning was ever given to the public as to why Justice Dogar was deemed a better fit than those he superseded for the top job at the court of this nation’s capital.\n\nFive sitting judges went on the record to argue (very convincingly) that this transfer was illegal and amounted to nothing more than an attack on the independence of the judiciary; going so far as to file a petition against the transfer appointments in the Supreme Court (SC). This challenge was heard by the constitutional bench, itself a creation of the 26th Amendment, and went exactly how you would expect it to.\n\nWith every passing day, the mess that this amendment created gets layers added to it, and the prospect of any meaningful pushback feels less and less likely. Robust challenges to its legality remain completely ignored by the SC. And almost a year into its enactment, while its impacts are immense and impossible to quantify, the result here is simple; the same IHC that once represented the very best of our judiciary — pushing back against power, delivering intelligent and progressive judgments, and standing up for the vulnerable — has been reduced to castigating activists and broadcasting misogyny.\n\nThis country deserves better. And if justice is to be seen to be done, we can’t have Justices seeing half the population as lesser than the other.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/161656247e6977c.webp",
  "retrievedAt": "2025-09-19T14:39:44.312Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942187/the-words-of-the-chief-justice",
  "dateList": "2025-09-14",
  "date_published": "2025-09-16T13:02:21.000Z"
}
