{
  "title": "Elders form body to ‘expel’ transgenders from Swabi - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWABI: Elders formed an 11-member committee here on Saturday, declaring all transgender persons will be expelled from Swabi district.\n\nThe development came after a Wednesday incident when the transgender people and participants of a music programme used “abusive language” against the police over the latter’s bid to stop the event.\n\nThe police later launched a crackdown, leading to the arrest of 226 people, including two transgender persons.\n\nThe 11-member committee comprises tehsil president of Jamiat Ulema-i-Islam-Fazl Maulana Abdul Samad Haqqani, religious leader Maulana Abdul Hadi, Gul Nabi Khan, president of Islahi Jirga Maneri Payyan, Bakhtiar Khan, general secretary, Bashir Khan, president, Islahi Jirga Maneri Bala, Gul Rehman, general secretary, Yasir Khan, president of Anjuman-i-Dokandaran, Swabi city, Irsalan Khan, senior vice-president, Zamin Shah Bhutto president of traders Link Road Swabi and two transgender.\n\nMaulana Haqqani said: “We don’t want our youth to get involved in wrong activities and wish to create an environment where everyone earn livelihood with dignity and honour.”\n\nMaulana Samad said the committee wanted transgender persons to leave the district peacefully and earn their livelihood elsewhere because as long as they lived here, music shows would be arranged, negatively impacting youth.\n\nYasir Khan said that in the first phase, transgender persons would ask peacefully to leave the district and if that act didn’t work, then the district police would be involved for the purpose.\n\n“We are determined to achieve our target,” he said.\n\nMeanwhile, the transgender persons said in a video message that they respected elders and treated everyone with respect and did not speak against anyone but the circumstances forced them to raise their voice.\n\nThey said the explusion would never happen.\n\nThey warned elders against taking the law into their own hands and said they respected and followed local norms and values while earning livelihood.\n\nThey complained that the people blamed them for their children’s act of watching their performances.\n\nThe transgender persons said they were aware of the law and the Constitution and if they were given government jobs, they were ready to stop dancing in functions.\n\nThey said that none of transgenders was involved in the sale of ice-drug or liquor but various illegal activities continued in the district, needing attention.\n\nThey said elders should look at them from the perspective of humanity as they’re part of the Pakhtun society. Meanwhile, members of the committee said that they were expected to meet in the next few days and would also hold a meeting with district police to discuss a strategy for “expelling” transgenders from the district.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:09:53.533Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941758/elders-form-body-to-expel-transgenders-from-swabi",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:23:38.000Z"
}
