{
  "title": "Stakeholders differ over flood impact on supplies - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Business stakeholders have expressed divergent views on the impact of floods on supply chains, with some citing delays in interprovincial cargo movement and crop damage, while others insist supplies of food, fuel and medicines remain normal.\n\nThe federal government has already imposed a climate change and agriculture emergency after floods in Punjab moved downstream towards Sindh, heightening fears of food inflation.\n\nOfficial estimates put the damage at 4.2 million people affected, 1.58 million animals lost and over 4,400 villages inundated in Punjab, with houses and farmland also destroyed in Gilgit-Baltistan and Khyber Pakhtunkhwa.\n\nAccording to media reports, exceptionally high flood levels have been recorded at Panjnad Headworks on the Chenab River, while medium levels continue at Sindh’s Guddu and Sukkur barrages.\n\nCargo delays hit retail/e-commerce\n\nChain Store Association of Pakistan (CSAP) Chairman Asfandanyar Farukh said cargo movement between Punjab and Sindh has slowed due to floods and damaged infrastructure. Goods now take two to three days longer to reach destinations compared to normal schedules, he added.\n\nCargo delays, crop losses and rising food inflation risks emerge as stakeholders assess floods’ impact\n\nE-commerce deliveries, particularly between Karachi and Punjab, are also delayed by two to three days, leading to cancellations by impatient customers, he said.\n\nFertiliser Manufacturers of Pakistan Advisory Council (FMPAC) Executive Director retired Brig Shershah Malik said the floods that struck in late August have badly hit agriculture in Punjab, KP and Sindh.\n\nAlthough fertiliser application for the kharif season was almost complete — with 100pc DAP and 90pc urea already applied — standing crops including rice, sugarcane and vegetables suffered extensive damage. About 1.5m acres of farmland have been affected in Punjab and KP, while data from Sindh is awaited.\n\nHe warned that farmers’ financial losses and their inability to afford fertiliser could undermine wheat sowing in October, creating a risk for food security during the upcoming rabi season.\n\nFood exports under threat\n\nPatron-in-Chief of the All Pakistan Fruits and Vegetables Exporters, Importers and Merchants Association Waheed Ahmed said supplies of onion from Balochistan and potatoes from Punjab’s cold storages to Karachi have slowed, while about 50pc of Sindh’s onion crop has been damaged. Onion consumption stands at 175,000 tonnes per month.\n\nTomato supply has also been hit, with imports from Iran supplementing local production. Monthly demand is about 40,000 tonnes.\n\nMr Ahmed warned of a potential $200m loss in fruit and vegetable exports out of total annual exports of $750m. He urged the government to waive taxes on imported vegetables and provide direct compensation to farmers, noting that mango and citrus orchards destroyed by floods would take years to recover.\n\nHe further called for urgent investment in dams, headworks and climate-smart agriculture, arguing that perennial crops such as mangoes provide greater resilience to extreme weather than seasonal crops.\n\nWholesale, transport and oil supply\n\nFalahi Anjuman Wholesale Vegetable Market, Super Highway, President Haji Shahjehan said vegetables from Punjab and Balochistan were reaching Karachi with delays of one to two days, while green vegetables from Sindh continued to arrive normally.\n\nHowever, Transporters of Goods Association (TGA) President Tariq Gujjar said interprovincial movement of goods remained unaffected.\n\nSecretary General Oil Companies Advisory Council (OCAC) Dr Nazir Abbas Zaidi also ruled out any supply crisis. “There is not a single complaint of shortages from anywhere in the country,” he said, adding that contingency routes had already been planned in case of road or bridge closures.\n\nKarachi Wholesalers Grocers Association (KWGA) Chairman Rauf Ibrahim said wholesale markets in Jodia Bazaar and Dandia Bazaar have not experienced delays in supplies from Punjab, Sindh or imported shipments. “There is no shortage of food items in wholesale markets,” he maintained.\n\nPakistan Pharmaceutical Manufacturers Association (PPMA) Chairman Tauqeer Ul Haq said medicine supplies were normal and firms had pre-positioned stocks in flood-hit areas. Industry members were also donating medicines to affectees, he said.\n\nWafi Energy Pakistan Limited donated 5,000 litres of diesel and petrol to the NDMA this month, after contributing 1,000 litres in August.\n\nSBP flags economic risks\n\nThe State Bank of Pakistan (SBP), in its report on Banking Sector Outlook for H2CY25, said subdued inflation, exchange rate stability and improved credit ratings could support recovery. Banking sector performance was expected to remain steady in the second half of the year.\n\nHowever, it cautioned that torrential rains and floods may undermine economic prospects. While credit risk in the banking sector was expected to remain contained, the repayment capacity of agricultural borrowers could weaken.\n\nThe SBP said overall banking soundness would likely remain unaffected due to the limited share of agri-loans in total advances and strong capital buffers.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/14100548c2af701.webp",
  "retrievedAt": "2025-10-12T04:09:33.791Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941814/stakeholders-differ-over-flood-impact-on-supplies",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:22:54.000Z"
}
