{
  "title": "Israel has become ‘persistent irritant’ and danger to world peace: Dar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Monday called for urgent steps against Israel to “safeguard the global order”, in the wake of Tel Aviv’s strike on Qatar earlier this week.\n\nIsrael targeted Hamas leaders on Tuesday in strikes on the Qatari capital, killing five Hamas members and a Qatari security officer. The attack drew widespread international condemnation, including from Gulf monarchies allied with the United States, Israel’s main backer.\n\nAttending a ministerial meeting in the Qatari capital, Dar delivered a speech where he highlighted that the frequency of meetings to discuss Israel’s activities in the region underlines “how Israel has become a persistent irritant and a danger to world peace and security”, according to the Foreign Office (FO).\n\n“Pakistan condemns, in the strongest possible terms, the illegal and unprovoked Israeli aggression against the brotherly State of Qatar,” Dar was quoted as saying.\n\n“This reckless and provocative attack constitutes a flagrant violation of the sovereignty and territorial integrity of Qatar, contrary to the fundamental principles of international law, including the UN Charter, in particular its Article 2(4) prohibiting the threat or use of force.”\n\nCalling the attack “unwarranted, unjustified and appalling”, the foreign minister highlighted that this activity is emblematic of Israel’s rogue mindset, which disregards international law and norms.\n\n“No state is safe from such an unhinged entity that defies all precepts of civilised behaviour, Dar stated. “The question of Israeli accountability is a test for the credibility of the global system.”\n\nThe foreign minister highlighted urgent steps that need to be taken “to safeguard the global order”:\n\nIsrael must be held accountable for war crimes and crimes against humanity. It should not be allowed to get away with attacking Islamic countries and killing people with impunity.\n\nCreation of an Arab-Islamic task force to monitor the Israeli designs in the region and adopt effective deterrent and offensive measures in a synchronised manner to ward off Israeli expansionist designs.\n\nPursue the suspension of Israel’s membership in the United Nations. Following up on this step would be a clear message on seriousness by the Ummah.\n\nMember states should actively consider implementing additional punitive measures against Israel, as a means to reinforce accountability and deter further violations of international law.\n\nThe UN Security Council must urgently demand [from] Israel, under Chapter VII of the UN Charter … an immediate, unconditional, and permanent ceasefire, release of hostages and exchange of Palestinian prisoners.\n\nUnfettered, sustained and secure humanitarian access to all civilians in need, and the protection of aid workers, medical teams and UN personnel in the [Occupied Palestinian Territories].\n\nThe revival of a genuine and time-bound political process to achieve a just, comprehensive and lasting two-state solution in accordance with international law and relevant UN and OIC resolutions.\n\nMonday’s summit in Doha is expected to rally support for Qatar in the wake of last week’s Israeli attack targeting Hamas in the Gulf state.\n\nA draft of the resolution that will be considered by heads of state condemned Israel’s attack as a destabilising escalation and said the states opposed Israel’s “plans to impose a new reality in the region”.\n\nThe draft, which was seen by Reuters, did not mention any diplomatic or economic moves against Israel. The resolution may change before the leaders meet in Doha on Monday.\n\nThe attack has prompted US-allied Gulf Arab states to close ranks, adding to strains in ties between the United Arab Emirates (UAE) and Israel, which normalised relations in 2020.\n\nThe emergency summit, bringing together members of the Arab League and the Organisation of Islamic Cooperation (OIC), began with a meeting of foreign ministers on Sunday to craft the draft resolution.\n\nThe gathering is a message that “Qatar is not alone … and that Arab and Islamic states stand by it,” Arab League Secretary General Ahmed Aboul Gheit told the Asharq al-Awsat newspaper.\n\nDar will “lead Pakistan’s delegation to the ministerial meeting ahead of the Emergency Arab-Islamic Summit”, a statement by the FO said.\n\nUpon arrival, the deputy PM was received by Pakistan’s Ambassador to Qatar Muhammad Aamer, Pakistan’s envoy to the Organisation of Islamic Cooperation (OIC), and senior officials of the Qatari government.\n\nThe Arab-Islamic summit — held under the umbrella of the 57-member OIC — is expected to draw heads of state and governments, along with senior officials, from across the Muslim world. PM Shehbaz Sharif is also set to attend the high-level moot.\n\n“The summit, cosponsored by Pakistan, has been convened in the wake of Israel’s airstrikes on Doha and the escalating developments in Palestine — following Israeli attempts to occupy Gaza, expand settlement activities in the occupied West Bank and forcibly displace the Palestinians,“ an FO statement said yesterday.\n\nDiplomats said more than 50 OIC member states are expected to attend the Doha summit, where leaders may also weigh in on pushing Palestinian statehood at the upcoming UN General Assembly session in New York.\n\nOn the sidelines of the preparatory foreign ministers’ meeting, Dar today met with Egypt’s FM Dr Badr Abdelatty.\n\n“They condemned illegal Israeli strikes on Qatar and other Muslim nations, terming them blatant violations of sovereignty and international law. Both reaffirmed their unwavering support for the Palestinian cause and stressed the urgent need for unity across the Muslim ummah,” FO said in a statement.\n\nDar aslo with his Iranian counterpart, Foreign Minister Abbas Araghchi, on the sidelines of the meeting.\n\nAccording to the FO, they strongly condemned Israel’s unprovoked strikes on Qatar and other Muslim nations, terming them grave violations of sovereignty, international law, and the UN Charter.\n\n“Both (leaders) underscored the pivotal role of the Arab League and the OIC in uniting the Muslim Ummah at this critical juncture and reaffirmed their unwavering support for the Palestinian people’s just struggle for freedom and self-determination,” the FO statement read.\n\nDar further met with with Malaysia’s Foreign Minister Dato’ Seri Mohamad Hasan on the sidelines of the meeting.\n\n“They strongly condemned Israeli strikes on Qatar and other Muslim nations as gross violations of sovereignty and international law,” the FO said.\n\n“They reaffirmed unwavering support for the Palestinian cause and emphasized the vital importance of unity across the Muslim Ummah. They welcomed the Arab Islamic Summit as timely and essential for collective action at this critical juncture.”\n\nAnalysts say tomorrow’s Arab-Islamic summit is meant to send Israel a clear signal. Pakistan has been vocal in its criticism of Israel, especially taking the centre stage at a recent United Nations Security Council meeting, where it engaged in a heated debate with Israel.\n\n“Repeated Israeli attacks against sovereign states in the region are a matter of grave concern, not only for the Muslim ummah but also for the wider international community,” FO spokesperson Shafqat Ali Khan told reporters on Friday.\n\nFollowing the attack, PM Shehbaz undertook a one-day visit to Doha, where he met with Qatari Emir Sheikh Hamad bin Khalifa al-Thani to denounce the Israeli action and show solidarity with the Gulf state.\n\nQatar plays a mediation role in Israel’s recent war on Gaza alongside the US and Egypt. It hosts the largest US base in the region, and also recently gave US President Donald Trump a luxury Boeing 747-8 jet to use as his presidential plane.\n\nFor the first time in recent memory, the US joined all 15 UNSC members in condemning the Israeli strike during Thursday’s emergency meeting. The US has historically shielded Israel from statements of condemnation by not endorsing them, but on Thursday, it opted not to veto the joint statement.\n\nDespite ongoing tensions, Trump on Friday held a dinner with Qatari Prime Minister Sheikh Mohammed bin Abdulrahman al-Thani in New York.\n\nThe US president has said he was “very unhappy” about the Israeli attack on Qatar. However, earlier today, Secretary of State Marco Rubio said it was “not going to change the nature of our relationship with the Israelis”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/14201838df4d901.webp",
  "retrievedAt": "2025-09-19T14:38:38.217Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941937/israel-has-become-persistent-irritant-and-danger-to-world-peace-dar",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T11:25:17.000Z"
}
