{
  "title": "New auditor general to face fallout from ‘most expensive typo’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A new auditor general will have to clean up the mess left by his predecessor, after the Auditor General of Pakistan’s (AGP) office backtracked on a controversial report, which gave an astronomical figure for irregularities unearthed in the federal government’s accounts.\n\nMaqbool Ahmed Gondal was sworn in as the country’s 22nd AGP on Monday, at a ceremony held in the Supreme Court.\n\nAppointed for a fixed tenure of four years, Mr Gondal will immediately have to deal with the fallout from the AGP office’s U-turn its ‘Consolidated Audit Report of Federal Government for the Audit Year 2024-25’.\n\nThe original report, released in August this year, contained the illogical figure of irregularities worth Rs376 trillion, which is 3.5 times more than the country’s total gross domestic product (GDP).\n\nAfter repeatedly defending its controversial audit report, containing astronomical figure of ‘irregularities’, auditor general’s office finally blames ‘typos’ for the discrepancy\n\nIt had alleged procurement-related irregularities of Rs284tr, defective civil works worth Rs85.6tr, receivables of Rs2.5tr, and unresolved circular debt of Rs1.2tr.\n\nThe figures implied financial anomalies far beyond the size of Pakistan’s kitty, sparking disbelief even within government circles.\n\nAlthough the outgoing auditor general, Muhammad Ajmal Gondal, had repeatedly defended the contents of the report, after sustained criticism and media scrutiny, the department conceded its error.\n\nA note appended to the introduction of the fresh report says: “The executive summary of the original version of the Consolidated Audit Report uploaded on the [AGP’s website] had a few typos. At two places, the word ‘trillion’ had been used instead of ‘billion’. The actual amount after rectification is Rs.9.769 trillion.”\n\nThe revised amount of Rs9.769tr, still a staggering sum, constitutes nearly two-thirds of the federal budget for FY2023-24.\n\nThe revised report explains that the irregularities span multiple years and include out-of-budget items such as circular debt, land disputes, and corporate accounts.\n\nThis new version was uploaded to the AGP office’s official website last week.\n\nWhen asked why the AGP office chose to initially defend the report which contained the incorrect figures, an official privy to the matter claimed that this seemed to have become “a matter of credibility as well as ego of the department”.\n\nExpert opinion\n\nExperts Dawn spoke to about the discrepancy offered their own opinions on how such a massive error could have gone undetected.\n\nThe Rs376tr figure appears to be an inflated aggregation of audit observations, not actual verified financial losses, and must be contextualised. The AGP only audited 1,362 formations with Rs24.2tr expenditure and Rs20.6tr receipts, so the Rs376tr irregularities claim exceeds the real audit scope,” argues Dr Vaqar Ahmad, an economist with audit expertise.\n\n“The mismatch arises because AGP often records ‘procedural or regulatory deviations’ as irregularities, multiplying values far beyond actual spending,” says Mr Ahmad, who works with the Sustainable Development Policy Institute (SDPI).\n\nAccording to him, the Rs5.58tr reported as recovered is deposited with the national exchequer, while the remaining ‘irregularities’ are mostly audit objections unlikely to be fully realised recoveries.\n\nA former provincial auditor general was at pains to clarify that these figures constituted irregularities, not corruption.\n\n“There are over 30 criterions these spending are judged against. One project could fall under over a dozen conditions — like Public Procurement Regulatory Authority (PPRA), Finance Divisions Rules, the particular contract conditions, rules of the contracting bodies (Wapda, Pepco etc.) and so on. If a contract is judged on ten different criteria — its different steps falling under different legal provisions, the irregularities are bound to multiply,” he said.\n\nAccording to a senior official in the Punjab government, audits in Pakistan are conducted under the obsolete and typical ‘desi’ mindset of just creating more and more audit paras having no solid evidence of corruption. Such audits are usually not specific to irregularities as per the actual budget expenditures, thus revealing exaggerated figures to put pressure on the departments.\n\n“If the auditor doesn’t find receipt of any expense during the audit, he considers it misappropriation of funds even though the department-under audit, proves making such expense through other solid evidences. In certain cases, the auditor even declares the whole procurement process suspicious, multiplying it several times with the actual expenses.\n\n“In my whole service, I have never seen any auditor specific to auditing the actual budget expenditures. Certain portions of the revenue targets, which are not achieved, are also considered as irregularities,” he says.\n\nHousing and Works Division Secretary Hamed Yaqoob Sheikh, who has also served as federal finance as well as federal planning secretary, says the audit has two functions — to oversee whether the expenditures have been made correctly and in line with the rules and regulations; and to point out procedural lapses if irregularities are being committed time and again.\n\nBelieving that there is no shortage of expertise at the AGP office, Mr Sheikh stresses it needs to shift from mere auditing transactions to assessing “value for money” as is the case in the developed world.\n\nMalik Asad in Islamabad, Khalid Hasnain, Mansoor Malik, and Ahmad Fraz Khan in Lahore also contributed to this report\n\nPublished in Dawn, September 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:39:44.554Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942326/new-auditor-general-to-face-fallout-from-most-expensive-typo",
  "dateList": "2025-09-14",
  "date_published": "2025-09-16T02:15:52.000Z"
}
