{
  "title": "Floods destroy rice, other crops on 140,000 acres in Narowal - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: Losses of more than Rs10 billion have been reported by farmers as rice and other crops cultivated on 140,250 acres of agricultural land have been lost due to the recent flooding in the Narowal district.\n\nAs per details, the high-level floods in the river Ravi and rainwater drains Auj, Baein, Basantar and Dek wiped out farmlands and devastated the farming community.\n\nDue to the lack of an industrial zone in Narowal district, the livelihood of locals depends on agriculture and farming is done on 355,425 acres of land. Farmers grow rice, wheat, vegetables, pulses and animal fodder on these lands.\n\nLocals report that four to five feet of floodwater has been accumulated in their fields. Adding insult to injury, the already suffering farmers and citizens lost their homes, while roads and other infrastructure was also destroyed in the floods.\n\nFarmers say wheat cultivation not possible without financial assistance\n\nNarowal Deputy Commissioner Syed Hassan Raza told Dawn that crops cultivated on 140,250 acres of land had been lost due to the floods. He said that farmers in Shakargarh tehsil suffered the most due to the floods as 77,090 acres of land had been submerged in the area.\n\nHe said that 45,617 acres of agricultural land was under floodwater in Narowal tehsil and 17,543 acres in Zafarwal. He said that the rice crop cultivated on 84,000 acres had been lost due to the floods. He said that the floodwaters washed away fodder for animals cultivated on 8,176 acres of land.\n\nFarmer Muhammad Yaqoob said that farmers had suffered a loss of more than 10 billion rupees due to the flood. He said that the world-famous rice of Narowal was the biggest loss as it was the most cultivated in the district.\n\nAnother farmer Muhammad Afzal said that the loss caused to farmers was unbearable and now it was not possible for them to cultivate wheat without financial assistance. He said that their houses were also damaged and livestock sheds had been washed away. Grains, wheat seeds, urea fertiliser, agricultural machinery were also affected, he added.\n\nHe said that farmers had taken loans for fertilisers, agricultural chemicals and other needs and these loans were to paid after their harvest. How would farmers meet household expenses, children’s education and start farming again for the whole year, he asked.\n\nTo a question, the DC said that teams from the revenue and agriculture departments were assessing the losses suffered by farmers. He said that financial assistance would be provided to them as per the government’s policy.\n\nPublished in Dawn, September 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c5dc43b8dad.jpg",
  "retrievedAt": "2025-09-19T14:38:54.261Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941796/floods-destroy-rice-other-crops-on-140000-acres-in-narowal",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T02:23:22.000Z"
}
