{
  "title": "PPP fully endorses PM’s offer for Charter of National Reconciliation: Bilawal",
  "link": "https://www.app.com.pk/national/ppp-fully-endorses-pms-offer-for-charter-of-national-reconciliation-bilawal/",
  "date_published": "2024-03-04T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP): Chairman of the Pakistan People’s Party (PPP), Bilawal Bhutto Zardari, stated on Monday that the PPP fully supported the offer made by newly elected Prime Minister Shehbaz Sharif for a ‘Charter of National Reconciliation.’\nSpeaking in the National Assembly, he recalled the Prime Minister’s offer during his maiden speech in the House to collaborate on a Charter of National Reconciliation.\n“We not only endorse it but also urge the Opposition to participate in this process for the broader interests of the country,” he stated.\nBilawal Bhutto congratulated the newly elected Chief Ministers of all four provinces and emphasized the need for them to play their role in saving Pakistan’s “democracy and economy.”\nHe said that people did not vote for anyone to create a ruckus but to save them from this economic crisis.\nBilawal Bhutto stressed the need for discourse among all the lawmakers.\nHe said the Parliament was the mother of all institutions, and if this institution was strengthened, it would ultimately empower the masses.\n“The people of Pakistan are tired of poverty, unemployment, and inflation,” he said, adding “they did not give their vote for you to come here and abuse each other and create a ruckus.”\nBilawal Bhutto asked older lawmakers to make decisions that benefit youth and future generations.\n“Many of whom have been in this House six times,” he remarked.\n“Past decisions that have been made have completely ruined the country,” he added.\nThe PPP chief said he was disappointed by the “abuse hurled around” at yesterday’s National Assembly session that saw PML-N’s Shehbaz Sharif elected prime minister for his second term.\n“What is the nation seeing? We have reached a dangerous point,” he said.\nBilawal Bhutto said that the February 8 elections were being “made controversial for no reason” by incidents like a raid on a presidential candidate’s residence.\nThe PPP Chairman extended his party’s support on the matter of the PTI wanting to address any election irregularities.\nHe condemned the ruckus and consistent sloganeering during yesterday’s National Assembly session that saw Shehbaz Sharif elected as prime minister.\n“I appeal to all of you, especially those who are members of this House for a third time, don’t create this kind of ruckus here,” he added.\nThe PPP chief welcomed the Prime Minister’s elect announcement to provide subsidy to the farmers on fertilizers.\nBilawal Bhutto called for electoral and judicial reforms and noted that the country had been unsuccessful in judicial and election reforms, requesting that conversations be had on both these topics.\n“If we can address these, then no power in the world can weaken Pakistan’s democracy,” he said.\nThe PPP chief lamented the violence that claimed the lives of several electoral candidates and workers, noting grenade attacks in Balochistan and across the country prior to the general elections.\n“In Pakistan, elections are such that candidates get killed while contesting elections. We need to ensure this does not happen,” he added.\n“I hope we can do work that lets me tell families that their sacrifice was not in vain,” he said.\nHe urged Prime Minister Shehbaz Sharif to form judicial commission under the head of Chief Justice of Pakistan Justice Faez Isa to probe the incidents on May 9 so that the culprits should be booked and the innocents must be released.\nBilawal Bhutto has endorsed the PTI’s call for the formation of a judicial commission to probe the May 9 riots.\nThe newly elected Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur’s remarks regarding an inquiry into the saga, he added.\n“PPP endorse this if the PTI assured us that it will accept the decision of the judicial commission it is not possible that someone attacks our institutions, the martyr’s memorials and we forget it,” he said.\nBilawal Bhutto said the masses people were looking towards their elected representatives to lead the country out of multidimensional challenges faced by the country including those on the economic front.\nHe said that PTI misused the cipher for political gains, adding that those involved in the cipher’s misuse had committed a violation of the constitution and should be penalized.\nHe claimed that the PTI founder politicized the cipher by printing a copy and publishing it in international publications.\nBilawal asserted that the PTI founder self-claimed that the cipher was lost by him, while the opposition leader claimed that the bureaucracy was responsible for the cipher loss.\nThe chairman of PPP affirmed that anti-state elements and national rivals could detract from the cipher, posing a threat to national security, state institutions, and the state itself.\nHe urged the Prime Minister Shehbaz Sharif for the abolishment of unwanted federal ministries.",
  "retrievedAt": "2025-08-11T01:08:17.777Z"
}
