{
  "title": "PPAF, NCSW celebrate International Women’s Day",
  "link": "https://www.app.com.pk/national/ppaf-ncsw-celebrate-international-womens-day/",
  "date_published": "2024-03-04T10:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP):The Pakistan Poverty Alleviation Fund (PPAF), in collaboration with the National Commission on the Status of Women (NCSW), the Ministry of National Heritage and Culture Division, the Ministry of Human Rights, and the Punjab Government, hosted a National Women’s Conference on Economic Empowerment in Islamabad to commemorate International Women’s Day.\nThe conference emphasized the vital importance of investing in women’s potential and acknowledging their invaluable contributions to society and sustainable economic growth.\nA prominent highlight of the event was the awarding of the annual PPAF Amtul Raqeeb Awards to female community leaders from marginalized areas across the country, celebrating their resilience and inspirational leadership within their communities.\nAdditionally, four special accolades were given to outstanding individuals for their exceptional commitment and innovation, setting the stage for further progress and excellence in their respective fields.\nThe event was attended by representatives from government institutions, the donor and diplomatic community, academia, civil society, and students from educational institutions. During a welcoming address, Nadir Gul Barech, CEO of the Pakistan Poverty Alleviation Fund (PPAF), underscored the essential link between gender equality and sustainable development goals, including good governance, human rights, and environmental sustainability.\nHe highlighted the central role of women and girls in PPAF’s initiatives, noting the significant impact that empowering women has on their lives and communities.\nBarech detailed PPAF’s efforts in enhancing women’s access to financial resources, providing assets, interest-free loans, and technical and financial training to reduce poverty and promote inclusion. He emphasized the importance of giving women a voice, including them in decision-making processes, and removing barriers to their participation in development, reinforcing the organization’s commitment to women’s empowerment.\nNilofar Bakhtiar, Chairperson of the National Commission on the Status of Women (NCSW) and the chief guest of the conference, stressed the importance of inspiring a new generation of women to break free from fear and pursue their dreams by equipping them with the skills necessary to become leaders who can significantly contribute to Pakistan’s social and economic well-being.\nBakhtiar stated, ‘We cannot achieve true development without equal opportunities for women in education, health, and employment.’ She underscored the need for equal opportunities and skill development for women, citing them as both a moral and practical imperative.\nShe envisioned the event as a beacon of optimism, signaling a shift towards a future where women lead the narrative of Pakistan’s development and prosperity. Bakhtiar also shed light on the significance of national narratives ‘Paigham-e- Pakistan’ and ‘Dukhtaran-e-Pakistan,’ initiatives that promote unity, peace, social cohesion, and the empowerment of women.\nThe audience also heard from former Inspector General of Police, Helena Iqbal Saeed, Dr Amena Hasan, Dr Saima Afzal, and Dr Bakhtawar Khalid, who shared their journeys to success despite facing adversities. They emphasized that success is a journey requiring continuous effort, perseverance, and dedication. Girl students from various colleges in Islamabad and Rawalpindi impressed the audience with their performances themed around the Economic Empowerment of Women, earning accolades from a panel of judges for their creativity and insight.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:08:21.426Z"
}
