{
  "title": "Govt committed to ensure TB-free Pakistan",
  "link": "https://www.app.com.pk/national/govt-committed-to-ensure-tb-free-pakistan/",
  "date_published": "2024-03-04T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP): Federal Secretary of the Ministry of National Health Services, Regulations, and Coordination Iftikhar Ali Shallwani on Monday said the government has taken decisive steps towards eradicating tuberculosis, reaffirming its commitment to a TB-free nation.\nHe was addressing the event held to observe World TB Day 2024 organized by Ministry of National Health Services, Regulations and Coordination, the Common Management Unit (CMU) for AIDS, TB, and Malaria, in collaboration with JSI and Dopasi foundation.\nThe secretary reaffirmed the Government of Pakistan’s commitment to combatting tuberculosis (TB) by ensuring free diagnostic and treatment facilities across public and private health institutions.\nHe said with Pakistan ranking fifth among high burden countries globally, the country witnesses approximately 608,000 new TB cases and 15,000 drug-resistant TB cases annually.\nTo confront this challenge, the government provides free TB diagnostic and treatment services in over 1500 public and private facilities, involving more than 15,000 general practitioners in TB control efforts, he added.\nEmphasizing the scale of the challenge, Shallwani addressed the task of finding and treating 2.2 million individuals affected by TB, including children and those battling Drug-Resistant TB.\nAdditionally, the government aims to administer TB Preventive Treatment to over 1.2 million people, reaffirming its dedication to preserving lives and safeguarding communities, he added.\nDr Razia Kaniz Fatima, National Coordination for Coordination Management Unit, AIDS, TB, and Malaria, emphasized this year’s World TB Day theme, highlighting the necessity for collective action, innovation, and collaboration to accelerate progress towards eradicating TB as a public health menace.\nCommending the efforts of the Government of Pakistan and various stakeholders, Dr Fatima stressed the significance of person-centered public health services, trust-building, innovation, and accountability.\nDr Muhammad Ahmed Kazi, Director General of Ministry of Health underscored the devastating impact of TB on individuals, families, and communities, urging heightened political and social commitment to mitigate its burden.\nHe acknowledged the tireless endeavors of healthcare workers, researchers, policymakers, and communities worldwide in combatting this ancient disease.\nThe event featured a video message by Dr Lucica Ditiu, Executive Director of the Stop TB Partnership, and Dr Tereza Kasaeva, Director of the Global TB Programme at WHO.\nDr Luo Dapeng, newly appointed WHO Representative Pakistan, also delivered remarks.\nSuccess stories of two patients (DST or DR TB) were also presented.\nA panel discussion among partners, government officials, civil society representatives, community leaders, and donors was facilitated by Faheem.\nAs Pakistan commemorates World TB Day 2024, the nation recommits itself to combatting TB with renewed determination and collaboration, striving closer towards the goal of a TB-free future.",
  "retrievedAt": "2025-08-11T01:07:32.486Z"
}
