{
  "title": "PANAH organizes symposium on “Healthy diet policies to prevent obesity”",
  "link": "https://www.app.com.pk/national/panah-organizes-symposium-on-healthy-diet-policies-to-prevent-obesity/",
  "date_published": "2024-03-04T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP): Health experts at a symposium on World Obesity Day titled “Healthy diet policies to prevent obesity”, organized by Pakistan National Heart Association (PANAH) on Monday discussed the alarming rise of the overweight, obesity and diet related non-communicable diseases (NCDs) in the country\nThe symposium was attended by distinguished experts, health professionals, policymakers and media.\nAccording to a press release, more than 40% of people in the country are obese or overweight. The prevalence of overweight among the children under 5 has almost doubled from 2011 to 2018. The obesity and overweight increased\nin women of reproductive age from 28% to 38% in five years.\nSugary drinks/ultra-processed products often high in sugar, salt or trans-fats are among the major contributors to obesity and many other non-communicable diseases. Government must take immediate policy actions to reduce the obesity and NCDs in the country.\nFormer Federal Minister of Health Dr Nadeem Jan was the chief guest on the occasion. Among the guests include Ex President PANAH, Gen. (R) General Ashraf Khan ,Country representative of Global Health Advocacy Incubator (GHAI) Munawar Hussain, Vice President PANAH Col. Dr Shakeel Ahmed Mirza, President National Press Club Islamabad Anwar Raza, CEO Heartfile Dr Saba Amjad, health professionals, civil society representatives and media.\nDr Nadeem Jan reiterated the government’s dedication to tackling the obesity epidemic and NCDs. He said that Ministry of National Health Services, Regulations and Coordination is committed to take all possible measures to improve public health in Pakistan.\nHe said Ministry of Health has recently banned the use of Sugary drinks in health ministry and issued an advisory to other ministries to ban these unhealthy drinks in their respective domains and added that though I have retired, my support will always be with the PANAH.\nGen. (R) Ashraf Khan delivered a keynote address shedding light on modifiable risk factors associated with non-communicable diseases and obesity.\nHe said that overweight and obesity are the key modifiable risk factors for cardiovascular and many other fatal non-communicable diseases. High body mass index (BMI) contributes considerably to NCDs. Unhealthy diets are among the major contributors to obesity. Government shall take immediate policy measures to reduce the risk of obesity in Pakistan. He stressed the need for higher taxes on ultra-processed foods to reduce their consumption.\nMunawar Hussain in his presentation, delved into policies aimed at reducing the consumption of ultra-processed products with a special focus on higher taxes on sugary drinks, chocolates, ice creams, salty and sweet snacks, fast foods, baked items, ready to eat meals and processed meat.\nHe said Taxing ultra-processed foods is a triple win for government as it reduces the obesity and other non-communicable diseases, generate additional revenue for the government and government does not bear any cost. The revenue collected from taxes must be earmarked fully or partially for public health programs.\nHe also stressed on adopting the holistic approach including regulating trans-fats in all foods, marketing restrictions and imposing Front of Pack Warning Labels and on ultra-processed products.\n“Sugary drinks are the largest source of the intake of the sugar in the diet. The liquid sugar alters the metabolism of the body, promote excess calorie intake which can lead to obesity and type 2 diabetes” said by Dr. Shakeel Ahmed Mirza.\nUltra-processed foods are often high in sugar, salt or tran-fats. World Health Organization recommends the limits of sugar, salt and trans-fats in our daily diet. If we want to reduce the disease burden, we must take serious policy actions to reduce the alarming increase in obesity and other non-communicable diseases.\nSanaullah Ghumman briefed the participants about PANAHs campaign on the reduction of the consumption of ultra-processed foods. He said that PANAH is not only working to raise awareness of general public on health harms of ultra-processed foods but also working with policy makers for formulation o effective policies to reduce their consumption. He thanked the health minister for banning the sugary drinks in ministries and departments of federal government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:07:54.023Z"
}
