{
  "title": "CUI, D-8 International University Iran ink academic accord",
  "link": "https://www.app.com.pk/national/cui-d-8-international-university-iran-ink-academic-accord/",
  "date_published": "2024-03-04T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP): COMSATS University Islamabad (CUI) and D-8 International University (D-8 IU), Iran, Monday signed an MoU already authorized by the federal cabinet of Pakistan to enhance their collaboration in joint academic and research activities including exchange of faculty, researchers, students, staff, scholarships and training courses.\nThe joint academic and research activities will play instrumental role for the development of faculty and administrative staff, joint training programs, convening of joint conferences and other areas.\nIn the MoU signing ceremony held at COMSATS University Islamabad Campus, H.E Dr. Reza Amiri Moghadam, Ambassador of the Islamic Republic of Iran to Pakistan and Mr. Masoud Haghighi, First Counsellor attended the event.\nD-8 IU Chancellor Professor Abbas Afkhami and COMSATS Varsity Rector, Prof. Dr. Sajid Qamar, signed the agreement. Also from CUI, the following officials were present: Prof. Dr. Sajjad A. Madani, Registrar, Dr. Tahir Naeem, Director (P&D/HRD), Prof. Dr. Sohail Asghar, In-charge, Islamabad Campus, Dr. Hammad Omer, T.I., Head, International Office,  Ali Tawab Baloch, Senior Manager and Dr. Aqif Anwar, Head IRCBM Lahore. From D-8 IU, the participants included  Milad Saki, Head, International Office, and Dr. Mazaher Ahmadi, Advisor to Chancellor.\nThe Head, CUI International Office presented detailed achievements, milestones of CUI as well as engagements of the university with Iran and wished for future potential opportunities.\nSpeaking on the occasion, the ambassador stated, “Iran and Pakistan enjoy relationships and ties in various areas including political, economic, and trade areas, and we would like the two countries to deepen their relationships by cooperation in academic and scientific fields.”\nThe Chancellor of D-8 IU proposed reciprocal scholarships for PhD students, further solidifying the commitment to equitable cooperation.\nLooking ahead, the Rector COMSATS University Islamabad expressed enthusiasm for implementing the MoU, with focus on the exchange of researchers and students as integral component of future collaborations.\n“COMSATS will welcome more Iranian students to the university”, the Rector said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:07:56.709Z"
}
