{
  "title": "Govt to provide free-of-cost seeds to farmers in flood-hit areas: Minister",
  "link": "https://www.app.com.pk/national/govt-to-provide-free-of-cost-seeds-to-farmers-in-flood-hit-areas-minister/",
  "date_published": "2022-10-13T09:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP):Federal Minister for National Food Security and Research Tariq Bashir Cheema on Thursday informed the National Assembly (NA) that the government had allocated sufficient funds for the distribution of free-of-cost seeds among the farmers of flood-hit areas of the country.\nParticipating in the debate on a motion moved by Naveed Qamar, he said “This House may discuss the situation arising out of the recent floods in the country”, adding he said “I assured the member of the parliament that for the first time, farmers across Sindh and Balochistan provinces as well in flood-hit district each in Punjab and Khyber Pakhtunkhwa provinces will be provided with free seeds for wheat.”\nHe further informed that Rs. 4 billion had been transferred to National Disaster Management Authority (NDMA). It had started the procurement of seeds for the farmers in the flood-hit areas.\nThe minister said that the federal government would also arrange Rs. 4 billion more for the purpose.\nHe said it was agreed that provincial governments would match the amount announced by the federal government. “We have started the procurement of the seeds, and these will be distributed among the farmers of the flood-hit areas without any discrimination”, he added.\nThe minister said that the federal government was keen to review the agriculture sector in the flood-hit areas as it will be beneficial for the country.\nParticipating in the debate, Grand Democratic Alliance (GDA) leader Ghous Bux Khan Mahar asked the government officials to visit the flood-hit areas of Sindh and Balochistan. He alleged that relief goods had not been provided to flood victims in the Sindh province. He said that flood affectees are living in the open sky and demanded the Sindh government reach out to help flood victims.\nThe GDA lawmakers called upon all the political parties to set aside political differences and work together to uplift people and prosperity and development of the country.\nGDA leader said that farmers affected by the current flood should be provided cheaper fertilizers at their doorstep.\nJamiat Ulama-e-Islam leader Muhammad Jamal ud Din said that flood affectees should be provided relief and compensation at their doorsteps.\nPakistan Tehreek-e-Insaf leader Mir Muhammad Murad Khan Jamali said that about 80 per cent area of the Balochistan area was destroyed by the floods.\nHe appreciated the government’s announcement for providing free seeds to farmers in the flood-hit areas. He also asked the government to devise a policy to deal with the flood-like situation in the country.\nPakistan People Partry leader Mir Munawar Ali Khan Talpur appreciated the Sindh Chief Minister for visiting the flood-hit areas and distributing relief goods among the affectees. He also lauded esteemed Pakistan Army for assisting flood affectees.",
  "retrievedAt": "2025-08-11T15:43:26.239Z"
}
