{
  "title": "Power supply to be fully restored by evening: Khurram",
  "link": "https://www.app.com.pk/national/power-supply-to-be-fully-restored-by-evening-khurram/",
  "date_published": "2022-10-13T10:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP):Minister for Power Division Khurram Dastgir Khan on Thursday said that the government was fully cognizant to the power blackout in Southern parts of the country and it would be fully restored by the evening.\nAddressing a press conference here, he said country’s southern parts witnessed power black out due to technical fault at two 500 kV transmission lines simultaneously which resulted tripping of several power plants.\n“We are trying to completely restore the system between ‘Maghrib and Isha’,” he said.\nThe minister said that the fault occurred at 9.16 a.m. in two 500 kV southern transmission lines NK-1 and Jamshroo which caused power suspension in southern areas of the country including Karachi, Quetta, Hyderabad and Sukkur etc.\nHe said our first priority was to isolate Karachi from it, and we successfully isolated it by 9:45. 1000 MW which was provided daily to Karachi from the national grid was disconnected but K Electric own system was independently operational and was supplying electricity to the port city, he added.\nHe said tripping caused temporary shortfall of 8,000 MW in the system and some areas of Multan and Faisalabad also witnessed partial outage. However, he said so far over 4700 MW has been restored to the system in a short time.\nHe said he along with MD National Transmission and Despatch Company (NTDC) and MD National Power Control Centre (NPCC) was personally supervising the restoration work.\nHe said power supply has already been fully restored to Sibbi, Quetta Electric, Multan, Faisalabad while partially restored to Sukkur.\nKhurram said three teams including reconnection team dealing with the cut-off conductors, the second repair team and the third team, was the inquiry team, which would submit a report to the ministry in four days identifying the cause of the incident. Appropriate action would be taken in light of inquiry report, he added.\nHe appreciated the NTDC and NPCC teams to keep away North of country from tripping and power blackout. The NTDC team also restored power supply in flood affected areas in a record time, he added.\nHe said power restoration to Karachi and Quetta was priority and gradually power supply to other areas was also being restored.\nReplying to a question, he said fault occurred simultaneously at NK-1 and Jamshroo transmission lines. However, North of the country remained safe from power outage, he said.\nHe said 1000 MW electricity was suspended to Karachi from the national grid which would be restored once tripped power plants fully resumed electricity generation as such plants took some time to come on line.",
  "retrievedAt": "2025-08-11T15:43:25.016Z"
}
