{
  "title": "Want to leave behind legacy of peace; ready for dialogue with India for prosperity, development: PM",
  "link": "https://www.app.com.pk/national/want-to-leave-behind-a-legacy-of-peace-prosperity-pm-stresses-efforts-for-kashmir-resolution-peaceful-afghanistan/",
  "date_published": "2022-10-13T15:56:00.000Z",
  "source": "APP",
  "content": "ASTANA (Kazakhstan), Oct 13 (APP): Prime Minister Shehbaz Sharif on Thursday said that he was “absolutely ready” to have dialogue with India for resolution of Kashmir dispute as he wanted to leave behind a legacy of peace and progress for the prosperity of coming generations.\nAddressing the 6th Summit of the Conference on Interaction and Confidence Building Measures in Asia (CICA) in Kazakhstan’s capital Astana, the prime minister said Pakistan was “absolutely ready and willing for a discussion with Indian counterparts to promote trade and investment provided they showed the sincerity of purpose”.\n“India has become a threat to its minorities, neighbours and the entire region,” he remarked.\n“I want to leave behind a legacy of peace and progress for the prosperity of the coming generations of our region,” said the prime minister who spoke at length about the regional issues, including Kashmir and Palestine, and revival of peace in Afghanistan calling for their dialogue-based resolution.\nHighlighting the human rights abuses in the Indian Illegally Occupied Jammu and Kashmir, the prime minister said the Kashmiris faced continued denial of their right to self-determination.\nHe urged other countries to take notice of the human rights violations in the IIOJK, which was the manifestation of Indian policy of preferring bullet over ballot as the country had also blatantly quashed the United Nations Security Council’s resolution on holding a plebiscite in Kashmir.\nHe told the gathering that Pakistan was willing to “conditionally engage with India” for the sake of prosperity and development as both sides of the border could not afford to deal with massive challenges of poverty and unemployment amid meager resources.\nHe stressed that the people deserved the resources to be diverted to their education and health.\nHe, however, said the “onus remains on India to take necessary steps to engage towards the result-oriented solutions”.\n“Through constructive dialogue, we can build mutual trust,” he remarked and mentioned Pakistan’s location offering a natural bridge among various economies of the region.\nComing to Afghanistan, the prime minister said, ”A prosperous and stable Afghanistan is not only in the interest of Pakistan but also for the international community.”\nHe said the four decades of conflict not only took a heavy toll on the country but also upon its neighbouring Pakistan.\nThe prime minister said that Pakistan suffered immense damage to its peace and security with serious consequences in form of 80,000 casualties and billions of dollars financial losses.\nHe, however, expressed satisfaction that after immense sacrifices, Pakistan was now able to control extremism and terrorism on its soil, besides managing to host four million Afghan refugees.\nReferring to another regional dispute of Palestine, the prime minister reiterated his call for a peaceful way of its resolution to ensure peace in the Middle East and the region.\nHe called for pooling resources among the regional countries to address the common challenges in the interest of peace and progress.\n“Pakistan’s first priority at the moment is to revive rapid and equitable economy,” the prime minister said and highlighted the multi-billion dollar project of China Pakistan Economic Corridor (CPEC), which had transformed the economic and connectivity landscape of the region.\nHe also invited the CICA member states to consider benefiting from the trade, investment and business opportunities offered by Pakistan.\nOn the recent floods in Pakistan, the prime minister pointed out that the country was bearing the brunt of climate change despite its less than one percent carbon omissions.\nHe thanked the countries that stepped forward in extending assistance to Pakistan to carry out the relief and rehabilitation activities in the flood-affected areas.\nHe also termed encouraging the upscale $816 million flash appeal by the United Nations launched to meet the daunting challenge of heavy losses incurred by the flash floods.\nThe prime minister expressed confidence that Pakistan was “determined and committed” to emerge stronger after the flood disaster.\n“Pakistan, with the support of its people and the friendly countries, will come out of this problem,” he said.\nHe also elaborated the significance of CICA as a unique forum for promoting interaction, understanding, and collaboration among the countries across Asia.\nEarlier, the prime minister on his arrival at the Palace of Independence, the venue of CICA summit, was warmly welcomed by Kazakh President Kassym-Jomart Tokayev.\nThe prime minister along with other heads of state and government also had a group photograph before the summit was opened.",
  "retrievedAt": "2025-08-11T15:43:20.534Z"
}
