{
  "title": "Adopting telemedicine, strengthening preventive care vital to overcome healthcare challenges: President",
  "link": "https://www.app.com.pk/national/adopting-telemedicine-strengthening-preventive-healthcare-vital-to-overcome-healthcare-challenges-president/",
  "date_published": "2022-10-13T10:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 13 (APP): President Dr Arif Alvi on Thursday said that the adoption of digital technology and telemedicine, and strengthening preventive health care was essential to help overcome the increasing healthcare challenges faced by the underprivileged population.\nThe president said this in a meeting with the delegation of Global Executives of Siemens Healthineers led by CEO of the Middle East & South Africa (MESA) Regions Ole Per Maloy, who called on him here at Aiwan-e-Sadr.\nTalking to the delegation, the president emphasized that healthcare providers should embrace innovation and transform healthcare delivery to improve the quality of healthcare services and enhance people’s access to medical services in a cost-effective and efficient manner.\nHe underlined the need to promote preventive healthcare system by creating awareness about the importance of prevention and early detection of diseases by adopting a healthy lifestyle.\nHe said a healthy lifestyle could be adopted by observing cleanliness, regular exercise, eating a balanced diet, management of tension and anxiety, avoiding smoking and use of drugs and seeking medical assistance at the early stage of health issues faced by them.\nThe president said that there was a need to repeatedly inculcate the importance of a healthy lifestyle and taking precautionary measures to prevent the occurrence of diseases.\nHe said the early detection of disease or illness to the general public through all possible means of communication was also important.\nHe added that the advance of smart devices and software solutions had a great potential to transform the medical sector, especially in Pakistan where the health system was fragile and overburdened.\nPresident Alvi stressed the need to develop telemedicine facilities and use mobile units to provide awareness, medical advice and treatment to the unprivileged segment of society in rural and far-flung areas who could not afford the high cost associated with diagnostic and curative healthcare.\nHe stressed the need for enhancing collaboration with Siemens Healthineers by sharing knowledge, adopting the best practices and skill sets and innovation being made in the preventive health care system and provision of quality but cost-competitive and affordable health facilities.\nEarlier, Ole Per Maloy briefed the president regarding various products of Siemens Healthineers.\nHe said that Siemens Medical Solutions was the parent company of several medical technology companies in Germany, and was a leading healthcare solution provider to Pakistan in the domain of laboratory and radiology.\nHe said the company’s core mission was to empower healthcare providers and help in expanding precision medicine, transforming care delivery and improving patient experience, enabled by the digitalization of the healthcare system.",
  "retrievedAt": "2025-08-11T15:43:25.115Z"
}
