{
  "title": "Noisy protest by PTI lawmakers mars NA proceedings - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Assembly on Thursday saw another day of noisy protest by PTI lawmakers with torn copies of agenda flying all around and slogans for release of Imran Khan echoing in the House.\n\nThis all started when Agha Rafiullah of PPP during the question hour put an un-related supplementary question about 190m pounds received from United Kingdom’s National Crime Agency (NCA), and the information minister happily responded to it.\n\nThe main question was about the status of Diamer-Bhasha dam in terms of construction progress, but on a supplementary question, he asked if the amount received from the NCA went to the national treasury, and the minister replied in the negative.\n\nAmid full-throated slogans from the opposition benches like “free Imran Khan” and “laathi goli ki sarkar nahin chaley gi” (The rule of baton and bullet cannot continue), the minister alleged that during PTI’s tenure, the 190 million pounds — public money belonging to Pakistan — was diverted for personal gains.\n\nHe claimed that the then prime minister Imran Khan, his wife, and their associates including Farhat Shehzadi used these funds to purchase lands, and demanded expensive gifts, including five-carat diamond rings, from a prominent real estate tycoon.\n\nHe said the money was in fact returned to the man on whom the fine had been imposed and a sham trust was formed by former prime minister Imran Khan and his spouse. He said the amount received from the NCA was adjusted against another fine and thus an amount of Rs80 billion had been devoured.\n\nAs Rafiullah rose in his chair to ask another question and the noisy protest continued, he said these were the issues of public importance and the purpose was to hold the government accountable.\n\nHe accused the PTI of helping the government by protest. “You can do it after the question hour,” he said.\n\nLater, PTI senator Iqbal Afridi pointed out the quorum, which was followed by PTI members’ exit from the House.\n\nThe House was found not to be in order after the count and deputy speaker of National Assembly Syed Ghulam Mustafa Shah suspended the proceedings of the House for 15 minutes.\n\nThe proceedings, however, ended soon after the House reassembled and was adjourned to meet again on Friday (today).\n\nPublished in Dawn, January 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:52:52.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885786/noisy-protest-by-pti-lawmakers-mars-na-proceedings",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T03:37:07.000Z"
}
