{
  "title": "PTI changes stance on meeting with military leadership - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The issue of a meeting between Chief of Army Staff General Asim Munir and PTI leaders Ali Amin Gandapur and Barrister Gohar Ali Khan came under intense scrutiny on Thursday, but the agenda of the rendezvous remained shrouded in mystery, amid conflicting claims from both sides.\n\nInitially, the interim PTI chairman had denied a meeting took place, but on Thursday, he confirmed a meeting with the army chief, where he claimed to have “received a positive response”. A statement attributed to security sources, however, denied any political aspect of the gathering, saying the contents of the meeting were being reported out of context.\n\nIt is understood that the meeting took place during the army chief’s recent trip to Peshawar, where he also met other political leaders from Khyber Pakhtunkhwa.\n\nThe meeting was also confirmed by former prime minister Imran Khan, who is incarcerated in Adiala jail, saying if talks had started between the two sides, then it was indeed a step in the right direction. Responding to a question by a reporter following the court hearing in Adiala jail, Mr Khan stated: “Yes, Barrister Gohar Khan has met the army chief, and it is a welcome move.”\n\nLeaders ‘confirm’ Gohar met Gen Munir alongside KP CM; military sources dispute party’s version of events\n\nThe PTI founder reiterated his long-held stance that dialogue with the establishment was crucial for ensuring political and economic stability in the country. He said the PTI had always been open to talks with the establishment, but it was the establishment that had previously shut the doors to talks. “I never said our doors are closed. Only through talks can stability be brought to the country,” he remarked.\n\nSpeaking about the meeting, Barrister Gohar revealed that he and Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur had met the army chief.\n\n“In the meeting, we placed all our issues before the army chief,” he stated, adding that a positive response was received during the discussions. “All issues concerning the country’s stability were discussed,” he said, expressing optimism about the outcome. “Hopefully, the situation will improve now.”\n\nKP Chief Minister Ali Amin Gandapur told reporters that he “met the army chief in Peshawar in a security meeting”, where leaders of other parties, including Barrister Gohar, were also present.\n\nIn the wake of this claim, military sources released a clarification of sorts, specifying that the meeting in Peshawar was held in the context of security and counter-terrorism issues in KP province.\n\nSources said that Barrister Gohar had tried to discuss political issues during the meeting, but he was told to take them up with politicians instead of the military.\n\n“The discussions were presented out of context,” the clarification said, adding that an attempt had been made to give political colour to the discussions on security issues, which was regrettable.\n\nToshakhana case\n\nAlso on Thursday, the Islamabad High Court directed the legal team of Imran Khan and Bushra Bibi to remove the administrative objections raised by the registrar’s office regarding the acquittal applications of the PTI founder and Bushra Bibi in the Toshakhana case. During the hearing, Barrister Salman Safdar, along with other lawyers representing the petitioners, highlighted that the only objection raised was the lack of certified copies in their application.\n\nBarrister Safdar explained that all relevant orders were duly attached with certified copies, and expressed frustration over the rapid pace of the trial. “The trial is being expedited unfairly with three hearings a week, and outside regular working hours,” he argued. Meanwhile, a hearing for the Toshakhana case took place in a makeshift courtroom in Adiala jail, with Special Judge Central Shahrukh Arjumand presiding over the proceedings.\n\nMr Khan was presented in the courtroom, while Bushra Bibi’s request for exemption from attendance on medical grounds was filed and subsequently accepted. The defence counsel completed the cross-examination of a prosecution witness Talat Mehmood. Over the course of the hearing, statements from seven witnesses were recorded, and cross-examination of five witnesses was successfully completed. The court also summoned additional witnesses to record their statements in the next hearing. The proceedings have been scheduled to continue on January 20.\n\nSeparately, a Rawalpindi anti-terrorism court judge hearing the May 9 cases against the PTI leadership banned the entry of lawyer Ali Imran Shehzad for disorderliness during the Jan 15 hearing and asked PTI leader Mussarat Jamshed to hire a new lawyer. Mr Shehzad was also issued a contempt notice.\n\nPublished in Dawn, January 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:45:27.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885774/pti-changes-stance-on-meeting-with-military-leadership",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T03:22:02.000Z"
}
