{
  "title": "Pakistan’s role in anti-terror ‘too big for labels’: FO - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan’s role in supporting US counter-terrorism efforts and promoting regional stability transcends simplistic labels, Foreign Office spokesman Shafqat Ali Khan said on Thursday.\n\n“It is a fact that Pakistan is not part of any treaty alliance with the United States. It is also a fact that Pakistan has been designated a major non-Nato ally since 2004. But it is also a fact that Pakistan’s contribution to maintaining peace and security in the region and the fight against terrorism is far too great to be encapsulated in technical and legal labels,” Mr Khan, who recently took over as FO spokesman, stated during his maiden briefing.\n\nMr Khan’s comments came in response to remarks by White House National Security Communications Adviser John Kirby, who, at a Washington briefing, underscored the absence of a formal defence pact between the two countries.\n\nDespite this, Kirby acknowledged the decades-long cooperation between Washington and Islamabad, particularly in counter-terrorism efforts along the Afghanistan-Pakistan border.\n\nWelcomes Gaza ceasefire deal; dismisses speculation about ‘collaboration’ with Tajikistan to destabilise government in Afghanistan\n\nThe FO has consistently highlighted the country’s role as a key player in combating global terrorism, often seeking to redefine its ties with Washington beyond transactional terms.\n\nIn a separate development, Mr Khan confirmed that Ambassador to US Rizwan Sheikh would represent Pakistan at the Jan 20 inauguration of US President-elect Donald Trump, as has been customary in the past.\n\nMedia reports have indicated that Trump has invited a limited number of foreign leaders to attend the event, deviating from longstanding protocol.\n\nIndian External Affairs Minister S. Jaishankar is expected to represent India at the inauguration, adding another layer of diplomatic interest to the high-profile ceremony.\n\nResponding to a question about the hiring of lobbyist by the Pakistani government in Washington, Mr Khan called it a standard international practice. “I don’t have the specifics right now, but I can just make a broad point about it. About hiring of lobbyists: it’s a normal practice in the US. There is nothing unusual about it. It’s a common practice. Most countries hire lobbyists. This is a routine activity,” he said.\n\nAfghanistan\n\nThe spokesman dismissed speculation that Pakistan is collaborating with Tajikistan to destabilise Taliban-controlled Afghanistan.\n\n“Any speculation regarding Pakistan and Tajikistan working to destabilise or something I would reject. And our relationship, like with all friendly countries is based on the principles of UN Charter,” the Foreign Office spokesman said while responding to a question.\n\nThe remarks come after some quarters speculated about covert cooperation between Pakistan and Tajikistan following a visit by Lt Gen Asim Malik, director-general of Inter-Services Intelligence (ISI), to Tajikistan late last month.\n\nTajikistan, which hosts leaders of Afghanistan’s National Resistance Front and maintains no official ties with the Taliban, has repeatedly voiced concerns over the presence of terrorist groups in Afghanistan.\n\nMr Khan also highlighted Pak­istan’s concerns over the presence of Tehreek-i-Taliban Pakis­tan (TTP) sanctuaries in Afghanistan.\n\nGaza\n\nThe FO spokesperson also welcomed the recent ceasefire agreement for Gaza, expressing the hope that it will lead to lasting peace and alleviate the humanitarian crisis in the region.\n\n“At this point in time, we can hope for the best. We have seen the news of the two sides reaching a ceasefire, a truce, through the mediation and efforts of a number of countries involved. We take this development positively and as I noted and we hope that this would lead to a permanent ceasefire, which could alleviate the unprecedented sufferings which have befallen the people of Palestine and Gaza,” Mr Khan said.\n\nHe emphasised the importance of the truce being fully implemented and urged that humanitarian assistance be scaled up to address the dire needs of civilians in Gaza.\n\n“Indiscriminate use of force by Israeli occupation forces has caused unprecedented loss of lives and property and displacements of hundreds of thousands of innocent civilian Palestinians,” he said. “Israel’s expansionist designs have destabilised the entire region.”\n\nPublished in Dawn, January 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:12:43.994Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885771/pakistans-role-in-anti-terror-too-big-for-labels-fo",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T03:14:26.000Z"
}
