{
  "title": "Lawyers call for delaying JCP meetings amid 26th amendment challenges - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The All Pakistan Lawyers Action Committee (APLAC) has urged Supreme Court and high court judges to postpone meetings of the Judicial Commission of Pakistan (JCP) until challenges to the 26th Amendment to the Constitution are resolved.\n\nThis content of the letter was disclosed during a press conference on Thursday by senior counsel Senator Hamid Khan and Islamabad High Court Bar Association President Riasat Ali Azad. The letter was endorsed by several elected and former office-bearers of bar associations and bar councils.\n\nThey said the letter was being addressed to the superior court judges as “staunch defenders” of constitutionalism, the rule of law and the independence of the judiciary, adding that it was with grave concern that they were raising the issue of the 26th Amendment, which according to them had profound implications for the judiciary’s autonomy and institutional integrity.\n\nThe letter feared that the judiciary stood as the final bastion of constitutionalism and the rule of law and at this critical juncture, they trusted that the judges would act decisively to protect the judiciary’s independence and integrity by constituting a full court to hear challenges against the 26th Amendment and postponing all JCP meetings until the resolution of these petitions.\n\nAsk SC, high court judges to act decisively to protect judiciary’s independence, integrity\n\n“Your (judges’) collective wisdom and commitment to upholding constitutional principles will ensure that the judiciary remains a symbol of justice, impartiality and independence,” the letter said. “Needless to say. it is the bounden duty of every judge to preserve, protect and defend the Constitution.”\n\nIt said that the 26th Amendment, allegedly enacted under “contentious and colourable circumstances”, directly undermined the foundational principle of judicial independence enshrined in Articles 175(3), 177 and 193 of the Constitution.\n\nSpecifically, the amendment’s provisions altering the composition and functioning of JCP represented a clear attempt by the executive to dominate the judiciary, contrary to the doctrine of separation of powers, it said.\n\nThe constitutional vires of this amendment were presently under challenge in numerous petitions before the Supreme Court, raising critical questions about its validity, the letter said. “Proceeding with judicial appointments under the framework of the impugned amendment before resolving these constitutional challenges risks nullifying such appointments if the amendment is eventually struck down and may cause significant embarrassment and uncertainty for the appointees and the judiciary as an institution,” it added.\n\nSuch appointments would also undermine public confidence in the judiciary’s impartiality and independence, it said.\n\nSenior lawyers and former presidents of the Supreme Court Bar Association (SCBA) — including Hamid Khan, Ali Ahmed Kurd, Qazi Muhammad Anwar, Abid S. Zuberi, Amanullah Kanrani, Shafqat Mehmood Chohan, Maqsood Buttar, Ishtiaq A. Khan, Tahir Faraz Abbasi, Munir Kakar, Rahib Khan Buladi — are among those who have endorsed the letter.\n\nMeanwhile, the incumbent SCBA president, Mian Muhammad Rauf Atta, in a separate letter said the appointments to the superior judiciary were imperative for the efficient functioning of our judicial system and for ensuring the prompt dispensation of justice to all.\n\nHe said it was essential that these appointments were made without any further delay to enhance the judicial capacity, which was already grappling with a shortage of judges, thus affecting the overall performance of the judiciary.\n\nAny further delay would significantly undermine the very foundation of fair and swift justice for the public at large, he said, adding that the role of JCP and its working were well defined.\n\n“We regard the formation of JCP as the most balanced in recent years, as it includes equal representation from all relevant stakeholders,” he said, expressing complete confidence in their insight, judgement and adherence to the spirit of the Constitution.\n\nAbove all, JCP Appointment Rules, 2024, have been recently framed, del­iberated, and approved and all the nitty-gritties concerning the appointments to the superior courts have been thoroughly considered. The process of judicial appointments has ent­ered its culmination stage.\n\n“We are hopeful that, rather than being delayed, the matter of these long-awaited appointments will effectively be finalised for the better good of the rule of law and the prompt dispensation of justice. We also expect that the appointments will be made purely on a merit basis,” he added.\n\nPublished in Dawn, January 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:12:43.931Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885769/lawyers-call-for-delaying-jcp-meetings-amid-26th-amendment-challenges",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T03:10:57.000Z"
}
