{
  "title": "DNA confirms suspect’s identity in rape-cum-murder of Gujrat girl - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: The DNA samples of a suspect matched with that of a five-year-old girl who was strangled after rape in Khohaar village of the Sara-i-Alamgir Saddar police area.\n\nThe suspect, a gardener in a college, was the neighbour of the child.\n\nThe autopsy report also confirmed that the girl, the daughter of an expat ‘J’, had been raped before being killed as marks of torture were also found on sensitive parts of her body, said an official of Gujrat police.\n\nAddressing a news conference on Thursday, Gujrat SP Investigation Riaz Ahmad Naz said the father of the girl had lodged a kidnap complaint on Jan 5, saying that his minor son and daughter had left the house for tuition. His son returned home but the daughter did not.\n\nThe SP said police were involved in the search for the missing girl whose body was found in an abandoned house near the same street the next day.\n\nNeighbour of minor victim confesses to committing crime\n\nA special team of police was constituted to trace the suspect. The DNA samples from 73 different locations of the area were collected out of which 24 were found as those of humans.\n\nFive suspects residing in the vicinity of the crime scene were detained for interrogation and their DNAs and polygraphic tests were also conducted.\n\nDuring the forensic analysis of the samples of the detained suspects, the samples of one matched with that of the victim girl as per the report of the Punjab Forensic Science Agency, the SP said and added that the suspect had also confessed to committing the crime.\n\nAnother official source said the suspect was working as a gardener in a college of Rasul in the district Mandi Bahauddin, some kilometres from the Khohaar village. The suspect’s house, he said, was located in the neighbourhood of the victim girl.\n\nThe police officer said the suspect had initially kept the girl’s body in the upper portion of his house and could not dump it due to the deployment of police in the area.\n\nThe next morning, he threw the body by packing it into a sack from the roof of another house in the neighbourhood instead of throwing it from his own house’s roof.\n\nPublished in Dawn, January 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:12:43.321Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885733/dna-confirms-suspects-identity-in-rape-cum-murder-of-gujrat-girl",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T02:58:26.000Z"
}
