{
  "title": "Trump’s return a fresh threat to ‘fraying’ rights system, HRW warns - World - DAWN.COM",
  "author": null,
  "content": "UNITED NATIONS: Human Rights Watch on Thursday blasted the “craven unwillingness” of governments to defend international norms and institutions last year, while warning that Donald Trump’s return to power will compound pressure on the world’s “fraying” rights system.\n\nFrom Gaza to Sudan, Haiti and Ukraine — 2024 saw rights violations “at the most extreme,” HRW chief Tirana Hassan said in an interview ahead of the Thursday release of the organisation’s annual report.\n\nWorldwide elections and deadly conflicts over the past year challenged the “integrity of democratic institutions and the principles of human rights and humanitarian law” — but many governments “have failed the test,” the 500-page document said.\n\nIt noted mounting repression in Russia, India and Venezuela as well as continuing devastation from the conflicts in Gaza, Sudan and Ukraine. These conflicts and other humanitarian crises, marked by the “craven unwillingness of many governments to stand up to suffering and abuse,” exposed the “fraying of international norms meant to protect civilians and the devastating human cost when they are flouted,” according to the report.\n\nIt called out authoritarian governments — including in Russia and Mali — for violating democratic norms, while also slamming liberal democracies, saying they were “not always reliable champions of human rights at home or abroad.”\n\nHassan pointed to US President Joe Biden continuing to provide Israel with weapons, despite mounting evidence they have “been used in the commission of war crimes and the killing of civilians” in Gaza.\n\nShe said 2024 showed “how inconsistent the commitment to human rights” has been. “That is very dangerous, because it sends a message that certain rights apply to some people and they don’t to others,” the Singapore-born lawyer said.\n\nTrump ‘vacuum’\n\nWith Trump’s return to the US presidency, HRW expressed concern that his administration would “repeat and even magnify the serious rights violations of his first term.” Renewed attacks by Trump on minority rights, international law and multilateral institutions risk “emboldening illiberal leaders worldwide to follow suit,” it warned.\n\nHassan said that a US retreat from multilateral systems under Trump’s second term would create “a real vacuum, which is going to be filled by opportunistic actors like China” to advance their “anti-rights agenda.” “But it’s not all doom and gloom,” she said, pointing to some progress last year in international courts, such as South Africa’s case against Israel over its conflict in Gaza.\n\nPopular uprisings have also seen success in pushing back against authoritarian regimes, such as in Bangladesh, where longtime ruler Sheikh Hasina was ousted in August. “These resistance movements highlight a crucial reality: the fight for rights is often driven by ordinary people, fed up with injustice and corruption, bringing together their collective power to compel governments to uphold basic rights and serve the people instead of their own interests,” the HRW report said.\n\n‘Time to double down’\n\nHassan described the continued global fight for rights as “the challenge of our time.” While people can feel “overwhelmed by the horrors” occurring worldwide, “this isn’t a time to look away, if anything, this is a time to double down.” HRW’s report, which reviews the situation in about 100 countries, highlighted the “widespread atrocities” faced by civilians in Sudan, while Haiti has seen gang violence reach “catastrophic levels.” It also called out Israel for committing “crimes against humanity” and possibly “genocide” during the Gaza conflict.\n\nPublished in Dawn, January 17th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:45:09.227Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1885817/trumps-return-a-fresh-threat-to-fraying-rights-system-hrw-warns",
  "dateList": "2025-01-17",
  "date_published": "2025-01-17T04:32:33.000Z"
}
