{
  "title": "Establishment of tertiary hospitals need of hour: CM",
  "link": "https://www.app.com.pk/national/establishment-of-tertiary-hospitals-need-of-hour-cm/",
  "date_published": "2020-12-29T13:58:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 29 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan has termed the establishment of new tertiary care hospitals in Hazara, Malakand and south regions as need of the hour.\nHe was chairing over a meeting regarding the establishment of new tertiary care hospitals in Hazara, Malakand and southern regions of the province. Administrative Secretaries of Health, Finance and P&D departments and other concerned authorities attended the meeting.\nThe chief minister directed the quarter concerned to identify suitable lands for the establishment of such hospitals and submit final proposals to this effect within two week time period so that further progress could be made possible to this effect.\nHe made it clear that land should be identified at such points which are equally accessible for all the districts and the concerned regions adding that the ultimate purpose of the establishment of new hospitals is to minimize the burden of patients on teaching hospitals of Peshawar and to provide tertiary healthcare facilities to the people at local level.\nIt was decided in the meeting that the proposed hospitals would be established under Public Private Partnership (PPP) for which land would be provided by the provincial government.\nThe meeting was informed that 580 Kanal land free from all encumbrance near Mansehra has been identified for the establishment of new tertiary hospital in Hazara region.\nThe Chief Minister while agreeing in principle to the identified site, said that it was equally accessible to the people of Kohistan and Battagram and other districts, and directed that such suitable lands should also be identified for the establishment of new hospitals in Malakand and southern regions.\nMeanwhile, it was also decided in the meeting to establish a new tertiary care hospital under Public Private Partnership in the provincial capital on already available piece of land.\nThe Chief Minister directed the health, P&D, Finance and other relevant departments to sit together and come up with the final and practicable action plan within a week so that practical work could be started on the proposed hospital.",
  "retrievedAt": "2025-08-11T20:11:47.518Z"
}
