{
  "title": "Karima Baloch’s death points to RAW’s clandestine operation",
  "link": "https://www.app.com.pk/national/karima-balochs-death-hints-at-raws-clandestine-operation/",
  "date_published": "2020-12-29T14:00:00.000Z",
  "source": "APP",
  "content": "The mysterious circumstances surrounding the death of Karima Baloch, a human rights activist in Canada, has led the experts to believe the incident as a clandestine operation aimed at cleaning the notorious tracks of Indian intelligence outfit – RAW.\nKarima Baloch, 37, who was the chairperson of Baloch Students Organization (BSO) has been in a self-exile in Canada. According to her published interviews in various newspapers, she was tasked to move to Ontario by the BSO and was granted asylum in 2016.\nIn a video message in Hindi to Indian Prime Minister Narendra Modi, Karima Baloch addressed him as ‘Shri Modi Ji’ and appealed to him to help her and “other Baloch brothers who were either missing or had been killed,” as their brother.\n“Today I am asking you to help your Baloch sister, as a brother, and appeal you to protect us from Baloch genocide, war crimes, and human rights violations and expect you to be the voice of the Baloch at international fora, and join our fight against their oppression, across the world,” she said in the message.\nKarima Baloch maligned Pakistan at the United Nations’ 39th session of the Human Rights Council and maintained strong links with the Indian funded anti-Pakistan networks sponsored by the Research and Analysis Wing (RAW).\nShe was part of the `Indian Chronicles’ Srivastava Group Disinfo campaign against Pakistan, which was finally exposed by the EU DisinfoLab.\nSecurity officials believe that she served as part of the Indian Research and Analysis Wing’s (RAW) sponsored network for propaganda against Pakistan and fell victim to the clean-up, after being exposed.\nThe incident served as a trigger for the Indian media, which squarely blamed Pakistan for her death and unleashed a barrage of propaganda and fake news on news channels and social media.\nKarima Baloch aka Karima Marri or Mehrab was chosen by Mama Qadeer and made Chairperson of Baloch Students Organization-Azad (BSO-Azad), and successfully served as head of the banned terror organization BSO-Azad.",
  "retrievedAt": "2025-08-11T20:11:48.593Z"
}
