{
  "title": "Govt promises PTI written response by tomorrow - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Irfan Siddiqui says Imran’s party had agreed to wait seven working days for their answer\n• Opposition party demands immediate appointment of new chief election commissioner\n• PTI spox denies ‘rifts’ after Gandapur replaced\n\nISLAMABAD: Despite mixed signals from the PTI, the government on Sunday refused to budge from its position on talks with the opposition party, reiterating that it would present written replies to their charter of demands during the next meeting, scheduled for tomorrow (Tuesday).\n\nMeanwhile, the opposition party has demanded the immediate appointment of a new chief election commissioner, as the incumbent Sikandar Sultan Raja’s tenure came to an end on Sunday.\n\nThe PTI ‘abandoned’ the negotiation process a couple of days ago after the government side did not respond to its demand to form judicial commissions to probe the May 9, 2023 and Nov 26, 2024 protests the party had held for the release of its jailed founder Imran Khan.\n\nOn Saturday, however, PTI Secretary General Salman Akram Raja said that he had a detailed meeting with the party founder, during which the latter showed an interest in meeting the PTI negotiation committee.\n\nThe government claimed on Sunday that PTI had left the dialogue process, despite an agreement that the former would submit its response to the PTI’s demands within seven working days, meaning Jan 28.\n\n“We are not ready to be ridiculed (by announcing our replies publicly or before the media). We will present our replies before the committee in the forthcoming meeting,” asserted Senator Irfan Siddiqui, spokesperson for the government’s negotiation team, in a statement.\n\nMr Siddiqui quoted Barrister Gohar Ali Khan as saying Imran Khan had directed the party to leave the talks as the government was not sincere in forming judicial commissions.\n\n“We cannot reply (to the PTI’s demands) before the 28th. We will neither give our replies nor make any announcement regarding the [judicial] commissions before [the end of] seven days,” he added.\n\nOn the other hand, Barrister Gohar in a statement said that although PTI had quit the dialogue process, he could convince Imran Khan to again join the talks, if the government agreed to hold talks on the terms of reference (TORs) of the judicial commissions.\n\nTarnishing ECP image\n\nEarlier in the day, PTI called upon the government to immediately appoint an honest, unbiased and neutral chief election commissioner (CEC) in a transparent manner in consultation with the party to revitalise the poll watchdog’s “badly tarnished integrity” and ensure the continuity of democratic processes in the country.\n\nThe demand coincided with the ending of the tenure of CEC Sikandar Sultan Raja on Sunday.\n\nThe outgoing chief’s era left an indelible mark on the country’s electoral landscape, asserted PTI’s Central Information Secretary Sheikh Waqqas Akram in a statement.\n\nTherefore, he added, it was incumbent upon the government to ensure a timely and consensus-based appointment of the CEC as well as the provincial heads of the institution to shield it from “further destruction”.\n\nMr Akram emphasised the need for the government to constitute a parliamentary committee without any delay to oversee these appointments, as stipulated in Article 213 of the constitution.\n\nMr Akram also dismissed reports of divisions within the PTI’s Khyber Pakhtunkhwa chapter, emphasising that the party remains a cohesive and unified force under the leadership of Imran Khan.\n\nIt may be recalled that KP Chief Minister Ali Amin Gandapur, who also headed the party’s provincial chapter, was replaced by MNA Junaid Akbar Khan a day earlier.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:59:10.761Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887924/govt-promises-pti-written-response-by-tomorrow",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:23:56.000Z"
}
