{
  "title": "Prioritising workplace safety - Business - DAWN.COM",
  "author": null,
  "content": "As of January 2025, Pakistan’s occupational safety and health (OSH) landscape remains riddled with challenges, emphasising the urgent need for comprehensive reforms. Despite being a member of the International Labour Organisation (ILO) since 1947 and ratifying 36 conventions (30 of which remain in force), including the eight core conventions, Pakistan has yet to adopt critical instruments such as the Promotional Framework for Occupational Safety and Health Convention, 1985 (No. 161), and the Safety and Health in Mines Convention, 1995 (No. 176).\n\nFurthermore, Pakistan has not ratified as many as 57 ILO conventions across various sectors, underscoring the slow progress in improving workplace standards and the lives of its workforce.\n\nReliable data on workplace accidents and occupational diseases is notably scarce due to the absence of a centralised system for recording such incidents. This lack of data hampers efforts to identify trends and implement targeted interventions.\n\nGlobally, vulnerabilities across sectors, climate change, and rising occupational hazards have amplified the need for urgent action. According to the ILO, approximately 2.78 million workers die annually due to global work-related accidents or diseases, with an additional 374m non-fatal injuries reported each year.\n\nUnsafe work conditions lead to lost productivity, higher healthcare costs, and diminished quality of life for workers and their families\n\nIn Pakistan, the situation is particularly dire for the 67.25m employed workforce. The ILO has confirmed that OSH conditions in both formal and informal sectors are alarmingly poor. While official statistics are unavailable, media reports paint a grim picture.\n\nExplosions in mines, factory boiler accidents, and other workplace mishaps are frequent, causing significant fatalities and injuries. According to ILO estimates, approximately 1,136 workers in Pakistan suffer occupational injuries per 100,000 workers annually, though this figure is likely underreported due to the lack of\n\na robust data collection and monitoring system.\n\nA major factor contributing to Pakistan’s poor workplace safety record is the lack of awareness and prioritisation of OSH risks among enterprises, particularly in the organised sector. Hazardous working conditions persist due to weak enforcement of existing regulations and the absence of a national preventive safety culture. This has also contributed to lower labour productivity, with Pakistan ranking 110th out of 140 countries on the productivity index.\n\nIndustrial pollution further compounds workplace hazards, particularly in sectors like manufacturing, construction, and agriculture. For instance, the textile industry generates harmful emissions during dyeing and finishing processes, while the steel and engineering industries expose workers to dangerous levels of dust, smoke, and gases.\n\nSpecific workplace accidents, often underreported, highlight the severity of the issue. The 2012 Baldia garment factory fire in Karachi killed 258 workers and injured over 600. More recently, between 2020 and 2024, numerous boiler explosions in industrial hubs like Faisalabad, Lahore, and Karachi caused multiple fatalities and injuries. For example, a December 2024 boiler explosion in Sheikhupura killed six workers, while a similar incident in Narowal injured seven. Such recurring incidents underscore the urgent need for robust safety measures.\n\nPsychological risks and work-related stress also remain largely unaddressed. Additionally, despite being internationally banned, asbestos — an established carcinogen — continues to pose significant health risks to workers in Pakistan. Occupational diseases such as asthma, skin disorders, and musculoskeletal issues are prevalent, particularly in high-risk sectors.\n\nInternationally, the ILO has adopted over 40 labour standards addressing OSH, including the Safety and Health in Construction Convention, 1988 (No. 167), the Chemicals Convention, 1990 (No. 170), and the Prevention of Major Industrial Accidents Convention, 1993 (No. 174). However, Pakistan has yet to ratify these crucial conventions, reflecting its lack of commitment to workplace safety.\n\nDomestically, Pakistan has enacted laws such as the Pakistan Occupational Health and Safety Act 2018, alongside provincial legislation like the Sindh Occupational Safety and Health Act 2017, the Punjab Occupational Safety and Health Act 2019/2022, and the Khyber Pakhtunkhwa Occupational Safety and Health Act 2022.\n\nUnfortunately, these laws are poorly enforced, resulting in widespread noncompliance. The unorganised sector, employing two-thirds of the non-farm workforce, is particularly vulnerable due to little or no oversight.\n\nRecent developments provide some hope. Pakistan has agreed to ratify the ILO’s Safety and Health in Mines Convention, 1995 (No. 176), and the 2021 International Accord on Health and Safety in the Textile and Garment Industry is set to be extended to the country. While these steps are encouraging, they are insufficient to address systemic issues.\n\nTo improve workplace safety, Pakistan must take several critical steps. Consolidating and modernising labour laws to align with international standards, ratifying key ILO conventions, and adopting a national OSH policy are essential.\n\nA robust inspection system must be established to ensure compliance, while awareness campaigns and capacity-building initiatives should educate employers and workers on OSH. Industries must adopt safer technologies and practices, supported by government incentives like subsidies and tax breaks.\n\nGood governance is essential for achieving these goals. Empowered regulatory authorities and strict penalties for non-compliance are necessary to foster accountability. Public-private partnerships can mobilise resources and expertise to improve workplace safety.\n\nIn conclusion, workplace safety is both a moral imperative and an economic necessity. Unsafe conditions lead to lost productivity, higher healthcare costs, and diminished quality of life for workers and their families.\n\nBy prioritising workplace safety, Pakistan can protect its workforce, boost economic performance, and align itself with global labour standards. The time to act is now, as the cost of inaction is measured not only in financial losses but also in human lives.\n\nThe writer is retired chairman of the State Engineering Corporation\n\nPublished in Dawn, The Business and Finance Weekly, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6795a9d971885.gif",
  "retrievedAt": "2025-10-12T01:01:51.775Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887784/prioritising-workplace-safety",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:12.000Z"
}
