{
  "title": "Kashmiris hold protests on India’s Republic Day - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Kashmiri people took to the streets in different cities and towns of Azad Jammu and Kashmir (AJK) and in many other parts of the country on Sunday to condemn India for brazenly suppressing their democratic rights and yet observing a so-called Republic Day.\n\nIn state capital Muzaffarabad, a demonstration was jointly organised by the public sector Jammu and Kashmir Liberation Cell (JKLC) and post-1989 migrants from occupied Jammu and Kashmir at Burhan Wani Chowk.\n\nParticipants carrying banners, black flags and balloons marched from Burhan Wani Chowk to the United Nations Observer’s Office, where they submitted a resolution against Indian war crimes in the occupied territory.\n\nThe protesters burned an effigy of Indian Prime Minister Narendra Modi and tore up an Indian flag there.\n\nAJK PM urges world to hold India accountable for ‘state-sponsored terrorism’\n\nEarlier, addressing the gathering, Legislative Assembly Speaker Chaudhry Latif Akbar said Kashmiris had attempted to give peace a chance, but India’s actions proved that it was not interested in peace. “If we do not respond to the enemy with equal force, it will never come to the negotiating table,” he asserted.\n\nHe urged Pakistan’s president and premier to visit AJK on Kashmir Solidarity Day on Feb 5 to devise a strategy for the Kashmir freedom movement. “We need to transform AJK into a true base camp for the liberation of occupied Jammu and Kashmir,” he claimed. He assured the audience of unwavering commitment, vowing that no effort would be spared to take the Kashmir liberation movement to its logical conclusion.\n\nHighlighting the crucial role of youth, Speaker Akbar urged them to step forward and play a pro-active role in raising awareness about the freedom struggle and announced that the Legislative Assembly would move beyond mere resolutions to adopt a more robust and effective role in this effort.\n\nHe strongly criticised India for its illegal detention of All Parties Hurriyat Conference (APHC) leadership in occupied Jammu and Kashmir, calling for an end to this oppression.\n\n“India’s blatant human rights violations in Kashmir demand serious accountability,” he said, adding that the people of Kashmir had rejected Modi’s Hindutva agenda outright.\n\nHe praised Pakistan for consistently championing the cause of Kashmiris on international forums.\n\n‘Terrorist state’\n\nUzair Ahmed Ghazali, a prominent Kashmir refugee leader, called India ‘a terrorist state’ pointing out that the country had unleashed atrocities on unarmed Kashmiri civilians. “For the past 78 years, India has used black laws to strip Kashmiris of all democratic, political, social, and religious rights, but is falsely portraying itself as the so-called largest democracy,” he said.\n\nOther speakers also detailed the tragic situation in occupied Kashmir and the atrocities committed by Indian forces, and called upon the UNSC to fulfil its constitutional role in resolving the Kashmir issue fairly.\n\nThey appealed to justice and peace-loving nations and institutions worldwide to recognise India as a brutal state masquerading under the cloak of democracy and to intervene to halt its aggressive actions in occupied Kashmir.\n\nIn Islamabad, an anti-India demonstration was held outside the Foreign Office by the Kashmiris led by AJK PM Chaudhry Anwarul Haq, AJK cabinet members and APHC representatives.\n\nSpeaking on the occasion, Mr Haq said India was a terrorist state, which must be held accountable by the world community for its war crimes. He maintained that the Kashmir issue could not be resolved through moral, political, or diplomatic efforts alone.\n\n“It requires advancing the struggle of our ancestors and turning their vision into action by taking bold steps forward. With the grace of Allah, Azad Jammu and Kashmir will make strong defensive plans and step forward to support the struggle of their Kashmiri brethren,” he vowed.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6796d8842b90a.jpg",
  "retrievedAt": "2025-08-26T07:59:09.427Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887915/kashmiris-hold-protests-on-indias-republic-day",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:02.000Z"
}
