{
  "title": "Winter festivals end with spectacular showcase of GB’s culture - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: Two winter sports festivals, one in Astore and another in the Hunza district of the Gilgit-Baltistan region concluded on a glitzy note on Sunday amid freezing temperatures.\n\nNail-biting contests and musical performances marked the culmination of the three-day event titled, “The Frozen Fairytale Winter Feast”, in Murtazabad, Hunza.\n\nBoth male and female teams from the Ghizer district secured victories in their respective final ice hockey matches.\n\nA total of 10 male and female teams from Gilgit, Ghizer, Hunza and Nagar districts took part in ice hockey competitions. In the final contest, Ghizer defeated Gilgit 3-0 in the male category, while in the female category, they defeated Hunza by a margin of one goal.\n\nCompetitions in ice curling and ice skating were also part of the event. Locals braved the harsh weather to attend the event in thousands and enjoyed dance performances to the tunes of traditional music.\n\nStalls featuring local cuisine and handicrafts were set up by entrepreneurs to make the most of the event.\n\nThe closing ceremony of the event held at Murtazabad ice rink was attended by GB Chief Secretary Abrar Ahmed Mirza as the chief guest, alongside Special Assistant to the GB Chief Minister on Information Eiman Shah, commissioner Gilgit and Tourism Secretary Zamir Abbas.\n\nSpeaking on the occasion, GB Chief Secretary Abrar Ahmad Mirza said these initiatives will not only promote winter sports but also boost tourism in the scenic region.\n\nSeparately on Sunday, the Deosai Snow Festival concluded in the Chilum area of Astore district with a vibrant showcase of local talent.\n\nThe event was organised by the Pakistan Army to promote tourism in the snow-covered plains of Deosai and the culture of Gilgit-Baltistan.\n\nThe ceremony was attended by Force Commander Northern Areas Major General Syed Imtiaz Hussain Gillani as the chief guest along with officers of the district administration.\n\nA large number of people from different areas of the district participated in this magnificent event.\n\nStalls showcasing various cultural items, handicrafts, traditional food and dry fruits were set up.\n\nCompetitions featuring traditional sports of the area, including tug-of-war, were organised for children and youth, along with musical performances of renowned artists.\n\nParticipants said the festival not only became a way of promoting the culture of the area but also served as a source of joy and entertainment for the locals.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6796c9f112197.gif",
  "retrievedAt": "2025-08-26T07:58:44.576Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887866/winter-festivals-end-with-spectacular-showcase-of-gbs-culture",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:37.000Z"
}
