{
  "title": "India boosts domestic arms industry and looks West to pare back Russia reliance - World - DAWN.COM",
  "author": null,
  "content": "India’s efforts to pare back a longstanding reliance on Russian military hardware is bearing fruit after the courting of new Western allies and a rapidly growing domestic arms industry, analysts say.\n\nAt a time when Moscow’s military-industrial complex is occupied with the ongoing war in Ukraine, India has made the modernisation of its armed forces a top priority.\n\nThat urgency has risen in tandem with tensions between the world’s most populous nation and its northern neighbour China, especially since a deadly 2020 clash between their troops.\n\n“India’s perception of its security environment vis-a-vis China has been dramatically altered,” Harsh V Pant, of the New Delhi-based Observer Research Foundation think-tank, told AFP.\n\nRelations between the two neighbours went into freefall after the clash on their shared frontier, which killed 20 Indian and at least four Chinese soldiers.\n\n“It has sort of shaken the system and there’s a realisation that we have to do whatever is best now, and very fast,” Pant said of the incident.\n\nIndia has become the world’s largest arms importer with purchases steadily rising to account for nearly 10 per cent of all imports globally in 2019-23, the Stockholm International Peace Research Institute (SIPRI) said last year.\n\nMore is in the pipeline, with orders worth tens of billions of dollars from the United States, France, Israel and Germany in coming years.\n\nModi will be in France next month where he is expected to sign deals worth about $10 billion for Rafale fighter jets and Scorpene-class submarines, Indian media reports say.\n\nDefence minister Rajnath Singh has also promised at least $100 billion in fresh domestic military hardware contracts by 2033 to spur local arms production.\n\n“India has been traditionally an importer for decades and only switched to emphasising on indigenous manufacturing… in the last decade,” strategic affairs analyst Nitin Gokhale told AFP.\n\n“It is not easy to switch, not everything can be manufactured or produced here,” he said, saying the country lacked the ability to manufacture “high-end technology” weapons systems.\n\nBut its efforts have still seen numerous impressive milestones.\n\nThis decade India has opened an expansive new helicopter factory, launched its first homemade aircraft carrier, and conducted a successful long-range hypersonic missile test.\n\nThat in turn has fostered a growing arms export market which saw sales last year worth $2.63 billion — still a tiny amount compared to established players, but a 30-fold increase in a decade.\n\nIndia is expected in the coming weeks to announce a landmark deal to supply Indonesia’s military with supersonic cruise missiles in a deal worth nearly $450 million.\n\nThe government aims to triple this figure by 2029, with a significant chunk of the $75 billion it spent on defence last year aimed at boosting local production.\n\nIndia has deepened defence cooperation with Western countries in recent years, including in the much-feted Quad alliance with the United States, Japan and Australia.\n\nThis reorientation has helped India sign various deals to import and locally co-produce military drones, naval ships, fighter jets and other hardware with suppliers from Western countries.\n\nIt has also led to a precipitous drop in India’s share of arms from longstanding ally Russia, which supplied 76pc of its military imports in 2009-13 but only 36pc in 2019-23, according to SIPRI data.\n\nNew Delhi has nonetheless sought to maintain the delicate balance between India’s historically warm ties with Moscow while courting closer partnerships with Western nations.\n\nModi’s government has resisted pressure from Washington and elsewhere to explicitly condemn Russia’s 2022 invasion of Ukraine, instead urging both sides to the negotiating table.\n\nGokhale said that India was not in the position to abandon its relationship with Russia, which still plays an important role as a supplier of advanced weaponry including cruise missiles and nuclear submarine technology.\n\n“India has certainly spread its risks by sourcing from other countries,” he said. “But Russia remains a very important and dependable partner.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2713320797018e5.jpg",
  "retrievedAt": "2025-08-26T07:58:27.709Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888023/india-boosts-domestic-arms-industry-and-looks-west-to-pare-back-russia-reliance",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T08:44:27.000Z"
}
