{
  "title": "Fiscal potential of agricultural taxation - Business - DAWN.COM",
  "author": null,
  "content": "The taxation of Pakistan’s agricultural sector remains a contentious issue, driven by its significant contribution to the national GDP of around 24 per cent yet its disproportionately low contribution to tax revenue, amounting to less than 1pc — less than Rs4 billion of total taxes collected.\n\nAdvocates for agricultural income tax (AIT) argue it could provide a critical revenue stream, potentially addressing the country’s fiscal deficit. Generally, it is believed that agricultural income is not taxed. However, it is subject to three different forms of taxation under provincial jurisdiction: land-based tax, income-based tax, and ushr, an Islamic form of taxation on produce.\n\nThe land-based tax in the agricultural sector is levied on the area under cultivation. According to agricultural land statistics, approximately 89pc of farmers own less than 12.5 acres, exempting them from the land-based tax. These farmers collectively own 25.43m acres and cultivate 23.49m acres which are therefore exempt from the land-based tax.\n\nLand-based tax applies to about 11pc of landowners, who collectively own 27.48m acres of land but, surprisingly, cultivate only 19.13m acres. That means there is a considerable amount of uncultivated land indicating potential inefficiencies or barriers to land use.\n\nThe ownership and tenancy of agricultural land are often complex and poorly recorded, making it difficult to accurately assess tax liabilities\n\nFollowing the prevailing tax structure, land-based taxes can only generate about Rs8bn. The focus on cultivated land for taxation purposes means a large portion of land owned by landowners is not contributing to tax revenue.\n\nEvaluating the agricultural income tax indicates that the tax rates are progressive, meaning the tax rate increases with higher income brackets. This ensures that farmers with higher earnings contribute greater taxes, aligning with principles of equity and fairness. However, tax rates are too low. Although tax rates are updated in 2019, they still require another revision. We heard a lot about new revisions in the tax rate, yet there is no amendment except including livestock income into the tax net.\n\nHowever, following current tax rates, the sector’s estimated taxable potential from crop-based income is around Rs68.48bn, potentially nearing Rs100bn when livestock and commercial orchards are included. The figures are compelling, yet collecting this amount is not practical due to significant challenges.\n\nWhen there are multiple landowners, each pays AIT based on their share. This can result in taxable earnings being shifted to an exemption category due to the distribution of profits. For instance, if four people collectively earn Rs1.4m from a piece of land, they must pay Rs10,000 in AIT. However, when the earnings are divided equally, each person receives Rs350,000, which falls under the exemption category. As a result, no AIT can be collected.\n\nThe ownership and tenancy of agricultural land are often complex and poorly recorded, making it difficult to accurately assess tax liabilities. A large majority of small and medium-sized farmers do not maintain records of their produce and sales. Furthermore, most agricultural production is not conducted on a commercial basis, and many farmers do not maintain records of income and expenditure. This lack of record-keeping makes it difficult to accurately assess income levels, apply taxes appropriately, and enforce compliance.\n\nLand-based tax applies to about 11pc of landowners, who collectively own 27.48m acres but cultivate only 19.13m acres leaving a considerable portion eligible but untaxed\n\nAIT is calculated based on annual income linked to the fiscal year ending on June 30th, while the crop season concludes with the Kharif harvest in September-October. This discrepancy makes it difficult to accurately estimate annual income. Currently, there are no criteria or frameworks in place to address this issue.\n\nThe third type of tax on the agricultural sector is the ushr, an Islamic form of agricultural tax that is simpler to assess and administer. At a rate of 5pc, the potential revenue under ushr could potentially generate over Rs1.5 trillion.\n\nThe following key aspects should be considered for the effective and efficient taxation of the agriculture sector in Pakistan. Before taxing agriculture, there is a need to eliminate the minimum support price (MSP) for major agricultural produce, especially for large farmers. It’s quite strange to talk of taxation for agriculture where this sector is already running on major subsidies and different financial supports regardless of the size of landholding. MSP can be restricted to small growers only.\n\nLand-based tax should apply to both cultivated and uncultivated land; however, the rate of tax must be higher for the uncultivated land. Higher taxes on uncultivated or underutilised land could discourage wasteful practices and promote better land use. If a tax of Rs1,000 per acre is imposed on landholders who own land of more than 50 acres, it could generate an estimated revenue of Rs5.92bn.\n\nLand-based tax is not a pure site value tax on the implicit value of land; it should be based on the market value of the land.\n\nImplementing ushr is relatively easy, and this can produce significant revenue. It aligns tax obligations with both state requirements and religious principles, making it more straightforward to implement and encouraging taxpayer compliance. This revenue can then be diverted to different welfare projects.\n\nUtilising technology for better record-keeping and monitoring of agricultural activities can help streamline tax assessment and collection processes.\n\nThe author is a research fellow and a member of the Agricultural and Climate Change Research Group at the Pakistan Institute of Development Economics.\nEmail: faisalali@pide.org.pk.\n\nPublished in Dawn, The Business and Finance Weekly, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:58:58.178Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887932/fiscal-potential-of-agricultural-taxation",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:11.000Z"
}
