{
  "title": "Third-party review, extra marks likely options to end BIEK results controversy - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Opposition leader Khurshidi says traditional scrutiny procedures of no use as they only deal with re-totalling of marks, not reassessment of answer sheets • House committee to meet again on Wednesday\n\nKARACHI: The parliamentary committee of the Sindh Assembly, formed to investigate the controversial results of the Board of Intermediate Education Karachi (BIEK), is learnt to have considered different options to address the issue.\n\nInformed sources told Dawn that the committee it its maiden meeting discussed at length the options including third party assessment of the answer sheets or compensatory increase in the students’ overall percentage across the board.\n\nThey said that the students who got extremely poor percentage in the intermediate board exams in Karachi might have a ray of hope as the parliamentary committee was likely to recommend for an increase of 10 to 15 per cent to their percentage.\n\nThe sources said that the committee deliberated upon the possible ways to make up the loss of the students, many of whom had secured more than 80 to 85 per cent in matriculation, but were given less than 50 per cent marks in the intermediate exams, while several others also failed in many subjects.\n\nThe Sindh Assembly had last week formed a house committee to investigate the controversial results of the intermediate board in Karachi, accepting the demand of the opposition parties in the assembly.\n\nThe committee, headed by Education Minister Syed Sardar Shah and comprising Sadia Javed, Taha Ahmed, Shabbir Ahmed Qureshi, Yousuf Baloch, Wasim Ahmed, and Farooq Ahmed, discussed several proposals to give relief to the affected students, including assessment of their answer sheets through a third party.\n\nTalking to Dawn, the education minister said that the committee would forward its recommendation to the competent authority after deliberating upon all possible means to rectify the results.\n\nHe said that the committee as a first step had called for the report of the investigation committee constituted earlier to probe into the poor results in the intermediate exams.\n\nMr Shah said that the affected students had been advised to submit their complaints regarding poor results. “Justice will be done with the students and strict action will be taken against the officials responsible,” he added.\n\nThe sources said that the house committee was scheduled to meet again on Wednesday as it wanted to dispose of the issue by Feb 15.\n\nOpposition Leader in Sindh Assembly Ali Khurshidi, also a member of the committee, said that formation of the house committee to investigate the poor examination results was itself an ample proof of injustice meted out to the students of the city.\n\nHe said that there were severe irregularities in the examination and a committee was also formed to look into the matter last year too. “The deputy controller who was found involved in the irregularities was later elevated to the post of controller,” he said.\n\nThe leader of the Muttahida Qaumi Movement-Pakistan said that his party had first raised the issue of poor results in intermediate board in the house as a large number of the students were affected.\n\nHe said that their target was to get the affected students compensated as soon as possible as the issue had already been pending disposal lately.\n\nThe opposition leaders said that the committee would recommend to the authorities to give an increase of 10 to 20 per cent in the percentage of the affected students.\n\nHe said that the traditional scrutiny procedure for the answer sheets was of no use as it was only about re-calculating the sums of marks on the answers. “You cannot dispute the marks given by the examiner in the scrutiny of answer sheet,” he added.\n\nThe MQM-P leader said that there should be a third party assessment of the results, but added that it would be a time consuming task.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:58:57.231Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887926/third-party-review-extra-marks-likely-options-to-end-biek-results-controversy",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:24.000Z"
}
