{
  "title": "JI-sponsored multiparty event urges masses to join ‘Save Indus Movement’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "HYDERABAD: Leaders of various political parties, nationalist groups and religious entities participating in a seminar organised by Jamaat-i-Islami’s Sindh chapter on Sunday rejected the federal government’s initiative of corporate farming, proposed amendments to the Indus River System Authority Act and the plan for six new canals to be fed through the Indus River.\n\nIn its declaration, the leaders claimed that the corporate farming initiative was aimed at doling out Sindh’s lands to corporate sector and other powerful quarters.\n\nThe declaration called for holding a transparent audit by a reputed international firm for determining denial of Sindh’s share of water under the 1991 Water Accord and to verify the claim that Sindh’s share of water had been stolen between 1991 and 2025.\n\nIt resolved to lay a siege to CM House [in Karachi] if Pakistan Peoples Party didn’t give up its hypocritical policies on the projects in question.\n\nIt observed that Sindh had an agrarian economy, and apprehended that constructing the six new canals would render Sindh’s lands barren. “Every child of Sindh will resist the plan,” it warned.\n\nIt said that areas of lower Sindh, including Thatta, Sujawal, Badin and Tando Mohammad Khan, had been experiencing a chronic water shortage. Since water is not being released into sea, millions of acres of agricultural land had been devoured by sea.\n\nIt stressed that the people of Sindh, irrespective of their religious, cultural and lingual identity, must join the Darya Bachao Tehreek (Save Indus Movement). The declaration called for withdrawal of draft amendments to the Irsa Act.\n\nIt resolved to approach the judiciary as part of the ongoing peaceful movement against “dacoity over Sindh’s water share and the plan to stomach Sindh’s millions of acres in the name of corporate farming”.\n\nIt demanded that Irsa should provide Sindh its due share in the Indus water in line with the 1991 Accord; construction of Asia’s largest Sukkur Barrage should be completed transparently; adequate price of agricultural produce should be given to farmers; black-marketing of fertiliser and seeds must end; water theft should be eliminated by notifying in gazette the actual measurement of canals and watercourses; and water shortage in Karachi and Hyderabad should be put to an end.\n\nJI Sindh Emir Kashif Saeed, in his presidential address, accused PPP of facilitating federal government and other powerful quarters in the canal project.\n\nPeople of Sindh, as well as history, would never forgive PPP over its double standards on this “bargain over Sindh”, he said, and alleged that Sindh’s rulers were constantly looting its resources.\n\nThe JI leader observed that despite having resources, people of Sindh were facing starvation, and said that prosperity, trade and progress were dependent on agriculture but the province had persistently been facing water shortage.\n\nHe vowed to take the National Finance Commission (NFC), auction of Sindh’s precious lands and other issues on roads and streets, besides invoking jurisdiction of constitutional forums.\n\nSindh United Party president Syed Zain Shah termed federal government’s statistics on water “fictitious”.\n\nHe warned that prevailing unrest among people of Sindh could create issues of national integrity. He said that Sindh’s rights were being usurped on the basis of majority and power, adding that over 70m people were on one side, and the ‘power’ on the other side.\n\nSindh Taraqqi-pasand Party (STP) Chairman Dr Qadir Magsi said the Indus River was the only source of irrigation for Sindh. If more canals were created, this would turn this province a “mass graveyard”.\n\nPakistan Muslim League-Functional (PML-F) Sindh General Secretary Sardar Rahim said Pir Pagara had made it clear that he would go to any extent to safeguard Sindh’s share of water.\n\nHe added that these canals were “red line” of Sindh, and that people of Sindh would never allow anyone to cross it. He said that new canals would destroy not only lands but culture of Sindh.\n\nSindh Abadgar Board (SAB) Vice President Nadeem Shah said that water was a matter of life and death for everyone.\n\nMilli Yakjehti Council (MYC) leader and Jamiat Ulema-i-Pakistan-Noorani (JUP-N) chief Sahibzada Abul Khair Mohammad Zubair praised the JI for holding the event timely.\n\nHe said that the conspiracy to take away water was in fact a conspiracy to kill people. He also expressed his concern that dacoits of the katcha and pacca areas of Sindh were looting people.\n\nHe called for a unified struggle on these issues. He said people were dying of hunger and rulers were buying vehicles worth Rs6bn.\n\nMYC Sindh President Asad Bhutto, Sindh Qaumi Party President Nawaz Zaunr, Kissan Board’s Sindh President Quddoos Ahmadani, Majlis Wahdatul Muslimeen leader Farman Shah, Pakistan Tehreek-i-Insaf leader Khawand Bux Jahejo, Qaumi Awami Tehreek President Altaf Khaskheli, Awami Tehreek leader Ismail Khaskheli, PML-Q leader Chaudhry Mazharul Haq, Sindh Abadgar Ittehad President Zubair Talpur, Shia Ulema Council leader Moazzam Shah, columnist Dastagir Bhatti and others also expressed their views at the seminar.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6796d4e249542.gif",
  "retrievedAt": "2025-08-26T07:58:56.049Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887909/ji-sponsored-multiparty-event-urges-masses-to-join-save-indus-movement",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:24.000Z"
}
