{
  "title": "Asif, four others advance to National Snooker last-16 - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Five players including Mohammad Asif advanced to the pre-quarterfinals of the 49th National Snooker Championship following impressive victories here at the NBP Sports Complex on Sunday.\n\nBesides Asif, Mohammad Sajjad, Shahid Aftab, Sohail Shehzad and Adil A. Jabbar secured their berths in the next round.\n\nNBP’s Asif, who won the world amateur title last year, recorded a dominant 4-0 (72-41, 119(89)-0, 57-43, 70-29) win over Islamabad’s Shan Namat while department-mate Sajjad also made it through, overcoming fifth-seeded Abdul Javaid of Islamabad 4-1.\n\nDespite dropping the first frame 40-65, Sajjad mounted a strong comeback to win the next four frames, on the back of three strong breaks of 86, 88 and 69.\n\nShahid displayed exceptional skill to defeat Umair Haider 4-1 (70-62(50), 124(119)-06, 42-71, 70(56)-1, 65(50)-24). Shahid’s break of 119 in the second frame was the highlight of the match.\n\nSohail, meanwhile, downed Ahsan Javaid of Punjab 4-2 (69(63)-50, 54-78, 06-60, 94-40, 87(62)-41, 74(74)-0).\n\nSohail won the first frame before Ahsan secured the next two frames to move ahead. Sohail, though, halted Ahsan’s comeback as he upped the ante and stitched breaks of 62 and 74 to confirm his place in the last-16.\n\nBalochistan’s Adil cruised into the next round with a crushing 4-0 (71-40, 80(78)-38, 54-49, 58-14) triumph over Punjab’s Mohammad Nazeer.\n\nMeanwhile, the day’s biggest shock came when Ian Mark John of Sindh stunned defending champion Asjad Iqbal with a 4-1 (69-22, 5-63, 64-32, 68-13, 98-3) victory in their group-stage match.\n\nBabar Masih also made a century-break but his effort went in vain as he lost 4-2 to Mohammad Naseem Akhtar.\n\nIn other matches, Mohammad Hasnain of Sindh defeated Umar Naeem 4-2, and Awaisullah Munir won 4-0 against Waseem Abbas.\n\nSeveral matches ended with 4-3 scorelines, including wins for Umair Khan, Amir Shehzad, Abdullah and Umair Alam.\n\nUmair defeated Zaib Khan, Amir overcame Shahid Shafique, Abdullah edged out\n\nUmair Sodagar and Alam triumphed over S.M. Muneeb Ali\n\nZaib was again on the receiving end in Sunday’s later match as he lost to Shahid Saleem 4-2.\n\nKhizar Aziz and Mohammad Faheem were also among the victors as they recorded flawless 4-0 wins over Suleman Khan and Ali Raza, respectively.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6796ddebc18b0.gif",
  "retrievedAt": "2025-10-12T01:01:52.107Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887948/asif-four-others-advance-to-national-snooker-last-16",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:17.000Z"
}
