{
  "title": "CM Maryam warns field cops of consequences for showing poor performance - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Expressing concern at surging crime rate in Punjab, Chief Minister Maryam Nawaz reprimanded the city and district police officers for not taking preemptive measures to stop killings and control other crimes in the province, warning them that those showing below average performance would be removed from their positions.\n\nDuring a meeting attended by Punjab IGP Dr Usman Anwar, Lahore Capital City Police Officer (CCPO) Bilal Siddique Kamyana, all the city and district police officers and others from top leadership of the provincial police Additional Secretary Law & Order to Chief Minister Zeeshan Raza stressed on improvement in the crime situation.\n\nAt this, a source said CCPO Kamyana said what else the police should do as it had already brought the crime rate down by 44 percent.\n\nThe source said that the CM said she would not go by the figures, and would rather want police to improve their performance to the public’s satisfaction.\n\nShe showed her utter displeasure over the low conviction rate, particularly in drug selling and street crime cases, he said.\n\nMs Nawaz also mentioned frequent incidents of murders reported in parts of Punjab, saying she was least interested merely in crime statistics gathered by the police, adding that lives could be saved by taking preemptive measures.\n\n“I have done a lot to depoliticise the Punjab police, but still the crime is on the rise,” she was quoted as having said.\n\nShe further told the meeting that she had given “complete autonomy” to police officers in the transfer and posting matters by discouraging the interference of the MNAs and MPAs in this respect.\n\nAt this, the IGP expressed his apprehension that the chief minister was receiving more complaints from the parliamentarians regarding law and order as the police high-ups have stopped entertaining them with regard to transfers and postings of the police officers of their (parliamentarians’) choice.\n\nThe CM told the police officers that the Punjab government has so far provided the department “all they had demanded”, including hefty funds and logistic support to improve service delivery.\n\nThe official said that the CM also questioned the officers individually about their performance and mentioned the recent incidents of murder and major street crimes district-wise.\n\nIt became an embarrassing situation for many of the DPOs as they were not fully prepared to update the CM on such incidents occurring in their respective jurisdictions, the official said.\n\nHe said Ms Nawaz chided the Gujrat DPO over serious complaints of corruption and pathetic police performance in the district.\n\nSimilarly, she reprimanded the Rawalpindi CPO for being lowest with regard to performance in the Group-I, which also comprised Gujranwala, Multan and Faisalabad.\n\nShe also expressed her displeasure over the crime situation in Nankana Sahib district and told the DPO that he had consistently been showing below-average performance for the last six months or so.\n\nAbout Rahim Yar Khan, the CM said the district police performance was not up to the mark. The source says the DPO, however, tried to satisfy Ms Nawaz by pointing out that a most-wanted criminal bearing head money was killed in an “encounter” in the district. The CM, however, rejected the DPO’s claim and suggested him to focus on bring improvement in law and order as per the Key Performance Indicators (KPIs), rather than taking pride in a single incident.\n\nDuring the meeting, the CM appreciated the performance of the CPOs and DPOs of Vehari, Gujranwala, Sahiwal and Kasur for securing top positions as per the KPIs she had designed to judge the police officers’ performance.\n\nThe official said that as the additional secretary (law & order) took up the matter of police officers being ignored in award of cash reward given to five deputy commissioners for showing outstanding performance, Ms Nawaz promised that they would also get the honorarium, but warned that those failing to meet the KPIs would be transferred..\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:01:54.557Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887885/cm-maryam-warns-field-cops-of-consequences-for-showing-poor-performance",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:24:30.000Z"
}
