{
  "title": "Bangladesh hires big firms to trace $17bn missing from banks - World - DAWN.COM",
  "author": null,
  "content": "LONDON: Bangladesh’s central bank has hired three “Big Four” accounting firms — EY, Deloitte and KPMG — to audit banks it says lost $17 billion to business people close to the regime of former leader Sheikh Hasina, the Financial Times reported on Sunday, citing bank governor Ahsan Mansur.\n\nIn an interview with the newspaper, Mansur said the Bangladesh Financial Intelligence Unit had also formed 11 joint investigation teams to track down and reclaim assets it believes were bought with the funds siphoned out of the banks and to help prosecute those responsible.\n\nEY and Deloitte did not respond to requests for comment outside regular business hours. Efforts to contact KPMG for a comment through their website were not successful.\n\nMansur, who was appointed central bank governor by interim national leader Muhammad Yunus after Sheikh Hasina fled to India in August, said to the FT the investigations would look at 10 leading Bangladeshi businesses as well as the ousted former leader and her relatives.\n\nThe govt has also formed 11 joint investigation teams to track down funds allegedly siphoned out of banks by ‘people close to Hasina’\n\nMansur, a former economist at the International Monetary Fund, has been tasked with helping to stabilise Bangladesh’s economy. He is also beginning the process of recovering what he estimates is at least two trillion taka ($16.46 billion) taken from the banks during the 15 years when Hasina and her Awami League party were in power, the FT said.\n\nBanks taken over\n\nMansur told the Financial Times that several leading banks had been taken over with the help of the country’s military intelligence agency, in some cases “at gunpoint”.\n\nHe said the asset quality review was looking at six banks, in which five had shares held by S. Alam, a conglomerate headed by Singapore-based Bangladeshi tycoon Mohammed Saiful Alam.\n\n“As part of that investigation, the old MDs of these banks have been asked to take leaves of absence so that quality is unhindered and the asset review is not interfered with,” Mansur said.\n\nBangladesh’s Anti-Corruption Commission this month filed a case against several people, including two of Alam’s sons, charging them with embezzling Tk11.3bn in the form of loans. A Dhaka court ordered the seizure of several properties in connection with the case.\n\nAlam’s lawyers Quinn Emanuel Urquhart & Sullivan told the FT that he and investors in the conglomerate had “committed no wrongdoing, and they are prepared to commence legal proceedings to protect their investments in Bangladesh, if necessary”.\n\nQuinn Emanuel said Alam and the group’s investors “welcome transparency and the application of international standards”, but that Mansur’s position was conflicted as the principal driver of the Yunus government’s task force on banking sector reforms.\n\nAlam’s lawyers, who last month wrote to Yunus warning they were prepared to launch international arbitration if they could not solve their dispute with Dhaka, said accusations of money laundering, and any other allegations, against the businessman and his family were “baseless”.\n\nInternational help\n\nThe Yunus government has enlisted international help in its efforts to trace and reclaim money it claims was taken out of the country, including from the UK’s Inter­national Anti-Corruption Coordina­tion Centre and the US Treasury.\n\nThe Treasury is offering Yunus’s advisers technical assistance as Bangladesh prepares to make formal requests for legal assistance from other countries.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/27101255b334d58.jpg",
  "retrievedAt": "2025-10-12T01:01:50.466Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887979/bangladesh-hires-big-firms-to-trace-17bn-missing-from-banks",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T02:14:13.000Z"
}
