{
  "title": "Ill-fated Korean plane warned of bird strikes seconds before black box stopped recording - World - DAWN.COM",
  "author": null,
  "content": "THE ill-fated Jeju Air plane in last month’s deadly crash received a warning from air traffic control about bird activity just one minute before its black box recording stopped, the transport ministry said on Saturday.\n\nThe ministry briefed the preliminary findings to the bereaved families following its probe into the fatal crash of the low-cost carrier plane from Bang­kok that killed 179 people on board and left two survivors, in South Korea’s southwestern city of Muan on Dec 29 of last year.\n\nThe government plans to release the preliminary report by Monday, which will be sent to the Inter­national Civil Aviation Organisation, the United States, France and Thai­land, the ministry said.\n\nThe investigation committee under the ministry said surveillance footage from the time of the accident at Muan Internatio­nal Airport confirmed that the plane attempted a go-around when it hit a flock of birds.\n\nThe plane first communicated with the air traffic control tower at 8:54:43am as it was approaching for landing.\n\nThe control tower cleared it for landing on Runway 01, in the opposite direction of the runway where the accident happened.\n\nAt 8:57:50am, the control tower issued a warning to the aircraft about a potential bird strike. At 8:58:11am, the captain and first officer talked about a flock of birds flying below the aircraft.\n\nThe recording appears to have stopped at 8:58:50am, sugges-ting that the plane probably lost power after both engines were shut down due to the bird strikes.\n\nFeathers and blood, apparently of a type of winter migratory ducks, were found on both engines, the ministry said.\n\nThe pilot is believed to have declared the emergency “mayday” distress call at 8:58:56am, but this is an estimate made through synchronisation with the control tower records, as no recording of it remains in the black box, the ministry said.\n\nThe plane flew for about four minutes before landing from the opposition direction without the landing gear deployed. It rammed into a concrete localiser mound and exploded in flames at 9:02:57am.\n\nThe ministry said it will take several months to analyse flight data and cockpit voice recordings for verification.\n\nMeanwhile, the group representing the victims’ families said it decided to end the search for victims’ remains at the accident site.\n\nAuthorities have sent the remains found from the site to the national forensics institute for identification.\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:01:38.776Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887983/ill-fated-korean-plane-warned-of-bird-strikes-seconds-before-black-box-stopped-recording",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T02:14:13.000Z"
}
