{
  "title": "India, China agree to resume flights 5 years after stoppage - World - DAWN.COM",
  "author": null,
  "content": "India and China agreed in principle on Monday to resume direct flights between the two nations, nearly five years after the Covid-19 pandemic and subsequent political tensions halted them.\n\nThe announcement came after a visit to Beijing by Indian foreign ministry secretary Vikram Misri and heralds the latest signs of a thaw in the frosty ties between the world’s two most populous nations.\n\nMisri’s trip to the Chinese capital marked one of the most senior official visits since a deadly Himalayan troop clash on their shared border in 2020 sent relations into a tailspin.\n\nA statement from India’s foreign ministry said a visit by a top envoy to Beijing had yielded agreement “in principle to resume direct air services between the two countries”.\n\n“The relevant technical authorities on the two sides will meet and negotiate an updated framework for this purpose at an early date,” it said.\n\nIndia’s statement also said China had permitted the resumption of a pilgrimage to a popular shrine to the Hindu deity Krishna that had also been halted at the start of the decade.\n\nBoth sides had committed to work harder on diplomacy to “restore mutual trust and confidence” and to resolve outstanding trade and economic issues, the statement said.\n\nAround 500 monthly direct flights operated between China and India before the pandemic, according to Indian media outlet Moneycontrol.\n\nA statement from China’s foreign ministry did not mention the agreement on flight resumptions but said both countries had been working to improve ties since last year.\n\n“The improvement and development of China-India relations is fully in line with the fundamental interests of the two countries,” the Chinese statement said.\n\nIndia and China are intense rivals competing for strategic influence across South Asia. Flights between both countries were halted in early 2020 at the start of the pandemic.\n\nServices to Hong Kong eventually resumed as the public health crisis receded but not to the Chinese mainland, owing to the bitter fallout of the deadly troop clash later that year.\n\nAt least 20 Indian and four Chinese soldiers were killed in the skirmish in a remote stretch of the high-altitude borderlands along their 3,500-kilometre frontier.\n\nThe fallout from the incident saw India clamp down on Chinese companies, preventing them from investing in critical economic sectors, along with a ban on hundreds of Chinese gaming and e-commerce apps, including TikTok.\n\nBeijing and New Delhi agreed last October on a significant military disengagement at a key flashpoint of their disputed border. The accord came shortly before a rare formal meeting — the first in five years — between Chinese President Xi Jinping and Indian Prime Minister Narendra Modi.\n\nMisri’s visit to Beijing came weeks after a diplomatic tour by India’s national security adviser Ajit Doval, a key bureaucratic ally of Modi.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:58:26.172Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888059/india-china-agree-to-resume-flights-5-years-after-stoppage",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T16:31:26.000Z"
}
