{
  "title": "Love bites - Newspaper - DAWN.COM",
  "author": null,
  "content": "LOVE makes you stupid. When you fall in love (or think you have), three chemicals team up to make you lose your mind, overriding rational thought and logic and making you do things you would not ordinarily do.\n\nNow, if scientists, poets and people who regularly post emo messages on Facebook know this, you can be sure that scammers do as well. And they use this to their advantage.\n\nMeet Anne, a well-to-do 51-year-old French woman who was going through a difficult divorce with her millionaire husband. Anne was an avid Instagrammer and so, when she went on a pricey ski vacation she naturally posted the pictures online. Soon after, she was messaged by a woman claiming to be Brad Pitt’s mother. That’s right: the mother of world-famous Hollywood star, Angelina Jolie’s ex-husband Brad Pitt.\n\nA day later she gets a message from someone claiming to be Brad himself, who starts by telling Anne that he heard about her from his mother (like a good desi boy) and wanted to chat with her.\n\nAt this point, Anne was wary and quite rightly wondering why the idol of millions was messaging a random middle-aged lady on Instagram. But the faux Brad was so charming and empathetic that Anne, who needed a shoulder to cry on given her ongoing divorce, took the bait.\n\nThe scammers exploit our belief that only ‘other people’ are duped.\n\nThen came the love bombing: Pseudo Pitt was so charming, empathetic and engaging that Anne’s logical brain short-circuited and she went deeper down the rabbit hole. Recalling the chats, she said, “There are so few men who write you this kind of thing. I liked the man I was talking to. He knew how to talk to women, it was always very well done.”\n\nBut then, when Anne’s divorce was finalised and she got a whopping 775,000 euros as her settlement, ‘Brad’ dropped a bombshell: he told Anne that, unbeknownst to the world, he had been fighting a lonely battle against kidney cancer and needed money to fund the treatment. Why would multimillionaire Brad Pitt need money?\n\nWell, that’s because all his bank accounts had been sealed due to his ongoing divorce with Angelina Jolie. As proof, he also sent Anne doctored pictures of ‘Brad’ in hospital beds and undergoing surgery. In some of these incredibly badly photoshopped pics, he can be seen holding a note calling Anne his ‘wife’ and professing his love. Even at this stage Anne later said she found it strange that her purported ‘fiance’ was never free for a phone call or video chat but she went along with it, eventually sending the scammer 830,000 euros, which amounts to a whopping 24 crore Pakistani rupees.\n\nIt was only after she saw a news item of a healthy Brad Pitt dating his new girlfriend that she realised she had been had. Anne then had to be hospitalised for depression and, on release, has filed a case with the French police. ‘Find my scammer’, an organisation that does what its name implies, says that they have homed in on a group of four to five young Nigerian men who have previously scammed several women with the fake Brad Pitt approach. They had also posed as Hollywood star Keanu Reeves.\n\nWhich brings us to Katherine Goodson, a 67-year-old Californian who was approached on social media by someone posing as Keanu Reeves in 2022. Interestingly, this scammer confided in Goodson that he was wary of women who wanted to exploit him for his money, and she ended up sending him a $500 gift card to show him she wasn’t interested in his money. At this point, she realised she was being scammed and posted a warning on social media after blocking the offending account.\n\nNow get this: after that she was ap­­proached by another account claiming to be Keanu who wan­t­­ed to console her after she was scammed in his name! She fell for it, and fell in love. Goodson ended up giving away so much money to ‘Keanu’ that she is now homeless and lives in her car. Now if you’re reading this and saying ‘well, that could never happen to me!’ then you’re reacting exactly the way scammers want you to. Part of the array of psychological blind spots that these grifters exploit is our belief that things like this happen only to ‘other people’ and not to us … because we’re smarter than that, right?\n\nWrong. Over a billion dollars a year are lost to such romance scammers in the US alone, and these are just the cases where people admit to being scammed. And statistically, while more men fall prey to romance scams, women are more willing to actually send cash to people they have never met!\n\nWe all have a need to love and be loved, but the rule of thumb is that when something sounds too good to be true it usually isn’t good. Or true.\n\nThe writer is a journalist.\n\nX: @zarrarkhuhro\n\nPublished in Dawn, January 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6796e4cd6551e.jpg",
  "retrievedAt": "2025-08-26T07:58:30.642Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887963",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T01:51:17.000Z"
}
