{
  "title": "Reinforced vaccination campaign to start this week to stop new Covid variant: Asad",
  "link": "https://www.app.com.pk/national/reinforced-vaccination-campaign-to-start-this-week-to-stop-new-covid-variant-asad/",
  "date_published": "2021-11-29T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 29 (APP):Minister for Planning, Development and Special Initiatives Asad Umar on Monday said that keeping in view the impending threat of the new variant of COVID-19, the government had decided to re-intensify the vaccination campaign across the country by utilizing extra resources.\n“The vaccination process was already going on but now we are going to escalate the process and within two or three days, a reinforced vaccination campaign would start in all the provinces to minimize threat of the new variant (Omicron),” he said while addressing a press briefing here along with Special Assistant to Prime Minister on Health Dr Faisal Sultan after chairing a meeting at National Command and Operation Center.\nHe said the new variant was a very dangerous virus and it had potential to spread across the world. “What we can do is to at least delay the arrival of virus in Pakistan by taking prompt actions,” he added.\nHe said the testing process had also been slowed in the country due to the low rate of cases, but now “we are going to start testing in the high risk areas to check the virus”.\nThe minister said the government had also decided to put specific restrictions on international flights and travelers.\nHe said as per news pouring in about the the new variant, it was very dangerous but the vaccination could be proved as effective against the virus.\nAsad Umar informed that till date, some 50 million people in the country had been completely inoculated while 30 million had received first dose of the vaccine.“In order to minimize the threat of the new variant, I urge all those who had received first or no dose, to please complete the vaccination as soon as possible,” he added.\nHe said by taking prompt actions during coming few weeks, the government would be able to reduce the threat of the new virus to minimum level.\n“Vaccination, Vaccination, and Vaccination is the only way to control the disease,” the minister concluded.\nDr Faisal Sultan on the occasion said the new variant was dangerous in the sense that it had the ability to spread more rapidly than the earlier variants.",
  "retrievedAt": "2025-08-11T21:40:16.421Z"
}
