{
  "title": "PM Sharif  vows to revamp Pakistan’s economy by emulating Chinese model",
  "link": "https://www.app.com.pk/national/pm-sharif-vows-to-revamp-pakistans-economy-by-emulating-chinese-model/",
  "date_published": "2024-08-01T15:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday pledged to revamp Pakistan’s economy by emulating China’s model, with the objective of achieving similar economic success on a smaller scale.\nSpeaking to a 12-member Chinese delegation led by Wang Fukang, the prime minister said that during his recent visit to China, he requested President Xi Jinping and Prime Minister Li Qiang to send experts to Pakistan. “The goal is to model Pakistan’s economy after China’s. Today, these experts are here, and we’re confident that progress will follow soon.”\nWelcoming the delegation by emphasizing that China and Pakistan were eternal friends, with a friendship that knew no bounds, he emphasized that industrial cooperation was crucial at this time and expressed hope that it could be shifted to Pakistan.\nHe believes that joint ventures and cooperation would create a win-win situation.\nHe said the delegation’s visit was highly reassuring, and expressed hope that it would be both useful and productive for Pakistan.\nHe anticipated that it would enhance bilateral arrangements in areas such as industry, agriculture, economic zones, and help increase Pakistan’s capacity to produce agricultural items in high demand in China.\nHe noted that Pakistan could meet Chinese requirements by exporting high-quality goods and exploring opportunities in mining and minerals, IT, and export zones. He also suggested relocating certain industries to Pakistan due to China’s shift towards more advanced and sophisticated industrial ventures.\nHe stated that the federal cabinet has decided to offer free visas to Chinese citizens starting August 14, demonstrating Pakistan’s commitment. He emphasized that Sino-Pak relations were higher than the Himalayas and deeper than the oceans.\nThe delegation, comprising representatives from 10 different Chinese ministries, was visiting Pakistan to enhance cooperation across various sectors. They will provide input on Chinese investment, the second phase of China-Pakistan Economic Corridor (CPEC), and boosting Pakistani exports. Additionally, they will review and offer recommendations on IT, agriculture, industry, investment, energy, minerals, special economic zones, and communication.\nHe stated that Pakistan has implemented robust measures to ensure the safety of Chinese citizens, with Interior Minister Mohsin Naqvi and Minister for Planning, Development, and Special Initiatives Professor Ahsan Iqbal overseeing these efforts. The government was committed to maintaining stringent security and preventing any breaches. Those responsible for any harmful acts will be held accountable.\nAdditionally, he conveyed deep sorrow on behalf of his government and people for the loss of Chinese citizens in Bisham a few months ago. The Prime Minister stated that those responsible for the killings of Chinese citizens have been arrested and will get exemplary punishment.\nHe mentioned that he has held several meetings with law enforcement agencies, the Interior Secretary, and NECTA.\nSpeaking on the occasion, delegation head, Wang Fukang stated that technical cooperation would further strengthen Pak-China strategic relations and expressed gratitude to Pakistan for its hospitality.\nThe meeting was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, Minister for Interior and Narcotics Control Mohsin Naqvi, Minister for Planning, Development, and Special Initiatives Professor Ahsan Iqbal, Minister for Finance Muhammad Aurangzeb,  Federal Minister for Economic AffairsAhad Khan Cheema, Special Assistant to the Prime Minister Tariq Fatmi, Coordinator to the Prime Minister Rana Ahsan Afzam, and Chinese Ambassador to Pakistan Jiang Zaidong, along with other senior officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:18:25.408Z"
}
