{
  "title": "Iqra University’s fashion thesis collection captivates industry experts",
  "link": "https://www.app.com.pk/national/iqra-universitys-fashion-thesis-collection-captivates-industry-experts/",
  "date_published": "2024-08-01T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): Iqra University Islamabad showcased a trailblazing fashion thesis by its final-year students, who have swiftly become prominent figures in the fashion industry. This event marked the culmination of the students’ extensive research and creative exploration throughout their academic tenure at the university.\nThe innovative thesis demonstrated each student’s unique creative vision, pushing the limits of traditional fashion design. It provided insights into their evolving personal styles and creative growth over their four years in the Fashion Design program. The project not only challenged conventional fashion norms but also offered fresh perspectives on the students’ personal and professional development.\nThe unveiling ceremony was honored by the presence of distinguished diplomats and ambassadors. Ms. Irena Gancheva, Ambassador of Bulgaria to Pakistan, and Mr. Mehmet Toyran, Educational Counsellor at the Embassy of Türkiye, visited the exhibition and commended the students for their ingenuity and creative prowess.\nThe collection, comprising the work of 53 students, featured individual themes that highlighted their dedication and creativity. Each garment reflected the students’ commitment to fashion, incorporating their extensive hands-on experience gained during their four years at the university.\nAmong the key highlights of the “Final Year Thesis Spring 2024” were the innovative design concepts, developed through rigorous research and personal exploration. The collection also displayed significant cultural integration, blending various traditions with Pakistani values to create experimental and unique garments.\nA distinguished panel of fashion and creative industry experts reviewed the students’ work. The jury included Ms. Vaneeza Ahmed (Model/Actress), Ms. Shazia Kiyani (Fashion Designer), Mr. Azam Jamal (Visual Artist and Associate Professor at NCA/Former Principal of PIFD), and Aqeel Ahmed Solangi (Associate Professor and Head of Painting and Sculpture at NCA RWP). The project was supervised by Ms. Benish Rehman (Assistant Professor) and Ms. Qandeel Zahira (Adjunct Faculty).\nThis event represents a pivotal moment in the academic and professional journeys of Iqra University Islamabad’s fashion design students, setting a new benchmark for creativity and innovation in the fashion industry.",
  "retrievedAt": "2025-08-11T04:16:28.843Z"
}
