{
  "title": "Rubina Khalid emphasizes zero tolerance against misbehavior with women beneficiaries",
  "link": "https://www.app.com.pk/national/rubina-khalid-emphasizes-zero-tolerance-against-misbehavior-with-women-beneficiaries/",
  "date_published": "2024-08-01T15:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP):Chairperson Benazir Income Support Programme (BISP), Senator Rubina Khalid during her visit to the Peshawar Tehsil Office on Thursday emphasized that there will be zero tolerance against any misbehavior with the women beneficiaries.\nThe purpose of the visit was to monitor the arrangements at the office and review the facilities provided for the deserving women receiving Kafaalat and educational stipends. Rubina Khalid engaged with the beneficiaries, listened to their issues, and provided guidance, particularly to the needy and elderly women in the program.\nIn her conversation with the media, Senator Rubina Khalid reflected on the vision of Shaheed Mohtarma Benazir Bhutto for the welfare of poor women in Pakistan, which led to the establishment of BISP.\n“The program was founded by Shaheed Mohtarma Benazir Bhutto while she was in exile in Dubai and was implemented by President Asif Ali Zardari in 2008,” she recounted.\nHighlighting the transparency measures in place, she noted that BISP payment centers were set up following instructions from President Asif Ali Zardari.\nRubina Khalid also announced that President Asif Ali Zardari directed the opening of bank accounts for deserving women to streamline their access to stipends.\nStressing the importance of skill development and technical education, she stated, “Empowering women with skills and technical education is crucial for their economic independence and the overall development of our society.”\nShe called upon the media to play a proactive role in creating awareness among beneficiaries about the program’s benefits and guidelines.\nRubina Khalid issued a stern warning to beneficiaries to ignore any communication from numbers other than the official 8171 and cautioned against handing over their National Identity Cards to anyone to prevent fraud.\nShe reaffirmed BISP’s dedication to protecting the rights of women and ensuring they receive their due support with dignity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:16:48.678Z"
}
