{
  "title": "Pakistan, Indonesia share brotherly relations and mutual Sufi traditions; Envoy",
  "link": "https://www.app.com.pk/national/pakistan-indonesia-share-brotherly-relations-and-mutual-sufi-traditions-envoy/",
  "date_published": "2024-08-01T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): Acting Ambassador of Indonesia, Rahmat K on Thursday said that Pakistan and Indonesia shared brotherly relations and mutual Sufi traditions based on deep relations between our founding fathers.\nThe Acting Ambassador was addressing a seminar on “Nation-State, Islam and Democracy: Perspectives from Pakistan and Indonesia”, organized by the Embassy of the Republic of Indonesia, said a press release.\nChairman Nahdatul Ulema, Indonesia, Ulil Abshar Abdalla was chief guest on the occasion.\nThe speakers emphasized that debates on nation-state and democracy were common in academia and should be discussed. “Islamic teachings prioritize a welfare state over a specific governance form, with the rightly guided Caliphs selected through diverse methods suited to societal needs. The governance in Islam is based on clear objectives from Islamic Injunctions and laws. Islamic societies do not permit representatives to create policies against Islamic values, though concessions are allowed in exceptional circumstances,” the speakers said.\n“Pakistan, founded on Islamic principles by Quaid-e-Azam Muhammad Ali Jinnah, unites diverse cultures and ethnicities. Jinnah advocated for democracy based on Islamic ideals and principles, emphasizing discussions and consultations in state affairs. Debates on nation-state and democracy also require examining post-colonial perspectives. It is crucial to consider these epistemologies and recognize the rich history of Islam as the common denominator for addressing challenges in Muslim nation-states”, they said.\nThe Ambassador of Indonesia remarked that Pakistan and Indonesia were two largest Muslim countries having one of largest democracy. There are deep relations between our founding fathers. Indonesia always tries to take part in creating a peaceful world for all. Muslims have a duty to excel, following Quranic rules and regulations, and to educate people on true Islamic practices in daily life, he said.\nThe Ambassador said there are similarities and differences between the two countries, adding that both countries shared Sufi traditions and have brotherly relations. The teachings and essence of Islam are the same globally, he said.\nThe speakers observed that Islam was preached in Indonesia and Pakistan through Sufis, and we remained indebted to them for that. Pakistan and Indonesia together represent the largest Muslim population. If there are misconceptions about Islam, the fault lies with us. The biggest question since September 2001 is whether Islam is compatible with democracy. Indonesia serves as an example that Islam is indeed compatible with democracy. There is also the question of whether nationalism is compatible with Islam. Scholars have put forth arguments proving that Islam is compatible with nationalism. However, the concept of nationalism for Muslims is different and that is well explained by Allama Iqbal, they expressed.\nAmongst distinguished speakers were Former Caretaker Federal Law Minister, Ahmer Bilal Soofi, Ambassador (R) Tariq Osman Hyder, Adhoc Member Shariat Appellate Bench, Supreme Court Dr Qibla Ayaz Sahib, Senior Research Associate MUSLIM Institute, Kashif Aslam and Public Relations Associate MUSLIM Institute Asif Tanveer Awan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:16:26.710Z"
}
