{
  "title": "Nation to observe day of mourning on Friday to show solidarity with Palestinians",
  "link": "https://www.app.com.pk/national/pakistan-to-observe-mourning-day-tomorrow-friday-to-show-solidarity-with-palestinians/",
  "date_published": "2024-08-01T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): The government allied parties on Thursday decided that the nation would observe a day of mourning across the country on August 2 (Friday) in solidarity with the Palestinian brothers and sisters and to condemn the Israeli state-sponsored terrorism in Palestine.\nA consultative meeting of the allied parties on the deteriorating situation in Palestine, in a joint declaration, also announced that the funeral prayer in absentia for Ismail Haniyeh, chief of Hamas Political Bureau, who was assassinated in Tehran on Wednesday, would be offered by the nation after Friday prayers.\nThe meeting, which was presided over by Prime Minister Shehbaz Sharif, also decided to present a resolution in the Parliament to express full solidarity with the people of Palestine.\nThe participants of the meeting strongly condemned the ongoing Israeli brutalities in Palestine for last nine months, and expressed full solidarity with the Palestinian brothers and sisters.\nThey also expressed deep sorrow and grief over the martyrdom of Hamas leader Ismail Haniyeh.\nThey were of the view that the Hamas leader’s assassination incident was a conspiracy to sabotage the efforts to get stopped the ongoing Israeli atrocities on the Palestinians and establish peace in the region. Such incidents destroyed the world peace.\nThe prime minister termed the ongoing Israeli state-sponsored terrorism in Palestine a tragedy for the Muslim Ummah.\nThe meeting demanded to ensure immediate provision of humanitarian aid to the unarmed Palestinians.\nIt was decided that Pakistan would continue to provide relief goods, besides taking effective measures for the medical assistance of the oppressed Palestinian brothers and sisters. It was further decided that the injured Palestinians would\nbe brought to Pakistan for treatment.\nThe meeting also decided that Palestinian medical students would be admitted to medical colleges in Pakistan with financial support to continue their education.\nThe participants were of the view that with the ongoing genocide and state-sponsored terrorism in Palestine, Israel was violating the resolutions of the United Nations, the decisions of the International Court of Justice and international laws, while the world community remained a silent spectator.\nThey asked the international community to adopt a clear stand against the Israeli brutalities, as otherwise it would be a question mark against viability of international laws and institutions for future generations.\nThe meeting also urged the international community, including the United Nations to break their silence and immediately get stopped the ongoing genocide of the oppressed Palestinians by the Zionist forces and bring Israel to justice for war crimes.\nLeaders and senior representatives of Pakistan Muslim League Nawaz (PML-N), Pakistan Peoples Party (PPP), Balochistan Awami Party (BAP), Muttahida Qaumi Movement (MQM), Pakistan Muslim League-Q, Pakistan Muslim League Zia and National Party attended the meeting.",
  "retrievedAt": "2025-08-11T04:18:05.256Z"
}
