{
  "title": "Pakistani youth with innovation key to brighten future, climate resilience: Patricia Scotland",
  "link": "https://www.app.com.pk/national/pakistani-youth-with-innovation-key-to-brighten-future-climate-resilience-patricia-scotland/",
  "date_published": "2024-08-01T10:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): Secretary General, Commonwealth, Patricia Scotland on Thursday said the Pakistani youth full of rich potential in creativity and innovation are the key to brighten future and embrace climate resilience.\nShe was addressing as special guest at the Sustainable Development Policy Institute (SDPI) jointly held symposium, titled “Driving the Change: The Dynamic Role of Pakistan’s Youth and Civil Society in Climate Resilience”, in collaboration with the Prime Minister’s Youth Programme (PMYP) and the Ministry of Climate Change and Environmental Coordination here at the Pakistan Institute of Parliamentary Studies (PIPS).\nSecretary General Commonwealth, Patricia Scotland said the courage and equity of the youth would drive the future of the world amid climate crises. She said it’s the first generation to face the worst impacts of climate change and the last to take action against climate change risks.\nShe mentioned that the passion, energy, equity and knowledge at the symposium gives great hope. Commenting on her visit to National University of Sciences and Technology (NUST), she said that she had witnessed innovation, creativity and solutions that gave her joy, help and hope to fight climate crisis with the possibility of a bright future.\n“This youth bulge is the richest gold reserve in this part of the country. The Commonwealth nations represent one-third of the world whereas that demographic diversity give us a chance to grapple with the problems of tomorrow. AI will add $15.7 trillion to the global economy, and we should ensure our youth take benefit of it,” she mentioned.\nThe Commonwealth had developed a consortium with the Silicon Valley to develop an AI Academy to train the youth as mankind amid AI revolution have the chance to be master or mastered by it.\nChairman, PMYP, Rana Mashood Ahmad Khan in his keynote address commended the Commonwealth Secretary General, Patricia Scotland for forging alliances among the member nations.\nHe also commended the donors and partners for their support. “Youth empowerment is the way forward and the Prime Minister Youth Programme is running Green Youth Movement under which green clubs have been established in 137 varsities out of the total 268 universities which will be further rolled out at all educational levels,” he said.\nUnder the PMYP, he said the programme is educating youth and driving advocacy drive through them at the community level. “Youth of Pakistan has to take a stand to keep house in order. The government is going to launch the National Volunteer Corps whose logo will be launched today by the Commonwealth Secretary General,” he added.\nHe further mentioned that 200,000 youngsters would be trained under the Corps for disaster management activities due to rising natural calamities intensity and frequency throughout the country.\nIt would also engage the community at large on the lines of Green Youth Movement, he said, adding, “Youth must visit Pakistan youth portal to see government initiatives being launched for the younger generation.”\nOn the occasion, guest of honour, Prime Minister’s Coordinator for Climate Change, Romina Khurshid Alam said the symposium like forums play a crucial role in giving voice to the youth.\n“Youth of Pakistan has great will to do and are committed to achieve any task, whereas it’s important to have effective communication between parliamentarians and youth to share ideas and give voice to the younger people for solutions,” she said.\nRomina Khurshid said international youth should join hands for collective whereas the Commonwealth can play a great role in driving climate agenda.\nShe suggested the Commonwealth Secretary General to collaborate on educational scholarships imparting knowledge and exposure to talented youth to drive solutions to climate change.\nEarlier, in his welcome remarks, Executive Director, SDPI, Dr Abid Qaiyum Suleri briefed the distinguished guests that the Institute is the oldest independent think-tank of Pakistan that represents itself as a shadow government due to its collaborative role as part of the solution and guiding the government for its course correction in the strategic and policy realms of economy, climate change, food security, international relations and others.\nDr Suleri underlined that major challenge of how policies like Carbon Border Adjustment Mechanism (CBAM) will affect the future of nations like Pakistan as its exporters like other nations would be forces to share carbon emissions at every step of their export products.\nHe also highlighted that it would affect countries like Pakistan having sovereign territories like EU as its export partners.\nDr Abid Suler mentioned that Artificial Intelligence (AI) and climate change will affect the job market of the future as many present-day knowledge and disciplines will become irrelevant. However, the Commonwealth secretariat can intervene as its 56 nations that are its member to workout collaborative efforts, he added.\nHigh Commissioner Canadian High Commission, Leslie Scanlon said youth perspectives needs to be centered while considering climate action as they are the most impacted due to climate change impacts.\nShe added that the youth have the most effective and strong voices against climate inaction as they are disappointed of the role of their decision-making leaders for not addressing the vagaries of climate catastrophes effectively.\nShe added that the youth need to be supported, whereas their climate education is crucial in this regard as Population Council report highlights lack of knowledge among disaster-hit population about causes of climate change.\nResident Representative, UNDP, Samuel Rizk said its important to recognise youth role and concerns in efforts combating climate change. He said the youth interested in human security and sustainable development is important as climate change is going to be a formidable challenge in the future.\nAt the conclusion, PM’s aide, Romina Khurshid Alam, Secretary General Commonwealth, Patricia Scotland, Executive Director, SDPI, Dr Abid Qaiyum Suleri and others launched the COP in My City project.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:16:59.041Z"
}
