{
  "article_id": "2025-10-20_d622757253f2530c712cd3b9c8e6d17e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fia-handcuffs-fgeha-official-over-corruption-fraud/",
    "retrieved_at": "2025-10-20T19:00:33.560Z"
  },
  "metadata": {
    "title": "FIA handcuffs FGEHA official over corruption, fraud",
    "author": null,
    "date_published": "2025-10-20T19:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 185,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 20 (APP): Federal Investigation Agency (FIA) Islamabad Zone's Anti-Corruption Circle arrested an employee of the Federal Government Employees Housing Authority (FGEHA) on charges of corruption, fraud, and tampering with official land records.\\n\\nAn FIA official told APP on Monday that the accused, identified as Zakir Hussain, was serving as a patwari at FGEHA. His pre-arrest bail was cancelled by the Special Judge Central-II Islamabad, following which he was taken into custody.\\n\\nAccording to the FIA, the accused manipulated supplementary awards of built-up properties in Mouza Thalla Syedan (G-14/3) by fraudulently inserting fake co-owners into the revenue record. Using his official position, he unlawfully facilitated non-entitled individuals to be shown as owners, enabling them to receive compensation and plots.\\n\\nOfficials said this forgery deprived genuine owners of their rights and caused financial loss to the national exchequer. The accused has been shifted into custody, and further investigation is underway to determine the full extent of his involvement.\\n\\nThe FIA official added that the Agency remains committed to curbing corruption, misuse of authority, and protecting the rights of citizens by taking strict action against those who abuse public trust.\\n\\n",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}