{
  "title": "South African experts train IWMB staff, others on wildlife management, biodiversity preservation",
  "link": "https://www.app.com.pk/national/south-african-experts-train-iwmb-staff-others-on-wildlife-management-biodiversity-preservation/",
  "date_published": "2023-07-23T16:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP):A team of South African experts have imparted training to the IWMB staff, volunteers and ecologists and wildlife department staff of provincial institutions on wildlife management and biodiversity preservation.\nThe Islamabad Wildlife Management Board (IWMB) organized two days training session under the supervision of South African wildlife experts, said a news release issued here.\nThe officers from Punjab, Khyber Pakhtunkhwa (KP), Azad Jammu and Kashmir (AJK), Ministry of Climate Change and Environmental Coordination (MOCCC), IWMB including veterinarians, environmentalists, ecologists, volunteers and students from different universities participated in the training session.\nThe training workshop was graced by the presence of IWMB Chairperson, Rina Saeed Khan.\nIn her opening speech, the Chairperson, extended a warm welcome to all attendees, emphasized the significance of preserving such precious ecosystems and biodiversity of MHNP for future generations. Using breathtaking visuals and engaging narratives, she provided an in-depth overview of the Margalla Hills National Park (MHNP) rich biodiversity, unique geological formations, historical significance, flora and fauna.\nSenior Board Member, Waqar Zakria, in his presentation shed light on the conservation efforts undertaken by the IWMB to safeguard the park against various threats, including deforestation, illegal poaching, fire forest, illegal wood cutting, illegal encroachment and habitat destruction.\nHe commended the collective efforts of the board, local communities, and volunteer in working towards protection of MHNP. The guests and attendees gained a deeper understanding of the ecological significance of MHNP.\nDistinguished South African wildlife experts sharing their vast knowledge and experience with the participants. The main focus of the training was on wildlife management, a critical aspect of preserving and safeguarding our diverse ecosystem. Their presentations covered a wide range of topics, including best practices in wildlife management, conservation strategies, and the latest advancements in the field.\nAdditionally, the training included a session on general and specific immobilization, overview of radio telemetry, collaring, data collection game capture, drug use, care in captivity, drone usages and census survey.The participants actively engaged with the experts, asking questions and taking part in interactive discussions.\nThe training session was an excellent opportunity for professionals from different provinces of Pakistan to come together, exchange ideas, and learn from international experts. It not only strengthened their knowledge but also fostered a spirit of collaboration among participants.",
  "retrievedAt": "2025-08-11T08:58:44.580Z"
}
