{
  "title": "Heavy rains in KP resulted death of four persons, another one injured",
  "link": "https://www.app.com.pk/national/heavy-rains-in-kp-resulted-death-of-four-persons-another-one-injured/",
  "date_published": "2023-07-23T06:39:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 23 (APP): Heavy rains all across Khyber Pakhtunkhwa resulted in the death of four people while one person was injured, a report issued by Provincial Disaster Management said here Sunday.\nAccording to reports so far, 67 houses were partially damaged and 7 houses were completely damaged due to floods and rains across the province with 39 houses in Lower Chitral while 19 in Upper Chitral were partially damaged due to flood.\nOn the instructions of the Relief Department, District Administration, PDMA, Rescue 1122, Civil Defence, and related institutions are on alert, a spokesman of the Relief Department said here.\nRelief materials were provided to the affected families of Chitral Upper and a detailed assessment of the damage will be started as soon as the flood waters recede in Lower Chitral, spokesman of the Relief Department added.\nSensitive communities in Chitral Lower had already been shifted to safer places with food items (dry ration) being provided to the affected families and Dir Lower road has been cleared for traffic by the district administration.\nThe district administration mobilized heavy machinery for the speedy restoration of the roads and the road has been cleared for traffic at Koghuzi, the spokesman said. A one-way road has been opened by the district administration of Dir Upper.\nThe two-way rehabilitation of the road is in progress, he informed.\nPDMA had issued a letter to all concerned institutions and district administration besides giving on-the-spot instructions to take precautionary measures regarding rains, flash floods, urban flooding, and flooding in rivers.\nThe Rescue 1122, Monsoon Mock Exercises, Preparation and Training in progress with Rescue 1122 is conducting evacuation training in boats to deal with the possible flood situation in monsoon, said Dr. Khateer Ahmed, Director General of Rescue 1122.\nRescue 1122 presented a practical model of exercises in the Kabul River in Nowshera, Dr. Khateer Ahmed said. People trapped in the Kabul River were also rescued by boats, the official of Rescue 1122 said.\nDG 1122 said that Rescue 1122 also conducted a search by scuba diving and that Rescue 1122 is providing training to security agencies, civil defense, schools and colleges, and local people within the resources available across the province.",
  "retrievedAt": "2025-08-11T08:58:48.217Z"
}
