{
  "title": "NAB law amended to promote transparency, run affairs smoothly: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/nab-law-amended-to-promote-transparency-run-affairs-smoothly-ahsan-iqbal/",
  "date_published": "2022-06-22T11:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP): Federal Minister for Planning, Development and Special Initiatives, Ahsan Iqbal said here on Wednesday that the incumbent government believed in transparency that was why amendments were made in the National Accountability Bureau (NAB) law to run state affairs smoothly.\nAddressing a press conference along with senior Pakistan Muslim League Leader, Shahid Khaqan Abbassi, the minister said that the amendments were the same as proclaimed by the former Prime Minister Imran Khan to be necessary to run businesses and administrative systems in the country.\nThe minister said, the amendments were made keeping in view the decisions of Supreme Court, High Court and Council of Islamic Ideology adding that these high forums had directed incorporation of amendments to remove NAB law’s contradiction with constitution and law.\nHe said that Imran Khan was now trying to deceive people that the incumbent government was making the amendments for its own benefits.\nHowever, the minister said, the amendments were based on those arguments which Imran Khan himself would argue for amending the law.\nHe said that the former prime minister would argue that due to NAB law, the bureaucracy had left working and the investors were not investing as this black law was hurdle in the way.\nHe said, Imran Khan should listen his own speeches in which he had given extensive arguments in favour of these amendments.\nAhsan Iqbal said that nobody should be put behind bars without listening him/her.\nHe said, the NAB law was hurdle in running economy and systems of the country so there was need to correct it for smooth functioning of different affairs of the country.\nHe lamented that nowadays people of the country were being lectured by a person (Imran Khan), during whose government Pakistan’s ranking in corruption worsened while corruption mafias were promoted to loot and plunder.\nHe said, the negative politics of Imran Khan had been exposed as he failed to prove a single paisa of corruption in development funding of Rs 3200 billion made during PML-N tenure.\nIn addition, the previous government also failed to prove that any personal interest was involved in $29 billion China Pakistan Economic Corridor (CPEC) projects.\nHe said no corruption case was proved against Nawaz Sharif, Shehbaz Sahrif and against him (Ahsan Iqbal).\nHe said Imran Khan had failed to prove any corruption, so he should seek forgiveness from people for deceiving them during his tenure.\nHe said, Khan should be accounted for damaging the economy of the country, adding it was for the first time in history that no development fund was released during the fourth quarter of the fiscal year 2021-22\nHe said the incumbent government believed in transparent laws. One who looted should be accounted for but there should not be any political victimization, he added.",
  "retrievedAt": "2025-08-11T15:08:01.193Z"
}
