{
  "title": "Mushaal urges legal fraternity to speed up efforts to ensure safe release of Yasin",
  "link": "https://www.app.com.pk/national/mushaal-urges-legal-fraternity-to-speed-up-efforts-to-ensure-safe-release-of-yasin/",
  "date_published": "2022-06-22T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP): Mushaal Hussein Mullick, wife of jailed Kashmiri Hurriyat Leader Yasin Malik Wednesday urged the world to shun duplicity and imposed sanctions on fascist Narendra Modi-led India for trampling laws and unleashing wave of terrorism and barbarism in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nSpeaking at a seminar organized by Islamabad High Court Bar Association to condemn India and discuss the disputed judgment against JKLF chief Yasin Malik here, she thanked the Bar for holding the event to raise voice against unjust and inhuman treatment meted out to the Kashmiri leader.\nShe said that the world should build presser on Indian imposed severe sanctions or else it would be next to impossible to stop the reign of terror in the occupied valley.\nMushaal, who is Chairperson Peace and Culture Organistaion, said that it was the right time to highlight the issue of Yasin Malik’s illegal detention at every forum because he was battling for life.\nThe chairperson expressed fear that Yasin Malik was kept in death cell in isolation and they were worried about his life because notorious Indian police were known for tortured to death, as dozen of senior hurriyat leaders and young freedom fighters had already tortured to death in jails.\nShe lauded the Bar for its efforts and appealed them to accelerate their efforts and help her to fight his case at International Court of Justice, UN, EU and OIC forums.\nMushaal stated that Yasin believed in peaceful struggle; however, they implicated him in false, fabricated and concocted cases to keep him silence.\nShe said that the fascist authorities used all brutal tactics, as he was neither provided the much-needed medicines despite fast deteriorating health condition nor his counsel was allowed to meet him.\nThe Hhurriyat leader asked the legal fraternity to play their role to ensure safe release of Yasin who has been battling for life in the death cell.\nThe chairperson vowed that the brutal government can cross all limits of barbarity and inhuman acts but they could not silence the ‘voice of Kashmir’.\nMushaal said that the fascist Narendra Modi turned Kashmir into living hell for people but ironically the world observed a criminal silence in this regard.\nShe appealed the UN bodies, so-called human right organisations and world known human right activists to shun the double-standard and raised voice for Yasin Malik because he was kept in illegal detention in fake cases framed against him for his crime to raise voice for the birth right of right to self-determination of Kashmiri people.",
  "retrievedAt": "2025-08-11T15:08:00.822Z"
}
