{
  "title": "Pakistan to provide relief assistance to quake-hit Afghans: PM",
  "link": "https://www.app.com.pk/national/pakistan-to-provide-relief-assistance-to-quake-hit-afghans-pm/",
  "date_published": "2022-06-22T06:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP): Prime Minister Shehbaz Sharif on Wednesday expressed grief over the loss of lives due to the earthquake in Afghanistan and vowed to provide relief assistance to the affected people.\nHe said Pakistan would provide all possible assistance to the people of Afghanistan.”We are with our Afghan brothers and sisters in this difficult time,” he remarked.\nShehbaz said he had issued directives to the Pakistani authorities concerned to provide necessary relief assistance to the government of Afghanistan.\n“We are deeply saddened by the damage caused by the earthquake, especially in the Paktika region,” he said.\nDeeply grieved to learn about earthquake in Afghanistan, resulting in loss of innocent lives. People in Pakistan share the grief & sorrow of their Afghan brethren. Relevant authorities working to support Afghanistan in this time of need.\nThe prime minister prayed for those who lost their lives and expressed sympathy with the affected families.\nThe Foreign Office in a statement said the government and people of Pakistan extended deepest condolences and sympathies over the loss of precious lives and damage to property caused by the tragic earthquake in Paktika province of Afghanistan and its adjoining areas, and torrential floods in various provinces across the country.\n“The people of Pakistan stand in strong solidarity with their Afghan brethren in this difficult time. We have no doubt that the brotherly Afghan people will overcome the effects of this natural calamity with their characteristic resilience,” it said.\nThe FO said, “Our authorities and institutions are working to extend required assistance to Afghanistan in coordination with their relevant institutions”.",
  "retrievedAt": "2025-08-11T15:08:05.419Z"
}
