{
  "title": "President AJK says Britain and EU MPs committed to raise Kashmir issue",
  "link": "https://www.app.com.pk/national/president-ajk-says-britain-and-eu-mps-committed-to-raise-kashmir-issue/",
  "date_published": "2022-06-22T14:48:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Jun 22 (APP): Referring to his recent two weeks long visit to Britain and many European countries, Azad Jammu and Kashmir (AJK) President Barrister Sultan Mehmood Chaudhary, while counting the successes, said that many members of Britain and European Union (EU) parliaments had committed to raise their voices against human rights violation in illegally Indian occupied Jammu and Kashmir (IIOJK).\nThe members also pledged to raise their voices against unjustified conviction of Kashmiri leader Yaseen Malik, said the AJK President\nAddressing a crowded press conference here at presidency on Wednesday after returning from a foreign tour, he informed the journalists about his briefing to various forums and individuals about recent happenings in IIOJK, particularly the unjust sentence awarded to Kashmiri leader Yaseen Malik who had been sent to gallows by the Indian courts.\nHe said he had constituted a defense committee comprising top legal experts, including barristers, to plead Malik’s case in Indian higher judiciary as well as at international forums of Justice.\nHowever, he said, that AJK government was unable to take the case in international court of justice under international law as United Nations’ member countries can approach the forum for resolution of mutual disputes.\nHe said, he had earlier constituted Kashmir committees comprising British and EU parliamentarians in respective parliaments that had been dissolved after Brexit deal and had now persuaded the MPs, during his recent visit, to reconstitute the committees and persuaded the local councils as well to form all parties Kashmir committees within the councils.\nHe said he was in constant touch with US congress woman Elham Umar, who recently visited AJK while assuring him to constitute a woman Caucus in US Parliament to focus the rights of IIOJK women besides raising the issue of HR violations by the Indian forces in US congress.",
  "retrievedAt": "2025-08-11T15:07:53.898Z"
}
