{
  "title": "Leading int’l, Indian media outlets propagate Pakistan’s intrusion in Afghan internal affairs: DG ISPR",
  "link": "https://www.app.com.pk/national/leading-intl-indian-media-outlets-propagate-pakistans-intrusion-in-afghan-internal-affairs-dg-ispr/",
  "date_published": "2021-09-20T17:28:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Sep 20 (APP):Director General Inter Services Public Relations (DG ISPR) Major General Babar Iftikhar on Monday said some leading international and Indian media outlets published and aired fake news stories in an attempt to propagate Pakistan’s interference in the internal affairs of Afghanistan.\nIn an interview to a local news forum, the spokesperson of military’s media wing said the manner in which Indian journalists and media outlets spread lies regarding the Panjshir conflict exposed that they relied on fabricated and concocted information.\nMajor General Babar said Pakistan was confident that the Taliban would fulfil their commitment of not allowing any terrorist organisation to use Afghan soil against any country including Pakistan.\n“Pakistan is in constant contact with Afghan Taliban officials to protect the country’s national security,” the ISPR DG told.\nHe said the Afghan Taliban had reiterated on several occasions that they would not let any group or organisation use the Afghan soil for terror activities.\n“We have no reason to doubt their intentions, and that is why we are in constant touch with them to protect our national interest,” Major General Babar said.\nSince the Taliban, he said took control of the Afghan capital Kabul last month, Pakistan has been calling upon the international community to play its role in rebuilding the war-torn country to ensure peace and stability.\nHe added that Pakistan had also urged the Afghan Taliban to form an inclusive government comprising all ethnicities including Tajiks, Hazaras and Uzbek.\nPrime Minister Imran Khan last week also announced that he had initiated dialogue with the Taliban for an inclusive government, the ISPR DG told.\nHe said after 40 years of conflict, this inclusive effort would ensure peace and a stable Afghanistan, which was not only in the interest of Afghanistan rather the region as well.\nReplying a query, Major General Babar Iftikhar said border management was being continuously improved and it would be made completely secure in the near future.\n“Our goal has always been better management on this side of the border,” he said, adding that fencing the Pakistan-Afghan border was a major responsibility given the size of the region and other challenges.\n“Despite all the difficulties, Pakistan has completed the fencing work on 90% of the border. Border management is constantly improving and we are hopeful that it will be fully secured in the near future,” he informed.",
  "retrievedAt": "2025-08-11T21:17:13.240Z"
}
