{
  "title": "PPP delegation calls on Bilawal Zardari",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP): A high-level delegation of PPP Khyber Pakhtunkhwa led by the party’s Provincial President, Muhammad Ali Shah Bacha called on Chairman Pakistan Peoples Party Bilawal Bhutto Zardari here Wednesday.\nThe delegation included Parliamentary Leader Ahmed Karim Kundi, MPAs Ehsan Miankhel, Karamat Ullah Khan Chugharmatti, Arbab Zarak Khan and Advisor on Media and Strategy, Osama Yawar.\nDuring the meeting, the chairman was given a detailed briefing on the ongoing political, economic and administrative crisis in Khyber Pakhtunkhwa.\nThe delegation informed him about the upcoming protest rally scheduled to be held on May 26 at 2pm under the “Soobah Bachao” campaign in front of the Khyber Pakhtunkhwa Assembly.\nThe rally aims to raise a powerful public voice against alleged corruption, lawlessness, unemployment, and the incompetence of the provincial government.\nChairman PPP was apprised that the current KP government has allegedly deprived the people of basic facilities, educational institutions are deteriorating, hospitals lack essential medicines, law and order continues to worsen, and inflation and joblessness are crushing the poor. Despite these alarming conditions, the KP government remains indifferent and has failed to deliver.\nThe rally’s purpose is not only to highlight the plight of the general public but also to express solidarity with the employees who were unlawfully dismissed from their jobs by the provincial government.\nChairman PPP appreciated the efforts of the party leaders and instructed them to actively raise public issues on every forum and resist injustice with full force.\nThe PPP Khyber Pakhtunkhwa leadership reaffirmed its commitment to continue the struggle to free the province from the grip of corruption, and administrative failure.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:27:04.189Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ppp-delegation-calls-on-bilawal-zardari/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T13:19:00.000Z"
}
