{
  "title": "PM’s Green Youth Movement delegation visits AIOU",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP):A delegation from the Prime Minister’s Green Youth Movement visited Allama Iqbal Open University(AIOU) here on Wednesday with the aim of interacting with the members of the university’s “Youth Movement Club” and reviewing the club’s initiatives. The delegation was led by Kamran Shakoor, a member of the Prime Minister’s National Youth Council.\nDean of the Faculty of Sciences and the focal person of the Youth Club, Professor Dr. Sher Muhammad, briefed the delegation on the club’s activities.\nDr. Sher mentioned that a course on kitchen gardening is being offered at the university, which has seen active participation from both students and faculty members. A dedicated area within the university has been allocated for practical work, so that participants can benefit from it in their domestic lives.\nKamran Shakoor praised the efforts of the Green Youth Movement Club, AIOU stating that considering the university’s large student enrollment, it was included in the program three years ago to achieve meaningful results, which are now visibly taking shape.\nHe also highlighted government-level initiatives for the youth, noting that through the National Innovation Awards, students involved in research can receive grants of up to 3 million rupees. Additionally, a six-month training program will enhance their skills, enabling them to contribute to the country’s socio-economic development.\nChairperson of the Environmental Science Department, Dr. Sophia, also addressed the gathering. The event concluded with the distribution of certificates among the members of the Green Youth Movement Club at Allama Iqbal Open University.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:27:29.611Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pms-green-youth-movement-delegation-visits-aiou/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T12:46:00.000Z"
}
