{
  "title": "Lawmakers express concerns over Parliament Lodges, demand immediate action",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP): During the Question Hour in the National Assembly on Wednesday, members from various political parties voiced strong concerns over the persistent issues surrounding the Parliament Lodges and demanded urgent remedial action.\nResponding to a question raised by Dr. Shazia Sobia Aslam, Parliamentary Secretary Mukhtar Ahmad Malik informed the House that the Capital Development Authority (CDA) has no role in the allocation of budget and allotment of lodges. He clarified that CDA’s responsibility was limited to budget utilization as per the directions of the Parliament’s House and Library Committee.\nIn response to a supplementary question by Aamir Dogar, Deputy Speaker Syed Ghulam Mustafa Shah acknowledged that the CDA’s performance regarding the Parliament Lodges has been far from exemplary. He noted that a director and deputy director were suspended in the past due to mismanagement. He further informed that a meeting in the Planning Division is underway, and tenders will be issued once approval is granted. Currently, 51 MNAs have no official accommodation.\nPPP leader Syed Naveed Qamar suggested outsourcing lodges management, arguing that the quality could significantly improve with the current budget if handled by private firms. He added that the matter is under discussion in the Standing Committee on Finance.\nMNA Noor Alam Khan highlighted that while MNAs are paying rent and utility bills on time, employees at the lodges are receiving unnecessary perks. He criticized the inefficient deployment of nearly 200 CDA staff, stating that only two or three workers are available when called.\nHe also pointed out that the gym at the Parliament Lodges is often used by outsiders rather than elected members.\nMNA Syed Waseem said that room allotments should be based on merit. He suggested reallocating lodges from ministers who have moved to the Ministers’ Colony to MNAs currently without accommodation.\nDr. Tariq Fazal Chaudhry termed it a serious issue affecting all MNAs. He stressed that complaints about the lodges are frequent and persistent. He underscored the need to complete a construction project that has been pending since 2008 to resolve space shortages. He also highlighted that management inefficiencies are a major concern and stated that CDA can only improve performance if it receives adequate funding. He mentioned janitorial services and other maintenance issues as key management shortcomings.\nThe Deputy Speaker concluded by announcing that janitorial services at the Parliament Lodges are being outsourced in an effort to improve conditions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:27:53.544Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/lawmakers-express-concerns-over-parliament-lodges-demand-immediate-action/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T10:08:00.000Z"
}
