{
  "title": "Bangladeshi envoy urges stronger trade, cultural ties with Pakistan",
  "author": null,
  "content": "LAHORE, May 14 (APP): Bangladeshi High Commissioner to Pakistan Muhammad Iqbal Hussain Khan on Wednesday called for increasing cooperation in the areas of trade, economy, culture, health, education and people-to-people linkages for the mutual benefit of the two countries.\nAfter visiting Lahore Press Club, he was talking to the media on the current scenarios of the region and emphasised improving air linkages and shipping connections between Pakistan and Bangladesh to enhance bilateral trade as well as strengthening relations. He said there was great potential to enhance education, health, agriculture and cultural cooperation between the two brotherly countries. He called for making efforts to further increase people-to-people and cultural exchanges to bring the two countries closer.\nThe HC said that Bangladesh greatly valued its relations with Pakistan, which were based on common faith, shared history and cultural similarities. He highlighted the potential for increasing relations in the area of health tourism. He informed that Bangladeshi students were also interested in getting higher education from Pakistani universities. He said that people of both the countries are facing a challenge of direct flight, but he informed media that some of private companies are working on staring direct flights between Pakistan and Bangladesh, and soon the people of both countries would listen positive news.\nThe high commissioner also highlighted the growing trade and diplomatic relations between Bangladesh and Pakistan, stating that these ties would continue to grow stronger. In his remarks, the envoy also highlighted the need for increased cooperation between Pakistan and Bangladesh in various fields, including trade, commerce and culture. He expressed his optimism about the future of bilateral relations, citing the growing demand for direct flights between the two countries.\nHe emphasised the longstanding and friendly relations between Pakistan and Bangladesh and noted that both the countries were on a steady path of development and encouraged mutual investment in various sectors, particularly trade and industry.\nTo a question about revival of SAARC (South Asian Association for Regional Cooperation), he said that it should be revived as soon as possible and all the country should get benefits of roads, waters, trade opportunities, tourism, industry and other sectors of other nations of south Asia.\nTo another query, Iqbal said that Bangladesh is never in favour of tensions on borders, issues should be resolved through dialogue.\nMr Khan stated his delight in visiting Lahore, highlighting its rich cultural heritage and economic potential.\nLahore Press Club President Arshad Ansari, General Secretary Zahid Abid and other office-bearers were also present on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:28:18.055Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/bangladeshi-envoy-urges-stronger-trade-cultural-ties-with-pakistan/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T09:53:00.000Z"
}
