{
  "title": "Comprehensive measures underway to revive sports in Pakistan, NA informed",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP):Parliamentary Secretary Kiran Imran Dar informed the National Assembly on Wednesday that comprehensive measures are being taken to promote sports in the country, including the revival of departmental support and steps to depoliticize sports federations.\nResponding to questions from lawmakers during the Question Hour, Dar acknowledged that Pakistan’s national hockey team has failed to qualify for international events since 2012 due to internal issues within the federation. She said the government has now introduced several reforms to boost sports development, particularly hockey.\n“A model constitution for National Sports Federations has been introduced within the Pakistan Sports Board framework, and policy guidelines have been issued to ensure timely elections in various federations,” she said. “Instructions have also been provided regarding foreign tours.”\nDar noted that the Pakistan Hockey Federation received a budget of Rs. 119 million. She emphasized that efforts are being made to eliminate politics from sports organizations to improve overall performance and transparency.\nShe added that, following the 18th Amendment, sports have become a provincial subject, but the federal government continues to support athletes showing promise at international levels, including enhancing rewards for outstanding performances.\nIn response to supplementary questions from MNAs Dr. Nafisa Shah, Samina Khalid Ghurki, and Shehryar Afridi, Dar said 44 sports federations are currently active in the country and that promising talent is being nurtured through training and opportunities at the national level.\nHighlighting a recent achievement, she mentioned that Pakistan’s hockey team was runner-up in a 2024 tournament, after which the Prime Minister announced a cash reward of Rs. 1 million for each player.\nShe also confirmed that departmental sports support, which was previously discontinued, has been reinstated to provide stable platforms for athletes across various disciplines.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:28:14.653Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/comprehensive-measures-underway-to-revive-sports-in-pakistan-na-informed/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T10:13:00.000Z"
}
