{
  "title": "E-Procurement: Over 28,000 local, international firms register on PPRA platform",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP): The Public Procurement Regulatory Authority (PPRA) Managing Director Hasnat Ahmed Qureshi has announced the successful implementation of Pakistan’s e-procurement system with over 28,000 suppliers already registered, including 400 foreign firms the platform represents a significant step toward streamlined and transparent public procurement aligning with the Prime Minister’s vision for a digital and transparent economy.\nHe stated that PPRA, following a robust framework and international standards, has introduced the e-Pak Acquisition & Disposal System (e-PADS), which has automated the entire procurement process. “Thousands of vendors have already registered on this modern e-procurement platform, including foreign companies which can now register within 24 hours after verification by the Federal Board of Revenue and the Securities and Exchange Commission of Pakistan,” Qureshi added.\nMD PPRA said that suppliers can participate in public procurement from their mobile phones or laptops, and obstacles such as visiting the office and paying for tender documents have been removed. All the tasks— from procurement planning, tender submission, and bid analysis to awarding contracts—are now performed through a safe, innovative, and user-friendly online platform, he added.\nHe elucidated that e-PADS is a foolproof automated system that entirely restricts human intervention, even no individual including MD PPRA could interfere in its operations. “Regular security audits are conducted and access to records is made possible through the log system in case of complaints. This inbuilt security system and reduction of human interference is further promoting transparency and accountability, he observed.\nHe further explained that in the wake of the 18th Constitutional Amendment, procurement being a provincial subject, provinces can enact their own procurement bodies and regulation frameworks. Despite the fact, all provinces including Punjab, Sindh, and Khyber Pakhtunkhwa, are using PPRA’s e-PADS while Balochistan will adopt the platform in the coming month.\nHe apprised that internet facilities have been improved in remote areas of the country, enabling supplier’s accessibility to PPRA’s e-procurement system. If any issues arise, vendors can seek assistance from provincial and federal PPRA through its helplines, which operates from 8 AM to midnight, and can visit offices in person to resolve any complex situation, he added.\nThe Pakistan Public Procurement Regulatory Authority (PPRA) is an autonomous regulatory body formed under the PPRA Ordinance. The main objective of the body is to regulate the procurement of goods, construction, and consultancy services in government institutions under the PPRA Rules 2004 to promote transparent, efficient, and fair procurement practices.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:27:19.308Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/e-procurement-over-28000-local-international-firms-register-on-ppra-platform/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T12:44:00.000Z"
}
