{
  "title": "Dr Mukhtar for strengthening primary healthcare services",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP): Minister of State for Health, Dr. Mukhtar Bharath has emphasized the need for strengthening primary healthcare services for long-term health system sustainability.\nHe was chairing a meeting to assess and enhance healthcare services across the Islamabad Capital Territory (ICT).\nThe meeting brought together senior officials, including the Director General Health and the District Health Officer (DHO), along with key representatives from the Ministry of National Health Services.\nThe session focused on a comprehensive review of ongoing health projects and issued directives for the swift execution of upcoming initiatives.\nParticular emphasis was placed on the successful implementation of 14 upcoming medical camps in underserved union councils of ICT.\nReaffirming his commitment to healthcare reform, Dr. Bharath outlined his vision to transform Islamabad into a model city for healthcare.\n“A robust primary care system will reduce the patient load on tertiary hospitals,” he stated.\nDr. Bharath announced the development of an integrated strategy aimed at expanding Universal Health Coverage (UHC), and directed the establishment of a real-time health data system to support evidence-based decision-making and policy formulation.\nDr. Bharath directed the DHO to evaluate the operational status and service quality of Capital Development Authority (CDA) dispensaries.\nHe stressed the importance of public awareness and called for an extensive media campaign to engage communities in health initiatives.\nCommending the outsourcing of sanitation and security services, the Minister encouraged further expansion of diagnostic services through public-private partnerships.\nHe also ordered health authorities to enhance dengue prevention measures, eradicate identified hotspots, and boost routine immunization coverage to 95%.\nKey decisions of the meeting including implementation of digital reporting mechanisms in all ICT health facilities and development of a digital health services dashboard linked with the DHO ICT website for enhanced service tracking and transparency.\nThe meeting also decided formation of a Technical Working Group, scheduled to meet on May 23, to develop a strategy for health system integration, including the introduction of a “One Patient, One ID” framework.\nIt was also decided to formulate a roadmap to empower the District Health Officer, incorporating a new appointment system based on 89-day performance reviews and launch of a one-month training program for vaccinators in partnership with the Health Services Academy.\nJoint operations between the CDA and the DHO Office were also mandated to improve healthcare accessibility and outreach across the region.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:26:31.913Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/dr-mukhtar-for-strengthening-primary-healthcare-services/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T16:12:00.000Z"
}
