{
  "title": "ILO, AICS partner to promote green jobs & economic inclusion in KP",
  "author": null,
  "content": "ISLAMABAD, May 14 (APP):The International Labour Organization (ILO) and the Italian Agency for Development Cooperation (AICS) have launched a new partnership to promote just transitions and decent work in Khyber Pakhtunkhwa.\nStarting on June 2025, the three-year initiative will strengthen green skills training, support enterprise development, and expand employment opportunities—particularly for women and youth—in flood-affected districts, contributing to climate-resilient recovery and inclusive economic growth, said a press release here on Wednesday.\nThe collaboration was formalized through the signing of an agreement between Geir Tonstol, Country Director of the ILO in Pakistan, and Marilina Armellin, Ambassador of Italy to Pakistan.\nThe project will focus on equipping young women and men with green construction skills, enhancing occupational safety and health (OSH) standards, and supporting women and youth-led businesses in the eco-tourism sector.\nTitled “Just Transitions for Men, Women and Youth through Skills Training and Jobs Creation in Sustainable Construction and Eco-Tourism,” the initiative will integrate green construction modules into provincial Technical and Vocational Education and Training (TVET) institutions, support the certification of workers for domestic and overseas employment, and provide targeted enterprise development support—particularly for those often excluded from the formal labour market.\nThis includes scaling the national skills assessment and certification framework for the construction sector, helping workers access decent employment.\nMarilina Armellin, Ambassador of Italy to Pakistan, reaffirmed Italy’s commitment to supporting Pakistan’s development goals. “We are proud to support this initiative, which aligns with our priorities on climate action, gender equality, and economic empowerment. Together with ILO, we aim to strengthen livelihoods and foster sustainable development,” she added.\nGeir Tonstol, Country Director for ILO Pakistan acknowledged the generous support of the Italian Government and emphasised the significance of the initiative. “This partnership is about building resilience. By investing in skills, sustainability, and inclusive growth, we are supporting communities to recover with dignity and to participate fully in a greener, fairer economy,” he said.\nThe initiative contributes to the Government of Pakistan’s post-flood recovery strategy, supports the UN Sustainable Development Cooperation Framework, Provincial economic recovery plans and aligns with the Global Accelerator on Jobs and Social Protection.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:27:26.372Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ilo-aics-partner-to-promote-green-jobs-economic-inclusion-in-kp/",
  "dateList": "2025-05-14",
  "date_published": "2025-05-14T13:13:00.000Z"
}
