{
  "title": "Interior ministry wants NA body briefed on illegal allotment of plots in Islamabad’s NPF - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Interior has directed the National Police Foundation (NPF) and the Capital Development Authority (CDA) to arrange a briefing for the National Assembly Standing Committee on Interior about alleged illegal allotment of plots and pending projects of the NPF.\n\nAccording to a letter of the interior ministry, the NPF managing director has been asked to brief the committee “regarding illegal allotments of plots in housing schemes of the NPF.”\n\nIt may be mentioned that the NPF has reportedly allotted six plots worth Rs100 million each for Rs1.57 million to former interior secretary Aftab Akbar Durrani and six police officers, including three inspectors general (IGs).\n\nOne plot measuring a kanal was allotted to additional IG Punjab Bilal Siddique Kamyana currently posted as the Capital City Police Officer Lahore in the NPF Scheme in Sector O-9 for Rs500,000 where the market price of the plot was Rs30 million.\n\nSix plots worth Rs100m each allegedly allotted for Rs1.57m to former interior secretary, six police officers\n\nIG KP Akhtar Hayat Khan, IG Punjab Dr Usman Anwar, Sabir Ahmed, Managing Director NPF, Deputy Inspectors General Karim Khan and Syed Ali Mohsin got one kanal plot each at E-11 of Islamabad.\n\nThese officials were allotted the plots at rates fixed prior to the year 2000 when the market value of a kanal plot in E-11 was about Rs1.5 million.\n\nInterestingly, an original allottee - ex-DIG Shahid Iqbal - has approached a civil court of Islamabad against the cancellation of his plot and its subsequent allotment to NPF Director DIG Mohsin Ali.\n\nHe contended in the petition that the NFP management refused to restore his allotment.\n\nMoreover, the former secretary interior Mr Durrani was allotted the plot weeks before his retirement.\n\nAccording to a document available with Dawn, the ex-secretary a few days before his retirement issued a Statutory Regulatory Order (SRO) that gave the NPF more autonomy as it changed the composition of its board including eight directors of the foundation as members.\n\nAs per the previous SRO of the NPF, the board comprised the secretary interior, director general Federal Investigation Agency, IGs of Sindh, Punjab, Balochistan, KP, the director general Federal Security Force and the NPF managing director.\n\nThere was no provision of extension for the MD NPF in the initial SRO of 1975, however, the ex-secretary interior in the SRO 2024 made the term extendable.\n\nIt said: “The managing director shall be appointed by the federal government on deputation from amongst the serving inspectors general of police for a period of three years, extendable for another term.”\n\nInterestingly, the term of Sabir Ahmed expired on Dec 24 and insiders claimed that he was seeking an extension for another three years on the basis of these rules.\n\nIn addition to allotment of these residential plots, the NPF also disposed of a prime commercial plot at a throwaway price.\n\nThe plot measuring 5,000 square yard was allotted to a private firm M/s SMB Limited for Rs1.08 billion.\n\nThe CDA in January this year had disposed of four much smaller plots at Rs7.7 billion through an open auction.\n\nThe CDA auctioned two plots at I-8 Markaz measuring 666.66 and 800 square yards at Rs1.14 billion and Rs1.46 billion, respectively.\n\nA plot measuring 533.33 sq yard in I-14 Markaz was sold against (Rs1.225 million per sq yard) Rs653 million and a Blue Area plot in the G-8 portion, measuring 2666.66 sq yard, fetched Rs4.53 billion. It was auctioned for Rs1.7 million per sq yard.\n\nAccording to the minutes of a meeting, the board approved disposing of the plot through sealed bids instead of open auction.\n\nDuring the board meeting, Additional Inspector General of KP Mohammad Ali Babakhel opposed the disposal of commercial land through sealed bids and urged: “It would have been better if open auction under the hammer had been carried out instead of sealed bid auction.”\n\nLikewise, the director headquarters admin of the NPF Deputy Inspector General Mohammad Karim Khan was of the view that “procedure prescribed under Islamabad Land Disposal Rules (ILDR) 2005 has not been followed.”\n\nAnother official of the NPF SP Tanveerul Hassan raised multiple questions on the sealed bidding in his note of dissent and termed it against the regulations and rules applicable to the NPF.\n\nHe stated, “Sealed bid auction method adopted for auction of commercial plots is in conflict of ILDR.”\n\nHe pointed out that Rule 9 (1) of the NPF Rules stipulates “the commercial plots in the scheme shall be disposed of through the open auction to the general public for generation of funds for the welfare of the beneficiaries.”\n\nHe also questioned why a multi-purpose commercial plot was restricted for the IT sector company which according to him “resulted in lack of competition and exclusion of other bidders/firms involved in the business.”\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:00:13.655Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882289/interior-ministry-wants-na-body-briefed-on-illegal-allotment-of-plots-in-islamabads-npf",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:54.000Z"
}
