{
  "title": "CM Bugti urges national unity to combat terrorism - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Sarfraz Bugti acknowledged the significant challenge of terrorism not only in the province but across the country, emphasising that the government and security forces are making joint efforts to combat the menace.\n\nSpeaking at the passing-out parade of the Anti-Terrorist Force (ATF) on Tuesday, CM Bugti praised the force’s sacrifices in the fight against terrorism and alleged that the Indian intelligence agency RAW terrorist activities in Balochistan.\n\nThe parade marked the graduation of the 17th batch of ATF recruits who completed their training.\n\nAmong those present at the event were Balochistan Inspector General of Police (IGP) Moazzam Jah Ansari, the ATF commandant and other senior police officials.\n\nSays govt will cover educational expenses for children of martyrs\n\nOn the occasion, CM Bugti opted not to speak from behind a bulletproof podium, stating: “The day I provide our entire valiant officers with bulletproof vehicles, I will address from the bulletproof podium.”\n\nHe said terrorism is not just a challenge for Balochistan, but for the entire country.\n\nHe stressed the importance of joint efforts to eliminate terrorism from the region and noted that the government, along with security forces, is committed to this mission.\n\nHighlighting the tough conditions under which the Balochistan police operate, he paid tribute to the numerous brave officers and personnel who sacrificed their lives in the fight against terrorism. He said combating terrorism is a collective national responsibility, and not just the duty of security forces.\n\n“Terrorists in any form are condemnable, and we will bring them to justice,” CM Bugti said. He also exposed the involvement of RAW in supporting terrorist elements that target innocent civilians, educators, lawyers, and educational institutions in Balochistan. However, he assured that their efforts to destabilise the region would be thwarted through national unity.\n\nThe CM praised the ATF and Balochistan police for their frontline role in ensuring peace and security in the province.\n\nHe also announced plans to upgrade the ATF Training School, including the installation of advanced thermal cameras, renovation of its infrastructure, and the creation of new blocks dedicated to the memory of martyrs.\n\nCM Bugti reaffirmed the government’s commitment to the families of martyrs.\n\n“The martyrs live in our hearts, and we will never abandon their families. Every Pakistani is a custodian of the sacrifices made by these heroes, and ensuring their families’ welfare is our duty,” he said.\n\nHe also announced that the Balochistan government would cover the educational expenses for the children of both security personnel and civilian martyrs for the next 16 years.\n\nThe IGP, in his address, highlighted the Balochistan police’s dedication to protecting citizens’ lives and property.\n\nHe also discussed the advanced training provided to the ATF personnel to better counter emerging terrorism threats.\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:41:06.153Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882356/cm-bugti-urges-national-unity-to-combat-terrorism",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:16.000Z"
}
