{
  "title": "FBR falls Rs386bn short of revenue target - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Fe­­d­­eral Board of Revenue missed its revenue collection target by nearly Rs386 billion in the first half of the current fiscal year, as a decline in im­­p­orts and lower-than-expe­cted inflation impacted tax receipts.\n\nAccording to provisi­on­­al figures released on Tu­­esday, FBR collected Rs5.623 trillion between July and December aga­inst the target of Rs6.009tr. However, the collection is 26pc higher compared to the year-ago figure of Rs4.466tr.\n\nThe shortfall is largely attributed to reduced tax collection from imports due to a slowdown in tra­de, sluggish manufacturing growth and unexpectedly low inflation, which has dropped to single digits in recent months.\n\nDecember alone saw a gap of Rs47bn, with Rs1.326tr collected aga­inst a target of Rs1.373tr. However, this represen­t­­ed a 35pc increase compa­red to Rs984bn collected in December last year.\n\nSlowdown in imports, low inflation hamper tax collection in July-December\n\nThe government’s ove­rly ambitious revenue target of Rs12.913tr for FY25, a 40pc increase from FY24, is now backfiring. The refusal to cut expenses and the unexpected hike in the revenue target make it seem nearly impossible to achieve.\n\nThe FBR paid Rs273bn in refunds to taxpayers in the first half of the FY25, up from Rs234bn in the same period last year, representing a 16.66pc incr­e­ase. The FBR paid Rs70bn in refunds in December compared to Rs38bn in the same month last year, a reduction of 84pc.\n\nThe government belie­ves that the additional revenue of Rs3.659tr in FY25 will be achieved from three main factors. It hopes that GDP growth of 3pc, large-scale manufacturing expanding at 3.5pc with inflation at 12.9pc, and imports growing at 16.9pc will collectively yield an additional Rs1.863tr in revenue in FY25.\n\nIndependent economi­s­­ts estimate that real revenue collection in FY25 will be approximately Rs12tr.\n\nFBR Chairman Rashid Mahmood Langrial said in the second quarter, FBR achieved the hi­­gh­est tax-to-GDP ratio per quarter in the last four years. The tax-to-GDP ratio for the second quarter is 10.8pc, which surpasses the IMF target of 10.6pc.\n\nThe IMF team will visit Islamabad in late Febru­a­­ry or early March to conduct the first economic re­­view under the 37-month, $7bn EFF. The revenue shortfall is expected to be managed by adjusting au­­tonomous growth and red­ucing expenditures inst­e­­ad of introducing new taxes.\n\nIn July-December, inc­o­­me tax collections totalled Rs2.780tr, exceeding the target of Rs2.524tr by Rs256bn. The income tax collection recorded a growth of 29pc when compared with last year’s collection of Rs2.149tr.\n\nThe sales tax collection fell short of the target by Rs380bn in the first half of FY25, totalling Rs1.898tr. The sales tax collection recorded a growth of 25pc compared with last year’s collection of Rs1.514tr. The customs collection also fell short of the target by Rs155bn as its collection stood at Rs598bn during the months under review.\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6774a07e41d08.gif",
  "retrievedAt": "2025-10-12T00:41:04.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882374/fbr-falls-rs386bn-short-of-revenue-target",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:23.000Z"
}
