{
  "title": "Power tariff to edge higher despite lower fuel costs - Business - DAWN.COM",
  "author": null,
  "content": "• CPPA seeks 63 paise per unit negative FCA in January against Rs1.14 in December\n• Govt seeks early tariff rebasing, changes in peak hours\n\nISLAMABAD: The government announced on Tuesday that electricity tariffs for January 2025 will see a slight increase compared to December 2024, despite lower-than-expected fuel costs. The adjustment comes as part of an early rebasing of the national tariff regime and changes in peak and off-peak timings.\n\nAt a public hearing presided over by National Electric Power Regulatory Authority (Nepra) Chairman Waseem Mukhtar, the Central Power Purchasing Agency (CCPA) sought a negative fuel cost adjustment (FCA) of 63 paise per unit for November consumption.\n\nIt was explained that Rs1.14 per unit negative FCA applicable in December would be replaced by 63 paise negative FCA in January. Therefore, the “net increase for consumers would be 51 paise per kWh (unit)” in January.\n\nBoth Mr Mukhtar and Nepra’s tariff member Mathar Niaz Rana said the consumers were paying a heavy price for the inefficiencies of power companies. Mr Mukhtar grilled the public sector entities for an eight-month delay in the completion of Lahore-North grid facilities and mass­i­­ve underutilisation (in some cases 800 MW against 4,000 MW capacity or just 20pc ca­­pacity utilisation in November) of the Ma­­tiari-Lahore Transmission Line. Consu­m­ers pay full charges for the entire capacity.\n\nThe hearing was told that the CPPA had claimed Rs47 billion partial load adjustment charges (PLAC) — generally on account of plant availability but low demand — in 2023 and Rs56bn in 2024, including Rs2.2bn in November 2024 alone. A key reason for this was changing demand patterns in view of unaffordable tariffs and solarisation factors.\n\nNepra, therefore, ordered an enquiry into the delay in transmission project completion and a technical study by the power division to look into changes in demand patterns.\n\nMr Mukhtar said he had just received a letter from the power division for an early tariff rebasing request in January and February, under which the government also wanted changes to the time-of-use (TOU) mechanism as peak demand had shifted to late night from the current evening hours.\n\nCPPA’s Rehan Akhtar suspected that the timing of Discos’ TOU meters might not be in line with Pakistan Standard Time and should be warned to ensure factual recording and billing.\n\nMr Rana, the tariff member, pointed out that some coal-based power plants were being paid full working capital for the plant and fuel inventory going beyond 90 days despite zero plant factor and suggested that both these heads required to be rationalised to actual basis.\n\nIt was also pointed out that some of the challenges to low-capacity utilisation of local coal-based power generation were due to delays in the expansion of Thar Coal Mine, and the Sindh Coal Authority should be pushed to ensure mine expansion as per commitment.\n\nIt was pointed out that at present, the talk of conversion of imported coal-based plants to local coal for tariff reduction appeared useless. The regulator “expressed concern over the delay of mine expansion and asked the government to play its role in railway-related problems for coal transportation as well for relief to the consumers through tariff reduction.\n\nThe hearing was told that electricity demand was 6.34pc higher in November than last year, mainly because of the “warmest November in history” but overall consumption in five months was around 4pc lower.\n\nThis will be the fifth month in a row that FCAs remain negative, mainly because of substantial fuel allowances allowed by the regulator through a 20pc increase in base tariff effective from July 1, 2024. A record 82.3pc of the total power supply during No­­­­­vember flowed from domestic fuel sour­ces, almost half of that at zero fuel cost.\n\nThe CPPA claimed that the average fuel cost amounted to Rs7.23 per unit in November compared to Rs9.44 per unit in the same month last year. It said the power companies had charged Rs7.86 per unit fuel cost in November, which actually turned out to be Rs7.23 per unit, thus a refund of 63 paise per unit.\n\nIt said that about 8,032 gigawatt-hours (GWh) of electricity was generated at an estimated fuel expenditure of Rs58.49bn (Rs7.28 per unit) in November, of which 7,716 GWh was delivered to Discos at the cost of Rs55.76bn (at Rs7.23 per unit).\n\nThe biggest share of total power supply came from hydroelectric at 35.61pc compared to its 36.5pc share last year. Hydropower has no fuel cost.\n\nThe second biggest share in the national grid came from nuclear power plants at 20.61pc, followed by local coal at 12.68pc and RLNG at about 11.29pc.\n\nThe supply from coal-based generation amounted to about 19pc of the total grid supply. Of this, generation from local coal increased to 12.68pc and from imported coal to 5.94pc. Domestic gas-based power generation had a 10.68pc share.\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:00:18.477Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882375/power-tariff-to-edge-higher-despite-lower-fuel-costs",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:23.000Z"
}
