{
  "title": "Bulls celebrate new year with all-time high rally - Business - DAWN.COM",
  "author": null,
  "content": "Bulls celebrated new year at the Pakistan Stock Exchange (PSX) with a new 1,800 point rally on Wednesday, crossing the barrier of 117,000.\n\nThe KSE-100 index climbed 1544.18, or 1.34 per cent, to stand at 116,681.01 points from the previous close of 115,126.90 at 11:53am.\n\nFinally, the index closed at record-high 117,008.08, up by 1881.18 or 1.63pc. from the last close.\n\nAwais Ashraf, director reasearch at AKD Securities, said, “Expectation of interest rates dropping to single digits, with December’s inflation forecast at 4.15pc — the lowest since April 2018 — is drawing increased interest from investors.\n\n“This optimism has particularly boosted leveraged stocks, which have seen the strongest rally,” he said.\n\nNotably, he highlighted that Fauji Fertiliser Company had accounted for a quarter of the index’s gains “driven by anticipation of a significant dividend following the merger of its subsidiary, Fauji Fertiliser Bin Qasim”.\n\n“Meanwhile, banks are performing well as the removal of ADR [advance to deposit ratio]-related taxation is expected to enable them to concentrate on deposit growth, offsetting the impact of incremental taxation,” he said.\n\nFurthermore, AKD Securities noted that the stock market’s yearly perfomance could be attributed to increasing political stability and aggressive monetary easing by State Bank of Pakistan (SBP) amid stable currency.\n\n“Macroeconomic stability and a substantial drop in fixed-income yields, in the backdrop of falling commodity prices, have increased the appeal of equities,” it said. “The decline in yields was facilitated by the government’s improved debt management, supported by debt buyback initiatives and strong dividend payout by the central bank.”\n\nRegarding investor confidence, the report highlighted that it was further bolstered by mutual funds in the latter half of the year — initially demonstrated by foreign investors and insurance firms in the 1HCY24.\n\n“In the global arena, the KSE-100 Index ranked as the second-best performing market, trailing only Argentina,” it added.\n\nYesterday, despite the slight dip on the last session of the year, the KSE-100 ended 2024 with an unprecedented 84pc gain, the highest annual return in 22 years, driven by improved economic conditions and a stable political environment, the brokerage house Topline Research said.\n\nThe KSE-100’s stellar performance was powered by contributions from banks (13,847 points), fertilisers (11,169 points), and E&P (10,012 points). These sectors collectively accounted for 66pc of the index’s gains, according to Arif Habib Limited.\n\nMore to follow",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/01112819df3d8d5.jpg",
  "retrievedAt": "2025-08-26T06:00:09.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882419/bulls-celebrate-new-year-with-all-time-high-rally",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T07:01:03.000Z"
}
