{
  "title": "Peace deal ‘delayed’ as Lower Kurram reps skip jirga sitting - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR / KURRAM: A Grand Jirga working towards a peace accord that would lead to the reopening of roads in restive Kurram hit a snag on Tuesday, as two representatives from Lower Kurram were not available, delaying the solemnisation of an agreement between the warring sides.\n\nA day earlier, Barrister Muhammad Ali Saif, the spokesperson for the Khyber Pakhtunkhwa gov­ernment, had clai­med that they expected a peace accord to be signed by Tuesday.\n\nHowever, speaking to Dawn on Tuesday, he said that two jirga members, representing the Sunnis of Lower Kurram, could not reach for the meeting.\n\nBarrister Saif said that the Upper Kurram side had already signed the agreement, while both sides had also agreed to the main points of the deal. He claimed that the inking of a formal accord was a mere formality, which would be carried out once both sides met today (Wednesday).\n\nBarrister Saif says Upper Kurram has already signed agreement, expects final deal to be formally inked today\n\nEchoing the claim that one side had already sig­ned the agreement, Kur­ram Deputy Comm­issi­oner Javedullah Mehsud told Dawn that former Senator Rashid Ahmed Khan — who is one of the representatives of Lower Kurram — could not attend due to the death of a close relative.\n\nThe official said the Upper Kurram side has already signed the Kurram peace roadmap, adding that both sides would meet again on Wednesday at 11am to sign the agreement.\n\nMalik Saeed Asghar, a jirga member from Parachinar, confirmed to Dawn that they had already signed the peace agreement, but since the other side was not in full attendance on Tuesday, they would meet again on Wednesday.\n\nA day earlier, Barrister Saif had said that following the agreement, both sides have to surrender their weapons and demolish their bunkers, which would be followed by the opening of roads to Parachinar.\n\nThe main road connecting the district to the rest of the province has been closed for several weeks, resulting in a severe shortage of edibles and other commodities.\n\nAlthough the government has airlifted supplies into the region, while the Edhi Trust and other philanthropists have also lent support, the situation for those who remain cut off from the rest of the country remains dire.\n\nMoreover, the sit-in outside the Parachinar Press Club against the closure of roads continues, despite freezing conditions.\n\nA peace poetry session was also organised during the sit-in, where poets presented their works regarding peace. Similar protests are also being held in the Sultan, Gosar and Bagan areas against the closure of roads.\n\nMan killed\n\nSeparately, a man hailing from Punjab was reportedly killed in Kurram’s Sadda bazaar area on Tuesday.\n\nAccording to Kurram police, a traveller identified as Nadeem Hussain was caught by some armed men in Sadda Bazaar, who slit his throat.\n\nFormer federal minister Sajid Turi and tehsil chairman Agha Muzammil Hussain said that this was the second such incident, which occurred in spite of a ceasefire agreement. They said that if those behind the beheading of two people in Lower Kurram a few ago back had been punished, this second incident would not have happened.\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:00:33.075Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882316/peace-deal-delayed-as-lower-kurram-reps-skip-jirga-sitting",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:03.000Z"
}
