{
  "title": "Trader shot dead in suspected targeted attack in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A trader was shot dead by four assailants in a suspected targeted attack on Abul Hasan Ispahani Road on Tuesday, police said.\n\nThey identified the victim as Allah Yar, 38, who was involved in the poultry feed supply business.\n\nMobina Town SHO Mohammed Nawaz said that the victim, along with another person, was on his way to a poultry farm in his car in the small hours of Tuesday morning when four assailants riding two motorcycles signalled him to stop.\n\nHowever, he tried to speed away, but the assailants opened fire, forcing him to slow down.\n\nThe SHO said that the assailants came closer and shot him from a close range and rode away. He died on the spot.\n\nHe said that the police got significant clues, which suggested that the murder might be an outcome of some personal enmity.\n\nThe body was shifted to the Abbasi Shaheed Hospital (ASH) for medico-legal formalities.\n\nSuspect shot dead by citizen\n\nA suspected robber was shot dead by a citizen near Tahir Villa Chowrangi in Federal B Area.\n\nThe Gulberg police said that two armed robbers tried to loot a citizen, who took out his pistol and opened fire, resulting in injuries to one of the robbers and a passer-by, later identified as Adnan Amin, 28.\n\nThe police said that wounded robber died on the spot and his accomplice managed to escape.\n\nThe body and injured were shifted to the ASH for medico-legal formalities.\n\nThe police claimed to have recovered one pistol and a motorcycle from the custody of the killed suspect.\n\nMeanwhile, a young man was shot at and wounded in the SITE area on Tuesday evening.\n\nPolice identified the victim as Zafar Muhammad, 22. He was shifted to the ASH for treatment.\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:00:17.191Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882330/trader-shot-dead-in-suspected-targeted-attack-in-karachi",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:40.000Z"
}
