{
  "title": "Petrol, diesel jump; LPG becomes cheaper - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Tuesday raised the prices of petrol and high-speed diesel (HSD) by 56 paise and Rs2.96 per litre, respectively, effective immediately for the fortnight ending Jan 15.\n\nOn the other hand, the Oil and Gas Regulatory Authority (Ogra) notified a reduction in liquefied petroleum gas (LPG) prices by Rs4.01 per kg, or 1.58 per cent, for January.\n\nIn a late-night announ­cement, the Ministry of Finance said Ogra had worked out the consumer prices of petroleum products in view of the fluctuations in the international market in the last fortnight.\n\nThe ex-depot price of HSD was increased by Rs2.96 per litre (1.1pc) to Rs258.34 for the next fortnight from Rs255.38 over the past fortnight.\n\nMost of the transport sec­­tor runs on HSD. Its price is considered inflat­i­onary as it is mostly used in heavy transport vehicles, trains and agricultural engines like trucks, buses, tractors, tube wells and threshers and particularly adds to the prices of vegetables and other eatables.\n\nThe ex-depot petrol price was set at Rs255.66 per litre against Rs252.10 in the outgoing fortnight. Petrol is mostly used in private transport, small vehicles, rickshaws, and two-wheelers, and it has a direct bearing on the budget of the middle and lower-middle classes.\n\nAt present, the government charges about Rs76 per litre tax on both petrol and HSD. Although the GST is zero on all petroleum products, the government charges Rs60 per litre petroleum development levy on both products. It also charges about Rs16 per litre customs duty on petrol and HSD. In addition, about Rs17 per litre distribution and sales margins are going to oil companies and their dealers.\n\nLPG\n\nOgra notified the new price for an 11.8kg cylinder, which was Rs2,953.36 for January compared to Rs3,000.79 in December.\n\nThe oil and gas regulatorr said the LPG producer price was linked with Saudi Aramco’s contract price (CP) and the US dollar exchange rate.\n\nAs compared to the previous month, Saudi Aramco’s CP decreased by 2pc while the average dollar exchange rate slightly increased by 0.12pc, resulting in a reduction in LPG’s consumer price by Rs47.43 per cylinder (1.58pc).\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:00:31.954Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882315/petrol-diesel-jump-lpg-becomes-cheaper",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:03.000Z"
}
