{
  "title": "Govt plans to pull out of Haj operation, Senate panel told - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Onus may be shifted to private firms\n• Tour operators asked to end litigation or risk cancellation of quotas\n\nISLAMABAD: The Senate Standing Committee on Religious Affairs was informed on Tuesday that the government plans to phase out its involvement in the Haj arrangements and intends to transfer the responsibility of managing the operation to private companies, possibly in 2025.\n\nReligious Affairs Secretary Dr Zulfiqar Haider disclosed this while briefing the Senate committee about the government’s next Haj scheme.\n\nThe committee, chaired by Senator Attaullah Rehman, witnessed heated arguments between private Haj operators and the Religious Affairs Ministry officials over the quota allocated to the tour operators.\n\nResponding to the accusation by the tour operators that the government was planning to harm their business, Dr Haider said the government intends to transfer the entire responsibility of managing the Haj operations to private companies, potentially starting in 2025.\n\nThe secretary explained that the ministry had registered 904 companies for Haj operation, but following concerns conveyed by the Saudi authorities about the large number of participating entities, this number was reduced to 162.\n\n“However, Saudi Arabia expressed concerns over dealing with such high number of companies, and asked to reduce it further,” the official claimed.\n\nHe said the Saudi authorities had given their policy directive to Pakistan that each Haj operator should manage a minimum of 2,000 pilgrims.\n\nThe official apprised the meeting that a Haj quota of 179,000 had been allocated to Pakistan for 2025 by the Saudi government based on the country’s population, adding that the government had divided this number into two, with one half to be covered under the official scheme and the other by private tour operators.\n\nHe said a quota of around 90,000 had been allocated for the private Haj scheme and this quota had been divided among the selected 40-45 operators.\n\nDr Haider said that the reduction in the number of companies had to be done in compliance with the Saudi instructions, adding that they want to streamline the Haj operations.\n\nWhen the committee members inquired about the impact of reducing the number of tour operators to around 46 only, the ministry officials said a large number of tour operators had challenged the decision in a court of law.\n\nThe secretary asked the tour operators to withdraw their court cases, warning that failure to do so could result in the cancellation of their Haj quotas.\n\nThe committee was informed that around 80 complaints had been received against the private Haj scheme and 18,000 over the government’s scheme related to Haj 2024.\n\nDr Haider cautioned that any further delay in resolving the court matter could result in Saudi Arabia revoking the private Haj quotas altogether.\n\nHe suggested that the private operators should merge to avail the minimum quota of 2,000 pilgrims.\n\nPublished in Dawn, January 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:00:31.237Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882314/govt-plans-to-pull-out-of-haj-operation-senate-panel-told",
  "dateList": "2025-01-01",
  "date_published": "2025-01-01T01:59:03.000Z"
}
