{
  "title": "PDF partners with WUM to empower underprivileged students through scholarships",
  "link": "https://www.app.com.pk/national/pdf-partners-with-wum-to-empower-underprivileged-students-through-scholarships-2/",
  "date_published": "2024-09-25T14:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):The Pakistan Development Foundation (PDF) and the Women University Mardan (WUM) have inked a memorandum of understanding to provide scholarships to the deserving and underprivileged students of the varsity.\nThe agreement was signed by PDF Chairman Muhammad Bilal Sethi and WUM Acting Vice Chancellor Professor Dr Safia Ahmed. Deputy Director Office of Research, Innovation and Commercialization (ORIC) Halima Ikram and Campus Coordinator Muhammad Kamran were also present on the occasion.\nAccording to the agreement, the Foundation would also organize conferences, trainings and workshops to increase the capacity of the students and teachers from time to time. Both partners would facilitate each other in the promotion of educational and research based activities.\nThe two institutions would establish a Business Incubation Center (BIC) at the WUM, in which women entrepreneurs would be trained and supported in starting businesses. The BIC would not only support students of the varsity but wider community of the Mardan district in their entrepreneurial enterprise.\nThe PDF chairman, in his remarks, said the agreement would further enhance the shared efforts of PDF and WUM to empower women through education and research. Knowledge and skills are the basic right of women, he added.\nHe stressed that educational institutions should play a role in increasing the trend of business among students. In times when there was saturation in the jobs market the option of business and entrepreneurship for women was vital.\nThe WUM VC said the model of public-private partnership was indispensable for the improvement of teaching and learning process in universities.\nShe said the establishment of the BIC would promote entrepreneurship among female students and women of Mardan, which was a constructive initiative for their future.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:21:38.568Z"
}
