{
  "title": "Under training IB officers visit Safe City Islamabad",
  "link": "https://www.app.com.pk/national/under-training-ib-officers-visit-safe-city-islamabad/",
  "date_published": "2024-09-25T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):The under-training officers of Intelligence Bureau (IB) Academy Islamabad combined intelligence course on Wednesday visited Safe City Islamabad Capital Territory (ICT) as part of their study tour.\nAccording to a public relations officer, Senior Superintendent of Police (SSP) Safe City Muhammad Shoaib Khan welcomed the officers of Intelligence Bureau (IB) Academy Islamabad combined intelligence course, following special orders from Inspector General (IG) Police Islamabad Syed Ali Nasir Rizvi.\nHe said, the officers were informed about the various sections of Safe City Islamabad, including the Command-and-Control Center, online Women Police Station, advanced technology-equipped cameras, and the Police Operations Center Hall.\nThey were informed that the project is playing a key role in multiple departments such as the Police Operations Center, Emergency Control Center, Dispatch Control Center, Data Hub Unit, E-Challan System, and the “Pucar-15” helpline, he added.\nThey learned that Safe City Islamabad’s advanced camera systems are pivotal in preventing crime and ensuring the safety of citizens. The modern cameras help resolve 42% of crimes through the Safe City Command and Control Center, he added.\nThe officers were informed that face recognition cameras have been installed at the entry and exit points of the city which are playing an important role in identifying suspicious elements.\nThey later met with Director General (DG) Safe City Shakir Hussain Dawar and appreciated the technical capabilities of the Islamabad Police.\nThe officers expressed gratitude to DG Safe City Islamabad and his team for facilitating a successful visit.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:21:15.269Z"
}
