{
  "title": "Australian High Commissioner highlights shared history, future collaboration",
  "link": "https://www.app.com.pk/national/australian-high-commissioner-highlights-shared-history-future-collaboration/",
  "date_published": "2024-09-25T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP): Australian High Commissioner to Pakistan, Neil Hawkins, on Wednesday, in his address at Islamabad Policy Research Institute (IPRI) delved into the theme ‘Australia’s Strategic Environment and Relations with Pakistan.’\nIn his speech at IPRI’s forum ‘Diplomatic Reflections’, he highlighted the deep historical ties and future collaborative efforts between the two nations, a news release said.\nHawkins began by drawing attention to the rich history that binds Australia and Pakistan. He noted that the links between the peoples of Australia and today’s Pakistan date back more than a century. From 1860 to 1920, approximately 2,000 cameleers from Balochistan played a crucial role in exploring Australia’s deserts, transporting essential supplies to remote towns, building railways, and supporting gold mining. These Baloch cameleers also introduced Islam to Australia, constructing the country’s first mosque in Maree, South Australia, in 1884.\nThe High Commissioner also commemorated the Pakistani soldiers, then part of the British Indian Army, who served alongside Australian troops at Gallipoli during World War I.\nFormal diplomatic relations between the two countries commenced with Pakistan’s independence in 1948. Today, this partnership is underpinned by strong people-to-people links and a shared commitment to promoting gender equality and climate resilience.\nHawkins emphasized the importance of climate change and environmental hazards, noting that Australia, like Pakistan, views these issues as matters of national security. He highlighted the similarities between the two countries, both frequently affected by natural disasters such as forest fires and floods. The High Commissioner pointed out that Australia has been assisting Pakistan in addressing these challenges through knowledge-sharing and expertise in sustainable agriculture and water management.\nThis year marks the 40th anniversary of agricultural cooperation between Australia and Pakistan under the auspices of the Australian Centre for International Agricultural Research (ACIAR). Hawkins lauded the progress made from 1984 to 2024, with Australian expertise playing a pivotal role in promoting sustainable agriculture in Pakistan.\nAddressing the critical issue of water management, Hawkins expressed concern over the water table in Sindh and Punjab provinces, which is depleting by one meter each year. He underscored the importance of effective water management and sustainable agricultural practices, emphasizing Australia’s role in aiding Pakistan through knowledge-sharing initiatives. He also highlighted the need for more wastewater treatment plants, to ensure the quality of water.\nHawkins concluded by stressing that with 77 percent of Pakistan’s renewable water originating from outside its borders, better water management is vital for the country’s future. He shared insights into Australia’s experience, where farmers trade surplus water to optimize the use of this precious resource.\nTalking about the strategic environment of Australia, Neil Hawkins said that Australia’s goal was to achieve a strategic equilibrium where no country dominates or is dominated, where sovereignty is respected and for a predictable region that operates by rules and norms. He emphasised that all countries including Pakistan has a role in maintaining stability in our region.\nTo help deter conflict, protect trade routes and promote a strategic equilibrium, he noted Australia was investing in some nuclear-powered but conventionally armed submarines.\nThe High Commissioner also took questions from the audience, providing detailed responses on concerns over security, trade, and education.\nThe High Commissioner’s address was a testament to the enduring partnership between Australia and Pakistan, rooted in history and geared towards a collaborative future in addressing pressing global challenges.",
  "retrievedAt": "2025-08-10T21:20:54.797Z"
}
