{
  "title": "Efforts afoot to make Islamabad Safest City: DIG Islamabad",
  "link": "https://www.app.com.pk/national/efforts-afoot-to-make-islamabad-safest-city-dig-islamabad/",
  "date_published": "2024-09-25T15:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):Islamabad Capital Territory (ICT) police Deputy Inspector General (DIG) Syed Ali Raza on Wednesday chaired an important meeting with Saddar Zone police officers at his office.\nAccording to a police spokesperson, the meeting was attended by the Superintendent of Police (SP) Saddar Zone Hakam Khan, SDPOs, SHOs, and crime control teams.\nHe said the DIG reviewed the performance of all police officials in detail, awarding officers for good performance and issuing show-cause notices to those with poor performance.\nHe said that while issuing directions, the DIG emphasized that in the upcoming meeting, the performance of all officers will be reviewed, with no compromise on the rise of crime.\nHe said DIG Syed Ali Raza issued directives to police officials and crime control teams to prevent incidents of robbery, dacoity, and theft in their respective jurisdictions.\n“Under the supervision of the SHOs, these teams will work to arrest absconders, proclaimed offenders, target offenders, and missing gang members,” DIG said.\nSyed Ali Raza said the special teams will take effective measures to prevent criminal incidents, adding that the progress of crime control teams will be reviewed daily, he said.\nAll police officers are expected to be more proactive in combating criminal elements, he added.\nThe DIG further stated that police officers who perform well will be commended, while those showing negligence or poor performance will face departmental action, he said.\nAli Raza urged all police officers to provide facilities for citizens, stressing that the protection of citizens’ lives and property remains the top priority of Islamabad Police, and any form of negligence or incompetence will not be tolerated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:21:17.246Z"
}
