{
  "title": "Jazz,UNDP expand partnership to enhance digital literacy",
  "link": "https://www.app.com.pk/national/jazzundp-expand-partnership-to-enhance-digital-literacy/",
  "date_published": "2024-09-25T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP):Jazz, Pakistan’s leading digital operator, has solidified its commitment to advancing digital and financial literacy, driving economic empowerment, and closing the digital divide through a strategic Memorandum of Understanding (MoU) with the United Nations Development Programme (UNDP).\nThe collaboration, built on an already successful ongoing partnership, advances shared goals of inclusive development and sustainable economic growth through technology-driven solutions said a news release.\nThe MoU was signed by Aamir Ibrahim, CEO of Jazz, and Dr. Samuel Rizk, Resident Representative of UNDP. Under the MoU, Jazz and UNDP will intensify efforts to equip youth, women, and entrepreneurs from marginalized communities with essential skills for Pakistan’s digital economy. The collaboration will advance the Sustainable Development Goals (SDGs) by promoting diversity and inclusion in technology and STEM fields, and mobilizing the private sector for global sustainability.\nJazz has a long-standing partnership with UNDP, built on successful initiatives like the Jazz Youth Employment Program and the Women’s Initiative in Social Entrepreneurship (WISE) program. These programs have equipped young entrepreneurs and women with essential skills to address societal challenges, promote economic empowerment, and bridge gender gaps in entrepreneurship. In the future, this MoU may further extend the partnership into identified domains, fostering new collaborative opportunities.\nSharing his thoughts on the partnership, Aamir Ibrahim, CEO Jazz, said, “This collaboration with UNDP aligns with our purpose of enhancing the lives and livelihoods of Pakistani women and youth through technology. By integrating our technological capabilities and outreach with UNDP’s leadership in sustainable development, we are bridging the digital divide and empowering underserved communities. Together, we are creating opportunities for youth, women, and entrepreneurs to thrive in Pakistan’s digital economy with innovative solutions and impactful initiatives.”\nDr. Samuel Rizk, Resident Representative, UNDP Pakistan, highlighted the critical role of private-sector collaboration in advancing sustainable development, stating, “Through this MoU, we are unlocking new opportunities for digital transformation in Pakistan, ensuring that no one is left behind as we work toward a more equitable future for communities with limited or no digital access.”\nThe MoU also aims to support digitalization and data analytics in climate resilience, disaster prevention, early warning systems, poverty reduction, digital democracy, diversity and inclusion, and social protection. Jazz and UNDP will also address the digital divide with targeted capacity-building programs in educational and public-sector training institutions, aiming to deliver lasting social and economic impact across Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:21:19.571Z"
}
