{
  "title": "Gandhara Symposium: Salik for promotion of tolerance, unity to fight extremism, injustice",
  "link": "https://www.app.com.pk/national/gandhara-symposium-salik-for-promotion-of-tolerance-unity-to-fight-extremism-injustice/",
  "date_published": "2024-05-28T08:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 28 (APP):Minister for Religious Affairs and Interfaith Harmony Chaudhary Salik Hussain on Tuesday emphasized the concerted efforts to promote tolerance and understanding as well as unity to fight the menace of extremism posing threats to the world’s peace and security.\n“In today’s world, extremism poses one of the most potent threats to peace and security… Let us promote tolerance and understanding recognizing that our diversity is our strength. We must stand united against extremism and injustice,” the minister said addressing a symposium titled “From Gandhara to the World: The Legacy of Gandharan Buddhism” held by the Ministry of Foreign Affairs here in connection with Vesakh Day.\nThe two-day event brought together religious leaders and experts from Nepal, Sri Lanka, Thailand and Vietnam, besides scholars, diplomats, historians and art enthusiasts to provide them a platform to exchange ideas and foster connections.\nSri Lanka’s Minister for Buddhasasana, Religious and Cultural Affairs, Vidura Wikramanayaka was the guest of honor at the inaugural session, which took place earlier in the day.\nThe minister said that the diverse gathering representing different countries and cultures underscored the deep and enduring ties between the nations, besides serving as a reminder of the profound connections that unite them in shared aspirations.\nHighlighting the significance of intercultural and interfaith dialogue, Minister Salik said Vesakh festival reminded them of the profound wisdom and compassion that underpinned Buddhist teachings.\nIn his address, Minister of Buddhasasana, Religious and Cultural Affairs of Sri Lanka Vidura Wikramanayaka called for harnessing the values of Budhha and promoting cultural diplomacy to bring the people and nations together.\n“Let us make Gandhara a bridge to serve for the purpose… We have to make Gandhara a living legacy,” he remarked.\nHe said Gandhara was a focal point of human civilization from where the message of Budhha was disseminated to other parts of the world.\nHe emphasised reviving Gandhara heritage not just as a tourist attraction but rather for self-development which was the epitome of Budhha’s teachings.\nPakistan has a rich connection with Buddhism – the signs of ancient Gandhara civilization include Takshasila (Taxila), Purushapura (Peshawar), and Pushkalavati (Charsadda),\nIn her remarks, Additional Secretary Maryam Madiha Aftab said that the symposium would help deepen understanding of the Gandhara heritage and promote enduring relevance with the Gandhara world.\nShe said the event would bring together experts, scholars diplomats, historians and art enthusiasts to provide them a platform to exchange ideas and foster connections.\nBefore the symposium, Anil Sakya, Honorary Rector World Buddhist University Thailand, in his video message, had expressed the hope that the symposium would let us understand how Buddhism had developed besides enlightening the gathering more about Buddhism’s contribution to this world.\nHe said Pakistan was a seat where Buddha images first appeared in Buddhist history, adding the Gandara art had been very influential for all the Buddhists and non-Buddhists all over the world.\nThe Ministry of Foreign Affairs is organizing a symposium and an exhibition, titled “From Gandhara to the World”, on 28-29 May.\nA large number of Islamabad-based diplomats, government functionaries, scholars, artists and art-lovers are attending the event, alongside around 25 foreign delegates, including some at the Ministerial level, from Sri Lanka, Nepal, Thailand and Vietnam.\nThe event is being organized in connection with the ‘Vesak Day’, which commemorates Buddha’s birth, enlightenment and death, Foreign Office Spokesperson said in a press release.\nIt is aimed at showcasing Pakistan’s rich cultural heritage, and underscoring the importance that the government attaches to inter-faith harmony.\nA number of prominent Buddhist monks and scholars also addressed the inaugural session including Most Venerable Thich Ductuan from Vietnam, Venerable Anil Sakya from Thailand, Om Charan Amatya, scholar-cum-politician from Nepal, Stefano Davide Bettera, President, European Buddhist Union and Li Xiguang, Director, Pakistan Culture and Communication Centre, Tsinghua University, Beijing.\nA message from Venerable Dhimbulkumbure Sri Sarankara Vimaladhamma Thera, Chief Incumbent of the Ancient Rajamaha Viharaya of Kandy, Sri Lanka was also read out by Venerable Tempitiye Indawimala.\nThe subsequent sessions of the symposium explored various dimensions of Gandharan heritage that emerged, over three thousand years ago, in the northwest of Pakistan out of the interaction between Hellenistic and local philosophical and cultural traditions.",
  "retrievedAt": "2025-08-11T02:47:35.808Z"
}
