{
  "title": "Social media divide nation without strong awareness of social values: CM Bugti",
  "link": "https://www.app.com.pk/national/social-media-divide-nation-without-strong-awareness-of-social-values-cm-bugti/",
  "date_published": "2024-05-28T14:49:00.000Z",
  "source": "APP",
  "content": "QUETTA, May 28 (APP):Balochistan Chief Minister Mir Sarfraz Ahmed Bugti on Tuesday said that social media has divided our nation without strong awareness of social values and created a gap between the state and the youth through wrong narrative.\nHe said that the process of dialogue would continue with the youth and were ready to engage with the youth in every forum.\nHe expressed these views while addressing the closing ceremony of the13th National Workshop Balochistan.\nThe Chief Minister said that all kinds of conspiracies against Pakistan would be foiled, the monster of terrorism, conspiracies were made to divide the nation on religious and linguistic basis while the forces and the nation have foiled all kinds of plots against the country through national unity.\nHe said that in a healthy society, it was the democratic right of everyone to have individual opinion while personal opinion must be measured against ground realities and the scale of truth and any popular narrative should be verified in depth.\nHe said that the world went towards the social media platform after prior preparation, but we entered the era of social media without any conscious preparation, which had negative effects directly on social values which were of the moment. He said that we would not leave our youth alone and could listen to them at every level and measures would be taken to address their problems for interest of the province.\nThe CM said that through the National Workshop Balochistan, the concept of Balochistan has been effectively clarified at the national level which was positive sign of the province saying that the participants of all the provinces involved in this workshop were aware of the ground realities of Balochistan.\nHe said that the provincial government would provide all possible support and cooperation to continue such positive activities.\nAt the end of the ceremony, Chief Minister Balochistan also gave certificates to the participants of the workshop.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:47:52.329Z"
}
