{
  "title": "Marriyum blasts Imran for lame excuses for avoiding appearances in courts",
  "link": "https://www.app.com.pk/national/marriyum-blasts-imran-for-lame-excuses-for-avoiding-appearances-in-courts/",
  "date_published": "2023-02-28T06:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Tuesday castigated Pakistan Tehreek-e-Insaf Chairman Imran Khan for his lame excuses for not appearing in courts.\nIn a statement, the minister said that the courts continue asking about Imran’s whereabouts but he continued to evade.Marriyum said that the ” foreign agent” was appealing to the banking court for granting bail. In the Tosha Khana case, charges are to be framed against him, yet he refused to appear.She said if Imran Khan fails to appear in courts, he should be arrested so that his desire to fill the jail will also be fulfilled.\nShe said, “If Nawaz Sharif could appear in court with his daughter on daily basis, why Imran Khan could not appear with Bushra and Farah Gogi?” She said Imran Khan should realise that in his difficult time, Bushra Bibi and Farah Gogi left him alone to face court cases.\nShe said that “watch thief and foreign agent” should answer why Tosha Khana gifts were stolen and why did he sell the watch with an image of the Holy Kaaba.\nMarriyum asked Imran to appear in court and tell why did Bushra Bibi sell Tosha Khana’s diamond necklaces.He should also tell the court why foreign agents used charity money in politics, she said.\nThe minister said that Khan should also answer why they used their employees’ private accounts for money laundering.\nHe should also answer why Shaukat Khanum Hospital charity money was invested in the private housing society.“Why did Imran take millions of dollars from the Wootton cricket club and why that charity money was invested in politics?”She asked Imran to tell the nation why foreign funding was used against the country.",
  "retrievedAt": "2025-08-11T06:13:41.707Z"
}
