{
  "title": "Imran Khan arrested in ‘biggest corruption case of Pakistan’s history’: SAPM Tarar",
  "link": "https://www.app.com.pk/national/imran-khan-arrested-in-biggest-corruption-case-of-pakistans-history-sapm-tarar/",
  "date_published": "2023-05-09T17:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 09 (APP):Special Assistant to the Prime Minister on Interior and Legal Affairs Attaullah Tarar on Tuesday said Pakistan Tehreek-e-Insaf Chairman Imran Khan was arrested in the Al-Qadir Trust case, the biggest corruption case in the history of Pakistan.\nAddressing a press conference, he alleged that the PTI chief indulged in corruption and corrupt practice during his government, besides misuse of power and his arrest was not a surprise move rather it was the result of months-long investigations by the National Accountability Bureau (NAB).\nAtta Tarar claimed that Imran Khan used his influential position to retrieve 190 million pounds for a property tycoon, which was confiscated by the British National Crime Agency on money laundering charges. In return, the property tycoon gifted the state-owned land of 458 kanals to the Al-Qadir Trust.\nThe trust deed of Al-Qadir Trust had the signatures of Zulfi Bukhari, Babar Awan, Bushra Bibi and Imran Khan, he added.\nHe further claimed that Imran Khan should have been arrested a long time ago for his involvement in corruption in the Al-Qadir Trust case and selling gifts stolen from the Toshakhana.\nThe SAPM expressed his doubts about the nature of the social services rendered by the Al-Qadir Trust, which received a total of Rs 180 million in its different accounts, in addition to the precious land transferred in its name. There was a nexus among the persons sitting in the Prime Minister’s House at that time, who established a bogus trust to launder money and in return get hundreds of kanals of land from the property tycoon.\nHe accused Imran Khan of ignoring various NAB notices served to him in the Al-Qadir Trust case and not cooperating with the anti-graft institution. On the contrary, he said, the Pakistan Muslim League-Nawas leaders had to visit courts and relevant offices multiple times for investigation into the fake cases instituted against them.\nResponding to a question, Atta Tarar confirmed that Malik Riaz was the property tycoon referred to by him in the press conference. NAB served notices to Malik Riaz and the PTI leaders, including Asad Umar and Fawad Chaudhry, but none of them showed up for investigations, he added.\nThe SAPM warned the PTI protestors of strict action for indulging in unlawful activity. Only a few PTI supporters were protesting over the arrest of their leader, and vandalizing public and private properties, and they would be treated as per the law, he warned.\nHe called for trying Imran Khan under Article 6, and legal consultation in that regard was underway.",
  "retrievedAt": "2025-08-11T08:27:46.790Z"
}
