{
  "title": "BISP extending financial assistance to 9mln deserving families",
  "link": "https://www.app.com.pk/national/bisp-extending-financial-assistance-to-9mln-deserving-families/",
  "date_published": "2023-05-09T17:00:00.000Z",
  "source": "APP",
  "content": "MURREE, May 09 (APP):Federal Minister for Poverty Alleviation and Social Safety / Chairperson BISP, Ms. Shazia Marri on Tuesday said Benazir Income Support Program is providing financial support to nine million underprivileged families across the country.\nShe was speaking at a three-day 1st Annual National Social Protection Conference in collaboration with GIZ, a German organization, World Bank and Asian Development Bank in Murree.\nThe representatives of BISP’s development partners and international agencies, senior level officials of the Federal and provincial governments took part in the conference.\nShe said, “We need to discuss the adotive social protection and address the challenges being faced by poor because every disastrous situation mostly affects poorest of the poor in every society. We need to build our capacity and to work for the building immune system of most vulnerable population of the society.”\nShe hoped the conference would help to come up with ways to contribute towards adoptive social protection in a more concerted and sustainable way.\nShe further said that she believes in stronger federating units and urged the provinces not only to work with BISP but also to be resilient in response to shocks being faced by their people because there are still so many people who needs to be covered and urged upon the provinces to work together for this greater cause.\nThe participants were divided in 3 groups; one to deliberate on Federal-Provincial collaboration for strengthening social registries and integrated social information system.\nAnother group discussed to workout the resilience, adoptive social protection, and linking social protection & climate change, and the Federal-Provincial collaboration for an efficient social protection system.\nThe presentations were given by Dr Shireen Mustafa Secretary Social Welfare Department, Government of Sindh, Dr Mehwish Qalbani of Rehabilitation Department, Sindh & Ali Shehzad CEO of PSPA, and Dr Samina Khalil of Applied Economic Research Centre, respectively. Dr Franz von Roenne project lead of SP-SHP of GIZ moderated the days’ sessions.\nThe Conference participants discussed the challenges being faced by the vulnerable and poor of the society and came up with suggestions for the Federal and Provencal collaboration for an efficient social protection.\nYusuf Khan Secretary Ministry of Poverty Alleviation & Social Safety, Dr Tahir Noor, Additional Secretary, BISP, Naveed Akbar, DG, NSER of BISP, Ms. Johanna Knoess senior expert on social protection of GIZ, Omer Bin Zia senior project officer Asian Development Bank, Ms. Melis U. Guven lead economist social protection and jobs of the World Bank and others took active part in the deliberations of second day.",
  "retrievedAt": "2025-08-11T08:27:50.711Z"
}
