{
  "title": "Rana Sana asks stakeholders to immediate resolve flour shortage in KP",
  "link": "https://www.app.com.pk/national/rana-sana-asks-stakeholders-to-immediate-resolve-flour-shortage-in-kp/",
  "date_published": "2023-05-09T11:30:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, May 09 (APP):Interior Minister Rana Sanaullah on Tuesday directed the concerned quarters and all stakeholders to immediately resolve the flour shortage in Khyber Pakhtunkhwa and warned that no further delay would be tolerated.\nChairing a high level meeting here at the Cabinet room on wheat, sugar, flour, fertilizer smuggling, he directed the Federal Secretary for National Food Security and Research Zafar Hassan, KP Secretary Food Abid Wazir and Punjab Food Secretary Muhammad Zaman Watto to resolve the issue without any delay.\nHe also asked the provincial government to chalk out a mechanism for uninterrupted supply of flour and wheat in the market.\nHe said as per the directives of Prime Minister Shehbaz Sharif there would be no compromise on uninterrupted supply of flour and wheat to masses, adding that the KP government should immediately take 100,000 metric ton stock of wheat from PASCO.\nHe further directed the police not to stop flour supply for domestic purpose from Punjab to KP.\nEarlier, KP Chief Secretary Nadeem Aslam Chaudhry, Secretary Home Khyber Pakhtunkhwa Abid Majeed and KP IGP Akhtar Hayat Khan briefed the minister regarding the availability of flour, wheat, sugar, and fertilisers in the province and preventive measures against smuggling and hoarding.\nThe chief secretary told the minister about shortage of wheat quota of KP and urged for an increase it to cater with the prevailing demand of the province.\nHe said that the current wheat and flour shortage in the province could not be addressed without extended cooperation of the Punjab government.\nThe minister expressed his satisfaction over the steps being taken by the provincial government to curb the smuggling and hoarding.\nA detailed discussion was also held regarding shortage of flour and wheat in Khyber Pakhtunkhwa.\nFederal Secretary for National Food Security and Research Zafar Hassan, KP Secretary Food Abid Wazir and Punjab Food Secretary Muhammad Zaman Watto attended the meeting through a video link.",
  "retrievedAt": "2025-08-11T08:27:54.281Z"
}
