{
  "title": "Contempt of Parliament Bill introduced in NA",
  "link": "https://www.app.com.pk/national/contempt-of-parliament-bill-introduced-in-na/",
  "date_published": "2023-05-09T14:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP):Rana Muhamad Qasim Noon of the Pakistan Tehreek-e-Insaf on Tuesday introduced ‘The Contempt of Majlis-e-Shoora (Parliament) Bill 2023’ in the National Assembly, aimed at punishing those involved in the contempt of Parliament or a committee or breach of privilege of a House or a member.\nOn the advice of Minister of State for Law and Justice Shahadat Awan and Minister for Parliamentary Affairs Murtaza Javed Abbasi, Speaker Raja Pervez Ashraf referred the bill to the committee concerned for further deliberation with the directive to submit the report within seven days.\nMinister Shahadat Awan viewed that the House must adopt a proper procedure to unanimously pass the important bill. The standing committee would further fine-tune the bill and remove lacuna if any, he added.\nAppreciating the PTI MNA for introducing such an important bill in the House, the minister said the amendment in the Constitution was the right of the Parliament and it also had the discretion to pass or reject any bill.\nHe said this bill would further help to establish the writ of the Parliament, urging the other state institutions to work within their own constitutional domains.\nLeader of the Opposition Raja Riaz Ahmad Khan opined that as it was a matter of the Parliament’s prestige and supremacy there was no need to refer the bill to the committee.\nHowever, the mover agreed with the idea of worthy ministers and a couple of colleagues to send the bill to the committee concerned to further improve its content from the legal perspective.\nHe emphasized that the Parliament was the supreme institution and also the mother of all the institutions but its powers were being undermined by others time and again.\nHe said the bill should be passed unanimously to uphold the sanctity and supremacy of the Parliament, which should use its “constitutional authority to make all those accountable involved in its contempt”.\nPakistan Muslim League-Nawaz’s Shaikh Rohale Asghar proposed the speaker to take the consent of the House instead of forwarding it to the committee concerned.\nFederal Minister Javed Latif said the bill was the voice of the House and sought the Speaker’s ruling on it.\nPakistan Peoples Party’s Mir Ghulam Ali Talpur said there must be amendments in the law as it was the need of the hour. The bill should be passed without any further delay as there was no logic to send it to the committee, he added.\nJamaat-e-Islami’s Abdul Akbar Chitrali, seconding the bill, said, “We must keep our house in order instead of inviting a third party to get involved in the affairs of Parliament”.\nPTI’s Muhammad Mohsin Khan Leghari opined that the bill should not be given a blind approval and it should be sent to the committee for further consideration.\nIndependent MNA Muhammad Aslam Bhootani termed the bill historic, saying it should be drafted keeping in view all aspects.\nMuttahida Qaumi Movement’s Sabir Hussain Kaim Khani, favouring the bill, said those who spread false notions against the Parliament should be made accountable.\nBalochistan National Party’s Muhammad Hashim Notezai extended all-out support on behalf of his party to the bill, saying there must be the supremacy of the Constitution and the Parliament.\nPTI’s Sardar Riaz Mehmood Khan Mazari said the Speaker must be given powers to de-seat anyone whosoever violated the rules and regulations of the august House.\nPML-N’s Mehnaz Akber Aziz said the bill should be sent to the committee to further refine its language.\nPML-N’s Sheikh Fayyaz Ud Din said there should not be any procedural mistake in the bill and that was why it was essential to send it to the committee.\nBalochistan Awami Party’s Khalid Hussain Magsi said the bill should be taken up seriously and there should be no compromise on the Parliament’s prestige.\nPPP’s Nafisa Shah said the bill should have come into force so earlier.",
  "retrievedAt": "2025-08-11T08:27:50.056Z"
}
