{
  "title": "Business community should work for welfare of special persons, breast cancer prevention: Samina Alvi",
  "link": "https://www.app.com.pk/national/business-community-should-work-for-welfare-of-special-persons-breast-cancer-prevention-samina-alvi/",
  "date_published": "2023-05-09T10:56:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 9 (APP):First lady Begum Samina Alvi on Tuesday called upon the business community to play role in welfare of the persons with disabilities and raising awareness to prevent breast cancer among women.\nSpeaking as chief guest at an awareness session about breast cancer among the women organized by the Rawalpindi Chamber of Commerce and Industry (RCCI) here, Begum Alvi said promotion of awareness about breast cancer was the need of the hour because timely diagnosis and treatment of breast cancer can prevent this fatal disease.\nShe said the business community had a pivotal role in the socio-economic development of any country. After the collective efforts, she said a substantial success had been achieved in awareness against breast cancer.\nShe said women should be aware of any abnormal changes in the body and consult a doctor immediately. “Women empowerment is a welcome process that should continue. Due to awareness, the chances of preventing breast cancer are 90 per cent. Availability of breast cancer diagnostics facilities also has to be ensured in far-flung areas of the country,” she added.\nBegum Samina Alvi said that persons with disabilities were also an important part of society who should be given special attention.\n“Steps are being taken on the government level for rehabilitation of the special persons,” she said adding that people from all walks of life especially the business community should play role in welfare and the rehabilitation of special persons and to make them useful citizens of the society.\nShe urged the private sector and the NGOs to fix a special quota for them. The government, she said is taking sincere steps to empower special persons as well as the women. She also stressed the youth of the country to play their role in the development of the country by fully utilizing their capabilities.\nOn the occasion, the RCCI President Saqib Rafique said that due to the efforts of the business community, the Rawalpindi Development Authority (RDA) has made it mandatory for all commercial buildings to build ramps for special persons. He said the RCCI with the help of the business community, is playing its role in raising awareness about breast cancer prevention, rehabilitation of the special persons and mental health growth.\nHe said the Chamber has ensured practical participation in the government’s efforts in breast cancer prevention, mental health growth, rehabilitation, and welfare of persons with disabilities.",
  "retrievedAt": "2025-08-11T08:27:54.035Z"
}
