{
  "title": "Experts concerned over weaponisation of AI; call for legal instruments on LAWS",
  "link": "https://www.app.com.pk/national/experts-concerned-over-weaponisation-of-ai-call-for-legal-instruments-on-laws/",
  "date_published": "2023-05-09T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP): The speakers at a seminar here on Tuesday expressed concerns over the increasing weaponisation of artificial intelligence generating insecurity and fear saying that any failure to evolve legal instruments on LAWS would lead to arms races and weaken arms control regimes.\nThe seminar on “Lethal Autonomous Weapon Systems (LAWS): A Regional Perspective” was organised by Arms Control and Disarmament Centre (ACDC) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with Sustainable Peace and Development Organization (SPADO).\nThe event was attended by members of the diplomatic community, academia, experts from think tanks, officials from relevant departments representatives of civil society, and university students.\nIn his welcome remarks, Director General ISSI Sohail Mahmood said that the transformative potential of new and emerging technologies like robotics, Artificial Intelligence (AI) and machine learning was affecting every facet of human civilization.\n“These technologies had now spread to over 100 countries, increasing from 60 a decade ago. States could utilize these emerging technologies for the development of LAWS,” he added.\nHe said the proliferation of these technologies had raised the profile of the phenomenon and required deeper reflection. The dual-use nature of these technologies had also led to massive commercial use and raised concerns that non-state actors could use these technologies for malicious purposes, he commented.\nSohail said in May 2013, Pakistan became the first country to call for a ban on fully autonomous weapons. It had repeatedly advocated for a ban on autonomous weapons and was spearheading the efforts internationally to have a legally binding instrument.\nIn his introductory remarks Director ACDC-ISSI Malik Qasim Mustafa said that increasing weaponisation of AI was generating insecurity and fear and presented complex security challenges for states.\nHe said the development of these weapons had raised fundamental questions on their regulation, autonomy, accountability and state responsibility and their likely impact on human protection instruments like international human rights and Instrumental Humanitarian Law.\nChief Executive, SPADO Raza Shah Khan noted that the “Global Movement to Ban Killer Robots” had been active for more than a decade and comprised 150 non-governmental organizations from 60 countries working to retain meaningful human control over the use of force by banning the development, production, and use of fully autonomous weapons.\nThe NGOs aimed to get a consensus on an international legally binding instrument on LAWS. There was already support of 90 states as well as the Secretary General of the UN in favour of a legally binding instrument on LAWS; however, several major countries were resisting a consensus-based approach.\nHe appreciated Pakistan’s leading role, regionally and globally, on supporting a legally binding instrument on LAWS.\nAmbassador Khalil Hashmi, Permanent Representative of Pakistan to the United Nations and other International Organizations in Geneva, in a special video message, stated that Pakistan’s UN Mission in Geneva had been working to promote a ban on LAWS for years. Since 2014, there have been conversations at the international level on this issue.\nHe said that states remained divided into two camps–those who supported legally binding instruments; and those that opposed it. He reaffirmed that Pakistan’s efforts in this regard would continue.\nFormer Law Minister Ahmer Bilal Soofi said that in the case of LAWS, it was a grey area as to when a state could respond and what would constitute an attack on the country, and whether it could respond under Article 51 of the UN Charter.\nHe presented several proposals including the need to regulate the private sector, as well as government-to-government enterprises. He emphasized the need to create customary norms against autonomous weapons.\nCounsellor UN Mission of State of Palestine in Geneva Nada Tarbush shared the “State of Palestine’s Position.”\nShe appreciated how Pakistan had shaped the international debate on LAWS and outlined the Palestinian perspective regarding LAWs and said that two categories should be prohibited – one that targets humans, and one that does not have humans in the loop.\nShe emphasized the need for “meaningful human control” on weapons comprised of a system of reliability, predictability, understanding and explanability, and tracebility.\nShe highlighted the Israeli use of LAWS against Palestinians. Undderscoring that these weapons may become available to non-state actors, she stressed that developing a legally binding instrument was an urgent matter.\nGovernment Relations Manager, Campaign to Stop Killer Robots, Geneva Ousman Noor highlighted the primary issue with LAWS that machines were replacing humans and any decision for the use of force would be made through data. This was problematic from a moral, legal and security point of view.\nHe expressed concern that these weapons will proliferate beyond the battlefield. There were issues from International Humanitarian Law (IHL) perspective as well since these weapons could not distinguish between combatants and non-combatants.\nHe appreciated the role of Pakistan in the fight to ban LAWS and expressed confidence in the enormous potential for Pakistan to lead the way in the fight.\nAdvisor SPD Maj. General Ausaf Ali (R) said that AI was leading the third revolution in warfare. Major military powers were indulging in AI-led arms racing in the land, air, sea, cyber and space domains, he said.\nAusaf Ali said it would have consequences for conventional and nuclear capabilities and implications for strategic stability.\nHe talked about the transformative potential of LAWS on nuclear capabilities. He also dilated on LAWS in the South Asian context, including India acquiring Predator drones as well as S-400 systems that have autonomy built in their system.\nDirector (ACDIS) and Science Diplomacy, MOFA Ahsan Nabeel gave an overview of Pakistan’s position on “Proposal for an International Legal Instrument on LAWS.”\nHe said that international consensus on the issue remained elusive. He emphasized that failure to evolve legal instruments on LAWS will lead to arms races, weaken arms control regimes, and lead to precarious international security. He reiterated that Pakistan’s efforts for a legally binding instrument will continue.\nA robust question-answer session followed the presentations by the panel of experts.\nChairman, BOG ISSI Khalid Mahmood concluded the seminar with a vote of thanks. He emphasized that while the march of technology could not be stopped, there was an enormous challenge in how to regulate LAWS.",
  "retrievedAt": "2025-08-11T08:27:50.343Z"
}
