{
  "title": "Amin urges Google to enhance scholarships for Pakistanis to 450,000",
  "link": "https://www.app.com.pk/national/amin-urges-google-to-enhance-scholarships-for-pakistanis-to-450000/",
  "date_published": "2023-05-09T15:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP):Federal Minister for Information Technology and Telecommunication Syed Amin-Ul-Haque on Tuesday urged the Google to enhance scholarships from 44,500 to 450,000 for Pakistanis.\nAddressing Google Career Certificates 2.0 launching ceremony organized by Google Asia Pacific, he said, “In 2022, Google in collaboration with partners IRM and Ignite, gave out 15,000 scholarships to Pakistanis and this year, we are further deepening our commitment. Google in collaboration with partners IRM and Tech Valley will give out a total of 44,500 scholarships to Pakistanis.”\nHe said that Google’s programs of skill development in emerging technologies and soft skills are very much aligned with the vision of the Ministry of IT.  “In this era of digitalization, limited skills are never enough; young people need to stay updated with the fast-paced trendy world,” he added.\nThe minister welcomed the Google Asia Pakistan Team and lauded the efforts to launch their new version of Career Certificates Program for Pakistan.\nSyed Amin Ul Haque said in pursuit of the government’s objective to increase IT exports, the Ministry of Information Technology and Telecommunication has collaborated with both public and private sector stakeholders to set a goal of 100% export growth in the coming years.\n“Achieving this target requires skilled youth trained in the latest technologies to meet the demands of the market” he added.\nHe said Google Career Certificates focused on six in-demand areas related to digital, including, IT support, project management, Data analysis, UX design, IT automation, Digital marketing and E-commerce.\nHe said now, in 2023, Google has announced 3 highly demanded courses including Business intelligence, advanced data analytics and cyber security.  “These programs will ensure that Pakistanis are ready for the future of the Pakistani job economy,” he added.\nThe minister said that the government focus is on women and urban youth, both of which are underrepresented, and in need of these skills and certifications.",
  "retrievedAt": "2025-08-11T08:27:50.349Z"
}
