{
  "title": "NDMA’s NEOC advises caution as severe weather hits capital region",
  "author": null,
  "content": "ISLAMABAD, Apr 20 (APP):The National Disaster Management Authority’s (NDMA) National Emergency Operations Center (NEOC) has urged people to follow safety guidelines to stay safe, as a localised weather system over Islamabad and Rawalpindi is expected to bring strong winds, isolated rainfall, and possible hailstorms within the next 8–10 hours.\nThe NDMA warns that an incoming westerly disturbance is likely to bring heavy rainfall, strong windstorms, thunderstorms, and isolated hailstorms to Pothohar region, Upper Punjab, and Central Punjab during the next 12 hours.\nThis weather system is expected to significantly impact major urban centers including Islamabad, Rawalpindi, Lahore, and Faisalabad.\nAuthorities anticipate several hazardous conditions including strong winds and heavy precipitation that may result in fallen trees and widespread power outages. The storm system also carries potential for damaging hailstorms and dust storms that could affect infrastructure, damaging rooftops, vehicles, agricultural crops, and power transmission lines. Additionally, significantly reduced visibility caused by dust and rainfall is expected to create dangerous driving conditions, substantially increasing the risk of road accidents.\nResidents in affected areas are strongly advised to take necessary precautions by securing outdoor objects, staying updated through NDMA’s mobile app Pak NDMA Disaster Alert,and avoiding unnecessary travel. Emergency services remain on high alert to respond to any weather-related incidents.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:41:19.369Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ndmas-neoc-advises-caution-as-severe-weather-hits-capital-region/",
  "dateList": "2025-04-20",
  "date_published": "2025-04-20T12:32:00.000Z"
}
