{
  "title": "Bangladesh launches ‘Operation Devil Hunt’ against Hasina loyalists - World - DAWN.COM",
  "author": null,
  "content": "DHAKA: Bangladesh on Sunday launched a major security operation after protesters were attacked by gangs allegedly connected to the ousted regime of ex-leader Sheikh Hasina.\n\nA government statement said the operation began after gangs “linked to the fallen autocratic regime attacked a group of students, leaving them severely injured”.\n\nJahangir Alam Chowdhury, head of the interior ministry in the interim government that took over after Hasina was ousted in the August 2024 student-led revolution, has dubbed it “Operation Devil Hunt”.\n\n“It will continue until we uproot the devils,” Chowdhury told reporters. The sweeping security operations come after days of unrest.\n\nOn Wednesday, six months to the day since Hasina fled as crowds stormed her palace in Dhaka, protesters smashed down buildings connected to her family using excavators.\n\nDhaka rejects New Delhi’s statement on country’s internal affairs as ‘unexpected and unwarranted’\n\nProtests were triggered in response to reports that 77-year-old Hasina — who has defied an arrest warrant to face trial crimes against humanity — would appear in a Facebook broadcast from exile in neighbouring India.\n\nBuildings destroyed included the museum and former home of Hasina’s late father, Bangladesh’s first president Sheikh Mujibur Rahman. The interim government blamed Hasina for the violence.\n\nOn Friday, interim leader and Nobel Peace Prize winner Muhammad Yunus also pleaded for calm. “Respecting the rule of law is what differentiates the new Bangladesh we are working together to build, from the old Bangladesh under the fascist regime,” Yunus said in a statement.\n\n“For the citizens who rose up and overthrew the Hasina regime … it is imperative to prove to ourselves and our friends around the world that our commitment to our principles — respecting one another’s civil and human rights and acting under the law — is unshakable.”\n\nHours later, members of the StudentsAgainstDiscrimination — the protest group credited with sparking the uprising against Hasina – were attacked in the Dhaka district of Gazipur.\n\nThe vocal and powerful group — whose members are in the government cabinet — had since demanded action.\n\nIndian interference\n\nNew Delhi’s statement on the demolition of Bangabandhu’s house on Dhanmondi 32 is uncalled-for and unexpected, said foreign affairs ministry spokesperson Rafiqul Alam on Saturday.\n\nAccording to The Daily Star, Rafiqul made this remark when asked about the statement by the Indian Ministry of External Affairs (MEA) regarding the destruction of the Bangabandhu Memorial Museum on Dhanmondi 32 on February 5.\n\nOn February 6, Indian MEA spokesperson Randhir Jaiswal stated that it was regrettable that the historic residence of Sheikh Mujibur Rahman — a symbol of the heroic resistance of the people of Bangladesh against the forces of occupation and oppression — was destroyed.\n\n“All those who value the freedom struggle that nurtured Bangladeshi identity and pride are aware of the importance of this residence for the national consciousness of Bangladesh. This act of vandalism should be strongly condemned,” he said.\n\nWhen asked about this statement at a media briefing at the Foreign Ministry, Rafiqul Alam said that the MEA’s remarks had come to the notice of the interim government.\n\n“This statement on the internal affairs of Bangladesh is unexpected and unwarranted. We have witnessed various unfortunate situations in the neighbouring country, but Bangladesh does not issue statements on the internal affairs of other nations.\n\n“Bangladesh expects the same courtesy from other countries,” he added.\n\nPublished in Dawn, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:29:04.756Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890967/bangladesh-launches-operation-devil-hunt-against-hasina-loyalists",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T01:47:51.000Z"
}
