{
  "title": "The potential in SME B2B transactions - Newspaper - DAWN.COM",
  "author": null,
  "content": "“PAKISTAN is one of the most exciting markets to be in,” said Shahebaz Khan, Senior Vice President, Head of Commercial and Money Movement Solutions, CEMEA, Visa. The economy is not highly digitised, but it has the fifth largest Gen Z population in the world, which are more likely to spend digitally than the preceding generations, he explains.\n\nCounterintuitively, the informal small and medium enterprises segment is another strong reason the global payments technology company sees potential for growth in the country. Small businesses are starved for banking services, he explains. While banks may be reluctant to lend, small and medium enterprises (SMEs) can access debit cards. On one hand, it allows them to track petty cash and manage working capital requirements. On the other hand, it builds a digital footprint of cash flows that allows them access to future financing lines, especially as the State Bank of Pakistan (SBP) has introduced incentives to lend to small players, he added.\n\nSMEs contribute 40 per cent to GDP and employ 72pc of the non-agricultural workforce, states ‘Digitising SME B2B Payments — The promise of commercial cards 2025’, a whitepaper by Visa. The report estimates that digitising payments, especially business-to-business (B2B) transactions, has the potential for over $121 billion worth of digital activity.\n\nVital for the country’s economic growth, SMEs account 30pc of all exports. However, only about 5.3 million are registered, with most operating in the informal sector. Barriers to access to information about financial services, a complex regulatory environment, limited technical expertise, and financing have resulted in Pakistan ranking the lowest regionally in business borrowing. Only 2.1pc of enterprises, primarily large corporations, have access to lines of credit — well below the regional average of 27.5pc.\n\nDigitising payments, especially business-to-business transactions for small players, could generate over $121 billion worth of digital activity, estimates Visa\n\nOut of Pakistan’s estimated 28m businesses, around 7.5 are addressable for digital payment solutions in the short run. About 19m businesses, mainly in the agriculture sector, can shift to digital payment solutions in the medium- to long-term, states the report.\n\nThe real potential for digitisation SMEs appears to lie in B2B transactions. In 2022, Pakistan had about $255bn of B2B payment flows, of which a whopping 85pc were cash-based. This indicates the tremendous size of the informal economy and its high dependence on physical transactions.\n\nHowever, the growth patterns mentioned by Mr Khan are evident since about 15pc of SME B2B payments are now digital. Here too, there is a conundrum. SMEs often use personal debit or credit cards for business transactions, which violates the State Bank’s directive to separate personal and business expenses. Although there is an annual cap of $30,000 for international transactions on personal cards, business owners frequently use them for both local and global payments.\n\nVisa identifies the largest digitisation opportunity within SME payables — specifically the SME-to-large corporate payment flow. The largest 8pc of SMEs in the formal sector account for 60pc of total SME payables. On the one hand, focusing on high-value B2B transactions can have an outsized impact in efficiency gains. On the other hand, a low-risk, high-volume entry point is small-value transactions that amount to roughly $6bn in SME B2B payables.\n\nThe IT sector, particular, has a lot of potential for digitisation. For services such as cloud storage, payments to cross-border merchants require removing operational challenges and establishing robust digital enterprise payment solutions.\n\nRecognising this, the SBP recently expanded foreign transaction limits for 62 service providers to $400,000 per company.\n\nWhile there is a strong use case for SMEs, commercial card payments accounted for approximately only 1pc of total card spend in 2022. Businesses prefer to opt for cards in their owner’s name for business expenses, limiting demand for commercial cards.\n\nChanging the mindset in an economy where each segment is determined to remain out of the tax net, and hence the digital formal economy is extremely challenging. For cards, any cards, to be accepted as a means of payment, there has to be a physical and technical infrastructure in place. For example, if a consumer is carrying a payment card but there is no point-of-sale machine, there will be limited demand for the card, explains Mr Khan.\n\nUndoubtedly, the potential for digitising payments and, hence, increasing the use of cards is huge. This may be why Visa’s presence in Pakistan has increased from four people working in the country to 30 in the last seven years. However, for the potential to materialise, resistance to formalisation and a regulatory push is necessary so that the benefits of digitisation outweigh the cons.\n\nPublished in Dawn, The Business and Finance Weekly, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:29:02.867Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891002",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T02:29:32.000Z"
}
