{
  "title": "CORPORATE WINDOW: Relief on hold for the auto sector - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE cut in the interest rate to 12 per cent from 22pc in June 2024 is reviving auto financing at a snail’s pace as either the monthly instalments are still unaffordable or the consumers are waiting for a further drop in instalments after a possible future interest rate cut.\n\nFor the last few months, banks and assemblers have been trying hard to lure buyers through promotional offers and lowering financing costs.\n\nAs the market is abuzz with reports of a further interest rate drop by 1pc in the next Monetary Policy Meeting of the State Bank in March, the resulting anxiety keeps buyers away from car leasing.\n\nBankers and auto sector stakeholders believe that people with handsome salaries in the corporate sector and big private firms are turning up for auto financing, while regular citizens still consider the interest rate too high for auto financing.\n\nBanks charge 3-5pc more than the policy rate Karachi Interbank Offered Rate (Kibor) -Plus. A banker dealing in car leasing said if a buyer books a locally assembled Suzuki Alto VXL AGS 660cc, priced at Rs3.04 million, on a five-year instalment package by paying 30pc the of vehicle’s amount, the monthly instalment comes to Rs56,000-57,000 per month, including the monthly Takaful amount of Rs5,073 and Rs1,527 for tracker charges. The monthly instalment was Rs 68,000-70,000 when the interest rate was 22pc, he added.\n\nLarge private firms are opting for auto financing, while regular citizens still consider the interest rate too high\n\nThe locally assembled Toyota Yaris Ativ CVT 1.3 carries a price tag of Rs5.62m, but its monthly instalment on a five-year package comes to Rs112,000-115,000 per month, which was Rs122,000-124,000 in June 2024. More or less, the same five-year instalment plan exists for a fully loaded Suzuki Swift.\n\nThe banker further explained that a buyer, with no other liability, must have a monthly salary of Rs 150,000 or above to own a Suzuki 660cc; otherwise, it will be difficult for him to pay the monthly instalment.\n\nOffering a different view, auto part maker/exporter Mashood Ali Khan says, “Only individuals earning over Rs 200,000 per month seem to be opting for auto financing, particularly for small 660cc vehicles. Those earning below this threshold still find car leasing out of reach due to the burden of high educational expenses, utility bills, and daily living costs.”\n\nCEO of Indus Motor Company, Ali Asghar Jamali, elaborates that the share of auto financing in overall sales of Toyota vehicles has only inched up to 24pc from 20pc after a cut in the interest rate to 12pc from 22pc “which is such a small improvement”. He hoped that the cut in interest rates would help improve auto financing in the future.\n\nHowever, car purchases will flourish ahead of Budget FY26 based on the increasing imports of parts and accessories by the assemblers, the influx of new models, and the lowering interest rate coupled with attractive packages offered by banks and assemblers, Mr Jamali hoped.\n\n“A single-digit interest rate may inject new life into auto financing as well as vehicle sales,” Mr Khan said.\n\nHowever, the rising sales of cars, light commercial vehicles, pickups, and vans are still far behind the record sales of 250,000 units achieved soon after Covid-19, which assemblers are striving hard to achieve. Though the rupee-dollar stability has kept the prices of vehicles relatively under control, some assemblers had to slash prices to achieve their sales targets. The improvement in the foreign exchange situation also supports imports of parts and accessories.\n\nIn the last few weeks, bank financing has increased by a good percentage, although many buyers are waiting for rates to slide further, shared an authorised dealer. Another dealer said if the State Bank increases auto loan financing limits from Rs3m to Rs5-6m, that will also augur well for sales of cars as well as auto loans.\n\nAs per data from the State Bank of Pakistan (SBP), the outstanding loans for purchasing cars started crawling up from the end of September 2024, which stood at Rs227.54 billion from Rs227.29bn at the end of August. It rose to Rs 235.88bn in October but again slightly fell to Rs 234.64bn in November. In December 2024, auto financing improved to Rs 235.45bn.\n\nAuto financing was at its peak of Rs368bn at the end of June 2022 before it went on a downward spiral. According to an Insight Securities report, the SBP introduced strict regulations during FY22 to curb auto financing in response to declining foreign exchange reserves.\n\nKey measures included reducing the repayment tenure to five years for cars up to 1,000cc and three years for cars above 1,000cc, increasing the down payment requirement to 30pc, and capping the maximum financing limit at Rs3m.\n\nHistorically, declining interest rates have driven growth in auto financing, eventually leading to higher auto sales. However, the effects of falling interest rates often take some time to translate into auto financing. The auto financing data of the last 10 years reveal that generally there is a lag of six to eight months in the transmission of policy rate into auto financing and a 10-12 month lag in policy rate and car sales, the report said.\n\nPublished in Dawn, The Business and Finance Weekly, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a964718d84d.gif",
  "retrievedAt": "2025-08-25T19:29:02.817Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891012",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T02:29:31.000Z"
}
