{
  "title": "Two, including policeman killed, 3 injured in separate incidents in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two people — including a policeman — died on Monday while three others were injured in separate incidents, claimed to be personal enmity, in Karachi, police and rescue officials said.\n\n“At around 11am today, 45-year-old Gulshan Rashid was burnt to death after her brother-in-law, Dilawar, set her on fire. Her teenage daughter, Asma, and son, Ahmed Rashid, also sustained burn injuries in Korangi,” Awami Colony police Station House Officer Mohammed Saud told Dawn.com.\n\nAccording to SHO Saud, the suspect fled after torching both women while 17-year-old Ahmed suffered burn wounds while trying to save his mother and sister.\n\nThe victims were moved to the Burns Centre of Civil Hospital Karachi, where Gulshan was pronounced dead.\n\nThe officer said the condition of her daughter was also critical while her son sustained minor injuries, attributing some “family dispute” as a probable motive for the attack but did not elaborate on it.\n\nThe SHO said that the victim’s husband Rashid Khan had verbally told the police that his elder brother Dilawar was involved in this “gruesome incident”, however, the police were waiting for him to formally lodge a first information report (FIR) to initiate legal proceedings.\n\nThe Crime Scene Unit of the police has collected evidence from the spot.\n\nIn a separate incident in Steel Town, a policeman was shot dead while his wife was injured over some personal enmity, police claimed.\n\nMalir Superintendent of Police (SP) Saeed Rind told Dawn.com that “Khameso Jokhio, 40, was murdered by unknown suspects inside his flat while his wife, Raeesa Jokhio, 30, was injured.”\n\nThe victim was posted at Steel Town, SP Rind said.\n\nHe said that the police had a “significant clue” about the identity of the alleged killer who was a close relative of the injured woman.\n\n“The woman had significant property and the alleged suspect wanted to usurp it and for this, the suspect carried out this heinous crime,” the SP said, adding that the body and the injured were moved to the Jinnah Postgraduate Medical Centre.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:28:59.289Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891081/two-including-policeman-killed-3-injured-in-separate-incidents-in-karachi",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T18:01:05.000Z"
}
