{
  "title": "PHC acquits four in abduction of girl, forced marriage case - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has acquitted four persons and set aside the sentence of life imprisonment awarded to them by a child protection court for allegedly abducting a teenage girl and forcing her to marriage with one of them in Swat district.\n\nA bench consisting of Justice Mohammad Naeem Anwar and Justice Wiqar Ahmad accepted two appeals filed by the convicts including three brothers named Sher Ali Khan, Raza Khan and Samiullah and their relative Lal Mohammad, observing that the prosecution had not been able to prove its case against the appellants beyond reasonable doubt.\n\n“Confidence inspiring evidence is missing with the prosecution. Benefit of doubt has to go to the appellants/convicts as they cannot be handed down conviction and punishment on the basis of such weaker type of evidence,” the bench ruled.\n\nAn additional sessions judge/judge of child protection court had convicted the appellants on June 22, 2023 under Section 365-B (abducting or inducing woman to compel for marriage) of Pakistan Penal Code and sentenced them to life imprisonment with fine of Rs200,000 each.\n\nPetitioners were sentenced to life imprisonment by child protection court\n\nThe trial court had also convicted them for house trespassing under Section 458 of PPC and sentenced them to 14 years rigorous imprisonment with fine of Rs100,000 each.\n\nThe FIR of the occurrence had been registered on Sep 11, 2021, at Shah Dehri police station in Swat wherein father of the 16-year-old girl was complainant. He had stated that a sister of the three accused persons had eloped with his brother around 10 years ago and both of them had contracted marriage.\n\nHe claimed that one of the accused, Raza Khan, had few months ago demanded hand of his daughter for his son, who was settled in Saudi Arabia. However, he claimed that he had turned down the proposal as the accused was demanding that all the marriage expenses should be met by him.\n\nHe alleged that at nighttime the accused persons entered his residence and forcibly took away his daughter while his hands were fastened with a rope. Subsequently, the prosecution claimed that the girl was recovered while she was forcibly married to one of the accused, Sher Ali.\n\nInitially, the alleged victim had recorded her statement with a magistrate and stated that she had married Sher Ali of her free will. Later on, her statement was again recorded by a magistrate wherein she charged the appellants for her abduction and forcing her to marry Sher Ali.\n\nLater on, during pendency of the trial the girl had also filed suit in a family court for dissolution of the said marriage and that case was decided in her favour.\n\nAdvocate Khizar Hayat Khazana appeared for the appellants and contended that the alleged victim had in fact gone with Sher Ali and contracted Nikah with him of her free will which was evident from the presence of witnesses in the Nikah ceremony.\n\nHe argued that the complainant had falsely charged the accused persons in a concocted case. He said that the girl admitted during cross examination that she consulted her brother and father before retracting from her first statement, which she had recorded with the magistrate, thus the subsequent statement carried no legal weight or at least she was not a reliable witness.\n\nPublished in Dawn, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:29:17.689Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890867/phc-acquits-four-in-abduction-of-girl-forced-marriage-case",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T01:04:27.000Z"
}
