{
  "title": "Ogra’s opinion sought on plan to curb use of substandard LPG cylinders in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Taking notice of tragic incidence of liquefied petroleum gas (LPG) cylinder blasts, Sindh Ombudsman Muhammad Sohail Rajput has sought the opinion of the Oil and Gas Regularity Authority (Ogra) regarding potential amendments to laws aimed at controlling the substandard manufacturing and illegal sale of LPG cylinders.\n\nDuring a suo motu hearing on the issue, he emphasised that the substandard production and unauthorised sale of gas cylinders posed a serious threat to public safety.\n\nThe hearing was attended by Secretary to the Provincial Ombudsman Mansoor Abbas Rizvi, Karachi Commissioner Syed Hassan Naqvi, Karachi police chief Javed Alam Odho, Municipal Commissioner Karachi SM Afzal, Executive Director Ogra Ghulam Mohammad Shaheen, Senior Technical Instructor Civil Defence Karachi Mirza Mursaleen Baig, Deputy Convener of the Federation of Pakistan Chambers of Commerce and Industry (FPCCI) Farhan Ayaz and other officials.\n\nReferring to recent LPG cylinder blast incidents in Hyderabad, Multan and Dera Ghazi Khan, the provincial ombudsman directed the Ogra to provide its recommendations on necessary amendments to the authority’s laws within two weeks.\n\nOmbudsman says people are forced to use cylinders due to non-availability of cooking gas\n\nHe also instructed Ogra to submit details of the measures taken to regulate LPG sales.\n\nMr Rajput further directed the Karachi commissioner to form a committee comprising all relevant stakeholders and prepare terms of reference (TORs) for addressing the illegal sale of substandard LPG cylinders.\n\nHe said that the people were forced to use LPG cylinders due to the non-availability of the natural gas. In such circumstances, the protection of human lives and an adequate gas supply should be the top priority.\n\nBriefing the ombudsman regarding the illegal and substandard sale of LPG, the Karachi commissioner stated that more than 300 shops had been sealed in the city for selling LPG illegally and in substandard conditions. He further revealed that over 6,000 shops in the city were engaged in LPG sales in violation of Ogra regulations.\n\nHe emphasised that the Ogra must amend its rules to grant additional authority to commissioners and deputy commissioners, enabling them to take stricter action against illegal LPG sales.\n\nThe city police chief said that the amendments in Ogra rules regarding the substandard and illegal sale of LPG would not only determine the direction of the city administration but also the police action.\n\nDeputy Convener of FPCCI Farhan Ayaz pointed out that while LPG sales regulations were one aspect of the issue, the manufacturing of substandard LPG cylinders and bowsers was the primary cause of fatal accidents. He noted that currently, all cylinder manufacturing operations were based in Punjab.\n\nPublished in Dawn, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:20:56.539Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890944/ogras-opinion-sought-on-plan-to-curb-use-of-substandard-lpg-cylinders-in-sindh",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T01:04:10.000Z"
}
