{
  "title": "A positive note - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN’S economy has ‘stabilised’. Yet it remains just a shock — a failed performance review of the IMF’s 37-month $7bn programme — away from a relapse.\n\nThis is the crux of a special note released by Fitch Ratings ahead of the first biannual programme review, expected to start soon. Not that Pakistan is likely to fail the upcoming review, but Fitch, like many others, is not too bullish on the government’s commitment to implementing the difficult reforms needed to address the imbalances in the economy.\n\nWhile acknowledging the “progress in restoring economic stability and rebuilding external buffers”, the note cautions that “structural reforms would be key to the IMF programme reviews and continued financing from other … lenders”.\n\nA weakened balance-of-payments position is at the core of our economic crisis. Even though liquidity has strengthened of late, thanks to a robust increase in remittances, curtailment of imports, and generous rollovers of bilateral debt by China, Saudi Arabia and the UAE, foreign “reserves remain low relative to funding needs”.\n\nMedia reports suggest that the government has again reached out to Beijing for a two-year rescheduling of $3.4bn loans maturing between last October and September 2027 to cover the financing gap identified by the IMF.\n\nThere is no doubt that the economy has turned a corner as far as macro indicators are concerned: inflation is down to below 3pc, the current account is running a surplus, foreign payments — other than the loans rolled over — are being made on time, international reserves are growing, the exchange rate has stabilised, reduced interest rates are pushing private credit offtake, etc.\n\nOn the fiscal side, Pakistan has met at least three of five Fund benchmarks: it has achieved the targets for a primary budget surplus, net revenue collection and provincial cash surplus — though it has fallen short in FBR tax collection by nearly Rs470bn and failed to tax retailers.\n\nThese improvements, including provincial legislation to harmonise agriculture tax rates with the federal tax regime, means that the forthcoming review should not be negative. We may also see rating agencies upgrade our ranking, helping us access foreign bond markets and other sources of commercial loans as private flows remain elusive.\n\nBut the ‘turnaround’ has come at great cost to the salaried middle class. With the government unable to press the growth accelerator without upending the fragile recovery, the sufferings of low-middle-income households are unlikely to disappear soon. The only way the ruling elites can compensate them for their sacrifices is to put the country on the path of reforms and stick to it.\n\nPublished in Dawn, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:29:04.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891000/a-positive-note",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T02:07:08.000Z"
}
