{
  "title": "Almost all nations miss UN deadline for new climate targets - World - DAWN.COM",
  "author": null,
  "content": "Nearly all nations missed a UN deadline on Monday to submit new targets for slashing carbon emissions, including major economies under pressure to show leadership following the US retreat on climate change.\n\nJust 10 of nearly 200 countries required under the Paris Agreement to deliver fresh climate plans by February 10 did so on time, according to a UN database tracking the submissions.\n\nUnder the climate accord, each country is supposed to provide a steeper headline figure for cutting heat-trapping emissions by 2035, and a detailed blueprint for how to achieve this.\n\nGlobal emissions have been rising but need to almost halve by the end of the decade to limit global warming to safer levels agreed under the Paris deal.\n\nUN climate chief Simon Stiell has called this latest round of national pledges “the most important policy documents of this century”.\n\nYet just a handful of major polluters handed in upgraded targets on time, with China, India and the European Union the biggest names on a lengthy absentee list.\n\nMost G20 economies were missing in action with the United States, Britain and Brazil — which is hosting this year’s UN climate summit — the only exceptions.\n\nThe US pledge is largely symbolic, made before President Donald Trump ordered Washington out of the Paris deal.\n\nThere is no penalty for submitting late targets, formally titled nationally determined contributions (NDCs).\n\nThey are not legally binding but act as an accountability measure to ensure countries are taking climate change seriously and doing their fair share toward achieving the Paris goals.\n\nThe sluggish response will not ease fears of a possible backslide on climate action as leaders juggle Trump’s return and other competing priorities from budget and security crises to electoral pressure.\n\nEbony Holland from the International Institute for Environment and Development said the US retreat was “clearly a setback” but there were many reasons for the tepid turnout.\n\n“It’s clear there are some broad geopolitical shifts underway that are proving to be a challenge when it comes to international cooperation, especially on big issues like climate change,” said Holland, a policy lead at the London-based think tank.\n\nThe EU, historically a leader on climate policy, has been delayed by elections and internal processes and is bracing for fresh polls in Germany and Poland.\n\nAn EU spokeswoman said a collective target for the 27-nation bloc would be unveiled “well ahead” of the UN COP30 climate conference in November.\n\n“We will continue to be a leading voice for international climate action,” she said.\n\nAnalysts say China — both the world’s biggest polluter and its largest renewable energy investor — was also expected to release its much-anticipated NDC in the second half of 2025.\n\nThe United Arab Emirates, Ecuador, Saint Lucia, New Zealand, Andorra, Switzerland and Uruguay rounded out the list of countries that made Monday’s cut-off.\n\nEvans Njewa, a Malawian diplomat and chair of the Least Developed Countries group, said many poorer nations lacked the financial resources and technical expertise to compile such complex, economy-wide policies.\n\n“Big emitters, whose historical and ongoing pollution has driven the climate crisis, must take responsibility and lead by example,” he told AFP.\n\nCountries have been consistently late in filing periodic updates to their NDCs since the Paris accord was signed in 2015.\n\nLast week, Stiell asked that countries turn in “first-rate” submissions by September so they could be properly assessed before the UN climate summit in Belem.\n\n“The worsening climate crisis will not wait or pause its disastrous impact as nations delay their action plans,” said Tracy Carty from Greenpeace International.\n\nLinda Kalcher, executive director of the Strategic Perspectives think tank, said in some cases it was better that countries work on fine tuning quality proposals, rather than rushing out something weaker.\n\n“The concern is that if too many countries delay, you could give the perception that they’re not willing to act,” she told AFP.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:28:59.297Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891067/almost-all-nations-miss-un-deadline-for-new-climate-targets",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T11:51:59.000Z"
}
