{
  "title": "Boat tragedies prompt FIA to offload 2,500 in one month at Lahore airport - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Following the boat capsizing incidents in Europe in which several Pakistanis lost their lives, the Federal Investigation Agency (FIA) has introduced “rigorous screening” at all airports of the country primarily to stop potential illegal immigrants from reaching transitory destinations by air.\n\nOnly at Lahore airport, the FIA offloaded 2,500 passengers during the last one month or so for having “fake, suspicious, or incomplete documents”. Even some passengers traveling on genuine documents were also offloaded by the FIA, suspecting them to be illegal immigrants.\n\nMost of the offloaded passengers were to leave for Saudi Arabia, Azerbaijan, Iran, Iraq, Malaysia, Senegal, Ethiopia, Mauritania, Turkey, Qatar, Kuwait, Kyrgyzstan, Kenya, Egypt and Libya. The FIA has identified these countries as a transit destinations of the illegal immigrants for their further travel to European or other developed countries. The passengers were mostly traveling to these countries on visit, tourist, Umrah and student visas.\n\n“Lahore airport authorities are conducting rigorous screening of passengers under the directives of FIA Lahore chief Sarfraz Khan Virk. As many as 2,501 passengers have been offloaded due to fake, suspicious, or incomplete documents since this January,” an FIA spokesperson told Dawn on Sunday.\n\n“A comprehensive review of passengers’ travel records is being carried out. Eight passengers have been arrested for using forged documents. Some 14 individuals involved in begging have been taken into custody,” he said and added the arrested individuals had been handed over to the Anti-Human Trafficking Circle, Lahore, for further investigation.\n\nHe said nine fugitives wanted by the Punjab police were also prevented from fleeing abroad by FIA. In 2024, the spokesperson said, as many 8,812 passengers were offloaded due to fake, suspicious, or incomplete documents at the Lahore airport. “Some 79 passengers were arrested for using forged documents and 75 others involved in begging were also detained. Similarly, 57 fugitives, wanted by Punjab police in serious cases, were stopped from fleeing the country last year,” he added.\n\nVirk said the crackdown against the human traffickers linked to the boat tragedies would continue. “Operations against human trafficking networks have been intensified as FIA remains committed to a zero-tolerance policy against this heinous crime,” he said.\n\nOwing to the rigorous screening at the international airports of the country, even the genuine passengers traveling with legal documents and visit visas of European, Central Asian and the Middle Eastern countries are facing severe hardships.\n\nThe tour operators have also urged the authorities concerned not to stop passengers on genuine visas as it is hurting their business. The FIA recently dismissed 13 of its officials and stopped promotions of three constables said to be involved in the Greek boat tragedy in 2024.\n\nSimilarly, 65 FIA officials last month were blacklisted for posting at any immigration check post and anti-human trafficking circles in the country in the light of the inquiry into the Greece boat tragedy in which several Pakistanis had lost their lives.\n\nThe FIA had begun the purge following the capsizing of a boat carrying illegal immigrants near Greece in December last year. As per an estimate, more than 80 Pakistanis drowned in the accident, while 36 were rescued. The remaining were presumed dead.\n\nIn response to the tragedy, Prime Minister Shehbaz Sharif had ordered the authorities to take action against human smugglers and officials aiding them. Since then, a countrywide crackdown has been launched against human smugglers, leading to the arrests of dozens of suspects.\n\nPublished in Dawn, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:21:41.133Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890925/boat-tragedies-prompt-fia-to-offload-2500-in-one-month-at-lahore-airport",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T01:04:16.000Z"
}
