{
  "title": "IHC suggests Justice Dogar’s elevation to Supreme Court - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has included Justice Sardar Mohammad Sarfraz Dogar in its list of nominees for vacant Supreme Court positions.\n\nInitially, the IHC had forwarded the names of three judges — Chief Justice Aamer Farooq, Justice Mohsin Akhtar Kayani, and Justice Miangul Hassan Aurangzeb — to the Judicial Commission of Pakistan (JCP) for consideration. However, the administration has now revised the list to include Justice Dogar as well.\n\nThe JCP is set to meet today (Monday) to finalise appointments for eight vacant Supreme Court positions. Earlier this month, the commission sought nominations from all high courts, requesting a list of five senior judges from each.\n\nThe IHC initially nominated only three judges because the other two senior judges, Justice Tariq Mehmood Jahangiri and Justice Babar Sattar, did not meet the minimum requirement of five years of service.\n\nJCP set to meet today to finalise appointment of eight judges to apex court\n\nHowever, Justice Dogar, along with two judges from the Sindh High Court and Balochistan High Court, was recently transferred to the IHC. Following his transfer, the IHC administration revised its seniority list and designated him as the senior puisne judge. Finally, his name has also been sent to the JCP.\n\nDays before Justice Dogar’s name was added, five judges of the IHC approached Chief Justice of Pakistan Yahya Afridi and IHC Chief Justice Aamer Farooq to reclaim their seniority.\n\nThe judges argued that any transferred judge must take a fresh oath under Article 194 of the Constitution, which would place them at the bottom of the IHC’s seniority list.\n\nThis would render them ineligible for immediate consideration for the position of IHC chief justice, contradicting the Judicial Commission of Pakistan’s (JCP) Appointment Rules 2024, which stipulate that the chief justice of a high court must be selected from its three most senior judges.\n\nAccording to the representation submitted by the judges, a judge takes an oath for the high court in which they are appointed. It further emphasised that according to the constitutional intent, a judge must take a fresh oath when transferred to another high court.\n\nBased on this principle, the seniority of a judge transferred to another high court should be determined from the date of their new oath.\n\nThe judges clarified that their representation was strictly concerned with the seniority issue and was unrelated to the transfer of judges.\n\nCoincidently, four judges of the Supreme Court also raised similar concerns and are also seeking the postponement of the JCP session until a decision on the petitions against the 26th Amendment.\n\n“In the alternative, the JCP should wait until the Supreme Court’s constitutional bench decides applications seeking a full court hearing to determine the challenges or the matter of judges’ transfer to the Islamabad High Court (IHC) and their seniority is determined on the judicial side,” the judges wrote to CJP Afridi.\n\nIn a three-page letter, senior puisne judge Justice Syed Mansoor Ali Shah, Justice Munib Akhtar, Justice Ayesha A. Malik and Justice Athar Minallah stated that the induction of judges who were beneficiaries of the 26th Amendment would weigh heavily on faltering public trust enjoyed by the institution and unnecessarily make matters more complicated.\n\nReferring to the recent transfer of judges to the IHC from different high courts under Article 200, the letter stated the transfer could neither be permanent nor open-ended; rather, it should be temporary and time-bound.\n\nJudges transferred under Article 200(1) are required to take the oath of office in the transferred high court, the letter said, adding that there were obvious implications and consequences for the seniority of the transferred judge, who of course, will always retain and have a lien on their seniority in the high court of origin.\n\n“How can this be? How can a judge who would and could not possibly have been eligible for any such consideration at all in his own high court, suddenly and in consequence of the alchemy of a prima facie constitutionally suspect and defective transfer become eligible to be considered for the Supreme Court? What cannot be done directly cannot be done indirectly,” the letter said.\n\n“Quite obviously, the slate of candidates, if we may put it so, for consideration at the meeting appears to be constitutionally defective as both including a judge who ought not to be there and excluding one who ought to be (i.e. the fifth senior judge of the IHC). A legally permissible consideration of candidates appears therefore not to be possible in the present circumstances,” it added.\n\nPublished in Dawn, February 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:29:16.776Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890984/ihc-suggests-justice-dogars-elevation-to-supreme-court",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T01:47:42.000Z"
}
