{
  "title": "Malala Fund welcomes Pakistan’s new plan to address its national education crisis",
  "link": "https://www.app.com.pk/national/malala-fund-welcomes-pakistans-new-plan-to-address-its-national-education-crisis/",
  "date_published": "2024-05-17T15:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Malala Funds has welcomed Pakistan’s new education emergency plan to address its national education crises and bring more than 26 million out-of-school children into schools under the directives of Prime Minister Shehbaz Sharif.\nMalala Fund welcomes this news, which responds to demands from Pakistani activists, educators and civil society for the administration to take urgent action on girls’ education, said a press release on Friday.\nThrough the Education Emergency initiative, the government of Pakistan aims to make significant reductions to the overall number of children out of school. In a directive released from the Prime Minister’s office on Friday, the government has committed to allocating at least Rs25 billion to education over the next five years. This includes a commitment to increase its education budget from 1.7 per cent to four per cent of GDP.\n“The Education Emergency Initiative is a promising first step,” said Lena Alfi, Acting CEO of Malala Fund. “If Pakistan fulfils its commitment to double education spending over the next five years, it could change the trajectory of millions of girls’ lives for the better. Malala Fund looks forward to monitoring the progress of all commitments made to girls alongside our local partners and civil society.”\nThe directive also included commitments to fast-track teacher recruitment and support the development and expansion of nutritional, financial literacy, and science, technology, engineering, arts and mathematics (STEAM) programming for students.\nIn Pakistan, 12 million girls are out of school, and only 13 per cent of girls advance to grade 9. Malala Fund wants to help speed up progress.\nSince 2017, the Malala Fund has invested more than $12 million in local activists and organisations who are driving solutions to the education barriers girls in their communities face.  This work has focused on advocating for quality education, improved school infrastructure in rural regions and wider digital inclusion.\nMalala Fund has also worked in partnership with the Ministry of Federal Education and Professional Training over the last two years to improve girls’ access to STEAM education at public secondary schools across the country.\nIn his remarks at the National Education Emergency Conference in Islamabad last week, Prime Minister Sharif said: “Today, with iron conviction, and the support of provinces, we will handle the challenge of 26 million out-of-school children. We will bring them back to school…I declare from this moment an Emergency in Education all over Pakistan…The way we did it in Punjab, we will do it in Pakistan.”\nLeaders including Dr. Khalid Maqbool Siddiqui, Federal Minister for Education, and Mohyuddin Wani, Federal Secretary for Education, also endorsed the Prime Minister’s message. Conference attendees included diplomats, donor organisations, academics and members of civil society. The World Bank, UNICEF and the UK’s Foreign, Commonwealth & Development Office (FCDO) committed to continue investing in education in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:33:52.966Z"
}
