{
  "title": "Govt sets up Climate Change Authority",
  "link": "https://www.app.com.pk/national/govt-sets-up-climate-change-authority/",
  "date_published": "2024-05-17T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): The Federal Government on Friday established the country’s first “Climate Change Authority” under the Climate Change Act 2017.\nAccording to a notification of the Ministry of Climate Change and Environmental Coordination, the Authority was formed under sub section (1) of Section 5, of the Pakistan Climate Change Act No.X of 2017.\nThe three-judge Supreme Court bench comprising Justice Athar Minallah, Justice Syed Mansoor Ali Shah, and Justice Muhammad Ali Mazhar, in its judgment in the petition of Public Interest Law Association of Pakistan to highlight the existential threat of climate change, had ordered the Federal Government to establish the Climate Change Authority to cope with the risk of global warming and environmental degradation.\nAs per the Climate Change Act 2017, the Minister-in-charge of the Climate Ministry was responsible for establishing the Authority – a body corporate with perpetual succession and a common seal and capable of suing and being sued; acquiring or disposing of moveable and immovable property; borrowing money; entering into contracts; and doing or performing all other things or acts necessary for the proper discharge of its functions.\nThe Act also also mentions that the headquarters of the Authority will be in Islamabad and it may set up its offices at other places as per the requirement.\nThe Authority will comprise the Chairperson, Member (Adaptation), Member (Mitigation), Member (Climate Finance), Member (Coordination) and one member from each province to be nominated by the respective provincial ministers-in-charge.\nThe members including Chairperson of the Authority will be appointed by the prime minister, on such terms and conditions as he may deem fit, in view of their qualifications and experience.\nThe chairperson and members shall be scientists, academicians, professionals, serving or retired government servants, industrialists, agriculturists other technocrats with at least fifteen year’s experience in fields related to climate\nchange and the environment, with a distinguished service record.",
  "retrievedAt": "2025-08-11T02:33:31.038Z"
}
