{
  "title": "PM for launching national programme to combat child stunting in Pakistan",
  "link": "https://www.app.com.pk/national/pm-for-launching-national-programme-to-combat-child-stunting-in-pakistan/",
  "date_published": "2024-05-17T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP): Prime Minister Shehbaz Sharif on Friday directed to launch a nationwide programme in collaboration with the provincial governments to tackle the issue of child stunting in the country.\nChairing a high-level meeting here to discuss the critical issue of child stunting in the country, the prime minister also directed the concerned authorities to prepare a comprehensive plan to combat the chronic disease, population control and other health issues.\nHe said provision of the best nutrition to the children was important for a bright future of the country. “The government will take special measures on priority for the best growth of the children.”\nIn the meeting, the World Bank presented a comprehensive report on the data regarding growth of the children in Pakistan.\nHighlighting the root causes of child stunting, it was informed in the meeting that inadequate healthcare facilities, lack of essential nutrients, contaminated water, poor hygiene and lack of awareness about the disease were the main reasons of child stunting.\nFurthermore, data about other diseases such as Tuberculosis, Hepatitis, Diabetes in Pakistan was also presented in the meeting.\nThe prime minister stressed the need for a coordinated effort between the federal and provincial governments to address this critical issue.\nThe meeting was attended by Federal Ministers Ahsan Iqbal and Ahad Khan Cheema, Coordinator to the Prime Minister Malik Mukhtar Ahmed Bhurt, Deputy Chairman Planning Commission Jehanzeb Khan, and other senior government officials, as well as international experts from the World Bank, UNICEF, and other organizations.\nWorld Bank Country Director Naje Benhasain, UNICEF Representative in Pakistan Abdullah Fazil, World Food Program Representative in Pakistan and other world renowned experts, Chief Secretaries of the four provinces, Dr. Zavalafiqar Ali Bhutta, Dr. Sajid Sufi, Dr. Ijaz Nabi and world-renowned experts from related fields also attended the meeting.",
  "retrievedAt": "2025-08-11T02:33:30.516Z"
}
