{
  "title": "Education Minister asks NAVTTC to set appropriate quality standards",
  "link": "https://www.app.com.pk/national/education-minister-asks-navttc-to-set-appropriate-quality-standards/",
  "date_published": "2023-04-12T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 12 (APP):Federal Minister for Education and Professional Training Rana Tanveer Hussain Wednesday said that NAVTTC should set appropriate quality standards to ensure that Pakistani graduates from technical training institutes are accepted in foreign markets.\nHe stated this while taking a briefing from Chairman National Vocational and Technical Training Commission (NAVTTC) Shahid Khan.\nSenior officials of the ministry including Secretary Education Waseem Ajmal Chaudhry also attended the meeting.\nFurthermore, provincial DGs of NAVTTC were also present via online link.\nRana Tanveer Hussain said, “There is a dire need for NAVTTC to perform at its full capacity.”\nHe said, “It is imperative that our training is internationally accredited in order to ensure the acceptability of the Pakistani workforce in foreign markets such as Saudi Arabia, Japan, and Europe.”\nHe also highlighted the need to give equal importance to imparting technical education to women and trans-genders.\nRana Tanveer said that KSA offered to fully fund a technical institute that will aim at providing students the technical skills needed to succeed in KSA market.\nHe said that coordination with KSA on this project is on going and that it will become a platform for modern technical education for the Pakistani youth.\nHe emphasized the need to work diligently and complete the on going projects at maximum speed.\nHe urged the management to be pro-active in their approach and enhance the productivity of their institutions so that the youth of Pakistan can be put on the track to success.\nRana Tanveer said that it is the utmost duty of all of government departments to work with integrity and perform their duty in the most honest and productive manner.\nRana Tanveer said that there needs to be cohesion within departments as well. He emphasized the need to increase productivity in the most effective and efficient manner.",
  "retrievedAt": "2025-08-11T08:17:30.680Z"
}
