{
  "title": "Audiences losing interest in serious content, says drama writer Arshad Chahal",
  "author": null,
  "content": "ISLAMABAD, Jan 27 (APP):Renowned drama writer Arshad Chahal has expressed concern that audiences are losing interest in serious content that focuses on societal issues.\nTalking to APP on Monday, Arshad said that Iranian TV content is strong and has yet to gain popularity in the Pakistani industry.\nHe observed that audiences want to escape their problems and watch luxurious lifestyles on screen. However, he stressed that television’s role is not only to entertain but also to inform and educate people.\nSharing his career journey, he stated that he started by writing a Punjabi novel, “Cheerhan Di Chaan”, which was later dramatized by Pakistan Television (PTV). His novel earned him the Masood Khaddar Posh Award and Warish Shah Award from the Academy of Letters, he added.\nArshad Chahal highlighted that writing a drama is a serious task that requires extensive homework. He explained that writers must first decide on a subject, such as comedy or social issues and then develop a storyline with character details.\nHe noted that a writer can condense a story into a 50-minute episode or expand it into multiple episodes by adding character details and events.\nArshad Chahal differentiated between drama serials, which follow a story and soap operas, which focus on character development. He praised PTV for always following the story and concluding dramas in 13 episodes.\nCommenting on Turkish plays, Arshad Chahal said that initial productions like “Fatima Gul” and “Ishq e Mamnu” were outstanding, but later soap serials had unnecessary details.\nHe advocated for the production of dramas that tackle societal issues, behaviors and solutions, stressing the need for responsible storytelling.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:05:17.160Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/audiences-losing-interest-in-serious-content-says-drama-writer-arshad-chahal/",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T10:40:00.000Z"
}
