{
  "title": "Banks urged to halt branch closures in Sindh’s smaller cities",
  "author": null,
  "content": "ISLAMABAD, Jan 27 (APP):Senator Dost Ali Jeesar raised concerns in the Senate on Monday here about the growing trend of transferring bank branches from small cities in Sindh to larger urban centers, calling it a move that undermines the economic prospects of smaller towns.\nSpeaking on a point of public importance, the Dost Ali highlighted that key business hubs like Razaqabad and Dadu district had seen profitable bank branches relocated despite their significant role in facilitating local commerce. “If this trend continues, these towns will be left with no banks. All operations will shift to major cities like Karachi, Islamabad, Lahore, and Peshawar, depriving small cities of opportunities for business and banking services,” he warned.\nSenator Dost Ali stressed that such closures would hinder economic activities in these areas and urged the authorities to halt the process. “Even branches operating at a profit are being shifted. Licenses must come with conditions preventing unnecessary relocations,” the senator added.\nResponding to the concerns, Minister for Finance Senator Aurangzeb Khan assured that the government would take up the matter with the State Bank of Pakistan. “Currently, there are around 30 to 32 commercial banks in the country. These banks regularly assess their branch networks, making decisions based on factors such as high concentration of branches in a single area,” he said.\nAurangzeb further explained that the banking sector is shifting towards digital and branchless banking to enhance accessibility. “With advancements in mobile apps and digital banking, many transactions can now be conducted without visiting physical branches. Agent networks, including local grocery stores offering easy account openings and transactions, are emerging as alternatives to brick-and-mortar branches,” the minister explained.\nHe also assured the Senate that he would personally convey the senator’s concerns to the Governor of the State Bank of Pakistan and discuss the issue to address the matter appropriately.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:04:19.732Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/banks-urged-to-halt-branch-closures-in-sindhs-smaller-cities/",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T14:49:00.000Z"
}
