{
  "title": "Gas tariffs unchanged for domestic users following PM’s instructions: Musadik Malik",
  "author": null,
  "content": "ISLAMABAD, Jan 27 (APP): Federal Minister for Petroleum Dr. Musadik Malik on Monday said that in line with the directives from the Prime Minister, gas prices have not been increased for domestic consumers and several other key sectors.\nAddressing a press conference, he said that the decision also benefits special roti tandoors, general industry (process), commercial users, CNG, cement, fertilizer, and the power sectors.\n“Our proposal to increase gas prices was rejected by the Prime Minister to provide relief to financially struggling citizens,” he said.\nHe said that 64 percent of gas consumers belong to economically weaker segments, and the Prime Minister has ensured they are shielded from price hikes.\nDr. Malik shared that while the Oil and Gas Regulatory Authority (OGRA) recommended a rate of Rs. 1,770/MMBTU for domestic consumers, the Prime Minister dismissed the suggestion.\n“This decision directly benefits the lower-income population,” he said. Currently, domestic consumers are charged Rs. 200/MMBTU, a rate significantly lower than OGRA’s proposed amount.\nHowever, the minister mentioned that the gas sale price for the General Industry (Captive) category has been increased from Rs. 3,000/MMBTU to Rs. 3,500/MMBTU. He clarified that this price adjustment was part of an agreement signed by the previous) government with the International Monetary Fund (IMF).\nHighlighting challenges faced by industries in Karachi, he said, out that only 18 out of 2,500 industrial units generate captive power at Rs. 13 per unit, while others purchase electricity from K-Electric at Rs. 60 per unit. This disparity places the latter group at a considerable competitive disadvantage.\nDr. Musadik Malik underscored the government’s commitment to improving the lives of ordinary citizens by creating job opportunities and curbing inflation.\nHe reported a significant reduction in inflation, which dropped from 38 percent to 4.1 percent as of December. Prices of daily essentials for the poor fell by 0.8 percent, while food inflation decreased by 2.5 percent.\nHe said, rural areas, home to 60 percent of the population, also experienced notable reductions in inflation.\nThe minister highlighted the government’s success in reducing gas theft and expressed optimism about further improvements.\nHe said, that there was a decline in the policy rate from 23 percent to 12 percent, signalling a positive economic trajectory.\nDr. Musadik Malik criticized the previous PTI administration for alleged mismanagement, claiming it provided $4 billion in interest-free benefits to the wealthy. He also accused the PTI government of using £190 million, recovered by the UK National Crime Agency, to pay a court fine imposed on real estate tycoon Malik Riaz. “This is corruption,” he asserted, adding that 450 kanals of land had been claimed from Malik Riaz.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:04:22.469Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/gas-tariffs-unchanged-for-domestic-users-following-pms-instructions-musadik-malik/",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T13:46:00.000Z"
}
