{
  "title": "Naqvi strengthens Pak-US ties in key meeting with congressman Alexander Green",
  "author": null,
  "content": "ISLAMABAD, Jan 27 (APP):Federal Minister for Interior Mohsin Naqvi held an important meeting with US congressman Alexander Green, a prominent member of the Congressional Finance Committee, to discuss mutual interests and strengthen Pakistan-U.S. relations.\nDuring the meeting, Naqvi highlighted the challenges Pakistan faces, including incidents of terrorism and cross-border infiltration from Afghanistan. He also expressed his appreciation for Congressman Green’s consistent support for Pakistan, particularly his assistance to earthquake and flood victims.\nThe minister commended Green’s principled stance on the Palestine issue, acknowledging his vocal support for the cause as “commendable and widely appreciated.”\n“Pakistan-U.S. relations are experiencing a positive shift,” said Naqvi, expressing optimism about further strengthening ties between the two nations in the coming days.\nCongressman Green reaffirmed his commitment to fostering goodwill, announcing plans to visit Pakistan again soon. “I have visited Pakistan four times to support its people during natural disasters, and I will continue to stand in solidarity with them,” he said.\nThe meeting was attended by Pakistan’s Consul General in Houston, Muhammad Aftab Chaudhry, and prominent Pakistani-American businessman Tahir Javed, who lauded the growing cooperation between the two countries.\nThis high-level engagement underscores the mutual commitment to enhancing diplomatic and humanitarian collaboration between Pakistan and the United States.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:05:38.981Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/naqvi-strengthens-pak-us-ties-in-key-meeting-with-congressman-alexander-green/",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T09:26:00.000Z"
}
