{
  "title": "Cabinet Committee on rightsizing reviews federal ministries progress, ministry of railways rightsizing plan",
  "author": null,
  "content": "ISLAMABAD, Jan 27 (APP):A meeting of the Cabinet Committee on Rightsizing of the Federal Government on Monday chaired by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb to review progress on the implementation of rightsizing measures across federal ministries and deliberated on the rightsizing plan of the Ministry of Railways.\nThe Establishment Division informed the minister about receiving confirmations from 29 ministries and one constitutional body regarding the abolition of 11,877 posts and 4,660 dying posts, said a news release.\nAurangzeb commended the implementation of the committee’s decisions and acknowledged the efforts of the ministries and departments involved.\nThe Ministry of Railways presented a detailed overview of its rightsizing initiatives. The committee was apprised that out of 95,859 sanctioned posts in the ministry, 17,101 posts have already been abolished, while 5,695 posts are in the process of being abolished.\nFurthermore, 15,000 additional posts are planned to be eliminated in the near future as part of the ministry’s rightsizing efforts.\nThe presentation highlighted measures aimed at enhancing operational efficiency and optimizing resources, focusing on aligning the ministry’s functions with its core mandate and reducing redundant posts.\nDiscussions emphasized the importance of modernizing Pakistan Railways and ensuring its operations remain efficient and effective.\nThe committee decided to refer the case to the Sub-Committee on Rightsizing for further review and implementation of the proposed measures.\nThe meeting concluded with a directive to continue implementing rightsizing measures across federal ministries in a phased manner to achieve effectiveness, efficiency, and sustainable policy outcomes.\nThe meeting was attended by Minister of State for Finance and Revenue Ali Parvez Malik, Members of National Assembly, Federal Secretaries, and senior officers from relevant ministries and divisions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:03:54.795Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cabinet-committee-on-rightsizing-reviews-federal-ministries-progress-ministry-of-railways-rightsizing-plan/",
  "dateList": "2025-01-27",
  "date_published": "2025-01-27T16:37:00.000Z"
}
