{
  "article_id": "2025-01-13_0cf6f5767fcb258fc2da766c7b25cb99",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884764/roadshow-marks-return-of-pia-flights-to-paris",
    "retrieved_at": "2025-10-12T00:49:03.090Z"
  },
  "metadata": {
    "title": "Roadshow marks return of PIA flights to Paris - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:22.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678448cb18911.jpg",
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI: A roadshow was held in capital of France to mark the resumption of PIA flights to Paris. A large number of Pakistanis and travel agents from across France and Europe participated in the roadshow which was held at a local hotel in Paris, a spokesman for PIA said. During the ceremony, Pakistanis told the PIA administration that they faced numerous problems due to suspension of flights of the national airline. The Pakistani community demanded the PIA management to resume flights to other European cities to facilitate Pakistanis. After resumption of PIA flights to and from Europe, there has been a clear decrease in fares of other airlines operating to Pakistan, the spokesman said. Bringing bodies of Pakistanis back to Pakistan from European countries used to cost thousands of dollars and entailed severe hardship and suffering. After resumption of PIA flights, this facility will now be provided free of charge, PIA's Chief Commercial Officer (CCO) Nausherwan Adil announced this on the occasion. He said PIA will commercially expand its network in Europe and it will provide facility to bring bodies of fellow citizens from European countries to Pakistan free of cost. He said PIA plans to commercially extend its network in Europe. The national flag carrier resumed its flights to Europe on Friday after a ban of four and a half years. Published in Dawn, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}