{
  "article_id": "2025-01-13_ccce515595bc0e64df02ee6eb2a1e7e0",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884936/fo-condemns-increasingly-racist-islamophobic-discourse-on-pakistanis-in-uk",
    "retrieved_at": "2025-08-26T07:38:59.725Z"
  },
  "metadata": {
    "title": "FO condemns ‘increasingly racist, Islamophobic’ discourse on Pakistanis in UK - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T13:54:41.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/131913080eef190.png",
    "categories": [],
    "word_count": 460,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "The Foreign Office (FO) on Monday condemned what it called the \"increasingly racist and Islamophobic\" comments directed at Pakistanis in the UK, emphasising the deep relations between both countries as well as the contributions of British Pakistanis. The statement came after tech billionaire Elon Musk entered a contentious debate surrounding the term \"Asian grooming gangs\", with remarks sparking concerns of perpetuating harmful anti-Pakistani stereotypes. Musk attacked the UK government over grooming gangs, using his platform X to accuse one key Labour leader of being a \"rape genocide apologist\", and calling for her and British Prime Minister Keir Starmer to be jailed. Priyanka Chaturvedi, a leader of India's Uddhav Thackeray-led Shiv Sena, wrote on X, \"Repeat after me, they aren't ASIAN Grooming Gangs but PAKISTANI grooming gangs.\" Musk replied with a terse \"true,\" signalling his support for her remarks. The term \"grooming gangs\" stems from the widespread abuse of girls in several English towns and cities, which emerged more than a decade ago. A series of court cases eventually led to the convictions of dozens of men, mostly of South Asian Muslim origin. The victims were vulnerable, mostly white, girls. The scandals have been seized upon by far-right figures, in particular Tommy Robinson, a prominent extremist agitator. FO spokesperson Shafqat Ali Khan delivered a statement on Monday in response to the growing anti-Pakistani discourse observed in the UK. \"As such, we note with deep concern the increasingly racist and Islamophobic political and media commentary in the UK that is aimed at conflating the reprehensible actions of a few individuals with the entire 1.7 million British Pakistani diaspora.\" He added that Pakistan-UK friendship was characterised by warmth, cordiality, robust cooperation and trust. \"Nurtured over decades this relationship remains an important priority of Pakistan's foreign policy,\" Khan said. He emphasised that the \"deep and multifaceted relations\" between the two countries cover a wide range of fields, including trade and investment and counter-terrorism. \"The presence of 1.7 million strong British-Pakistani diaspora provides the strongest link between the two friendly countries,\" Khan added. He maintained that British nationals of Pakistani origin have contributed to the United Kingdom's growth and development, with a large number of predominantly Muslim soldiers having served in the British Indian army in both World Wars. \"British Pakistanis today form the backbone of the UK's health, retail and services sectors,\" Khan continued. \"Many British Pakistanis hold high public office, and thousands serve their communities as Members of Parliament, mayors, councillors, and as members of local police and municipal services.\" Khan highlighted the contributions of British Pakistanis in sports and arts, noting, \"Their cuisine and music enriches British culture.\" \"To demonise such a large and diverse community on the basis of the actions of a few individuals needs to be condemned,\" Khan said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}