{
  "article_id": "2025-01-13_e794bff8792f9921c56e4d1c5f937a20",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884931/bangladesh-files-graft-cases-against-ousted-leader-sheikh-hasinas-family",
    "retrieved_at": "2025-08-26T07:39:00.688Z"
  },
  "metadata": {
    "title": "Bangladesh files graft cases against ousted leader Sheikh Hasina’s family - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T12:22:41.000Z",
    "image_url": "https://i.dawn.com/medium/2024/08/06105535452c32a.jpg?r=120307",
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Bangladesh's anti-graft commission has filed cases against ousted leader Sheikh Hasina and her family, including a British government minister and a senior United Nations official, its chief said on Monday. Hasina, 77, fled a revolution in August 2024 to India, where she has defied extradition requests from Bangladesh to face charges including mass murder. The cases are linked to an alleged large-scale land grab of lucrative plots in a suburb of the densely populated capital Dhaka. \"Sheikh Hasina, in collaboration with some officials, allocated plots for herself and her family members,\" Anti-Corruption Commission (ACC) director general Akhter Hossain told reporters. Hossain said those named in the case also include Hasina's niece, British anti-corruption minister Tulip Siddiq. She has insisted she has done nothing wrong. Hasina's daughter Saima Wazed, the World Health Organisation's South East Asia chief, is also listed. There was no immediate response from Wazed. \"The ACC investigation team has obtained the necessary documents and found sufficient evidence to file the cases,\" Hossain told AFP. \"They will include relevant details, such as property acquisitions while conducting further investigations.\" Hasina's son Sajeeb Wazed Joy is also named, as well as Hasina's sister Sheikh Rehana, Siddiq's mother. Siddiq referred herself this month to the standards adviser of British Prime Minister Keir Starmer. The referral came after British newspapers The Sunday Times and Financial Times reported that she had lived in properties linked to Hasina's administration. Bangladesh's anti-corruption commission also launched a probe in December into the alleged embezzlement by Hasina's family of $5 billion connected to a Russian-funded nuclear power plant. The kickback allegations relate to the $12.65bn Rooppur nuclear plant, which was bankrolled by Moscow with a 90 per cent loan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}