{
  "article_id": "2025-01-13_abe66f9a6bf6f0b0f0fd676b779d129b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884782/murder-suspect-killed-in-alleged-police-encounter-in-rawalpindi",
    "retrieved_at": "2025-08-26T07:39:17.699Z"
  },
  "metadata": {
    "title": "Murder suspect killed in alleged police encounter in Rawalpindi - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:19:10.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 474,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "RAWALPINDI: A suspect arrested in connection with a murder case was killed in an alleged police encounter in Rawalpindi, police said on Sunday. According to a spokesperson for the Rawalpindi police, the case unfolded when accomplices of the suspect tried to free him from police custody while he was being taken to the crime scene for recovery of the weapon used in his alleged crime. He said when the police team along with the suspect entered the jurisdiction of Pirwadhai police station, armed accomplices of the man in custody ambushed them. \"In the midst of the frenzy, the suspect identified as Mehr Ali tried to escape. However, the police chased him down. Instead of surrendering to the police, he opened gunfire at the police and was killed in the ensuing battle,\" the spokesperson said. He further said Mehr Ali was arrested during the investigation of a case registered with the city police station. According to the First Information Report (FIR), a man named Mohsin reportedly went missing after leaving his house to see Mehr Ali at his Adiala Road home. The complainant told the police that the victim had Rs4.3 million at the time he went missing. The local police launched an investigation and arrested Mehr Ali on suspicion of the murder. He was presented before a court and a six-day physical remand was acquired. During interrogation, he allegedly confessed to killing Mohsin out of monetary greed and dismembering his body before dumping the remains at a deserted plot. However, police said that on Saturday night when the police took him to the crime scene, they were ambushed en route by the suspect's accomplices. The police spokesperson further said at the time of the encounter, a Pirwadhai police team was also present in the area for snap-checking. The suspect died of gunshot wounds. Separately on Sunday, Rawalpindi City Police Officer (CPO) Syed Khalid Hamdani held a farewell ceremony at the Police Lines Headquarters in honour of the transfer of two senior police officers of Rawalpindi police. The transferred officers include Senior Superintendent of Police (SSP) Operations retired Flight Lieutenant Hafiz Kamran Asghar and Pothohar Superintendent of Police (SP) Nasir Nawaz. The ceremony was attended by CPO Rawalpindi Syed Khalid Hamdani, Chief Traffic Officer (CTO) Beenish Fatima, SP CIA Taimoor Khan, SP security, divisional SPs, SDPOs and other senior officers. The Rawalpindi CPO and other officers expressed their best wishes for the future of the transferred officers. Honorary shields and gifts were given to the transferred officers by the CPO who said that the transferred officers worked very hard during their postings. \"The valuable services of retired Flight Lieutenant Hafiz Kamran Asghar and SP Nasir Nawaz to Rawalpindi police are commendable,\" he said. CPO Hamdani and other officers expressed their best wishes for the future of the transferred officers. Published in Dawn, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}