{
  "article_id": "2025-01-13_7b798201472845dc8a64d5dd2c665396",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884744/startup-funding-tough-but-not-terrible",
    "retrieved_at": "2025-08-26T07:39:32.940Z"
  },
  "metadata": {
    "title": "Startup funding — tough, but not terrible - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:36.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/13163918d02420b.png",
    "categories": [],
    "word_count": 949,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "Percentage changes are usually quite deceiving as they have a great ability to make metrics look better or worse than they are in reality. Consider December's inflation as a case in point: at 4.1 per cent, it implies economic stabilisation even if one major underlying reason is the high base of the index. It also works the other way around, particularly for production-related indicators where activity is finally 'growing' again after multi-year lows. But when it comes to Pakistani startups, even percentages fail to work their magic as the low base continues to get smaller. This was the story of 2024 as funding clocked in at $22.5 million, plunging 70pc over the previous year, which itself had recorded a 77pc dip. As a result, the total investment receded well below the 2019 levels, when the local ecosystem was still quite nascent and hardly any of the current venture funds even launched. Similarly, the number of deals declined further to just 15, worse than even the 2018 reading. Dismal as the headline numbers may appear, the reality was at least slightly better, even if far from good. For starters, the amount is significantly understated as nine of the 15 announced deals didn't disclose the actual dollar value. While the majority of the rounds happened to be at seed or earlier stages, there was one Pre-Series A and another Series A in the mix. Safe to assume they would have raked in seven-figure transactions. On the flip side, this happens every year, as many startups prefer to keep the amounts private when issuing investment press releases. In 2024, the average deal size clocked in at $3.75m, 68pc higher than the previous year Secondly, and perhaps more importantly, we saw some activity in non-equity financing as well. During the year, at least three startups raised debt, with Abhi getting a $15m credit line and Neem another $4m. On the other hand, Shark Tank Pakistan also brought in a fresh funding avenue to local businesses through an entirely different format and saw some massive announcements. How this show promotes entrepreneurship in the country will perhaps be easier to assess: the bigger challenge is whether it will be successful in encouraging local investors to deploy their capital beyond the traditional asset classes like real estate. But all of these changes will take time, so let's stick to the data we have instead of using the same boilerplate statements. In 2024, the average deal size clocked in at $3.75m, 68pc higher than the previous year, again because only six companies announced the round amount and happened to be not as early stage. Overall, a third of the deals were seed while another four were Pre-Series A and two came at Series A. Sector-wise, e-commerce led in volumes with five deals worth a disclosed $8.5m, substantially down from last year. Meanwhile fintech came on top value-wise, at $10.5m across four rounds. transport & logistics, once a heavyweight, did not see any activity whatsoever. Finally, we saw some signs of mergers and acquisitions, notably Turkiye's Papara buying Sadapay at a reported price range of $30-50m. There was some consolidation at even earlier stages as Elphinstone acquired Trikl. But don't get too excited as yet as such transactions remain largely stock-based, offering little, if any, actual returns to the founders. It may still be a long while before we see any healthy pathway towards exits. For the last many quarters, any mention of Pakistan's miniscule absolute numbers and massive percentage declines is followed by a primer on monetary policy, the Federal Reserve and asset allocation. Numbers are put in a global and regional context to highlight how our trend mirrors most other markets, even if the scale doesn't. Well, 2024 wasn't any of that, at least from a bird's eye view. Specifically, during 4QFY24, total global funding breached the $100 billion mark for the first time in eight quarters. At $108.8bn, it was also the highest amount since 2QFY19 and rose 34pc year-on-year, the steepest increase from 2022 onwards. However, the global deal count remained depressed compared to past standards, slipping 31pc YoY and clocked in at 7,023 - the lowest on record. Naturally, this means that average ticket sizes are getting bigger and all the credit for that goes to artificial intelligence (AI). In fact, AI drove the bulk of the activity in 2024 and accounted for 35.7pc of dollar value - 11 percentage points higher than the previous year and almost twice compared to 2022 levels. In 4QFY24, the sector's share in investment stood at an astounding 50.8pc, raising more than all others combined. Though AI's contribution to volumes was not as dominant, it still came in at a record 23.4pc. This is despite the sector's deal count slipping to 1,818 - under 2,000 for the first time in 16 quarters and the lowest since 3QFY20. But for now, the love affair between AI and venture capital seems to be geographical in nature with North America alone receiving 75.3pc of all dollars and 50.3pc of deals in the sector during 2024. For all regions except Latin America, the share of AI in their respective capital raised went up compared to the previous years, even if the numbers weren't big enough to either make a meaningful dent in the global pie or their respective continental aggregates. What this great divergence means for Pakistan's ability to attract risk capital is probably a bigger question, especially considering our virtual absence from anything truly innovative or requiring research and development. Unfortunately, answers to these fall well beyond my aptitude or mandate. The writer is the co-founder of Data Darbar Published in Dawn, The Business and Finance Weekly, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}