{
  "article_id": "2025-01-13_c7d99d85af1396ed55a2bc36e23f61a6",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884766/us-lawmaker-looks-to-scrap-pakistans-non-nato-ally-status",
    "retrieved_at": "2025-10-12T00:50:03.571Z"
  },
  "metadata": {
    "title": "US lawmaker looks to scrap Pakistan’s ‘non-Nato ally’ status - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:22.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 575,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "WASHINGTON: Congressman Andy Biggs, a far-right Republican from Arizona known for his hard-line positions, has reintroduced legislation to revoke Pakistan's status as a major non-Nato ally (MNNA), a designation the country has held since 2004. However, the legislation focuses on action against the Haqqani Network, which the US State Department designated as a foreign terrorist organisation in Sept 2012. Analysts highlighted that even if the bill were adopted, its practical impact might be limited, especially since Sirajuddin Haqqani -the son of Haqqani Network founder Jalaluddin Haqqani - is currently serving as the interim foreign minister of Afghanistan. The US, it should be noted, continues to engage with Afghanistan through the Doha process. Bill among four put forward by far-right Republican; analysts say practical impact of move will be limited Last week, Biggs submitted four legislative proposals, including the bill aimed at terminating Pakistan's MNNA status. He currently serves as the chairman of the House Judiciary Committee's Subcommittee on Crime and Federal Government Surveillance. The bill, titled \"To terminate the designation of the Islamic Republic of Pakistan as a major non-NATO ally, and for other purposes,\" has been referred to the Committee on Foreign Affairs. The proposed legislation calls for the revocation of Pakistan's MNNA designation under Section 517(a)(1) of the Foreign Assistance Act of 1961, unless the US president certifies that Pakistan is committed to: conducting military operations that significantly disrupt the Haqqani Network's safe havens in Pakistan; preventing the Haqqani Network from using Pakistani territory as a sanctuary; actively coordinating with Afghanistan to restrict militant movement along the Afghan-Pakistan border; and arresting and prosecuting senior and mid-level leaders of the Haqqani Network. The bill would also prohibit the president from reinstating Pakistan's MNNA designation until these conditions are met. Pakistan was granted MNNA status in 2004 by then-President George W. Bush, enabling it to access benefits such as military training, defence cooperation, and grant aid. The designation is intended to strengthen strategic partnerships and improve defence capabilities. Observers noted that Congressman Biggs has introduced similar bills multiple times since 2019, though none have progressed to a House vote. \"This is a recurring initiative by Biggs,\" said one diplomatic source, adding that his efforts align with attempts during the Trump administration to pressurise Pakistan. \"President Trump had already suspended military aid to Pakistan,\" one expert noted. \"This appears to be part of a broader push to pressure Pakistan to distance itself from China. Ironically, such measures could have the opposite effect, pushing Islamabad closer to Beijing.\" The fate of the proposed legislation depends on whether it is brought to the floor for debate in the House and Senate. Biggs' legislative agenda Congressman Biggs has introduced several contentious bills alongside this one. These include a resolution urging the House to reject the legitimacy of the International Criminal Court (ICC), which recently issued arrest warrants for Israeli Prime Minister Benjamin Netanyahu over actions in Gaza. Another bill seeks to eliminate all US funding to the World Health Organization (WHO), which has been accused by the Israeli government of supporting Hamas in Gaza - claims the United Nations has categorically denied. As chair of the Freedom Caucus, often associated with far-right populist positions, Biggs has taken polarizing stances on several issues. He opposes elective abortion rights, rejects the scientific consensus on climate change, and voted against establishing 'Juneteenth' as a federal holiday in 2021, commemorating the end of slavery in the US. Published in Dawn, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}