{
  "article_id": "2025-01-13_5f4cb6d1172e60d59801f9e3b3454e02",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884836/new-zealand-recall-proven-trio-for-champions-trophy",
    "retrieved_at": "2025-08-26T07:39:31.196Z"
  },
  "metadata": {
    "title": "New Zealand recall proven trio for Champions Trophy - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:43.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 331,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "WELLINGTON: Seasoned players Kane Williamson, Devon Conway and Lockie Ferguson were recalled on Sunday to an experienced New Zealand squad to contest the ICC Champions Trophy one-day tournament. The key trio were unavailable for the just-completed home ODI series against Sri Lanka because of offshore T20 commitments. Batters Williamson and Conway have been playing in South Africa's T20 league while pace bowler Ferguson is involved in Australia's Big Bash competition. Ben Sears was also selected for the ICC tournament co-hosted by Pakistan and the UAE, having missed the 2-1 series win over Sri Lanka with a knee injury. It will be the first senior ICC event for Sears and fellow pace bowlers Will O'Rourke and Nathan Smith. Matt Henry will lead the New Zealand attack after the international retirements of stalwarts Trent Boult and Tim Southee with Lockie Ferguson making up a five-strong pace battery. Coach Gary Stead will oversee a squad he said also boasted experience and depth. \"We're currently blessed with a lot of quality players and that certainly made for some challenging selection discussions,\" Stead said. \"We've gone with the squad that will offer us the best options to perform well in the expected conditions in Pakistan and the UAE.\" Spin bowler Mitchell Santner will lead New Zealand at a major event for the first time, after being named full-time white ball captain in December. Santner, former skipper Williamson and wicket-keeper Tom Latham were all part of the New Zealand squad for the last edition of the Champions Trophy, in England and Wales in 2017. New Zealand will play warm-up matches against Pakistan, South Africa and Afghanistan in Karachi before playing the tournament's opening match against Pakistan in Karachi on Feb 19, followed by pool games against Bangladesh and India. Squad: Mitchell Santner (captain), Will Young, Devon Conway, Rachin Ravindra, Kane Williamson, Mark Chapman, Daryl Mitchell, Tom Latham, Glenn Phillips, Michael Bracewell, Nathan Smith, Matt Henry, Lockie Ferguson, Ben Sears, Will O'Rourke. Published in Dawn, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}