{
  "article_id": "2025-01-13_02e943a7f362873f028e179e09dd24fd",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884835/sabalenka-zverev-shine-after-rain-stops-play-in-melbourne",
    "retrieved_at": "2025-08-26T07:39:30.981Z"
  },
  "metadata": {
    "title": "Sabalenka, Zverev shine after rain stops play in Melbourne - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:43.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6784625924a5d.gif",
    "categories": [],
    "word_count": 865,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "MELBOURNE: Aryna Sabalenka opened her bid for a third straight Australian Open title with a 6-3, 6-2 victory over Sloane Stephens on Sunday after rain had washed away a good chunk of play on the opening day at Melbourne Park. The top seed did not have it all her own way against the 2017 US Open champion but wrapped up the win in little more than an hour on Rod Laver Arena, one of three courts where play continued under closed roofs during the deluge. Margaret Court Arena and John Cain Arena are the other two. Men's second seed Alexander Zverev, seeking a maiden Grand Slam title, made a dominant start to his bid as he closed out the evening session on the main showcourt with a 6-4, 6-4, 6-4 victory over 2019 semi-finalist Lucas Pouille. Olympic champion Zheng Qinwen, who lost to Sabalenka in last year's final, reached the second round indoors, while men's sixth seed Casper Ruud and former world number four Kei Nishikori dodged the wet weather to secure five-set victories. It was another matter on the outside courts where play ended after less than an hour in the morning and did not resume until more than six hours later in the early evening. Eight of the 32 scheduled singles matches were scratched and organisers will be giving thanks for the cushion of the extra day which was first added to the tournament last year. One of the benefits of winning three Grand Slam titles is preferential scheduling and the roof of Rod Laver Arena was open again to the evening sun as Sabalenka took to court to face American Stephens. Five breaks of serve, 20 winners and 21 unforced errors later and the Belarusian was leading the crowd in an impromptu dance, having secured a second-round clash with Spain's Jessica Bouzas Maneiro, who beat Britain's Sonay Kartal 6-1, 7-6(5). \"It's not like I played my best match, probably, but I was glad to close it out in straight sets,\" the 26-year-old said. \"I love playing here, it feels like home.\" Zverev was equally impressive despite not hitting top gear as he began his quest to become the first German man to claim a major since Boris Becker at Melbourne Park in 1996. Frenchman Pouille tried his best to resist Zverev in the third set, but the world number 103 who has endured injury problems in recent years faded away. \"Lucas is somebody who when healthy isn't the ranking that he is,\" Zverev said. \"He's a great player, so I wish him all the best.\" At the start of the day, the roofs of the showcourts were already closed before a violent thunderstorm brought the first rain and Zheng and Romanian qualifier Anca Todoni played out their baseline battle uninterrupted. Fifth seed Zheng, who did not play a warm-up tournament, struggled against the tall Todoni in the first set, finally breaking for 4-3 only to be broken back. The 22-year-old saved a set point before clinching the tiebreaker 7-3 and quickly raced to a 3-0 lead in the second while Todoni racked up unforced errors as she fought to stay in the contest. \"The first match is never easy and I made some stupid mistakes,\" Zheng said after wrapping up her 7-6(3), 6-1 win in a shade under two hours. Earlier, Mirra Andreeva was the first player to reach the second round when the 17-year-old Russian beat Czech Marie Bouzkova 6-3, 6-3 on John Cain Arena. Women's 11th seed Paula Badosa, 18th seed Donna Vekic and 2021 US Open champion Leylah Fernandez also progressed. Badosa downed China's Xinyu Wang 6-3, 7-6(5), Vekic beat Diane Parry of France 6-4, 6-4 and Fernandez defeated Ukraine's Yuliia Starodubtseva 7-5, 6-4. Clara Tauson of the Norway came from a set down to beat Czech Republic's Linda Noskova - who last year ousted world no 2 Iga Swiatek in Australian Open - 5-7, 6-3, 6-4. On Margaret Court Arena, Arthur Fils was the first man into second round when he came from a set down to beat unseeded Finn Otto Virtanen 3-6, 7-6(4), 6-4, 6-4. \"It's pretty nice, man. First time in my life I'm playing on a good court,\" the 20th seeded Frenchman said. \"To be able to play a match and to finish a match with a roof, it's much more easy than to play, to stop with the rain.\" The other two early men's matches were much longer with Norwegian Ruud advancing after a 6-3, 1-6, 7-5, 2-6, 6-1 victory over Jaume Munar and Japan's Nishikori prevailing 4-6, 6-7(4), 7-5, 6-2, 6-3 against Brazilian qualifier Thiago Monteiro. \"He deserved to win today but somehow I fought through,\" said Nishikori, who was playing at Melbourne Park for the first time in four years after a horror run of injuries. Qualifier Hady Habib gave Lebanese fans reason to cheer by becoming the first man from his nation to win a singles main draw match at a Grand Slam in the professional era with a 7-6(4), 6-4, 7-6(6) win over China's Bu Yunchaokete. Habib will next face French 14th seed Ugo Humbert, who ground past Italy's Matteo Gigante 7-6(5), 7-5, 6-4. Published in Dawn, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}