{
  "article_id": "2025-01-13_e41c5d661b1e71251764a6458665eacb",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884747/pension-pain",
    "retrieved_at": "2025-08-26T07:39:33.009Z"
  },
  "metadata": {
    "title": "Pension pain - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:37.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6783e9ac7bb4e.gif",
    "categories": [],
    "word_count": 253,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "\"In about seven to eight years, the pension budget will be more than the defence budget if it is not handled properly,\" said Miftah Ismail, former finance minister of Pakistan. It has ballooned steeply over the last three years, crossing Rs1tr in FY25. \"When a man retires, he gets a pension. After he dies, his wife gets a pension. After his wife dies, his daughter gets the pension,\" he explained. Then there is double- and triple-dipping, the same person drawing multiple pensions because of the system's inefficiencies. A lot of the reforms needed are low-hanging fruits in terms of streamlining processes and transparency, he added. To put it in perspective, the pension budget is more than 6x the allocations for protecting the environment (Rs7.2bn), housing (Rs28bn), health (Rs28bn) and education (Rs167bn) combined. Military pensions comprise over 65pc of the budget in FY25. The government has recently taken broad measures to curtail the pension budget, including discontinuing multiple pensions for individuals, reducing the basis for calculating future increases, and switching pension calculations from the last drawn salary to an average of receipts in the previous two years of service. Like many other problems that have been addressed only when they become time bombs, this, too, has been languishing for years because of a lack of political will by those who have power. These reforms do not aim to bring down the pension budget, it just reduces the rate of increase for its allocation. Published in Dawn, The Business and Finance Weekly, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}