{
  "article_id": "2025-01-13_8bb410fe7f848c86324e14f8e3c3e470",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884741/finance-the-three-fs-of-economy",
    "retrieved_at": "2025-08-26T07:39:32.491Z"
  },
  "metadata": {
    "title": "Finance: The three “Fs” of economy - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-13T01:18:37.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 873,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "The United Arab Emirates has agreed to roll over its $2 billion debt due for repayment this month. This decision should help the State Bank keep the rupee stable amidst the expanding trade deficit. Meanwhile, Pakistan is taking two commendable steps - one under International Monetary Fund pressure and the other in response to shifting geopolitical realities - to strengthen its economy. The hybrid regime has finally resolved to downsize the bloated government, which consumes a significant portion of the country's annual revenue. Additionally, it has begun implementing its 'look towards the East' policy to generate export earnings and attract foreign investment. This strategic pivot seeks to reduce reliance on Western markets, where political constraints are making it increasingly difficult to promote exports and secure investments. Pakistan is now prioritising Gulf countries for foreign investment, while aiming to unlock greater trade potential with China, Bangladesh, Japan, South Korea, Singapore, Indonesia, Malaysia and Iran. It has also signalled a willingness to normalise trade relations with India under specific conditions. The Uraan plan must prioritise food security, female empowerment, and financial inclusion to incur any meaningful change in the country Both short-term measures, such as securing debt rollovers, and long-term initiatives, such as focusing on eastern markets and rightsizing the government, are vital under the current circumstances. These steps, if executed effectively, could yield positive outcomes for the economy. However, for long-term, sustainable development, the recently unveiled Uraan Pakistan plan must prioritise three critical areas: food security, female empowerment and financial inclusion. A foreign exchange-starved country like Pakistan cannot hope to boost export earnings sustainably if a significant portion of its population continues to face food shortages while a large share of export revenue is derived from food exports. According to a recent report in Dawn, 22 per cent of Pakistanis - about 52.8 million people out of a total population of 240m - are facing high levels of food insecurity. This alarming statistic is official, mind you, drawn from the latest bulletin published by the Ministry of National Health Services. Simultaneously, food exports account for a substantial share (23pc) of Pakistan's total export earnings (July-November 2024). With the textile sector crippled by shortages of domestically produced cotton, costly and unreliable electricity supplies, and interrupted gas deliveries, food exports have become a key source of foreign exchange. However, the reliance on food exports comes with significant challenges. Most of these earnings are generated from commodities such as rice grains rather than highly processed, value-added food products. In periods of higher food exports, the domestic market often experiences a spike in food prices, putting basic food items out of reach for millions of Pakistanis and worsening the food security crisis; addressing this issue must be a top priority. The government needs to balance the goals of boosting export revenue and ensuring affordable food supplies for the domestic population. This requires investments in agricultural technology, better supply chain management, and policies aimed at promoting the export of processed food products that fetch higher prices internationally. Women, who make up slightly more than half of Pakistan's population, remain an untapped resource for economic progress. However, systemic barriers continue to prevent their full participation in the economy. According to the World Bank, Pakistan's female labour force participation rate is only 25.4pc, compared to 83.7pc for men. This disparity is driven by limited access to education, restrictions on mobility, and a lack of safe and supportive work environments. Moreover, cultural and social norms often restrict women's access to opportunities, such as owning smartphones, pursuing higher education, or working alongside men in farms, factories, and offices. Addressing these issues is essential for empowering women to contribute meaningfully to the economy. Politically, women's representation remains low, with only 20.5pc of parliamentary seats held by women as of February 2024. Increasing women's participation in decision-making roles is critical for driving policies that address gender disparities and empower women in all spheres of life. Financial inclusion is another key area where Pakistan lags behind its regional counterparts. Currently, Pakistan ranks just above war-torn Afghanistan in terms of financial inclusion. Only 13pc of women in Pakistan have access to financial accounts, compared to 34pc of men. This stark gender gap reflects the broader structural barriers to women's economic empowerment. In response to this issue, the Asian Development Bank approved $155.5m in financing in 2024 to support reforms aimed at enhancing women's access to financial services. Initiatives such as microcredit schemes for women entrepreneurs, mobile banking solutions, and financial literacy programs are vital for improving financial inclusion. By enabling more women to participate in the financial system, Pakistan can unlock new avenues for economic growth and reduce poverty. To address these challenges effectively, Pakistan must adopt a holistic and coordinated approach. There is a pressing need for empowering women economically and removing the barriers to women's labour force participation by promoting female education, vocational training and expanding their access to technology and financial services. Policymakers ought to ensure safe and inclusive workplaces through legal reforms and enforcement of existing labour laws. For years, the central bank and banks have been trying to promote financial inclusion, but their efforts must be paired up with societal support. Published in Dawn, The Business and Finance Weekly, January 13th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}