{
  "title": "Govt taking steps to curb tax evasion in real estate sector: Parliamentary Secretary",
  "author": null,
  "content": "ISLAMABAD, Apr 9 (APP):Parliamentary Secretary for Finance and Revenue, Saad Waseem Sheikh, on Wednesday informed the National Assembly that federal government is taking steps to curb tax evasion in the real estate sector.\nResponding to a question during the question hour, he said property tax falls under provincial jurisdiction, not the Revenue Division. However, the federal government has introduced measures to address tax evasion in the real estate market.\nSheikh explained that the Income Tax Ordinance, 2001, includes provisions to address property-related taxes. These include taxes on income from property, capital value taxes on immovable property, and advance taxes on property trading. Notably, sections 236C and 236K of the ordinance focus on collecting advance taxes from property trading. Sheikh pointed out that the main goal of the advance tax is to generate revenue from property transactions.\nResponding to another question about the revenue shortfall estimated by the International Monetary Fund (IMF), which suggested a shortfall of Rs490 billion for the fiscal year 2024-25.\nSheikh clarified that the IMF had not highlighted any shortfall against the agreed revenue targets. Instead, he explained that the revenue targets were based on a tax-to-GDP ratio of 10.6%, which is adjusted based on the nominal GDP. Due to the current lower inflation rate, the nominal revenue collection target was revised downwards, though the tax-to-GDP ratio remained the same.\nDespite the downward revision in inflation forecasts, Sheikh assured that the government is committed to meeting its original revenue targets. He emphasized ongoing efforts to expand the tax base, improve tax compliance, and strengthen enforcement mechanisms to ensure revenue targets are met, even amidst challenging economic conditions.\nHe said that challenges surrounding property tax and tax evasion persist, the government was actively working to address these issues while keeping its revenue targets in focus.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:18:09.184Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govt-taking-steps-to-curb-tax-evasion-in-real-estate-sector-parliamentary-secretary/",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T17:25:00.000Z"
}
