{
  "title": "PMIF-25 brings together local, global industry leaders as Pakistan showcases its vast mineral wealth",
  "author": null,
  "content": "ISLAMABAD, Apr 09 (APP):Pakistan has taken a significant step towards harnessing its vast mineral resources through responsible, sustainable, and inclusive development, as highlighted during the two-day Pakistan Minerals Investment Forum 2025 (PMIF-25) held on April 8 and 9.\nOrganized by the Oil and Gas Development Company Limited (OGDCL), with support from the Special Investment Facilitation Council (SIFC) and the Government of Pakistan, the summit featured several high-level sessions, including a Reko Diq-focused discussion.\nThe forum brought together over 300 delegates from around the world, including government leaders, mining experts, investors, and academics.\nThe forum was aimed at boosting local and foreign investment in Pakistan’s mineral sector, which holds immense untapped potential.\nThe conference served as a comprehensive platform for policy dialogue, investment facilitation, and knowledge sharing, setting the stage for Pakistan to emerge as a competitive player in the global minerals market. Participants from China, the United States, Saudi Arabia, Russia, Turkiye, Kenya, Finland, and other countries joined local investors and stakeholders to explore investment opportunities and sign agreements and memorandums of understanding across various segments of the mining value chain.\nThe National Minerals Harmonisation Framework 2025 was also launched at the event. The framework is a comprehensive reform package designed to streamline investment policies and create a more investor-friendly regulatory environment.\nOn the sidelines of the PMIF25, a Memorandum of Understanding (MoU) was signed between Pakistan and Turkiye for joint offshore exploration.\nThe MoU was inked between the Turkish Petroleum Corporation (TPAO) and Pakistan’s state-owned enterprises—OGDCL, Mari Energies Ltd, and Pakistan Petroleum Limited (PPL)—during a meeting between Federal Minister Ali Pervaiz Malik and Turkiye’s Minister for Energy and Natural Resources.\nFederal Minister for Energy (Petroleum Division) Ali Pervaiz Malik and Federal Minister for Commerce Jam Kamal Khan also held a meeting with the high-level delegation of Saudi Arabia led by Abdulrahman Al-Belushi, Deputy Minister for Mining.\nDuring the meeting, the two sides discussed strengthening bilateral cooperation in the energy and mineral sectors. Both sides explored avenues to deepen collaboration in Pakistan’s oil, gas, and mining industries.\nDuring the meeting, Abdullah Al Shamrani, CEO of the Saudi Geological Survey, extended an invitation to the Geological Survey of Pakistan to visit Saudi Arabia for knowledge-sharing and technological collaboration. The Saudi delegation expressed a strong interest in exploring investment opportunities in Pakistan’s energy and mineral sectors.\nMeanwhile, MD/CEO OGDCL Ahmed Hayat Lak and MD/CEO GHPL Masood Nabi held a productive meeting with a delegation from China’s Zijin Mining Group Co., Ltd.\nThe discussion focused on exploring investment opportunities, strategic partnerships, and the application of innovative mining technologies to advance sustainable mining practices in Pakistan.\nOn day two of the forum, Russell Howard Owen, Mineral Resources Manager at Reko Diq Mining Company, along with Engineering Manager Daniel Nel, unveiled the findings of the project’s recently completed feasibility study in a session titled “Deep Dive – Unveiling Reko Diq’s Feasibility Study: Technical Insights & Innovations.”\nThey shared details about the mine’s geology, water supply strategies, modern processing infrastructure, and the use of sustainable technologies for long-distance mining.\nThe session also highlighted Balochistan’s potential in renewable energy and the integration of environmentally responsible mining practices.\nThe Reko Diq project, set to begin production in 2028, was praised for its approach to infrastructure development, export readiness, and the promotion of knowledge-based growth and technical skills in local communities. Presenters stressed the need for social infrastructure to accompany mining growth in the region.\nA panel discussion on “Strengthening Industry-Academia Linkages – Building a Future-Ready Mining Workforce” was also held on day two. Panelists included Aamir Malik of Wood Mackenzie, Richard Barley from Barrick Gold, Gulmina Bilal Ahmed from NAVTTC, Dr. Hafeezur Rehman from BUITEMS, and Sami Farooq from GIKI.\nThe discussion underscored the importance of developing a skilled workforce to support the sector’s expansion.\nDespite Pakistan’s resource potential, mining currently contributes only 3% to the GDP.\nPanelists called for vocational training institutions focused on mining, greater collaboration between academia and industry, and gender inclusion to ensure a broad-based talent pool.\nThey also proposed curriculum reforms, regulation of training funds, and the establishment of mining-focused campuses, particularly in Balochistan.\nThe third session, “Financing the Future – Investment in Pakistan’s Minerals to Meet Global Demand,” brought together Khawaja Aftab Ahmed (IFC), Cathy Marsh (ADB), Qumar Sarwar Abbasi (Finance Ministry), and Jon Hannah (Sullivan & Cromwell), with Bloomberg’s Faseeh Mangi moderating.\nSpeakers highlighted the importance of stable and investor-friendly policies, risk mitigation mechanisms, and global benchmarking to attract capital into Pakistan’s mineral value chain.\nExamples were drawn from countries like Chile and mineral-rich regions of Africa and Latin America. Participants emphasized the role of enabling infrastructure, integration of green energy, and policy frameworks to support both large and small-scale enterprises.\nThe final session, “Promoting Responsible Mining – Social License, Sustainability & Climate Leadership,” explored the intersection of mining, environment, and community engagement. Panelists included Rebecca Campbell (White & Case), Claire Alidenes (ADB), Ashley Price (Reko Diq Mining Co.), Herman Cornelissen (DMT Group), and Ayla Majid (Planetive).\nThey emphasized the need for projects to secure a ‘social license to operate’ through transparent community engagement, environmental and social impact assessments (ESIA), and long-term social investments. Speakers stressed women’s inclusion, ESG (environmental, social and governance) compliance, and climate leadership in driving a responsible mining future.\nBarrick Gold CEO Mark Bristow highlighted the significance of the Reko Diq copper and gold project and described it as a pivotal milestone for Pakistan.\nHe said the project would not only economically benefit Pakistan but also transform Balochistan. Bristow said that the feasibility study has been completed, with production targeted to begin in 2028.\nThe mine is expected to produce 240,000 tonnes of copper and 300,000 ounces of gold annually. During peak construction, the project is set to employ over 7,500 people and will provide 4,000 long-term direct jobs, he said.\nBristow said Reko Diq is just the beginning, calling it a “starter mine,” and added that Barrick is continuing to discover porphyry bodies in the region. He expressed confidence that Pakistan is poised to join the ranks of top global mining jurisdictions, competing with countries like Chile, Peru, the DRC, and Zambia.\nThe forum’s first day also included high-level panel discussions. One panel featured a ministerial dialogue on driving responsible growth in mining, with participation from top officials from Pakistan, Turkiye, Saudi Arabia, and Kenya.\nThe opening panel, titled “Driving Responsible Growth in Mining – Governance, Cooperation & Building Resilient Supply Chains,” brought together ministers from Pakistan, Turkey, Saudi Arabia, and Kenya. Moderated by Eithne Treanor, the session underscored the critical need for cross-border collaboration, resilient value chains, and improved regulatory frameworks to support ethical and inclusive mining.\nA panel discussion on “Driving the Reko Diq Project Forward – Insights, Impact & the Road Ahead” provided a comprehensive view of one of Pakistan’s most significant mineral developments. Moderated by Patrick Barnes from Wood Mackenzie, the session featured technical and financial experts from Barrick Gold and Weir. Isak Mare,\nDeputy Project Director at Reko Diq Mining Company, shared key project milestones and community development initiatives, while Barrick’s James Ferguson highlighted the project’s long-term financial structuring.\nConcluding the forum, OGDCL Managing Director and CEO Ahmed Hayat Lak declared PMIF25 a milestone in Pakistan’s journey toward responsible and profitable mining.\nHe said that PMIF25 has laid the groundwork for a new era of responsible, sustainable and inclusive mining in Pakistan. “Pakistan is not just mineral-rich but investor-ready,” he said.\nHe emphasized the need for building this industry together which is not just profitable but also purposeful. “PMIF25 has shown us what is possible when silos are broken, when public and private sectors come together, and when a vision is matched by will.”\nHe thanked the Special Investment Facilitation Council and other institutions for their support and stressed that the momentum created at the forum must lead to actionable partnerships and investments. “Remember, PMIF25 is not a conclusion; it’s a beginning,” he said.\n“The conversations that started here must evolve into real partnerships. The ideas shared here must now shape investments. And the momentum built here must now carry us forward.”\nHe also announced that the next edition of the forum—PMIF26—would be held next year.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:18:55.807Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pmif-25-brings-together-local-global-industry-leaders-as-pakistan-showcases-its-vast-mineral-wealth/",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T15:25:00.000Z"
}
