{
  "title": "FOSPAH ensures justice after 34-year Wait: Revenue authorities ordered to attest mutation of property",
  "author": null,
  "content": "ISLAMABAD, Apr 09 (APP):In a landmark case highlighting the systemic challenges faced by women in securing their rightful inheritance, the Federal Ombudsperson for Protection Against Harassment at the Workplace (FOSPAH), Ms. Fauzia Viqar, has ensured justice for Fakraz Bibi, the Complainant, whose family waited over 34 years to have the mutation of their legally purchased property registered.\nThe property in question was bought by Fakraz Bibi’s late father more than three decades ago. Although a registered sale deed was duly executed in his name, the mutation—a critical step in officially updating ownership in the revenue records—was never attested. Despite multiple attempts over the years by the Complainant and her siblings, the revenue authorities persistently refused to process the mutation, citing the passage of time and other bureaucratic barriers.\nThe Complainant approached FOSPAH after exhausting all other avenues and FOSPAH promptly took cognizance of the matter, recognizing it not only as a property dispute but also as a violation of a woman’s constitutional right to inheritance and legal ownership.\nFollowing a detailed hearing and subsequent orders issued by FOSPAH, the revenue authorities extended their cooperation. The mutation was formally attested—bringing long-overdue justice to the Complainant and her family.\nThis case underscores the vital role FOSPAH plays in ensuring that women, particularly those fighting for their property and inheritance rights, are heard and protected under the law.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:20:11.265Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fospah-ensures-justice-after-34-year-wait-revenue-authorities-ordered-to-attest-mutation-of-property/",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T11:27:00.000Z"
}
