{
  "title": "Govt’s top priority to provide affordable housing, quality infrastructure for industrial workers",
  "author": null,
  "content": "ISLAMABAD, Apr 09 (APP):Minister for Overseas Pakistanis and Human Resource Development Chaudhry Salik Hussain has said providing affordable housing and quality infrastructure for industrial workers is the government’s top priority.\nHe said this while inaugurating electricity supply to the newly constructed labour complex in Islamabad, according to a press release.\nThe labour complex has been completed by the Workers Welfare Fund.\nThe Minister said such projects not only provide affordable and quality facilities but also ensure a better environment for industrial workers. He expressed the government’s determination to make available all possible resources for the welfare of the industrial workers.\nThe Minister also directed for early allotment of the constructed houses and apartments to the deserving and eligible labour and workers.\nChaudhry Salik Hussain further said the second phase of the labour complex would commence soon to benefit more industrial workers with residential facilities.\nOn this occasion, Secretary Workers Welfare Fund Zulfiqar Ahmed briefed that the second phase of the residential project will include all international-standard facilities.\nChaudhry Salik Hussain also visited over 1,500 constructed houses, flats, community centre, and mosques. He appreciated the efforts of Secretary Workers Welfare Fund Zulfiqar Ahmed and his team.\nOn this occasion, Secretary Workers Welfare Fund Zulfiqar Ahmed also presented a commemorative shield to Chaudhry Salik Hussain.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:21:04.206Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/govts-top-priority-to-provide-affordable-housing-quality-infrastructure-for-industrial-workers/",
  "dateList": "2025-04-09",
  "date_published": "2025-04-09T06:52:00.000Z"
}
