{
  "article_id": "2025-02-18_501770b67364b8b16812b478bf0ddf4a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/japans-ambassador-hosts-reception-to-celebrate-emperor-naruhitos-65th-birthday/",
    "retrieved_at": "2025-08-27T12:50:30.199Z"
  },
  "metadata": {
    "title": "Japan’s ambassador hosts reception to celebrate emperor Naruhito’s 65th birthday",
    "author": null,
    "date_published": "2025-02-18T14:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 341,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 18 (APP): Japan's Ambassador to Pakistan, Akamatsu Shuichi on Tuesday hosted a reception to mark the 65th birthday of His Majesty Emperor Naruhito at a local hotel. Federal Minister for Commerce, Jam Kamal Khan, attended the event as the chief guest, alongside a distinguished gathering of diplomats, government officials, and members of the business and cultural communities. In his address, Ambassador Akamatsu reflected on his experiences in Pakistan since his arrival in late November 2024, expressing appreciation for the warm sentiments toward Japan and the enthusiasm for strengthening bilateral ties. \"There still lies an unlimited space for cooperation between our two countries,\" he remarked. Discussing global affairs, the ambassador underscored Japan's commitment to restoring peace and stability in an increasingly divided international landscape. \"The rule of law is being challenged in many ways, making it our urgent task to uphold international harmony. Japan is committed to working with Pakistan to achieve this goal,\" he stated. On the bilateral front, Ambassador Akamatsu reaffirmed Japan's long-standing support for Pakistan through over 70 years of Official Development Assistance (ODA). He emphasized Japan's development philosophy of sustainable assistance, saying, \"Not only providing fish, but also teaching how to fish, based on mutual respect and collaboration.\" Highlighting cultural and people-to-people exchanges, he encouraged greater participation from Pakistan in Expo 2025, scheduled to take place in Osaka, Kansai from April to October this year. Referring to the Japanese saying \"seeing is believing,\" he invited Pakistanis to experience Japan firsthand. The evening also featured a vibrant showcase of Japanese culture. Students from the Islamabad Japanese School performed traditional taiko drumming and the folk dance 'So-ran bushi.' Exhibitions of Ikebana and Bonsai, organized by the Lahore Sogetsu Study Group and the Lahore Bonsai Society, were also on display, along with exhibits by the Japan International Cooperation Agency (JICA) and Japanese companies. Ambassador Akamatsu concluded by expressing his hope for stronger ties between the two nations, saying, \"I wish for more active exchanges between Japan and Pakistan, fostering a friendship that meets the demands of this new era.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}