{
  "article_id": "2025-08-28_182db39a42731808c245e1dc1b14c24e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fospah-rules-invasive-cctv-surveillance-amounts-to-workplace-harassment/",
    "retrieved_at": "2025-09-06T10:37:10.733Z"
  },
  "metadata": {
    "title": "FOSPAH Rules: Invasive CCTV surveillance amounts to workplace harassment",
    "author": null,
    "date_published": "2025-08-28T16:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 199,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 28 (APP):The Federal Ombudsperson for Protection Against Harassment (FOSPAH) has delivered a significant ruling, holding that constant and invasive CCTV monitoring of employees can constitute workplace harassment. The decision came in the case of Saneem Afshain vs. Azhar Abbas, CEO of Yashal English House, Rawalpindi, where the complainant alleged she was subjected to excessive surveillance and intimidation. After reviewing evidence, the Ombudsperson found that the accused engaged in unjustified and targeted monitoring, even sending CCTV screenshots to the complainant, creating a hostile and distressing work environment. The Ombudsperson declared this behavior to be harassment under the law and ordered payment of Rs. 50,000/- in compensation to Ms. Saneem and a penalty of censure against Azhar. The Ombudsperson also directed mandatory workplace reforms, including the formation of an Inquiry Committee and the public display of the Workplace Code of Conduct in both English and Urdu. The ruling underscores that harassment is not confined to unwelcome advances but includes any conduct that violates dignity, privacy, or creates fear and intimidation at work. \"This case is a reminder that surveillance cannot be misused to control, target, or intimidate employees. Privacy and dignity are fundamental workplace rights,\" the Ombudsperson's office stated.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}