{
  "article_id": "2025-08-28_03d6335809502ca8a108d0c96111c646",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rivers-chenab-ravi-sutlej-indus-continue-to-flow-in-exceptional-high-medium-flood-ffc/",
    "retrieved_at": "2025-09-06T10:37:11.325Z"
  },
  "metadata": {
    "title": "Rivers Chenab, Ravi, Sutlej, Indus continue to flow in exceptional high, medium flood: FFC",
    "author": null,
    "date_published": "2025-08-28T16:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 252,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 28 (APP):Federal Flood Commission (FFC) has said that rivers Chenab, Ravi, Sutlej and Indus are flowing in exceptional high and medium flood. According to daily FFC report on Thursday, River Indus is flowing in low flood at Taunsa-Guddu-Sukkur-Kotri reaches while River Chenab is in medium flood with falling trend at Marala and exceptional high flood with falling trend at Khanki and Qadirabad. Similarly, River Ravi is running in high flood with falling trend at Jassar, exceptional high flood with rising trend at Shahdara and high flood with rising trend at Balloki while River Sutlej is also in exceptional high flood with steady condition at Ganda Singh Wala and medium flood with steady condition at Suleimanki. River Ravi at Shahdara has attained exceptionally high flood level and is still rising. It is likely to decrease within next 24 hours. Moreover, River Ravi at Balloki is expected to attain exceptionally high flood level within 24 hours. Due to releases from Indian dams, exceptionally high flood level will continue in river Sutlej at Ganda Singh Wala and downstream while River Chenab at Trimmu is expected to attain exceptionally high flood level on Friday (evening). Tarbela Dam has already attained its Maximum Conservation Level (MCL) of 1550 feet while Mangla Reservoir stands at 1222. 60 feet which is 19.40 feet below its MCL of 1242 feet. The combined live storage of Tarbela, Chashma and Mangla reservoirs stands at 11.740 MAF, which is 88.16 % of the total available live storage capacity of 13.316 MAF.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}