{
  "title": "PM reverses PEMRA’s ban on airing Imran’s speeches: Marriyum",
  "link": "https://www.app.com.pk/national/pm-reverses-pemras-ban-on-airing-imrans-speeches-marriyum/",
  "date_published": "2022-11-05T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Saturday said Prime Minister Shehbaz Sharif had reversed the ban imposed by the Pakistan Electronic Media Regulatory Authority (PEMRA) on television channels from airing Imran Khan’s speeches.\nThe directives for lifting the ban on Imran’s speeches, issued to PEMRA, by the prime minister was in accordance with the law which granted such powers to the federal government, the minister said in a news statement.\nShe said the prime minister issued these directives to PEMRA by invoking its section 5.\nMarriyum said PM Shehbaz Sharif had also directed PEMRA to ensure full compliance of Article 19 of the Constitution.\nThe minister said PM Shehbaz Sharif had set a new tradition by bringing an end to the bitter traditions of Imran Khan’s era.\n“We do not believe in what has been done by Imran Khan with Muhammad Nawaz Sharif, Maryam Nawaz and other political leaders during his four-year rule,” she remarked.\nThe minister said the federal government led by Muhammad Shehbaz Sharif fully believed in democratic norms and the constitutional right of freedom of expression.\nShe said it was Imran Khan who imposed restrictions on his political opponents, leaders, activists and media during his four-year rule. “Imran Khan was free to churn out lies against his opponents,” she said.\nThe minister said Imran Khan’s speeches against the coalition government should reach to the public so they could know the reality of the “Fitna”.\nImran Khan’s supporters, she said, would have to understand the reality of this “Fitna” and his mischief and lies.\nShe said the current government believed in democratic norms and values, but ironically Imran Khan had a “fasicst mindset”.",
  "retrievedAt": "2025-08-11T15:50:58.053Z"
}
