{
  "title": "Bilawal, EU High Representative agree to enhance cooperation",
  "link": "https://www.app.com.pk/national/bilawal-eu-high-representative-agree-to-enhance-cooperation/",
  "date_published": "2022-11-05T16:46:00.000Z",
  "source": "APP",
  "content": "The Foreign Minister during the meeting held in the United Arab Emirates expressed satisfaction over multifaceted relations between Pakistan and the European Union, which have strengthened over time.\nHe noted that recent interactions between the two sides including holding of Joint Commission in Islamabad last month and the visit of the members of the European Parliament this week, have maintained positive momentum in bilateral ties.\nThe Foreign Minister also appreciated the humanitarian assistance of 133 million Euros by the EU and its member states to Pakistan after the devastation caused by the recent climate-induced floods. He apprised the EU High Representative of the enormous task Pakistan is faced with on account of rehabilitation and reconstruction work.\nHe called on the international community to rise to the occasion and ensure climate justice for Pakistan.The High Representative assured full support to the Foreign Minister in meeting the daunting challenge.\nThe Foreign Minister and the EU High Representative also discussed the GSP Plus – a scheme mutually beneficial for both Pakistan and the European Union.\nHe hoped that Pakistan and the EU would continue to benefit from it and its successor dispensation in the future as well. The High Representative lauded Pakistan’s progress in implementing the international conventions that are part of the GSP plus scheme.\nThe Foreign Minister urged the High Representative that the European Union should delist Pakistan at the soonest possible from its list of countries having strategic deficiencies in their Anti Money Laundering/Counter Financing of Terrorism regimes, after Pakistan exited the FATF grey list last month. The High Representative appreciated Pakistan’s remarkable progress in completing the two Financial Action Task Force Action Plans and assured the Foreign Minister that the EU would delist Pakistan soon.\nBoth sides agreed to further strengthen Pakistan-EU relations and to remain engaged, inter alia, with established institutional mechanisms.",
  "retrievedAt": "2025-08-11T15:50:58.076Z"
}
