{
  "title": "Saghar denounces confiscation of Shabbir Shah’s home-cum-office by Indian authorities",
  "link": "https://www.app.com.pk/national/saghar-denounces-confiscation-of-shabbir-shahs-home-cum-office-by-indian-authorities-2/",
  "date_published": "2022-11-05T09:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):Convener All Parties Hurriyat Conference AJK chapter and acting chairman Democratic Freedom Party Mehmood Ahmed Saghar here on Saturday strongly condemned the Indian Enforcement Directorate (IED) for confiscating the house of the incarcerated party chairman Shabbir Ahmad Shah in Srinagar.\nIn a statement issued here on Saturday, Sagar termed it a pressure tactic on the part of India’s racist regime. He said attaching of Shah’s home-cum office was a colonial-era tactic the BJP has since long been using to break the political will of Shabir Ahmed Shah and other Hurriyat leaders who refused to accept the government’s concocted narrative on Kashmir and remained stick to their principled stance.\nHe said that the DFP chief has been one of the worst victims of India’s vendetta politics, adding it was nothing new for Shah who has been facing all this right from his childhood days. “Such tactics won’t deter Shah Sahib from pursuing the noble cause for which he had devoted his entire life”, the DFP leader said.\nHe, however, maintained that it was unfortunate that the Modi government was shamelessly using these so-called agencies to harass and humiliate the families of hurriyat leaders and activists. Sagar said the Modi government had let loose its so-called NIA and EDA authorities to resistance leaders in order to dent their public image.\nReferring to the Indian government’s three-prong strategy to eliminate Hurriyat leadership from the scene, Saghar said, “First they ran a mega smear campaign, which was followed by a massive crackdown to malign Hurriyat leaders and now they have virtually started to confiscate their properties they have lawfully inherited from their parents”.\nHe said that Hurriyat leaders could not be intimidated by such mean tactics. Urging India to stop its policy of persecuting Kashmiris just for raising their legitimate demands, Saghar said that India must accept ground reality and take steps to settle the lingering Kashmir dispute in accordance with the United Nations resolutions.Meanwhile, while paying eulogizing tributes to martyrs of Jammu, the incarcerated APHC leader Shabir Ahmed Shah said that the massacre of Muslims in Jammu in 1947 at the hands of Hindu fanatics was the most horrible incident of Kashmir that continues to haunt Kashmiris despite the passage seventy-five years.\nIn his message from Tihar jail Shabir Ahmed Shah said, “Hindu chauvinists aided and abetted by Dogra Maharaja wiped out the entire Muslim population of the entire province with a mala-fide intent to alter demography of the region”.Terming it as a worst example of genocide and ethnic cleansing he said that during the intervening period of time (27 Oct 1947 to 6 Nov 1947) thousands of Muslims were massacred in the Jammu region by mobs led by the extremist Hindus, whereas tens of thousands of hapless families were forced to flee and take refuge in the newly formed state of Pakistan.\nHe said that the chronology of key events of Kashmir history amply demonstrate the fact that changing demographic complexion of Muslim majority state of Jammu and Kashmir had always been on the cards from day one.\nThe Muslims, he said constituted more than 60 percent of the population of Jammu region, were reduced to a minority after killing more than two lakh (two hundred thousands) Muslims. He said that stripping Jammu and Kashmir of its decades’ old special status and doing away with article 35-A was part of this sinister design to convert Muslim majority of the state into minority.\nExpressing serious concern over the continued bloodshed and violence in Kashmir, he said that it was high time that the world community takes effective notice of human rights violations and killing of innocent Kashmiris especially the youth who were being ruthlessly murdered by the occupation forces",
  "retrievedAt": "2025-08-11T15:51:01.961Z"
}
