{
  "title": "Swati should cooperate with FIA to reach real culprits: Ashrafi",
  "link": "https://www.app.com.pk/national/swati-should-cooperate-with-fia-to-reach-real-culprits-ashrafi/",
  "date_published": "2022-11-05T17:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 05 (APP):Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mahmood Ashrafi on Saturday said Pakistan Tehreek-e-Insaf (PTI)’s Senator Azam Khan Swati should cooperate with Federal Investigation Agency (FIA) to reach the real culprits behind the leaked video.\nAshrafi who is also the chairman of Pakistan Ulema Council, in a video message, proposed the respective legislator not to be part of the blame game without any solid evidence as it is not in larger interest of the country.\nHe, in reaction to Swati’s emotional presser in which he has accused a national security institution’s officer, said although the incident was sorrowful but it did not mean that it should be used for the political point-scoring.\nHe said the habit of maligning the nation security institutions and their responsible officers before any logical conclusion of the investigation should be stopped now.\nHe said the miscreants behind this fake video must be brought to justice as it is a condemnable incident.\nMeanwhile, in the talk show of a private news channel, prime minister’s aide, on the sad incident of firing on Pakistan Tehreek-e-Insaf’s convoy in Wazirabad, said in Punjab, Imran Khan’s party was at the helm of affairs and it should hold a transparent investigation on the matter.\nThe prime minister had given all options to the provincial government to probe the matter thoroughly, he said adding, the way national security institutions responsible officers were being targeted that was not acceptable at all costs.\nAshrafi said the non-state actors were trying to destabilize the country by chaos and anarchy, that was why; they were targeting the national defense institutions time and again as “our religion, homeland and military are redlines for us.”Regarding PTI chief Imran Khan’s demand of three resignations, he said it was unconstitutional and it was not the proper way to seek resignations on the basis of mere allegations.\nLauding the matchless services of Major General Faisal, he said the anti-state elements were hatching conspiracies against this son of the soil who had played a heroic role by dismantling the enemies’ network in the war on terror.\nCriticizing the PTI’s leadership that is consistently engaged in the defamation campaign against the armed forces, he said this illicit drive was pleasing India as its job was being performed by our disgruntled politicians.\nHe said it was expected that President Dr. Arif Alvi and Punjab Chief Minister Chaudhry Pervez Elahi would play a significant role in easing the prevailing political tension in the country. But they could not help resolve the differences due to the stubbornness and ego of the particular political party’s leadership, Ashrafi lamented.",
  "retrievedAt": "2025-08-11T15:50:58.067Z"
}
