{
  "article_id": "2025-06-18_ea0a7b83629948a0526537c46bcfbe25",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/legal-education-body-secp-join-hands-to-train-lawyers-law-students/",
    "retrieved_at": "2025-08-27T16:11:59.416Z"
  },
  "metadata": {
    "title": "Legal education body, SECP join hands to train lawyers, law students",
    "author": null,
    "date_published": "2025-06-18T13:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 18 (APP):The Directorate of Legal Education (DLE) and the Securities and Exchange Commission of Pakistan (SECP) on Wednesday signed a Memorandum of Understanding (MoU) at the Supreme Court Building to strengthen legal training in corporate, banking, and company laws. The Federal Law Minister was present at the ceremony as the chief guest. The agreement was signed by Barrister Usama Malik, Director of the Directorate of Legal Education, and Mujtaba Lodhi, Commissioner SECP, said a press release issued here. The aim is to work together on training initiatives focused on corporate, company, banking, and insurance law. These sessions will be designed for lawyers, law students, prosecutors, and SECP's in-house legal staff. The event brought together several senior officials. From SECP, Chairman Akif Saeed, along with Commissioners Mujtaba Lodhi, Zeeshan Khattak, and Muzaffar Mirza attended the signing ceremony. From the legal side, prominent members of the Pakistan Bar Council including Ahsan Bhoon, Amjad Shah, and Chairman of the Legal Education Committee Qalb-e-Hassan Shah were present. Supreme Court Bar Association President Rauf Atta also joined the ceremony. The Law Minister welcomed the partnership and highlighted the importance of continuous legal education for lawyers. He expressed hope that this effort would help bridge the gap between legal education and practice. SECP Chairman Akif Saeed praised the agreement and assured the Commission's full support in the proposed training programs. He said that such initiatives would help legal professionals stay updated with developments in financial and business laws. Barrister Usama Malik said this step marks the beginning of a long-term working relationship between the Directorate and SECP. He said the collaboration would raise the quality of legal education and professional training, not only for lawyers and students but also for legal officers within SECP. This partnership is expected to produce a regular calendar of training sessions and workshops, enabling better understanding of complex regulatory issues and legal practices among participants.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}