{
  "article_id": "2025-06-18_14d67b4259ee0f20174e7ea6fe84da67",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pieas-showcases-technological-excellence-career-pathways-at-open-house-2025/",
    "retrieved_at": "2025-08-27T16:12:50.903Z"
  },
  "metadata": {
    "title": "PIEAS showcases technological excellence, career pathways at open house 2025",
    "author": null,
    "date_published": "2025-06-18T06:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 190,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 18 (APP):Innovation, creativity, and real-world problem-solving took center stage here at the Pakistan Institute of Engineering and Applied Sciences (PIEAS) Career Fair and Open House 2025. The event was organized by the university's Office of Research, Innovation and Commercialization (ORIC), according to a press release issued here on Wednesday. The event showcased more than 120 Final Year Design Projects (FYDPs), reflecting the students' efforts to address a wide range of national and global challenges. From energy efficiency and automation to AI applications, quantum technology, biomedical devices, and advanced materials, the projects underscored PIEAS's emphasis on research-driven innovation. Over 40 prominent organizations from both public and private sectors participated in the event. They engaged with students through technical discussions, conducted on-spot interviews, and explored recruitment prospects, reinforcing academia-industry linkages. Speaking on the occasion as chief guest, Rector PIEAS, Dr. Naseem Irfan reaffirmed the institute's commitment to nurturing indigenous human resources in cutting-edge fields of science and technology. He also highlighted the importance of fostering collaboration between academia and industry through platforms like the PIEAS Open House, positioning it as a vital bridge for technological advancement in Pakistan's high-tech sectors.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}