{
  "title": "MoCC briefs NA body on preparations to plead country’s case at COP27",
  "link": "https://www.app.com.pk/national/mocc-briefs-na-body-on-preparations-to-plead-countrys-case-at-cop27/",
  "date_published": "2022-10-28T11:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP): The Ministry of Climate Change officials on Friday briefed the National Assembly Standing Committee on its preparations to attend the global 27th Conference of the Parties (COP27) to be held in Sharm El-Sheikh, Egypt where the world would join heads to discuss efforts for coping with environmental degradation.\nThe Standing Committee on Climate Change in its 31st meeting held under the chair of MNA Nuzhat Pathan lauded the efforts of the Ministry for including the advocacy of Climate Finance, loss & damages and adaptation to bring on the agenda of the 27th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP27) for the first time.\nThe Ministry of Climate Change (MoCC) shared its schedule which includes the Prime Minister’s Speech, Joint Chairing of round table with the Prime Minister for Norway, bilateral engagements at the ministerial level, negotiation on eight dedicated streams, side events by Pakistani delegation and Civil Society Members.\nThe Secretary, MoCC gave a comprehensive briefing on the upcoming COP27. He apprised the Committee about the stance of Ministry of Climate Change on the issue of adaptation mechanism during the Conference. He also informed that Pakistan was in the front line of the advocacy of the Climate Finance Issues along-with other developing countries.\nHe said that unprecedented climate-induced disaster in Pakistan hit 84 districts across the country. The World Bank has estimated Pakistan’s flood losses around $40 Billion. “Pakistan will emphasize on seeking $100 billion as promised in 2009. Pakistan will be suggesting to develop a transparency mechanism for defining Climate Finance needs.”\nAt the end, the committee decided to hold its next meeting on November 29 at Gawadar to witness the marine pollution and waste management at sea site.\nThe committee deferred “The Pakistan Trade Control of Wild Fuana and Flora (Amendment) Bill, 2022” (Govt. Bill) and “The Environmental Protection (Amendment) Bill, 2021 (moved by Ali Gohar Khan, MNA) due to non-presence of its mover. The committee also deferred Question No. 146 (moved by Ms. Nuzhat Pathan, MNA) and Question No. 117 (moved by Ms. Tahira Aurangzeb, MNA) till its next meeting.",
  "retrievedAt": "2025-08-11T15:48:26.566Z"
}
