{
  "title": "PM thanks U.S. over additional $30 mln relief aid for Pakistan flood victim",
  "link": "https://www.app.com.pk/national/pm-thanks-u-s-over-additional-30-mln-relief-aid-for-pakistan-flood-victim/",
  "date_published": "2022-10-28T08:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP): Prime Minister Shehbaz Sharif on Friday expressed gratitude to the United States for additional $30 million flood relief assistance for the flood-affected people of Pakistan.\n“Grateful to U.S. govt for the announcement of an additional $30 million in humanitarian assistance for flood victims,” he said in a tweet.\nHe mentioned that with the onset of winter, the challenges of food, health and shelter still persisted.\nShehbaz Sharif urged the international community to show urgency in contributing to the UN flash appeal on relief assistance for the flood-struck people of Pakistan.\n“World should promptly contribute to UN aid appeal to mitigate the impact of tragedy,” he said.\nU.S. Ambassador Donald Blome on Thursday announced an additional $30 million in humanitarian assistance to support flood-affected populations in Pakistan.\nThis new funding brings the United States total assistance to Pakistan for flood response, food security, and disaster preparedness and capacity building efforts to $97 million this year.\nThe new funding, according to a press statement by the U.S. embassy, will expand efforts to address immediate needs, scaling up assistance to the most affected communities and enabling USAID to reach more than 4 million people.\nWith the additional funding, the U.S. government, through USAID, will provide life-saving food, nutrition, and health assistance to mitigate increased food insecurity and malnutrition resulting from the impact of the floods, as well as curb the rise of diseases resulting from stagnant flood waters.\nThe new funding will also provide shelter supplies to help families rebuild as well as winterization kits to help families prepare as cold weather approaches.",
  "retrievedAt": "2025-08-11T15:48:30.896Z"
}
