{
  "title": "Imran, others to be probed in Arshad’s killing case: Minister",
  "link": "https://www.app.com.pk/national/imran-others-to-be-probed-in-arshads-killing-case-minister/",
  "date_published": "2022-10-28T12:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 28 (APP): Federal Minister Mian Javed Latif on Friday said PTI chief Imran Khan and other party leaders, including Fawad Chaudhry will also be investigated in the killing case of renowned journalist Arshad Sharif.\nAddressing a press conference here, he said “Imran Khan in the lust of power was jeopardizing the country’s economy, values and traditions of the society. Even he [Imran] did not prevent himself from uttering words against the state institutions. “\n“I am very saddened over the killing of Arshad Sharif which was no doubt a big loss to his family,” he said while extending condolences to the bereaved family.\nHe said all those culprits who facilitated and plotted the murder of Arshad Sharif should be brought to justice.\nHe appreciated the commitment of Inter-Services Public Relations (ISPR) to uphold the constitutions during the press briefing on the other day.\nMian Javed Latif urged the prime minister to approve the inquiry into Arshad Sharif’s murder in the Cabinet meeting to initiate free fair and transparent investigation into the case.\nHe said criticism was the right of everyone, but dragging youth and inciting students of colleges and universities for personal motives was against the moralities.\n“We have never seen before that youth was indoctrinated against national institutions and leaders,” remarked Javed Latif.\nHe blamed Imran Khan for “inciting people in the name of the so-called revolution,” adding that his only “purpose was to ruin the economy, violate the constitution, and weaken the state by bringing revolt in the institutions and ridiculing them.”\nHe said his party strongly believed in the supremacy of law and the constitution.\n“A national leader is one who sacrifice his life for the prosperity of the country, not that who does politics on the dead bodies of people,” he maintained.",
  "retrievedAt": "2025-08-11T15:48:25.027Z"
}
