{
  "title": "Opposition parties afraid of submitting receipts in foreign funding case",
  "link": "https://www.app.com.pk/national/opposition-parties-afraid-of-submitting-receipts-in-foreign-funding-case/",
  "date_published": "2021-01-26T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Federal Minister for Communications and Postal Services Murad Saeed Tuesday said that opposition parties were afraid of submitting receipts in foreign funding case as they will be exposed for receiving funding from the Jewish lobby.\nSpeaking in Senate, he said that PPP and PML-N have not yet submitted their foreign funding report and receipts.\nHe said that the opposition instead of submitting receipts to ECP, organized protest in front of Election Commission of Pakistan (ECP).\nHe said that 6 weeks time was given to the opposition for submitting receipts but so far they had not submitted anything.\nThe minister said that previous government had put everything on lease. He said that PML-N finance minister once stated that Pakistan Steel Mill buyer will be given PIA in free.\nHe said that Khuzdar Awaran road project was started, while Quetta Bypass and Dera Murad Jamali Bypass were also constructed by the present government. He said that in last 10 years only 1100 km roads project were approved, but present government had initiated work on 3316 km roads projects in the country.\nMurad Saeed said that previous government had spent money from the national exchequer for construction of Raiwind road.\nHe said that fake accounts, money laundering and now Broadsheet issue had resurfaced, adding that all these issues were related to the previous governments.\n“PML-N was always made victory sign soon after any case decision but later came to know the real nature of decisions” he said.\nThe minister said that Prime Minister Imran Khan had no sugar mill, adding that sugar mills were owned by Asif Ali Zardari and Sharif family.\nHe said that wheat was recovered from the houses of Sindh government sitting ministers.\nMurad Saeed said that exports increased by 5 per cent, foreign remittances by 24.9 per cent, investment rose, large scale and manufacturing increased by 5 per cent. He said that agriculture showed negative growth during previous government.\nHe said that 100 per cent health insurance were provided to the people in KP and merged districts of erstwhile FATA.\nHe said that people of Azad Jammu Kashmir and Gilgit Baltistan, Punjab will also get Sehat Insaf Card a free treatment facility.\nHe said that Balochistan government was also directed by the Prime Minister to initiate the Sehat Insaf Card project.\nHe said that people of all the provinces will get free treatment from Agha Khan Hospital Karachi, while people of Sindh will not have this facility due to their provincial government.\nHe said that PTI government had paid compensation to the families in the merged districts of erstwhile FATA.\nThe minister said Europe’s Disinfolab had fully identified India’s conspiracies against Pakistan.\nHe said Prime Minister Imran Khan had exposed the ugly face of India at international forums. Pakistan had not only exposed Indians’ conspiracies but also thwarted them successfully.\nHe said that Nawaz Sharif never raised voice against India due to his personal interest and relations with people like Sajan Jandal, adding that Nawaz Sharif also denied to meet with Kashmiri leadership during visit to India.",
  "retrievedAt": "2025-08-11T20:16:50.391Z"
}
