{
  "title": "Youth centers being set up for career counseling: Usman Dar",
  "link": "https://www.app.com.pk/national/youth-centers-being-set-up-for-career-counseling-usman-dar/",
  "date_published": "2021-01-26T15:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar Tuesday said youth centers were being set up across the country to address unemployment issues of young people through career counseling.\nUsman Dar told this to the delegation of National Dialogue Forum comprising students of 15 universities. The delegation including participants from all federating units was called on him at the Prime Minister’s Office, said a news release.\nThe SAPM said the youth’s participation in policy making was imperative as they constituted 60 per cent of the country’s population. The present government had formed National Youth Council (NYC) for the purpose, he added.\nUsman Dar said the Pakistan Tehreek-e-Insaf came into the power with the support of Pakistani youth that was why it was committed to their welfare and development.\n“After 18th amendment, youth is a provincial subject, but under the vision of Prime Minister Imran Khan, the federal government has taken historic initiatives for youth development”, he maintained.\nHe said National Youth Development Framework (NYDF) was a comprehensive road-map designed for youth development by our government, which was implemented through PM Kamyab Jawan Programme.\nThe SAPM elaborated that the programme included Rs 100 billion Youth Entrepreneurship Scheme, skills programme and other major initiatives related to youth empowerment.\nQuota for the students from Balochistan in technical education courses would be enhanced, he stressed.\nHe said people of newly ‘emerged’ districts in Khyber Pakhtunkhwa would soon witness a positive change in the near future as no one had ever paid attention to those areas.\nThe visiting students shared their views on various issues faced by youth. They also gave suggestions to improve various initiatives taken for the betterment of Pakistani youth.",
  "retrievedAt": "2025-08-11T20:16:52.892Z"
}
