{
  "title": "Cabinet approves commission of inquiry on Broadsheet issue to bring truth before nation",
  "link": "https://www.app.com.pk/national/cabinet-approves-commission-of-inquiry-on-broadsheet-issue-to-bring-truth-before-nation/",
  "date_published": "2021-01-26T16:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): The Federal Cabinet on Tuesday approved the constitution of the commission of inquiry on the Broadsheet issue under the chairmanship of Justice Retired Azmat Saeed to bring the truth before the nation.\nBriefing the media about the decisions of Federal Cabinet meeting chaired by Prime Minister Imran Khan, Minister for Information and Broadcasting Shibli Faraz said the inquiry commission had been tasked to submit its findings on the Broadsheet issue within 45 days and expose those who had played a key role in destroying country’s economy.\nHe said the Broadsheet case had exposed how the past regimes had put political expediency over morality to give safe passage to the corrupt people, which eventually led to the acceptance of corruption in the society.\nHe said the past regimes had decriminalized corruption, which seriously damaged the moral fabric of the society, where an honest person was regarded as a ‘loser’.\nHe said it was only Imran Khan, who literally had challenged the status quo for the first time in the history of Pakistan to purge the country of corruption.\nThe agreement with Broadsheet was signed by previous governments and the country might suffer losses in case of non-payment to Broadsheet, he added.\nThe minister said contrary to previous practices, Prime Minister Imran Khan would not bow down to any pressure and hold all corrupt elements accountable.\nAbout reforms in the Senate election process, he said everyone knew that votes were bought and sold in the Senate elections and the government wanted to restore the sanctity of the upper house of the parliament.\nHe said Prime Minister Imran Khan wanted transparency in Senate polls and the government was striving to restore the sanctity of the Senate as sale and purchase of votes in Senate elections was quite common in past.\nA constitutional amendment bill to make the upper house elections transparent was already in the National Assembly, he added.\nHe said the government could resort to present the bill in the National Assembly for ensuring open ballot in the Senate elections.\nShibli said economic indicators were showing a positive trajectory as exports of the country were increasing swiftly due to prudent policies of the government.\nHe said the previous government had left the national economy in a fragile situation but the incumbent government put it back on the right track.\nWhen PTI government assumed powers, the current account deficit was over Rs20 billion, which had now pushed to surplus, he said adding circular debt could register significant enhancement in case of not increasing power prices.\nThe industrial and agriculture production had registered a significant increase, he said.\nHe said the government wanted to rid the country’s economy of interest, and under the condition of Islamic banking, it was necessary to mortgage an asset in order to take a loan.\nShibli said the prime minister issued directives that some other building should be mortgaged in place of F-9 Park for Sukuk Bonds.\nReplying to questions from media persons, Senator Shibli Faraz stated that the Broadsheet issue investigation was not against the government rivals but criminals who had a role in causing massive financial and moral loss to the nation.\nTo a question, Shibli said that the government had already submitted a bill in the National Assembly and was mulling a constitutional amendment to make the Senate election process transparent and it would like to place the legislative bill before the opposition.\nAppealing to the media not to give the Broadsheet issue a political touch, he said that the government’s objective\nthrough the Broadsheet inquiry commission was to let the nation know, how certain characters, resorted to political expediency and got NRO.\nHe continued that again these very characters touted 34 amendments in NAB law and Shahid Khaqan Abbasi demanded pack-up of the anti-graft body.\nThe minister remarked that this was the only government, which opted for this difficult path to eradicate corruption and the prime minister waged a 22-year struggle against it and wanted open hearing of the foreign funding case. He added today, those who had tried to trap PTI, had themselves got entangled in the foreign funding case.\nHe said that Imran Khan was the only person, who launched a genuine political struggle while all others were hierarchical leaders.\n“When a prime minister indulges in corruption, then his ministers and advisors and bureaucrats follow suit and this goes down in the entire system,” he maintained.\nAnswering another question, he said that the government was opposed to any rise in the cost of production for the export industry with regards to supply of gas even for a short period of one or two months.\nTo a query, the minister expressed the hope that justice retired Azmat Saeed Shiekh would conduct the Broadsheet investigation, otherwise, there might have been a statement from him by now.\nHe described him the best and most competent person for the job, having vast experience of NAB as well as the Supreme Court.\nThe minister said that the opposition was raising hue and cry over his name, as they knew he was an honest person and was capable of taking the matter to its logical end.\nHe added TORs of the commission envisaged that any institution, individual or document could be summoned and sought.\nAbout the import of the Covid-19 vaccine, Shibli said the government would regulate its price and it would start pouring in next few days. All the related details, he added, would be shared with the media by the Ministry of health in a couple of days.",
  "retrievedAt": "2025-08-11T20:16:49.498Z"
}
