{
  "title": "AJK President brands India a fascist State, not democratic country",
  "link": "https://www.app.com.pk/national/ajk-president-brands-india-a-fascist-state-not-democratic-country/",
  "date_published": "2021-01-26T15:50:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK):, Jan 26 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan has asserted that today’s India is neither secular nor democratic state but a settler-colonial power, and its hegemonic designs are serious threats to peace and security of not only neighbouring countries but the whole region of South Asia.\n“India’s illegal occupation of Jammu and Kashmir and its recent actions are not acceptable to the people of Kashmir and they are determined to continue their struggle till the return of the last Indian soldier,” he underlined.\nHe made these remarks while addressing the meeting of the Senate of Women’s University Bagh amidst India’s so-called Republic Day on Tuesday which the Kashmiri people observed as the Black Day, AJK president said.\nHe said the Kashmiri people on both sides of the Line of Control, Pakistan and across the world observed Black Day because the carnage of Kashmiri people which India had started immediately after independence from the British rule 72 years ago, still continues.\nHe said all Indian actions including the occupation of Jammu and Kashmir and depriving the Kashmiri people of their freedom are a clear proof of India’s being a fascist and settler-colonial state.\n“India which falsely claims to be the biggest democracy of the world, is busy in massacring the Kashmiri people in the occupied territory for their democratic demands of freedom, right to self-determination, fundamental human rights and the civil liberties,” he added.\nHe called upon the international community particularly the United Nations, human rights organizations and the world civil society to take immediate exception to the unlawful and immoral acts in occupied Jammu and Kashmir, and play their role for a solution to the long-standing Kashmiri issue and the cessation of the genocide of the Kashmiri Muslims.\nDeclaring Women’s University as an asset of knowledge for Jammu and Kashmir state, the AJK president expressed the hope that Vice-Chancellor Prof. Dr Abdul Hameed will soon achieve the target of building a permanent campus of the university, get financial resources, and hire highly qualified faculty for the university in order to put it on the track of development.\nThe Senate session was attended besides Vice-Chancellor Bagh University, Vice-Chancellor University of Poonch-Rawalakot Prof. Dr Mohammad Rasool Jan, Rector International Islamic University Prof Dr Masoom Yasinzai, former Vice Chancellor University of Peshawar Prof Dr Noor Jahan, former Vice-Chancellor of Fatima Jinnah Women’s University Prof Dr Samina Amin Cadir, Prof Dr Razia Sultana, Zaheeruddin Qureshi, Mohammad Raza Chuhan, Prof. Dr Farooq Ahmed, Dr. Mohammad Shoaib Amjad, Ms Saiqa Saghir, Ms Surriya Shaman.",
  "retrievedAt": "2025-08-11T20:16:51.234Z"
}
