{
  "title": "1 bln trees to be planted by end-of-season: Senate told",
  "link": "https://www.app.com.pk/national/1-bln-trees-to-be-planted-by-end-of-season-senate-told/",
  "date_published": "2021-01-26T06:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Minister of State for Climate Change Zartaj Gul Wazir Tuesday informed the Senate that one billion trees would be planted by the end-of-season under the Billion Tree project in the country.\nReplying to various supplementary questions during the Question Hour, she said 85,000 jobs had also been given to the people under the project so far.\nShe said approximately over 185 industries units including different scale of sizes were working in the capital. She said there was complete prohibition of flow of industrial waste into rivers or streams of the capital.\nThe minister said all industries of the capital were bound to control their industrial waste through installation of pollution control systems.\nShe said all steel furnace industries in the capital except two had installed air filter in the last two years. The air filters converted five ton carbon every month into power form which was being used for making artificial items including jewelry, she said.\nThe minister said the Supreme Court had given verdict that no brick kiln would be allowed to run without zig-zag technology. The government was providing assistance to kilns owners to convert their plants with zig-zag technology, she said.\nZartaj Gul said after 18th constitutional amendment, Pakistan Environmental Protection Agency (Pak-EPA) was mandated with its function under Pakistan Environmental Protection Act 1997 for protection, conservation and rehabilitation of environment in Islamabad Capital Territory (ICT) only.\nPak-EPA took legal actions against the industries when noncompliance of Pakistan Environmental Protection Act 1997 and rules and regulations made thereunder, were observed, she said.",
  "retrievedAt": "2025-08-11T20:16:59.036Z"
}
