{
  "title": "Indus Water treaty ignores climate variant, depleting aquifer; dialogue necessary to address water crisis: Amin aslam",
  "link": "https://www.app.com.pk/national/indus-water-treaty-ignores-climate-variant-depleting-aquifer-dialogue-necessary-to-address-water-crisis-amin-aslam/",
  "date_published": "2020-02-15T23:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):Adviser to the Prime Minister on Climate Change Malik Amin Aslam Sunday said the Indus Water Treaty between India and Pakistan overlooked climate changes and decreasing level of underground water that were creating water crisis in the country.\nHe made these remarks addressing a special talk on “Sustainable Development and Climate Change here.\nAmin said there had been a shift in the monsoon season’s pattern that increased dry weather in the region that caused the ground water (aquifer) to deplete and overall water resources.\nThe adviser said, “There should be a dialogue on this issue to incorporate climate pattern shifts and aquifer depletion in the Indus Water Treaty as it is causing serious water scarcity in the country. But the present situation is not favourable in this regard.”\nHe added that Pakistan for the past decade had continuously been among the top 10 most vulnerable countries due to climate change and at present, was placed at number 5 in terms of vulnerability and serious risks due to climate change.\n“The adaptation cost for mitigating climate change affects was US$ 6 yo 14 billion per year,” he added.\nPakistan, he said, was facing serious impacts of environmental degradation that was mainly due to its topography and geography which was disaster-prone in nature.\nA recent World Bank report placed Pakistan among the most hot countries in the world where the world’s highest temperature was recorded in Jacobabad city of Pakistan, he added.\n“Prime Minister Imran Khan is the first person in Pakistan who highlighted environmental degradation occurring in the region in his book ‘Indus Journey’ back in 1980’s when nobody was aware of the issue in the country. He tasked me to develop Billion Tree Tsunami (BTT) plantation project which proved to be major shift in the policy and implementation of the country,” he added.\n“BTT has managed to create half a million jobs that empowered impoverished women, youth and unemployed masses and resulted in a green economy,” he noted.\nHe said it was the first project in the country’s history put to third party evaluation where global forums like WWF, FAO, WEF and IUCN called a beyond the target successful project.\nAmin said we had developed a green five-point agenda that comprises 40 percent nature based solutions and energy shift to renewable and eco-friendly solutions.\n“The green agenda comprises of 10 BTT, Plastic Bags Ban, Clean Green Pakistan Index, Recharge Pakistan and Electric Vehicle Policy. We are targeting transport transition to 30 percent to electric vehicles by 2030 as it will help reduce 70 percent running cost of automobiles and reduction in oil import bill of the country,” he added.\nIt had been for the first time that Pakistan managed to get huge amounts of grants from Green Climate Fund (GCF) as US$ 200 million funding was released for various projects including 40 monitoring stations to be installed in the Northern glaciers, Karachi Zero emissions metro bus, climate smart agriculture project and others, he added.\n“We have also launched Eco-system Restoration Fund at the COP-25 Madrid that is a transparent facility for the partner countries to partake in the 5-point green agenda of environmental conservation where Pakistan is already doing its lot,” Amin mentioned.\nAt the end, a video showing Pakistan’s challenge and efforts to address climate change was also showed to the UN Secretary General.\nMinister of State for Climate Change Zartaj Gul in her welcome address said climate change was the defining reality of current era as global efforts to mitigate environmental degradation were falling and required to increase the efforts three times more to overcome the crisis.\nShe said United Nations Secretary General was leading the climate action initiatives and organized Climate Action Summit that recommended serious action against the increasing risk of climate change.\nThe UN Secretary General deserved great appreciation for spearheading dialogues over climate change, she added.\nPrime Minister Imran Khan and his team was fully determined to implement climate change reducing efforts with the vision to leave no one behind, she added.",
  "retrievedAt": "2025-08-11T18:48:31.979Z"
}
