{
  "title": "Guterres for colossal global efforts to reverse climate impacts",
  "link": "https://www.app.com.pk/national/guterres-for-colossal-global-efforts-to-reverse-climate-impacts/",
  "date_published": "2020-02-16T06:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):United Nations Secretary General (UNSG) Antonio Guterres on Sunday while linking the need to merge the local initiatives with the global efforts to ward off the climate degradation, appreciated Pakistan and its people for taking some of the vital steps to reverse back global warming affects.\nAddressing as a key speaker in a ceremony on ‘Sustainable Development and Climate Change’ the visiting chief the global body, said that though the climate change posed grave and urgent challenges to the world community, but he was convinced ‘they can tackle them through unity which will make difference’.\nHe said though Pakistan had been facing adverse climatic effects, but it was not the only country battered with the negative effects, as no country on earth was immune to such chaotic changes, citing Australia and the US.\nGuterres said that he firmly believed that going through these challenges would not be an easy task as there were multiple and unpredictable changes in the chaotic world.\nHe also noted with regret the growing gap among the nations due to various national policies and stressed upon bringing them in cohesion for generating global momentum against global impacts.\n“I am convinced that we can tackle the challenges through unity which will make a difference,” he added.\nThe UN secretary general further said that global warming was linked to the global swarming affecting economies of the world.\nAbout global impacts upon Pakistan, he observed that about 80 per cent water in the country was being utilized for the irrigation purposes which had put this natural resource under huge stress, besides glaciers were melting which could pose challenge for the national food security.\n“Pakistan is not alone as the same story is mirrored across the world,” he said, adding that the planet was burning and some were adding to fuel the fire.\nHe also stressed upon the need for taking drastic efforts to mitigate hazardous affects of lethal gas and smoke emissions.\nThe UN secretary general underlined that they required ‘to move from grey economy to green economy’ and look towards the year 2030 with optimism and determination.\nGuterres also congratulated Pakistan for the success launch of Ten billion tsunami trees and Green Pakistan movements.\nHe said that he was extremely pleased that use of plastic bags had been banished in Islamabad and observed that dumping of plastic bags across the globe ended up in seas.\nThe UN chief also noted that achievement of sustainable development goals as agreed upon by all the members of the UN was also imperative to overcome issues of poverty, gender imbalances, unemployment, food security and human rights.\nHe also linked the achievement of the development goals with the peace and prosperity and realization of human rights which were critical for the future of the coming generations.\nHe urged the global members to come forward and cooperate beyond borders and sectors. He called upon the world community for more cooperation in eradicating issues like money laundering and tax evasion.\nGuterres also noted with satisfaction that Pakistan had been the first country that had embraced the SDGs, which was incorporated in its national development goals.\nHe also lauded government’s efforts for enhancing the social protection and safety net with initiatives like Kamyab Naujawan programme and others.\nHe said Pakistan had been grappling with the major challenges.\nThe UN secretary general also appreciated Pakistan for hosting the largest number of refugees over the years which had affected its economy and security.\nDeclaring his relations with the country as something ‘love affair’ he said it was totally unfair in which Pakistan had been portrayed in the past.\nHe also recalled his past visits to Pakistan as commissioner for the Afghan refugees and his interaction with ‘the noble and generous people of Pakistan’.",
  "retrievedAt": "2025-08-11T18:48:20.008Z"
}
