{
  "title": "Polio immunization drive to vaccinate over 39 mln children from Monday",
  "link": "https://www.app.com.pk/national/polio-immunization-drive-to-vaccinate-over-39-mln-children-from-monday/",
  "date_published": "2020-02-16T00:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):The year’s first nationwide polio vaccination drive is scheduled to start from Monday to vaccinate 39.6 million children under the age of five years across the country.\nAccording to an official of National Emergency Operations Centre, during the campaign, over 265,000 frontline polio workers would go street to street and knock at every door to protect Pakistani children against the crippling virus.\n“Building on the successful national campaign in December last year, the nation is all set to undertake aggressive measures to push the virus back during 2020 setting the stage to root out polio from the country once for all.”\n“We are committed to reach every last child with the essential polio vaccine and I request all segments of society to join hands,” said Dr. Zafar Mirza, the Special Assistant to the Prime Minister on Health.\n“We have critically reviewed our performance during last campaign and worked with provincial and district teams for an even better preparedness for the upcoming nationwide vaccination effort, ” he added.\n“The current geographical spread and the intensity of the virus transmission poses a real risk to our children across the country.\nReaching every child during the nationwide door to door campaign will provide the much needed immunity boost to our children and ensure they stay protected from the lifelong paralysis,” said Dr. Rana Muhammad Safdar, Coordinator National Emergency Operations Centre.\n“Learning from 2019, we have the firm resolve to turn the situation around in 2020. The national team urges every Pakistani to assume the role of Sehat Muhafiz ensuring vaccination of own children as well as those around them,” he said.\nTo benefit from the low temperatures, Pakistan’s Polio Eradication programme scheduled three back to back national campaigns during the months of December, February and April with two additional strategic response rounds in high risk districts during January and March.\nTo build on gains of last two months, the national EOC has deployed its 50 experts as facilitators across critical areas of the country to support the frontline workers in administering two drops of the oral polio vaccine to every child during the February NID.\nThe effort will not only protect children from contracting the disease, but also prevent them from carrying the virus in their intestines.\nThe programme is making all out efforts to ensure a polio-free future and is supported by all segments of the society including medical community, top religious scholars, journalists, celebrities etc. making it a truly national effort.\nThe drive in Karachi will start from next week.\nIt is important for parents and caregivers to welcome Polio frontline workers knocking at their doors and support them in vaccinating children in the neighborhood as well.\nThe programme has also launched the “Sehat Tahhafuz Helpline 1166” with local language capacities that allows the public to seek advice and report children that have not been vaccinated due to any reason.\nPakistan has made steady progress since 1994 bringing the number of polio cases significantly down from the highs of almost 20,000 a year. Nevertheless, it is still listed among the last two polio endemic countries in the world along with neighboring Afghanistan.\nA total of 144 wild polio virus cases were reported in the country during 2019 while another 17 have so far been reported in 2020 including ten from Khyber Pakhtunkhwa, five from Sindh and two from Balochistan.",
  "retrievedAt": "2025-08-11T18:48:31.677Z"
}
