{
  "title": "Pakistan at tipping point of tremendous tourism boost: President",
  "link": "https://www.app.com.pk/national/pakistan-at-tipping-point-of-tremendous-tourism-boost-president/",
  "date_published": "2020-02-16T03:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 16 (APP):President Dr Arif Alvi Sunday said being home to one of the oldest civilizations and rich with enormous natural and architectural beauty, Pakistan was at the tipping point of a tremendous boost in the tourism sector.\nAddressing the formal launching ceremony of an executive degree program on hospitality management introduced by Serena Hotels in collaboration with École hôtelière de Lausanne, a Switzerland based hospitality management school, the president said considering the dramatic boost in the influx of tourists, Pakistan would require more than 100,000 skilled manpower in the field of hospitality.\nThe ceremony was attended by First Lady Samina Alvi, CEO of Serena Hotels Aziz Bolani, a number of diplomats and people from collaborating agencies and organizations.\nHe said having traveled to around 35 countries, he knew the needs of a tourist while visiting abroad and lauded the hotel management for taking the initiative.\nThe president, who earlier also unveiled the plaque to launch the program, said Pakistan had experienced a slump in the tourism owing to the security situation, however since last three to four years, the situation had improved rapidly.\nHe said only Gilgit Baltistan had received around two million tourists last year comparing some 15,000 in the previous years. Even above two million people had visited Nathia Gali despite the fact the natural beauty of the area had been undermined by the haphazard constructions.\nHe said without waiting for the government’s initiatives and facilitation, people had taken over the sector and even stared renting out some parts of their own residences just to earn revenue and cope with the shortage of hotels.\nHe told the gathering that Pakistan was home to one of the oldest civilizations, Buddha remains and religious tourism which offered a great potential for the tourism sector.\nThe president also lauded the different initiatives of Agha Khan for preservation of culture, architecture and languages of different parts of the country.\nCEO Serena Hotels Aziz Bolani while highlighting Pakistan’s tourism potential said it was rich with beaches, heritage, mountains, oldest civilizations and above all the hospitable people.\nUnfortunately, the country could not yet capitalize that great asset, though the incumbent government had prioritized tourism in its policies.\nHe said Pakistan just lacked infrastructure required for facilitation of tourists.\nHe said the degree program, starting Monday, consisted of seven modules with the final modules to be held in December this year.\nHe also thanked the EHL for sending their faculty to Pakistan as one of their members also explained the world class executive program at the ceremony in which the experts would share their expertise in the art of serving the guests.",
  "retrievedAt": "2025-08-11T18:48:22.621Z"
}
