{
  "title": "PAC expresses displeasure over appointment of DG Audit Peshawar",
  "link": "https://www.app.com.pk/national/pac-expresses-displeasure-over-appointment-of-dg-audit-peshawar/",
  "date_published": "2022-09-20T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): The Public Accounts Committee meeting under the chairmanship of Noor Alam Khan on Tuesday expressed displeasure as to why grade 19 officer was posted against a higher post of DG (Audit) by the Accountant General of Pakistan in Peshawar.\nThe committee further expressed that the said DG exceeded his powers by publishing a report into the press without approval of PAC and the committee directed the AGP to remove him from the post and hold inquiry against him and submit report to the PAC.\nAccording to the press release issued by PAC secretariat, the committee emphasized the need to rehabilitate the damaged dams and its infrastructure on war footing grounds.\nFor construction of dams the ministry of water resource should strive to hire services of local engineers instead of Foreigen based engineers because local people can easily be approached in case of any damage after completion of projects as compared to foreigners.\nThe secretary ministry of water resources to make policy of stall reshuffle so that no officer/official should state more than three years against a post and all those who are working against a post beyond three years be transferred.\nThe committee issued directions to PAC secretariat to call all those government departments which are not getting their accounts Audited by the Auditor General of Pakistan like OGRA, PTCL etc in the current week.\nAll those departments which are running without rules must formulate departmental rules so thaty they could work in an organized manner.\nThe secretary establishment division has been directed to write a letter to the Registrar, Supreme Court dto provide details for accounts of Diamer-Bhasha Dam.\nThis letter should be embodied with all constitution provision in this regard.\nPAC secretariat should write a letter to the former Chief Justice of Pakistan Mr. Saqib Nisar and be requested to attend the next meeting of the committee and explain the details of account of Diamer-Bhasha Dam before the PAC.\nDuring the meeting the issue of Kalabagh Dab was raised however the chairman said that the committee should avoid from controversial issues.\nThe chairman said that the PAC has not yet received report on Mohmand Dam and directed the secretary Ministry of Water Resources to submit comprehensive report thereof without further delay.\nIn order to curb down corruption and violation of the rules from the Government department, the committee directed the secretary Cabinet Division to issue directions of PAC to all Ministries/Divisions/Departments that in future Federal Secretaries, Additional Secretaries and Joint Secretaries in charge of Ministries/Departments/Divisions shall be responsible if any violation of rules is committed in their respective Ministries/Departments/Division.\nThe secretary Ministry of Water Resources and along with provincial team of Chief Engineers of different small and big dams gave briefing to the committee on current condition of dams and damages caused due to heavy rains and floods which played havoc across the country and resulted unprecedented huge loss to human lives and dams.",
  "retrievedAt": "2025-08-11T15:36:34.048Z"
}
