{
  "title": "Imran trying to return to power trough ‘blackmailing & intimidation’: Marriyum",
  "link": "https://www.app.com.pk/national/imran-trying-to-return-to-power-trough-blackmailing-intimidation-marriyum/",
  "date_published": "2022-09-20T14:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 20 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Tuesday said Imran Khan was a ‘bluff master’ and trying to return into power through ‘blackmailing and intimidation’.\n“It is not possible for you (Imran Khan) to get power (back) through blackmailing, bluff and lies,” the minister said in a news statement while reacting to the Pakistan Tehreek-e-Insaf (PTI) chairman’s remarks.\nThose, who were advising on (striking) a balance in the civil-military relationship, should better care about Imran’s ‘mental health’, she said while referring to Chaudhry Fawad Hussain’s statement.\nImran Khan first hurled allegations and then resorted to giving clarifications. which showed that his mental condition was in a total disarray, she added.\nThe PTI chief, she said, “is a coward, otherwise, he should name the persons who are threatening him and his party leaders”.\nShe said Imran Khan, who was a “coward” and “liar”, sent his political opponents to jails while assuming that the time would never change for him.\nThe minister said Imran Khan had assumed that he could frighten Maryam Nawaz by sending her to jail, but, in fact, he was afraid of her growing popularity among the masses.\nIt was astonishing that Imran Khan, who himself was obsessed with the thoughts of Nawaz Sharif, Shehbaz Sharif and Maryam Nawaz, was talking about ‘Haqeeqi Azadi’ (real freedom), she added.\nMarriyum said the only response Imran Khan’s remarks against Prime Minister Shehbaz Sharif was that the same should be completely ignored. He (Imran) should be put under medical observation as Shehbaz’s successful foreign visits might have an adverse impact on his health, she added.\nAs regards Imran Khan’s plan for another march towards Islamabad, she said he had abandoned his workers in the midway after giving a call for long march on May 25. “He is begging for support while his spokespersons are giving clarifications,” she added.",
  "retrievedAt": "2025-08-11T15:36:35.639Z"
}
