{
  "title": "Govt focusing on relief, rehabilitation, economy: Khurramn Dastagir",
  "link": "https://www.app.com.pk/national/govt-focusing-on-relief-rehabilitation-economy-khurramn-dastagir/",
  "date_published": "2022-09-19T19:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP):Minister for Energy Engr Khurram Dastagir Khan on Monday said the coalition government was focusing on relief, rehabilitation and economy.\nThe government was paying special attention to relief and rehabilitation works being carried out in flood-hit areas of Pakistan, he said while talking to PTV.\nHe said besides improving governance government was taking steps to reduce electricity charges in next two months adding that measures were underway to control inflation.\nKhurram Dastair said discussion was being made with Russia to import wheat commodity at affordable rates.\nThe minister said that relief and rehabilitation of over thirty million people who suffered due to floods, were the priorities of the government.\nAbout inflated bills of electricity, and load shedding, he said they were working on different projects to generate more electricity to meet growing demand in the market.\nHe said that solar plants and other alternative system for generating energy would be made to address rising demand. The people had made extra usage of electricity in summer season, he noted.\nAbout rising dollar issue, he said State Bank of Pakistan (SBP), had taken notice of some private banking system. He hoped that national currency would be strengthened against dollar.\nTo a question about regime change in Punjab, he said PML-N had no interest to bring changes in Punjab. Some groups in PTI had developed differences and that may cause changes in the provincial set up, he added.\nTo a question about Shehbaz Sharif’s visit to United States, he said, finance minister had left for the USA to lend support in talks with the international organizations. Pakistani high dignitaries would inform the world organizations and leaders about the gravity of climate change in Pakistan, he added.\nKhurram Dastagir said that Saudi Arabia had extended relief to Pakistan and reschedule the payment plan. He hoped that friendly countries and international organizations including Asian Development Bank (ADB) and World Bank would also support Pakistan and provide funds for relief and rehabilitation of flood hit areas.",
  "retrievedAt": "2025-08-11T15:36:32.103Z"
}
