{
  "title": "Pakistan, Kazakhstan need to work closely for regional, global peace: Fawad",
  "link": "https://www.app.com.pk/national/pakistan-kazakhstan-need-to-work-closely-for-regional-global-peace-fawad/",
  "date_published": "2021-12-08T18:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 8 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain Wednesday said Pakistan and Kazakhstan were needed to work closely at different fora to ensure peace and stability in the world especially within the region.\nHe said both the countries were members of important international fora including the United Nations, Organization of Islamic Cooperation, Shanghai Cooperation Organization and Economic Cooperation Organization.\nAddressing a ceremony held here in connection with the national day of Kazakhstan, he said the world including Kazakhstan must come forward to help mitigate the sufferings of Afghan people on humanitarian basis. Peace and stability in Afghanistan was vital for the entire region including Pakistan, he added.Fawad, on behalf of the Pakistanis, also felicitated the leadership and people of Kazakhstan on their national day.\nPakistan and Kazakhstan ties were anchored in the shared religious and cultural values and had the potential to become important trade partners due to their strong diplomatic, historical, religious and political ties, he noted.\nThe minister said his country was committed to promote an inclusive coordination with the Central Asian countries under its ‘Vision Central Asia Policy’.\nKazakhstan was an important country of the Asia, he said while stressing the need for boosting bilateral cooperation in industrial and agriculture sectors by both the countries whose economies were mainly based on those sectors.\nThe two countries were needed to work together in the areas of politics, trade, investment, energy, bilateral relations, security and culture, the minister maintained and called for promoting bilateral cooperation among their private sectors.\n“We want to expand the railway and road network with the Central Asian States,” Fawad stressed and said both the countries had important place in the region due to their geographical importance and the Silk Route.\nHe said Islamabad had gained unique status in the world as about 65 per cent of world population was just three hours away from the federal capital of Pakistan.He said there had been vast trade opportunities in Pakistan especially in the fields of energy, agriculture, information technology, communications, construction and railways.",
  "retrievedAt": "2025-08-11T21:41:55.996Z"
}
