{
  "title": "Innovative, scientific interventions imperative to ensure food security: Shibli Faraz",
  "link": "https://www.app.com.pk/national/innovative-scientific-interventions-imperative-to-ensure-food-security-shibli-faraz/",
  "date_published": "2021-12-08T15:31:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Dec 08 (APP):Federal Minister for Science and Technology, Senator Syed Shibli Faraz Wednesday said that innovative, scientific interventions are imperative in agriculture sector to ensure food security by enhancing per acre yield.\nHe expressed these views during a meeting with UAF Vice Chancellor Prof. Dr. Iqrar Ahmad Khan at the meeting room of University of Agriculture Faisalabad (UAF).\nFederal Secretary Science and Technology Dr. Akhtar Nazir, Pakistan Council of Scientific and Industrial Research (PCSIR) Chairman Dr. Syed Hussain Abidi, Pro-Vice Chancellor Dr. Anas Sarwar Qureshi and all the deans were present.\nSyed Shibli Faraz said that instead of being an adornment of the library, researchers should introduce new technologies to solve the problems of farmers and agricultural sector. He said that farmers were facing difficulties due to poor quality seeds but the proposed certified seed project of the UAF would prove a milestone in tackling this challenge. He assured of the federal government would extend full support for the success of this project.\nHe said that UAF was rendering remarkable services for development of agriculture sector. He said that agricultural scientists should introduce IT applications for the promotion of modern trends in agriculture with the help of information technology so that the farmers could get up-to-date information immediately. He said the academia, industry and the government must make joint efforts to attain the new height of the prosperity. He said that the government was promoting the culture of need based and applied research for uplift of agriculture sector.\nHe also underlined the need to create awareness among the farmers about the latest trends including hydroponics. Dr Iqrar Ahmad Khan said that only 30-35% of the farmers in the country could benefit from certified seeds. He said the UAF seed project would come up with the valuable results. He said that agriculture was facing problems including low productivity, fertility of land, shrinking agricultural area, water, unavailability of certified seeds. He said that nature has enriched Pakistan with natural resources but unfortunately we had not used them wisely.\n“Health problems are arising due to malnutrition. If we make flour from a mixture of wheat and corn, it will also improve the quality of food,” he said. He said that the average wheat yield of Pakistan per acre is 31 maunds while progressive farmers are getting up to 60 maunds. He said that due to lack of resources in our country, the farmer were facing difficulty in obtaining agricultural inputs due to which there was a problem of reduction in overall yield per acre. He said that machine picking of cotton will increase production.\nDr. Akhtar Nazir said that all resources were being utilized for the solution of the problems faced by the farmers. He said that the scientists of UAF have to play a vital role for the development of agriculture. “Our yield per acre is very low due to traditional farming methods. If the recommendations of agricultural scientists are followed, the yield can be increased,” he said.\nDr. Syed Hussain Abidi said that the knowledge based economy was essential in the present times for progress by cultivating a culture of excellent research. “We have to take steps to bring modern technology to the farmers,” he said.",
  "retrievedAt": "2025-08-11T21:41:59.968Z"
}
