{
  "title": "Government to facilitate film, cinema industry: Firdous",
  "link": "https://www.app.com.pk/national/government-to-facilitate-film-cinema-industry-firdous/",
  "date_published": "2020-03-07T03:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr. Firdous\nAshiq Awan Saturday said the government was committed to facilitate film and cinema industry in Pakistan so that healthy entertainment could be provided to all segments of society across the country.\nShe was talking to the representatives of Pakistan Film Producers Association and Pakistan Film Exhibitors Association in Lahore, said a press release issued here. Secretary Information and Broadcasting, Akbar Durrani, Director General Directorate of Electronic Media & Publications and Chairman Central Board of Film Censors also attended the meeting.\nMatters relating to the implementation and review of National Film Policy 2018 came under discussion.\nTalking to the participants of the meeting, Dr. Firdous Ashiq Awan emphasized that the prime minister had directed that proposals for facilitating film and cinema industry may be prepared so that the relaxations and concessions approved under the existing film policy could be effectively implemented.\nShe also mentioned that the government intended to remove overlapping in the film censorship process, wherein every film has to pass thrice through the censor process, by giving more powers to the Central Board.\nShe said as this matter involves consultation with provinces, the prime minister had desired that this proposal may be discussed at the level of Council of Common Interest.\nAkbar Durrani assured the participants that the information ministry wanted to fully implement the current film policy and invited suggestions and recommendations from film associations to further improve it.\nHe said film producers would be encouraged and facilitated in shooting their films at picturesque locations in various parts of the country.\nThe meeting decided that a three-member committee will soon be formed to give its recommendations for improving the 2018 Film Policy. The committee will comprise members from the associations of film producers, film distributors as well as film exhibitors.\nParticipants of the meeting included office bearers of Pakistan Film Producers Association led by Chairman Shaikh Amjad Rasheed and Pakistan Film Exhibitors Association led by Chairman Zoraiz Lashari.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:54:51.961Z"
}
