{
  "title": "OIC’s special envoy concludes visit assuring full support for Kashmiris",
  "link": "https://www.app.com.pk/national/oics-special-envoy-concludes-visit-assuring-full-support-for-kashmiris/",
  "date_published": "2020-03-07T00:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP):The Secretary General of Organization of Islamic Cooperation (OIC)’s Special Envoy for Jammu and Kashmir Ambassador Yousef M. Al Dobeay concluded his visit to Pakistan wherein he assured for all out support to bring an end to the sufferings of the Kashmiri people.\nAccording to a Foreign Office statement issued Saturday, the special envoy and his high-level delegation met Prime Minister Imran Khan, foreign minister, minister for Kashmir affairs and Gilgit Baltistan, parliamentary committee on Kashmir, and foreign secretary.\nA delegation of representatives of the All Parties Hurriyat Conference (APHC) also met with the delegation and apprised it of the aggravating situation in IOJK.\nDuring the meetings, the Pakistani leadership appreciated OIC’s steadfast support for the people of Jammu and Kashmir, particularly in the aftermath of India’s unilateral and illegal actions of 5 August 2019.\nThe special envoy was apprised of the dire human rights and humanitarian situation in the IOJK and the threat to peace and security owing to India’s belligerent rhetoric and aggressive actions.\nIt was emphasized that the Kashmiris looked towards the OIC and Muslim Ummah for active support for the realization of their fundamental rights and for peaceful resolution of the Jammu and Kashmir dispute.\nIn AJK, the delegation held meetings with the President and Prime Minister of AJK, and visited the Line of Control (LoC) as well as a refugee camp in Muzaffarabad.\nIn their interactions, the AJK leadership commended the OIC’s commitment to the Kashmir cause and their support for the oppressed people of IOJ&K.\nDuring its visit to the LoC at Chakothi, the delegation was briefed about the loss of civilian lives and damage to property due to frequent unprovoked firings by the Indian forces across the LoC.\nAt the refugee camp in Muzaffarabad, the delegation interacted with refugees from IOJK to get first-hand understanding of the sufferings of Kashmiris under India’s illegal occupation.\nThe special envoy emphasized that Kashmir and Palestine remained the top most items on the OIC agenda.\nReaffirming the OIC’s principled position, he stated that Jammu and Kashmir was an internationally recognized dispute which called for its peaceful settlement in accordance with the relevant UN and OIC resolutions.\nHe assured that the OIC would take all necessary steps to alleviate the sufferings of the Kashmiris and help resolve the dispute according to the wishes of the people of Jammu and Kashmir.\nThis was the first visit of Ambassador Yousef M. Al Dobeay to Pakistan and AJK after his appointment as OIC Secretary General’s Special Envoy for Jammu and Kashmir during the 14th Summit of OIC held in Makkah in May 2019.\nThe visit was also a reaffirmation of the OIC’s commitment to the Kashmir cause.",
  "retrievedAt": "2025-08-11T18:54:56.762Z"
}
