{
  "title": "Plebiscite – only way to settlement of longstanding Kashmir issue: AJK Prime Minister",
  "link": "https://www.app.com.pk/national/plebiscite-only-way-to-settlement-of-longstanding-kashmir-issue-ajk-prime-minister/",
  "date_published": "2020-03-06T21:52:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): , Mar 07 (APP):Azad Jammu Kashmir Prime Minister Raja Farooq Haider Khan has said that the resolution of the longstanding Kashmir issue lies only in holding of the plebiscite under UN resolutions\nAddressing to an oath taking ceremony of District Bar Association Rawalakot on Saturday, he said India has violated international laws and agreements by annexing Occupied Jammu and Kashmir.\nThe Prime Minister said changing demography of the Occupied Kashmir is contrary to the United Nations resolutions on Kashmir.\nHe asked lawyers to utilize media and convey the grievances and plights of the Kashmiris to the United Nations and other global human rights bodies.\nRaja Farooq Haider Khan also appealed overseas Kashmiris and Pakistanis to step up their efforts for raising Kashmir issue at all available forums and set aside their differences.\nReferring to his government initiative, he said that administrative, financial and legislative powers through 13th Amendment. “Strength of the judges would be enhanced in High Court to dispose of cases as early as possible”, he added.\nEarlier, Prime Minister administered oath to the newly elected office bearers of the Rawalakot Bar Association.\nThe Prime Minister, during his visit also laid foundation stone and inaugurated different development projects in Poonch district including Goyi Nalla road, Rawalakot University road, Rawalakot-Hajira Road, Khai Gulla-Tolli Peer Lassdana Road, inaugurated Battay-Ne-Rah BHU, KhaiGalla-TarrarKhal Road, Hajira-TarrarKhal Road, Hajira-Tatta Pani Road, Hajira-Abbaspur Road, THQ hospital, Electricity Office, Abbaspur-Mehmood Galli Road and others.\nThe Prime Minister was accompanied by Minister Works and Communication Chaudhary Muhammad Aziz, Minister Forests Sardar Mir Akbar, Minister Local Government Raja Naseer Ahmed Khan, Minister Health and Finance Dr. Najeeb Naqi, Deputy Speaker Sardar Amir Altaf, Minister Education Barrister Syed Iftikhar Ali Gillani, Advisor Raja Imdad Ali Tariq and large number of party leaders and the party activists.",
  "retrievedAt": "2025-08-11T18:54:58.821Z"
}
