{
  "title": "Qureshi for coordination among departments for development of city",
  "link": "https://www.app.com.pk/national/qureshi-for-coordination-among-departments-for-development-of-city/",
  "date_published": "2020-03-07T04:31:00.000Z",
  "source": "APP",
  "content": "MULTAN, Mar 07 (APP):Foreign Minister Makhdoom Shah Mahmood Hussain Qureshi urged the district departments to ensure proper coordination for bringing positive changes in the city.\nAddressing the oath taking ceremony of newly elected members of Multan Development Authority’s (MDA) Employees Association (CBA) here on Saturday, Qureshi said four departments including MDA, WASA, PHA and MWMC could bring positive changes in the city by ensuring proper coordination among each other. He said cleanliness was being improved day by day in the city while sewerage was one of the challenging issues for the administration.\nHe said the sewerage system had not been replaced for the last 30 years which\nhad almost completed its life.\nThe foreign minister said the city of saints had a history of over thousands of years which was now being expanded in the shape of different colonies with the same sewerage system.\nHe said the sewerage water was being shifted into canals which was not only affecting agriculture land but also creating different disease for public.\nQureshi said a mega plan for sewerage was approved by the provincial government but the WASA administration told the government that the funds could not be utilized.\nHe added that now work had been started on the project and hoped that the funds would be spent on the said project before June 2020.\nThe foreign minister said he held a meeting with Chief Minister Punjab Sardar Usman Buzdar in which a comprehensive development program for Multan had been put up including water supply, sewerage, parks rehabilitation and other development works.\nHe said he had decided to utilize funds which he got in the capacity of an MNA through the certified engineers of MDA and Punjab Highways in order to ensure quality work.\nHe assured full support to Director General MDA Agha Ali Abbas for making solid strategy and proper plan for development of the city.\nFM Qureshi added that all possible resources would be utilized to ensure resources for MDA and protection of rights of its employees.\nDiscussing the issue of pending salaries to employees of Parks and Horticulture Authority (PHA) from the last four months, Makhdoom Shah Mahmood Hussain Qureshi said PHA was an important department and he would take up the issue with the provincial government to resolve the issues faced by the PHA employees.\nEarlier, he took oath from the newly elected body of the union.\nProvincial Minister for Energy Dr Akhtar Malik, DG MDA Agha Ali Abbas, Chairman MDA Mian Jameel, MPAs Saleem Labor, Waseem Khan Badozai and others were also present in the ceremony.",
  "retrievedAt": "2025-08-11T18:54:53.253Z"
}
