{
  "title": "Japan committed to provide support to Pakistan for its socio-economic uplift: Japanese envoy",
  "link": "https://www.app.com.pk/national/japan-committed-to-provide-support-to-pakistan-for-its-socio-economic-uplift-japanese-envoy/",
  "date_published": "2021-11-30T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP):The newly appointed Ambassador of Japan to Pakistan WADA Mitsuhiro on Tuesday said his government is committed to provide support to Pakistan for its socio-economic development and the effect of utilizing Japan’s strengths toward the development of Pakistan and the region will continue.\n“It is my pleasure to contribute to the development of Japan-Pakistan relations especially at this very important time and to work in this wonderful country which has a rich history, culture and also very warm-hearted people,” said a press release issued by the embassy of Japan.\nThe ambassador said that business cooperation is also a very important area for further development, adding that in 2020, the amount of export of some Pakistani products including fresh mangoes, dates, salt and shrimps to Japan stood at a record high.\nMoreover, he said the Japanese companies located in Pakistan have established long-standing business relations with Pakistan and contributed to Pakistani economic development through large amounts of investment and employment.\nHe said next year marks the 70th anniversary of the establishment of diplomatic relations between Japan and Pakistan since the cordial relationship between the two countries began in 1952.\nOn this remarkable opportunity, he said he would sincerely pursue his duties to further develop the existing friendly relationships in various fields such as politics, economy, culture, and defence cooperation.\nWADA Mitsuhiro said development cooperation between the two countries had started back in 1954 and to date, Japan has been the second largest donner for Pakistan on a cumulative basis after the United States.\nExchange of people in various fields has also promoted our relationship, he said, adding that unfortunately, the movement of people and economic activities have been restricted to a great extent in recent years due to the COVID-19 pandemic.\nHowever, he said he would continue to devote himself to enhance people-to-people exchange by utilizing all possible means, including online.\nHe appreciated the Pakistani athletes who competed at their best in the Tokyo Olympic and Paralympic Games even during the COVID-19 situation in the summer of 2021.\nThe Ambassador said he would work hard to further cordial Japan and Pakistan relationships and invited the Pakistani community to make joint efforts for further strengthening the stable, vibrant and prosperous Japan-Pakistan relations.",
  "retrievedAt": "2025-08-11T21:40:20.921Z"
}
