{
  "title": "PM Khan stirs world community’s conscience over Islamophobia: Murad Saeed",
  "link": "https://www.app.com.pk/national/pm-khan-stirs-world-communitys-conscience-over-islamophobia-murad-saeed/",
  "date_published": "2022-01-31T11:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP): Minister for Communications and Postal Services Murad Saeed Monday said Prime Minister Imran Khan exposed the organized propaganda campaign to link Islam with terrorism rather stirred the dead conscience of the world at various global foras.\nThe minister released videos of Prime Minister Imran Khan’s speeches against Islamophobia on international forums on his official Twitter handle.\nIn his statement issued here on Canadian Prime Minister Justin Trudeau and Russian President Putin’s joining Imran Khan’s voice against Islamophobia, the minister said that as Imran Khan became the Prime Minister, he raised voice against Islamophobia at the international forums.\nHe said that the world witnessed the moment, when the message of Islam resounded at the United Nations’ general assembly session.He said, Imran Khan informed the world about the agony and pain of Muslims being inflicted in the name of freedom of expression.\nMurad said that Prime Minister Imran Khan also wrote letters to the United Nations, the World Economic Forum and the OIC to take steps for stemming Islamophobia.\nHe said that Prime Minister Imran Khan also contacted world Islamic leaders, including Turkish President Raccip Tayyab Erdogan and Malaysian Prime Minister Mahathir Mohamad, to convey the true message of Islam and to counter propaganda against Islam.\nThe minister added that global voices were rising against Islamophobia in the world today, after Russian President Putin and Canadian Prime Minister Justin Trudeau’s statements against Islamophobia.He said that today the world listened to Imran Khan’s speeches as he emerged as the leader of the Islamic world.\nMuread Saeed said, Today, the whole country is asking why the political clerics and so-called liberal politicians were silent when Islam is being linked to terrorism through an organized campaign.He said while raising the query that, “We secrified 80,000 lives in war on terror but the blame kept coming on us. Why are you silent? all the former rulers except Imran Khan remained silent on the blasphemous sketches.\nHe said that those who beg for power from the outer world have bowed heads and could not fight the case of their nations at the international forums.Murad said that the former rulers used to stay in expensive hotels with number of guests and their priority was special flights, rather serving poor masses, while PM Imran Khan used to go on ordinary flight to save the country’s money and to fight the nation’s case.\nHe said that with the strong voice of Imran Khan, the propaganda against Islam was dying.Expressing gratitude to Prime Minister, he said that media was also requested to support its Prime Minister in his efforts for Islam and Muslims and to convey the true message of the Islamic countries to the world.",
  "retrievedAt": "2025-08-11T14:13:23.085Z"
}
