{
  "title": "Hurriyat Leader’s daughter receives father’s HR Award",
  "link": "https://www.app.com.pk/national/hurriyat-leaders-daughter-receives-fathers-hr-award/",
  "date_published": "2022-01-31T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 31 (APP): Raziyah Sultana daughter of Mushaal Hussein Mullick and veteran Kashmiri Hurriyat Leader Mohammad Yasin Malik received her father’s Human Rights Hurriyat Award.\nYasin Malik has been languishing in notorious Tihar jail for his sole crime to defy the Indian brutal and unlawful occupation in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHuman Rights Council of Pakistan (HRCP) honored senior Hurriyat leader Mohammad Yasin Malik with Human Rights Award for his sacrifices and peaceful struggle to break the shackles of Indian slavery, here in a ceremony on Monday.\nMuhammad Yasin Malik, the chairman of JKLF, was born in 1966 in a Kashmiri household of Maisuma Bazar, “The Gaza Strip of Kashmir”, near Budshah Chowk in the centre of Srinagar, the capital city of Jammu Kashmir. He is the only brother of his three sisters and second child of his parents.\nHis introduction to pro freedom political activism occurred while he was still in school at the age of 14.\nSpeaking on the occasion, Mushaal, wife of jailed Kashmiri Hurriyat leader, Muhammad Yasin Malik, thanked Human Rights Council for recognizing peaceful struggle of her incarcerated husband of the birth right of right to self-determination of Kashmiri people, who, she said, is battling for life in the notorious Tihar jail.\nShe said that Yasin Malik was the main youth leader along with his close friend Shaheed a Ashfaq Majeed Wani who played vital role in public mobilisation in favour of MUF during 1986-87 so called state elections.\nThe chairperson said that her husband has spent more than 15 years in jails but nothing could shake his resolve in fight against Indian occupation.\nMushaal vowed that she would keep on exposing the brutal and fascist face of Indian government at all fora. The hurriyat leader said that it is high time to accelerate our struggle to highlight the Indian brutalities unleashed in the occupied valley in order to alert the world powers and human rights organizations, who are largely oblivious to the war crimes being committed by Indian forces.\nMushaal went on to say that the fascist Narendra Modi government adopted laws and policies that systematically discriminate against Muslims and other monitories.\nThe chairperson lamented that religious minorities are being subjected to state-sponsored violence in India but the international community and UN bodies observed criminal silence over the world’s worst state terrorism.\nShe said that an alarming upsurge has been witnessed in cordon and search operations by Indian troops across the occupied territory under which innocent Kashmiri people are being ruthlessly killed on daily basis in the valley.\nMoreover, Mushaal said that over one million Indian troops conduct flag marches in the residential areas to terrorize the Kashmiri people.\nThe Hurriyat leader said that the fascist Indian forces crossed all limits of state barbarism to muzzle the dissenting voices in the valley; however, she vowed that Indian authorities could not dampen the courage of brave Kashmiri people and they would take their freedom struggle to their logical ends at all costs.\nMushaal reminded the UN bodies and world powers to honor their pledges made with the Kashmiri people and let them allow deciding their fate as per their free will.",
  "retrievedAt": "2025-08-11T14:13:19.578Z"
}
