{
  "title": "Asia Cup: India, Pakistan to face each other for the third time in final today - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan will be facing India for a third time today at 7:30pm PST as the arch-rivals clash in a potentially testy Men’s Asia Cup 2025 final at the Dubai International Stadium.\n\nPakistan were beaten comprehensively twice, first in the group stage and then in Super Fours, by the Indian team. The Indian juggernaut has crushed every opposition on its path before swaggering into the final of the eight-team tournament looking every inch the reigning 20-over world champions.\n\nIndia survived a scare in Friday’s dead rubber when they edged out Sri Lanka via Super Over after Sri Lanka managed to tie the match after getting 202 at Dubai.\n\nPakistan on Thursday won by 11 runs after stumbling to 135-8 in the virtual semi-final against Bangladesh.\n\nWith that win, the Green Shirts booked their final date with archrivals India for the first time in the 17th iteration of the Asia Cup today.\n\nAhead of the high-profile clash, Pakistan Cricket Board chief and Asian Cricket Council chairman Mohsin Naqvi has stirred up a hornet’s nest with an ambiguous post on X about a “balancing act”.\n\n“How much time do you need to explain the reasons behind the balancing act?” he wrote on X, leaving fans pondering if it was intended for the Indian team, given its timing.\n\nThe previous two matches have been marred by much controversy as the two countries are playing against each other amid high tensions following the four-day military standoff in May.\n\nThe controversy began with calls from across the border to “boycott” the match. Later, at the match, pressure got to the players as well, with the Indian team refusing to shake hands with their rivals at the toss and after the match, prompting many to decry the “lack of sportsmanship” exhibited by the Indian side.\n\nIndian skipper Suryakumar Yadav was said to have “politicised” the win by bringing up the Pahalgam terrorist attack in India-occupied Kashmir, saying the victory was “a perfect gift” for his nation.\n\nIn response to this, the Pakistan Cricket Board (PCB) lodged an official complaint with the ICC against Yadav.\n\nThe PCB also complained to the ICC that match referee Andy Pycroft had told skipper Salman Ali Agha not to approach Indian counterpart Suryakumar Yadav for a handshake at the toss.\n\nFurther, during the September 21 match, when the rivals met for the second time, Pacer Haris Rauf and opener Sahibzada Farhan were reprimanded by the ICC for gestures made during the match.\n\nBecause of fraught political ties, nuclear-armed neighbours India and Pakistan only meet at neutral venues during multi-team tournaments.\n\nTensions soared ahead of the Asia Cup after the two countries engaged in their worst conflict since 1999. The hostilities in May left more than 70 people dead in missile, drone and artillery exchanges, before a ceasefire.\n\nThe conflict was triggered by an April attack on civilians in Pahalgam in occupied Kashmir that New Delhi accused Pakistan of backing, a charge Islamabad denies.\n\nIndia lifted the Asia Cup in its last, 50-over edition and are the favourites to retain the crown.\n\nPakistan squad: Salman Agha (captain), Saim Ayub, Fakhar Zaman, Sahibzada Farhan, Hasan Nawaz, Salman Mirza, Mohammad Haris, Mohammad Nawaz, Shaheen Shah Afridi, Haris Rauf, Hasan Ali, Hussain Talat, Sufiyan Muqeem, Abrar Ahmed, Khushdil Shah, Faheem Ashraf, Mohammad Wasim.\n\nIndia squad: Suryakumar Yadav (capt), Shubman Gill (vice-capt), Abhishek Sharma, Tilak Varma, Hardik Pandya, Shivam Dube, Axar Patel, Jitesh Sharma (wk), Jasprit Bumrah, Arshdeep Singh, Varun Chakravarthy, Kuldeep Yadav, Sanju Samson (wk), Harshit Rana, Rinku Singh.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/28134911b168f18.webp",
  "retrievedAt": "2025-10-12T00:16:30.363Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945184/asia-cup-india-pakistan-to-face-each-other-for-the-third-time-in-final-today",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T09:04:47.000Z"
}
