{
  "title": "Three TikTokers arrested for tirade against CM Punjab in Sargodha - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: Faisalabad National Cyber Crime Investigation Agency (NCCIA) on Saturday arrested three TikTokers from Sargodha for using abusive language against Punjab Chief Minister Maryam Nawaz.\n\nSub-inspector Amer Sultan claimed in his FIR that accused Ahad Abbas, Badar Zaman and Qasim Ali uploaded ‘unethical’ videos on their TikTok accounts.\n\nAn NCCIA official said that all three had been arrested and their mobile phones had also been recovered.\n\nARRESTED: A Faisalabad anti-corruption establishment (ACE) team arrested a former bank official from Toba Tek Singh for fraud after 19 years.\n\nAn ACE official said that accused Amer Shahzad had committed fraud of Rs3.5 million with account holders.\n\nHe was declared a proclaimed offender by a court 19 years ago and since then he was at large.\n\nThe official claimed that after receiving information that the accused had returned to Pakistan from abroad, he was arrested in a successful raid.\n\nACTION AGAINST COPS: Faisalabad RPO Zeeshan Asghar on Saturday took action against three police officials on charges of corruption and overstepping their authority.\n\nA press release said that Jaranwala Saddar SHO inspector Asim Mahais and Gojra City SHO inspector Muhammad Sarfraz had been suspended. Toba Tek Singh City SHO sub-inspector Muhammad Nadeem Jat had been demoted to the ASI rank for poor performance, incompetence and failure to register a case in time.\n\nPublished in Dawn, September 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:24:59.202Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945048/three-tiktokers-arrested-for-tirade-against-cm-punjab-in-sargodha",
  "dateList": "2025-09-28",
  "date_published": "2025-09-27T23:20:41.000Z"
}
