{
  "title": "Pakistan gunning to avoid unwanted hat-trick against India in Asia Cup final - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: Pakistan will be gunning for revenge, but an unbeaten India look firm favourites to retain the Asia Cup title when the arch-rivals clash in a potentially testy final on Sunday, with political and on-field friction overshadowing their first-ever title clash in the regional tournament.\n\nThe Indian juggernaut crushed every opposition before swaggering into the final of the eight-team tournament, looking every inch the reigning 20-over world champions.\n\nPakistan secured their place in the final after edging past Bangl­adesh by 11 runs on Thursday, setting the stage for a blockbuster meeting with the defending champions.\n\nThe showdown comes months after deadly fighting between the nuclear-armed neighbours, who have not played a bilateral series in over a decade.\n\nTheir most recent meetings in the group stage and Super Four round of this Asia Cup saw India skipper Suryakumar Yadav refusing to shake hands with counterpart Salman Ali Agha.\n\nPlayers from both sides also skipped post-match handshakes after the first and second encounters, which were marred by some over-the-top celebrations and subsequent verbal duels between players.\n\nIndia comfortably won both the games, stretching their unbeaten run against Pakistan to seven matches dating back to 2022 — three One-day Internationals and four T20Is. India leads 12-3 in T20 matches.\n\n“Every individual has the right to express emotions. If we stop a fast bowler from showing emotions, what’s left then? I won’t stop anyone as long as it is not disrespectful,” Pakistan captain Salman told reporters on Saturday.\n\nThe all-rounder acknowledged the enormity of an India-Pakistan final but brushed aside the outside chatter.\n\n“India versus Pakistan matches come with a baggage of pressure. In the last two games, we lost because we made more mistakes,” he admitted.\n\n“The final brings the same pressure on both teams. We don’t care what the Indian media says. For us, it’s only about doing the basics right.”\n\nThe noise surrounding India-Pakistan games often transcends cricket, but Salman insisted that sportsmanship has remained a constant, irrespective of diplomatic highs and lows.\n\n“I started playing U-16 in 2007. I never saw any teams not shaking hands. Even when Indo-Pak relations were worse, we still shook hands,” he recalled.\n\nWith television studios on both sides dissecting every gesture and word, Salman’s mantra was simple: ignore the ‘uncontrollables’ and focus on the trophy. “We can’t control what’s happening outside. We can control the controllables. And that is winning the Asia Cup.”\n\nThe Indian team, containing the world’s top-ranked batter and bowler in the T20 format in opener Abhishek Sharma and spinner Varun Chakravarthy, has won all five of their matches in this 17th edition of the Asia Cup and is chasing a record-extending ninth title.\n\nSix-hitting machine Abhishek is also the tournament’s leading scorer with 309 runs from six innings, often setting the tone of India’s batting in the first six powerplay overs.\n\nIn a low-scoring tournament where only Pathum Nissanka of Sri Lanka managed a century, Abhis­hek’s red-hot form at the top meant skipper Suryakumar Yadav’s struggle with the bat has not really been felt.\n\nWily seamer Jasprit Bumrah has helped India control the powerplay overs with the ball but left-arm spinner Kuldeep Yadav has been their wrecker-in-chief, leading the bowlers’ chart with 13 wickets.\n\nFellow spinners Axar Patel and Chakravarthy have also kept it tight in the middle overs and the slew of all-rounders at his disposal has left Suryakumar practically spoilt for bowling choices.\n\nBut their fielding has been suspect, with 12 dropped catches in the tournament so far.\n\nIndia survived a scare in Friday’s dead rubber when they edged out Sri Lanka via Super Over, which should shake off any complacency that might have crept into their campaign.\n\n“We [as a team] by no means are a finished article and we know that,” India’s bowling coach Morne Morkel told reporters at a press conference after the match. “But luckily, we have won, and we have won sometimes in ugly fashion, but we will take that. And as a group, we always take the learning and look to improve and take it on Sunday.”\n\nPakistan will naturally be motivated to avoid a third defeat to the arch-rivals in a single tournament and will take heart from their narrow victory in Thursday’s virtual semi-final against Bangladesh.\n\nThe two-time Asia Cup champions will rely on their pace duo of Shaheen Shah Afridi and Haris Rauf to provide early breakthroughs, while spinners Abrar Ahmed and Mohammad Nawaz will aim to contain India’s powerful batting lineup.\n\nMorkel, who had earlier worked briefly as a bowling consultant with the Pakistan team, was looking ahead to an “edge of the seat” battle between Shaheen and Abhishek.\n\n“Shaheen is obviously an aggressive bowler who will try and knock you over. And Abhishek is not going to hold back. I think so far, every time these two went head-to-head, we all as cricket supporters and fans are on the edge of our seats, and that’s great for the game,” Morkel said.\n\nPakistan’s batting, however, remains a concern after collapsing to 49-5 against Bangladesh before recovering to post 135-8, which proved to be a winning total.\n\n“We know we haven’t batted well,” said Salman. “Hopefully we give our best in the final … We know that if we play our best cricket, we can beat any team.”\n\nPublished in Dawn, September 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/28112608b74da05.webp",
  "retrievedAt": "2025-10-12T00:16:59.745Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945084/pakistan-gunning-to-avoid-unwanted-hat-trick-against-india-in-asia-cup-final",
  "dateList": "2025-09-28",
  "date_published": "2025-09-27T23:20:25.000Z"
}
