{
  "title": "Karachi police constable suspended over allegation of sexually assaulting polio worker - Pakistan - DAWN.COM",
  "author": null,
  "content": "A constable of Mithadar police in Karachi has been suspended over allegations of sexually assaulting a female polio worker, South Deputy Inspector General (DIG) Syed Asad Raza told Dawn.com on Sunday.\n\nDIG Raza has directed the South senior superintendent of police to conduct a “transparent inquiry” of the case.\n\n“The girl is an orphan and a polio worker,” the DIG said. “The suspended policeman was a part of the polio team.”\n\nIn her complaint, the victim stated that she is a divorcee and the mother of two children. She alleged that the suspect took her phone number from the team’s WhatsApp group and started sending her messages saying that he loves her and wants to marry her.\n\nShe alleged in the complaint that the suspect took advantage of her and took her to a guest house, where he sexually assaulted her. The victim added that she has become pregnant with the policeman’s child, but now he is refusing to marry her.\n\nEarlier this week, the body of a seven-year-old boy who went missing was found in the Landhi area, while a post-mortem examination confirmed that he had been raped before being murdered. A police surgeon said the body was in an advanced state of decomposition and bore multiple bone fractures.\n\n“The findings are consistent with anal sexual violence,” she said. The cause of death was determined to be massive head trauma inflicted by a hard and blunt object.\n\nA few days later, two men confessed before magistrates to raping the boy and murdering him by strangling him with a shoelace and striking him in the head with a brick.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/09/24111711291465c.webp",
  "retrievedAt": "2025-10-12T00:16:28.481Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945250/karachi-police-constable-suspended-over-allegation-of-sexually-assaulting-polio-worker",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T16:29:32.000Z"
}
