{
  "title": "Many helpless as flood relief work ends in Alipur - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Thousands of flood-affected residents in Tehsil Alipur of Muzaffargarh district are left to survive on their own, marooned without access to food, shelter, and essential supplies after the district administration officially ended rescue and relief operations, despite vast areas remaining submerged.\n\nThe decision has plunged already vulnerable communities into a deeper crisis. In water-logged villages including Azmatpur, Lati Marhi and Bait Nabi Shah, stagnant floodwater continues to fill homes, but with official relief channels severed, families have nowhere to turn.\n\nThe administration has also shut down relief centres established in local schools, compelling displaced individuals to return to their destroyed or inundated houses.\n\nThe scale of the disaster is immense. Of the 14 union councils in Tehsil Alipur, 11 were swallowed by floodwaters. Officials estimate that nearly 400,000 of the tehsil’s 700,000 people have been affected and forced to abandon their homes.\n\nDistrict official links provision of further relief to completion of damage assessment survey\n\nFor residents like Abid Khan, this means living under the open sky.\n\n“All of the houses in our basti have collapsed,” Mr Abid said. “We have to live under the sky. We did not get any tents, and my children and other family members have to spend the day under the scorching sun.”\n\nKhan, from the Azmatpur area, added that his family has no ration and no fodder for their surviving cattle, which are their primary source of livelihood.\n\nMuzaffar Gopang from the village of Kundrala said his family has been without a roof for 15 days.\n\n“Our house collapsed and water is still inundating our low-lying area. We cannot even go back,” he said. Mr Gopang stated their cattle are stranded on riverbanks without fodder and that families feel completely cut off. “The authorities did not visit our areas.”\n\nDescribing the scene of utter destruction, he reported floodwaters reaching 10 to 12 feet. “All the houses of Basti Chandia have washed away. We are helpless and waiting for any relief. Ministers and officials visited other areas, but we did not receive any help.”\n\nOthers reported receiving no aid at all. Ghulam Fareed Chandia from Bait Mullanwali said his community has not received a single packet of ration in over two weeks.\n\n“No one from the ministers or the district and tehsil administration has visited us,” he said. “All the houses of Basti Chandia have washed away. We are helpless and waiting for any relief.”\n\nMuzaffargarh Deputy Commissioner Usman Tahir Jappa confirmed the conclusion of the rescue and relief phase.\n\n“The rescue and relief operation was completed, and we are now starting a survey to address the issues of the people,” Mr Jappa told Dawn. He added that relief would be provided after the damage assessment survey is completed.\n\nPublished in Dawn, September 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:16:59.875Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945112/many-helpless-as-flood-relief-work-ends-in-alipur",
  "dateList": "2025-09-28",
  "date_published": "2025-09-27T23:20:17.000Z"
}
