{
  "title": "Russia pounds Kyiv, other regions in mass drone and missile attack - World - DAWN.COM",
  "author": null,
  "content": "Russia launched hundreds of drones and missiles at Kyiv and other parts of Ukraine early on Sunday, killing at least four people and injuring dozens, in one of the most sustained attacks on the capital since the full-scale war began.\n\nNeighbouring Poland closed its airspace near two southeastern cities and its air force scrambled jets in response until the danger had passed.\n\nUkraine’s military said that Russia launched 595 drones and 48 missiles overnight and its air defences shot down 568 drones and 43 missiles. It noted that the main target of the strike was the capital Kyiv.\n\nPresident Volodymyr Zelensky said the attack, which lasted more than 12 hours, damaged a cardiology clinic, factories and residential buildings.\n\nRussia’s defence ministry said on Sunday it had carried out a “massive” attack on Ukraine using long-range air and sea-based weapons and drones to target military infrastructure, including airfields.\n\nMoscow has denied targeting civilians in its war against Ukraine, although thousands have been killed and residential areas extensively damaged by its attacks.\n\nZelensky again urged the international community to act decisively to cut off Russia’s energy revenues that fund its invasion. Ukraine has so far failed to convince US President Donald Trump to impose punitive sanctions on Moscow.\n\n“The time for decisive action is long overdue, and we count on a strong response from the United States, Europe, the G7, and the G20,” he said on the Telegram messaging app.\n\nKyiv awoke to loud explosions, drones flying overhead and air defences booming. Smoke from one of the strike sites drifted across the morning sky as the air raid alert ended at 9:13am, nearly seven hours after it began.\n\nReuters journalists visited an area in the suburbs of Kyiv, where rows of newly built homes were almost totally destroyed, and parked cars flattened by falling debris.\n\nResidents sifted through the wreckage of an apartment block after their windows were blown in by the force of a blast.\n\nSome people hurried to metro stations underground, from where they followed events on their mobile phones.\n\nAttacks on such a scale have stretched Ukraine’s limited air defences throughout 2025. Zelensky said on Saturday an additional Patriot missile system from Israel had been deployed and he expected two more to arrive this autumn.\n\nHe and other officials have asked international partners for more to protect Ukraine’s skies, but air defence systems are limited in availability and other nations are keen to bolster their defences amid perceived threats from Russia.\n\nZelensky said Sunday’s attack targeted several regions, including the southern city of Zaporizhzhia, where authorities said at least 16 people were injured.\n\nEmergency services said at least four people were killed, while 67 people were reported wounded across the country by local authorities.\n\nAmong the fatalities was a 12-year-old girl, although that has not been officially confirmed, Tymur Tkachenko, head of Kyiv’s military administration, said on Telegram.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/28200820bc93d39.webp",
  "retrievedAt": "2025-10-12T00:16:27.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945234/russia-pounds-kyiv-other-regions-in-mass-drone-and-missile-attack",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T15:09:05.000Z"
}
