{
  "title": "Asia Cup: Shaheen spreads his wings to become Pakistan’s steady ‘all-rounder’ - Sport - DAWN.COM",
  "author": null,
  "content": "In a game that had turned into a virtual semi-final, a transformation was nearing its completion. It had taken time but the necessary trust had been gained — a tottering Pakistan were pinning hopes on Shaheen Shah Afridi to dig them out of a hole and, for a change, with the bat.\n\nBangladesh had reduced Salman Ali Agha’s men to 58-5 in their 2025 Asia Cup Super Four clash and Pakistan were searching for some inspiration when the transformed Shaheen hoicked Tanzim Hasan Saqib to the top tier of the Dubai International Cricket Stadium for the first six of the match.\n\nTaskin Ahmed, Bangladesh’s most successful bowler of the night, was then clubbed for another in the next over to pave way for Pakistan to post a respectable 135-8; the defence of which he would later spearhead with the ball.\n\nThere is a viral video from the 2024 T20 World Cup in which Shaheen jokingly complains to the ICC crew for putting ‘bowler’ next to his name instead of ‘all-rounder’. Only days later, his unbeaten 16-ball 23 not out helped Pakistan to a respectable score against a much weaker and lower-ranked USA — a game they went on to lose and resulted in an upheaval in the T20 side — after a listless showing from batters had left Pakistan in jeopardy, much similar to this night in Dubai.\n\nThe two massive sixes had been anticipated from the moment Shaheen had walked into the middle ahead of all-rounders Mohammad Nawaz and Faheem Ashraf. This was only the fourth time in his T20I career that Shaheen had walked out to bat above number eight.\n\nSuch has been this tournament for him, after all. His runs have taken Pakistan to decent totals from embarrassing positions and they have come at scorching strike rates, turning his lower-order contributions into impactful knocks.\n\nThere was an uproar only days ago, in their opening Super Fours fixture, when Pakistan kept Shaheen in the dugout as India asphyxiated their middle order after a flying start to restrict them to 171. Shaheen had come into that game after being the second-highest scorer for Pakistan in the last two matches. His best T20I score of 33 not out off 16 balls had taken Pakistan to 127 against India in their first meeting of the tournament and his 29 not out off 14 had propelled them to 146 against UAE. He hit four sixes against India that were the most a batter had managed that night.\n\nThere have been instances in the Pakistan Super League when Shaheen has promoted himself up the order for the very job that needed to be done in the latter half of Pakistan’s innings during their Super Fours meeting with India. The most famous instance being the 2023 PSL final when he rushed out of the dressing room to cross the rope ahead of David Weise after the fall of wicket in the 15th over and smashed 44 not out in only 15 balls.\n\n“My job is to deliver [for the team] whether it is in the batting, bowling or fielding,” Shaheen said during this Asia Cup. “I try to give my 100 per cent whenever I play regardless of whether I am sick or I am carrying an injury. I don’t show it because my job is to lift the morale and energy of the team.”\n\nIn Shaheen, Pakistan had found an attacking bowler who bowled at express pace and moved the new ball around. His high release point helped him extract bounce from the slow surfaces, but his most threatening weapon has always been his pitched up in-swingers.\n\nHe found success across formats and transformed into Pakistan’s all-format leader of the attack, before that ill-fated dive in Galle derailed his career.\n\nUnable to run and bowl, it was during the days of his rehabilitation that Shaheen began to work on his batting. Later, in a PCB in-house video that captured his batting session, Shaheen recalled how he had always liked to bat, but only got the opportunity to work on it during the rehab.\n\nAnd his efforts have started to pay dividends.\n\nShaheen has hit 23 sixes and 15 fours in T20Is and 22 and 14 of those have come since his return from the injury. He averages 16.41 and has been scoring at a strike rate of 134.13 since, a marked improvement from 9.50 and 95 from his pre-injury days.\n\nThat he had the greatest six-hitter Pakistan has ever produced at his house helped. A video of Shahid Afridi, his father-in-law, teaching him bat swing and feeding him under arm full tosses at the Moin Khan Academy in Karachi in early 2023 went viral. In the PSL that year, Shaheen made 133 runs at a strike rate of 168.35. The next PSL, his 107 runs were scored at 164.61. Across the 2023 and 2024 seasons, Shaheen hit 21 sixes and 13 fours.\n\nNow, he’s unwaveringly translated that to the international stage.\n\nIn this Asia Cup, only five players from Pakistan have scored more than 80 runs and Shaheen’s strike rate of 188 is the best among them. In fact, his strike rate, among batters with at least 80 runs, is only bettered by Afghanistan’s Azmatullah Omarzai (217.07) and India’s Abhishek Sharma (204.63) in this tournament.\n\nHe has the joint-fourth most sixes in the tournament behind Sharma (19), Bangladesh’s Saif Hasan (12), and Sri Lanka’s Pathum Nissanka (11). Sahibzada Farhan, who Pakistan brought into the side after a chart-topping PSL for his six-hitting abilities, has hit the same number of sixes as Shaheen.\n\nWhat augurs well for Pakistan is that he seems to be peaking in both aspects of the game just at the right time as they head into the Asia Cup final against India as it was his lethal opening bursts that set Pakistan’s wins in the last two matches against Sri Lanka and Bangladesh.\n\nHe took a wicket each in the first over — which has now become his trademark — and dismantled their top orders inside the powerplay. Following his consecutive three-wicket hauls, he now has the joint-second most wickets in this tournament with nine scalps with each wicket costing 16 runs.\n\nThe last two years have not been a smooth sailing for Shaheen. He has been in and out of the side and has remained embroiled in off field controversies. He was sacked as the captain of the T20I side after only one series at the start of 2024 and was later quoted in a PCB media release without his consent that caused friction between him and the management.\n\nHe was dropped from the Test side after the first Bangladesh Test and again after the first Test against England. He was not included in the squad for the Tests in South Africa, despite the pitches there ripe for fast bowling, and was later dropped from the T20I side for the home and away series against Bangladesh in summer this year despite leading Lahore Qalandars to their third title. He is the only captain to have multiple PSL trophies.\n\nThere had been concerns about Shaheen’s waning bowling speed and effectiveness. And, in all fairness, he is yet to be as good as he was before the knee injury. But, the signs, of late, have been encouraging.\n\nShaheen has had wickets in every match of this tournament, except against India. He got smashed at 11.50 and 10.43 runs per over on the last two Sundays.\n\nIndia’s batting dominance in this tournament has come at the back of the staggering top-order performances and the battle between the Indian openers and Shaheen sets for a spicy subplot.\n\nT20 is a fickle format and it takes only one bowling spell or a batting cameo to take the game away from the opposition. Shaheen knows a thing or two about it. He had orchestrated Pakistan’s famous 10-wicket win over India in the 2021 T20 World Cup inside the first 2.1 overs and has proven himself as a reliable lower-order contributor with the bat over the last two weeks.\n\nA bit of both this Sunday and he will not have to ask anyone to write ‘all-rounder’ next to his name.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/2811390769da1f3.webp",
  "retrievedAt": "2025-10-12T00:16:30.198Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945180/asia-cup-shaheen-spreads-his-wings-to-become-pakistans-steady-all-rounder",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T07:22:49.000Z"
}
