{
  "title": "Global shipping faces fragile growth - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Global shipping, responsible for over 80 per cent of world merchandise trade, is entering a phase of fragile growth, rising costs and increased uncertainty, according to UNCTAD’s Review of Maritime Transport 2025. After strong growth last year, seaborne trade volume is expected to rise by only 0.5pc in 2025, reflecting challenges from geopolitical tensions and evolving trade patterns.\n\nThe report highlights that long-distance rerouting driven by geopolitical tensions kept ships busier in 2024, contributing to a record 6pc increase in ton-miles. However, new tariffs, port fees and shifting trade routes are creating operational challenges, with more skipped ports, longer voyages and higher costs.\n\nUS policy measures targeting foreign-built or operated vessels may further increase shipping costs and affect routes. The energy sector is also undergoing a transition: coal and oil volumes are expected to decline due to decarbonisation, while the gas trade continues to expand.\n\nCompetition for critical minerals, essential for batteries and renewable energy, is adding new tensions in maritime trade.\n\nDeveloping countries depend heavily on maritime logistics to capitalise on these opportunities.\n\nFreight rates have become volatile, influenced by disruptions such as the 2024 Red Sea crisis. Continuing geopolitical tensions in 2025 raise concerns about potential disruptions in strategic areas, such as the Strait of Hormuz. Environmental regulations and emissions pricing are increasingly shaping shipping economics.\n\nHigh transport costs disproportionately impact developing countries, especially Small Island Developing States (SIDS) and Least Developed Countries (LDCs). UNCTAD urges the adoption of targeted policies to manage rising costs, enhance port infrastructure, and promote cleaner and more efficient operations.\n\nPorts are facing congestion and delays, which are compounded by the need to invest in digital systems, such as maritime single windows and port community platforms.\n\nPublished in Dawn, September 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:16:43.647Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945131/global-shipping-faces-fragile-growth",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T01:52:50.000Z"
}
