{
  "title": "Shama Junejo claims PM Shehbaz included her in Pakistan’s UN delegation as adviser - Pakistan - DAWN.COM",
  "author": null,
  "content": "The controversy surrounding the supposed inclusion of columnist and social media activist Shama Junejo in Pakistan’s delegation to the United Nations this week took a new turn on Sunday when she claimed that Prime Minister Shehbaz Sharif had included her among the delegates as an adviser.\n\nThe controversy had surfaced when photos from Defence Minister Khawaja Asif’s address at a UN Security Council session on artificial intelligence (AI) spread like wildfire on social media platform X, with users pointing to Junejo sitting in the background. Several of them also shared screenshots from her Twitter (now X) timeline from several years ago, expressing support for Israel — a position sharply at odds with Pakistan’s longstanding pro-Palestinian stance.\n\nAfter social media furore, Asif said on X that only the Foreign Office could explain Junejo’s presence at the session. Later, the FO clarified that she had not been part of Pakistan’s accredited delegation.\n\nFollowing that, Asif also spoke about the matter on Geo News programme ‘Naya Pakistan’. Asked whether he was “taken aback” by the FO’s statement, Asif emphatically said: “I was taken aback, rather I was a bit disturbed that such people could be with the delegation whom no one owns later.” He also denied Junejo having written PM Shehbaz’s speech for the 80th UN General Assembly session, further stating that as far as he knew, she did not have any official position, be it of an adviser or a special assistant.\n\nHowever, Junejo claimed in a post on X today that she had been working for the prime minister for the past many months.\n\n“My policy briefs, advice and points during the Pakistan-India escalation are all part of the record and preserved,” she said, further claiming that the premier had assigned her the task of “writing the UN speech”.\n\nThe London-based social media activist went on to claim that the PM himself had included her in the UN delegation as an adviser and that she was also issued a security pass.\n\n“I worked with his team day and night. I travelled with him, stayed with his team in the same hotel and was also a part of his important meetings on the sidelines (of the UNGA session), such as the one with Bill Gates,” she said, adding that in another conference on climate on the UNGA sidelines, she was sitting with Foreign Minister Ishaq Dar behind the prime minister.\n\nAccording to Junejo, after the session on climate, the protocol team escorted her to the session on AI, where she sat behind Asif alongside a man she identified as Bilal. In her post, she also shared a picture of herself with Asif and Pakistan Crypto Council Chief Executive Officer Bilal Bin Saqib, as well as that of her UN card.\n\nJunejo maintained that at the AI conference, Bilal continued to write a new speech and “we had tea together afterwards”.\n\n“We sat together for 40 minutes waiting for the car, and returned to the hotel together in the same car. Khawaja Asif sahib sat with me on the backseat of the car,” she maintained.\n\nJunejo claimed that she was also at the UN “with the others” when PM Shehbaz was delivering his speech. “There, Khawaja Asif was sitting in front of me, and we all applauded together for the prime minister.”\n\nAccording to her, the PM’s “historic speech was not only written by her, but it was teamwork”. Junejo had claimed about being a part of the minister’s speech-writing team since April earlier as well.\n\nIn her post today, she claimed that her return flight was also booked beforehand, and the mission protocol team had dropped her at the airport.\n\nShe questioned, “Why is Khawaja Asif sahib issuing such statements now and under what agenda is he tarnishing a historic visit of his government?”\n\n“The prime minister should ask him about this, as his authority has been challenged, not mine.”\n\nIn a similar post on X in English, she said Asif’s statements and the FO’s post “ have embarrassed Pakistan globally“.\n\nShe added, “If anyone attempts to malign my character or professional integrity, I reserve the right to pursue legal action in the UK.”\n\nWhen the controversy had initially surfaced, Asif, facing a barrage of criticism, publicly distanced himself from Junejo’s appearance with the delegation and pointed the finger at the FO.\n\nIn a post on X, the defence minister had clarified that he had given the speech instead of PM Shehbaz at the UNSC session as the latter had other engagements.\n\n“This woman or whoever sat behind me was and is at the discretion of the Foreign Office,” Asif said. “Who is this woman? Why is she with the delegation, and why was she seated behind me? Only the FO can answer these questions. It is not appropriate for me to respond on their behalf.”\n\nSubsequently, the FO issued a clarification, stating: “The Ministry of Foreign Affairs has noted queries regarding the seating of a certain individual behind the defence minister at a recent meeting of the UNSC.\n\n“To clarify, the individual in question was not listed in the official letter of credence for the Pakistan delegation to the 80th UNGA session, signed by the deputy prime minister and foreign minister.\n\n“As such, her seating behind the defence minister did not have the approval of the deputy prime minister/ foreign minister.”\n\nOfficial sources confirmed to Dawn that while the FO did not issue the required letter of credence, Junejo joined PM Shehbaz’s entourage from Britain, where she had been staying at the same hotel.\n\nOn arrival in New York, Pakistan’s mission to the UN was directed by “a senior political leader” to issue a note verbale for facilitating her accreditation so that she could attend meetings, including the UNSC debate, the Dawn report said.\n\nIt added that the leader’s argument was that though she wasn’t part of the official delegation notified by FO for the session, she was part of the entourage. Therefore, the mission was asked to get her accredited.\n\nA source categorically told Dawn that the FO did not even have prior knowledge about Junejo’s inclusion in the entourage.\n\nMeanwhile, Junejo has also posted about her stance on Israel.\n\nIn a post on X today, she said that an impression of her being pro-Israel was created on the basis of a 2018 post on X. “Whereas, I have been writing against the massacre in Gaza and Netanyahu almost daily since 2023. But nobody sees that.”\n\nShe said her statements about Pakistan recognising Israel were given during Abraham Accords — a set of agreements that normalised ties between Israel and multiple Arab states — and that she had always condemned Israel’s atrocities since its invasion of Gaza. “I will keep doing so,” she added, referring to a video of Pakistani delegates walking out during the recent UNGA session.\n\nAt the UNGA, delegates from several countries had walked out, boycotting Israeli Prime Minister Benjamin Netanyahu’s speech.\n\nEarlier, Junejo had shared screenshots on X of previous posts where she had called out Israel’s genocide in Gaza.\n\nThe Dawn report from yesterday mentions that in her social media posts from London, Junejo had also said she was in possession of the ‘secret files’ raising questions about the security of such documents.\n\nJunejo, in a post on X, also appeared to be clarifying this matter. She said: “There was a fire incident at the Churchill Hotel which left me panicked. I am disabled and was not assisted during evacuation. I carried hard copies of speech drafts and meeting notes — my personal intellectual property. These were sensitive but not state documents. I held no access to or custody of any official files beyond my remit.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:16:30.274Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945191/shama-junejo-claims-pm-shehbaz-included-her-in-pakistans-un-delegation-as-adviser",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T11:44:58.000Z"
}
