{
  "title": "SHO among six injured as protest against child’s murder turns violent in AJK’s Kotli district - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: At least five police personnel, including an SHO and a woman constable, and one demonstrator were injured on Saturday when a protest against the murder of a six-year-old girl turned violent in Khuiratta, in the southern Kotli district of Azad Jammu and Kashmir.\n\nThe clash erupted after protesters, staging a two-day sit-in at a busy roundabout on the call of Tehreek-i-Labbaik leader and former assembly candidate Arslan Ghazi, blocked all entry and exit routes of the border town early in the morning.\n\nThe demonstrators, including women—some carrying infants—held placards and banners and chanted slogans against the police and administration, accusing them of “failing to dispense justice to the victim’s family”.\n\nWhen the administration attempted to reopen the roads, police took one activist, Kamran, into custody and summoned Mr Ghazi for talks. Protesters assumed he too had been detained and, in anger, pelted stones at the police station, to get him released.\n\nPolice responded with firing in the air, tear gas, and baton charges.\n\nPolice said the clash left SHO Raja Sadaqat Hussain, head constable Shahzad Ahmed, constables Rafaqat Hussain and Shah Nawaz Hussain, lady constable Saaila Kanwal, and an 18-year-old demonstrator, Arman Adnan, injured.\n\nThe agitation stemmed from public dissatisfaction with multiple inquiries into the brutal killing of Tasmiya Sohail, the six-year-old girl who went missing on July 29 and whose “chemically mutilated” body was recovered three days later from a field near her home.\n\nThe victim’s family belongs to the Rajput tribe.\n\nPolice initially suspected Mumtaz Shah, a resident of Faisalabad employed by former police constable Chaudhry Faisal Mushtaq to look after livestock, as the culprit since he had left for his hometown in the early hours of July 30.\n\nHe was arrested the following day with the help of his employer, who belongs to the Jat tribe and had also served as a gunman for AJK Health Minister and Khuiratta MLA Nisar Ansar Abdali.\n\nAccording to police sources, Shah confessed during interrogation to raping and killing the child “under the influence of Satan” and led them to the recovery of her clothes, shoes, and the chemicals used on her body.\n\nHowever, reportedly, the initial medical examination did not confirm rape because the body had been reduced to a bony structure. A conclusive opinion was still awaited from forensic experts.\n\nIn a video statement recorded in custody, Shah alleged that his employer and the employer’s nephew had instigated him to commit the crime.\n\nOn the family’s demand, an inquiry was conducted under SSP Kotli Adeel Ahmed Langrial, which held Shah responsible for the murder. But relatives and locals rejected the findings, alleging that crucial facts had been suppressed.\n\nA second team, led by SP Nadeem Arif with two DSPs among its members, also blamed Shah. Again, the family dismissed the outcome, demanding the inclusion of intelligence agency representatives.\n\nThe government then constituted a Joint Investigation Team (JIT) under SP Khurram Iqbal with agency participation, but the family objected, insisting it should be led by a DIG.\n\nThe parents even held press conferences in Islamabad and Muzaffarabad to press their demand.\n\nTrue to its tradition of acting only after situations escalate, the government appointed DIG Yasin Qureshi as head of a new five-member JIT — also including representatives of ISI and IB — on Friday afternoon, when the protest sit-in had already entered its second day.”\n\nThe committee was authorised to co-opt any B-17 officer from the Punjab Forensic Science Laboratory and the Federal Investigation Agency for assistance and directed to submit its report within 10 days.\n\nHowever, because the notification did not include a representative of Military Intelligence, protesters continued their sit-in on Saturday, which paralysed life in the town.\n\nAlthough police had reinforced their ranks in anticipation of unrest, residents said that by evening the situation was gradually returning to normal. Still, the sit-in continued, keeping the road to Kotli city blocked.\n\nPublished in Dawn, September 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:24:49.227Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945032/sho-among-six-injured-as-protest-against-childs-murder-turns-violent-in-ajks-kotli-district",
  "dateList": "2025-09-28",
  "date_published": "2025-09-27T23:20:46.000Z"
}
