{
  "title": "FIA arrests its two staffers at Islamabad airport for alleged role in illegal immigration deals - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Federal Investigation Agency (FIA) on Sunday said it had foiled an attempt to send citizens abroad for hefty bribes and arrested two of its own personnel posted at Islamabad International Airport.\n\nAccording to an FIA statement, the action was taken on the instructions of the director of the agency’s Islamabad Zone during a surprise inspection of the immigration staff under the supervision of Deputy Director (Immigration) Salman Liaquat.\n\nThe statement read that an assistant sub-inspector and a constable were taken into custody while on duty “after they were found using mobile phones”, which the immigration staff are prohibited from carrying during duty.\n\nTheir phones were searched on suspicion, and “important evidence related to illegal immigration” was recovered.\n\nThe FIA reported that according to initial investigation, the two men were in “contact with passengers and agents” and “charging Rs50,000 per person to send citizens to the Philippines and Uzbekistan”.\n\nRecords of transactions amounting to “millions of rupees were recovered from the suspects’ mobile phones”, and the pair was “using microfinance accounts to receive payments”, the statement read.\n\nA case has been registered with the FIA Anti-Corruption Circle in Islamabad, and a three-day physical remand of the suspects has been obtained, it added.\n\nLast month, the FIA took notice over videotaping of passengers, mostly female migrants, on Pak-Afghan border crossing Torkham.\n\nA video went viral on the social media, prompting the agency to take notice of the FIA official recording passengers and being negligent during duty at the border.\n\nA statement read that the DG FIA had sought a detailed report of the incident from the Director FIA Peshawar Zone and the official had been suspended immediately.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/2310192968f4b51.png",
  "retrievedAt": "2025-10-12T00:16:27.562Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1945197/fia-arrests-its-two-staffers-at-islamabad-airport-for-alleged-role-in-illegal-immigration-deals",
  "dateList": "2025-09-28",
  "date_published": "2025-09-28T13:00:47.000Z"
}
