{
  "title": "Deputy PM Dar urges collective efforts for national development",
  "author": null,
  "content": "ISLAMABAD, Mar 4 (APP):Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Tuesday emphasized the importance of collaboration from all institutions and individuals in the country’s development, stating that the government was committed to advancing the country’s economy through focused efforts.\nHe highlighted that Pakistan had great resilience and was blessed with huge reserves of mines & mineral, granite, hydrocarbon, stones and other resources worth at least US$ 10 trillion.\nAddressing the groundbreaking ceremony of the office building foundation, Competition Commission of Pakistan (CCP), he recalled that in 2013, Pakistan was declared globally macroeconomic unstable country and it was projected to default between six to seven months.\nThe world institutions were projecting that at least 12-15 years were needed to get out of quagmire. However, he said it took only three years to stabilize the country’s economy as Pakistan completed its first International Monetary Fund (IMF) programme 2013-16, all macro economic indicators were showing positive trend, foreign reserves made new high record, overall inflation eased to 3.9%, and stock market also went high.\n“It is matter of streamlining the things, the prime minister is working day and night, trying to explore all these areas,” he said adding that it is not too far away when Pakistan will get the right place in the comity of nation.\n“The only thing lacking is strong economic power,” the deputy prime minister added.\nHe recalled that in 2017-18, Pakistan was already the 24th global economy and maximum in 2030, it was going to become part of G-20.\nHe said the PDM government was doing nothing but saving the country from default.\n“Those who are not well-wishers want to see Pakistan default and struggle economically because they cannot digest our nuclear power and missile technology,” DPM Ishaq Dar added.\nThe deputy prime minister pointed out that today (March 04) was the completion of first year of Prime Minister Shehbaz Sharif’s government.\n“In one year’s of the incumbent government, we held a multilateral big event of Shanghai Cooperation Organization (SCO) Heads of Governments in Pakistan that took place followed by another big multilateral event regarding the international girls education in which four dozen countries participated.\nThe deputy PM emphasized that the Competition Commission of Pakistan was established to curb cartels in the country.\n“We do not have very strong consumer protection societies like the West has,” he said adding that the role and responsibilities of Competition Commission of Pakistan (CCP) are even double- as a formal government regulator as well as to replace the consumer protection societies which are lacking and not present in Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:20:05.809Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/deputy-pm-dar-urges-collective-efforts-for-national-development-2/",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T09:24:00.000Z"
}
