{
  "title": "Chairperson BISP, MD PBM discuss mutual cooperation for welfare projects",
  "author": null,
  "content": "ISLAMABAD, Mar 04 (APP):Chairperson Benazir Income Support Programme (BISP) Senator Rubina Khalid in a meeting with the Managing Director Pakistan Bait-ul-Mal (PBM) Senator Captain (R) Shaheen Khalid Butt on Tuesday discussed avenues of mutual cooperation in welfare initiatives for the socio-economic uplift of disadvantaged communities.\nDuring the meeting held at the PBM office, Senator Rubina Khalid congratulated Shaheen Khalid Butt on assuming the charge of MD Bait-ul-Mal and expressed her hope for strengthening collaboration between the two organizations.\nThe meeting focused on data sharing of deserving individuals through the National Socio-Economic Registry (NSER), skill development programs under the Benazir Hunarmand Program, and future welfare projects.\nSenator Rubina Khalid said that BISP is set to launch the Benazir Hunarmand Program to provide certified skill training to eligible individuals, enabling them to secure international employment opportunities.\n“In light of the rising demand for skilled labor in the global market, providing certified training will help deserving individuals achieve economic independence and break the cycle of poverty,” she remarked.\nThe Chairperson emphasized that data sharing between BISP and PBM would help identify and target deserving individuals more effectively, ensuring the transparency and success of joint welfare projects.\nMD Bait-ul-Mal Shaheen Khalid Butt assured his full support and cooperation, reiterating PBM’s commitment to work alongside BISP for the betterment of underprivileged segments of society.\nBoth leaders agreed to further strengthen coordination between the two institutions for the uplift of marginalized communities across the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:21:02.265Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/chairperson-bisp-md-pbm-discuss-mutual-cooperation-for-welfare-projects/",
  "dateList": "2025-03-04",
  "date_published": "2025-03-04T11:57:00.000Z"
}
