{
  "title": "NHMP launches CE category driving license for public, paving way for employment opportunities abroad",
  "link": "https://www.app.com.pk/national/nhmp-launches-ce-category-driving-license-for-public-paving-way-for-employment-opportunities-abroad/",
  "date_published": "2023-10-14T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP): The National Highway Motorway Police (NHMP) has issued a (CE) category driving license for the general public, enabling drivers to operate trailers.\nThis is a significant development, as it will open up new employment opportunities for Pakistanis in the Middle East, Canada, and Europe, where there is a high demand for CE category drivers, a public relations officer said on Saturday.\nThe launch of the CE category license was inaugurated by Federal Minister for Communications and Information Technology Shahid Ashraf Tarar, who emphasized the importance of providing maximum employment opportunities to the youth in the shortest possible time. He also highlighted the potential of this license to increase foreign exchange reserves in Pakistan.\nIG Motorway Police Sultan Ali Khawaja expressed his gratitude to the Federal Minister for his support and assured that the Motorway Police is committed to issuing 3,000 to 5,000 CE category driving licenses by next year.\nHe also emphasized the importance of a transparent and strict examination process to ensure that only qualified drivers are issued with this license.\nThe launch of the CE category driving license is a commendable step by the Motorway Police, and it is hoped that it will help to reduce traffic accidents and make the roads safer.\nIt is also a positive development for the Pakistani economy, as it will open up new employment opportunities for Pakistanis abroad and contribute to increased foreign exchange reserves.\nThe CE category driving license is currently being issued from the HTV Test Center Sangjani, Islamabad.\nThe fee for the license is Rs 5,000, and to be eligible for the CE category driving license, applicants must have a valid LTV driving license for at least one year.\nThe aspiring applicants must also pass a theoretical and practical test conducted by the Motorway Police.\nThe launch of the CE category driving license is a welcome step that will benefit both Pakistani drivers and the economy as a whole.",
  "retrievedAt": "2025-08-11T10:04:48.622Z"
}
