{
  "title": "SAPM urges Saudi Arabia for intake of over 1 mln Pakistanis annually for Saudi Vision 2030",
  "link": "https://www.app.com.pk/national/sapm-urges-saudi-arabia-for-intake-of-over-1-mln-pakistanis-annually-for-saudi-vision-2030/",
  "date_published": "2023-10-14T09:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 14 (APP):The Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (OP&HRD) Jawad Sohrab Malik held a meeting with His Excellency, Nawaf bin Said Al-Malki, the Ambassador of the Kingdom of Saudi Arabia (KSA) here to partake in the emerging manpower opportunities for the Saudi Vision 2030.\nMalik requested the KSA to employ a significant number of workforce from Pakistan for the completion of the Saudi Vision 2030, said a press release here Saturday.\n“Currently, about 5 million Pakistanis proceed to Saudi Arabia annually. There is a real prospect of this figure rising to over 1 million,” he continued. According to him, this mix of skilled, semi-skilled, and unskilled manpower from Pakistan has enabled Saudi Arabia to meet its diverse workforce needs effectively.\nSAPM underlined Pakistan’s capacity to provide over 1 million persons having varied skills to be employed under the job opportunities created by Saudi Vision 2030, according to which the Saudi economy is diversifying and embracing further areas. He apprised the Saudis of how our government is building a skilled Labour Force Pool in order to tap the huge potential of our bulging youth in areas of digitization, services, and tourism.\nThe Saudi Ambassador expressed support for the proposal forwarded by Jawad Sohrab Malik on enhancing the share of Pakistan’s manpower resources.\nAppreciating the dynamic and visionary leadership of the Kingdom, Jawad Sohrab Malik expressed his gratitude to His Royal Highness, the Crown Prince, Muhammad Bin Salman for extending his consistent and resolute support for Pakistan on various economic, strategic and bilateral issues.\nBoth sides agreed to launch further deliberations on the prospects of new employment opportunities for Pakistanis in KSA through a forthcoming meeting of SAPM on OP&HRD, Jawad Sohrab Malik, scheduled to be held in Saudi Arabia with the Labour Minister and other high-ranking officials of the Kingdom.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:05:15.112Z"
}
