{
  "title": "August 5 another mourning, black day for IIOJK people: APHC",
  "link": "https://www.app.com.pk/national/august-5-another-mourning-black-day-for-iiojk-people-aphc/",
  "date_published": "2024-07-28T09:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 28 (APP):The All Parties Hurriyat Conference (APHC) has said that August 5 is another exploitation, mourning and a black day for the people of Indian illegally occupied Jammu and Kashmir which has now turned into a big open-air prison.\nThe Modi regime, in gross violation of the United Nations resolutions and international law, repealed the special status of Indian illegally occupied Jammu and Kashmir and imposed an unprecedented military siege in the territory on August 5, 2019.\nAPHC spokesman Advocate Abdul Rashid Minhas in a statement in Srinagar said the BJP/RSS Indian government has usurped the political, social and religious rights of the Kashmiris and the 5th August 2019 action was a direct attack on Kashmir’s unique identity, culture, employment, demography, and basic fundamental rights.\nHe said the 5th August is one of the most tragic, painful, and catastrophic days in the modern history of occupied Jammu and Kashmir. He appealed to the oppressed Kashmiri people to observe a complete strike and mark August 05 as Youm-e-Istehsal-e-Kashmir and Black Day.\nOn the completion of five years of Indian siege in occupied Jammu and Kashmir, he said that it was the day when Hindutva forces in flagrant violation of the international law and United Nations resolutions scrapped the special status of IIOJK and deprived its people of all political, social, cultural, economic and religious rights.\nTerming the 5th August as ‘Day of Mourning’ for Kashmiris, he said that the tragedy of scrapping special status was the worst dacoity, biggest robbery and attack on the identity, culture and basic rights of the Kashmiris.\nHe appealed to the people to observe strikes in all regions of IIOJK.\nHe further said that 5th August was the day when the New Delhi-controlled Hindutva regime, with its all military might, resources and institutions, attacked Kashmir and usurped the basic rights of the Kashmiri people.\nAbdul Rashid Minhas also urged Kashmiris living on both sides of the Line of Control and the world over to organize protests and rallies and arrange other programmes to draw the attention of the world community towards unabated Hindutva terrorism in Kashmir.\nTerming Kashmir a gigantic prison and the world’s largest torture cell, he said every inch of Kashmir is dotted with trigger-happy troops and Kashmir has been reeling under constant siege for the past four years.\nHe said since 5th August 2019 occupation forces have butchered hundreds of Kashmiris and thousands have been arrested and are languishing in IIOJK and Indian jails under different concocted cases.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:10:50.542Z"
}
