{
  "title": "Embassy holds early voting for Uzbek Presidential elections in Lahore, Karachi",
  "link": "https://www.app.com.pk/national/embassy-holds-early-voting-for-uzbek-presidential-elections-in-lahore-karachi/",
  "date_published": "2023-07-05T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP): The Embassy of Uzbekistan in Pakistan on Wednesday organized early voting for the Presidential elections of Uzbekistan in Lahore and Karachi.\nUzbek citizens residing in these cities and surrounding areas participated in the voting process, which was conducted in adherence to the Electoral Code, said a news release.\nIn the polling stations, voters have gotten acquainted with the candidates and their pre-election programs.\nThe updated Constitution of the Republic of Uzbekistan has been distributed among citizens, the new version of which was approved at a national referendum on April 30, 2023.\nThe citizens of Uzbekistan noted the importance of large-scale reforms carried out in the country in all spheres of life, their socially-oriented nature, highly appreciating the priority of protecting the interests of the citizens in the structure of relations between society and state.\n“Today we participated in an important political event and voted for the future of our Uzbekistan. We are confident that the President-elect will serve for the further development of our Motherland”, said young compatriots Kamila and Alina Saed.\n“Despite the fact that we are abroad, our country ensures the observance of our constitutional rights. We feel our involvement in the reform processes in Uzbekistan and the significance of our choice. This pleases us. Such relations with citizens living abroad increase their sense of personal responsibility for the future of the Motherland”, – said Mrs. Jamila Arifbaeva.\nThe citizens also expressed hope that the results of the Presidential Elections will form a solid foundation for the intensive implementation of the goals for the construction of a New Uzbekistan.\nElections are the event for the common political decision of the people, the beginning of a new stage in the development of statehood. Therefore, it is necessary to take the elections seriously.\nCitizens of Uzbekistan in Pakistan carefully monitor the election campaign of all candidates and their proposals for the further development of our country.\n“The election platform of all candidates is aimed at ensuring the uninterrupted continuation of the reforms carried out in the country. They differ only in the mechanisms for achieving a common goal. Based on this, today we made our choice – we voted for the candidate whose proposals are close to our ideas about the future. We are confident that the election results will serve to continue the processes of renewal and development of Uzbekistan,”, – Albina Kurtbedinova said.\nCitizens of Uzbekistan can also take part in the Presidential Elections and vote on July 9 (Sunday) at the Embassy of Uzbekistan in Islamabad.",
  "retrievedAt": "2025-08-11T08:50:50.562Z"
}
