{
  "title": "PM pays tributes to Captain Karnal Sher Khan Shaheed",
  "link": "https://www.app.com.pk/national/pm-pays-tributes-to-captain-karnal-sher-khan-shaheed/",
  "date_published": "2023-07-05T07:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP):Prime Minister Shehbaz Sharif on Wednesday paid tributes to Captain Karnal Sher Khan Shaheed Nishan-i-Haider on his 24th martyrdom day.\nHe said the nation salutes to all the martyrs including Captain Karnal Sher Khan Shaheed.\nThe prime minister said Karnal Sher Khan Shaheed was such a brave son of Pakistan whose courage, valour and bravery were confessed by the enemy itself.\nCaptain Karnal Sher Khan turned into a lion like his name and pounced on the enemy chasing it away from the borders of the motherland, he said in a statement issued by the PM office.\nPM Shehbaz said Captain Sher Khan paid his duty of safeguarding the country at 17000 feet height and sacrificed his life for the sake of the country.\nThe nation is indebted to its martyrs and it will continue to pray for the elevation of ranks of their souls, he said.\nCaptain Karnal Sher Khan along with his soldiers defended the border of Pakistan despite being outnumbered by the enemy, the prime minister added.\nHe deplored that on May 9, black history was written by desecrating the memorials and statues of Captain Karnal Sher Khan and other martyrs.\nHe asked the young generation to get full awareness of the martyrs’ great sacrifices, bravery and undying love for the motherland.\nThe prime minister said the 9th May incidents conveyed the message, particularly to the enemy that we did not respect our martyrs.\n“The whole nation will protect the sanctity and honour of the martyr who sacrifices his life while defending the country, and will punish the criminals.”\nThe prime minister said Captain Karnal Sher Khan was the first Nishan-i-Haider who belonged to Khyber Pakhtunkhwa province.\nHe also prayed for the martyred and grant of courage to the bereaved family to bear the loss.",
  "retrievedAt": "2025-08-11T08:50:47.126Z"
}
