{
  "title": "PTI’s own people exposed  Panama conspiracy, only Nawaz Sharif can resolve country’s problems: Marriyum",
  "link": "https://www.app.com.pk/national/ptis-own-people-exposed-panama-conspiracy-only-nawaz-sharif-can-resolve-countrys-problems-marriyum/",
  "date_published": "2023-07-05T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 05 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday said that Pakistan Tehreek-e-Insaaf’s own people had exposed the Panama conspiracy.\nAddressing a press conference here, she said that characters behind that conspiracy pushed the country towards multiple crises by imposing an incompetent and inefficient person at the helm of affairs.\nThe minister said that the solution of Pakistan’s probelms lied  only with Nawaz Sharif who served thrice as Prime Minister.\n“During the Nawaz Sharif era, the economy was stabilized, he gave the people a gift of China Pakistan Economic Corridor”, she said adding that  great injustice was done to the person who had done great service to the country as prime minister.\nTaking a jibe at Imran,  she said the shadowy figures and characters who were burning the country today, stood on the container to stop the CPEC project in 2013-14.\nMarriyum Aurangzeb said on that Pakistan Muslim League-Nawaz Quaid  Nawaz Sharif was disqualified under a conspiracy when “Panama verdict was changed to Iqama.”\nDuring the press conference, she played a video clip of senior Pakistan Tehreek-e-Insaf leader and legal wizard Hamid Khan who told a private TV channel that it appeared that  the decision to disqualify Nawaz Sharif in Iqama case was done somewhere else.\nShe said similar statements had also been given by former interior minister and senior PTI leader Syed\nIjaz Shah who were not related to PML-N in any way.\nShe said that Nawaz Sharif was deposed as Prime Minister through a conspiracy but the country and the masses suffered the most.\nThe minister said that for the last one year, the coalition government led by Prime Minister Shehbaz Sharif had been trying to revive the country’s economy destroyed during 4 years misrule of the PTI.\nThe present regime was also striving to overcome unemployment, load shedding and terrorism which hit the country during Imran Khan’s tenure, she added.\nDuring the last four years, incompetent and inefficient rulers of the past pushed the country towards total destruction.\nMinister for Information and Broadcasting said that story of Pakistan’s destruction had started in 2013 during PTI’s sit in.\nWhen the PML-N came to power in 2013, Pakistan faced inflation, terrorism, unemployment in the country and it was on the verge of default.\nIn 2013 elections, the voters understood that only Nawaz Sharif could resolve the country’s problems and they voted him into power.\nShe said despite launch of Imran’s agitation,  Nawaz Sharif laid the foundation of political stability within the\ncountry and gave a chance to the parties having a majority in the provinces to form governments at provincial level.\nThe minister said that CPEC was a gift to the region from the leadership of Pakistan and China and it was\nthe vision of PML-N Quaid Muhammad Nawaz Sharif and President Xi Jinping of China.\nCPEC project played a role in development of Pakistan in every sector from 2013 to 2018, she said.\nAs soon as the CPEC project started, she said elements conspiring against Pakistan’s development were mobilized.\nWhen the news of President Xi Jinping’s visit to Pakistan came, a man stood on the container against the development of the country and the visit had to be postponed.\nShe said the same person on the container called for the civil disobedience movement.\nUnder the CPEC project, energy projects were to be started, employment opportunities were to be created but this person tried to create hurdles in the way of country’s progress.\nReferring to Imran’s criticism of recent IMF deal, she said the present government did not sign this programme, adding it was the PTI regime which signed, then violated and finally suspended it for political gains last year.\nShe said it was Prime Minister Nawaz Sharif who stabilized the country’s economy after coming to power in 2013, completed the IMF program.\nIn 2017, the country was on the path of development and only IMF program in the country’s history was successfully completed.\nNawaz Sharif wanted to make the youth of the country economic independence, he wanted to promote IT, agriculture sectors, and increase exports.\nShe said instead of raising hollow slogans, Nawaz Sharif had promised to stabilize the country’s economy and\nfulfilled his promises.\nFrom 2013 to 2017, 14,000 megawatts of electricity was generated in the country and load shedding eliminated.\nShe said that scourge of terrorism was rooted out from the country after launch of the largest anti-terrorist operation in the country’s history.\nOn the other hand, she said there was a person standing on the container to stop development projects of the country.\nThe minister said  there was a conspiracy against Nawaz Sharif because he was giving employment and business to the people, removing darkness from the country.\nShe said it was strange that the person who plunged the country into multiple crises was raising questions of IMF deal and inflation.\nMarriyum said Imran had ruined national economy, foreign policy  and caused unemployment due to bad policies.\nThose who disqualified Nawaz Sharif were totally exposed in front of the masses,  she added.\nShe said Nawaz Sharif despite knowing that all allegations of corruption against him were bogus, appeared in courts and proved that he was not involved in any wrongdoings or fraud.\nWhen Nawaz Sharif was arrested,  she said neither any property nor memorials of martyrs were\nburnt.\nShe said that Nawaz Sharif appeared more than 150 times in accountability courts along with his daughter to prove his innocence.\nShe said that revival of IMF programme was also a question of Pakistan’s credibility and Prime Minister Shehbaz Sharif,\nFinance Minister Ishaq Dar and Foreign Minister Bilawal Bhutto Zardari worked hard for this purpose.\nThe minister said that those who put the country on fire on May 9,  and who appeared in court wearing containers were greeted in the court with words like ” good to see you, good luck”.\nShe said there was great contrast between the performance of the PTI regime led by Imran Khan and the PML-N government led by Nawaz Sharif as PM and Shehbaz Sharif as chief minister Punjab.\nShe said that inefficient,  incompetent, foreign- funded people  put the country on fire, ruined the economy, and allowed terrorists to re-emerge.\nOn the contrary,  Nawaz Sharif stabilized the economy, GDP growth rate touched 6.1 pc mark, ended load shedding by generating 14000 mega watt electricity, launched flag ship project China Pakistan\nEconomic Corridor, and rooted out terrorism.\nShe said the PML-N in the past had revived the economy and once again the coalition government was taking steps for revival of the economy,  end to unemployment and inflation.\nThe minister said that on July 5, a dictator derailed  democracy in Pakistan by toppling the government of Prime Minister Shaheed Zulfikar Ali Bhutto.\nShe said July 5 was also martyrdom anniversary of  Captain Kernal Sher Khan Shaheed.\nShe said July 5 was also the day of completion of ten years of the launch of China Pakistan Economic Corridor, a game changer project envisioned by Prime Minister Nawaz Sharif and Chinese President Xi.\nDue to the incompetence of the previous government many crises including energy shortage had arisen in the country, she maintained.\nWhile replying to media persons questions she said the government did not believe in political victimization of its political opponents and Imran Khan was facing cases for his crimes.\nIf the government wanted to arrest Imran, it could have done so 14 months back, she pointed out.\nThe minister said that no one befool the people for a long time and the international media had realised that his narrative was a pack of lies.",
  "retrievedAt": "2025-08-11T08:50:43.613Z"
}
