{
  "title": "PTA develops user friendly Complaint Management System to check uploading of unlawful online content",
  "link": "https://www.app.com.pk/national/pta-develops-user-friendly-complaint-management-system-to-check-uploading-of-unlawful-online-content/",
  "date_published": "2023-07-05T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 5 (APP):In order to address formidable challenges in this era of social and digital media regarding the uploading of unlawful online content, the Pakistan Telecommunication Authority (PTA) has developed a user friendly Complaint Management System (CMS), accessible at its website as well as through mobile app.\nThe CMS is available through the web link: http://complaint.pta.gov.pk/RegisterComplaint.aspx and can be downloaded at Play Store and Appstore.\nAccording to an article written by a senior official of PTA, Muhammad Farooq, “Raising public awareness about the complaint registering mechanism provided by social media platforms, as well as the mechanism provided by PTA, will facilitate the lodging of complaints concerning unlawful online content”.\nThe article titled “The Role of Timely Reporting Unlawful Online Content” elaborates that any aggrieved person can lodge the complaint to PTA by selecting a relevant category such as Anti-State, Sectarian, etc while incomplete or wrong information may cause rejection of the complaint or delay in processing complaint.\nFor public guidance, a video “How to Report Unlawful Online Content” has been uploaded on PTA’s official Youtube channel (@ptaofficialpk).\nSocial media strive to ensure a safe platform for users through self-regulation, which involves the issuance of community guidelines and standards. It is essential for the public to familiarize themselves with these community standards/guidelines of these platforms.\nThese guidelines provide a framework of rules aimed at creating a safe environment for users to interact and share information. They also include advice on illegal and prohibited actions that may result in the permanent suspension of user accounts.\nTimely reporting of unlawful content that goes against the community guidelines/standards is crucial for its early removal and the permanent banning of repeat offenders. Social Media (SM) platforms actively encourage users to approach them directly to seek missing or additional information needed for the timely resolution f issues.\nPTA has provided a list of URLs for major SM platforms where complaints can be lodged that is accessible at (http://www.pta.gov.pk/assets/media/sm_platforms_09032020.pdf).\nAdditionally, WhatsApp, known for its end-to-end encryption, encourages its users to report unlawful content within the app itself. Users can do so by long-pressing the unlawful message and selecting the `report’ option.\nAwareness of unlawful online content and its reporting to SM platforms/PTA will ensure safe, responsible and secure use of cyberspace, the article said.\nIn the past, broadcasters/telecasters held complete control over the content to be broadcasted or telecasted, ensuring the avoidance of inappropriate or unlawful programs.\nHowever, with the emergence of the internet, this control has shifted to internet users, who can now easily upload and share their content online with just a few clicks. Consequently, the uploaded content becomes instantly accessible to millions of users worldwide.\nThe advent of this new era has presented formidable challenges, particularly in relation to the uploading and sharing of violent, harmful, and indecent content. Such content has the potential to significantly impact society at large without undergoing essential scrutiny by the concerned regulators.\nTimely identification and removal of unlawful content is crucial in minimizing its impact. While social media companies employ Artificial Intelligence (AI) algorithms, these AI systems are still in the learning phase and require time to reach maturity.\nConsequently, companies are currently dependent on a complaint-based mechanism, where the public reports unlawful content, and content moderators at the company’s end analyze the reported content.",
  "retrievedAt": "2025-08-11T08:50:40.167Z"
}
