{
  "title": "Govt taking all measures to equip doctors, medical staff fighting Coronavirus with protective gears: PM",
  "link": "https://www.app.com.pk/national/govt-taking-all-measures-to-equip-doctors-medical-staff-fighting-coronavirus-with-protective-gears-pm/",
  "date_published": "2020-04-06T11:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP):Prime Minister Imran Khan on Monday said that the government was taking all possible measures to equip the doctors and medical staff – frontline force against the Corona pandemic – with the required protective gears on priority basis.\nHe was presiding over a meeting held here to review the situation of Coronavirus in the country.\nThe meeting was attended by Federal Ministers Asad Umar, Makhdoom Khusro Bakhtiar, Muhammad Hammad Azhar, Advisor on Finance Dr. Abdul Hafeez Sheikh, Special Assistants to PM Dr Firdous Ashiq Awan, Dr. Zafar Mirza, Dr. Moeed Yusuf, Chairman National Disaster Management Authority (NDMA) Lt. Gen. Muhammad Afzal and senior officers.\nChairman NDMA Lt. Gen. Muhammad Afzal and Special Assistant on Health Dr. Zafar Mirza briefed the prime minister in detail about the latest situation of Coronavirus and the measures being taken to take care of the people affected by Coronavirus.\nThe prime minister was told that at present 3300 ventilators were available in 136 hospitals across the country, and the NDMA was in direct contact with the hospitals’ administration to ensure the provision of protection kits to doctors and other medical workers.\nThe Chairman NDMA told the participants that with 49,500 protection kits already provided to various hospitals in all the provinces, the provision of more protection kits to hospitals would be completed in a day or two.\nThe prime minister was told that NDMA had no shortage of protection kits and face masks and their target was to ensure the availability of ventilators in required numbers for which measures were being taken on emergency basis.\nThe participants were apprised that special attention was being given to enhance the capacity of Coronavirus testing on daily basis and in that respect steps were being taken on priority.\nBesides, measures were also being taken to ensure the availability of technical staff and their training, it was further informed.\nMinister for Planning Asad Umar briefed the meeting about the progress of development projects and the continuity of economic activities.\nThe prime minister while talking about the continuity of economic activities in the wake of situation arising out of the Coronavirus outbreak with particular focus on providing relief to the poor after the comprehensive incentives package announced by him for the construction industry, directed that the fruits of this sector’s revival should reach the poor and downtrodden especially the laborers.\nHe said the funds allocated for Public Sector Development Program (PSDP) should be spent on projects related to Small and Medium Industries (SMEs).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:03:26.159Z"
}
