{
  "title": "FM calls for region-wide pooling of research efforts to combat Covid-19",
  "link": "https://www.app.com.pk/national/fm-calls-for-region-wide-pooling-of-research-efforts-to-combat-covid-19/",
  "date_published": "2020-04-06T03:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP):Foreign Minister Shah Mehmood Qureshi on Monday called for pooling of region-wide research capabilities to combat Coronavirus for effective coordination in relief and containment efforts.\nIn a telephonic conversation with Secretary General of Shanghai Cooperation Organization (SCO) Vladimir Norov, Foreign Minister Qureshi said in order to strengthen regional cooperation in South Asia in the wake of the pandemic, Pakistan had proposed a video conference of SAARC Health Ministers to learn from each other’s experiences.\nThe Foreign Minister briefed the Secretary General on the measures being taken by Pakistan to contain Covid-19 pandemic.\nHe said Pakistan attached high importance to SCO as its member states comprised more than 40 percent of the world population and accounted for a quarter of global GDP.\nAt a time when the entire world was facing this challenge, coordinated\nefforts through SCO platform were essential to adopt an effective strategy\nto control the pandemic, he added.\nQureshi said China was providing valuable support to Pakistan in dealing with the pandemic.\nUnderlining that China had led the way in effective containment, and a lot could be gained from the Chinese experience, the Foreign Minister\nappreciated SCO Secretariat’s role in disseminating timely information\non China’s effective response to the pandemic.\nThe Foreign Minister also lauded the Russian initiative to hold a video\nconference of the Experts of Health Ministries of SCO member states on\nApril 1, 2020.\nAlluding to the adverse socio-economic ramifications of the crisis, Foreign\nMinister Qureshi highlighted Prime Minister Imran Khan’s call for debt relief\nand restructuring for developing countries and said that he had discussed\nthis issue with other leaders including the Secretary General of UN, the\nSecretary General of OIC and his counterparts from European countries.\nHe expressed the hope that SCO would play an effective role in taking\nthe proposal forward through its own platform.\nThe SCO Secretary General thanked the Foreign Minister for the call.\nHe expressed appreciation for the Prime Minister’s proposal for debt relief\nand restructuring for developing countries and said that financial support\nfor developing countries was the need of the hour.\nThe Secretary General conveyed his best wishes to the Government and\npeople of Pakistan in successfully facing the challenge posed by the pandemic\nand reiterated his resolve to utilize all possible means to ensure effective use\nof SCO in coordinating efforts of Member States to combat the pandemic.\nThe Foreign Minister invited the SCO Secretary General to visit Pakistan\nas soon as the situation permitted, which he accepted.",
  "retrievedAt": "2025-08-11T19:03:31.377Z"
}
