{
  "title": "Ministers’ meeting on COVID-19 situation held at NCOC",
  "link": "https://www.app.com.pk/national/ministers-meeting-on-covid-19-situation-held-at-ncoc/",
  "date_published": "2020-04-06T02:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 06 (APP):A detailed briefing was given to the federal ministers on current coronavirus (COVID-19) situation and measures being adopted to combat the disease at National Command and Operation Center (NCOC) on Monday.\nFederal Minister for Planning, development, Reforms and special initiatives Asad Umer chaired the session which was attended by Brig ® Ijaz Ahmed Shah, Minister for Interior, Muhammad Hammad Azhar, Minister for Economic Affairs, Omar Ayub Khan, Minister for Energy , Khusro Bakhtiar, Minister for National Food Security and Research, Abdul Razak Dawood PM Adviser for Commerce, Textile, Industry and Production and Investment, Dr Zafar Mirza, Special Assistant to PM on National Health Services, Moeed Yousaf, Special Assistant to PM on National Security.\nChief Secretaries of all provinces and Azad Jammu and Kashmir (AJK) participated through video conference. The meeting started with update on critical health care equipment needed for COVID-19.\nThe meeting was informed that so far 3,844 ventilators are available with Islamabad Capital Territory (ICT) 47, Balochistan 74, Khyber Pakhtunkhwa 400, Punjab 1,697, Sindh 1,550, AJK 63 and Gilgit Baltistan 13.\nThe meeting was informed that efforts are at hand to procure additional ventilators along with indigenous production.\nThe meeting was informed that the government has earmarked Rs 50 billion as Special Ramazan Package for common people.\nMD Utilities Stores briefed on available stock and measures to ensure uninterrupted supply during enforcement measures and particularly Ramazan.\nAsad Umer directed MD utilities stores to evolve a mechanism to stop bulk purchase and over buying by retailers to let the benefit reach to common people.\nHe also instructed ministry of energy to ensure accelerating supply of fuel to various parts of Balochistan particularly border areas, where fuel supply may have been affected by the border situation.\nThe meeting was informed about the a detailed plan of action by ministry of industries in consultation with provinces to keep essential industries like food, pharmaceuticals, energy and industries for enforcement measures till 14th April following laid down health guidelines and post April15.\nA uniformed policy will be presented by ministry of industries on Tuesday at NCOC for implementation across the country for containment of COVID-19\nIt was decided that a detailed road-map for flight operations post 11th April will be presented on 8th April at NCOC for final decision.\nThe forum reviewed present situation on new cases, efforts for containment and preparations for future.\nIt was informed that at the moment Pakistan has 163 tests per million capacity against India’s 50 per million. There are total 20 labs across the country included one ICT one, Punjab five, Sindh seven, KP one, Balochistan two, AJK one, GB two, with 6,584 testing capacity included ICT 1500, Punjab 2,064, Sindh 1,900, KP 284, Balochistan 380, AJK 180 and GB 276 while 13 labs are in pipelines.\nIt was emphasized that the testing capacity needed to be significantly ramped up. It was decided that a target for the testing capacity enhancement will be fixed by Tuesday.\nIt was decided to logistics arrangements to collect and transport samples, availability of testing kits, swabs and transport medium and availability of necessary medical equipment and testing kits for meeting these requirements besides improving track and tracing mechanism to identify clusters for targeted testing and isolation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:03:32.474Z"
}
