{
  "title": "Transfer of cash assistance to deserving families will begin this week: Sania Nishtar",
  "link": "https://www.app.com.pk/national/transfer-of-cash-assistance-to-deserving-families-will-begin-this-week-sania-nishtar/",
  "date_published": "2020-04-06T03:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP):Special Assistant to Prime Minister on Poverty Alleviation and Social Safety Dr. Sania Nishtar on Monday assured that the transfer of cash assistance of Rs 12,000 to deserving families under Ehsaas Emergency Cash Program will begin this week.\nFederal government is providing cash assistance to support the vulnerable segments of society which was affected due to lockdown in the wake of COVID-19, she said while talking in a Radio Current Affair program.\nSania said deserving people should send an SMS to 8171 and so far over 34 million messages have been received through this service.\nUnder this programme, a deserving family will get a one-time assistance of 12,000 rupees to cater daily needs for four months, he added .\nElaborating the eligibility criteria, she said there will three types of messages in response of people’s SMS like eligible, ineligible, or contact to the concerned district administration.\nShe said those, who will get a message asking to contact the district administration, are not required to go anywhere now as their particulars are being verified automatically.\nShe said those, who will get a message of eligibility, will be informed, in a follow up SMS, that from where and when they should collect their amount.\nShe said beneficiaries of this programme will be finalized through proper scrutinizing mechanisms like data analytic, wealth profiling, average monthly bills, and travel history.\nGovernment employees are not eligible for this scheme, she mentioned.\nReplying to a question, Dr. Sania Nishtar said there will be an option for appeal if a person gets a notification that he is not eligible for the assistance. She said a helpline for this purpose will be established soon.\nAnswering another query, she said more than one SMS can be sent from a same mobile number as data has the ability to further scrutinize profile of every individual person.",
  "retrievedAt": "2025-08-11T19:03:29.763Z"
}
