{
  "title": "Pakistan within three weeks to start manufacturing its own ventilators : Fawad Ch",
  "link": "https://www.app.com.pk/national/pakistan-within-three-weeks-to-start-manufacturing-its-own-ventilators-fawad-ch/",
  "date_published": "2020-04-05T21:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP):Federal Minister for Science and Technology Fawad Chaudhry Monday announced that Pakistan within three weeks would start manufacturing of its own Ventilators to increase testing capacity for Coronavirus.\nTalking to private news channel, Fawad hoped that today after getting the approval of Drugs Regulatory Authority of Pakistan (DRAP), Pakistan will start locally its own testing kits and ventilators manufacturing to save the lives of many critically ill coronavirus patients.\nHe said we will successfully made the ventilators in country, which is the much needed medical equipment for the hospitals amid the coronavirus epidemic.\nSteps have already been taken to manufacture the test kits and ventilators locally, he added.\nFawad Chaudhry added that earlier only test kits were made by China and other countries.\nHigh costs, manufacturing countries’ inability to fulfill export demands due to their own local demands, among other reasons, have made import of the equipment even more difficult even in America so after the manufacturing of local Ventilators we will get cheap rate testing facilities in our own country, he added.\nTo improve the testing capacity, NDMA, federal government and provisional governments are working in close collaboration to increase the existing number of coronavirus testing labs and its capacity.\nHe said the Coronavirus cases surged in U.S. and Europe as compared to South Asia countries where corona patients are less affected.\nFawad said Pakistan will also be the part of world research on Corona virus where we will soon to launch a research paper as well.\nHe said, the federal government took major steps for overcoming the shortage of ventilators and testing kits for screening and detection of coronavirus.\nThe indigenous ventilators will be far cheaper than those being imported from abroad, the minister added.\nHe said that Pakistan Engineering Council (PEC) was given this task to overcome shortage of ventilators in the prevailing health crisis due to increasing number of Coronavirus patients in the country.\nReplying a Query about increasing stressed among Public related to coronavirus, he urged people to strictly follow social distancing and self-quarantine as the country is facing major threats due to the coronavirus.\nHe suggested that people to promote the habit of reading books at home during the corona lock downs.\nHe urged the media to focus on educating people, as it is the collective responsibility of all citizens.\nThe government is also working on an economic package to support the people, industry and the country’s economy from the negative effects of the pandemic, he added.",
  "retrievedAt": "2025-08-11T19:03:35.128Z"
}
