{
  "title": "Those responsible for sugar, wheat crises must be punished: President",
  "link": "https://www.app.com.pk/national/those-responsible-for-sugar-wheat-crises-must-be-punished-president/",
  "date_published": "2020-04-06T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 6 (APP):President Dr Arif Alvi Monday said the government should punish those who had been found responsible for creating sugar and wheat crises in the country.\nThe president, in an interview with a private television channel, said Prime Minister Imran Khan deserved the credit for the initiative of ordering a probe into the crises and making the inquiry reports public.\nHe said the forensic analysis would help dig out the facts whether the subsidy on sugar was given genuinely or exaggerated; however, those who had minted money out of the crisis must be punished.\nTo a question, he said since the report was made public, Jahangir Tareen was not attending any government meetings.\nBeing a relevant institution, the Competition Commission of Pakistan should play its due role to discourage cartelization, he added.\nDiscussing the coronavirus, Dr Alvi said while being in quarantine at their homes, the people should take it as an opportunity to revive their bonding with their families and revert to Allah Almighty to seek His forgiveness and blessings.\nHe said all the countries could not perform the way China had acted to contain the Covid-19 pandemic by ensuring all supplies amid a complete lockdown.\nHe said during his visit to China, he had interacted with Pakistani students in Wuhan who had stated that the quarantine was very strict but despite that they had been receiving all their supplies at their doorstep.\nTo a question, he said though the research was underway on the effectiveness of chloroquine for treatment of Covid-19 patients, the country had a sufficient stock of the medicine available.\nHe said being a developing country, Pakistan would have to maintain a balance while imposing the lockdown in order to avoid unemployment and ensure supply of food to the poor people.\nThe president said Pakistan would emerge as a stronger nation out of thee situation because it would not only help the country build its capacity in the health sector but also develop the people’s habits of observing proper hygiene.\nHe said the Pakistan Engineering Council, doctors and engineers of Pakistan were preparing local ventilators and corona testing kits to help the country overcome the challenge.\nTo a question about the opposition labeling the Corona Relief Tiger Force as a body with political motives, the president said he had also asked the opposition leaders to engage their youth in the relief efforts.\nHe reiterated his call for the people to offer prayers at home to maintain social distancing to avoid spread of the coronavirus as had also been guided by the religious scholars from Egypt as well as Pakistan through their decrees.\nHe lauded the efforts made by the Center as well as the provincial governments to contain the virus in their capacities, what, he believed, would also help the provinces build their capacities after the 18th Amendment.\nTo a question, he said due to the lockdown the kids suffering from Thalaessemia suffered for decreased blood donations; however, he thanked the personnel of Islamabad Police for responding to his call and making the blood donations.",
  "retrievedAt": "2025-08-11T19:03:26.167Z"
}
