{
  "title": "Fawad for opposition’s ‘positive contribution’ towards Pakistan’s betterment",
  "link": "https://www.app.com.pk/national/fawad-for-oppositions-positive-contribution-towards-pakistans-betterment/",
  "date_published": "2021-06-22T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain Tuesday said the opposition parties had the right to criticize the government policies but they should also give their long due ‘positive contribution’ towards the betterment of Pakistan.\n“Opposition should come up with their suggestions, we (the government) are ready to consider them,” he said while participating in the federal budget debate in the National Assembly.\nHe said the public had given the mandate to their elected representatives to find solution of their problems at this august forum of the Parliament through effective legislation.\n“A message should go from the House that the elected representatives are discussing their problems and finding out solution to the confronted issues,” he said.\nFawad invited the opposition parties to make collective efforts for progress and developing of the country, asking them “Let us know, how can we unanimously move ahead. We are ready to move together, but for the God sake, you must shun the tendencies of negative politics. Please come to positive politics, and we together move forward the country – Pakistan.”\nThe minister was of the view that the country needed national unity on larger issues, highlighting the importance of electoral and judicial reforms and a vibrant foreign policy.\nHe said the Pakistan Tehreek-i-Insaf (PTI) government had submitted as many as 49 amendments in the Election Act aimed at ensuring transparent elections in the country and strengthening the Election Commission of Pakistan.\nHe said the opposition should give their suggestions on the electoral reforms bill, if they were not agreeing with the amendments suggested by the government.\n“It is of the foremost importance that there should be electoral reforms.”\nSimilarly, he said the country needed judicial reforms to remove flaws from the existing system, evolve a mechanism of judges’ appointment and constitution of Supreme Court benches.\nBesides, he said the situation in Afghanistan was worsening and it could have negative impact on Pakistan, so the political leadership should focus on the foreign policy related matters to evolve an effective strategy to tackle the confronted challenges.\nFawad regretted that so far the opposition held no serious debate on the federal budget, asking them to give their proposals for national development and welfare of the common man, if they were not agreeing with the budgetary proposals of the government.\nHe said it seemed that Leader of Opposition Shehbaz Sharif had no control over his party as he repeatedly talked about ‘joint efforts’ on floor of the House, but gave no response when asked to constitute a focal group for the dialogue.\n“Leader of the Opposition is Shehbaz Sharif, but it seems that the party decisions are taken by someone else,” he said asking the PML-N to first decide that who was the decision-making authority within the party; and then contact the government for the dialogue.\nThe minister said with increased economic pace; the opposition parties were getting weakened and fearing that they would lose the next general elections too.\nFawad Chaudhary said that the total volume of the federal budget was around over Rs 8000 billion. During the current year, the tax revenue collection remained around Rs 4,700-Rs 48,00 billions and we were expecting that the tax collection would be Rs 5700 billion during the next fiscal year.\nHe said there would be a budget deficit of around Rs 3,000 billion.\nMajor chuck around 57 per cent of total revenue collection would be given to the provinces, he added.\nHe went on to say that major expenditures were included– Rs 2000 billion for debt servicing, Rs 700 billion for pay and pension allowance and defence budget.\n“We could not enhance our defence budget for the last three years with the ratio as our neigbour country was increasing,” he said.\nMoreover, we have to pay Rs 2000 interest on loans taken by the past regimes, he added.\nTerming the period of 2008 to 2018 a decade of darkness for Pakistan, the minister said the total foreign debt of the country was only Rs 6,000 billion from 1947 to 2008 which had surged to Rs 26,000 billion during 2008-2018.\nThe minister said suddenly our foreign debt had started to increase to Rs 26,000 billion during 2008 to 2018 when Asif Zardari and Nawaz Sharif came into power.\nHe said luxurious projects like Sahiwal Coal Power Plant were set up. Earlier, we were not paying a single penny to the power plants but the past government started paying compulsory payments under the head of capacity charges to them.\nAfter 2018, now, we have to pay Rs 900 billion under capacity payment charges to them whether they generate power or not, he added.\nHe said in 2023 which would be an election year, we have to pay Rs 1500 billion under the capacity payment charges.\nFawad said today the situation was that we were paying Rs 2000 billion per year in debt servicing.\nDespite the fact the country’s transmission system could only transmit 24,000 MW electricity, the past government set up unnecessary power plants, he said.\nHe said the country has capacity to generate 30,000 MW but the transmission system has only capacity to transmit 24,000 MW. “Who is responsible for this,” the minister questioned.\nThe minister said under the 18th constitutional amendment, a big share of revenue went to the provinces.\nHe said Rs 1600-1700 billion went to the Sindh province over the last two years under the National Finance Commission (NFC) Award. He said another Rs 700-750 billion would go to the province during the next fiscal year.\nHe however regretted that the provincial government of Sindh has done nothing worthwhile for the provision of basic amenities to the people.\nKarachi, he said, was like a mini Pakistan and 5th largest city of the world but the provincial government could not develop police for this city so far despite being in power for the last 13 years. Billions of rupees were being taken on the name of Badin and Ghottki but no development was carried out, he added.“Where is this fund going,” the minister questioned.\nHe said this was the reason that the prime minister had stood up against corruption. Some families were purchasing properties in London, Dubai, Canada and USA with the looted and plundered money, he added.\nThe minister said the incumbent government under the leadership of Imran Khan has put the country on the right track.\nHe said the first case of COVID-19 was reported on February 26 and nothing including safety equipment and protective gears etc were being manufactured in the country.\nHe lauded the services of country’s scientists, engineers and youth that owing to their efforts, Pakistan not only started manufacturing all the COVID-19 related protective gears and ventilators but was also now a major exporter of these equipment in the region.",
  "retrievedAt": "2025-08-11T20:52:31.962Z"
}
