{
  "title": "PTI preparing to form next government in Sindh : Shahbaz Gill",
  "link": "https://www.app.com.pk/national/pti-preparing-to-form-next-government-in-sindh-shahbaz-gill/",
  "date_published": "2021-06-22T09:26:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 22 (APP):Special Assistant to Prime Minister on Political Communication, Dr Shahbaz Gill Tuesday said Pakistan Tehreek-e-Insaf was preparing to form its government in Sindh in next tenure.\nAddressing a news conference at Sindh Governor House, he said Sindh government had miserably failed to perform in each sector and its incompetency had compelled the federal government to carryout those development works which was provincial government’s responsibility.\nHe said Bilawal Bhutto Zardari had alleged that federal government was missing in Sindh, Bilawal may submit an application to federal government so the federal government would takeover.\nPresenting the Sindh government’s budget expenditures to media, he said Sindh government had failed to collect its set tax target of Rs. 128 billion and collected only Rs. 105 billion.\nFederal and Punjab government collected more than 27 percent of their set tax collection targets, Shahbaz Gill said even KP government’s performance in tax collection was far better than the Sindh government. In respect of Non-Tax Revenue Sindh government collected Rs. 12 billion instead of its set target of Rs. 50 billion.\nHe said those who have visited parts of interior Sindh would be aware why Bilawal Bhutto Zardari keep mentioning donkeys in his speeches because donkeys were being kept in government schools, police stations and hospitals in Sindh. “We will not leave the people of Sindh on mercy of Sindh government and will continue to raise our voice for the people “.\nShahbaz Gill said opposition was responsible for criticism based on facts and figures not for using harsh words and baseless allegations. Out of total Rs. 150 billion announced for ADP schemes, Sindh government utilized only Rs. 100 billion. Last year the provincial government had Rs. 30 billion in cash while this year they have Rs. 65 billion in cash, why the amount was not spent on the welfare of the masses, he questioned.\nHe said the party which chanted slogan to provide meal, clothes and shelter had only allocated Rs. 12 billion for subsidies in such testing times of COVID-19 while the federal government had allocated Rs. 700 billion for the purpose.\nPM’s Special Assistant said federal government last year provided funds of Rs. 725 billion to provincial government of Sindh while due to better performance of federal government this year, funds of Rs. 884 billion had been issued to Sindh government. The raise in respect of salaries in Sindh was due to the increased funds provided by the federal government.\nResponding to a query about water theft allegations by Sindh government, Gill replied that Sindh government had failed to prove it. He invited journalists to visit any barrage of their choice and prove any theft.\nAnswering another question, he said Sindh was given most of the money in PSDP. PTI was not a regional party like PPP.",
  "retrievedAt": "2025-08-11T20:52:32.069Z"
}
