{
  "title": "PM directs Law Ministry to take steps against harassment of women: Maleeka Bukhari",
  "link": "https://www.app.com.pk/national/pm-directs-law-ministry-to-take-steps-against-harassment-of-women-maleeka-bukhari/",
  "date_published": "2021-06-22T17:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP): Parliamentary Secretary for Law and Justice Barrister Maleeka Ali Bukhari on Tuesday said the Prime Minister Imran Khan has issued directions to Law Ministry to take quick, bold steps against harassment of women and children and sexual violence.\n“The Prime Minister Imran Khan’s first direction to Ministry of Law and Justice was to enact laws for reducing sexual violence and discrimination against women,” she said while addressing a press conference along with Minister of State for Climate Change Zartaj and Parliamentary Secretary for Planning, Development, and Reforms Kanwal Shauzab.\nShe highlighted that the Prime Minister directed to set up special courts under the Anti-Rape Law passed by the Parliament which was never done by any previous regime or Prime Minister.\nBukhari added that rape was a non-compoundable and complex offense against the state where our government established joint investigation teams (JITs), Anti-Rape Crisis Cells, and Special Courts under the Anti-Rape Law.\n“Under Section-13 of the Anti-Rape Law, the regrettable law of two-finger testing to examine a rape victim has been abolished. Women’s character assassination has also been banned under this law whereas the trial process of such cases has been expedited,” she said.\nShe added that the Anti-Rape Fund to support the implementation of the legislation was allocated Rs 100 million funding the current budget where the Budget document also noted the provision of additional funding ahead.\n“Our government has passed Enforcement of Women Property Rights and ensured a grassroots level implementation through the Deputy Commissioner and Women Ombudsman. We took strong and positive steps for curing rape,” she added.\nMaleeka Bukhari collectively invited all the political parties in the Parliament to partake in the national dialogue with a bipartisan approach to protect women and girls against sexual violence as they all need them.\nShe concluded that there was a fancy word roaming over social media with the aim to show distorted facts over the matter which should be shunned by the masses as a responsible society.",
  "retrievedAt": "2025-08-11T20:52:28.164Z"
}
