{
  "article_id": "2025-02-24_2d2b752e90c88ebd040e8500e9f6e7aa",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pm-to-visit-uzbekistan-on-tuesday/",
    "retrieved_at": "2025-08-27T13:04:23.215Z"
  },
  "metadata": {
    "title": "PM to visit Uzbekistan on Tuesday",
    "author": null,
    "date_published": "2025-02-24T12:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 219,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 24 (APP): At the invitation of President of Republic of Uzbekistan Shavkat Mirziyoyev, Prime Minister Muhammad Shehbaz Sharif will pay an official visit to Uzbekistan on February 25-26. The prime minister will be accompanied by a high-level delegation including Deputy Prime Minister/ Foreign Minister Mohammad Ishaq Dar and other members of his cabinet, Foreign Office Spokesperson said in a press release on Monday. \"The Prime Minister of Pakistan and the President of Uzbekistan, during the bilateral meeting would discuss all areas of bilateral cooperation including connectivity, economic, trade, investment, energy, defence and security, regional stability, and education. The leaders would also exchange views on regional and international issues of mutual interest. A number of bilateral agreements/MoUs will also be signed,\" it was added. The prime minister would also address the Pakistan-Uzbekistan Business Forum. Leading businessmen from both sides will participate in the Business Forum and hold B2B meetings to further enhance bilateral trade. Pakistan and Uzbekistan are bound together by common bonds of history, culture, religion, and their aspirations for peace and development, the spokesperson said. The prime minister's visit underscored Pakistan's commitment to further strengthen its ties with Uzbekistan, through fostering greater economic collaboration and exploring new avenues of partnership, as part of the strategic vision for regional integration and economic prosperity, it was further added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}