{
  "article_id": "2025-02-24_a024c7989e1c757268639b41dfe41652",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-visits-victory-monument-to-honour-heroes-martyrs-of-karabakh-war/",
    "retrieved_at": "2025-08-27T13:03:33.986Z"
  },
  "metadata": {
    "title": "PM visits Victory Monument to honour heroes, martyrs of Karabakh war",
    "author": null,
    "date_published": "2025-02-24T15:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "BAKU , Feb 24 (APP):Prime Minister Shehbaz Sharif Monday visited the recently built \"Victory Monument\" to honour the heroes and martyrs of the 44-day war for the independence of Nagorno Karabakh. The victory in the war was historic for restoring the regional integrity of Azerbaijan. The prime minister laid a floral wreath at the monument to pay tribute to the national heroes of Azerbaijan for their sacrifices. These heroes bravely defended their nation during the 2020 conflict of Nagorno Karabakh. While penning his impressions, he said, \"This magnificent Monument of Victory was a symbol of great bravery, courage, and national honour and was evident of the unwavering commitment and determination of Azerbaijan.\" He appreciated the Azerbaijani nation's demonstration of extraordinary courage and national pride during the 44-day war. He stressed that Pakistan would always stand with its brotherly country Azerbaijan with complete solidarity. \"Pakistan appreciates the efforts of Azerbaijan for peace, stability, and prosperity in the region,\" he added. He noted that the visit to the Monument of Victory was reflective of Pakistan's unshakeable commitment to support the sovereignty and integrity of Azerbaijan. Deputy Prime Minister and Foreign Minister Ishaq Dar, Minister for Commerce Jam Kamal Khan, Minister for Investment and Privatization Abdul Aleem Khan, Minister for Overseas Pakistanis and Human Resource Development Chaudhry Salik Hussain, Minister for Information and Broadcasting Attaullah Tarar and Special Assistant to Prime Minister Syed Tariq Fatimi and high-level officials were also present on the occasion.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}