{
  "article_id": "2025-02-24_bd17c1b201b97218d4090698208e53c3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/efp-pbdn-honor-employers-championing-disability-inclusion/",
    "retrieved_at": "2025-08-27T13:05:21.273Z"
  },
  "metadata": {
    "title": "EFP, PBDN honor employers championing disability inclusion",
    "author": null,
    "date_published": "2025-02-24T07:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 367,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 24 (APP): The Employers' Federation of Pakistan (EFP) and the Pakistan Business and Disability Network (PBDN) held the 2nd Disability Inclusion Excellence Awards in Karachi, recognizing companies that have made significant efforts to include people with disabilities in the workforce. The event, held in collaboration with the International Labour Organization (ILO), Sightsavers Pakistan, German Cooperation (GIZ), UNICEF, Standard Chartered, and other partners, celebrated organizations that have demonstrated exemplary policies and practices in integrating persons with disabilities into their workforce, said a press release issued here on Monday. Speaking at the ceremony, Muhammad Feroz Alam, Vice President of EFP highlighted the broader impact of inclusive workplaces. He said, \"By embracing inclusivity, businesses are not just meeting corporate social responsibility goals but also unlocking immense potential and innovation within their workforce. The Disability Inclusion Excellence Awards celebrate these changemakers who are leading the way towards a more equitable society.\" Syed Nazar Ali, Secretary General EFP emphasized the importance of inclusivity in the workplace: \"Empowering every individual, irrespective of ability, is not just a duty but a fundamental pillar of a just and progressive society. The Disability Inclusion Excellence Awards highlight our collective responsibility to create workplaces that are accessible and equitable for all. I commend the employers who have taken tangible steps to promote disability inclusion and equal opportunities.\" Since its inception in 2022, the Disability Inclusion Excellence Award has served as a platform to recognize organizations that go beyond compliance and actively create opportunities for persons with disabilities. The 2023-2024 award winners were selected from a competitive pool of applicants based on their inclusive workplace policies, recruitment practices, accessibility initiatives, and long-term commitment to diversity and equal opportunity. This year, winners were recognized across three award categories: 12 organizations in Diamond, 9 in Gold, and 9 in Silver. The full list is available on the EFP website. These companies have set a remarkable example in disability inclusion, leading the way with progressive hiring practices, workplace accommodations, and awareness initiatives. The event concluded with a strong call to action for more organizations to adopt inclusive hiring practices and integrate accessibility into their corporate strategies, ensuring that workplaces across Pakistan reflect the values of diversity, equity, and inclusion.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}