{
  "title": "Over 50 officers get training against locust threat",
  "link": "https://www.app.com.pk/national/over-50-officers-get-training-against-locust-threat/",
  "date_published": "2020-05-09T22:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP):Department of Plant Protection has trained 50 agriculture officers of Sindh province in order to mitigate the desert locust attacks and avoid damage threat to seasonal crops standing over million of hectares across province.\nMeanwile, about 153,665 km2 area has been surveyed. Out of this, 50,148 km2 was in Sindh, said an official in the Ministry of National Food Security and Research.\nTalking to APP, he said that on the directives of Prime Minister Imran Khan, an amount of Rs 1 billion was also released to combat the locust threat.\nFor the purpose of survey and control, he said that agencies like National Disaster Management Authority and provincial agricultural departments and the Department of Plant Protection were working jointly and in strong collaboration with each other.\nBesides, he said that Pakistan Army was also strengthening the efforts of government as military units were deployed on the ground for support in terms of men and material.\nHe clarified that locust was not restricted to Sindh alone, rather it has its presence and invaded other provinces as well.\nLocust was an international phenomenon, threatening around 60 countries of the world, he remarked.\nIn Pakistan, he said that swarms of desert locust are expected to migrate from Iran and other places to summer breeding regions in Sindh and Punjab.\nHe said that despite the limited resources including aircraft availability, the maximum aerial control activities were undertaken in the province of Sindh during 2019.\nHe said about 20,300 hectares have so far been came under the activity, and will be continued this year as well.\nTo overcome the shortage of aircrafts, the Federal Government was in the process of hiring aircrafts for spraying, he said adding that more ore than 100,000 liters ULV pesticide has been stored in Sindh, and a greater quantity can be provided on requirement.\nTwelve EC sprayers for the control of locust in the cultivated areas have also been deployed in various districts of Sindh to overcome the problem, he added.\nMoreover, 87 ULV sprayers have been ordered by NDMA, he said adding that the delivery of these sprayers has been delayed due to the COVID-19 situation in the country of manufacture.",
  "retrievedAt": "2025-08-11T19:12:05.401Z"
}
