{
  "title": "CM allows conditional home isolation for corona patients",
  "link": "https://www.app.com.pk/national/cm-allows-conditional-home-isolation-for-corona-patients/",
  "date_published": "2020-05-09T23:49:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 10 (APP)::Punjab Chief Minister Sardar Usman Buzdar has given permission for home isolation/quarantine for coronavirus patients with limited symptoms.\nAccording to a notification issued here on Sunday by the Punjab Primary and Secondary Healthcare Department, the Punjab chief minister, on the directions of corona expert advisory group and technical working group, has advised for following standard operating procedures (SOPs), devised by the International Health Organisation for home isolation.\nHe said that the patient would be kept in home isolation under the supervision of the district health authority concerned in a building where all necessary facilities were available.\nHe said that such hotels, school buildings, mosques, hostels and community centres could be used for home isolation where all necessary facilities were provided and such buildings would be disinfected on daily basis.\nBuzdar said that solid waste of the patients would be disposed of according to the given guidelines. “Such buildings cannot be used for isolation where cooling and heating systems can cause spread of the virus,” he made it clear.\nThe CM said that food would be provided to the patient in only disposable packs. He said that decision of home isolation of any patient would be made by home isolation committee, formed by the assistant commissioner of the area and assistant commissioner or his representative, DDO Health and chief officer of the area concerned would be members of the committee.\nPopulation Welfare, Livestock, Excise and Taxation staff would monitor and report about the isolation committee and three isolation committees would be formed in one union council in which at least one doctor would also be a member of the committee, whereas one committee would be constituted in a rural union council with one doctor in it, the CM said.\nThe chief minister said that the committee would also review space about keeping the number of patients in home isolation according to the family members and the family would be informed about the SOPs before allowing any patient home isolation.\nThe patient would be bound to inform the authorities about his condition on daily basis and testing protocol would be mandatory for the patient, he said.\nThe chief minister said that the period of home isolation would be for 10 days and for removal of home isolation conditions, the patient had to show at least two negative corona tests and after termination of home isolation, another test would be conducted after five days.\nIn case of non-availability of test, the patient would have to stay in quarantine for more than two weeks.",
  "retrievedAt": "2025-08-11T19:12:03.365Z"
}
