{
  "title": "Govt releases Rs 85.9 bn for development projects of NHA",
  "link": "https://www.app.com.pk/national/govt-releases-rs-85-9-bn-for-development-projects-of-nha-2/",
  "date_published": "2020-05-10T05:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP):The government has so far released Rs 85.9 billion for development projects of National Highway Authority (NHA) out of total allocation of Rs 95.67 billion under its Public Sector Development Programme (PSDP) 2019-20.\nAccording to latest data released by the Planning Commission, an amount of Rs 18.5 billion has been released for construction of motorway from Burhan-Hakla on M-1 to Dera Ismail Khan.\nFor construction of infrastructure and allied works for metro bus services Peshawar Morr-New International Airport Islamabad, the amount released so far was Rs 3.533 billion, while total allocation for this project for the year 2019-20 is Rs 4.5 billion.\nSimilarly, the government also issued Rs 3.5 billion for construction of black top road Yakmatch-Kharan via Dostain Wadh Khurmagai, whereas for Rs 2.6 billion has been released for construction of 6-lane highway from Kala Shah Kaku to Lahore ring road. For improvement, upgradation and widening of Jaglot-Skardu road, an amount of Rs 5.5 billion has been release out of total allocation of Rs 7.4 billion while for Lahore-Multan motorway, the government released Rs 4.5 billion.\nLikewise an amount of Rs 4 billion out of total allocation of Rs 6.5 billion has been released for Sukkur-Hyderabad motorway, whereas for improvement and widening of additional 2-lanes on either side of Thokar Niaz Baig to Hudyiara Drain Multan Road, Lahore, an amount of Rs 2 billion has been released.\nFor the dualization of Indus Highway Saral Gambila to Kohat Section, the amount released was Rs 5 billion whereas for dualization and improvement of pindigheb-Kohat road Rs 2 billion were released. An amount of Rs 2.5 billion was released for Peshawar Northern Bypass whereas Rs 2 billion have been released for Sukkur-Multan morotway. The government also released Rs 3.02 billion for land acquisition of Zhob-Kuchlak road whereas R 1.025 billion have been released for Zhob to Kuchlak road.",
  "retrievedAt": "2025-08-11T19:12:00.339Z"
}
