{
  "title": "People to share facts, avoid creating fear : Yasmin Rashid",
  "link": "https://www.app.com.pk/national/people-to-share-facts-avoid-creating-fear-yasmin-rashid/",
  "date_published": "2020-05-10T01:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP):Punjab Minister for Health, Dr. Yasmin Rashid Sunday said people should to share authentic and verified information on social media to educate people to combat COVID-19 spread rather than spreading fear among masses.\nGovernment has evolved a multi-step strategy and soon succeeded to tackle coronavirus spread, she said adding, misinformation, rumors and myths could be as deadly as COVID-19 pandemic.\n“Doctors, and other para medical staff are on the front line of the battle against coronavirus and they will be provided with the necessary protective equipment to ensure their safety and health,” she said while talking to a private news channel.\nShe further said that 90 per cent of coronavirus patients reported to the health officials had shown no symptoms after contracting the virus.\n“We need to create more awareness among the general public specially in rural areas regarding coronavirus and how it could be avoided,” the minister said adding that less number of cases were reported in Pakistan as compared to other countries across the globe.\nDr Yasmin further said the nation had to show a responsible behaviour at this testing time.\nShe said misleading myths about cures, and incorrect health advice could have devastating consequences.\nShe explained that testing capacity of coronavirus test is being increased in Punjab while policy for recruitment of more health staff has also been prepared that would be implemented soon.\nThe situation emerged due to Coronavirus has necessitated recruitment of more health experts to serve people during the pandemic and share the burden of hospitals, she mentioned.\nReplying a query, she said Prime Minister Imran Khan’s government was committed to secure lives of citizens, providing them all basic necessities of life under prevailing conditions of COVID-19 with its limited resources.\nShe also expressed regret that opposition is engaged in criticising and asked them to behave like mature politicians and play their role in this hour of need.",
  "retrievedAt": "2025-08-11T19:12:00.987Z"
}
