{
  "title": "Asad Umar urges every individual to take responsibility of controlling COVID-19",
  "link": "https://www.app.com.pk/national/asad-umar-urges-every-individual-to-take-responsibility-of-controlling-covid-19/",
  "date_published": "2020-05-10T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP):Minister for Planning, Development and Special Initiatives Asad Umar Sunday urged upon every individual to take responsibility of adopting precautionary measures issued by the government and health departments to control the coronavirus disease (COVID-19).\n“Apart from all efforts of health teams, administration and use of technology to contain the disease, the most powerful activist is every individual who has the responsible to not only save himself but to save the whole society and the country from the disease,” Asad Umar said while addressing a press briefing here.\nAppreciating the people’s behavior, he expressed the satisfaction that majority of the people were following the precautionary measures issued by the government to prevent spread of COVID-19.\nAsad Umar who chairs the National Command and Operation Center (NCOC) on coronavirus, said it had become even more important to adopt precautionary measures when the government had decided to ease lockdown to provide the people opportunities of earning livelihoods.\nHe said the situation of coronavirus in the country was not out of control however in case of any emergency, the government was fully prepared to cope with the situation.\nThe minister said the decision of gradual lifting of lockdown was unanimously taken to ensure that the daily wagers and small businessmen should not lose their sources of income.\nBut on the other hand, he said, the numbers of COVID patients were also increasing.\n“The people cannot be left without employments for long time, therefore the government has adopted such a system through which the daily routine life could be ensured along with strict measures to control the disease,” he maintained.\nAsad Umar said the big policy decisions had already been taken and now the government was ensuring operational implementation on the ground.\nHe said all provincial and federal government departments and armed forces were working together to implement this system.\nHe specifically appreciated the NCOC team who was working diligently since March 31 without any break.\nThe minister informed that the Testing, Tracking and Quarantining system was being fully implemented.\nHe said the number of tests in the country had increased from 473 tests on March 15 to over 31,000 tests on May 9.\n“Now 70 laboratories across the country have the capacity of testing for corona disease which possess all necessary equipment required for the testing,” he added.\nDuring the briefing, Asad Umar also gave a presentation to show how the government was implementing the TTQ system.\nHe informed that smart lock down system had started working on ground.\nUnder this system, he informed that with the help of technology, we got to know the number of cases in various areas of the country, and the health teams approach those areas and decide which streets or localities are to be sealed.\nHe informed that in Punjab, 359 smart lockdown cases were enforced, while in Khyber Pakhtunkhwa the number of smart lock down was 177.\nHe said at present 165 corona patients were on oxygen out of which 85 were on ventilators in various hospitals across the country while over 5,500 corona patients were admitted in the hospitals.\nThe minister informed that the National Information Technology Board (NITB) had developed a web portal in which record of 424 hospitals was being up loaded through which the users would be able to know about the available facilities in those hospitals for COVID patients.\nHe said each hospital would have separate login ID through which details of available facilities would be obtained.\nFurther, he said the Punjab government had also developed a mobile application through which the people would have access to information about the availability of health facilities, beds and ventilators etc.\nThe minister said that the government had also made an agreement with the Rural Support Programme which was a network of thousands of community based institutions to reach 25% poor communities across the country.\nHe said the Punjab government had also notified allowing the coronavirus patients to quarantine themselves at home if they had no need of hospitalization.\nUmar also urged the people to get test for coronavirus if they found any of the its symptoms.",
  "retrievedAt": "2025-08-11T19:11:59.913Z"
}
