{
  "article_id": "2025-04-21_f1b7fea5d25dc7cac2f1457420ed75f5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-warns-of-prolonged-hot-dry-weather-starting-tuesday/",
    "retrieved_at": "2025-08-27T14:43:51.636Z"
  },
  "metadata": {
    "title": "NDMA warns of prolonged hot, dry weather starting Tuesday",
    "author": null,
    "date_published": "2025-04-21T16:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 188,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 21 (APP): The National Disaster Management Authority's (NDMA) National Emergency Operation Centre (NEOC) has predicted predominantly hot and dry weather throughout most regions of the country from April 22 to 27, 2025. According to an advisory issued by the NDMA's National Emergency Operation Centre (NEOC), Balochistan and Sindh are expected to experience hot and dry weather throughout the current week. Temperatures are likely to remain significantly above normal, raising concerns of potential heat-related stress for the population, particularly vulnerable groups. In Khyber Pakhtunkhwa, Gilgit Baltistan and AJ&K hot weather conditions are anticipated in most areas. However, certain areas of GB, AJ&K and districts of KP including Abbottabad, Bannu, Buner, Charsadda, Chitral, Dir, Haripur, Karak, Kohat, Kohistan, Khyber, Kurram, Mansehra, Mohmand, Nowshera, Peshawar, Swabi, Swat, and Waziristan may experience cloudy skies accompanied by isolated rainfall during the advisory period. The National Disaster Management Authority (NDMA) stated that its National Emergency Operation Centre (NEOC) is continuously monitoring the situation and coordinating with all relevant stakeholders. NDMA urged citizens to download the Pak NDMA Disaster Alert App for real-time warnings and follow its official social media for safety guidelines.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}