{
  "article_id": "2025-04-21_793772b5f3b0cd6984ab94bce969029e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/hurriyat-leaders-pay-tribute-to-philosopher-poet-allama-iqbal-on-his-87th-death-anniversary/",
    "retrieved_at": "2025-08-27T14:42:35.816Z"
  },
  "metadata": {
    "title": "Hurriyat leaders pay tribute to philosopher-poet Allama Iqbal on his 87th death anniversary",
    "author": null,
    "date_published": "2025-04-21T11:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 340,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 21 (APP):A condolence gathering was organised by senior Hurriyat leader Syed Yousaf Naseem at the All Parties Hurriyat Conference (APHC) Azad Kashmir and Pakistan wing office to commemorate the 87th death anniversary of the celebrated poet and philosopher, Allama Dr. Muhammad Iqbal. Speakers at the condolence gathering paid tribute to Allama Iqbal, describing him as a multifaceted personality who not only awakened Muslims from slumber but also ignited a flame of freedom, self-awareness, and consciousness in their hearts, which continues to guide them today. They highlighted his profound impact on Muslim thought and identity. The speakers said that Allama Iqbal's thought and philosophy gave the Muslims of the subcontinent a new spiritual and intellectual strength, inspiring them to strive for freedom from the shackles of slavery. Iqbal's concept of \"Khudi\" (selfhood) enables individuals to understand their true identity, purpose, and the importance of freedom. Speakers emphasized the deep connection between the Kashmiri people and Allama Iqbal's thoughts. They highlighted that Iqbal's poetry has consistently conveyed a message of patience, resilience, and struggle to the oppressed people of Kashmir. Moreover, Iqbal expressed his spiritual and intellectual solidarity with Kashmir, supporting the Kashmiris' right to self-determination. The All Parties Hurriyat Conference (APHC) leaders appealed to the United Nations and human rights organizations to grant the Kashmiri people their inherent, legal, and moral right to self-determination. This, they said, would pave the way for peace, justice, and stability in South Asia. The condolence gathering concluded with a prayer for the elevation of Allama Iqbal's ranks, the martyrs of Kashmir, Kashmir's freedom, and Pakistan's stability. The participants reaffirmed their resolve that the Kashmiri nation would continue its freedom struggle to realize Iqbal's vision, ultimately achieving its rightful goal. The prayer gathering was attended by senior Hurriyat leaders, including Mahmood Ahmad Sagar, Advocate Parvez Ahmad (General Secretary), Mushtaq Ahmad Butt (Secretary Information), Syed Faiz Nashqbandi, Madam Shamim Shal, Sheikh Abdul Mateen, Dawood Khan, Javed Butt, Mian Muzaffar, Syed Gulshan, Nazir Ahmad Karnaah, Adil Mushtaq, Abdul Hameed Lone, and Muhammad Ashraf Dar, among others.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}