{
  "article_id": "2025-04-21_a99ae04d966fbfeb6b7145ea3ea59728",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-discusses-pmdcs-regulatory-framework/",
    "retrieved_at": "2025-08-27T14:44:05.794Z"
  },
  "metadata": {
    "title": "NA body discusses PMDC’s regulatory framework",
    "author": null,
    "date_published": "2025-04-21T13:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 774,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 21 (APP): The National Assembly Standing Committee on National Health Services, Regulations and Coordination on Monday discussed the Pakistan Medical and Dental Council (PMDC) and its regulatory framework. Chaired by Dr. Mahesh Kumar Malani MNA, the Committee took note of the longstanding issue of rising fees in private medical colleges The body appreciated the uniformity introduced through the PMDC proposal to cap the fee at Rs. 1.8 million to 2.5 million annually, with a maximum five percent yearly increment. However, the chair strongly emphasized that this cap must be strictly enforced and no institution should be permitted to exceed the limit. Regarding the Medical and Dental College Admission Test (MDCAT), the committee was informed that a uniform national curriculum had been developed through consensus and was available online. The revised curriculum would be finalized soon, but the committee stressed that it must be shared with members prior to formal approval. The committee expressed serious concern about the delays and reported corrupt practices in issuing experience certificates to medical professionals. It was categorically directed that such certificates be issued without delay and in a transparent manner. In relation to the Sehat Sahulat Programme, the committee was apprised that a meeting of the ACNEC was expected within the next fifteen days, and that a high-level committee under the Prime Minister has recommended shifting the programme's coverage to those living below the poverty line, with government subsidies. The Committee stressed the need for transparency in determining hospital eligibility and recommended that details of the development or current mode under which the programme would continue be shared with the committee. It also stressed that the programme should be expanded to areas such as AJK and Tharparkar and that manpower issues and malpractices be addressed at the earliest. The Committee reviewed the proposal to increase the excise duty on sugary and ultra-processed foods. It was informed that the Federal Board of Revenue (FBR) had agreed to the Ministry of Health's recommendation to raise the duty from the existing 20 percent to 30 percent. The chair directed that the proposal be included in the upcoming Finance Bill and reiterated to the FBR that this must be ensured. The Committee requested that the final response from the FBR be submitted before May 2, 2025. During the discussion on the Pakistan Nursing and Midwifery Council (PN&MC), the Committee expressed strong displeasure over the absence of the PNMC President and Secretary, despite the issuance of formal notices and a meeting summons. The Committee directed the Ministry of National Health Services, Regulations and Coordination to take serious notice of their non-attendance and initiate appropriate disciplinary action against them in accordance with relevant rules and procedures. The Committee resolved to issue a show-cause notice through the Speaker of the National Assembly. The members raised serious concerns about the legitimacy of the President's appointment and her academic qualifications. The chair directed the ministry to finalize its response and ensure that a comprehensive decision on the matter, including the President's qualifications and appointment process, be presented before the next meeting. Regarding \"The Pakistan Medical and Dental Council (Amendment) Bill, 2024\" and \"The Islamabad Healthcare Regulation (Amendment) Bill, 2024\" (moved by Ms. Shaista Pervaiz, MNA), the Chairman of the Committee instructed the Ministry of National Health Services, Regulations and Coordination to hold a separate meeting with the mover without delay, address all outstanding concerns, and ensure her satisfaction prior to April 24, 2025. The Committee deferred \"The Pharmacy (Amendment) Bill, 2024\" (moved by Mr. Abdul Qadir Patel, MNA) due to absence of the Mover. The Committee unanimously approved \"The Islamabad Capital Territory Compulsory Thalassemia Screening Bill, 2025\" (moved by Ms. Sharmila Sahiba Faruqui Hashaam, MNA) with amendment to clause 4 of the bill that was unanimously agreed to be removed. The Ministry of Law and Justice as well as the Ministry of Health were on the same page and did not give a nod of approval. The Committee also discussed the issue of protection of employees regularized through Cabinet Sub-committee on regularization with the approval of the Prime Minister in 2010. The Committee expressed concern that thousands of doctors and healthcare workers, regularized over the past 20 years, might be at risk of losing their jobs due to the Establishment Division's memo of referring to the FPSC for fresh tests. The Committee emphasized that no regularized employee should be laid off and urged the Ministry of Health and the Ministry of Law and Justice to find a viable, legal solution to protect these workers. The chair stated that this issue extends beyond the jurisdiction of the Health Ministry and must be addressed at the highest level.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}