{
  "article_id": "2025-04-21_7dfc04b6f17f4e308ac9a7d5db4daabd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pias-direct-baku-flight-resumption-vital-for-tourism-connectivity-pm/",
    "retrieved_at": "2025-08-27T14:43:04.057Z"
  },
  "metadata": {
    "title": "PIA’s direct Baku flight resumption vital for tourism, connectivity: PM",
    "author": null,
    "date_published": "2025-04-21T04:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 199,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 21 (APP): Prime Minister Shehbaz Sharif on Monday welcoming the resumption of direct PIA flights between Lahore and Baku called it a significant milestone for tourism and regional connectivity between both countries. \"I warmly welcome the resumption of PIA's direct flights between Lahore and Baku after a hiatus of two years - a significant milestone for tourism and regional connectivity between our brotherly countries,\" the prime minister wrote on his X timeline. He said that the inaugural flight, captained by Shahida Ismail, was also a proud reminder that Pakistani women continued to excel in all fields, including aviation. He said that his government remained committed to achieving greater milestones in the fraternal ties between Pakistan and Azerbaijan as bilateral cooperation was strengthening across sectors. The prime minister also commended Aviation Minister Khawaja Muhammad Asif and his entire team for their efforts in advancing the country's aviation linkages. The resumption of direct flight between Lahore and Baku was inaugurated on Sunday at a ceremony attended by Aviation Minister Khawaja Muhammad Asif and Azerbaijan Ambassador Khazar Farhadov. \"Today's the big day - we're flying to Baku! A new chapter begins. Long-Live Pak-Azerbaijan friendship,\" the airline said in a statement.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}