{
  "article_id": "2025-04-21_38427efecd40decba7c8bb78b4d93afd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-values-growing-ties-with-rwanda-gilani/",
    "retrieved_at": "2025-08-27T14:43:32.128Z"
  },
  "metadata": {
    "title": "Pakistan values growing ties with Rwanda: Gilani",
    "author": null,
    "date_published": "2025-04-21T16:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 531,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 21 (APP): Senate Chairman Syed Yousuf Raza Gilani on Monday said that Pakistan deeply values its relationship with Rwanda, noting that bilateral ties have strengthened steadily over time. During a meeting with Rwanda's Foreign Minister, Olivier Jean Patrick Nduhungirehe, the chairman said that Pakistan has shared a draft Memorandum of Understanding (MoU) for a strategic partnership with the East African Community (EAC), and Rwanda's support in this regard holds great importance. He said that NADRA has completed digital identity documentation projects in Nigeria, Sudan, Kenya, Somalia, and Pakistan is ready to offer similar services to Rwanda. Gilani said that the establishment of the Pakistani Resident mission in Kigali in 2021 and the inauguration of Rwanda's High Commission in Islamabad in 2024 have given a new dimension to bilateral relations. He highlighted the first round of Bilateral Political Consultations (BPC) held in Kigali in January 2025 and the visit of a parliamentary delegation led by Rwanda's Senate President to Pakistan in October 2023 as significant milestones. He added that both countries cooperate with each other at international and regional forums. The formation of the Pakistan-Rwanda Friendship Group by Rwanda's Senate is a commendable step. The Chairman Senate highlighted the importance of Parliamentary cooperation and observed that a Parliamentary group has been constituted to pave the way for more interaction and bilateral exchanges. He also extended invitation to his Rwandan counterpart to visit Pakistan. Gilani also informed that Rwandan side about the SIFC forum and said that the platform offers one window solution for trade and investment. The Senate Chairman further informed about Multan, city of Saints. The Chairman said that Pakistan places high importance on economic relations with Rwanda. Currently, Pakistan is the largest importer of Rwandan tea and is now exploring possibilities for importing coffee, avocados, pulses, and beans. He added that Pakistan produces some of the world's best rice, textiles, surgical instruments, pharmaceutical products, and footballs, all of which can find a strong market in Rwanda. Since football is the most popular sport in Rwanda, the import of globally renowned Pakistani footballs can also be considered. In addition to trade, there are vast opportunities for cooperation in the fields of education, science, technology, and investment. The Chairman appreciated the participation of Rwandan entrepreneurs in the Health, Engineering, and Minerals Show (HEMS) held in Lahore. He informed that Rwandan diplomats are receiving training at Islamabad's Foreign Service Academy, and so far, 11 diplomats have benefited from this program. Two Rwandan candidates are currently undergoing training under the Pakistan Technical Assistance Programme (PTAP) at the Pakistan Railway Academy, Walton, Lahore. Pakistan is also willing to offer training facilities to Rwanda in the banking and postal sectors. Four seats reserved for Rwandan students under PTAP have not yet been utilized. Rwanda's Foreign Minister Olivier Jean Patrick Nduhungirehe agreed with the views of the Chairman Senate, thanked him, and said that friendly relations with Pakistan are a matter of pride for Rwanda. He expressed a desire to further enhance bilateral cooperation across various sectors. He appreciated Pakistan's hospitality and sincere efforts to promote mutual interests and assured that Rwanda would further strengthen high-level engagements and parliamentary exchanges with Pakistan in the future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}