{
  "article_id": "2025-04-21_a91d1ca939de947b1deb751111c93c7d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/unity-among-muslim-countries-essential-to-tackle-extremism-terrorism-ayaz/",
    "retrieved_at": "2025-08-27T14:43:51.795Z"
  },
  "metadata": {
    "title": "Unity among Muslim countries essential to tackle extremism, terrorism: Ayaz",
    "author": null,
    "date_published": "2025-04-21T16:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 413,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 21 (APP):Speaker National Assembly Sardar Ayaz Sadiq on Monday said that unity among Muslim countries essential to tackle extremism, terrorism. During his meeting with Chairman of Shura Council, Dr. Abdullah bin Muhammed bin Ibrahim Al-Sheikh, in Riyadh, he reaffirmed Pakistan's unwavering commitment to deepening bilateral ties with the Kingdom of Saudi Arabia. He said that Pakistan and Saudi Arabia enjoy brotherly relations rooted in shared faith, history and mutual respect. The Speaker underscored the importance of enhancing parliamentary cooperation through frequent exchanges between the legislatures of both countries. He emphasized that such interactions are essential for fostering mutual understanding and institutional collaboration. Ayaz Sadiq also highlighted the vast investment opportunities available in Pakistan, particularly in the sectors of energy, infrastructure, agriculture and information technology. He extended a cordial invitation to Saudi investors to explore and capitalize on these prospects, assuring them of full support and facilitation. Ayaz expressed appreciation for the consistent and valuable support extended by Saudi Arabia to Pakistan at regional and international forums, especially during times of need. He also strongly condemned the killings of innocent children and women in Palestine and Kashmir, saying that unity among Muslim countries is crucial for addressing such challenges and effectively combating extremism and injustice. Later, during his meeting with the Grand Mufti of Saudi Arabia, Sheikh Abdulaziz bin Abdullah Al Sheikh, he stressed the vital role of religious leadership in promoting peace and countering extremism. He urged the Grand Mufti to consider issuing a unified and categorical fatwa against terrorism, saying that terrorists are killing innocent people as such practices are not allowed in any religion. The Speaker noted that religious scholars bear a significant responsibility in guiding youth, shaping narratives of moderation and reinforcing the true essence of Islam, which advocates peace, tolerance, and humanity. He also expressed Pakistan's strong desire for continued cooperation between religious institutions in both countries to promote interfaith harmony and counter radicalization. Furthermore, Ayaz Sadiq met with Prince Faisal bin Bandar bin Abdulaziz Al Saud, the Governor of Riyadh. The two dignitaries discussed a broad range of issues aimed at further strengthening bilateral cooperation. The emphasis was placed on deepening economic and cultural ties, boosting trade volume and exploring collaborative opportunities in areas of mutual interest. Ayaz Sadiq reaffirmed Pakistan's keen interest in working closely with Saudi Arabia to build long-term, sustainable partnerships. He welcomed the Kingdom's Vision 2030 reforms and expressed Pakistan's support for initiatives aimed at promoting regional connectivity and inclusive economic development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}