{
  "title": "Pri­vatisation Commission approves second attempt to divest PIA - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pri­vatisation Commission on Tuesday recommended to the Cabinet Committee on Privatisation transaction structure for the second attempt of Pakistan Inter­­national Airlines Company Ltd (PIACL) based on divestment of 51 to 100 per cent shares capital of the national flag carrier.\n\nThe proposed divestment will be together with the management control of the airline as well. The final terms and conditions for the transfer and acquisition of equity stake will be finalised during the course of bidding process and set out in the bid documents for approval by the Cabinet Committee on Privatisation.\n\nThe approval of PIACL transaction structure was given at a meeting of Privatisation Commi­ssion Board, chaired by newly appointed Adviser to the Prime Minister on Pri­va­tisation Muhammad Ali.\n\nPrime Minister Shehbaz Sharif has expedited the privatisation process of PIA, advancing its closure to June instead of previously planned October timeline.\n\nThe first attempt of privatisation made in October last year failed when the sole bidder offered Rs10 billion, which was far below the minimum ex­­pectations of Rs85bn fixed by the Privatisation Commission.\n\nThe board also discussed the transaction structure options for privatising Roosevelt Hotel Corporation, New York, and decided to have a briefing with the financial adviser before making any decision.\n\nPrivatisation of PIACL and the Roosevelt Hotel are on top of the government’s agenda for 2025.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:57.596Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898843/privatisation-commission-approves-second-attempt-to-divest-pia",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:09.000Z"
}
