{
  "title": "Cop martyred, another hurt in KP shootings - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Terrorist killed in Charsadda\n• Curfew imposed in Upper South Waziristan\n• Khyber residents thwart kidnap attempt\n\nPESHAWAR: While a daylong curfew has been imposed in three parts of Upper South Waziristan amid security concerns, a policeman returning home was martyred in Dera Ismail Khan, a Motorway Police official sustained injuries on Swat Motorway, law enforcers foiled an attack on a checkpoint in Charsadda and locals thwarted an abduction attempt by militants in Khyber on Tuesday.\n\nPolice officials said that a policeman, Mohammad Ali, was martyred when unidentified attackers opened fire on him on Chashma Road near Singhar area of in D.I. Khan district.\n\nThe martyred cop was on his way back home when he was targeted and the assailants fled the scene after the shooting, the officials said, adding that the slain cop’s body was shifted to hospital.\n\nLater, police launched a search operation in the area.\n\nIn Malakand, a Swat Motorway patrol car came under attack, leaving a police cashier, Majid, injured.\n\nOfficials said the shooters fled when the Motorway Police retaliated.\n\nLater, the counterterrorism department of police registered an FIR against the unidentified shooters. According to the CTD report, Sub-inspector Yahya of Swat Motorway Police, along with others, was on routine patrol duty on the motorway from Pillai to Chakdara Interchange when miscreants from a hill near Zalmakot Tunnel opened fire on their car (ARU-690).\n\nThe shooters escaped in retaliatory firing. However, the firing left the car damaged and Majid injured. The injured cashier was shifted to Batkhela hospital.\n\nOn the other hand, a militant was killed when law enforcers foiled an attack on Atki Bypass checkpoint in the Shabqdar area of Charsadda district.\n\nThe slain militant was later identified as Javed Khan, a resident of Bannu. He was wanted by CTD in police van attacks and target killings. A pistol, hand grenade and explosive material were found in the possession of the accused.\n\nCurfew imposed\n\nSeparately, the Upper South Waziristan district administration on Tuesday evening issued a notification, announcing the imposition of a curfew from 6am to 6pm on Wednesday in three areas amid security concerns.\n\nDuring this period, movement on some key roads, including from Aziz Abad Chowk to Sarvekai and Jandola, road connecting Spin Jumaat, Asman Manza, and Ladha to Makin and the road from Bibi Raghzai to Kotkai and Jandola will be closed for all vehicles.\n\nDeputy Commissioner Saleem Jan emphasised that there would be a complete ban on all movement along these routes from morning, urging the public to use alternative routes to avoid any inconvenience.\n\nLocals foil kidnap attempt\n\nIn a display of unity and courage, residents of Tirah valley of Khyber district thwarted an attempt by a group of armed militants to abduct a soldier who had arrived at his home to spend vacation with family.\n\nSources said that armed militants barged into the house of Noor Salim, a resident of Wali Khel in Bar Qambarkhel area, in an attempt to abduct him and fired into the air to scare his family when they put up resistance. The gunfire grabbed locals’ attention who gathered at the house in large numbers, refusing the militants to take soldier, Noor Salim, away. He was currently posted in Awaran district and recently returned home.\n\nMuhammad Irfan Mughal in Dera Ismail Khan, Gohar Ali Gohar in Batkhela, Faiz Muhammad in Charsadda, A.K. Wazir in South Waziristan and Ibrahim Shinwari in Khyber contributed to this report\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:40.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898851/cop-martyred-another-hurt-in-kp-shootings",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:00.000Z"
}
