{
  "title": "IHC constitutes larger bench on PTI founder’s jail rights petitions - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) has constituted a larger bench to hear all petitions related to the visitation rights and jail conditions of former prime minister Imran Khan, currently incarcerated at Adiala jail.\n\nThe three-member bench, comprising acting Chief Justice Sar­dar Mohammad Sarfraz Dogar, Justice Arbab Mohammad Tahir, and Justice Mohammad Azam Khan, will hear all the petitions related to Mr Khan’s jail facilities, including his meetings with relatives, party leaders and his entitlements, from now onwards.\n\nThe IHC administration has transferred all 26 petitions, including contempt of court applications against Adiala Jail Superintendent Abdul Ghafoor Anjum, to the larger bench.\n\nThe decision to consolidate the cases was made following an application by Mr Anjum, who cited logistical challenges in appearing before multiple benches.\n\nJustice Dogar-led bench to hear all 26 pleas, including Imran’s contempt plea against jail superintendent\n\nActing CJ Dogar subsequently ordered that all related petitions be heard by a single bench to ensure uni formity in adjudication.\n\nThe petitioners in the case inc­lude Imran Khan, his sister Noreen Niazi, opposition leader Omar Ayub Khan, Shoaib Shaheen, Saifur Rehman, Dawood Shoukat, Mian Ghous Muhammad, Asad Malik, Tariq Mehmood, Shahina Shahabuddin, Shaista Khosa and Mashal Azam Yousafzai.\n\nIn one such petition, filed by Mashal Azam Yousafzai, Justice Sardar Ejaz Ishaq Khan had directed the authorities to produce Mr Khan before the court. However, citing security concerns, the directive was not complied with. The judge later assigned court clerk Sakina Bangash to visit the jail and verify whether Mr Khan had been denied access to his legal counsel. Ms Bangash, however, was unable to meet the ex-PM, leaving the key questions unanswered. This issue will also be addressed by the larger bench.\n\nAt the hearing, Advocate Nav­eed Malik representing the jail superintendent argued that the Standard Operating Procedures (SOPs) for Mr Khan’s political meetings in jail had already been established in an intra-court appeal. Yet multiple petitions related to these meetings were being heard by different benches, causing administrative challenges. He urged the court to consolidate these cases to ease the burden on the jail administration.\n\nThe petition, filed under Section 24 of the Civil Procedure Code (CPC), emphasised the need for consistent judicial rulings regarding his visitation rights. The court was told that conflicting judgements from different benches created operational difficulties for the jail administration.\n\nSSP Anjum noted that Adiala jail currently houses over 8,000 inmates — four times its capacity of 2,000 — posing serious challenges for prison management. Despite these difficulties, he claimed that Mr Khan has been provided all privileges under the Pakistan Prison Rules of 1978, including regular meetings with family, lawyers, and political associates, as well as access to reading materials and newspapers.\n\nThe petition reiterated that the jail superintendent holds the authority to regulate or restrict meetings with prisoners under prison regulations.\n\nSpeaking to Dawn, Mr Khan’s spokesman Niazullah Khan Niazi said the ex-premier and his spouse instructed the legal team to follow the cases before the larger bench. However, he added, Mr Khan also reserved the right to file an objection at any point.\n\nAbout Mashal Yousafzai’s meeting with Mr Khan and his spouse Bushra Bibi, Mr Niazi said she is not the counsel for both, though being a political worker she has the right to visit the incarcerated couple.\n\nTerrorism\n\nMr Niazi said Mr Khan was sad over the recent terrorist incidents and said since the PTI was the largest political party with presence and mandate across the country, it could not be sidelined at such a critical juncture.\n\nThe spokesman said that Mr Khan criticised the “stakeholders” for excluding the PTI from the peace process and including the PML-N government even though, he added, was formed through the manipulation of Form-47. According to him, the ex-premier wants expeditious hearing on the appeals against his conviction in Al Qadir Trust case.\n\nHe regretted that the jail authorities were not arranging weekly telephonic contact of Mr Khan with his sons, mandatory 72-hour-long private meeting with his spouse after every 90 days, adding that the jail administration had discontinued the facilities of TV and newspapers.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:02:16.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898809/ihc-constitutes-larger-bench-on-pti-founders-jail-rights-petitions",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:18:50.000Z"
}
