{
  "title": "3 Balochistan universities shut over ‘security concerns’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Three Baloc­h­istan universities have ind­efinitely stopped on-campus classes and asked students to attend virtual classes.\n\nThe University of Baloc­h­istan, Sardar Bahadur Khan Women University and University of Turbat have suspended academic activities immediately.\n\nAccording to sources, the decision has been ta­ken in view of recent att­acks and security threats.\n\nThe decision came days after terrorists hijacked the Jaffar Express near Sibi. At least 26 hostages, including 18 security personnel, lost their lives in the attack.\n\nSince then, multiple attacks have taken place across Balochistan.\n\nThe decision was taken by university administrati­ons after consultation with deans and heads of the academic departments.\n\nA notification issued by the University of Baloch­is­tan said a meeting was co­nvened with the deans and sectional heads, which decided that all campuses will switch to virtual lear­ning until further orders.\n\nIt offered no reason for the decision.\n\nThe notification said the faculty members have been instructed to utilise existing ID numbers to access the required digital resources and learning management systems.\n\nUniversity of Balochistan Vice Chancellor Zahoor Ahmad Bazai told Dawn.com that classes have been moved online as students from remote areas were unable to reach campuses due to protests on national highways.\n\nBazai said that students from areas where there was a problem with internet access would be provided concessions during the semester, while the decision on online classes would be taken after Eidul Fitr.\n\n“As soon as the issue of sit-ins and closure on national highways is resolved, the University of Balochistan will resume its work in normal conditions. We will do it because our aim is to provide education to children,” the vice chancellor told Dawn.com.\n\nThe Sardar Bahadur Khan Women University also issued a notification announcing a similar decision.\n\nIt said students will attend online classes during Ramazan.\n\nA statement issued by the University of Trubat after a meeting chaired by Vice Chancellor Prof Dr Gul Hasan said in light of the “prevailing situation”, the meeting decided to suspend academic activities and classes from Tuesday.\n\nIt added that the meeting discussed and reviewed academic and administrative matters, along with the ongoing “illegal occupation and blockade” of the university’s Administrative Block by a group of students.\n\nThe participants decided to stop the entry of outsiders and to protect the university’s assets, as well as the lives of employees and students residing on the premises, the statement added.\n\nThe statement asked the students to vacate hostel rooms within two days.\n\nThe registrar briefed the meeting on the “unauthorised occupation and blockade of the Administrative Block” by students, which began on March 13.\n\nHe explained that, in response to the Disciplinary Committee’s decisions, a group of students locked the entrance, staged a sit-in at the main gate, and prevented the staff from entering their offices.\n\nThe protest has caused significant difficulties for students, faculty, and administrative staff, especially during the holy month of Ramazan, the registrar stated.\n\nIn an effort to resolve the situation through dialogue, the university formed a committee of senior faculty members on March 13, which met with the protesting students.\n\nThey were assured that their legitimate concerns would be addressed.\n\nHowever, the students refused to end the blockade of the Administrative Block, insisting that the hostel allotment of a student who had been penalised by the Disciplinary Committee for illegal activities be reinstated as a precondition for dialogue.\n\nThe Balochistan University of Information Technology, Engineering and Management Sciences has stopped the transport services for students.\n\nA decision on academic activities is expected on Wednesday as examinations are in progress.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:02.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898811/3-balochistan-universities-shut-over-security-concerns",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:18:50.000Z"
}
