{
  "title": "Rape case against Dubai-returned man in Toba Tek Singh - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: The Ghulam Muhammadabad police in Faisalabad registered a rape case on Tuesday against a Dubai-returned man regarding a three-year old incident.\n\nThe complainant stated in her first information report under Section 376 of the Pakistan Penal Code that in 2022 she was residing in the rented upper storey of a house while the suspect lived on the ground floor. On the day of the incident, she went to his house to take something from his wife, but she was not there. The suspect raped her at gunpoint and later blackmailed her for one year, allegedly extorting Rs600,000 from her.\n\nIn 2023, the suspect went to Dubai. She said five days ago, he again attempted to rape her, but fled when she raised an alarm.\n\nAlso, a scrap dealer allegedly attempted to rape two minor girls in the Habib Park locality of Gojra on Tuesday.\n\nThe complainant informed Gojra City police that his daughter and niece went to sell empty bottles to the suspect, who lured both girls to the rooftop of his shop where he attempted to rape them. However, on raising an alarm, the suspect fled.\n\nPolice were conducting raids to arrest the accused.\n\nROBBERY: Robbers injured a man when he was returning home after withdrawing money from the Jaranwala Habib Bank branch on Tuesday.\n\nAccording to Rodala police in Faisalabad, Tariq Ghafoor and Zahoor Akbar were on their way to Chak 280-GB when two bandits on a motorcycle attempted to snatch Rs200,000. As they offered resistance, the robbers opened fire, and a bullet hit Tariq Ghafoor in the head, seriously wounding him.\n\nThe outlaws fled without snatching the cash. The injured man was shifted to Jaranwala THQ Hospital.\n\nCASE TRACED: Chak Jhumra police have traced a blind murder of a factory worker whose body was found three days ago on the roof of the third storey of Gohar Textile Mills.\n\nThe police said on Tuesday that it was a difficult job to check the mobile data of 6,000 phones of factory workers, but police finally arrested suspect Qasim Masih by tracing through geo-fencing.\n\nHe confessed that on March 7, he took his deceased fellow worker Amer Abbas to the rooftop of the mills’ building with some excuse, where he hit his head with a heavy stone. After Amer died, Qasim picked Rs32,000 from his pocket, which the deceased had received as salary from the mills.\n\nAlso, a man missing for the last six days was found dead in Mailsi Link Canal at Khanewal on Tuesday. A kidnapping case was registered by Talamba police against unidentified people when Muhammad Rafiq, 50, of Nusrat Colony, went missing. His body was shifted to Talamba Rural Health Centre for autopsy.\n\nGCUF SEMINAR: Government College University Faisalabad (GCUF) Vice Chancellor Dr Rauf-i-Azam addressing a seminar on Tuesday titled ‘Celebration of Pakistan Resolution’ said that Pakistan’s progress depends on economic stability, without which sustainable development and global recognition remain distant goals.\n\nHe said we must embrace technology, education and innovation to secure our nation’s future and ensure prosperity for coming generations. He said that the world is advancing rapidly, and to keep pace, Pakistan must embrace technology and global knowledge.\n\nZafarullah Khan, former executive director of the Pakistan Institute for Parliamentary Services (PIPS), Islamabad, said the strength of politics lies in its diversity and that political stability is essential for achieving social stability in Pakistan. He said progress depends on the stability of the political system, which in turn ensures societal growth and development.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:04.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898758/rape-case-against-dubai-returned-man-in-toba-tek-singh",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:31.000Z"
}
