{
  "title": "Lawmakers doled out funds amid stalled uplift spending - Pakistan - DAWN.COM",
  "author": null,
  "content": "• 96pc of funds under Sustainable Development Goals Achievement Programme released in July-February\n• Overall PSDP spending stands at Rs312.3bn, just over a quarter of annual allocation\n\nISLAMABAD: A swift 96 per cent disbursement for parliamentarians’ sc­h­e­mes gave a sudden boost to an otherwise slu­ggish development programme in the first eight months (July-February) of the current fiscal year.\n\nOfficial data from the Planning Commission shows that total spending under the Public Sector Development Progra­m­me (PSDP) stood at Rs312.3 billion, amounting to 28.4pc of the Rs1.1 trillion allocated for the year.\n\nHowever, spending under the Sustainable Development Goals Ach­ievement Progra­mme (SAP) — a code name for parliamentarians’ sche­mes — far exceeded the allocation, reaching almost 140pc of the initially earmarked Rs25bn and about 70pc of the Rs51bn that was later approved.\n\nThis extraordinary spending comes against the backdrop of a Rs600bn revenue shortfall during the same period. Excluding SAP allocations, core PSDP utilisation was significantly lower, standing at just 26pc, or Rs277bn of the Rs1.05tr earmarked.\n\nUnlike the swift disbursement seen this year, SAP funds are usually not released so easily, and lawmakers often have to run from pillar to post to secure approvals and access allocations.\n\n“The SAP fund was doubled, approved for disbursement and spent with ‘Shehbaz Speed’,” said a senior government official involved in the process.\n\nHe explained that approval for increasing the SAP fund to Rs50.773bn and its allocation to parliamentarians of coalition partners was notified on Jan 9 and almost 96pc funds (Rs48.64bn) were released within a couple of weeks. The total utilisation by the end of February reached Rs35bn (72pc) in less than two months compared to 26pc utilisation in the core development portfolio in eight months.\n\nOfficials said the government originally pla­nned Rs50bn for SAP at the time of the Annual Plan Coordination Com­m­ittee meeting in April last year but later red­uced it to Rs25bn as part of the final budget prepared in consultation with the International Monetary Fund (IMF).\n\nHowever, it was doubled at a meeting of coalition partners led by Deputy Prime Minister Ishaq Dar in November to almost Rs50bn in the budget books for 2024-25. Mr Dar declined a demand of the coalition partner PPP to carry forward around Rs30bn in unspent funds from last fiscal year on technical grounds.\n\nThe government also relaxed principles alre­ady notified for the PSDP to ensure quick disbursements to satisfy parliamentarians associated with the government. This is in addition to about 300pc increase in the salaries of parliamentarians and the expansion of the federal cabinet.\n\nIn the budget 2023-24, the then PML-N government allocated Rs91bn for the parliamentarians’ scheme and appro­ved about Rs61bn for disbursement before it was replaced by the caretaker government, which put a freeze on such political schemes.\n\nAs a result, about Rs57bn could be utilised by the end of the fiscal year. The two PPP constitutional officeholders — Senate chairman and the National Assembly’s deputy speaker — then demanded that those Rs34bn unspent funds be utilised this year.\n\nPlanning Minister Ahsan Iqbal had told the Ishaq Dar-led meeting “that Rs50bn had been allocated by the government for the SAP 2024-25 under PSDP”.\n\nStrangely, though, the PSDP available on the planning ministry’s official website still shows an allocation of Rs25bn for SAP without the approval of the respective schemes.\n\nOf the total Rs48.37bn, Rs28.87bn was approved by Punjab-based parliamentarians, followed by Rs15.25bn for Sindh, Rs2.25bn for Balochistan, Rs1.25bh for Khyber Pakhtunkhwa, and Rs750 million for Islamabad.\n\nMeanwhile, overall PSDP spending in the first eight months of the previous fiscal year had stood at Rs237bn or 25pc of the Rs940bn allocation.\n\nUnder the mechanism announced by the Ministry of Finance for the current fiscal year, the government should release 15pc of budgeted allocation in the first quarter, followed by 20pc in the second quarter, 25pc in the third quarter and the remaining 40pc in the last quarter.\n\nThe estimated release for PSDP by the end of February should be at around 52pc of annual allocation or no less than Rs572bn. Planning Commission actually authorised Rs631bn for the first three quarters.\n\nAll 36 federal ministries and divisions and their agencies could spend only Rs253bn in the eight months, accounting for 30pc of their Rs843bn allocations. About half of these funds (Rs125bn) were spent in January and February.\n\nThe two major overall corporate entities — the National Highway Authority (NHA) and the National Transmission and Dispatch Company — spent a meagre amount of Rs59bn in the eight months, about 23pc of their joint allocation of Rs255bn. Even on an individual basis, the NHA utilised about Rs49bn against its annual share of Rs161bn.\n\nThe power sector, on the other hand, utilised a miniscule Rs10.6bn, around 11pc of Rs94.5bn annual allocation. Likewise, despite the country being at risk of climate disasters, the climate change division spent only Rs478m, about 9pc of its Rs5.256bn allocation.\n\nAnother critical ministry in the social sector — National Food Security — was able to utilise about 4.9pc (Rs1.1bn) against its sizable allocation of Rs23.9bn.\n\nThe official data also shows that the Railways Division was the only federal ministry that could unusually touch the general utilisation threshold with spending of Rs21bn, almost 60pc of the Rs35bn allocation.\n\nConversely, the Planning Commission, which is actually the custodian of the development programme, could itself make an expenditure of just Rs2bn, about 15pc of a hefty allocation of Rs21.4bn it had amassed at the time of budget approval.\n\nThis raises questions about the capability of the planning ministry, which is required to keep a watch on the utilisation of development funds across the country.\n\nThe provinces and special areas (merged districts of Khyber Pakhtunkhwa, Azad Kashmir and Gilgit-Baltistan) were jointly able to spend Rs79bn, around 31pc of their annual allocation of Rs257bn.\n\nThe Water Resources Division, which had the largest allocation in PSDP at Rs170bn, could spend only Rs50bn, or 29pc.\n\nThe Higher Education Commission spent an amount of Rs15bn in the first eight months against its annual allocation of more than Rs61bn.\n\nAt least five ministries could not spend anything in the eight months, including the ministries of commerce, communications, narcotics control, religious affairs and strategic plans division. This alarming spending pattern has a direct negative bearing on the living standards of the people and economic growth.\n\nThe government originally allocated Rs1.4tr for PSDP, but this was revised to Rs1.1tr under the IMF agreement.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:26.585Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898812/lawmakers-doled-out-funds-amid-stalled-uplift-spending",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:18:50.000Z"
}
