{
  "title": "NCRC representatives summoned in missing children’s case - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Constitu­tio­nal Bench of the Supreme Court on Tuesday summoned representatives of the National Commission on the Rights of Child (NCRC) in a case moved to seek a declaration that police should treat the issue of missing children as a cognisable offence.\n\nHeaded by Justice Aminuddin Khan, the five-judge bench had taken up a petition moved by the Karachi-based Roshni Research and Development Welfare Organisation in 2018.\n\nThe petitioner sought a direction to amend the relevant laws by the federal and provincial governments and establish special courts in consultation with the respected high courts.\n\nOn Tuesday, the apex court was told that despite earlier directions that Attorney Gen­eral for Pakistan should meet the inspector generals of police (IGPs) to sort out the matter, no such meeting took place.\n\nHowever, Additional Attorney General (AAG) Chaud­hry Aamir Rehman contested the statement, claiming that the AGP did meet several IGPs.\n\nDuring the hearing, Justice Jamal Khan Mandokhail regretted that laws for the protection of children were not being implemented.\n\nAccording to a study conducted by the organisation, around 5,000 to 6,000 children “disappear from Karachi” every year, but police instead of registering a proper FIR for each case, only mention such incidents in Roznamcha (daily diary) without carrying out any investigation or efforts to trace such children.\n\nReferring to Section 364-A of the Pakistan Penal Code, the court was told that police officials take advantage of lacuna in the law to avoid case registration since the vital words in the section are kidnapping or abduction.\n\nWhen a complainant approach police to lodge the case of a missing child, officials say “disappearance” was not mentioned in any provision of the PPC, the petition claimed.\n\nThe situation in Punjab and other provinces was not less horrendous, the petition stated, adding that immediate indulgence of the Supreme Court was needed to enforce the fundamental rights of the public.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:25.798Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898873",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:38:42.000Z"
}
