{
  "title": "Suspect arrested under cybercrime law sent to jail in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: A suspect detained by the police for alleged propaganda against the state, the Punjab chief minister, and the heads of intelligence agencies was sent on judicial remand on Tuesday, a day after his arrest.\n\nMohammad Rehan, a resident of Sadiqabad, was arrested by the Waris Khan police under the Prevention of Electronic Crimes Act (Peca) after the complaint of a foot constable, Shahzad Ahmad.\n\nThe police official said in the FIR that he was using social media on his cell phone near Committee Chowk on Monday night when he saw Mohammad Rehan, a resident of Sadiqabad, was campaigning against the Punjab CM, the military, and the state for passing aggressive remarks.\n\nIn the FIR, the police official claimed that the suspect posted similar content on his other social media accounts, including Facebook.\n\nHe said the posts made by the suspect indicated that the said person was an active supporter of a political party and was deliberately sharing anti-state material to create unrest and hatred against the government.\n\nMohammad Rehan was produced before the court of law on Tuesday and sent to jail on judicial remand.\n\nOn Sunday, the Federal Investigation Agency conducted a raid in Banigala and arrested a suspect for allegedly campaigning against state institutions.\n\nThe suspect was identified as Haider Saeed.\n\nA court later granted physical remand of the suspect to the FIA after he was arrested for his alleged involvement in social media propaganda against the state over the recent terrorist attack on Jaffar Express.\n\nThe suspect was produced before the court of senior civil judge Mohammad Abbas Shah by the FIA team and requested for an eight-day remand custody for further investigation.\n\nHowever, the court granted a three-day remand for further investigation and recovery.\n\nTwo killed\n\nMeanwhile, two persons were killed in separate road traffic accidents on Murree Road on Tuesday.\n\nA motorcycle rider was killed after being hit by a truck on Murree Road near Rehmanabad.\n\nTayyab Tariq was riding his motorcycle when he was knocked down by a truck on Murree Road. He was removed to Benazir Bhutto Hospital, where the doctors pronounced him dead. A loader rickshaw driver was killed after his vehicle crashed into a truck which was moving ahead of him near Marir Chowk.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:02:59.415Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898805/suspect-arrested-under-cybercrime-law-sent-to-jail-in-rawalpindi",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:39.000Z"
}
