{
  "title": "Woman dies as she flings herself, son in front of train in Narowal - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: A woman died and her minor son was critically injured allegedly when she flung herself and the child in front of a running passenger train in Sialkot.\n\nA Sialkot Rescue 1122 spokesman said Zanira Bibi (40) died on the spot, while her four-year-old son Abdullah was critically injured when the woman threw herself and the minor in front of Allama Iqbal Express near Chawinda railway crossing in Pasrur tehsil.He said that a rescuers’ team dispatched to the scene handed over the woman’s body to police and shifted the injured minor to Pasrur Tehsil Headquarters Hospital.\n\nAs per locals, Afzal and Shahid, the woman, a resident of a village, allegedly died by suicide after being by fed up with poverty and domestic disputes.\n\nARRESTED: Sialkot police arrested a man for making a hoax robbery call on police helpline 15.\n\nAs per a district police spokesman, a man, identified as Rashid, called on the police helpline 15, saying that unidentified robbers deprived him of Rs170,000 in Saddar police limits.\n\nHe said that a police team, led by SHO Abdul Razzaqa, arrived at the scene in response to the call and during initial investigation found the complainant’s statement suspicious.\n\nHe said that on further investigation it transpired that the complaint was baseless. He claimed that the police also recovered the amount, that was allegedly taken away, from the complainant.\n\nHe said the police arrested Rashid for making a hoax call about a robbery.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:52.606Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898770/woman-dies-as-she-flings-herself-son-in-front-of-train-in-narowal",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:31.000Z"
}
