{
  "title": "President Zardari urges need to win ‘war against terrorism’ during Quetta visit - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari on Wednesday emphasised the need to win the “war against terrorism” at all costs during a visit to Quetta amid the prevailing tense security environment in Balochistan.\n\nThe visit comes amid an upsurge in terrorism in Khyber Pakhtunkhwa and Balochistan. Just this month, Balochistan witnessed the unprecedented Jaffar Express hijacking which resulted in at least 31 lives being lost and a suicide blast in Noshki District that left five dead.\n\nMeanwhile, there were multiple assaults on KP police among other incidents, while three terrorists were killed by security forces in a counterterrorism operation in the Khyber district on Monday.\n\nA statement from the PPP said President Zardari arrived in Quetta on a one-day visit to review the provincial law and order situation. He later attended a briefing on law and order in the province.\n\nIn a statement issued on the meeting’s discussion, the president was quoted as saying: “Terrorists will be defeated at all costs. Terrorists are trying to divide the nation The situation is clear, the state has to survive, the war against terrorism has to be won.”\n\nPresident Zardari pledged to provide modern weaponry to counter-terrorism forces and expressed his desire for development and lasting peace in Balochistan, the statement read.\n\n“Balochistan is close to my heart,” the president said, adding that he wanted “to see every child of Balochistan in school”.\n\n“Enlightening children with modern technology is the need of the hour,” he was quoted as saying.\n\nPPP Chairman Bilawal Bhutto-Zardari was also a part of the meeting attended by Balochistan Chief Minister Mir Sarfraz Bugti and provincial ministers.\n\nPresident Zardari and Bilawal later also met with members of parliamentary parties in Balochistan, according to a separate statement issued by the Presidency.\n\nOpposition leaders in the Balochistan Assembly and parliamentarians from various political parties presented their concerns and proposals regarding public welfare and the province’s challenges.\n\nAccording to the Presidency, President Zardari highlighted during the meeting that he had a special connection with the people of Balochistan. He emphasised that national solidarity must be upheld to take the country forward.\n\nThe president assured that all rights would be granted to the people. “We do not believe in taking away rights but in winning the hearts of the people by granting them their due,” he was quoted as saying.\n\nHe added that all efforts for the welfare and prosperity of Balochistan would yield positive results, with “decisions being made that would be remembered in history”, the Presidency said.\n\nThe president also said that he would set up a special camp in Balochistan after Eidul Fitr to listen to public grievances and suggestions.\n\nA day ago, the Parliamentary Committee on National Security had emphasised the urgent need to implement counterterrorism frameworks — the Nat­ional Action Plan and Vision Azm-i-Istehkam — to curb terrorism, as Army Chief Gen Asim Munir pointed to governance gaps as a key reason behind the spike in terrorism and called for making Pakistan a “hard state”.\n\nThe communique also emphasised the need for unity and political resolve to face the threat of terrorism with the full strength of the state, calling for a national consensus in the fight against terrorism.\n\nPrime Minister Shehbaz Sharif had similarly called for national unity and dialogue against the menace of terrorism in the country in a visit to Quetta last week after the attack.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/19183434fbed2fd.jpg",
  "retrievedAt": "2025-08-25T15:17:21.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898968/president-zardari-urges-need-to-win-war-against-terrorism-during-quetta-visit",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T14:33:38.000Z"
}
