{
  "title": "Turkish university cancels Istanbul mayor’s degree - World - DAWN.COM",
  "author": null,
  "content": "ISTANBUL: A Turkish university said on Tuesday that Istanbul’s opposition mayor Ekrem Imamoglu — already the target of a clutch of court cases — falsely obtained his university degree.\n\nIstanbul University said the degrees of 28 graduates including Imamoglu — a major rival of President Recep Tayyip Erdogan — “will be withdrawn and cancelled on the grounds of... obvious error”, it said on X.\n\nThe ruling could deprive him of the chance to challenge Erdogan for the presidency — an office which requires a higher education degree. Imamoglu, who is in his second term as mayor of Turkey’s largest city, is likely to fight the decision in court.\n\nMurat Emir, lawmaker from Imamoglu CHP party, said: “This decision has dealt a heavy blow to our democracy.” The mayor’s office published a photocopy of a business management diploma which Imamoglu received from Istanbul University in 1995 after a journalist claimed he did not have one.\n\nThe opposition mayor is the subject of multiple investigations and court cases in the run up to presidential elections in 2028.\n\nRegularly targeted by Erdogan, who was also a mayor of Istanbul, Imamoglu was sentenced to two years and seven months in jail and banned from political activities in 2022 for “insulting” members of Turkiye’s High Electoral Committee, a sentence he has appealed.\n\nA vocal opponent of the president, Imamoglu denounced what he termed judicial “harassment” in January on leaving an Istanbul court where he had been questioned as part of an investigation opened after criticism of the city’s public prosecutor.\n\nIstanbul University said it was sending documents to the Istanbul prosecutor’s office as well as the high education council.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:42.743Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898867/turkish-university-cancels-istanbul-mayors-degree",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:29:45.000Z"
}
