{
  "title": "Trump admin overstepped authority in immigration crackdown, experts say - World - DAWN.COM",
  "author": null,
  "content": "New York: The Trump administration has likely exceeded its authority in invoking rarely applied laws to justify parts of its wide-ranging immigration crackdown, legal experts said.\n\nStill, the Supreme Court could ultimately determine if the White House has the far-reaching power it claims to decide who should be deported. President Donald Trump, a Republican, has drawn pushback from Democratic lawmakers and civil rights groups for deporting alleged Venezuelan gang members to El Salvador by citing a wartime law from 1798, and for trying to deport a lawful permanent resident under an untested statute passed in 1952.\n\nIn both cases, the administration likely overstepped its statutory authority and is vulnerable to being overturned by courts, said immigration lawyer David Leopold. “These are unilateral, factual determinations made by the executive,” Leopold said in an interview on Monday.\n\nThe Trump administration over the weekend invoked the 18th-century Alien Enemies Act, which gives the president the authority to detain and deport foreign citizens during times of war, to deport 238 alleged gang members.\n\nThe administration asserted that the gang, Tren de Aragua, was invading the United States, justifying their deportations under the law, which was enacted to combat spying and sabotage during tensions with France. But US District Judge James Boasberg in Washington temporarily blocked any deportations under the Alien Enemies Act, writing that the law refers to hostile acts perpetrated by another nation.\n\nThe alleged gang members were flown to El Salvador nonetheless, potentially setting up a constitutional clash. Boasberg’s ruling came in response to a lawsuit brought by the American Civil Liberties Union, which said the Trump administration’s invocation of the law would deprive people in immigration detention of due process rights because they would not be able to challenge the determination that they are “alien enemies.”\n\n“They are just making stuff up,” said Michael Gerhardt, a law professor at the University of North Carolina. Scott Anderson, a fellow with the Brookings Institution think tank, said the Supreme Court in 2015 declined to endorse the idea that the executive branch had exclusive authority over foreign affairs.\n\nFree speech fight\n\nSimilarly, the statute used by the Trump administration to justify the immigration detention of Columbia student Mahmoud Khalil appears to have been used only once before, according to legal experts. Lawyers for Khalil, a green card holder of Palestinian descent, have said the arrest was retaliation for his participation in pro-Palestinian protests and violated his rights to free speech as guaranteed by the First Amendment to the US Constitution.\n\nThe administration has justified his detention under a provision of the 1952 Immigration and Nationality Act stating that any immigrant may be deported if the secretary of state determines that their activities or presence in the U.S. could pose adverse foreign policy consequences. Trump has, without evidence, accused Khalil of supporting Palestinian group Hamas.\n\nThe provision has been tested just once before, legal experts said. In 1995, the statute was used to detain Mario Ruiz Massieu, a former assistant attorney general of Mexico.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:24.554Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898862/trump-admin-overstepped-authority-in-immigration-crackdown-experts-say",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:29:45.000Z"
}
