{
  "title": "Sugar prices should not exceed Rs164 per kg, says Deputy PM Dar - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister Ishaq Dar on Wednesday said that retail sugar prices should not exceed Rs164 after the Competition Commission of Pakistan (CCP) warned sugar mills against price manipulation.\n\nContrary to the rates announced by the prime minister as well as several attempts by the government to maintain retail sales at Rs130 per kg, sugar prices in the markets continue to soar above Rs180 per kg in various markets across the country.\n\nSugar consumption is forecast to increase slightly to 6.7 million tonnes as it has continuously grown due to the population growth and demand from the food processing sector.\n\nDuring the last season, Pakistan produced more than 6.84m tonnes of sugar, which is expected to rise in 2024-25.\n\nSpeaking to journalists, the deputy prime minister said that according to news reports, there was a spike in sugar prices to Rs178 -179, “which is obviously not tolerable” to the prime minister.\n\n“So yesterday we had a late night meeting so we could conclude this matter — so we can together find a viable way in which a common citizen can find relief and he doesn’t have to hear talks of [sugar prices] reaching Rs180 to Rs200,” he said.\n\n“And we reach a reasonable price where you don’t suffer losses either — [so] a subcommittee is being made for the numbers which Rana Tanveer sahab [minister for national food security and research] will head.”\n\nDar said the committee will work until April 19 to determine costs and provide feedback on the sugar mills claims — that they were not responsible for the price hike of the commodity.\n\nHe also added that they needed to work on a system so that the “common man can have cheaper sugar … but for that we would need a distribution channel and an implementation mechanism is necessary”.\n\nOn Federal Board of Revenue (FBR)’s sales tax on sugar, he said that it would be charged at Rs154 to 155 — with the price cap at Rs159.\n\nHe said that the government will work to gather intelligence reports, along with the CCP, which will also collect data.\n\nGiven this alleged massive siphoning from the consumers, the CCP had stated that it was closely monitoring the ongoing sugar crisis and warned that strict enforcement and policy actions will be taken if any anti-competitive activities are found.\n\nThe CCP has been working to curb cartelisation in the sugar industry, promoting fair competition and protecting consumers.\n\n“We need to ensure a two tier system and if the government is satisfied that we can implement the two tier system, the advantage will be that the common man can get sugar at a cheaper price,” Dar said.\n\nThe CCP inquiry launched in 2020 revealed that sugar mills were prima facie engaged in price-fixing and controlling supply through coordinated actions facilitated by the Pakistan Sugar Mills Association (PSMA).\n\nAs part of the investigation, the CCP also conducted raids and imposed Rs44 billion in penalties on sugar mills and the PSMA in August 2021, one of the highest fines in its history.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/19124837966d7c8.jpg",
  "retrievedAt": "2025-08-25T15:17:23.661Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898925/sugar-prices-should-not-exceed-rs164-per-kg-says-deputy-pm-dar",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T09:02:33.000Z"
}
