{
  "title": "Italy finds six bodies, 40 missing after migrant shipwreck - World - DAWN.COM",
  "author": null,
  "content": "Six people died and 40 are missing after a migrant shipwreck in the Mediterranean, the United Nations said on Wednesday, as Italian authorities searched for survivors off the island of Lampedusa.\n\n“Still too many dead in a new shipwreck in the Mediterranean,” Chiara Cardoletti, the Italy representative of the UN refugee agency UNHCR, said on X.\n\nAn inflatable dinghy carrying 56 people had left the Tunisian port of Sfax on Monday before getting into trouble, she said.\n\n“After a few hours of sailing, the dinghy began to deflate and take on water. Six bodies recovered. 40 missing,” she wrote.\n\nItaly’s coastguard and police pulled 10 people to safety — six men and four women — a UNHCR spokesperson told AFP, adding that they are scouring the area for survivors.\n\nThose rescued said there had been 56 people on board from the Ivory Coast, Mali, Guinea and Cameroon.\n\nThe dinghy was reportedly found partially deflated off the tiny rocky outcrop of Lampione, to the west of Lampedusa, which lies closer to North Africa than Europe.\n\nSurvivors, who are receiving psychological support, said some of the missing had fallen overboard in rough seas, according to the i news agency.\n\nAfter the migrants were rescued, a separate group of 40 migrants landed on Lampedusa after travelling from Sfax in metal boats, the ANSA news agency said.\n\nThere were five landings in Lampedusa on Tuesday with a total of 213 migrants, bringing the number of people at the island’s reception centre to 230, it said.\n\nAround 8,743 migrants have arrived in Italy so far this year, slightly more than in the same period last year, according to Italy’s interior ministry.\n\nFar-right Prime Minister Giorgia Meloni has adopted a tough stance on migrants, vowing to stop arrivals, which are down sharply on 2023 figures.\n\nThe country is the first port of call for many people who make the perilous journey on small boats from North Africa to Europe.\n\nAccording to the International Organization for Migration, 140 people have died or gone missing while attempting the crossing so far this year.\n\nMeloni’s flagship plan is to outsource migrant processing to Albania — a non-EU country — and speed up repatriations of failed asylum seekers.\n\nBut the scheme, which is being closely watched by Europe, has run into several legal hurdles and the purpose-built centres in Albania currently stand empty.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:21.299Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898958/italy-finds-six-bodies-40-missing-after-migrant-shipwreck",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T12:22:56.000Z"
}
