{
  "title": "FPCCI develops charter of economy - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Federation of Pakistan Chambers of Commerce and Industry (FPCCI) has developed a comprehensive Charter of Economy to foster political consensus for an effective strategy to address challenges.\n\nThe charter was presented to Finance Minister Muhammad Aurangzeb in a meeting on Tuesday, seeking to free the country from its economic calamities by prioritising its development and growth, particularly to meet the needs of the growing population, especially the youth, who form the core of Pakistan’s demographic structure.\n\nSenator Noman Wazir Khattak provided a de­­tailed presentation on the proposals and recommendations outlined in the Charter of Economy. The key recommendations in­­cluded reorganising specialised civil services and establishing dedicated groups in critical sectors such as energy, finance, industry, and health to lead policy formulation and ensure informed decision-making.\n\nThe charter also called for embracing solar and wind energy, seen as the cheapest sources of power, and proposed keeping wheeling char­ges for the Competi­tive Trading Bilateral Con­tract Market (CTBCM) at a maximum of Rs4 per KWh.\n\nIt was also emphasised a greater focus on regional trade and development financial institutions, with proposals for at least 20pc of lending directed toward long-term CAPEX and 10pc toward startup CAPEX.\n\nA stable exchange rate was recommended to support exports and discourage imports that do not comply with the Pakistan Standards and Quality Control Authority (PSQCA). The charter also stressed the importance of a uniform gas pricing structure for industries across the country to promote industrial growth.\n\nFurther recommendations included transferring ownership of State-Owned Enterprises (SOEs) to employees, allowing them to manage these enterprises or privatise them, and converting their pension funds into equity. It was proposed strategic reforms on various fronts, including debt management, trade partnerships, tax compliance, energy efficiency, and the exploitation of mineral resources. It also called for a progressive taxation model for agriculture, better governance structures, pension and welfare reforms, digitalisation, and improvements to the bankruptcy laws in Pakistan.\n\nFinance Minister Muhammad Aurangzeb welcomed the FPCCI delegation and praised their efforts in preparing a comprehensive and timely charter of economy, noting that such initiatives are crucial at this juncture, even when political parties agree on a common set of economic goals.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:57.945Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898844/fpcci-develops-charter-of-economy",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:09.000Z"
}
