{
  "title": "Why Sindh’s farmers are up in arms over the Cholistan canal project - Pakistan - DAWN.COM",
  "author": null,
  "content": "Among the crowd of students gathered on the Indus Highway on March 4, Saqlain Sindhi’s voice was the loudest. “Darya-e-Sindh par daaka dala jaraha hai (Indus River is being robbed),” he bellowed. As president of the Jeay Sindh Students Federation (JSSF), Sindhi has spent years rallying students, farmers, and labourers, organising protests against policies that threaten the River Indus. But the fight had never been as urgent as it was now.\n\n“The Green Pakistan Initiative is an assault on our river which is vital to our identity, culture, and very existence. This is about our land, our generations to come, and our survival,” Sindhi asserted, speaking to Dawn.com.\n\nDiljan Laghari, vice-president of JSSF-Arisar, also protesting the scheme which aims to construct canals on the Indus river, expanded on this sentiment: “Sindh thrives on agriculture — our economy depends on it. If the Indus river is drained and our water disappears, so does our livelihood. We refuse to let that happen.”\n\nTheir words reflect the collective frustration simmering among the youth in Sindh.\n\nThe protest was organised weeks after the inauguration of the Cholistan project by Punjab Chief Minister Maryam Nawaz and Chief of Army Staff Gen Asim Munir on February 15, with thousands of protesters marching along the Indus Highway on March 4. Sindhi and Laghari were among the many who took to the streets in Jamshoro, joining students and activists from nationalist student groups.\n\nWhat began as a peaceful protest soon spiralled into chaos as security forces baton-charged and lobbed teargas shells to disperse the demonstrators, turning it into yet another battle for the river unfolding on its own soil.\n\nLaunched last month with three business franchises in Cholistan, the Green Pakistan initiative, Sindhi argued, “masks the systemic erosion of our heritage under the guise of progress and development”.\n\nThe Green Pakistan Initiative (GPI), spearheaded by the federal government, hinges on a network of six newly developed canals that will channel water from the Indus river to irrigate Punjab’s Cholistan region. It is being touted as a bold step towards food security and rural upliftment, transforming barren lands through modern farming techniques.\n\nWith a three-pronged approach — a Green Agri Mall, a Smart Agri Farm, and an Agri Research and Facilitation Centre — the plan promises farmers cutting-edge support and aims to maximise crop productivity.\n\nAs per the scheme, the 176km-long Cholistan canal, which is a core element of the project, will draw water from Punjab’s existing Rasul-Qadirabad, Qadirabad-Balloki and Balloki-Sulemanki (RQBS) link canals at a staggering cost of Rs211.34 billion. The aim is to cultivate a new command area in southern Punjab by irrigating 1.2 million acres in two phases — 455,000 acres in Phase I and 744,000 acres in Phase II.\n\nBut what is being hailed as a game-changer for Punjab has triggered an uproar in Sindh, where stakeholders fear the project will siphon away their water rights.\n\nAt the centre of the debate is the Sukkur Barrage, a critical component of Sindh’s irrigation system, which supplies water to 8.2 million acres of farmland through seven main canals spanning over 5,800 kilometres. Among them, the Nara Canal (592.7 km) and Rohri Canal (334.26 km) extend deep into Sindh, reaching districts like Badin and Mirpurkhas. The barrage also supplies water to Balochistan via the North Western Canal (NWC), which is reflective of its regional significance.\n\nAs the lower riparian province, Sindh contends that these allocations are already extensive and further diversions could cripple its existing irrigation system. Its largest Nara canal’s designed discharge is 13,649 cusecs — almost half of what RQBS’ existing capacity is. Given Punjab’s RQBS will inevitably receive more water than the largest canal in Sindh ever could — why draw from Sindh’s share at all?\n\nSindh also points out that the plan, reliant on flows from the Sutlej River — a tributary of the Indus that feeds the Cholistan Canal — depends entirely on surplus releases from India, since the river was surrendered under the Indus Water Treaty of 1960. However, with the Sutlej virtually dry, authorities have resorted to an extraordinary measure: manually pumping water from other rivers to sustain the diversion. This spells trouble ahead.\n\nHow much of Sindh’s irrigation supply will be compromised? Even a modest reduction in Sukkur’s discharge could disrupt this balance, threatening water availability in tail-end regions already facing acute shortages.\n\nConsequently, Sindh has expressed reservations over the project’s reliance on the Indus river. In January 2024, Sindh’s caretaker Chief Minister Maqbool Baqar questioned the issuance of its certification, voicing concerns to the then caretaker Prime Minister Anwaarul Haq Kakar.\n\nIn November last year, Sindh Chief Minister Syed Murad Ali Shah opposed the plan as well, arguing that the Indus River System Authority (Irsa) lacks the mandate to approve it, given that it has no allocation under the 1991 Water Accord and that the project threatens Sindh’s already limited water supply. The contentious water project, challenged by Sindh to protect its permanent water interests, was presented before the Council of Common Interests (CCI) in 2023 and 2024. However, a final decision on the matter remains pending.\n\nToday, opposition to the project has intensified. Just last week, heated debates erupted in the Sindh Assembly as lawmakers clashed over the project before unanimously passing a resolution demanding “an immediate halt to all plans and activities related to the construction of the canals.” CM Murad called for a dialogue among provincial stakeholders to ensure inter-provincial water justice and warned against unilateral diversions. “Sindh’s people have a rightful claim over these rivers,” he stressed.\n\nMany activists, lawyers, farmers, and students have also joined the chorus of concern, cautioning against the far-reaching repercussions of the plan.\n\nWith tensions at their peak, critical questions emerge: Why the outrage? What is it about the initiative that has set ablaze such resistance? Who truly benefits from this move and at what cost to those who have relied on the Indus for sustenance for centuries?\n\nZulfikar Ali Bhutto Jr, an environmentalist who refers to the Indus river as the “Maa” (mother) of Sindhis, has disparaged the very premise of the project, terming it reckless in the face of worsening water scarcity. He said that the Indus is running dry and Sukkur Barrage is witnessing one of the driest years on record, warning that diverting the Indus’ water through these new canals suggests draining nearly 20,000 cusecs of water when only 18,000 cusecs remain after Sukkur Barrage. “This means we will go into a minus,” he told Dawn.com.\n\nAccording to Zulfikar Jr, the very authorities driving the plan forward are the ones sounding the alarm on an impending drought. “They are fully aware that Sindh is on the brink of a severe water crisis, yet they continue to authorise diversions that will only accelerate depletion,” said Zulfikar Jr.\n\nNaseer Memon, a consultant on climate change induced natural disasters, echoed this sentiment, saying the government’s indifference to water shortage was evident. “To put it in perspective: Guddu Barrage can sustain about two million acres of land. Given that over six million acres in Cholistan are to be irrigated in the future, the water requirement would be three times what the barrage can supply. The question is — where will this water come from?” he said.\n\n“We simply don’t have enough water,” he highlighted. “Canals remain in drought phases, the dams are steadily shrinking, and for over two decades, Irsa has consistently declared water shortages. The numbers don’t lie either. The average discharge downstream of Kotri has plummeted from 40.69 million acre-feet (MAF) between 1976-1998 to just 14.035 MAF from 1999-2023.”\n\nAs of Saturday, Dawn.com reported that Mangla Dam had officially hit its dead level of 1,050 feet, reducing its ability to supply irrigation water to Punjab and Sindh. Tarbela Dam is not far behind, with its water level dangerously close to its dead level of 1,402ft, standing at 1,405.10ft. The Chashma Reservoir, too, is on the verge of depletion, sitting at 639.20ft, a mere inch away from its dead level of 638.15ft.\n\nThis acute shortage threatens millions of acres of farmland, putting crops like wheat and sugarcane at severe risk. Consequently, Irsa has warned the two provinces — the country’s main breadbaskets — to prepare for up to a 35 per cent water shortage for the remainder of the Rabi season.\n\nAs upstream diversions intensify, they will starve the Indus Delta — the region where the river meets the sea — hastening seawater intrusion and decimating fragile ecosystems. Beyond this, the controversial project carries a dangerous ripple effect, exacerbating water woes in Sindh’s parched cities.\n\nWith urban populations swelling, the demand for municipal, industrial, and commercial water is increasing at an equal pace. Karachi alone depends on the Indus for 85pc of its water primarily sourced from Keenjhar Lake, which is fed by the Indus, while Hyderabad, Larkana, and Sukkur rely on it entirely.\n\nHowever, the worsening scarcity isn’t just an issue of supply — it’s also a public health disaster waiting to unfold. Karachi, Hyderabad, and Sukkur — already crippled by chronic shortages — face a spike in pollution levels as drinking water becomes increasingly toxic.\n\nAccording to the Water and Sanitation Agency (Wasa), Hyderabad’s water carries 790 milligrams per litre of Total Dissolved Solids (TDS), exceeding the World Health Organisation’s (WHO) 500mg/l threshold. This is a result of shrinking faucet flows in the Indus and unchecked pollution.\n\nEnvironmental expert Memon explained that as natural river water shrinks, the river loses its ability to cleanse itself, leading to a surge in contamination levels. Constructing more canals upstream will further deprive Kotri Barrage — the source of drinking water in urban centres — of the water needed to dilute contaminants, risking a full-blown health crisis in Karachi, Hyderabad, Tando Mohammad Khan, and Badin.\n\nThe dangers of toxic water are tragically familiar. In 2004, Hyderabad saw a devastating outbreak when as many as 55 people lost their lives, and around 6,000 were hospitalised after consuming contaminated water. With worsening water shortages, the risk of another public health disaster looms large.\n\nThe Ravi and Sutlej, overloaded with agriculture runoff and industrial waste, are on the verge of becoming entirely unfit for human consumption. “Millions in Karachi and Hyderabad will be forced to drink poisoned water,” he cautioned.\n\nThe crisis threatens to dismantle entire ways of life. As rivers dry up and land becomes unsuitable for farming, communities that have depended on these waters for generations find themselves at risk of losing their cultural identity.\n\n“Initially, the government was championing the plan as ‘cooperative farming’, presenting it as an inclusive approach to agriculture. They have now tactfully altered their language, terming it ‘corporate farming’ — because that is exactly what it is — a profit-driven, exploitative model of agriculture,” said Zulfikar Jr. He alleged that the federal government is actively seizing lands from farmers in Punjab, Sindh, and Balochistan, to integrate them into these irrigation networks.\n\nAccording to Zulfikar Jr, farmers, zamindars, and labourers rely on the existing local system which, as imperfect as it may be, manages to sustain the local population. “Now, instead of feeding our own people, this water will irrigate cash crops that can be exported to countries such as China and Saudi Arabia. This project is not for Pakistanis. Let’s be absolutely clear about that,” he stated.\n\nZulfikar Jr was referring to reports that Pakistan is courting $6 billion from Saudi Arabia, the UAE, Qatar, and Bahrain over the next three to five years to revolutionise its agriculture sector. The aim is to bring 1.5 million acres of unused land under cultivation and upgrade 50 million acres with advanced mechanisation to usher in a new era of corporate farming.\n\nIn November 2024, the federal government revealed that only 8.2 million acres of land in Sindh is cultivated compared to more than 30 million acres in Punjab. Against this backdrop, it is important to note that as 18 million acres of land in Sindh remain uncultivated, its water is being diverted to irrigate just 1.2 million acres in Punjab.\n\nEighteen million acres left barren — to water just one. Let that sink in.\n\n“What do you think will happen then? Farmers will be pushed off their ancestral lands — in southern Punjab, in Sindh, in my hometown, Larkana. And this is not simply a default consequence of the plan; it is deliberate, engineered dislocation,” said Zulfikar Jr.\n\nHe added that the displaced haris (farmers) will have no choice but to migrate to urban slums, where they will struggle to find employment. Their traditional way of life will be erased. “This is cultural genocide of a people,” he said.\n\nAs a matter of fact, the slow death of Sindh’s fertile lands began several years ago. Seawater intrusion has ravaged Thatta and Badin, regions once renowned for rice and wheat cultivation. They have now turned barren due to increased soil salinity. Over 1.2 million people — mostly small-scale farmers and fisherfolk — have been uprooted as their lands turn uninhabitable. A study by the Sindh Development Institute estimates that 70pc of the delta’s agricultural land is no longer viable for conventional farming.\n\n“They want zamindars to abandon their lands and lease new land at a minimum of 5,000 acres. That’s the size of the Defence Housing Authority (DHA) in Karachi. But most zamindars own 500-600 acres — even the wealthiest waderas do not have 5,000 acres,” he explained. Their goal is to force traditional landowners out of the picture and turn poor farmers into migrant labourers working on land that has been made foreign to them, he claimed.\n\nIn a similar vein, Dr Riaz Shaikh, dean of the Faculty of Social Sciences at Szabist, questioned the true intent behind such grand infrastructure projects. His concern underscores a pattern seen elsewhere: land development projects initially presented as solutions for local populations often end up displacing them instead.\n\n“Today, we’re talking about irrigating the land, tomorrow it could easily morph into something else — perhaps a highway slicing through the desert, followed by commercial ventures and farmhouses,” he warned.\n\nShaikh sees this as yet another “anti-people project” with no input from those most affected. “At the very least, follow international standards. At the very least, ask the people of Cholistan if they agree. But they’re absent from this debate. We are at the mercy of those in power,” he lamented.\n\nHammad Naqi Khan, director general of WWF-Pakistan (WWF-P), also criticising the blind embrace of corporate farming, said that everything ultimately boils down to elite capture. “On the one hand, fertile farmland is being swallowed up by luxury housing schemes, golf courses, and weekend retreats. On the other, farmers are being driven further from their livelihoods. Both, direct consequences of the plan. How can we justify this?” he said, pointing out the misplaced priorities of the decision-makers.\n\nThe land, the rivers, and the traditions tied to them are now collateral damage in the pursuit of an elaborate scheme that will pick profit over people each time, he reinstated.\n\nMemon focused on the aspect of deepening poverty as projects with corporate interests at the expense of those at the margins are pushed forward. “The Indus Delta is already on its last breath. This will be the final nail in its coffin. Visit the region, observe the conditions people live in and you’d think you have stepped into the 16th century.”\n\nA United Nations Development Programme (UNDP) survey on multidimensional poverty reported that in districts such as Sujawal, Thatta, and Badin, nearly 80pc of people live in extreme poverty.\n\n“Their livelihoods are gone. Their health is deteriorating. There is no life for them. And now, this scheme will take away even the last drops of water they rely on.” He called it a great human tragedy.\n\n“Almost half of the water comes from glacier melt, and the rest from the rains, primarily monsoon rains. But both lifelines are becoming dangerously unreliable,” WWF-P’s Khan explained, adding that glaciers are melting at an accelerating rate, unleashing floods in one season and leaving parched riverbeds the next. Meanwhile, erratic monsoons swing between extremes — bringing either heavy downpours or droughts. “We are a water-stressed country, yet we continue to mismanage our most precious resource,” he warned.\n\n“At WWF-P, we say ‘no river stretch should run dry.’ That is a basic environmental principle,” he asserted. But the Indus is being choked at its source. With reduced freshwater flows, the sea will further creep inland, swallowing fertile land and poisoning what remains, he stated.\n\nAs a consequence, Khan mentioned that there is potential for further loss of mangrove forests — Pakistan’s natural coastal defenders and a breeding ground for marine life. “It’s scientifically established that mangroves require estuaries, the junction where both freshwater and seawater mix, to grow. But with the Indus running dry and failing to replenish these critical ecosystems, the forests will inevitably wither. As they die out, coastal erosion will accelerate, leaving communities vulnerable to tsunamis, storms, and cyclones,” he emphasised.\n\nEqually concerned about the increasing threat of climate change-induced disasters, Shaikh said that mangroves, which produce 10 times more oxygen than an average tree, are vanishing. “Without them, we are exposed”. He added that Sindh’s coastal agriculture, once abundant with premium papayas, bananas, and chikoos, is already in decline.\n\nMoreover, said Shaikh, fishermen along the delta cast their nets into waters that no longer breathe. The river’s flow has weakened, and with it, the oxygen that sustains marine life. As the fish disappear and the nets come up empty, centuries-old coastal communities are forced to abandon their homes and relocate, in pursuit of water that no longer reaches them, he lamented.\n\nMemon concurred. “There are numerous species that depend on mangrove forests as nurseries. Because of the shortage of freshwater flows, the fish species, and the whole aquatic ecosystem, will collapse along with the mangroves.”\n\nZulfikar Jr, also the founder of Bulhan Bachao, an organisation which works on wildlife conservation through community engagement, cautioned that we’ll be staring at an ecological disaster of unimaginable scale, especially when it comes to the extinction of species like the Indus River dolphin.\n\nThe Indus River dolphin, found nowhere else in the world, could be among the first to disappear if the project moves forward. Around 90pc of its population thrives in the very waters that will be siphoned away, he explained. “Over the years, these creatures have navigated the river despite the perils they’ve faced. But they cannot navigate a world without water.”\n\nAs a water engineer and environmentalist working in the field for around 30 years, Khan said that it saddens him to see decision-makers prioritising such costly infrastructure ventures, rather than addressing the underlying issues within the existing system. “Instead of moving ahead, let’s take a step back,” he suggested.\n\n“Take our agricultural yields — whether it’s cotton, rice, or wheat. We don’t even need to compare our output with superpower countries like China or the US; let’s simply take India’s example. The geographical location is the same, the land is the same, yet we lag far behind. So, if the land itself isn’t the limiting factor, what systemic inefficiencies are holding us back?” Advocating for a glass-half-full outlook, he stressed that this is a reflection of our untapped potential — proof that there is still potential.\n\nHe stated that provincial agricultural departments, which should be guiding farmers on best practices, conducting research, and ensuring sustainable land use, remain underperforming and unaccountable. According to him, without strict oversight and reforms, even the most ambitious projects will fail to deliver meaningful, tangible results.\n\nKhan emphasised that policymakers must reassess cropping patterns, tailor decisions based on those assessments, and hold those in charge responsible. “But all we do is throw around buzzwords like ‘corporate farming’ and pursue projects that do more harm than good”.\n\nFor him, the discussion needs to shift to overlooked nature-based solutions and alternatives, which offer far more sustainable and cost-effective results. He builds on three key points: strategic land-use planning, innovative water management, and maximising existing resources.\n\nProper land-use planning, he said, is the foundation of responsible development. “We need to define clear zones for housing, agriculture, industry, and environmental protection. Without this, we will continue to see fertile agricultural land disappear under unchecked urban sprawl, while marginalised areas are expected to sustain large-scale projects with little regard for feasibility.”\n\nSecondly, he underscored the potential of aquaculture and forestry as viable alternatives, particularly in degraded lands. “Look at the blackish water in parts of Cholistan — rather than dismissing it as useless, we should explore what kind of crops can thrive there. Can we grow salt-tolerant crops? Can we use it for aquaculture? What about agroforestry? Can we cultivate tree species that can be harvested in six years for timber or biodiesel?” Khan insisted that these are the questions the government needs to ask before deciding to pour billions into unsustainable projects.\n\nLastly, he called for enhancing existing irrigation systems within canal command areas. “If food security is the real concern behind corporate farming, why aren’t we first improving the way we irrigate our crops? There is ample opportunity to optimise agronomic practices on the land we already have — if only we choose to look in that direction.”\n\nWe already have a troubled situation across all provinces. The people are fuming everywhere, said Memon.\n\nSpeaking in the context of Sindh, he warned that a huge political movement is taking root. “If you follow Sindhi media, channels, newspapers — you’d know that every single day brings fresh strikes, demonstrations, and riots. Yet, most mainstream media outlets are barely giving it the coverage it deserves.”\n\n“When that happens, what sentiment do you think it creates? Think politically. Think of relationships between people and between provinces. What is already strained is being further damaged, and this is a dangerous sign for the federation,” he expressed.\n\nMemon brought attention to the fact that the impact of the project will not be exclusive to Sindh; southern Punjab, too, will experience a perpetual water shortage. “Cholistan is already a poverty-stricken region, and its people will not see any economic relief from this initiative. In a corporate farming model, the benefits are reaped solely by private companies and it’s important to not lose sight of who your fight is really against,” he said.\n\nKhan echoed this concern. “A farmer sitting at the tail end of Punjab shares a similar fate with a farmer based in Sindh. He doesn’t get water either — not even through perennial canals. Both of them survive by pumping whatever little water they can,” he said.\n\n“I don’t want to make this a Punjab vs Sindh issue because it really isn’t,” Zulfikar Jr noted too, aware of how easily the outrage against resource exploitation can be conflated with hostility against a specific province. He cautioned to steer clear of narratives that can be reduced to a provincial rivalry.\n\n“I want to see a united, happy, and equal Pakistan, and this project, to put it as simply as I can, is a slap in the face of the unity of our federation,” he concluded.\n\nHeader image: Awami Tehreek activists stage a rally against the construction of new canals to draw additional water from Indus River. —PPI",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/19122307afefed8.jpg",
  "retrievedAt": "2025-08-25T15:17:25.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1897446/why-sindhs-farmers-are-up-in-arms-over-the-cholistan-canal-project",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T07:23:52.000Z"
}
