{
  "title": "IHC judge irked over surprise transfer of Imran legal access case - Pakistan - DAWN.COM",
  "author": null,
  "content": "Justice Sardar Ejaz Ishaq of the Islamabad High Court (IHC) initiated contempt proceedings on Wednesday after discovering that a case under his jurisdiction — concerning ex-premier Imran Khan’s right to meet with his lawyer — had been transferred to a larger bench without his knowledge or consent.\n\nThe IHC administration had yesterday constituted a three-member larger bench — headed by newly appointed Acting Chief Justice Sardar Sarfraz Dogar — to hear all 26 petitions related to the visitation rights and jail conditions of Imran.\n\nAs the orders in one such petition were not followed, Imran’s lawyer Mashal Yousufzai sought contempt proceedings against Adiala Jail Superintendent Abdul Ghafoor Anjum. The case was heard last week by Justice Ishaq.\n\nHowever, the cause list for the case presided by Justice Ishaq — set to resume on March 21 — was cancelled by the IHC registrar’s office due to the larger bench’s formation, it emerged during a hearing today.\n\nYousufzai, her counsel Advocate Shoaib Shaheen and Imran’s spokesperson Niazullah Khan Niazi appeared before the court.\n\nIn a separate development, the petitions clubbed together were fixed for hearing before the larger bench for tomorrow.\n\nThe bench, led by Justice Dogar and including Justices Arbab Muhammad Tahir and Muhammad Azam Khan, will hear the pleas, which include Yousufzai’s contempt case.\n\nAll 26 petitions — including contempt of court applications against Anjum — were transferred to the larger bench on the Adiala Jail official’s request, which cited logistical challenges in appearing before multiple benches.\n\nIn one such petition filed by Yousafzai, Justice Ishaq had directed the authorities to produce the PTI founder before the court. However, citing security concerns, the directive was not complied with.\n\nThe judge later assigned court clerk Sakina Bangash to visit the jail and verify whether Imran had been denied access to his legal counsel. Bangash, however, was unable to meet the ex-PM, leaving the key questions unanswered. This issue was also to be addressed by the larger bench.\n\nAs the hearing began in the morning, Justice Ishaq summoned the court’s Deputy Registrar (judicial) Sultan Mehmood and the Islamabad advocate general at 11am to seek the reasons for the cause list’s cancellation.\n\n“Are you involved in whatever has happened?” Justice Ishaq asked the advocate general. When Mehmood arrived, the judge asked him, “On whose directives did you cancel the cause list?”\n\nThe deputy registrar replied, “We were issued instructions by the [IHC] chief justice’s office, which said that a larger bench has been formed so you may cancel this case’s cause list.”\n\nThe judge then asked him under which law was the “miscellaneous application for the case transfer” filed. “Does the state support transferring a case without the [presiding] judge’s will?” he further asked.\n\n“Instead of doing this, you could have planted explosives in my courtroom’s foundations and blown it up,” Justice Ishaq remarked, expressing his displeasure.\n\nNoting a failure to “settle basic questions”, the judge lamented how the country would progress if the courts were deliberating upon the same fundamentals “every 10 years”.\n\n“There is no greater folly than the economy making progress without implementation of the law,” he observed.\n\nJustice Ishaq went on to stress that it was not a matter of his “personality or authority but of the high court’s respect”. “Would the public’s belief in the justice system be maintained in this manner?” he asked rhetorically.\n\nAt this point, Yousufzai’s lawyer Shaheen said that the state and the jail superintendent were not even the affected parties in the case. “What justice would we get tomorrow?” the PTI lawyer said.\n\nYousufzai herself said that if this was happening to them outside prison, who knew what the PTI founder and his wife Bushra Bibi were going through in jail.\n\nTo this, Justice Ishaq replied: “You are talking about that? We here are worried about our institution. A guided missile was heading towards you; now it is approaching us.”\n\nThe judge then sought written replies from both the deputy registrar and the Islamabad advocate general over the case transfer and the subsequent cancellation of the cause list.\n\n“Does the chief justice have the authority to transfer a case pending before a judge to another judge without their consent?” Justice Ishaq asked.\n\n“Let’s suppose there is a very corrupt chief justice in the future. Will he have the authority to transfer the case in this way?” he wondered. “If a party has three cases, can the ongoing case be transferred if he requests the chief justice?\n\n“Are you opening the doors to corruption and nepotism?” Justice Ishaq asked, adding that it was synonymous with misleading the court of justice.\n\n“It is not in the IHC rules that [without] the judge’s will, the chief justice transfers the case,” the judge observed. He warned: “Whatever you are doing by making this [matter] an issue of ego will tear apart this high court.\n\n“If the state has decided that they have to win an ego war, then there is no point of me sitting here,” the IHC judge said, highlighting that the court’s top judge was also bound by the law and could not act on his whims.\n\n“Is the judge beholden to the registrar’s office? Will the office decide whether the judge should hear the case or not? Will the cause list decide how the court delivers justice?” Justice Ishaq wondered.\n\nTo this, the deputy registrar (judicial) replied: “We sent the matter to the chief justice’s office for instructions and were told to transfer the case to a larger bench.”\n\n“The proceedings before the larger bench are being held in contempt of the proceedings of this court,” Justice Ishaq noted.\n\n“The real accountability of judges is the public. When the public sees this, they will say that if there is a case against powerful people, the judges are helpless and only the chief justice can hear [the case].”\n\nThe judge said that he was taking action to resolve all these questions.\n\n“The public should know that the judges of the high court will not tolerate this encroachment on the independence of the judiciary,” Justice Ishaq asserted.\n\n“It upset me last night that this matter has reached this point,” he said.\n\n“You have gone so far that the commission has not met for a minute,” Justice Ishaq said to the deputy registrar. “You have decided that even centuries-old traditions have to be abolished.”\n\nSubsequently, the case was adjourned till tomorrow (Thursday).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/19160136b23985c.jpg",
  "retrievedAt": "2025-08-25T15:17:23.511Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898952/ihc-judge-irked-over-surprise-transfer-of-imran-legal-access-case",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T12:17:39.000Z"
}
