{
  "title": "Only 35 lawmakers turn up as pre-budget debate in Sindh Assembly continues - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Lethargic attitude and apathy towards the pre-budget discussion by most of the treasury and opposition members haunted the Sindh Assembly as hardly 35 members turned up to attend the sitting on Tuesday.\n\nAs many as 17 of them participated in the discussion amid continued disorder with Deputy Speaker Anthony Naveed repeatedly telling the lawmakers to maintain order in the thinly attended house as many of them chatted with each other turning their back to the chair.\n\nOnly 24 members were present in the house when proceeding began. Some of the members immediately left the house after delivering their speeches, while a female member from the treasury benches even moved around using her mobile phone and having a chit-chat with fellow members.\n\nWhile the opposition members complained of water shortage and poor civic infrastructure in their respective constituencies, the treasury members focused more on the issue of six new canals and achievements of Pakistan Peoples Party-led provincial government.\n\n17 members of opposition and ruling parties raise water, health and infrastructure issues in their constituencies\n\nThe situation turned tense occasionally as some of the speeches also contained harsh criticism, jibes and allegations instead of suggestions and proposals for the upcoming budget.\n\nPPP’s Qasim Siraj Soomro said that there was a need to make pilot programs in health more effective, adding that cardio-vascular diseases units should also be established in Nagarparkar. “There is one NICVD unit in Mithi but it is two hours away,” he added.\n\nHe demanded allocation of funds for water supply line in Thar, so that drinking water could be provided to all areas including Mithi.\n\nMuttahida Qaumi Movement-Pakistan member Ijazul Haq criticised the provincial government and said the civic and road infrastructure across the province, including Karachi, was in a highly dilapidated condition.\n\nThe MPA from Orangi Town said that he belonged to Asia’s biggest slum and the provincial government seemed to have decided not to provide water to the people of Orangi.\n\nThe MQM-P lawmaker said that even 10 per cent of the uplift projects had not been completed.\n\nProvincial Minister Shahina Sher Ali said that there was a tradition here that “when you are in the opposition, you make smoky speeches”.\n\nShe said that the PPP had a clear stance on the issue of new canals on the Indus River. “We have clearly said that we will not allow canals to be built,” she said.\n\nMQM-P’s Faheem Ahmed mainly focused his speech on an interest-free economy, asking the provincial government to eliminate interest-based system in the province. “This province cannot develop with an interest-based economy,” he added.\n\nPPP’s Imtiaz Sheikh paid rich tributes to Health Minister Azra Pechuho for laying a network of hospitals across the province. He said that Tharparkar was generating the cheapest electricity in Pakistan. “Our roads and highways are excellent,” he added.\n\nHe also said that the PPP did not want canals to be built. “The new canals will lead to hatred among provinces,” he apprehended.\n\nPakistan Tehreek-i-Insaaf-backed Sunni Ittehad Council member from Lyari also lambasted the provincial government for ignoring his constituency and alleged that “massive corruption had been rampant in the Lyari General Hospital for the past many years” and the provincial government and health minister appeared helpless.\n\nHe said that there was an acute shortage of water in Lyari. “There is no electricity and gas either,” he deplored and asked the provincial government to resolve the problems of his constituency.\n\nOther members who spoke on the occasion were PPP’s Arif Khan Mehar, Jameel Soomro, Adil Altaf Unnar, Arbab Amir Amanullah, Riaz Shah Shirazi and Sarfaraz Hussain Shah, MQM-P’s Mazahir Hussain, Rana Liaqat, Shaikh Abdullah, Naseer Ahmed and Bilqees Mukhtar.\n\nNo new canal will be allowed: Sharjeel\n\nTalking to media persons at the Sindh Assembly Media Corner, Sindh Senior Minister Sharjeel Inam Memon said that the Pakistan Peoples Party and the Sindh government will not under any circumstances allow any canal to be constructed on the Indus River, adds APP.\n\nHe emphasised that the message is clear: no matter what happens, canals will not be allowed to be built.\n\nHe stated that all parties in the Sindh Assembly have unanimously passed a resolution against the construction of canals. “A team of journalists will be sent after Eid to observe firsthand the work being done on the canals,” he said.\n\nHe said that national issues concerned the entire nation, and in every difficult situation, unity was essential.\n\n“According to evidence available with security agencies, India is behind acts of terrorism in Pakistan,” he said, adding that on October 18, 2007 hundreds of PPP workers were attacked by terrorists but despite this, the party had never been shy of condemning terrorism publicly and always raised its voice against terrorism.\n\nHe went on to say that even today, Khyber Pakhtunkhwa chief minister cannot go to his constituency, and the police force is not in a position to patrol the streets at night.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:05.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898828/only-35-lawmakers-turn-up-as-pre-budget-debate-in-sindh-assembly-continues",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:24.000Z"
}
