{
  "title": "Prime suspect confessed to police about Mustafa Amir’s murder, Karachi ATC told - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Judge extends Armaghan’s physical remand for fifth time\n• Suspect involved in heated exchange with his father over new attorney\n• Media barred from witnessing proceedings\n\nKARACHI: The prosecution in the Mustafa Amir murder case claimed before an anti-terrorism court (ATC) on Tuesday that prime suspect Armaghan Qureshi had recorded his confessional statement before an SSP admitting to having killed the 23-year-old youth in January.\n\nArmaghan, who was produced before the ATC-IV judge, said he wanted to confess his guilt. However, Special Public Prosecutor Zulfiqar Ali Arain submitted that the suspect had already recorded his “confessional statement” before a senior police officer under Section 21-H (conditional admissibility of confession) of the Anti-Terrorism Act.\n\nAlso, the ATC extended the prime suspect’s remand for the fifth time.\n\nAccording to remand papers, the IO informed the court that since the suspect claimed to have told his father about the incident and his father allegedly advised him to go into hiding, the police needed to interrogate Kamran Asghar Qureshi.\n\nHe added that a USB, laptop, and other devices had been sent for forensic analysis to the Punjab Forensic Science Agency (PFSA) in Lahore, and he was awaiting the results.\n\nHe further submitted that other agencies, including the Federal Investigation Agency, Anti-Narcotics Force, and a special committee formed for the investigation, were also interrogating the suspect.\n\nOn the other hand, the defence counsel, Tahir-ur-Rehman, opposed the IO’s request and pleaded that the suspect be sent to jail in judicial custody.\n\nDuring the remand proceedings, the situation became tense when Kamran Qureshi asked his son Armaghan to sign the vakalatnama of Advocate Khurram Abbas.\n\nHowever, upon his son’s refusal, an altercation broke out between them as a result Kamran Qureshi shouted in the courtroom which led the security staff to escort him out of the premises.\n\nAfter hearing both sides, the court extended the suspect’s physical custody till March 24 and directed the IO to submit a medical examination report in three days through the medical superintendent of a government hospital, as the suspect had complained of maltreatment before the court.\n\nOn Tuesday reporters were not allowed to enter the ATC premises by security staff, who claimed that they were following directives to restrict “unauthorised or irrelevant persons” from entering the judicial complex.\n\nHowever, acting Prosecutor General Muntazir Mehdi told Dawn that they did not restrict media personnel from entering the ATC premises. “Today, it was the police who restricted reporters on their own,” he said.\n\nHe added that in the last hearing, the suspect’s father misbehaved with the prosecutor, but the police did nothing to handle the situation. During Tuesday’s proceeding, he pointed out that journalists were standing outside the ATC while the suspect’s relatives were inside the court premises.\n\nThe prosecutor general explained that they had written to the registrar regarding security and the reason was that the suspect’s father tends to create trouble there.\n\nA day earlier, the prosecutor general office had directed the ATC registrar to arrange security measures and restrict “unauthorised or irrelevant persons” from entering the judicial complex on a request by special prosecutor Arain claiming that the father of Armaghan had abused and threatened him with dire consequences within court premises.\n\nAfter obtaining physical custody in the Mustafa Amir case, the suspect, Armaghan, was produced before the ATC administrative judge by IO Aamir Altaf.\n\nThe case pertained to Armaghan allegedly opening fire on a journalist and injuring him within the jurisdiction of the Bahadurabad police station in November 2024.\n\nAfter the hearing, the court remanded him in police custody for seven days also on grounds for further interrogation, recovery of alleged weapons and to collect CCTV footage.\n\nThe court directed the IO to conduct the investigation “strictly in accordance with the law and ensure that the accused is not subjected to any undue coercion or maltreatment”.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:03:04.917Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898826/prime-suspect-confessed-to-police-about-mustafa-amirs-murder-karachi-atc-told",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:24.000Z"
}
