{
  "title": "Mengal rues Balochistan’s deprivation - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan National Party president, Sardar Akhtar Mengal, has emphasised the importance of Balochistan for Pakistan stating the province was the most resource-rich in the subcontinent.\n\nIn an open letter posted on X (formerly Twitter), he said was “ironic” that many people think Balochistan was limited to Gwadar.\n\n“Even if you take Gwadar out, Balochistan is still the most resource-rich province in the subcontinent,” he said.\n\nHowever, the state’s narrative has kept this truth away from the people, Mr Mengal alleged.\n\nHe went on to highlight the natural resources of Balochistan, pointing out that it is the region where gold and copper lie buried in the lands of Reko Diq, worth trillions of dollars.\n\nIf these resources were in the hands of the Baloch people, they might be among the wealthiest in the world today.\n\nMr Mengal also said that treasures were being extracted from Saindak mines, but locals were deprived of even basic necessities of life in their own province.\n\nBalochistan, he added, is the land that gave Pakistan natural gas, fueling the entire country’s industries and economy, but many homes in Balochistan are still without this facility, with stoves cold and children freezing to death in winter.\n\nHe also emphasised that Balochistan gave Pakistan access to sea, Gwadar port and the China-Pakistan Economic Corridor, which benefits the entire country’s business community.\n\nHowever, the fishermen of Gwadar still needed permits to fish in their own sea and they were struggling to earn a living, Mr Mengal claimed.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:02:42.959Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898871/mengal-rues-balochistans-deprivation",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:38:42.000Z"
}
