{
  "title": "Women humiliated by bus operators over fare dispute in Sargodha - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: In a dispute over overcharging, the bus staff forcibly removed women passengers from the vehicle, subjected them to violence and threatened them with consequences.\n\nTaking notice of the incident, District Police Officer (DPO) Muhammad Sohaib Ashraf sought a report, which triggered action by Jhawarian police.\n\nConductor Shamsher was arrested, while raids are underway to arrest the other suspects.\n\nDeputy Commissioner retired Capt Muhammad Waseem directed RTA Secretary Malik Muhammad Tahir to take immediate action.\n\nThe vehicle was impounded at the police station. Action has been initiated against the transport owners.\n\nCRIMES: As Eidul Fitr approaches, incidents of theft and robbery have surged across the city.\n\nIn one incident, robbers drugged a passenger at the railway station and looted him. In another, a jeweler Zaheer Ahmed was robbed of gold worth over Rs2.5 million. He was intercepted by a gang near Trust Plaza after he arrived from Lahore via 47 Bus Stand.\n\nFactory Area police registered a case after four days and launched a search for the culprits.\n\nFIRE: A house in Satellite Town suffered damage worth millions after a discarded cigarette ignited a pile of husk beside the building.\n\nThe fire spread rapidly but was contained by Rescue 1122, preventing major destruction.\n\nThe incident occurred behind a private hospital, raising concerns over fire safety in residential areas.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:44.606Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898757/women-humiliated-by-bus-operators-over-fare-dispute-in-sargodha",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:19:31.000Z"
}
