{
  "title": "Pakistan establishes diplomatic ties with Federated States of Micronesia - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan and the Federated States of Micronesia have formally established diplomatic relations to open up avenues for bilateral cooperation.\n\nThe Federated States of Micronesia are an island nation located in the western Pacific Ocean that joined the United Nations in 1991, according to the UN’s website.\n\nBoth countries’ permanent representatives to the UN signed an agreement at a ceremony in New York, the Pakistan Mission to the UN said in a press release on Thursday.\n\n“Ambassador Asim Iftikhar Ahmad, Permanent Representative of Pakistan to the UN, and Federated States of Micronesia’s counterpart, Ambassador Jeem S. Lippwe, signed a joint communiqué to formalise the relationship between the two countries,” the Pakistan Mission said.\n\nAddressing the ceremony, Ambassador Ahmad noted: “The relations would open up avenues for cooperation in the field of human resource management, capacity building and climate change.”\n\nBoth Missions would “work closely on key matters, especially promotion of international peace and security” at the UN, the envoy highlighted.\n\nHe praised that the development came on Pakistan’s Independence Day anniversary and that it was the 100th country to forge ties with Micronesia.\n\nAmbassador Lippwe “expressed his happiness on the start of a new chapter in bilateral relations”, according to the Pakistan Mission statement.\n\nWhile thanking Pakistan for extending support to his country, the ambassador said he “looked forward to working closely with his Pakistani counterpart to strengthen [the] bond of friendship”.\n\nThe Mission statement noted that Ambassadors Ahmad and Lippwe held a brief meeting before the ceremony, where they discussed “matters of mutual interest, including possible areas of cooperation both bilaterally as well as at the UN”.\n\nThe signing ceremony was attended by the two countries’ diplomats, including Deputy Permanent Representative to the UN Ambassador Usman Jadoon.\n\nIn Dec 2024, Pakistan joined a coalition spearheaded by small island Pacific states to push for a new treaty focused on managing an equitable phase-out of fossil fuels and financing a global just transition away from the threat of coal, oil and gas production.\n\nPakistan was the first South Asian state to engage with this group to “understand the contours of the proposal for a Fossil Fuel Treaty, aimed at fairly winding down fossil fuel production”.\n\nThe 16-strong group has members across four continents, including Vanuatu, Tuvalu, Tonga, Fiji, the Solomon Islands, Niue, Antigua and Barbuda, Timor-Leste, Palau, Colombia, Samoa, Nauru, the Marshall Islands, the Federated States of Micronesia, Pakistan, and the Bahamas.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/15125322a119be0.jpg",
  "retrievedAt": "2025-08-25T15:18:18.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1931044/pakistan-establishes-diplomatic-ties-with-federated-states-of-micronesia",
  "dateList": "2025-03-19",
  "date_published": "2025-08-15T08:24:39.000Z"
}
