{
  "title": "Orthodox Jews threaten to bring down Netanyahu coalition - World - DAWN.COM",
  "author": null,
  "content": "BNEI BRAK: One of Israel’s most divisive domestic issues has reared itself again to challenge Prime Minister Benjamin Netanyahu, after a group in the ruling coalition said it would bring the government down unless it exempts ultra-Orthodox Jews from army service.\n\nSome members of United Torah Judaism, one of two ultra-Orthodox Jewish parties in the coalition, said in a letter that they would vote against the budget if the government did not pass a new law formalising exemptions for religious students. “If this matter is once again sidelined or delayed for any reason, we will not be able to continue as partners in the coalition,” said the March 6 letter signed by Housing Minister and party chairman Yitzhak Goldknopf and two others.\n\nThe government must pass the budget by the end of the month or call snap elections. United Torah Judaism holds seven seats in the Knesset, Israel’s parliament. It is too early to predict the consequences. Netanyahu, Israel’s longest-serving prime minister, is a proven master at smoothing over disagreements in his coalitions. An ultra-nationalist group that quit the government over the ceasefire in Gaza in January announced on Tuesday it was returning.\n\nBut pollster Mitchell Barak, who worked for Netanyahu in the 1990s, said this time ultra-Orthodox politicians appeared unwilling to compromise, and the prime minister might have to look outside the coalition for support to pass the budget, an extraordinary step.\n\n“He’s going to look for someone who can compromise, save him, and be that ‘freyer’,” he said, speaking before the ultra-nationalists announced their return to the coalition and using a Yiddish word for someone who lets others take advantage of him. “That’s how he operates.”\n\nMilitary strained\n\nIn Israel, military service is mandatory at age 18, after which Israelis become reservists liable to be called up for training or deployment. But dating back to Israel’s founding in 1948 it made an exemption for ultra-Orthodox communities, known as Haredim, whose young men mainly dedicate their lives to studying religious texts in academies known as yeshivot.\n\nThose communities were initially small but have grown rapidly in the following decades. According to government data, there are now 1.4 million Haredim, accounting for about 14 per cent of the population, deepening resentment among other Israelis who are conscripted.\n\nIn 2017, the Supreme Court ruled that the exemption was unconstitutional, and last year it ordered the military to conscript yeshiva students. Legal experts say the only way to restore the exemption would be to pass a new law enshrining it. Members of the Haredi community say they would resist any attempt to conscript their children.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:38.679Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898857/orthodox-jews-threaten-to-bring-down-netanyahu-coalition",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:29:45.000Z"
}
