{
  "title": "Gates warns White House he can’t replace US government - World - DAWN.COM",
  "author": null,
  "content": "LONDON: Bill Gates is personally lobbying Trump administration officials to keep funding health programs worldwide, from childhood vaccination to HIV treatment, and warning that his foundation cannot step in to fill gaps, two sources familiar with the matter said.\n\nGates, the billionaire Microsoft co-founder turned global health philanthropist, met with the National Security Council as well as Republican and Democratic lawmakers in recent weeks to press that case, the sources said.\n\nSoon after his January 20 inauguration, President Donald Trump moved to dismantle the US Agency for International Development, cutting more than 80 per cent of contracts and freezing billions of dollars for everything from emergency food assistance to malaria prevention.\n\nThe Trump administration, led by the State Department, is reviewing what kinds of foreign aid will remain under its America First policy, with a list of around 30 global health projects for consideration, one of the sources said.\n\nBill was recently in Washington DC meeting with decision makers to discuss the life-saving impact of US international assistance and the need for a strategic plan to protect the worlds most vulnerable while safeguarding Americas health and security, said a spokesperson for the Gates Foundation, his charitable organisation.\n\nGates told the officials he met with that his foundation cannot replace the role of the US government, the sources said. Gates Foundation directors have also said publicly that no foundation has that capability.\n\nAt the same time, many Gates Foundation top priorities like eradicating polio and fighting malaria will be hit by the US pullback.\n\nPublished in Dawn, March 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:17:39.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1898858/gates-warns-white-house-he-cant-replace-us-government",
  "dateList": "2025-03-19",
  "date_published": "2025-03-19T01:29:45.000Z"
}
