{
  "title": "PM seeks transparent, faceless customs system",
  "author": null,
  "content": "ISLAMABAD, Aug 26 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday directed the relevant authorities to ensure transparency by integrating the customs inspection and assessment system with modern technology and making it faceless.\nHe said that the purpose of improving and modernizing the customs system was to facilitate businessmen associated with exports and imports while simultaneously increasing national revenue.\nChairing the progress review meeting on faceless appraisal of customs, the prime minister also issued special directives to minimize the time duration of the administrative procedures required for customs inspection and assessment.\nFor the effective implementation of customs system reforms, all relevant institutions should work in harmony and under an integrated strategy, the prime minister said adding that enhancing business and investment through economic and trade reforms was among the government’s top priorities.\nThe prime minister stressed that in reforms of the customs system, every possible benefit should be derived from international best practices and feasible strategies.\nThe government and all relevant institutions, he said were determined to achieve the goal of national economic development, prosperity, and improvement in trade and investment.\nHe also directed to entrust the authority of hearing appeals filed by businessmen against customs assessments should to impartial officers.\nThe prime minister instructed to make organized planning to handle the increasing volume of cargo at ports and ensure its swift dispatch in such a way that goods move from the port to their destination at the earliest.\nHe also said that immediate necessary steps should be taken to make the appeal system against customs assessments transparent.\nThe meeting was briefed on the steps taken so far in customs inspection and assessment.\nIt was informed that an Artificial Intelligence–based risk management system will soon be operational.\nThe use of AI in inspection through customs scanners is reducing the time required for customs clearance.\nDue to effective government actions against smuggling, the illegal transportation of goods has decreased, and the number of goods cleared through the formal legal customs system has increased, the meeting was informed.\nThe meeting was further told that work was ongoing to take all necessary steps to make the customs inspection and assessment system faceless.\nMinister for Finance Muhammad Aurangzeb, Minister for Climate Change Dr. Musadik Malik, Minister for Information and Broadcasting Attaullah Tarar, Minister for Economic Affairs Division Ahad Khan Cheema, Minister of State for Finance Bilal Azhar Kayani and senior government officials attended the meeting.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-26T11:17:14.485Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-seeks-transparent-faceless-customs-system/",
  "dateList": "2025-08-26",
  "date_published": "2025-08-26T08:46:00.000Z"
}
