{
  "title": "NA speaker wants Punjab to constitute agriculture committee",
  "link": "https://www.app.com.pk/national/na-speaker-wants-punjab-to-constitute-agriculture-committee/",
  "date_published": "2020-08-18T03:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 18 (APP):Acting Governor Punjab Chaudhry Pervaiz Elahi met National Assembly (NA) Speaker Asad Qaisar at Governor’s House here on Tuesday and discussed with him parliamentary affairs, measures to promote agriculture in the country and matters of mutual interest.\nThe NA speaker stressed the need for promoting the agriculture sector in the country and asked the acting governor Punjab, who’s also the Punjab Assembly speaker, to constitute an agriculture committee in the provincial assembly on the pattern of the National Assembly, so that the farm sector could be established on modern lines in the country.\nHe said Ch Pervaiz Elahi was himself an agriculturist; he was well aware of the issue facing the sector and, therefore, his input and feedback in that regard would be a valuable contribution.\nHe urged the need to facilitate farmers and traders so that the agriculture sector could serve as the backbone of the country’s economy, adding that there was need for the center and provinces to work in close collaboration for uplift of the farm sector.\nThe acting governor Punjab, Chaudhry Pervaiz Elahi, said assured the NA speaker that the Punjab Assembly would adopt the guidelines outlined by Asad Qaisar and form a committee soon. He said that agriculture sector was the largest contributor to the GDP growth of Pakistan, adding that there was a lot more to be done to achieve the best results in the sector in Punjab.\nCh Pervaiz Elahi regretted the fact that the past regimes did not work for promotion of the agriculture sector during the past 10 years and ignored it badly. He said the Punjab chief minister was already working for betterment of the agriculture sector in the province, adding that the proposed agriculture committee would help streamline the farm sector in the province.",
  "retrievedAt": "2025-08-11T19:40:50.557Z"
}
