{
  "title": "CM for evolving plan to transfer staff working at same station for more than two years",
  "link": "https://www.app.com.pk/national/cm-for-evolving-plan-to-transfer-staff-working-at-same-station-for-more-than-two-years/",
  "date_published": "2020-08-18T03:19:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 18 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan has directed all the ministers and secretaries to chalk out a comprehensive plan for transfer of staff working at same station at the same post for more than two years.\nPresiding over a meeting here Tuesday with Provincial Ministers, Advisors, Special Assistants, Chief Secretary, Additional Chief Secretary, Senior Member Board of Revenue and Administrative Secretaries, the CM directed for a plan fortnightly.\nThe transfers of the officials should be made both at provincial and district levels, he added.\nThe transfer of any official should be final and any recommendation for readjustment on the same post should be discouraged, he categorically stated.\nHe also advised to prepare lists of personnel in black & white on the basis of their performance, reputation and personal conduct.\nThe lists of personnel should be categorized on the basis of their conduct, performance and reputation that included black, gray and white.\nThe Administrative Department should start taking action against the staff falling in the gray and black list, he added.\nNo Tehsildar and Patwari should be posted in their own Tehsil and area, he added.\nHe stated that all departments should work on policy for e-transferring that will bring about a visible transparency in the transfer, posting of staff.\nMinisters should regularly review and monitor the performance of their departments in order to ensure improving the performance of their departments, he directed.\nThe Chief Minister stood committed for efficient style of governance in the province at all costs adding that all pre-requisites required for good governance would be put on place wherever required without any discrimination.\nMahmood Khan congratulated the Cabinet on the successful completion of two years of the provincial government and hoped that the style of quality and people-friendly good governance will be replicated and even further improved in the coming years.\nHe also congratulated the Cabinet over the successful completion of BRT project and approved the Ehsas Nashonoma Program as pilot project by Health Department linking it with the Benazir Income Support Program.\nThe pilot project was initially launched in Khyber and Malakand districts. Under this program, food supplement will be given to mother and child for about two and a half years.\nThe CM said that Provincial Cabinet had approved Khyber Pakhtunkhwa Power Crushers Rules 2020 which had been early directed by him in the Secretaries Committee meeting wherein he had clearly directed to frame rules under all acts enacted by the provincial assembly.\nThe new rules included the renewal of licenses and working out modern processing and mechanism.\nSimilarly, the cabinet clearly laid down the procedure that the new rules will be governed by a clear mechanism and power crushers will not be allowed to set up their plants in urban areas up to 500 meters while in rural areas up to 300 meters.\nThe cabinet was also briefed about the situation of wheat and flour throughout the province. The Cabinet was informed that the supply of wheat is being increased to 1 million metric tons through PASCO and import while the daily quota of mills will be increased from 2000 metric tons to 3000 metric tons.\nThe cabinet in the wake of corona pandemic gave exemption to the health department for necessary procurement from KPPRA Act 2012.\nThe Health Department sent a summary to the Chief Minister for revocation of exemption due to normalcy of corona situation.\nNow the procurements will be carried out in accordance with normal procedure. The chief minister agreed to the summary and had directed bringing the summary to provincial cabinet for clearance and the cabinet cleared it.\nThe Provincial Cabinet cleared the Khyber Pakhtunkhwa Police Amendment Bill 2020 for onward tabling in the Provincial Assembly.\nUnder the bill, a regular quota of 5% has been fixed for the recruitment of children of police martyrs.\nThe seniority of all such recruitees, the sons of martyrs will be determined by the date of martyrdom of their fathers.\nA quota of 20% will go to the graduate constables and head constables who are bound to pass the competitive examination of Police Service Commission.\nThe 50% quota of the head constable would be through the DPC and 25% quota will be allocated for the direct recruitment. All those quotas will be subject to the approval of the Provincial Assembly.\nThe Provincial Cabinet has approved in principle the Khyber Pakhtunkhwa Local Government Coordination Unit Rules 2020. Under these rules, the authority for delimitation has been dissolved as per decision of the Supreme Court transferring this power to the Election Commission.\nThe provincial cabinet approved the construction of Category B Hospital of Tehsil Headquarters Matta and Children’s Hospital in Swat District through Frontier Works Organization.\nThe Provincial Cabinet agreed to the proposal appointing Justice Ijaz Anwar Honorable Judge of Peshawar High Court as member labour appellate tribunal. The provincial cabinet has approved the upgradation of the post of Assistant Registrar of Cooperative Department from Grade-16 to Grade 17, Inspector’s post from Grade-11 to 16 and Sub-Inspector’s post from Grade-7 to 11.\nThe provincial cabinet has directed that all upgradation cases should be rooted through the committee formed in the Finance Department and these up gradations should not come to the cabinet next time.\nThe provincial cabinet approved an increase of 10 percent in the cost of approved schemes to 15 percent as according to the Planning Commission’s manual; it can be increased up to 15% while the Financial Power Rules 2018 has shown an increase of up to 10%.\nThe Provincial Cabinet approved the said amendment in the Financial Power Rules 2018 so that it could be done as per the Manual of the Planning Commission.\nThe Provincial Cabinet approved the appointment of Chief Executive Officer for Water and Sanitation Companies of Mardan and Kohat.\nThe meeting also approved the appointment of Raziuddin Khan as Additional Advocate Swat. The Cabinet also approved the appointment of Syed Kamran Shah, a Grade-21 officer, as the Managing Director of Lissaail-e-WalMahroom. The provincial cabinet also agreed to give additional charge to Ajmal Khan Wazir of Anti-Terrorism Court Mingora, the additional responsibility for the Buner Anti-Terrorism Court.\nIn the meeting, re-consitution of medical transplantation authority under health department was also approved.\nThe new non-official members included Dr. Ahmad Nawaz, Dr. Syed Mubeeb Shah, Dr. AamirGhafoor, Dr. Ibrar Hussain, Dr. Nisar Ahmad and Dr. Sohail.",
  "retrievedAt": "2025-08-11T19:40:59.983Z"
}
