{
  "title": "Pakistan’s direction set towards welfare state in last two years: PM",
  "link": "https://www.app.com.pk/national/pakistans-direction-set-towards-welfare-state-in-last-two-years-pm/",
  "date_published": "2020-08-18T18:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Prime Minister Imran Khan on Tuesday said his biggest achievement in the last two years of government was setting Pakistan’s direction towards becoming a welfare state.\n“If someone asks me what I did for the country during my tenure, I will say that I have set its direction right to realize the dream of its forefathers,” the prime minister said in an interview with senior journalist Kamran Khan at Dunya News television channel.\nImran Khan said Pakistan came into being to implement the concept of an Islamic welfare state, in line with the principles of State of Medina with an objective to uplift the downtrodden and weaker segments.\nHe said his tenure as prime minister was the ‘biggest struggle of his life filled with challenges’, including crashed economy, foreign debts and power crisis.\n“From sports to politics, my entire life is all about struggle. Even in government, I confronted the challenges with a spirit to never give up,” he added.\nAs regards the economic instability, the prime minister said the current account deficit of $20 billion was the biggest challenge as it caused currency devaluation. Corrective measures were taken to bring it down to $3 billion.\nOne of the steps was to squeeze the expenditures for economic stability, he said, adding currently the government had achieved the balance of primary budget.\nRegarding the energy crisis, Imran Khan said Pakistan was generating the most expensive electricity due to the power contracts inked by the previous governments for kickbacks.\nThe recent agreement of his government with Independent Power Producers (IPPs), he said, would help overcome the problems of power sector. The future of industries in the country was linked with cheap electricity generation.\nHe said the government was also working on public sector power plants and a comprehensive power policy would be revealed in two weeks.\nAbout the coronavirus pandemic, the prime minister said the strategy of smart lockdown had helped overcome the challenge.\n“When the vision is to uplift the poor, then there are special blessings from Allah Almighty,” he said, adding many countries, including neighbouring India, had opted for a complete lockdown that increased poverty.\nHe mentioned his Special Assistant on Social Welfare Dr Sania Nishtar, who launched the Ehsaas programme under which financial assistance was given to the poor and deserving regardless of their political affiliations.\nEven the concept behind opening of the construction sector during the pandemic was to provide a window of earning to labourers and daily wagers, he added.Imran Khan said his dream of a ‘New Pakistan’ would not be complete unless the mafias and cartels were eliminated.\n“It is the government’s responsibility to protect the interests of public and it is my mission to fight the mafias,” he said when asked to comment on unchecked price of sugar in the country.\nHe regretted that the elite culture prevailed in the country, where the rich avoided taxes and the businessmen got rebates in the name of exports.\nWhen asked about the involvement of Jehangir Tareen in the sugar crisis being the owner of mills, the prime minister said he was hurt to see his name in the Sugar Inquiry Commission’s report, as he was very close to him and in the forefront of his struggle against the mafias.\nIt was a difficult decision for him since “a leader is always supposed to be Sadiq and Ameen (truthful and honest)”, he added. Making profit by a business was not bad, but profiteering by cartels was not acceptable, he said.\nThe prime minister pointed out that during the forensic investigation, the team led by Wajid Zia was threatened by the Sugar Mills Association.\nHe said it was found that the frontmen of brokers gave very little to the farmers of their produce while maintaining duplicate account books.\nImran Khan said the mafias had the clout and power as they even tried to get a court stay on the Commission’s report.\n“When you take on cartels, they fight back,” he said, adding,“It is the mission of my life to fight the mafias, who do not pay taxes, yet make huge profits.”\nHe said it was discovered that a huge quantity of sugar was being exported to Afghanistan, which did not have such a high demand.\nThere were also reports of sugar being hoarded in Punjab, against which strict action would be taken, he added.\nThe prime minister rejected the recent reports of corruption against the Punjab chief minister about allegedly granting liqour permits for a bribe, saying he had got the matter investigated by an intelligence agency.\n“I got reports from IB (Intelligence Bureau) on Usman Buzdar.\nI wonder as to why NAB (National Accountability Bureau) is investigating. There is nothing in it.”\nImran Khan said,“If I don’t involve in corruption, how can I let any one else in my party or government to mint money illegally.”\nHe said allegations were one-sided as Buzdar was not a media savvy person and did not defend himself at public platforms. “A long list of contenders for the post of chief minister even from within the party” were behind it, he regretted.\nThe prime minister said the performance of Punjab government was ahead of all, citing ease of doing business and construction projects.\nImran Khan said Pakistan would not recognize Israel as a state unless the due rights of Palestinians were acknowledged.\nHe said Pakistan’s role was to get the entire Muslim world united, however, stressed that the country’s foreign policy on Palestine was clear. “On account of the atrocities by Israelis on Palestinians, we as Muslims are accountable before Allah Almighty,” he added.\nThe prime minister dismissed the impression that Pakistan’s relations with Saudi Arabia were getting sour. The Kingdom had helped Pakistan in difficult times.\nHe said Pakistan’s future was linked with China, which was going to become a big financial power.\nThe China Pakistan Economic Corridor (CPEC) was a big opportunity for Pakistan’s economic revival.\nHe said Chinese President Xi JInping, whose had postponed his visit to Pakistan in May due to the coronavirus pandemic, would come in the winters.\nHe regretted that many European countries were supporting India against China.\nPrime Minister Imran Khan said Pakistan had immense potential to become a tourist destination owing to its splendid landscape and diverse culture.\nHe said his vision was to invest in the country’s youth to use them as rich human resource in order to put the country on prosperity.\nHe said construction sector alone had the potential to give a boost to economic activity and mentioned that several incentive packages were given by his government for housing sector.\nThe Prime Minister said Lahore’s River Ravi Urban project and Karachi Bundle Eye would be the mega projects to be built as modern infrastructures in the country’s two major metropolitans.\nHe said the government would also work on gas exploration projects to overcome energy crisis.\nWhen asked about situation of Pakistan International Airlines and Pakistan Railways, he said mismanagement and over-recruitment resulted in debacle of these institutions.\nHe said the inquiry into fake pilot licenses was underway for seven months before it was made public, however, admitted that “presentation of the matter could have been better to avoid fall out and international embarrassment”.\nHe said work on giving separate status to Civil Aviation Authority (CAA) as a regulator was underway in line with the recommendation of Dr Ishrat Hussain’s committee of reforms.\nIn second stage, the modernization of airports would be conducted, he said.\nOn civic problems of Karachi, he regretted that the glory of country’s business hub eclipsed due to absence of local government system for the city.\n“Karachi should have a metropolitan system with its own collection of money as the allocation from Public Sector Development Programme could not be enough for development of such a major city,” he said.",
  "retrievedAt": "2025-08-11T19:40:48.350Z"
}
