{
  "title": "Human rights ministry manages to enact critical legislation in 2 years",
  "link": "https://www.app.com.pk/national/human-rights-ministry-manages-to-enact-critical-legislation-in-2-years/",
  "date_published": "2020-08-18T03:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): The Ministry of Human Rights has managed to enact critical legislation including Zanaib Alert (Response and Recovery) Act for the protection and recovery of children from abuse and also drafted several laws which are in the process of enactment over the past two years.\nThis is reported in a 204-page report, compiled by the Ministry of Human Rights highlighting the government’s achievements and reforms in diverse fields during a period from August 18, 2018 to August 18, 2020.\nIn order to protect and promote Human Rights in Pakistan, legislation was needed at the baseline level for the protection of human rights according to the Constitution of Pakistan and Pakistan’s international commitments.\nUnder the chair of federal minister for human rights, the commission conducted extensive research and produced a comprehensive report in line with the terms of reference laid down by the Islamabad High Court.\nThe report entailed a detailed assessment of the conditions of Pakistan’s Prisons and a gap analysis of Pakistan Prison Rules with Mandela Prison Rules and the Bangkok Rules.\nThe committee is headed by Federal Minister for Human Rights Dr Shireen Mazari with officials from the Ministry of Interior as other members of the committee.\nThe committee under the leadership of Dr Mazari has already carried out a gap analysis by comparing the provisions of the Pakistan Prison Rules and the Bangkok Rules.\nDuring this period, the minister took notice of more than five hundred cases. Most of the cases were resolved. Some high profile cases brought up on media include the case of Hindu girls Reena and Raveena.\nIn August 2019, she wrote a letter to 18 United Nations Special Mandate Holders regarding gross human rights violations in Indian Illegally Occupied Kashmir (IIOJK).\nShe also sent a letter to the United Nations Office for the Coordination of Humanitarian Affairs, urging for the institution of a humanitarian corridor for the provision of emergency food and medical supplies to citizens of IIOJK.",
  "retrievedAt": "2025-08-11T19:41:00.059Z"
}
