{
  "title": "Improving access of vulnerable segments to health facilities is priority of govt: Dr Nausheen",
  "link": "https://www.app.com.pk/national/improving-access-of-vulnerable-segments-to-health-facilities-is-priority-of-govt-dr-nausheen/",
  "date_published": "2020-08-18T03:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Parliamentary Secretary for Ministry of National Health Services, Regulations and Coordination Dr Nausheen Hamid on Tuesday said improving access of people, particularly women and other vulnerable segments, to health facilities is an important priority of the incumbent government led by Prime Minister Imran Khan.\nShe was speaking at a webinar on dissemination of key findings of the Pakistan Maternal Mortality Survey (PMMS) which was organized by the National Institute of Population Studies (NIPS).\nThe objective of the survey was to assess progress on maternal health indicators to help policy makers and organizations to improve health facilities for the population. The PMMS, the first exclusive nationwide survey provides data for the four provinces, Gilgit-Baltistan and Azad Jammu and Kashmir.\nShe said to identify the gaps in services and facilities at national and regional levels, it is necessary to have access to reliable data which enables executing organizations to implement remedial measures.\nThe government, therefore, encourages evidence-based research work to provide a direction.\nThe NIPS, as the only public sector organization at the federal level to undertake research in population matters, has met this need to an extent by regularly conducting the Pakistan Demographic and Health Surveys (PDHS) besides other research studies ranging from quality of health care to nutrition.\nOn maternal mortality, the first and last direct estimate of maternal mortality with a limited sample size was obtained in 2006-07, as a part of PDHS. It is unfortunate that substantive research work in this important area could not be undertaken at national level for more than a decade.\n“Now finally, we have the results of the survey to provide a good insight into maternal complications and morbidities, age-specific mortality rates by region and gender. But more importantly, it provides national level maternal mortality ratio (MMR), a yardstick of progress on Sustainable Development Goals (SDGs).”\nShe said though the MMR has come down to 186 per 100,000 live births compared to 276 in 2006-07 and there has been improvement in relation to other developing countries with high levels of MMR, concerted efforts will be required to bring it down to the target of less than 70 by the year 2030 as prescribed in the SDGs.\nOther factors to be kept in view are the differences in mortality ratios in age groups and among urban and rural areas. The mortality ratio is lowest among women in the age bracket of 20-24 years but more than doubles for older women.\nSimilarly, in rural areas, the mortality ratio is 26% higher compared to urban areas. High number of maternal deaths in some areas apparently reflects inequalities in access to quality of health services. “We will need to focus on such disparities to improve the quality of maternal health.”\nShe said with six-fold increase in our population since independence, there are challenges of socioeconomic development. The situation is aggravated by the urbanization process.\n“The size of the population and the urbanization process obviously place pressure not only on health facilities but also on other development initiatives. But let me assure you that the government is determined to deal with these challenges by prioritizing and ensuring fair distribution of resources.”\nShe said, “We are striving for women to have better access to health facilities for family planning, pregnancy and for neonatal care. Maternity services, antenatal care are part of the Sehat Sahulat Programme of the government aimed at ensuring access of our citizens to good quality of medical services in a swift and dignified manner.”\nThe programme also includes maternal consultancy for family planning, immunization and nutrition to support the underprivileged sections of our population. These steps are in addition to those taken by provincial governments to improve and increase the number of facilities, she added.\nUNFPA Representative Lina Mousa said, “Though COVID-19 pandemic have posed new and considerable challenges for health and population departments to continue the provision essential maternal and newborn healthcare services including family planning, however, the results are encouraging and provide reliable data for policy development and programme planning for maternal and child health.”\nDFID Pakistan Country Director Annabel Gerry said she is proud to support this important study to assess the levels of maternal mortality in Pakistan. An improved access to family planning services is at the heart of United Kingdom’s development agenda in Pakistan.\nShe said, “Accurate data and through our continued technical assistance to Punjab and KP, we will achieve the target of reducing maternal mortality rate in the country.”\nActing USAID Mission Director Clay Epperson said the United States government congratulates Pakistan on its commendable accomplishment in reducing maternal deaths by one-third.\nIt reflects the impact of the partnership between the government of Pakistan, USAID and other development partners, as well as the civil society and private sector to ensure that pregnant women deliver in the presence of a skilled health professional.\nDr Nausheen Hamid appreciated the efforts of individuals and organizations which contributed to the PMMS besides the National institute of Population Studies, Pakistan Bureau of Statistics, National Committee for Maternal and Neonatal Health, Provincial Departments supported by international partners including United Nations Population Fund (UNFPA), Department for International Development (DFID), USAID, ICF International and Bill and Melinda Gates Foundation which facilitated the survey through financial and technical assistance.",
  "retrievedAt": "2025-08-11T19:40:52.883Z"
}
