{
  "title": "‘Tahafuz’, ‘Taleemi Wazaif’ to be launched under Ehsaas in coming months: Dr. Nishtar",
  "link": "https://www.app.com.pk/national/tahafuz-taleemi-wazaif-to-be-launched-under-ehsaas-in-coming-months-dr-nishtar/",
  "date_published": "2020-08-18T02:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Tuesday disclosed that Pakistan’s first shock-oriented precision safety net, “Tahafuz” to cover heavy medical expenditures for the deserving and “Taleemi Wazaif” to benefit five million primary school going children in 148 districts through conditional cash transfers would be launched in the coming months under the umbrella of Ehsaas.\nAddressing a news briefing held here to highlight 15-month long journey of Ehsaas program, she said fighting poverty has always been one of the top priorities of the Prime Minister Imran Khan.\nBased on principles of Islamic ideology similar to those put in place by Prophet Muhammad (PBUH) in Madina, the Ehsaas journey began with its formal launch by the Prime Minister on March 27, 2019.\nEhsaas is transformational for Pakistan, ending the cycle of multidimensional poverty for millions of the poorest people in our country and using 21st century tools to deliver a modern welfare state, she said.\nEhsaas’ poverty reduction strategy currently embodies more than 140 programmes, policies and initiative and being the largest ever social safety and poverty alleviation programme aimed at the extreme poor, orphans, widows, the homeless, the differently abled, the jobless, poor farmers, labourers, the sick who risk medical impoverishment, the undernourished, students from low-income backgrounds and poor women and elderly citizens.\nListing some initiatives under Ehsaas, Dr. Nishtar highlighted that Kafaalat is an unconditional cash-transfer programme that provides monthly payments of Rs. 2,000 and bank accounts for seven million disadvantaged households (100% women) across the country.\nUnder the Rs. 42.65 billion interest free loans programme 80,000 loans are disbursed every month in 100 districts. So far, 844,000 interest free loans (45% women) have been disbursed for small enterprises to graduate the poor out of poverty and set them on the course of economic prosperity.\nLikewise, the Rs. 15 billion Ehsaas Amdan programme is aimed at creating opportunities for the most disadvantaged people through the transfer of small income-generating assets. Launched in 23 disadvantaged districts of Pakistan, the programme will transfer 200,000 productive assets to deserving households (60% women), countrywide. To date, 27,000 assets have been transferred.\nAs part of Mazdoor ka Ehsaas, the Ehsaas Langar scheme has been introduced under an innovative public-private partnership with Saylani Trust feeding more than 600 laborers daily. To date, 12 Langar facilities have been opened nationwide and work on the remaining is quickly underway, she said.\nAbout Ehsaas undergraduate scholarship programme, Dr. Nishtar briefed that Rs 20 billion were allocated for 200,000 scholarships over 4 years to support needy students. This represented a paradigm shift in the government’s scholarship policy.\nThe first round of scholarships for the year 2019-20 has successfully been awarded and Rs. 4.9 billion has been disbursed to 50,700 students all over the country.\nAbout the recently launched Ehsaas Nashonuma, Dr. Nishtar said the nutrition conditional cash transfer programme for mothers and children aims to address stunting in children under two years of age.\nThe programme is rolled out in nine of the poorest districts through 33 Ehsaas Nashonuma Centres providing cash and nutritious food for mothers and children.\nPersons with disabilities form Pakistan’s largest overlooked minority. A new policy for differently abled was announced in June 2019 under the Ehsaas framework.\nWork hinged on eight Ehsaas policy actions for welfare of disabled is currently underway by the government on the fast track basis.\nIn response to COVID-19 induced economic shutdown, Dr. Nishtar said the government allocated Rs. 203 billion within just 10 days of shutdown to deliver one-time emergency cash assistance to 16.9 million families at risk of extreme poverty. Given family size, this represents nearly 109 million people or half the country’s population, representing the largest and most extensive social protection intervention ever in the history of the country.\nEach family receives Rs. 12,000 for immediate subsistence. Digital capabilities established over the past year as part of Ehsaas, were adapted to deliver Ehsaas Emergency Cash.\nFor the first time in the history of the country, Ehsaas stakeholder committees on Orphanages and Labour Expert Group have been put in place to stipulate “Living Standards for Orphanages and Child Care Centres” and “Recommendations to extend labour welfare measures for the informal sector in the country” respectively.\nSince their institutionalization, the two committees have met 13-14 times last year, and after taking stock of the on-ground situation, are close to releasing their respective reports.\nShe said Poverty Alleviation and Social Safety Division (PASSD) is unique since it is the only Division that was purpose-established to deliver Ehsaas, which is the biggest and boldest program ever launched in Pakistan to uplift marginalized people.\nEhsaas is unique because of its scale, policy formulation, well-articulated strategy, multisectoral character, governance and integrity policy, institutional arrangements, monitoring framework and enhanced funding to deliver the programme nationwide.\nDuring the course of the last 15 months, Ehsaas has been richly praised worldwide.\nPost COVID-19, the United Nations Poverty Eradication Alliance was formed and SAPM Sania Nishtar was invited to join as a member. Ehsaas has been profiled at many international events over the last six months, including events hosted by the United Nations, Asian Development Bank, World Bank, United Nation Development Program, UN Women, Oxford Poverty and Human Development Initiative, Harvard Pakistan Forum and SUN Movement.\nAlso, World Economic Forum, Telegraph, World Bank, World Food Programme (WFP) and UNSGSA have all engaged with and deeply appreciated Ehsaas, she added.",
  "retrievedAt": "2025-08-11T19:41:06.904Z"
}
