{
  "title": "Difficult period gone, good times ahead: Shibli Faraz",
  "link": "https://www.app.com.pk/national/shibli-development/",
  "date_published": "2020-08-18T05:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Minister for Information and Broadcasting Senator Shibli Faraz said on Tuesday that for people of Pakistan, difficult period was over now and good times had arrived, which reflected in multiple positive developments of the last week.\nHe was briefing the media persons about two-year performance of the Pakistan Tehreek-e-Insaf (PTI) government along with Foreign Minister Shah Mahmood Qureshi, Adviser to the PM on Finance Hafeez Shaikh, Minister for Planning, Development and Reforms Asad Umar, Minister for Industries Hammad Azhar, Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection Dr Sania Nishtar here.\nThe 204-page report, compiled by the Ministry of Information and Broadcasting, contained the government’s achievements and reforms in diverse fields during a period from August 18, 2018 to August 18, 2020.\nHe said the incumbent regime was presenting its two-year performance to the public which was the essence and basic practice of democracy.\nThe minister said the formation of PTI was based on the thinking of national poet Allama Muhmmad Iqbal and founder of Pakistan Quaid-i-Azam Muhammad Ali Jinnah, which ended the politics of right and left in the country and introduced the politics of ‘right and wrong.’\nUnfortunately, he said, Pakistan became a geographical reality in 1947 but the ideological goals for which it was created could not be achieved so far.\nHe said in past rulers focused on their personal welfare instead of working for betterment of people and the country, but now the masses had rejected this brand of politics.\nThe objective of PTI formation was to serve the masses and make Pakistan an Islamic welfare state on the pattern of the State of Madina based on compassion and justice.\nHe said the motto of the government under the vision of Prime Minister Imran Khan who is personally a pro-poor and hardworking person and believed in across the board accountability, justice, rule of law, merit and transparency.\nTalking about the role of the Ministry of Information and Broadcasting, he said that in the changed international scenario, its responsibility was not only to project the government policies and its achievements but also counter enemies’ propaganda.\n“Our challenge is to fight on the internal and external fronts. The role of our Ministry of Information has become very important as the fifth generation has been launched,” he remarked.\nSenator Shibli Faraz said that certain forces were hell bent to damage the national economy, spread dependency and frustration among the masses but the Information Ministry under the leadership of Prime Minister Imran Khan would counter this propaganda war aggressively.\nThe minister said in the age of digital and social media every Pakistani citizen has become a journalist and will play his or her role in countering enemy propaganda against the nation.\nHe said “every citizen, every journalist and every politician would take part in this war and play their due role in achieving victory. The whole nation is united against the fifth generation war launched by the inimical forces and would repel this aggression above political divides and considerations.”",
  "retrievedAt": "2025-08-11T19:40:48.396Z"
}
