{
  "title": "Even mild Covid-19 cases may provide lasting immunity, shows study",
  "link": "https://www.app.com.pk/national/even-mild-covid-19-cases-may-provide-lasting-immunity-shows-study/",
  "date_published": "2020-08-18T03:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Mild cases of Covid-19 can trigger robust memory T cell responses: an essential part of the immune system, even in the absence of detectable virus-specific antibody responses, said researchers.\nThe study, published in the journal Cell, revealed that memory T cell responses generated by natural exposure to or infection with SARS-CoV-2, the virus that causes Covid-19, may be a significant immune component to prevent recurrent episodes of severe disease.\n“It is critical to determine if exposed or infected people, especially those with asymptomatic or very mild forms of the disease who likely act inadvertently as the major transmitters, develop robust adaptive immune responses against SARS-CoV-2,” said study senior author Marcus Buggert of the Karolinska Institutet in Sweden.\nMost studies of immune protection against SARS-CoV-2 in humans have focused on the induction of neutralising antibodies, Medical Daily reported .\nAccording to the researchers, the antibody responses, however, tend to wane and are not detectable in all patients, especially those with less severe forms of Covid-19.\nResearch in mice has shown that vaccine-induced memory T cell responses, which can persist for many years, protect against the related virus SARS-CoV-1, even in the absence of detectable antibodies.\nUntil now, it was not clear how SARS-CoV-2 specific T cell responses relate to antibody responses or to the clinical course of Covid-19 in humans.\nFor the current study, the research team assessed Covid-19 virus-specific T cell and antibody responses in more than 200 individuals from Sweden across the full spectrum of exposure, infection, and disease.\nDuring the acute phase of infection, the T cell responses were associated with various clinical markers of disease severity. After recovery from Covid-19, SARS-CoV-2 specific memory T cell responses were detectable.\nThe strongest T cell responses were present in individuals who recovered from severe Covid-19.\nThe findings showed that progressively lower T cell responses were observed in individuals who recovered from very mild Covid-19, and family members exposed to the virus.\nIn line with expectations, all 23 individuals who recovered from severe Covid-19 developed both SARS-CoV-2 specific antibody and T cell responses.\nBut surprisingly, SARS-CoV-2 specific memory T cell responses were detected months after infection in exposed family members and in most individuals with a history of very mild Covid-19, sometimes in the absence of SARS-CoV-2 specific antibodies.\nAmong the 31 individuals who recovered from mild Covid-19, almost all had detectable antibody responses (27/31) and developed T cell responses (30/31).\n“Our findings suggest that the reliance on antibody responses may underestimate the extent of population-level immunity against SARS-CoV-2,” Buggert said.\n“The obvious next step is to determine whether robust memory T cell responses in the absence of detectable antibodies can protect against Covid-19 in the long term,” the author noted.",
  "retrievedAt": "2025-08-11T19:41:05.949Z"
}
