{
  "title": "CM Punjab inaugurates double-decker bus service to promote tourism",
  "link": "https://www.app.com.pk/national/cm-punjab-inaugurates-double-decker-bus-service-to-promote-tourism/",
  "date_published": "2020-08-18T03:20:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 18 (APP): Punjab Chief Minister (CM), Sardar Usman Buzdar on Tuesday inaugurated double-decker bus service hoping to promote tourism in the twin cities of Rawalpindi and Islamabad.\nAddressing the inaugural ceremony of the bus service, the CM said that the bus service would boost tourism.\n“Punjab government is taking measures to promote tourism in the province,” he said adding, the Tourism Department is going to establish a tourism institute in Rawalpindi which would launch training programs for youngsters.\nThe Punjab government would provide more buses if needed, he said.\nHe announced that children, elderly and special people would get special concession for travelling in bus service.\nUsman Buzdar further said, “We want to promote tourism across Punjab province and the government will make Bahawalpur to Attock and Kohe Sulaiman to Murree as a tourism hub.”\nUsman Buzdar announced that double-decker bus service would also be launched in Bahawalpur.\nHe further announced that new tourist spots would be created around lakes, forts and other places as the province has immense tourism potential which would be promoted. He said the government would explore new tourist destinations in Jhelum and Chakwal.\nKotli Sattian is a very beautiful area which was not explored, CM said adding, Punjab government would launch a project to connect Kotli Sattian with Narr and Murree which would promote tourism in the area and provide people a new tourist destination.\nTourism activity would also create new job opportunities in the region, he added.\nHe said, the Punjab government was giving special attention to Rawalpindi and several projects of the city was being completed on priority, adding, college which was made institution of higher education is now fully functioning university.\nHe further said, the feasibility report of Nullah Lai project is near completion, adding, Rawalpindi Ring Road project would also be kicked off soon.\nThe urology institute project which was made functional partially would be completed this year, he stated.\nUsman Buzdar assured that Dadocha dam, four parking plazas and Ammar chowk projects would be completed by the incumbent government.\nTalking about different projects announced by the Punjab government for Murree, the CM said, “We are providing funds for resolving a longstanding water shortage issue of the hill station. Kohsar University has been approved. We will upgrade tourist spots of Murree besides up-gradation of tehsil hospital. A police station will also be established to facilitate the tourists.”\nTo a question he said, Punjab government would launch a safe city project for Rawalpindi which would make the entire city a safe area.\nIt is pertinent to mention here that Punjab Tourism Development Corporation Punjab (TDCP) will operate the buses. The main terminal has been set up at Allama Iqbal Park double road.\nIn Islamabad, tourists would visit different tourist spots including Faisal Mosque, Marghrzar Zoo, Daman-e-Koh, Constitution Avenue, Lok Virsa, Pakistan Museum of Natural History and Shakarparian.\nThe objective of the bus service is to promote tourism and invite local and foreign tourists to enjoy culture and visit beautiful places of the twin cities.",
  "retrievedAt": "2025-08-11T19:40:57.920Z"
}
