{
  "title": "Tourism sector completes journey from survival to revival",
  "link": "https://www.app.com.pk/national/tourism-sector-completes-journey-from-survival-to-revival/",
  "date_published": "2020-08-18T03:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): As soon as the government has reopened the tourism sector, it is ready to make comeback on the global arena after a hiatus of almost five months, mulling to roll out a number of initiatives that have been halted due to the coronavirus pandemic.\n“The premier tourism body – Pakistan Tourism Development Corporation (PTDC) – is gearing up to launch all the initiatives, delayed due to closure of the sector in the wake of coronavirus,” a senior officer of the PTDC told APP, while sharing the government’s two years performance in the tourism sector.\nHe said the PTDC had developed ‘Brand Pakistan’ with the help of international experts and would launch it soon to introduce the country as a tourism brand across the globe. Brand Pakistan had three main components including brand identity development, musical score creation and interactive e-portal, he added.\nThe officer said an exclusive e-portal would also be launched to provide a world class exposure to Pakistan’s tourist attractions through one click. “The portal will consist of a user-friendly interface to interact with the prospective tourists and provide them online connectivity to view Pakistan’s tourist sites through virtual galleries, videos and documentaries and avail the various available services.”\nHe said the development of National Tourism Strategy (2020-2030) was in final stages. It was meant to develop a harmonized framework for the tourism sector, after taking all the stakeholders on board. It would focus on four key areas including good governance, tourism demand and supply, job creation and enabling growth.\nHe said the country was also preparing to host the ‘World Tourism Forum’ next year to showcase the country’s tourism potential, attract investment and build Pakistan into an international brand. “The participation of over 1,000 foreign visitors including investors, companies, tourists and holiday makers is expected.”\nHighlighting the tourism promotion steps taken by the government in last two years, he said prior to the COVID-19, the government undertook multiple initiatives at policy level, formed authorities at federal level to boost coordination among federating units and opened up the country by easing the visa process to revive the sector once lurching from crisis to crisis due to slackness of previous governments.\nHe said the government constituted the National Tourism Coordination Board (NTCB) with representation from all provinces and stakeholders. Nine working groups were formed to assist the NTCB, with each group assigned a specific thematic areas such as ‘Policy and Regulatory Reforms’, ‘Eco Tourism’, ‘Culture and Heritage Tourism’ and ‘Religious Tourism Working Group’.\nThe board was responsible for coordination between federal, provincial and regional tourism organizations/ departments, along with international tourism bodies for promoting the country tourism.\nThe officer said the PTDC restructuring has been completed to transform it into a progressive, efficient and technology savvy organization.\nIt would enable the PTDC to fulfill the assigned roles and responsibilities in a befitting manner that includes tourism promotion, marketing, research and analysis, monitoring and evaluation and coordination at national and international level.\nHe said the government had relaxed its visa policy for boosting influx of foreign tourists to the country.\nThe officer said e-visa facility was being provided to over 170 countries, whereas visa on arrival to citizens of 50 countries. So far around 120 thousand people international visitors had utilized those services for obtaining Pakistani visa, he added.\nHe said the Tourism Development Endowment Fund with seed money of Rs1 billion had been established after receiving concurrence from all stakeholders.\nThe fund would be utilized to promote tourism potential of Pakistan. It would also aid tourism industry in matters related to hospitality services, standards and certifications, research and analysis and centralized tourism database, he added.\nThe officer also mentioned multiple initiatives taken by the government for tourism promotion in the country.\nIt included participation in global tourism conferences, holding of tourism gala in 2020, opening of Kartarpur Corridor and establishment of Buddhist trail.",
  "retrievedAt": "2025-08-11T19:40:54.161Z"
}
