{
  "title": "Senate grants extension to two committees for presentation of reports",
  "link": "https://www.app.com.pk/national/senate-grants-extension-to-two-committees-for-presentation-of-reports/",
  "date_published": "2020-08-18T03:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):The Senate passed four motions on Tuesday under Rule 194 (1) granting extension of 60 working days to standing committees on foreign affairs and functional committee on human rights for presentations of reports on matters referred to them.\nChairman standing committee on foreign affairs, Senator Mushahid Hussain Syed moved motions under sub-rule (1) of Rule 194 of the Rules of Procedure and conduct of business in the senate, 2012, that the time for presentation of reports of the committee on two starred questions may be extended for a further period of 60 working days with effect from August 25.\nThe House passed both motions giving relaxation of 60 working days to the senate body on foreign affairs for presentation of reports on questions regarding the amount contributed by Pakistan so far towards financing of South Asian University (SAU) established by SAARC countries present position of the case against Dr. Aafia Siddiqui in the US.\nThe upper house also passed two other motions granting extension of 60 working days to functional committee on human rights for presentation of reports on points of public importance regarding arrest and naked video of young man by Station House Officer, PS Tehkal and arrest and death of a labourer in custody of police in Kotli, Azad Kashmir.\nBoth motions were presented by the chairman functional committee on human rights, Mustafa Nawaz Khokhar and the extension was granted with effect from August 24.\nChairman standing committee on railways, Senator Muhammad Asad Ali Khan Junejo presented report of the committee on a point of public importance regarding payment of amount of compensation to the injured and dead in the train accident of Tezgam Express on October 31, 2019.\nChairman standing committee on law and justice, Muhammad Javed Abbasi presented reports of the committee on the Islamabad High Court (Amendment) Bill, 2020 and the Constitution (Amendment) Bill, 2020 (Insertion of new Article 25B).",
  "retrievedAt": "2025-08-11T19:41:04.110Z"
}
