{
  "title": "I&B Ministry takes revolutionary steps to meet modern day media challenges",
  "link": "https://www.app.com.pk/national/ib-ministry-takes-revolutionary-steps-to-meet-modern-day-media-challenges/",
  "date_published": "2020-08-18T03:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): The Pakistan Tehreek-e-Insaf (PTI) government after coming to power in 2018 has taken several revolutionary steps to reform and improve the performance of Ministry of Information and Broadcasting so that it can meet the challenges of modern day media .\nThe Two-year Performance Report of the government issued on Tuesday said before August 2018, the rules, regulations and systems for the facilitation and development of the media industry were either outdated or non-existent. Similarly there was lack of synergy in the proper projection of Pakistan’s image nationally and internationally.\nThe media industry was facing financial crunch and there was a sense of dissatisfaction and job insecurity among the media workers, the report added.\nTo create an informed society, foster citizen centric national dialogue, promote national cohesion, advance media and reinforce Pakistan’s global outreach, the PTI government set a new vision for the Ministry of Information and Broadcasting, which included:\n• To institute and champion two-way communication between the citizens and state\n• To strengthen Pakistan’s image and international presence\n• Transparent and fair distribution of government advertisements to all media\n• Digitization of media monitoring and analysis processes\n• Digitalization and modernization of APPC, PBC, PTVC & SRBC\n• Streamlining of registration procedures for publications and news agencies\n• Automation of registration procedures\n• Promotion and development of media industry\n• Media development through capacity building, financial assistance to journalists/journalist bodies.\nAs per the performance report, the initiatives taken by the government during the last two years are:\n• Establishment of Digital Media Wing (DMW)\n• Formulation of Advertisement Policy including digital media advertising mechanism\n• Advertisement Framework for Regional Newspapers/ Periodicals\n• Implementation of Film Policy\n• Automation and restructuring of Press Registrar Office, Audit Bureau of Circulation (ABC) and Central Media List (CML).\n• Creation of Pakistani Artist Database\n• Establishment of Information Commission\n• Transparent criteria for disbursement of grant-in-aid from the Federal Government to the deserving journalists and journalistic bodies especially press clubs\n• In line with the Prime Minister’s Vision “Engage Africa”, a proposal submitted for opening new Press Sections in African Region (Uganda, Congo, Morocco, Tanzania, Ivory Coast, Ghana, Rwanda, Tunisia and Djibouti).\n• Special publications (including books) and documentaries on Pakistan’s tourism, culture published/ produced and facilitated by Press Sections abroad.\n• Under the rules of Business (Rule 16-17), the Ministry is mandated to establish Tourism Centers abroad. Press Sections have set up special tourism desks, in some embassies; they have been allowed to demarcate a special place for tourism centre. In the United Kingdom and France they have proper centres.\n• To facilitate Chinese media in Pakistan, an exclusive China-CPEC desk has been established in EP Wing (HQs).\n• A consultative forum to advise on important issues, and help prepare response on important issues has been established. The forum comprises former senior officials of M/o I&B (Secretaries,\nDGs), special invitees, representatives of commerce, finance and tourism deptt, important think tanks and social media experts.\n• The Publication Wing of Directorate of Electronic Media and Publications (DEMP) published and re-printed 99 books in the last two years. Prominent among those were Rising Pakistan, Indus Faces, Mah-e-Nau,Munno Bhai Number, Faraz Number and Habib Jalib Number.\nFilm Wing of the DEMP produced two songs (one National & one for Gurduwara Kartarpur), 12 documentaries, three Promos and two TVCs for national occasions.\n• Exhibition Wing organised exhibitions on all national occasions in all the four provincial capitals for the first time. Over all 13 exhibitions were held in the last two years. All designing work of cards, banners and posters was done in house.\n• Monitoring Wing: Expansion in Electronic Media Monitoring at DEMP has been to 50 plus channels from previously 12 plus channels only. A total of 18,174 spots (approximately) have been\ntracked, which include 320 missing spots that managed to save approximately over Rs.18 million from government exchequer by identifying missing spots in public sector advertisement campaigns.\nTracking reports of all media plans are completed and transmission certificates are issued to the\ndepartment concerned .\n• Cyber Wing has undertaken a number of initiatives: Development of QR Codes to “Discover Pakistan on QR Wheels- Pakistan the land of splendid beauty & opportunities”. These QR codes provide more data, including URL links, geo-coordinates, text and visuals.\nNews Data Bank has been created to provide one fountain source of information on the various steps/initiatives taken by the Government.\nThe “Cyber News Data Bank” aims to provide maximum, authentic and credible information processed into news format and at a ‘one click’ distance away in subject/ topic wise categorized clusters.\n• Radio Pakistan has successfully tested the first ever Digital Radio Mondiale (DRM) for FM test transmission on a consumer receiver in the country. After the successful test Pakistan has joined Russia, Indonesia and South Africa that have been demonstrating very recently the quality and deficiency of DRM in the FM band.\n• The IT team of PBC has indigenously developed a Mobile Application (Android & iOS) under the name “Radio Pakistan Official ” for live audio streaming of its stations/channels.\nThe live audio streaming channels available at Pakistan Broadcasting Corporation (PBC) website and Android / iOS apps have been increased to 25 channels.\nIn the past two years, PEMRA has awarded 11 Satellite TV Channels, 25 Commercial FM Radio Stations, 6 Non-Commercial FM Radio Stations, 11 Landing Rights Permissions, 8 IPTV Distribution Service licences, 5 Television Audience Measurement Services, 2 Mobile TV, 339 new Cable TV licences whereas 1060 Cable TV Licenses were renewed/revalidated and one Direct to Home (DTH) licence was given.\n• The Associated Press of Pakistan Corporation (APPC) took initiatives in two areas, including digitalization and restructuring.\nAPPC created a paper free environment, software system introduced for allocating assignments, news transfer, E- filing, accounts management, and HR record and performance evaluation and staff were given up to date equipment.\nFor restructuring, the APPC eliminated redundant jobs, closed unproductive stations, and created new high tech skilled jobs, and staff transferred to newly created departments of marketing, digital\nmedia services, and digital TV channel. APPC performance and income increased about 50 per cent and budget losses controlled. Moreover, an editorial board has also been created.\n• The Press Information Department started a fresh physical verification process of newspapers/ periodicals all over the country.\nTo achieve the vision of transparency and accountability, office of Press Registrar has denotified 4,500 fake titles of different fake publications.\nAutomation and restructuring of Central Media List (CML) was done, besides creation of Pakistan Photo Archives and preservation of decades old Photo Record.\nConverting manual system of various departments to E- filing under the vision of the Government to develop paper-free office environment, a very comprehensive digital portal related to COVID 19 was developed for instant information for the public, doctors, media personnel and all programmes and campaigns initiated by the government as a one-window approachable platform. Portal access:\nhttp://coronacounter.pid.gov.pk/\nThe live streaming of all press conferences, official programmes and government campaigns is done through the social media platforms of the PID.\nFresh physical verification process of newspapers/ periodicals all over the country was started.\nTwo years performance of PID in terms of its variety of functions can be quantified by the fact that it arranged 604 press conferences, issued 9,996 press releases, issued 17,797 supplements and managed 231 campaigns. The PID also arranged live streaming of 500 major mega events and generated advertisements business worth Rs 4.7 billion and its social media outreach has touched 56445234 mark.\nMoreover, the Digital Media Wing has been established and advertisement policy has been approved.\nFramework for Regional Newspapers/ Periodicals has been finalised.\nToRs prepared for newly formed Board of Governors (BoGs) to review Film Policy 2018\nState of the art online application launched for the Press Registrar Office, ABC and CML to ensure transparency and efficiency.\nDatabase of artists being created and updated regularly for financial assistance.\nInformation Commission was established in November, 2018 and the rules under Right of Access to Information Act, 2017 have been notified.\nA transparent criterion for grant disbursement was approved and grants were disbursed to deserving journalists and journalistic bodies especially press clubs in a non-discretionary manner.\nPhysical verification of over 300 newspapers/periodicals has been completed throughout the country.\n– In 2018 and 2019 bidding for award of 79 satellite TV channels licenses were held.\nAwareness & Outreach for the initiatives:\nMinistry of Information and Broadcasting attached departments, including APPC, Cyber Wing, External Publicity Wing (EP), Press Information Department(PID), PBC, Pakistan Television\nCorporation (PTVC), have strong social media presence. They have on Facebook: 3.4 million followers, Twitter: 2.5 million followers, Instagram: 900K followers.\nThe Ministry of Information organized special workshops and seminars, including:\n– Two-day experts meeting on the new challenges of media training in collaboration with ISESCO,one-day workshop for female journalists on “Empowering Women in Media\n– “Inclusion Leadership and Technology” workshop on ‘Story telling with info graphics: The art of Data Visualization’\n– Seminar on “International Day in Support of Victims of Torture” (Humans without Human Rights in IOJ&K)\n– Kashmir Under Siege Seminar\n– Panel discussion on Kashmir Siege Day\n– Training on Media Engagement for Civil Servants at Civil Services Academy(ISA)\n– Four-week training on Strategic Communications for Officers of the Khyber Pakhtunkhwa Information Dept.\nProposed and implemented legislative, policy framework of the ministry included:\n• Formulation of draft advertisement policy for print, electronic, social and new media\n• SOPs/ Criteria for grant of advertisement rates have been notified.\n• Journalist’s safety, security, protection and welfare bill 2020 (ongoing consultation with Law and\nJustice Division)\n• SOPs/ Criteria for financial assistance to journalists and journalistic bodies/press clubs\n• PBC Amendment Bill\n• APPC Amendment Bill\n• PCP Amendment Bill\n• The Motion Pictures Ordinance Amendment Bill\n• Pakistan Electronic Media Regulatory Authority (PEMRA) Amendment Bill\n• Press, Newspapers, News Agencies and Books Registration Amendment Bill\n• Defamation Amendment Bill.",
  "retrievedAt": "2025-08-11T19:40:51.989Z"
}
