{
  "title": "Govt to complete tenure successfully: Farrukh Habib",
  "link": "https://www.app.com.pk/national/govt-to-complete-tenure-successfully-farrukh-habib/",
  "date_published": "2020-08-18T03:25:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Aug 18 (APP): Federal Parliamentary Secretary for Railways Mian Farrukh Habib on Tuesday said the PTI government would complete its constitutional tenure successfully.\nTalking to APP here, he said the country was passing through a critical stage when the\nPTI came to power. Under dynamic leadership of Prime Minister Imran Khan, the PTI government had not only completed its two years but it had also overcome many problems, he added.\nHe said that corona pandemic had badly affected the world, including Pakistan, however, the PTI government effectively dealt the situation.\nHe said that Prime Minister Imran Khan had visionary leadership qualities, therefore,\nhe in time took initiative and launched the PM Ehsaas Emergency Cash Programme under which more than 16 million people had been provided financial assistance as they were facing great deal of difficulties after closure of economic activities due to COVID-19.\nHe said the PTI government had not only distributed Rs 250 billion among the poor\nduring corona situation but it also paid back loans of Rs 5,000 billion. Similarly, the government concentrated on enhancing exports so that maximum foreign exchange could be fetched.\nIn this connection, special incentives and relief packages were also announced for farmers\nand other stakeholders, he said.\nHe said the PTI government had successfully put the country on way to progress\nand prosperity, adding that cheap electricity projects were being launched after which prices of all things will decrease.\nResponding to a question, he said that opposition parties were trying to derail\ndevelopment process only to divert attention of people from their own loot and plunder.\nHe said the government had started accountability process against corrupt elements\nand they would be taken to task for greater national interest.",
  "retrievedAt": "2025-08-11T19:40:50.560Z"
}
