{
  "title": "MoCC implements 11 climate change adaptation, mitigation projects, bags over $200 m global funding",
  "link": "https://www.app.com.pk/national/mocc-implements-11-climate-change-adaptation-mitigation-projects-bags-over-200-m-global-funding/",
  "date_published": "2020-08-18T03:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):The Ministry of Climate Change (MoCC) during the last two years successfully implemented 11 climate change adaptation and mitigation projects, and managed to get over $ 200 million global funding.\nThe projects being implemented on ground included 10 Billion Tree Tsunami Programme, Clean Green Pakistan Index, Pakistan Hydromet and Climate Services Project, Ban on Polythene Bags, National Electric Vehicle Policy, Adoption of Zig-zag Brick Kiln Technology, GLOF II Project, Climate Resilient Agriculture, Snow Leopard and Ecosystem Protection Programme, Green Economic Stimulus, Clean Green Pakistan, Green Economic Stimulus and Digitization of MoCC, said the PTI government’s two-year performance report released on Tuesday.\nOne of the biggest interventions of the government was the 10 Billion Tree Tsunami Programme (10BTTP).\nThe government decided to set a goal of 10 billion tree plantation across the country with an estimated capital cost of Rs 110.0826 billion that includes forestry component of Rs 98.051 billion and wildlife component of Rs 12.0316 billion. It is a Rs 125.184 billion programme aimed to increase the forest cover by planting 3.22 billion trees in phase I; undertake major biodiversity initiatives especially conservation of national parks.\nThe initiative was expected to yield one million jobs in next four years.\nUnder “Enhancement of Forest Cover and Management” component of TBTT, on July 2, 2020, the prime minister launched Rs 4 billion development project of 15 national parks over the next three years aiming to expand protective areas from 12 to 15 percent by 2023. Almost 5,000 direct green jobs will be created in the initial phase of the project.\nDuring the past two years, under 10BTTP around 324 million plants have been planted and 85,000 employment opportunities have been created for daily wagers.\nThe prime minister launched the Clean Green Pakistan Index (CGPI) as a flagship initiative of the Ministry of Climate Change, in September 2019.\nThe CGPI was launched as a pilot in 12 cities of Punjab, which include Multan, Gujranwala, Faisalabad, Lahore, Rawalpindi, Sargodha, Bahawalpur, D G Khan, Sahiwal, Sialkot, Gujrat, Attock and Murree and it is also piloted in seven cities of Khyber Pakhtunkhwa (KP) which included Bannu, Dera Ismail Khan, Abbottabad, Kohat, Malakand, Mardan and Peshawar. The CGPI was a composite index of five pillars of Clean and Green Pakistan Movement i.e. water, sanitation, hygiene, solid waste management and plantation. The first progress report of 19 cities has been compiled after third party monitoring by UN Habitat and the ranking will be announced in July 2020 based on 35 indicators.\nPakistan Hydromet and Climate Services Project was also a key initiative of the ministry which was initiated to strengthen Pakistan’s public sector delivery of reliable and timely hydro-meteorological and disaster risk management services. US$ 188 million of the total project amount (US$ 210 million) was committed by the World Bank and would be implemented over the period of five years (2019- 2024).\nHydro-meteorological and climate services project cost was US$106.0 million aimed to achieve institutional strengthening, infrastructure modernization, enhanced service delivery of Pakistan Meteorological Department (PMD) and Monitoring and Implementation Support of PMD. The Disaster Risk Management (component total US$82 million) that would deal with Legal Policy, Infrastructure for Resilience; and Support of NDMA.\nIn order to overcome the increasing risk of plastic pollution the ministry imposed ban on polythene bags in Islamabad on August 14, 2019. The main aim of the initiative was to encourage the people of Islamabad to use reusable bags which were distributed by the MoCC to the general public for awareness.\nThe Ministry of Climate Change drafted the National Electric Vehicle Policy with the broad aim of getting the electric vehicles (EVs) introduced in the country in a phased manner addressing the issue of climate change and air pollution with an aim to bring half a million electric motorcycles and rickshaws, along with more than 100,000 electric cars, buses and trucks, into the transportation system over the next five years. The draft policy envisages net benefits in the range of US$ 2.2 billion to US$ 3.7 billion as net saving in oil import bill to the country under different scenarios in the 2020 to 2030 time period.\nThe legislation was under enforcement and for each quarter, inspection of 500 outlets/shops in Islamabad had been planned. However, the inspections have been halted due to COVID-19.\nThe ministry with support for UN Environment, Climate and Clean Air Coalition (CCAC), National Energy Efficiency and Conservation Authority (NEECA) and federal and provincial Environment Protection Agencies; initiated a programme to convert traditional brick kilns to Zig-Zag technology. The policy was approved by the Cabinet in November 2019. Thereafter, a committee constituted to endorse the incentive packages of different vehicles. So far, packages for 2-wheelers, 3-wheelers, buses and trucks have been endorsed.\nThe ministry to reduce the impacts of climate change implemented Glacial Lake Outburst Flood (GLOF) risk reduction in Northern Pakistan. The objective of the project was to strengthen resilience of communities that are likely to be affected by GLOF. The MoCC has initiated US$ 37 million project funded by GCF for GLOF II for 12 valleys in 15 districts of KPK and GB from 2018 to 2023.\nAround US$ 35 million GCF grant was signed with FAO for eight districts of Dera Ghazi Khan, Khanewal, Lodhran, Multan and Muzzafargarh in Punjab Province, and Badin, Sanghar and Umer Kot in Sindh for transforming the Indus Basin with Climate Resilient Agriculture and water management, targeted to provide nature solutions to small and subsistence farmers.\nUnder sustainable forest management and wildlife conservation, the MoCC initiated Snow Leopard and Ecosystem Protection Programme funded by GEF. The project was initiated in September 2018 to promote an integrated landscape-wide approach for the survival of snow leopard and its prey species by reducing threats and applying sustainable land and forest management in critical habitats in Northern Pakistan.\nBased on the priorities of the government for creating greater job opportunities during and post COVID-19; the Ministry of Climate Change proposed a “Green Economic Stimulus”, largely focusing to divert and re-configure implementation and roll out of TBTTP and CGPI creating greater opportunities for jobs and incomes. The World Bank’s grant of $ 60 million was proposed to provide short term relief in the shape of job creation and livelihood operations. Green jobs would be scaled up to 200,000 by December 2020 under “Green Economic Stimulus”.\nClean Green Pakistan (CGP) was re-designed to contribute to the objectives of job creation through contributing to total sanitation, solid waste management and hygiene within identified districts of the two provinces.\nA total of 53,250 jobs will be created over the span of three months that will include Community Mobilizers, Social Mobilizers, Sanitation Labor, Drain Clean Gang, and Urban Horticulture, Garbage Collectors/Scavengers, Certified Clean Green Champions.\nMinistry currently has a website which was an interactive website developed with all requirements concerning functions, procedures, SOPs, NOCs etc. under the Ministry’s jurisdiction, with real time updates, however an online complaint/feedback system is missing. A comprehensive exercise on digitization of ministry is underway.\nPakistan this year emerged as one of the countries to achieve SDG-13 Climate Action. This is the first time Pakistan has achieved any SDG goal.\nAccording to SDG report 2020, Pakistan’s SDG index score improved from 54.9 in 2018 to 56.2 in 2020. For the last two years, Pakistan was on track at maintaining attainments contributing to SDG-13 but still there were some challenges to be addressed. However, this year it is commendable for Pakistan that we have “achieved” SDG-13 with diligent efforts of government.",
  "retrievedAt": "2025-08-11T19:40:54.607Z"
}
