{
  "title": "Early commercial launch of AMA scheme on cards",
  "link": "https://www.app.com.pk/national/early-commercial-launch-of-ama-scheme-on-cards/",
  "date_published": "2020-08-18T03:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Pakistan Telecommunication Authority (PTA) was committed for an early commercial launch of Asaan Mobile Account (AMA) scheme, ensuring fulfillment of all technical parameters as defined in Third Party Service Provider (TPSP) license, related IM and subsequent clarifications.\nPakistan Telecommunication Authority (PTA) and State Bank of Pakistan (SBP) issued two TPSP licenses in 2018 to Virtual Remittance Gateway (VRG) (Pvt) Ltd and Digital Bridge (Pvt) Ltd (DBL) aimed to bring unbanked population into formal banking services, said a news release.\nHowever, it has been noted that VRG while violating the legal framework and license conditions, has started an ill-intended campaign in a section of media to malign the regulator and influence regulatory decisions.\nTo expedite availability of AMA scheme for general public, PTA provided all facilitation to TPSP licensees, through series of meetings and discussion spanned over several months to resolve the technical and financial issues between all stakeholders.\nHowever, VRG instead of recognising the efforts of PTA, has tried to malign the regulator by publishing twisted facts.\nIn fact, VRG has tried to put the burden of its own failures on the part of regulator. VRG has alleged in the media that PTA has delayed issuance of commencement certificate for commercial operations since Jan 2020, whereas SBP issued authorization to VRG for commercial launch on April 9.\nAs a consequence of SBP authorization and completing commercial agreement with mobile operator, VRG applied to PTA for commencement certificate on 4th August, 2020.\nIt is clarified that issuance of commencement certificate requires submission of commercial agreements by a TPSP licensee with all the Cellular Mobile Operators (CMOs).\nSince completion of pilot launch and inspection of VRG system in Jan 2020, PTA has repeatedly been urging VRG to expedite and submit commercial agreements for issuance of commencement certificate.\nHowever, VRG was unable to submit any commercial agreement since last six months until August 4, that too with only one operator i.e. Jazz. Even the agreement with Jazz is conditional on VRG’s agreements with other operators.\nUnder VRG’s license conditions, a 30 days prior notice is required by VRG for commencement.\nHence, there is no delay on part of PTA in issuance of commencement certificate and the same will be issued after fulfilment of quality of service conditions and evaluation of the commercial agreement.\nVRG has also reported that it has signed an agreement with SCO which has mandate to operate cell phone services in AJ&K and GB.\nVRG has even not been awarded any TPSP license for AJ&K and GB, a requirement to operate in AJ&K and GB.\nTherefore, VRG’s commercial agreement with SCO is misleading to the general public. TPSP licensee is also required to submit its agreements to the regulator, however, no agreement with SCO has been submitted yet by VRG.\nFurthermore, VRG has blatantly alleged a fair regulator to favour other TPSP licensee (DBL) to put pressure on the regulator well before the 30 days notice for processing of commencement certificate, which ends on September 4th.\nIt clearly indicates licensee’s intention of covering any shortfalls in commercial agreements and technical design through pressure tactics.",
  "retrievedAt": "2025-08-11T19:40:52.257Z"
}
