{
  "title": "Committee annoyed over non-appointment of heads of eight dept of MoST",
  "link": "https://www.app.com.pk/national/committee-annoyed-over-non-appointment-of-heads-of-eight-dept-of-most/",
  "date_published": "2020-08-18T03:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): The Senate Standing Committee on Science and Technology in its meeting held on Tuesday expressed annoyance over non-appointment of heads of eight departments working under the Ministry of Science and Technology (MoST).\nChairman of the committee, Senator Mushtaq Ahmad Khan said eight departments of the ministry were running their affairs without permanent heads and nobody was taking it serious.\nHowever, the officials of the ministry conveyed that the names of heads of these departments have been finalized and appointment of heads of two departments will be notified shortly while others will also be appointed soon.\nThe committee took up various issues of importance including irregularities in seniority list of Pakistan Council of Scientific and Industrial Research (PCSIR), details of on-going corruption cases at Pakistan Standards and Quality Control Authority (PSQCA) and pending promotion cases at both organizations.\nIn addition to this development of an ecosystem for promotion and glamorization of Science and Technology and status of on-going projects were discussed in detail.\nThe meeting commenced with details of the fact-finding committee regarding irregularities in the seniority list of the officers of PCSIR. Members were informed that the matter was resolved as per recommendations of the Committee.\nA final seniority list will be submitted to the Ministry at the earliest.\nThe Committee was also informed that a list of all eligible promotion cases have been submitted to the Ministry.\nChairman Committee, Senator Mushtaq Ahmad was of the view that organizations under the Ministry of Science and Technology (MoST) must ensure that the system is formulated to ensure promotions on time so that such disputes do not arise.\nWhile discussing details of corruption cases at PSQCA, the Committee took strict notice of officers not being suspended during investigations.\nIt was asserted that this would impact the inquiry outcome and was important to ensure transparency.\nWhile discussing the progress on the initiation of a dual degree program by COMSATS, the Committee directed the HEC to withdraw the Court case against it.\nChairman Committee, Senator Mushtaq Ahmad lauded the on-going projects under the umbrella of MoST and said that all possible steps must be taken so that timelines are met. This, he said, was imperative to the progress of the country. Details of six projects were shared with the Committee.\nReviewing the details of developing an ecosystem that will promote and glamorize Science and Technology in the country, the Committee was of the view that development of a central ecosystem that is governed by a common platform is imperative to the progress of the country.\nThe Committee took strong notice of a dearth of meeting of the National Commission on Science and Technology, since 2002. Chairman Committee, Senator Mushtaq Ahmad said that meetings must be conducted on a regular basis as this was the only way forward to success.\nHe asserted that a meeting of the Executive Committee be called immediately.\nThe meeting was attended by Senator Hidayatullah, Senator Muhammad Asad Ali Khan Junejo, Senator Kamran Michael and senior officers from the Ministry of Science and Technology, Higher Education Commission, PSQCA, PCSIR, COMSATS along with all concerned.",
  "retrievedAt": "2025-08-11T19:40:56.835Z"
}
