{
  "title": "New Portal to connect think tanks, academia approved by NSC: Dr Moeed",
  "link": "https://www.app.com.pk/national/new-portal-to-connect-think-tanks-academia-approved-by-nsc-dr-moeed/",
  "date_published": "2020-08-18T03:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Special Assistant to the Prime Minister (SAPM) on National Security Dr Moeed W. Yusuf said a new portal was going to be launched that would connect think tanks and academia to policy makers, approved by the NSC’s advisory board.\nHe expressed these views during reviving the Advisory Board of the National Security Committee (NSC) and chaired the newly revised Advisory Board’s meeting here on Tuesday at the Prime Minister’s Office, said a press release.\nNational Security Committee (NSC) was the apex decision-making body on national security matters.\nThe Advisory Board was a sub organ of the National Security Committee comprising leading think tanks who present recommendations for consideration of the NSC. The Board had not met since 2018.\nDuring the meeting, the SAPM announced the launching of an innovative portal to connect think tanks and academia with policy makers.\nThe SAPM said that the portal would help integrate think tanks across the country and enable them to contribute constructively towards government decisions and policy-making process.\nDr Moeed Yousaf said, “This will bridge the gap between the academia and the government, which has not been done in the past, and will help the government make better policies”. The portal was the first of its kind anywhere in the region and speaks to the government’s commitment towards inclusive policy making.\nThe SAPM was responding to the thorough exchange of views on the important role of various think tanks in the country in conducting research on the challenges and opportunities facing Pakistan.\nThe participants noted that there existed over 100 think tanks, but not enough has been done to channelize their input. The SAPM confirmed National Security Division’s desire to set this right.\nExplaining the Prime Minister’s vision, Dr. Moeed Yusuf said that the PM had a pro-people and pro-poor outlook towards national security.\nDr Yusuf said that the concept of national security has evolved over time from its traditional connotation of border security to also encompass concepts such as human security, welfare of the common citizen, economic security and environmental security. He said the government had adopted a multifaceted approach to cater to all the facets of the national security.\nWhile the Western view has always unfairly cast Pakistan in a negative light, the reality is that all stakeholders are working together day and night to achieve true security for each and every common citizen. That is the target set by the Prime Minister.\nThe National Security Division is currently spearheading a number of key strategic initiatives under the PM’s guidance, including finalizing a comprehensive national security policy document and document, formulating the Economic Diplomacy strategy, and playing a critical role in promoting Pakistan’s Kashmir policy in coollaboration with all stakeholders.\nThe meeting was attended by representatives of the Institute of Strategic Studies Islamabad (ISSI), Institute of Regional Studies (IRS), Institute of Strategic Studies, Research and Analysis (ISSRA) of the NDU, Islamabad Policy Research Institute (IPRI), Center for Aerospace & Security Studies (CASS) and senior officials of National Security Division.",
  "retrievedAt": "2025-08-11T19:40:50.760Z"
}
