{
  "title": "World must speak with “one voice” to urge India to desist from altering IIOJK demographics: FO",
  "link": "https://www.app.com.pk/national/world-must-speak-with-one-voice-to-urge-india-to-desist-from-altering-iiojk-demographics-fo/",
  "date_published": "2022-11-17T18:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): Pakistan on Thursday urged the world to speak with one voice to urge India to desist from altering the demographics of the Indian Illegally Occupied Jammu and Kashmir through coercion and by unilateral and illegal means.\n“The world must speak with one voice to urge India to desist from altering the demographics of IIOJK through coercion and by unilateral and illegal means. It must immediately undo all subsequent legal and administrative measures that aim to rob the Kashmiri people of the democratic majority and their ethnic identity,” newly appointed Foreign Office spokesperson Mumtaz Zahra Baloch said in her maiden weekly press briefing here.\nShe said Pakistan wished to remind the world that the only durable solution to the Jammu and Kashmir dispute lies in holding a free and impartial plebiscite as espoused in relevant UN Security Council resolutions, to enable the people of Kashmir to exercise their right of self-determination.\nHighlighting the major diplomatic engagements during the last two weeks, the spokesperson apprised the media of Prime Minister Muhammad Shehbaz Sharif’s participation in COP 27 World Leaders Summit from November 6-8 in Sharm El-Sheikh.\nShe said the visit gave Pakistan an opportunity to highlight the climate-induced flood catastrophe in Pakistan and the impact of climate change particularly being faced by the developing countries.\nThe spokesperson said the prime minister co-chaired with Norwegian and Egyptian counterparts, a High-Level Roundtable on Climate Change and Sustainability of Vulnerable Communities besides attending Middle East Green Initiative Summit.\nShe told the media that Foreign Minister Bilawal Bhutto Zardari undertook a visit to Saudi Arabia from November 9-10 and co-chaired the Joint Sub-Committee meeting of inaugural session of the Ministerial Committee of the Political and Security Pillar of the Saudi-Pakistan Supreme Coordination Committee (SPSCC).\nHe also held a meeting with Secretary General of the GCC to discuss regional situation in Afghanistan and recent floods in Pakistan with a focus on Pakistan-GCC cooperation to mitigate the impact of climate change.\nThe European Union Commissioner for Migration and Home Affairs, Ylva Johansson visited Pakistan from November 13-14 and visited Peshawar and held meetings with relevant authorities on border management.\nThe EU Commissioner’s visit focused on migration related matters, including readmission and return of illegal migrants. She also announced launch of Pakistan-EU Migration and Mobility Dialogue in the first half of next year.\nShe said in a positive development, United Kingdom has officially removed Pakistan from its list of ‘High Risk Third Countries’, in accordance with the decision taken by the Financial Action Task Force (FATF).\nBriefing the newsmen about the verdict in 2021 Dasu terrorist attack case, the spokesperson said it had once again demonstrated Pakistan’s abiding commitment to counterterrorism.\nShe said Pakistan remained committed to the safety and security of Chinese workers, projects and institutions in Pakistan and believed that the “ironclad” Pakistan-China All-Weather Strategic Cooperative Partnership would never be undermined by hostile forces.\nRegarding the Indian media reports quoting Director General International Atomic Energy Agency (IAEA) that the firing of BrahMos nuclear capable missile into Pakistani territory from India on March 9, 2022 was not a cause of any specific concern for the IAEA, the spokesperson said DG IAEA’s statement should have been qualified by stating that IAEA has no mandate on such matters.\n“But the Director General’s response cannot be purposely misinterpreted to trivialize the incident of a nuclear capable BrahMos missile fire with grave implications for regional and global security. India needs to explain several repeated incidents of nuclear and radioactive material theft and illicit trafficking that are more relevant to the IAEA mandate,” she remarked.\nTo a question about the progress on the case of Arshad Sharif’s murder, the spokesperson said the report of the investigation team was awaited. The Foreign Office had facilitated the entire process and would continue to do so.\nAsked about the schedule of Saudi Crown Prince Muhammad Bin Salman’s visit to Pakistan, she said though the visit was in works, the Foreign Office never announced the dates of the visit or cancellation of the visit.\n“The visit is being rescheduled and new dates of the visit are being firmed up in consultation with the Saudi side… The highlight of the visit would be holding of the second meeting of the Saudi-Pakistan Supreme Coordination Council (SPSCC) and signing of a number of MoUs covering various areas including economic, trade, culture and investment etc,” the spokesperson remarked.\nTo a question whether there has been any verbal or written complaint by Saudi authorities on the issue of sale of watch gifted to the former Prime Minister Imran Khan by Saudi Crown Prince, the spokesperson explained, “With regards to any official communication on this matter, I am not aware of that. As for the process, please note that the Cabinet division develops guidelines and also oversees the entire process.”\nAsked about the issuance of diplomatic passport to former prime minister Nawaz Sharif, she said there were certain regulations and guidelines under which the Government of Pakistan issues diplomatic passports to individuals.“There is a list of individuals who are entitled to diplomatic passports and that includes former Prime Ministers and former Presidents.”\nAbout the Donor’s Conference for Pakistan, the spokesperson said the discussions were underway and the conference may most probably take place in Geneva.",
  "retrievedAt": "2025-08-11T15:53:31.850Z"
}
