{
  "title": "Chairman NDMA, US delegation discuss post flood damages’ management",
  "link": "https://www.app.com.pk/national/chairman-ndma-us-delegation-discuss-post-flood-damages-management/",
  "date_published": "2022-11-17T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP): The US Delegation led by Commanding General of US Army Central, Lieutenant General Patrick D. Frank on Thursday visited NDMA and held a meeting with Chairman NDMA Lieutenant General Inam Haider Malik.\nThe delegation exchanged aspects of mutual interest in post floods damages’ management in Pakistan and sought insights into areas of future possibilities of engagement and cooperation, a news release said.\nThe chairman National Disaster Management Authority (NDMA) indicated an immediate requirement of developing intellectual and academic forums such as a new National Institute of Disaster Management (NIDM) and visible presence of NDMA in global and regional platforms and events.\nHe underscored the envisaged areas of technological inputs to enhance capacity and futuristic risk projection by NDMA through newly conceptualized existing National Emergency Operation Centre (NEOC) and investment in building capacity of national emergency response and preparedness through sharing experience, training and transfer of technology in the field of Disaster Management.\nThe chairman hinted at great learning outcomes from the management of current floods and NDMA’s planning for new proactive approach to engage all emergency response-related stakeholders for national-level preparedness of disasters. He also discussed the existing shortfalls in disaster management in Pakistan and emergency response structure.\nChairman NDMA noted that Pakistan ranked seventh amongst the most vulnerable countries to climate change impact and there is a critical requirement to build an AI-based systems. He shared NDMA’s vision to be a futuristic, technology-enabled entity and globally engaged organization, which is committed for ‘Climate Millennium Goals’ and leading for ‘Climate Reversal Initiatives’. He added that it required US-led international support in completing Pakistan’s held-up national surveys of vulnerable areas.\nCommanding Gen, Lt Gen Patrick D. Frank acknowledged Pakistan’s rescue and relief efforts during floods and reassured US Government’s assistance through USAID to continue support for flood affectees. He briefed on working of FEMA; US leading emergency management organization and role of US Military’s Reserved Force in disaster management.\nChairman NDMA thanked the US delegation for visiting Pakistan in critical time and expressed hope to benefit from US experiences in future.\nBoth sides agreed on shared climate security’s universal applicability of standard protocols and replication of successful management of mitigation templates of the developed world during emergencies and crisis.",
  "retrievedAt": "2025-08-11T15:53:37.937Z"
}
