{
  "title": "Nishan-i-Haider laureate ‘Major Tufail’ remembered on his 63rd anniversary",
  "link": "https://www.app.com.pk/national/nishan-i-haider-laureate-major-tufail-remembered-on-his-63rd-anniversary/",
  "date_published": "2021-08-07T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP):Legendary soldier of Pakistan Army Major Tufail Muhammad Shaheed was paid rich tributes for his unforgettable services for the country on his 63rd martyred anniversary being observed on Saturday.\nMajor Tufail Muhammad Shaheed, the second recipient of Nishan-e-Haider was born in Hoshiarpur in 1914 and commissioned in the 16 Punjab regiment in 1943.\nAfter a distinguished career, which included several instructional and command appointments in his own Battalion and also in the Civil Armed Forces, he was posted to the East Pakistan Rifles in 1958 as a Company Commander.\nAlso in August, Indian troops captured a village in East Pakistan. Major Tufail divided his men in three groups and it was decided that they would launch the assault during the dark hours of 7th august, electronic channels reported.\nHe encircled an illegal Indian post, which violated the internationally recognized boundary between the two countries, in the Lakshmipur area.\nWhen major Tufail group was about fifteen yards from enemy, they came under heavy fire and three bullets entered major’s stomach. Despite the shower of blood from his stomach, he kept moving forward and silenced the machine gun with a grenade.\nWhen another enemy machine-gun opened fire, killing his second in command, Major Tufail destroyed that gun too with a well-aimed grenade.\nDuring the hand-to-hand encounter that followed, he noticed the commander of the Indian post moving silently to attack one of his men.\nThough fatally wounded, Major Tufail crawled towards the enemy commander. He stretched out one of his legs and as the enemy stumbled he hit him in the face with his steel helmet, thus saving his troop.\nMajor continued directing the operation until the enemy was driven out leaving behind four dead and three prisoners.\nDue to loss of so much blood, Major Tufail fell on the ground, and then got up and said to his officer “I have completed my duty, the enemy is on the run”.\nMajor Tufail was taken to hospital but he later died the same day, the 7th August 1958.\nHe was awarded with Nishan-e-Haider, Pakistan s highest military award for his courage and was buried in Burewala.",
  "retrievedAt": "2025-08-11T21:03:09.521Z"
}
