{
  "title": "Pakistan strongly rejects baseless Afghan rep’s accusations at UNSC",
  "link": "https://www.app.com.pk/national/pakistan-strongly-rejects-baseless-afghan-reps-accusations-at-unsc/",
  "date_published": "2021-08-07T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 7 (APP): Pakistan has categorically rejected the propagated disinformation and baseless allegations levelled by Afghanistan’s representative in his statement at the United Nations Security Council (UNSC) with a view to mislead the international community.\nPakistan’s position on the issue had been shared with Security Council members, the Foreign Office spokesperson said in a press release on Saturday regarding the discussion at the UNSC on the situation in Afghanistan.\n“We also urge the Government of Afghanistan, once again, to refrain from the blame-game and engage with Pakistan in a meaningful manner to address the challenges to peace, security and progress in the region. In this regard, we reiterate the need for effective use of bilateral institutional arrangements such as the Afghanistan Pakistan Action Plan for Peace and Solidarity (APAPPS),” the spokesperson said.\nNot acceding to Pakistan’s request to address the #UNSC session on Afghanistan, as well as to make the platform available to enable the peddling of false narratives against Pakistan, is a matter of deep regret. 1/3 pic.twitter.com/X0999JOgdH\n— Spokesperson  MoFA (@ForeignOfficePk) August 7, 2021\n“It is equally important to remain cognisant of spoilers, both within and outside, who do not wish to see the return of peace and stability in Afghanistan and the region,” the spokesperson maintained.\nThe spokesperson further said that it was a matter of deep regret that, as the closest neighbour of Afghanistan, whose contribution in the ongoing peace process had been recognized by the international community, Pakistan’s request to the President of the Security Council to address the Council’s session and present its perspective on the Afghan peace process and the way forward was not acceded to.\n“On the other hand, the Council’s platform was made available to enable the peddling of a false narrative against Pakistan,” it was added.\nPakistan had repeatedly shared its perspective on peace and stability in clear and unambiguous terms with the international community.\n“We emphatically reiterate that there is no military solution to the conflict in Afghanistan and that a negotiated political settlement is the only way forward for durable peace and security in the country,” the press release quoted the spokesperson as saying.\nTowards that end, Pakistan’s constructive efforts with support of the international community led to achieving important milestones in Doha peace process including the U.S.-Taliban Peace Agreement and the subsequent commencement of Intra-Afghan Negotiations.\nPakistan calls upon all sides in Afghanistan to eschew the military approach and work together to secure an inclusive, broad-based and comprehensive political settlement. It is equally important to remain cognisant of spoilers, both within and outside. 3/3\nAs the U.S. and NATO forces are near completion of their withdrawal from Afghanistan, they were seriously concerned at the growing violence in Afghanistan and lack of substantive progress in the Intra-Afghan negotiations, it was further added.\nExpressing deep concern at the reports of human rights violations, Pakistan urged all sides to ensure full respect for human rights and international humanitarian law.\n“Pakistan calls upon all warring sides in Afghanistan to eschew the military approach, engage constructively in negotiations, and work together to secure an inclusive, broad-based and comprehensive political settlement,” the spokesperson said.",
  "retrievedAt": "2025-08-11T21:03:04.874Z"
}
