{
  "title": "Kashmir Solidarity Forum Japan submits a resolution to UN office in Tokyo on Kashmir Black day.",
  "link": "https://www.app.com.pk/national/kashmir-solidarity-forum-japan-submits-a-resolution-to-un-office-in-tokyo-on-kashmir-black-day/",
  "date_published": "2021-08-07T09:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 07 (APP):Chairman, Kashmir Solidarity Forum Japan (KSFJ), Barrister Shahid Majeed submitted a resolution to the United Nations office in Tokyo on August 5, which was observed all over the world as “Kashmir Black Day“.\n“Through this resolution we have registered our protest to the United Nations reminding it (UN) of its pledge made to the people of Kashmir accepting their right of self determination”, said Shahid in a statement made available to APP, here on Saturday.\nChairman KSFJ accompanied by a large number of Pakistanis expats living in Japan handed over the resolution to the director of UN office in Tokyo.\nBarrister Shahid Majeed speaking on the occasion said that India must stop its brutal suppression of Kashmiris, adhere to its international human rights obligations, and honor the commitment to grant to Kashmiris their inalienable right to self-determination through a free and impartial plebiscite under the UN auspices.\nChairman KSFJ highlighted India’s unacceptable actions and gross human rights violations in Kashmir, and said the Indian government should restore the original status of Kashmir.\nShahid Majeed acknowledged Pakistan’s continued political, diplomatic and moral support to the oppressed Kashmiris in their legitimate struggle for the right to self-determination, promised to them by the international community through numerous UNSC Resolutions.\nHe said until the real situation and status of the state of Jammu and Kashmir is restored, black days will be observed against the Indian move and there will be demonstrations around the world to condemn India.\nChairman KSJF also distributed pamphlets among the Japanese people regarding struggle of Kashmiris people for their right of freedom, India’s illegal and unilateral actions of August 5, 2019 and turning Kashmir into a large prison but failed to dampen the determined spirit of the freedom loving Kashmiri people and Indian government inhuman acts for oppressing Kashmiri people for 74 years.",
  "retrievedAt": "2025-08-11T21:03:10.557Z"
}
