{
  "title": "State media organizations’ digitalization to help project national narrative more effectively: Fawad",
  "link": "https://www.app.com.pk/national/state-media-organizations-digitalization-to-help-project-national-narrative-more-effectively-fawad/",
  "date_published": "2021-08-07T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Saturday said in the modern era wars were being fought on the media, and only those nations were successful which had strong narratives.\nAddressing the launching of National Digital Media Platform under the Ministry of Information and Broadcasting, he said the step would help project Pakistan’s image and the national narrative at the international level more effectively.\nHe said in old days wars were fought with armies, and swords and guns, but now with narratives and image building.\nHe said unfortunately the Ministry of Information and Broadcasting in the past had been downgraded as it became the mouthpiece of then ruling parties.\nHowever, today the ministry was doing its job of projecting the state narrative as the present government was not following the past practice, he added.\nDue to weak narratives, the minister said, the countries lost their strategic importance.\nDespite martyrdom of over 70,000 Pakistanis in the war against terrorism, Pakistan remained on the defensive as it could not project the above sacrifices in an effective manner, he added.\nFawad said today was an important day for transformation of the official media in Pakistan. The Pakistan Television, which was launched in 1964, was going HD (High Definition), Radio Pakistan shifted to Internet and the Associated Press of Pakistan (APP) was digitalized.\nHe said the present government had established the Digital Media Wing in the Information Ministry to project the country’s narrative on digital platforms.\nHe said the APP was being digitized to compete with leading world news agencies like Reuters and AFP.\nHe said the government had recently approved the National Digital Cable Policy 2021 for cable operators, who would be given loans under the Kamyab Jawan Programme.\nThe minister said despite many problems the Press Information Department had become paperless, as all the process of issuance of advertisements to the media outlets, including the billing process, had been computerized with elimination of human involvement.\nFor the first time there were no outstanding dues of media houses against the government, he added. In the past three months Rs 670 million were paid to the media houses, which also proved helpful in payment of outstanding dues of the media workers, the minister said.\nFawad said a media technology university was also being established to bring new technology in film and television production.\nHe said when he assumed office as Information Minister in 2018 he was surprised to know that the Pakistan Tehreek-e-Insaf was far ahead of the government media sector on the digitalization front.\nThe television networks of all the countries in region, including Afghanistan, had gone HD, but Pakistan could not take that step, he added.\nPrime Minister Imran Khan’s emphasis, he said, was on bringing new technology in the media industry and narrative building.\nThe minister said it was the first and foremost responsibility of the government to be answerable to the people and for that matter it was imperative to do capacity building of the institutions .\nHe said it was also being mulled the rename the Ministry of Information and Broadcasting as the Ministry of Media as a lot of changes had occurred with the passage of time, particularly with the involvement of technology.\nStrengthening of media industry would help project a narrative of Pakistan, he added.",
  "retrievedAt": "2025-08-11T21:03:04.870Z"
}
