{
  "title": "COVID-19 national positivity ratio hovers over 8%",
  "link": "https://www.app.com.pk/national/covid-19-national-positivity-ratio-hovers-over-8/",
  "date_published": "2021-08-07T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP):The national tally of total active COVID-19 cases was recorded 79,837 the highest during fourth wave of pandemic on Saturday with 4,720 more people testing positive for the deadly virus and 4,780 people recovering from the disease during the last 24 hours.\nNinety-five corona patients have died during past 24 hours, 85 of whom were under treatment in the hospitals and 10 of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Punjab.\nOut of the total 95 deaths occurred, 43 of them died were under treatment on ventilators.\nThere were 4,275 Covid infected patients under treatment in critical condition with 118 of them admitted during past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe national Corona positivity ratio during past 24 hours was recorded 8.24 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 43%, Bahawalpur 40%, Peshawar 32% and Multan 34%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Hyderabad 71%, Abbottabad 54%, Karachi 63%, and Islamabad 38%.\nAround 424 ventilators were occupied elsewhere in the country while no Covid affected person was on ventilator in Balochistan and Azad Jammu and Kashmir (AJK).\nSome 57,233 tests were conducted across the country on Friday, including 18,223 in Sindh, 20,413 in Punjab, 10,173 in Khyber Pakhtunkhwa (KP), 4,342 in Islamabad Capital Territory (ICT), 2,062 in Balochistan, 732 in GB, and 1,288 in AJK.\nAround 959,491 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,063,125 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 26,421, Balochistan 31,069, GB 8,615, ICT 90,093, KP 147,452, Punjab 362,557 and Sindh 396,918.\nAbout 23,797 deaths were recorded in country since the eruption of the contagion. Around 6,168 people perished in Sindh, 38 of them died in the hospitals and four out of the hospitals on Friday.\n11,172 people died in Punjab died with 31 deaths occurred in past 24 hours. Some 25 individuals died in the hospitals and six out of the hospitals.\nAs many as 4,524 people expired in KP, 17 of them died in hospitals on Friday, 811 individuals died in ICT, two of them died in the hospitals in past 24 hours, 331 people died in Balochistan, one of them perished in the hospital on Friday, 150 infected people perished in GB, and 641 people died in AJK, two of them succumbed to the deadly virus in the hospitals on Friday.\nA total of 16,393,404 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 4,725 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:03:07.095Z"
}
