{
  "title": "President launches digitalization of state media organizations",
  "link": "https://www.app.com.pk/national/president-launches-digitalization-of-state-media-organizations/",
  "date_published": "2021-08-07T13:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP): President Dr Arif Alvi on Saturday launched digitalization of the state media organizations; including the Associated Press of Pakistan (APP), Pakistan Television, Radio Pakistan at a ceremony held here at the Pakistan-China Friendship Center.\nThe Digital Transformation of State Media (DTSM) project, initiated by the Ministry of Information and Broadcasting also included Directorate of Electronic Media and Publication (DEMP) as well as the advertisements of the Ministry of Information and Broadcasting, and Pemra.\nThe ceremony was attended by First Lady Begum Samina Alvi, Minister for Information and Broadcasting Chaudhry Fawad Hussain, Minister of State for Information and Broadcasting Farrukh Habib, Speaker of the National Assembly Asad Qaisar, Minister for Human Rights Dr Shireen Mazari, senator Faisal Javed, parliamentarians, mediapersons, authorities of the ministry of information and state media outlets.\nUnder the project the APP Digital would be fully operationalised and be expanded, the PTV News would go High Definition (HD), Pakistan Radio would start podcasts and the National Media University would be established with focus on art, design, animations, digital journalism, while the DMW would focus on strengthening Digital Media presence of the State of Pakistan.\nLIVE #APPNews : President Dr Arif Alvi attends digitalization ceremony of Ministry of Information and Broadcasting #StateMediaGoesDigital @PresOfPakistan @ArifAlvi @fawadchaudhry  https://t.co/PpFElZmbDp\n— APP  (@appcsocialmedia) August 7, 2021\nThe digitalization of the news and other services would provide much improved users’ experience, boost speed of news distribution and reach. The digitalisation of the Information Ministry got a boost on the personal initiatives of Federal Minister for Information Chaudhry Fawad Hussain.\nThe project is part of the National Digital Information Platform (NDIP), aunched today, keeping in view the vision of Prime Minister Imran Khan for a Digital Pakistan.\nPresident Dr Arif Alvi also handed over award of ISO 9001:2015 and 27001:2013 certifications to Managing Director of Associated Press of Pakistan (APP) Mobashir Hasan in recognition of the organization’s improved quality standards of management at par with the international level.\nUnder the certification, the APP stands transformed from conventional to a dynamic digitalized mass media service, and aims at setting new trends and lead as a key source of digitally accessible news and factual public information.\nUnder the digitalization, the APP plans to expand its reach by providing customized news feed and digital content for its subscribers and the public.\nThe APP would also acquire latest computers, video editing and transmission equipment and servers for efficient news distribution and maintaining of its digital archives.",
  "retrievedAt": "2025-08-11T21:03:08.572Z"
}
