{
  "article_id": "2025-01-08_ad980559f390c7bee3f4ce8cfe0c01e7",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883791/narowal-woman-kills-two-kids-dies-by-suicide",
    "retrieved_at": "2025-08-26T07:32:23.781Z"
  },
  "metadata": {
    "title": "Narowal woman kills two kids, dies by suicide - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-08T01:49:48.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 324,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "NAROWAL: A woman allegedly poisoned her two children to death and later took her own life by consuming poison in Sheikhupura on Tuesday. According to Rescue 1122, Umme Habiba had a strained relationship with her husband Muhammad Qaiser, of Nishiman Park, Sheikhupura. She fed poisoned food to her children - three-year-old Muhammad and five-year-old Samar - and consumed the same herself. Rescue 1122 reported that the children succumbed to poisoning on the spot, while Habiba was provided first aid at the scene and shifted to Sheikhupura District Headquarters Hospital, where she later passed away despite medical efforts. Upon receiving information about the incident, local police took the bodies into custody and shifted to the hospital for post-mortem and legal formalities. POLICE ENCOUNTERS: Sialkot district witnessed 33 police encounters in 2024, resulting in the deaths of 22 suspects and the arrest of 27 others. Six police personnel sustained serious injuries during these encounters. District Police Officer (DPO) Rana Umar Farooq informed Dawn that Sialkot accounted for the highest number of police encounters in Punjab last year. The police engaged armed suspects during pursuits in various parts of the district, with 22 wanted criminals eliminated and 17 others apprehended alive. Ten injured suspects were arrested and shifted to hospitals for treatment. Among the injured police personnel were constables Nasir Yaqub, Vishal Ilyas, Usman Tariq, Tajumal Hussain and Muhammad Usman. Free medical treatment and necessary facilities were provided to the injured officials. The DPO said that no police personnel were martyred in 2024 encounters, though three officials lost their lives during operations in 2023. He added that the arrested suspects were involved in severe crimes, and their cases have been forwarded to the courts. Police also arrested 2,745 category A and 7,713 category B wanted criminals during the year. Sialkot remains the district with the most frequent police encounters in Punjab, underscoring the police's commitment to safeguarding citizens' lives and property. Published in Dawn, January 8th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}