{
  "article_id": "2025-01-08_ec602530c2c4732d0a5e0301d1c3d710",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883820/levies-man-martyred-in-panjgur",
    "retrieved_at": "2025-08-26T07:32:15.097Z"
  },
  "metadata": {
    "title": "Levies man martyred in Panjgur - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-08T02:20:50.000Z",
    "image_url": "https://i.dawn.com/medium/2024/03/2808080976e0fbc.jpg?r=080818",
    "categories": [],
    "word_count": 217,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "GWADAR: A Levies Force official was shot dead by unknown assailants in Panjgur, police said on Tuesday. The victim, Mumtaz Ahmed, was going home after performing his duty at the Football Chowk when he was targeted by some unknown motorcyclists in the Khudabadan area. Mr Ahmed was killed on the spot, a senior police officer said. Police moved his body to the district hospital. A case has been registered against unknown attackers, and a search operation has been launched in the area to arrest the killers, police added. Sariab attack In Quetta, a child was killed and three policemen injured in a gun attack in Sariab area, on Tuesday. Quetta shooting claims child's life, leaves three cops wounded According to police, armed men opened fire on a police party in Sharifabad area of Sariab late at night. As the cops returned fire, it led to an intense gunfight which continued for some time. The child, who was passing throught the area, got injured after being caught in the gunfire. He and the three injured policemen were shifted to the Civil Hospital where the child succumbed to his injuries. Police said an operation has been launched in the area to arrest the attackers. Saleem Shahid in Quetta also contributed to this report Published in Dawn, January 8th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}