{
  "article_id": "2025-01-08_843b53aada01c737ae8dae9b45ffbb8c",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883750/cooperation-shrinking-due-to-geopolitics-world-economic-forum-report",
    "retrieved_at": "2025-08-26T07:32:36.246Z"
  },
  "metadata": {
    "title": "Cooperation shrinking due to geopolitics: World Economic Forum report - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-08T01:49:21.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 308,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: International cooperation has flatlined, driven by heightened geopolitical tensions and instability, but momentum in climate finance and health and innovation offers hope, the World Economic Forum said in a report, the Global Cooperation Barometer, released on Tuesday. The WEF's flagship annual report highlights that global cooperation is at a critical juncture and its analysis reveals that after trending positively for a decade and surpassing pre-pandemic levels, overall cooperation has stagnated. The report used 41 indicators to measure the current state of global cooperation, and its aim is to offer world leaders a tool to better understand the contours of cooperation. \"What the Barometer shows is that cooperation is not only essential to address crucial economic, environmental and technological challenges, it is possible within today's more turbulent context,\" said Borge Brende, the WEF President and CEO. As the largely stable cooperative order that defined the post-Cold War period is giving way to a more fragmented landscape, solutions to pressing challenges - from climate action to technological governance - require collaboration. Despite the global security crises, the new findings indicate that collaboration has continued in various areas, including vaccine distribution, scientific research, renewable energy development and more, offering models for future cooperation, the barometer points out. While geopolitical competition is rising in regard to certain frontier technologies such as semiconductors, overall global cooperation in technology and innovation advanced in 2023, in part due to digitisation of the global economy. This helped drive the adoption of new technologies, a strong ramp-up in the supply of critical minerals - and a related drop in the price of lithium batteries - and a rebound in student mobility. However, rapid disruption from emerging technologies like AI is reshaping the global landscape, raising the possibility of a new frontline of geostrategic competition or even an \"AI arms race\". Published in Dawn, January 8th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}