{
  "title": "Israel has no right to meddle in Pakistan’s internal affairs: Ashrafi",
  "link": "https://www.app.com.pk/national/israel-has-no-right-to-meddle-in-pakistans-internal-affairs-ashrafi/",
  "date_published": "2023-07-12T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP):Prime Minister’s Special Representative on Interfaith Harmony and Middle East, Hafiz Muhammad Tahir Mahmood Ashrafi, on Wednesday firmly asserted that Israel had no right to meddle in Pakistan’s internal affairs.\nAddressing a press conference Ashrafi, who is also the chairman of Pakistan Ulema Council, criticized the Israeli government for showing sympathy towards individuals allegedly responsible for the attacks on government and military installations on May 9.\nHe warned Israel to refrain from interfering, emphasizing that the matter at hand solely concerned Pakistan.\nAshrafi labeled Israel as a notorious perpetrator responsible for the deaths of numerous innocent Palestinians, expressing his dismay that the concerned party did not give a stronger response to Israel’s actions on the international stage.\nHowever, he assured the public that all minority communities in Pakistan were safe, enjoying a peaceful life with their full rights protected.\nIn a united stance against Israeli interference, Ashrafi announced that the Ulema and Mashaykh (religious scholars) would unequivocally condemn Israel on the upcoming Friday, making their voices heard across the nation.\nThis collective denouncement aimed to shed light on the specific segment of Pakistani society for which Israel had advocated on the global platform.\nAshrafi also expressed gratitude towards the Kingdom of Saudi Arabia for its generous economic and financial aid to Pakistan.\nHe emphasized the pivotal role played by Saudi Arabia in fostering economic cooperation between the two countries.\nAccording to Ashrafi, the Saudi government had transferred $2 billion to Pakistan’s State Bank, a significant financial injection that was expected to have a transformative impact on the country’s economic landscape. This infusion of funds would create new opportunities for growth and development in Pakistan.\nThe Prime Minister’s Special Representative further commended Islamic countries for their endorsement of Pakistan’s proposed agreement against the desecration of the Holy Quran at the United Nations.\nAshrafi specifically praised Prime Minister Muhammad Shehbaz Sharif and Foreign Minister Bilawal Bhutto Zardari for their efforts in securing approval for the agreement and promoting the cause of protecting the sanctity of the Holy Quran on a global scale.\nHe expressed optimism that this landmark agreement would pave the way for the wider acceptance of laws safeguarding the sanctity of celestial religions, scriptures, and prophets, ultimately enhancing Pakistan’s reputation as a champion against Islamophobia.\nAshrafi concluded his address by applauding both the civilian and military leadership for launching the Special Investment Facilitation Council and the Green Pakistan Initiative. These initiatives were seen as crucial steps in propelling the country towards progress and prosperity.",
  "retrievedAt": "2025-08-11T08:53:33.591Z"
}
