{
  "title": "Pakistan achieves remarkable progress on polio eradication: Secretary Health",
  "link": "https://www.app.com.pk/national/pakistan-achieves-remarkable-progress-on-polio-eradication-secretary-health/",
  "date_published": "2023-07-12T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): Secretary for Ministry of National Health Services, Regulations and Coordination, Iftikhar Shallwani said that Pakistan has made remarkable progress on polio eradication, despite many challenges, and was well on the path to wiping out polio from its borders.\nDelivering a statement on behalf of the Minister for Health Abdul Qadir Patel at the 22nd meeting of the Independent Monitoring Board (IMB) in Geneva, the federal health secretary said that polio eradication has been and was a top priority for the Government of Pakistan.\nHe stated that the government’s commitment was evident from the fact that polio campaigns continued during a climate catastrophe and economic hardship.\nIftikhar Shallwani said, “The emergence of polio cases last year after a historic gap of 15 months was a stark reminder that while we have made remarkable progress, the work was far from over, and even greater determination was needed now more than ever.”\nHighlighting the innovative strategies of the Pakistan Polio Programme to reach every last child with the vaccine, he said that after the 2022 outbreak, only one polio case has been reported this year, which speaks volumes about the Programme’s preparedness and response capacity.\n“Many challenges still remain between us and the polio finish line, and the government was doing its utmost to reach all inaccessible children, address community hesitancy and vaccinate at border crossings,” the health secretary said. “We are confident that we are on the right path, and we will interrupt virus transmission this year.”\nThe Pakistani delegation at the IMB meeting, which continues till July 13, also includes Sindh Chief Secretary Sohail Rajput, Punjab Chief Secretary Zahid Akhtar Zaman, Chief Secretary Khyber Pakhtunkhwa Nadeem Aslam Chaudhry, Chief Secretary Balochistan Abdul Aziz Uquaili and National Emergency Operations Centre for Polio Eradication Coordinator Dr Shahzad Baig, among others.\nThe IMB was an impartial, independent body of global health experts which assesses the progress and challenges of polio eradication and issues an annual report. Through its unbiased evaluations and recommendations, the IMB promotes transparency and accountability in polio eradication strategies worldwide.",
  "retrievedAt": "2025-08-11T08:53:30.892Z"
}
