{
  "title": "Senator Talha for developing sustainable tourism initiatives on Gandhara",
  "link": "https://www.app.com.pk/national/senator-talha-for-developing-sustainable-tourism-initiatives-on-gandhara/",
  "date_published": "2023-07-12T15:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): Minister for Religious Affairs and Inter-faith Harmony, Senator Talha Mahmood on Wednesday said that developing sustainable tourism initiatives, particularly related to Gandhara, should be one of key goals.\nHe expressed these views here during the concluding session of Gandhara Symposium 2023 titled “Cultural Diplomacy: Reviving Gandhara Civilization and Buddhist Heritage in Pakistan”\nSenator Talha highlighted the hospitable nature of Pakistani society and dispelled the negative propaganda about security in Pakistan. As a mark of Pakistan promoting inter-faith harmony, he extended an invitation to the people of different faiths and cultures to visit Pakistan.\nDay-II of the symposium commenced with the Fourth Session on “Exploring the Spirit of Gandhara: Preserving the Past & Illuminating the Future.”\nThe speakers stressed the vital role of the local communities in the preservation, protection, and promotion of the Gandhara heritage.\nThe session was moderated by the Director of the State Bank Museum and Head of ICOM Pakistan, Dr. Asma Ibrahim.\nSpeakers of the session were Prof of Archaeology, University of Leicester, UK, Prof. Ruth Young; Senior Researcher, Cultural Heritage Foundation, South Korea, Yi Yun Jung; Director Minister of Buddhasana Religious And Cultural Affairs, Sri Lanka, Nishantha Pushpakumara; Prof. Dr. Hridya Ratna Bajracharaya; Former VC Lumbini University, Nepal; and Prof. Xiang Debao, Prof. School of International Journalism & Communication, Beijing University.\nThe panelists discussed that the heritage sites were very important for religious practices but also for building religious and national identity.\nThey highlighted that the true spirits of Gandhara were reflected in the stone sculpture of fasting Siddharta, the academic excellence of Taxila, and the mindful, pragmatic, imaginative, creative, and bold nature of Gandhara.\nIt was proposed to support the bringing of new digital technology and chemicals for preservation purposes. It was also underlined that Gandhara was not only a communication but an all-out campaign for modernization for not only an international audience but also for the Pakistanis themselves.\nIn the Concluding Session, a summary of the Symposium was presented by Dr. Abdul Samad that highlighted key takeaways from the 2-day Panel Discussions, Round Table, and In-house deliberations.\nThis was followed by concluding remarks from Dr. Ramesh Kumar Vankwani, who stressed inter-faith harmony and shared his views and suggestions on promoting Gandhara tourism. An address by the Chief Guest Minister for Religious Affairs and Inter-faith, Senator Talha Mahmood, was delivered.\nLastly, a vote of thanks was presented by DG ISSI Ambassador Sohail Mahmood. He congratulated the organizers and participants on the completion of the academic sessions, which had held in-depth deliberations on various aspects of Gandhara civilization, and produced takeaways that would be beneficial in crafting an appropriate strategy and action plan.\nHe extended special thanks to foreign participants and Pakistani scholars and experts for their insightful presentations and thoughtful discourse.\nHe concluded that this Symposium, a multi-stakeholder enterprise, was a resounding success owning to the excellent collaboration and coordination among all relevant departments and institutions.",
  "retrievedAt": "2025-08-11T08:53:32.332Z"
}
