{
  "title": "NDMA for protective measures amid medium to high level flood forecast in River Sutlej",
  "link": "https://www.app.com.pk/national/ndma-for-protective-measures-amid-medium-to-high-level-flood-forecast-in-river-sutlej/",
  "date_published": "2023-07-12T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): The National Disaster Management Authority (NDMA) on Wednesday issued an advisory alert for the provincial departments to ensure proper protective measures amid medium to high-level flood forecast in River Sutlej.\nAccording to the NDMA, during the next 24-48 hours, a medium to high level of flood was expected in Ganda Singhwala in the area along River Sutlej, and adjoining low-lying areas may come under the influence of the possible impacts.\nMoreover, it said there was a possibility of heavy rain with strong winds, and thunderstorms in different cities of the country.\nThere would be a risk of floods in low-lying areas and landslides in the mountainous areas, strong winds and thunderstorms can damage weak and dilapidated power poles, solar panels, billboards, tall trees or structures under construction, it said.\nThe safety measures included that the district administration should ensure the provision of emergency personnel and machinery including dewatering pumps in flood-prone areas, to maintain the flow of traffic, the administration should ensure a parallel traffic plan during drainage operation from underpasses and low roads, ensure the completion of stock taking by the concerned district administration.\nThe administration of the flood-prone areas should continue monitoring the sensitive areas, especially at the river Chenab’s Trimmu and the Ravi River’s Jassar areas until July 20th.\nThe Provincial Disaster Management Authority (PDMA) Punjab should ensure timely evacuation of the residents of the low-lying areas around the Rivers Chenab, Ravi, Sutlej and its associated canals.\nThe Rescue services, armed forces, and NGOs active in the respective areas should be ready to ensure emergency personnel, machinery and quick response in emergency situations.",
  "retrievedAt": "2025-08-11T08:53:39.061Z"
}
