{
  "title": "Poultry traders, importers’ hullabaloo on GMOs import halt exploitative, NA body told",
  "link": "https://www.app.com.pk/national/poultry-traders-importers-hullabaloo-on-gmos-import-halt-exploitative-na-body-told/",
  "date_published": "2023-07-12T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): The poultry traders and importers of Soybean seeds have created an exploitative hullabaloo at the national level pertaining to halt of genetically modified organisms (GMOs) seeds as the importers were illicitly importing the soybean seeds without meeting the legal formalities and protocols.\nAdditional Secretary Ministry of Climate Change and Environmental Coordination, Musadik Ahmed Malik on Wednesday informed the National Assembly Standing Committee on Climate Change and Environmental Coordination presided by MNA Nuzhat Pathan that in 1995 GMOs were introduced to create pest and weather resistant crops.\nThe chairperson raised the query before the Ministry of Climate Change pertaining to the alleged deliberate halt of soybean seeds causing economic damage to the poultry industry and increase in the price of broiler chicken.\nSetting the historical context, he said there were two lobbies one opposing and the other supporting the GMOs.\nHowever, later the Cartagena Convention was formulated in Spain and all countries made commitment that they would report on international biosafety house to report transboundary movement of the GMOs.\nIn Pakistan, the Cultivation regime after 2005 introduced locally produced BT Cotton GMOs based seeds and it was the only genetically modified crop prevailing in the country and there was no other GMOs locally produced or cultivated.\nSoybean seeds were imported to produce oil and its husk was used for making poultry feed as it had high protein which was good for fast growth of chicks, he added.\n“In Pakistan, there is no import without license. From 2015 till date none of the importers took license for importing soybean seeds. US is the biggest exporter of GMOs-based soybean and canola and it is not signatory to Cartagena Protocol,” he added.\nThe Customs Department on suspicion in 2022 tested two consignment of soybean seeds that were found GMOs whereas it was necessary to hold risk assessment to obtain a license and in order to circumvent the cumbersome ordeal of risk assessment the importers used illicit means, he added.\nThe federal cabinet gave directions to revisit rules and improve regulatory regime for biosafe human consumption of GMOs whereas the ministry engaged biotechnology scientists in an aggressive consultative sessions on the matter, the MoCC official said.\nThe scientist’s opinion was that since 1995 GMOs’ human consumption was underway like in US most of the products were GMO-based and heavily consumed at the local level.\nThe countries importing it were also using and there were no harmful impact reported so it was safe for human consumption, he added.\nSince its developers are far ahead of Pakistan in GMOs risk assessment there was no need to develop local risk assessment mechanism and therefore the ministry decided to amend the rules and engage stakeholders like Ministry of Food Security, he said.\nMusadiq Khan said Pakistan had soybean seed alternates in the country and there was no shortage of poultry feed raw material.\nThe Food Ministry claimed that there would be no shortage of chicken feed whereas the importers and poultry farmers exploited the matter, he alleged.\nThe rules amendment summary was submitted to the Cabinet Committee on Legislative Amendments on July 10th and it suggested that keeping in view local risk assessment of US FDA and EPA a one time license for three years with the condition of local risk assessment for mandatory to review and renewal of the license would be awarded to an importer, he said.",
  "retrievedAt": "2025-08-11T08:53:35.677Z"
}
