{
  "title": "PTV, Radio Pakistan attacked by proponents of institutions’ auctioning: Marriyum",
  "link": "https://www.app.com.pk/national/ptv-radio-pakistan-attacked-by-proponents-of-institutions-auctioning-marriyum/",
  "date_published": "2023-07-12T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 12 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday said national assets like Pakistan Television (PTV) and Radio Pakistan were attacked by those who were proponents of privatizing the national institutions and selling their buildings during their 4-year tenure which ensued nothing but conspiracies, lies and propaganda.\n“On coming into power, we have not chanted slogans to auction buildings of Radio Pakistan which is a national heritage and asset of the country,” she said while recalling policies of the previous regime which was bent upon privatizing the national institutions, especially in the information sector.\n“Those who vowed to auction national institutions were the same individuals who had not only attacked the Pakistan Television (PTV) in 2014, but also the building of Radio Pakistan in Peshawar on May 9 this year,” the minister regretted while addressing the media here at Radio Pakistan after inaugurating 12 new studios which were set up on modern lines as a result of the reforms started 14 months ago.\nShe was accompanied by Secretary Information and Broadcasting Sohail Khan and DG Radio Tahir Hassan.\nThe minister said the Pakistan Tehreek-e-Insaf’s (PTI) plan to auctioni the Radio Pakistan was also akin to an attack on the national asset, but it was the then opposition led by Prime Minister Shehbaz Sharif who foiled their nefarious design.\nRecalling the May 9 incidents which included vandalizing of Radio Pakistan and sensitive installations, and burning of memorials of martyrs, she said it was the same mindset that wanted to privatize the national assets on coming into power.\nThe minister told the reporters that the present government rolled out a reform programme to upgrade and digitize the Radio Pakistan on war footing soon after assuming the power.\nIt was under implementation for last 14 months, she added.\nMarriyum said a comprehensive business plan had been worked out to transform the Radio Pakistan into a financially viable organization. “New studios have been established at the Radio Pakistan which I visited today for reviewing its efficiency,” she added.\nRound the clock sports transmission of Radio Pakistan FM had been initiated at 94 frequency, she said, adding programmes in 11 regional languages were also launched.\nAs regards the environment, she said a dedicated transmission had been initiated to discuss its challenges and highlight the country’s biodiversity, wildlife, water management, forest conservation and management.\nMarriyum said a studio had been launched to instill research-based information regarding tech in the masses. Likewise, a studio was established to broadcast moral drama reel live, while podcast studios had also been launched.\n“We have started a dedicated live 24-hour music transmission,” she said, adding a world service was also launched to disseminate all sort of news, culture and heritage related content among the overseas Pakistanis.\nAnother studio to broadcast news bulletin had also been launched, while Saut-ul-Quran segment of Radio Pakistan was completely digitalized, Marriyum noted.\nShe said Saut-ul-Quran was the vision of Minister for Planning Ahsan Iqbal, which had been implemented by the Radio Pakistan.\nThe minister said a total of 12 studios were established on modern lines and at par with the international standards.\nShe said all those initiatives were taken by the incumbent government in last 14 months, as the Information Ministry was unfortunately spearheaded by a minister who completely focused on gagging the media by assaulting journalists.\nOther than those initiatives, cinemas research cells were also established in Radio Pakistan, she said, adding all the studios would welcome the talented students who would eventually get an opportunity to hone their skills.\nShe said a summer programme was being launched for universities’ students by integrating academies of PTV, Radio Pakistan Academy, and Information Services.\nMarriyum lashed out at the PTI chief for consistently churning out lies, spreading propaganda, hatching conspiracies, and above all using national institutions for political purpose during his government tenure.\nShe said the PTI chairman today stated that the country would have been defaulted if the PTI opposed to the IMF bailout programme. “This is a mental state and that is why I say he is not normal,” she added.\nMarriyum said the person had been declared a “predator” for free press by international organizations and it was he who was responsible for bringing the country to the brink of default.\nOn the other hand, she said, today Pakistan’s ranking had been improved for its national economy as well as human rights. “Our mission and vision is reflected in continuous progress of the economy,” she added.\nThe minister said the present government took tough decisions and even sacrificed its politics over the national interest.",
  "retrievedAt": "2025-08-11T08:53:28.777Z"
}
