{
  "title": "Religious pluralism, need of hour: Qadri",
  "link": "https://www.app.com.pk/national/religious-pluralism-need-of-hour-qadri/",
  "date_published": "2022-02-02T16:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 02 (APP): Religious Affairs and Interfaith Harmony Minister Pir Noor ul Haq Qadri Wednesday said religious pluralism was need of the hour.\nHe was addressing Paigham-e-Pakistan Tassawaf Conference, held under the auspices of Ittehad Millat Council here.\nHe said the Paigham-e-Pakistan doctrine was completely based on the teachings of Sufiya-e-Kiram (mystics). He said the message of mystics was about unity and tolerance instead of creating differences among the people.\nQadri quoted an anecdote from the life of Hazrat Baba Faridudin when a man brought a scissor as a present for him. Baba Farid said he wished if he had brought a needle and thread for him. Elaborating the philosophy of Baba Farid, he said the function of scissor was to cut the material while needle and thread join things together.\nHe said once a man came to Hazrat Bayazid Bastami and asked him whether the beard on his face was better or the tail of his cattle. Bastami did not show any aggressiveness but replied in polite manner that if he died on his faith as per Islamic ideology, his beard was better than his cattle’s tail otherwise his cattle’s tail was better than his beard.\nQadri said this event gave a crystal-clear message of tolerance to the people.He said the differences could be resolved with patience and dialogue without under estimating or degrading anyone.\nHe further said a man asked Hazrat Junaid Baghdadi about the crux of Islam. Baghdadi said that praising the blessings of Allah Almighty and to serve His creatures was the gist of the religion.\nHe said until and unless the Muslim Ummah revisited the mystics’ teachings, it would not be able to sort out issues prevailing in the society.He said Sufiya-e-Kiram spread Islam with their good character and moral ethics across the world.\nHe feared that nothing could harm the federating units of the country but religious sectarianism and linguistic violence. He said Paigham-e-Pakistan was the most authentic document after the Constitution of Pakistan. More than 5,000 Ulemas hailing from all segments of the society had put their signatures on it unanimously, he added. He said for making it the part of curriculum and extra curriculum activities, we needed to play our pro-active role.\nHe said Prime Minister Imran Khan had raised his voice at every international forum against the Islamophobia. He said the way the prime minister had fought the case against Islamophobia in the world, it had started given positive results. Qadri said this was the outcome of the prime minister’s unwavering efforts that President of Russia Vladimir Putin had said the right to speak was not to speak against the Prophet.He said a couple of days ago, Prime Minister of Canada Justin Trudeau had said there was no room for hatred against the Muslims in his country.\nHe said there was a dire need to further spread the narrative of Paigham-e-Pakistan.He also condemned the recent terrorist incidents and said the goal behind such sad events was to isolate and malign Pakistan at the international level. He said they wanted to build a peaceful Pakistan – free of sectarianism, extremism and terrorism. In the end, he distributed trophies among the seminary students.",
  "retrievedAt": "2025-08-11T14:14:18.159Z"
}
