{
  "title": "Regional situation, strategic partnership on top of PM’s agenda: Ambassador Haque",
  "link": "https://www.app.com.pk/national/regional-situation-strategic-partnership-on-top-of-pms-agenda-ambassador-haque/",
  "date_published": "2022-02-02T17:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP): Pakistan Ambassador to China Moin-ul-Haque Wednesday said that the regional situation, Afghanistan and Kashmir issue would top the agenda of talks during Prime Minister Imran Khan’s upcoming visit to China.\nTalking to PTV News, the ambassador said the prime minister would hold important meetings with the Chinese leadership including President Xi Jinping and Premier Li Keqiang.\n“The prime minister is undertaking the official visit at the special invitation of the Chinese leadership to attend Beijing Winter Olympics and will also hold meetings with different heads of states on the sidelines of the event,” he added.\nMoin-ul-Haque further said that during his meetings with the Chinese leadership, the prime minister would reiterate his government’s strong commitment to the high quality development of China Pakistan Economic Corridor (CPEC) and reassure government of Pakistan’s full support.\nThe ambassador said the prime minister would also hold meetings with the top Chinese enterprises and discuss the emerging prospects of investment and cooperation in housing, IT and other sectors of Pakistan.\nHe said the leadership of the two countries would discuss Afghanistan situation. Both countries had been closely cooperating over the efforts for peace and stability in Afghanistan, he added.\nPakistan and China had been calling upon the international community for the financial support to meet the humanitarian needs of Afghanistan, he said, adding besides, Kashmir issues would be prominently figured during talks with the Chinese leadership.\nThe ambassador said China had been a strong supporter over the Kashmir issue and it had raised it at the United Nations Security Council.\nAbout Pak-China ties, Moin said it had been ‘unique, historic, very deep and all-weather strategic partnership’ which always stood the tests of time.\nThis relationship had strengthened over the years, and nurtured deeply by the people and leadership of the two countries, he opined.",
  "retrievedAt": "2025-08-11T14:14:15.751Z"
}
