{
  "title": "Chairman PRCS engages in humanitarian collaboration with ambassador of Morocco",
  "link": "https://www.app.com.pk/national/chairman-prcs-engages-in-humanitarian-collaboration-with-ambassador-of-morocco/",
  "date_published": "2024-04-26T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Chairman Pakistan Red Crescent Society (PRCS), Sardar Shahid Ahmed Laghari, held a courtesy meeting with Ambassador of the of Morocco in Pakistan, Mohammed Karmoune here on Friday.\nThis meeting that took place at the Embassy of Morocco marked a crucial moment in the humanitarian relationship between Pakistan and Morocco.\nThe meeting provided a platform for both parties to deliberate on matters of mutual interest, particularly focusing on humanitarian aid and disaster management. Chairman Laghari emphasized the substantial partnership between the two nations in addressing humanitarian challenges.\nDuring the discussions, Chairman Laghari provided insights into the ongoing programs and projects of the Pakistan Red Crescent Society, emphasizing the organization’s commitment to serving vulnerable communities nationwide. He underscored the importance of international cooperation and solidarity in effectively addressing humanitarian crises, expressing gratitude for Morocco’s past participation in PRCS-organized events such as the International Donors Conference.\nChairman Laghari specifically emphasized PRCS’s anticipation of support from the Government of Morocco, especially in the recovery phase following the devastating Monsoon 2022 floods. He also expressed a strong desire to enhance cooperation, particularly with the Moroccan government, the Moroccan Red Cross, and other humanitarian organizations aligned with the Red Crescent mandate, aiming to alleviate the suffering of vulnerable communities in Pakistan.\nThe chairman extended an invitation to the ambassador to visit the PRCS which was graciously accepted.\nAmbassador Mohammed Karmoune expressed gratitude to Chairman Laghari for the comprehensive information and insights provided regarding disaster management during the floods, noting the impressive execution. He commended the PRC Society for its relentless efforts, led by Chairman Sardar Shahid Ahmed Laghari, in providing assistance to those in need, especially during times of crisis.\nThe ambassador pledged to facilitate Chairman Laghari’s visit to Morocco, arranging meetings with counterparts from the Moroccan Red Cross and heads of humanitarian organizations. He recognized the indispensable role of humanitarian organizations like PRCS in mitigating human suffering and promoting resilience within communities.\nConcluding the meeting, Chairman Laghari presented a memento to Ambassador Mohammed Karmoune, along with a souvenir, symbolizing the spirit of humanitarian collaboration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:08:13.293Z"
}
