{
  "title": "Senators for national consensus to address country’s pressing issues",
  "link": "https://www.app.com.pk/national/senators-for-national-consensus-to-address-countrys-pressing-issues/",
  "date_published": "2024-04-26T10:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Senator Jam Saifullah Khan said that it was need of the hour to show unity among all political parties to address all major issues confronting the country on a priority basis.\nAddressing in the Upper House at the maiden debates during the motion of thanks, he suggested that all political parties should close the chapter of political revenge from each other and stop the hurdles on the path of development and growth of the state, whereas constructive and positive criticism would be welcomed from the Opposition.\nKhan highlighted the sacrifices of Pakistan Peoples Party Parliamentarians (PPPP) and Awami National Party (ANP) in the past in Khyber Pakhtunkhwa during the war on terror.\nSenator Irfan ul Haq Siddique while participating in the debate on a motion of thanks on the presidential address, said that Syed Yousuf Raza Gillani would be better for the Chairmanship of Senate.\nHe also invited the Opposition to come forward and join hands with the government benches for the sake of the country’s development and national economy.\n“Currently, the country is facing many challenges at international level, so all political parties should shun personal political scoring and work for the state and citizens,” Senator Siddique said.\nThe Upper House, he said is also an institute of democracy to promote the voices of the people for the betterment of the country.\nMoreover, the country is facing high inflation, the day to day increase in power and gas tariffs and price hike of petroleum products and daily use commodities, he added.\nHe maintained that it was the responsibility of all political parties to show unity among all political ranks to address the national issues.\nSenator Jan Muhammad of National Partry urged on reconciliation and derided creating hurdles on reserved seats for women members of Pakistan Tehreek-e-Insaf (PTI).\nHe said that extremism was a big issue of the country, the government should take practical steps to eliminate it. “Pakistan should also revisit its relationship with Saudi Arab, Iran and Afghanistan to cope with religious extremism,” he added.\nSenator Jan demanded the decision makers to resolve pressing issues of extremism, terrorism, sectarian violence, and missing persons issue in Balochistan through political platforms.\nSenator Mohammad Humayun Mohmand of Pakistan Tehreek-e-Insaf (PTI) felicitated Chairman Senate Syed Yousuf Raza Gilani on assuming his charge. He demanded the House to also discuss issues of the Opposition parties including PTI’s alleged politically fabricated cases.\nSenator Bushra Anjum Butt of Pakistan Muslim League-Nawaz suggested that youth of the country needed positive motivation, whereas no constructive debate had been generated at the floor of the House for providing solutions to the massive problems of the youth bulge of the country.\nChairman Senate commended Senator Bushra Anjum for her convincing maiden speech at the floor of the House that left the entire gathering in silence during her address. He said that the House would learn from young members like her and would refine the ambience of the House for healthy debates.\nSenator Muhammad Aslam Abro of PPPP said that PPP had sacrificed its top brass for the supremacy of democratic process in the country.\nThe Senate Session was adjourned to meet again on Monday (April 29th) at 1500 hours.",
  "retrievedAt": "2025-08-11T02:08:17.315Z"
}
