{
  "title": "PM directs formation of committee for consultation with provinces on carbon credits policy",
  "link": "https://www.app.com.pk/national/pm-directs-formation-of-committee-for-consultation-with-provinces-on-carbon-credits-policy/",
  "date_published": "2024-04-26T14:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP):Prime Minister Shehbaz Sharif Friday directed formation of a committee for consultation with the provinces for policy making on guiding principles for carbon credits.\nHe was chairing the third meeting of Pakistan Council for Climate Change.\nThe federal and provincial governments would work together for making policies regarding climate change, he said.\n“Our challenges regarding climate change are increasing with every passing day,” he said, adding without the consultation of provinces, there was no question of policy making of any kind on the issue.\nThe participants discussed in detail policy guidelines for foreign trading in carbon credits. He instructed that a policy draft should be presented in the next meeting of the Council after consultation with the provinces.\nThe chief ministers of the four provinces expressed their viewpoint regarding policy making and gave recommendations.\nThe prime minister directed that the provinces and other stakeholders should be taken into confidence regarding the important policy draft on climate change.\nHe said Pakistan was one of the countries badly suffered from the adverse effects of climate change. It was gravely affected by the rains in 2022 and the floods caused by them.\nAs a servant of Pakistan, he said, he worked for the relief and rehabilitation of the flood affectees and fought the case of Pakistan all across the world regarding climate change.\nHe said Ahsan Iqbal and Sherry Rehman and all the relevant institutions and ministries took important steps to take Pakistan out of that difficult time and to build infrastructure in the country regarding climate change.\nHe said he and the Pakistani nation were thankful to the friendly countries and the international community particularly Secretary General of the United Nations for coming to the aid of affected Pakistanis.\nFederal ministers including Ishaq Dar, Ahad Cheema, Muhammad Aurangzeb and Sardar Awais Khan Leghari, Coordinator of Prime Minister on Climate Change Romina Khurshid Alam, high level officers and experts from the public and private sectors attended the meeting.\nThe Azad Jammu & Kashmir prime minister and the chief ministers of provinces, including Gilgit Baltistan, attended the meeting through video link.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:08:13.439Z"
}
