{
  "title": "Pakistan needs foolproof maritime security: Mushahid",
  "link": "https://www.app.com.pk/national/pakistan-needs-foolproof-maritime-security-mushahid/",
  "date_published": "2022-12-21T15:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Chairman Senate Standing Committee on Defence Senator Mushahid Hussain Sayed on Wednesday said the next war was expected to be at sea and not on land, therefore, Pakistan needed to ensure foolproof maritime security.\nHe was delivering his keynote address at the National Institute of Maritime Affairs (NIMA), a two-day International Maritime Symposium (IMS) on the topic “Geo-economic Dimensions of Indian Ocean Region (IOR) – Opportunities for Region and Beyond” on 20 and 21 December 2022, a news release said.\nThe experts from home and abroad presented their views about the geo-economic importance of IOR.\nSenator Mushahid Hussain Syed, while deliberating on the current global security scenario, opined that it was the most dangerous decade after World War II.\n“World is witnessing historic changes; economic and global powers are emerging from East,” he added.\nThe focus of second day proceeding was on maritime security in the context of regional connectivity. Air Marshal Zahid Mahmood, vice chief of Air Staff was the chief guest.\nWhereas Vice Admiral (R) Abdul Aleem moderated the session discussion. Vice Admiral (R) Iftikhar Rao spoke about the Maritime Threats & Challenges in Regional Perspective.\nHe talked about the Malacca strait choke point and its importance to the world, especially to China. He also emphasized that Gwadar is a commercial port and its security is vital for economic dividends.\nDr. Christian Beuger, of University of Copenhagen, talked about the Security of Sealines of Communications (SLOCs) and emphasized collaborative strategy in IOR to meet the non-conventional threats, particularly to SLOCs.\nHe opined that Pakistan is in a position to take the lead in this regard.\nWhile delivering talk, Prof. Dr. Azhar Ahmed, of Bahria University, was of the view that Geo- Economics is an instrument to achieve objectives of Geo-Politics. He underscored that without political stability no country can progress.\nAir Marshal Zahid Mahmood highlighted the importance of maritime security and its linkage with national security.\nHe emphasized on the need of developing operational strategies to meet the maritime security threats. Dr. Hassan Daud Butt, of Bahria University, spoke about the need of regional connectivity, both on land and over sea.\nThe message of Prime Minister of Pakistan was also read out during the session.\nWhile emphasizing the Maritime Security of Pakistan, PM opined that Pakistan is heavily dependent on its sea lines of communications because over 90% of Pakistan’s trade and almost 100% energy imports are through sea.\nTherefore, any disruption in maritime trade has serious repercussions for the national security. The government is well aware of this imperative and is providing all out support to maritime security apparatus especially to Pakistan Navy.\nVice Admiral Faisal Rasool Lodhi, Vice Chief of the Naval Staff was the chief guest of the closing session.\nHe emphasized that effective security is essential to protect the expanding maritime economic activities in Pakistan, region and beyond.\nPakistan, therefore, needs proactive diplomacy, well considered economic policies and risk management as important ingredients to harness and sustain the pace of development and potential growth.\nThe symposium was well attended by maritime professionals, security experts, academia, think tanks and media personnel.",
  "retrievedAt": "2025-08-11T16:02:50.284Z"
}
