{
  "title": "AJK President for dispensation of quality higher studies  to enter ranks of developed nations",
  "link": "https://www.app.com.pk/national/ajk-president-for-dispensation-of-quality-higher-studies-to-enter-ranks-of-developed-nations/",
  "date_published": "2022-12-21T13:01:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Dec 21 (APP): Azad Jammu Kashmir President Barrister Sultan Mahmood Chaudhry here on Wednesday emphasized the need of delivery of quality higher studies as per the needs of the modern age, to enter the ranks of the developed nations in true perspective.\nHe was addressing the 7th Convocation of Azad Jammu Kashmir’s only world-class state-run Mirpur University of Science and Technology (MUST).\nVice Chancellor MUST Brig (Retd) Prof. Dr. Muhammad Younis Javeid (Sitara e Imtiaz-Military), Registrar Khizer ul Haq, Dean Engineering Faculty Mujtaba Jaffery, Dean Prof. Dr. Muhammad Aslam, Dean Dr. Tehseen Ghous, Director Prof, Zaffar Iqbal of MUST Business School and Dean Faculty of Health and Nutrition, Teacher Ms. Aafia Naz and others also addressed the ceremony highlighting the overall outstanding performance of the Varsity besides their respective faculties.\nThe AJK President, on this occasion, gave away degrees of graduation, post graduation and PhD in various professional disciplines to the successful graduates qualified from the varsity besides the concerned academicians securing distinctions under the fold of the Varsity.The AJK President said that Pakistan was confronted with serious problems like poverty, violence, terrorism, energy deficiency, unavailability of clean water and illiteracy. It is only through education that we can ensure national development and overcome all these issues, he added.\nSultan continued that the AJK government was committed to make serious and strenuous efforts to improve access, quality, equity and governance in education sector by enhancing educational facilities within the minimum possible time.\nAppropriate policies are being formulated and their implementation strategies are being devised to achieve the national goal of quality education for all, he revealed.\nThe AJK President Barrister Sultan, who is also Chancellor of the AJK-based public universities, including the MUST continued that it was crystal clear that investment for the attainment of high education standards in education was the real investment.\n“We have to develop the higher education sector to meet the requirements of Human Resource Development of the State of Jammu and Kashmir”, he emphasized added that the AJK government had taken bold and difficult decisions for making the teachers employment system more transparent and merit-based.\n“We have successfully implemented the merit policy so that top merit graduates prefer public sector institutions in order to become more productive for the socio-economic uplift of the country”, the President said.\nAzad Jammu and Kashmir, the AJK President said, is the base camp for the struggle of independence of Kashmir.\nWe are deeply committed to the cause of Kashmir. I condemn the atrocities and gross human rights violation by the Indian Army in Indian Illegally occupied Jammu Kashmir State.\nPaying rich tributes to the valiant people of the Indian Occupied Jammu Kashmir State, Barrister Sultan assured the brave sons of the soil of continuing full support to them in their struggle for the right of self-determination as promised by the United Nations.\nThe AJK President underlined that in this fast developing era the world over, universities are considered forums of innovations and creativity through which societies and states benefit. Universities, he continued, play a crucial and decisive role in generating new ideas, and transmitting knowledge.\nHigher education institutions are major sources for providing the qualified human resource to the industry and society.\nThey are indispensable players in enhancing the socio-economic environments and the quality of life through applied research and play a strategic role in educating and training the scientists, teachers, researchers, entrepreneurs and other skilled workers. All of them comprise the real wealth of a nation.\nThe academic curricula must be dynamic, and at par with the best institutions of the world having an industry-focus, he urged.\nBarrister Sultan said that he was extremely delighted to note that MUST under the able and inspiring guidance of Prof. Dr. Muhammad YounusJaved SI (M) and his team of professors and administrators has first time participated in International Times Higher Education (THE) Impact Ranking (2022) and has been ranked at 53rd in Pakistan and fall at 1001+ category of the HEIs of the whole world at International level.\nIn the 2022 Times Higher Education Impact Rankings, MUST is the only University from AJK which participated in this International ranking and achieved singular honour. Impact Rankings are the first and only global performance tables that assess universities against the United Nations’ Sustainable Development Goals (SDGs).\n“Demonstrating a commitment to sustainability is becoming essential for the world’s higher education institutions”.\nThe AJK President lauded that incumbent management of the MUST far securing the grant of Rs. 250.206 Million from HEC for the development project titled “Up-gradation of University College of Engineering and Technology into MUST” for completion of the remaining work.\nHe revealed that the AJ&K government was going to establish “Special Technology Zone” at MUST and land has been earmarked for the establishment of Special Technology Zone in the State.\nThis will bring revolution in information technology and e-business, he added.\nThe President also appreciated the construction of Islamic Centre and Jamia Masjid in the new campus of the MUST at Jarri Kashmir by the Peer Sahib Gulhar Sharif, Kotli at New Campus Jarikas for 3000 persons including the students and employees of the University.\nThe University, he added has provided 10 Kanals of land and whole expenditures will be borne by Astana Alia Gulhar Sharif. This is a great gesture by Peer Sahib Gulhar Sharif.\nHe also lauded the MUST for launching six new degree programs i.e. BS English at Mirpur Campus, BS Architecture Engineering Technology, BS Biomedical Engineering Technology, BS Information Engineering Technology, MS Electrical Technology and MS Civil Technology.\nThe quality of education, Barrister Sultan said, is an issue, which needs to be addressed seriously.\nWe cannot develop unless we give quality education to our youth. If we want to developour country, we need to invest more on human resource development, as people blessed with the quality education really make a big difference, he added.\nThe AJK President congratulated all the graduates and their proud parents on achieving this major milestone in their academic career. He also felicitated the Medal Winners for distinguishing themselves with the outstanding performance.\n“You have certainly made your parents, teaching faculty and country proud with achieving these prestigious academic qualifications.”\nThe President also congratulated the proud parents who have been a consistent source of strength during your studies and provided you required support in all your endeavors and aspirations.\n“It is a momentous stage for you as you are now qualified engineers, scientists and expert of your chosen fields, ready to embark upon journey of your professional career”, Barrister Sultan said adding that he also extend special felicitations to the Vice Chancellor and his teaching faculty as without their support, dedication and commitment, this success would not have been possible.\nBarrister Sultan Mahmood Chaudhry asked the graduates that they were among the very small percentage of blessed and fortunate people of the State of Azad Jammu and Kashmir and Pakistan who got an opportunity to pursue their education in the fields of Engineering and Technology, Natural and Applied Sciences, Social Sciences and Humanities, Health and Medical Sciences, Veterinary and Animal Sciences, and Business Administration and Management.\n“But at the same time, you should not forget that there are large numbers of men and women who, despite having the best abilities and strong desire to pursue professional education, cannot make it due to financial limitations”, he said.\n“The parents and the government have provided you resources and opportunities to complete your education and realize your dreams. You should be thankful to your parents for their unconditional support” he told the students.\nHe asked the students that as pride of Pakistan, their parents and the teachers have prepared them with the requisite knowledge and qualities to start your professional career in the industry and as entrepreneurs. He said that knowledge was changing on very fast pace.\nIt is the responsibility of new generation to keep their selves abreast with the latest developments and changes in the field of your interest, he said and advised the students that they should bring passion to their endeavors, be firm and consistent in your behavior, bring out the zeal in you and the spark in your eyes to undertake every task.\nYou are aware that the world is shaped by such men and women who challenged the status quo”.\nSultan said “there are opportunities waiting for the students in our blessed country and in the world at large. Grab them, shape your lives and the world.”I call upon each one of you to take a pledge to make the full use of your knowledge for the benefit of society and humanity at large, he emphasized.\nAfter completion of your formal education, you can contribute effectively for the development and progress of the motherland.\nToday, you are commencing a new phase of your life. You are stepping in the fields having a wide variety of challenges, uphill tasks and tough competitions.\nI am confident that MUST has groomed you to take these challenges and tasks in a befitting manner. We expect that you will embark upon your professional career with competence, capability, confidence and will contribute for socio-economic uplift of our beloved country, he expressed.",
  "retrievedAt": "2025-08-11T16:02:54.359Z"
}
