{
  "title": "NA body directs PMC to address students’ concerns",
  "link": "https://www.app.com.pk/national/na-body-directs-pmc-to-address-students-concerns/",
  "date_published": "2022-12-21T13:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): The National Assembly Standing Committee on National Health Services, Regulations and Coordination on Wednesday directed the Pakistan Medical Commission (PMC) to communicate the concerned universities for resolving the issues of students within a week.\nThe Committee, which met under the chairmanship of Dr Muhammad Afzal Dhandla, directed the Council to hold a meeting with the Vice Chancellors of the University of Health Sciences (UHS) Lahore and Shaheed Zulfiqar Ali Bhutto Medical University (SZAMBU) Islamabad in this regard.\nThe Committee recommended the Vice President of PMC, Dr Khursheed Ahmad Nasim to look into the matter as students and their parents have complaints regarding the Medical and Dental College Admission Test (MDCAT) exam and ensure to resolve the issue as early as possible.\nHe directed that no students should be victimized, and asked to reconsider the students’ issues first. He added that students should be facilitated on priority basis.\nPML-N lawmaker Dr Zehra Wadood Fatemi raised the question from PMC official, that mostly multiple-choice questions (MCQS) were out of the syllabus in the MDCAT test held this year.\nWhile responding to the queries, PMC Vice President, Dr Khursheed Ahmad Nasim informed the committee, that not a single question was taken out of syllabus in the MDCAT test and assured that all questions used by UHS were from the question bank of PMC.\nHe said that a meeting is being arranged to address the students and parents concerns and later a report will be presented to the committee within a week.\nThe Committee member Aliya Kamran said that there were many vacant seats in Pakistan Institute of Medical Sciences (PIMS) despite burden of the patients on the hospital.\nOn which the Chairperson of the Committee Dr Muhammad Afzal Dhandla directed the Ministry of Health to fill the vacant posts on contract basis in PIMS with immediate effect.\nShe added that there were complaints of the absence of senior doctors and professors in the PIMS during duty hours due to which patients have to face hardships.",
  "retrievedAt": "2025-08-11T16:02:53.781Z"
}
