{
  "title": "Comprehensive strategy evolved to effectively tackle energy issues: Khawaja Asif",
  "link": "https://www.app.com.pk/national/comprehensive-strategy-evolved-to-effectively-tackle-energy-issues-khawaja-asif/",
  "date_published": "2022-12-21T14:51:00.000Z",
  "source": "APP",
  "content": "QUETTA, Dec 21 (APP): Minister for Defence Khawaja Asif on Wednesday said a comprehensive strategy had been evolved for energy conservation and his visit was aimed at taking the Balochistan government on board, besides seeking their input on the issue.\nThe Federal Government was fully focused on energy saving by adopting practical steps and measures to effectively cut down the extravagant use of national resources, he said addressing a meeting soon after his arrival at the Quetta Airport.\nFederal ministers Maulana Abdul Wasay, Nawabzada Shah Zain Bugti and Mossadaq Malik, Advisor to the PM Qamar Zaman Kaira, and Secretary Energy Rashid Mahmood Langriyal accompanied Khawaja Asif.\nThe minister said Prime Minister Shehbaz Sharif had directed them to share the recommendations of the special committee constituted by him for energy conservation with stakeholders, including the provincial governments.\nHe said since taking over the charge in April, the present government inherited multiple problems and a lack of funds, while the flash floods further aggravated the situation, rendering millions of people homeless and financially vulnerable.\nKhawaja Asif said energy saving was the need of the hour, which required radical lifestyle changes to redress the issue.He stressed that both the government and the people would have to jointly make efforts for saving electricity, petrol, gas and water.\nHe pointed out that the world over business started in the morning and closed by sunset, but in Pakistan, the situation was starkly different as the markets remained open till late night which was surely a waste of energy.\nHe said the committee had suggested for closure of commercial markets and business centres by 8 p.m. and restaurants by 10 p.m., in addition to changing the working hours of government offices.\nHe expressed confidence that the people would fully support the government to implement the energy conservation strategy which would ultimately lead to economic development and prosperity.\nSenator Manzoor Kakar, Provincial Minister for Finance and Food Zamrak Khan Achakzai, Malik Naseer Shahwani and representatives of the Traders and Farmer Action Committee explained their viewpoints and put forward suggestions.",
  "retrievedAt": "2025-08-11T16:02:50.587Z"
}
