{
  "title": "Govt tightens restrictions to curb corona spread: Dr Faisal",
  "link": "https://www.app.com.pk/national/govt-tightens-restrictions-to-curb-corona-spread-dr-faisal/",
  "date_published": "2021-04-27T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP):Special Assistant to the Prime Minister on National Health Services, Regulations, and Coordination Dr Faisal Sultan Tuesday said the government had taken appropriate measures and tightened restrictions to curb the COVID-19 disease as the virus was continuing to spread fast in the country.\nBriefing the media, he said the government was closely monitoring the third wave and it may lock down more areas if other interventions did not work in the next few days.\nHe said the prime minister had also engaged the armed forces to ensure that standard operating procedures (SOPs) were being followed in locked down areas which had high positivity ratio.\nHe said the National Command and Operation Centre (NCOC) had access to data from all districts and reviewed it on daily basis. “Its decisions are based on the spread of virus, success of SOP enforcement and capacity of the healthcare system.”\nDr Faisal urged the people to trust the NCOC and provincial government’s decision-making bodies as they had clear picture in front of them about the COVID-19 and moreover, they continue to expand the capacity of their healthcare system on day to day basis.\nHe said, “Our engineers are actively working on making more plants functional for the production of oxygen.” adding the diversion from non-essential industries were also being planned while avenues for import from other countries were also being explored.\nHe said logistics for the transport including the availability of trucks and drivers were also being monitored while guidelines for using oxygen efficiently were being issued to ensure that there was no wastage.\nDr Faisal said the government was regularly purchasing vaccines despite the global supply issue and Pakistan’s vaccine roll-out was continuing uninterrupted.\n“We have been very transparent and clear in our communication about vaccine procurement. It is wrong to say that the government is relying only on donations as we have already been purchasing from three manufacturers.”\nHe said since March 30, three million purchased vaccines had arrived in the country. “We have signed deals for 30 million doses, including a deal for technology transfer and joint manufacturing of CanSino.”\nDr Faisal said, “Only 1.7 million doses are grants from China. So we are not dependent solely on grants but we are grateful to our ally China.”\nHe said the money was not a concern and the government was willing to spend it, however, there was a serious lack of supply all over the world. “Even the richest countries like Canada and Australia have had to pause or slow down their roll-out due to a lack of supply.”\nDr Faisal said, “No matter, how much money you are willing to spend, you cannot buy more than availability. In the last few months, manufacturers like Astra Zeneca and Moderna have been unable to meet the demand.”\nHe said, “We are not dependent on COVAX and keeping this global supply issue in mind, we explored multiple channels.”\nDr Faisal said, “We did not reach out to COVAX just because it is willing to provide vaccine doses for free but we pursued COVAX in the interest of time as it is the biggest purchaser of vaccines and could provide doses sooner.”\nHe said the COVAX’s delivery got considerably delayed due to global supply issue. The COVAX would deliver on its promise in the future and it was a viable option.\nHe said many countries restricted the export of vaccines until local demand was met due to a surge in the cases.\nHe said vaccination for senior citizens of above 50 years was already underway and from tomorrow, citizens of this age group could message their computerized national identity cards numbers to 1166 and walk into the nearest vaccination center.\nHe said from today, the government had started registration for vaccine of citizens above 40 years of age and advised them to wait for further instructions from the government.\nHe said the vaccination centers were closed on Fridays but open on Sundays while those vaccination centers were operating after Iftar as well. He said the list of vaccination centers were available on NCOC’s website: www.ncoc.gov.pk\nHe asked the citizens to follow SOPs, wear a mask, maintain six feet distance, not leave house unnecessarily, and not to go in crowds at all.\nHe said due to the corona situation, Ramazan and Eid-ul-Fitr would be celebrated with simplicity this time.",
  "retrievedAt": "2025-08-11T20:39:57.716Z"
}
