{
  "title": "NTC, Schlumberger sign MoU to collaborate on AI deployment",
  "link": "https://www.app.com.pk/national/ntc-schlumberger-sign-mou-to-collaborate-on-ai-deployment/",
  "date_published": "2021-04-27T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 27 (APP): Following the government “Digital Pakistan” initiative, National Telecommunication Corporation (‘NTC’) and Schlumberger Tuesday signed a Memorandum of Understanding (MoU) to collaborate on the deployment of AI and digital solutions enabled by the DELFI* cognitive E&P environment, hosted on NTC’s data centres in Pakistan.\nBy working together, the two organizations will enable Pakistani energy companies to benefit from new digital and data-driven technologies that significantly increase operational efficiency and improve business performance, said a press release issued here Tuesday.\n“Our strategic collaboration with NTC accelerates digital transformation for the Pakistani energy industry. By hosting the DELFI environment on NTC’s in-country cloud services Schlumberger provides customers with secure access to our leading AI and digital solutions on a rapidly expanding cloud service across Pakistan.\nWith advanced cloud technologies and almost limitless capacity, geoscientists, engineers and data scientists can accelerate their workflows and insights to enhance critical business decisions,” commented Zaurayze Tarique, Managing Director, Schlumberger Pakistan and Yemen. “Deployment of DELFI solutions will help the Pakistani energy sector elevate performance across the industry’s value chain.”\n“In resource and knowledge intensive industries, such as the oil and gas industry, companies can now deliver breakthrough performance thanks to the development and large-scale use of innovative digital technologies and new cloud-based business models.\nBy collaborating with Schlumberger, NTC is extending commitment to invest in the development of the industry by working with the largest industrial and technological leaders from international and Pakistani oil and gas markets,” commented Viqar Rashid Khan, Managing Director, National Telecommunications Corporation.\nSchlumberger will work with NTC on a programmatic roll-out of technologies to expand cloud-based solutions in Pakistan. This will include adoption of the DrillPlan, coherent well construction planning solution which maximizes the results from drilling teams by automating repetitive tasks and validation of workflows in a single, common system.\nEnergy companies will also gain access to the DELFI Petrotechnical Suite—Schlumberger’s collection of digital solutions for petrotechnical workflows—and enhances their capabilities with AI and high-performance computing power enabled by the cloud.\nThese new digital technologies are advantageous in energy discovery and production because they enable large complex models, computer simulations, and analyses to be run in a fraction of the time in comparison to traditional computing solutions.\nThe MoU also formalizes the commitment from both organization to deploy the OSDU™ Data Platform—the industry standard for digital data for the energy industry—and lays the foundation for collaborative innovation for future energy workflows and solutions.\nNTC has its extensive and growing network of data centres across Pakistan, supported with proprietary technologies and services for storing, processing and analysing data with advanced digital capabilities including AI. NTC also complies with international and Pakistani standards for data protection and security.\nFederal Secretary IT & Telecom Mr. Shoaib Ahmad Siddiqui, said that “It is indeed a historic occasion for NTC to have achieved this milestone and I would like to congratulate National Telecommunication Corporation (NTC) management and Schlumberger on signing of this MOU.\nGiven the augmented IT demand and growth, in line with “DIGITAL PAKISTAN” vision of the Government, Ministry of Information Technology and Telecommunication (MoITT) being the national focal Ministry and enabling arm of the Government, has formulated the “Digital Pakistan Policy” based on vision of “Digital Pakistan” and we can proudly say that NTC is playing a very important role under MoITT supporting “Digital Pakistan”, a vision of the PM.”\nSpeaking on the occasion, Brig (R) Viqar Rashid, MD NTC expressed that NTC is a G-Cloud (Government Cloud) Services provider. National Telecommunication Corporation (NTC) has partnered with Schlumberger, as part of the endeavor to materialize Hon’ble Prime Minister Imran Khan’s Digital Pakistan vision to setup Pakistan’s 1st E&P In-Country Cloud Center.\nThis is a major step forward on the journey to establishing the open and flexible digital environment oil industry needs and this digital partnership will produce an industry-first solution to overcome Pakistan E&P challenges.\nThe ceremony was witnessed by Federal Secretary IT & Telecom Shoaib Ahmad Siddiqui, Managing Director NTC Brig (R) Viqar Rashid Khan, Managing Director Schlumberger Pakistan Zaurayze Tarique, Director Digital Subsurface Solutions Trygve Randen, President Schlumberger MENA region Tarek Rizk,\nVP Digital Subsurface Solutions – MENA region Lyndsey Lomas, Regional Managing Director (Oman, Pakistan & Yemen) Ali Al Lawati, Regional Manager Integrated Projects Ali Raif, Country Manager Schlumberger (Pak, Oman and Yemen) Khalid Mahmood and other high-level officials.",
  "retrievedAt": "2025-08-11T20:39:57.028Z"
}
