{
  "title": "PIA special flight to take 150 Pak students to China on 7th June",
  "link": "https://www.app.com.pk/national/pia-special-flight-to-take-150-pak-students-to-china-on-7th-june/",
  "date_published": "2022-06-01T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 01 (APP):Federal Minister for Education and Professional Training Rana Tanveer Hussain was apprised on Wednesday that a special charter flight of PIA will fly on June 7th to take Pakistani students to Xian, China.\nWhile chairing a meeting to resolve the issues of Pakistani students studying in China, the minister was informed that all formal approvals for a charter flight have been gained from the government of China.  The flight will take approximately 150 students back to China, contingent on issue of Chinese visas to Pakistani students.\nThe meeting was attended by senior officials of the Ministry of Federal Education, Ministry of Foreign Affairs, , HEC, PIA, and Aviation Division.  Rana Tanveer said that we have to put top priority on resolving the issue of Pakistani students who are enrolled in Chinese Institutes.\nThe students, Rana said, are our children and emphasized on the importance of supporting the youth of the country. He said that the students are an asset for the country.\nOn direction of the Federal Minister the forum was informed that the ticket prices have been highly subsidized so that they are affordable for the students. Rana Tanveer was informed that 112 student visas have been issued to the Pakistani students while 17 visas are still pending.\nRana Tanveer directed the Ministry of Foreign Affairs to ensure facilitation of Pakistani students with respect to their visas. The minister said that the issues of Pakistani students are of utmost importance and reiterated his resolve to ensure that the concerns of the Pakistani students will be addressed on priority basis.\nHe directed the forum to ensure speedy execution so that the loss of education of Pakistani students can be minimized on emergency basis.",
  "retrievedAt": "2025-08-11T15:00:28.530Z"
}
