{
  "title": "Senate body approves bill for special persons’ access to media",
  "link": "https://www.app.com.pk/national/senate-body-approves-bill-for-special-persons-access-to-media/",
  "date_published": "2022-06-01T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP): The Senate’s Standing Committee on Information and Broadcasting Wednesday unanimously approved a bill, aimed at taking the steps which would ensure the special persons’ access to the media.\nSenator Saleem Mandviwalla, who moved “The Access of Media (Deaf and Dumb) Persons Bill, 2022”, gave a detailed briefing to the committee which met here with Senator Faisal Javed in the chair.\nMandviwalla said the word “dumb” had been removed from the bill as some committee members had expressed reservations in that regard.\nHe pointed out the growing sense of alienation among the special persons who could not watch dramas and listen to the news on television channels.\nThe senator sought the support of Ministry of Information and Broadcasting and Pakistan Electronic Media Regulatory Authority (PEMRA) for implementing the bill once it became the law after approval from the relevant forums.\nThe Secretary for Information and Broadcasting and PEMRA Chairman did not express any reservation over the bill and vowed full support for its implementation.\nThe Director General Pakistan of Broadcasting Corporation (PBC) briefed the panel about the issue raised by Senator Irfan ul Haque Siddiqui regarding cutting down of trees within the premises of Radio Pakistan, Rawalpindi.\nHe presented the report on the matter which was rejected by Senator Irfan who urged the committee to inquire into the cutting down of trees.\nThe Senator asked the PBC DG to share the complete details including market value, kinds and number of trees which were cut down within the premises of Radio Pakistan, Rawalpindi.\nCommittee Chairman Faisal Javed summoned the officials of Environmental Protection Agency and relevant department of Punjab in the next meeting so that the matter could be looked into.\nThe committee was also briefed over the actions taken against some journalists and anchorpersons. The chairman took exception to the matter and directed the departments concerned for implementing the law for journalists’ protection in letter and spirit.\nThe committee chairman  also directed the Information Ministry to submit the details of advertisements given to the electronic and print media in the tenures of different governments.",
  "retrievedAt": "2025-08-11T15:00:27.365Z"
}
