{
  "article_id": "2025-07-05_61283351e2925ab3e5ea1e30d98e8529",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-participates-in-500-year-old-mourning-procession-in-rohri/",
    "retrieved_at": "2025-08-27T09:16:07.894Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi participates in 500-Year-Old Mourning Procession in Rohri",
    "author": null,
    "date_published": "2025-07-05T15:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 196,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "SUKKUR, Jul 05 (APP):Federal Interior Minister Mohsin Naqvi on Saturday attended the historic 500-year-old mourning procession in Rohri, reviewing security arrangements. Today, 2,700 mourning processions and 7,000 majalis were held across the country, with the situation remaining peaceful. Speaking to journalists at the residence of Provincial Energy Minister Syed Nasir Hussain Shah in Rohri, Minister Naqvi emphasized the governmentas efforts to ensure minimal inconvenience to the public during the Muharram processions. He praised the security arrangements made for the occasion. Regarding recent rumors about President Asif Ali Zardari on social media, Minister Naqvi urged the public to ignore such reports, stating that all political parties and the establishment stand united. Addressing concerns about dacoits in Sindhas kacha areas, Minister Naqvi assured that the federal government is fully aware of the situation and will soon launch an operation against the dacoits in collaboration with provincial governments. Minister Mohsin Naqvi also expressed gratitude to Sukkur District Council Chairman Syed Kumail Hyder Shah for his efforts in establishing a NADRA office in Sukkur, fulfilling a promise to the people of the city. He announced plans to start construction on a new Passport Office building in the Sukkur city soon.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}