{
  "article_id": "2025-07-05_7c9433f4494cefcc0d74d8ac95b2ff01",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/martyrdom-of-imam-hussain-ra-timeless-symbol-of-resistance-against-falsehood-jamaat-e-islami/",
    "retrieved_at": "2025-08-27T09:16:06.759Z"
  },
  "metadata": {
    "title": "Martyrdom of Imam Hussain (RA) timeless symbol of resistance against falsehood: Jamaat-e-Islami",
    "author": null,
    "date_published": "2025-07-05T15:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 316,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 05 (APP):Dr. Humaira Tariq, Secretary General of Jamaat-e-Islami Pakistan (Women's Wing), and Qudsia Namoos, Nazima of Jamaat-e-Islami Women's Wing Islamabad, on Saturday emphasized that the tragedy of Karbala stood as a radiant beacon in human history, reminding us of the importance of standing firm against oppression, tyranny, and falsehood. Talking to APP, they stated that the martyrdom of Imam Hussain (RA) was not just a historical event, but a powerful and eternal symbol of the struggle between truth and falsehood. The message of Karbala remains alive and relevant today, calling on individuals to rise against corrupt systems, unjust laws, and the silencing of truth. \"Silence in the face of oppression becomes a sin,\" they said. Referring to the ongoing suffering of oppressed Muslims in Palestine, Kashmir, Iran, and other regions, the leaders highlighted that the global Muslim community must draw strength from the spirit of Imam Hussain (RA) to confront today's injustices. Dr. Humaira Tariq further stated that in a time when powerful enemies like Israel, are spreading widespread oppression across the world, the spirit of martyrdom of Imam Hussain (RA) must be remembered and upheld. \"The lesson of Karbala is clear: even a small group standing for truth, when supported by sincere faith, is aided by Allah. This should inspire us to raise our voices against tyranny, to unite as an Ummah, and to stand in solidarity with the oppressed,\" she added. She stressed that if the Muslim Ummah wanted to live with dignity, it must understand the true spirit and philosophy of Karbala, and follow the footsteps of Imam Hussain (RA). Qudsia Namoos, in her remarks, said that the supreme sacrifice made by Imam Hussain (RA), his family, and companions in the field of Karbala remains a guiding light for all believers. Their unwavering stand for justice continues to inspire generations to uphold truth, courage, and resilience in the face of tyranny.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}