{
  "article_id": "2025-07-05_83bbe460e3cb78fcc7cad958d0dc268e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-wildlife-board-files-legal-complaint-over-illegal-deer-slaughter-in-margalla-hills/",
    "retrieved_at": "2025-08-27T09:16:29.616Z"
  },
  "metadata": {
    "title": "Islamabad Wildlife Board files legal complaint over illegal deer slaughter in Margalla Hills",
    "author": null,
    "date_published": "2025-07-05T13:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 05 (APP):The Islamabad Wildlife Management Board (IWMB) has filed a formal complaint at the relevant police station seeking legal action against individuals involved in the reported slaughter of a barking deer in Margalla Hills National Park-an act that violates Pakistan's wildlife protection laws. According to an IWMB spokesperson, the complaint names Bashir Abbasi, Zain Abbasi, and unidentified individuals as accused in the case. The Board is pursuing charges under the Islamabad Nature Conservation and Wildlife Management Act, 2024, specifically sections 12.4(a) and 16.1(a), which prohibit the harming or killing of protected wildlife. \"The barking deer is listed as a protected species under Schedule I of the Act,\" the spokesperson told APP. \"Its killing is a serious offense, and we are committed to ensuring that those responsible are held accountable.\" Under the law, he said violations of these provisions carry a maximum penalty of Rs 1 million in fines and up to one year in imprisonment. The complaint further invokes Section 23 of the Act, which states that even a deceased wild animal found in a protected area is considered the property of the federal government. The move comes a day after a video surfaced online showing the deer being slaughtered in the national park, sparking public outrage and prompting a swift response from the Ministry of Climate Change and Environmental Coordination. Federal Minister Dr. Musadik Malik condemned the incident and ordered an immediate inquiry. Margalla Hills National Park is one of Pakistan's most biodiverse protected areas, home to several endangered and native species. Officials and environmentalists alike have called for stricter enforcement to prevent such incidents in the future. Legal proceedings are now underway, and authorities say further action will depend on the outcome of the investigation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}