{
  "title": "NA body seeks early completion of damaged houses’ survey in South Waziristan",
  "link": "https://www.app.com.pk/national/na-body-seeks-early-completion-of-damaged-houses-survey-in-south-waziristan/",
  "date_published": "2023-07-13T16:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP): The National Assembly Standing Committee on States and Frontier Regions (SAFRON) on Thursday directed the Additional Deputy Commissioner (ADC) of Tribal District South Waziristan to complete the remaining surveys of damaged houses within two weeks.\nThe Committee that met here with Muhammad Jamal-ul-Din in the chair expressed grave concerns when informed that the survey of around 4000 damaged houses was still not completed due to the Law & Order situation on the ground in some areas of South Waziristan.\nThe NA body urged ADC to forward all the survey forms to Rehabilitation & Reconstruction Unit (RRU) secretariat, Peshawar without any further delay as the matter was in process for the last 6-7 years and submit the report to the Committee accordingly.\nThe ADC while briefing the committee regarding Special Integrated Area Development Package for Tribal District South Waziristan apprised that the Project Management Unit (PMU) is not fully functional due to the ban on appointment of Grade-17 and above employees by the Election Commission of Pakistan.\nThe committee directed ADC to process the case and sent it to the Election Commission of Pakistan (ECP) requesting for NOC for the appointment of Grade-17 and above employees as soon as possible in order to make functional the Project Management Unit and to deliver the development projects in time.\nThe committee was also briefed on the progress regarding the alleged illegal absorption of 77 Levies Force/ Khasadar in KP Police in detail by the Special Secretary, Home & Tribal Affairs Department, Government of Khyber Pakhtunkhwa.\nMeanwhile, the committee also discussed the issue of regularization of Governors Model Schools Staff and the release of their salaries which have been stopped for the last six months.\nThe committee directed the Secretary of Elementary & Secondary Education to move summery immediately for seeking grant-in-Aid in order to make payment to the staff of the above-mentioned schools.\nThe meeting was attended by MNAs Ibadullah Khan, Chaudry Muhammad Ashraf, Nasiba Channa, Afreen Khan and senior officials of the Ministry and its attached departments.",
  "retrievedAt": "2025-08-11T08:54:12.081Z"
}
