{
  "title": "Around 7.2 million families received Benazir Kafaalat payments: Faisal Kundi",
  "link": "https://www.app.com.pk/national/around-7-2-million-families-received-benazir-kafaalat-payments-faisal-kundi/",
  "date_published": "2023-07-13T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 13 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety, Faisal Karim Kundi Thursday said that around 7.2 million families received their quarterly payments under the Benazir Kafaalat programme till today.\nAddressing a press conference, the SAPM said that the Benazir Education stipends were also being disbursed among the beneficiaries along with the Kafaalat payments.\nHe advised the beneficiaries of Benazir Income Support Programme (BISP) to only follow the messages which was sent through BISP official number 8171 and ignore the fake messages from other numbers.\nThe SAPM said that around 0.3 million cards of the beneficiaries, earlier blocked during the previous government tenure, had been reactivated to provide relief to the poor while the remaining cards would be reactivated soon after completing the necessary requirements.\nTo a question, Faisal Kundi said that beneficiaries of BISP would be able to open their accounts in any bank available near to them instead of only two banks which were designated for this purpose in the past.\nExpressing his concern over the Parachinar issue, Faisal Kundi urged the political parties and ulemas (Religious Scholars) from all school of thoughts to intervene for resolving the issue of Parachinar.\n“There is need to resolve the issue immediately to ensure peace as Muharram is near”, Faisal Kundi said.\nLand occupation was still a major issue in Khyber Pakhtunkhwa and the Pakistan Tehreek-e-Insaf led government did nothing for resolving such issues, he said.\nCriticizing the attack on the military installations on May 09 by rioters, Faisal Kundi said those involved in the incident must be punished.\n“What happened on May 9 was an insult to our martyrs whose families proudly say that our sons died for the sake of our country”, he said.\nThe minister also criticized International Monetary Fund delegation’s visit to meet a person in Zaman Park who was wanted by the state in different cases and urged the relevant authorities to convey a strong message on it.",
  "retrievedAt": "2025-08-11T08:54:19.159Z"
}
