{
  "title": "Federal Ombudsman for improved facilities to expats at airports",
  "link": "https://www.app.com.pk/national/federal-ombudsman-for-improved-facilities-to-expats-at-airports/",
  "date_published": "2021-03-17T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP):Federal Ombudsman Syed Tahir Shahbaz Wednesday underlined the need for providing maximum facilities to the Pakistani expatriates at all the international airports of the country by improving one-window facilitation desks.\nChairing a high-level meeting, he said around 8.5 million overseas Pakistanis, who sent billions of dollars to Pakistan every year, were valuable asset of the country. Provision of facilities to them should be a top priority of every government institution, he added.\nTahir Shahbaz called for round-the-clock presence of the officials of all the departments concerned at the one-window facilitation desks.\nThe meeting was attended by Bureau of Emigration and Overseas Employment (BEOE) Director General (DG) Kashif Ahmed Noor, Ministry of Overseas Pakistanis and Human Resource Development Joint Secretary Shaheena Ali, Grievance Commissioner for Overseas Pakistanis Dr Inamul Haq Javed and Senior Adviser Appraisal Ejaz Ahmed Qureshi, a news release said.\nOn the occasion, the Grievance Commissioner for Overseas Pakistanis presented a report and apprised the meeting about his recent visit to the Peshawar airport.\nHe said approximately 80 flights were operated at the airport in a week, and most of the travelers belonged to the labour class, who faced a number of problems with regard to the BEOE.\nThe Federal Ombudsman directed the BEOE DG to take initiatives for resolving all the issues, faced by the emigrants. He also directed for submission of monthly performance report of the facilitation desks.\nHe stressed the need for better coordination among all the departments concerned to ensure provision of improved facilities to the expats.\nTahir Shahbaz also directed the Civil Aviation Authority (CAA) for facilitating the officials of different departments performing duties at the desks.\nIt may be mentioned that some 12 departments, including Federal Investigation Agency, Immigration, National Database & Registration Authority (NADRA) , Overseas Pakistanis Foundation (OPF), CAA and others are providing facilitation to the overseas Pakistanis at eight international airports in line with the directions of Federal Ombudsman.",
  "retrievedAt": "2025-08-11T20:30:28.224Z"
}
