{
  "title": "NA panel seeks report of action taken against Aurat March objectionable slogans",
  "link": "https://www.app.com.pk/national/na-panel-seeks-report-of-action-taken-against-aurat-march-objectionable-slogans/",
  "date_published": "2021-03-17T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP):National Assembly Standing Committee on Religious Affairs and Interfaith Harmony on Wednesday directed ministries of interior and law and justice to furnish the details of action taken against the elements behind displaying the objectionable material in the Aurat March of March 8.\nThe meeting of the committee presided over by Maulana Asad Mehmood, the son of Maulana Fazlur Rehman, expressed its indignation over sacrilegious banners, placards and slogans displayed in the women march on March 8 and declared the march as unethical, in contrary to the constitution and opposite to the teachings of Islam.\nThe committee sought details about the participant (NGOs) non governmental organisations of the march and source of the funding (of the participant NGOs).\nChairman Asad Mehmood said the impious slogans displayed in the March could not be even repeated.\nShahida AKhtar Ali, a member of committee said the videos of various female participants of the March have already gone viral on social media.\nShagufta Jumani, another member of the committee said she was ashamed after watching the banners of the march which were totally against our moral values.\nLamenting the absence of any authority to prevent the misquoting of Qur’an, Hadith and religious material, the committee granted its consent to present a Bill for establishing an authority to prevent the misuse of religious material.\nThe forum also discussed the absence of government authority on blasphemy and printing of non-Islamic writings or similar materials.\n“Is there any authority in our country to review and take action on controversial writings,”? questioned the chairman. Authorities have been set up to investigate everything including milk and water and take action against the culprits.\nThe Committee adopted a resolution condemning the United Kingdom’s report titled “Suffocation of the Faithful, the persecution of Ahmedi Muslims in Pakistan and the rise of International Extremism,”\nAdding that the report was interference in Pakistan’s internal affairs. The resolution was presented by PTI’s Jamshed Thomas, a member of the committee.",
  "retrievedAt": "2025-08-11T20:30:19.621Z"
}
