{
  "title": "NUMS, DRAP ink 5-year DOU on information exchange, capacity building",
  "link": "https://www.app.com.pk/national/nums-drap-ink-5-year-dou-on-information-exchange-capacity-building/",
  "date_published": "2021-03-17T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 17 (APP):The National University of Medical Sciences (NUMS) and the Drug Regulatory Authority of Pakistan(DRAP) Wednesday inked a five-year Document of Understanding (DoU) to exchange information, compliance, training and capacity building in view of the university’s plans revolving around bio-equivalence and clinical trials involving human subjects.\nNUMS Vice Chancellor Lt Gen (Retd) Syed Muhammad Imran Majeed and DRAP Chief Executive Officer Asim Rauf signed the agreement at a ceremony here, a news release said.\nDirector NUMS Office of Research, Innovation and Commercial (ORIC) Dr Awais Siraj and DRAP Director Pharmacy Services Dr. Abdul Rashid were also present during the signing ceremony.\nOn the occasion, the Vice Chancellor said NUMS was planning to set up a National Institute of Advanced Studies and Research (NIASAR).\nThe planning division of Finance Ministry, he said, had earmarked special funds to specifically train NUMS’s faculty from the world leading universities like Harvard and Queen Mary for supporting the national endeavor of research and development.\nNUMS Pro Vice Chancellor Administration Maj Gen ((Retd)) Syed Ammar Reza Hamadani , who was present on the occasion, was working on this project, he added.\nThe vice chancellor said the DOU between the two institutions would help realize words of the Father- of- the Nation, Quaid-e Azam Muhammad Ali Jinnah, who once said, that whatever products are created, should carry the brand name of Pakistan.\nDRAP CEO Asim Rauf billed the DOU as ‘a paradigm shift to further achieve DRAP and NUMS objectives’ to lay foundation for research and quality products in the country.\nHe said the percentage of spurious and sub-standard drugs in Pakistan were almost the same as were in the United States of America and Europe.\nThe establishment of state of the art bio-equivalence laboratory at the National Institute of Advanced Studies and Research would improve standard of medicines in the country, he added.\nThe cooperation between the two national institutions, he said, would synergize DRAP to monitor and manufacturing of products which would help flush out spurious drugs from the country.",
  "retrievedAt": "2025-08-11T20:30:11.957Z"
}
