{
  "title": "Helping orphans, vulnerable children our religious obligation: AJK President",
  "link": "https://www.app.com.pk/national/helping-orphans-vulnerable-children-our-religious-obligation-ajk-president/",
  "date_published": "2021-03-17T14:57:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 17 (APP):President Azad Jammu and Kashmir (AJK) Sardar Masood Khan on Wednesday said it was our religious, moral and social obligation to take care of orphans, helpless and indigent children and their families.\nHe was talking to a delegation consisting of senior National Deputy Director Aghosh Home, Air Vice Marshal (retd) Farooq Habib, Vice President Al-Khidmat Foundation Pakistan Salim Ranjha and Air Commodore (Retd) Mohsin Mirza in the federal metropolis, AJK President office said.\nThe state president appreciated the volunteers of the Al-Khidmat Foundation for serving poor and vulnerable people in remote and inaccessible areas of Pakistan and Azad Kashmir.\nTerming Al-Khidmat as one of the leading organizations fully dedicated to humanitarian services, President Masood appreciated the efforts of the organization during the coronavirus pandemic and in the wake of any other disasters in Pakistan and Azad\nJammu and Kashmir.\nHe added that the services of Alkhidmat and its subsidiaries to take care of orphans and destitute children would never be forgotten. Terming the people of Pakistan as the most benevolent in the world, the AJK president said Pakistanis donated billions of rupees to cater for the financial needs of the poor and the vulnerable communities, and this spirit was least witnessed in any other part of the world.\nEarlier, members of the delegation apprised the state president of the social services of the Foundation, said Al Khidamt has been working over the years in disaster relief, provision of healthcare facilities, clean drinking water, vocational training and also providing interest-free loans for establishing small scale businesses for poor and vulnerable.\nThe members of the delegation said Al Khidmat has also been actively working during the recent coronavirus pandemic. Over 31500 volunteers of the organization have distributed food and aid amongst people.\n11 special units and quarantine centres have been set up by the organization and also disinfection of mosques, churches, other places of religion, localities have been carried out by the organisation.\nThe delegation further briefed the President of the working of the Aghoosh Orphan Care Programme. Currently, 14 centres were operational and 15 more centres were being constructed and planned. Almost 1200 orphans were living in these centres.\nAround 15000 orphans have benefited from this orphan care programme, which also included family support. Alkhidmat delegation also apprised the President of the Aghoosh excellence centre located on Murree Expressway and invited him to visit the state of the art institution.\nThey said two schools in Rawalakot and Bagh built by the organization were satisfactorily functioning and said that another orphan school would soon be opened in Mirpur.",
  "retrievedAt": "2025-08-11T20:30:10.561Z"
}
