{
  "title": "UET organizes int’l conference on energy conservation",
  "link": "https://www.app.com.pk/national/uet-organizes-intl-conference-on-energy-conservation/",
  "date_published": "2021-03-17T18:19:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 17 (APP):The Centre for Energy Research & Development (CERAD) of the University of Engineering and Technology (UET) Lahore organized 4th IEEE International Conference on Energy Conservation and Efficiency (ICECE) 2021 virtually in collaboration with IEEE Power & Energy Society (PES), IEEE Industry Application Society (IAS) Lahore Chapter, IEEE Lahore Section, and Punjab Energy Efficiency and Conservation Agency (PEECA).\nAt least 116 scholars from 17 countries including US, China, India, UK, Japan, South Korea, Italy, Turkey, Saudi Arabia, Canada, Bangladesh, Indonesia, Sri Lanka, Portugal, Poland and Iraq submitted their research papers at the conference, out of which 31 research papers were presented at the conference.\nInaugural session of the conference was addressed by the Provincial Minister for Energy Akhtar Malik, Chairman Prime Minister’s Task Force Dr. Ata-ur-Rehman, Chairman Punjab Higher Education Commission (PHEC) Prof. Dr. Fazal Ahmad Khalid and Vice Chancellor UET Lahore Prof. Dr. Syed Mansoor Sarwar. MD PEECA Adnan Mudassir and Director CERAD Dr. Waqar Mahmood also addressed the conference.\nOn this occasion, Punjab Energy Minister Dr Akhtar Malik congratulated UET for holding this international conference. He said that such conferences were necessary to overcome the energy crisis in the country.\nThe Energy Minister said that the Punjab government has saved a lot of energy by setting up four major departments on modern techniques of energy. He was of the view that government started using modern equipment in these departments by abolishing the old methods of electricity.\nDr. Ata-ur-Rehman, Chairman, Prime Minister’s Task Force, briefed the participants on the vision of the Government of Pakistan. He said that massive efforts are being made to promote green energy in Pakistan which would help in controlling pollution in the country. While millions of rupees will be saved.\nVice Chancellor UET Prof. Dr. Syed Mansoor Sarwar vowed to continue UET’s efforts to overcome the energy crisis in Pakistan.\nA panel discussion was also organized among the representatives of various organizations in the conference in which representatives of Punjab Energy Efficiency and Conservation Agency, National Energy Efficiency and Conservation Authority, Pak Solar Association, Coal and Mining Departments participated. At the 4th Annual International Conference, various industries and CERAD also showcased their projects.",
  "retrievedAt": "2025-08-11T20:30:26.231Z"
}
