{
  "title": "PDM part of history: Dr Firdous",
  "link": "https://www.app.com.pk/national/pdm-part-of-history-dr-firdous/",
  "date_published": "2021-03-17T15:55:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 17 (APP):Special Assistant to Chief Minister on Information Dr Firdous Ashiq Awan on Wednesday said that Pakistan Democratic Movement (PDM) was now the part of history as the umbrella alliance of 11 assorted parties and pressure groups had met its tragic death.\nAddressing a press conference here at DPGR office, she said that ‘Mr 10 per cent’ deserved salute for doing the much-needed job. She said the whole politics of Maryam Safdar revolved around ranting against the state institutions and personal attacks on Prime Minister Imran Khan.\nShe said that Asif Ali Zardari had fully understood the importance of ‘Pakistan Khappay’ slogan but Maryam Safdar had a different agenda to please the foreign masters and this was fully evident from the abhorrent statement of PML-N MNA Mian Javaid Latif.\nThe SACM said the PPP had won the ‘championship’ as it achieved success in the senate election, formed its government in Sindh and saved its skin.\n“I am thankful to Asif Ali Zardari for proving my words right as he refused to give resignations as desired by Maryam Safdar and Maulana Fazalur Rehman,” she said.\nDr Firdous said that Maryam was making tall claims to send the elected government back home just for safeguarding her father and the looted money but all her efforts ended in vain.\nThe PDM was an unnatural alliance with no common agenda and its narrative had been buried once and for all, she said.\nShe said that Maryam Safdar herself confessed that Nawaz Sharif had a threat from NAB but in reality, Nawaz Sharif was afraid of losing the looted money while Ishaq Dar could become approver anytime.\nIt was in everybody’s knowledge that Shahid Khaqan Abbasi helped Ishaq Dar to escape from the country by using state resources, she alleged.\nShe said Punjab Chief Minister Sardar Usman Buzdar would visit every district of the province to ensure composite development as the PTI government was determined to develop every district of the province.\nShe said that price hike was the biggest challenge and the government had announced a subsidy of Rs 7 billion, adding that the government was ensuring the availability of essential commodities at cheap rates in 313 subsidized bazaars.\nShe said that a digital mechanism had been evolved to protect consumers’ rights and to keep a vigilant eye on prices and authority had been set up in this regard.\nDr Firdous said the current wave of COVID-19 pandemic was more dangerous than previous and urged the masses to follow the SOPs strictly and asked the media to play its role in the awareness campaign.\nShe said that vaccination of elderly citizens was going on well while paramedics, nurses and other medical staff had already been vaccinated. The government is contemplating vaccinating media persons for being front-line workers, she added.\nResponding to a question, Dr Firdous said that Usman Buzdar was enjoying full confidence of the PM and rumours about his removal have no basis.\nTo another question about Maryam’s political future, the SACM said that Maryam Safdar was making tall claims to overthrow the government but her wishes never came true, she is upset due to ditching of PPP and the clever moves of Bilawal Zardari. She said that Shehbaz Sharif’s intriguing silence shows that the Sharif family was facing internal chaos.\nShe said the PM desired to give the right of direct vote to the people in local bodies election to discourage horse-trading.\nThe PTI was striving for a transparent LB system where development was done by local representatives instead of parliamentarians, she added.",
  "retrievedAt": "2025-08-11T20:30:27.351Z"
}
