{
  "title": "Senate chairman refers PEMRA Bill to standing committee for fine tuning",
  "link": "https://www.app.com.pk/national/senate-chairman-refers-pemra-bill-to-standing-committee-for-fine-tuning/",
  "date_published": "2023-08-04T16:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP): Senate Chairman Muhammad Sadiq Sanjrani on Friday referred the Pakistan Electronic Media Regulatory Authority (Amendment) Bill, 2023, to the Standing Committee on Information and Standing Committe for further refinement and improvement in response to the concerns raised by the senators.\nThe amended PEMRA bill, drafted after in-depth debate and consultations with all the stakeholders and presented by Minister for Information and Broadcasting Marriyum Aurangzeb, has already been passed by the National Assembly.\nUnder the bill, the powers of the PEMRA chairman have been given to the Council of Complaints.\nSenator Tahir Bizinjo suggested that the bill should be sent to the standing committee to address the concerns of media persons.\nSenator Mushtaq Ahmed stated that the journalists organizations had rejected the bill.\nThe Upper House of the Parliament also passed 14 bills, including The National Anti-Money Laundering and Counter Financing of Terrorism Authority Bill, 2023, presented by Minister of State for Foreign Affairs Hina Rabbani Khar;The Gas (Theft Control and Recovery) Bill, 2023, introduced by Minister for Energy, Khurram Dastgir Khan; The Federal Urdu University of Arts, Sciences, and Technology, Islamabad (Amendment) Bill, 2023, presented by Minister for Finance and Revenue, Muhammad Ishaq Dar; The National Skills University Islamabad (Amendment) Bill, 2023, moved by Minister for Finance and Revenue, Muhammad Ishaq Dar; The Imports and Exports (Control) (Amendment) Bill, 2023, presented byMinister for Law and Justice, Azam Nazir Tarar; The Trade Marks (Amendment) Bill, 2023, brought forward by Ministerfor Law and Justice, Azam Nazir Tarar; The Hajj and Umrah (Regulation) Bill, 2023 and The Pakistan Ruet-e-Hilal Bill, 2023, both bills presented by Minister for Religious Affairs and Interfaith Harmony, Talha Mehmood; The Emigration (Amendment) Bill, 2023, introduced by Minister for Law and Justice, Azam Nazir Tarar; The Press Council of Pakistan (Amendment) Bill, 2023 presented by Minister of Information and Broadcasting, Marriyum Aurangzeb; The Protection of Journalists and Media Professionals (Amendment) Bill, 2023; The Press, Newspapers, News Agencies, and BooksRegistration (Amendment) Bill, 2023; The Gun and Country Club Bill, 2023; and The National Logistics Corporation Bill.\nFor the passage of the Press Council bill, the chairman had to order a count. The outcome of the count showed that 16 senators voted in favour of the bill, while nine opposed it.",
  "retrievedAt": "2025-08-11T09:03:57.600Z"
}
