{
  "title": "Chairman NDMA along with delegation paid visit to US",
  "link": "https://www.app.com.pk/national/chairman-ndma-along-with-delegation-paid-visit-to-us/",
  "date_published": "2023-08-04T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP): Chairman National Disaster Management Authority (NDMA), Lieutenant General Inam Haider Malik along with a ten-member delegation visited the United States of America (USA) from 23 to 29 July on special invitation from Headquarters US Army Central (ARCENT).\nThis visit was the follow-up to the visit of Commanding General ARCENT, Lieutenant General Patrick D. Frank to the NDMA in June this year and a continuation of bilateral engagements between US ARCENT and NDMA, said a news release issued here Friday.\nThe Chairman NDMA and the delegation were received by Deputy Commanding General ARCENT, Major General Henry S. Dixon and his staff at Shaw Air Force Base in Colombia, South Carolina.\nThe objective of the visit was to enhance mutual cooperation among both countries and armies in the field of disaster management.The delegation visited US Central Command (CENTCOM), where they were welcomed by Lieutenant General Patrick D. Frank through video link.\nThe delegation also visited State Emergency Operations Centre (EOC) in South Carolina, Federal Emergency Management Agency (FEMA) Regional Headquarters in Georgia Atlanta, USAID and FEMA Headquarters in Washington.\nThe delegation was also briefed by US Army Corps of Engineers (USACE) Transatlantic Division and Deputy Executive Director of Pacific Disaster Center, University of Hawaii. Pakistan’s Ambassador to the USA, Masood Khan hosted a luncheon in honour of the delegation.\nThe visit gave an insight into the procedures and latest technologies being employed by US counterparts for threat identification, risk analysis, risk mitigation and response generation, which will prove beneficial for enhancement in the sphere of disaster Management in Pakistan.",
  "retrievedAt": "2025-08-11T09:04:12.023Z"
}
