{
  "title": "Court seeks arguments from Imran Khan’s counsel regarding maintainability of criminal case",
  "link": "https://www.app.com.pk/national/court-seeks-arguments-from-imran-khans-counsel-regarding-maintainability-of-criminal-case/",
  "date_published": "2023-08-04T15:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP): A lower court on Friday summoned Chairman PTI Imran Khan along with his lawyers for arguments in a case pertaining the maintainability of the toshakhana case following the orders of Islamabad High Court (IHC).\nAdditional District and Session Judge Hamayun Dilawar heard the criminal case against former prime minister Imran Khan.\nDuring the course of proceeding, counsel for ECP Amjad Pervaiz argued that all documents were filed by the accused himself after signing it, that’s why there was no question regarding its acceptance. The said that the gifts received from toshakhana and challan submitted to national assembly were the part of the record.\nThe lawyer said that the former prime minister and his wife had received a total of 58 gifts, adding that the value of 14 gifts was evaluated more than Rs30,000. As per the accused they had purchased four gifts against Rs21.6 million, he said, adding that cufflinks, watches, ring and iPhone were included in the gifts. He said that the gifts were received after payment of 20% price in 2018-19. It had been told that the gifts of jewelry were received by the wife of former prime minister, he said.\nThe lawyer said that the former prime minister had mentioned no any jewelry in form-B submitted to the ECP, adding that the accused had admitted the facts it in his statement under section-342.  The former prime minister had received five gifts in 2020-21 including Rolex watch, cufflinks, ring, suit, necklace, bracelet and others, he said. The lawyer said that he couldn’t admit that the former prime minister was not owning any vehicle. What would happened if Imran Khan disclosed jewelry owned by him before public, he asked.\nThe lawyer said that the former prime minister had declared the value of his three house worth only five lac in last four years. The PTI chairman had stated that he was no owning any jewelry, he said and concluded his argument.\nPTI’s lawyer Asim Baig appeared before the court and adopted the stance that the SC had declared that the trial court couldn’t issue final judgment until their appeal was pending in high court and prayed the court to adjourn the case till the decision of IHC. The judge asked the lawyer to present order if any regarding the stay into the proceeding. The court said that the attitude of the defence lawyers was unprofessional.\nLater, the lawyer told the court that the high court had remanded back the case pertaining the admissibility of the criminal case and instructed it to re-hear it. However, the court had not issued any stay against the proceeding.\nECP’s counsel also told the judge that the petition pertaining transfer of the case had been rejected by the high court and FIA had been directed to probe into the fake social media posts associated with the name of judge.\nThe court said that the ECP’s lawyer had already given arguments regarding the maintainability of the case and asked Imran Khan’s counsel to give arguments tomorrow.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:04:04.889Z"
}
