{
  "title": "Seminar held in Brussels to mark “Youm-e-Istehsal Kashmir”",
  "link": "https://www.app.com.pk/national/seminar-held-in-brussels-to-mark-youm-e-istehsal-kashmir/",
  "date_published": "2023-08-04T18:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP):The embassy of Pakistan Brussels organized a seminar on the eve of Youm-e-Istehsal (Day of exploitation) Kashmir to express its firm support to the people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe seminar which was held in hybrid format was aimed at highlighting the human rights violations by the Indian government in the IIOJK especially in the wake of August 5, 2019 actions to modify the status contrary to the international commitments.\nFormer Member of the European Parliament Phil Bennion, Chairman Kashmir Institute of International Relations Altaf Hussain Wani, Former President Kashmir Chamber of Commerce & Industry Dr. Mubeen Shah and Chairman EU Kashmir Council Ali Raza Syed expressed their views focusing on the gross violations by the Indian forces of the right to liberty, health, education, expression, assembly and freedom of religion.\nWhile highlighting the grave human rights situation in the IIOJK, the panellists called upon India to cease atrocities against innocent Kashmiris who were suffering under its illegal occupation for over past seven decades. They termed Indian actions since 05 August 2019, illegal and in violation of the international law, and demanded their unconditional revocation.\nIn her remarks, the Ambassador of Pakistan to the EU, Belgium and Luxembourg, Amna Baloch apprised the audience about the unabated atrocities being committed by the Indian security forces, especially after illegally revoking the special status of the IIOJ&K on 5th August 2019. She underscored that over 900,000 Indian occupation forces turned IIOJK into the world’s largest open prison and the most militarized zone in the world, which necessitates intervention from the international community especially UN and the European Union. The ambassador reiterated Pakistan’s political, diplomatic and moral support for the Kashmiri people’s just cause of self-determination according to the relevant resolutions of the UN Security Council.\nThe event was attended by representatives of media, scholars, Pakistani and Kashmiri diaspora.",
  "retrievedAt": "2025-08-11T09:03:56.797Z"
}
