{
  "title": "Pakistan to continue moral, political, diplomatic support to Kashmiris: PM",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-moral-political-diplomatic-support-to-kashmiris-pm/",
  "date_published": "2023-08-04T18:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Prime Minister Shehbaz Sharif said Pakistan will continue to lend its unstinted moral, political and diplomatic support to the rightful and just cause of the freedom struggle of the Kashmiri people.\nIn a message on the Youm-e-Istehsal to be observed on August 5, 2023, he said, “It is Pakistan’s abiding commitment and promise to our Kashmiri brothers and sisters that we will echo their voices, at every forum until the world takes action and urges India to end its egregious human rights violations and forcible occupation of IIOJK, undo all unilateral and illegal measures it has taken since 5 August 2019, and take necessary steps to carry out a fair and impartial plebiscite in accordance with the United Nations Security Council resolutions.”\n“It has been four years since India unilaterally and illegally revoked the special status of Indian Illegally Occupied Jammu & Kashmir (IIOJK) on 5 August 2019. Since then, India has resorted to use of brutal force and violence to suppress the Kashmiri people. It has also undertaken a series of measures clearly aimed at altering the internationally recognized disputed status of IIOJK. In particular, India has tried to bring about demographic changes to undermine the right to self-determination of the Kashmiris.”\n“The recent steps by India indicate its nefarious designs to disenfranchise the Muslim majority population of Kashmir. To this end, it has carried out a selective delimitation of electoral constituencies, issued fake domiciles to millions of non-Kashmiris, and added hundreds of thousands of temporary residents to alter the existing voter rolls. These are part of a well thought-out strategy to change Kashmir’s demography and political landscape. Pakistan outrightly rejects all such unilateral and illegal steps,” he added.\nThe prime minister said, “The barbaric and brutal occupation of IIOJK by India not only violates international law, but also makes a mockery of the globally accepted norms of fundamental rights and freedoms. The international community can no longer remain silent while India continues to perpetrate its oppression in Kashmir.”\n“Despite more than seven decades of Indian occupation, including four painful years of continuous military siege and media blackout, India has failed to silence the voices of the brave Kashmiri people, whose just freedom struggle has further intensified. Three successive generations of innocent Kashmiris have sacrificed their lives and liberties, but courageously continued to defy the increasing coercion of the Indian occupation forces. Pakistan salutes these brave Kashmiri men and women and assures them of its continued resolute support in their cause for freedom from Indian subjugation,” he added.\nIndia’s failure to honour its commitments to the Kashmiri people and to the international community as well as to the United Nations, brought into question its standing as a responsible member state, he said adding India’s refusal to grant the Kashmiris their inalienable right to self-determination had serious implications for South Asia and beyond.\n“The people of South Asia desire peace and stability and this can only become possible through meaningful and purpose-oriented dialogue between India and Pakistan that includes discussion on all outstanding issues, including the Jammu and Kashmir dispute,” he concluded.",
  "retrievedAt": "2025-08-11T09:03:56.322Z"
}
