{
  "title": "Major reforms needed to achieve economic independence: PM",
  "link": "https://www.app.com.pk/national/major-reforms-needed-to-achieve-economic-independence-pm/",
  "date_published": "2023-08-03T19:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP):: Prime Minister Shehbaz Sharif Thursday said now Pakistan was out of danger of financial default but the next government would have to undertake major reforms to achieve economic independence and lessen burden on the common man.\nSpeaking at a dinner hosted by him for leadership of allied parties, he said after formation of the coalition government on April 11 last year, he faced unprecedented challenges including economic difficulties, cumbersome talks with International Monetary Fund, disastrous floods, hyper inflation and political chaos.Imran Niazi and his gang created political chaos with their baseless accusations, riots and long marches, he recalled.\nNo country could make progress without political stability, he said adding politics of the country was poisoned with the culture of baseless allegations and abuse.\nShehbaz Sharif said the uphill challenge of IMF gave him sleepless nights as lack of IMF agreement would have burdened the economy, put pressure on foreign exchange reserves, devalued the rupee and caused unemployment.\nHe said he had critical talks with Managing Director IMF in Paris which finally led to successful conclusion of the agreement.\nHe said the government of Imran Niazi damaged foreign relations with its irresponsible attitude towards friendly countries including China and by levelling false accusations of corruption in the Chinese led projects.This irresponsible behaviour was against the interests of Pakistan, he stressed.\nHe said his government restored relations with China which in the past had invested more than $25 billion in infrastructure projects in Pakistan.\nHe said brotherly countries including Saudi Arabia, United Arab Emirates and Islamic Development Bank bridged the financing gap of $ four billion to meet requirements for an IMF deal.China supported Pakistan and in the last three months provided $4.5 billion and sided with the country at the United Nations in sensitive matters, he informed.President of China reiterated recently that his country would never leave Pakistan alone, he told.\nHe said the next government needed to ensure education and health facilities for people and employment for youth.\nHe said power sector losses amounted to Rs 450 billion every year while loss of some power distribution companies were at 50 percent and power theft was also alarming.\nHe thanked the coalition partners and his party leadership including Nawaz Sharif, Asif Zardari, Maulana Fazlur Rehman and others for their guidance and support and for reposing confidence in him in the National Assembly.\nHe also lauded Speaker National Assembly and Chairman Senate for amicably running proceedings of the Parliament.",
  "retrievedAt": "2025-08-11T09:04:19.530Z"
}
