{
  "title": "Pakistan stands committed to Kashmiris’ cause of self-determination: Dr. Faisal",
  "link": "https://www.app.com.pk/national/pakistan-stands-committed-to-kashmiris-cause-of-self-determination-dr-faisal/",
  "date_published": "2023-08-04T13:53:00.000Z",
  "source": "APP",
  "content": "The seminar was attended by UK Parliamentarians, members of Pakistani and Kashmiri diaspora, prominent locals, representatives of the human rights organizations and media representatives.\nIn his address on the occasion, High Commissioner Dr. Mohammad Faisal highlighted the plight of Kashmiris and urged international attention to end the ongoing human rights abuses being committed by the occupation forces in IIOJK. Condemning India’s illegal actions of August 5, 2019 that stripped IIOJK of its special status, Dr. Faisal reiterated Pakistan’s firm commitment to the cause of self-determination for the Kashmiri people.\nThe High Commissioner denounced India’s tactics of land grab, eviction of locals, and media suppression, etc. He recounted the disturbing details of India’s systematic campaign to alter the demography, culture and political identity of IIOJK.\nIn conclusion, Dr. Faisal expressed gratitude to individuals and organizations worldwide advocating the rights and dignity of the Kashmiri people.\nBritish Parliamentarians and speakers expressed solidarity with the Kashmiris, urging India to end human rights violations in IIOJK. The speakers stressed the urgent need to address the longstanding Jammu & Kashmir dispute in accordance with the relevant resolutions of the United Nations Security Council.\nEarlier, a Photo Exhibition was organized at the High Commission, displaying evidence of continued atrocities committed by Indian occupation forces in IIOJK. The images served as a stark reminder of the need to address the human rights situation and work towards a peaceful resolution of the Jammu & Kashmir dispute as per the wishes of the Kashmiri people.\nWorldwide commemoration of Youm-e-Istehsal is a powerful reminder of the urgent need to address the humanitarian crisis in IIOJK, protect the human rights of the Kashmiris and the early resolution of the Jammu & Kashmir dispute.",
  "retrievedAt": "2025-08-11T09:04:06.044Z"
}
