{
  "title": "President directs UBL to refund Rs 79,500 with profit to fraud victim",
  "link": "https://www.app.com.pk/national/president-directs-ubl-to-refund-rs-79500-with-profit-to-fraud-victim/",
  "date_published": "2023-08-04T12:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): President Dr Arif Alvi has directed United Bank Ltd (UBL) to refund defrauded amount along with profit to a fraud victim and to remove the inherent flaws in their systems to prevent online fraud and fraudulent transactions.\nHe also instructed the bank to educate their customers about the pros and cons of online funds transfer facility before activating digital banking.\nThe president gave these remarks while deciding upon a representation filed by UBL against the decision of Banking Mohtasib directing it to refund Rs 79,500 to Abdul Rauf (the complainant), whose account was fraudulently debited through the Inter-Bank Funds Transfer (IBFT) facility, a President House press release said Friday.\nHe urged banks to comply with the relevant rules and regulations of the State Bank of Pakistan (SBP) regarding online funds transfer facility, customer consent and authentication of transactions.\nThe president also asked Banking Mohtasib Pakistan to approach SBP and other banks that on the rejection of a complaint of a bank customer about a disputed transaction, the customer should be informed in a simple letter that they could approach the institution of Banking Mohtasib for relief.\nAs per details, the complainant had received a call from a phone number similar to the bank’s helpline, and the caller introduced himself as the bank’s representative and asked for his banking details/credentials, which he provided.\nLater, his account was debited with a total amount of Rs 79,500 through IBFT even though he had never activated the Internet Banking Facility.\nHe approached the bank to retrieve his lost amount but to no avail. Feeling aggrieved, he raised the matter with Banking Mohtasib , which passed the orders in his favour. The bank, then, filed a representation with the president against Mohtasib’s decision.\nBefore deciding upon the representation, the president held a hearing of the case, at Aiwan-e-Sadr, in which the complainant and UBL’s representative appeared.\nUBL’s representative contended that 16 transactions of multiple small amounts were conducted from the complainant’s bank account. He further said that the complainant should have kept his personal credentials secure and the bank could not be held responsible for the disputed transactions as the customer himself shared his banking information with the caller.\nThe president pointed out that the bank was confusing two different steps with each other as the first step was obtaining the customer’s consent for availing IBFT facility and the second step was the customer’s authentication before conducting the banking transaction.\nHe said that the Bank had opened this channel without the customer’s consent, without informing him about the pros and cons of the facility, even though he was not familiar with digital banking.\nHe added that without the default opening of the IBFT facility, the fraud would not have been possible.\nIn his decision, the president held that the Bank did not comply with SBP’s directives which made it clear that customer consent had to be obtained, and non-compliance on UBL’s part amounted to maladministration.\nHe, therefore, rejected the bank’s representation and further asked UBL to improve its system and provide information to customers at the time of opening the bank accounts.\nHe directed UBL to refund Rs 79,500 to the customer along with the profit within 30 days.",
  "retrievedAt": "2025-08-11T09:04:15.970Z"
}
