{
  "title": "Kashmiris on both sides of LoC will observe Youm-e-Istehsal tomorrow",
  "link": "https://www.app.com.pk/national/kashmiris-on-both-sides-of-loc-will-observe-youm-e-istehsal-tomorrow/",
  "date_published": "2023-08-04T18:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 4 (APP): Kashmiris on both sides of the Line of Control (LoC), in Pakistan and all over the world will observe Youm-e-Istehsal, tomorrow, August 5, to register their protest against Narendra Modi-led Hindutva Indian government’s illegal action taken on that day in 2019.\nPresident Dr Arif Alvi has resolved that Pakistan would continue to be the voice of its Kashmiri brothers and sisters, who had been making invaluable sacrifices and would extend all possible support for the fullest realization of their legitimate rights.\n“We have no doubt that durable peace and stability in South Asia can only be achieved through a peaceful resolution of the Jammu and Kashmir dispute, in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people,” the president said in his message on Youm-e-Istehsal annually observed on August 5.\nHe said that India unleashed its illegal and unilateral actions on August 5, 2019, in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) with the aim of disempowering, disenfranchising, and dispossessing the Kashmiri people in their own land.\nPrime Minister Shehbaz Sharif said Pakistan will continue to lend its unstinted moral, political and diplomatic support to the rightful and just cause of the freedom struggle of the Kashmiri people.\nIn a message on the Youm-e-Istehsal to be observed on August 5, 2023, he said, “It is Pakistan’s abiding commitment and promise to our Kashmiri brothers and sisters that we will echo their voices, at every forum until the world takes action and urges India to end its egregious human rights violations and forcible occupation of IIOJK, undo all unilateral and illegal measures it has taken since 5 August 2019 and take necessary steps to carry out a fair and impartial plebiscite in accordance with the United Nations Security Council resolutions.”\nAdvisor to Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira briefed the prime minister about the planned activities for Yaum-e-Istehsal-e-Kashmir to be observed on August 5, including seminars and awareness drives, particularly the ceremonies scheduled to be held at Pakistan’s diplomatic missions across the world.\nAhead of ‘Youm-e-Istehsal’ on August 5, Foreign Secretary Dr Asad Majeed Friday here briefed the Islamabad-based diplomatic missions on the latest developments in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nAccording to Foreign Office, he highlighted the legal, security and human rights dimensions of the situation in IIOJK.\nMinister for Parliamentary Affairs Murtaza Javed Abbasi on Friday informed the National Assembly that Pakistan has always forcefully raised the plight of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) at all world forums.\nReplying to a question during Question Hour, he said all the political parties of the country have a united stance on the Kashmir dispute.\nChina on Friday reiterated its clear and consistent position on the Kashmir issue ahead of “Yaum-e-Istehsal-e-Kashmir”, and called for proper and peaceful resolution of the longstanding issue under the United Nations (UN) Charter, UN Security Council’s resolutions and bilateral agreements.\n“China’s position on the Kashmir issue is consistent and clear. This issue is a dispute left over from history between India and Pakistan and should be resolved in accordance with the UN Charter, relevant UN Security Council’s resolutions and bilateral agreements in a properly and peaceful manner,” a Chinese Foreign Ministry spokesperson said ahead of the fourth anniversary of India’s unilateral and illegal act in the Indian Illegally Occupied Jammu & Kashmir.\nPeople of Khanewal would express solidarity with their Kashmiri brethren on Saturday, Aug 5, by joining different programmes including seminars and rallies as part of the observance of Youm-e-Istehsal-e-Kashmir.\nPeople from different walks of life including traders, journalists, writers, teachers, students, religious leaders and social workers would attend the main ceremony at district headquarters, Zila Council Hall. DPO Rana Omar Farooq and ADCR Azooba Azeem would join the ceremony as special guests.",
  "retrievedAt": "2025-08-11T09:03:57.038Z"
}
