{
  "title": "Streamlining visa issuances: Hina enhances efficiency, accountability for Afghan nationals’ applications",
  "link": "https://www.app.com.pk/national/streamlining-visa-issuances-hina-enhances-efficiency-accountability-for-afghan-nationals-applications/",
  "date_published": "2023-08-04T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 04 (APP): Minister of State for Foreign Affairs, Hina Rabbani Khar, on Friday, shedding light on the intricacies surrounding visa issuances for Afghan nationals in the Senate.\nRecognizing the complexity of the matter during the question, she emphasized that national foreign missions receive a staggering number of routine visa applications, making the process multifaceted.\nIn her statement, Hina outlined the commitment of the national diplomatic mission to extend leniency in granting visas on grounds of health or humanitarian reasons.\nHowever, she underscored that this benevolent intention sometimes led to misuse by Afghan nationals, causing challenges within the system.\nAn important revelation was made by Hina as she highlighted the comprehensive overhaul of the visa issuance process. Presently, the authority to grant visas, especially in cases requiring relaxation, rested solely with the head of the mission, she said adding that this shift in power had been enacted in the last two months, with the delegation of such authority withdrawn from other embassy staff.\nModernizing the approach to visa facilitation, Hina detailed the introduction of an online visa application system. Additionally, specific staff members had been entrusted with the responsibility of evaluating all necessary formalities before granting visas, she added.\nAddressing concerns raised by senators, the minister of state for foreign affairs responded to questions regarding a specific incident. She revealed that an individual named Sair Khan, while serving as a Cypher Assistant at the Pakistani embassy in Stockholm, Sweden, had been found to be in violation of government guidelines by issuing visas to Afghan nationals.\nShe said immediate action was taken as Khan was promptly recalled from his mission adding that the matter had also been referred to the Federal Investigation Agency for a comprehensive inquiry and appropriate measures.\nIn a bid to enhance transparency, efficiency, and accountability, Minister Hina Rabbani Khar’s initiatives marked a significant step forward in the realm of visa issuances for Afghan nationals.\nIn a recent session, Senator Mohsin Aziz from the Pakistan Tehreek-e-Insaf party raised questions regarding the alleged misuse of vehicles under the Ministry of Foreign Affairs.\nMinister Hina Rabbani Khar promptly responded to the concerns, asserting that there had been no misuse of vehicles within the ministry.\nAddressing the issue of vehicles being used by Pakistani missions abroad, she dispelled any misconceptions, terming the notion of misuse as a mistaken perception. She emphasized that the vehicles, including those from embassies, were utilized properly, even accommodating ministerial delegations.\nShe proposed a comprehensive analysis with expenditures of other national institutions, such as the National Assembly or Senate considering expenses related to petrol, oil, lubricants, and vehicle maintenance. This, she argued, would enable a more accurate assessment of the financial management involved.\nHina also shed light on the ministry’s efforts to enhance transparency. She revealed plans to centralize the audit of all administrative expenses through an online dashboard. This initiative aimed to make expenditure details accessible to every citizen, ensuring accountability and openness, she maintained.\nSenator Danesh Kumar from the Balochistan Awami Party commended Minister Hina Rabbani Khar for her meticulous financial management. He acknowledged the stark contrast between the current low expenditure and previous reports of higher expenses under different governments.\nAs the discussion unfolded, Minister Hina Rabbani Khar effectively addressed concerns, highlighting the responsible and accountable approach of the Ministry of Foreign Affairs towards vehicle usage and financial management.",
  "retrievedAt": "2025-08-11T09:04:08.586Z"
}
