{
  "article_id": "2025-10-12_fdf5ed6fa1fe1220fc60e128be3f60ba",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-deeply-concerned-at-aggression-by-afghan-taliban-fitna-e-khawarij-fo-spokesperson/",
    "retrieved_at": "2025-10-16T23:54:55.554Z"
  },
  "metadata": {
    "title": "Pakistan deeply concerned at aggression by Afghan Taliban, Fitna-e-Khawarij: FO Spokesperson",
    "author": null,
    "date_published": "2025-10-12T22:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 464,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 12 (APP): Pakistan is deeply concerned at the unwarranted aggression by the Afghan Taliban, Fitna-e-Khawarij and Fitna-e-Hindustan along the Pak-Afghan border on the night of 11-12 October, the Foreign Office (FO) Spokesperson said in a statement here on Sunday. He said, \"Such unprovoked actions aimed at destabilising the Pak-Afghan border belie the overall spirit of peaceful neighbourhood and cooperative relations between the two brotherly countries.\" \"Pakistan, exercising its right of self-defence, not only effectively repulsed the assaults all along the border, but also inflicted heavy losses on Taliban forces and affiliated Khwarjis, in terms of men, material and infrastructure. These infrastructures were used to plan and facilitate terrorist attacks against Pakistan. In our targeted and precise response, all possible measures were taken to prevent any collateral damage and protect civilians,\" he added. \"Pakistan greatly values dialogue and diplomacy and a mutually beneficial relationship with Afghanistan,\" he said, adding, \"At the same time, the Government of Pakistan continues to closely monitor the situation and would take all possible measures to safeguard its territory and the lives of its people. Any further provocations would be met with an unwavering and befitting response.\" He said, \"Pakistan strongly rejects assertions and insinuations by the Interim Afghan Foreign Minister in India to divert attention from the presence of terrorist elements in Afghanistan. By making these baseless assertions, the Taliban regime cannot absolve itself of its responsibilities towards regional peace and stability. Continued presence of terrorist elements on Afghan soil and the freedom of activities enjoyed by them in Afghanistan are well documented in UN Monitoring Team reports.\" \"The fight against terrorism is a common cause. Instead of shifting responsibilities, the Taliban regime should honour its commitment of not allowing its territory to be used for terrorism against other countries, as well as play its due role in achieving peace and stability in the region and beyond,\" he continued. He said, \"Pakistan has repeatedly shared its concerns related to the presence of Fitna-e-Khawarij and Fitna-e-Hindustan operating from Afghan soil. Pakistan expects concrete and verifiable actions against these terrorist elements by the Taliban regime.\" \"Pakistan, in the spirit of good neighbourliness, Islamic brotherhood, and humanity, has generously hosted around four million Afghans for more than four decades. Pakistan will take all actions to regulate the presence of Afghan nationals on its territory, in accordance with international norms and laws,\" he remarked. He said, \"Pakistan is desirous of a peaceful, stable, friendly, inclusive, regionally connected, and prosperous Afghanistan. Pakistan expects the Taliban regime to act responsibly, honour its commitments, and play a constructive role in achieving the shared objective of rooting out terrorism from its soil.\" \"We also hope that one day, the Afghan people will be emancipated and they will be governed by a true representative government,\" he concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}