{
  "article_id": "2025-10-12_a49c764ce6dbade445d2b19ce3c95559",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-pays-glowing-tribute-to-23-martyred-soldiers-vows-firm-response-to-afghan-taliban/",
    "retrieved_at": "2025-10-16T23:56:31.472Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi pays glowing tribute to 23 Martyred soldiers; vows firm response to Afghan Taliban",
    "author": null,
    "date_published": "2025-10-12T15:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 321,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 12 (APP): Federal Interior Minister Mohsin Naqvi has paid rich tribute to the 23 brave sons of Pakistan who embraced martyrdom as a result of unprovoked firing by the Afghan Taliban and Indian-sponsored terrorists along the border areas. In a strongly worded statement, the Interior Minister said the cowardly and unprovoked attacks targeting Pakistani security forces and civilians were a gross violation of international law and would not go unanswered. He emphasized that Pakistan's valiant forces have once again demonstrated unmatched courage and professionalism in defending the nation's frontiers. \"Pakistan's brave sons have set a great example by sacrificing their lives in defense of the motherland,\" Mohsin Naqvi said. \"Their sacrifices will always be remembered as a symbol of national pride and unwavering patriotism.\" The Interior Minister offered heartfelt condolences to the families of the martyrs, assuring them that the entire nation stands shoulder to shoulder with them in this time of grief. He also prayed for the early recovery of the injured soldiers, who are being treated at various military hospitals. Praising the valor of Pakistan's armed forces, Naqvi said that the security forces gave a befitting response, eliminating more than 200 Afghan Taliban and Indian-backed terrorists during the retaliatory action. \"I pay tribute to our courageous soldiers who not only defended the homeland but also sent a clear message to those who dare to challenge Pakistan's sovereignty,\" he stated. \"The enemies' nefarious designs have been crushed by the determination and bravery of our troops.\" Naqvi hailed the security forces as the nation's true heroes, saying their dedication and sacrifice continue to guarantee the safety, stability, and integrity of Pakistan. \"The sacrifices of our martyrs are the foundation of our national strength. Pakistan will never forget the blood of its heroes,\" he affirmed. The Interior Minister reiterated the government's resolve to maintain peace along the border and deal firmly with all hostile elements working against Pakistan's security interests.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}