{
  "article_id": "2025-10-12_b658ddc846a35bd6421928aa15e3702a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/twin-cities-women-police-battle-daily-commute-to-serve-and-survive/",
    "retrieved_at": "2025-10-16T23:55:42.254Z"
  },
  "metadata": {
    "title": "Twin Citiesâ Women Police battle daily commute to serve and survive",
    "author": null,
    "date_published": "2025-10-12T17:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 585,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 12 (APP): For many women police officers in Islamabad and Rawalpindi, the day does not end when duty ends. It often begins at home before sunrise preparing breakfast, sending children to school, finishing household choresA and then continues with another challenge: reaching duty points on time and returning home without proper transport. Outside Rawalpindias Sadiqabad police station, a woman constable waves at passing vehicles. Her duty is over, but the cityas public transport has stopped due to protest rallies. No bus, no van, not even a rickshaw halts. Motorcyclists ride past without a glance. At home, her three hungry children wait for food. aI still have to knead the flour, cook for my kids, and serve my husband. But first I need to reach home a and that itself feels impossible,a she says with tired eyes. Across Pakistan, women in the police are performing double duties. At home, they are mothers, wives, and homemakers. On the streets, they are officers responsible for law and order. But unlike many of their male colleagues, they have no reliable transport to take them to and from work. One woman officer, now serving at the Police Helpline 15 Office in Islamabad, told APP: aEvery morning during rush hours I wait long for a wagon or bus. If I am late, punishment awaits me. But nobody asks how we manage to reach duty every day a and returning home is equally tough.a Another ICT Police constable from Sanam Chowk, Khanna Pul, explained how she often walks long stretches daily. aAfter finishing household chores, I leave for duty. On the way back, I also buy vegetables and groceries. Carrying heavy bags after a full day of work is exhausting, but I rush home because my children are waiting.a For women posted at checkpoints or VIP events, the problem becomes even worse. Hours of standing under the sun are followed by more hours searching for a ride. aOne colleague may drop me halfway, but my home is still far. Getting inside my street is always a struggle,a a young policewoman said. A senior female officer of Islamabad Police told APP that women personnel also lack a formal platform to raise their concerns. aThere is no union or association to represent us inside the department. That is why our problems, especially transport, remain unheard,a she said. When contacted, a senior police official acknowledged the challenge but said that some facilities exist. aWe do run shuttle services a one in the morning and one in the evening a which pick and drop women police officers along main roads. But this helps only those who live on those routes and who work fixed office hours. For special duties like Muharram processions, rallies, or protest deployments, they have to manage on their own,a the official explained. According to cautious estimates, Islamabad Police has around 500 women police officers serving in various roles. Despite their growing presence, many continue to face daily struggles simply reaching duty points and returning home. These stories show that transport is not a small issue. For women police, it is about dignity, safety, and time with their families. Many feel aabandoned by the system they serve,a pointing out that while men often arrange shared rides, women are left on their own. Despite everything, these officers say they are proud to wear the uniform. Their only demand is basic support. aWe serve with pride. But please a give us a way to reach duty and return home safely,a one officer appealed.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}