{
  "title": "Govt decides to move SC for ban on PTI & review on reserved seats verdict: Tarar",
  "link": "https://www.app.com.pk/national/govt-decides-to-move-sc-for-ban-on-pti-review-on-reserved-seats-verdict-tarar/",
  "date_published": "2024-07-15T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP): Minister for Information, Broadcasting, Culture and National Heritage Attaullah Tarar on Monday announced four major decisions of the federal the government of banning Pakistan Tehreek-e-Insaf, filing of review petition in reserved seats case, references against PTI founder and others for subverting the Constitution and strict legal action against handful of overseas Pakistanis for anti-state activities.\nHe announced the decision at a press conference which mainly highlighted the activities of the PTI and its leadership to weaken sovereignty of the country and harm its integrity at the international level.\nThe press conference also featured audio and video clips that allegedly showed involvement of the PTI and its leadership in the ‘anti-state’ activities.\nThe minister said: “This is a fact and on the record that the PTI has been involved in the anti-state activities and to this end, the government and its allies have decided to initiated legal proceedings to ban the PTI under Article 17 of the Constitution which empowers the federal government to ban any such a party.”\nTarar justified the action of the government against the PTI which, he alleged, obtained foreign funding to attack the state institutions on May 9, default the economy by sabotaging Pakistan’s negotiation with the International Monetary Fund, resettle the terrorists in the country and hire lobbying firms to get a resolution passed against the country in a foreign country’s Parliament.\nAll these activities of the PTI were established, he said, adding “in view of the foreign funding case, May 9 riots, and the cipher episode as well as the resolution passed in the US, we believe that there is very credible evidence present to have the PTI banned.”\nHe said a series of events that set off in a form of chain, gave a clear understanding of the anti-state agenda of the PTI which first brought terrorist back into the country and then attacked on the state institution to undermine its sovereignty.\nOn the one hand, they were giving shelter and safe heavens to the terrorists and on the other hand they resorted to attack the army installations including the Corps Commander House in Lahore, he said asking the PTI’s founder who gave him the authority to bring back disgruntled elements in settled areas.\nThe minister said the party used the prohibited funding to hire lobbying firms that worked to damage the integrity of the country.\nThe minister said the Election Commission of Pakistan (ECP) had given a verdict that the PTI had received prohibited funding, recalling how delaying tactics were used to prevent further proceeding in the case during the tenure of the PTI government.\nHe said it was on the record that how the PTI miserably failed to justify and defend the funding received from Israeli and Indian origin overseas persons.\nHe questioned the participation of the PTI leadership in a meeting and dinner which reportedly had a presence of an Israeli billionaire in London especially at a time when genocide of innocent Palestinians was being committed.\nRecalling how the PTI misled the nation by orchestrating a cipher drama, he said it was on record that the PTI founder suggested his confidants to play with an official document. Even Ambassador Asad Majeed, the author of cipher, said there was no threat to the country in the cipher, but the PTI leadership was hell bent upon damaging the diplomatic relations of Pakistan with the other country.\nHe said PTI’s former finance ministers Shaukat Tareen reportedly told the then provincial finance ministers to write a letter to sabotage a deal of the Government with the IMF.\nTarar said the entire family of the PTI founder was involved in May 9 attack as three of his sisters were found outside the Corps Commander House in Lahore and his nephew was seen defiling the official uniforms.\nThe workers were ordered to reach designated points for creating chaos and anarchy, he said, adding the video and audio evidences were available with the government. “We have irrefutable evidence and strong grounds to ban the party,” he noted.\nSpeaking about the time when the then-government decided to dissolve the assemblies during the no-confidence motion against Imran Khan, the minister said the ruling alliance had also decided to move a reference against the then-prime minister, then-president Arif Alvi and then former National Assembly deputy speaker Qasim Suri.\nHe said that this reference, under Article 6 of the Constitution, would be sent to the Supreme Court after the cabinet’s approval.\nAs regards anti-state campaign and conspiracies from abroad, he said a handful of overseas Pakistanis who collected funds to weaken Pakistan, did not represent the majority who had been contributing to the national economy by sending massive remittances.\nA resolution would be passed in the House to take action against such elements, he added.\nFor the last some days, he said an orchestrated campaign was underway to create a volatile situation in the country.\nThe whole nation witnessed how an impression was being created that “whatever worst one does, it could be forgone,” he said referring to the relief given to what he described as “perpetrators of the May 9, orchestrators of cipher conspiracy against country and patrons of those who hired services of the lobbyist firms abroad to get approve Parliamentary resolution.\n“Whatever happens whether they hold (intra) party elections or not, or there is an Iddat case or any other thing such as a case of 190 million pounds…the impression is that they are untouchables,” he added.\n“I want to respond to them in clear and unambiguous words that is no more,” he said while ruling out any progress of the country amid the presence of the PTI.\nAs regards a decision on reserved seats, he said it had created an impression that “the given relief is uncalled for”.\n“The PTI was not a party to the case, nor their members claimed to be members of the PTI; all of them joined Sunni Itehad Council and submitted their affidavits,” he said while asserting that the Sunni Itehad Council did not allow non-Muslim to be the members of the party which technically deprived the party of its minority seats.\n“Keeping in view the legal loophole in this judgement, the government and its allies have decided to file a review petition,” he added.\nStressing that the review petition is justified, the minister said that the women and minorities, who suffered injustices, believed that this review petition should be filed.\n“We will ask whether the MNAs who got relief were present in the court, were their affidavit present and did they ask for that relief and should the Election Act 2017 section be nullified,” said Tarar.\nMeanwhile, comparing political grooming of the Pakistan Muslim League-Nawaz and Pakistan Tehreek-e-Insaf (PTI) workers, he said the founder of the PTI was a “worst fascist” in the political history who set tradition of sending mothers and sisters of his political opponents behind bars and suspending the supply food and medicines to his opponents in the jail under his political witch-hunt.\nOn the other hand, he said the PML leadership had trained its workers to share pain, grief and happiness of their opponents, but unfortunately, it seemed that our patience and far-sightedness was being taken as weakness.\nHe also lashed out the PTI for running a malicious campaign targeting the NAB Chairman.\nTo a query, he said talks with leader of Tehreek-e-Labaik Saad Rizvi was underway and being briefed about the steps taken by Prime Minister Shehbaz Sharif to highlight plight of Palestinians at international level.\nTo another query, he said, “we respect the judiciary wholeheartedly and we have legal right to appeal against the decision and the government is going to file the review petition.”",
  "retrievedAt": "2025-08-11T03:55:39.812Z"
}
