{
  "title": "Envoys of seven nations present diplomatic credentials to President Zardari",
  "link": "https://www.app.com.pk/national/envoys-of-seven-nations-present-diplomatic-credentials-to-president-zardari/",
  "date_published": "2024-07-15T13:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP):The envoys of seven countries including Zimbabwe, Tajikistan, Rwanda, Argentina, Myanmar, Cambodia, and Botswana presented their diplomatic credentials to President Asif Ali Zardari during a ceremony held at Aiwan-e-Sadr on Monday.\nThe President received credentials from the Ambassador-designate of Zimbabwe, Titus Mehliswa Jonathan Abu-Basutu; the Ambassador-designate of Tajikistan, Sharifzoda Yusuf Toir; the High Commissioner-designate of Rwanda, Ms. Harerimana Fatou; the Ambassador-designate of Argentina, Sebastian Sayus; the Ambassador-designate of Myanmar, Wunna Han; the Ambassador-designate of Cambodia, Sok Chea; and the Ambassador-designate of Botswana, Dr. Batlang Comma Serema.\nLater, the envoys also held separate meetings with the President.\nTalking to the envoys, the President said that Pakistan had great investment opportunities and foreign countries should benefit from its investment-friendly environment. He highlighted that foreign investors should explore investment opportunities in Pakistan’s agriculture, livestock, Information Technology, energy and mining sectors.\nThe President stated that Pakistan wanted to broaden cooperation with all friendly countries in diverse fields, especially trade, investment, and culture.\nHe remarked that Pakistan attached great importance to expanding economic cooperation and further maximising trade volume with friendly countries to its fullest potential. He also called for increasing contacts among the business communities to boost economic and trade relations.\nPresident Asif Ali Zardari congratulated the envoys on their appointment as ambassadors to Pakistan and expressed the hope that they would play their role in further improving mutually beneficial cooperation.\nEarlier, the envoys were presented guard of honour by a smartly turned-out contingent of Pakistan Armed Forces upon their arrival at Aiwan-e-Sadr.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:56:00.575Z"
}
