{
  "title": "Gov’t committed to invest in modern skills, professional education for youth: PM",
  "link": "https://www.app.com.pk/national/govt-committed-to-invest-in-modern-skills-professional-education-for-youth-pm/",
  "date_published": "2024-07-15T08:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP):Prime Minister Muhammad Shehbaz Sharif on Monday said the government was committed to investing in modern skills and professional education for the youth.\nIn his message in connection with the World Youth Skills Day, the prime minister said the greatest strength of Pakistan was its talented youth and equipping them with modern skills was the need of the hour to secure the future of the country.\nHe highlighted that the government was equipping its youth with modern education, equal development opportunities as well as modern professional training to compete with the world.\nThe prime minister reiterated the government’s resolve to send 300,000 youth for vocational training in the field of information technology and 1000 for modern agriculture to China.\nIn this context, he said the government was giving top priority to the women and the youth belonging to remote and backward areas of the country.\nThe prime minister said training programs in the field of information technology were also continued at the national level. “Millions of students are honing their skills in and outside Pakistan after completing their education under these programs.”\nHe said the government had also started bringing reforms in the institutions under National Vocational and Technical Training Commission (NAVTTC).\nTogether with NAVTTC and its partner institutions, the government is ensuring the provision of marketable skills and professional training to thousands of youth, he remarked.\nHe said the government would ensure modern skills and professional training to the youth for their development and dignified employment in every field of life.",
  "retrievedAt": "2025-08-11T03:55:12.638Z"
}
