{
  "title": "Islamabad police announces comprehensive traffic plan for 9 Muharram procession",
  "link": "https://www.app.com.pk/national/islamabad-police-announces-comprehensive-traffic-plan-for-9-muharram-procession/",
  "date_published": "2024-07-15T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP): In preparation for the 9 Muharram procession, Islamabad Police, under the orders of IG Syed Ali Nasir Rizvi, has finalized a detailed security and traffic management plan.\nThe arrangements have been crafted under the supervision of DIG Islamabad Syed Ali Raza and Chief Traffic Officer Muhammad Sarfraz Virk.\nThe significant 9 Muharram Al Haram Procession will commence from Mian Imambargah in G/6-2, follow its designated route, and return to its starting point.\nTo ensure the smooth flow of the procession, the traffic arrangements have been made.\nThe road from Fazal Haq Road, Polyclinic to Kulsoom Plaza, will be closed to general traffic.\nCitizens are advised to use Jinnah Avenue from Kulsoom Plaza to China Chowk instead.\n7th Avenue will be off-limits for general traffic on both sides from Daman Koh Chowk to Chand Tara Chowk Blue Area Out Loop and from 7th Avenue Chowk Suhrawardy.\nAlternative routes include Urban Alternate Road, Jinnah Avenue, Suhrawardy Road, and Margalla Road.\nSadar Road will be closed between Iqbal Hall and Melody Chowk on both sides.\nCitizens can use Abpara Suhrawardy Road as an alternative.\nMunicipal Road from Lal Masjid to Shahada Chowk and GPO Chowk on both sides will be closed.\nShaheed Millat Road can be used as an alternative route.\nLuqman Hakeem Road from Polyclinic to Iqbal Hall will be closed. Jinnah Avenue will serve as an alternative route.\nTo assist citizens, traffic police will be deployed at key points to guide and provide alternative routes.\nCitizens are urged to use alternate routes during the procession and cooperate with traffic police to ensure a smooth flow of traffic.",
  "retrievedAt": "2025-08-11T03:55:59.414Z"
}
