{
  "title": "Govt asks for Rs1.15/unit cut in electricity rate - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Reduction to benefit consumers in all categories, except ‘lifeline’ domestic users, using up to 50 units per month\n• Relief worked out based on Nepra’s tariff determination, power purchase price, reduced subsidies under IMF deal\n• Regulator to hold public hearing on Tuesday to consider Centre’s application\n\nISLAMABAD: The government wants to reduce the electricity price for consumers across the country starting July 1, it emerged on Sunday.\n\nThe federal government has filed a petition with the National Electric Power Regulatory Authority (Nepra), requesting a Rs1.15 per unit reduction in the tariff.\n\nThe change would be applicable to all but lifeline domestic consumers.\n\nThe power division has advised against any change in electricity rates for the first two lifeline slabs of domestic consumers, as they were already over-subsidised.\n\nNepra has called a public hearing on July 1 to complete the formality before notification and application of the revised tariff.\n\nAccording to the petition, the per unit rate for lifeline consumers with up to 50 units per month would remain unchanged at Rs3.95, followed by Rs7.74 for those in the 50 to 100 units range.\n\nFor all other consumers and categories, the government has sought a flat Rs1.15 per unit reduction for FY2025-26, but the relief ranges between 3 to 10 per cent depending on their respective rates at present.\n\nFor example, protected consumers in the 1 to 100 units range would now be charged at Rs10.54 per unit, instead of Rs11.69 at present, a reduction of 9.8pc.\n\nThe subsequent slab — from 101 to 200 units — in the protected category would be charged at Rs13.01 per unit instead of Rs14.16 per unit, down 8pc.\n\nThe non-protected consumers — those consuming more than 200 units — will be charged Rs23.44 instead of Rs23.59 per unit for the first 100 units, down by almost 5pc.\n\nThe reduction in rates for all other categories, including commercial, industrial, agriculture and bulk consumers would vary from 3 to 4pc but flat Rs1.15 per unit.\n\nThe average rate would come at around Rs31.60 per unit, down from about Rs32.75 per unit at present.\n\nThese rates have been worked out on the basis of Nepra’s tariff determinations for all distribution companies to meet their revenue requirements, aggregate power purchase prices in FY2025-26 and reduced subsidy allocations in the federal budget under an agreement with the International Monetary Fund (IMF).\n\nThe Nepra had determined Rs34 per unit national average tariff for FY2025-26 against Rs35.50 per unit this year.\n\nThe proposed tariff has been worked out after incorporating about 12.9pc lower subsidy allocation in the budget at Rs1.04 trillion for FY 2025-26 against Rs1.19tr in FY2024-25.\n\nThis includes an inter-Disco tariff differential subsidy (TDS) of Rs249.14bn in FY2025-26 against Rs276bn in the outgoing year, down 10pc.\n\nSubsidy for tariff differential to tubewells in Balochistan will be Rs4bn in 2025-26, down from Rs 9.5bn in 2024-25.\n\nThe amount of subsidies for merged districts of KP and former Fata has been reduced by over 38pc to Rs40bn for FY 2025-26 from Rs 65bn for FY2024-25.\n\nOn the other hand, subsidy allocation for K-Electric has also been scaled down by 28pc, from Rs174bn in the outgoing fiscal year to Rs125bn for next year.\n\nLikewise, the TDS for Azad Jammu and Kashmir has also been slashed by 31.5pc from Rs108bn this year to Rs74bn.\n\nThe subsidy allocation for Pakistan Energy Resolving Fund — meant to ensure timely payments to Chin­ese investors — has been protected at Rs48bn while TDS for the tribal region has been cut by 39pc from Rs65bn to Rs40bn instead.\n\nHowever, a subsidy allocation of Rs400bn has been made in the budget, slightly higher than Rs394bn in FY2025-26.\n\nThe power division said its petition was in line with the National Electricity Policy, 2021 which provided under Clause 5.6.1 that the “financial sustainability of the sector is premised on the recovery of full cost of service, to the extent feasible, through an efficient tariff structure, which ensures sufficient liquidity in the sector”.\n\nIt said the proposed tariff was in line with the Nepra-determined rates for all Discos, the socio-economic objectives and budgetary targets.\n\nThe latest uniform tariff for Discos was set by Nepra through its determination dated July 13, 2024 that had been notified on July 14.\n\nThe Power Division said it had submitted to the federal cabinet on Saturday (June 28) the proposed uniform tariff.\n\nAccordingly, the uniform tariff, being reflective of the federal government’s economic and social policy and based on the consolidated revenue requirement approved and determined by the regulator, was anticipated to receive unchanged approval.\n\nThe Power Division said the government will also maintain a uniform consumer-end tariff for K-Electric and Discos, even after their privatisation, through direct or indirect subsidies.\n\nAccordingly, KE applicable uniform variable charge is required to be modified to recover the revenue requirements of KE determined by the Nepra in view of the proposed targeted subsidy and cross subsidies.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:33:30.185Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921131/govt-asks-for-rs115unit-cut-in-electricity-rate",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:23:56.000Z"
}
