{
  "title": "Fact-finding panel calls RDA officers to Lahore in Rs1.98bn scam probe - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The fact-finding committee formed by the Punjab chief secretary in the financial scam of Rs1.98 billion has called Rawalpindi Development Authority (RDA) former and present officials to Lahore on July 2.\n\nIn May, the financial scam was unearthed in the RDA during reconciliation of accounts after the transfer of some finance branch officials. Initially, an amount of Rs3bn was found missing from the RDA accounts since 2016, and after investigations, over Rs1bn had been recovered from different banks. However, an amount of Rs1.98bn still remains missing, and this amount had been distributed among 22 people and firms.\n\nOn the request of the RDA, the National Accountability Bureau (NAB) and the Anti-Corruption Establishment (ACE) also launched inquiries into the matter, but so far no investigation has been completed despite the passage of one and a half months.\n\nA senior official told Dawn that the chief secretary had also formed the committee to probe the matter at the start of June, but the committee is still clueless. He said that the record of the finance branch was with the fact-finding committee as well as NAB and ACE.\n\nRDA chief says she has given all records of civic body to committee\n\nHowever, he said the fact-finding committee had again summoned retired and serving senior officials of the RDA on July 2 and will also start an inquiry with the relevant bank officials where the RDA money went missing.\n\nHe said that the former directors general of the RDA would also be included in the investigations to determine how they ignored the missing money from the banks. He said every year an audit of the accounts was held but it was strange how they ignored the fact about the missing amount and payments to some firms without any record.\n\nHe said that due to the scam, it would be difficult for the civic body to prepare the annual budget. He said that the committee is likely to start the probe with the beneficiary firms, but a few have gone abroad.\n\nWhen contacted, RDA Director General Kinza Murtaza said the fact-finding committee was probing the matter. She said that she had given all the records of the civic body to the committee and that it had summoned them again on July 2 in Lahore.\n\nShe said that to avoid such scams, the RDA was preparing new standard operating procedures for the finance branch and, in this regard, all the records would be digitised.\n\nShe said that they were planning not to give the charge of head of the finance branch to the same person for more than two years, as in previous experience, the former head of the finance branch had misled the head of the civic body with fake details.\n\nShe said that the committee wanted more records and had asked the retired employees to appear before them. She said the committee will likely question the bank officials and seek records, so the findings will be completed by next month.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:33:03.622Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921064/fact-finding-panel-calls-rda-officers-to-lahore-in-rs198bn-scam-probe",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:48.000Z"
}
