{
  "title": "Country’s June inflation likely to remain between 3-4pc: finance ministry - Business - DAWN.COM",
  "author": null,
  "content": "The finance ministry, in its monthly economic outlook report on Monday, said that the consumer price index (CPI) inflation was expected to remain in the range of 3 to 4 per cent in June.\n\nLast month, depicting a cautious outlook towards growth in Large-Scale Manufacturing (LSM), the Ministry of Finance (MoF) had presented a rising trajectory for inflation during May and June.\n\nThe year-on-year consumer inflation rate in May was the highest since Dece­m­ber, indicating a rebound in inflation after months of slowdown. According to data released by the Pakistan Bureau of Statistics, the CPI inflation had stood at 3.46pc in May 2025 as compared to the previous year.\n\n“Inflation is expected to remain within the range of 3.0-4.0pc for June 2025,” said the finance ministry in its Monthly Economic Update and Outlook (June 2025) report.\n\nAwais Ashraf, director research at AKD Securities, said that the finance ministry’s inflation projections were in line with their expectations.\n\n“We projected the inflation to remain at 3.2pc in June, the analyst said.\n\nThe report said that the outlook for LSM in the coming months appeared to be positive, supported by encouraging trends in high-frequency indicators such as cement dispatches and automobile sales.\n\nSales of cars, sport utility vehicles, pickups and vans clocked in at 14,762 units in May, reflecting a rise of 35pc year-on-year and 39pc month-on-month.\n\nHowever, the finance ministry also stated that LSM showed a mixed performance in April 2025, registering a year-on-year (YoY) growth of 2.3pc while contracting by 3.2pc on month-on-month (MoM) basis.\n\n“The uptake in loans to the private sector businesses suggests rising production activities and improved investor confidence,” the report continued.\n\nWith regards to the current account surplus, the report stated that the external account position continued to improve during the July-May period of the fiscal year 2024-25 on account of rising remittances and exports.\n\nIt stated that on the external front, higher remittances and exports will continue to keep the current account in surplus for FY 2025.\n\nIn the agriculture sector, the report said that quality seeds and mechanisation are expected to boost agricultural output.\n\n“Imports of agricultural machinery rose by 10pc, worth $69.2 million in July–Apr FY2025, indicating rising mechanisation,” the report said.\n\nEarlier this month, Finance Minister Muhammad Aurangzeb unveiled the Pakistan Economic Survey 2024-25, exuding confidence that the country’s economy would be able to post growth of 2.7pc in the outgoing fiscal year for the gross domestic product (GDP).\n\nThe National Accounts Committee showed Pakistan’s GDP growth at 1.37pc for the first quarter of FY25, 1.53pc for the second, and 2.4 for the third. This implies that the economy would need to post a growth rate of 5.5pc in the three months of April-June to get to the 2.7pc figure announced by the finance minister.\n\nThe GDP growth figure, however, is still lower than 3.6pc, marking the third successive year of the government missing its targeted figure.\n\nAdditional input from Reuters",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:32:49.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921197/countrys-june-inflation-likely-to-remain-between-3-4pc-finance-ministry",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T07:42:07.000Z"
}
