{
  "title": "PM Shehbaz calls on Nisar as ‘comeback’ rumours swirl - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Rumours of a probable political rapproachment began swirling in the federal capital on Sunday, as Prime Minister Shehbaz Sharif met his estranged former party colleague, Chaudhry Nisar Ali Khan.\n\nMedia reports said the PM arrived at Mr Nisar’s home with an offer to rejoin the PML-N. However, it could not be ascertained whether Mr Nisar accepted the offer or not.\n\nIt is believed the prime minister met Mr Nisar with the consent of his elder brother and PML-N president, Nawaz Sharif.\n\nHowever, a statement from the Prime Minister’s Office (PMO) said the PM only inquired about Mr Nisar’s health.\n\n“They discussed the national and international situation during the meeting,” said the official press release about the meeting that took place in a “very pleasant atmosphere” where the two leaders “revived memories of the past”.\n\nPML-N leader refutes reports, says party in no mood to bring estranged leader\n\nVideos of the meeting showed Mr Nisar’s son also sitting with his father during the meeting.\n\nA senior PML-N leader told Dawn the PM only met Mr Nisar to inquire about his health, as he had not been well for the past few days.\n\nThere was no truth in reports that Mr Nisar had been asked to rejoin the party and that he assured the PM he would consider the offer, said the PML-N leader, who wished not to be named. “It is just a storm in a teacup.”\n\nThe PML-N leader stated it has not been discussed at any party forum that the top leadership wanted to bring back Mr Nisar into the fold.\n\nPM Shehbaz might have remained in touch with Mr Nisar, but the disgruntled PML-N leader has severed all connections with Mr Nawaz since a long time, said the party leader.\n\nThe PML-N leader said Punjab Chief Minister Maryam Nawaz Sharif now has a significant role in the party’s decision-making and “Mr Nisar had never been in her good books”.\n\nHe said the party apparently doesn’t need Mr Nisar because another leader, Engineer Qamarul Islam, has already won the same National Assembly seat from Taxila, which was Mr Nisar’s constituency.\n\nHe said after departing PML-N, Mr Nisar had spoken harshly against the party.\n\n“This cannot be forgotten by party leaders. Therefore, there is no desire in the party to bring Mr Nisar back,” he added.\n\nAnother source said the meeting was held in a cordial atmosphere, where the PM complained to Mr Nisar in a lighter tone, saying, “You have forgotten us.”\n\nMr Nisar denied the impression, saying he had been ill lately.\n\nSources said the PM also condoled the death of Mr Nisar’s sister, who died recently.\n\nOnce considered a trusted aide of Nawaz Sharif, he remained associated with the PML-N for 34 years. He parted ways with the party just before the 2018 general elections, following differences with the elder Sharif.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6861d327320d7.gif",
  "retrievedAt": "2025-10-12T03:50:02.448Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921121/pm-shehbaz-calls-on-nisar-as-comeback-rumours-swirl",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:08.000Z"
}
