{
  "title": "Thousands flee wildfires in Turkiye as Europe is hit by early heatwave - World - DAWN.COM",
  "author": null,
  "content": "Firefighters battled wildfires in Turkiye and France on Monday, and more than 50,000 people were evacuated as an early summer heatwave hit Europe.\n\nHealth alerts were issued in France, Spain, Italy, Portugal and Germany. Even the Netherlands, used to a milder climate, issued a warning for high temperatures in the coming days, coupled with high humidity.\n\n“Large parts of Western Europe are experiencing extreme heat and heatwave conditions that are normally observed in July or August, rather than June,” said Samantha Burgess, strategic lead for climate at the EU’s Copernicus Climate Change Service.\n\nTemperatures were in some locations 5-10 degrees Celsius warmer than they otherwise should have been at this time of the year, she said.\n\nIn Turkiye, wildfires raged for a second day in the western province of Izmir, fanned by strong winds, Forestry Minister Ibrahim Yumakli said. More than 50,000 people have been evacuated from five regions, including more than 42,000 in Izmir, Turkiye’s AFAD emergency management authority said.\n\nTurkiye’s coastal regions have in recent years been ravaged by wildfires as summers have become hotter and drier, which scientists say is a result of human-induced climate change.\n\nIn France, where temperatures are expected to peak on Tuesday and Wednesday, wildfires broke out on Sunday in the southwestern Aude department, where temperatures topped 40°C, burning 400 hectares and forcing the evacuation of a campsite and an abbey, authorities said.\n\nThe fires were under control but not yet extinguished, authorities said on Monday. Weather service Meteo France put a record 84 of the country’s 101 departments on an orange heatwave alert from Monday until midweek.\n\nFrom spectators queuing at the All England Club for the Wimbledon tennis tournament to tourists at the Colosseum in Rome and Seville in Spain, people sweltered in the heat.\n\n“It’s about 20 degrees warmer than I’m used to and I’m sunburnt all over,” said tennis fan Scott Henderson, attending Wimbledon from Scotland.\n\nSpain is on course for its hottest June on record, the national meteorological service AEMET said.\n\n“Over the next few days, at least until Thursday, intense heat will continue in much of Spain,” said Ruben del Campo, a spokesperson for the weather agency.\n\nIn Seville, southern Spain, where global leaders gathered for a United Nations conference, temperatures hit 42°C.\n\n“It’s awful,” municipal worker Bernabe Rufo said as he cleaned a fountain. “We need to be looking for shade constantly.” The top temperature in the country was registered at 43.7°C in El Granado.\n\nIn Italy, the Health Ministry issued heatwave red alerts for 16 cities, including Rome and Milan.\n\nThe Lombardy region, part of Italy’s northern industrial heartland, is planning to ban open-air work in the hottest part of the day, heeding a request from trade unions, its president said.\n\nIn Germany, too, heat warnings were in place across large parts of western and southwestern regions on Monday, where temperatures climbed to up to 34°C. Authorities appealed to consumers to limit their use of water.\n\nThe heatwave has lowered water levels on the Rhine River, hampering shipping and raising freight costs for cargo owners, commodity traders said. German and French baseload power prices for Tuesday surged as the heatwave led to increased demand for cooling.\n\nHeat can affect health in various ways, and experts are most concerned about older people and babies, as well as outdoor labourers and people struggling economically.\n\nGlobally, extreme heat kills up to 480,000 people annually, surpassing the combined toll from floods, earthquakes and hurricanes, and poses growing risks to infrastructure, the economy and healthcare systems, Swiss Re said earlier this month.\n\nScientists say the main cause of climate change is greenhouse gas emissions from burning fossil fuels. Last year was the planet’s hottest on record.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/3021573811a6e8a.jpg",
  "retrievedAt": "2025-08-20T04:32:44.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921250/thousands-flee-wildfires-in-turkiye-as-europe-is-hit-by-early-heatwave",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T16:58:34.000Z"
}
