{
  "title": "Major Sukkur public hospital without essential facilities - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Long hours of power outages coupled with unavailability of any power generator has been a cause of distress and pain being equally suffered by patients and staff of the (GMMMC) Hospital, working under the Sukkur Civil Hospital.\n\nOut of order airconditioners add to the miseries as the city’s climate remains hot to very hot in summers.\n\nAccording to sources in the GMMMC (Ghulam Mohammad Mahar Medical College) Hospital, in most cases surgeries are postponed and if performed at all, the process used to be an ordeal for doctors and paramedics, besides patients.\n\nThe sources and attendants of various patients confided to Dawn that the issues were turning worse mainly due to mismanagement on the part of the hospital administration.\n\nRecently, four scheduled surgeries had to be put off due to unavailability of electricity and alternative power source. Another one had to be undertaken considering the patient’s precarious condition. The procedures were performed amid extremely hot conditions.\n\nSurgeries are postponed off and on due to hours-long outages as it lacks power generator\n\nThroughout the process surgeons and OT staff were sweating while the patients remained uncomfortable.\n\nThe doctors, along with the patients whose surgeries were postponed, and their attendants went to the office of the medical superintendent to sort out the issues but he was not present there at that time.\n\nThe patients and their relative kept arguing with other staff over their disappointment and uncertain schedule of surgeries.\n\nThe sources said the doctors and paramedics admitted that postponement of surgeries was a serious medical issue, and told the affected people that they would also raise their voice over the situation. They said power outages or out of order ACs must not become cause of any such lapses. They agreed to hold a protest demonstration in front of the office of the MS or chairman of the hospital’s management board if the matter was not sorted out.\n\nPerturbed over media reports on such lapses in recent weeks, the Teaching Hospital Management Board (THMB), through its PRO, expressed its concern over “trend of unverified media reporting on public health matters concerning our institution”.\n\nThrough its June 1, 2025 letter to the Sukkur National Press Club president, the board appreciated the role of media in ensuring accountability and transparency, but said that reporting must not be based on hearsay or without proper verification.\n\nThe board alleged that some journalists were posting photos or video clips pertaining to the JMMMC and its staff on social media platforms which, it said, is a “violation [of] section 2R (a) to (i) of Prevention of Electronic Crimes (PEC) Act (amended 2025)”.\n\n“To ensure a responsible and constructive media environment, the THMB has unanimously decided to establish a ‘media and communications protocol committee, tasked with ensuring that all public or press-related communications are accurate, legally compliant, and consistent with the institutional mission,” it said.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:49:44.324Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921083/major-sukkur-public-hospital-without-essential-facilities",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:35.000Z"
}
