{
  "title": "Eradication of polio in KP remains elusive - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The emergency operation centre for polio in Khyber Pakhtunkhwa is struggling to cope with the chronic challenges it faces in eradication of poliomyelitis, a vaccine-preventable childhood ailment.\n\nThe province has recorded seven polio cases, the highest number registered by any province in the country this year so far, owing to almost the same reasons that have been hampering EOC’s efforts to wipe out the disease and safeguard children against lifelong disabilities.\n\nOf these cases, three have been detected in Bannu, one each in Tank, Lakki Marwat, Torghar and Dera Ismail Khan. Tally of polio cases stands at 13 in the country.\n\nKhyber Pakhtunkhwa reported 19,070 refusals against oral polio vaccine in February immunisation campaign while 97,743 children remained unvaccinated because they were not present when health workers visited their homes during the drive. The percentage was registered at 93 of the total target of 6.45 million children under five years in the province.\n\nThe province has reported seven cases of the crippling disease this year\n\nIn the last drive, conducted in May-June this year, the number of refusals dwindled to 17,993 whereas the count of unavailable children was 172,068. Overall percentage was 98 in the campaign.\n\nHealth workers associated with polio-related activities told Dawn that the trend continued since long as the same families refused drops either in the shape of direct refusals or didn’t bring their children when they visited their houses.\n\n“In this way, the polio eradication in the province has become a dream that will never come true as far these issued are not addressed,” they said.\n\nThe district administration, police and respective district health officers continue to receive warnings from chief secretary before every campaign to ensure vaccination of all target children. Therefore, the administration resorts to strict measures against those showing defiance against vaccination.\n\nThey said that parents opposed to polio immunisation put pressure on vaccinators to show their children as vaccinated in the record. Subsequently, vaccinators showed their children vaccinated in record and marked the finger with indelible ink, a sign of vaccinated children, they said.\n\nHealth workers said that fake finger marking had become a big fraud in the campaign under which children were shown vaccinated without giving anti-polio drops to them. “Vaccinators do fake finger marking for their safety as several people have been killed during polio campaigns so far,” they said.\n\nMany areas, which are called harder, are not even visited by vaccinators because the communities don’t accept polio vaccine on one or another pretext. Some people say vaccines is not allowed in Islam prior to occurrence of any disease while others argue that these drops are designed by western countries to render the recipients incapable of producing children.\n\nOf late, people are demanding pavement of streets, provision of water and sanitation facilities and end to power loadshedding in return for allowing drops to their children. These measures are required to be tackled by government at administrative level as health workers remain gripped with extreme fear during polio drive.\n\nHealth workers said that in every campaign, they faced violence that resulted in injuries and deaths of their colleagues and policemen guarding vaccinators.\n\n“Since 2012, 130 persons have been killed and 206 injured in attacks on health workers. Therefore, the responsibility lies with the administration to address the chronic challenges and ensure smooth-sailing of campaign,” said health workers.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:49:41.768Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921045/eradication-of-polio-in-kp-remains-elusive",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:55.000Z"
}
