{
  "title": "Williams hits century for Zimbabwe but South Africa in control - Sport - DAWN.COM",
  "author": null,
  "content": "BULAWAYO: Sean Williams hit an aggressive century for Zimbabwe but South Africa were in control after the second day of the first Test at Queens Sports Club in Bulawayo on Sunday.\n\nThe left-handed Williams hit 137 off 163 balls — more than half his team’s total of 251.\n\nSouth Africa led by 167 runs on the first innings and stretched their lead to 216 runs when they reached 49 for one at the close of play.\n\nZimbabwe were soon in trouble after South Africa declared their first innings at their overnight 418 for nine.\n\nNew cap Codi Yusuf took two wickets in his first three overs and Zimbabwe suffered a major blow when opening batsman Brian Bennett was forced to retire hurt for 19 after being struck on the helmet when he missed a hook against fast bowler Kwena Maphaka.\n\nBennett, who scored 139 on his previous Test appearance against England in Nottingham last month, was ruled out of the rest of the match with mild concussion.\n\nHe was replaced by Prince Masvaure who was dismissed for seven when he batted at number seven.\n\nWilliams and captain Craig Ervine (36) shared the only substantial partnership of the innings, putting on 81 before Ervine was stumped by Kyle Verreynne to give Keshav Maharaj his 200th Test scalp.\n\nYusuf, like fellow debutants Lhuan-dre Pretorius and Dewald Brevis, made a promising start to his Test career, taking three for 42. Pretorius made 153 and Brevis 51 in South Africa’s first innings.\n\nAll-rounder Wiaan Mulder took four for 50 and left-arm spinner Maharaj, captaining the team for the first time in the absence of injured Temba Bavuma, claimed three for 70.\n\nFast bowler Tanaka Chivanga took a wicket in his first over for the second time in the match, having Matthew Breetzke caught at gully for one.\n\nBut Tony de Zorzi (22 not out) and Mulder (25 not out) prevented any further breakthroughs before bad light stopped play.\n\nThe match is not part of the World Test Chanpionship and the South African team includes only four of the players who won the World Test Championship final against Australia at Lord’s in London earlier this month.\n\nSCOREBOARD\n\nSOUTH AFRICA (1st Innings) 418-9 decl (L.D. Pretorius 153, C. Bosch 100 not out; T. Chivanga 4-83)\n\nZIMBABWE (1st Innings):\n\nB. Bennett retired hurt 19\n\nT. Kaitano c de Zorzi b Yusuf 0\n\nN. Welch c Verreynne b Yusuf 4\n\nS. Williams st Verreynne b Maharaj 137\n\nC. Ervine st Verreynne b Maharaj 36\n\nW. Madhevere lbw Mulder 15\n\nP. Masvaure c Verreynne b Mulder 7\n\nT. Tsiga c Yusuf b Mulder 9\n\nW. Masakadza c Verreynne b Yusuf 4\n\nV. Masekesa not out 11\n\nB. Muzarabani b Mulder 0\n\nT. Chivanga c Maphaka b Maharaj 0\n\nEXTRAS (LB-6, NB-1, W-2) 9\n\nTOTAL (all out, 67.4 overs) 251\n\nFALL OF WICKETS: 1-5 (Kaitano), 2-23 (Welch), 3-119 (Ervine), 4-167 (Madhevere), 5-185 (Masvaure), 6-201 (Tsiga), 7-217 (Masakadza), 8-249 (Williams), 9-250 (Muzarabani)\n\nBOWLING: Yusuf 14-2-42-3 (1nb); Maphaka 12-1-52-0 (1w); Mulder 16-2-50-4 (1w); Bosch 9-1-31-0; Maharaj 16.4-1-70-3\n\nSOUTH AFRICA (2nd Innings):\n\nM. Breetzke c Madhevere b Chivanga 1\n\nT. de Zorzi not out 22\n\nW. Mulder not out 25\n\nEXTRAS (W-1) 1\n\nTOTAL (for one wicket, 13 overs) 49\n\nFALL OF WICKET: 1-1 (Breetzke)\n\nSTILL TO BAT: D. Bedingham, L.D. Pretorius, D. Brevis, K. Verreynne, C. Bosch, K. Maharaj, C. Yusuf, K. Maphaka\n\nBOWLING: Muzarabani 7-1-21-0; Chivanga 3-0-18-1 (1w); Masakadza 3-0-10-0\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6861cb18d5394.gif",
  "retrievedAt": "2025-10-12T03:49:06.601Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921094/williams-hits-century-for-zimbabwe-but-south-africa-in-control",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:15.000Z"
}
