{
  "title": "Marginally improving fiscal planning - Business - DAWN.COM",
  "author": null,
  "content": "Drawing comfort from the Iran-Israel ceasefire and adhering to the two-week schedule for the budget debate, the National Assembly last week passed a relatively improved version of the proposed federal budget for 2025-26. While its core remained largely unchanged, subtle in form and far from ideal, it was nonetheless a step forward.\n\nThe Finance Bill, set to become law upon presidential assent, is notably more people and business-friendly, and less autocratic in tone, than the original draft presented by Finance Minister Aurangzeb Khan on June 10.\n\nIt has significantly raised the taxable income threshold, moderately reduced income tax rates for salaried middle class, slightly lowered the super tax on businesses, adopted a more lenient stance on tax frauds and property and car transactions by non-filers, increased the minimum wage, and enhanced allocation for the Benazir Income Support Programme (BISP), among other measures.\n\nThe threshold of taxable income has been more than doubled — from Rs50,000 to Rs1,200,000 annually. Import duty on solar panels was reduced from 18pc to 10pc. The minimum wage was increased from Rs37,000 to 40,000 per month. The Super Tax was cut by 0.5 percentage points. Income tax rates were lowered across several brackets: from 2.5pc to 1pc for the lowest band, from 15pc to 11pc for the next, from 25pc to 23pc for the one above that. The allocation for the BISP was raised from Rs592bn to Rs716bn. The 2.5pc carbon tax was retained, though rebranded as Carbon Support Levy.\n\nThe PPP, a key coalition partner of PML-N and holder of the chairpersonship of both Senate and National Assembly Finance Committees, played a pivotal role in driving these improvements, alongside other parliamentarians who actively contributed to the budget debate.\n\nWhile the changes introduced in the budget offer much-needed relief, they fall short of addressing more substantive concerns. Key critiques remain unaddressed, such as the continued overreliance on regressive indirect taxation, the absence of meaningful efforts to broaden the tax base, insufficient incentives for capital formation and job creation, and the neglect of the vast tax potential of large commercial enterprises operated by security establishment-affiliated trusts.\n\nThe Finance Bill that is set to become law is notably more people and business-friendly, and less autocratic in tone than the draft presented earlier\n\nCritics also highlight the need to link the state’s right to impose additional taxes to its performance in delivering promised services, raise the minimum wage to a sustainable level, fully pass on the benefits of declining oil prices to the public, and realign expenditure priorities to align better with the needs of the economy and the people.\n\nIt is also worth noting that recent changes to the Parliament’s rules of business, allowing a member of National Assembly Finance Committee from outside the ruling party to critically review the Finance Bill, contributed to a more substantive and balanced debate, ultimately leading to improvements in the original draft.\n\nSalahuddin Safdar, a parliamentary governance expert with the Free and Fair Election Network, noted that while verbatim records of the National Assembly budget sessions are not yet available (making a full assessment premature) the process showed signs of improvement.\n\n“What stood out this time was the review of the Finance Bill by the Assembly’s Standing Committee on Finance,” Mr Safdar observed. “A key shift was the removal of a rule in October last year that had previously barred the bill from committee scrutiny. Additionally, unlike in the past, the committee is now chaired by Syed Naveed Qamar of a coalition partner rather than a member of the ruling party. These procedural changes likely contributed to the amendments made to the original fiscal and taxation proposals.”\n\nSenator Salim Mandviwala, Chair of the Senate Standing Committee on Finance, was candid in his remarks. He outlined the coordination between the Senate and the National Assembly during the budget debate.\n\n“Despite the constraints imposed by International Monetary Fund conditions and the limited manoeuvrability within Pakistan’s power structure, I believe we succeeded in improving the proposed budget. While much more is needed, some progress is better than none. I appreciate the efforts of colleagues in the National Assembly who worked diligently to incorporate changes that addressed key concerns — such as easing the burden on the salaried middle class, improving allocations for pro-poor initiatives, and introducing checks on tax authorities to prevent harassment of businesses and high-net-worth individuals,” Mr Mandviwala said.\n\nThis scribe has obtained a copy of the recommendations from the Senate Standing Committee on Planning, Development, and Special Initiatives, which reviewed and proposed revisions to the Public Sector Development Programme (PSDP). When contacted by phone, Senator Quratul Ain Mari, chairperson of the committee stated that the committee had thoroughly vetted all PSDP projects and put forward recommendations aimed at ensuring regionally equitable development spending, eliminating allocations for defunct or poorly conceived projects, and increasing support of initiatives considered critical to improving development outcomes. While these recommendations are not binding, they have been shared with the parliamentary finance committee and legislators for consideration and further action.\n\nAmong other issues highlighted in the note, the committee pointed out instances where Sindh has not been treated at par with the other provinces. Notably, schemes of the now defunct Public Works Department (PWD) have been transferred to provincial governments except for Sindh. The committee recommended that all 27 PWD schemes be immediately handed over to the Government of Sindh to ensure adoption of a uniform policy across the country.\n\nPublished in Dawn, The Business and Finance Weekly, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:49:08.350Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921168/marginally-improving-fiscal-planning",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T01:14:46.000Z"
}
