{
  "title": "Court postpones Netanyahu appearance in graft trial - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: An Israeli court on Sunday postponed Prime Minister Benjamin Netanyahu’s testimony in his corruption trial after he requested a delay, as US President Donald Trump called for the case to be thrown out.\n\n“Following the explanations given… we partially accept the request and cancel at this stage Mr Netanyahu’s hearings scheduled” for this week, the Jerusalem district court said in its ruling, published online by Netanyahu’s Likud party.\n\nNetanyahu’s lawyers had asked the court to excuse him from testifying over the next two weeks so he could focus on security issues following a ceasefire with Iran and amid ongoing fighting in Gaza where Israeli prisoners are held.\n\nThey had submitted Netanyahu’s schedule to the court to demonstrate “the national need for the prime minister to devote all his time and energy to the political, national and security issues at hand”.\n\nTrump had described the case against the Israeli PM as a ‘witch hunt’, saying the trial ‘should be cancelled immediately, or a pardon given to a Great Hero’\n\nThe court initially rejected the lawyers’ request but said in its ruling on Sunday that it had changed its judgement after hearing arguments from the prime minister, the head of military intelligence and the chief of the Mossad spy agency.\n\nTrump backing\n\nTrump on Saturday said in a post on his Truth Social platform that the United States was “not going to stand” for the continued prosecution, prompting Netanyahu to thank him in a message on X.\n\nEarlier in the week, the US president had described the case against the Israeli premier as a “witch hunt”, saying the trial “should be CANCELLED, IMMEDIATELY, or a Pardon given to a Great Hero”.\n\nIsraeli opposition leader Yair Lapid reacted by saying that Trump “should not interfere in a judicial trial in an independent country”. Netanyahu has denied any wrongdoing in the corruption affair and his supporters have described the long-running trial as politically motivated.\n\nIn one of the cases, he and his wife, Sara, are accused of accepting more than $260,000 worth of luxury goods such as cigars, jewellery and champagne from billionaires in exchange for political favours.\n\nIn two others, Netanyahu is accused of attempting to negotiate more favourable coverage from two Israeli media outlets.\n\nThe prime minister has reques­ted multiple postponements to the trial since it began in May 2020.\n\nRival urges Netanyahu to quit\n\nDuring his current term, which started in late 2022, Netanyahu’s government has proposed far-reaching judicial reforms that critics say were designed to weaken the courts and prompted massive protests that were only curtailed by the onset of the Gaza war.\n\nIn an interview with Israel’s Channel 12 that aired on Saturday, former prime minister Naftali Bennett accused Netanyahu of deepening divisions in Israeli society, and said that he “must go”. Netanyahu “has been in power for 20 years… that’s too much, it’s not healthy,” Bennett said.\n\nThe former right-wing premier managed to form a coalition in 2021 that ousted Netanyahu from the premiership after 12 consecutive years, but it collapsed before the end of the following year.\n\nBennett is rumoured to be planning a comeback, with public opinion polls suggesting he may have enough support to oust Netanyahu again. He declined to comment on that prospect in Saturday’s interview.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T04:33:15.828Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921106/court-postpones-netanyahu-appearance-in-graft-trial",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:29.000Z"
}
