{
  "title": "Move to protect people of coastal areas from climate change - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry on Sunday announced a programme to protect the lives and livelihoods of communities in coastal zones.\n\nThe Port Community Climate Resilience Programme, a pilot project, will be launched in selected areas of Karachi and Gwadar, the minister said in a statement issued on Sunday.\n\nUnder the programme, communities will be engaged in shaping localised, sustainable climate solutions and improving public awareness, ecosystems and coastal urban environments.\n\nThe minister said that mounting heat is severely disrupting daily life in urban coastal areas, where dense populations, limited green spaces and inadequate infrastructure are amplifying impacts of extreme weather.\n\nNew programme to engage communities, increase awareness about sustainable solutions to address environmental issues\n\nHe stressed the need for coordinated response to rising temperatures.\n\nHe said that a comprehensive national action plan would also be developed in coordination with provincial authorities, port administrations, and climate experts to prepare a series of immediate interventions, including urban greening projects and ventilation retrofitting in informal settlements near ports to reduce urban heat accumulation and to improve living conditions of vulnerable populations.\n\n“Port workers are at the frontlines of our maritime economy. They must be protected from the worst effects of extreme heat,” he said.\n\nAcknowledging economic vulnerabilities of the communities living at the post side, many of whom depend on outdoor work such as fishing, transport and cargo handling, the minister stressed the importance of promoting alternative livelihoods. Diversifying income sources, he said, will reduce exposure to extreme weather and open up safer employment opportunities.\n\nCommunities living near ports are among the first to feel effects of climate change. In areas like Karachi’s coastal belts and informal settlements near the fish harbour, people face high exposure to heat without access to cooling, clean water, or medical services.\n\nThe minister noted an increase in cases of heatstroke, respiratory distress, and dehydration in these zones. In Gwadar, fishing operations and small businesses have suffered, while children and elderly residents remain at heightened risk due to a lack of emergency healthcare services.\n\nHe said that climate change can no longer be viewed as a distant environmental concern, but rather as an immediate development challenge for maritime future. Rising heat is cutting into work hours, slowing port operations, and endangering the well-being of labourers who form the backbone of the national logistics network.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:49:24.219Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921116/move-to-protect-people-of-coastal-areas-from-climate-change",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:24:08.000Z"
}
