{
  "title": "Hague court’s ruling - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE Hague-based Permanent Court of Arbitration’s unanimous decision, that the judicial body’s competence cannot be affected by the unilateral suspension of the Indus Waters Treaty, is a legal and moral victory for Pakistan.\n\nThough the ruling has come in connection with a case initiated by Pakistan in 2016, it suggests that India’s decision to hold the IWT in ‘abeyance’ after the Pahalgam episode has no firm basis in international law and that, in the eyes of neutral observers, the treaty very much holds.\n\nThe court made the decision based on the text of the IWT, particularly the article stating that the treaty will hold until both states mutually withdraw from it. In the present circumstances, this is not the case, as Pakistan still honours the agreement.\n\nNot surprisingly, while Pakistan has welcomed the decision, India has reacted in a belligerent manner. Casting aspersions on the court, it has rejected the decision, saying that it “has never recognised the existence in law of this so-called Court of Arbitration”.\n\nThis displays an alarming lack of respect for international institutions, and the language is not one associated with responsible states. If matters do not go India’s way, will it also reject the jurisdiction of august multilateral fora such as the UN’s International Court of Justice?\n\nMoreover, New Delhi’s reaction borders on the conspiratorial, as the Indian external affairs ministry has characterised the court’s declaration as a “charade at Pakistan’s behest”.\n\nThis farcical assumption suggests that Pakistan has the power to control the decision-making process of independent international institutions. If the matter did not concern such a critical issue as water rights, the Indian reaction would have been seen as comical.\n\nHowever, although Pakistan has achieved a legal success where upholding the IWT’s sanctity and rejecting the treaty’s unilateral suspension are concerned, it must be prepared to launch a robust legal and political defence of its water rights at all international fora.\n\nIndia’s intentions regarding Pakistan’s share of water are hardly benign. In fact, the Indian home minister has said his country would “never” restore the IWT, and that Pakistan’s share of water would be diverted to Rajasthan. This indicates that India is not ready for a peaceful resolution of bilateral disputes, particularly matters related to water, even though Prime Minster Shehbaz Sharif recently reiterated his desire to engage with India on all issues.\n\nAs The Hague court’s observations have illustrated, Pakistan’s case is a strong one. The country must deploy the best legal and diplomatic minds to defend its water rights. India can still choose to engage with Pakistan so that outstanding issues can be sorted out peacefully. The grim alternative, if India deprives Pakistan of its water, will be more animosity and conflict.\n\nPublished in Dawn, June 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:50:04.394Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921148/hague-courts-ruling",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T00:25:12.000Z"
}
