{
  "title": "Resolution of Kashmir issue imperative for regional peace; Speaker NA",
  "link": "https://www.app.com.pk/national/resolution-of-kashmir-issue-imperative-for-regional-peace-speaker-na/",
  "date_published": "2022-10-26T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):Speaker of National Assembly Raja Pervez Ashraf and Deputy Speaker Zahid Akram Durrani Wednesday said that the people of Occupied Kashmir have made eternal sacrifices for the sake of independence.\n“The blood of unarmed Kashmiris would not go in vain and the day was not far when the people of Kashmir would see the dawn of freedom in Occupied Kashmir through their struggle for their right to self-determination” they expressed in their separate messages on the occasion of Kashmir Black’ Day which is being observed on 27th October every year.\nThey said that the Kashmir issue was an unfinished agenda of partition of the subcontinent without which lasting peace in South Asia was impossible.\nOn this occasion, the NA Speaker said that this day reminds us a great tragedy in the history of Kashmir when the Indian army illegally landed their forces in Kashmir and occupied the region. For seven decades, the innocent Kashmiris are fighting for their independence.\nRaja Pervaiz Ashraf said that thousands of children have been martyred in Occupied Kashmir for the last 75 years and thousands of incidents of desecration and rape of women have taken place.\nHe said that the hands of the so-called democratic government of India were stained with the blood of thousands of Kashmiri martyrs. He urged the international community to take stern notice of the atrocities perpetrated by India in Kashmir and play its role in ending the ongoing human rights violations in Occupied Kashmir.\nRaja Pervez Ashraf said that the resolution of the Kashmir issue was essential for the establishment of lasting peace in the region. He called on the United Nations to play its role in finding a peaceful solution to the Kashmir issue as per Security Council resolutions.\nReiterating Pakistan’s principled stand for the struggle of the Kashmiri people for independence, the Speaker said that Pakistan would continue to provide moral, political and diplomatic support to the Kashmiri people in their struggle for self-determination at every forum.\nHe said that the present Parliament has passed several resolutions to resolve the Kashmir issue in accordance with UN Security Council resolutions and to stop the atrocities committed by Indian forces in the Occupied Territories. He said that the forcible occupation of Kashmir by India was against the moral values of a civilized society and the basic right of the people to self-determination.\nDeputy Speaker Zahid Akram Durrani on the occasion said that the Day reminds us of the biggest tragedy in history when Indian forces illegally occupied Jammu and Kashmir.\nHe said that the blood of innocent Kashmiris shall never go in vain. He expressed the confidence that the Kashmiri people would soon see the dawn of independence and have a chance to breathe freely.\nThe Deputy Speaker said that the Government and the people of Pakistan have always stood by their Kashmiri brothers and sisters and would continue their moral, political and diplomatic support.\nHe urged the international community to take stern notice of the atrocities perpetrated by India in Kashmir.",
  "retrievedAt": "2025-08-11T15:47:53.659Z"
}
