{
  "title": "Pakistan to establish technical, vocational varsity in Saudi Arabia for expatriates: Sajid Turi",
  "link": "https://www.app.com.pk/national/pakistan-to-establish-technical-vocational-varsity-in-saudi-arabia-for-expatriates-sajid-turi/",
  "date_published": "2022-10-26T08:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):Federal Minister for Overseas Pakistanis and Human Resource Development (OP&HRD) Sajid Hussain Turi said that Pakistan with the cooperation of Saudi Arabia would establish a technical and vocational university for Overseas Pakistanis.\nHe said that Saudi Arabia was the home of some 2.3 million Pakistanis who were working and living there for a long time and Turi reiterated that Overseas Pakistanis were playing a key role in the development of Pakistan hence, the development of the welfare of Pakistanis is paramount and it is considered to be a priority of the present government.\nThe minister was addressing to Pakistani diaspora in the United Kingdom, as Pakistan Peoples Party UK Chapter hosted a dinner and discussion in Ilford, with Federal Minister for Overseas Pakistanis and Human Resource Development Sajid Hussain Turi and Ex Governor Shoulatullah (KPK).\nThe meeting was held with prominent UK PPP leaders. Minister informed about the stances the party was taking with the Pakistan Peoples Party chairman’s support to deliver innovative policies for overseas Pakistanis.\nHe further elaborated that with the collaboration of OPF a facilitation desk would be established in order to resolve the problems of Pakistani’s and their dependents.\nHe said that overseas Pakistanis would not be deprived of voting rights. A new plan is being created where constituents will be selected to represent them in Parliament, he added.\nTuri also discussed the importance of trade and the implementation of cross boarders trade, and the deliverance of maximum employment opportunities for Pakistani’s.",
  "retrievedAt": "2025-08-11T15:47:58.951Z"
}
