{
  "title": "ECP organizes painting competition to highlight importance of vote",
  "link": "https://www.app.com.pk/national/ecp-organizes-painting-competition-to-highlight-importance-of-vote/",
  "date_published": "2022-10-26T12:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 26 (APP):Election Commission of Pakistan (ECP) on Wednesday organized a two day painting competition among students of various colleges and universities from across the country at Pakistan National Council of Arts (PNCA) aiming to highlight the importance of vote among the country’s youth.\nThe purpose of the competition themed “Your vote to a promising future” was to motivate the youth to fully participate in the electioneering process. The exhibition was inaugurated by Secretary ECP Omer Hamid Khan. As many as 280 paintings were on the display, each depicted unique idea to motivate the youth to cast their vote.\nThe ECP has announced prizes for three first winners of the competition and appreciation certificates among promising contenders. A panel of judges included Ahmed Bilal Mehboob PILDAT, Nagin Hayat of Nomad Art Gallery and Maryam Ahmed, Director of Visual Art, PNCA would decide about the winners. First prize will be Rs 100,000, second Rs 50,000 and third Rs 25,000. The prize distribution ceremony will be held on Dec 7 on National Voters Day.\nSpeaking on the occasion, the Secretary ECP said the Election Commission of Pakistan (ECP) has been conducting a special awareness campaign for students in various educational institutions throughout the country to create awareness about the electoral process and students can play their role as responsible and active citizens in all upcoming elections. ECP has conducted over 380 seminars in different education institutes to enhance awareness about vote casting in youth, he told.\nHe said that special lectures were given to the students by the ECP officers in the workshops, where the students were informed about how to play their full role to increase voter registration and turnout. Later, he told that a question and answer session was also held. He said that art was a creative tool to express feelings and ECP was focusing on youth to participate in electioneering process.",
  "retrievedAt": "2025-08-11T15:47:55.446Z"
}
