{
  "title": "Ashrafi invites world personalities, organizations for flood victims help",
  "link": "https://www.app.com.pk/national/asharfi-invites-world-personalities-organizations-for-flood-victims-help/",
  "date_published": "2022-09-03T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 03 (APP):Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi on Saturday invited the world leading personalities and organizations for the flood victims help in Pakistan.\nTalking to national and international media, Ashrafi who is also the chairman of Pakistan Ulema Council said Pakistan alone could not cope with the damages caused by the floods in different parts of the country.\nSeeking support to overcome this critical situation, he said the world should come and witness itself the damages incurred due to flash floods in Pakistan.\nBesides lauding the services of Pakistan Army, and volunteers of religious organizations in flood hit areas, he said the endeavours on the part of Palestine for ‘Pakistan Solidarity Day’ and assistance for flood victims were commendable.\nHe said Pakistan was grateful to the United Arab Emirates, Qatar, Saudi Arabia, Turkiye, China, United Kingdom and United States for extending all out cooperation to the flood victims in Pakistan.\nIn the post-flood situation, the leaderships of Saudi Arabia, Qatar, United Arab Emirates and Turkiye had expressed their bonds of love and brotherhood with Pakistan.\nAshrafi said we should seriously think about the climate change and its implications.\nNo doubt, the flood was a test from the Allah Almighty, but it had also disclosed our shortcomings and negligence, he said proposing dams should be built and the construction of other buildings on the rivers’ banks should not be allowed.\nHe said it should also be investigated why the roads and bridges were made so weak which could not withstand by flash floods.\nHe said Pakistan Army was the pride of the Pakistani nation and the service rendered by it on the instructions of Chief of Army Staff General Qamar Javed Bajwa in this difficult situation were exemplary as per its tradition.\nHe lamented, “It is a pity that the political leaderships of the country could not be united even after the flash floods,” adding the process of reconciliation should be started within the country.\nHe expressed the hope that Punjab Chief Minister Chaudhry Pervez Elahi and President Dr Arif Alvi would play an important role in the process of reconciliation.\nHe also made it clear that neither proscribed outfits were collecting donations not participating in relief work anywhere in Pakistan.\nHe said India wanted to create more difficulties for Pakistan even in this difficult situation adding it aimed to obstruct the aid and cooperation of the world and international organizations helping Pakistan in this trying time.",
  "retrievedAt": "2025-08-11T15:30:50.171Z"
}
