{
  "title": "British High Commissioner visits flood relief camp in Nowshera",
  "link": "https://www.app.com.pk/national/british-high-commissioner-visits-flood-relief-camp-in-nowshera/",
  "date_published": "2022-09-03T12:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 3 (APP): British High Commissioner Christian Turner Saturday visited flood-hit villages in Nowshera, where a UK Charity Islamic Relief is providing lifesaving aid to flood affected people.\nThe High Commissioner also visited the village Kakol Abad and met with affected communities. He expressed his sorrow at the losses incurred during the flooding and assured them of UK’s continued support, said the spokesperson of the British High Commission in Islamabad.\nTalking to the media, British High Commissioner Christian Turner said: “The people I have met today are strong and will rebuild. But they need urgent support with water, sanitation, and shelter. The UK is helping provide that. The standard you walk past is the standard you accept.”\nAccompanied by Islamic Relief Worldwide’s CEO Waseem Ahmad and Islamic Relief Pakistan’s Country Director Asif Sherazi, the High Commissioner witnessed first-hand the devastating impact of the climate catastrophe.\nExpressing solidarity with the people at the camp, the British High Commissioner reaffirmed the UK’s commitment to Pakistan and observed the community’s challenges and efforts to support those affected.\nHe visited Nowshera, days after the UK announced an additional £15 million to help affected communities. This money will be spent for urgent lifesaving support and will go towards water and sanitation, shelter and home repairs, and primary healthcare, especially for women and girls.\nOn the occasion, Islamic Relief Country Director Asif Sherazi also talked with media and said “the situation is worsening with every passing day and in terms of damages, it is surpassing the floods of 2010.\nWe are on ground since August 3 meeting the needs of the affected across the country with shelters, clean drinking water, cash grants, food and hygiene items. Till now we have reached 30,000 people with lifesaving aid that will be doubled in the next week.\nThe aim is to support half a million under our emergency response. Since the needs are huge and dire, we appreciate the UK’s increased support for the humanitarian response and the DEC appeal. We urge the UK government and other countries for increased funding for the recovery phase too.”\nIslamic Relief is a member of the Disasters Emergency Committee (DEC) that launched the Pakistan Floods Appeal to collect funds for relief efforts; the UK government has announced it will match pound for pound the first £5 million ofpublic donations, as part of the total £15 million pledge.",
  "retrievedAt": "2025-08-11T15:30:55.766Z"
}
