{
  "title": "Science, Technology varsity to be established in Kurrum District : Sajid Turi",
  "link": "https://www.app.com.pk/national/science-technology-varsity-to-be-established-in-kurrum-district-sajid-turi/",
  "date_published": "2022-11-07T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP): Federal Minister for Overseas Pakistanis and Human Resource Development Sajid Hussain Turi announced that a science and technology varsity would be established at Kurrum District of the ex-FATA area.\nThe minister said this University is a catalyst project for the people of tribal areas who had been deprived of their basic rights since the creation of Pakistan, said a press release here on Monday.\nSajid Hussain Turi had a meeting with Chairman Higher Education Commission (HEC) Professor Dr. Mukhtar Ahmed in this regard.\nIt was decided in the meeting that one university will be established in every district of ex-FATA (commonly known as the newly merged districts of Khyber Pakhtunkhwa so that the students of the area do not face any difficulties in obtaining higher education and they would not be deprived of their basic right of getting higher education}.\nThe progress and prosperity of the region depended on quality education, the minister added.\nThe educated youth would have more opportunities in this era of competition. “Education is a form of investment as it provides a stream of income just as any other investment would,” he asserted.\nTuri said it has been an ardent desire that universities be established in all tribal districts, including Kurram district and today, he was happy to announce that Kohat University of Science and Technology (KUST) in Karam district was being established.\nHe further added that a formal decision has been taken to establish a university in Parachinar, which would be inaugurated soon and admissions in various fields of science, IT and arts would be announced from the new academic year.\nHe said that classes initially would be held temporarily in Government College No. 2 Parachinar, but in the previous government of Pakistan People’s Party, acres of land was purchased for the construction of a magnificent building for the university, on which the construction would be started by the end of this year.\nHe said that this university would be the first university in the history of tribal areas for which he was very excited, adding he was grateful to the then president Asif Ali Zardari and former prime minister Syed Yousuf Raza Gilani who announced funds to purchase land for Kurram University.\nHe said that Pakistan People’s Party has a special role in the development, health and education of tribal districts and under the patronage of Bilawal Bhutto Zardari, all efforts are underway to bring tribal districts into the national mainstream of the country through development in all sectors.\nHe said that Prime Minister Shehbaz Sharif has offered his full support for the development of the newly merged districts of FATA and emphasized that the rehabilitation of tribal areas was the top priority of his government.\nFederal Minister Sajid Hussain Turi stressed that very soon universities would be opened in other districts of ex-FATA, which will certainly play a key role in the better future of the youth there.\nHe said that the dissemination of education has a special priority near him which is instrumental to create an educated generation for Pakistan’s future.",
  "retrievedAt": "2025-08-11T15:51:17.752Z"
}
