{
  "title": "Policy being framed to promote indigenous solar panels manufacturing",
  "link": "https://www.app.com.pk/national/policy-being-framed-to-promote-indigenous-solar-panels-manufacturing/",
  "date_published": "2022-11-07T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 7 (APP):Engineering Development Board (EDB) is in process of formulating a Solar Panel Manufacturing Policy to promote local production and meet power needs, rapidly increasing with each passing year.\nThe solar panel manufacturing policy would be linked with national solar energy policy being prepared by Ministry of Power and Renewable Energy Task Force.\nThe glass and aluminium frames used for solar panels can easily be manufactured in Pakistan owing to strong presence of this allied industry within the country.\nAs per official information, the demand for solar panels is soaring and there was a need to promote manufacturing at a local level to help promote industry and save precious foreign exchange.\nApart from above policy, the Board is also in process of formulating Agricultural Implements Manufacturing Policy and Steel and Petrochemicals.\nMeanwhile, when contacted official sources on Monday said in order to establish new industries, meet local demand and increase production of export quality goods, EDB/Ministry of Industries and Production have also framed Mobile Device Manufacturing Policy and Auto Industry Development and Export Policy (2021-26) including incentives for Electric Vehicles.\nUnder Mobile Device Manufacturing Policy, 30 mobile manufacturers have been issued licenses to start local manufacturing of mobile devices by setting up local facility while under Auto Development Policy (2016-21), a number of new manufacturers have established manufacturing/assembling of new brands of vehicles.\nThe sources said around 11 new EV manufacturers in 2-3 wheelers (electric bikes and rikshaws) have invested. The policy offers various incentives to these manufacturers in taxes and duties etc.\nMoreover, the sources said Green Field Technology was another initiative for both import substitution and export enhancement. Under this scheme, different incentives in terms of taxes and duties are given to companies who bring new technologies that can introduce innovative product design and reduction in production cost.\nGreen field Licenses are recommended by EDB to such companies after physical verification of their manufacturing facilities. EDB has approved nine cases of green field status.\nEDB is facilitating businesses to increase production and exports and in this regard, it is involved in Annual Budget Exercise to help Engineering Industry by rationalizing cost of doing business under principles of cascading tariff regime.\nSimilarly, under export facilitation scheme of the government, the duties and taxes on imports of raw material and components which are used to manufacture export quality goods are already at 0% which also includes Duty and Tax Remission for Exports (DTRE).\nEDB is conducting Input/output ratios as required by FBR under these schemes. The exporters who are not availing the incentives of above scheme are facilitated by providing Duty Draw Back (DDB) on their inputs used for manufacturing of exportable products.\nIn order to export value added goods, EDB is working in coordination with Ministry of Commerce to revise the rates of Draw Back on Local Taxes and Levies (DLTL) while to enhance the production of export quality goods, Engineering Development Board has conducted detail studies to increase the competitiveness of Domestic Fan Industry and Surgical Instrument Industry of Pakistan and study on Cutlery industry is in pipeline.",
  "retrievedAt": "2025-08-11T15:51:18.088Z"
}
