{
  "title": "PPP to safeguard Pakistan, pass on a prosperous country to next generations: Asif Zardari",
  "link": "https://www.app.com.pk/national/ppp-to-safeguard-pakistan-pass-on-a-prosperous-country-to-next-generations-asif-zardari/",
  "date_published": "2023-04-10T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP): Former president Asif Ali Zardari on Monday said they would safeguard Pakistan at all costs, and then pass on a prosperous country to the next generations.\n“We had created Pakistan and we will put it back on path of development. The country has huge potential to grow as it produces commodities which are in great demand at international level,” he said which addressing the Convention on the Golden Jubilee Celebrations of the 1973 Constitution.\nHe said the Pakistan People’s Party (PPP) had never used religion for political objectives and would not do so in the future too. Its founder Zulfikar Ali Bhutto, however, was ousted from government in sheer violation of the Constitution and also using the religion card, he added.\nAsif Zardari said being a student of history, he was witness to the key events the country had gone through.\nThe former president lamented that fake cases had been registered against him in the past for political reasons, but no corruption allegations were proved against him.\nHe said the Constitution would reign supreme and nobody would be allowed to hold it in abeyance. “The PPP had played its role in safeguarding the Constitution and will continue doing so in future also. The democracy had been weakened over the years but we will make it strong.”\nHe said,“We talked about the rights of Balochistan and Khyber-Pakhtunkhwa during our government’s tenure and unanimously got passed the 18th Constitutional Amendment and approved the NFC (National Finance Commission) Award giving provincial autonomy to the federating units.”\nUnfortunately, he said, the neighboring country was involved in terrorist activities in Balochistan but the only solution for bringing back peace to the province was dialogue. “We will continue to resolve their problems through talks.”\nCiting the initiatives taken during the last PPP government, Asif Zardari said he had signed an agreement for the swap of currency with five countries but unfortunately it could not continue.\nHe had also inked an agreement with China for the development of Gwadar Port, he added.\n“We cannot afford any odd situation now. The PTI (Pakistan Tehreek-e-Isaf is now approaching us for dialogue, but its chief wants such decisions which are in his favour,” he added.\nHe claimed that the PTI was paying Rs 30,000 each to its workers and said he knew about its sources of funding.\nThe PTI, he said, had hired political workers, social media activists and journalists to continue its propaganda against the country and institutions.\nEven PTI Chairman Imran Khan admitted that he had used the funds donated by the public for the Shaukat Khanum Memorial Hospital, for his political purposes, which was a severe violation of the political parties’ law, he added.\n“We will never bow to the violation of law; we will fight on every front to safeguard the Constitution and the country,” he vowed.",
  "retrievedAt": "2025-08-11T08:16:08.655Z"
}
