{
  "title": "Ulema, Mashaykh term Muhammad bin Salman ‘leader of peace’",
  "link": "https://www.app.com.pk/national/ulema-mashaykh-term-muhammad-bin-salman-leader-of-peace/",
  "date_published": "2023-04-10T16:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP): Ulema and Mashaykh from all schools of thought on Monday termed Saudi Crown Prince Muhammad bin Salman the ‘leader of peace’.\nPaying tribute to the dynamic and visionary leadership of the Saudi Crown Prince, they appreciated the efforts for initiating the peace process between the Kingdom of Saudi Arabia and Iran in a bid to unite the entire Muslim Ummah at one platform.\nThey exchanged these views during the fifth international annual ‘Paigham-e-Islam Conference’ organized by the Pakistan Ulema Council headed by Hafiz Muhammad Tahir Mehmood Ashrafi, who is also the Prime Minister’s Special Representative on Interfaith Harmony and Middle East.\nAddressing the conference, Ashrafi said Muhammad bin Salman was taking Saudi Arabia to the new heights of progress and prosperity and its role as a peace maker as building diplomatic ties with Iran was its living evidence.\nHe expressed the hope that under the leadership of KSA which was at the helm of affairs of the Organisation of Islamic Cooperation, the longstanding issues of Palestine and Indian Illegally Occupied Jammu and Kashmir (IIOJK) would be resolved peacefully.\nHe said Saudi Arabia and Pakistan were on one page on the issues of IIOJK and Palestine and they would leave no stone unturned for their real independence from the clutches of India and Israel respectively.\nHe said the good relations between Saudi Arabia and Iran would yield positive results not only for the Muslim world but also for the region. The increasing bonds of friendship between the two states would help defeat the nefarious designs of enemies that wanted to create divisions on the basis of sectarianism among the Muslim countries in order to meet their hidden agendas.\nAshrafi said the Paigham-e-Pakistan was the most important document after the Constitution because it had almost eliminated the sectarian violence from the country.\nOn the current political and economic situation of the country, he said Pakistan was in dire need of peace and harmony. “Pakistan could be a regional economic power, if we manage to deal political instability with mutual understanding ,” he opined.\nHe proposed the religious and political leadership of the country to unite at one platform and resolve the national issues with collective efforts.\nHe said there were certain non-state actors who were trying to create public hatred against the institutions, particularly through social media. They would hopefully be dealt with an iron hand and their conspiracies would be foiled once for all, he added.\nThe conference was attended by a number of renowned Ulema and Mashaykh, religious scholars, parliamentarians, politicians, diplomats, and others.",
  "retrievedAt": "2025-08-11T08:15:59.926Z"
}
