{
  "title": "Three private member bills smoothly sail through Senate",
  "link": "https://www.app.com.pk/national/three-private-member-bills-smoothly-sail-through-senate/",
  "date_published": "2023-04-10T08:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP): As many as three private members’ bills including the National Disaster Management (Amendment) Bill, 2022, the Export Processing Zones Authority (Amendment) Bill, 2023 and the Pakistan Environmental Protection (Amendment) Bill, 2023 on Monday smoothly sailed through the Senate.\nThe bills were piloted by Seemee Ezdi and Hidayat Ullah in the House.\nThe Senate approved two bills including the Export Processing Zones Authority (Amendment) and the Pakistan Environmental Protection (Amendment) unanimously and the National Disaster Management (Amendment) Bill, 2022 with a majority vote.\nThe statement of objects and reasons of the Export Processing Zones Authority bill says that Export Processing Zones Authority is a Pakistan Government venture conceived and designed to increase and improve the exports of the country.\nIts main objectives are accelerating the pace of industrialization in the country and enhancing the volume of exports by creating an enabling environment for investors to initiate ambitious export-oriented projects in the Zones which would, as a corollary, create job opportunities, bring in new technology and attract foreign investment.\nWith the passage of time, the need has arisen to establish Private and Public Participated Export Processing Zones under the Export Processing Zones Authority Ordinance, 1980 (IV of 1980).\nThe purpose of this amendment is to define and include Private and Public Participated Export Processing Zones within the definition of Zones to meet the objectives.\nWhereas, the statement of objects and reasons of the Pakistan Environmental Protection (Amendment) Bill, 2023 says that Industrial wastewater contains many hazardous organic compounds and inorganic compounds like heavy metals which can cause damage to the delicate aquatic ecosystem.\nPollutants have very long-lasting effects on the sustainability of local ecosystems and pose a serious threat to human health. The bill aimed at stopping individuals and factory owners from throwing any amount of untreated wet waste directly into the rivers.\nMeanwhile, the amendment in the National Disaster Management Act, 2010 provides a suitable composition for the National Commission, reinstating the befitting rank in order to stream the nation’s fight against disasters and a binding provision for the Commission to meet a least once a year.\nMoreover, the Chairman Senate referred back the Criminal Laws (Amendment) Bill, 2023 to the concerned committee after opposing by the Minister of State for Law and Justice Shahadat Awan for detailed deliberation.",
  "retrievedAt": "2025-08-11T08:16:27.293Z"
}
