{
  "title": "IBCC introduces QR code-based attestation on certificates to ensure authenticity",
  "link": "https://www.app.com.pk/national/ibcc-introduces-qr-code-based-attestation-on-certificates-to-ensure-authenticity/",
  "date_published": "2023-04-10T11:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP):The Inter-Board Committee of Chairmen (IBCC) has achieved a milestone by introducing QR code-based attestation on certificates to ensure authenticity with enhanced security.\nThe complete process of attestation had been digitized to provide improved efficiency, increased accuracy better accessibility and enhanced transparency, which had not only benefited the organization, but also facilitated the public at large, IBCC Secretary Dr Ghulam Ali Mallah said in a statement on Monday.\nHe said the new attestation method would now feature a QR code-based ticket pasted on certificates, which could be scanned using a smartphone or any other QR code reader application.\n“This step will not only make the attestation process faster and more efficient, but it will also reduce the cost for both the organization and the student,” he added.\nDr Mallah said the initiative would ensure that the attestation certificates issued by the IBCC were tamper-proof, easily verifiable, and accessible to everyone anytime and anywhere. “This shall prevent fraud and forgery of educational documents.”\nWith the QR code-based attestation certificates, he said any individual or institution could now easily verify the authenticity of the certificate and the qualifications of the certificate holder ensuring that only qualified and deserving candidates were selected for employment or higher education, while also providing a secure and reliable way of verifying academic qualifications.\nThe IBCC secretary said, “This is a moment of pride as we introduce QR code-based attestation, which will ensure the security and accessibility of educational documents, and will also help in eliminating fraud and forgery. IBCC is committed to providing innovative and reliable services to the education sector, and we believe that this new initiative will greatly benefit students, institutions, and employers alike.”",
  "retrievedAt": "2025-08-11T08:16:14.422Z"
}
