{
  "title": "PM vows to ensure sanctity of Constitution by making country economically independent",
  "link": "https://www.app.com.pk/national/pm-vows-to-ensure-sanctity-of-constitution-by-making-country-economically-independent/",
  "date_published": "2023-04-10T08:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP):Prime Minister Shehbaz Sharif on Monday vowed to ensure the sanctity of the Constitution by making Pakistan economically developed and independent and by facilitating common people.\n“Constitution is the protector and guiding principle of Pakistan and we can sacrifice our lives to protect it,” he said in his message to the nation.\nThe prime minister felicitated the nation on the completion of 50 years of the 1973 Constitution of the country.\nHe also paid tributes to all the political parties, leaders, and parliamentarians who formulated the constitution for the country.\n“We pay tribute to all the respected personalities who elevated the sanctity of the Constitution and continue to play role in its strength during the last 50 years,” he added.\nPM Shehbaz said the Constitution of Pakistan 1973 was the extract of the vision of Quaid-i-Azam Muhammad Ali Jinnah, Allama Muhammad Iqbal, and other founders of Pakistan.\nHe said the Constitution of Pakistan kept the nation united. Terming it the mother of all state institutions, he said Constitution is a unanimously agreed upon civil agreement among all the stakeholders living in Pakistan.\nThe prime minister said despite untoward incidents and conspiracies that happened in the past, the Constitution maintained its existence in the country.\nHe said Zulfikar Ali Bhutto was not only the architect of the Constitution but also the one to sacrifice his own life for its sanctity.\n“I particularly salute Benazir Bhutto and Muhammad Nawaz Sharif who played a historic role in promoting, saving, and upholding the Constitution of Pakistan,” he added.\nHe said it was a pleasant coincidence in the country’s history that on the occasion of the Constitution’s golden jubilee celebrations, all the pro-democracy, people-friendly, and pro-constitution parties were in power.\nHe said the golden jubilee of the Constitution coincided with the time when political parties with the help of the Constitution ousted the selected ruling group from power.",
  "retrievedAt": "2025-08-11T08:16:24.195Z"
}
