{
  "title": "Bilawal for following trichotomy of power principle to bring Pakistan out of problems",
  "link": "https://www.app.com.pk/national/bilawal-for-following-trichotomy-of-power-principle-to-bring-pakistan-out-of-problems/",
  "date_published": "2023-04-10T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 10 (APP): Minister for Foreign Affairs Bilawal Bhutto Zardari while underlining the need for unity among political and democratic forces on Monday said all institutions should work in their constitutional ambit to bring Pakistan out of various problems including economic, inflation, unemployment and terrorism being confronted by the country.\nSpeaking at a convention held in connection with the golden jubilee celebrations of the 1973 constitution, he said the undemocratic forces always took advantage of differences among the politicians and political parties in the past. It was the right time to forge unity and work jointly for political and economic stability in the country, he added.\nThe minister said the National Security Committee in its meeting has decided to launch operations against terrorists and defeated them again like in the past.\nHe said the 1973 constitution which was unanimously passed by this august house and kept intact all the provinces of the country.\nHe said April 10 was a historical day and this day should be a part of the syllabus to teach in schools to the new generation about the importance of the constitutional day like August 14, 1947. It was a historical day as the country got its unanimous constitution on April 10, 1974, he added.\nHe said April 10 was the foundation day of our 50 years of political struggle. Shaheed Zulfikar Ali Bhutto united the broken and scattered country through a unanimous constitution in 1973, he added.\nHe said the Constitution of 1973 gave the country a way forward to tread the path of progress and constitutionalism.\nHe went on to say that Shaheed Benazir Bhutto and Nawaz Sharif inked a charter of democracy (CoD) in 2006 as the undemocratic forces always took benefit of differences and communication gaps among the political forces in the past. Pakistan People’s Party (PPP) not only restored the 1973 constitution in letter and spirit but also provided rights to the provinces besides giving them their identity, he added.\nHowever, the minister said undemocratic forces started conspiracies against CoD and imposed a selected prime minister aimed at abrogating the unanimous constitution of 1973 and cleared the way for setting up of One Unit again in the country.\nHowever, Bilawal said some elements in various institutions did not want CoD and our unity. Such elements wanted their selected rule in the country besides imposing a selected again for their personal gains, he added.\nHe said they had 10 years plan and if that doctrine continued, there would be the murder of merit in other institutions. One man show and dictatorship always remained contrary to democracy, he added.\nThe minister said there were some judges who always rejected dictatorship and gave their dissenting notes against the undemocratic step.\nHowever, he regretted that some judges who were bound to defend the constitution supported the dictator and announced decisions against the prime minister.\nHe appealed to the Chief Justice to sit with his brother judges and sort out differences to uphold the integrity and dignity of the court in the eyes of the people. He expressed confidence that the consensus of the Apex Court would withstand any conspiracy to subvert the Constitution.\nThe minister said the incumbent finance minister was making strides to foil Imran Niazi’s attack on the economy.\nImran Khan had imposed the economic and security crises on the country merely for protecting his rule, he added.",
  "retrievedAt": "2025-08-11T08:16:00.094Z"
}
