{
  "title": "Nation will never forgive, forget conspirators, their backers: PM",
  "link": "https://www.app.com.pk/national/nation-will-never-forgive-or-forget-conspirators-their-backers-pm/",
  "date_published": "2022-03-31T16:30:00.000Z",
  "source": "APP",
  "content": "“On Sunday, there is voting (on a no-confidence motion). The country’s fate is about to be decided on Sunday… The nation will decide where they want the country lead to,” the prime minister said in his address to the nation broadcast live.\nHe said the people would always remember those who would be committing any treachery on Sunday as they would not buy their argument so easily.\nThe prime minister addressed the nation hours after he chaired the meeting of the National Security Committee, which called the formal communication of a foreign country’s official “blatant interference” in Pakistan’s internal affairs and also decided to issue a demarche to that country.\n“I will fight if you think this conspiracy will succeed. Future generations will not forgive them. They should not have any misconceptions. It will make no difference to me as I live in my own house, bear my own expenses, and have no family member in politics,” he remarked.\nHe told the nation that on March 7, the government received a message from that country through Pakistan’s ambassador there, which said that they would pardon Pakistan’s all misgivings if Imran Khan was ousted. If happened otherwise, Pakistan would have to face difficulties.\n“This (message) is against the nation,” he said, adding the message coming before the vote of confidence showed that the political opponents were in contact with that country.\n“Is this our worth?…We are creeping like snails,” he remarked.\nThe prime minister said the conspiracy was being hatched through three stooges in Pakistan. They wanted to oust Imran Khan and it would also be fine for that country, he added.\nHe questioned the nation whether they would allow the one into power facing NAB (National Accountability Bureau) cases for corruption of billions of rupees, and an absconder whose corruption tales were also highlighted by the Western media, including the BBC.\nHe said out of nothing, the said foreign country expressed its concerns over his Russian visit which he had done after thorough consultation with the military leadership, Foreign Office and think tanks.\nHe said through their intelligence reports, the foreign countries had all the information about him as well as the opposition leaders and their benami properties and bank accounts abroad.\nHe said the leaders, who were now beloved by the said foreign country, never condemned 400 drone attacks by the United States during their tenures killing innocent people.\nReferring to the Wikileaks disclosures, he said JUI-F chief Maulana Fazlur Rehman had once offered to serve the US interests if he was given power.\nHe said instead of condemning Narendra Modi for calling that time Army Chief General Raheel Sharif a terrorist, he said Nawaz Sharif used to secretly meet him.\nHe said instead of condemning the drone attacks, the then president Asif Zardari told the US that the collateral damage made no different to him.\nHe said Shehbaz Sharif had opposed his “Absolutely Not” stance to join the US-led war anymore, said his government was pursuing an independent foreign policy.\n“Our public representatives are on sale. This is the trade of loyalties. This is the trade of country and its sovereignty. What lesson are we giving to our youth? No one will ever call them ideological. Everyone knows them,” the prime minister remarked.\n.:The prime minister said Pakistan was at a defining moment, it had to choose from two paths.\nCalling Quaid-e-Azam Muhammad Ali Jinnah a great politician and lawyer, he said before he came into politics, he had everything; popularity, money. “Even today I do not need anything from others and I am thankful to Allah for His blessings.”\nImran Khan said he was among the first generation, which grew up in an independent nation while his parents were born in an enslaved country.\nHe said self-respect was the sign of an independent nation and Pakistan had to be built according to vthe ision of Quaid-e-Azam and Allama Muhammad Iqbal. Its aim was to become an Islamic welfare state on the model of Riyasat-e-Madina founded on the principles of justice, humanity and self-respect.\n“Humans are the best of creations. Humans move ahead and resist against difficulties. I want that the youth should learn from the life and qualities of Prophet Muhammad (Peace Be Upon Him).\nHe said when he assumed power, he decided that Pakistan’s foreign policy would be independent but it would not be against India, the United States, Europe and other countries. “In the past I criticized the wrong policies of the foreign countries.”\nHe recalled that Pakistan had nothing to do with the war on terror and nobody from Pakistan was involved in the attacks on the United States on 9/11.\nPervez Musharraf committed the biggest mistake when it became an ally of the United States after 9/11, while in the war against Soviet Union, Mujahideen were trained to wage Jehad against the foreign occupation of Afghanistan, he observed.\nHe said later on the United States, which earlier was an ally, imposed sanctions against Pakistan.\nPakistan was against terrorism and it sacrificed 80,000 nationals in the war against terrorism, he said, adding its tribal areas were peaceful but when the people there were killed they turned against Pakistan.\nHe said the people in tribal areas declared Pakistanis as collaborators and carried out terror attacks against the country, while the United States asked Pakistan to do more at the time when its innocent people were being killed in the drone attacks, he added.\nThe prime minister said he was called Taliban Khan when he staged a sit-in against the drone attacks.\nDuring the US-led war terrorism, the people of tribal areas as well as the expatriates suffered the most but no one spoke for them except him, he added.\nThe Pakistani politicians were fearful and they did not want to talk against the foreign powers, while the past governments were complicit in the killings of people in tribal areas, he stressed.\nHe said when he came into power he declared that Pakistan’s foreign policy would be independent but would not be against the US, Europe and India. “I talked against India when it changed the status of Kashmir.”\nThe prime minister said during the US-led war against terrorism, the people of tribal areas as well as the expatriates suffered the most but no one spoke for them except himself.\nHe said the leaders like Nawaz Sharif could never speak against foreign powers because they had riches abroad. “They are the Mir Jafars and Mir Sadiqs of this time. The nation will never forget them. The future generations will not forgive them,” he added.\nHe told the nation that the government had placed the foreign country’s message before the Federal Cabinet before presenting it to the National Security Committee, services chiefs and the Parliamentary Committee of the National Security.\n“This is not for any provocation. It contains even more serious things,” he remarked.\nThe prime minister vowed not to resign and instead expressed his determination to emerge stronger.\nHe said those who were shifting their loyalties on the pretext of awakened conscience, should have resigned if they had any problem with the government’s performance.",
  "retrievedAt": "2025-08-11T14:38:08.363Z"
}
