{
  "title": "Own people’s accountability most painful but essential as sugar probe not person specific: Shahzad",
  "link": "https://www.app.com.pk/national/nobody-being-favoured-targeted-or-protected-in-sugar-scam-probe-advisor/",
  "date_published": "2021-04-03T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP): Advisor to Prime Minister on Interior and Accountability Barrister Mirza Shahzad Akbar Saturday said that the accountability of own people was the most painful but absolutely essential as the ongoing sugar scam probe was not person specific.\nAddressing a news conference, he said “It is painful to question your own but it is the right thing to do, but we can’t create hurdles in the accountability process.”\nHe said the ongoing sugar scam probe was not person specific as nobody was being favoured, targeted or protected in the investigations being conducted in light of sugar commission report endorsed by the federal cabinet and superior judiciary.\nHe said the investigations were being conducted against the accused persons irrespective of their affiliations and strict action would be taken against those involved in sugar crisis and price hike through speculation.\nHe said the government has determined Rs 80 per kg as ex mill price of sugar for the first time in history. Khyber Pakhtunkhwa, Punjab and Sindh has been directed to notify ex mill prices of sugar.\nSindh government was being contacted to notify the price – the federal government will notify the ex mill prices in case of failure by Sindh government. To a question he said “I’ve personal reservations that 15 to 20 percent price extra profit had been offered to manufacturers in the ex mill price. The ex mill prices of sugar would be determined every year.\nHe said the government has received a report that the speculators were planning to further enhance sugar prices from Rs 20 to Rs 30 per kg during Ramzan. He said the investigations have revealed that 16 major WhatsApp groups were working across the country to determine the prices of sugar.\nA man neither a broker or supplier determines the price of sugar through manipulations. Investigations have revealed that the sugar manufacturers were also taking pecuniary benefits from the speculative prices determined by WhatsApp groups.\nFIA Lahore zone has registered 10 FIRs (First Information Reports) against these WhatsApp speculators. According to details there were 464 personal accounts of 40 major speculators having turnout of Rs 106 billion during this season.\nThe current balance in these accounts was Rs 320 million. These accounts has already been frozen. The ledgers of these speculators revealed – some 382 fake benami third party individual accounts having turn out of Rs 667 billion were being maintained.\nThese accounts have not been frozen yet, however the data has been shared with all banks and State Bank and FBR (Federal Board of Revenue) for action.\nThe prime responsibility of the government is to check price hike and govt has taken various initiatives to check price hike. Punjab has enacted Punjab Prevention of Speculation in Essential Commodities Ordinance 2021 to check prices of sugar, flour, rice, edible oil,vegetable ghee to check prices. The speculation in prices has been declared an offence.\nThe government has also managed and rationalized the supply chain of sugar by giving responsibility of supply chain monitoring to respective deputy commissioners and sugar cane commissioners right from factory to end user. The revenue generations from sugar have increased by 100 percent as comparing to last financial year.\nFBR has detected over Rs 400 billion misappropriation in taxes in last five years. The sugar commission report had recommended investigations against nine major companies. First FIR registered against Ramzan Sugar Mills over the charges of over Rs 25 billion money laundering through fake Benami accounts and later the money was extracted in form of cash.\nIn the case Shahbaz Sharif and sons were nominated. Investigation are continuing right now. Salman has already been declared proclaimed offender. Another FIR has been registered against JDW group on charges of Rs4.35 billion money laundering.\nOn completion of investigations, the investigating officer would submit challan in relevant court. Another investigation related to JDW is being conducted on allegations of Rs 3.14 billion money laundering.\nThird FIR had been registered against JDW on charges of Rs 2.2 billion regarding money laundering and corporate fraud.\nThe journey from May 2020 to date was not easy. The prices of sugar accelerated when even crushing season was not even started after crushing season started sugar prices again augmented which is unjustified Responding to a question,\nHe said Chairman PPP Bilawal Bhutto should concentrate on careful spell check of the contents provided by aunt Sherry Rehman before reading and also must apply his own mind also.\n“ Bilawal should rather concentrate on responding the show cause notice issued by PDM chief Maulana Fazlur Rehman for defying alliance’s directives.",
  "retrievedAt": "2025-08-11T20:34:56.663Z"
}
