{
  "title": "COMSATS webinar calls for int’l youth’s response to COVID-19",
  "link": "https://www.app.com.pk/national/comsats-webinar-calls-for-intl-youths-response-to-covid-19/",
  "date_published": "2020-05-17T00:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 17 (APP):Around 50 participants from over 15 countries came together at a webinar titled “Role and Challenges of Youth in Global Crisis – COVID-19”, to deliberate on applying youth’s potential to help deal with current coronavirus pandemic and looming global threats and challenges to sustainability, such as climate change.\nYouth from Azerbaijan; Botswana; Cameroon; China; Egypt; Ghana; Greece; Jordan; Kenya; Norway; Pakistan; Switzerland; Tanzania; Tunisia; Turkey; Uganda; United Kingdom; and Zimbabwe participated in the webinar organized by the Commission on Science and Technology for Sustainable Development in the South (COMSATS).\nModerated by a Kenyan youth leader, Vice Chairperson for Policy and Advocacy at Commonwealth Youth Council Nafula Wafula, the event provided the international youth an effective platform to express their ideas and resolve to live up to the needs of current global challenges. The event was organized virtually to respect the social distancing necessitated by the COVID-19 pandemic.\nIn his opening remarks on the occasion, COMSATS Executive Director Dr S M Junaid Zaidi offered COMSATS as an effective platform to youth to come together and apply their faculties to play their due role for resolution of global challenges, only one of which was the current pandemic.\n“With right approaches,” said Dr Zaidi, “Corona crisis can be turned into an opportunity to further the growth towards sustainability. Youth can play an important role in finding innovative solutions to emerging global threats such as corona pandemic”.\nThe coordinator of this activity, COMSATS Assistant Director (Programmes) Engr Qaiser Nawab highlighted the role of youth in bringing necessary change in the society given they were provided necessary resources and opportunities.\nHe urged global youth to come forward with different innovative ideas to serve humanity.\nThe event that also marked the National Youth Day of China took stock on the remarkable success that the country had in containing the spread of COVID-19 as a nation, as well as how the country’s youth played an exemplary role in creating awareness about disease prevention and control.\nA few Chinese students who volunteered for community service during the pandemic shared their experiences with the participants and emphasized on making joint global efforts to cater to the needs of the masses.\nDuring other discussions, it was suggested that technological education should be incorporated in curricula from the very grassroots level to build youth’s capacity in relevant spheres.\nIt was opined that early shift to digital tools and methods could help address the rising youth unemployment challenges.\nYouth’s involvement was deemed an important element along with civic education, democracy and local development in the building of societies.\nOnline education and learning during the pandemic was discussed as a big challenge for countries with IT resources constraints, such as Tanzania, that were facing serious issues in continuing the education in times of pandemic. Government-backed youth-led initiatives in Ghana relating to digital campaigning for raising awareness and reducing social stigmas associated with COVID-19 were also appreciated.\nThe participants also presented various solutions to cope with the ramifications of the corona pandemic. Online sharing of experiences, knowledge and best practices relating to mitigation strategies and coping mechanisms were also regarded important for generating integrated response to corona pandemic.",
  "retrievedAt": "2025-08-11T19:13:43.022Z"
}
