{
  "title": "Amendments to Elections Act 2017 as per Constitution, NA rules of business: Tarar",
  "link": "https://www.app.com.pk/national/amendments-to-elections-act-2017-as-per-constitution-na-rules-of-business-tarar/",
  "date_published": "2024-08-06T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP): Federal Minister for Law and Justice and Parliamentary Affairs, Senator Azam Nazeer Tarar on Tuesday brushed aside the Opposition’s accusations of amending the Elections Act 2017 against the law and clarified that the amendments were carried out as per the Constitution and the National Assembly Rules of Business.\nSpeaking in response to Sunni Ittehad Council (SIC), Member National Assembly (MNA) Barrister Gohar Khan’s accusations at the point of order during the fourth meeting of the eighth National Assembly session here, the Law and Parliamentary Affairs Minister underscored that the amendments introduced in the Elections Act 2017 were as per the Constitutional scheme entailed in the Article 51 and 106 and the legal framework adopted by this House, after 102 meetings, with consensus in 2017.\nTarar said the Opposition member had alleged that the Election Act (Second Amendment) Bill 2024 was not being sent to the Law and Justice standing committee of the Lower House of the Parliament.\n“As per rules and business, it is allocated to the standing committee of Parliamentary Affairs where SIC’s MNA Ali Muhammad Khan and others deliberated on the matter. The amendment is as per the constitution and within the rules of business and code of conduct of the National Assembly,” the Minister maintained.\nEarlier, Barrister Gohar Khan of SIC said the resolution on Kashmir has been unanimously approved by the House and the Opposition had accorded its full support for the Resolution to express solidarity with Shaheed Palestinian Leader Ismail Haniyeh. The Opposition also supported the treasury benches on other critical international and regional junctures, he added.\nHe alleged that the treasury benches had trampled the legal and parliamentary laws to table the Elections Act amendment bill.\nMuttahida Qaumi Movement-Pakistan (MQM-P), Senior MNA, Dr Farooq Sattar said the apex court’s decision for the allotment of reserved seats had created conflict between the institutions of the Parliament and Judiciary. He accused that the amendments to Elections Act 2017’s rules 66 and 106 had led to the worst defeat of the opposition and the treasury benches as both have failed to draw consensus to resolve national issues.\nHowever, the 250 million population facing the worst crises were left in the lurch amid a political crisis, whereas no efforts were being made to pull out the masses from the abyss of that crisis, he said.\nMNA Zulfiqar Bachani of Pakistan Peoples Party Parliamentarians (PPPP) raised the serious negligence of the National Highways and Motorway Police (NHMP) during a road accident that occurred on M-9 Karachi-Hyderabad Motorway.\nHe alleged that the bodies of the deceased were left bare after the incident and the NHMP was absent and neither its helpline responded to the calls after the incident to relocate the corpses of the dead. “They must be questioned for their negligence as they are unable to provide facilities on the motorway,” he added.",
  "retrievedAt": "2025-08-11T04:25:34.439Z"
}
