{
  "title": "Chairman WAPDA, World Bank team review construction progress on Tarbela 5th Extension Project",
  "link": "https://www.app.com.pk/national/chairman-wapda-world-bank-team-review-construction-progress-on-tarbela-5th-extension-project/",
  "date_published": "2024-08-06T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP):Chairman WAPDA, Engr Lt Gen Sajjad Ghani (Retd) accompanied by a World Bank team headed by Advisor Masood Ahmed and Task Team Leader Gautum Gunjan on Tuesday visited Tarbela 5th Extension Hydropower Project and reviewed construction progress on key components.\nAfter detailed visit of the various sites, the Chairman also presided over a progress review meeting at the Project Office, said a press release.\nThe Project Management briefed the Chairman and the World Bank team about the progress achieved so far on seven key sites of the Project, which included intake, tunnel, penstock and outlet, power house, tail race culvert, tail race canal and switchyard.\nResource deployment, timelines and implementation plan  for completion of the Project were also discussed during the meeting. It was briefed that electricity generation from the Project is likely to commence in 2025-26.\nAddressing the meeting, the Chairman emphasized upon timely completion of the Project to cope with the increasing demand of energy in the country through green, clean and most affordable electricity. He urged the Consultants and the Contractors to maximize their efforts so that the Project could be completed by 2025-26.\nMember (Power) WAPDA, GM Tarbela Dam Project, PD Tarbela 5th Extension Hydopower Project and representatives of the Consultants and the Contractors were also present on the occasion.\nWAPDA is constructing Tarbela 5th Extension Hydropower Project on Tunnel No. 5 of Tarbela Dam. World Bank and Asian Infrastructure Investment Bank are providing financial assistance for the Project to the tune of US$ 390 million and US$ 300 million respectively.\nCumulative generation capacity of the Project stands at 1530 MW with three generating units of 510 MW each. The Project will provide 1.347 billion units of environment-friendly and low-cost hydel electricity to the National Grid every year. With completion of Tarbela 5th Extension, installed capacity at Tarbela Dam will increase from 4888 MW to 6418 MW.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:26:22.858Z"
}
