{
  "title": "Mobilink Bank introduces affordable E-bike loans for a greener future",
  "link": "https://www.app.com.pk/national/mobilink-bank-introduces-affordable-e-bike-loans-for-a-greener-future/",
  "date_published": "2024-08-06T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): Dedicated to promoting positive environmental change, Mobilink Bank has recently announced the launch of E-Bike loans.\nThis initiative, aimed at empowering individuals with accessible and eco-friendly transportation options, was formalized through a Memorandum of Understanding (MoU) with PakZon Electric Motors (Pvt) Ltd., Pakistan’s leading electric bike manufacturer said a news release.\nThrough this offer, the Bank is extending exclusive benefits to all its customers, including a 6% discount on E-bikes purchased through PakZon dealerships, three complimentary checkups at PakZon 3S dealerships, and a one-year battery warranty for two, three and four-wheelers.\nThese benefits are designed to make E-bike ownership more affordable and convenient.\nMobilink Bank is part of the VEON group, a global digital oper¬ator that provides converged con¬nectivity and digital services to nearly 160 million customers in six dynamic markets that are home to 7% of the world’s population.\nMobilink Bank’s E-Bike Loan is a strategic expansion of its retail lending portfolio, marking a foray into the growing green financing sector. By offering hassle-free financing solutions, the Bank drives sustainable transportation adoption and enables individuals, particularly women, to make informed choices about their mobility needs.\n“As part of our ‘Change to Sustain’ program, we are committed to reducing our carbon footprint and enabling our customers to do the same,” shared Atta-ur-Rehman, Chief Business Officer Mobilink Bank. “Our latest endeavour, the E-Bike loan, offers a practical solution for individuals and the environment. By providing easy financing for electric bikes, we strive to cultivate a culture of empowerment and self-reliance, particularly among women. This initiative helps us break down gender barriers, promotes equitable access to resources and paves the way for a greener, more sustainable future for all,” he added.\nThrough this initiative, the Bank is dedicated to expanding E-bike adoption, reducing carbon emissions and enhancing urban mobility. By increasing E-bike penetration, particularly in urban areas, the initiative is committed to achieving a 100-metric-ton reduction in CO2 emissions within the next two years.\n“This partnership signifies a shared vision for innovation and excellence in the electric vehicle sector,” said Shahzaib Amjad, Managing Director at PakZon Electric Motors (Pvt.) Ltd. “We are confident that this collaboration will pave the way for groundbreaking advancements and mutual growth. Here is to a prosperous and transformative journey together. May our collective efforts drive success and set new benchmarks in the industry,” he further added.\nThe Bank’s steadfast commitment to environmental stewardship is further solidified by allocating PKR 2.5 billion to renewable energy financing and solarization of fifteen branches in 2024.",
  "retrievedAt": "2025-08-11T04:26:24.650Z"
}
