{
  "title": "8 students from Pakistan to participate in Huawei’s Seeds for Future regional finals 2024 in Uzbekistan",
  "link": "https://www.app.com.pk/national/8-students-from-pakistan-to-participate-in-huaweis-seeds-for-future-regional-finals-2024-in-uzbekistan/",
  "date_published": "2024-08-06T07:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP):8 Pakistani students will take part in the regional finals of Huawei Seeds for the Future 2024 in Tashkent, Uzbekistan, from August 11 to 17.\nBuilding on the success of last year’s edition, Huawei’s flagship Corporate Social Responsibility (CSR) program brings together a record 157 students from 14 countries across the Middle East and Central Asia region, said a news release issued by the Huawai.\nThe 2024 Seeds for the Future Regional Round is supported by the Ministry of Digital Technologies of the Republic of Uzbekistan and the IT Education Association.\nMany other telecom, regulatory, labor authorities and vocational training bodies from the Middle East and Central Asia countries have also partnered with Huawei on this program.\nThis backing reflects the initiative’s global reach, which has seen the program gain recognition from more than 450 senior officials and heads of state worldwide.\nSince its launch in 2008, Seeds for the Future has made a significant impact globally, benefiting over 18,000 students from 141 countries, highlighting the program’s importance in developing global ICT talent.\nSteven Yi, President of Huawei in the Middle East and Central Asia, said, “I want to congratulate the Pakistan team for making it to the regional finals being held in Uzbekistan for the first time. Huawei’s Seeds for the Future program is dedicated to equipping these bright minds with the essential skills and mindsets needed to thrive in our fast-paced world. We’ve designed this platform to offer a wide range of opportunities, including online courses, competitions, exchange programs, and scholarships. We aim to provide talented youth from the ME&CA region with unparalleled STEM experiences, empowering them to pursue their dreams and make meaningful contributions to the global community.”\nAreeba Faheem and Muhammad Ahmad from COMSATS university Islamabad, Haider Irfan and Mian Akbar Jan from GIKI, Abtaal Aatif and Isaam Ansari from FAST NUCES, Zahra Nawaz from UET Taxila and Asfand Yar Jamali from NUST Islamabad were selected for the Seeds for the future program 2024.\nInnovation is fostered through cutting-edge technological seminars and expert interactions.\nDigitalization focuses on cultivating skills crucial for global digital transformation, while sustainability is promoted through environmental responsibility and exposure to green technologies. On the other hand, entrepreneurship combines theory and practice, guiding participants to develop commercially viable solutions.\nThis approach ensures Seeds for the Future nurtures well-rounded ICT leaders equipped to address global challenges and drive industry innovation. Seeds for the Future 2024 features Tech4Good, an entrepreneurship program that challenges young adults to address social issues using digital technologies.\nIt focuses on sustainable development and empowers students to create viable tech-based solutions.\nThe program offers intensive training, monthly workshops, a global competition, and incentives to help winning teams turn innovative ideas into successful businesses. In this mission, Tech4Good aims to bridge the gap between ICT skills and real-world problem solving, fostering a new generation of socially conscious tech entrepreneurs.\n“Seeds for the Future represent Huawei’s long-standing commitment to nurturing the next generation of ICT leaders. By bringing together talented students from across the Middle East and Central Asia, we’re not just imparting technical knowledge – we’re fostering innovation, cross-cultural understanding, and the skills needed to drive digital transformation in the region. This initiative is a testament to our belief that empowering youth is key to building a fully connected, intelligent world. Moreover, it underscores the crucial role of talent in digital transformation, including building the digital economy, driving socioeconomic development, and supporting the achievement of national plans and visions,” Steven added.\nThe Seeds for the Future program by Huawei is a flagship Corporate Social Responsibility (CSR) initiative aimed at developing skilled ICT talent and fostering cross-cultural communication.\nIt aims to bridge the gap between academic learning and real-world industry needs. Participants benefit from hands-on experience with cutting-edge technologies such as 5G, artificial intelligence, and cloud computing, guided by industry experts and Huawei’s top technologists.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:25:09.381Z"
}
