{
  "title": "Ethiopian Embassy, SDPI to jointly hold ‘Green Legacy Forum’ in Islamabad",
  "link": "https://www.app.com.pk/national/ethiopian-embassy-sdpi-to-jointly-hold-green-legacy-forum-in-islamabad/",
  "date_published": "2024-08-06T10:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP): The Embassy of the Federal Democratic Republic Ethiopia (FDRE) and Sustainable Development Policy Institute (SDPI) have agreed to forge a mutual collaboration to jointly organize “Green Legacy Forum” to create awareness and mobilize all segments of society for massive plantation of fruits and vegetables, which will not only restore eco-system but also ensure food security and sustainable development.\nThe collaboration was agreed upon during a meeting between Special Envoy & Ambassador Extraordinary and Plenipotentiary of Ethiopia to Pakistan, Jemal Beker Abdula and Dr. Abid Qaiyum Suleri, Executive Director, SDPI here at the Embassy of Ethiopia.\nThe forum will have participation of Parliamentarians, diplomatic and business community, environmentalists, religious and media fraternity, youth and civil society. It is aimed at sharing success story of Ethiopia with Pakistan in environmental conservation, ecosystem restoration and food security under the Green Legacy initiative of Dr. Abiy Ahmed, Prime Minister of Ethiopia.\nSpeaking on the occasion, H.E. Ambassador Jemal Beker lauded the services and capabilities of the SDPI as the premier independent think tank of Pakistan with its core capabilities in niche areas of economics, climate change, food security, human rights, health and social protection.\nHe underlined the importance of the Green Legacy Initiative which is the flagship project of the government of Ethiopia with the highest-level political leadership and public endorsement that has set an ambitious target of 7.5 billion seedlings to be planted across the country in 2024.\nThe Ambassador said since 2019, Ethiopia had planted more than 40 billion seedlings of vegetables, fruits and animal feed which had increased its capacity to address climate related challenges and reduced poverty, boosted job creation, and ensured food security.\nHe underscored the need to rollout massive nationwide campaign in Pakistan to address the growing vulnerability of its masses against climate change as 2022 floods’ devastation left its communities bareheaded under the risks and devastation of unprecedented scale.\n“I have personally witnessed the flood-impacted areas across the country that allowed me to assess the toll paid by masses despite their minimal contribution towards global warming and environmental degradation,” he added.\nIt is high time for all segments of Pakistani society to join hands to save the planet earth, he said, reiterating his resolve to work closely with them to take green initiatives for Pakistan.\nOn the occasion, Executive Director, SDPI, Dr Abid Qaiyum Suleri informed Ambassador Jemal Beker that the Institute used to hold an annual development and economic forum that convenes global, regional and local experts and dignitaries to share their valuable insights on critical global issue causing grassroots level impacts across the regions.\nHe suggested the Ambassador of Ethiopia to forge a bilateral collaboration to host a high-level plenary at the Forum that will not only help engage relevant key stakeholders but also the international experts that could help in spreading the word on promoting Green Legacy and Climate Action.\nDr Suleri who is also the member to the Advisory Committee of COP29 presidency in Baku informed the Ambassador that the SDPI will convene an international jurists plenary at COP29 under the title Green Justice to initiate dialogue among top-level judiciary of the developed and developing countries to build consensus on Climate Justice.\nHe extended full support of the Institute to the Embassy to engage state-level dignitaries to participate in that plenary.",
  "retrievedAt": "2025-08-11T04:26:26.364Z"
}
