{
  "title": "NUST Internship Programme for International Students concludes",
  "link": "https://www.app.com.pk/national/nust-internship-programme-for-international-students-concludes/",
  "date_published": "2024-08-06T11:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP): Geared towards fostering global diversity, achieving mutual growth through cultural exchange and opening doors to opportunities for all, NUST Internship Programme for International Students (NIPIS-24) has finally drawn to a close after providing a learning opportunity to the participants from various countries.\nThis year, as many as 15 interns came all the way from Egypt, Ireland, Nepal, Sri Lanka, Turkiye, and the United Kingdom to benefit from the month-long internship.\nEntailing a 360 learning opportunity, NIPIS ’24 delivered a sublime internship experience to international participants, advancing their academic competence, reinforcing their professional skills, and simultaneously offering insights into the rich cultural heritage and exposure to the natural beauty of Pakistan.\nNUST Placement Office made special arrangements for technical trainings of the international interns, placing them in various NUST schools specialising in Engineering and IT, Applied Biosciences and Social Sciences.\nThe participants engaged in various research projects and attended industry-specific trainings.\nThe programme also facilitated industrial visits to S&P Global, PepsiCo and Pak Steel Re-rolling Mills.\nPro-Rector Research, Innovation & Commercialisation (RIC-NUST), Dr Rizwan Riaz, graced the closing ceremony with his presence and distributed certificates among the interns.\nSpeaking to the interns, he said that they are now part of the NUST family, and put an accent on warmly greeting them again. He hoped that they would act as ambassadors of Pakistan and NUST, and share the knowledge and experience gained during the internship with their friends and colleagues back home.\nHe also encouraged them to pursue higher studies at NUST.\nThe closing ceremony witnessed captivating testimonials by the interns, highlighting their experiences and accomplishments, and strong connections and cherished memories they made during the course of NIPIS ’24.",
  "retrievedAt": "2025-08-11T04:26:24.626Z"
}
