{
  "title": "Rivers Indus, Kabul run in medium, low flood",
  "link": "https://www.app.com.pk/national/rivers-indus-kabul-run-in-medium-low-flood/",
  "date_published": "2024-08-06T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP):The Federal Flood Commission (FFC) has said that presently, River Indus is experiencing medium flood in Chashma-Taunsa reach whereas it is in low flood at three locations (Tarbela-Kalabagh & Guddu).\nAccording to daily FFC report on Tuesday River Kabul is also flowing in low flood both at Warsak & Nowshera.\nThe other major rivers in the Indus River System, including Jhelum, Chenab, Ravi, and Sutlej are flowing with normal discharges. The present Combined Live Storage of Tarbela, Mangla & Chashma is 9.718 MAF against a total live storage capacity of 13.354 MAF.\nTarbela Reservoir has attained water level of 1537.00 feet i.e. 13.00 feet below its Maximum Conservation Level (MCL) of 1550 feet whereas Mangla Reservoir is at an elevation of 1206.10 feet (45.90 feet below its MCL: 1242.00 feet).\nIn view of higher water levels, Tarbela Dam Flood Management Committee is advised to remain vigilant and ensure filling of reservoir as per approved SOPs and dam safety guidelines.\nAccording to the Flood Forecasting Division (FFD), Lahore, the Well-Marked Low over North Madhya Pradesh (India) has moved to Northwestern Rajasthan (India) and adjoining Pakistan. Also, trough of Westerly Wave persists over Northern Pakistan with a Seasonal Low over Northwestern Balochistan. At present, moderate moist currents from both the Arabian Sea and Bay of Bengal are penetrating into central and upper parts of the country up to 5000 feet.\nThe FFD has forecast scattered thunderstorm rain of Moderate Intensity over Islamabad, Punjab (Rawalpindi Division), Eastern Sindh and Khyber Pakhtunkhwa including the upper catchments of rivers Jhelum, Indus and Kabul for the next 24 hours.\nAlso isolated thunderstorm rainfall of Moderate Intensity may occur over Punjab (Multan, D.G.Khan, Faisalabad, Sargodha and Sahiwal Divisions) and Balochistan during the same period besides scattered to widespread thunderstorm rain of Moderate Intensity with isolated Heavy to Very Heavy Falls over Punjab (Gujranwala, Lahore and Bahawalpur Divisions), upper catchments of Rivers Sutlej, Ravi and Chenab.\nAs a result, medium to high flows are anticipated in river Chenab and its tributaries including nullahs of rivers Ravi and Chenab. Flows in river Sutlej will depend on releases from India.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:25:34.396Z"
}
