{
  "title": "Political ownership, economic integration amid rule of law in merged districts critical to stem TTP resurgence",
  "link": "https://www.app.com.pk/national/political-ownership-economic-integration-amid-rule-of-law-in-merged-districts-critical-to-stem-ttp-resurgence/",
  "date_published": "2024-08-06T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP):The experts at the book launch event of Islamabad Policy Research Institute (IPRI) on Tuesday underscored the need to ensure political ownership and economic integration amid rule of law in the newly merged tribal districts of ex-FATA to stem Tehreek-e-Taliban Pakistan (TTP) resurgence.\nThe IPRI hosted the book launch of “Recrudescence of TTP Violence – Its causes and possible remedies” which is the first of its kind research-based publication that probed the phenomenon of TTP and its recurrence in the tribal districts through ground-based surveys and interviews of local stakeholders hailing from different walks of life which were co-authored by IPRI Research Team under the leadership of Director, Research, IPRI, Dr Raashid Walid Janjua.\nIn his opening remarks, President IPRI, Ambassador, Dr Raza Muhammad said Pakistan is facing continued violence and terrorism due to its partnership in the war on terror. This book started eight months back peer headed by Dr Raashid Walid Janjua involved interviews and surveys on the ground for quality evidence through stakeholder and community engagement, he added.\nSpeaking on the occasion, Director Research, IPRI, Dr Raashid Walid Janjua explained that recrudescence meant the thing that was coming up again and again but this rise of TTP bedevilled Pakistan. The armed forces, he said conducted many military operations from Al Meezan to Zarb-e-Azb that helped recoup 1,600 km area and kill 3,500 hardcore terrorists.\nThe motivation behind the book was the fact that the terrorists’ attacks had reduced from 1,214 in 2023 to 201 so far, he said. The book has six chapters that explore different facets of the crisis as post 2021 a great change in the social environment of ex-FATA areas was witnessed, he added.\nDr Raashid noted that the book was less academic and more field-oriented easy to comprehend for everyone. The methodology was based on interviews, field surveys and focused group discussion with all stakeholders including the local populace, youth, KP civil administration, Police, Peshawar Corps and Frontier Corps (FC).\nThe book, he said had identified three main causes of TTP resurgence mainly the vacuum created in the absence of administration, police and judiciary. However, these tribal territories were being managed under the FCR laws, traditions, Masharans or Malaks (tribal leaders), shariah law and Muftians (religious scholars), he added.\nHe noted that practically constitutional merger had taken place but financially it did not happen, whereas lack of long-term vision and consistent policies about security integration and development of merged districts, lack of livelihoods, infrastructure development and economic integration of merged districts with other parts of the country paved the way for TTP filling in the vacuum in merged districts.\nHe mentioned that some 86 coalmines in Darra Adam Khel had brought a decline in illicit arms sales which was the mainstay of that community to only a 10% share of the total income of that area that helped extend complete livelihood opportunities to the local populace and curbed any possibility of terrorism resurgence.\n“The altered environment of Afghanistan and proxy warfare along with ecosystem of crime and illegal activities provided a breeding ground for TTP that was splintered but it is essential to contain it,” he said.\nDr Janjua mentioned that the field survey helped gauge the perception of the local population, where over half of the respondents claimed that no substantial reforms were made in the newly merged districts and a large percentage expressed dissatisfaction over police and local judiciary, and the development progress.\nIn conclusion, he said the book recommended a whole national approach starting from political ownership, policy consistency, and public support to win the trust of the local masses against the terrorism resurgence.\nPakistan should keep engaging with the Afghan Interim Government to convince them to deny sanctuaries to TTP and ensure the proactive role of civil government in strengthening institutions and proper budgetary allocations for the development of the newly merged districts, he added.\nSpecial Representative for Afghanistan, Ambassador Asif Durrani in his special remarks said that dealing with tribal belt technically involved Afghanistan as post 1979 Afghan War three generations of Afghanistan had been raised facing conflict, where Pakistan lost its key human capital.\n“The TTP amid resurgence got recruits by two conditions placed before tribal masses that either they pay money for their operations or give two mujahideen. However, the families were compelled to surrender two recruits. TTP is recurring either the correct remedy was not applied on time or properly administered but the rule of law is the core to all remedies to social issues,” he added.\nAmbassador Durrani mentioned that the government of Pakistan negotiated with TTP on three conditions to surrender, accept the Constitution and appear before the court of law for heinous crimes which they all rejected.\nThe study in the book revealed breaches of the rule of law in different instances and indicated the key areas where it could be applied for desired results, he added.\nThe book launch was followed by an active question hour session participated by media, researchers and members from different walks of life.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:26:24.723Z"
}
