{
  "title": "Newly-wed couple dies of asphyxiation in Neelum Valley - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: A newlywed couple from Karachi died of asphyxiation in a Neelum Valley guesthouse during a freezing night on Friday, officials said on Saturday.\n\nAccording to them, Syed Mohammad Taha Ali, 25, and his wife, Dua Zehra Zahid, 22, residents of Malir, Karachi, had checked into a rest house in Kel Seri village, about 145 kilometres northeast of Muzaffarabad, on Friday.\n\nAfter leaving their luggage in the room, they went sightseeing in the upper areas of Kel and returned around 10:30 pm, deputy commissioner Nadeem Ahmed Janjua told Dawn.\n\nAs the temperature had plummeted to minus 10 degrees Celsius, the couple sealed even the smallest openings in their room and turned on a gas heater to stay warm, he said.\n\nThe rest house staff advised them to keep the cylinder outside after half an hour, in line with the administration and tourism department’s safety guidelines issued after previous incidents of asphyxiation.\n\nWhile the couple agreed, they did not follow the instructions, Mr Janjua added.\n\nOn Saturday morning, around 10 am, staff members knocked on all rooms to check if guests required any services. While others responded, there was no reply from the couple’s room, raising concerns, he said.\n\nAlarmed, the staff alerted the district disaster management authority, whose personnel forced the door open after repeated knocks went unanswered. Inside, they found both husband and wife dead.\n\n“The woman was lying in bed, while the man appeared to have collapsed on the floor, possibly while attempting to open the door,” Mr Janjua said.\n\nThe bodies were shifted to Muzaffarabad in the evening and handed over to their relatives after the completion of legal formalities.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:39:53.316Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892192/newly-wed-couple-dies-of-asphyxiation-in-neelum-valley",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:12:25.000Z"
}
