{
  "title": "KCCI slams Nepra’s limited relief for Karachi consumers - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Karachi Chamber of Commerce and Industry (KCCI) has strongly condemned the recent decision by the National Electric Power Regulatory Authority (Nepra) depriving Karachi’s consumers of significant relief in the monthly electricity adjustment.\n\nIn a statement on Saturday, KCCI President Muhammad Jawed Bilwani said both Nepra and K-Electric have failed to deliver the promised benefits to Karachi’s consumers. He regretted that Nepra’s recent announcement regarding the fuel price adjustment for November revealed a meager reduction of Rs1.23 per unit.\n\nWhile this reduction is a step in the right direction, it falls far short of expectations. Karachi’s consumers were anticipating a much larger relief, especially since K-Electric had previously requested a reduction of up to Rs4.98 per unit for November’s adjustment.\n\nMr Bilwani said that despite the tariff adjustment for November being calculated at a reduction of Rs5.0029 per unit, only a Rs1.23 reduction was implemented for K-Electric consumers. This resulted in a significant benefit of Rs5.444 billion being withheld from the consumers.\n\nBoth Nepra and K-Electric have failed to fulfil their commitment to providing substantial relief to consumers during these challenging times, he deplored. “Karachi’s consumers, already burdened by the high cost of living and doing business, are now being further victimised by this blatant injustice.”\n\nThe KCCI president pointed out that Nepra, which is tasked with protecting the rights of electricity consumers, had fallen short of its mandate by not ensuring that the full benefits were passed on. Meanwhile, KE appeared indifferent to the hardships faced by Karachi’s residents, continuing to benefit from delays in tariff reductions.\n\nMr Bilwani also criticised Nepra’s failure to enforce the full reduction for Karachi’s consumers, calling K-Electric’s failure to implement the full benefit of Rs5.444 billion an economic betrayal.\n\nHe also referred to the dissenting opinion by Nepra Member Tariff Mathar Niaz Rana, secon-ded by Member Technical\n\nRafiq Sheikh, who opposed the limited relief given to K-Electric consumers.\n\nIn his dissent, Mr Rana argued that Karachi’s consumers should have received the full benefit of the November adjustment, which would have amounted to a Rs5.0029 reduction per unit, resulting in a direct benefit of over Rs7.215bn.\n\n“The KCCI fully supports Mathar Niaz Rana’s dissenting view. His stance represents the voice of Karachi’s business community and consumers, who are being unfairly burdened by this unjust decision,” Mr Bilwani said.\n\nHe added that Rs8.7bn is still under consideration by the authority and yet to be finalised, with Nepra having put the amount on hold, which he described as “really strange”.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:28:01.095Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892254/kcci-slams-nepras-limited-relief-for-karachi-consumers",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:12:00.000Z"
}
