{
  "title": "Sugar to cost Rs130/kg during Ramazan - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Federal Minis­ter for Industries and Production Rana Tanveer Hussain on Saturday said that sugar would be available at Rs130 per kilogram during Ramazan at stalls to be set up by mills across the country.\n\nHe announced this while chairing a meeting of the Sugar Advisory Board to finalise sugar prices for the upcoming month of Ramazan, according to a news release. The meeting focused on ensuring that sugar is available at reasonable prices during the holy month.\n\nThe minister said sugar stalls will offer sugar in small packages of 1-2kg, and one CNIC holder will be allowed to purchase up to 5kg of sugar. The stalls will be operational three days before the start of the holy month and will continue until the 27th of Ramazan, ensuring ample supply for consumers.\n\nMr Tanveer emphasised the importance of maintaining a smooth supply chain and directed the relevant authorities to ensure the efficient management of these stalls.\n\nHe called for close coordination between the Pakistan Sugar Mills Association (PSMA), district administrations and cane commissioners to prevent any mismanagement or long queues, ensuring a hassle-free experience for customers.\n\nThe minister also recommended increasing the number of stalls and setting them up at municipal committee levels across districts to better cater to the public. He assured that he, along with the chief secretaries, would personally monitor the entire process to ensure its smooth execution and success.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:28:37.362Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892255/sugar-to-cost-rs130kg-during-ramazan",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:12:00.000Z"
}
