{
  "title": "Israeli, Palestinian prisoners swapped amid renewed fears - World - DAWN.COM",
  "author": null,
  "content": "KHAN YUNIS: Palestinians released three Israeli prisoners on Saturday in exchange for hundreds of Palestinian inmates freed by Israel, completing the latest swap despite fears the Gaza truce deal was near collapse.\n\nClutching gift bags given by their captors and certificates to mark the end of their captivity, the three men, flanked by fighters, called for the completion of further prisoner exchanges under the ceasefire deal.\n\nNot long after, a busload of Palestinian prisoners departed Israel’s Ofer prison and was greeted by a cheering crowd in the occupied West Bank city of Ramallah. More buses took inmates from an Israeli prison in the Negev desert to the Gaza Strip.\n\nThere were fears for Palestinians in Israeli custody after several were hospitalised following their release last week. The Red Crescent said four of those released on Saturday were also transferred to a hospital in the Israeli-occupied West Bank.\n\nSaturday’s swap, the sixth since the truce took effect on Jan 19, came after Hamas had threatened to pause releases over Israeli violations, while Israel had threatened to resume bombings if it did.\n\nThe three prisoners — Israeli-American Sagui Dekel-Chen, Israeli-Russian Sasha Trupanov and Israeli-Argentine Yair Horn — had been held since the Oct 7, 2023, raids in Israel.\n\nFriends and families of the Israeli prisoners shed tears of joy at the sight of their loved ones.\n\n“Finally, Sasha can be surrounded by his loved ones and begin a new path,” Trupanov’s family said in a statement.\n\nDekel-Chen’s wife, Avital, said in a call to her sister aired by Israel’s Kan public broadcaster: “My breath has returned. He looks so handsome.”\n\nLater in the day, hundreds of Palestinians freed by Israel reached Khan Yunis, where they threw up victory signs and waved to a jubilant crowd.\n\nAccording to the Palestinian Prisoners Club advocacy group, Israel was to release 369 Palestinians.\n\nImages broadcast on Israeli media showed Palestinian prisoners ahead of their release wearing sweatshirts featuring the prison service logo, a Star of David, and the slogan: “We will not forget and we will not forgive.” After the deal had appeared to be on the brink of collapse, a Hamas official said on Friday the group expected talks on a second phase of the ceasefire to begin early next week. Another source familiar with the talks offered a similar timeline.\n\nThe negotiations on the second phase are meant to lay out steps towards a more permanent end to the conflict.\n\nUS Secretary of State Marco Rubio, whose country is Israel’s top backer and one of the truce mediators, is due to arrive in Israel on Sunday for talks with Prime Minister Benjamin Netanyahu on the truce.\n\nA crowd gathered in Israel’s commercial hub of Tel Aviv to watch a live feed of the exchange, with many carrying Israeli flags and posters with messages, including “Sorry and welcome back” and “Complete the ceasefire”.\n\nTrump’s proposal\n\nThe ceasefire has been under massive strain since US President Donald Trump proposed a takeover of the Gaza Strip under which the territory’s population of more than two million people would be moved to Egypt or Jordan.\n\nArab countries have come together to reject Trump’s plan, and Saudi Arabia will host the leaders of Egypt, Jordan, Qatar and the United Arab Emirates on Feb 20 for a summit on the issue.\n\nA joint statement from the heads of Christian churches in Israeli-occupied Jerusalem also said Gazans “must not be forced into exile”.\n\nThe office of Israeli Prime Minister Benjamim Netanyahu said it was working with the US to get the remaining prisoners freed “as quickly as possible”.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b1107849b8e.jpg",
  "retrievedAt": "2025-10-12T01:27:18.932Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892216/israeli-palestinian-prisoners-swapped-amid-renewed-fears",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:11:46.000Z"
}
