{
  "title": "Shangla people pour onto roads against killing of miners in Harnai - Pakistan - DAWN.COM",
  "author": null,
  "content": "SHANGLA: Residents of Shangla blocked the Bisham-Swat Road in Alpuri on Saturday against the terrorist attack that claimed the lives of 10 coal miners, including six Shangla residents, in Harnai, Balochistan, on Friday.\n\nThe residents came onto the roads on the call of Shangla action committee and the district bar association, upon arrival of bodies of mineworkers from Balochistan.\n\nThe six deceased were brought to their native town, Lilownai, on Saturday afternoon.\n\nThe protesters, among them family members of the deceased, shouted slogans against the government for its failure to protect innocent citizens.\n\nAddressing the rally, chairman Shangla action committee Waqif Shah Advocate condemned the ‘pathetic’ behaviour of Balochistan government for not providing ambulances for shifting the bodies (mostly remains) of the blast victims.\n\nHe said the other coal miners from Shangla then had to place a piece of cloth on the road for collecting donations for arranging ambulances for the victims, and the bodies were brought to Shangla without the support of the Balochistan, federal and Khyber Pakhtunkhwa governments.\n\nMr Shah said the underprivileged people of Shangla left their families to make a living for them working in coal mines, but unfortunately they were neither safe inside the mines nor outside.\n\nAbid Yar, spokesperson of the coal mine workers’ rights association, said a large number of poor people from Shangla worked in coal mines in different areas of Balochistan to earn a living for their families back home, but the precarious security situation was taking a heavy toll on their lives.\n\nHe said the government should immediately announce a martyred package for the families of the blast victims, and ensure the safety of mineworkers in the province.\n\nIbadullah Khan, Opposition Leader in the Khyber Pakhtunkhwa Assembly, condemned the terrorist attack on the innocent workers, saying: “We demand immediate inquiry into the incident.”\n\nA protest rally was also held in Lilownai village after the bodies of miners arrived there.\n\nThe funeral prayers of all the six martyred miners were offered at Lilownai bus stand.\n\nThe deceased were identified as Ayaz Khan, Hazrat, Bacha Hussain, residents of Upper Dir, Mohammad Hanif, Rahimullah Gul, Javed Khan, Rehmat Shahid, Daulat Mand, Iqbal Hussain, residents of Lilownai, Shangla, while Umar Ali belonged to Khwazakhela, Swat.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b101ffb9efa.jpg",
  "retrievedAt": "2025-10-12T01:28:06.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892200/shangla-people-pour-onto-roads-against-killing-of-miners-in-harnai",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:12:31.000Z"
}
