{
  "title": "Germany’s far-right AfD basks in spotlight of Musk support - World - DAWN.COM",
  "author": null,
  "content": "All other German parties see the far-right Alternative for Germany (AfD) as a threat to democracy, but the anti-immigration party has a powerful friend abroad: Elon Musk, the loudhailer voice of Team Trump.\n\n“Let’s go, guys, let’s go — fight for a great future for Germany!” the tech billionaire shouted via video link at a recent AfD campaign rally.\n\n“It’s good to be proud of German culture, German values, and not to lose that in some sort of multiculturalism that dilutes everything,” he told the jubilant crowd in Halle in the party’s ex-communist eastern heartland.\n\nWhile mainstream Berlin has reacted with a shudder to the new leadership in Washington, the AfD has cheered its ideological allies in the fight against migrants, wind farms, gender politics and all things “woke”.\n\nAs Europe’s top economy careens towards February 23 polls, Musk has weighed in on the campaign with volleys of online crossfire.\n\nAs well as backing the AfD, the man behind SpaceX, Tesla and X has also trolled centre-left Chancellor Olaf Scholz with insults such as “fool” and “Oaf Schitz”.\n\n“You must vote for change,” Musk told Germans in a streamed conversation with the party’s top election candidate Alice Weidel. “And that is why I’m really strongly recommending that people vote for AfD.”\n\nOn Friday, US Vice President JD Vance backed that stance in a speech to a security meeting in Munich where he berated EU leaders for ignoring the wishes of voters worried about immigration in a broadside later hailed by Trump.\n\nLong shunned as outsiders in Germany, the subject of mass protests and security services surveillance, the AfD has gloated about the attention lavished on it from across the Atlantic as it polls at a record 20 per cent.\n\n“It’s a good time for the AfD because we are getting a lot of support from the Trump administration,” said the party’s Berlin boss, architect Kristin Brinker.\n\n“If the richest man in the world and people from Trump’s circle say that the AfD is okay, you can work with them, then that’s the best thing that could have happened — and I think it will open even more doors for us.”\n\nThe AfD was invited to Trump’s inauguration, a day on which a jubilant Musk gave a right-arm salute many interpreted as the Nazi greeting outlawed in post-war Germany.\n\nMusk has denied any such meaning, but many of his critics were not convinced — including political activists who beamed the image and the word “Heil” onto the Tesla electric-car plant outside Berlin.\n\nWhen Musk addressed the AfD campaign rally, he told the crowd via video link to be proud of their “millennia-old” culture and worry less about their historical guilt.\n\nIt played well with the party, whose senior figures have called for an end to Germany’s post-World War II culture of repentance and dubbed Berlin’s Holocaust remembrance site a “memorial of shame”.\n\nMusk has delighted in deriding Germany’s centrist politicians, who have been stunned by the new hostility from the United States, long their most important ally.\n\nScholz has tried to push back, including on Trump’s stated designs on Greenland, seeking to signal a quietly resolute stance while avoiding further stirring up a hornets’ nest.\n\nTrump — who often rails against Germany over insufficient Nato spending and its huge trade surplus — has also issued threats, such as tariffs that would hammer Germany’s already ailing economy.\n\nConservative election frontrunner Friedrich Merz, who boasts a business world background, has vowed to speak to Trump, whom he has characterised as “predictably unpredictable”.\n\nWhile Berlin’s political establishment is in a flap over Trump 2.0, the AfD cannot believe its luck.\n\nIn her streamed X chat with Musk, Weidel claimed the AfD had been “negatively framed” as an extremist group. She insisted it was really a “conservative libertarian” party.\n\nLike Musk, she spoke admiringly of Trump and said it had caused her “physical pain to see how he has been disparaged” in Germany.\n\nBoth voiced their shared disdain for German bureaucracy and online “censorship” and agreed heartily when Weidel slammed Germany’s “insane, woke, leftist, socialist” education system.\n\nWhen the conversation turned to Germany’s Nazi history, Weidel insisted Hitler was a “communist”. They also discussed the Middle East and religion, before their exchanges took an interstellar turn.\n\nWeidel asked Musk about his plans to settle Mars, leading the Space X chief to expound at length on his vision for humans to become “a multi-planet species”.\n\nWhile their chat was widely ridiculed in German media, political scientist Wolfgang Schroeder of Kassel University predicted Musk’s praise for the AfD would have “a mobilising effect” and presented “a kind of ennoblement”.\n\nHeader image: A person holds a placard depicting Alice Weidel, co-leader of the Alternative for Germany party (AfD), and SpaceX CEO Elon Musk, during a demonstration called for by ‘Koeln stellt sich quer’ [Cologne is standing up] against the far-right Alternative for Germany (AfD) party in Cologne, Germany on Jan 25, 2025. — Reuters/Jana Rodenbusch",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/16135057a2b0511.jpg",
  "retrievedAt": "2025-08-25T19:39:38.610Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892344/germanys-far-right-afd-basks-in-spotlight-of-musk-support",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T08:57:02.000Z"
}
