{
  "title": "Yasmin expects Nawaz to admit defeat in NA-130 election - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The incarcerated president of PTI’s Punjab chapter, Dr Yasmin Rashid, in an open letter sent through her lawyer, has said PML-N chief Nawaz Sharif should have the courage to admit his ‘defeat’ in the 2024 general elections as did his party leaders Rana Sanaullah and Saad Rafique.\n\nShe said the people were aware who had won the election in the Lahore NA-130 constituency. “I contested the election from jail, yet I managed to get more votes than Nawaz Sharif according to 93 per cent results as per Form-45 that we have,” she said.\n\nHoping that the election tribunals will be honest with their verdict once they go through the fudged-up results, she said the truth would finally prevail.\n\nShe said the nation came through with flying colours on Black Day on Feb 8 proving that they believe in the democracy, but “do not try out their patience”.\n\nShe said Section 144 and other such laws were applicable only to PTI supporters. “Our workers are harassed, MPAs arrested, tear-gassed and beaten up if they peacefully protest on the pretext of Section 144, while federal information minister Attaullah Tarar can hold a rally to celebrate achievements in Lahore city – supported and assisted by the police,” she observed.\n\nShe said she did not blame Mr Tarar, the follower of Ta-hayat Quaid [lifetime leader] Nawaz Sharif, who played a match only when he had ‘his own’ umpires in the field.\n\nShe said 372 days had passed since the destruction of the election process on Feb 8, 2024. She said a fraudulent Form-47 government came into existence which was completely subservient to the establishment. The tribunals, which were supposed to decide the election petitions within 80 days, were almost dormant, defying the rule of Election Commission of Pakistan itself.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:40:07.634Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892212/yasmin-expects-nawaz-to-admit-defeat-in-na-130-election",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:11:46.000Z"
}
