{
  "title": "China seeks stronger cooperation with Germany and EU - World - DAWN.COM",
  "author": null,
  "content": "BEIJING: China considers Germany and the European Union as a whole as strategic partners, and it wants stronger cooperation with them in the spirit of free trade and multilateralism, the Chinese foreign minister told the German chancellor on Saturday.\n\nForeign Minister Wang Yi told Chancellor Olaf Scholz that China was willing to deepen “all-round cooperation” with Germ­any as part of positive bilateral efforts to maintain global peace and stability.\n\nWang was in Germany, the EU’s biggest economy, to attend the annual Mun­ich Security Conference and held talks with the EU’s foreign policy chief and his Spanish and French counterparts, as well as with Scholz.\n\nGermany, whose huge car sector is reliant on Chi­na, voted last October agai­nst the European Union’s tariffs on China-made electric vehicles (EVs).\n\nAccording to a statement from the Chinese foreign ministry, Wang conveyed to Scholz China’s appreciation of Germany’s “rational and pragmatic” attitude towards the tariffs. He said he hoped Germany would “continue to play a constructive role in resolving trade frictions and other issues between China and the EU as soon as possible,” the statement said.\n\nWithout giving detail, the statement also said China and the EU should jointly work towards better mutual relations.\n\nThe officials discussed the Russia-Ukraine conflict, with Wang saying China and Europe share the goal of wanting to move towards a peaceful resolution of the crisis. “China is willing to maintain communication with Germany and other relevant parties and continue to play a constructive role in promoting peace talks,” Wang said.\n\nFollowing increased pressure from the United States on European members of Nato to increase their defence expenditure, Wang spoke of the necessity for a “balanced, effective and sustainable” Euro­p­ean security framework, an official Chinese statement said.\n\nEarlier, in his speech at the conference, Wang laid out China’s position on the Ukraine war and urging peace talks that included all stakeholders involved in the conflict.\n\nAccording to a separate statement from China, Wang also told his German counterpart on the sidelines of the conference that Germany has been a “stabilising force” in its relations with the EU.\n\nWang said China saw no fundamental conflicts between it and the EU in remarks to Kaja Kallas, the EU’s foreign policy chief, also on the conference’s sid­elines, and said China was willing to work to enhance mutual understanding and pursue global stability.\n\nDuring his time in Munich, Wang also met his French counterpart and urged a cooling of any trade friction. “As comprehensive strategic partners, we believe that China and France and China and the EU have the wisdom and ability to handle the matter properly,” he said.\n\nScholz rebukes Vance\n\nAt the conference, Ger­man Chancellor Olaf Sch­olz delivered a strong reb­uke on Saturday to US Vice President JD Vance’s att­ack on Europe’s stance tow­ard hate speech and the far right, saying it was not right for others to tell Germany and Europe what to do.\n\nVance lambasted Euro­pean leaders on the first day of the Munich conference, accusing them of censoring free speech and criticising German mainstream parties’ “firewall” against the far-right Alter­native for Germany (AfD). Vance also met AfD leadership, after endorsing the party as a political partner.\n\n“That is not appropriate, especially not among friends and allies. We firmly reject that,” Scholz said, adding there were “good reasons” not to work with the AfD.\n\n“Never again fascism, never again racism, never again aggressive war. That is why an overwhelming majority in our country opposes anyone who glorifies or justifies criminal National Socialism,” Scholz said.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b10ccda0844.jpg",
  "retrievedAt": "2025-08-25T19:40:07.982Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892211/china-seeks-stronger-cooperation-with-germany-and-eu",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:11:46.000Z"
}
