{
  "title": "Hong Kong’s twin panda cubs to make public debut today - World - DAWN.COM",
  "author": null,
  "content": "HONG KONG: Hong Kong’s baby panda twins will make their public debut on Sunday, with officials rolling out a full-scale panda marketing campaign to boost tourism. The pair, one female and one male, were born six months ago and join four other pandas at the city’s Ocean Park theme park.\n\n“This is the first pair of giant pandas born in Hong Kong, and the whole city is cheering with excitement,” John Lee, the city’s leader, said at a ceremony on Saturday. He added that a naming competition had been launched with the names to be announced in the first half of the year.\n\nSince their mother Ying Ying became the world’s oldest giant panda on record to have given birth, just one day shy of her 19th birthday, panda decor and promotions have mushroomed across Hong Kong.\n\nThe panda carers said the female cub seemed more active than her male twin. She loves climbing the tree inside the enclosure and resting there while her brother likes to wander around and play with the plants.\n\nThe male cub has been marked with two purple food-colouring spots on its back to distinguish it from his sister, the Associated Press reported.Metro trains and the city’s airport express have adopted panda themes and an exhibition with 2,500 panda sculptures has been on display at different locations around the city. Adding to panda mania has been the arrival of two from Sichuan, An An and Ke Ke, who were gifted by the central Chinese government in September and only put on display in December.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b13fbe931b0.gif",
  "retrievedAt": "2025-10-12T01:28:20.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892300/hong-kongs-twin-panda-cubs-to-make-public-debut-today",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:30:53.000Z"
}
