{
  "title": "Blanket age relaxation approved for Sindh govt jobs - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Recogni­sing prolonged delays in recruitment and an overwhelming number of applications, the Sindh government on Saturday approved a blanket relaxation of up to five years beyond the maximum age limit of candidates for the provincial government jobs.\n\nPreviously, the age limit for government jobs was 28 years, which has now been increased to 33.\n\nThe relaxation applies across all departments, except for the police and the posts filled through the combined competitive examination condu­cted by the Sindh Public Service Commission.\n\nThe relaxation will remain in effect for an initial period of two years, starting from Jan 1, 2025, to Dec 31, 2026.\n\nUnder Rule-5, upper age relaxation for gene­ral candidates will be gra­nted based on compe­lling reasons and sound justifications. These reasons may include medical issues, the death of parents or a spouse, natural calamities, delays in appointments, recruitment bans, and other significant circumstances. To assess these cases, special committees will be constituted.\n\nCabinet decision to remain effective till end of 2026\n\nAddressing a press con­f­e­rence, provincial minister Sharjeel Inam Memon said the cabinet had approved an increase of five years in the age limit for provincial government jobs. “This decision was made by the provincial cabinet, considering the restrictions on government jobs,” he added.\n\nA spokesman for CM House said the cabinet had approved the Relax­a­tion of Upper Age Limit Rules, which granted significant upper age relaxation for candidates appl­ying for government jobs.\n\nChief Minister Syed Murad Ali Shah, who cha­ired the cabinet mee­ting, directed the services, general administration and coordination department (SGA&CD) to notify the new rules.\n\nThe meeting, held at CM House, was attended among others by ministers, advisers, special assistants, acting chief secretary and relevant secretaries.\n\nAccording to the decision, the general upper age relaxation applies to various categories of candidates, as follows: government servants with two years of continuous service will be eligible for up to five years of relaxation, to be granted by the respective administrative department; general candidates will be entitled to up to two years of relaxation by the administrative department and up to five years by the SGA&CD; widows or children of civil servants who died during service will also be eligible for up to five years of relaxation, granted by the administrative department; persons with disabilities, divorced women, and widows will also be entitled to up to five years of relaxation, granted by the administrative department.\n\nWidows and divorced women must present relevant certificates, such as a death certificate (for widows) or a divorce certificate (for divorced women), at the time of applying for age relaxation.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:27:53.869Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892218/blanket-age-relaxation-approved-for-sindh-govt-jobs",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:11:39.000Z"
}
