{
  "title": "Maintaining balance - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE are good reasons to be wary. With a new US administration under Donald Trump consolidating its grip on that nation’s foreign policy, there is uncertainty about the short- to medium-term future of Pakistan-US ties.\n\nRecent developments give cause for concern. The Foreign Office has been compelled to publicly express its concerns regarding the outcomes of a recent meeting between President Trump and Indian Prime Minister Narendra Modi. Specifically, Islamabad is worried about Mr Trump’s offer to sell advanced military technologies, such as F-35 jets, to India, which has implications for Pakistan’s national defence.\n\nIt is also indignant that the joint communiqué issued after the meeting has called for Pakistan to “expeditiously bring to justice” those responsible for the 2008 Mumbai attacks and the Pathankot incident and called for Pakistani territory to not be used for cross-border terrorism. Such references are “one-sided” and “misleading”, the FO has said.\n\nMeanwhile, the US has nominated S. Paul Kapur, a scholar of Indian origin known for his hawkish views on Pakistan, to be its representative for South and Central Asia. Mr Kapur would be the latest addition to a bevy of strong critics of Pakistan in the new administration. His nomination is already being seen in some circles as a sign of Washington’s souring view of Islamabad’s policies.\n\nThen there are vocal groups of Pakistani expatriates in the US who rallied behind Mr Trump during his campaign and have been pushing for the new administration to take a harder line on Islamabad’s internal policies. All of these factors seem to give the impression that the regime in Islamabad is in the unenvious position of being forced to once again ‘prove’ its utility for US policymakers.\n\nThere is no question that Pakistan’s concerns regarding India are valid. New Delhi seems to once again be leveraging economic heft to avoid accountability for its own involvement in running global assassination and terrorism networks, while at the same time using its engagements with foreign partners to shift blame publicly onto Pakistan.\n\nIslamabad should not stand by idly as India plays this game; it must take a more proactive approach to establishing Pakistan’s bona fides. It is regrettable that despite Pakistan’s long engagement in the global war against terrorism and its continuing counterterrorism cooperation with the US, the steep price its people have paid in social and economic terms is still not recognised or appreciated.\n\nClearly, we need to rethink our foreign and security policies to bring them closer to the expectations of foreign allies while keeping national interests supreme.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/15074818c66bbfe.png?r=074910",
  "retrievedAt": "2025-08-25T19:39:39.602Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892284",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:12:51.000Z"
}
