{
  "title": "Suspect remanded in police custody as SHC moved for exhumation of Mustafa Amir’s body - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: An anti-terrorism court on Saturday remanded a suspect in police custody in a case pertaining to the abduction and murder of a youth in the Defence Housing Authority.\n\nMustafa Amir was abducted from the DHA on Jan 6 and two weeks later his family had received a ransom call. During the course of investigation, the police arrested victim’s friend Armaghan after a shoot-out, but could not get his physical remand from court for questioning.\n\nOn Saturday, the investigating officer produced another suspect, Sheraz, aka Shavez Bukhari, a friend of Armaghan, and sought his custody for interrogation.\n\nThe IO said that during the initial questioning, the suspect had disclosed that Armaghan had called Mustafa at his DHA residence, killed him after subjecting him to torture and burn the body along with his car in Hub.\n\nProsecution approaches SHC for getting physical remand of prime suspect Armaghan\n\nThe judge remanded the suspect in police custody till Feb 21 and directed the IO to produce him at the next hearing along with a progress report.\n\nPlea for exhumation\n\nThe mother of the victim also moved an application in court, seeking a directive for the authorities concerned to exhume the body of her son.\n\nHowever, the ATC asked the applicant to approach the judicial magistrate concerned for such purpose as a magistrate is empowered to pass an order about exhumation and other related issues.\n\nThe police said that an unidentified body was found in a torched car in Hub on Jan 12 and the Balochistan police had handed it over to the Edhi Foundation for burial. The unclaimed body was buried in the Edhi graveyard in Karachi on Jan 16.\n\nMagistrate’s refusal to remand Armaghan challenged in SHC\n\nThe prosecution said that Armaghan was arrested during a raid at his residence in DHA on Feb 8 after a shoot-out that led to bullet injuries to a DSP and a police constable while the police had also obtained a cell phone of the deceased and found blood stains as well as illicit weapons from the house.\n\nThereafter, the IO had brought the suspect before the court and sought his physical remand for questioning, but the judge turned down the request and sent him to prison on judicial remand.\n\nActing prosecutor general of Sindh Muntazir Mehdi said that the prosecution had approached the Sindh High Court to impugn the order passed by the administrative judge of ATCs denying physical custody of the main suspect Armaghan.\n\nHe was of the view that it was a heinous crime and the key suspect was remanded to jail even before the investigation could start. He said his physical custody was necessary for investigation.\n\nHe also said that another order of the ATC, passed on an application filed by Armaghan’s father seeking registration of an FIR against the raiding police party, had also been challenged before the SHC and such matters were likely to be taken up for hearing on Monday.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:27:45.603Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892234/suspect-remanded-in-police-custody-as-shc-moved-for-exhumation-of-mustafa-amirs-body",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:12:12.000Z"
}
