{
  "title": "Ambitious project launched to turn Cholistan green - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Punjab CM, COAS inaugurate project under Green Pakistan Initiative\n• Farmers to get high-yield seeds, machinery on rent to improve crop output\n• Minister highlights urgent need for tackling food security challenges\n\nLAHORE: Punjab Chief Minister Maryam Nawaz Sharif and Chief of Army Staff (COAS) Gen Asim Munir on Saturday inaugurated an ambitious agriculture initiative to irrigate barren land in Punjab’s Cholistan area.\n\nUnder the initiative, farmers would be provided with high-quality seeds, fertilisers, modern machinery and scientific support to increase the yield of their crops, says a press release issued by the provincial government.\n\nThe project was inaugurated with considerable fanfare, despite serious reservations of PPP — an ally of PML-N in the federal government — over the plan to draw new canals from the Indus River to meet the irrigation needs of Green Pakistan Initiative (GPI).\n\nThe inauguration ceremony at Kandai and Chapu areas of Cholistan was also attended by fed­e­ral Minister for National Food Security & Research Rana Tanveer Hussain, federal Minister for Water Resources Dr Mus­adik Malik, senior provincial minister Marriyum Aurangzeb, provincial minister for agriculture and livestock Syed Ashiq Hussain Kirmani, provin­cial minister for irrigation Muhammad Kazim Pir­zada and senior officials.\n\nThe main components of the project are the Green Agri Mall and Service Company, Smart Agri Farm and Agri Research and Facilitation Centre.\n\nThe Green Agri Mall and Service Company will be a “one-stop solution” for farmers, providing them high-yield seeds, fertilisers, pesticides and fuel at subsidised rates at their doorstep, the statement added.\n\nModern farming machines, including tractors and drones, will also be rented out to farmers.\n\nA 5,000-acre Smart Agri Farm will be irrigated through a ‘High Efficiency Irrigation Sys­tem’ or maximum crop yield at the lowest possible cost.\n\nThe Agri Research and Facilitation Centre would provide technical input and laboratory services, including soil testing, to farmers. The centre will collaborate with research and academic institutes across Pakistan to improve agricultural output.\n\n‘Lifeline of Pakistan’\n\nWhile addressing the ceremony, the Punjab chief minister said agriculture was the “lifeline of Pakistan”.\n\nMaryam Nawaz lauded the GPI for “introducing contemporary best practices” in the agriculture sector. She said the projects would “mark the beginning of a new phase” for Punjab farmers.\n\nAgricultural development is “closely linked to the well-being of farmers and the overall growth of Pakistan”. She also handed over land allotm­ent letters to the next of kin of martyred soldiers and war-wounded veterans.\n\nCOAS Munir acknowledged the role of Punjab as a “powerhouse for Pak­is­tan’s agriculture sector”.\n\nHe appreciated the GPI for its considerable success in a short time and assured the army’s continued support for economic development.\n\nReforms needed\n\nThe provincial agriculture minister said GPI would transform Cholis-tan from a barren region to a fertile land.\n\nThe farmers will have access to all agricultural facilities, including seeds, pesticides, fertilisers and modern farming machinery under GPI, he told a press conference on Saturday.\n\nHe added that these agricultural inputs will be available to farmers at government-regulated prices.\n\nThe rental service for agricultural machinery would also be expanded to every tehsil of Punjab, the minister added.\n\n“This mega programme … will serve as a major milestone in developing the agricultural sector.”\n\nHe said the Punjab government has launched several projects to support farmers, including the Kissan Card, Green Tractor Programme, solarisation of agricultural tube wells and the provision of super seeders to combat smog.\n\nThese projects will bring “revolutionary reforms” in the agricultural sector and introduce modern technology to boost the national economy, Mr Kirmani added.\n\nHe emphasised the importance of using genetically resilient and climate-adaptive seeds, efficient irrigation systems and modern agricultural machinery to increase the per-acre crop yield and reduce losses.\n\n“There is an urgent need to introduce cooperative farming to tackle food security challenges,” the minister claimed.\n\n“Along with revolutionary reforms in the agricultural sector, the country’s economy will be improved by introducing modern technology in farming.”\n\nHe added that provincial, federal, and army institutions were “working together in a collaborative effort” to achieve this goal.\n\nHe added that reforms have also been undertaken in the livestock sector, including initiatives like the livestock card and distribution of assets among widows and divorced women of south Punjab.\n\nOver 100,000 animals have been registered through the livestock card, the minister said, adding that an animal tag and trace system has been started to improve bread, milk and meat production.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b10fd850e61.jpg",
  "retrievedAt": "2025-10-12T01:27:41.499Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892222/ambitious-project-launched-to-turn-cholistan-green",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:11:39.000Z"
}
