{
  "title": "Musk and space travel skewered in South Korean director Bong’s latest film - World - DAWN.COM",
  "author": null,
  "content": "Interplanetary space travel and the vanity of tech billionaires like Elon Musk are the subject of acclaimed South Korean director Bong Joon Ho’s satirical new film “Mickey 17” which was shown at the Berlin film festival on Saturday.\n\nThe writer and director of the Oscar-winning 2019 hit “Parasite” returns to screens with a darkly comic take on the sci-fi genre starring British actor Robert Pattinson as Mickey, an intrepid but accident-prone space explorer.\n\nThe film tells “a story of the future but it seems like it could also happen in the present or the past”, Bong said at the Berlin Film Festival.\n\nThe plot revolves around a megalomaniac billionaire with a resemblance to Musk —played with brio by “Avengers” star Mark Ruffalo — who boards a spaceship travelling to colonise an icy planet in a not-too-distant future.\n\n“Mark Ruffalo is a character who embodies the dictators of the past who we’ve experienced,” said Bong, who adapted the book “Mickey7” by sci-fi writer Edward Ashton.\n\nMickey is a struggling working-class passenger known as an “expendable” who is chosen to undertake all the most dangerous missions aboard the vessel.\n\nWhen he dies — in various grisly fashions — Mickey can be recreated again using a human 3D printer.\n\nPattinson said he enjoyed playing characters who have “an incredibly complicated philosophical situation they have to deal with”.\n\n“I think there’s something quite moving with Mickey where he is trying to process what he is and what he’s made out of, but also at the same time has a kind of relationship with all of his previous selves,” he said.\n\n“I think it’s actually a question that most people have to deal with at one point or another. Basically asking why do I exist, but having quite a silly character trying to consider it.”\n\nMusk, who has emerged as one of US President Donald Trump’s most trusted aides, is in the vanguard of Silicon Valley’s right-wing “tech-utopians” who believe innovation can solve everything from the climate crisis to human mortality.\n\nThe South African-born Tesla boss has spent billions of dollars developing rockets at his SpaceX company to send a manned mission to Mars by 2030, with interplanetary travel seen by him as crucial for humanity’s survival.\n\nThe ambition was given a boost by Trump during his inauguration speech on January 20 when he vowed to “plant the Stars and Stripes on the planet Mars”.\n\nOther US billionaires such as Amazon founder Jeff Bezos are also engaged in a private space race.\n\nBong said he “had some faces in mind” when creating Ruffalo’s character, but he was based on “bad politicians… from the past” rather than anyone from the present.\n\n“But history always repeats itself, so (the film) seems to cover current events as well,” he said.\n\nIn “Mickey 17”, passengers hop on the rocket ship almost casually for a variety of reasons, with Mickey seeking to escape his problems on Earth.\n\nIt is not the first time a dystopian future has provided the backdrop to a Bong film, with his 2013 movie “Snowpiercer” set on a train following a failed climate-change experiment that has plunged the planet into a new ice age.\n\nBong, 55, said he wanted his foray into science fiction to have a “very human” element and for the situation in the film to be “one you could experience in real life”.\n\n“I want to make films of all genres, that’s my life’s goal. Though I’m a bit nervous about musicals,” he said.\n\n“Mickey 17”, a Warner Bros. production, will be released first in South Korea on February 28 before appearing in cinemas internationally from March 5.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1614205839ff465.jpg",
  "retrievedAt": "2025-08-25T19:39:36.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892342/musk-and-space-travel-skewered-in-south-korean-director-bongs-latest-film",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T09:48:18.000Z"
}
