{
  "title": "Blasphemy convict on death row acquitted in Rawalpindi - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Lahore High Court (LHC), Rawalpindi bench, has acquitted a man previously sentenced to death on blasphemy charges, citing insufficient evidence and inconsistencies in witness testimonies.\n\nSajid Ali, son of Mohsin Khan, was accused of making derogatory remarks against religious personalities. He was booked on April 14, 2020, in a case registered in Hasanabdal, Attock.\n\nHe was charged under Section 295-C of the Pakistan Penal Code (PPC), which mandates the death penalty for derogatory remarks against the Holy Prophet (peace be upon him), Section 298-A, which criminalises offensive remarks against the family and companions of the Holy Prophet (PBUH), carrying a penalty of up to three years in prison.\n\nFollowing a trial, the additional sessions judge of Hasanabdal sentenced Sajid to death in 2023, with a fine of Rs100,000. He was also sentenced to three years of rigorous imprisonment under Section 298-A of the PPC. However, Sajid challenged the ruling before the LHC .\n\nInconsistencies in witness accounts, insufficient proof cited for overturning trial court’s decision\n\nHis counsel, Advocate Tania Bazai, argued the case was fabricated and the prosecution failed to provide credible evidence to support the allegations against her client.\n\nThe lawyer highlighted inconsistencies in the testimonies of prosecution witnesses, some of whom provided “conflicting versions of the alleged incident”. She argued the FIR was registered days after the alleged remarks had been made. The prosecution failed to produce any direct or physical evidence linking the accused to these remarks, she argued.\n\nAfter reviewing the case, the court found the evidence against Sajid to be inconclusive and insufficient to sustain a conviction. The court noted that prosecution witness testimonies contained serious contradictions, undermining their credibility.\n\nSubsequently, the LHC bench overturned the trial court’s verdict and ordered immediate release of Sajid, setting aside the death sentence.\n\nPublished in Dawn, February 16th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:39:39.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892304/blasphemy-convict-on-death-row-acquitted-in-rawalpindi",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T01:38:50.000Z"
}
