{
  "title": "Levies personnel martyred, 2 others injured in attack on Kalat checkpost - Pakistan - DAWN.COM",
  "author": null,
  "content": "A levies personnel was martyred while two others were injured on Sunday as a result of an attack on a checkpost in Balochistan’s Kalat district, officials said.\n\nPakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan. Terror attacks have increased since the banned Tehreek-i-Taliban Pakistan (TTP) broke a fragile ceasefire agreement with the government in 2022.\n\nIn a statement, Balochistan government spokesperson Shahid Rind said, “One personnel was martyred while two were injured in an attack on a Levies checkpost in Kalat.”\n\nHe added that the Levies force immediately retaliated, forcing the assailants to flee. An investigation into the attack has been ordered, Rind said.\n\nThe injured personnel have been shifted to Quetta for medical treatment, according to Rind.\n\nThe spokesperson further said a search operation was being carried out to arrest the miscreants and that directives on that had been issued to the law enforcement agencies.\n\nExpressing the Balochistan government’s condolences on the incident, Rind paid tribute to the martyred security personnel and said he shared the grief of the bereaved family.\n\n“The sacrifices rendered by the security forces to restore peace will not go to waste,” Rind asserted.\n\nThe checkpost assault comes just a day after four soldiers were martyred while 15 terrorists were killed in two separate intelligence-based operations (IBOs) carried out in Khyber Pakhtunkhwa.\n\nAt the outset of this month, 18 soldiers were martyred while 23 terrorists were killed within 24 hours in various sanitisation operations across Balochistan. Twelve of the slain militants had died in an overnight clash in Kalat.\n\nThe same day, in a late-night incident, four personnel of the Balochistan Levies and a civilian were martyred in a bomb att­ack in KP’s Dera Ismail Khan, near Baloch­istan’s border district of Dherani. The Counter-Terrorism Department (CTD) registered a case while the Balochistan government formed a fact-finding tribunal to probe the incident.\n\nThe next day, two security personnel lost their lives and another person was injured in separate armed attacks in Balochistan.\n\nWith at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade, according to a report issued by the Centre for Research and Security Studies (CRSS) think-tank.\n\nAccording to the ISPR Director General, security forces conducted a total of 59,775 operations last year during which 925 terrorists were killed and 383 officers and soldiers were martyred.\n\nMeanwhile, Prime Minister Shehbaz Sharif strongly condemned the terrorist attack on the Kalat Levies checkpost, state-run Radio Pakistan reported.\n\nIn a statement, he said the terrorists are enemies of the development and progress of Balochistan.\n\nAccording to his statement quoted in the report, the Levies personnel was named Ali Nawaz. The premier prayed for the martyr’s high rank, saying he sacrificed his life to defend his motherland.\n\nThe prime minister also wished the injured a speedy recovery and reaffirmed the government’s resolve to not “allow the nefarious designs of terrorists to succeed”.\n\nBalochistan Chief Minister Sarfraz Bugti also denounced the attack in a statement on X. He hailed Nawaz for fulfilling his duties and setting an “example of bravery by sacrificing his life”.\n\nCM Bugti said he shared the grief of the personnel’s family and prayed for the quick recovery of the injured security persons.\n\n“The sacrifices rendered by the security forces to protect the people of Balochistan will always be remembered,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/16161652ef1fdd7.png",
  "retrievedAt": "2025-08-25T19:39:35.305Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892352/levies-personnel-martyred-2-others-injured-in-attack-on-kalat-checkpost",
  "dateList": "2025-02-16",
  "date_published": "2025-02-16T11:29:19.000Z"
}
