{
  "title": "Denmark Ambassador greets Pakistan on 75th independence anniversary",
  "link": "https://www.app.com.pk/national/denmark-ambassador-greets-pakistan-on-75th-independence-anniversary/",
  "date_published": "2022-08-14T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP):Ambassador of Denmark to Pakistan, Ms Lis Rosenholm on Sunday greeted Pakistan on its 75th independence anniversary and expressed their heartiest felicitations and best wishes to the people of Pakistan.\nOn the occasion of the Diamond Jubilee of Pakistan’s independence, on behalf of the people of Denmark, Ambassador Lis Rosenholm, said that “A happy country is a diverse, tolerant and inclusive one.”\nThe Ambassador said in a message,”We are looking forward to continue working together for a green future for Pakistan and my best wishes for happiness and prosperity for the people of Pakistan.”\nShe said that recently Pakistan and Denmark have signed an inter-governmental framework agreement to enhance financial cooperation in energy and water sectors.Ambassador, Lis Rosenholm said that this cooperation with Pakistan in water, energy and the other sectors is a gift the people of Denmark gave to Pakistan on the occasion of Pakistan’s 75th Independence Day.\nThe agreement, signed by Danish Ambassador Lis Rosenholm and representative of the Economic Affairs Division, allowed for the interest free loans in renewable energy, energy efficiency ,water supply and waste-water treatment sectors.\nPakistan and Denmark enjoyed a friendly and cordial relationship, and there was a lot of potential to enhance the relationship between both the nations.\nShe stated that the efforts to revive bilateral economic and development cooperation with Pakistan, agreeing to provide on-budget support to the Government of Pakistan through the Inter-Governmental Framework Agreement. The focus on Waste Water Treatment Projects in Faisalabad and Lahore was immensely appreciated, she.\nIt is pertinent to mention that this framework agreement is a breakthrough in the bilateral and economic relations between Pakistan and Denmark, who have been partners in successful development cooperation since 1969; however, there had been no active on-budget financial support extended by Denmark since 2017.\nThe efforts to revive bilateral economic and development cooperation between the two countries paid off with Denmark agreeing to provide on-budget support to the Government of Pakistan through this Inter-Governmental Framework Agreement.\nThis Framework Agreement would act as an umbrella agreement for potential development sector projects emanating from it mainly in the sectors of renewable energy, energy efficiency, water supply and waste-water treatment sectors.\nEach project will have its separate financing agreement, which will be negotiated with the Danish side case by case in consultation with all the stakeholders.\nCurrently, waste water treatment projects in Faisalabad and Lahore are in the pipeline, which are to be negotiated under the ambit of this framework agreement.This agreement offers the Danida Sustainable Infrastructure Finance (DSIF) Facility by the Danish side which would provide interest free, but tied loans up to but not limited to € 100 million, and would also facilitate transfer of technology and know-how from Denmark to Pakistan.\nThe interest free loans after signing this agreement would have a 35% concessional element covering the interest on the loan, export premium, bank margin and an upfront grant if these expenses do not arrive at 35% of the contract amount.",
  "retrievedAt": "2025-08-11T15:23:52.092Z"
}
