{
  "title": "Pakistan enjoys special status in comity of nations: PM AJK",
  "link": "https://www.app.com.pk/national/pakistan-enjoys-special-status-in-comity-of-nations-pm-ajk/",
  "date_published": "2022-08-14T14:04:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Aug 14 (APP):Prime Minister Azad Jammu and Kashmir Sardar Tanveer Ilyas Khan while highlighting Pakistan’s role and its geopolitical importance has said that as a responsible global player Pakistan enjoys a special status in the comity of nations.\nHe was speaking at a special function held here on Sunday to mark the Pakistan’s diamond jubilee celebrations. The PM said Pakistan has emerged as a key player in world affairs.\n“The freedom of this country [Pakistan] is linked to the sacrifices of our forefathers”, the PM said, adding that a strong and economically vibrant Pakistan was our ultimate destination. “May our beloved country prosper in leaps and bounds”, he prayed.\nPaying rich tributes to Kashmiris living on the other side of the Line of Control (LoC), the PM said, “On this auspicious occasion, we salute our Kashmiri brethren, mothers, and sisters who bury their martyrs wrapped in green flags”.\nAppreciating their resilience in the face of Indian state terrorism, the PM said, “We salute the courageous people of the Indian occupied Kashmir who are standing firm in the face of nine lakh Indian forces and fighting them bravely.”\nUrging the world to shun its policy of indifference towards the miseries of the Kashmir people, the PM said, “We demand that the world should influence the government of India to withdraw its forces from Kashmir and allow Kashmiris to decide their political fate according to their will.”\nSardar Tanveer congratulated Chairman Development Authority Syed Azhar Geelani and all other concerned authorities for organizing the magnificent ceremony to celebrate Pakistan’s diamond jubilee.\nAddressing the ceremony, Local Government Minister Khawaja Farooq Ahmad said that an economically strong and stable Pakistan was guarantor for the success of the Kashmir Liberation Movement. He said that the day was not far when Kashmiris would celebrate their Independence Day.\nAzad Kashmir Education Minister Dewan Ali Khan Chaghtai said that “our forefathers had decided to commit their future to Pakistan on 19 July 1947 at the residence of Sardar Muhammad Ibrahim Khan even before the independence of Pakistan.”\nFinance Minister Abdul Majid Khan said, “It is a matter of pride for us that we are celebrating the diamond jubilee of Pakistan today”. Khan said that he was proud that they were living in a free state. “Our forefathers have shed their blood in the freedom movement”, he added.\nHe said that Pakistan day was also being celebrated in Occupied Kashmir. Pakistan was incomplete until Kashmir was freed and annexed to Pakistan, he added.\nChief Secretary Muhammad Usman Chachar said, “Today’s ceremony is a matter of honour for us and it is a reminder that we consider independence as a blessing”. He said that Pakistan has always fought the case of Kashmiris at the international level.\n“In accordance with the UN resolutions, Pakistan has highlighted the issue of Kashmir at every forum”, Chachar said.\nOn the occasion, Government Ministers Chaudhry Muhammad Rasheed, Deputy Speaker Chaudhry Riaz Ahmad, State Disaster Management Authority Minister Chaudhry Akbar Ibrahim, Forest Minister Muhammad Akmal Sargala, Parliamentary Secretary Prof. Taqdees Geelani, Chairman Prime Minister Inspection and Implementation Commission Raja Mansoor Khan, Inspector General Police Dr. Ameer Ahmed Sheikh, traders, high civil and military officials, and large number of public including children were also present.",
  "retrievedAt": "2025-08-11T15:23:54.870Z"
}
