{
  "title": "PM reiterates resolve to transform Pakistan into a state reflective of founders’ ideals",
  "link": "https://www.app.com.pk/national/pm-reiterates-resolve-to-transform-pakistan-into-a-state-reflective-of-founders-ideals/",
  "date_published": "2022-08-14T05:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday stressed that they should seek guidance from the ideology and thoughts of the founding fathers and put the welfare of the people at the center of their mission of national rejuvenation.\n“Let us vow to turn Pakistan into a nation-state that is reflective of the ideals of our founding fathers,” the prime minister said in a message on the 75th Independence Day of Pakistan.\nHe said the 75th Independence Day was a watershed moment in the nation’s history. Today we pay rich tributes to Muslims of the sub-continent and express our collective gratitude to them for their heroic struggle, and epic sacrifices for the creation of a new state.\nThe establishment of Pakistan is an outcome of the Quaid-i-Azam’s single-minded devotion, unflinching resolve and his unwavering struggle, he added.\nThe prime minister said from the conception of an idea in 1930, Pakistan emerged on the map of the world as the largest Muslim country in a short span of 17 years.\nThe coming of Pakistan into existence was not less than a miracle that stunned friends and foes alike, beating all predictions and assessments, he added.\n“Where the 75th Independence Day is an occasion of jubilation and festivity, it is also a moment of reflection and self-accountability. We, as a nation, have achieved many milestones during the last seven and a half decades,” he added.\nThe prime minister said “From thwarting external aggression to putting together federal constitution to becoming the 7th nuclear power of the world to beating the scourge of terrorism, we have come a long way. The odds were definitely heavier than anyone could imagine but our national will to defeat them was stronger.”\nAt the same time, he observed that it was also a fact that we have not been able to fully realize the dream that our founding fathers dreamed; the dream of socio-economic justice, rule of and equality before the law, and the dream of an egalitarian society.\n“While we are an independent nation, a precious gift for which we cannot thank Allah Almighty enough, true freedom lies in being free from want, hunger, poverty and backwardness. As long as we do not have economic sovereignty, the concept of freedom will remain incomplete,” he added.\nHe said nothing was more dangerous for a nation than the internal division; disruption and chaos, for such negative forces undermine the solidarity and integrity of the country and rob societies of their national purpose.\nThe Quaid-i-Azam warned against such evils and gave the motto of “unity, faith and discipline” as an antidote, he added.\n“The greatest strength of our country is the people, particularly the youth. It is their energy, resolve and passion that is capable of overcoming any odd, beating any hurdle and lighting the candle of hope. We can push back the divisive and nihilistic forces with the power of the people and protect our freedom and identity. I have my full faith in their capabilities to chart a way forward,” the prime minister reaffirmed.",
  "retrievedAt": "2025-08-11T15:24:06.546Z"
}
