{
  "title": "MOFA officials pay musical tribute on 75th anniversary of Independence Day",
  "link": "https://www.app.com.pk/national/mofa-officials-pay-musical-tribute-on-75th-anniversary-of-independence-day/",
  "date_published": "2022-08-14T11:13:00.000Z",
  "source": "APP",
  "content": "SLAMABAD, Aug 14 (APP): On the occasion of the 75th anniversary of Pakistan’s Independence, officers of the Ministry of Foreign Affairs (MOFA) came together to pay a heartfelt musical tribute to the homeland.\nThe Officers re-recorded the iconic milli naghma (national song) penned by Kaleem Usmani and sung by Mehdi Hassan, “Yeh Watan tumhara hai (this is your country)”.\nThis song was recorded and filmed in collaboration with Pakistan Television, Radio Pakistan and renowned singer and composer Owais Niazi.\nThis famous milli naghma was chosen for its powerful message that reminded all Pakistanis to treasure and protect the homeland that was created through the independence struggle by our forefathers led by Quaid-e-Azam Muhammad Ali Jinnah, and with the blood of the martyrs in its soil.\n“We are reminded of our duty to our homeland, to its skies and to its waters, with discipline and dedication – to rise to our responsibility as guardians of this country. It has a powerful message for the youth of Pakistan to cherish their identity and remember that it is their hard work and determination that will take this country forward,” the foreign office spokesperson said in a press release on Sunday.\nTrue to the spirit of the song calling on the people to rise to the occasion and recognize their duty as guardians of our homeland, the officers of the Ministry of Foreign Affairs performed their duties conscientiously as the first line of defence for Pakistan.\nThe video showcased the life and work within the ministry of foreign affairs and its various locations, its iconic buildings, the officers’ daily work routine in the ministry, official meetings, the scenic views from the foreign service hostels and last but not the least, officers undergoing training in the Foreign Service Academy.",
  "retrievedAt": "2025-08-11T15:23:59.376Z"
}
