{
  "title": "Parliamentarians urge to forge unity to cope with current challenges",
  "link": "https://www.app.com.pk/national/parliamentarians-urge-to-forge-unity-to-cope-with-current-challenges/",
  "date_published": "2022-08-13T20:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): The lawmakers in the National Assembly on Saturday urged to forge unity to cope with current challenges and move forward for a bright future of Pakistan by reviewing the past mistakes.\nTaking part in debate in the National Assembly (NA), held in connection with the 75th anniversary of Pakistan, Defense Minister Khawaja Muhammad Asif felicitated Speaker Raja Pervaiz Ashraf for organizing a three-day Diamond Jubilee celebration of the first Constituent Assembly.\nHe said a series of conventions and events of diamond jubilee were participated by non-Muslim Pakistanis and people from all walks of life which were highly commendable.\nHe said today, we were celebrating 75 years of independence, however, we should ensure self-accountability to analyse what we had lost and achieved during the period.\nThe minister said the democratic governments and parliaments were dissolve in past due to undue intervention in their affairs adding obstacles were created in the working of Parliament which was supposed to play its actual role.\nHe said it was a good omen that there was consistency in the democratic process of the Parliament since 2008. “If we make comparison of the 75 years, there was despondency and division, despite that people are in love with Pakistan”, he added.\nHe said we were elected representatives of 220 million people and it was our mandate to lead the people, adding the way Pakistan Tehreek-e-Insaf had governed the country in the last four years, it had destroyed the political culture badly.\n“Politician should do politics with the support of masses and their votes,” he said, adding we should respect all the institutions as per Constitution.\nHe said a person who had no political status, used a language which was never used by any other political leader throughout the political history.\nKhawaja Asif said we should make promise to rise with the support of people instead of any other power.\nHe said Parliament was supreme and 1973 Constitution was sacred for all of us.\n“We should rely on the power of people,” he said adding this was our moral and constitutional obligation to respect the judiciary.\nHe said we should respect the valour and sacrifices of our armed forces as they were rendering their precious lives in the line of duty.\nHe said all the institutions should work within their constitutional domains.\nMinister for Water Resources Syed Khursheed Ahmed Shah congratulated the countrymen over completion of 75 years of independence of Pakistan.\nHe also lauded the Speaker Raja Pervez Ashraf for arranging magnificent Diamond Jubilee celebrations and hoped for the bright future of the country.\nHe also remembered the sacrifices of the people of Indian Illegally Occupied Jammu and Kashmir and said their efforts for right to self-determination would be successful one day.\nHe said we would have to ensure self-accountability to move forward and new generation would have to be told about the purpose behind the creation of Pakistan. Though Pakistan was facing severe economic and other challenges but Quaid’s Pakistan would get rid of all problems through unity, he added.\nPTI MNA Ahmed Hussain Dehar said Pakistan was full of resources and the nation had the ability to remain steadfast against the challenges and tackle them accordingly.\nHe said all institutions including Pakistan Army should be respected which had given great sacrifices for the country.\nMinister for Communication and Parliamentary Leader of MMA, Asad Mehmood said freedom was a great blessing and the entire nation was thankful to Allah Almighty to bestow us with it.\nHe said services of all including laborers, agriculturists, teachers, bureaucrats, armed forces and others should be acknowledged who were struggling for a great Pakistan.\nHe also supported the freedom struggle of the people of Indian Illegally Occupied Jammu and  Kashmir and said it would get success in near future.",
  "retrievedAt": "2025-08-11T15:24:09.367Z"
}
