{
  "title": "PM to break ground for industrial city, inaugurate shelter home in Faisalabad today",
  "link": "https://www.app.com.pk/national/pm-to-break-ground-for-industrial-city-inaugurate-shelter-home-in-faisalabad-today/",
  "date_published": "2020-01-03T01:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP):Prime Minister Imran Khan is scheduled to visit Faisalabad today(Friday) where he is expected to break ground for Allama Iqbal Industrial City and inaugurate a Panagah to accommodate down and out people.\nUnder China Pakistan Economic Corridor (CPEC) Industrial Cooperation Framework, nine Special Economic Zones have been planned. Out of these, three have been declared as Prioritized Special Economic Zones by the governments of Pakistan and China including Allama Iqbal Industrial City of Faisalabad, Rashakai SEZ in KPK and Dhabajee SEZ in Sindh.\nUnder CPEC industrial cooperation, the Government of Pakistan expects huge industrial relocation.\nStrategically located on Motorway M4 at Sahianwala Interchange, the Allama Iqbal Industrial City of Faisalabad is the first Prioritized Special Economic Zone in Pakistan. The first phase of the project would be completed by year 2021.\nKeeping in view the importance of CPEC, the Government of the Punjab has placed the project on high priority and is providing all the necessary support for its early completion.\nAllama Iqbal Industrial City will create 300,000 job opportunities for the people of Punjab in next five years and is in line with Prime Minister’s vision of creating 10 million Jobs.\nThe project will attract approximately Rs 400 billion investment in automobiles, value added textiles, engineering, pharmaceuticals, food processing, chemicals, construction materials, FGCG and packaging sectors. It will contribute to the GDP of Pakistan, increase the exports of the country and would also encourage the import substitution.\nM-3 Industrial City SEZ of Faisalabad Industrial Estate Developement & Management Company is the success story which has attracted foreign direct investments from China, Turkey, Korea, Europe and Japan. The project has the distinction of hosting maximum number of private sector Chinese companies in Pakistan and the number is increasing day by day due to its excellent infrastructure and professional management.\nMoreover, Deputy Commissioner of Faisalabad would also brief the prime minister on “Clean Faisalabad” campaign in the city.",
  "retrievedAt": "2025-08-11T18:34:05.672Z"
}
