{
  "title": "Consensus of major political parties on service extension issue, solely for national cause : Firdous Ashiq",
  "link": "https://www.app.com.pk/national/consensus-of-major-political-parties-on-service-extension-issue-solely-for-national-cause-firdous-ashiq/",
  "date_published": "2020-01-03T06:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 03 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Friday said mainstream political parties had extended support for legislation on service extension bill, solely for the national cause, sans any political consideration.\nTalking to media persons at the Parliament House, she said that the proposed amendment was aimed at removing technical lacuna in the Army Act to effectively handle service extension issues.\nShe said the world witnessed the entire nation standing behind the Armed Forces.\nShe termed the legislation an important step towards ensuring liaison among state institutions, which also reflected statesmanship of Prime Minister Imran Khan.\nLauding leadership of major political parties for support on the legislation, she said it was\nimperative for political forces to give priority to national interests at a time when there were tensions at international borders.\nShe said the Constitution laid the responsibility of country’s defense with the PM and added\nthat Parliament was going to further strengthen the democratic prime minister which would\neventually help strengthen the country and the state institutions.\nShe called upon the parliamentarians to ensure sanctity of vote and voter through substantive and concrete steps adding “Pakistan comes first” since it was the ultimate identity of every citizen.\nShe said that the political temperature in the country must bring down adding political differences were hallmark of politics.\nShe said national interest was paramount and added country’s development, prosperity and growth were directly linked to political stability which ultimately brings foreign investment, jobs and controls price hike in the country.\nShe said Prime Minister has reiterated his stance of bringing Pakistan back on the on the track, thus leading to national prosperity.\nResponding to a question, she said that Parliament through collective wisdom has to delineate future course of action as the proposed amendments in the NAB ordinance had also been laid in the House.\n“I am very hopeful that Maulana Faza-ur-Rehman will review his stance and will support the proposed amendment” she said.",
  "retrievedAt": "2025-08-11T18:34:02.492Z"
}
