{
  "title": "PMD alarms of heavy rain to generate flash flooding, trigger landslides",
  "link": "https://www.app.com.pk/national/pmd-alarms-of-heavy-rain-to-generate-flash-flooding-trigger-landslides/",
  "date_published": "2022-07-29T14:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): Pakistan Meteorological Department (PMD) has warned of heavy rains likely to generate urban flooding and trigger landslides in the vulnerable areas during the prevailing monsoonMonsoon currents were continuously penetrating in upper and lower parts of the country.\nWesterly waves were also penetrating western parts of the country.\nHeavy rains may generate urban flooding and flash flooding in local Nullahs of Islamabad, Rawalpindi, Lahore, Gujranwala, Sialkot, Kasur, Sahiwal, Mansehra, Abbottabad, Haripur, Dir, Swat, Peshawar, Mardan, Malakand, Bajaur, Lakki Marwat, Bannu, Tank, Khuzdar, Zhob, Barkhan, Kohlu, Musa Khel, Sherani, Sibbi and Bolan during the period. The rainfall may trigger landslides in Kashmir, Galiyat, Murree, Abbottabad, Mansehra, Chillas, Diamir, Gilgit, Hunza, Astore and Skardu during the forecast period.\nTravelers and tourists are advised to remain more cautious during the forecast period.\nOn Saturday, more rain-wind/thundershower is expected in Punjab, Islamabad, Khyber Pakhtunkhwa, north/eastern Balochistan, Kashmir and Gilgit-Baltistan.\nIsolated heavy falls are likely in Kashmir, upper Punjab, Islamabad, upper Khyber Pakhtunkhwa and north Balochistan.\nDuring the last 24 hours, rain-wind/thundershower (with isolated heavy falls) occurred in Punjab, Khyber Pakhtunkhwa, Kashmir, Balochistan, Sindh and Gilgit Baltistan.\nThe rainfall recorded during the period was Punjab: Lahore (Lakshmi Chowk 103mm, Paniwala Talab 83, Farrukhabad 75, Samanabad 70, Mughalpura 67, Chowk Nakhuda 56, Gulshan-e-Ravi, Upper Mall 50, Gulberg 42, City 39, Iqbal Town 37, Tajpura 20, Airport 05), Okara 79, Mangla 69, Attock 64, Jhelum 55, Bahawalnagar 51, Sahiwal 41, Murree 34, Rawalpindi (Chaklala 31, Shamsabad 23), Islamabad (Bokra 27, Zero Point, Golra 26, Saidpur 20, Airport 08), Noorpurthal 10, Bahawalpur (City 10, Airport 04), Mandi Bahauddin 08, Kot Addu 07, Chakwal, Layyah 05 , Khanewal 04, Joharabad 03, Sargodha 02, Narowal 01, Khyber Pakhtunkhwa: Mardan 94, Kakul 69, Balakot 64, Saidu sharif 38, Malam Jabba 29, Dir (Upper 08, Lower 07), Cherat 08, Bacha Khan Airport 04, Peshawar 03, Pattan 01, Balochistan: Kalat 42, Lasbela 33, Khuzdar 21, Zhob 07, Barkhan 02, Sibbi 01, Kashmir: Muzaffarabad (Airport, City 32), Rawalakot 24, Gari Dupatta 11, Kotli 04, Sindh: Karachi (Surjani 09, Orangi Town 03, University Road 01), Badin 02, Thatta 01 and Gilgit-Baltistan: 03 mm in Bagrote.\nThe highest maximum temperatures recorded were Nokkundi 41 C, Chillas, Drosh and Mirkhani 40 C.",
  "retrievedAt": "2025-08-11T15:18:40.928Z"
}
