{
  "title": "Pakistan asks Indian govt to refrain from victimizing Kashmiri leaders: FO Spokesperson",
  "link": "https://www.app.com.pk/national/pakistan-asks-indian-govt-to-refrain-from-victimizing-kashmiri-leaders-fo-spokesperson/",
  "date_published": "2022-07-29T18:27:00.000Z",
  "source": "APP",
  "content": "Addressing the weekly press conference here, the Foreign Office Spokesperson said India, the serial violator of human rights, would be well advised to introspect its inhumane siege of Indian Illegally Occupied Jammu and Kashmir (IIOJK) and its total failure to smother the flame of freedom and self-determination from the hearts of the Kashmiris despite employing draconian tactics, indiscriminate use of illegitimate force, unleashing a reign of terror, torture and human rights violations for the past 75 years.\nIndia’s futile attempts to obfuscate cold facts by making controversial, irresponsible, and untenable assertions stand fully exposed – it could mislead the world, he added.\nHe said Pakistan remains deeply concerned over the deteriorating health of Hurriyat leader, Muhammad Yasin Malik.\n“He continues to suffer for his legitimate political resistance to India’s illegal occupation of IIOJK. We reject this judicial persecution and demand his immediate release.”\nHe said the inhuman incarceration of Yasin Malik, his sham trials under fabricated cases, the fallacious conviction and the malfeasant attempts at tarnishing the legitimate struggle of the Kashmiris for their right to self-determination only further confirm India’s known credentials as a serial violator of human rights and usurper of fundamental freedoms of the Kashmiri people.\nHe said Pakistan once again urged the international community to take cognizance of India’s inhuman and illegal detention and treatment of Yasin Malik and of other political leaders, and to ensure that the Kashmiri people could exercise their right to self-determination as promised to them by the UN and the international community.\n“More than 1.5 billion people of this region deserve to see the dawn of peace and prosperity – something that has been held hostage to India’s hostile agenda, hegemonistic designs and systematic violations of human rights in IIOJK,” he added.\nHe said, “As we prepare to solemnly commemorate Youm-e-Istehsaal on 5 August marking three years of India’s unilateral and illegal actions in IIOJK and unabated human rights violations, we salute the indomitable spirit of the people of IIOJK. We honor their immense sacrifices. And we reaffirm our resolve to stand shoulder to shoulder with our Kashmiri brothers and sisters and extend unrelenting, all possible support until they realize their legitimate right to self-determination in accordance with the UNSC resolutions.”\n“Pakistan has also categorically rejected the baseless and misguided remarks made by the Indian Ministry of External Affairs Spokesperson in an effort to politicize the China-Pakistan Economic Corridor (CPEC). Attempts to cast aspersions over CPEC show India’s insecurity as well as the pursuit of a hegemonic agenda that has held back socio-economic development in South Asia for decades,” he added.\nThe Spokesperson said, “We reject India’s fallacious assertion that CPEC impinged on its sovereignty and territorial integrity. It is in fact India that is illegally occupying the State of Jammu & Kashmir for over seven decades while perpetrating gross and widespread human rights violations and effectuating blatant territorial and demographic changes in the occupied territory in complete contravention of international law and relevant UNSC resolutions.”",
  "retrievedAt": "2025-08-11T15:18:48.369Z"
}
