{
  "title": "Modi-led RSS further alienate Muslims, other minorities",
  "link": "https://www.app.com.pk/national/modi-led-rss-further-alienate-muslims-other-minorities/",
  "date_published": "2022-07-29T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): The modus operandi which has been applied by the Hindu zealot forces over the decades and presently the Modi-led RSS (Rashtriya Swayamsevak Sangh) in India is not only further alienating the Muslims but also the Dalits. Both the Muslims and the Dalits constitute almost 45 percent of the Indian population.\nTheir policy of suppressing the minorities is sophisticated under which they give priority to the Hindus, which automatically marginalizes the minorities – the Muslims, the Buddhists and even the Dalits.\nSheikh Alam, a Muslim leader of Mamta Banerjee’s Trinamool Congress Party, has recently been quoted by the Indian media as saying: “We (Muslims) are 30 percent and they (Hindus) are 70 percent. They will come to power with the support of the 70 percent, they should be ashamed. If our Muslim population moves to one side then we can create four new Pakistan. Where will 70 percent of the population go?”\nTalking to APP, former ambassador Asif Durrani said although the Indian constitution talked about the country’s secular nature, but for all practical purposes it was a Hindu state.\nHe said the Muslims constituted almost 15 percent of India’s population, however, their representation in businesses and bureaucracy was less than one percent and they were being further repressed. “So in this context, if the world thinks that India is a secular democratic state, but I think something is wrong.”\nThe international community, he added, needed to take note of the situation and put pressure on India to stop gross human rights violations and grant Kashmiris their right to self-determination in accordance with the United Nations Security Council resolutions.\nAccording to a census conducted by India in 2011, he said, out of total 12.5 million population in the Illegally Indian Occupied Jammu and Kashmir, 68.31 percent were Muslims and 28.43 percent Hindus.\nThe ambassador said the Kashmiris were almost besieged in their own territory as the Hindutva forces led by the RSS wanted to change the demography of the occupied state by converting the majority into minority and then express their readiness for a plebiscite.\nGeneral (retd) Tallat Masood told APP that the Narendra Modi regime was promoting the Hindutva ideology to further suppress the Muslims and other minorities.\nHe said Modi’s suppressive policy vis-a-vis Kashmir had further damaged the interests and future of the Kashmiri people. His doctrine was creating doubts as to whether Pakistan and India could come to any understanding on the very sensitive issue of Kashmir, In fact his policies were extremely detrimental for the people of Kashmir and also for Pakistan.\nAnalyst Ershad Mahmud said the Muslims were leading their lives on the margins in Modi’s India. “They are almost disempowered under his Bharatiya Janata Party’s (BJP) government as the entire state apparatus is being used to crush them. Some international experts believe that the genocide of Muslims is being carried out in India.”\nHe said Modi had adopted a two pronged approach to deal with domestic politics and the international community separately.\nAt home, Ershad observed, Modi preached communalism, building his political career on the anti-Muslim rhetoric and thriving on hate speech. “Facts speak louder than words. Out of 543 seats in the Lok Sabha, the BJP has 301 but not a single Muslim member belongs to the party.”\nWhile abroad, he tried to build his image of a moderate and peaceful statesman who worked for peaceful coexistence and regional connectivity, he added.\nHowever, Modi’s strategy had flopped as “such a duplicitous and double-faced political approach yields nothing and instead comes around”, he said.\nAccording to Dr Ejaz Hussain, secular Hindus as well as non-Hindu communities in India are being coerced, socio-politically and discursively, to either embrace Hindutva values or face exclusion of all sorts, i.e., de-citizenship.\nHe said as the Modi led government staunchly believed in making India a singular identity grounded in Hindutva, it had made the disputed territory of IIOJK a part of the Indian Union in August 2019.\nHe said both Kashmir and Ladakh were integrated with the Indian states to complete the pending agenda of Akhand Bharat (Unified India). Its geopolitical repercussions were manifested in terms of Indian military’s recent clash with its Chinese counterpart in Ladakh.\nDr Ejaz Hussain told APP that Pakistan-India relations also further deteriorated owing largely to Hindutva policies pursued by the Modi regime.\nThe RSS, he added, was busy in expanding its organizational and ideological apparatuses in south India also.\nHe said to counter the Hindutva ideology and re-project India as a secular country, the non-RSS-BJP groups and political parties would have to join ranks and put a united stance on all fronts. The international community also needed to question the wrongs committed by the Modi regime in the garb of RSS, he added.",
  "retrievedAt": "2025-08-11T15:18:56.037Z"
}
