{
  "title": "Pakistan Army relief efforts continue in flood-hit areas of country: ISPR",
  "link": "https://www.app.com.pk/national/pakistan-army-relief-efforts-continue-in-flood-hit-areas-of-country-ispr/",
  "date_published": "2022-07-29T13:12:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 29 (APP):Pakistan Army relief efforts continued in flood hit areas of various districts across the country alongwith Navy, Frontier Corps (FC) and Rangers troops constantly assisting the civil administration and local communities in all flood affected areas.\nAccording to the Inter Services Public Relations (ISPR) news release here received, it said in Balochistan, some 2,300 individuals of four villages were evacuated to safer places from Othal. The Army troops provided shelter and cooked meals to the affected population.\nThe N-25 highway connecting Quetta-Karachi was opened for traffic which was blocked at four different places due to collapse of bridges. Telecommunication was also restored in most of Balochistan particularly in Lasbela District in coordination with the Pakistan Telecommunication Authority (PTA).\nThe country, it said had received 467% additional unprecedented rains from July 1 till date during the prevailing monsoon season. Some 29 Districts of Balochistan were affected due to recent rains and flash floods particularly Lasbela, Kech, Quetta, Sibbi , Khuzdar and Kohlu. During the abnormal monsoon rains, 3,953 houses got damaged across the province. There were five medical camps established in flood hit areas of Balochistan including Hub, Gaddani, Bela and Duddar and Jhal Magsi.In Gwadar, Army dewatering teams had cleared Gawadar area whereas the costal highway blocked at Aghore was opened for traffic. In Jhal Magsi, four sorties of Army aviation helicopters operated delivering 1.3 tons of relief items including rations and medicines. Water level considerably receded after no rain was reported in the area. The connectivity of Gandhawa was resumed with Jhal Magsi, and efforts were underway to resume connectivity on other two roads whereas 200 individuals were evacuated.\nIn Khuzdar, water level was still high in Mula River whereas work on connectivity of M-8 would be resumed by NHA after water recedes. The General Officer Commanding at Khuzdar also visited Bela and surroundings to oversee relief efforts.\nIn Chaman, Babe Dosti was opened by dewatering teams as it remained closed due to inundation. In Lasbela, telecommunication was also resumed whereas relief operation by Army, FC and Pakistan Cost Guards was underway. However, all four locations on RCD opened for light traffic only.In Zhob, a mobile field medical camp was established by FC and Civil administration in Zhob where 1,570 patients were treated.\nIn Kila Saifullah, flash flooding occurred in the area. In Ziarat, Quetta -Ziarat Road was blocked near Kawas Tangi Station due to heavy flooding was opened. In Quetta, floods were reported in Hanna and Nawa Kili where rescue and relief teams were working on the site.In Sindh, 58 dewatering teams were employed for dewatering in Karachi only. Gharo Grid Station at Thatta which was flooded with water has been cleared by Army dewatering teams.\nSome 300 individuals were evacuated in Jamshoro and the Army also established relief camp at Jamshoro.M-9 was flooded at various places due to overflow of Lath Dam whereas dewatering teams along with heavy machinery were employed to clear the road whereas ration and medicine was being provided to local people at Dadu and Khairpur.\nIn Gilgit Baltistan (GB), Karakoram Highway (KKH) and Jaglot-Skardu road was kept open by the Frontier Works Organization (FWO) clearing multiple landslides.The Ghizer District was cut off due to flash flooding where communication infrastructure was opened whereas food and medicines were provided to local residents.\nIn Khyber Pakhtunkhwa (KP), Tank, Chitral and Swabi Districts were badly affected due to rains whereas the Chitral- Mastooj and Tank- Gomal Zam Dam Roads were opened for traffic.",
  "retrievedAt": "2025-08-11T15:18:41.551Z"
}
