{
  "title": "189 Pakistani students receive Fulbright scholarships for Master’s, Ph.D. degree in U.S",
  "link": "https://www.app.com.pk/national/189-pakistani-students-receive-fulbright-scholarships-for-masters-ph-d-degree-in-u-s/",
  "date_published": "2022-07-29T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): To promote educational and cultural exchange between the United States and Pakistan, the United States Educational Foundation in Pakistan (USEFP) has awarded the Fulbright Scholarship to 189 Pakistani students to pursue advanced studies and research at leading U.S. universities.\nAccording to the press note issued by U.S embassy in Islamabad on Friday, the awardees will start their higher education journey at 82 universities this fall in various disciplines, including environmental studies, energy management, and social sciences.\nPakistan has the largest Fulbright program in the world in terms of U.S. government contribution, with $18.44 million dollars this year to support 189 students.\nThis is a testament to the U.S commitment to our cooperation in Pakistan, now celebrating our 75th anniversary.\nThe Government of Pakistan, through the Higher Education Commission, also supports a significant number of PhD scholarships.\nThis year’s 189 students attended a two-day pre-departure orientation organized by the United States Educational Foundation in Pakistan (USEFP) in Islamabad to prepare for the journey, their exchange programs, life on university campuses, and American culture.\nThe U.S. Ambassador Donald Blome congratulated the grantees on their achievement.\n“Pakistani Fulbrighters have solved social problems, written new laws, advanced policies to ensure equal access and voices to all, and so much more.\nThey do this all for one purpose: to create a better, safer, and more prosperous Pakistan. In this goal, the United States and Pakistan are united,” Ambassador Blome said.\nHe further stressed that the United States invests in education because it strengthens the American relationship with Pakistan, builds stability in the region, and leads to shared economic prosperity.\nThe 2022 Fulbright cohort is one of the largest ever for Pakistan, with students from 47 public and private universities representing all regions of Pakistan.\nThis year, 125 Master’s and 64 PhD (31 Fulbright PhD and 33 Fulbright-HEC PhD) students and 7 Fulbright Foreign Language Teaching Assistant (FLTA) fellows were selected for these awards. Half of the grantees are women.\nThe scholarship covers travel, living stipends, health insurance, and tuition for the entire study period.\nSince the program began in Pakistan in 1951, 4,100 Pakistanis have received the Fulbright award to study, conduct research, exchange ideas, and contribute to finding solutions to shared international concerns.\nIn just the past two decades, 2,568 Pakistani’s have been awarded these scholarships.\nWhen they return, Fulbright students join a community of over 32,000 Pakistanis who have participated in a U.S. Government-sponsored exchange or English language program over the years.\n“The Fulbright Exchange Program represents a life-changing opportunity for its recipients, providing a top-tier academic experience and exceptional cultural and social enrichment,” noted USEFP Executive Director Rita Akhtar. “It is also a great contribution to both countries more broadly.\nAmericans benefit from the experience and insight of Pakistan’s brightest young scholars, and Pakistanis benefit from the contribution these Fulbrighters make when they return with all their new knowledge and experience.\nMore than 2,000 Fulbright alumni already returned and currently working in Pakistan are proof that Fulbright is a great investment in the future and a key component in building mutual understanding between the people of Pakistan and the people of the United States.”",
  "retrievedAt": "2025-08-11T15:18:55.846Z"
}
