{
  "title": "PM, Bill Gates discuss polio eradication in Pakistan",
  "link": "https://www.app.com.pk/national/pm-bill-gates-discuss-polio-eradication-in-pakistan/",
  "date_published": "2022-07-29T18:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 29 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday spoke on the telephone with Bill Gates, Co-Chair of the Bill & Melinda Gates Foundation (BMGF) and discussed the ongoing public health including polio eradication and social sector programs supported by BMGF in Pakistan.\nThe Prime Minister appreciated the valuable support extended by the BMGF to Pakistan in polio eradication and improving immunization, nutrition and financial inclusion in the country.\nHe also reaffirmed Pakistan’s desire to further strengthen the fruitful partnership with the Foundation in all the ongoing areas of cooperation.\nThe Prime Minister expressed grave concern on the recent increase in the number of confirmed cases of poliovirus in Pakistan in 2022 and stressed that his government remained committed to ending all forms of polio from the country.\nWhile noting that all cases of poliovirus confirmed so far this year belonged to the southern Khyber Pakhtunkhwa (KP), the Prime Minister highlighted that his government was actively implementing the special emergency response plan for south KP to scale up and improve the quality of the polio eradication program.\nHe conveyed to Mr. Gates that his government was also focused on strengthening operations at all levels of the program and empowering districts to make decisions based on the specific needs of their areas.\nThe Prime Minister also mentioned that providing safety and security to all members of the polio program, especially the frontline workers, would be his government’s high priority.\nBill Gates shared the concern and reiterated the Foundation’s continued support to Pakistan for ensuring that no child was at risk of paralysis due to poliovirus.\nThe Prime Minister and Bill Gates also exchanged views on BMGF’s support for various other government-led programs aimed at addressing malnutrition and stunting, essential immunization services, micropayment gateway RAAST, and digitization of the National Savings Program.",
  "retrievedAt": "2025-08-11T15:18:49.144Z"
}
