{
  "title": "Ground breaking ceremony for “Establishment of Pak-Korea Testing Laboratory” held",
  "link": "https://www.app.com.pk/national/ground-breaking-ceremony-for-establishment-of-pak-korea-testing-laboratory-held/",
  "date_published": "2022-07-29T11:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):The ground breaking ceremony of “Pak-Korea Testing Laboratory for PV-Modules and Allied Equipment” being established by the Pakistan Council of Renewable Energy technologies (PCRET) and Korea International Cooperation Agency (KOICA) was held at a local hotel on Friday.\nFederal Secretary for Science and Technology, Mr. Ghulam Muhammad Memon was chief guest on the occasion. While Ambassador of Republic of Korea, Mr. Sangpyo Suh and Director General PCRET, Dr. Syed Atta-ur-Rehman were also present on the occasion.\nSpeaking on the occasion, the federal secretary said that the bilateral cooperation between the two nations reflects that our all-weather strategic partnership is developing by leaps and bounds.\n“Over the last 40 years, our friendship has withstood the test of time and become good example of nation to nation relations”, he said.He appreciated the cooperation between Pakistan council of Renewable Energy Technologies (PCRET) and KOICA in the field of Solar Photovoltaic (PV) testing as per international standards.\nHe said that Pakistan being a sun belt country has great potential of solar photovoltaics, specially due to the fact that this wide spread country is a laterally developed country.\nThe rooftop mounted PV systems connected with the local grid through net metering can significantly alter the pi-charts of our power generation and consumption patterns.The power generated through solar photovoltaic offers the lowest cost of the power generation while the hydel source is highly capital intensive.\nThe federal secretary mentioned that the government announced a new alternative renewable energy (ARE) policy 2019 in October 2020.\nThe policy aims at creating a conducive environment supported by robust framework for sustainable growth of ARE sector in Pakistan.The government’s strategic objectives of energy security, affordability of electricity, availability for all, environmental protection, sustainable development, social equity and mitigation of climate change will further be harnessed under the ARE policy 2019, Ghulam Memon said.\nThe policy is target oriented and sets a target of achieving 20% on-grid capacity from ARE technologies by 2025 and 30% capacity by 2030. Establishment of this PAK-KOREA PV testing laboratory will play its significant role in introducing a quality control mechanism of solar panels in the country and will help to achieve our set targets in this sector in a more reliable and sustainable fashion.\nSpeaking on the occasion, Ambassador of Republic of Korea, Mr. Sangpyo Suh said that the impact of climate change is getting severe and now climate change becomes the biggest threat to human beings all over the country.\nConsidering the current situation, it is our prime responsibility to make every effort for CO2 mitigation and climate change adaptation as agreed in Paris Climate Agreement.In this respect, this project will contribute to implementing The Paris Agreement and is in accord with Pakistani government’s renewable energy policy initiative with the aim of generation 20% of its energy from renewable energy by 2030, the ambassador said.\nIt is pertinent to mention here that PCRET is establishing solar panel testing laboratory under the project titled “Establishment of PAK-KOREA Testing Laboratory for PV Modules and Allied Equipment”.\nThe solar panel testing laboratory is being established under a grant-aid project from Korea International Cooperation Agency (KOICA) amounting to 9.5 Million USD and local Public Sector Development Program (PSDP) share of Rs. 71.629 Million.\nThe testing laboratory is planned to achieve status of Certification Body Testing Laboratory (CBTL) in collaboration with Pakistan Standards and Quality Control Authority (PSQCA). The testing laboratory after its completion will be the first testing laboratory of the country having CBTL status.\nThe KOICA will construct the testing laboratory and provide, install and commission all the required equipment for the solar panel testing. The KOICA will also provide one year training to PCRET employees for smooth operation of the project during and after its completion. Obtaining of International certifications including IEC-61215 and IEC-61730 along with ISO-17025 will also be sponsored and facilitated by the Korean side.\nPCRET will provide all the local support required for execution of the project along with 8 kanals of space for the project at Plot no. 55, Street 7, Sector H-8/4, Islamabad. PCRET will also ensure involvement of its employees to seek training during the project and ensure its execution and operation after its completion.\nThe PSQCA has already initiated the process for adding solar panels in the list of its declared mandatory items. Therefore the PSQCA will ensure partial testing of sample from each import consignment of solar panels through the newly established CBTL. The CBTL will also offer its services to national and international private sector.\nEstablishment of the solar panel testing laboratory with CBTL status will go a long way in ensuring comprehensive and reliable quality control mechanism of solar panels in the country. The project is expected to be completed by December 2024.\nSpeaking on the occasion, the federal secretary assured his all out support for this project and thanked KOICA for extending support for this direly needed initiative.",
  "retrievedAt": "2025-08-11T15:18:43.463Z"
}
