{
  "title": "Bangulzai debunks propaganda over missing persons killing in Ziarat",
  "link": "https://www.app.com.pk/national/bangulzai-debunks-propaganda-over-missing-persons-killing-in-ziarat/",
  "date_published": "2022-07-29T15:10:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jul 29 (APP): Senior Leader of Pakistan People’s Party (PPP) Sardar Noor Ahmed Bangulzai on Friday debunked the propaganda over killing of the missing person Engineer Zaheer Ahmed in the Ziarat operation and claimed that the so-called killed was alive and the allegations of his relatives were false.\nBangulzai who is also the tribe chief addressed a media conference to reveal the facts on the propaganda made on the killing of missing persons under the garb of terrorists.\nHe said a drama was staged on the killing of missing persons after the Ziarat operation and self-interested elements held a sit-in on the Red Zone of Quetta in the name of missing persons.\nBangulzai added that the relatives of the missing persons were accusing the security forces of martyrdom of Zaheer Ahmed. He was alive and present with him during the press conference, he said.\nHe added that after the operation against the terrorists who killed Shaheed Lieutenant Colonel Laiq Baig Mirza and his cousin Umar Javed and organized malicious propaganda was started to malign the security forces.\nThe terrorists were projected as innocent citizens to divert attention from this heinous incident of terrorism. A misleading attempt was made to include Engineer Zaheer Ahmed in the fictitious list of missing persons, he underlined.\nThe drop scene of the killing of Engineer Zaheer Ahmed raised some questions on the narrative of missing persons.\nEngineer Zaheer, whose name was chanted in the protest camps organised by the BNM in Europe, turned out to be alive.\n“Zaheer Baloch’s family members buried the body without identification on whose request?” he queried while breaking the propaganda myth.\nIn the protest camps, Zaheer’s pictures were displayed and the women of his family were used to promote the fake narrative at whose behest? Are the families of missing persons willingly part of the terrorist campaign or BLA and Mama Qadir using them for their propaganda by threatening them? The tribal leader raised the questions during the press conference.\nOn the occasion, the alleged missing person Engineer Zaheer Ahmad confessed that he did not belong to any terrorist organization, adding, “On my death, my family members recited Fateha but I am alive and have reached my home safely”.\nAn FIR was also registered regarding the disappearance of Zaheer Ahmed.A group of terrorists abducted Shaheed Lieutenant Colonel Laiq Baig Mirza (serving in DHA Quetta) and his cousin Umer Javed while returning to Quetta near Warchoom, Ziarat, after having visited Quaid’s residency was shot dead while seven terrorists were also killed in a rescue operation.\nAmong the slain terrorists, Shahzad, a highly trained terrorist of Balochistan Liberation Army (BLA), was tasked of recruiting insurgents from hostels and colleges for the BLA, he said, adding, “He was the urban area commander of the BLA and an active supplier of weapons and explosives to the BLA terrorists.”",
  "retrievedAt": "2025-08-11T15:18:55.799Z"
}
