{
  "article_id": "2025-05-27_f9062cb0bfb58e2459086938a4c1ed68",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/29-children-immunized-on-first-vaccination-day/",
    "retrieved_at": "2025-08-27T15:56:23.029Z"
  },
  "metadata": {
    "title": "29% children immunized on first vaccination day",
    "author": null,
    "date_published": "2025-05-27T09:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 202,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 27 (APP):The second day of the third national polio immunization campaign of the year is underway across Pakistan, with encouraging progress reported from various regaions. According to the National Emergency Operations Centre (NEOC), as per official data, 29% of the target population of children under the age of five received polio drops on the first day of the campaign. Province-wise breakdown shows that 30% of children in Punjab, 24% in Sindh, 31% in Khyber Pakhtunkhwa, and 21% in Balochistan were vaccinated. In Islamabad, 24% of the targeted children were reached. Gilgit-Baltistan and Azad Jammu and Kashmir reported higher coverage, with 32% and 33% of children vaccinated respectively. The NEOC noted that the polio campaign is being carried out simultaneously in Pakistan and Afghanistan as part of a coordinated regional effort to eradicate the virus. The current campaign will continue uninterrupted until June 1, aiming to reach every eligible child. Health authorities have once again appealed to parents to cooperate fully with polio workers visiting homes. \"Polio virus remains present in our environment,\" a NEOC spokesperson warned, emphasizing that vaccinating children under five is a national responsibility. Parents have been urged to ensure their children receive polio drops during every campaign.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}