{
  "article_id": "2025-05-27_c695d11466612d43fd3832c4d8f3649e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ogra-rolls-out-e-licensing-system-to-facilitate-oil-gas-industry/",
    "retrieved_at": "2025-08-27T15:58:28.211Z"
  },
  "metadata": {
    "title": "OGRA rolls out E-licensing system to facilitate oil & gas industry",
    "author": null,
    "date_published": "2025-05-27T12:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 193,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 27 (APP): The Oil and Gas Regulatory Authority (OGRA) has launched a new e-licensing system aimed at modernising and streamlining the licensing process for Pakistan's oil and gas industry. This digital initiative marks a significant move towards improved regulatory efficiency and digital transformation in the energy sector. Developed in collaboration with the National IT Board (NITB), the new platform enables fully digitised licensing across all industry segments, including Gas, LNG, CNG, LPG, refineries, and oil. The initiative is designed to simplify and accelerate the process of obtaining or renewing licenses, offering enhanced transparency and efficiency for businesses operating in the midstream and downstream energy markets. \"This launch marks a significant milestone in our journey toward digital governance,\" said a spokesperson for OGRA. \"By cutting paperwork and enabling faster processing, we're not only improving convenience for applicants and investors, but also reinforcing confidence in Pakistan's regulatory framework.\" Accessible from anywhere, the new system allows users to submit applications online, track progress in real time, and benefit from a streamlined approval process. It aligns with national goals to enhance energy security, foster private sector participation, and attract greater investment into Pakistan's energy landscape.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}