{
  "article_id": "2025-05-27_46ced18bbabe78441c6d3a173c2448bc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ti-pic-organizes-workshop-for-public-information-officers/",
    "retrieved_at": "2025-08-27T15:57:13.417Z"
  },
  "metadata": {
    "title": "TI, PIC organizes workshop for public information officers",
    "author": null,
    "date_published": "2025-05-27T16:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 27 (APP): Transparency International Pakistan (TI Pakistan), in collaboration with the Pakistan Information Commission (PIC), organized a training workshop for Public Information Officers (PIOs) on the implementation of the Right of Access to Information Act, 2017. The workshop focused particularly on Section 5 - Proactive Disclosure, as part of ongoing efforts to enhance transparency, accountability, and access to information in Pakistan. The event brought together PIOs from various federal departments. Key speakers included Mr. Shoaib Ahmed Siddiqui, Chief Information Commissioner, Pakistan Information Commission; Mr. Kashif Ali, Executive Director, TI Pakistan; Mr. Awais Nawaz, Additional Secretary, Department of Information and Culture, Punjab; and other senior officials from the Punjab Information Commission and Government of Punjab. Addressing the participants, Mr. Shoaib Ahmed Siddiqui highlighted the role of PIOs in upholding citizens' constitutional right to information under Article 19-A. Mr. Kashif Ali emphasized the need for proactive disclosure as a tool for reducing information gaps and promoting good governance. Dr. Mehboob Qadir, former Chief Information Commissioner, Punjab, and Mr. Ijaz Hassan Awan, Information Commissioner, elaborated on legal provisions and key exemptions under the RTI Act, offering clarity on enforcement. Mr. Muhammad Malik Bhulla, Chief Information Commissioner, Punjab, shared the province's experience with RTI implementation and stressed the importance of building a culture of transparency. Participants actively engaged in interactive sessions, discussing practical challenges and sharing insights for effective implementation of the law. Muhammad Naeem Khan, Director, Legislation & Parliamentary Affairs, Government of Punjab, concluded the event by appreciating the efforts of all stakeholders in promoting transparency and strengthening democratic governance. He acknowledged TI Pakistan's role in organizing the training and advancing the right to information agenda.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}