{
  "article_id": "2025-05-27_77c2e9640c751befdd15da8a6e3437ce",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-judges-transfer-case-agp-conclude-arguments/",
    "retrieved_at": "2025-08-27T15:55:54.970Z"
  },
  "metadata": {
    "title": "IHC Judges’ Transfer Case: AGP conclude arguments",
    "author": null,
    "date_published": "2025-05-27T11:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 649,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, May 27 (APP): The Supreme Court's constitutional bench on Tuesday adjourned the hearing of the Islamabad High Court (IHC) judges' transfer and seniority case until May 29. During the proceedings, Attorney General Mansoor Usman Awan concluded his arguments pleading the court to dismiss the petitions challenging the judges' transfers and declare other related petitions as inadmissible. The five-member bench, headed by Justice Muhammad Ali Mazhar, heard the petitions filed against the transfer and seniority of judges at the IHC. Justice Mazhar observed that the counsels representing the petitioner judges had withheld certain key facts from the court, failing to mention details regarding their representations and the decisions made in response. The Attorney General argued that the transferred judges were not newly appointed and therefore did not require taking a fresh oath. He referenced previous Supreme Court judgments stating that seniority is determined from the date of appointment. Responding to a query from Justice Shakeel Ahmed, the Attorney General clarified that the explanation regarding the oath was issued by the Law Secretary to remove ambiguity in the notification issued after approval of the advice. The Attorney General maintained that the seniority of transferred judges was determined by then IHC Chief Justice Aamer Farooq, who exercised full discretion in the matter. No objections were raised by the chief justices or registrars of the four high courts regarding the transfer of judges. In response to further queries, the Attorney General stated that the transferred judges had requested their seniority to be determined based on whether they were required to take a fresh oath. He also emphasized that Article 200 of the Constitution clearly outlines the procedure for judicial transfers and grants this authority to the judiciary, not the executive. Justice Naeem Akhtar Afghan questioned the principle behind selecting Justice Sarfraz Dogar for transfer, noting that although he was 15th in seniority at the Lahore High Court, he became the most senior judge at the IHC after transfer. Justice Panhwar questioned whether the IHC chief justice was authorized to determine seniority of judges transferred from other high courts. The Attorney General responded that since the judges had already been transferred to the IHC, the chief justice of that court held the authority. Justice Panhwar noted that it still needed to be determined whether the transferred judges were to be considered part of the IHC or their original courts. Justice Shakeel Ahmed asked the Attorney General to assist the court on three critical questions: If the transfers were permanent, were they made under Article 175A of the Constitution? Who would evaluate the performance of additional judges transferred from the Balochistan High Court - the chief justice of BHC or IHC? And what impact did the transfers have on the IHC's administrative committee, considering seniority? The Attorney General argued that Article 175A, introduced through the 18th Amendment, did not repeal Article 200, thus judicial transfers under the latter remain valid. Justice Shakeel Ahmed remarked that Article 200 stipulates transfers must be in the public interest. The Attorney General said that temporary transfers entitled judges to additional allowances, while permanent transfers did not. Furthermore, no objections were raised by the judges regarding the nature of their transfers, and their consent was obtained. The bench directed submission of minutes from Judicial Commission of Pakistan (JCP) meetings held on January 17 and February 10. The Attorney General explained that the January meeting approved the appointment of two additional judges to the IHC, while the February meeting concerned the elevation of Justice Aamer Farooq to the Supreme Court. Justice Afghan asked whether Justice Dogar was included in the IHC list during the February meeting. The Attorney General confirmed his inclusion but said his name was not discussed. The court concluded proceedings for the day, with the constitutional bench adjourning the case until May 29. The petitioners' counsels are expected to present their rebuttal arguments at the next hearing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}