{
  "article_id": "2025-05-27_d3e4c492d25deb1207e01076acb6cff7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-panel-urges-timely-completion-of-ongoing-projects-by-fgeha/",
    "retrieved_at": "2025-08-27T15:56:55.818Z"
  },
  "metadata": {
    "title": "NA panel urges timely completion of ongoing projects by FGEHA",
    "author": null,
    "date_published": "2025-05-26T19:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 332,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 26 (APP):National Assembly Standing Committee on Housing and Works on Monday underscored the urgency of completing all ongoing projects under the FGEHA and emphasized the immediate development of all sectors to safeguard allottees' rights along with the swift completion of flats in sectors G-13 and G-14. Chaired by PML-N MNA Anjum Aqeel Khan, the second meeting of the Sub-Committee of the National Assembly Standing Committee on Housing and Works convened in the Committee Room of the Federal Government Employees Housing Authority (FGEHA). The meeting was breifed that FGEHA has reserved the plots against journalist quota, Once FGEHA receive the recommendation by Ministry of Information & Broadcasting (MOIB), the plots will be allotted to the journalists. The chairman of the sub-committee. Anjum Aqeel, stated that he is in contact with Ministry of Information and Broadcasting (MOIB), which has assured the issuance of the final list on June 15. To address the longstanding issues faced by allottees of sectors G-14/1 and G-15, Anjum Aqeel Khan announced the formation of joint committees consisting of affected residents and FGEHA officials, with findings and resolutions expected within 45 days. He further mentioned that a committee was being established to resolve issues in sectors F-14 and F-15. He directed the issuance of allotment letters to those selected through balloting and instructed to carry out additional balloting to ensure fair distribution. Addressing concerns over the acquisition of sectors F-12 and G-12, chairman called for a clear and transparent plan to uphold fairness. The meeting highlighted the urgency of accelerating housing projects to meet the growing demands of federal employees and resolve all the pending issues.Land acquisition, build up property and other issues pertaining to housing projects undertaken by FGEHA were also discussed. FGEHA's Additional Secretary Ashfaq Ghumman, Director Land, Director Cordination, Director Maintainance and other officials of the authority were present in the meeting. The Sub-Committee member Seema Mohi ud Jamili was also in attendance. The Sub-Committee ensured their full coperation in resolving all the discussed issues.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}