{
  "article_id": "2025-05-27_ce113efec23df1caf851e4968ebbb57b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/saudi-arabia-hosts-30-pakistanis-as-state-guests-for-hajj-2025/",
    "retrieved_at": "2025-08-27T15:57:43.093Z"
  },
  "metadata": {
    "title": "Saudi Arabia hosts 30 Pakistanis as state guests for Hajj 2025",
    "author": null,
    "date_published": "2025-05-27T14:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 405,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, May 27 (APP): The Kingdom of Saudi Arabia has extended a special gesture of religious solidarity by inviting 30 Pakistani citizens to perform Hajj this year as state guests under the Custodian of the Two Holy Mosques' Guests Program. In a formal ceremony held at the Royal Embassy of Saudi Arabia in Islamabad on Tuesday, Ambassador Nawaf bin Said Al-Malki handed over travel documents, visas, and Ahram to the selected pilgrims. The event was attended by the beneficiaries of the program and other dignitaries. The initiative is part of a broader royal directive issued by King Salman bin Abdulaziz Al Saud, which mandates hosting 1,300 male and female pilgrims from over 100 countries to perform Hajj during the Islamic year 1446 AH. The program is supervised by the Saudi Ministry of Islamic Affairs, Dawah and Guidance and is aimed at fostering global Islamic unity and extending Saudi Arabia's hospitality to Muslims around the world. Speaking to the media, Ambassador Al-Malki said the initiative reflects the Kingdom's longstanding commitment to serving Islam and deepening ties with Muslim nations. He noted that the program is conducted under the guidance of King Salman and Crown Prince and Prime Minister Mohammed bin Salman as part of Saudi Arabia's annual efforts to support deserving pilgrims from Pakistan and other Islamic nations. \"Every year, pilgrims from across the Islamic world are granted the opportunity to perform Hajj under this royal initiative, with comprehensive arrangements including travel, accommodation, and logistical support,\" Al-Malki stated. He added that all services are provided under the supervision of the Ministry of Islamic Affairs to ensure a smooth and spiritually fulfilling experience. Expressing their gratitude, the Pakistani pilgrims thanked the Saudi leadership for the generous gesture. Central Ruet-e-Hilal Committee Chairman, Maulana Syed Abdul Khabir Azad, lauded the Kingdom's continued support to the global Muslim community and acknowledged the personal efforts of Ambassador Al-Malki in strengthening the Pakistan-Saudi Arabia bilateral relationship. He also highlighted the Kingdom's inclusion of approximately 1,000 Palestinian pilgrims in this year's Hajj delegation, emphasizing Saudi Arabia's broader humanitarian and religious outreach. Since its inception in 1417 AH, the Custodian of the Two Holy Mosques' Guests Program has facilitated Hajj for nearly 65,000 pilgrims from 140 countries, offering them comprehensive religious, health, cultural, and logistical support from nomination to return. Ambassador Al-Malki reiterated that this initiative aligns with Saudi Arabia's Vision 2030, which aims to bolster the Kingdom's global Islamic leadership and humanitarian engagement.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}