{
  "article_id": "2025-05-27_00aa463089f6a1339d91d95bb950da24",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nbf-hosts-literary-event-adabi-rabtay/",
    "retrieved_at": "2025-08-27T15:56:44.455Z"
  },
  "metadata": {
    "title": "NBF hosts literary event âAdabi Rabtayâ",
    "author": null,
    "date_published": "2025-05-27T08:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 367,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 27 (APP):National Book Foundation (NBF), under the auspices of the Ministry of Federal Education and Professional Training (MoFE&PT), successfully hosted the third installment of literary event aAdabi Rabtaya at its esteemed Ahmed Faraz Auditorium. The event was graced by the presence of Muhammad Hameed Shahid, a distinguished intellectual, acclaimed fiction writer, and respected literary critic, as the chief guest. Guests of honor included celebrated poet, writer, humorist, and sketch writer Salman Basit, renowned poet Abdul Qadir Taban, prominent poetess, writer, and humorist from the younger generation Dr. Fakhira Noreen, and emerging writer Bushra Ayub Khan, said a press release issued here on Tuesday. The opening remarks were delivered by the Secretary NBF, Murad Ali Mohmand. Managing Director of the NBF, Dr. Kamran Jahangir, expressed gratitude to the chief guest, guests of honor, and the participants of the event. He also shared details about the NBFas current and upcoming projects. Abdul Qadir Taban recited two splendid ghazals and also presented his poetry in melody, receiving great appreciation and setting a captivating atmosphere in the gathering. Dr. Fakhira Noreen presented three poems that were highly praised for their significant themes. The second part of the program featured a wonderful musical session, where Salman Adil and Qamar Babar mesmerized the audience with their musical talent, which received the overwhelming response. The third session was dedicated to prose. On this occasion, Salman Basit presented an impressive and engaging sketch about the chief guest Muhammad Hameed Shahid, which was particularly enjoyed by both the guest of honor and the audience. Bushra Ayub Khan carried forward the tradition of letter writing after the sketch, and presented a beautiful prose piece in the form of a alettera that the audience listened to attentively and praised greatly. Chief guest Muhammad Hameed Shahid declared the event memorable and splendid. He offered thoughtful commentary on the creative works and literary expression of all the guests of honor. He praised the aAdabi Rabtaya program by the NBF as a very welcome initiative, stating, aSuch programs are essential for the promotion of literature and culture.a He applauded the NBFas efforts in this regard. Writers, poets, intellectuals, and literary enthusiasts from Islamabad and Rawalpindi attended the gracious event.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}