{
  "article_id": "2025-05-05_2f23e8858856ac5f11880680551ccd30",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-committed-to-regional-peace-but-any-aggression-to-be-responded-forcefully-tarar/",
    "retrieved_at": "2025-08-27T15:07:05.706Z"
  },
  "metadata": {
    "title": "Pakistan committed to regional peace, but any aggression to be responded forcefully: Tarar",
    "author": null,
    "date_published": "2025-05-05T04:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 324,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 05 (APP):Federal Minister for Information and Broadcasting Attaullah Tarar has said that Pakistan had once again made it clear to the world that it was committed to regional peace, however, any Indian aggression will be responded to promptly and forcefully. This he said while talking to international and local media representatives during a visit to the Line of Control on Sunday. The Ministry of Information and Broadcasting had facilitated the visit of local and international media representatives to the LoC. The purpose of the visit was to expose the false and baseless propaganda spread by India, and to expose Indian propaganda, ground facts were presented to the media representatives. The media representatives were taken to specific places that were declared by India as alleged terrorist hideouts in Azad Jammu and Kashmir. By observing the ground facts, the testimony of the local population, and the conditions themselves, the media got the opportunity to know the truth of these Indian claims. Speaking on the occasion, Attaullah Tarar said India had repeatedly made baseless allegations against Pakistan. \"Today we have put all the facts before the international and domestic media\", Attaullah Tarar maintained. The minister said that the places that India had been declaring as imaginary terrorist camps were actually areas of the general civilian population. \"Pakistan is a responsible state that not only committed to regional and even global peace,\" Attaullah Tarar said, adding Islamabad always condemns terrorism or terrorist activities in any part of the world. \"We have repeatedly proven through our actions that we are advocates of peace. We will go to any extent to defend our sovereignty,\" Attaullah Tarar stated. The minister said that India should take notice of human rights violations in occupied Kashmir before leveling baseless accusations against Pakistan. India propagates on the Line of Control to hide its internal failures, but today the international media representatives have seen the real truth with their own eyes, Attaullah Tarar said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}