{
  "article_id": "2025-05-05_d4713e40edf8b5ab5ced225c5a11996a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/security-forces-kill-8-khawarij-terrorists-in-multiple-engagements-in-kp/",
    "retrieved_at": "2025-08-27T15:06:56.064Z"
  },
  "metadata": {
    "title": "Security Forces kill 8 Khawarij terrorists in multiple engagements in KP",
    "author": null,
    "date_published": "2025-05-05T17:48:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 229,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, May 05 (APP): Security Forces killed eight Khawarij terrorists during multiple engagements in Khyber Pakhtunkhwa provinces while a brave son of soil Naik Mujahid Khan embraced martyrdom. \"An intelligence based operation (IBO) was conducted by the Security Forces in general area Mir Ali, North Waziristan District. During the conduct of operation, own troops effectively engaged the Khawarij location and resultantly, three Khwarij were sent to hell,\" said a news release issued by Inter Services Public Relations (ISPR) here Monday. \"In another IBO, conducted in South Waziristan District, two Khawarij were successfully neutralized by the security forces. However, during intense fire exchange, one brave son of soil, Naik Mujahid Khan (age: 40 years, resident of District Kohat) having fought gallantly, paid the ultimate sacrifice and embraced Shahadat,\" it further said. Two more engagements took place between own troops and Khawarij in Khyber and Bannu Districts, resulting in killing of three Khawarij. Weapons, ammunition and explosives were also recovered from the killed Khawarij, who remained actively involved in numerous terrorist activities in the area against the security forces as well as target killing of innocent civilians. \"Sanitization operations are being conducted to eliminate any other Kharji found in the area, as the security forces of Pakistan are determined to wipe out the menace of terrorism and such sacrifices of our brave soldiers further strengthen our resolve,\" the news release said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}