{
  "article_id": "2025-05-05_e47e50f08f8795f7ccd2e05937e4df97",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/interior-minister-mohsin-meets-qatari-counterpart-agrees-to-enhance-bilateral-cooperation/",
    "retrieved_at": "2025-08-27T15:06:14.228Z"
  },
  "metadata": {
    "title": "Interior Minister Mohsin meets Qatari counterpart, agrees to enhance bilateral cooperation",
    "author": null,
    "date_published": "2025-05-05T11:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 276,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 5 (APP):Federal Minister for Interior, Mohsin Naqvi, visited the Ministry of Interior in Qatar's capital, Doha on Monday where he held a significant meeting with Qatari Minister of Interior Sheikh Khalifa bin Hamad bin Khalifa Al Thani. The two sides discussed matters of mutual interest, bilateral relations, and ways to enhance cooperation in various fields. Minister Naqvi briefed his Qatari counterpart on the regional security situation, particularly the rising tensions between Pakistan and India. He conveyed Pakistan's principled stance, stating that the country has always rejected any policy of aggression and has offered an independent and impartial investigation into the Pulwama incident so that the world can see the facts and identify the real perpetrators. He emphasized that making baseless and illogical accusations against Pakistan is tantamount to ignoring the country's immense sacrifices in the fight against terrorism. Both sides stressed the need for joint efforts to combat organized crime networks and cybercrime. They also agreed on launching training exchange programs for officers from police and law enforcement agencies. Minister Naqvi reiterated Pakistan's desire to build strong and enduring relations with Qatar at all levels and said mutual cooperation in drug prevention would be further strengthened. Qatari Minister of Interior Sheikh Khalifa bin Hamad expressed Qatar's commitment to enhancing cooperation with Pakistan. Both countries agreed to appoint focal persons to expand collaboration across various sectors. The Qatari minister added that Qatar attaches great importance to its bilateral relationship with Pakistan. Also present on the occasion were Qatar's Minister of State for Interior Sheikh Abdulaziz bin Faisal bin Mohammed Al Thani, Pakistan's Ambassador to Qatar Muhammad Aamir, and senior officials of Qatar's Ministry of Interior.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}