{
  "article_id": "2025-05-05_a3a1f043ea69231e5396b5a62e557fec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-receives-telephone-call-from-the-un-secretary-general-discusses-security-situation-in-region/",
    "retrieved_at": "2025-08-27T15:07:09.544Z"
  },
  "metadata": {
    "title": "PM receives telephone call from the UN Secretary General, discusses security situation in region",
    "author": null,
    "date_published": "2025-05-05T16:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 177,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, May 5 (APP): United Nations Secretary-General Antonio Guterres Monday called Prime Minister Muhammad Shehbaz Sharif and discusses the prevailing security situation in South Asia. This was the second telephone conversation between the two leaders within a week, a press release issued by the PM House said. The prime minister appreciated the UN Secretary General's continued engagement and outreach efforts and welcomed his call for de-escalation as well as the need to avoid any confrontation. While reiterating his offer of an independent transparent, neutral and credible investigation, the prime minister expressed his concern that India was yet to provide any evidence, nevertheless it continued to resort to provocative rhetoric and war mongering. He reiterated Pakistan's determination to defend its sovereignty and territorial integrity. The prime minister expressed his serious concern at Indian attempts to politicise international financial institutions in an attempt to harm Pakistan's economic interests. The secretary general briefed the prime minister on his outreach efforts for peace and stability in the region, and expressed his commitment to remain engaged with all interlocutors on the issue.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}