{
  "article_id": "2025-05-05_6aaa1a8e6fd1d29fb4e35a8b503f0eec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-accelerated-action-against-tax-evasion-under-invoicing-amid-punitive-action-against-illicit-cigarette-trader/",
    "retrieved_at": "2025-08-27T15:05:55.108Z"
  },
  "metadata": {
    "title": "PM directs accelerated action against tax evasion, under-invoicing amid punitive action against illicit cigarette trader",
    "author": null,
    "date_published": "2025-05-05T12:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 293,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, May 05 (APP):Prime Minister Muhammad Shehbaz Sharif on Monday directed authorities concerned to accelerate actions against tax evasion, under-invoicing, and other irregularities across all sectors amid strict legal action against those involved in the sale and purchase of illegally manufactured cigarettes and other non-duty-paid goods. The directives were issued by the prime minister after a high-level meeting chaired by him to review matters regarding the Federal Board of Revenue (FBR), with a strong emphasis on removing obstacles in tax collection and reforming the taxation system, a Prime Minister's Office news release said. The prime minister said that proposed amendments in various clauses of the Income Tax Ordinance and Federal Excise Act were designed to eliminate hurdles in tax recovery, without affecting the rights of regular taxpayers and compliant businesses. \"These amendments aim to protect honest taxpayers and prevent unnecessary harassment of businesses and companies by FBR officials,\" the prime minister stated. He added that the reforms would simplify the tax payment process and help expand the tax net, ultimately reducing the burden on the common citizen. During the meeting, the prime minister was briefed on the steps taken to curb tax evasion in various sectors. The FBR is currently implementing digital monitoring systems, including Track and Trace, to enhance transparency and compliance. The briefing highlighted that measures are actively being taken against tax evasion in industries such as tobacco, cement, poultry, sugar, beverages, and others. FBR has successfully identified irregularities through video monitoring in several sectors. Furthermore, provinces have now been empowered to seize illicit tobacco products. The meeting also noted that a monitoring system for the poultry industry is being established under FBR supervision. Federal Ministers Azam Nazeer Tarar, Ahsan Iqbal, Muhammad Aurangzeb, Chairman FBR, and senior officials attended the session.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}