{
  "title": "Sehat Insaf Card flagship programme of PTI govt: Dr Firdous",
  "link": "https://www.app.com.pk/national/sehat-insaf-card-flagship-programme-of-pti-govt-dr-firdous/",
  "date_published": "2020-11-24T15:18:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 24 (APP): Special Assistant to Punjab Chief Minister on Information Dr Firdous Ashiq Awan on Tuesday said that Sehat Insaf Card was a flagship programme of Pakistan Tehreek-e-Insaf (PTI) government which was facilitating downtrodden and deserving people to avail healthcare facilities and treatment for chronic as well as major ailments free of cost.\nShe expressed these views in a ceremony organized for distribution of Sehat Insaf Cards at Rural Health Centre Jaman Shah in Layyah District, says handout issued here.\nDr Firdous Ashiq Awan said that thousands of deserving people were benefiting from the Sehat Insaf Card scheme across the province. She said that provision of standard health facilities, quality education and timely justice was the top priority of Prime Minister Imran Khan.\nShe said that the nomination of Usman Buzdar as the Punjab Chief Minister proved Prime Minister’s love for the people of South Punjab, adding that no one else could better understand and resolve the problems and issues of the region then Usman Buzdar, as he belonged to the people.\nThe SACM said that focus of the former rulers was limited to the development of some big cities due to their political interests and small towns were neglected which enhanced the sense of deprivation among people. She said that under the leadership of Prime Minister Imran Khan the journey of public service and development would continue.\nShe said the PTI government was making all-out efforts to fulfill all the promises made by PM Imran Khan. According to the vision of Prime Minister Imran Khan, every deserving family would get the Sehat Insaf Card without discrimination, she added.\nDr Firdous Asiq Awan said that around 50 per cent cards would be distributed among the people this year whereas 100 per cent cards would be distributed next year. She said that the Punjab Chief Minister recently initiated the Sehat Medicine Card program that would provide free of cost medicines to the patients of Hepatitis, TB and Aids.\nThe Special Assistant to CM also administered the oath to newly elected officials of Jaman Shah Press Club. She also directed the Special Assistant to CM on Auqaf and Religious Affairs Syed Rafaqat Ali Gillani and the Deputy Commissioner Layyah Azfar Zia to complete the work for the establishment of journalist colony in Layyah.\nLater talking to media, she said that the South Punjab Secretariat had been established to resolve the problems of people of these areas where government officials and vigilant political leadership would deliver to the masses at their doorsteps.\nShe said those who had left Pakistan to England in the garb of medical treatment were often found in shopping centers instead of hospital.\nResponding to a question, she said the Pakistan Democratic Movement should fight coronavirus instead of mud-slinging the government. “If life lasts, so does politics,” she suggested.\nLater, she also distributed Sehat Insaf Cards in Gojra Tehsil of TT Singh District.",
  "retrievedAt": "2025-08-11T20:03:02.683Z"
}
