{
  "title": "Dr. Sania Nishtar listed among 100 inspiring women",
  "link": "https://www.app.com.pk/national/dr-sania-nishtar-listed-among-100-inspiring-women/",
  "date_published": "2020-11-24T13:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar has been listed among the 100 most inspiring and influential women around the world by BBC.\nThe BBC has revealed the list of 100 inspiring and influential women from around the world for 2020 who are leading change and making a difference during these turbulent times.\nThis is an absolute honor for Pakistan that this year’s BBC list includes Dr. Sania Nishtar, who leads Ehsaas program along with Sanna Marin, who leads Finland’s all-female coalition government and Sarah Gilbert, who heads the Oxford University research into a coronavirus vaccine.\nThe list can be accessed here: https://www.bbc.com/news/world-55042935.\nThis distinction has been conferred upon Dr. Sania for her work and contribution in poverty alleviation, global health and development.\n“The dramatic impact of Covid-19 presents us with a once-in-a-generation chance to build a fairer world and bring an end to poverty, inequality and the climate crisis. For this, women must be equal, empowered stakeholders”, said Dr. Sania.\nDr. Sania Nishtar is a leader in global health and sustainable development. Since 2018, she has been spearheading the transformative Ehsaas Poverty Alleviation programme, which has improved the livelihoods of millions of Pakistanis.\nAs Special Assistant to the Prime Minister of Pakistan on Poverty Alleviation and Social Protection, Dr. Sania has helped empower the masses by taking the necessary first steps toward the development of a welfare state in Pakistan.\nAs part of the BBC’s policy, the BBC 100 Women team drew up a shortlist of candidates who had made the headlines or influenced important stories over the past 12 months, as well as those who had inspiring stories to tell, achieved something significant or influenced their societies in ways that wouldn’t necessarily make the news.\nThe pool of names was then assessed against this year’s theme – women who led change – and measured for regional representation and due impartiality, before the final names were chosen.",
  "retrievedAt": "2025-08-11T20:03:03.867Z"
}
