{
  "title": "Shelter homes- a leap forward towards a welfare state",
  "link": "https://www.app.com.pk/national/shelter-homes-a-leap-forward-towards-a-welfare-state/",
  "date_published": "2020-11-24T09:58:00.000Z",
  "source": "APP",
  "content": "By Syed Zahid Majeed\nISLAMABAD, Nov 24 (APP): Prime Minister Imran Khan’s initiative, to set up shelter homes for providing basic amenities of life to low income labours, who, otherwise, had to spend their nights at footpaths or in the open while braving the harsh weather conditions, is a giant step forward in establishing the state of Madina – a model of perfection where protecting the rights of vulnerable is government’s primary responsibility.\nIndeed, for the first time in history, a government is taking care of its people like this. Shelter homes serving million of non resident daily wage earners and their dependents with dignity by providing them residential and food services at par with the one-star hotels free of cost.\nThis project is one of the best steps taken by PTI considering it as responsibility, not a favour by ending all forms of exploitation as promised in the manifesto of ruling Pakistan Tehreek-e-Insaf (PTI). All and sundry should encourage these steps as it’s a hope for the poor that someone is there to facilitate them, someone to take care of them.\nA sum of Rs 49.5 million per annum has been allocated for each Panah Gah. The donations were also being accepted. Around 150 shelter homes were running across the country, which are being equipped with modern facilities.\nAccording to latest data, more than 144,609 destitute have benefited from the Panah Gahs, while 16,566 persons provided shelter, 128,048 provided meals in the Panah Gahs (Shelter homes) from September 1 to date.\nIn October some 67,046 people have benefited from Panah Gahs, meal was provided to 58,716, shelter provided to 8,330. In last 24 hours, total beneficiaries were 2,891, meals provided to 2,597 and shelter to 384 homeless persons. Panah Gah portrays PM’s philosophy of affection and care towards the unprivileged populace of the country.\nPTI government has launched flagship project of Shelter Homes in the country to provide roofs to 20 million homeless people from out of a total of 220 million population according to 2017 census.\nAccording to a document of Physical Education, Development & Peace (PDP) Foundation, there are 20 million people without housing across the country and majority of them is living in big cities.\nDuring his visit to the first remodeled Shelter Home (Panagah) in Tarlai area of the Federal Capital, Prime Minister Imran Khan said the civilized nations are recognized not by the luxurious lifestyle of the elite class rather through the living conditions of the poor.\nPrime minister also joined the beneficiaries over dinner.\nThe democratic performances are measured through welfare programs and the wellbeing of the poor.\nIn contrary, past government did not pay heed on providing accommodation and meal facilities to deserving population of the country.\nPML-N government squandered billion of rupees on white elephant projects included metro, orange line train, Laptop scheme and others.\nWhile the plight of the poor continued to deteriorate during their entire tenure.\nThe shelter homes are being run on build, run and handover basis in collaboration with charity organisations and private sector to sponsor under corporate social responsibility (CSR). Transparent and simple procedures have been devised for accepting donations.\nPakistan Bait-ul-Mal (PBM) has been tasked to remodel, rehabilitate the existing shelter homes and establish newones in phases to provide valued temporary/overnight stay with two time meals to the needy individuals seeking bed and breakfast in pursuit of employment.\nIn the first phase, the existing and new Panah Gahs in Islamabad Capital Territory (ICT) were being renovated.\nPBM has finalized a plan to set up five each shelter homes in Sindh and Balochistan, and eight each in Punjab and Khyber Pakhtunkhwa by January 31,2021.",
  "retrievedAt": "2025-08-11T20:03:06.597Z"
}
