{
  "title": "Pakistan, AJK artists to promote Kashmiri culture, heritage, says Shehryar Afridi",
  "link": "https://www.app.com.pk/national/pakistan-ajk-artists-to-promote-kashmiri-culture-heritage-says-shehryar-afridi/",
  "date_published": "2020-11-24T12:42:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 24 (APP): Chairman, Kashmir Committee, Shehryar Khan Afridi on Tuesday said artist communities of Pakistan and Azad Jammu and Kashmir (AJK) would work closely to help preserve and protect true cultural heritage of Kashmir.\nAddressing the participants of an informal meeting of Karachi-based members of the newly constituted Cultural Advisory Board of the committee here, Shehryar Afridi said Kashmiri culture was being destroyed by the Indian Occupational regime of Jammu and Kashmir but Pakistani artists from cinematic, television and literary spheres would work with the Kashmiri artists to foil Indian designs.\n“Modi regime is trying to harm the identity and pride of the Kashmiri nation. For this objective, the occupation forces are using tools of oppression including youth killings, torture, rape and Indian cultural invasion to help their design of Kashmiri genocide. We won’t let India do it,” he said.\nAfridi said the occupational regime in Indian Illegally Occupied Jammu and Kashmir was also trying to damage Kashmiri culture by massive demographic change through issuance of domicile to non-residents and also by opening wine shops and destroying mosques and shrines in Jammu and Kashmir.\nHe said that the Kashmir committee stands committed to preserve the Kashmiri culture and identity and all necessary steps would be taken to restore pride of Kashmiris.\nShehryar Khan Afridi said rather convening a meeting in Islamabad, he had decided to visit all the four provincial capitals and Muzaffarabad to meet the members of the advisory board in their home towns first.\n“Once we hold meetings in provincial and Azad Kashmir capitals, we will convene a mega event in the National Assembly to send a strong message to the occupational regime of India and the world that Pakistan and its artists stand by Kashmiris shoulder to shoulder.”\nHe said soon meetings of the advisory boards of Lahore, Islamabad, Peshawar, Quetta, Gilgit Baltistan and Azad Jammu and Kashmir chapters would be due to take\nplace next month.\nChaired by Shehryar Khan Afridi, the meeting was attended by accomplished names from the spheres of sports and media, including the likes of Squash legend Jahangir Khan,\nActors Humayon Saeed, Fahad Mustafa, Adnan Siddiqui, Bilal Ashraf, Ali Rahman Khan, Sarwat Gillani and Dr. Fahad Mirza, singer Shehzad Roy and a host of other well known faces.",
  "retrievedAt": "2025-08-11T20:03:05.766Z"
}
