{
  "title": "No tolerance for crimes against children, women in civilized society: PM",
  "link": "https://www.app.com.pk/national/no-tolerance-for-crimes-against-children-women-in-civilized-society-pm/",
  "date_published": "2020-11-24T15:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): The prime minister was chairing a meeting of the Federal Cabinet which considered a number of important agenda items, PM Office Media Wing in a press release said.\nThe cabinet, in principle, approved Anti-Rape (Investigation and Trial) Ordinance 2020 and Pakistan Penal Code (Amended) Ordinance 2020.\nMinister of Law and Justice Faroogh Nasim apprised the meeting about the relevant laws regarding appointment of members of parliament in the board of directors of government entities. The cabinet decided to seek guidance from the Supreme Court of Pakistan in that regard.\nFor the promotion of technology, the cabinet in principle approved establishment of Special Technology Zones Authority. Initially, the zones would be established in Peshawar, Islamabad, Lahore and Haripur. The cabinet also approved such zones for Karachi and Quetta.\nThe prime minister observed that Pakistan enjoyed huge potential in information technology (IT), which should be utilized.\nHe said the IT was a step towards progress in the modern times and directed for setting up 50 technological zones throughout the country.\nThe cabinet also ratified the decisions taken during meetings of the Cabinet Committee on Institutional Reforms held on October 29 and November 12 respectively.\nA progress report with regard to the vacancies of chief executive officers (CEOs) and managing directors in different government institutions was also submitted. The prime minister directed earlier completion of the process.\nThe cabinet also approved appointment of director general of National Archives under Clause 3(2) of the National Archives Act.\nThe Economic Affairs Division apprised the cabinet that G-20 countries had deferred payments on loans worth 1.7 to 2 billion dollars given to the country during the period from May to December this year. The decision to defer payment of these loans and facility was taken in view of the coronavirus pandemic, which would remain effective till June 2021.\nThe cabinet granted its approval to the Secretary Economic Affairs Division for signing of agreements over rescheduling of these loans with 16 countries of G-20.\nThe cabinet also granted approval to the Ministry of Commerce to issue a no-objection certificate (NOC) for payments to different international channels with respect to sports transmission on the Pakistan Television.\nIt also directed the Ministry of Information and Broadcasting to run effective campaign for public awareness about the coronavirus pandemic in accordance with the direction of Lahore High Court on a petition.\nThe cabinet approved appointments of managing director and board of governors of National Book Foundation.\nIt also accorded its approval for referring of the amendments issue of Civil Aviation Rules 1991 to the Cabinet Committee on law.\nThe cabinet ratified decisions taken by its Economic Coordination Committee during its meeting on November 16 and those of the Cabinet Committee on Energy during its meeting on November 19.\nMinister for planning Asad Umar briefed the meeting about the important economic indicators.",
  "retrievedAt": "2025-08-11T20:03:02.704Z"
}
