{
  "article_id": "2025-03-20_420f0ed46d702bd9027a1f805913c252",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/establishment-division-implements-major-reforms-to-enhance-civil-service-efficiency/",
    "retrieved_at": "2025-08-27T13:53:10.765Z"
  },
  "metadata": {
    "title": "Establishment Division implements major reforms to enhance civil service efficiency",
    "author": null,
    "date_published": "2025-03-20T09:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 548,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 20 (APP):Establishment Division has made significant strides in modernising Pakistanas civil service through administrative, legislative, and policy reforms during past one year. According to the official data, the major accomplishments of the Establishment Division are the successful transition to the E-Office system for improved communication, the initiation of the Rightsizing process, and the amendment of Civil Servants Promotion Rules. Moreover, amendments to the Civil Servants Promotion Rules have improved the career progression framework, fostering merit-based advancements. To further enhance efficiency, the Division has developed an online Personnel Evaluation Reports (PER) module, streamlining the appraisal process for civil servants. The Federal Public Service Commission (FPSC) has also played a key role by conducting major examinations, including CSS 2023 and 2024, Special CSS Examination 2023, and MPT for CSS 2025, leading to a transparent and merit-driven recruitment process. Around 35 key appointments were made in federal government departments, and 16 meetings were held for performance evaluation and extension cases of MP Scale officers. Recruitment through FPSC resulted in the induction of officers into various services, including the PAS, PSP, and OMG. The division processed 150 legal cases, handled from different ministries, and addressed induction and probation matters for officers. It also managed parliamentary affairs and processed over 50 medical claims for officers and retirees. An amount of Rs.121.3 million has been expended for the rent of residential accommodation hired for officers/officials of the Establishment Division during the fiscal year 2023-24. These initiatives collectively contribute to a more efficient, transparent, and performance-driven civil service. Key impacts included enhanced reporting and documentation with streamlined Personnel Evaluation Reports (PERs), performance and productivity boost by aligning individual goals with organisational objectives and recognising top performers, an update to the Civil Servants Promotion Rules, 2019, improved career progression aligned with good governance principles, workforce optimisation, improved communication, and leadership development. strengthened internal coordination and decision-making. Notable developments included the introduction of posting guidelines for Pakistan Military Accounts Department personnel and amendments to the FBR staff selection and PA&AS officer policies, significant rule changes to the Occupational Group & Services Rules and the NSPP Ordinance, and a proposed amendment to the Civil Servants Act that aims to enhance transparency by requiring asset declarations for senior public officials and enhance international collaborations by signing MOUs with institutions in Vietnam, Egypt, Kuwait, South Korea, Malaysia, Hungary, and Ethiopia. The division also launched Special Professional Pay Scales (SPPS) to attract skilled professionals and revised criteria for MP Scale positions. New guidelines for draughting MP Scale TORs, reforms in the civil servant promotion process, and an incentive package for PAS/PSP officers in Balochistan further contribute to governance improvements. The Division has also actively engaged in public outreach, training, policy discussions, and digital facilitation. Key initiatives include the expansion of the Executive Development Institute (EDI) with a new branch in Islamabad, fostering policy dialogues, workshops, and internship programs under NSPP. The FPSC has improved candidate support through a Facilitation Centre and an interactive website. Moreover, the Pakistan Academy for Rural Development (PARD) offers vocational training for women and high-tech skill development for youth, including partnerships with NAVTTC. PARDas initiatives have trained hundreds of individuals in various fields, enhancing local employment opportunities. The 2024 Client Satisfaction Survey, conducted under ISO 9001:2015, showed strong appreciation for the Establishment Divisionas Training Wing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}