{
  "article_id": "2025-03-20_a6d995aadbe5a218f7b58536c695fe29",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pac-forms-3-sub-committees-raises-concerns-over-lapsed-grants-unauthorized-honorariums/",
    "retrieved_at": "2025-08-27T13:54:06.125Z"
  },
  "metadata": {
    "title": "PAC forms 3 Sub-Committees, raises concerns over lapsed grants & unauthorized honorariums",
    "author": null,
    "date_published": "2025-03-20T15:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 323,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 20 (APP):The Public Accounts Committee (PAC), under the chairmanship of Junaid Akbar Khan on Thursday has announced the formation of three new sub-committees during a recent meeting that also addressed pressing financial matters, including lapsed grants and unauthorized honorariums. According to the announcement, the first sub-committee will be convened by Tariq Fazal Chaudhry, with members Sanaullah Khan Masti Khel, Rana Qasim Noon, and Hina Rabbani Khar. The second sub-committee will be led by Syed Naveed Qamar, joined by Shibli Faraz, Shaza Fatima Khawaja, and Moeen Amir Pirzada. The third sub-committee will be headed by Malik Amir Dogar, with Shazia Marri, Riaz Fatyana, and Afnan Ullah Khan as members. During the session, the PAC expressed serious concerns over the lapse of Rs 58 billion in economic affairs grants. \"The situation is almost the same in every ministry,\" remarked Chairman Junaid Akbar, while questioning the Finance Division's handling of funds. The committee also scrutinized the disbursement of Rs 240 million in honorariums to Finance Division employees during the fiscal year 2022-23 without an approved policy. \"Preparing the budget is their fundamental duty - why are they getting honorariums?\" questioned Riaz Fatyana, calling the selective allocation of honorariums a violation of the Constitution. Additionally, the PAC reviewed an audit objection regarding losses caused by robbery and embezzlement at the Regional Directorate of National Savings Centers in Karachi, sparking light-hearted remarks from committee members. \"Also tell us the method to recover money from the robbers!\" quipped Chairman Junaid Akbar. In a significant move, the PAC requested a comprehensive report from NAB and FIA on the cases referred by the committee over the past five years. \"NAB and FIA should inform us how many cases the committee has referred in the past five years and what their current status is,\" demanded the Chairman. The meeting concluded with strong calls for accountability, stricter financial oversight, and the implementation of policies to prevent the misuse of public funds.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}