{
  "article_id": "2025-03-20_3c56b21c3ddb7fc6451cf4fd5c84cffb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pbm-hum-mashal-e-rah-foundation-host-iftaar-dinner-for-female-students-of-wec/",
    "retrieved_at": "2025-08-27T13:53:39.965Z"
  },
  "metadata": {
    "title": "PBM, Hum Mashal-e-Rah Foundation host Iftaar Dinner for female students of WEC",
    "author": null,
    "date_published": "2025-03-19T19:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 220,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 19 (APP):Pakistan Bait-ul-Mal (PBM) and Hum Mashal-e-Rah (HMR) Foundation jointly organized an Iftaar dinner for the female students of PBMas Women Empowerment Centre (WEC) in Islamabad. The event was graced by PBM Managing Director Senator Captain (Retd.) Shaheen Khalid Butt and HMR Foundation Chairperson Ms. Amnah Aftab, among other dignitaries. During his interaction with the students, Senator Captain Shaheen Khalid Butt encouraged them to pursue professional education and skill development with dedication. He assured them of full support in their journey toward self-reliance. aI believe that the country can be put on the path of development by making women strong and self-reliant. The federal government is committed to womenas emancipation by providing equal opportunities and a conducive environment for their progress,a he stated. Highlighting PBMas efforts for womenas empowerment, he shared that the organization operates 162 Women Empowerment Centers nationwide. So far, approximately 300,000 female students have successfully completed vocational training in fields such as beautician services, cooking, embroidery, stitching, dress designing, and computer skills. Ms. Amnah Aftab, Chairperson of HMR Foundation, emphasized her organizationas initiatives for the rehabilitation of underprivileged and vulnerable communities. She reaffirmed her commitment to collaborating with PBM for the welfare of societyas marginalized sections. The event served as a platform to reinforce the importance of womenas empowerment through skill development and social support.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}