{
  "article_id": "2025-03-20_9dfbcbc9bcee0dd4bf450e3bff7c68c3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-saudi-arabia-vow-to-take-bilateral-partnership-to-new-heights-strengthen-defence-security-ties/",
    "retrieved_at": "2025-08-27T13:53:17.550Z"
  },
  "metadata": {
    "title": "Pakistan, Saudi Arabia vow to take bilateral partnership to new heights, strengthen defence, security ties",
    "author": null,
    "date_published": "2025-03-20T04:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 283,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "JEDDAH, Mar 20 (APP): Pakistan and Saudi Arabia on Thursday reaffirmed their commitment to take bilateral partnership to new heights and strengthening defense and security cooperation, recognizing the importance of collaborative efforts in addressing regional security challenges. The bilateral ties and cooperation were discussed in a bilateral meeting between Prime Minister Muhammad Shehbaz Sharif and Saudi Crown Prince and Prime Minister of the Kingdom of Saudi Arabia Mohammed bin Salman here. The prime minister, who is on a four-day visit to the Kingdom, was accompanied by the Deputy Prime Minister and Foreign Minister Senator Ishaq Dar, Chief of the Army Staff General Syed Asim Munir and Chief Minister of Punjab Maryam Nawaz. The meeting reaffirmed the strong and historic ties between Pakistan and Saudi Arabia, with discussions focused on enhancing cooperation in economic, trade, investment, energy and defense sectors. Both leaders expressed satisfaction with the growing economic collaboration between the two nations. The prime minister appreciated the Kingdom's commitment to increasing investments in key sectors, which would contribute to Pakistan's economic growth and stability. The two leaders held in-depth discussions on the evolving regional situation as well as geopolitical landscape and agreed to work closely at all levels for promoting their shared vision for peace, stability and prosperity in the region. The Saudi Crown Prince acknowledged the significant contributions of the Pakistani community in Saudi Arabia and agreed to enhance measures to facilitate their welfare. Both the leaders emphasized the need to further strengthen people-to-people ties, cultural exchanges, and educational collaboration. The prime minister and the crown prince reaffirmed their commitment to elevating Pakistan-Saudi Arabia partnership to new heights, guided by mutual respect, shared interests, and a common vision for progress and prosperity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}