{
  "title": "Iran envoy for optimum use of existing capacities, possibilities in economic sectors",
  "link": "https://www.app.com.pk/national/iran-envoy-for-optimum-use-of-existing-capacities-possibilities-in-economic-sectors/",
  "date_published": "2023-04-28T16:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP):Ambassador of the Islamic Republic of Iran Seyed Mohammad Ali Hosseini on Friday called for the optimum use of existing capacities and possibilities in different economic sectors including tourism, and mutual investment of Iran and Pakistan.\n“The capacities of the commonalities and links in the various areas of history, civilization, language, religion, geography, culture and so on should be availed for the betterment of the life of the people and for the development of the indigenous region which is a homeland to all of us and our next generations,” the envoy said while talking to journalists.\nThe envoy was of the view that journalists and media members can help in promoting ties, boosting cooperation, removing misunderstandings, lifting tensions and bridging the gaps.\n“We pay tribute to all the journalists that sacrificed their most loved life in engaging their careers to promote justice, truth and love around the world” he added.\nAbout Iran and Pakistan’s bilateral ties the ambassador said, Iran has strengthened its relations with the neighbouring, brotherly and friendly country of Pakistan in line with its policy of close relationship with its neighbours, and still now, this goal is being followed up nonstop and despite the obstacles.\nHe said, “During my mission in the neighboring and brotherly country of Pakistan, despite the illegal and unfair sanctions against my country, and despite the restrictions that the spread of pandemics imposed on all of us, we witnessed great progress and developments in the various aspects of our relations with Pakistan including political, economic, security and trade.”\nIn the political field, he said, high-level political exchanges and consultations and close cooperation in regional developments, kept a reasonable pace and continued appropriately.\nHe said with the great determination and efforts made by the authorities of the two countries trade volume had reached $2.2 billion between Iran and Pakistan.\nHe said that great progress has been made in other fields of cooperation including cultural, scientific, defence and security.\nHe expressed gratitude to the media for their dedication, support, cooperation and contributions to further strengthening the relations between the two brotherly countries of Iran and Pakistan.",
  "retrievedAt": "2025-08-11T08:23:36.001Z"
}
