{
  "title": "IHC seeks arguments in contempt plea against Imran Khan",
  "link": "https://www.app.com.pk/national/ihc-seeks-arguments-in-contempt-plea-against-imran-khan/",
  "date_published": "2023-04-28T13:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP):The Islamabad High Court (IHC) on Friday sought more arguments in a contempt of court petition against former prime minister Imran Khan.\nChief Justice Aamer Farooq heard the case filed by Assistant Commissioner ICT Abdullah.\nAt the outset of the hearing, Imran Khan’s lawyer Khwaja Haris argued that various cases were made against different people on the incident of the judicial complex. He said that a judicial case filed was also lost on the said day which was a serious matter.\nThe lawyer said that all cases against his client were under process in relevant forums, adding that it would affect the proceedings if the case was proceeded here.\nSpecial Prosecutor Rizwan Abbasi said that the court was also shifting to another place at the request of Imran Khan. He prayed the court to serve notices to Imran Khan on contempt of court case. He said that this court had ordered the PTI’s chairman that he would ensure the law and order situation and prayed the court to issue notice to Imran Khan for violating this order.\nThe chief justice remarked that there was an incident of the riot on the said day but it was a question that who was responsible for it. The prosecutor said that all people involved in vandalizing belong to the PTI and there were tweets that the workers were formally called.\nThe chief justice remarked that the people could arrive to support their leader but whether there was proof of incitement of the people for vandalizing. The court asked the prosecution to assist the bench after viewing the report of IGP, adding that a mod didn’t have a mindset.\nThe court sought more arguments on the petition and adjourned the hearing till next Friday.",
  "retrievedAt": "2025-08-11T08:23:42.489Z"
}
