{
  "title": "OGDCL partners with IHHN to provide health facilities across Pakistan",
  "link": "https://www.app.com.pk/national/ogdcl-partners-with-ihhn-to-provide-health-facilities-across-pakistan/",
  "date_published": "2023-04-28T12:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): The Oil and Gas Development Company Limited (OGDCL) on Friday partnered with the Indus Hospital and Health Network (IHHN) to provide quality health services at doorsteps in various districts across Pakistan.\nAccording to a press release, OGDCL signed the memorandum of understanding (MoU) with IHHN to enhance health services in local communities by establishing and operating upgraded health facilities in various forms.\nAs a socially responsible corporate, OGDCL has been serving communities by providing treatment and medicines through various health facilities. However, with the growing demand for enhanced health services at doorsteps, OGDCL has partnered with IHHN to cater for health facilities at identified OGDCL operational fields.\nUnder this partnership, IHHN will establish and operate health facilities, and OGDCL will sponsor the establishment and operational expenses of all the facilities. The Managing Director and CEO of OGDCL, on the occasion of the MOU signing, commended the efforts of IHHN and said, “OGDCL believes in equal opportunities for all, resulting in community well-being and transformation of their lives through quality services.”\nSpeaking at the MoU signing ceremony, the founding president of IHHN expressed his pleasure, saying that “we at IHHN are honored and delighted to partner with OGDCL for well-being of our communities through access to high-quality, free-of-cost healthcare.”\n“Access to healthcare continues to be a huge challenge in Pakistan, and OGDCL’s commitment to addressing this emergency is most admirable. I’m sure that this partnership will go on to benefit countless people across Pakistan,” he added.",
  "retrievedAt": "2025-08-11T08:23:46.001Z"
}
