{
  "title": "Imran Khan gets protective bail in mutiny case till May 3",
  "link": "https://www.app.com.pk/national/imran-khan-gets-protective-bail-in-mutiny-case-till-may-3/",
  "date_published": "2023-04-28T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP):The Islamabad High Court (IHC) on Friday granted protective bail to Pakistan Tehreek-e-Insaf Chairman Imran Khan till May 3, in a mutiny case registered at the Ramna Police Station, Islamabad.\nJustice Aamer Farooq, hearing the case, approved the bail against surety bonds of Rs100,000 and also instructed the petitioner to approach the relevant forum for confirmation of the bail.\nDuring the hearing, Imran Khan appeared in the court amid tight security. PTI leaders Fawad Chaudhry, Qasim Suri, Umar Ayub, Senator Saifullah Niazi and Sadaqat Abbasi, Advocate General Islamabad Jahangir Khan Jadoon and State Councilor Zohaib Gondal were also present.\nEarlier, the IHC Registrar Office had raised two objections over the petition pertaining the biometric verification and filing of the case directly in the high court. The PTI chief did the biometrics on reaching the high court.\nAt the outset, Imran Khan’s lawyers Barrister Salman Safdar and Faisal Chaudhry informed the court that the objection related to the biometric verification had been removed. The court also removed the second objection on the bail petition.\nWhile approving Imran Khan’s bail, the court asked his lawyers that they would have to approach the relevant court for the purpose.\nAdvocate General Islamabad Jahangir Jadoon said as the district courts were being shifted to a new place, where the petitioner would be provided fool-proof security.\nHe objected to the hearing of the bail application on the day it was filed. As soon as Imran Khan’s petition was filed it was fixed for hearing.\nThe impression that a powerful person used to get relief from the courts should end, he said, adding Imran Khan himself had been stating that the powerful should be brought under the law.\nHe asked whether a common citizen would also be treated like that. At this, the chief justice remarked that the court had given relief to two common citizens in the same way.\nJahangir Jadoon requested the court to also instruct Imran Khan to approach the trial court. Barrister Salman Safdar said that the process of shifting courts would be completed in the month of May.\nThe court instructed Imran Khan to join the investigation process into the case and adjourned the hearing till May 3.\nSalman Safdar said the Lahore High Court (LHC) on April 14 granted protective bail to Imran Khan in the instant case till April 26. Subsequently, Imran had approached the IHC requesting that the mutiny case against him be quashed.\nThe Ramna Police, in the first information report registered under sections 138, 500 and 505 of the Pakistan Penal Code (PPC), stated that Imran Khan, in a speech from Zaman Park, Lahore on March 19, levelled several allegations against a senior officer of the state institution, besides resorting to his “character assassination”.",
  "retrievedAt": "2025-08-11T08:23:41.219Z"
}
