{
  "title": "Govt sets target to enroll all 70,000 out of school children in capital by June 30: NA told",
  "link": "https://www.app.com.pk/national/govt-sets-target-to-enroll-all-70000-out-of-school-children-in-capital-by-june-30-na-told/",
  "date_published": "2023-04-28T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP):Minister for Federal Education and Professional Training Rana Tanveer Hussain on Friday informed the National Assembly that the government had set an ambitious target to bring all 70,000 out of school children in the Islamabad Capital Territory to zero by June 30.\nReplying to various supplementary questions during the Question Hour, the minister said currently, around 70,000 children were out of school in Islamabad and all-out efforts were being made to enroll them in schools by June 30.\nRana Tanveer said the government had also launched the Schools on Wheels initiative in Islamabad to provide education to the children of rural areas. For the purpose, buses were converted into mobile schools having state of the art facilities, including toilets.\nHe said on the directives of Prime Minister Shehbaz Sharif, the ministry was also planning to provide such mobile buses facility to the children of flood-affected areas of the Balochistan and Sindh. Even the World Bank (WB) had also appreciated the government’s initiative, besides assuring provision of 30 buses for the noble cause, he added.\nHe said the WB also intended to introduce such system in Africa. The ministry was ready to assist other provinces if the provincial governments provided buses, he said.\nHe said the government had also stared the tele school system, besides focusing on distance learning. It had also undertaken accelerated learning programme with the cooperation of the United Kingdom to enhance literacy rate in the country, he added.\nTo another question, he said 0.8 per cent increase was recorded in the literacy rate in last nine months.\nLater, the chair referred the matter to the standing committee concerned for detailed deliberations.",
  "retrievedAt": "2025-08-11T08:23:45.945Z"
}
