{
  "title": "President lauds professional excellence of armed forces",
  "author": null,
  "content": "ISLAMABAD, May 17 (APP): President Asif Ali Zardari Saturday lauded the exemplary conduct and professional excellence of the Pakistan Armed Forces in the successful execution of Marqa-e-Haq, acknowledging their resolute determination and unshakable courage in the face of unprovoked aggression.\nHe made the remarks during a visit to Gujranwala Cantonment.\nHe was accompanied by Federal Interior Minister Mohsin Raza Naqvi.\nUpon arrival, the President was received by Chief of Army Staff General Syed Asim Munir, NI (M). Commanders of Mangla and Gujranwala Corps were also present on the occasion.\nHe paid solemn tribute to the military and civilian martyrs who laid down their lives in defence of the motherland, affirming that their sacrifice remains a sacred trust and a source of enduring national pride. He underscored that the sons of the soil, fortified by the enduring spirit of the nation, stood with unwavering resolve to defend the motherland and thwarted hostile designs with exceptional valour and operational acumen.\nHe further remarked that history would bear witness to how, within a matter of hours, the Pakistan Armed Forces repelled aggression with unmatched precision and resolve, sending an unequivocal message of Pakistan’s strength, resilience, and national unity.\nDuring his interaction with officers and troops, the President commended their exemplary morale, combat readiness, and devotion to duty. He extended heartfelt congratulations on the successful culmination of Operation Bunyan-um-Marsoos, and expressed profound pride in the defenders of the nation, affirming that the people of Pakistan hold their brave soldiers in the highest esteem as the true custodians of national honour and sovereignty.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:34:35.152Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/president-lauds-professional-excellence-of-armed-forces/",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T13:58:00.000Z"
}
