{
  "title": "PM targets $125bn agri exports by 2030: Minister Rana Tanveer",
  "author": null,
  "content": "LAHORE, May 17 (APP):Federal Minister for National Food Security and Research Rana Tanveer Hussain said on Saturday that Prime Minister Shehbaz Sharif envisions a second green revolution to accelerate agricultural growth and boost agri-exports to $125 billion by 2030.\nPresiding over a consultative meeting at the Pakistan Agricultural Storage and Services Corporation (PASSCO) head office, he stated that the federal government was prioritising comprehensive reforms to transform agriculture, livestock, and fisheries sectors through 28 key initiatives aimed at enhancing value chains and earning substantial foreign exchange.\n“In line with the prime minister’s vision, six specialised working groups will focus on integrating technology and IT, strengthening research and farmer capacity, promoting mechanisation, financially empowering farmers, developing legal and regulatory frameworks, and driving overall agricultural growth,” he said.\nRana Tanveer lauded Punjab’s progress in the agriculture and livestock sectors, crediting the farmer-friendly reforms led by Chief Minister Maryam Nawaz Sharif. He said digital empowerment of farmers was a core objective to ensure they access essential services at their doorstep.\nPunjab Agriculture Minister Ashiq Hussain Kirmani shared that under the CM’s leadership, a Rs. 400 billion agricultural transformation plan is underway. He highlighted a focus on improving crop yields through advanced seed technologies and introducing high-tech machinery.\n“This year, four Agri Malls are being established, with the number to be increased to ten in the next fiscal year,” Kirmani said. He added that farmers were being provided access to modern machinery on rent at the tehsil level.\nTo enhance financial inclusion, the Punjab government has launched the Punjab Kisan Card, through which Rs. 55 billion in interest-free loans have already been disbursed. Additionally, 9,500 farmers have received subsidised green tractors — each with a Rs. 1 million subsidy — for the first time in the country’s history.\nTo improve agricultural extension services, Kirmani noted that 1,000 young agriculture graduates had been recruited to provide technical support to farmers. He announced that next year, mobile extension offices and labs would be set up in every union council to offer free soil and water testing along with expert advice.\nHe also shared that under the Punjab Clean Air Programme, the government is distributing 5,000 super seeders to help manage rice residue without burning.\nPunjab Chief Secretary Zahid Akhtar Zaman reaffirmed that the agriculture and livestock sectors are progressing due to the provincial government’s farmer-centric approach. He stressed the need for introducing advanced seed technologies to enhance cotton productivity.\nPunjab Agriculture Secretary Iftikhar Ali Sahoo highlighted a key challenge — high duties on agricultural machinery. “There’s a 25pc duty on local machinery and 35pc on imported equipment, which needs to be reduced to encourage mechanisation,” he noted.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:34:32.294Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-targets-125bn-agri-exports-by-2030-minister-rana-tanveer/",
  "dateList": "2025-05-17",
  "date_published": "2025-05-17T15:59:00.000Z"
}
