{
  "title": "Need to ensure suitable environment for working women: Law Minister",
  "link": "https://www.app.com.pk/national/need-to-ensure-suitable-environment-for-working-women-law-minister/",
  "date_published": "2023-03-13T13:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): Federal Minister Law and Justice Senator Azam Nazeer Tarar on Monday said that it was necessary to provide a proper work environment to women with zero tolerance for discrimination, fear and harassment.\nHe stated this while addressing the inaugural session of the National Women Police Conference organized by the United States Institute of Peace (USIP) and the Parliamentarians Commission for Human Rights (PCHR) under the theme of “Inspire, Empower, and Transform.”\nThe law minister said that policing for women or by women was a need of the hour, adding that nothing including law and religion stops women from playing an active and productive role in a profession of their choice.\nHe said that the legislation could give benefit only when the law was implemented in letter and spirit, adding that collective efforts were required for this purpose. The litigants were suffering due to the complexity of the law and jurisdiction issues, he said.\nAzam Nazeer said that society needed to bring changes in its attitudes towards gender issues to empower women. About 80% of women in the country needed cooperation and protection, he said.\nLaw Minister Azam Nazeer Tarar and Interior Minister Rana Sanaullah affirmed the commitment of the government to ensure that everyone in Pakistan had access to justice and that women are safe.\nThey emphasized the need for collaborative efforts between government agencies, civil society organizations and other stakeholders to promote gender equality and women empowerment in the country.\nDuring his remarks, US Ambassador to Islamabad Donald Blome emphasized the importance of women’s inclusion in policing and the need for innovative policies to ensure equal access to justice.\nHighlighting the role of women in policing and acknowledging the challenges they face in their line of work, Ambassador Blome also discussed the need for collaboration and partnership between various stakeholders to ensure women have equal opportunities and access to justice.\nExecutive Director of PCHR Shafique Chaudhry briefed the participants on the efforts towards improving gender inclusion and responsiveness in Pakistan police. USIP Country Director Imran Khan shared details about various activities under the U.S. Embassy-USIP Police Awam Sath Sath (PASS) program that USIP is carrying out in partnership with police departments and civil society organizations nationwide.\nThe National Women Police Conference 2023 is part of a broader effort to promote gender equality and women’s empowerment in Pakistan.\nSpeaking at the conference, Minister of Human Rights Riaz Hussain Pirzada, Federal Minister of Planning Ahsan Iqbal, Interior Minister Rana Sanaullah and Federal Minister of Climate Change Sherry Rehman also highlighted the importance of gender-responsive policing in Pakistan.\nThe conference concluded with a summary of recommendations and a way forward, followed by closing remarks from U.S. Embassy’s International Narcotics and Law Enforcement Director Lori Antolinez.",
  "retrievedAt": "2025-08-11T06:21:36.050Z"
}
