{
  "title": "Judge threatening case: Court issues arrest warrants against Imran Khan",
  "link": "https://www.app.com.pk/national/judge-threatening-case-court-issues-arrest-warrants-against-imran-khan/",
  "date_published": "2023-03-13T10:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP):A local court on Monday issued non-bailable arrest warrants of PTI’s chairman Imran Khan in woman judge threatening case and directed the police to produce him on March 29, after arresting.\nThe court also rejected the request of Imran Khan seeking again one-time exemption from the appearance.\nCivil Judge Rana Mujahid Raheem announced the verdict which had been earlier reserved. As the hearing commence, the judge said that he would issue the arrest warrants against Imran Khan if he didn’t appear the same day.\nAt the outset of hearing, the judge remarked that the court had summoned the accused to share the copies of the case documents and he had to appear in person to proceed the trial.\nImran Khan’s lawyer Intizar Panjutha argued that former prime minister had already faced an attack in Wazirabad and he was not completely fit to appear before the court. He said that security to his client had also been withdrawn and a petition had been moved to Lahore High Court in this regard.\nHe said that Imran Khan was not skipping the proceedings deliberately, adding there was threats to his life when he arrived Islamabad.\nThe lawyer prayed the court to grant one-time exemption from attendance to Imran Khan, adding he was not appearing due to certain reasons.\nSpecial Prosecutor Raja Rizwan Abbasi, on the occasion, opposed the exemption request of Imran Khan. During the hearing, Imran Khan’s lawyer also filed acquittal pea of his client.\nAfter hearing the arguments, the court reserved its judgment and later issued non-bailable arrest warrants against PTI’s head.\nIt may be mentioned that the Margalla Police Station had registered FIR against PTI’s chairman on giving threatening remarks about woman judge Zeba Chaudhry.",
  "retrievedAt": "2025-08-11T06:21:43.690Z"
}
