{
  "title": "Religious affairs minister vows to fight for tribal people’s rights",
  "link": "https://www.app.com.pk/national/religious-affairs-minister-vows-to-fight-for-tribal-peoples-rights/",
  "date_published": "2023-03-13T17:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor on Monday pledged to fight for the legal rights of tribal people at every forum.\nThe minister said this in a meeting with tribal elders including Mufti Muhammad Ijaz Shinwari, Haji Ahmed Saeed, Qari Jahad Shah Afridi, Maulana Abdul Malik Wazir Sultan, Pir Aqil Shah, Malik Ainuddin Shakir, and Malik Farhad Ali who called on him here in the ministry.\nAbdul Shakoor assured the tribal elders protesting for their rights before the National Press Club that he would present their case of legitimate rights before the judiciary, election commission, prime minister and army chief.\nHe said “I am from a tribal area and I will make all possible efforts to remove deprivations of erstwhile Federally Administered Tribal Areas (FATA) people.\nاسلام آباد: سابقہ فاٹا کے قبائلی عمائدین نے درست مردم شمار ی سے قبل الیکشن کو ظلم قرار دے دیا ؛ مزاحمت کا اعلان قبائلی عمائدین ، علاقہ مشران  اراکین جرگہ کا اسلام آباد پریس کلب کے باہر احتجاج اور وفاقی وزیر مفتی عبدالشکور سے ملاقات 1/3 pic.twitter.com/zWJRGiV3W3\n— Mufti Abdul Shakoor (@MuftishakoorJUI) March 13, 2023\nMeanwhile, tribal elders made it clear that they would not contest elections until a proper census to be held in their areas. They urged the government to restore the tribal constituencies and constitute new ones before the elections.\nThey complained that as a result of the merger, the FATA’s seats in Senate were abrogated while half of the seats were reduced in the National Assembly.\nفاٹا کے انضمام  اور دہشت گردی کے خلاف جنگ کے دوران قبائل تباہ حال ہو گئے،انضمام کے نتیجے میں فاٹا سے سینیٹ کی نشستیں ختم کی  گئیں، قومی اسمبلی سے تعداد نصف کی گئی، قبائل کے عوام درست مردم شماری  سے قبل الیکشن کروانے کی کوشش کو ناکام بنائیں گے :  جرگہ کا فیصلہ 3/3\nThey said the tribal people had rendered huge sacrifices in the war against terror, therefore, they should be provided maximum relief in every sphere of life.",
  "retrievedAt": "2025-08-11T06:21:26.011Z"
}
