{
  "title": "ECP establishes Online Scrutiny Cell to provide legal assistance to Punjab ROs",
  "link": "https://www.app.com.pk/national/ecp-establishes-online-scrutiny-cell-to-provide-legal-assistance-to-punjab-ros/",
  "date_published": "2023-03-13T11:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 13 (APP): The Election Commission of Pakistan (ECP) has established an online Scrutiny Cell to provide legal assistance and support to 297 Returning Officers (ROs) during the rigorous scrutiny of nomination papers of candidates vying for provincial assembly seats of Punjab.\nAccording to ECP spokesperson, the special software links several government agencies such as the National Database and Registration Authority (NADRA), Federal Board of Revenue (FBR), National Accountability Bureau (NAB), State Bank of Pakistan (SBP), and Federal Investigation Agency (FIA) with the Election Commission Secretariat. The Cell, tasked to work round the clock, was also equipped with fax, telephone, and internet facilities.\nThe necessary proforma and Standard Operating Procedure (SOPs) have been devised and provided to all the Returning Officers (ROs) to help them carry out their duties effectively.\nThis move by the ECP is aimed at ensuring free and fair elections in Pakistan and promoting transparency in the electoral process. With the help of advanced technology and the coordination of various government agencies, the ECP hopes to eliminate any possibility of electoral malpractice and uphold the integrity of the democratic process.\nThe returning officers were required to send candidate’s particulars to the online Scrutiny Cell daily.\nThis information will be scrutinized by special teams appointed by various government bodies including NADRA, FBR, SBP, and FIA. They have already appointed their focal persons to assist with the process.\nThe ECP has further assured that the information gathered through this scrutiny process will be immediately shared with the returning officers, in order to help them carry out immaculate scrutiny of the nomination papers.",
  "retrievedAt": "2025-08-11T06:21:40.536Z"
}
