{
  "article_id": "2025-01-14_34f77d2bcceb4a433e3207f303b7fba2",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885050",
    "retrieved_at": "2025-08-26T07:40:45.286Z"
  },
  "metadata": {
    "title": "Demolition of bunkers kicks off in Kurram - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T02:13:48.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 443,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KURRAM: Following a peace agreement between the warring sides in Kurram district, security forces and the district administration began demolishing bunkers in Lower Kurram using explosives, while the residents of Parachinar observed a shutter-down strike on Monday to protest the prolonged closure of roads. Kurram Deputy Commissioner Ashfaq Khan said that efforts were underway to demolish all bunkers in the region, adding that according to the 14-point Kohat peace agreement, all bunkers in the district would be demolished by February 1. In Lower Kurram, two bunkers have already been demolished - one each in Khar Kili and Balish Khel. Gunship helicopters continued to fly over the area as security forces and the district administration arrived in Lower Kurram early Monday morning to carry out the demolition operation. Tribal leader Jalal Bangash emphasised the importance of all parties implementing the peace agreement, urging the government to prioritise the first point of the agreement and take necessary measures to open and secure routes. Parachinar residents hold shutter-down strike over prolonged roadblocks Haji Saleem Khan, another tribal leader, said that sustainable peace is in the best interest of all parties, and that the public should cooperate with the elders and government to achieve this goal. The people of Parachinar, the headquarters of Kurram district, have been stranded for the last three months due to roadblocks and are demanding the immediate reopening and securing of the routes. The shortage of essential supplies led the residents to carry out the shutter-down strike. Leaders of the Kurram District Drug Association said medicine shops had run out of stock due to the roadblock. At a joint press conference in Parachinar, Pakistan Drug Association Parachinar president Haji Syed Hanif, chairman Moeen Hussain and Syed Iftikhar Hussain expressed concerns that the prolonged road closure had emptied their medical stores. They said children and other patients had died due to a lack of treatment, with the death toll surpassing 300. They highlighted the distressing situation, explaining that patients were repeatedly turned away without treatment, leading them to shut down their medical stores. Speaking at a joint press conference at the DHQ hospital in Parachinar, Young Doctors Association leaders Dr Zulfiqar Ali, Dr Sajjad, Dr Rafiq and others said that the lack of medicines and inability to transfer patients to Peshawar had caused immense suffering. Patients were dying in agony due to the closure of the routes, they said, adding that the situation was becoming increasingly unbearable. MPA Ali Hadi Irfani called for the immediate opening of the routes, noting that thousands of people had been trapped in the area for over 100 days due to the blockade. Published in Dawn, January 14th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}