{
  "article_id": "2025-01-14_16e7551e2646fab54d1d59428a1b2ffa",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885161/army-chief-cites-ttp-presence-cross-border-attacks-as-only-points-of-contention-with-afghanistan",
    "retrieved_at": "2025-08-26T07:40:40.292Z"
  },
  "metadata": {
    "title": "Army chief cites TTP presence, cross-border attacks as only points of contention with Afghanistan - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T14:09:27.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 645,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Chief of Army Staff (COAS) General Asim Munir has said that the only points of contention between Pakistan and Afghanistan are the presence of the banned militant Tehreek-i-Taliban Pakistan outfit in the latter and cross-border attacks. The remarks attributed to the army chief were carried by state broadcaster PTV News and were uttered during his Peshawar meeting a day ago with politicians from Khyber Pakhtunkhwa. Relations between Pakistan and Afghanistan have been strained due to frequent border skirmishes and Islamabad repeatedly demanding Kabul take action against the TTP for using Afghan soil to launch attacks in Pakistan. Kabul denies the allegations. Last month, at least eight people were killed and 13, including civilians, were injured on the Afghan side during clashes. The two sides were exchanging fire since Pakistani fighter jets bombed alleged TTP camps in Afghanistan's eastern Paktika province. One Frontier Corps soldier was martyred, while 11 others were injured in the clashes, which began after a failed bid by militants on the Afghan side to infiltrate Pakistan. Addressing the issue in his talks with politicians, the army chief said Afghanistan was a \"brotherly neighbour [and] an Islamic country\" with which Pakistan \"has always wanted\" better relations. \"The only difference with Afghanistan is the presence of Fitna al-Khawarij in Afghanistan and the spread of terrorism in Pakistan from across the border, and it will remain so until they remove this issue,\" the army chief was quoted as saying. In July, the government, through an official notification, designated the TTP as Fitna al Khawarij, while mandating all institutions to use the term khariji (outcast) when referring to the perpetrators of terrorist attacks on Pakistan. The army chief further said: \"Our policy is only Pakistan.\" COAS Munir said that no large-scale operation was being carried out in KP and nor was the TTP active in any area of Pakistan, adding that only targeted operations were carried out based on intelligence. The military chief said that everyone would have to stand together against terrorism without discrimination and prejudice as politics could only be conducted if there was a state. \"If there is no state, then there is nothing,\" he added. Gen Munir said the situation would improve if everyone worked together and cooperated. \"There is a special relationship between the people and the army. In this relationship, the false narrative of a gap is mainly driven by a specific agenda from abroad,\" the COAS was quoted as saying. He further said that the agreement of all parties on the National Action Plan (NAP) was encouraging but it had to be worked on quickly. The NAP is a 20-point plan created by the government in 2014 to combat terrorism and extremism. The plan was developed in collaboration with stakeholders and federal ministries The country's political leadership had asked the military brass to engage with Afghanistan to address Pakistan's internal security problems, he said. In the almost four-hour-long meeting with COAS Munir, representatives of several political parties expressed their concerns over the prevailing law and order situation in the province. Sources privy to the meeting said the political leadership wanted full implementation of the NAP while also suggesting a review of the plan to make certain changes if required. Speaking to Dawn, sources privy to the meeting disclosed that everyone \"suggested engagement with the interim Afghan government - formal or informal\". They said all the participants opined that cooperation between the neighbouring countries could facilitate bringing peace to the region. However, the army chief had pointed out that the Afghan interim rulers had failed to adhere to repeated warnings in the past. \"They don't listen to us,\" sources had quoted the army chief as telling those calling for formal or informal dialogue with the interim Afghan government. The political leaders had then suggested the military leadership use \"other ways for engagement\" with the Afghan interim government to resolve issues.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}