{
  "article_id": "2025-01-14_85bfefcc3d9b6dcc6fd16a68db5b406b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885172/sheikh-hasinas-niece-resigns-as-uk-anti-corruption-minister-over-ties-to-ex-pm",
    "retrieved_at": "2025-08-26T07:40:40.245Z"
  },
  "metadata": {
    "title": "Sheikh Hasina’s niece resigns as UK anti-corruption minister over ties to ex-PM - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T16:57:24.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/14215632fcb776e.jpg",
    "categories": [],
    "word_count": 380,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "The British minister responsible for financial services and fighting corruption resigned on Tuesday after weeks of questions over her financial ties to her aunt Sheikh Hasina, ousted last year as prime minister of Bangladesh. Tulip Siddiq, 42, had repeatedly denied any wrongdoing and Prime Minister Keir Starmer said last week he had full confidence in her. The resignation of a second government minister in two months is a blow to Starmer, whose approval ratings have plunged since his Labour Party won a general election in July. Siddiq was handed the portfolio for financial services policy after the election, a role that included responsibility for measures against money laundering. In a statement, Siddiq said although an investigation into her financial affairs found she had not breached the ministerial code of conduct, her position was \"likely to be a distraction from the work of the government\". \"I have therefore decided to resign from my ministerial position,\" she said. Starmer swiftly appointed Emma Reynolds, who was a pensions minister, to Siddiq's role. Hasina, who had ruled Bangladesh since 2009, is being investigated there on suspicion of corruption and money laundering. Hasina and her party deny wrongdoing. Siddiq was named in December as part of Bangladesh's investigation into whether her family were involved in siphoning off funds from Bangladeshi infrastructure projects. The anti-corruption commission alleged financial irregularities worth billions of dollars in the awarding of a $12.65 billion nuclear power contract, saying Hasina and Siddiq may have benefited. After facing further scrutiny over the use of properties in Britain linked to Hasina and her supporters, Siddiq referred herself to the government's independent ethics adviser. Siddiq lived in a north London property given to her family in 2009 by Moin Ghani, a Bangladeshi lawyer who has represented Hasina's government, documents filed with Companies House and the Land Registry show. She also acquired a separate property in London in 2004, without paying for it, from a developer linked to the Awami League, Hasina's political party, the Financial Times reported this month. Hasina fled Bangladesh after being toppled following weeks of protests. Siddiq's departure follows the resignation of British transport minister Louise Haigh late last year. Haigh acknowledged a minor criminal offence before she entered government, relating to a mobile phone that she had wrongly reported stolen.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}