{
  "article_id": "2025-01-14_3e667d5d5128fc7a27962a027a0cc928",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885128/may-9-riots-planners-masterminds-to-face-trial-in-military-court-defence-ministry-lawyer-informs-sc",
    "retrieved_at": "2025-08-26T07:40:42.612Z"
  },
  "metadata": {
    "title": "May 9 riots: Planners, masterminds to face trial in military court, defence ministry lawyer informs SC - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T09:16:28.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 1337,
    "reading_time_minutes": 7
  },
  "content": {
    "article_body": "The defence ministry's lawyer, Khawaja Haris, on Tuesday informed the Supreme Court's Constitutional Bench that the alleged masterminds and conspirators of the May 9 \"conspiracy\" would be tried in military courts. The bench, including Justices Aminuddin Khan, Naeem Akhtar Afghan, Jamal Khan Mandokhail, Muhammad Ali Mazhar, Hassan Azhar Rizvi, Musarrat Hilali, and Shahid Bilal Hassan, is hearing a case pertaining to the military trials - and recent sentencing - of civilians for their role in attacks on army installations during the riots that followed ex-premier Imran Khan's arrest on May 9, 2023. In recent hearings, SC judges have questioned why the accused were \"specifically\" tried in military courts instead of anti-terrorism courts, with Justice Mandokhail observing that \"the executive cannot play the role of judiciary\". A day ago, Justice Hilali wondered whether the Pakistan Army Act (PAA), 1952, outlined any punishment for officers who suspend the Constitution. During today's hearing, Advocate Haris, who appeared as the defence ministry's lawyer, in response to a question, said that trials of the conspirators and masterminds would also be held in the military courts. While continuing his arguments from yesterday, the defence ministry lawyer presented Sheikh Liaquat Hussain's case as an example of a civilian being tried in military court. Justice Rizvi asked whether an army officer was tried for their involvement in the events on May 9. \"How did the people reach the corps commander's house without any weapons,\" he asked, terming the intrusion a \"security failure\". In his response, the lawyer said that the charge on the people was for damaging property, adding that no military personnel was tried in the events that unfolded in 2023. However, Justice Mandokhail said that the court wanted to see the circumstances under which a civilian was tried in the Army Act, questioning its jurisdiction. \"The extent to which you are expanding the scope of the Army Act, [means] anyone can be tried under it,\" he said. At the outset of the hearing today, the defence counsel presented the example of Sheikh Liaquat Hussain's case as a civilian being tried under the military court. In response, Justice Mandokhail said that what needed to be ascertained was under what circumstance a civilian could be tried in the military court. \"The trial for stopping an army officer from doing their job by incitement will be carried out under the Army Act,\" Haris said, adding that the SC had ruled in the past that post-retirement, army personnel were to be considered civilians. Justice Mandokhail said that the defence's entire case was dependent on Brigadier F.B. Ali's case, in which a retired military officer was tried in a military court as a civilian. The defence counsel said that both, retired and serving army officials were tried in the case. \"Is anyone accused of inciting the army to not work in this case?\" Justice Manodkhail asked, adding that the action would only be considered criminal if an officer registered a complaint or took part in the events. \"Anyone who would disrupt the discipline of the army would go to the military courts,\" Haris said. In response, Justice Mandokhail asked if attacking an army convoy was also considered a \"disruption of discipline\". \"If a soldier has a dispute with a civilian at a checkpost, would this be considered as disruption?\" Justice Hilali asked. \"The extent to which you are expanding the scope of the Army Act, then anyone can be tried under it,\" Justice Mandokhail said. Justice Rizvi reminded the counsel that the F.B. Ali case was tried under martial law. \"Zulfikar Ali Bhutto was the civil martial law administrator at that time,\" Justice Rizvi said, adding that the case was filed in an attempt to remove the former premier. \"Martial law ended after the constitution was made,\" Justice Rizvi said. \"That is correct, however, the court order does not mention the imposition of emergency,\" Haris replied, adding that people who were tried in the F.B. Ali case were retired. \"If a soldier has a disagreement with a civilian in a cantonment area, where would the case go,\" Justice Hilali asked. To this, the defence lawyer said that \"disagreements\" were a different matter altogether. Justice Mandokhail said that the matter of military trials had been expanded beyond their scope. The counsel for the defence said that the trial of a civilian for interfering in military affairs even during peaceful times would be held in military courts. \"After all, there must be a mastermind who hatched the conspiracy?\" Justice Rizvi asked. In response, the counsel for the defence said that trial for the mastermind would also be held in military courts, adding that the law had been in place since 1967 and the matter of civilian trials in military court was not \"happening suddenly\". Justice Mandokhail noted, \"Associating [something] with an army officer and committing a crime against the army are separate things.\" \"If I use the word of association - that it is necessary to have an association,\" he added, asking whether the two were related to the crime that was committed. Haris replied that an association did not necessarily mean \"friends or family\", adding that this had also been discussed in detail in the F.B. Ali case. \"It is also related to discipline,\" he said. \"Association is with a person, not with a property,\" Justice Mandokhail retorted. \"If an ordinary citizen steals for his benefit, will they go to a military court or somewhere else?\" Justice Hilali asked. \"Catching a foreign spy also falls under the Official Secrets Act,\" Justice Mazhar highlighted. \"There were many protesters of May 9 who did not know what to do,\" Justice Hilali remarked. \"F.B. Ali was accused of conniving with some people within the institution,\" Justice Mandokhail replied, adding that it was necessary to prove a link to someone working from within the institution. \"Khawaja, I have an association with you,\" Justice Mandokhail said. \"Merely having this association will not constitute our collusion in any of your cases. \"It will be necessary to tell whether we were related in the crime that was committed,\" he remarked, adding this was an important point. \"If I go to a defence institution and steal a gun from there, the trial for it will also take place there [military court],\" Haris replied. \"In the gun theft, how will it be proven that the matter is internally related?\" Justice Mandokhail asked. \"Stealing the gun with which the soldier is supposed to fight battles would stop him from working,\" Haris said. \"Then tell me, where the gun theft FIR will be registered?\" Justice Mazhar asked. \"And many people were [going inside military installation] on May 9, it is being said that they did not know anything,\" Justice Hilali noted. \"All these people were not tried by a military court,\" Haris said, adding that he would present the details of the accused. \"Without discipline, the army cannot fight wars,\" he said, highlighting that \"obstruction in the duties of the army is also a violation of discipline\". Justice Mandokhail questioned the extent to which the Act could be expanded. \"ATA [Anti-Terrorism Act] is a stricter law than the Army Act,\" he said. \"In ATA, the punishments are stricter and there are no concessions.\" The hearing was then adjourned until tomorrow. On December 13, the constitutional bench conditionally allowed military courts to pronounce reserved verdicts of 85 civilians who were in custody for their alleged involvement in the May 9 riots in 2023. On Dec 21, military courts sentenced 25 civilians to prison terms ranging from two to 10 years for their involvement in the attacks. Days later, another 60 civilians were handed jail terms of a similar period over the matter. On January 2, the mercy petitions of 19 accused were accepted on humanitarian grounds, while 48 other pleas have been processed to Courts of Appeal. The sentencing of civilians by military courts was not only condemned by the PTI, but the United States, the United Kingdom and the European Union also raised concerns, saying the move contradicted international laws.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}