{
  "article_id": "2025-01-14_9fb464e4632f31121a78af88b371cfdd",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885045/sanjdi-mine-owners-booked-one-body-yet-to-be-found",
    "retrieved_at": "2025-08-26T07:41:14.723Z"
  },
  "metadata": {
    "title": "Sanjdi mine owners booked; one body yet to be found - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T02:13:48.000Z",
    "image_url": "https://i.dawn.com/medium/2025/01/67844b0ba686c.jpg",
    "categories": [],
    "word_count": 218,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA: The body of the last victim of the coal mine tragedy in Sanjdi was not recovered till Monday, four days after the accident. Police registered a case against the owners and the management on Monday on a complaint filed by Mines Inspector Abdul Rashid. The FIR named Sheikh Abdul Aziz and Hayat Khan as the accused. Twelve miners died after an explosion of methane gas in the mine on Jan 9. \"The miner whose body has not been recovered yet was working somewhere in the middle of the collapsed mine when it caved in,\" Ghani Baloch, the chief inspector of Mines, told Dawn. Rescue teams have been able to retrieve the bodies of 11 labourers from two different layers in the mine. CM's promise Balochistan Chief Minister Mir Sarfraz Bugti said on Monday that his government would take measures to protect workers in the mining sector. He told Dr Ibadullah, the Leader of the Opposition in the Khyber Pukhtunkhwah Assembly, the provincial government would give financial assistance to families of workers who lose their lives in accidents. \"We will also update safety measures in order to avert mining accidents.\" The chief minister said since mine workers were the backbone of Balochistan's economy, it was the government's duty to address their grievances. Published in Dawn, January 14th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}