{
  "article_id": "2025-01-14_b9739e0484e907f169563dc69fc87482",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885002/lahore-qalandars-get-mitchell-for-psl-10-williamson-warner-picked-by-karachi-kings",
    "retrieved_at": "2025-08-26T07:41:01.597Z"
  },
  "metadata": {
    "title": "Lahore Qalandars get Mitchell for PSL 10; Williamson, Warner picked by Karachi Kings - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T02:14:19.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/14095402e06b6ce.jpg",
    "categories": [],
    "word_count": 943,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "LAHORE: All six franchises of the HBL Pakistan Super League completed their respective squads for the 10th edition during the players' draft ceremony held here at the historical Hazuri Bagh, Lahore Fort on Monday. New Zealand's Daryl Mitchell became the first pick of the coming season when two-time winners Lahore Qalandars picked him to strengthen their batting order. Mitchell will make his PSL debut this year. New Zealand's batting maestro Kane Williamson was one of the prominent signings by Karachi Kings in the supplementary round one. Former Australian opener David Warner was picked by Kings as they made use of the second pick in the first Platinum round. Warner, with 12,727 T20 runs in 392 T20 matches under his belt, will also be among the PSL debutants. Peshawar Zalmi used the right to match option for English cricketer Tom Kohler-Cadmore, who was picked by Quetta Gladiators. Kohler-Cadmore has represented Zalmi in the last four PSL seasons. Gladiators then took New Zealand's Mark Chapman, who has played 81 T20 Internationals. New Zealand's Michael Bracewell and Matthew Short of Australia were the last two picks in the Platinum one round as they were gleaned by Multan Sultans and Islamabad United, respectively. In the Platinum round two, Quetta Gladiators and Karachi Kings had two picks each. Gladiators used their wild card pick option to snare all-rounder Faheem Ashraf. Aggressive Kiwi opener Finn Allen, 25, was the other player Quetta picked in this round. Karachi Kings strengthened their pace arsenal as they went for New Zealand pacer Adam Milne as their first pick of the Platinum two round and followed it up by using wild card on fast bowler Abbas Afridi. The Diamond round of picks saw Peshawar Zalmi, Islamabad United and Lahore Qalandars bag quality overseas talent in South African Corbin Bosch, Jason Holder of West Indies and Sri Lanka's Kusal Perera, respectively. Peshawar Zalmi topped up their pace stocks by picking Bangladesh's Nahid Rana in the Gold category round one. In the same category, Islamabad United picked Aussie fast bowler Ben Dwarshuis who will join compatriots Riley Meredith and Short on the United roster. In the Silver category round three Bangladesh spinner Rishad Hossain was roped in by Qalandars. In a first, Andries Gous of the United States made it to the PSL 2025. He will turn up for Islamabad United. Multan Sultans added Irish pacer Josh Little and West Indies' spinner Gudakesh Motie to their side during this round. In the supplementary round one, Kings' other overseas picks include Afghanistan's Mohammad Nabi, Warner and Bangladesh's Litton Das. West Indies' Johnson Charles, England's Tom Curran, Kusal Mendis of Sri Lanka and West Indies' pacer Alzarri Joseph were bagged by Sultans, Qalandars, Gladiators and Zalmi, respectively in supplementary round one. In round two, Sam Billings of England was snared by Qalandars who used the right to match card against defending champions Islamabad United, who later added South African batter Rassie van der Dussen to their squad. Quetta Gladiators made a strong pick in the Supplementary round two bagging Australia's Sean Abbott while Shai Hope of West Indies was taken by Sultans. Former Pakistan skipper and all-rounder Shoaib Malik, who is going to feature in his tenth consecutive PSL edition, was procured by Quetta Gladiators in the Supplementary round three. Among the two Emerging rounds of picks, notable selections were Hasan Nawaz (Gladiators) and Maaz Sadaqat (Zalmi). Spinner Saad Masood was taken by Islamabad United while Hunain Shah returned to the same franchise. Pacer Ubaid Shah was picked by Sultans. Final squads: ISLAMABAD UNITED: Matthew Short, Naseem Shah, Shadab Khan (all Platinum); Imad Wasim (mentor); Azam Khan, Jason Holder (both Diamond); Ben Dwarhuis, Salman Irshad, Salman Ali Agha (Brand Ambassador) and Haider Ali (all Gold); Andries Gous, Colin Munro, Muhammad Nawaz and Rumman Raees (all Silver); Hunain Shah, Saad Masood (both Emerging); Supplementary: Riley Meredith, Rassie van der Dussen MULTAN SULTANS: Michael Bracewell, Mohammad Rizwan, Usama Mir (all Platinum), David Willey (mentor), Iftikhar Ahmed (Brand Ambassador), Usman Khan (all Diamond); Chris Jordan, Kamran Ghulam and Mohammad Hasnain (all Gold); Akif Javed, Gudakesh Motie, Josh Little, Faisal Akram and Tayyab Tahir (all Silver); Ubaid Shah and Shahid Aziz (both Emerging); Supplementary: Johnson Charles, Mohammad Amir Barki, Shai Hope and Yasir Khan PESHAWAR ZALMI: Babar Azam, Saim Ayub, Tom Kohler-Cadmore (all Platinum); Corbin Bosch, Mohammad Ali and Mohammad Haris (all Diamond); Abdul Samad, Hussain Talat and Nahid Rana (all Gold); Arif Yaqoob, Najeebullah Zadran, Max Bryant, Mehran Mumtaz and Sufyan Moqim (Brand Ambassador) (all silver); Ali Raza, Maaz Sadaqat (both Emerging); Supplementary: Ahmed Daniyal, Alzarri Joseph. QUETTA GLADIATORS: Faheem Ashraf, Finn Allen, Mark Chapman (Platinum); Abrar Ahmed, Mohammad Amir (mentor), Rilee Rossouw (all Diamond); Akeal Hosein, Saud Shakeel (Brand Ambassador), Mohammad Wasim Jnr (all Gold); Haseebullah Khan, Khawaja Mohammad Nafay, Kyle Jamieson, Khurram Shahzad and Usman Tariq (all Silver); Mohammad Zeeshan, Hasan Nawaz (both Emerging); Supplementary: Danish Aziz, Kusal Mendis, Sean Abbott, Shoaib Malik KARACHI KINGS: Adam Milne, David Warner, Mohammad Abbas Afridi (all Platinum); Hasan Ali, James Vince, Khushdil Shah (all Diamond); Aamir Jamal, Muhammad Irfan Khan and Shan Masood (all Gold); Arafat Minhas (Brand Ambassador), Litton Das, Mir Hamza, Tim Seifert and Zahid Mehmood (all Silver); Fawad Ali, Riazullah (both Emerging); Supplementary: Kane Williamson, Mohammad Nabi, Omair Bin Yousuf, Mirza Mamoon LAHORE QALANDARS: Daryl Mitchell, Fakhar Zaman and Shaheen Shah Afridi (all Platinum); Haris Rauf (Brand Ambassador), Kusal Perera, Sikandar Raza (all Diamond); Abdullah Shafique, Jahandad Khan and Zaman Khan (all Gold); Asif Afridi, Asif Ali, David Wiese, Muhammad Akhlaq and Rishad Hossain (all Silver); Mohammad Azab, Momin Qamar (both Emerging); Supplementary: Mohammad Naeem, Sam Billings, Salman Ali Mirza, Tom Curran. Published in Dawn, January 14th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}