{
  "article_id": "2025-01-14_5b21969ab3688e44b221672bd725989d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1884984/cm-murad-appoints-12-more-special-assistants-eight-spokespersons",
    "retrieved_at": "2025-10-12T00:50:33.338Z"
  },
  "metadata": {
    "title": "CM Murad appoints 12 more special assistants, eight spokespersons - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T02:15:36.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "KARACHI: Chief Minister Syed Murad Ali Shah on Monday appointed 12 more special assistants, taking their number to 22. The new special assistants were Pir Fazal Shah Jeelani, Liaqat Askani, Tanzila Umme Habiba, Ameer Hamza Rais, Raza Haroon, Khair Muhammad Sheikh, Amanullah Mahsood, Kulsoom Chandio, Muhammad Ali Rashid, Muhammad Ali Bhutto, Hussain Aslam, and Veerji Kolhi. A CM House spokesman said that the newly inducted special assistants would be allocated portfolios shortly by the chief minister. He said that the provincial cabinet was not expanded as the special assistants were not cabinet members. On July 2, 2024, Lal Chand Ukrani, Sardar Faraz Rajar, Qasim Naveed Qamar, Waqar Mehdi, Rajveer Singh, Mansoor Shahani, Usman Hignoro, Abdul Jabbar Khan, Junaid Baloch, and Muhammad Saleem Baloch had been appointed as special assistants to the chief minister. Number of spokespersons reaches 16 Besides, the provincial government also named eight new spokespersons - Nadir Nabeel Gabol, Sukhdev Asardas, Buland Khan Junejo, Simita Afzal, Tahseen Abidi, Heer Soho, Aqraba Fatima, and Mustafa Abdullah. Now, there are 16 spokespersons for the provincial government as earlier Barrister Murtaza Wahab, Ghanwar Isran Ali, Sukkur Mayor Barrister Arsalan Islam Shaikh, Sarmad Palijo, Abdul Wahid Halepoto, Makhdoom Fakhar Zaman, Muhammad Ali Rashid and Sadia Javed were appointed as spokespersons. Published in Dawn, January 14th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}