{
  "article_id": "2025-01-14_e3019340443b123fac02d9cf8fc2e0b5",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885150/ptis-ejaz-chaudhry-absent-from-senate-despite-production-order",
    "retrieved_at": "2025-08-26T07:40:40.202Z"
  },
  "metadata": {
    "title": "PTI’s Ejaz Chaudhry absent from Senate despite production order - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T12:56:22.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/14173014c80bc05.jpg",
    "categories": [],
    "word_count": 632,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "PTI Senator Ejaz Chaudhry failed to appear in Tuesday's Senate session despite production orders issued by Chairman Yousaf Raza Gillani a day earlier. This was not the first production order issued for the senator, who is imprisoned at Lahore's Kot Lakhpat Jail. In March last year, he was due to be produced in the Senate but was unable to attend the session. In November of last year, Chaudhry was among 21 other PTI figures formally indicted by a Lahore Anti-Terrorism Court (ATC) in cases related to the countrywide riots on May 9, 2023, registered at the Racecourse and Sarwar Road police stations. \"We are greatly saddened as colleagues of a senator of this house who has been incarcerated for the last 1.5 years in a Lahore jail,\" Leader of the Opposition in the Senate Shibli Faraz said. Opposition lawmakers could be seen carrying placards with pictures of the missing senator during the senate proceedings. Faraz thanked the speaker for issuing the production order for Chaudhry, adding, \"Despite that, he is not among us because the government of Punjab does not want him to come here and talk.\" The PTI leader said that it was Chaudhry's legal, constitutional, and democratic right to attend the Senate session, terming the Punjab government's explanation of security issues obstructing his production in the Senate as \"regrettable\". He said that the house belonged to everyone, adding that \"our custodian's letter was not given importance.\" He called upon his fellow senators to \"stand as one\" to protest the \"lack of respect shown to the parliament.\" Law Minister Azam Nazeer Tarar acknowledged that the authorities were duty-bound to implement the production orders for Chaudry. Responding to Faraz on his remarks about Pakistan International Airlines' (PIA) privatisation process, Planning Minister Ahsan Iqbal said \"How do they have the audacity to talk about PIA ... they caused hundreds of billions in damages to it.\" Iqbal launched a scathing attack amidst intense opposition sloganeering, saying that the PTI government had gotten PIA banned from the UK and Europe. The planning minister also criticised Faraz's remark regarding PTI improving the economy during its government, pointing to the performance of economic indicators during the PTI government. \"China has invested $3 billion in foreign direct investment (FDI) ... who says FDI is not coming in?\" Iqbal also criticised PTI founder Imran Khan over the Al Qadir trust case. Meanwhile, PPP Senator Sherry Rehman and Deputy Prime Minister and Foreign Minister Ishaq Dar both slammed the design choice of PIA's Paris advertisement. Rehman said it had \"greatly\" hurt the national carrier's reputation. The advertisement in question showed a PIA plane flying directly towards the Eiffel Tower in Paris, with the ominous message, 'Paris. We are coming.' The senator added, \"It may be an innocent mistake but it has received a lot of backlash.\" FM Dar termed the incident a matter of \"stupidity\". Supporting Rehman's criticism, he said the prime minister had ordered an inquiry into who approved the ad. \"It's stupidity to show the Eiffel Tower and a plane close together, facing it. A better design would have shown the plane flying above or in a different direction,\" he said. The two also talked about the PIA privatisation process after Rehman asked if the effort was scrapped. Rehman also added, \"I wished that the opposition was also in the house today, who played a role in getting Pakistani pilots grounded.\" She said that PIA's services were not available in remote areas, adding that \"only 19 out of 34 planes are in the air and the rest are grounded\". Responding to Rehman's query, Dar said, \"PIA privatisation is being worked on rapidly,\" adding, \"It is better for Pakistan's corporate sector to take it up.\" Dar further said that the restoration of PIA's UK fights was being worked upon.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}