{
  "article_id": "2025-01-14_82605bbed63d6594c4ec17c6c947c08c",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885017/geopolitics-making-cybersecurity-challenges-more-complex-world-economic-forum",
    "retrieved_at": "2025-10-12T00:50:47.467Z"
  },
  "metadata": {
    "title": "Geopolitics making cybersecurity challenges more complex: World Economic Forum - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-14T02:13:57.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 407,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD: The global cybersecurity challenges have become more profound and complex due to geopolitical tensions, a new World Economic Forum (WEF) report says. 'Global Cybersecurity Outlook 2025' published on Monday said cybersecurity is entering an era of unprecedented complexity as geopolitical tensions are intensifying, new technologies are emerging at breakneck speed and threats are becoming more sophisticated. Nearly 60 per cent of organisations stated that geopolitical tensions have affected their cybersecurity strategy, as per the report. The geopolitical turmoil has also affected the perception of risks, with one in three CEOs citing cyber espionage and loss of sensitive information / intellectual property (IP) theft as their top concern. Around 45pc cyber leaders expressed concerns about the disruption of operations and business processes. \"The rapid adoption of emerging technologies is contributing to new vulnerabilities and new threats.\" The report called for a shift in perspective from cybersecurity to enhanced cyber resilience - the ability to mitigate the impact of significant cyber incidents on its goals and objectives. The WEF report underscored the importance of evaluating cyber risks from a socioeconomic perspective to effectively allocate resources and strengthen resilience against these threats. At the same time, expanding regulatory demands, vulnerabilities in interwoven supply chains and a widening cyber skills gap are compounding the challenges organisations face in staying secure, the report said. The reports added that 66pc of organisations expect artificial intelligence to have the most significant impact on cybersecurity in years to come and 37pc reported having processes in place to assess the security of AI tools before deployment. The growing complexity of cyberspace is \"exacerbating cyber inequity, widening the gap between large and small organisations, deepening the divide between developed and emerging economies\". Some 35pc of small organisations believe their cyber resilience is inadequate, a proportion that has increased sevenfold since 2022. This disparity in cyber resilience is further highlighted by regional differences in preparedness, the report said, adding that only 15pc of respondents in Europe and North America lack confidence in their country's ability to respond to major cyber incidents. In contrast, the proportion was 36pc in Africa and 42pc in Latin America. The public sector is disproportionately affected, with 38pc of respondents reporting insufficient resilience, compared to just 10 per cent of medium-to-large private sector organisations. This inequity extended to the cyber workforce, with 49pc of public-sector organisations indicating they lack the necessary talent to meet their cybersecurity goals. Published in Dawn, January 14th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}