{
  "title": "Korea to increase flood relief support for Pakistan: Ambassador Suh Sangpyo",
  "link": "https://www.app.com.pk/national/korea-to-increase-flood-relief-support-for-pakistan-ambassador-suh-sangpyo/",
  "date_published": "2022-10-06T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): Korean Ambassador Suh Sangpyo on Thursday said the Republic of Korea would increase it’s ongoing support for flood relief efforts in Pakistan and the Korean community based here would also share their contribution to support the flood victims.\nHe made these remarks at a one-day training workshop jointly organised by Ministry of Climate Change (MoCC) in collaboration with Korea International Cooperation Agency (KOICA) on enhancing SDG 6 Water Quality\nMonitoring in Pakistan.\nAmbassador Sangpyo said Pakistan was recently facing huge floods that had increased concentration on water monitoring whereas he also had witnessed the recent UN Flash Appeal podcast organised by Ministry of Foreign Affairs Pakistan.\n“Some $816 million have been pledged for the flood victims of Pakistan through the flash appeal which is five times more\nthan the amount asked in the previous flash appeal,” he added.\nThe Korean ambassador said there were various epidemics breakout in flood affected areas and the Korean government would provide assistance to address this issue.\nHe added the workshop was intended to improve water quality monitoring and ensure the implementation system on water quality management. Moreover, he said it would also help in exploring how efficiently KOICA could collaborate to improve water quality in Pakistan.\nSpeaking on the occasion, Secretary MoCC Asif Hyder Shah expressed gratitude to the Korean government for supporting the Ministry in handling critical project of water quality management.\nCommenting on the flood devastation, he said, the country was expecting this kind of disaster after 15 years but it had become a ground zero due to this tragedy as this was one of the biggest climate crisis ever faced by the country.\n“For Pakistan climate crisis is water crisis. We need to prepare resilience against both water scarcity and abundance. Our agriculture is highly dependent on Indus river and that is dependent on glaciers.”\nHowever, he regretted that the country despite accumulating so much water would become water scarce in the coming few years, whereas the problem of safe drinking water had  aggravated in the country.\nThe health issues and water borne diseases were the next challenge that the government was going to face, he added.\nThe workshop consisted of four sessions: Involving Introduction of Enhancing SDG 6 Water Quality Monitoring in Pakistan led by KOMIR, Perspective of Water Quality Monitoring in development agenda of Pakistan by MoCC, Water Policy in Korea led by K-Water and Climate Change and Water Resource Management in Pakistan led by MoCC.\nKorea International Cooperation Agency (KOICA) is a government aid agency of the Republic of Korea (ROK), founded in 1991. KOICA implements Korea’s grant and technical cooperation of the ROK, supporting the socio-economic development of many developing countries.\nIn 2010, KOICA opened its regional office in Islamabad, Pakistan. The office implements various projects in Transport, Energy, Water Management and Health, Rural Development.\nSimilarly, Capacity Building on Water Quality Monitoring and SDG 6 (6.1) Reporting Project was signed as agreement to extend cooperation on enhancing water quality monitoring and to improve capacity of the Government of Pakistan to achieve SDG 6 between Ministry of Climate Change (MoCC) and Korea International Cooperation Agency (KOICA) with a cost of $7.42 million from 2019 to 2024.",
  "retrievedAt": "2025-08-11T15:41:15.708Z"
}
