{
  "title": "Indonesia’s 77th Independence Day celebrated in Islamabad",
  "link": "https://www.app.com.pk/national/indonesias-77th-independence-day-celebrated-in-islamabad/",
  "date_published": "2022-10-06T10:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): The Embassy of Indonesia in Islamabad on Thursday celebrated the 77th Anniversary of its Independence Day.\nAddressing the ceremony, chief guest Federal Minister for Industries and Production Division Makhdoom Syed Murtaza Mehmood congratulated the Indonesian Ambassador on their Independence Day and underlined the strong bilateral and economic ties between both countries.\nThe minister also thanked the Indonesian government for providing relief assistance to flood victims of Pakistan. He also acknowledged the Indonesian government’s help in handling the palm oil crisis.\nTalking to the participants, Ambassador of Indonesia to Pakistan Adam Mulawarman Tugio said the 77th Anniversary of Independence is another milestone for Indonesia marked with significant political and economic achievements. Now, Indonesia is the world’s third largest democracy and a country where Islam and modernity coexist and deliver to bring economic progress, he expressed.\nHe added that the voices of developing countries and ensuring their participation in the development process were important parameters of Indonesia’s inclusive approach to the Indonesia’s Presidency in G-20.\nThe Ambassador also expressed his heartfelt condolences and sympathies to the victims of recent unprecedented flash floods in Pakistan. He added, “we believe that no nation alone can handle such a large-scale natural disaster, and it’s a shared responsibility of all to support people in distress. Indonesia stands with Pakistani brothers and sisters in this difficult time”.\nHe further stated that as a mark of solidarity, the Indonesian government dispatched humanitarian aid in-kind by two special aircrafts last month and a medical team with a US$1 million grant to support ongoing relief operation in Pakistan.\nRegarding bilateral relations, the Ambassador said since the establishment of diplomatic ties in 1947, Indonesia-Pakistan bilateral relations have continued to become stronger and more comprehensive.\nPakistan strategically holds great importance for Indonesia as a trusted friend and partner in South Asia. With the rapidly expanding national economy and the growing importance of ASEAN as a trade hub, Indonesia offers wonderful investment opportunities and collaboration to our friends from the business community in Pakistan.\nBoth sides are fully aware of the potential and benefits of cooperation and moving ahead by initiating various mechanisms, bilateral consultation forums, policy dialogue, trade promotion, and strengthening of people-to-people contacts to reap more fruits from productive engagement, the Ambassador concluded.",
  "retrievedAt": "2025-08-11T15:41:22.946Z"
}
