{
  "title": "PM seeks from rich polluting nations ‘climate justice, not begging bowl’ situation for Pakistan",
  "link": "https://www.app.com.pk/national/pm-seeks-from-rich-polluting-nations-climate-justice-not-begging-bowl-situation-for-pakistan/",
  "date_published": "2022-10-06T06:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP): Prime Minister Shehbaz Sharif has said that Pakistan should not be forced to go out with a “begging bowl” to rich polluting nations after the floods devastated the country, stressing that he would be seeking “climate justice” from the international community.\nIn the second part of his interview by the British daily The Guardian published Thursday, Sharif warned that Pakistan is facing an unprecedented crisis of health, food security and internal displacement after the “apocalyptic” monsoons put a third of Pakistan’s regions under water.\nWith Pakistan responsible for 0.8% of global carbon emissions, Sharif said it was the “responsibility of the developed countries, who caused these emissions, to stand by us”.\n“I’ve never seen this kind of devastation, inundation and suffering of our people in my lifetime,” he said.  “Millions have been displaced, they have become climate refugees within their own country.”\nWhile the international community has given billions in funds and donations and commitments for further support, Sharif was clear it was “not enough”.\n“The enormity of this climate-induced catastrophe is beyond our fiscal means,” he said. “The gap between our needs and what is available is too wide and it is widening by the day.”\nThe official death toll from the floods is 1,600, though many estimates on the ground have been higher. More than nine million people have been displaced and over two million homes destroyed, and millions of families have been forced to live in makeshift tents or shelters on roadsides.\nThe extent of the damage has been put at between $30bn and $35bn but Sharif said it was “a rough estimate, it could be more”, with more than 30,000 km of roads destroyed along with bridges, railways and power lines, as well as 4 million hectares (10m acres) of crops washed away.\n“Let me be clear, this is about climate justice,” said Sharif. “We are not blaming anybody, we’re not casting allegations, what we are we saying is this is not of our making but we have become a victim. Should I be asked to cast my appeal into a begging bowl? That is double jeopardy. That’s unjust, unfair.”\nPM Sharif expressed confidence that Pakistan would not get defaulted despite the upcoming billions of foreign debt repayments, and the billions more in flood damages. “No way. We will not default,” he said.\nSharif confirmed that the government would be talking to “everybody” about the possibility of foreign debt moratorium. “What we are asking for is fiscal space but not through the burden of more debt,” he said.\nPM Sharif mentioned that due to vastness of the flood situation and big distances among the affected areas, the government was still struggling to overcome the challenges.\nHe emphasized that the government was disbursing flood relief funds among the affected people through the Benazir Income Support Programme (BISP) in a transparent manner.",
  "retrievedAt": "2025-08-11T15:41:24.482Z"
}
