{
  "title": "IHC says  it will entertain PTI MNAs’ plea if they assure their return to NA",
  "link": "https://www.app.com.pk/national/ihc-says-it-will-entertain-pti-mnas-plea-if-they-assure-their-return-to-na/",
  "date_published": "2022-10-06T17:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): The Islamabad High Court (IHC) on Thursday observed that it would not entertain the Pakistan Tehreek e Insaf (PTI) MNAs’ petition until they satisfied it that they would returned to the National Assembly.\nChief Justice Athar Minallah, while hearing the plea of 10 PTI members of the National Assembly (MNAs) against acceptance of their resignations, observed that the members should have been in the parliament until the acceptance of their resignations to serve their constituencies.\nThey should also demonstrate the good intention by attending the NA session and in the meantime the case could be adjourned, he added.\nThe chief justice observed that the court could not allow them (the PTI members) to accept only those which were according to their wishes.\nPTI’s lawyer Barrister Ali Zafar said attending the NA session was a secondary issue. At this, the chief justice remarked that it meant that the PTI lawmakers were virtually boycotting the House.\nHe asked the petitioners to hold a deliberation in that regard and submit an affidavit that they would join the parliament.\nIf the 10 MNAs still supported the PTI’s policy of ‘not joining the parliament’ then the court would not hear their case.\nThe chief justice remarked that the court could not pass an order on a petition meant for mere political point scoring.\nChief Justice Minallah said the court could not provide the facility for a political dialogue. The petitioners had stated that they did not accept the current parliament, he noted.\nThe court observed that the petitioners wanted to prolong the political instability in the country, which was not in the national interest and could lead to economic damages.\nThe chief justice remarked that the court could not issue instructions to the National Assembly speaker. MNA Shakoor Shad’s resignation case differed from the instant matter as he had attended the NA session. Such political disputes should be better settled in the parliament and the courts should not be dragged into them, he added.\nBarrister Ali Zafar said he was not in a position to inform the court regarding the return of PTI members to the parliament. Once the memberships of his clients were restored then he would be able to respond on the matter, he contended.\nThe counsel said the resignations of PTI members were genuine but were conditional. The MNAs would not go to the parliament in violation of their party’s policy. Resignations of 11 PTI members were accepted in contrary to the procedure and law, he added.\nHe said the PTI leadership would take a decision regarding returning to the House after five days.\nOn this, the court said it could give five days to the petitioners to reach on a conclusion. They should satisfy the court that they wanted to attend the NA sessions.\nThe chief justice said the court could adjourn the case for an indefinite time. The PTI’s lawyer responded that then the by-polls would take place against the vacant seats.\nThe court asked whether the petitioners only wanted to suspend the by-polls.\nThe court then adjourned the hearing.",
  "retrievedAt": "2025-08-11T15:41:11.469Z"
}
