{
  "title": "Early diagnosis of breast cancer, awareness on breaking taboos crucial to save women’s lives: President",
  "link": "https://www.app.com.pk/national/early-diagnosis-of-breast-cancer-awareness-on-breaking-taboos-crucial-to-save-womens-lives-president/",
  "date_published": "2022-10-06T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): President Dr Arif Alvi on Thursday said early diagnosis of breast cancer was crucial in reducing the mortality rate in women and stressed raising awareness among the population to address the challenge by breaking social taboos about the disease.\nAlong with his wife Samina Alvi, the president in an interactive session with journalists of print and electronic media here at the Aiwan-e-Sadr, highlighted the importance of the media’s role in sensitizing the public about breast cancer.\nPresident Alvi emphasized adopting a preventive rather than curative approach as the government, at the level of the general public, could not bear the cost of expensive medical treatment including scanning and oncology procedures.\nHe called for educating women on how to conduct self-examination to locate any abnormal nodules and not to hesitate in seeking urgent medical help.\nPresident Alvi said it was the responsibility of society to give a safer and more comfortable public space to women by providing them access to facilities, whether relating to education, health, and an environment free from harassment.\nThe president urged the journalists to join the cause of fighting breast cancer by highlighting the topic in their write-ups and television programmes.\n“Let’s empower our women by improving their health and helping them contribute towards raising a healthy generation,” he said, adding that women at the grassroots level of society needed to be educated about self-examination through descriptive diagrams.\nBesides breast cancer, he stressed that awareness of other health issues including malnutrition, stunting, hepatitis, and communicable diseases was also significant.\nPresident Alvi mentioned that he had sent letters to media houses and journalists in the country, urging them to join hands with the government and civil society in raising awareness about breast cancer.\n‘I and Samina Alvi, with our four years of awareness campaign on breast cancer from the platform of the Presidency, want to address the issue with a ‘comprehensive shotgun approach’,” he said.\nBegum Samina Alvi said in view of her awareness campaign on breast cancer, the media had been effectively highlighting the subject in their television programmes and newspapers. She mentioned that she had proposed the television channels airing drama serials with the message of early diagnosis of breast cancer.\nShe also urged the male members of the family to realize the suffering attached to the disease and support women to get proper medical care.\nDr Fauzia Abdus Samad, Head of the Oncology Department at Fauji Foundation Hospital, Rawalpindi said of the 34,038 cases of female cancer incidents in Pakistan, over 40 percent were related to breast cancer.\nShe termed as alarming the one in nine mortality rate of women in the country and said self-diagnosis or early screening could up the survival rate of patients.\nShe said the disease limited to the breast only (localized) had a 99 percent survival rate, however, if spread to the axilla or chest wall (regional) and other organs such as lungs (distant) had 86 and 28 percent survival chances, respectively.\nAs per data from all oncology centres in Pakistan published in 2014, she said, the disease incidence was 29 percent (localized), 46 percent (regional) and 25 percent (distant).\nStressing self-examination, she said on detection of breast cancer, the chemotherapy and radiation could be avoided if the lump measured 2 cm and 5 cm, respectively.\nThe President and Begum Alvi also responded to the questions of the journalists pertaining to the national-level efforts with regard to October’s breast cancer awareness campaign.",
  "retrievedAt": "2025-08-11T15:41:22.231Z"
}
