{
  "title": "Modi intends to repeat nefarious Kashmir episode also in Indian states: AJK President",
  "link": "https://www.app.com.pk/national/modi-intends-to-repeat-nefarious-kashmir-episode-also-in-indian-states-ajk-presidents/",
  "date_published": "2021-02-09T13:14:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Feb 09 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan has said “Indian Illegally occupied Jammu and Kashmir is our home and it is on fire, and when a house catches fire, the first and the foremost priority is to do everything in your power to save it from reducing to ashes”.\nHe made these remarks while addressing a webinar on “Assessing Pakistan’s Kashmir policy: A Medium to Long-Term Strategy” organized by the Strategic Vision Institute here on Tuesday, said a statement issued by the AJK President office.\nThe webinar was also addressed by former Defense Minister Lt Gen (ret) Naeem Khalid Lodhi, former Pakistan High Commissioner to India, Ashraf Jahangir Qazi, former Corps Commander, Lt Gen (ret) Masood Aslam, Research Associate Haris Bilal Malik and others.\nIn his keynote address, the AJK president said that not medium or long term but a short-term strategy is needed to save Kashmir because any medium-term policy is meant for five to six years while Modi wants to resolve the Kashmir issue before next elections in India and for this purpose, he is taking rapid actions with lightning speed.\nTalking about the Indian actions in occupied Kashmir, the President said that the most dangerous action Modi has taken after the siege, bifurcation and turning the occupied territory into an Indian union territory is to change the demography of the state.\nHe warned that if the international community continues to shut eyes towards the situation in occupied Kashmir, Pakistan and India may head towards another war on the Kashmir issue, and if this war broke out, its impacts would be felt in London, Brussels, New York and Tokyo also thereby affecting the entire world.\nTouching upon the Indian war crimes in occupied Kashmir, Sardar Masood Khan said that the Prosecutor of International Criminal Court Ms Fatou Bensouda has indicated to conduct an investigation into war crimes in Palestinian territories, but even more serious crimes are being committed by Indian in occupied Jammu and Kashmir, and the mastermind of these crimes in Delhi, is constantly engaged in planning elimination of the Kashmiri people, and the international community has shut its eyes towards his crimes.\nHe maintained that what is happening in occupied Jammu and Kashmir is in the knowledge of the international community and all the influential countries, but they are tight-lipped against India because of their economic and strategic interests.\n“Some Western countries want to use India as a pawn against China, and India itself is ready to play this role,” he added.\nResponding to different questions from the participants of the webinar, the AJK president said that if the international community allowed the hooliganism to go on because of its petty political interests, peace and stability of the world would be destroyed as had happened after the World War-II.",
  "retrievedAt": "2025-08-11T20:20:21.831Z"
}
