{
  "title": "Rates for sale, purchase of senate voters fixed again: Asad Umar",
  "link": "https://www.app.com.pk/national/rates-for-sale-purchase-of-senate-voters-fixed-again-asad-umar/",
  "date_published": "2021-02-09T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 09 (APP): Minister for Planning, Development and Special Initiative Asad Umar Tuesday said as the date for Senate elections was approaching near, the politicians have started setting their rates to sell votes for senate seats.\n“It is not a new practice as we have been observing such “Bakra Mandis” like practices in the parliament for a long but the Pakistan Tehreek-i-Insaaf (PTI) government wants to stop such obnoxious game once for all,” he said while addressing a press conference here flanked by Minister for Information and Broadcasting Senator Shibli Faraz.\nAsad Umar said the leaked video that was being circulated in media, was the video actually recorded in 2018 before senate elections, clearly showed that some Khyber Pakhtunkhwa assembly members were receiving cash to sell their votes.\nHe said the PTI had cancelled the party membership of the alleged MPA of Khyber Pakhtunkwa Assembly which was also reflection of the party’s commitment to curb corrupt practices from across the board.\nHe said he that it was necessary to tell the people that the government had presented a bill in the parliament for a constitutional amendment to ensure senate election through open balloting.\nExpressing displeasure over the opposition’s attitude, he said the leaders of Pakistan Democratic Movement (PDM) had repeatedly supported the idea of senate elections through open balloting but now when there was a time to turn those statements into reality, they started playing politics on the issue.\n“The power of democracy does not come from any tank or arms, but it comes from the moral strength of the parliamentarians,” he added.\nHe said the charter of democracy was signed by Shaheed Benazir Bhutto and Nawaz Sharif in which it was clearly written that there should be no more senate elections through secret balloting.\nThe minister said the people won elections by utilizing the money that they had earned through wrong means and after winning election, they use their influence to earn more black money.\nAsad Umar said the government had right to get their due seats.\nAbout opposition’s remarks that the government was worried about the senate elections, the minister termed such remarks as wrong observations recalling the time when the government succeeded to approve the bill about Financial Action Task Force (FATF) despite having majority members of opposition in the senate.\nHe said the politicians who were creating fuss over the amendment knew that if the amendment would be passed, their source of black money would be stopped.\nTalking about the filing of a presidential reference to seek the Supreme Court’s opinion on open ballot in the Senate elections, Asad Umar said the time for the polls was approaching fast and the Apex Court had not yet reached a decision, that is why the government had decided to issue an ordinance but the top court would have the final decision.\nHe said interpreting the Constitution was the Supreme Court’s domain and whatever decision they take would be final and the government would accept it.\nResponding to a question, Umar said that MPAs and MNAs were “free to cast their votes for whoever they wanted”, adding that the Constitution did not stop them from doing so.\n“But if there is a basis for casting the vote [against your own party] that is unethical, we are talking about ending that.”",
  "retrievedAt": "2025-08-11T20:20:29.152Z"
}
