{
  "title": "SAPM discusses petroleum sector reforms with ADB team",
  "link": "https://www.app.com.pk/national/sapm-discusses-petroleum-sector-reforms-with-adb-team/",
  "date_published": "2021-02-09T07:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP):Special Assistant to Prime Minister (SAPM) on Petroleum Nadeem Babar held a virtual meeting with Country Director of Asian Development Bank (ADB) Xiaohong Yang and her energy sector team.\nThe meeting was aimed at discussing progress achieved on the reforms program in petroleum sector of Pakistan, a news release said.\nEnergy sector reforms are the part of government policy to improve energy economics and secure gas and oil supplies across the country.\nIn opening remarks, the SAPM thanked and appreciated the ADB for support and cooperation in the country’s energy sector reforms.\nHe said the government had made significant progress in every agenda item of energy reforms despite challenges caused by the COVID-19 pandemic.\nNadeem Babar apprised the forum that Third-Party Access (TPA) policy had fully been implemented, adding the TPA was also available for pipelines and the government had advertised the unused capacity of terminals for private companies enabling them to bring and sell the LNG to consumers of their own choice by this April.\nThe SAPM highlighted the exploration and production (E&P) activities being carried out in the country, and said the first bidding round for 15 onshore oil and gas blocks had been completed.\nHe said the minimum investment carried out by the E&P companies for studies and investigations in these blocks would be over $71 million in three years, followed by the development program in the identified blocks running into hundreds of millions of dollars in located areas.\nHe noted that the second and third round of the blocks’ bidding would be completed by end of this year.\nNadeem Babar informed the forum that the government had prepared a framework of regulatory authority for upstream petroleum sector; and it would be put in place after approval by Council of Common Interest (CCI) and necessary legislation.\nApprising the participants on Unaccounted Gas Factor (UFG), the SAPM said that both Sui companies had made a significant progress on reduction of the UFG losses.\nHe appreciated the support of ADB for hiring of consultant and study of strategic underground gas storage project.\nHe also acknowledged the interest of ADB in funding such a project, after completing the necessary formalities, if the government desired to proceed further after the feasibility study.\nHe underlined the importance of the underground gas storage facilities and said this project would enhance country’s capability to import gas and ensure sustainable economic growth.\nAt conclusion of the meeting, ADB Country Director Xiaohong Yang lauded Pakistan’s efforts for bringing reforms in the energy sector.\nShe hoped that the Bank would continue extending cooperation to Pakistan in the field of energy.",
  "retrievedAt": "2025-08-11T20:20:25.714Z"
}
