{
  "title": "NPHP gaining popularity among lower middle class",
  "link": "https://www.app.com.pk/national/nphp-gaining-popularity-among-lower-middle-class/",
  "date_published": "2021-02-09T08:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): The initiative of Pakistan Tehreek-i-Insaf (PTI) government to construct five million houses for poor homeless and middle class was gaining popularity among masses across the country.\nEven amidst the challenges posed by Coronavirus epidemic, the incentives for construction industry had led to massive business activity in construction and real estate sectors and jobs creation.\nKeeping in view the importance of the construction sector, the government has taken several far-reaching steps including legislation to facilitate the industry, like tax incentives and extension of fixed tax system till December 31, 2021.\nEarlier, the absence of mortgage law was a major hurdle on way to development of the housing sector, but the issue has now been resolved that would have positive effects on the industry.\nThe State Bank of Pakistan (SBP) has made it compulsory for all the banks to provide 5 percent of their respective domestic private sector credit to the housing and construction industry. This step would ensure around Rs 378 billion for construction financing till December 2021.\nThe mark up for 5 and 10 marla housing units has been cut down and for the low cost housing projects, the Naya Pakistan Housing and Development Authority (NPHDA) would provide subsidy of Rs. 300,000 per housing unit for first 100,000 housing unit.\nTo facilitate the builders and developers, the government would facilitate low cost housing and the NPDHA would play a key role in launching the project and provide subsidy and mortgage facilities to individuals.\nAccording to the NPDHA, the construction projects worth Rs 162.81 billion have been started in Punjab while projects worth Rs 136.42 billion were in the process of approval.\nIt will generate economic activity of Rs. 1,495.15 billion and provide employment opportunities to around 250,000 people. Similarly, the construction projects worth Rs 28.49 billion were launched in Khyber Pakhtunkhwa, creating economic activities worth Rs 142.431 billion and 27,000 jobs. Meanwhile, use of cement has registered 16.61 percent increase in first five months of the current financial year.\nThe government has also taken all possible measures to facilitate builders and developers. Earlier, it was difficult for them to get approval, but now the “approval procedure” has been simplified.\nThe establishment of Service Desk Portal and Help Desk has been finalized by the SBP to registered complaint about the Housing Finance Markup Subsidy Scheme for “My Pakistan My Home”.\nThe complaints regarding mark-up subsidy on loans can be lodged through these portals. The SBP has also set up help desks in 15 cities where SBP officers and bank focal persons would be present to address the grievances of the applicants.\nThe first time, the complainant can sign up to ‘servicedesk.sbp.org.pk’ through their mobile phones.\nPetron-in-Chief, the Association of Builders and Developers of Pakistan (ABAD) Mohsin Sheikhani appreciated the government incentives and said the builders were benefiting from these measures.\nHe said constructions of five million houses and 15 million jobs was achievable under this project as it is for the first time in 70 years that any government has declared the housing sector as an industry.\nMoshin said the package would benefit 72 industries affiliated to the construction industry as he noted that despite corona virus, the Prime Minister’s package had boosted construction activities.\nManaging Director and Chief Executive Officer Pakistan Mortgage Refinance Company (PMRC) Mudassir Khan said PMRC was providing refinancing facility backed by funding from the World Bank and the government.\nMudassir said long-term affordable housing finance is a reality now with disbursements reaching Rs.15 billion to 11 partner banks and financial institutions through conventional and innovative Islamic refinancing products.\nThe PMRC had also introduced a risk-sharing facility as a trustee for the government to encourage banks to lend for low-cost housing.\nSenior Financial Sector Specialist of Pakistan Mortgage Refinance Company Limited, Namous Zaheer appreciated Pakistan Housing Finance Scheme saying that the project would have long lasting results.\nShe said the World Bank with the collaboration of the government and PMRC were working on development of the mortgage finance industry in the country. Pakistan is one of the fastest growing countries in the world but faced shortage of houses.\nEarlier, a specific segment of society could get loans for housing but this scheme would provide affordable housing loans to low-income groups as well, she said adding, at present only 2 percent of women population has housing rights and steps were being taken to increase women’s participation in this scheme.\nShe said that low cost home finance would boost construction activities in the country, create jobs and benefit the allied industries. “The government and the Planning Commission were putting in maximum to make the project a success and prospering allied industries.\nChairman All Pakistan Cement Manufacturers Association, Azam Faruque said the NPHP will help revive business activities in a challenging situation of global economy’s slowdown.\nPakistan has huge opportunity to choose a better option like the construction of new houses to come out of this crisis.\nChairman Pakistan Iron and Steel Merchant Association, Tariq Irshad said that the construction industry is considered as the backbone of any economy and recent measures of the government would boost this sector.\nChairman All Pakistan Marble Industries Association, Noman Baqi Siddiqui also welcomed the government decision, saying that in this critical situation, the initiative would not only benefit the construction sector but the whole economy.\nAs Prime Minister Imran Khan himself reviews progress on the housing schemes, he personally chairs the meetings on important housing sector projects undergoing in the country. The negotiations with consultants and designing of Ravi City project have entered the final stage and the work was underway on proposed projects to build low-cost housing for the low-income class in the vicinity of small towns in Punjab.\nThese low cost 3 to 5 Marla houses would be initially launched in 25 to 27 districts of the province to be extended to 87 locations. The Punjab government would provide land and finances in the initial phase and subsidy under mortgage financing in the next phase.\nRegarding prefabricated houses, several international companies have shown interest in construction of houses. A Chinese Company Henan D.R. Construction Group Co. Ltd. has built first pre-fabricated house in Faisalabad industrial estate.\nPrime Minister Imran Khan had laid the foundation stone of the “Easy Fabricated Homes Private Limited Project” in September last year. During a visit to Beijing last year, the Prime Minister met with senior officials of Hunan D.R Construction Group and decided to invest in building prefabricated houses to meet the demand for houses in Pakistan.\nUnder the low cost and energy saving housing project, Deputy Chairman of NPHDA Lt. Gen. (R) Anwar Haider also inaugurated a pre-fabricated house model in Small Industrial Estate Faisalabad this month.\nThe single and double story sample houses were built from pre-fabricated material prepared by a factory at M-3 Industrial Park, Faisalabad. The life of this unit is at least 50 years.\nKorean company G. Songuo also built first fabricated house at Islamabad Pak-China Friendship Center. The company built two-bedroom house with imported material in seven days with its life stated to be 50 years. Its material can be manufactured domestically and insulation walls have been used for construction this house which is claimed to be 43 times safer than the traditional houses during fire eruption and earthquake.\nAccording to the representative of G. Songuo, the company can build four-storey houses and apartments. The transfer of modern technology would not only attract foreign investment but also help create employment opportunities. The company has the capacity to build 18,000 houses and apartments annually.",
  "retrievedAt": "2025-08-11T20:20:25.755Z"
}
