{
  "title": "Senate body expresses concerns over fake social media accounts",
  "link": "https://www.app.com.pk/national/senate-body-expresses-concerns-over-fake-social-media-accounts/",
  "date_published": "2021-02-09T16:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): The Senate Standing Committee on Information Technology and Telecommunications Tuesday expressed concerns over fake social media accounts operating with the names of political and social personalities.\nThe meeting was chaired by Senator Rubina Khalid. While expressing her grave concerns over the misuse of social media in the country Rehman Malik said that thousands of fake social media accounts are running for different malicious purposes and spreading blasphemous and highly objectionable materials to create uncertainty and chaos among the public.\nHe said that many are operating social media accounts with different names including the names of politicians are also used. He said that we had arranged hardware for Pakistan Telecommunication Authority (PTA) that such objectionable and hatred materials could be removed and the accounts could be blocked immediately however about the fate of hardware PTA can tell either it is operating or still under process.\nHe said that a fake Twitter account is being run in the name of Aitzaz Ahsan on Twitter about which, he has lodged a complaint with the FIA and PTA several times but several months passed and the said fake account in Aitzaz Ahsan is still active and spreading materials with his name.\nHe said that he as Chairman of Senate Standing Committee on Interior has also taken the notice of the said fake account and has sought a report from FIA for discussion in the upcoming meeting.\nRehman Malik urged that now is the need of time for legislation on social media to control such things adding that strict legal action should be taken against those violating cyber laws of the country.\nHe suggested that while dealing with social media we should replicate the model of Saudi Arabia and UAE wherein all mediums of social media are in the control of government and even a single blasphemous word can’t be posted.\nHe said that even calls on WhatsApp and other social mediums are controlled in UEA and Saudi Arabia. He said that strict action should be taken against those who post and spread blasphemous, sectarian, offensive, and objectionable material.\nHe expressed that no Muslim can bear Blasphemous words about our beloved Prophet (PBUH). He said that government should talk to social media operators to open their offices in Pakistan that it could be made possible to remove such objectionable material immediately.\nThe Senate body also discussed PTCL’s employees pension issue. Rehman Malik expressed concerns and annoyance over the Ministry of Information Technology and telecommunication and the Pakistan Teleco­mmunication Company Ltd (PTCL) for not paying the due amount to its pensioners despite Committee clear directions and Senate decision.\nHe advised to forward a complaint against its management for not following the recommendations of the Senate, Senate Committee and also not obeying the orders of the Supreme Court of Pakistan.\nHe suggested the committee take stern action against those involved in siphoning off the PTET’s assets. He said “I suggest that after the due procedures we should forward the case to FIA. This is essentially needed as the PTET board and the PTCL management are not even following the decision of Supreme Court, Senate house and this committee to pay the pensions as per law”.\nMinister for IT Syed Aminul Haque assured the committee that the issue of pensioners would be resolved at the earliest. “We are taking steps in this regard and the issue would be solved soon as per the law.”\nThe committee meeting was attended by Senators Taj Muhammad Afridi, Fida Muhammad, Barrister Muhammad Ali Khan Saif, Rukhsana Zubair, Rehman Malik and Faisal Javed besides Federal Minister for IT, Secretary, Ministry of IT, Chairman PTA and senior officials of relevant agencies.",
  "retrievedAt": "2025-08-11T20:20:30.469Z"
}
