{
  "title": "Pakistan embassy in Ethiopia marks Kashmir Solidarity Day",
  "link": "https://www.app.com.pk/national/pakistan-embassy-in-ethiopia-marks-kashmir-solidarity-day/",
  "date_published": "2021-02-09T12:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): Pakistan embassy in Ethiopia marked the Kashmir Solidarity Day with traditional zeal and commitment, highlighting the plight of people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) and the due role of international community in resolving the lingering issue of Kashmir.\nTo observe the day, a gathering of Ethiopian government officials, diplomatic community, media persons and Pakistani Diaspora was arranged on February 5 in newly built auditorium at the Embassy of Pakistan in Addis Ababa, according to a message received here.\nMessages from President Dr Arif Alvi and Prime Minister Imran Khan on the plight of Kashmiri were read out, while Pakistan ambassador Shozab Abbas gave a detailed presentation and educated the participants about the historical background of the Kashmir issue, its socio-political & socio-economic implications, military fallout and environmental cost for 1.68 billion people of South Asia.\nHe said the main bone of contention between Pakistan and India was the disputed territory of Jammu and Kashmir, which India had illegally occupied since the sub-continent’s partition in 1947.\nThe envoy highlighted the sufferings of innocent and helpless Kashmiris of IIOJK and urged the peace-loving people and nations to come forward and awake the slumbered conscious of Indian leadership for peaceful resolution of the dispute.\nHighlighting the plight of Kashmiris from legalistic and human rights perspectives, Shozab Abbas said the UN Security Council had already awarded final decision to hold plebiscite and determine the will of Kashmiri people. “Their (Kashmiris) birth right cannot be denied.”\nHowever, he said, continuous violations of Kashmiris rights by the Indian army and government had turned the “Heaven on Earth” into a “Burning Hell.”\nThe envoy highlighted the pathological sickness of Hindutva mindset and said that the disease would only degenerate Indian leadership from inside and make them coward and timid.\nHe also underscored the environmental catastrophes aggravated by the militaristic activities of India, and alarmed that it would denude Kashmir from the veneer of its lush green forest cover and accelerated ecological destruction and climate change in Kashmir.\n“Only peaceful, honest and people centric approaches, through diplomatic means, would save the unfortunate territory of Kashmir and bring normalcy and development in the entire subcontinent.\nLater a question-answer session was held, during which he gave detailed answers of the queries put forth by the participants.\nThe participants noted that Kashmiris have long suffered in their struggle and that the resolution of Kashmir issue was a key to prosperity in South Asian region.\nEthiopian Muslims also emphasized” to start special supplications for Kashmiri people, 365 days, for their ultimate freedom and redemption from unjust Indian occupation.”",
  "retrievedAt": "2025-08-11T20:20:22.881Z"
}
