{
  "title": "Commotion in NA no service to democracy: Asad Qaiser",
  "link": "https://www.app.com.pk/national/commotion-in-na-no-service-to-democracy-asad-qaiser/",
  "date_published": "2021-02-09T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 09 (APP): Adviser to the Prime Minister on Parliamentary Affairs Dr. Babar Awan called on Speaker National Assembly Asad Qaiser on Tuesday to discuss matters pertaining to legislation and issues of national importance.\nIt was decided to convene session of National Assembly on requisition of the opposition. It was also agreed that proceedings of the house would be conducted according to rules of procedure and conduct of business in the National Assembly.\nThe Speaker said that it was joint responsibility of government and opposition to conduct the proceedings of the house in a smooth manner and ensure a conducive atmosphere in the house.\nHe said that commotion in the House was neither a service to democracy nor to the people.\nHe further said that issues of national importance and legislation would be discussed in the forthcoming session.\nHe said that by conducting the proceedings of the House in a cordial atmosphere, matters of public importance and legislation could be enacted in a better manner.\nHe said that the aspirations of people were linked with the elected representatives, therefore in order to come up to their expectations, the elected representatives would have to discuss their problems through Parliament.\nAdviser to the Prime Minister on Parliamentary Affairs, Dr. Babar Awan, while praising role of Speaker in conducting the proceedings of the House effectively, said that the ruling party and the opposition have always been given equal opportunity in the proceedings of the House.\nHe hoped that members of National Assembly would follow rules and regulations in the upcoming sessions and would play their positive role in conducting proceedings of the house in a conducive atmosphere.\nHe said that issues of public importance should be discussed so that confidence of the people and their elected representatives could be increased.",
  "retrievedAt": "2025-08-11T20:20:30.464Z"
}
