{
  "title": "COMSTECH, Gourmet announces Industrial Internship Program",
  "link": "https://www.app.com.pk/national/comstech-gourmet-announces-industrial-internship-program/",
  "date_published": "2024-11-25T11:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP):The OIC Standing Committee on Scientific and Technological Cooperation (COMSTECH), in collaboration with Gourmet Industries, has announced the COMSTECH-Gourmet Industrial Internship Program for its first batch in January 2025.\nThis program aims to promote innovation, research, and skill development across various industrial sectors, offering participants practical training and exposure to advanced technologies and industrial processes.\nAccording to COMSTECH, the internship is open to applicants from OIC member countries holding a BS/BSc or MS/MSc in relevant fields and under the age of 40.\nHosted by Gourmet Industries, the largest food processing complex in Pakistan, the program offers 10 internships lasting four weeks. The selected candidates will receive accommodation, meals, and return economy-class air travel.\nThe objective of the COMSTECH-Gourmet Industrial Internship Program is to foster innovation and research and development (R&D) across diverse industrial sectors, including food processing, engineering, plant operations, recycling, and so forth.\nThis program aims to provide interns with hands-on experience and exposure to cutting-edge technologies and methodologies, thereby enhancing their practical skills and theoretical knowledge.\nBy engaging in real-world projects, interns will contribute to the advancement of industrial processes and the development of sustainable solutions, ultimately driving technological innovation and improving operational efficiencies in the fields of human nutrition and value addition.\nThe program focuses on key areas including food industry operations such as bakery, dairy, and beverages, plant utilities, recycling through innovative RPET methodologies, shrink-wrap production, sugar mill logistics, and media training in journalism and broadcasting. Participants will gain hands-on experience in supply chain management, production processes, and sustainability practices.\nThis initiative underscores COMSTECH’s mission to empower youth in OIC nations and advance technological development for socio-economic progress.\nThe applicants must complete the application form and upload the requested documents (CV, Research Proposal, etc.) at: (https://form.jotform.com/243101366016444) till November 30. The applicants can contact events@comstech.org for further information.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:37:19.668Z"
}
