{
  "title": "ISSI roundtable discusses Pakistan-U.S. relations in regional, global context",
  "link": "https://www.app.com.pk/national/issi-roundtable-discusses-pakistan-u-s-relations-in-regional-global-context/",
  "date_published": "2024-03-21T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): The Centre for Strategic Perspectives (CSP) at the Institute of Strategic Studies Islamabad (ISSI) hosted a Round Table discussion with H.E. Donald Blome, Ambassador of the United States of America to Pakistan, on “Pakistan-U.S. Relations in the Context of Regional and Global Developments here Thursday.\nThe roundtable participants included former Ambassadors and diplomats, heads of think tanks, academics, practitioners, and area experts, a news release said.\nIn his welcome remarks, DG ISSI Ambassador Sohail Mahmood recalled the past patterns of the relationship and dilated on its current dynamics. He noted that the Pakistan-U.S. relationship has been largely influenced by external circumstances, encompassing regional and global developments. The thrust of bilateral cooperation has now shifted from security to a wider range of areas, reflecting changing priorities. While counter-terrorism remains important, the greater focus now includes trade, investment, energy, IT, environment, education, culture, and people-to-people exchanges. This aligns with Pakistan’s pivot towards geo-economics and comprehensive human security. He concluded by stressing the importance of revitalizing the relationship, with due imagination and ambition about the future prospects.\nAmbassador Blome in his remarks, highlighted the importance of establishing robust ties to strengthen the relationship even further. He emphasized that economic development is the cornerstone of Pakistan-U.S. relations with a renewed focus on groundwork to bolster ties and collaborate effectively towards fostering enhanced peace, prosperity, and regional stability.\nFollowing the talk, the participants engaged in an interactive discussion that focused on a range of subjects — including the situation in Afghanistan; peace, security and strategic stability in South Asia; conflict in Europe and the Middle East; developments in Asia-Pacific; and maritime security.\nIn the end, Ambassador Khalid Mahmood, Chairman of the Board of Governors, ISSI presented the Institute’s memento to the Keynote Speaker followed by a group photo.",
  "retrievedAt": "2025-08-11T01:29:21.416Z"
}
