{
  "title": "Attaullah Tarar for devising mechanism to counter fake news regarding CPEC",
  "link": "https://www.app.com.pk/national/ataullah-tarar-for-devising-mechanism-to-counter-fake-news-regarding-cpec/",
  "date_published": "2024-03-21T07:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Thursday emphasized the need to devise a mechanism at the government-to-government and media-to-media level to counter fake news regarding the China-Pakistan Economic Corridor ( CPEC).\nAttaullah Tarar said this during a meeting with the Ambassador of the People’s Republic of China, Jiang Zaidong who called on the minister here.\nThe Chinese Ambassador congratulated Attaullah Tarar on assuming the portfolio of the Ministry of Information and Broadcasting.\nThe CPEC, Pakistan-China strategic relations, ongoing cooperation in the media and film sector, and China-Pakistan Information Corridor were discussed in the meeting.\nDiscussions were held regarding the expansion of cooperation between the two countries in the fields of media and the establishment of the Pakistan-China Information Corridor to prevent fake news about CPEC.\nPakistan highly valued its relations with China, the minister added that both countries were bound by the eternal bond of friendship.\nAttaullah Tarar said in 1998, his grandfather Muhammad Rafiq Tarar received the then Prime Minister of China on his visit to Pakistan as President.\n“We have seen Pakistan-China friendship from generation to generation. We have to inform our new generation about our historical and strong friendship,” he maintained.\n“We have to tell the new generation how China and Pakistan supported each other in difficult times,” the minister said.\nTarar said that China had supported Pakistan at every international forum including Shanghai Cooperation Organization and United Nations.\nHe opined that a close and sustainable partnership between the two countries in the form of CPEC was in the wider interest of the entire region.\nThe CPEC was an important milestone in promoting the economic development of Pakistan, Tarar remarked.\n“The China-Pakistan Economic Corridor is a framework for regional connectivity that will not only benefit China and Pakistan but will also have positive effects on Iran, Afghanistan, India, Central Asian Republics and the region,” the minister said.\nHe said that the China-Pakistan Information Corridor would be an important strategic step towards preventing fake news about CPEC as it aimed to harness the power of digital connectivity and information exchange.\nThe Ministry of Information, he added will continue its work in this regard.\nHe said it was the vision of Prime Minister Shehbaz Sharif to make Pakistan an investor-friendly country.\nIn the meeting, the two countries agreed to expand cooperation in the field of film and culture.\n“Like China, Pakistan is an ancient civilization with a history of seven thousand years,” Tarar told the Chinese envoy.\nHe said many spiritual and cultural movements emerged from the Indus Valley of Pakistan that shaped Asian culture.\nThe ancient Gandhara civilization of Pakistan introduced Buddhism to much of East Asia, including China, he stated.\nHe said Pakistan and China also jointly organized a Gandhara Buddhist exhibition at the Palace Museum last year.\nIn the meeting, discussions were also held regarding the advancement of the Sustainable Development Goals agenda between Pakistan and China.\nTarar said that Romina Khurshid Alam was in close contact with China regarding the SDGs project.\nThe MoU between Pakistan’s official news agency Associated Press of Pakistan and China Media Group (CMG) for the third Belt and Road Forum was also discussed in the meeting.\nThe minister said that a film production agreement was also under process between the governments of the two countries.\nThe minister said that the MoU between APP and Xinhua News Agency was in progress.\nCooperation for the joint production of a travel documentary between CGTN and PTV was also discussed by the minister and the Chinese Ambassador.",
  "retrievedAt": "2025-08-11T01:29:16.586Z"
}
