{
  "title": "ITP issues 70,000 pamphlets amongst road users to acquaint them with safety tips",
  "link": "https://www.app.com.pk/national/itp-issues-70000-pamphlets-amongst-road-users-to-acquaint-them-with-safety-tips/",
  "date_published": "2020-02-06T22:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 07 (APP):Minister of State for Parliamentary Affairs Ali Muhammad Khan Friday informed the National Assembly that Islamabad Traffic Police (ITP) had distributed about 70,000 pamphlets amongst the road users to acquaint them with road safety tips and safe driving techniques.\nResponding to question in Question hour, he said that ITP had started awareness campaigns at all major roads. ITP education teams deployed at special Nakajats at prominent places would educate road users. So far, he said, a total of 7, 01,077 road users had been educated during the current year.\nHe said that 800 streamers had been displayed at Zero point, Faizabad to Gulberg, Kashmir Highway, Margalla road and Murree Road.\nThe Minister said that during 2019, 8,39,256 people had violated traffic laws in the federal capital. The motorcyclists were issued about 1, 09,214 tickets for not wearing helmet while riding. Moreover, 8561 violation tickets had been issued to the drivers of vehicles plied without proper lights.\nHe said that ITP was regularly airing the road safety tips including wearing of helmets and use of proper lights through ITP FM 92.4 radio station.\nResponding to another question, he said that no new residential sector had been launched by Capital Development Authority (CDA) during the tenure of present government till date.\nThe minister said that as per the information of Federal Investigation Agency (FIA) the illegal organ trafficking cases had not increased in the country. He also suggested legislation to address shortcomings in method of donating organ to other than relatives.\nResponding to another question he said, no passport free entry was currently being allowed to Indian pilgrims in Kartarpur Sahib Corridor as per the MoU signed between Pakistan and India.\nHowever he said, proposal of giving concession of entry without passport, in order to attract more visitors, was under consideration, for which detailed input may be sought from Ministry of Foreign Affairs.\nAs per existing procedure, pilgrims could visit the Corridor from dawn to dusk after producing Indian passport or Oversees Citizen of Indian Origin Card alongwith passport of resident country, he said.\nSame was punched by the Immigration staff at Border Terminal against the data provided by Indian authorities for 10 days in advance.\nHe said that movement of Indian visitor was regulated from border till Gurdwara complex and back through combination of physical and electronic security system by Pakistan Rangers (Punjab) along-with other LEAs.\nIndian visitors were strictly kept inside the confines of Gurdwara complex by ensuring their movement through biometric systems, turnstile gates and to avoid their exit toward Pakistan side.\nMoreover, he said, all the activities in and around the corridor were monitored through surveillance cameras from the Control Room.\nThe Minister said that the forensic audit of the Jammu and Kashmir Cooperative Housing Society for the period from 2011, July,1 to 2016, June 30 was in progress as per orders of the Supreme Court.\nHe said that requisite action will be taken in the light of final report received from concerned auditor. The incumbent Managing Committee had taken the charge on 02-09-2019 and scrutiny of record was in progress. Action will be taken in accordance with law against any irregularity found.",
  "retrievedAt": "2025-08-11T18:45:40.747Z"
}
