{
  "title": "Senators express solidarity with Chinese Govt, nation on coronavirus affliction",
  "link": "https://www.app.com.pk/national/senators-express-solidarity-with-chinese-govt-nation-on-coronavirus-affliction/",
  "date_published": "2020-02-07T06:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 07 (APP):The lawmakers on Friday expressed solidarity with Chinese government and people on the tribulation and affliction of novel coronavirus which had inflicted China and some parts of the world.\nSpeaking on a point of public importance in the Senate, Leader of the House Syed Shibli Faraz said no case of coronavirus had been reported so far in the country.\nHe said that a comprehensive strategy had been worked out to cope with coronavirus and the government and all the stakeholders were monitoring the screening system at airports.\nShibli Faraz said that all possible steps were being ensured to deal with coronavirus and the government was ready to tackle any emergency situation in this regard.\nHe said an emergency operation cell, established at the Ministry of National Heath, Services and Regulations, had been observing the situation.\nShibli Faraz said that the separate wards had been set up at hospitals to deal with cases of coronavirus, if any.\nHe said the Ministry of Foreign Affairs and the Pakistan Embassy in China were actively monitoring the situation of coronavirus outbreak and also informing the parents of the students on continuous basis.\nMinister for Parliamentary Affairs Azam Khan Swati assured full support from the people, government and Senate to the Chinese Ambassador in Pakistan to check deadly coronavirus.\nThe Senators who spoke on the issue included Javed Abbasi, Mustaq Ahmed, Sitara Ayaz, Mushahid Ullah Khan, Abdul Ghafoor Haideri, Behramand Tangi, Dilawar Khan, Mushahid Hussain Syed and Nauman Wazir.\nThey suggested the government to formulate a committee of the Parliament to review the efforts against this deadly virus.\nThe legislators said that a strong massage should be conveyed from the Senate that all the Senators were ready to cooperate with the Chinese government on the issue.",
  "retrievedAt": "2025-08-11T18:45:41.264Z"
}
