{
  "title": "Truth has come out with Imran Khan’s audio leaks: Asif",
  "link": "https://www.app.com.pk/national/truth-has-come-out-with-imran-khans-audio-leaks-asif/",
  "date_published": "2022-10-08T15:04:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Oct 08 (APP):Federal Minister for Defence Khwaja Muhammad Asif has said that two audio were leaked on Friday, and everyone heard the conversation taking place in it.\nThe conversation also brought the truth before the public, though the Pakistan Muslim League-Nawaz (PML-N) leadership already knew that Pakistan Tehreek-e-Insaf (PTI) chairman always tells the public lies.\nTalking to the media here on Saturday, Kh Asif said that Imran Khan was talking about buying and selling parliamentarians in the audio leak. He said that Imran Khan could get the audios audited forensically if those were fake.\nThe federal minister said that before the 2018 elections, Imran Khan made promises to the people to give one crore jobs and five million houses. He contested the election on this basis. However, none of those promises were fulfilled by former prime minister, he added.\nKh Muhammad Asif said that Imran Khan should tell the nation which of his promises and narratives had been fulfilled thus far. He said that now his narratives of imported government and voter buying in elections had also been exposed.\nThe minister said that Imran Khan’s narratives and his lies showed that he was not loyal with the country and the public. He said that nobody knew what that person’s intentions were, and the nation should be thankful to Allah Almighty that the PTI chief had been exposed before the nation. He said that the narratives of external conspiracy and the cipher had also been exposed now.\nThe federal minister said that Azam Khan was asked where that cipher was, and he said “I don’t know”.\nHe said that the narrative of true freedom had also been exposed through Friday’s audio leak. “They are talking about extending the tenure of the army chief keeping in mind what is to happen in March and April,” Kh Asif said.\nHe said that in the coming days, Imran Khan would not find any place to hide his face. The federal minister said that 190 million pounds that Britain had sent belonged to the Pakistani government, but Imran Khan credited it to Malik Riaz’s liability account.\nHe regretted that no PTI leader, including its chairman Imran Khan, ever visited the flood victims. He said that national interest should be given priority over personal interest. He said that Pakistani forces had shown great performance against terrorism and sacrificed their lives for establishment of law and order.\nImran Khan had said that ‘neutrals’ were animals and he also termed them Mir Jafar and Mir Sadiq, which was regrettable, the minister added.\nKh Asif said that Nawaz Sharif’s sacrifices were countless for the country. He would return home soon. He said that the arrest warrant of Rana Sanaullah had been issued by the anti-corruption establishment Punjab, “but we have bravely fought the cases filed against us earlier and we will continue doing so.”“We are not scared of the Punjab government,” he added.",
  "retrievedAt": "2025-08-11T15:41:58.509Z"
}
