{
  "title": "President directs SRBC to pay Rs 10.32m outstanding dues to security company",
  "link": "https://www.app.com.pk/national/president-directs-srbc-to-pay-rs-10-32m-outstanding-dues-to-security-company/",
  "date_published": "2023-06-01T11:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 01 (APP): President Dr Arif Alvi has directed the Shalimar Recording and Broadcasting Company (SRBC) to pay outstanding dues of Rs 10.32 million to a company in lieu of security services, which SRBC had regretted to pay due to financial crunch.\nThe president further directed the Secretary of the Ministry of Information and Broadcasting to ensure payment of outstanding dues in monthly instalments within one year and, if necessary, seek approval of the competent forum within six months.\nHe gave these directions while rejecting a representation filed by SRBC against the decision of the Wafaqi Mohtasib (WM) that directed it to pay Rs 10,320,800 to a security company (the complainant company) on account of security services received from it, a President House press release said.\nThe SRBC had admitted the outstanding dues but had expressed its inability to pay the outstanding amount, even in easy instalments, due to financial constraints faced by it since 2020.\nFeeling aggrieved, the security company approached the Wafaqi Mohtasib, which passed the orders in its favour. SRBC, then, filed a representation with the president, which was rejected.\nIn his decision, the president said that it was strange that SRBC had adopted the stance before the president that it did not fall under the definition of “the Agency”, which as per president’s order No. 1 of 1983 meant a Ministry, Division, Department, Commission or office of the Federal Government or a statutory corporation or other institution established or controlled by the Federal Government.\nHe observed that SRBC was a public sector company, established under the Companies Act, 2017, and administratively controlled by the Ministry of Information and Broadcasting under the Rules of Business, 1973.\nPresident Alvi stated that SRBC had failed to pay out its liabilities, which it had already admitted, and it had simply refused to pay the amount, which was tantamount to maladministration under Article 2 of the President’s Order No. 1 of 1983.\nHe said that the findings of the WM were well-reasoned and rational and SRBC had failed to produce anything on record in support of its stance.\nThe president said that since maladministration was established on the part of SRBC, it was directed to pay the outstanding dues as per Wafaqi Mohtasib’s orders.\nHe added that Secretary MOIB should ensure to make the payment and, if necessary, seek approval of the competent forum within six months.",
  "retrievedAt": "2025-08-11T08:36:08.568Z"
}
