{
  "title": "Thar coal can ensure Pakistan’s energy security alone: CEO SECMC",
  "link": "https://www.app.com.pk/national/thar-coal-can-ensure-pakistans-energy-security-alone-ceo-secmc/",
  "date_published": "2023-06-01T09:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP): Chief Executive Officer (CEO) Sindh Engro Coal Mining Company (SECMC) Amir Iqbal has said that Thar coal alone can ensure the energy security of Pakistan besides reducing power tariffs significantly.\nTalking to APP here, he said that unlocking indigenous Thar coal reserves could generate approximately 100,000 megawatts (MW) electricity for the next 250 years. Coal was considered a cheap energy resource to catch up with future energy requirements of both the domestic and commercial consumers in Pakistan, adding in the last five years coal-based power production had also witnessed a significant increase, he added.\nThe CEO said in order to scale down fuel import costs, the country needed to shift towards local coal resources. Even in India, coal-fired power plants produce over two third of total electricity, he added.\nHe said India imports 200 million tons coal annually besides utilizing 500-600 million tons domestic coal while Pakistan’s coal production stood at a mere 14 to 15 million tons per annum.\nAmir Iqbal said currently SECMC was extracting 7.6 million tons per annum coal from Block-II and its capacity was being expanded to 11.2 million tons. Thar coal had total 13 blocks but presently coal was being mined from two blocks, he added.\nTerming coal reserves the future of Pakistan, Amir Iqbal said Thar coal could not only be used for power generation but also in the cement and steel industries. However, he said Thar coal had not yet been connected through the railway network. Once, Thar coal was connected with the railway network, it would not only open to the entire world but also pave the way for the economic prosperity of the country, he remarked.\nIn power plants, the average coal consumption is approximately 0.62kg/kWh. However, the new efficient power plants utilize 10% less coal as compared to the ordinary plants, he said.",
  "retrievedAt": "2025-08-11T08:36:10.917Z"
}
