{
  "title": "NA defence body condemns May 9 incidents, express solidarity with armed forces",
  "link": "https://www.app.com.pk/national/na-defence-body-condemns-may-9-incidents-express-solidarity-with-armed-forces/",
  "date_published": "2023-06-01T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP):The National Assembly Standing Committee on Defence Thursday expressed solidarity with the Armed Forces of Pakistan, who were pride of the nation and strongly condemned the incidents of terror that happened on 9th May.\nThe committee in its meeting held here under the chairmanship of Member National Assembly (MNA) Chaudhary Farrukh Altaf unanimously condemned the incidents of violence of May 9 and said such incidents were deplorable and intolerable, and must be dealt with sternly.\n“We unanimously condemn the incidents of violence of 9th May which have deeply hurt the sentiments of the nation. We stand with our Armed Forces,” the committee in its resolution resolved.\nThe 19th meeting of the Standing Committee on Defence discussed the prevailing law and order situation, and condemned the terror incidents of May 9th.\nThe committee remarked that it was imperative upon every citizen of Pakistan to respect the sanctity of the institutions and the public property of Pakistan.\nThe committee also paid tributes to the martyrs, who sacrificed their lives for Pakistan.\nMNA, Barjees Tahir moved the resolution stating, “The Committee passed the resolution unanimously, and recommended that the perpetrators of the violent incidents must be dealt with an iron hand.”\nAdditional Secretary, Ministry of Defence thanked the committee for recognizing the role and sacrifices of the Armed Forces of Pakistan to ensure prosperity of the country.\nThe committee expressed its desire to visit the General Head Quarters (GHQ), Rawalpindi as a symbol of solidarity with the armed forces .\nThe committee deferred “The Institute of Space Technology (Amendment) Bill, 2022,” moved by Muhammad Jamal ud Din, MNA till the next meeting.\nMNAs Rubina Irfan, Chaudhary Muhammad Barjess Tahir, Muhammad Khan Daha, Ramesh Kumar Vankwani and Salahuddin Ayubi attended the meeting.",
  "retrievedAt": "2025-08-11T08:36:09.435Z"
}
