{
  "title": "Nation witnessed ‘destructive & constructive’ mindsets in last one year: Marriyum",
  "link": "https://www.app.com.pk/national/nation-witnessed-destructive-constructive-mindsets-in-last-one-year-marriyum/",
  "date_published": "2023-06-01T17:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP):Minister for Information and Broadcasting Marriyum Aurangzeb on Thursday said the nation had witnessed both “constructive and destructive” mindsets in the last one year as the former brought destruction to the country while the latter served the masses.\n“Prime Minister Shehbaz Sharif during his ongoing government tenure stabilized the economy while the former ruler sowed the seeds of hatred, chaos and anarchy to train the armed groups which resulted into the May 9 tragedy,” the minister said while addressing a news conference.\nShe said the former ruler would not be remembered as a pragmatic leader as he had played no role in bringing political and economic stability in the country.\nOn the other hand, PM Shehbaz Sharif and the coalition government’s foremost priority was to ensure political and economic stability in the country as both were intertwined, she added.\n“We have inherited a ruined economy from the previous government of PTI which left the country at verge of default due to its inefficiency and incompetence,” she said, adding economic uncertainty was now on the retreat with end of political uncertainty.\n“The spell of misguidance seems to be breaking while the spell of hatred, mischief and anarchy is ending,” the minister remarked.\nMarriyum recalled that the previous government first signed the IMF programme, then violated, and finally suspended it. On the other hand, the present coalition government was holding negotiations with the IMF as it was determined to complete the ongoing programme.\nShe said the incompetent and inefficient PTI regime had laid economic mines and when ousted from the power, it resorted to agitation and long marches to disrupt the development process which was initiated by the coalition government under the leadership of PM Shehbaz Sharif.\n“The youth was brainwashed and the politics of arson and vandalism was promoted to ruin the economy,” she said while citing the May 9 tragedy as an example when armed groups attacked the sensitive installations.\nThe minister said the masses were reaping benefits of the reform agenda initiated by the coalition government in last one year with all the economic indicators had been on upward trajectory.\nThe price of LPG domestic cylinder had been reduced from Rs 2,759 to Rs 2,321, which would provide Rs 438 relief to domestic consumers per cylinder, she said, adding the commercial cylinder price had also been reduced by Rs 1,686.\nShe said the commercial LPG cylinder was earlier being sold at Rs 10,619 and now its price had been fixed at Rs 8,933. The price of cooking oil was decreased by upto Rs 70 per kg, whereas that of flour and wheat had been reduced by Rs 35 to Rs 40 per kg.\nShe said Prime Minister Shehbaz Sharif gave a historic package for farmers which proved a harbinger of bumper wheat crops. The prices of flour, wheat and cooking oil had come down today due to the government policy initiatives.\nOn the directives of Prime Minister Shehbaz Sharif, she said, young farmers were given loans on the easiest terms and subsidy was given on the DAP fertilizer prices and due to all the initiatives, today the country was moving towards economic stability.\nToday, the value of the dollar dropped by about Rs 27 due to the prudent policies of the government, she said, adding the PM had directed that direct relief of reduction in the prices of oil, flour and LPG cylinders should be passed on to the common people.\nThe prime minister, she said, had started consultations related to the budget with the departments concerned and he had formed two sub-committees regarding agriculture.\nThe committees, she said, would be responsible for ensuring supply of quality seeds, import of modern machinery and equipment, and ensuring their availability.\nThe prime minister directed that all agriculture tube-wells should be fully solar powered and he directed to ensure the best support price of wheat for the prosperity of farmers.\nShe said the scheme to provide direct subsidy on fertilizer to farmers would be implemented in an effective way. The committees would submit their report to the Prime Minister within three days. He also directed to work on oil seeds policy for cooking oil production in Pakistan, she added.\nShe regretted that the previous government changed the name of the youth programme which was launched by the former prime minister Nawaz Sharif, but failed to empower the youth through their socioeconomic development.\nThe programme had been revived to distribute to 100,000 laptops among the youth, she said, adding the young entrepreneurs continued their work with any disruption during the coronavirus pandemic just due to the laptop scheme which was launched in line with the vision of Prime Minister Shehbaz Sharif.\nShe said loans amounting to Rs 25 billion had been disbursed among young agriculturalists and the programme for skill development of 100,000 students was launched by the coalition government soon after coming into power.\nThe one-year programme had concluded with seed money of Rs 4 billion for the skill development of young people, she added.\nThe minister said the Nawaz Sharif led government was inherited a ruined economy and extreme inflation in 2013, but it boosted economic growth to 6 per cent and reduced inflation to 2 per cent.\nThe PTI came into power in 2018 with the sole purpose to create chaos and anarchy in the country, she regretted.\nShe said the whole nation bore the brunt of Nawaz Sharif’s ouster on the pretext of fake cases. Nawaz Sharif’s policies led to installation of 14,000 MW electricity and made the country terrorism free.\nOn the other hand, PM Shehbaz Sharif, who was chief minister of Punjab at that time, introduced people-friendly policies which led to building of road and infrastructure, mass transit system and empowerment of youth, she added.\nMarriyum challenged those who demanded election to compare 10-year performance of Shehbaz Sharif in Punjab and that of the PTI’s in Khyber Pakhtunkhwa where the Counter-Terrorism Department was shut down, youth was brainwashed and accountability was completely compromised.\nShe said politics should be pursued on the basis of performance instead of conspiracies.“Economy cannot be switched on or switched off, she said, adding it took time to improve economic indicators.”\nShe said the PTI government reversed all the progress made during four years of Nawaz Sharif and now asking us to undo the mess they left during their last four years.\n“We have made payment of sovereign and multilateral liabilities and bonds,” she said, adding external debts amounting to $15.31 billion and domestic loans of Rs 3,513 billion had been paid, she added.\n“We have the will, experience and intention to put the country on the path of progress,” she remarked.",
  "retrievedAt": "2025-08-11T08:35:51.846Z"
}
