{
  "title": "KIIR chair seeks UNSG’s urgent intervention to prevent Yasin Malik’s unlawful execution",
  "link": "https://www.app.com.pk/national/kiir-chair-seeks-unsgs-urgent-intervention-to-prevent-yasin-maliks-unlawful-execution/",
  "date_published": "2023-06-01T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP): Veteran rights activist and chairman of the Kashmir Institute of International Relations (KIIR) Altaf Hussain Wani has sought the UN secretary-general Antonio Guterres’ urgent intervention to prevent the unlawful execution of the Kashmiri leader Yasin Malik who has been languishing in India’s Tihar jail.\nIn his letter addressed to the UN chief, the KIIR chairman, highlighting the Indian government’s nefarious designs, said that the Hindu nationalist regime led by Modi was using Kashmiris as scapegoats to advance its communal agenda and appease its vote bank.\nHe said that the National Investigation Agency (NIA)’s plot to seek the death penalty for Yasin Malik was part of the Bharatiya Janata Party (BJP) government’s plan to regain popularity and win general elections scheduled to be held in 2024.\nReferring to the plight of the illegally detained JKLF chairman Muhammad Yasin Malik and the threat to his life, he said, “Malik, who is reckoned as one of the top rank campaigners of Kashmiris’ right to self-determination, has already been sentenced to life imprisonment by an Indian court on 25th May 2022 on charges widely believed to be politically motivated”.\nThe government of India, which deprived Malik of his fundamental right to defend himself in the court of law after implicating him in a concocted case, is now hell-bent on eliminating him by using its judiciary”, the letter said, adding that India has a long history of using the judiciary and other state apparatus to suppress the political and democratic dissent and legitimate political voices in the occupied Kashmir.\n“Indian courts that work on the whims and fancies of the ruling elite have miserably failed to dispense justice to Kashmiris”, the letter said.\n“The Indian investigation agency’s bid to seek the death penalty for Yasin Malik is a matter of serious concern as it poses a grave threat to the life of a man who has been leading a nonviolent movement, advocating for the peaceful resolution of the Jammu and Kashmir dispute”, the communique stated.\nTerming Malik as an uncompromising campaigner for Kashmiris’ political and diplomatic rights, Wani underlined the fact that the JKLF chief was being victimized just for raising his voice for the voiceless Kashmiris.\n“Yasin Malik is being targeted merely for his political beliefs. His only crime is that he refused to accept the Indian dictates on Kashmir”, he said.\n“There is ample evidence which suggests that the Hindu nationalist government led by Narendra Modi has been exploiting the state institutions such as the NIA to suppress dissent and consolidate power through a far-right agenda”, he maintained.\n“There is a genuine concern that the apartheid regime, which thrives on communal divide and anti-Muslim sentiment, could use the unlawful execution of the Kashmiri leader Yasin Malik- as a means to regain popularity and to bolster chances of retaining power in the upcoming Parliamentary Elections being held in 2024”, he said.\n“Under these extremely adverse circumstances, it is essentially important that the voices of peace and defenders of human rights should unite to advocate for Yasin Malik and challenge the malicious intentions of Modi and his government”, the communique further said.\nThe KIIR chief appealed to the UN secretary general to take swift and decisive action by demanding the Indian government to stop using its judiciary as a weapon to punish Kashmiri leaders who have been waging a peaceful struggle to achieve the fundamental rights guaranteed to Kashmiris by no less an authority than the United Nations.\nWani said that the UN secretary general’s urgent intervention in this matter would be instrumental in preventing the potential execution of Yasin Malik and upholding the principles of justice and human rights.\nPertinently, similar letters highlighting the plight of the JKLF chief and other Kashmiri prisoners have been dispatched to world human rights bodies and other UN special rapporteurs seeking their urgent attention towards the matter.",
  "retrievedAt": "2025-08-11T08:36:11.463Z"
}
