{
  "title": "Indonesian Embassy to organize “A Night at Lahore Museum” on June 17",
  "link": "https://www.app.com.pk/national/indonesian-embassy-to-organize-a-night-at-lahore-museum-on-june-17/",
  "date_published": "2023-06-01T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP): The Embassy of the Republic of Indonesia in collaboration with the Lahore Museum will organize a week-long photo exhibition titled” A Night at Lahore Museum: Tracing the Confluence of Civilizations Between Indonesia and Pakistan”, on June 17 (Saturday) at Lahore Museum.\nTalking to the officials of the Lahore Museum and journalists in Islamabad, the Ambassador of Indonesia Adam Tugio warmly invited the Pakistani friends to the Exhibition and to celebrate the rich cultural heritage of the two Muslim brotherly countries.\n“Let’s embrace the spirit of friendship and witness together the exciting display of cross-cultural connectivity and convergence of Indonesia-Pakistan civilization through past and present journeys”.Ambassador of Indonesia Adam Tugio will inaugurate the exhibition.\nThe exhibition will highlight the spread of Buddhist and Islamic civilization from ancient Gandhara to the archipelago, the territories known as Indonesia today, initially in search of spices, the golden green at that time. Through the display of selected photographs and artworks, the Exhibition provides an excellent opportunity for the visitors and art lovers to witness the impact of cultural influences across continents.\nThey manifested in the form of interesting similarities in art, traditions and architecture of the two great countries during the course of history. Moreover, Indonesian Batik and Pakistani Ajrak art will also be displayed in the exhibition, which are not only colorful and attractive but also carry cultural and historical significance, said a press release issued here on Thursday.\nDirector of the Lahore Museum, Muhammad Usman appreciated the initiative of this joint collaboration by the Embassy to strengthen the two-way historic religious cultural linkages and assured full cooperation from Lahore Museum to make this event successful and attractive for all the visitors.\nIt is pertinent to mention here that the week-long exhibition will be opened for general public from June 18-24, 2023, featuring a meticulously curated collection of photographs and videos to provide a fresh perspective on the cross-cultural connectivity between the two biggest Muslim populated countries from past to present time.",
  "retrievedAt": "2025-08-11T08:36:04.732Z"
}
