{
  "title": "100,000 laptops to be awarded among talented students of public sector universities",
  "link": "https://www.app.com.pk/national/100000-laptops-to-be-awarded-among-talented-students-of-public-sector-universities/",
  "date_published": "2023-06-01T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 01 (APP): As many as 100,000 laptops will be awarded to the talented students of public sector universities/higher education institutions across the country under the Prime Minister’s Laptop Scheme (Phase-III).The scheme, announced by the Prime Minister, aimed at providing high-quality latest laptops to young and talented students on merit through an online and transparent system.\nAccording to the Higher Education Commission (HEC), students can apply through a dedicated online portal www.pmyp.gov.pk till June 20, 2023.\nThe purpose of this scheme was to bring improvement in the quality of science and technology education, including ICT.\nThe project will also increase productivity and efficiency by providing advanced IT technologies to the students.It is pertinent to mention that in the past, two similar schemes have been successfully executed under the same programme executed by the HEC, Pakistan.\nThe eligibility criteria for awarding laptops to the students is that they must be studying in Public Sector Universities/ Degree Awarding Institutes duly recognized by HEC. Students must be enrolled till June 30, 2023.\nFor students who are enrolled in any five-year programme, they must be admitted after June 30, 2018, and before June 30, 2023; while for the four-year programme the students must be admitted after June 30, 2019 and before June 30, 2023.\nSimilarly, students enrolled in a two-year programme must be admitted after June 30, 2021, and before June 30, 2023.\nFor the 3.5, 2.5 and 1.5 years programmes, the starting admission dates are December 31, 2019, December 31, 2020, and December 31, 2021, while the end date is the same for all three programmes i.e. June 30, 2023.\nStudents enrolled in PhD/MS/ MPhil or equivalent 18-year programmes should not be enrolled in a weekend programme.\nStudents’ eligibility and enrolment status as defined above shall be validated on the day of distribution of laptops at the respective HEI. Only those students who have applied timely through an online portal and selected as per specified criteria will be awarded the laptop.\nThe laptops will be distributed on a merit basis to students of all degree programmes including BS (16 Years), MS/MPhil (18 Years) and PhD. Laptops’ share will be calculated on an enrollment basis in each degree programme.\nStudents must have secured 70 per cent marks in the semester system, and 60 per cent marks in the annual system.CGPA/ GPA to Percentage conversion shall be governed by the HEC-defined formula. The top meritorious students against the allocated quota of each department/ programme will be considered for the award of laptops as per their respective quota (year-wise or semester-wise).\nFor application and more information, students can visit https://laptop.pmyp.gov.pk/.",
  "retrievedAt": "2025-08-11T08:36:09.969Z"
}
