{
  "title": "PM invites Japanese companies to invest in Pakistan",
  "link": "https://www.app.com.pk/national/pm-invites-japanese-companies-to-invest-in-pakistan/",
  "date_published": "2023-06-01T15:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 1 (APP):Prime Minister Shehbaz Sharif Thursday said Pakistan considered Japan as an important partner for its progress and prosperity and Japanese companies should avail the immense opportunities for investment in Pakistan.\nThe PM was speaking to President Toyota Asia Yoshiki Konishi and Chief Executive Officer of Indus Motors Ali Asghar Jamali who called on him here.\nJapan’s ambassador to Pakistan Mitsuhiro Wada, Vice Chairman Toyota Indus Motors Shinji Yanagi, Minister for Finance Ishaq Dar, Minister for Industries and Production Makhdoom Murtza Mehmood, Advisor to PM Ahad Cheema, Special Assistants to PM Jehanzeb Khan and Tariq Bajwa and high ranking officials attended the meeting.\nIn a briefing, the prime minister was told that Toyota Indus Motors for the first time established a unit for production of hybrid vehicles in Pakistan with an investment of $100 million. Shehbaz Sharif welcomed the project of Toyota to produce hybrid vehicles in Pakistan.The production of hybrid vehicles in Pakistan would decrease the import bill resulting in saving of precious foreign exchange, he said adding the government was providing all available facilities to the industries for investment in modern technologies in the country.The Japanese ambassador said leading Japanese companies were desirous of further investment in Pakistan.\nDuring the briefing, it was told that in the current year from July, Toyota Indus Motors would start export of spare parts of vehicles and these exports would make Pakistan a part of the global supply chain.\nThe PM said exports of spare parts should be enhanced by taking benefit of the capacity of the engineering sector in the country. He said it should be ensured that the spare parts for the vehicles to be sold in Pakistan should be manufactured locally. The participants of the meeting lauded the prime minister for his government’s business friendly policies.",
  "retrievedAt": "2025-08-11T08:35:57.683Z"
}
