{
  "title": "Israel changes its story on killing of Palestinian paramedics - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: The Israeli military has provided new details that changed its initial account of the killing of 15 emergency workers near the southern Gaza city of Rafah on March 23, but said investigators were still examining the evidence.\n\nRed Crescent and UN officials said that 15 of the 17 paramedics and emergency workers from the Red Crescent, the Civil Emergency service and the UN were shot dead and buried in a shallow grave by Israeli troops on March 23.\n\nThey said the paramedics were dispatched to respond to reports of injuries from Israeli air strikes. Bodies of the paramedics were found a week later by officials from the United Nations and the Palestinian Red Crescent. An emergency worker is still missing.\n\nThe Israeli military initially claimed that soldiers had opened fire on vehicles that approached their position “suspiciously” in the dark without lights or markings. It said they killed nine militants from Hamas and Islamic Jihad who were travelling in Pale­stinian Red Crescent vehicles.\n\nBut video recovered from the mobile phone of one of the dead men and published by the Palestinian Red Crescent showed emergency workers in their uniforms and clearly marked ambulances and fire trucks, with their lights on, being fired on by Israeli soldiers.\n\nThe only known survivor of the incident, Palestinian Red Cres­cent paramedic Munther Abed, also said he had seen soldiers opening fire on clearly marked emergency response vehicles.\n\nAn Israeli military official said late Saturday the investigators were examining the video and conclusions were expected to be presented to army commanders.\n\nHe said the initial report received from the field did not describe lights but that investigators were looking at “operational information” and were trying to understand if this was due to an error by the person making the initial report.\n\nThe UN and Palestinian Red Crescent have demanded an independent inquiry into the killing of the paramedics.\n\nRed Crescent and UN officials said that apart from Abed, who was detained by Israeli troops for several hours before being released, another worker is still missing.\n\nThe UN said last week that available information indicated one team was killed by Israeli soldiers and other emergency and aid crews were killed one after another over several hours as they searched for their missing colleagues.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/070820210de1bcd.jpg",
  "retrievedAt": "2025-08-25T14:02:38.711Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902569/israel-changes-its-story-on-killing-of-palestinian-paramedics",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:19.000Z"
}
