{
  "title": "Hard or competent state? - Newspaper - DAWN.COM",
  "author": null,
  "content": "THERE are several aspects to the debate that has been going on in the media about a ‘hard state’.\n\nWhy, despite an array of coercive instruments and hard power available to the Pakistani state, has it been unable to achieve the core goals of security, stability and the state’s financial solvency? A hard state is not necessarily a strong or competent one. Perhaps it is preferable to use the notion of a competent or strong state instead of a ‘hard state’.\n\nA competent state would mean one that is able to effectively perform the core functions of a strong state — collect taxes to run the state, ensure rule of law, maintain order, control the borders and deliver public goods. It is also one in which the instruments of governance are robust and institutions fit for purpose. Trust is another essential attribute. A well-functioning, trusted state is what constitutes a competent state. Judged against these criteria, Pakistan has a long way to go before it can be considered a strong and competent state. That is a goal to aim for, if not an imperative for the country.\n\nAlso relevant to this discussion is the recognition that power and authority are not the same thing. People often deem power and authority to be synonymous. But power, however ‘hard’, does not necessarily confer authority.\n\nAuthority is where power, legitimacy and public purpose intersect. Authority rests on the legitimate exercise of power in the public interest that goes beyond the narrow interests or self-preservation of the ruling elite. The ‘rightful’ use of power, deployed to promote a public agenda, bestows authority. Authority is thus more a relationship (with the governed) than a capacity. It is based on consent, willingly given, as well as trust, not coercion. Authority also depends critically on credibility.\n\nIf one applies these concepts to the present state of play in the country, it becomes more than apparent how the state and those running it come up short. As the ongoing debate about ‘hardening the state’ has been generated by the grim situation in Balochistan, it needs to be considered at length.\n\nThe state’s managers have mostly used kinetic means to establish peace in a province that has long been characterised by historical grievances, popular discontent, poor governance and a sense of injustice with both the kind of unrepresentative rule thrust upon it and the iniquitous allocation of resources. Today, it is in turmoil and in the midst of a raging insurgency that the state’s managers are struggling to contain and defeat.\n\nCoercive actions do not ‘harden’ the state but harden public opinion against the power elite.\n\nThere is little doubt there is foreign involvement in fomenting terrorist violence and supporting militant groups in Balochistan. But it is the fertile ground created by flawed policies over the decades that has enabled hostile powers to exploit the situation. Certainly, this aspect of the security threat has to be tackled, but it means creating the internal conditions to deter and prevent external interference.\n\nThe state has not lacked hard power resources and instruments to use against militant violence in Balochistan. They have been deployed over the years in the form of repeated military operations and crackdowns. But on their own and in the absence of meaningful non-kinetic efforts — political, economic, social — to address the underlying drivers of public disaffection, they have ended up unintendedly exacerbating the situation.\n\nIt is counter-insurgency 101 that insurgents have to be isolated and the trust and support of the local community won. But in conflating militants with Baloch nationalists and casting every dissident group and political leader as traitors or abettors of terrorists, the state’s policy contradicts the basic principle of how to fight militancy, which is not to increase the number of adversaries.\n\nEngaging with the grievances that militants exploit is essential for any effective counter-insurgency strategy. But, instead of doing this, the recent crackdown on the Baloch Yakjehti Committee and arrests of its leaders and human rights activists have only compounded the explosive situation. It risks further radicalising opinion in the province.\n\nForcibly preventing a protest march to Quetta led by former chief minister and leader of the Balochistan National Party, Akhtar Mengal, to press for release of detainees, made matters even worse. The Jamhoori Watan Party also accused Balochistan’s authorities of using force to block its protest. Leaders of several political parties gathered in Quetta to condemn government curbs on protest rallies and sit-ins. All this is putting the federation under greater strain.\n\nThe use of coercive power in a political vacuum with unrepresentative provincial governments in place — including the present one — has meant state actions have lacked the authority and legitimacy needed to elicit public support. Legitimacy is built by meeting people’s needs and aspirations. Long festering, unfulfilled demands of Baloch groups and citizens — as, for example, on missing persons — have deepened the sense of public alienation. This has built an environment in which the use of hard power has proven to be counterproductive.\n\nThis is not to say law-enforcement actions are not needed to counter militant violence. Of course they are. They are necessary but not sufficient to deal with the multiple dimensions of the complex situation in Balochistan. They have to be undertaken with the consent of the local population, whose grievances have to be addressed. Without building trust, observing human rights and winning hearts and minds, no number of coercive actions by a ‘hardened state’ will succeed in defea­ting militants and establish peace and stability.\n\nIf a comprehensive national security strategy requires mobilisation of all elements of national power, why does state policy not involve that in Balochistan? To see the situation there only through a law-and-order prism is to denude counter-militancy strategy of the necessary political, economic, social and strategic communication dimensions. Without a strong political dimension in the state’s response, that meets the requirements of legitimacy, peace and security will remain elusive.\n\nElsewhere, across the country, the panoply of hard power and coercion being used against the political opposition and in curbing the media and muzzling dissent is strengthening neither the government nor the state. Far from ‘hardening’ the state, it is hardening public sentiment against the power elite and further eroding trust in state institutions. A strong state is built by empowering citizens, not repressing them.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f3252932798.jpg",
  "retrievedAt": "2025-10-12T02:23:50.569Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902593",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:13:02.000Z"
}
