{
  "title": "Pakistan envoy warns ‘all deals off’ if Afghan Taliban don’t comply with Islamabad’s concerns - Pakistan - DAWN.COM",
  "author": null,
  "content": "Ambassador Muhammad Sadiq Khan, Pakistan’s special envoy for Afghanistan, on Monday warned that “all deals with Afghanistan are off” if the Taliban rulers failed to act on Islamabad’s growing concerns regarding terrorism emanating from Afghan soil.\n\nPakistani officials have long been saying that leaders of the armed groups operate from Afghan soil to launch attacks in Pakistan. Kabul denies the assertions.\n\n“TTP (Tehreek-i-Taliban Pakistan) is a challenge, a big challenge for us. It cannot be tolerated because our young kids and boys are getting killed every day. Martyrdom has become so common in certain areas. That is sort of, it would be criminal to ignore that. And we have to find a solution.\n\n“Afghanistan will have to work with us on this. If they are not working with us, then all deals are off. Nothing could have happened. There would be no further progress on anything,” the Pakistani special envoy said while addressing a seminar at the Islamabad Policy Research Institute (IPRI).\n\nHis comments came nearly two weeks after he held talks with Afghan Taliban ministers and senior officials on a wide range of issues, focusing on the outlawed TTP and other groups blamed for violence in Pakistan.\n\nKhan had travelled to Afghanistan in December last year, days after he was reappointed the country’s special envoy to the neighbour.\n\n“Pakistan could be very helpful to Afghanistan if we could stop terrorism coming from the other side of the border. I totally would be pragmatic and honest about it,” he further said.\n\n“We have an issue in Pakistan also, that is one part. But people coming from Afghanistan is also an issue that has to be stopped, that has to be realised,” Sadiq pointed out.\n\nPakistan has been asking the Taliban government since its takeover in August 2021 to take action against the TTP and other terrorist groups and stop them from crossing the border.\n\nThe Taliban government hosted talks between Pakistan and the TTP leaders in Kabul in 2022. However, the talks failed and the then-government put a stop to negotiations.\n\n“The solution is not necessarily killing people, the solution is not necessarily arresting people and handing them over to Pakistan. The solution is restraining them, the solution is containing them, on which I think no one should have any objection,” the ambassador said.\n\nThe Taliban government has not responded to the latest remarks by the Pakistani special envoy. However, it does not accept Pakistan’s stance on the presence of TTP on Afghan soil.\n\nKhyber Pakhtunkhwa Governor Faisal Karim Kundi also addressed the seminar on “A Holistic Appraisal of the Security and Governance Challenges of Khyber Pakhtunkhwa” at a local hotel.\n\n“While security forces have made significant sacrifices to bring peace, the issues are still at large from terrorism, corruption, poverty, smuggling, drug trafficking and political issues,” Governor Kundi said.\n\n“In this regard, a solid civil-military pact is required to resolve these issues; there is a need for sustainable governance, one that is accountable and efficient,” he further said.\n\nHe said the empowerment of local governments was essential, and the financial aspects and systems must be managed by those with relevant expertise.\n\nFormer KP chief minister Amir Haider Khan Hoti emphasised the need for people’s ownership to fight militancy.\n\n“We need a national consensus to fight terrorism and treat it as an issue above politics,” he said.\n\nMeanwhile, former senator Sitara Ayaz said on the occasion: “It is unfortunate that we have been fighting for over two decades and still embroiled in fighting and infighting.\n\n“We have been unable to deal with the post-colonial impacts, and without understanding the Fata and KP’s cultural and historical dynamics, we tried for a merger.”\n\nLt Gen (retired) Hasan Azhar Hayat said, “We are losing the social space in KP. We need to identify the needs of the people of KP. People are tired of operations, and they also don’t want terror outfits like the Taliban in the area.\n\n“We need to facilitate the development and empowerment of the people and youth of KP. Engage the locals and tribal — the centre cannot make good policies without the input of locals,” he said.\n\nIPRI President Dr Raza Muhammad said in his opening remarks that “over the years, despite fighting and resisting troubles, problems of terrorism persisted.\n\nHe said Pakistan’s strategic location was extremely significant within the region since it was rich in natural resources from north to south. “Unfortunately, the whole belt is unstable. External forces of chaos thrive when there is internal instability. The grievances of the people are exploited by external and internal forces,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/071957465af86f4.jpg",
  "retrievedAt": "2025-08-25T14:01:54.836Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902722/pakistan-envoy-warns-all-deals-off-if-afghan-taliban-dont-comply-with-islamabads-concerns",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T15:15:41.000Z"
}
