{
  "title": "Finance: Urging financial prudence - Newspaper - DAWN.COM",
  "author": null,
  "content": "Tax collection in Pakistan remains below its potential, yet growth in tax revenues over the past decade has been notable. In the fiscal year 2013-14, total tax revenues stood at Rs2.56 trillion. By FY24, this figure had risen to Rs10.09tr, according to the Ministry of Finance. This increase represents a compound annual growth rate of 14.68 per cent.\n\nHowever, this impressive growth has come at a cost to citizens. Nearly every good and service used by Pakistan’s 242 million people is now taxed — from fresh milk and bread to petrol, mobile phone usage, and dining at restaurants.\n\nOver the past decade, the focus has remained disproportionately on indirect taxes rather than direct taxes, disproportionately burdening the poor and unemployed. Despite this, successive governments have failed to meet their total expenditure through tax revenues. Only a fraction of total revenue has come from non-tax sources, such as profits earned by the State Bank of Pakistan (SBP), forcing the government to rely heavily on domestic debt.\n\nThe lack of innovative revenue-generating strategies and the failure to create a conducive economic environment has made it difficult for governments to secure sufficient non-bank borrowings. As a result, each administration has continued excessive borrowing from banks, crowding out the private sector from access to credit.\n\nWithout genuine fiscal discipline, the country will remain trapped in a vicious cycle of debt and economic stagnation\n\nThis has, in turn, hampered industrial and business activity, reduced productivity, increased unemployment, and kept Pakistan’s exports stagnant. During FY24, the government’s borrowings from commercial banks for budgetary support stood at Rs7.48tr, according to the SBP. In contrast, banks’ net lending to the private sector totalled Rs513 billion.\n\nThis unsustainable pattern persists in the current fiscal year and is unlikely to change in the near future. Despite making lofty claims about expenditure control, successive governments have failed to demonstrate genuine fiscal discipline.\n\nThe recent increase of up to 188pc in the salaries and perks of cabinet members, just weeks after announcing cost-cutting measures, is a clear example. The purchase of luxury vehicles for senior government officials, particularly in Punjab and Sindh, further underscores the lack of commitment to financial prudence.\n\nIn FY14, the government’s current expenditures stood at Rs4tr, while tax collection amounted to Rs2.56tr. By FY24, current expenditures had ballooned to Rs18.57tr, whereas tax revenues reached Rs10.09tr. This widening gap raises serious concerns. If the government had been sincere about controlling expenses in FY14 and if the establishment had genuinely supported this effort, why has the gap between expenditures and tax revenues persisted despite substantial growth in tax collection?\n\nClearly, the real issue has not been the underperformance of tax collection alone but the government’s tendency to spend beyond its means has also played a role.\n\nIt has become commonplace to point out that a significant portion of government spending goes toward domestic debt servicing. While this is partially true, it does not tell the whole story. The rising cost of domestic debt servicing is driven not only by higher interest rates but also by the relentless accumulation of fresh debt.\n\nDue to continued reckless borrowing, the cost of domestic debt servicing has surged from Rs1.15 trillion in FY14 to approximately Rs8.16tr in FY24\n\nIn FY14, the government’s total domestic debt stood at Rs10.907tr. By FY24, it had skyrocketed to Rs47.16tr, according to SBP data. Due to continued reckless borrowing, the cost of domestic debt servicing has surged from Rs1.15tr in FY14 to approximately Rs8.16tr in FY24.\n\nUnchecked government spending over the years has pushed Pakistan deeper into a debt trap, crippling the private sector, increasing dependence on domestic and foreign borrowing, and preventing sustainable economic growth. The economy has struggled to achieve even a 5pc annual growth rate for five consecutive years, while poverty continues to rise.\n\nAcquiring foreign debt has always been and still is a huge challenge. The International Monetary Fund (IMF) bailout packages have significant political conditions. The World Bank and other international financial institutions demand increased transparency in projects they fund, and foreign investors assess Pakistan’s geopolitical risks before committing capital.\n\nIn contrast, generating domestic debt has never been a challenge. Pakistani banks are always willing to lend to the government, and the SBP routinely injects liquidity into the interbank market through open market operations (OMOs) to facilitate these borrowings.\n\nThis cycle has continued for years. However, the question remains: how long can this practice be sustained? What would happen if the IMF imposed restrictions on the frequency of SBP’s OMOs or the amount of liquidity it injects into the banking system before the government securities’ auctions?\n\nThe Fund has already prohibited the government from borrowing directly from the SBP because such borrowing is more inflationary than obtaining loans from commercial banks.\n\nPakistan’s current hybrid regime must urgently address these structural issues. Without genuine fiscal discipline and a shift in economic policy toward sustainable revenue generation and controlled expenditure, the country will remain trapped in a vicious cycle of debt and economic stagnation.\n\nPublished in Dawn, The Business and Finance Weekly, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:57.391Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902523",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:33.000Z"
}
