{
  "title": "Oil markets battered and bruised - Business - DAWN.COM",
  "author": null,
  "content": "Global markets are in a spin. Panic has seeped in. After registering a steep fall on Thursday (March 3), the day after President Trump’s tariff announcement, markets across the globe continued their freefall on Friday (March 4).\n\nThis was carnage, a bloodbath. The S&P 500 dropped six per cent, the Nasdaq slid 5.8pc, and the Dow Jones Industrial Average fell 2,231 points. The massacre was all around. The market-wide toll from the two-day tariff rout surged to a record $6.6 trillion, some media reports asserted. The crude oil market was no exception.\n\nThis all began with the broadside tariff blitz by President Trump, taking the US tariff barriers to their highest level in more than a century, slapping blanket duties on all US trading partners, including Pakistan, sparking fears of a global trade war and the real possibility of a global recession just around the corner.\n\nYes, energy was exempt from the Trump tariffs. Still, markets didn’t need much convincing. Oil markets began plunging as soon as the markets opened Thursday after Trump’s tariff announcement a day earlier.\n\nTrump’s import tariffs, Opec+‘s unwinding of production cuts and China’s retaliatory actions have wiped off $10 per barrel from global oil prices, some reports say\n\nOil prices plunged 7pc on Friday, settling at their lowest in over three years, with the global benchmark Brent futures settling at $4.56, or 6.5pc, lower at $65.58 a barrel, while US West Texas Intermediate crude futures lost $4.96, or 7.4pc, to end at $61.99. At the session low, Brent fell to $64.03, and WTI hit $60.45, their lowest in four years.\n\nThe S&P 500 Energy Index, composed of US oil and gas companies, plunged 16pc on Thursday and Friday. Big declines were noted by APA Corp., Diamondback Energy Inc. and Baker Hughes Co., as all fell more than 20pc.\n\nThis was a free fall, changing the global energy landscape and geopolitics, from the US to the Middle East. But even before President Trump’s sweeping tariffs, the escalating trade war was stoking fears of a global slowdown in economic activity that would erode crude demand.\n\nTrump’s tariffs were one of the reasons for this battering of the crude oil markets. But several other factors were already in play.\n\nLiterally out of nowhere, the Organisation of the Petroleum Exporting Countries (Opec) and its allies, including Russia, announced increasing their output three times the originally planned amount. The group now aims to return 411,000 barrels per day (bpd) to the market in May, up from the previously planned 135,000 (bpd). With markets possibly heading into a recessionary phase after the Trump bombshell, absorbing such an increase in output could be very difficult. That, too, contributed to the softening of the markets.\n\nOfficially, Saudi Arabia pushed to triple the production increase in an apparent bid to punish some of the group’s members, including Kazakhstan and Iraq, who were persistently flouting their output quotas.\n\nSome, however, remain sceptical of this explanation. President Trump has been insisting that Opec should open its taps further.\n\nThe reason for the demand was obvious. Trump needed to fulfil his election pledge of lower gas (petrol) prices at the next-door gas station. At this moment, with much at stake on the geopolitical front, the Saudi-led Opec+ could not have afforded to offend Trump. Hence, they gave in to the demand, many are asserting.\n\nThis is but a risky gamble for Opec+. Many of its members require high oil prices to cover government spending. Saudi Arabia, for instance, needs oil above $90 a barrel, according to the International Monetary Fund (IMF), and the less-than-expected revenues from oil have already forced Riyadh to scale back investment in some of the projects that are at the heart of Crown Prince Mohammed bin Salman’s vision to transform the kingdom’s economy.\n\nIraq also needs prices above $90 a barrel, while Kazakhstan needs more than $115 a barrel, the IMF estimates. It may not be easy for the oil producers to sustain lower prices for long.\n\nThe possibility of a settlement of the war between Russia and Ukraine is also raising the prospect of more Russian oil being exported, adding to the glut. Meanwhile, a ruling by a Russian court that the Caspian Pipeline Consortium’s Black Sea export terminal facilities should not be suspended also pressured prices lower. That decision could avert a potential fall in Kazakhstan’s oil production and supplies.\n\nThe combination of lower oil prices and the market glut also threatens to derail Trump’s push for US drillers to ramp up production. It goes against the Trumpian desire to increase US output further. “I don’t think ‘drill, baby, drill’ was ever a near-term reality for US producers,” Leo Mariani, an analyst at Roth Capital Partners LLC, said in a media phone interview. “Now it’s not even a consideration.”\n\nAnd in a lethal blow to the oil markets, while retaliating to President Trump’s sweeping tariffs, the Chinese Finance Ministry announced that from April 10, it would impose additional tariffs of 34pc on all goods produced in the US, concurrently adding seven rare earth minerals to Beijing’s export controls list.\n\nThe combined effect of Donald Trump’s import tariffs, Opec+‘s ‘inopportune’ decision to speed up the unwinding of production cuts and China’s retaliatory actions has wiped off $10 per barrel from global oil prices, some reports say.\n\nThe IMF is now warning that US import tariffs and reciprocal measures triggered by them pose a ‘significant risk’ to the health of the global economy, potentially indicating that its 3.3pc global GDP growth forecast for 2025-2026 could soon be cut lower.\n\nOil analysts are now beginning to re-evaluate their expectations for 2025 and 2026. Goldman Sachs Group Inc. has lowered its year-end price forecast of Brent crude by $5, to $66 a barrel. Enverus has slashed its demand growth model by more than a third. The UBS Group AG, which at the beginning of the year had projected global crude oil demand to grow by 1.1 million bpd, has now cut it by nearly 50pc.\n\n“The moment that President Trump put the tariffs that were hammering on Canada almost two months ago, we had already downgraded our forecast,” said Al Salazar, head of macro oil and gas research at Enverus. “The timing of the Opec announcement felt like them piling on.”\n\nMuch now would depend on how long the tariffs and the retaliatory tariffs remain. These are going to hurt global demand, perhaps permanently. The overall flow of goods and services is in for a detour. As Prime Minister Carney of Canada says, the world “will not be the same” henceforth.\n\nSome feel the tariffs and counter-tariffs may not last long, yet they will leave a lasting scar on the psychology of the global markets. Until then, oil markets are expected to stay mellow. And in the meantime, oil-importing countries like Pakistan should heave a sigh of relief.\n\nPublished in Dawn, The Business and Finance Weekly, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:24:50.454Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902529/oil-markets-battered-and-bruised",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:32.000Z"
}
