{
  "title": "The vicious trade war worsens - Business - DAWN.COM",
  "author": null,
  "content": "“Cynics were delighted at the spectacle of a country trying to collect debts from abroad and, at the same time, shutting out the import goods that could alone have provided the payment for those debts.”\n\nPaul A. Samuelson wrote this in his widely read textbook “Economics”, published in 1948, at a time when memories of the devastating impact of the Smoot-Hawley Tariff Act of 1930 on global trade were still fresh. Created to protect US farmers and businesses from foreign competitors, the act increased tariffs on foreign imports to the US by about 20 per cent. Over 25 countries responded by increasing their own tariffs on American goods.\n\nInternational trade plummeted drastically, resulting in a worldwide decline of 66pc between 1929 and 1934, contributing to the ill effects of the Great Depression. Both US exports and imports dropped substantially.\n\nAlmost a century later, President Donald Trump has slapped much steeper import taxes of up to 50pc — this includes a 10pc baseline across-the-board tariff on all foreign countries that came into effect last week — on 60 US trading partners to reduce America’s trade deficit and bring back manufacturing jobs by strong-arming the trading partners.\n\nMost experts insist that the outcome of Trump’s vicious trade war would be much more disruptive and damaging for the globalised trade order than the century-old legislation.\n\nThe (average) US tariff rate on all imports is now around 22pc from 2.5pc in 2024. That rate was last seen around 1910. Fitch Ratings said, “Many countries will likely end up in a recession.”\n\nFears of global recession abound as Pakistan and other nations reel from the sudden announcement of steep US reciprocal tariffs\n\nThat the global financial markets tumbled as Trump waved a list of selected countries running trade deficits with the US on what he had dubbed ‘Liberation Day’ underscored the worst fears of his trade war on friends and foes morphing into another global recession.\n\nReciprocal tariffs are an outcome of Trump’s deep-seated belief that America has been “ripped off” by “both friend and foe alike”, as well as his desire to reshape the global trading system in favour of American interests. The baseline 10pc tariff affects even countries like the UK, with which the US is running a trade surplus.\n\nThough Trump has hinted at using his punitive ‘reciprocal’ tariffs to get trade concessions from allies and rivals alike, no one sees the world coming back from it — at least not anytime soon. The multilateral free trade system is dead for now as the protectionist industrial policy takes hold in the US, the largest consumer in the world.\n\nThis is a game changer, not only for the US economy but for the global economy, said Fitch Ratings. “You can throw most forecasts out the door if this tariff rate stays on for an extended period of time.”\n\nEuropean Commission President Ursula von der Leyen has called the measure a “major blow to the world economy”. “The consequences will be dire for millions of people around the globe,” she said, adding that groceries, transport and medicine will cost more.\n\nMany said the magnitude of the rollout — both in scale and speed — wasn’t just aggressive; it was a full-throttle macro disruption. While some US trade representatives welcomed the protection for domestic industries, others expressed concern that higher costs could squeeze already tight margins for manufacturers and drive up prices for consumers.\n\n“The high costs of new tariffs threaten investment, jobs, supply chains and, in turn, America’s ability to outcompete other nations and lead as the pre-eminent manufacturing superpower,” said Jay Timmons, president and CEO of the National Association of Manufacturers.\n\nThe new US trade tariffs are feared to “sap yet more vigour from a world economy barely recovered from the post-pandemic inflation surge, weighed down by record debt and unnerved by geopolitical strife”.\n\nThe emerging global landscape in the wake of the US tariff onslaught is projected to produce new economic alignments among countries. Boyan Chukov, a veteran Bulgarian commentator on international relations, recently pointed out that US trade protectionism is shaking the foundation of transatlantic economic cooperation.\n\nThe situation may push Europe and China toward closer economic cooperation. A European Commission official recently said China is an important partner of the European Union (EU), and the EU is willing to deepen economic and trade cooperation and resolve differences (with Beijing) through dialogue.\n\nLike many other countries, Pakistan, which runs a trade surplus of more than $3 billion with the US, the single largest destination of the country’s exports, is quite serious. The US accounts for $5bn in goods exports from Pakistan (17pc of the nation’s total exports). The 29pc hike in tariff handed down to Pakistan is huge, and it would negatively impact its US exports — three-fourths of which comprise textiles and clothing.\n\nThe good news is that the government has finally constituted a committee with significant business representation to decide the course of action on how to engage the US trade authorities to seek some concessions from them.\n\nPublished in Dawn, The Business and Finance Weekly, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:02:25.509Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902446/the-vicious-trade-war-worsens",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:33.000Z"
}
