{
  "title": "CORPORATE WINDOW: Relief attempts fall short — again - Newspaper - DAWN.COM",
  "author": null,
  "content": "Pakistan’s reluctant billionaires remain unmoved by recent power tariff cuts, relative stability, and the International Monetary Fund’s (IMF) endorsement. Without tackling terrorism and restoring investor confidence, the large-scale investments needed for job creation and broad-based growth will remain elusive. Rising global tariffs have further deepened concerns. Uncertainty will persist until these core challenges are resolved.\n\nLast week, Prime Minister Shehbaz Sharif announced a reduction in electricity rates for residential and commercial consumers. The national average tariff was cut by Rs7.4 per unit, while industrial rates saw a Rs7.6 per unit reduction.\n\nFrom runaway inflation reaching 30 per cent and a close brush with sovereign default in 2024, Pakistan has come a long way. The government’s economic team has managed to restore a degree of macroeconomic stability in the current fiscal year. Inflation has fallen to record lows, allowing the State Bank to slash interest rates down from 22pc to 12pc.\n\nThe twin deficits have been brought under control, and with the support of friendly nations, foreign exchange reserves improved, lending much-needed stability to the currency market.\n\n‘Pakistan has most of the ingredients to attract investment but without visionary leadership and pragmatic efforts to market the country, these assets remain underutilised’\n\nIMF and Pakistan have reached a staff-level agreement on the first review under Pakistan’s 37-month $7 billion dollar Extended Fund Facility (EFF) and on a new 28-month $1.3bn arrangement under the Resilience and Sustainability Facility (RSF). Upon the IMF board approval, Pakistan will gain access to about $1bn under the EFF, bringing total disbursements under the EFF to about $2bn.\n\nDespite these positive developments, Pakistan’s economic performance in the first half of the current fiscal year has been underwhelming, with real GDP growth remaining below 1pc. Agriculture recorded a measly 1.1pc real growth, a sharp decline from 5.8pc during the same period last year. The service sector showed some improvement, rising from 1.3pc to 2.6pc.\n\nHowever, the industrial sector remained in negative territory, albeit with a slight recovery from -1.8pc to -0.2pc in real terms, according to official data shared by the Policy Research and Advisory Council of the Karachi Chamber of Commerce and Industry.\n\nLast week, President Trump slapped a blanket 10pc tariff on all imports to the US, along with steep duties of up to 54pc on nations with significant trade surpluses with his country, regardless of their size, development level or diplomatic ties with Washington. The move has sparked fears of global recession as affected nations brace for retaliatory measures.\n\nSharing his assessment of the situation, Musadiq Zulqarnain, one of the Pakistan’s leading businessmen, noted several structural challenges: “First, a significant portion of economic activity remains undocumented and is not being captured in official data. The high tax burden is inadvertently driving more activity into the informal sector. Meanwhile, despite recent macroeconomic stabilisation, the cost of doing business in the formal sector remains high. Without meaningful structural reforms, sustainable growth will remain elusive.”\n\nMr Zulqarnain welcomed the recent reduction in power tariffs as a positive step that could offer some short-term relief. However, he cautioned that other pressures persist — a slightly overvalued rupee and excess production capacity in key trading partners like China, for instance — which is contributing to dumping and undermining domestic industry.\n\n“Investment is likely to return once the cost of doing business is lowered and investors regain confidence in the continuity and consistency of government policies,” he added.\n\nBadruddin Kakar, a leader of the Quetta Chamber of Commerce and Industry, welcomed the recent reduction in electricity rates as a major win for the industry but emphasised that more needs to be done.\n\nHe urged the government to bring interest rates down to single digits to ease financing pressure and to streamline the tax regime on real estate. “Unlocking the real estate sector from burdensome taxes would stimulate growth and energise several dozen allied industries,” he noted.\n\nMuhammad Younus Dagha, Chairman of the Policy Research and Advisory Council and a former secretary and caretaker minister, believes investors’ hesitation stems from past experiences. “It’s not about losing faith; it is about knowing the devil,” he said, pointing to the absence of a long-term, consensus-based policy framework. Investors were burned by ad hoc policies in sectors like LNG, power and solar, which were later abandoned by successive governments, citing unproven corruption claims.\n\nHe also noted the government’s failure to curb capital flight, which worsened after last year’s damaging tax regime, despite evidence like the Dubai leaks. “There’s a complete lack of vision to attract real investments in the strategic sectors. Until that’s changed, the economy will remain dominated by speculative games in the stock market.”\n\nEhsan Malik, CEO of the Pakistan Business Council, emphasised that while stable macroeconomic conditions are essential, they’re not enough to drive investment or industrial growth.\n\n“Energy costs remain uncompetitive, long-term funding and forex for capital expenditure are lacking, and high taxes — especially on salaried individuals — are compressing demand and reinvestment,” he said.\n\nMr Malik pointed to low productivity, poor infrastructure, and security concerns as key factors eroding competitiveness. He added that a successful IMF review could improve Pakistan’s credit rating and unlock external financing, but looming US tariffs, affecting Pakistan’s top export market, pose a fresh risk to investor sentiment.\n\nMoin Fudda, former chairman of the Central Depository Company, echoed Mr Malik’s concerns, adding that investors continue to favour gold and real estate for stable returns. “Even after recent electricity price cuts of about 2.5 cents, rates in Pakistan remain at 12-13 cents per unit, still higher than the nine cents in competing countries,” he noted.\n\nMajyd Aziz, former president of the Karachi Chamber of Commerce and Industry, argues that investors, especially foreign, look beyond macroeconomic indicators. He notes that, decades ago, investors entered African markets despite weak fundamentals, but in Pakistan, serious red flags persist.\n\nThese include negative narratives around Balochistan, threats to Chinese nationals, instability along the Durand Line, reckless fiscal management, and a lack of meaningful reforms. “Pakistan has most of the ingredients to attract investment but without visionary leadership and pragmatic efforts to market the country, these assets remain underutilised,” he remarked.\n\nPublished in Dawn, The Business and Finance Weekly, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f1d607e1a6e.gif",
  "retrievedAt": "2025-08-25T14:01:58.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902455",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:33.000Z"
}
