{
  "title": "Lahore Police book singer Salman Ahmad under Peca law - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Lahore Police have booked musician and former PTI member Salman Ahmad under the Prevention of Electronic Crimes Act, 2016 (Peca) for allegedly sharing content against state institutions and figures online, it emerged on Monday.\n\nA first information report (FIR) was registered at Lahore’s Defence A Police Station on April 4 on the complaint of Sub-Inspector Ikram Hussain under Sections 11 (hate speech) and 20 (offences against dignity of a natural person) of Peca and Sections 500 (punishment for defamation), 504 (intentional insult with intent to provoke breach of the peace) and 505-1(C) (statement conducing to public mischief with intent to incite, or which is likely to incite, any class or community of persons to commit any offence against any other class or community) of the Pakistan Penal Code.\n\nThe FIR said some “malicious” elements had been using social media to “spread false and defamatory information” about government figures and institutions.\n\n“This false campaign is often based on fabricated news and baseless allegations … to mislead the public and create distrust against respected and important institutions and individuals,” the FIR said.\n\nHussain said that he was informed about a post on X by the singer, which the sub-inspector alleged aimed to “incite against national institutions and personalities”.\n\nAhmad “made a provocative and hateful post on Twitter (now known as X). The profile has about 265.4K followers, to whom this hateful post is being spread,” Hussain wrote, adding that “the minds of his viewers/followers are being turned against national and government institutions and figures.”\n\nThe PTI terminated the musician’s party membership for running a campaign against “the family of Imran Khan” in December 2024. Ahmad had posted on X to criticise party founder Imran’s wife Bushra Bibi for her political activities during the November 26 protests, sparking criticism from party supporters.\n\nPeca, since its introduction in 2016, has been widely criticised as a “black law” created mainly to punish dissent. In the eight years since its enactment, it has been used extensively against politicians, journalists, rights activists, and even ordinary political workers.\n\nThe National Assembly in January passed a controversial amendment bill to the country’s cybercrime laws amid a walkout by PTI lawmakers and journalists from the proceedings.\n\nEarlier this year, the administrator of a WhatsApp group in Punjab’s Pakpattan was arrested for allegedly violating Peca by permitting an insulting post targeting Punjab Chief Minister Maryam Nawaz to be shared in the group.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:53.559Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902734/lahore-police-book-singer-salman-ahmad-under-peca-law",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T18:35:35.000Z"
}
