{
  "title": "Farmers plan countrywide rallies against corporate farming - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Farmers have decided to launch a nationwide protest on April 13 against corporate farming being introduced under the Green Pakistan Initiative (GPI).\n\nAccording to a decision taken by a joint sitting by the Pakistan Kissan Rabita Committee, Anjuman Mazareen Punjab, Hari Jedojehad Committee, Crofter Foundation and others, rallies and conventions will be held in various towns and at public sector farms on April 13 (next Sunday).\n\nThe participants will demand an end to corporate farming and the eviction of peasants from the lands they have been cultivating for generations.\n\nThey will also seek a ban on construction of controversial canals in southern Punjab, and will demand all public sector agricultural lands distributed among the peasants, withdrawal of notices to tenants for payment of outstanding dues worth millions of rupees, and that wheat purchase price should be fixed at Rs4,000 per 40kg during the ongoing harvesting season.\n\nThe GPI is the federal government’s initiative aimed at enhancing agricultural development and tackling environmental issues by transforming uncultivated land into high-yield farms using modern technology, advanced irrigation systems, high-quality seeds, AI-driven monitoring, and better farming equipment.\n\nFarmers and activists fear that the transition to large-scale agribusinesses may threaten small landowners, displace peasants of state lands and limit their access to crucial agricultural resources.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:24:07.373Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902584/farmers-plan-countrywide-rallies-against-corporate-farming",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:26.000Z"
}
