{
  "title": "Major universities await help amid financial crunch - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Three federally chartered universities have been looking towards the finance ministry for additional grants for over two months, as the finance ministry has yet to convey its decision to the education ministry.\n\nIn the last week of January, the education ministry moved a summary, asking the finance ministry to release an additional grant of Rs2.5 billion for three universities – Quaid-i-Azam University, International Islamic University Islamabad (IIUI), and Federal Urdu University of Science and Technology.\n\nThese universities have been facing a severe financial crunch, making it difficult to pay salaries and pensions as well.\n\n“We checked with the education ministry on this Friday, and we were told…that they had moved a summary during the last week of January and that the matter was pending in the finance ministry,” said a faculty member of IIUI.\n\nIt may be noted that almost all public sector universities in the country have been facing financial issues, as the government has not allocated funds required for the ongoing fiscal year.\n\nEducation ministry waiting for finance ministry’s response on Rs2.5 billion grant\n\nSimilarly, overall funding for the higher education sector has been stagnant since 2019, causing difficulty for the management of universities while handling development and non-development expenditure, including research grants.\n\nAn education ministry official said that the government was cognisant of this issue and that in the upcoming budget, the higher education sector would be provided with adequate funds. “As a stopgap arrangement, the three public sector universities would be provided additional grant in this fiscal year and we have already moved a summary in this regard,” he said.\n\nSources in the Higher Education Commission told Dawn that public sector universities were facing financial issues as the higher education sector was facing a shortfall of Rs60 billion.\n\n“Higher education sector has been facing this shortfall for the past several years…the sector faced a shortfall of Rs17.7 billion in 2018-19, which is continuously increasing,” HEC Chairman Dr Mukhtar Ahmed told a National Assembly standing committee a few months ago.\n\n“Now the higher education sector is confronted with a shortfall of Rs60.1 billion. HEC requirement was Rs125 billion while the allocation was Rs65 billion [for the current fiscal year].”\n\nDr Mukhtar had said the gap was further widened by a decrease in the recurring grant per student from Rs67,528 in 2018-19 to Rs50,956 in 2023-24. The said committee had stressed the need to enhance the budgetary allocation for education to at least 4pc of the GDP in the upcoming budget for the fiscal year 2025-26.\n\nIt may be mentioned that on the one hand, existing public sector universities have been facing budget issues, while on the other, the federal government is all set to construct Daanish University in Islamabad, which will cost around Rs25 billion. Several Daanish schools will also be constructed in provinces.\n\nThe government is in the process of setting up the Daanish Education Trust. This trust would be provided 190 million pounds, which the UK government had seized from Bahria Town owner Malik Riaz and returned to Pakistan.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:24:44.857Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902626/major-universities-await-help-amid-financial-crunch",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T03:09:01.000Z"
}
