{
  "title": "Binance founder Zhao appointed as strategic adviser to Pakistan Crypto Council - Business - DAWN.COM",
  "author": null,
  "content": "Binance’s billionaire founder Changpeng Zhao on Monday was appointed as a strategic adviser to the Pakistan Crypto Council (PCC), a press release issued by the Finance Division said.\n\nThe Pakistan Crypto Council (PCC) was officially launched last month to “regulate and integrate blockchain technology and digital assets” into the country’s financial landscape.\n\nOn February 25, following a meeting between Finance Minister Muhammad Aurangzeb and a foreign delegation, the finance ministry announced it was considering “establishing a National Crypto Council” to adopt emerging digital currencies in line with global trends. In March, the government appointed]3 entrepreneur Bilal Bin Saqib as the chief adviser to the finance minister on the council.\n\nAccording to a press release issued today, the “groundbreaking move” of appointing Zhao as a strategic adviser was poised to reshape the global crypto landscape.\n\nThe announcement was made today during Zhao’s meeting with the PCC, chaired by Aurangzeb, bringing together key government stakeholders.\n\nIt said that Zhao held separate meetings with Prime Minister Shehbaz Sharif and Deputy Prime Minister Ishaq Dar.\n\n“This is a landmark moment for Pakistan,” said Aurangzeb. “We are sending a clear message to the world: Pakistan is open for innovation. With Zhao onboard, we are accelerating our vision to make Pakistan a regional powerhouse for Web3, digital finance, and blockchain-driven growth.\n\nPCC CEO Saqib said Pakistan was “opening its doors to the future of finance”.\n\n“And who better to guide us on this journey than Zhao — a pioneer who built the world’s largest crypto exchange and changed the way billions think about financial freedom,” Saqib said.\n\nThe press release said that as an official strategic adviser to the council, Zhao would provide guidance on regulation, infrastructure, education, and adoption.\n\nIt said that he would work closely with the government and the private sector to create a compliant, inclusive, and globally competitive crypto ecosystem.\n\n“Pakistan is a country of 240 million people, over 60 per cent of whom are under the age of 30. The potential here is limitless,” Zhao was quoted as saying in the press release.\n\nZhao’s appointment signalled a bold new era, where the country joined the ranks of Singapore, Dubai, and Switzerland as a progressive, Web3-ready nation, the press release said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/07190442b73a01e.jpg",
  "retrievedAt": "2025-08-25T14:01:54.712Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902715/binance-founder-zhao-appointed-as-strategic-adviser-to-pakistan-crypto-council",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T14:18:06.000Z"
}
