{
  "title": "LHC summons AGP again for assistance in case over implementation of Anti-Rape Act - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Lahore High Court (LHC) on Monday again summoned Attorney General of Pakistan (AGP) Mansoor Usman Awan on April 14 for assistance in a case pertaining to the implementation of the Anti-Rape (Investigation and Trial) Act 2021.\n\nThe Anti-Rape Act 2021 seeked to establish special courts and use of modern devices during the investigation and trial of rape cases. A special committee had been formed that year to oversee the implementation of the Act and reach out to any federal or provincial ministry, division office, agency or authority for effectual compliance.\n\nToday’s proceedings were heard by a three-member bench headed by LHC Chief Justice Aalia Neelum. Justice Farooq Haider and Justice Ali Zia Bajwa were the other members of the bench.\n\nAdditional Attorney General (AAG) Mirza Nasr Ahmed, Punjab Prosecutor General Syed Farhad Ali Shah and Advocate General of Punjab Amjad Parvez appeared before the bench.\n\nIn the previous hearing of the case, Justice Neelum deplored that no effective measures had been taken to keep the victims’ identity confidential in sexual assault cases and stressed that protecting them was of utmost importance.\n\nShe had observed that the preservation of evidence was crucial, and video/audio recordings and other evidence must be legally secured under the Qanun-i-Shahadat (the law of evidence).\n\nThe bench also heard a petition of suspect Salman Tahir, who was booked in a case over allegedly sexually assaulting a 10-year-old girl and had pleaded that a doctor had issued a bogus and illegal medical certificate.\n\nHe contended that the victim’s medical examination, including a two-finger test that was banned in 2021, was not conducted under the Anti-Rape Act.\n\nThe petitioner requested the court to approve his bail application.\n\nAt the outset of the hearing, Justice Neelum asked, “Has the AGP come to the court today?”\n\n“The AGP is busy in the Supreme Court,” AAG Ahmed responded.\n\n“The previous hearing was also postponed because of the AGP,” Chief Justice Neelum remarked.\n\nJustice Haider observed, “This is a serious matter; they should have informed that they are busy in the Supreme Court. We come having read the case [as] this is a very important matter.”\n\n“We are not satisfied with your answer,” Justice Haider told AAG Ahmed.\n\nAt this point, Justice Bajwa stated that if the AGP had prior engagements in the SC, he should have submitted a written request for adjourning the hearing.\n\n“This means that every institution of the federation is working according to its own will,” Justice Neelum remarked.\n\n“We had ordered that the AGP should appear for assistance,” Justice Haider said.\n\n“At the ground level, it is not the federation’s responsibility but the provinces’ to implement this act,” AAG Ahmed contended.\n\n“The national media does not raise this issue much; the international media has raised it more,” Justice Neelum noted, adding: “If there had been no international pressure, would this legislation have been enacted?”\n\nSubsequently, the bench summoned the AGP again on April 14 for assisting the court.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:56.909Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902687/lhc-summons-agp-again-for-assistance-in-case-over-implementation-of-anti-rape-act",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T09:22:33.000Z"
}
