{
  "title": "Have Imran’s blessing to open channel for talks, claims Swati - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Imran Khan is still ready to come to the table, if the establishment is prepared to negotiate, party leader Azam Khan Swati has claimed, adding that he had the PTI founder’s blessing to initiate talks to secure his freedom.\n\nIn a lengthy video message released to — in his words — clear the air following his recent meeting with the party founder in Adiala jail, Mr Swati criticised “certain vloggers and anchors for selling a false story”, without naming anyone.\n\nIn the midst of a widening rift between the party’s ranks in Khyber Pakhtunkwa, Mr Swati also backed KP CM Ali Amin Gandapur, PTI KP leader Junaid Akbar and party general secretary Salman Akram Raja, saying that they were “picked by Imran Khan himself”.\n\nRecounting his interaction with Mr Khan and Bushra Bibi in prison, he said he had repeatedly told the party founder he had “khotay sikkay” (counterfeit coins) in his pocket.\n\nHe also recounted a meeting with Mr Khan where, he claimed, the party leader had tasked him to reach out to Gen Asim Munir — following the latter’s app­ointment in Dec 2022 — to open the door for negotiations.\n\nMr Swati claimed that after this meeting, he had reached out to someone close to Gen Munir, a renowned anchorperson and a certain “Dr Tanveer” (thought to be a reference to Pakistani-American businessman Tanveer Ahmed), but to no avail.\n\n“Give me permission to work with Dr [Arif] Alvi and others to open the doors for talks,” Mr Swati claimed to have asked the PTI chief in their latest meeting, adding that Mr Khan gave him his blessing to do so.\n\nThe former minister claimed that the PTI founder reposed trust in his efforts, as he had stood with him through thick and thin.\n\n“If they are ready for talks, I am willing — like I was from day one,” he quoted the jailed ex-PM as saying.\n\nBeseeching vloggers and anchorpersons to stop sowing discord and work towards securing Imran Khan’s release, he also said that a negative campaign had been started against PTI USA leaders and others who had recently visited Pakistan.\n\nThis is being interpreted as a reference to a delegation of prominent Pakistani-Americans — under the banner of First Pakistan Global — who recently met with establishment figures. Reportedly, the agenda of that meeting revolved around efforts to secure Mr Khan’s release.\n\nBut in the wake of news of the meeting going public, a schism has emerged among PTI’s diaspora supporters — with one side arguing that these people had no mandate to negotiate on behalf of the party.\n\nHitting out at those claiming that Mr Khan had given him a “shut up call” for proposing talks with the establishment, Mr Swati maintained that no one had rendered more sacrifices, apart from martyrs, than him and his family. “I have faced torture and I have shared all details with Imran Khan. I am the one who cared about the 1,100 workers in jail and made efforts to secure their bails.”\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:23:49.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902573/have-imrans-blessing-to-open-channel-for-talks-claims-swati",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:11.000Z"
}
