{
  "title": "Three ‘most-wanted terrorists’ arrested in Karachi by Rangers and CTD - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three terrorists belonging to the proscribed Fitna al Khawarij group were arrested in Karachi by Sindh Rangers and Counter Terrorism Department (CTD) during a joint operation based on intelligence information, an official statement said on Monday.\n\nIn July last year, the government, through an official notification, designated the banned Tehreek-i-Taliban Pakistan (TTP) as Fitna al Khawarij, while mandating all institutions to use the term khariji (outcast) when referring to the perpetrators of terrorist attacks on Pakistan.\n\nA statement today from the Sindh Rangers said they had arrested Inamullah alias Lala, Naeemullah alias Umar Zali and Muhammad Taib alias Muhammad from Korangi.\n\n“The arrested terrorists have been involved in several attacks and acts of terrorism on security forces,” the Rangers said.\n\n“The three terrorists belong to the Fitna al Khawarij Hafiz Gul Bahadur group.”\n\nThe statement added that arms, ammunition and explosives have also been recovered from the terrorists.\n\nNaeemullah alias Umar Zali, joined Fitna al Khawarij in 2014 and is an important member of the Fitna al Khawarij Hafiz Gul Bahadur group.\n\nAdditionally, his father Momin Khan and uncle Salimullah were important commanders of Fitna al Khawarijand involved in several attacks on security forces. They were killed in security operations.\n\nNameeullah is trained in combat and has been involved in several terrorist actvities in Waziristan.\n\n“The accused came to Karachi a while ago and was active in organising his network,” the Rangers said.\n\nMeanwhile, Inamullah joined the Fitna al Khawarij Hafiz Gul Bahadur group in 2017 and was “very active” in Waziristan with the group of commander Abdul Hameed alias Fikramand in the Jani Khel area of ​​Waziristan, the statement read. He and his other associates were involved in several attacks on security forces.\n\nInamullah’s brother, also part of the Hafiz Gul Bahadur group, was “very active” in Waziristan, according to the statement. Like Naeemullah, Inamullah came to Karachi a while ago to organise and facilitate the Fitna al Khawarij network.\n\nMuhammad Taib in 2023 joined the Fitna al Khawarij (Fikarmand group), the statement said. He joined the group after the death of his brother Abdul Razzaq and was carrying out facilitation work in Karachi.\n\n“The three accused were planning terrorism in Karachi when they were arrested,” the statement said. “They have been handed over to CTD police for further legal action, along with the arms, ammunition and explosives.”\n\nIn October, the Sindh CTD arrested three alleged TTP terrorists in Karachi’s Sohrab Goth.\n\nEarlier in June, the TTP claimed responsibility for firing at the police in Sohrab Goth, which killed Police Constable (PC) Muhammad Yasin and injured PC Salman Abbas.\n\nMeanwhile, the Punjab CTD arrested seven terrorists in October during 129 intelligence-based operations.\n\nThe country has lately witnessed a sharp uptick in the number of attacks targeting security forces, other law enforcement agencies, and security checkpoints, particularly in Balochistan and Khyber Pakhtunkhwa.\n\nAttacks escalated after the TTP broke a fragile ceasefire agreement with the government in 2022 and vowed to target security forces.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:56.846Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902682/three-most-wanted-terrorists-arrested-in-karachi-by-rangers-and-ctd",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T08:25:56.000Z"
}
