{
  "title": "Overtaxed and underserved — reforming a broken tax equation - Business - DAWN.COM",
  "author": null,
  "content": "In the last fifteen years, Pakistan has been almost continuously engaged in one International Monetary Fund (IMF) programme or another, with a recurring emphasis on broadening the tax base and improving the tax-to-GDP ratio. However, instead of expanding the base, the strategy has largely centred on increasing tax rates — both direct and indirect — placing a heavier burden on compliant taxpayers while allowing marginal players to remain outside the net.\n\nThe evidence speaks for itself: our general sales tax (GST) rate has risen from 15 per cent to 18pc, and the corporate tax rate is now close to 50pc (including the super tax). Yet the tax-to-GDP ratio has barely crossed 10pc, even during periods of low commodity prices when the government has relied heavily on petroleum levies and other indirect taxes.\n\nAt the same time, the grey economy has flourished, particularly after 2015, driven by measures such as higher withholding taxes on non-filers, including cash withdrawals from banks. These policies have discouraged financial inclusion and formalisation, pushing the ratio of currency in circulation to broad money from an average of 22pc (FY06-15) to 28pc (FY16-24), despite growth in digital payments.\n\nClearly, something is deeply flawed. Weak enforcement allows tax evaders to benefit, while compliant taxpayers face mounting rates, creating a system that is not only inefficient but fundamentally unjust.\n\nThe situation has worsened significantly over the past two years.\n\nWeak enforcement benefits tax evaders, while compliant taxpayers face mounting rates, creating an inefficient and fundamentally unjust system\n\nFormal businesses now face an effective tax rate of 48pc, and for banks, it exceeds 55pc. Top-tier salaried individuals are taxed at 38.5pc, while non-salaried individuals face a staggering 49.5pc. These are tax burdens akin to those in Scandinavian countries, yet Pakistan’s public service delivery more closely resembles that of low-income nations. This stark contrast is widening the trust deficit and eroding the already fragile social contract between the state and its taxpayers.\n\nClearly, the existing model is not working. Both the government and the IMF must reflect and consider alternative approaches in the upcoming budget. Attempting to raise tax rates while also broadening the net is counterproductive. This is evident in sectors such as dairy and juices, where higher indirect taxes have actually reduced revenue. A similar phenomenon occurred in the tobacco sector, where the government is losing over Rs300 billion in annual revenue to tax evaders.\n\nSimilarly, withholding taxes on retailers and wholesalers are simply being passed on to consumers, leading to decreased sales volumes. The Laffer curve is clearly in effect; beyond a certain point, increasing tax rates leads to diminishing returns.\n\nHigh taxation is also discouraging capital formation. Numerous levies, including intercorporate dividend and capital value taxes, are pushing capital out of the country and deterring new investment. At a time when Pakistan urgently needs both local and foreign investment to generate sustainable economic growth, these tax policies are proving counterproductive.\n\nThe government must gradually start reducing corporate tax rates, phasing out the super tax, and lowering the income tax rate to 25pc — a level comparable to that of other emerging economies. Similarly, the tax burden on salaried individuals must be rationalised to reduce brain drain and attract skilled talent from abroad. Currently, salaried individuals in Pakistan pay two to three times more in taxes than their Indian counterparts, making the country less competitive in retaining human capital.\n\nIndustrialisation and investment in manufacturing are essential for Pakistan’s economic progress. Yet the manufacturing sector bears a disproportionately high tax burden. The industrial sector contributes just 18.5pc to GDP but pays 60pc of total taxes. Large-scale manufacturing, which accounts for only 8.2pc of GDP, pays four times that in taxes.\n\nOn the other hand, agriculture contributes 24.04pc to GDP but generates less than 1pc of tax revenue — largely due to exemptions and weak enforcement. This disparity also allows landlords to hide income from other sources by classifying it as agricultural income. In this context, the IMF’s condition to impose a normal income tax on agriculture is a welcome step.\n\nThe situation is similarly skewed in other sectors. Real estate contributes 5.85pc to GDP but less than 1pc in taxes. Wholesale and retail trade, accounting for 17.8pc of GDP, contributed only 2.9pc to tax revenue in FY24 — just one-seventh of its share in the economy. These discrepancies are stark, particularly when compared to peer countries.\n\nEgypt’s mandatory e-invoicing and Vietnam’s nationwide rollout of digital tax services show how real-time data and user-friendly platforms can drive compliance, especially among small and medium enterprises. By adopting similar digital tools, Pakistan can bridge the digital divide, address collection inefficiencies, and improve fiscal transparency. Strategic digitisation will not only broaden the tax base but also create a fairer system that promotes voluntary compliance and restores public trust.\n\nThese recommendations are not new. Corporate bodies and policy experts have advocated them for years. But the system is now reaching a critical tipping point. The capacity to extract further revenue from the formal sector is diminishing. This deepens the fiscal and balance-of-payments crisis.\n\nWith growing pressure from the IMF to broaden the tax base, it is high time the authorities demonstrated genuine commitment to tax reform. Embracing strategic digitalisation and rebalancing sectoral contributions can help build an equitable, efficient, and sustainable taxation system that supports Pakistan’s economic future.\n\nThe writer is the Secretary General and CEO of Overseas Investors Chambers of Commerce and Industry\n\nPublished in Dawn, The Business and Finance Weekly, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:02:25.470Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902454/overtaxed-and-underserved-reforming-a-broken-tax-equation",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:33.000Z"
}
