{
  "title": "Khyber Pass Economic Corridor project gets rolling - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The National Highway Authority (NHA) has initiated the process to build the Khyber Pass Economic Corridor (KPEC) by opening bids for two lots of its component, called the Khyber Torkham Expressway, a 48 km-long highway.\n\nThe project was initially planned to be launched in 2017. It could not progress due to multiple reasons, but now a total of 10 companies are involved in bidding.\n\nAccording to the NHA, a joint venture of ZKB-AZVIRT remained shared the lowest for Lot-1 by submitting a Rs135.17 billion bid, while ZGCC-Matracon submitted the second-lowest bid of Rs143.29 billion. Similarly, ZGCC-Matracon remained successful for Lot-2 by offering a bid of Rs79.03 billion, while ZKB-AZVIRT submitted the second-lowest bid of Rs85.69 billion.\n\n“The (KPEC) project aims to construct 48km long 4-lane, dual carriageway high-speed access controlled motorway, from Peshawar to Torkham and to promote economic development and uplift of areas adjoining to expressway falling in Khyber Pakhtunkhwa Province,” according to the Economic Affairs Division website.\n\nNHA receives bids for four-lane Khyber Torkham Expressway\n\nWhen contacted, a senior NHA official, who did not want to be named, said that complete transparency was ensured in the bidding process. He said the authority would soon award the contract to the lowest bidders as the bidding process has been completed.\n\nThe Khyber Pass Economic Corridor will connect Pakistan and Afghanistan with Central Asia through the Khyber Pass. It is part of corridors 5 and 6 of the Central Asia Regional Economic Cooperation (CAREC) routes, which will provide the shortest link between Pakistan, Afghanistan, Tajikistan, Uzbekistan and the Arabian Sea. This route has been integral to trade in South and Central Asia for hundreds of years.\n\nThe existing road between Peshawar and Torkham carries about 9,110 vehicles per day and congestion and steep grades mar the vehicular movement.\n\nAccording to a study, the existing road is not adequate and cannot be expanded on the current alignment at a reasonable cost due to engineering constraints and expensive resettlement and land acquisition. It is expected that 6,651 vehicles per day will divert from the existing road to the new expressway. This traffic projection does not depend on any further upgrade to the roads on the Afghan side of the corridor between Torkham and Kabul, it added.\n\nWith increased trade, traffic volume is projected to increase to 30,000 vehicles per day. With the Torkham border now open 24/7, the traffic volume could further increase and the new Peshawar Torkham Expressway will support the projected traffic volume, the study said.\n\nThe KPEC’s construction cost and contingency estimates are based on international practice for this type of four-lane expressway. The cost estimate per kilometer without contingencies is equivalent to $6.7 million, which is lower than the international average of $8-10 million per kilometre for expressways in similar mountainous and hilly terrains.\n\nThe preliminary designs include 22 bridges/flyovers, 139 drainage/culvert structures, and 2 major interchanges. International practice is to allocate enough financing for estimated costs and contingencies to provide confidence to bidders.\n\nThis will bring reputable contractors to work in this logistically and security-challenging but important area.\n\nThe study said the international average physical contingency is 10 per cent, and a similar contingency level is usually used to cover price escalation during the construction period.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:02:26.903Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902580/khyber-pass-economic-corridor-project-gets-rolling",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:26.000Z"
}
