{
  "title": "Shutter-down strike observed in various parts of Balochistan on BNP’s call - Pakistan - DAWN.COM",
  "author": null,
  "content": "Various cities across Balochistan observed a shutter-down strike on Monday in response to the BNP-M’s call as the party’s sit-in at the Lakpass area of Mastung entered its 11th day.\n\nThe BNP-M had begun a “long march” from Wadh to Quetta on March 28 to protest the arrests of Baloch Yakjehti Committee (BYC) leaders and activists, including Mahrang Baloch and Sammi Deen Baloch, as well as a crackdown on their sit-in in Quetta. Sammi was released on Tuesday.\n\nBNP-M chief Sardar Akhtar Mengal had anno­u­nced that the party would march on Quetta on April 6 after three rounds of negotiations had failed to make any progress.\n\nA day earlier, the police stopped protesters from entering the provincial capital using tear gas and shelling to disperse them.\n\nEarlier that day, the provincial government also warned Mengal that he would be arrested under the Maintenance of Public Order (MPO) if his party’s march entered Quetta. Balochistan government spokesperson Shahid Rind asserted that Mengal would be arrested if he “moves towards Quetta”.\n\nA strike was observed today in Gwadar, Turbat, Pasni, Panjgur, Khuzdar, Kharan, Mastung, Kalat, Dalbandin, Noshki, Sorab and Hub. The shops, markets and banks remained closed and vehicles largely stayed off the roads.\n\nAccording to BNP leader Quddus Baloch, two government delegations came for negotiations but there was no progress as the teams lacked authority.\n\nAccording to Baloch, the sit-in was under siege. He cited serious security concerns saying that Mastung was a stronghold of religious extremists.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/07124127105ad0d.jpg",
  "retrievedAt": "2025-08-25T14:01:57.325Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902679/shutter-down-strike-observed-in-various-parts-of-balochistan-on-bnps-call",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T08:00:32.000Z"
}
