{
  "title": "PTI has nothing to do with US bill calling for sanctions on state functionaries: Barrister Gohar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI Chairman Barrister Gohar Ali Khan on Monday said that his party had “nothing to do with” the bipartisan bill introduced in the US House of Representatives, calling for sanctions on Pakistani state functionaries over alleged human rights violations.\n\nThe bill, titled the “Pakistan Democracy Act”, over alleged human rights violations, including the “persecution” of former prime minister Imran Khan, was introduced last month by Republican Congressman Joe Wilson of South Carolina and Democrat Jimmy Panetta of California. It has been referred to the House of Foreign Affairs and Judiciary Committees for further deliberation.\n\nIn a response, Islamabad downplayed the matter and said it did not align with the “current positive dynamics” of bilateral relations between the two nations.\n\nSpeaking to reporters in Islamabad today, the PTI chairman dissociated his party from the matter, saying it had “nothing to do with the bills presented in the US.”\n\n“Numerous bills are presented in the US Congress,” Gohar said, adding that he had not read the bill himself yet.\n\nWhen asked about speculations regarding a US delegation visiting Pakistan, the PTI chairman said: “No one contacted us nor do we have any contact with them.”\n\nIn response to a question as to whether the party had any contact with the establishment, Barrister Gohar said that he was “hopeful that a way would be found”; however, he was not aware of any such developments.\n\nRegarding the party’s plan of action, he said that it would be decided in collaboration with the opposition alliance. “We would hear back from JUI-F chief Maulana Fazlur Rehman after April 15.”\n\n“All the opposition parties will be contacted, and whatever the future course of action is, we will carry it out with the alliance,” Gohar said.\n\nThe proposed legislation calls for the imposition of sanctions on Pakistan’s army chief within 180 days if the country does not take steps to improve its human rights situation. The bill seeks to utilise the US Global Magnitsky Human Rights Accountability Act, which allows the US to deny visas and entry to individuals accused of human rights violations.\n\nThe draft bill also calls on the US administration to identify key individuals involved in the alleged suppression of political opposition in Pakistan and place them on a sanctions list. It would further empower the US president to lift these sanctions if Pakistan ends military interference in governance and releases all “wrongfully detained political detainees.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:01:53.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902730/pti-has-nothing-to-do-with-us-bill-calling-for-sanctions-on-state-functionaries-barrister-gohar",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T17:35:52.000Z"
}
