{
  "title": "Le Pen slams ‘witch-hunt’ at Paris rally - World - DAWN.COM",
  "author": null,
  "content": "PARIS: France’s far-right leader Marine Le Pen on Sunday vowed to pursue her presidential ambitions after she was found guilty of embezzlement and banned from standing for office, saying her party is the target of a “witch hunt”.\n\nPolls have made the National Rally (RN) party figurehead the frontrunner ahead of a presidential election in two years, and the court sentence has stunned France’s political establishment.\n\nLe Pen spoke at one rally in central Paris six days after a court in the French capital found her and other RN officials guilty of embezzling European parliament funds to use them for domestic political duties.\n\nHer opponents backed the court’s decision at rival events on Sunday. “If you steal, you pay,” former prime minister Gabriel Attal told his supporters. Le Pen, 56, was given a four-year jail term, with two years suspended, and banned from public office for five years.\n\n“I won’t give up,” Le Pen told followers gathered in a Paris square with the golden dome of the Hotel National des Invalides in the background. She denounced a “witch hunt” against the RN as supporters waved French flags and chanted “Marine! Marine!”.\n\nJordan Bardella, Le Pen’s deputy and RN chief, said there were 10,000 people at the rally. But the square was not full. Bardella, 29, said the court ruling was aimed at “eliminating” Le Pen from the presidential race.\n\nHe said the party did not want to “discredit all judges” but the conviction was “a direct attack on democracy and a wound to millions of patriotic French people”.\n\nAmidst the divisive debate over the sentence, the judges who convicted Le Pen have received death threats. US President Donald Trump also called the sentence a “witch hunt” by “European leftists using lawfare to silence free speech”.\n\nPresident Emmanuel Macron has insisted however the French judiciary is “independent”.\n\nLeft wing and centrist parties staged counter gatherings against the far right. At a meeting of Macron’s Renaissance party in a Paris suburb, Attal accused the far right of “attacking our judges, attacking our institutions”. “You steal, you pay,” Attal said in a speech later in the day.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f31c5646d89.gif",
  "retrievedAt": "2025-10-12T02:24:33.641Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902559/le-pen-slams-witch-hunt-at-paris-rally",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:46.000Z"
}
