{
  "title": "UK finds Russian nuke sensors around the country - World - DAWN.COM",
  "author": null,
  "content": "LONDON: The UK military has found Russian sensors in seas around the country that it believes were attempting to spy on its nuclear submarines, the Sunday Times reported.\n\nThe Royal Navy found some devices planted on the sea bed while several washed ashore, the newspaper reported. Military and intelligence chiefs believe they were planted to gather intelligence on the UK’s four submarines that carry nuclear missiles.\n\n“There should be no doubt, there is a war raging in the Atlantic. This is a game of cat and mouse that has continued since the ending of the Cold War, and is now heating up again,” a senior UK miliary figure told the paper.\n\nThe newspaper’s three-month investigation said it had discovered unmanned Russian vehicles “lurking next to deep-sea communications cables”.\n\nMacron calls for ‘strong action’ if Moscow continues to ‘refuse peace’\n\nThe government also had “credible intelligence” that Russian oligarch-owned superyachts may have been used to conduct underwater reconnaissance, said the report.\n\nFrance warning\n\nFrench President Emmanuel Macron on Sunday called for “strong action” if Russia continued “to refuse peace”, days after a Russian ballistic missile killed nine children in Ukrainian leader Volodymyr Zelensky’s hometown. Despite US and European efforts to secure peace in Ukraine, Russia continued “to murder children and civilians”, Macron said.\n\n“My thoughts are with the children and all civilian victims of the bloody attacks carried out by Russia, including on April 4 in Kryvyi Rig,” Macron said on X in French and Ukrainian.\n\n“A ceasefire is needed as soon as possible. And strong action if Russia continues to try to buy time and refuse peace.” On Friday, a missile attack on the central Ukrainian city of Kryvyi Rig killed 20 people, including nine children.\n\nThe youngest victim was a three-year-old boy.\n\nMacron said that even though Ukraine accepted US President Donald Trump’s proposal for a complete ceasefire and European countries were also working to secure peace, “Russia is continuing the war with renewed intensity, with no regard for civilians.”\n\nZelensky said on Sunday that Moscow was increasing its aerial bombardment after Russia mounted a “massive” missile and drone attack on Ukraine overnight, killing two people. “The pressure on Russia is still insufficient,” he added.\n\nKyiv strikes\n\nA Russian missile attack on Kyiv killed one man and injured three other people overnight, causing damage and fires in several districts in the biggest such attack on Ukraine for weeks, Ukrainian officials said on Sunday.\n\nThe strike was the first large-scale attack using missiles and drones since the US said late last month it had negotiated two ceasefire accords with Russia and Ukraine, including one that would halt strikes on each other’s energy infrastructure.\n\nPoland on high alert\n\nWarnings from the air force of an attack, including regions bordering Poland, forced the neighbouring Nato-member country to scramble aircraft to ensure air safety.\n\nPoland has been on high alert for objects entering its airspace since a stray Ukrainian missile struck the southern Polish village of Przewodow in 2022, killing two people.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f31c3d93f7e.gif",
  "retrievedAt": "2025-10-12T02:24:32.477Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902561/uk-finds-russian-nuke-sensors-around-the-country",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:46.000Z"
}
