{
  "title": "Impeachment week in Seoul ends with chaos-free protests - World - DAWN.COM",
  "author": null,
  "content": "IN contrast to the violent unrest that followed the Constitutional Court’s 2017 removal of then-President Park Geun-hye — which left four people dead — the public response to Yoon Suk Yeol’s ouster on Friday has been largely calm, with protests remaining peaceful and orderly.\n\nAside from two isolated incidents Friday — a man in his 20s attempted to break a police bus window with a baton, and a reported self-immolation attem­pt near the presidential residence in Hannam-dong — the overall atmosphere at major rally sites in Seoul, including Anguk Station, Gwanghwamun and Hannam-dong, remained calm. No illegal protests or serious challenges to public order were reported.\n\nProtestors against and for Yoon’s removal expressed their emotions, but other than the above two incidents no violence was reported on Friday.\n\nLim Joon-tae, a professor in the Department of Police Administration at Dongguk University, was quoted by local media outlet News1 as saying that the police authorities’ concrete measures, including sealing off the area around the Constitutional Court and invoking the highest alert level in the police emergency response system, effectively prevented any physical confrontations among the politically divided demonstrators.\n\nLim explained that the shocking mob attack by Yoon supporters on the Seoul Western District Court on Jan. 19 served as a lesson that was learned from, in that it pushed the police to allocate more personnel and security equipment to ensure public safety and maintain order.\n\nThis time, mobile police squads and investigators were tasked with arresting any protestors who might break into the court building as well as with protecting the court justices. Some 14,000 officers in mobile police squads — the units used for crowd control — were deployed.\n\nAllocating a total of 513 Seoul firefighter paramedics and 84 ambulances were amo­ng numerous other measures to prepare for emergencies.\n\nActing Chief Justice of the Constitu­tional Court Moon Hyung-bae also expressed gratitude to the police for ensuring the court’s security and justices’ safety during Yoon’s impeachment trial.\n\nWhile acknowledging the authorities’ efforts to ensure public safety, Lee Joo-hee, a professor of sociology at Ewha Womans University, believes that the peaceful, mostly subdued rallies on Friday highlighted South Korea’s mature democracy.\n\n“People say that South Korea today is divided in almost every area, ranging from politics to age and gender issues. But we were able to see that many social groups, including minorities like young women and farmers, successfully made their voices heard without violence,” the professor said.\n\nPublished in Dawn, April 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/67f31d45610a8.gif",
  "retrievedAt": "2025-10-12T02:24:45.441Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1902563/impeachment-week-in-seoul-ends-with-chaos-free-protests",
  "dateList": "2025-04-07",
  "date_published": "2025-04-07T01:12:46.000Z"
}
