{
  "article_id": "2025-04-24_e25560fdc093d82096e0b34b4958acf4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/punjab-home-dept-launches-major-initiative-to-monitor-criminals-using-tracking-devices/",
    "retrieved_at": "2025-08-27T14:50:44.694Z"
  },
  "metadata": {
    "title": "Punjab home dept launches major initiative to monitor criminals using tracking devices",
    "author": null,
    "date_published": "2025-04-24T10:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 201,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Apr 24 (APP):In a groundbreaking move to enhance public safety and monitor criminal elements,the Punjab Home Department decided to equip habitual offenders and individuals listed under the Fourth Schedule with electronic tracking devices. The initiative was finalized during a high-level meeting chaired by Punjab Home Secretary Noor-ul-Amin Mengal. The meeting was attended by Special Secretary Interior Fazal-ur-Rehman, Additional IG Crime Control Department Sohail Zafar Chattha, DIG Operations Punjab Waqas Nazir, Additional Secretary Police Dr. Zeeshan Hanif and representatives from the law and finance departments. Under the new plan, 1,500 tracking bands will initially be distributed among three key departments:Crime Control Department (500 bands),Counter-Terrorism Department (CTD) (900 bands), Parole Department (100 bands). These GPS-enabled bands will allow 24/7 surveillance of the movements of the individuals wearing them. The devices aim to ensure closer monitoring of those with a history of criminal activity, particularly those deemed a threat to public safety or national security. Home Secretary Mengal also directed officials to begin preparations for the next phase of the project, which will involve importing more advanced tracking technology. The department plans to adopt international best practices for criminal surveillance, including the potential future use of sub-dermal micro-tracking chips, as recommended by experts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}