{
  "article_id": "2025-04-24_a13aca7354dbd83ce9799dba95378a67",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-on-parliamentary-affairs-briefed-on-grievance-wing-reforms/",
    "retrieved_at": "2025-08-27T14:52:07.284Z"
  },
  "metadata": {
    "title": "NA body on Parliamentary Affairs briefed on grievance wing reforms",
    "author": null,
    "date_published": "2025-04-24T13:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 24 (APP):The Standing Committee on Parliamentary Affairs was briefed Thursday on initiatives to strengthen the Prime Minister's Public Affairs and Grievance Wing, with an emphasis on improving its accessibility in remote and undeserved regions of the country. The meeting, chaired by Rana Iradat Sharif Khan, reviewed efforts to broaden the Wing's reach and enhance its responsiveness to public concerns. The Secretary of the Ministry of Parliamentary Affairs highlighted the ongoing coordination for developing a unified strategy to integrate the Chief Ministers' grievance redressal systems, including those in Azad Jammu & Kashmir (AJK) and Gilgit-Baltistan (GB), with the Pakistan Citizen Portal (PCP). The Committee was also informed about the status of ministerial assurances made on the floor of the House. Since the start of the 16th National Assembly, 44 such assurances have been recorded, with implementation reports submitted for 22 of them. In a unanimous decision, the Committee passed two resolutions. The first condemned the Indian government's unilateral suspension of the Indus Waters Treaty and the downgrading of diplomatic relations, describing these acts as grave provocations. The second resolution strongly denounced the killing of innocent civilians in Gaza, characterising Israel's actions as ethnic cleansing. The Committee expressed condolences over the passing of Pope Francis, acknowledging the global significance of his leadership and legacy.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}