{
  "article_id": "2025-04-24_6ce32717b387bbba1e3a102e0434f913",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-go-last-extent-for-ensuring-indus-waters-treaty-implementation-law-minister/",
    "retrieved_at": "2025-08-27T14:52:02.693Z"
  },
  "metadata": {
    "title": "Pakistan to go ‘Last Extent’ for ensuring Indus Waters Treaty implementation: Law Minister",
    "author": null,
    "date_published": "2025-04-24T14:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 244,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 24 (APP):Minister for Law and Justice, Senator Azam Nazeer Tarar on Thursday said that the Pakistan would go to the 'last extent' for ensuring the implementation of Indus Water Treaty (IWT 1960) as the international law also support us. He said that the National Security Committee (NSC) has given clear message to neighboring country India on its announcement to suspend the water treaty. The minister said that the Indian government through its recent measures wanted to put the burden of its incompetency and responsibility on others. Azam Nazeer said that there was no provision of unilaterally suspension of the IWT in the law, adding that the treaty is sacred for us, the law support Pakistan and it also couldn't be terminated as per Vienna Convention. Attorney General of Pakistan Barrister Mansoor Usman Awan said that India has no legal right to suspend the IWT-1960 unilaterally under the treaty. He said that so far it is just statement from India if any advancement is made beyond the statement, the Pakistan has all legal rights under the treaty to avail available forums for its right. The AGP clarified that if there is need of amendment, changes or even revoking the IWT it would require a further treaty between the two countries and it couldn't be done unilaterally. They were addressing a press conference along with Deputy Prime Minister Ishaq Dar, Minister of Defence Khawaja Asif and Federal Minister for Information and Broadcasting Attaullah Tarar.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}