{
  "article_id": "2025-04-24_70384f14609ca1a7fca95d7a97a0aaf4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/india-badly-exposed-after-pahalgam-incident-at-international-level-mushaal/",
    "retrieved_at": "2025-08-27T14:50:18.534Z"
  },
  "metadata": {
    "title": "India badly exposed after Pahalgam incident at international level: Mushaal",
    "author": null,
    "date_published": "2025-04-24T12:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 24 (APP):Hurriyat leader Yasin Malik's wife Mashaal Mulick here on Thursday said that after the false flag incident by Indian security forces in Pahalgam badly exposed at international level. Addressing at a press conference, she said that India is committing terrorism on the Indus Waters Treaty (IWT) and it has unilaterally broken it , suspending the Indus Waters Treaty is condemnable, India has prepared a terrible plan for the Pahalgam false flag operation, said a press release. Mushaal Mulick said that Pahalgam incident was carried out by the Indian intelligence agency 'RAW', the Modi government wants to start a war using an excuse, the Indian initiative threatens the peace of the region, minorities including Muslims and Sikhs are not safe in India, the worst human rights violations are continuing in occupied Kashmir, the United Nations and the international community should raise their voice against Indian bigotry. Mushaal Mulick further said that the Pahalgam incident was carried out by the Indian agency 'RAW', before that, Pathankot and other incidents were also carried out by Indian agencies as in the past including Jaffer Express and Gujarat incidents, India has been involved in all of them. She said that India accused Pakistan without evidence and India is targeting Kashmiris all over the world, minorities including Muslims and Sikhs are not safe in India, the worst human rights violations are continuing in occupied Kashmir. India's Modi government is following the Hindutva agenda, India is committing illegal measures in occupied Kashmir, the United Nations and the international community should raise their voice against Indian inhuman activities, he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}