{
  "article_id": "2025-04-24_c3161e32383215d043b915939f560c52",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/no-new-canals-without-mutual-consensus-of-provinces-pm/",
    "retrieved_at": "2025-08-27T14:51:08.373Z"
  },
  "metadata": {
    "title": "No new canals without mutual consensus of provinces: PM",
    "author": null,
    "date_published": "2025-04-24T16:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 379,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 24 (APP): Prime Minister Muhammad Shehbaz Sharif Thursday said no new canals would be built without mutual consensus by provinces in the Council of Common Interests (CCI). During a meeting with a delegation of Pakistan People's Party (PPP) led by its Chairman Bilawal Bhutto Zardari, he said the federal government had decided that no progress on the issue of canals would be made without consensus among the provinces. The meeting of CCI would be called on Friday, May 2, he told. He said he informed the PPP delegation about the decisions reached by the National Security Committee in response to the announcements by India, which took an aggressive stance against Pakistan. \"We have issued a press statement against the jingoistic steps of India after deliberations by the National Security Committee,\" he added. He said during the meeting with the PPP delegation, the issue of canals was discussed. The prime minister said he explained that Pakistan was a federation and the issue among provinces should be resolved with negotiations and sincerity and according to the national interest. He said it was his stated position for decades that economically Kalabagh dam was in the interest of the nation, adding however, nothing was more important than the federation and the objections of federating units should be accepted on the issue of Kalabagh dam. He said the issue of canals should be resolved according to mutual consensus. During the meeting, Pakistan Peoples Party and Pakistan Muslim League(N) decided that the issue of canals would be put before the Council of Common Interests (CCI), he added. In the CCI meeting, the decisions of Pakistan People's Party, Pakistan Muslim League (N) and the federal government regarding canals would be endorsed, he remarked. PPP Chairman Bilawal Bhutto thanked the prime minister for reaching decision about canals in view of the objections raised by the provinces. He also welcomed the step to endorse decisions of this meeting at the CCI forum. In the past the Kalabagh dam project was also stopped after raising of objections by the provinces, he added. He said his party condemned the decision of India to suspend the Indus Water Treaty, adding his party stood with the government on the issue and would also take up the matter at international forums.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}