{
  "article_id": "2025-04-24_921d46f703e3de4150b829e052cd4a98",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-water-supply-adequate-dg-dismisses-rumours-of-shortage-2/",
    "retrieved_at": "2025-08-27T14:50:19.476Z"
  },
  "metadata": {
    "title": "Islamabad water supply adequate, DG dismisses rumours of shortage",
    "author": null,
    "date_published": "2025-04-24T11:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 188,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 24 (APP):Islamabad's water reserves are sufficient until July, and monsoon rains are expected to replenish supplies further, Director General Water CDA Sardar Khan Zimri confirmed on Thursday. Talking to APP, Zimri dismissed rumours circulating in some sections of social media platforms of shortages as \"false and baseless,\" assuring residents of continued chlorinated water supply. \"Alhamdulillah, water reservoirs are currently stocked, and chlorine supplies are ample under the existing contract for the next six months,\" the DG stated. Laboratory staff conduct daily water quality tests to ensure safety. Of the city's 200 tube wells, 180-185 are operational, with repairs underway for the remaining. \"Tube well maintenance is routine, and contractors have already begun restoration work,\" he said. Meanwhile, 15-18 of Islamabad's 30 water tankers remain active daily, though staff shortages are being addressed. The water management CDA receives 200-250 complaints daily, which are \"resolved promptly.\" Zimri noted, stating most sectors receive normal supply, low pressure occasionally occurs due to pipeline repairs. He urged residents to ignore rumors and avoid water wastage, particularly for car or floor washing, with warnings of \"strict action and heavy fines\" for violations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}