{
  "title": "Water level in Mangla Dam at continual decline: 84.45 feet deep water discharged this season so far",
  "link": "https://www.app.com.pk/national/water-level-in-mangla-dam-at-continual-decline-84-45-feet-deep-water-discharged-this-season-so-far/",
  "date_published": "2023-12-21T16:22:00.000Z",
  "source": "APP",
  "content": "MIRPUR  ( AJK): Dec 21 (APP) ::Besides the ongoing seasonal scheduled power generation, the discharge of water from Mangla dam is in progress reducing the water level in the reservoir to 1157.55 feet against the maximum conservation level of 1242 feet with live storage of 2.092 MAF on Thursday.\nAs a result of the continual inflow of water during the ongoing season, the water level in Mangla Dam was recorded as 1157.55 feet after the discharge of 84.45 feet of water from the reservoir by Thursday.\nMangla Dam stands largest reservoir in terms of water storage in the country, was filled to its maximum conservation capacity of 1242 feet, on August 17, this year as seasonal impounding of the reservoir. official sources told APP on Thursday.\nAt present 2.093 million acre-feet (MAF) water is available in the Mangla dam reservoir, the media wing of WAPDA told the news agency.\nThe inflows of Jhelum River at Mangla reservoir were recorded as 4700 cusecs with outflows of 26000 cusecs of water from the dam on Thursday.\nAt the same time, the position of the river inflows and outflows at Tarbela, Mangla and Chashma along with the reservoirs levels and the barrages remained on Thursday as under:-\nRivers: Indus at Tarbela: Inflows 17300 cusecs and Outflows 28000 cusecs, Kabul at Nowshera: Inflows 7100 cusecs and Outflows 7100 cusecs, Khairabad Bridge: Inflows 12200 cusecs and Outflow 12200, Jhelum at Mangla: Inflows 4700 cusecs and Outflows 26000 cusecs, Chenab at Marala: Inflows 7200 cusecs and Outflows 2000 cusecs.\nBarrages: Jinnah: Inflows 46500 cusecs and Outflows 41000 cusecs, Chashma: Inflows: 43400 cusecs and Outflows 40000 cusecs, Taunsa: Inflows 44900 cusecs and Outflows 32900 cusecs, Guddu: Inflows 30800 cusecs and Outflows 26000 cusecs Sukkur: Inflows 22100 cusecs and Outflows 500 cusecs Kotri: Inflows 4100 cusecs and Outflows 0 cusecs Trimmu: Inflows 9200 cusecs and Outflow 2800 cusecs Panjnad: Inflows 5000 cusecs and Outflows 0 cusecs.\nTarbela: Minimum operating level 1402 feet, present level 1474.99 feet, maximum conservation level 1550 feet, live storage today 2.043 MAF.\nMangla: Minimum operating level 1050 feet, present level 1157.55 feet, maximum conservation level 1242 feet, live storage today 2.092 MAF.\nChashma: Minimum operating level 638.15 feet, present level 642.10 feet, maximum conservation level 649 feet, live storage today 0.060 MAF.\nThe inflows and outflows of River Indus at Tarbela, Jinnah and Chashma, River Kabul at Nowshera and River Jhelum at Mangla have been reflected as mean flows of 24 hours, whereas the other flows have been gauged at 6.00 a.m on Thursday.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:08:09.230Z"
}
