{
  "title": "Govt. fully committed to ensure peace, equal rights for all communities: President",
  "link": "https://www.app.com.pk/national/govt-fully-committed-to-ensure-peace-equal-rights-for-all-communities-president/",
  "date_published": "2023-12-21T09:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): President Dr Arif Alvi has reiterated that the government is fully committed to ensure peace, tranquility and equal rights to all citizens of the country irrespective of caste, creed and religion as enunciated in the Islamic teaching, pronounced by Quaid-e-Azam Muhammad Ali Jinnah and laid down by the Constitution of Pakistan.\nHe said that being an Islamic welfare state, it was their duty to safeguard the basic rights of all religious minorities and reassured that their all rights would be completely protected at all costs as the successive governments had been making strenuous efforts in this regard.\nAddressing a ceremony held here at the Aiwan-e-Sadr in connection with the celebrations of Christmas, the president said Prophet Isa (AS) was an embodiment of peace and affection and these values were much needed in today’s world shaken by strife, conflicts and wars.\nHe said that teachings of Islam as well as by almost all religions laid emphasis upon the value of human life and when its value was reduced, it gave rise to conflicts. “Wars and carnage are no solutions. My message to the world is; wars must end,” he stressed.\nThe ceremony was arranged by the ministry of religious affairs and interfaith harmony was attended by parliamentarians, religious leaders and members from different faiths, members of diplomatic corps and a large number of Christian families.\nThe president referring to atrocities in Gaza, said contrary to the religious teaching of peace and tolerance, the scenes in the world were topsy-turvy. About 19,000 precious human lives in Gaza had been lost but the human hearts had not melted, he added.\nHe opined that despite the United Nations’ calling for immediate ceasefire and a denunciation by the Pope himself, the carnage of Palestinians including Christians continued where churches besides, mosques were razed to the ground.\nThe enlightened world advocating the tenets of democratic values was so oblivious to the humanitarian woes in the conflict, he added.\nHe said when Pakistan Resolution was passed during 1940, a simultaneous resolution over Palestine was also adopted and reaffirmed that the two-state was the only solution to the issue.\nThe president said in Pakistan, all communities were enjoying equal rights and living with peace which was ‘a beautiful banquet’ of interfaith harmony and unity. Recollecting the tragic Jaranwala incident, he said whenever an incident involving religious minorities surfaced, the governments had immediately responded and also commended the judiciary for playing a significant role in ensuring their rights.\nHe said Holy Prophet Muhammad (Peace Be Upon Him) and the Caliphs also repeatedly advised and acted for the protection of rights, places of worship and lives of the followers of other faiths.\nMoreover, Quaid-e-Azam Muhammad Ali Jinnah, the founder of nation, in his historic and memorable speech of August 11, 1947 had stressed that everyone irrespective of colour, creed and religion would have the equal rights, privileges, and obligations, besides complete religious freedom in the new State of Pakistan, he added.\nHe also appreciated the contributions of religious minorities in the social and economic uplift of the country.\nCiting treatment meted out to minorities including Muslims, Christians and Sikhs in India, he said an archbishop in the Manipur had claimed that about 150 churches were burnt down which was given a colour of tribal conflict to divert attention from the plight of minorities.\nPresident Alvi said Hazrat Isa (AS) served the ailing and miserable humanity and spread the divine message of peace, empathy and affection among the human beings and the observance of day reinforced that message.\nEarlier, speaking on the occasion, Caretaker Minister for Religious Affairs and Interfaith Harmony Aneeq Ahmed said that all the Prophets spread the message of peace, equality and tolerance.\nHe urged the religious leaders to spread the message of peace and love in the world, adding that the white colour in the national flag of Pakistan declared that the country could not be completed without their religious minorities.\nArchbishop of twin-cities of Islamabad and Rawalpindi, Dr Joseph Arshad said that there was need to reinforce the spiritual message of peace, affection and interfaith harmony as spread by Hazrat Isa (AS).\nHe said the Christians and all other religious communities would continue playing their role in the progress and prosperity of the country.\nBishop of Lahore Diocese Nadeem Kamran, in his remarks, said that the joyous day reminded them to further foster brotherhood, affection and unity among their ranks and appreciated the Muslims and the government for taking steps to protecting their equal rights in Pakistan.",
  "retrievedAt": "2025-08-11T11:08:25.008Z"
}
