{
  "title": "Experts advise parents to boost Kids’ immune system, timely precautions against respiratory viruses in winter",
  "link": "https://www.app.com.pk/national/experts-advise-parents-to-boost-kids-immune-system-timely-precautions-against-respiratory-viruses-in-winter/",
  "date_published": "2023-12-21T06:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Health experts on Thursday advised parents to boost kids’ immune system and for taking timely precautionary measures that  can limit poor outcomes with influenza related viruses during this winter season where a new surge in pediatric patients with respiratory illnesses is overwhelming hospitals across the country.\nSenior consultant paediatrician Dr Nazia Mumtaz talking to a private news channel explained that flu is a highly contagious disease among children that spreads by inhaling droplets made by infected people when they cough, sneeze, or talk.\n“Early diagnosis and treatment can limit poor outcomes with influenza and mini- like COVID virus among kids” she added.\nThese infections, in most cases, are mild, and will therefore typically consist of nothing more than a fever, a blocked nose and a cough, she added.\nHowever, a small number of high-risk infants can become seriously affected and are admitted to hospital, she further mentioned.\nThere are no effective treatments for these viruses, so we must support infants as best we can as their own immune system fights off the infection, she said.\nReplying a query, another Kids specialist Dr Mukhtasim Khan added that if child is sniffling, coughing or has a fever or sore throat, it is possible that they could have picked up a respiratory virus, adding, for many healthy kids, these viruses cause a brief period of illness and discomfort before improving.\nBut for very young children or those with compromised immune systems, even a common respiratory illness can be a cause for concern, he expressed feared.\nThe best way to prevent virus is for everyone to get timely vaccination of influenza, he said, adding, washing hands frequently, wearing face masks and avoiding crowds can also help prevent the spread of illness.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:07:45.812Z"
}
