{
  "title": "Indian SC’s ruling on Kashmir has no moral or legal standing: APHC",
  "link": "https://www.app.com.pk/national/indian-scs-ruling-on-kashmir-has-no-moral-or-legal-standing-aphc/",
  "date_published": "2023-12-21T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):The All Parties Hurriyat Conference (APHC) has said that any judicial order about Indian Illegally Occupied Jammu and Kashmir (IIOJK) carries no moral and legal standing.\nIn his message from New Delhi’s infamous Tihar Jail, illegally detained senior leader of All Parties Hurriyat Conference Shabbir Ahmed Shah said the Indian Supreme Court’s recent verdict that validated the 05 August 2019 illegal action of the Modi government is yet another big betrayal to the Kashmiris.\nShabbir Shah maintained that holding a plebiscite in Jammu and Kashmir in line with the UN Security Council resolutions is the only thing the Kashmiri people have been demanding and fighting for the past several decades.\nOn the other hand, the report released by Kashmir Media Service said India is using draconian laws in Indian illegally occupied Jammu and Kashmir to suppress the Kashmiris’ struggle for the right to self-determination.\nThe Indian military, paramilitary, and police personnel enjoying unbridled powers under black laws are perpetrating war crimes and crimes against humanity with impunity to intimidate the Kashmiris into submission.\nThe Modi government is also using draconian laws to stifle political dissent in the occupied territory. However, the worst Indian atrocities have failed to subdue the Kashmiris’ resolve for freedom and they are determined to continue their struggle till complete success.\nMeanwhile, speakers at a seminar organized by Pasban-e-Hurriyat Jammu and Kashmir at Poonch Medical College in Rawalakot city of Azad Kashmir have urged the UN to take practical steps for the settlement of the Kashmir dispute by its resolutions and aspirations of the Kashmiri people. Students and faculty members of Poonch Medical College also held a rally on this occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:07:49.917Z"
}
