{
  "title": "No possibility of seat adjustment with JUI-F; says Sherry",
  "link": "https://www.app.com.pk/national/no-possibility-of-seat-adjustment-with-jui-f-says-sherry/",
  "date_published": "2023-12-21T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Pakistan Peoples Party (PPP) senior leader Sherry Rehman said on Thursday that there was ‘no possibility of seat adjustment with Jamiat Ulema-e-Islam Fazal (JUI-F), as it did not want general elections to be held on time.\n“The JUI-F was part of the collation government; however, this time the situation is different, but PPP doors are always open to other political opponents,” she told a private news channel.\nSherry reiterated that her party would launch a vigorous electoral campaign from Garhi Khuda Bakhsh on December 27, on the death anniversary of BB Shaheed.\nShe said that the PPP was the only party that stresses the need for holding timely elections in the country. The other political parties in the country are seemingly running away from the polls.\nShe deplored that different tactics were used in the past to create rifts in her party; their all attempts went in vein, and the PPP raised the slogan ‘Pakistan Khappay’ (Long live Pakistan). “We would never let anyone break Sindh,” said Sherry.\nThe PPP leader urged the politicians to abstain from politics of division as the country is going through tough conditions. She emphasized that the national interest must be above everything else.\nSherry Rehman was optimistic to form next government, saying that the PPP would contest elections from all constituencies across the country, and results in Punjab would be different.\nShe noted that the PPP wanted a level playing field for all the parties to contest the next polls in a free and fair manner.\nIn response to a query, she remarked PPP Chairman Bilawal Bhutto is a young politician and he will be the candidate of her party for the slot of prime minister in the upcoming elections.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:08:25.155Z"
}
