{
  "title": "Pakistan Network Track team wins grand prize in Huawei ICT Competition 2023-2024",
  "link": "https://www.app.com.pk/national/pakistan-network-track-team-wins-grand-prize-in-huawei-ict-competition-2023-2024/",
  "date_published": "2023-12-21T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Pakistan Network Track Team emerged as the grand prize winner in the Huawei ICT Competition 2023-2024 Regional Finals concluded on Thursday in Bahrain.\nHuawei ICT Competition 2023-2024 Regional Finals were organized in partnership with Shaikh Nasser bin Hamad Al Khalifa, the King’s Representative for Humanitarian Work and Youth Affairs, and the University of Bahrain at Bahrain Polytechnic.\nIn addition to the Pakistan Team, the Qatar Cloud Team, and the Kazakhstan Computing Track Team also secured the grand prize in the competition.\nThe first prize was won by the Lebanon Network Team, Kazakhstan Cloud Team, and Bahrain Computing Team. Meanwhile, the second position was secured by the Bahrain Network Team, Iraq Network Team, Lebanon Cloud Team, Pakistan Cloud Team, Jordan Computing Track Team, and Iraq Computing Track Team.\nIn the competition, the third prize was awarded to the Iraq Cloud Team, Saudi Arabia Cloud Team, Saudi Arabia Computing Track Team, and Lebanon Computing Team.\nA total of three teams from Pakistan, including two from Network Track and one from Cloud Track participated in the event. The Network Track Team included Muhammad Muhammad Osama, Qurat ul Ain Memon from Mehran University of Engineering and Technology, Indus (Muet) Jamshoro, and Muhammad Danial University of Engineering and Technology, Lahore (UET).\nThe Network Track Team two included Muhammad Bilal Gul, Muhammad Usman from UET Taxila, and Zain Tanveer from UET Lahore. The Cloud Track Team included Asfand Yar Jamali, Onkar, and Vishal Sagar from The National University of Sciences & Technology (NUST Islamabad).\nMore than 27,500 students from over 600 universities across 21 Middle Eastern & Central Asian countries participated in this year’s Middle East & Central Asia Huawei ICT Competition – marking the highest level of participation in the seven-year competition history.\nAddressing the concluding ceremony, King’s Representative for Humanitarian Works and Youth Affairs Shaikh Nasser bin Hamad Al Khalifa emphasized the importance of continuous upskilling and reskilling of youth, highlighting the need for high-intensity, gamified interactions for upgrading and upskilling participants.\nHe thanked Huawei for aligning with the vision and commended the collaboration between the private and public sectors.\nHe expressed his belief in the era ahead being full of opportunities, underscoring the responsibilities and opportunities that lie ahead.\nMinister of Education and Chairman of the Board of Trustees of the University of Bahrain, Dr. bin Mubarak Juma, welcomed the delegation from participating countries and expressed happiness over the fruitful partnership with Huawei.\nHe thanked Huawei for contributing to the digital ecosystem of the kingdom, investing in youth, and creating opportunities for Bahraini proficiency in modern technology.\nDr bin Mubarak Juma congratulated the winning teams and appreciated all participants for fostering the spirit of competition.\nPresident of Huawei Middle East and Central Asia Steven Yi, on the occasion, expressed gratitude to the Supreme Council for Youth and Sport, the Ministry for the Entrepreneurs, the Ministry of Labour, the Ministry of Education, Bahrain Polytechnic, and the University of Bahrain for their partnership.\nHe said that Huawei had made significant contributions to Bahrain’s ICT sector by collaborating with the government to advance digital transformation through 5G deployments, national broadband developments, and the training of over 2000 ICT professionals.\n“Together, we have achieved digital milestones in Bahrain, reflecting our growth and Bahrain’s excellent business environment, for which I would like to once again express our gratitude,” he added.\n“I would like to highlight that, while we have set up 240-plus ICT academies in the BG East and Central Asia, trained 1400 teachers, and educated more than 45,000 students per year.”\nInstructor of the winning grand prize team Faheem played a pivotal role in motivating and guiding the winning team.\nFaheem highlighted the challenges faced by Pakistani students due to the education system’s lack of quality and emphasized the need for students to work harder than their international counterparts. Despite the difficulties, he expressed confidence in maintaining momentum and making improvements in the upcoming competitions.\nHe discussed the tough nature of the Middle East’s network exam and the even more challenging global competition exam.\nHe acknowledged the need for improvement and hard work, especially considering the relative marking system in the global competition.\nThe winning team’s students, Muhammad Bilal Gul and Muhammad Usman shared their journey, starting from competing with over 14,000 students in Pakistan to reaching the global finals.\nThey highlighted the challenges faced during the national finals and the intense interview process, describing it as a do-or-die situation. Despite the unexpected difficulties in the lab exam during Bahrain’s competition, the team devised a strategy and successfully secured the grand prize.\nThey expressed gratitude to Allah and their team, emphasizing their preparation to win the global finals.\nThe Pakistani team that won the 2nd prize included Onkar, Zeeshan, Saagar, and Asfandyar Jamali, three of whom were from NUST and enrolled in CS and Engineering programs. They described their journey from discovering the ICT Competition at NUST through a seminar to successfully securing the 2nd position in the cloud track.",
  "retrievedAt": "2025-08-11T11:07:56.198Z"
}
