{
  "title": "Regional final of Huawei ICT 2023-24 Middle East and Central Asia concludes",
  "link": "https://www.app.com.pk/national/regional-final-of-huawei-ict-2023-24-middle-east-and-central-asia-concludes/",
  "date_published": "2023-12-21T07:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Huawei ICT Competition 2023-2024 regional finals arranged with a partnership of Shaikh Nasser bin Hamad Al Khalifa, the King’s Representative for Humanitarian Work and Youth Affairs, and the University of Bahrain concluded on Thursday at Bahrain Polytechnic.\nMore than 27,500 students from over 600 universities across 21 Middle Eastern & Central Asian countries have participated in this year’s Middle East & Central Asia Huawei ICT Competition – marking the highest level of participation in the seven-year competition history.\nShaikh Nasser bin Hamad Al Khalifa emphasized the importance of continuous upskilling and reskilling of youth, highlighting the need for high-intensity, gamified interactions for upgrading and upskilling participants.\nHe thanked Huawei for aligning with this vision and commended the collaboration between the private and public sectors.\nHe expressed his belief in the era ahead being full of opportunities, underscoring the responsibilities and opportunities that lie ahead.\nThe Minister of Education and Chairman of the Board of Trustees of the University of Bahrain, Dr. bin Mubarak Juma, welcomed the delegation from participating countries and expressed happiness over the fruitful partnership with Huawei.\nHe thanked Huawei for contributing to the digital ecosystem of the kingdom, investing in youth, and creating opportunities for Bahraini proficiency in modern technology. Dr. bin Mubarak Juma congratulated the winning teams and appreciated all participants for fostering the spirit of competition.\nPresident of Huawei Middle East and Central Asia Steven Yi on the occasion expressed gratitude to the Supreme Council for Youth and Sport, the Ministry for the Entrepreneurs, the Ministry of Labor, the Ministry of Education, Bahrain Polytechnic, and the University of Bahrain for their partnership.\nHe mentioned that Huawei has made significant contributions to Bahrain’s ICT sector by collaborating with the government to advance digital transformation through 5G deployments, national broadband developments, and the training of over 2000 ICT professionals.\n“Together, we have achieved digital milestones in Bahrain, reflecting our growth and Bahrain’s excellent business environment, for which I would like to once again express our gratitude,” he added. “I would like to highlight that, while we have set up 240-plus ICT academies in the BG East and Central Asia, trained 1400 teachers, and educated more than 45,000 students per year.”\nThe Huawei ICT Competition aims to identify, support, and nurture future ICT leaders by bridging the gap between the classroom and the workplace. It promotes innovation and creativity among students in the Middle East & Central Asia, providing them with opportunities to compete nationally, regionally, and internationally. The program enhances students’ employment opportunities in the ICT sector through knowledge sharing, hands-on skills development training, and participation in global competitions.",
  "retrievedAt": "2025-08-11T11:07:23.636Z"
}
