{
  "title": "Jordan’s Ambassador to Pakistan explores collaborative initiatives with COMSTECH",
  "link": "https://www.app.com.pk/national/jordans-ambassador-to-pakistan-explores-collaborative-initiatives-with-comstech/",
  "date_published": "2023-12-21T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): Coordinator General COMSTECH, Prof. Dr. M. Iqbal Choudhary, in a comprehensive meeting with the recently appointed Ambassador of Jordan to Pakistan, Dr. Maen KHREASAT at COMSTECH Secretariat here Thursday, discussed the establishment of a joint Water Resource Management Center and launch of a young scientists exchange program.\nDuring the meeting, Prof. Iqbal highlighted the ongoing collaborative efforts between COMSTECH and Jordan, revealing that COMSTECH had spent around $1.5 Million in various active projects with Jordan to date.\nDr. Iqbal further briefed the Ambassador about the existence of two COMSTECH-affiliated organizations in Jordan, namely the Islamic Academy of Sciences (IAS) and the Inter-Islamic Network on Water Resources Development and Management (INWRDAM).\nIn a groundbreaking proposal, the CG COMSTECH demanded the establishment of a joint Jordan-Pakistan Water Resource Management Laboratory under COMSTECH’s auspices at the Panjwani Hisaar Water Institute (NED University).\nHe also recommended the initiation of a young scientists exchange program between COMSTECH and Jordan, for scientific collaboration and knowledge exchange.\nDr. Iqbal also informed the Ambassadors about 500 free scholarships for Palestinian students by COMSTECH and Association of Private Sector Universities of Pakistan (APSUP)\nAmbassador KHREASAT expressed Jordan’s commitment to sustaining cooperation with COMSTECH, emphasizing Jordan’s role as a technology hub in the region.\nHe envisioned joint programs with COMSTECH to explore new technological frontiers and enhance higher education initiatives.\nHe appreciated the COMSTECH’s initiative of 500 scholarships for Palestinian students and offered all kinds of support from Jordan. The proposed joint Water Resource Management Center and the young scientists exchange program will stand as witness to strengthening ties between Jordan and Pakistan under the COMSTECH framework, he said.\nThe two sides concluded the meeting by affirming their commitment to mutual benefit and the exploration of opportunities for further collaboration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:08:12.615Z"
}
