{
  "title": "PMD signs landmark agreement for installation of Weather Surveillance Radar in Multan",
  "link": "https://www.app.com.pk/national/pmd-signs-landmark-agreement-for-installation-of-weather-surveillance-radar-in-multan/",
  "date_published": "2023-12-21T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): As a landmark achievement, the Pakistan Meteorological Department (PMD) has signed a Contract Agreement with the Consortium of Japan Radio Co, Ltd. (JRC) and Tobishima Corporation for the installation of a state-of-the-art dual-polarization Weather Surveillance Radar in Multan.\nThis achievement is a testament to the unwavering efforts of the Director\nGeneral PMD, Sahibzad Khan, has diligently worked to overcome obstacles that stalled this project for the past five years.\nThe signing ceremony took place on December 21, 2023, in Tokyo, Japan, marking a significant milestone in strengthening the nation’s weather forecasting capabilities, said a news release issued here.\nThe signing ceremony was attended by esteemed dignitaries, including Mir Hassan Naqvi, Senior Joint Secretary Aviation Division, Sahibzad Khan, Director General PMD, Dr. Muhammad Tahir Khan, Director P&D, PMD, representatives of JRC, JICA and International Meteorological Consultants (IMC).\nIt is noteworthy to highlight that this project faced delays due to the impact of COVID-19 and subsequent inflation over an extended period. However, the dedicated and effective efforts of DG PMD, Shahibzad Khan, have successfully transformed this challenge into a reality, paving the way for advancements in weather and flood forecasting through the installation of the Weather Surveillance Radar in Multan.\nThis collaboration under the JICA grant-in-aid project underscores the commitment of the Pakistan Meteorological Department to advancing its weather forecasting capabilities. The installation of this cutting-edge radar system is not only a technological leap forward but also a crucial step in improving the resilience of vulnerable communities.\nThe enhanced forecasting capabilities will allow for more accurate and timely warnings, mitigating the impact of adverse weather conditions.\nThe total project cost was estimated at PKR 6188.759 million, with a generous grant of PKR 5604.000 million from the Government of Japan.\nThe Government of Pakistan will contribute PKR 600.055 million to ensure the successful implementation of this transformative project.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:08:18.676Z"
}
