{
  "title": "Court grants police 2-day physical remand of Fawad",
  "link": "https://www.app.com.pk/national/court-grants-police-2-day-physical-remand-of-fawad/",
  "date_published": "2023-01-25T19:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 25 (APP):A local court of Islamabad on Wednesday granted the police a two-day physical remand of PTI leader Chaudhry Fawad Hussain in an FIR for inciting violence against the Election Commission of Pakistan (ECP).\nThe court instructed the Islamabad Police to produce the accused again on the completion of his remand time on January 27.\nJudicial Magistrate Naveed Khan announced the two-page verdict which was earlier reserved into the matter. The Pakistan Tehreek-e-Insaf’s (PTI) leader was produced before the court in the case regarding his “provocative speech” about the ECP officials and their families.\nEarlier during hearing, the prosecutor prayed the court to grant the police an eight-day physical remand of the accused.\nECP’s counsel Saad Hassan read out the contents of the first information report (FIR) before the court and said the accused had used the word ‘munshi’ for the institution.\nHe said the ECP was a constitutional institution and it had all powers to conduct elections in the country but it was being targeted deliberately. The provocative language used by Fawad Chaudhry in his speech was aimed at instigating the public against the ECP. He had asked the PTI workers to reach the houses of ECP officials.\nThe lawyer said Fawad wanted to promote hatred against the ECP and there was sufficient evidence available in the form of electronic data in that regard. The accused had admitted his controversial statement when he (lawyer) was reading out it, he added.\nThe ECP’s lawyer said the people who had supported Fawad’s assertions in his speech should also be unearthed. An anti-ECP campaign was launched based on his speech and the police had to investigate him about those remarks.\nFawad adopted the stance that the charges of sedition were also added in the FIR against him. He claimed that he was not delivering a speech, rather he was talking to a news channel, and it seemed that as per the plaintiff’s lawyer criticism was a treason act, .\nHe further said that his statement was his party’s policy as he was the spokesperson of Pakistan Tehreek-e-Insaf. It was not necessary that any such statement was also his own stance.\nHe said the Lahore Police handed him over to the Islamabad Police after arresting him. He was a senior lawyer, parliamentarian and a former federal minister, and unfortunately such fabricated cases were being initiated.\nHe prayed the court to terminate the FIR against him.\nThe court reserved the judgement, which was announced after some time.\nFawad Chaudhry’s brother Faraz Chaudhry was also present in the courtroom. Fawad Chaudhry was produced before the court amid foolproof security arrangements in place.\nThe FIR registered at the Kohsar Police Station on the complaint of ECP Secretary Umar Hameed accused Fawad of “inciting violence against a constitutional institution”. It was registered under sections 153-A (promotion of enmity between groups), 506 (criminal intimidation), 505 (statement conducing to public mischief) and 124-A (sedition) of the Pakistan Penal Code.",
  "retrievedAt": "2025-08-11T05:50:07.880Z"
}
