{
  "title": "Pakistan, U.S. in new process of ‘productive’ re-engagement: FO",
  "link": "https://www.app.com.pk/national/pakistan-u-s-in-new-process-of-productive-re-engagement-fo/",
  "date_published": "2023-01-26T08:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): The Foreign Office (FO) on Thursday said Pakistan and the United States were in a new process of re-engagement based on “productive and cooperative” collaboration in diverse matters.\n“We are undertaking discussions on different issues including agriculture, climate change, investment, energy, and other sectors and we also continue to discuss all issues of concern to both sides,” FO Spokesperson Mumtaz Zahra Baloch said in response to the statement of the U.S. that Pakistan can buy Russian oil despite restrictions.\nUS State Department’s spokesperson Ned Price at a press briefing Tuesday afternoon had stated Pakistan can also take advantage of the concessions Washington had given to other countries for buying oil from Russia.\nThe FO spokesperson said Pakistan appreciated its close friendship with the United States and was in a process of “re-engagement”.\nAsked about the claim of Pakistan national Abdul Rehman Makki that he was not provided an opportunity of defence over his listing by the United Nations, she said the decision was made by the world body under its listing procedure.\n“Pakistan as a responsible member of the international community follows the decision of the UN and its institutions,” she said.\nIf there was a backdoor diplomacy brokered by the United Arab Emirates between Pakistan and India, she dismissed any such development taking place.\n“At this stage, no dialogue is taking place between Pakistan and India,” she categorically stated.\nThe spokesperson said Minister of State for Foreign Affairs Hina Rabbani Khar, later this month, would lead the Pakistan delegation to the UN Human Rights Council in Geneva.\n“On January 30, she will present Pakistan’s national progress report under the Universal Periodic Review (UPR) process at the Council,” she said. The State Minister will outline the wide-ranging legal, policy, administrative and institutional steps taken by Pakistan to safeguard and advance human rights over the last five years.\nOn consultations with Afghanistan, she said both countries were in discussion on all matters including the security of their diplomats and citizens.\nShe confirmed that Pakistan’s envoy to Afghanistan Ubaidur Rehman Nizamani was still in Pakistan for consultations after the attack on him in Kabul.\nRegarding ongoing atrocities committed by India in Jammu and Kashmir, she said Pakistan would continue to raise its voice on the continuing grave human rights abuses in the valley.\n“It will also continue to extend unstinted moral, political and diplomatic support to the people of Jammu and Kashmir in their quest for self-determination in accordance with the relevant UN Security Council resolutions,” she said.",
  "retrievedAt": "2025-08-11T05:50:07.621Z"
}
