{
  "title": "Holy Quran desecration unbearable for Muslim Ummah: Minister Mufti Abdul Shakoor",
  "link": "https://www.app.com.pk/national/holy-quran-desecration-unbearable-for-muslim-ummah-minister-mufti-abdul-shakoor/",
  "date_published": "2023-01-26T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 26 (APP): Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor said the Holy Quran desecration was an unbearable act for Muslim Ummah across the world.\nHe was addressing the video link conference of the ministers of religious affairs of Muslim countries on the invitation of Head of Turkish Religious Affairs Dr Ali Arbash the other day.\nThe ministers of religious affairs of Islamic countries including Malaysia, Sudan, Djibouti, Iran, and Palestine participated in the conference.\nCondemning the desecration of the Holy Quran in Sweden, Minister Abdul Shakoor said the divine command was our basis and foundation and no Muslim could tolerate its desecration anyway.\nHe said similar incidents had also happened in Canada, New Zealand and other countries but the recent hateful incident of desecration of the Holy Quran in Sweden was not acceptable at all. “Islam is a religion of peace and tolerance and we respect everyone,” he added.\nHe said we thanked the head of Turkish religious affairs for realizing the sensitivity of this issue and uniting his counterparts of various Islamic countries and important personalities to discuss the permanent solution of such incidents.\nMinister Abdul Shakoor said the government, scholars and people of Pakistan strongly condemned this loathsome incident.\nHe said it was natural for Muslims to be concerned about this and adopt a firm and aggressive stance on it.\nHe said it was the responsibility of the United Nations and major countries to play their role as there was a dire need to make permanent and effective legislation on this matter.\nAfter the legislation, these laws should be implemented in letter and spirit globally as it would help to stop the reoccurring  of such nuisance issues and maintain peace and tranquillity in the comity of nations, he maintained.",
  "retrievedAt": "2025-08-11T05:50:03.676Z"
}
