{
  "title": "Pak, Bulgaria agree to enhance cooperation in education, culture",
  "link": "https://www.app.com.pk/national/pak-bulgaria-agree-to-enhance-cooperation-in-education-culture/",
  "date_published": "2022-07-20T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP):Bulgaria and Pakistan on Wednesday agreed to enhance cooperation in the field of education, professional training and culture.\nIt was agreed during a called on meeting held here between Ambassador of Bulgaria to Pakistan Ms. Irena Gancheva and Rana Tanveer Hussain, Federal Minister for Education, Professional Training, Rana Tanveer Hussain.\nSenior officials of the ministry including representative from HEC also attended the meeting.\nRana Tanveer welcomed the Bulgarian delegation and said that the two countries have always had friendly and cordial relations since 1965.\nHe said that Bulgaria has strong ties within Europe and Pakistan and should enhance its ties with Bulgaria for further cooperation between the two countries.\nRana Tanveer discussed and exchange of expertise regarding Vocational and Technical Training. He said that the two countries can benefit from the experience of each other.\nRana Tanveer welcomed exchange of teachers and students to further mutual cooperation especially for Skilled Vocational Training.\nHe said that there is significant potential in cooperation between the two countries. He said that Pakistan can learn from the expertise as Bulgaria has achieved 98 percent literacy. Minister said that Pakistan is willing to offer scholarships to Bulgarian students in order to enhance mutual collaboration.\nAmbassador of Bulgaria to Pakistan Ms. Irena Gancheva presented a draft of an MoU to be signed by both Governments for future collaboration in the field of Education.\nShe said that University to University cooperation and Technical Institution to Technical Institution collaboration is the way forward. She said that MoUs should be expedited between Pakistani and Bulgarian Universities to enhance exchanges.\nRana Tanveer Hussain said that the future is in Vocational Training of the population of Pakistan. He said that it provides the best opportunity to the people to find jobs. He said that Pakistan and Bulgaria through NAVTTC should exchange teachers and students to learn from the expertise of each other.\nRana Tanveer praised the current governments efforts in modernising the education system of Pakistan. Federal Minister thanked the Ambassador and highlighted the cordial and friendly relations between the two countries since 1975.\nHe said that there is a bonhomie between the two people. He stated that the two countries should enhance and fine tune their mutual relation.\nAmbassador of Bulgaria to Pakistan Ms. Irena Gancheva, stressed to further enhance the need for cooperation between the two states in the field of education and culture.\nFederal Minister said that our relations have always been marked by trust, mutual understanding and close cooperation and Pakistan attaches high importance to its relations with Bulgaria and is desirous of further enhancing these relations in all fields of mutual interests.\nDuring the meeting, Ambassador of Bulgaria to Pakistan Ms. Irena Gancheva said that there is a lot of scope of mutual cooperation in various fields including education and culture.\nShe also expressed keen interest in enhancing and promoting people to people contact and cultural exchanges between the two countries.",
  "retrievedAt": "2025-08-11T15:16:09.893Z"
}
