{
  "title": "Miftah agreed to bring furniture retailers under fix tax regime",
  "link": "https://www.app.com.pk/national/miftah-agreed-to-bring-furniture-retailers-under-fix-tax-regime/",
  "date_published": "2022-07-20T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP):Federal Minister for Finance&nbsp; and Revenue Miftah Ismail on Wednesday agreed to bring furniture retailers under fixed tax regime, in order to promote and develop local furniture Industry.\nA delegation of Pakistan Furniture Association led by Muhammad Shakeel Munir, President, Islamabad Chamber of Commerce and Industry called on the minister and briefed him about the difficulties being faced by the furniture retailers due to their placement in Tier-1 category for sales tax collection.\nZahid Hussain Chairman All Pakistan Furniture Association, Patron in Chief Mian Muhammad Afzaal and others were also part of the delegation.\nMuhammad Shakeel Munir informed the minister that the furniture industry had great potential to grow and boost exports of the country but placing furniture retailers in Tier-1 category for sales tax collection had created lot of difficulties for the sector that would affect its business activities.\nHe pleaded the case of furniture retailers for bringing them under fixed tax regime so that they could pay their sales tax through their electricity bills at the rate specified in the finance bill while the income tax collection should be continued at the prevailing rate.\nZahid Hussain, Chairman All Pakistan Furniture Association said that a fixed tax regime for furniture retailers will increase the tax revenue for the country and reduce the issues of furniture retailers.\nHe further requested that furniture retailers who are registered on the basis of area should be de-registered for tax purposes and subjected to fixed tax regime.\nAfter listening to the issues of furniture retailers, Miftah Ismail agreed to bring the furniture retailers in the fixed tax regime to save them from unnecessary problems and for this purpose, a new SRO would be issued soon.\nHe further said that the government would give due consideration to all genuine tax problems of the business community to promote ease of doing business for them so that they could play a more effective role in the economic development of the country.",
  "retrievedAt": "2025-08-11T15:16:13.305Z"
}
