{
  "title": "ECC approves tariff rationalization for K-Electric",
  "link": "https://www.app.com.pk/national/ecc-approves-tariff-rationalization-for-k-electric-3/",
  "date_published": "2022-07-20T14:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 20 (APP):The Economic Coordination Committee (ECC) of the Cabinet Wednesday approved the same tariff rationalization for K-Electric (KE) as the rest of the country.\nMinistry of Energy (Power Division) presented a summary on Tariff rationalization for power sector and submitted that in accordance with the National Electricity Policy 2021, the Government may maintain a uniform consumer–end tariff for K-Electric and state-owned distribution companies through incorporation of direct/indirect subsidies.\nAccordingly, KE applicable uniform variable charge is required to be modified to maintain the uniform tariff across the country. After discussion, the ECC approved the summary.\nThe meeting of the ECC was held here presided over by Federal Minister for Finance and Revenue Miftah Ismail.\nFederal Minister for Commerce Syed Naveed Qamar, Federal Minister for Power Khurram Dastgir Khan, Federal Minister for Industries and Production Makhdoom Syed Murtaza Mehmood, Minister of State for Finance and Revenue Dr. Aisha Ghous Pasha, Minister of State for Petroleum Musadik Masood Malik, Coordinator to the PM on economy Bilal Azhar Kayani, Coordinator to PM on Commerce & Industry Rana Ihsan Afzal, federal secretaries and senior officers attended the meeting.\nMinistry of National Food Security and Research tabled a summary on urgent advice relating to award of 3rd International Wheat Tender 2022 opened on 18th July, 2022. The ECC after discussion approved the lowest bid offered by M/s Vittera B.V / Marine International @ US$ 404.86/ MT for 120,000 MT on CFR bulk at sight L/C basis. Further TCP was allowed to match the tender quantity of 300,000 MT.\nMinistry of Industries and Production submitted a summary seeking authorization to TCP for signing agreement with Chinese firms for import of 200 KMT Urea from M/s Sinochem Fertilizer and M/s CNAMPGC at negotiated rate of US$ 500/MT (FoB) on 90 days deferred payment with markup basis.\nThe ECC approved the summary subject to discussion and decision in the Cabinet regarding allocation of Rs. 22 billion for this import with US$ 100 million as exchange cover, which has not been allocated into the budget 2022-23.\nMinistry of Energy (Petroleum Division) tabled a summary on rate of Petroleum Levy on Liquefied Petroleum Gas(LPG). The ECC returned back the summary to the Ministry for reconsideration of the proposal.",
  "retrievedAt": "2025-08-11T15:16:12.105Z"
}
