{
  "title": "Durrani inaugurates Hazrat Abdullah Shah Ghazi’s 1292nd Urs",
  "link": "https://www.app.com.pk/national/durrani-inaugurates-hazrat-abdullah-shah-ghazis-1292nd-urs/",
  "date_published": "2022-07-20T18:00:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jul 20 (APP): Acting Governor of Sindh Agha Siraj Khan Durrani on Wednesday inaugurated the 1292nd Urs of renowned Sufi Hazrat Abdullah Shah Ghazi by placing a floral wreath on his shrine and offering special prayers for the security, development and prosperity of the country.\nSpecial Assistant to Chief Minister of Sindh on Auqaf Pir Syed Ahmed Raza Shah Jilani, Secretary Auqaf Javed Sibghatullah, Chief Administrator of Awqaf Abdul Ghani Mehr and others were also present.\nThe three-day Urs celebrations, which will continue till July 22, feature a qawwali session after Isha prayer on July 20, Naat programme after Asr prayer on July 21, and another qawwali session after Isha prayer on July 22.\nTalking to media persons, the acting governor said that Sindh was the land of Sufis and all ethnicities were connected by eternal bond of love and brotherhood, adding that the bond would never allow the nefarious designs of the evil elements to break the unity and harmony in the province.\nIn response to a question, he said that the government had made all arrangements to maintain public order and peace during the celebrations, and the efforts of the relevant officials in that context were commendable.\nThe government was aware that pilgrims from all over the country would attend the Urs, so it had ensured coordinated and effective security measures, he added.\nHe said, “I will request former president Asif Ali Zardari and PPP Chairman Bilawal Bhutto to arrange a lift to the shrine to save visitors from the hardship.” Zardari, the acting governor noted, had played a crucial role in the construction and development of the shrine.\nRegarding the recent havoc wreaked by the rains in Karachi, Durrani said the encroachments covering the drains contributed to the urban floods.\nAnswering a question about local body elections, Durrani said that the provincial government was ready for the elections, which would hopefully be held on July 24 in Karachi and Hyderabad.",
  "retrievedAt": "2025-08-11T15:16:07.503Z"
}
