{
  "title": "Opposition resorting only to criticism for the sake of criticism: Buzdar",
  "link": "https://www.app.com.pk/national/opposition-resorting-only-to-criticism-for-the-sake-of-criticism-buzdar/",
  "date_published": "2020-06-20T23:35:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 21 (APP):Punjab Chief Minister Sardar Usman Buzdar has regretted that the opposition parties are resorting only to criticism for the sake of criticism and lamented that they had inflicted distress on people, instead of providing any substantial relief, in their respective tenures.\nIn a media statement issued here on Sunday the CM condemned that previous rulers only protected their vested interests and lured masses by hollow slogans, adding that masses want practical steps for their welfare instead of raising shallow slogans.\nThe CM said that coronavirus pandemic had adversely affected every segment of society and measures to safeguard interests of the weak segments have been proposed in the Punjab budget.\nHe said that common man has been provided relief through comprehensive planning and no government in the history of Punjab has ever provided tax relief worth Rs 56 billion.\nUsman Buzdar hoped that business activities will be promoted in the province with the provision of tax relief in the budget despite difficult circumstances. The CM emphasised that redressing economic difficulties of common man is the foremost priority of Pakistan Tehreek-e-Insaf (PTI) government as undue expenditures have been curtailed.\nPTI government, he added, is providing ease and comfort in the lives of every segment of the society. He mentioned that every work is being carried out on merit in the province. “Our intention is noble and clear, and we are treading in the right direction. We will advance forward more expeditiously in our journey in order to render services to the masses without caring for any criticism,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:22:15.961Z"
}
