{
  "title": "Kheri Murat to be developed as protected national park: Amin",
  "link": "https://www.app.com.pk/national/kheri-murat-to-be-developed-as-protected-national-park-amin/",
  "date_published": "2020-06-21T03:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Adviser to the Prime Minister on Climate Change Malik Amin Aslam has said the Kheri Murat forest area would be developed as a protected national park.\nTalking to APP, the Adviser said as many as seven national parks including Khari Murat would be developed across the country under 10 Billion Tree Tsunami (10BTT) programme to conserve the dwindling ecological, wildlife and biodiversity habitats who were rapidly depleting due to human activities and climate change.\nHe added that Green Stimulus Package was announced by the government to revive the halted plantation under 10BTT due to the COVID-19 pandemic.\nThe plantation was being carried out as per the standard operating procedures of wearing mask, maintaining social distance and avoid close contact with people having symptoms of coronavirus.\nAmin said the initiative would help encourage eco-tourism and nature conservation and would be like killing two birds with one stone.\nTo a question, he said Kheri Murat national park would be in Kheri Murat tehsil Fatehjang which was under Attock district and sprawls over an area of 8740 acres. He added that its boundaries in North were touching 9 villages, on South its boundaries touch 8 villages, on East its bounderies were touching Kheri Murat village and Rawalpindi and on the West it was touching hills close to village Gali Jageer.\nAmin Aslam said, “After the national park is established in Kheri Murat Forest area then any sort of hunting, shooting and poaching of wild species of this park will be declared illegal and to be considered as a punishable act with heavy penalties. This will be enforced within three miles radius of its boundaries.”\nThis area, he said would be protected to revive wildlife in its natural habitat and conserve the rich biodiversity of this unique ecosystem in the Kala Chitta Mountain range.\nAmin mentioned that it was just 50 miles from Islamabad and lying on both sides of the motorway, Kheri Murat National Park would provide excellent recreational activities to enjoy hiking and interaction with nature through ecotourism while providing employment to local communities.",
  "retrievedAt": "2025-08-11T19:22:12.447Z"
}
