{
  "title": "Pakistan Navy observes World Hydrography Day",
  "link": "https://www.app.com.pk/national/pakistan-navy-observes-world-hydrography-day-2/",
  "date_published": "2020-06-20T23:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 21 (APP):Pakistan Navy observed World Hydrography Day with enthusiasm and with an aim to create awareness about the importance of Hydrography and its role towards blue economy and overall national growth.\nEvery year on June 21, World Hydrography Day was celebrated across the world, under the auspices of International Hydrographic Organization, to draw worldwide attention towards the importance of hydrography and to appreciate the work done in this important field in support of safe navigation at open seas, ports and other protected marine areas around the globe, said a Pakistan Navy press release.\nThe theme selected for this year was “Hydrography – enabling autonomous technologies” which highlights the significant role of Hydrography for optimizing use of autonomous technologies in hydrographic processes. Autonomous platforms such as Autonomous Surface Vehicles (ASV) and Unmanned Aerial Vehicles (UAV) equipped with Laser based hydrography systems can be used to conduct high resolution and autonomous Hydrographic Surveys.\nPakistan was blessed with over 1000 Kilometers of coastline and an area of around 290,000 Sq Km at sea. More than 90 percent of Pakistan’s trade by volume and 70 percent by value was carried out through Arabian sea. As per Conventions on Law of the Sea (UNCLOS) and Safety of Life at Sea (SOLAS), Pakistan like other coastal states, was responsible for carrying out hydrographic surveys and production of nautical charts/ maps to provide accurate information to the mariners for safe sea passage. In this regard, Pakistan Navy Hydrographic Department was aptly fulfilling this international obligation, to ensure availability of updated information for mariners who traverse through the busy shipping lanes along Pakistan’s coast round the year.\nPakistan Navy remains abreast with modern trends in Hydrographic Surveys and has recently inducted a new survey vessel PNS BEHR MASAH in its inventory. The ship was equipped with state of the art hydrographic, physical oceanographic and geophysical survey equipment. Pakistan Navy Hydrographic Department was also utilizing some of the autonomous technologies to enhance identification of underwater objects besides operating autonomous aerial platforms for coastal topographic surveys.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:22:17.932Z"
}
