{
  "title": "Locals unhappy over Bezos’s Venice wedding - World - DAWN.COM",
  "author": null,
  "content": "ROME: Residents of Venice, already fed up with crowds of tourists cramming into their canal city, now have one more gripe: Jeff Bezos.\n\nThe billionaire Amazon founder is due to marry journalist Lauren Sanchez in a celebration in the Italian city from June 24 to 26 that is expected to attract countless VIPs.\n\nNot everyone is feeling the love though, with some residents hanging a huge banner with an X over Bezos’s name on a belltower overlooking the Venice lagoon before the sign was removed on Thursday.\n\n“He’s not welcome, not in Venice, not anywhere!” wrote the “No Space for Bezos” collective on Facebook, which was responsible for the banner.\n\nBezos is also the owner of space travel company Blue Origin, whose all-female flight in April carrying Sanchez, pop star Katy Perry and four others met with a public backlash for its high cost and environmental impact.\n\nThe anti-Bezos group, whose posters and stickers have been seen in recent days across the city, has called a public assembly this week to drum up opposition.\n\nThe Unesco-listed city, famous for its romantic gondolas and canals, is a favourite spot for lovers.\n\nIn Sept 2014, it was the backdrop for the wedding of Hollywood actor George Clooney and human rights lawyer Amal Alamuddin, a glamourous high-profile event that attracted countless tourists, fans and onlookers.\n\nThe atmosphere ahead of Bezos’s nuptials appeared more hostile.\n\n“Venice is a living city, not a place to rent to the highest bidder,” the collective wrote on social media.\n\nVenice’s mayor, Luigi Brugnaro, had welcomed the couple’s decision, however, saying in March that the wedding would bring in millions of dollars to the city.\n\nCity hall blasted “fake news” circulating about the wedding, saying that only 200 people were on the guest list and that the event would be “without any disruption whatsoever to the city, its residents and visitors”.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684cae82207c5.gif",
  "retrievedAt": "2025-08-20T03:56:35.226Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916991/locals-unhappy-over-bezoss-venice-wedding",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T00:27:56.000Z"
}
