{
  "title": "Barbs fly in Senate as PTI, PML-N accuse each other of corruption - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Barbs flew in the Senate on Friday with PTI and PML-N accusing each other of being involved in corruption. The two parties also held each other responsible for the economic mess the country was facing.\n\nOpening the budget debate in the House, Leader of the Opposition Syed Shibli Faraz said the government had set wrong priorities of public sector development. He said that while an allocation of Rs135 billion was proposed for water it was Rs227bn for roads. He alleged that it was because it was an easy way to make money.\n\nHe said that the proposed federal budget for the next year had become controversial in the beginning as questions were being raised about the apparently fudged economic figures presented in the budget.\n\n“The sanctity of the budget and the numbers in the budget document appear to be compromised,” he said, adding that the budget is a manipulation of figures as serious objections have been raised over it for the first time. He underlined that agriculture contributed 24 per cent to GDP, which was the main driver of the country’s economy.\n\nPPP lawmaker Shahadat Awan also finds faults with budget proposals\n\nHe noted that the policies of the government had broken the backbone of farmers after the Punjab government abolished the support price of wheat. The other crops have also faced contraction this year as cotton, maize and wheat prices and supply chain are facing disruption and an element of uncertainty has been created in the agriculture sector, he added.\n\nMr Faraz said that industrial sector had grown at the rate of 7 per cent during the last PTI government, which was now at 4.8 per cent, according to figures provided by the Shehbaz Sharif administration. When large-scale manufacturing is contracting continuously, how is the government showing the growth at 4.8 per cent, he added.\n\n“This gives the impression that the budget figures are manipulated,” he said.\n\nPML-N parliamentary leader Irfan Siddiqui rejected the claim of corruption in road projects and said one can at least see the built roads. He, however, said that it was not possible to see and count trees.\n\nHe claimed that it was the PTI regime, which had played havoc with the economy, crushed the law and the Constitution as well as the opposition.\n\nTowards the end of his speech, he urged the government to increase budget for education and prioritise it accordingly.\n\n“It pains me that the budget for education is so insufficient. Likewise, the recurring grant for higher education remains Rs66bn for the last 7-8 years while the development expenditure was Rs70bn in 2023-24 and in 2024-25, it was reduced to Rs66bn and now it has been further cut to Rs39bn. It must be enhanced,” he proposed.\n\nPPP’s Senator Shahadat Awan in his speech said the budget will fail to bring long-term economic stability. He said according to the World Bank report, 44.796 of Pakistanis, i.e. 107 million people, live below the poverty line and their daily income is less than 1200 rupees and unfortunately, no roadmap has been given in the current budget to reduce this poverty.\n\n“Likewise, in the face of rising inflation, the minimum salary of Rs37,000 that was kept is absolutely low and that is why the PPP has been demanding that this salary be increased to at least Rs50,000 and the federal government ensure that it is implemented in practice in the public and private sectors,” he said.\n\nHe said he was alarmed by this year’s decline of 13.5 per cent in major crops due to certain reasons. Wheat has fallen by 96 per cent but the government’s inaction is making the farmers cry.\n\n“I say that between 2024 and May 2025, the farmers have suffered a loss of Rs2200bn due to which the purchasing power of the landlord has been greatly affected, but it is strange that no forum has been set up for the redressal.\n\nSenator Awan called allocations for health and education pathetic. He said it is very surprising that this year’s budget does not include a single new health project.\n\nReferring to pension issue, he said in this budget, the government has fixed the period of family pension to 10 years after the death of the life partner; This is not justified at all and the government is requested to abolish the two existing standards.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:56:59.023Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917015/barbs-fly-in-senate-as-pti-pml-n-accuse-each-other-of-corruption",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T00:27:34.000Z"
}
