{
  "title": "Two welders burnt alive in Punjab workplace fire - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: Two young welding workers were burnt alive and another was critically injured in a small fibre sheet manufacturing unit in the Jawalanagar locality on Government Samanabad Graduate College Road, when a fire suddenly broke out.\n\nRescue 1122 said welding work was in progress in the godown of the unit, where painting chemicals were also stored. A spark fell on the paint and within seconds, the entire godown, along with the chemicals and wooden material, caught fire. Two of the three workers, identified as Ibrar Ali, 35, and Faisal Shahbaz, 20, were severely burnt and died instantly.\n\nThe third worker, deceased Ibrar’s elder brother Taimoor Abid, was seriously injured and was shifted to the burn unit of Allied Hospital.\n\nAll three workers were residents of the Islam Nagar locality.\n\nNEW BLOCK: It has been decided to build a new emergency block with 150 beds at the Faisalabad Institute of Cardiology (FIC) with the support of a philanthropist.\n\nIn the first phase, 50 beds will be added to the new emergency block, where all necessary facilities, including a radiology department and primary angiography, will be available. The number of screening and ECG rooms will also be increased.\n\nCommissioner Maryam Khan visited the FIC on Friday, received a briefing on the steps taken for the construction of the emergency block, and also inspected the site.\n\nThe commissioner directed that construction of the new block be started soon after fulfilling all legal requirements, and she also reviewed service delivery and the availability of medicines at the FIC.\n\nFDA: A comprehensive operation by the Faisalabad Development Authority (FDA) against illegal housing schemes, encroachments, and unauthorised constructions has been ongoing.\n\nFDA Director General Chaudhry Muhammad Asif told reporters on Friday that, over the last month, teams had conducted 45 operations, demolished structures of seven illegal housing schemes, sealed 28 plots for unauthorised constructions, and cleared permanent encroachments in 10 different areas.\n\nSEALED: Jhang District Council Chief Officer Mehr Muhammad Akram Bharwana directed on Friday the sealing of 10 district council-owned godowns rented to the food department for wheat storage.\n\nHe said Rs4.48 million in rent was outstanding, and recently audit paras had been raised by the audit team in this regard.\n\nHe said five godowns are in Jhang, three in Shorkot, and two in Shah Jewna.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:34:45.432Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917046/two-welders-burnt-alive-in-punjab-workplace-fire",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T03:10:25.000Z"
}
