{
  "title": "Water level in Khanpur Dam near dead level - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: The water level in Khanpur Dam has drastically dropped to 11 feet above the dead level due to persistent dry spells.\n\nThe situation has raised alarm bells and questions concerning the possible impact it may have on the water supply to Islamabad and Rawalpindi.\n\nAccording to official figures released on Friday, the reservoir’s water level has plummeted to 1,921 feet - just 11 feet above its dead storage level of 1,910 feet. The current water inflow into the dam stands at 16 cusecs and the outflow at 127 cusecs per day, including 96.18 cusecs per day to its municipal beneficiaries especially the Capital Development Authority (CDA) and Rawalpindi Cantonment Board (RCB). This growing disparity between supply and consumption could deplete the reservoir in a matter of days if current conditions persist.\n\nAn official said the remaining water in the reservoir could meet the demand of beneficiaries, especially RCB and CDA, for just 25 days. He said due to water supply to different civic beneficiaries of Rawalpindi and Islamabad, the level was decreasing by 0.10 feet per day.\n\nThe dam authorities said the catchment area which included Margalla Hills and Galiyat had not received enough rain, hence the situation has worsened and now rocks and mounds have become visible in different parts of the reservoir, especially at the main storage site and the spillways. If heavy rainfall does not occur within the next 10 to 15 days, the water level in the dam is expected to fall drastically to almost the dead level.\n\n“Due to prevailing low water in the dam, supply to both Khyber Pakhtunkhwa and Punjab for irrigation purposes has already been suspended around one month ago,” the official added. Due to prevailing dry weather, the water table in Taxila and Wah has receded sharply. Moreover, the number of visitors and picnickers to the dam had also declined.\n\nBoatmen have abandoned their boats on the dried-up surface of the lake. Khanpur Dam is situated near Potohar Plateau and Khanpur village in KP, about 40km from Islamabad and 15km from Haripur. The dam caters to domestic water supplies in Rawalpindi and Islamabad besides supplying water to the agricultural and industrial areas surrounding the twin cities.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684cf0ed536b2.jpg",
  "retrievedAt": "2025-08-20T03:56:29.899Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917068/water-level-in-khanpur-dam-near-dead-level",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T08:12:08.000Z"
}
