{
  "title": "Kashmir high court gets permanent chief justice - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: Justice Sardar Liaqat Hussain of the Azad Jammu and Kashmir (AJK) High Court was sworn in as the permanent Chief Justice on Friday, following the issuance of a formal notification to this effect by the AJK Law, Justice and Parliamentary Affairs Department a day earlier.\n\nThe oath was administered by AJK President Barrister Sultan Mahmood at a ceremony held at Kashmir House, which was also attended by Prime Minister Chaudhry Anwar ul Haq.\n\nUnder the AJK Constitution, chief justices and judges of the superior judiciary are appointed by the AJK President on the advice of the AJK Council chairman — the Prime Minister of Pakistan. However, appointments of acting chief justices, as a stopgap arrangement, fall within the exclusive prerogative of the AJK President.\n\nAccording to legal sources, the Prime Minister of Pakistan had approved the advice for Justice Hussain’s appointment as Chief Justice on June 5. However, due to a delay in its transmission to the president’s office, Justice Hussain was initially sworn in as acting Chief Justice on Monday, in accordance with an earlier notification issued on June 3.\n\nThe legal fraternity had expressed serious concern over the delay in issuing the notification for the appointment of a permanent chief justice, urging the relevant authorities to fulfill their constitutional responsibilities within a week.\n\nThere was no official word from the government regarding the reason for the holdup or the whereabouts of the advice earlier given by the Prime Minister of Pakistan in favour of Justice Hussain.\n\nOn Wednesday, however, the Law, Justice and Parliamentary Affairs Department issued a notification confirming Justice Hussain’s permanent appointment by the president under Article 43(2) of the AJK Constitution, following the advice of the AJK Council chairman and consultation with the Chief Justice of the AJK Supreme Court.\n\nThe oath-taking ceremony was attended by cabinet members, judges, senior government officials, and representatives of the legal fraternity.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:56:32.350Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917067/kashmir-high-court-gets-permanent-chief-justice",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T03:45:54.000Z"
}
