{
  "title": "No casualties as rocket fired at Bajaur house of PM’s aide Mubarak Zeb - Pakistan - DAWN.COM",
  "author": null,
  "content": "The residence of Special Assistant to Prime Minister on Tribal Affairs MNA Mubarak Zeb’s residence in Bajaur was targeted with a rocket in the wee hours of Saturday, according to police.\n\nLast month, an improvised explosive device (IED) had detonated outside the residence of MNA Zeb, partially damaging the house, police had said.\n\nBajaur District Police Officer Waqas Rafique, told Dawn.com that the rocket was fired at the residence of MNA Mubarak Zeb in Bajaur.\n\n“However, it struck the MNA’s neighbour’s house, resulting in damage to the house walls and gate,” he added.\n\nThe MNA confirmed the attack in a post on X as well, adding that there were no casualties in the attack.\n\nDPO Rafique added that there were no human casualties.\n\nHe said that miscreants had attacked the MNA’s house for the second time in the last two months.\n\nHe said that a search operation is underway in the area to track down the terrorists who launched the rocket at Zeb’s house.\n\nZeb was one of the PTI-backed independent candidates that the party decided to take action against after they voted in favour of the 26th Constitutional Amendment, against their party stance.\n\nEarlier in the week, a man was killed and two women were wounded after a mortar shell fired from Afghanistan’s side hit their house in the hilly area of Bajaur district’s Salarzai tehsil, police and residents said.\n\nIn April, four children were wounded when a mortar shell, fired from an undisclosed location, hit a house in the Lowi Mamund tehsil in Bajaur.\n\nAlso in April, eight people, including three security personnel and five residents, were injured after a roadside bomb targeted a vehicle of the Frontier Corps in the same district.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/14142148fb8681d.jpg",
  "retrievedAt": "2025-08-20T03:56:30.243Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917102/no-casualties-as-rocket-fired-at-bajaur-house-of-pms-aide-mubarak-zeb",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T09:24:01.000Z"
}
