{
  "title": "Review of salary hike offered after outcry - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Ayaz Sadiq distances himself from unprecedented increase in salaries of speaker, Senate chairman\n• NA’s sound system develops fault ‘due to PTI’s protest’\n• Opposition continues to face ‘censorship’ as budget debate begins\n\nISLAMABAD: A key government minister on Friday announced that a decision to award an unprecedented and massive increase in the salaries and allowances of the National Assembly speaker, Senate chairman and their deputies as well as federal ministers, could be reviewed and potentially even withdrawn in the wake of widespread and ‘somewhat justified’ criticism.\n\nThe announcement was made by Federal Minister for Parliamentary Affairs Dr Tariq Fazal Chaudhry on the floor of the National Assembly during a debate on the federal budget, after Speaker Ayaz Sadiq distanced himself from the ongoing controversy, clarifying that neither he nor the finance committee of the house had any role in this decision.\n\nThe speaker even declared that he would have no objection, if the decision to increase the salaries was withdrawn.\n\nThe speaker gave the “explanation” while interrupting the opening speech of Opposition Leader Omar Ayub Khan when the latter was about to mention the issue.\n\n“Let me give an explanation. Neither the finance committee [of the house] nor the National Assembly has made this decision. Those who have done so, they can do so,” he said without elaborating, adding that those who could make a decision about the salaries of ministers, speaker or the Senate chairman, could even withdraw it.\n\n“There is no harm, if it [the raise] is withdrawn,” he said. However, the speaker said that the decision to increase the salaries of the members of the parliament had been made by the house finance committee, thus implying that it could not be reversed.\n\nThough, the speaker had not named any individual or institution, the parliamentary affairs minister while mentioning the issue, admitted that it was his ministry which had prepared a summary for the increase in the salaries of the ministers and the custodians of the two houses, stating that the summary was approved by the federal cabinet.\n\nThis assertion from the minister came as a surprise for many amid reports that Prime Minister Shehbaz Sharif has taken a notice of the increase in the salaries and a harsh criticism from Defence Minister Khawaja Asif, who is also a member of the federal cabinet.\n\nQuoting sources, the media had reported on Friday that the prime minister’s action came in the wake of widespread public criticism over the increase in the salaries of the custodians of the two houses from Rs205,000 to Rs1.3 million a month, besides huge increase in the allowance bringing the total financial benefit to over Rs2m a month.\n\nHowever, during the post-budget press conference on June 11, Finance Minister Muhammad Aurangzeb had defended the steep hikes — some as large as 550 per cent — in the salaries of the speaker, Senate chairman and ministers.\n\nThe parliamentary affairs minister in his speech declared that since there was a criticism in the “concerned quarters”, therefore, the decision to increase the salaries could be “reviewed and withdrawn”, stating “it is not impracticable.”\n\nAfter taking the whole responsibility on his shoulder by admitting that his ministry had sent the summary to the federal cabinet for the approval, Dr Chaudhry then stated that altho­ugh there was no big financial impact of the increase in the salaries of the MPs, ministers and the NA speaker and the Senate chairman, the government was ready to “rectify” the decision.\n\n“Due to the general feelings among the government employees and those [sections of the society] living below the poverty line having no resources and for whom we have not added so much in the budget as our hands are tied, we can try to rectify [the decision] which has sent a bad message and caused a bad taste”, said the minister.\n\nDr Chaudhry, however, said they had to make this accumulative increase in the salaries as there had been no raise in the salaries of the MPs and the ministers in proportionate to the constant increase in the salaries of the government employees in the previous budgets over the past many years.\n\nFaulty sound system\n\nEarlier, the proceedings of the lower house of the parliament on the opening day of the bud­get debate were marked by disruptions and a controversy when the speaker anno­unced that the microphones and sound system inst­alled on the first four rows of the house were not functioning after developing a technical fault due to the protest of the opposition PTI members during the budget speech of the finance minister on June 10.\n\nThe speaker also stated that the repair of the system would cost upto Rs350m.\n\nInterestingly, the opposition members had to come to the opposition leader’s seat to deliver their speeches as the NA Secretariat staff had made special arrangements to provide mic facility to the opposition members.\n\nInitially, the proceedings of the house were not telecast live on the national as well as official social media websites, including YouTube and Facebook, but as soon as the opposition leader finished his speech and the parliamentary affairs minister took the floor, the live transmission of the proceedings began on the official social media channels.\n\nThe speeches of the opposition members were completely censored.\n\nThe parliamentary reporters also faced difficulties in the coverage of the proceedings as the National Assembly Secretariat staff had removed the speakers placed at the press lounge, besides the transmission was also not available on the screens installed there. The journalists had to sit in the press gallery to take notes of the speeches.\n\nDue to complete censoring of their speeches, some of the opposition members, including Omar Ayub Khan, were seen making videos from their mobile phones during the proceedings.\n\nBudget debate\n\nMost of the speakers from both sides of the aisle delivered political speeches, instead of talking about budgetary measures.\n\nAll front treasury benches remained empty most of the time during the opposition leader’s speech in which he harshly criticised the government’s economic policies.\n\nThe opposition leader in his speech also talked about the alleged political victimisation of the opposition, and demanded immediate release of the “political prisoners, including Imran Khan.”\n\nAlleging that there was no independent media and judiciary in the country, Mr Khan demanded fresh elections in the country after carrying out some poll reforms.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684cc14e05eae.gif",
  "retrievedAt": "2025-10-12T03:34:22.965Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917024/review-of-salary-hike-offered-after-outcry",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T00:27:27.000Z"
}
