{
  "title": "Budget democratisation - Pakistan - DAWN.COM",
  "author": null,
  "content": "UNTIL about a decade ago, elected representatives in our national and provincial assemblies had no real role in the budget process except for collectively lending their names to the document’s approval.\n\nThe drafting of budget proposals had, of course, always been the exclusive domain of the executive, but even when proposals were laid before the elected Houses, there was hardly any meaningful opportunity for members to comprehend, let alone scrutinise, the budget documents running into thousands of printed pages, as the budget debate lasted for an average of just 10 days in the National Assembly (NA) and even less in the provincial assemblies.\n\nStanding committees of the legislatures were never involved in the process and there was no formal channel for legislators to give recommendations to the government at the drafting stage. In brief, the budget process in Pakistan was one of the least democratic about 10 years ago.\n\nAlthough serious weaknesses persist, there are at least three ways in which Pakistan’s budget process has been significantly democratised over the past decade or so.\n\nThe first serious democratic reform in the federal budget process was introduced in 2013, when the NA amended its Rules of Procedure and Conduct of Business and added sub-sections 6 and 7 to Rule 201, requiring each ministry and division of the federal government to share its Public Sector Development Programme with the relevant standing committee of the NA by Jan 31 each year. Each committee, under the amended rule, is then required to forward its recommendations on the PSDP to the concerned ministry or division by March 1, giving one month to each committee to formulate and share its recommendations. Each ministry or division is supposed to incorporate the recommended amendments in the PSDP.\n\nThere is ample room to introduce more democratic provisions in the budget processes.\n\nMinistries and divisions are under obligation to inform each committee whether or not the recommendations have been incorporated in the PSDP. In case they have not, the reasons are to be furnished by the ministry or division to the concerned committee.\n\nAlthough implementation of the amended rule has not been ideal during the past 11 years, public representatives now have a window of opportunity to shape the PSDP, which is the most important part of the budget from the point of view of parliamentarians and their constituents. The provincial assemblies have yet to amend their rules to replicate the procedure for public representatives to give their recommendations for provincial annual development plans.\n\nA landmark law, the Public Finance Managem­ent Act was passed by parliament in 2019 to prescribe the federal budget formulation process in detail. The Act was amended in 2020 to make it even more comprehensive. Prior to PFMA, there was no governing law to guide the budget process. This Act, beside many other provisions, made it mandatory for the federal finance minister to present and discuss the Budget Strategy Paper (BSP) containing the basic assumptions and strategies relating to the budget with the standing committees on finance of the NA and Senate and seek the input of elected representatives constituting these committees prior to the detailing of the budget proposals.\n\nGenerally, this interaction takes place in April each year after the federal cabinet approves the BSP. It may, however, be more useful if the sequence is reversed by seeking the standing committees’ input to the BSP prior to approval by the cabinet as this will give a greater opportunity to incorporate the committees’ point of view in the BSP. Even in its present form, the law provides a significant opportunity to elected representatives to review the key basis and parameters of the coming budget and make a contribution in shaping it. It is also important to frame a similar law in the provinces as well as to involve the finance standing committees in finalising the provincial budgets.\n\nThere are, however, two key aspects of the budget process in which three out of the four provincial assemblies have taken the lead over parliament. Three assemblies (Punjab, Sindh and Balochistan) had amended their rules to hold pre-budget sessions every year to solicit MPAs’ input before finalising the document.\n\nDuring the session, which lasts from three to five days, officials of the provincial finance department and planning and development board are present to take notes on the MPAs’ ideas. Following the session, a report is typically submitted by the government to the assembly giving information on the action taken on each point raised by the MPAs. The Punjab Assembly was the first one to amend its rules in 2010, followed by Sindh in 2013, and Balochistan in 2018.\n\nThe three provincial assemblies also took an innovative step to amend their rules for holding quarterly post-budget sessions to monitor the implementation of the actual receipts and spending and compare it with the budgeted figures. It is expected that not only KP Assembly but also the NA will shortly follow the example of the three other provincial assemblies to incorporate the pre- and post-budget sessions in their rules.\n\nAlthough parliament and the provincial assemblies have made efforts to democratise the budget processes in the past decade, there is ample room to introduce more democratic provisions. For example, parliament should seriously consider amending Articles 84 and 124 of the Constitution, which respectively give the federal and provincial governments carte blanche to modify the budget approved by the assemblies. These articles, in fact, run counter to the democratic principle of parliamentary sovereignty.\n\nThe NA and provincial assemblies may also amend their rules to increase the duration of the budget sessions so that the time for the budget debate is extended from the present average 10 days to around 45 days to facilitate the standing committees in scrutinising the budget related to their ministries.\n\nThe writer is the president of Pakistan-based think tank, Pildat.\n\nX: @ABMPildat\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/684cd1e30dc7e.jpg",
  "retrievedAt": "2025-10-12T03:34:45.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917036/budget-democratisation",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T01:38:03.000Z"
}
