{
  "title": "‘Declaration of war’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISRAEL’S provocative behaviour has, once again, brought the Middle East to the precipice of a full-blown war.\n\nThe Zionist state’s attack on Iran, which began early on Friday morning and was continuing at the time these lines were being written, has the potential of setting the already fragile region on fire, and sending the global economy into a tailspin. A large number of fatalities have been reported, including women and children, and residential areas have been hit along with military targets.\n\nAmong the victims have been the Iranian army’s chief of staff, as well as the head of the powerful Pasdaran, along with several senior scientists. Several Iranian cities have been attacked, indicating that Israel had deep intelligence about key Iranian facilities and personnel. It is no wonder that Tehran has termed Israel’s reckless attack a ‘declaration of war’.\n\nTel Aviv has said it attacked Iran because of the supposed threat it posed to “Israel’s very survival”. This is contrary to the facts. It has been Israel that has constantly been provoking Iran. The bombing of Iranian diplomatic facilities in Damascus as well as the assassination of Hamas leader Ismail Haniyeh in Tehran last year, which resulted in two separate Iranian missile and drone barrages targeting Israel, are proof.\n\nIn fact, Israel has continuously been threatening regional peace for decades by attacking and pillaging other countries. Over the last few years, along with the murderous rampage in Gaza, Israel has attacked Syria, Lebanon, Yemen and now Iran. So Tel Aviv’s ‘self-defence’ alibi is hardly believable. The plain truth is that Israeli behaviour is a threat to world peace.\n\nThere has been condemnation of the Israeli attacks from several states, particularly the Muslim bloc. The Pakistani leadership as well as parliament have denounced Tel Aviv’s aggression and expressed solidarity with Tehran.\n\nYet others see the aggression differently; for example, US President Donald Trump says the offensive was “excellent” and has boasted that there is more in store. But he has also perplexingly asked Iran to return to the negotiating table. It is unlikely Iran will negotiate with a gun to its head. The Iranian leadership has promised to avenge the attack. It should be remembered that Iran has survived a brutal eight-year war with Iraq, and the Iranians are adept at playing the long game.\n\nIsrael has threatened that the attacks will continue for as long as needed; the Iranians may just take them up on the ‘offer’. The world stands at a very dangerous crossroads here. If the US joins in the ‘defence’ of Israel, matters may spiral out of control. The UNSC is meeting to address the issue, and though expectations should be modest, full efforts are needed to stop this new war.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:56:30.299Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917040",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T01:38:16.000Z"
}
