{
  "title": "PPP given over Rs26tr yet Sindh has remained poor, says PTI leader - Pakistan - DAWN.COM",
  "author": null,
  "content": "LARKANA: The Pakis­tan Tehreek-i-Insaf Sin­dh’s president, Haleem Adil Shaikh, has said that Paki­s­tan Peoples Party has received over Rs26 trillion during its back to back governments in the province yet Sindh remains in the grip of poverty, inflation and lawlessness.\n\nShaikh, who is former opposition leader in Sindh Assembly, said during his address to members of the District Bar Association on Friday that supremacy of Constitution and rule of law had been deliberately eroded and the 26th Amendment had been used as a tool to weaken judiciary and place it under the control of fraud politicians.\n\nHe criticised the state of constitutional governance, judicial independence and rampant corruption in Sindh and said the 26th Amendment was imposed through coercive means, which included abduction of [parliamentarians’] women, to curb constitutional protections.\n\nHe slammed the Prevention of Electronic Crimes Act (Peca), describing it as a draconian law designed to muzzle freedom of expression. Now a conspiracy was afoot to bring in the 27th Amendment, which could unlawfully extend tenure of current assemblies by another five years, he warned.\n\nHe urged legal community to revive their historical role of defending constitutional rights and said it was again responsibility of lawyers to resist the unconstitutional attempts and restore judicial independence.\n\nHe lambasted PPP over its ‘unprecedented corruption and administrative failure’ and said that over Rs10,000 billion financial irregularities and corruption in public funds had been reported in Sindh. Literacy rate in Sindh stood at a dismal 57.54 per cent and even this day more than 7.8 million children remained out of school, he pointed out.\n\nIn health sector, Shaikh lamented lack of basic medicines and ambulances in government hospitals and claimed that public sector jobs were being sold to the highest bidders.\n\nHe accused the PPP-led provincial government of pillaging Sindh’s natural wealth.\n\nMillions of acres of forest land had been encroached upon with total illegal occupation exceeding 2.8 million acres.\n\nEarlier, Ghulam Mus­tafa Magsi, general secretary of Larkana DBA and Javed Buledi welcomed the guest and presented him traditional gifts of Sindhi Topi and Ajrak.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:56:33.182Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916954/ppp-given-over-rs26tr-yet-sindh-has-remained-poor-says-pti-leader",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T00:28:02.000Z"
}
