{
  "title": "CPNE rejects Punjab’s awareness, information bill - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Council of Pakistan Newspaper Editors (CPNE) and the Pakistan Tehreek-i-Insaf have rejected the proposed Punjab Public Awareness and Dissemination of Information Bill 2025, terming it an attempt to gag journalists by denying them the right to question.\n\nSpeaking to Dawn, CPNE President Kazam Khan said the proposed law was an attempt to give legal protection to lavish public money spending for personal publicity. “The proposed law, after enactment, will allow the rulers to use public money for political gains and even launch unelected politicians’ advertisement campaigns,” he observed.\n\nMr Khan said the proposed law would be in conflict with the Supreme Court decisions and impact the proceedings of cases in courts.\n\nCommenting on the provision of lodging complaint with the Director-General of Public Relations (DGPR) and further appeal before the Punjab information secretary, the CPNE president said how the DGPR, who is the authority to allow launch of any advertisement campaign, can hear a complaint against himself and “decide against his own decision”.\n\nSimilarly, he said, the information secretary too was subservient to the political leadership.\n\n“The proposed law embodies classic censorship, stripping citizens of their right to question. Appeals against government campaigns will ironically be adjudicated by government officials themselves – a clear conflict of interest. The implications speak for themselves,” he commented.\n\nIdentifying another anomaly, the CPNE president said the bill proposed to take effect from Jan 1, 2024 when this government was not even formed and suggested covering some period of the caretaker government. “It’s concerning that it prohibits questioning about personal advertisement expenditures. This isn’t just censorship — it’s outright suppression of free speech,” he said.\n\nThe bill, tabled by the information minister in the Punjab Assembly on Thursday, was referred to a standing committee for one month, Mr Kazam stated. “The government is poised to enact the bill into law on Monday — after hasty approval by the committee.”\n\nIn a shocking display of legislative efficiency, he said, the Punjab information minister revealed that the bill was dispatched to the standing committee for review, “only to be deemed totally in accordance with law and in the interest of public”.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:56:59.458Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917007/cpne-rejects-punjabs-awareness-information-bill",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T00:27:39.000Z"
}
