{
  "title": "Khanewal sanitary worker dies after inhaling toxic emissions in manhole - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: A sanitary worker died and another fell unconscious after inhaling toxic gasses while cleaning a manhole at village 41/10-R in the suburbs of Khanewal city.\n\nAs per the sanitary inspector, two workers entered a manhole at the village to clean it.\n\nAs they were cleaning the manhole, they fell unconscious because of inhaling toxic gasses accumulating there.\n\nThe sanitary inspector said that sensing the situation, the workers were pulled up with a rope tied to their bodies.\n\nHe said that one of the workers, Roshan Maseeh, later died, while the other was shifted to hospital.\n\nTRADERS: The Muttahida Markazi Anjum-e-Tajran, Bahawalpur, has rejected the federal budget, terming it anti-people.\n\nAt a media talk, traders’ leader Hafiz Khurram Saleem regretted that contrary to the government’s assurance, the federal budget did not prove friendly for the traders and shopkeepers.\n\nHe regretted that the budget brought no relief for the traders and the common people.\n\nHe condemned the additional tax on solar plates, pushing their prices up.\n\nTWO DIE: A woman and a minor girl died, while two men accompanying them were injured when the motorcycle they were riding was run over by a trailer near mauza Dhurkot, Ahmedpur East.\n\nAccording to Rescue 1122, four persons were on a motorcycle when it was run over by a speeding trailer. As a result, a woman identified as Shabana (30) and a two-year-old Misbah died. Two men who were accompanying them were injured in the incident.\n\nThe bodies were shifted to Khairpur Daha Rural Health Centre.\n\nPolice are trying to trace the trailer driver who fled the scene.\n\nMURDER: A woman allegedly killed her husband in connivance with her male friend at village No 271/WB in Mailsi tehsil of Vehari district.\n\nAccording to police sources, one Asif was employed by Allah Rakha, who developed relations with his (Asif’s) wife Sidra Bibi.\n\nOn Friday, Sidra and Allah Rakha allegedly tortured Asif to death.\n\nDuring investigation, Mitroo police found Sidra and Allah Rakha guilty and arrested them for Asif’s murder.\n\nFIRING: A man was killed and another was injured when unidentified persons opened fire on them at village 78-15-L in Chamb Kalan, in Mian Channu police station limits.\n\nAs per police sources, unidentified attackers opened fire on Abdul Mannan (30) and Belal (35) at the village. As a result, Mannan died on the spot while Belal was seriously injured.\n\nThe body and the injured man were shifted to Mian Channu Tehsil Headquarters Hospital.\n\nIUB: The graduation ceremony of the passing-out students of the Islamia University’s department of world religions and interfaith harmony was held at the varsity on Friday.\n\nThe students, who passed MS and BS programmes were awarded certificates of appreciation during the ceremony.\n\nSpeaking on the occasion, VC Prof Dr Muhammad Kamran, who presided over the event, said the department could play a significant role in the promotion of the universal teachings of Islam at the global level.\n\nHe asked the teachers to engage students in research to promote Islamic teachings throughout the world.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:34:41.859Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917048/khanewal-sanitary-worker-dies-after-inhaling-toxic-emissions-in-manhole",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T03:14:17.000Z"
}
