{
  "title": "NA panel okays cash withdrawal hike, rejects online sales tax - Business - DAWN.COM",
  "author": null,
  "content": "• Tax relief for low-income salaried individuals reversed by cabinet, says FBR chief\n• PIA re-enters privatisation process, confirms finance minister\n• Tax on Google, YouTube services increased from 10pc to 15pc\n• 4pc tax on commercial rental income deferred\n\nISLAMABAD: The National Assem­bly’s Standing Committee on Finance and Revenue has approved an increase in the minimum threshold for daily cash withdrawals, raising it from Rs50,000 to Rs75,000 while rejected a separate proposal to impose an additional 2 per cent sales tax on online purchases, signalling resistance to new digital levies amid growing e-commerce activity.\n\nChaired by MNA Naveed Qamar, the committee also gave its nod to increasing the withholding tax rate on cash withdrawals — from 0.6pc to 0.8pc. However, the committee struck down a parallel proposal to raise the tax from 15pc to 20pc on loan profits earned by banks.\n\nAmong other decisions, the committee endorsed the government’s proposal to increase the tax on services provided by digital platforms such as Google and YouTube from 10pc to 15pc. A separate proposal to levy a 4pc tax on rental income from commercial properties, however, was deferred for further deliberation.\n\nThe committee also turned down a contentious proposal that would have mandated all sales of Rs200,000 to be conducted through banking channels — a measure critics argued could burden small traders. Meanwhile, it approved an amendment excluding rental income from being adjusted against business losses.\n\nThe committee also registered strong opposition to the phased withdrawal of tax exemptions for the former Federally and Provincially Administered Tribal Areas (Fata and Pata).\n\nTerming the move an “economic assassination” of small-scale enterprises in the region, Mr Naveed urged the Federal Board of Revenue (FBR) to revisit the decision. He emphasised the need to safeguard livelihoods and stimulate economic recovery in historically underserved areas, directing the FBR to explore avenues for continued fiscal relief tailored to local realities.\n\nA significant time of the committee’s proceedings was consumed by debate over conflicting tax rates proposed for low-income salaried individuals. While Finance Minister Muhammad Aurangzeb, in his budget speech, announced a 2.5pc tax rate for annual incomes ranging from Rs600,001 to Rs1.2 million, the Finance Bill 2025 instead reflected a lowered rate of 1pc.\n\nFBR Chairman Rashid Mahmood Langrial told the parliamentary committee that the federal cabinet has reversed the proposed tax relief for low-income salaried individuals.\n\nThe newly appointed minister of state for finance, Bilal Azhar Kayani, defended the government’s decision, offering justification for the withdrawal of relief to lower-income salaried individuals. Citing revised estimates, he noted that public sector salaries were raised by 10pc — a significant upward revision from the earlier projection of 6pc.\n\nHowever, the members observed that the salary bump would benefit only government employees, while the upward tax adjustment would disproportionately impact private sector earners who remain outside the scope of the pay increase.\n\nMr Qamar voiced concern over the cabinet’s handling of the tax rate increase, questioning the rationale behind approving a higher tax burden on low-income salaried individuals.\n\nFBR transformation plan\n\nMr Langrial briefed the committee on the FBR transformation plan, whose implementation will start from December.\n\nSome members of the parliamentary committee expressed reservations about the effectiveness of the Faceless Assessment System operational in Karachi, flagging mounting complaints over excessive charges, prolonged processing delays and resultant demurrages.\n\nLawmakers also raised concerns over the misapplication of the Digital Production Tracking and Digital Invoicing System.\n\nThey pointed out persistent errors by the tracking mechanism in differentiating between old, used and scrap materials — an issue they claimed was leading to unwarranted compliance penalties.\n\nIn response, the FBR noted ongoing instances where usable goods were allegedly being falsely declared as scrap, suggesting intentional misreporting by some stakeholders.\n\nThe FBR chairman informed the parliamentary committee that tax evasion in Pakistan’s cigarette and tobacco sector has reached an alarming Rs295 billion annually.\n\nHe said the FBR plans to introduce stricter enforcement mechanisms to curb widespread non-compliance in the industry.\n\nMr Langrial also highlighted concerns within the cotton and textile sector, noting that sales tax declarations remain significantly underreported.\n\nHe also listed several other sectors for low tax payments. He said that there is a tax gap of Rs7.1 trillion in the current fiscal year.\n\nHe said that smuggling through the Chagai border in Balochistan remains a major concern, contributing to an estimated Rs500bn in annual revenue losses. He noted tighter enforcement across other border regions and announced plans to introduce a cargo tracking system in the next fiscal year.\n\nTo bolster monitoring, digital screening technology will be installed at 22 key Indus River bridges, enabling remote vehicle checks from up to 20 kilometres away. Mr Langrial assured that the system will not hinder legitimate business activity.\n\nSenate committee on finance\n\nMeanwhile, in a separate session of the Senate Standing Committee on Finance, Finance Minister Aurangzeb briefed members on the economic outlook, budget measures and ongoing global challenges.\n\nHe confirmed that the World Bank had approved financing for the Reko Diq project, with the International Finance Corporation (IFC) contributing $700 million.\n\nDuring the meeting, Senators Ahmed and Abdul Qadir from Baloc­histan raised the issue of water scarcity in the province. Senator Ahmed urged the committee that the issue of clean drinking water was even more important than health and education problems.\n\nHe demanded the committee complete Kachhi Canal Project in Balochistan, which had been launched 25 years ago.\n\nMr Aurangzeb told the committee that the budget measures were fully endorsed by the IMF under tax enforcement commitments. He dismissed concerns over hurdles in opening letters of credit, calling such claims “misinformation”.\n\nOn privatisation, he acknowledged missed targets but confirmed that Pakistan Inter­na­tional Airlines has re-entered the privatisation process.\n\nAddressing agricultural taxation, he emphasised a shift in narrative — from claims that it could not be imposed to assertions that it it cannot be collected.\n\n“We will collect it — just give us the chance,” he said, adding that provinces will begin agricultural income tax collection from July 1, 2025.\n\nSenators also proposed increasing the retirement age of bureaucrats to ease pension pressures.\n\nIn response, Mr Aurangzeb noted that his previous institution had set retirement at 65, and the government would seriously evaluate the idea post-budget.\n\nPublished in Dawn, June 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:57:00.372Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1917022/na-panel-okays-cash-withdrawal-hike-rejects-online-sales-tax",
  "dateList": "2025-06-14",
  "date_published": "2025-06-14T00:27:27.000Z"
}
