{
  "title": "More than three quarters of Ehsaas benefits go to most rural women,  girls: Dr. Sania",
  "link": "https://www.app.com.pk/national/more-than-three-quarters-of-ehsaas-benefits-go-to-most-rural-women-girls-dr-sania/",
  "date_published": "2021-10-15T16:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar Friday said that more than three-quarters of the entire Ehsaas’ benefits go to most rural women and girls under the “Ehsaas 50%+ benefits policy for women and girls”.\nIn a message on the occasion of International Day of Rural Women, Dr. Sania paid tributes to all rural women in the country for their contributions towards reducing rural poverty.\nShe said that “Mazdoor Ka Ehsaas Report” released on May 1, 2021 strongly recognizes the work of rural women and home-based workers all over the country.\nNational Poverty Graduation Initiative of Ehsaas aims to graduate poorest households, particularly rural women out of poverty and set them on a course of economic and social prosperity.\nLaunched in July 2019, Ehsaas interest free loans for poverty graduation aims to impact 14.7 million vulnerable people in four years with half of them women, she said .\nOut of 1.4 million interest free small business loans disbursed so far, 46% went to rural women across 110 districts.\nDr. Sania said that the programme is steering the socio-economic transformation of women in remote areas, supporting them financially to establish small scale enterprises around petty trade, livestock, poultry and fish farming, agriculture, tailoring, embroidery and beauty parlors to improve their economic conditions.\nEhsaas policy framework and strategy explicitly recognizes the work of rural women involved in agriculture.\nEnabling 1.4 million individuals to come out of the shackles of poverty, 60% of small livelihood assets have been allocated for rural women under the 4-year Ehsaas Amdan programme.\nThe Rs 15 Billion programme is operational in 388 rural union councils of 23 poorest districts across the four provinces.\nEhsaas Amdan assets include livestock (goats, cows, buffaloes, and poultry), agricultural inputs, body of auto rickshaws, agriculture tools, cotton ginning machines and inputs for small retail outlets and enterprises.\nAll the eight million beneficiaries of the Ehsaas Kafaalat cash transfer programme and the Ehsaas Savings Wallets (One Women One Account financial inclusion initiative) are women, Dr. Sania said.\nIn 2020, during COVID-19 pandemic, Ehsaas delivered 54% emergency cash to women including those from rural areas.\nThis year 12 million women from underprivileged families are being paid Ehsaas cash.\nIn addition to the Ehsaas Education Stipends, Ehsaas Nashonuma, which provides specialised nutritional food and cash transfers to mothers and their children under two to prevent stunting in 15 most stunted districts, also has a higher stipend policy for the girl child, she said.\nUnder Ehsaas’ Undergraduate Scholarships, over 142,000 need and merit-based scholarships have been given to students in all districts of Pakistan, with strictly half of all scholarships reserved for girls.\nPart of Ehsaas framework, gender data disaggregation and its use for accountability is central to programme review, monitoring and reporting.\nThrough the Ehsaas Delivery Unit, the progress on the 50%+ benefits for women and girls’ metrics are stringently being monitored.\n“We must reimagine the role of rural women in the future workforce, which is being transformed by technology, digitization and burgeoning innovations”, she added..",
  "retrievedAt": "2025-08-11T21:28:14.228Z"
}
