{
  "title": "Fawad terms dissemination of fake news greatest challenge faced by media today",
  "link": "https://www.app.com.pk/national/fawad-terms-dissemination-of-fake-news-greatest-challenge-faced-by-media-today/",
  "date_published": "2021-10-15T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain said on Friday that the greatest challenge being faced by the modern media was dissemination of false propaganda through fake news.\nAddressing a seminar on “politics and journalism in the age of fake news” organized by Arab News he said that the phenomenon of fake news was created with the revolution in information technology and increase in media platforms.\nThe minister said the international community would have to prepare some rules to counter fake news and the aspect of responsibility would have to be added with freedom of expression.\nHe was of the opinion that there was a need of widespread debate on countering inside media organizations and there was dire need of proper training to those involved in this business.\nFawad Hussain said that a responsible media could be called an independent media.\nHe said that a section of media, especially in social media, was thriving on fake news and they wanted there should not be any restriction on fake news and baseless propaganda.\nThe minister said that the United States, United Kingdom and European Union had introduced online security rules and there was a need to move towards this direction.\nHe said that recently fake news was uploaded on social media claiming that in Pandora Papers leaks it was disclosed that the son of a Pakistani politician whose family had a history of money laundering and fake bank accounts, owned offshore companies.\nThe private media, he said, picked up the news without verification and the news went viral.\nThe minister said that former US President Barack Obama rightly said in 2013 that checking flow of information was the biggest challenge of the modern times as this was being used against political parties,governments and even countries.\nHe said that India had used non-political incidents for gaining political advantage. The minister said that a network of over 785 fake websites being run by India was exposed last year which was linked with Indian news agency ANI and leading news channels which used to generate fake news about Pakistan and tried to malign it.\nThese websites used to create and still had been creating fake news against Pakistan, he added.\nHe said that the Indian media tried to exploit the Noor Muqaddam murder case and Greater Iqbal Park incident to portray that Pakistan was not safe for women.\nHe said that it was traced that over 175 videos were generated on these incidents daily from Indian websites and tens of thousands of tweets were done and intelligence networks of some neighbouring countries supported this campaign.\nHe said that even Pakistani media became part of this vilification campaign without knowing facts.\nHe said that in 1996 in India Ajit Doval stage managed a fake incident of kidnapping of some tourists in an effort to link Kashmiris struggle with Islamic extremism.\nAfter this so-called incident, a vilification campaign was launched and claimed that Kashmiris freedom movement was linked to terrorism, he added.\nThe minister said Delhi had been declared as rape capital of the world a couple of years back and India tried to build a counter narrative to give an impression that such incidents also happened in other parts of the world.\nThe minister said that a twist was given to a news item and the difference between real and fake news was blurred  by the people involved in this unholy business.\nHe said that when the PTI came to power in the government, the digital media wing was very strong.\nThe minister said the PTI government had taken steps to modernize its digital media and digitalization of official news agency APP was done to ensure presence of national perspective on social media and digital platforms.\nHe said that during the recent crisis, in Afghanistan contradicting news were emerging but Pakistan tried to provide correct information to both national and international media outlets.",
  "retrievedAt": "2025-08-11T21:28:16.358Z"
}
