{
  "title": "Nation bears brunt of past regimes’ wrong policies in form of circular debt: Hammad",
  "link": "https://www.app.com.pk/national/nation-bears-brunt-of-past-regimes-wrong-policies-in-form-of-circular-debt-hammad/",
  "date_published": "2021-10-15T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP):Minister for Energy Hammad Azhar on Friday said the government and the people were bearing burden of energy sector circular debt due to expensive power generation contracts signed by the previous governments.\nAddressing a press conference flanked with Minister of State for Information and Broadcasting Farrukh Habib here, he said major component of circular debt was the capacity payment to the power plants, which now reached to Rs 700-800 billionfrom Rs 150 billion in 2013.\nHe said the circular debt would jump to Rs 2500-3000 billion by 2030, adding, the past regimes had set up unnecessary expensive power plants in the country.\nThe minister said today the entire nation was bearing the brunt of wrong decisions of the past governments, adding, the government of Pakistan Tehreek- i-Insaf (PTI) did not set up any such project.\nHammad said the Council of Common Interests (CCI) approved least cost basis Indicative Generation Capacity Expansion Plan (IGCEP) model based purely on open competitive bidding to cope with circular debt.\n“IGCEP model only allows power generation to be added when it is needed and on least cost basis,” he said.\nHe said if the the then government had enforced such model in 2013-15, today they were not facing problem of circular debt.\nThe minister said the government also introduced seasonal electricity package by abolishing peak hour tariff to utilize additional electricity available in the system.\nUnder the package, additional electricity used by the consumers would be Rs 5-6 per unit cheaper, he added.\nHe said the government had also shut down all old public sector power generation companies (GENCOs) that were running in losses besides it enhanced recoveries and controlled other losses.\nThe National Electric Power Regulatory Authority (NEPRA) had also reduced losses target from 15 percent to 13 percent for power distribution companies (DISCOs), he said.\nHammad Azhar said despite these measures, there was still difference of about Rs 1.50 per unit in purchase and sale of electricity.\nThe minister said the government had proposed NEPRA to increase Rs.139 per unit in tariff which would be applicable from November 1. However, the lifeline consumers would be exempted from the said raise, he said.\nHammad said the whole world, including America, China, Britain, India and European countries, was passing through energy crisis due to disruption in supply chains caused by the Coronavirus pandemic.\n“Due to COVID-19, gas supply lines have been disrupted too coupled with increase in the price and decrease in its non-availability,” he said.\nIn Britain, the minister said, the gas price had increased by 500 percent this year and 10 percent in most of the European countries.\nHe said the government had already procured 10 Liquefied Natural Gas (LNG) cargoes for consumption in November and December as compared to 11 of the same period last year, adding, there was no problem with delay in LNG tenders or imported gas.\n“The main problem is that the existing deposits of natural gas are depleting with the ratio of 9 percent annually for the last several years,” he said.\nDuring last 12 months, around 220 million cubic feet per day (MMCFD) gas flow had reduced on networks of the both the companies, Sui Northern Gas Pipelines Company and Sui Southern Gas Company.\nBesides, the network of domestic gas consumers had been increased significantly, which also started additional 130 MMCFD gas.\nHammad said the main reason of gas shortage was depletion of local gas reservoirs, for which the government would review all the ongoing schemes for residential consumers.\nHe said currently around 28 percent population of the country had the facility of natural gas through pipelines, adding, the two existing Regasified Liquefied Natural Gas (RLNG) terminals were operating at their full capacity to meet the country’s overall energy needs.\nHe said there was an annual loss of Rs 35-40 billion due to injection of imported RLNG gas in the system and the loss would further mount after the increase in its price at global level.\n“So, we are now going to change the pricing mechanism under which the imported gas will be injected in the domestic pipelines. With this the companies will charge the bill accordingly and avoid their losses,” he added.\nExplaining, he said, the government was going to amend the law called ‘weighted average cost of gas’ soon. “Unless, the pricing mechanism is not introduced, we are halting all the ongoing schemes and domestic connections.”\nThe minister said the previous government played havoc with the energy sector by not taking effective measures to meet future needs of the country.\nHe said the government had awarded licenses for construction of two new RLNG terminals, besides working to increase the commodity supply capacity to meet the ever-growing demand of gas in the country.\nReplying to a question, Hammad Azhar said there would be no compromise on the food security, so efforts would be made to ensure un-interrupted gas supply to fertilizer factories.\nReplying a query, Minister of State for Information and Broadcasting Farrukh Habib said the government had given Rs 24 billion subsidy to utility stores for providing relief to common man, contrary to Rs 850 million subsidies given by Pakistan Muslim League -Nawaz (PML-N) government in 2018.\nHe said the PML-N government plundered the national wealth by initiating expensive power generation projects without taking into consideration the consumers’ demand.\nHad these projects were meant for the factories of PML-N leadership, the expensive projects would not have been signed?, he remarked.\nNow, he said, the nation was bearing the brunt of all wrong decisions taken by the PML-N government in the form of mounting circular debt.\nHe said the incumbent government signed an agreement with Qatar at the ratio of 10.4 percent for spot buying of LNG, which greatly helped to save the public money.",
  "retrievedAt": "2025-08-11T21:28:15.583Z"
}
