{
  "title": "President IIUI inaugurates CMS",
  "link": "https://www.app.com.pk/national/president-iiui-inaugurates-cms/",
  "date_published": "2023-02-27T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): President International Islamic University Islamabad (IIUI) Dr. Hathal Homoud Alotaibi here on Monday inaugurated the Campus Management System (CMS) at the University’s campus to realize the strategic plan and vision of digitalize the University and its campus management system.\nAddressing the participants, the President IIUI said tat today was a historical day in the history of IIUI as he was happy to congratulate our community because the University had achieved a major breakthrough towards digitization by launching the Campus Management System. “I appreciate the efforts of the team that worked untiringly for the success of this task” Dr. Hathal said.\nHe said that the new campus management system was a major component in the implementation of the University’s strategic plan and reflected the high relevance IIUI attaches to international level teaching, learning and positive administrative reforms.\nEarlier, Dean FET , Nadeem Ahmed Sheikh gave a detailed briefing about the CMS, its benefits, its present stage and its outcomes in future. He also gave a detailed overview of the roadmap of the university’s strategic plan and elaborated on the state of data that has already been incorporated in the system. He also apprised of the future strategy and utilization of this system to facilitate the students, teachers and administrative staff.\nThe participants also hailed the CMS, saying that it would pave the way to academic excellence as it will help in transparent monitoring in pursuit of academic excellence and successful administrative reforms.\nThe IIU President said, the faculties and students can use the campus management system for application and enrollment, planning of studies and the semester, and for examination and other allied tasks. It shall also help in monitoring the trajectory of the administrative procedures and workflow of the officials, he added.\nHe informed that the campus management system would be made available in the form of a web-based interface.\nWhile appreciating the efforts of the CMS team, the IIUI President emphasized that their responsibility does not end here but their real work started from here as they had to ensure adoption of the system.\nHe urged the IIU community to take the ownership and adopt the system by cooperating with the IT team.\nHe said that this IT-based solution would facilitate a transparent, secure, enterprise-wide paperless system available to all administrators, academicians, students and research scholars as it interconnected all the major departments and institutes of the University.\nThe event was attended by the University’s Vice Presidents, Deans, DGs, IT officials and team members of the CMS.",
  "retrievedAt": "2025-08-11T06:12:55.593Z"
}
