{
  "title": "Strict measures cannot be avoided if coronavirus cases rise: CM",
  "link": "https://www.app.com.pk/national/strict-measures-cannot-be-avoided-if-coronavirus-cases-rise-cm/",
  "date_published": "2020-12-05T18:53:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 05 (APP):Punjab Chief Minister Sardar Usman Buzdar Saturday said that strict measures cannot be avoided if the number of coronavirus patients increased at the same pace in the province.\nAddressing a press conference at CM’s office here, he said the situation was quite dangerous, adding that the courts as well as National Command and Operation Centre (NCOC) had given decisions pertaining to public gatherings. The administration would take decisions regarding public gatherings according to the law, CM Buzdar said.\nThe CM reiterated that the government would take every step mandated by the law. He said that according to NCOC and courts’ decisions holding large gatherings was illegal.\nTo a question, he said that no one could hold a larger public gathering than Pakistan Tehreek-e-Insaf (PTI).\nHowever, he said that PTI stopped holding its public meetings in the wake of serious coronavirus situation.\nTo another question he said, “If anybody wants to move no confidence, it would be countered”.\nChief Minister Buzdar said the action was taken over violations of SOPs in various markets. However,he said that the government did not want to stop business activities and added that if Standard Operating Procedure SOPs were not being followed seriously then more strict measures would be taken. The chief minister expressed concern that the number of patients were increasing in hospitals.\nHe said the second wave of the COVID-19 resulted in 19941 positive coronavirus cases in the province and all the new cases surfaced during the last two months.\nHe said that 540 new cases and 22 deaths were reported during the last 24 hours. He said that 2 million and 60 thousand coronavirus tests had so far been conducted in Punjab, including 13,000 tests conducted the previous day.\nHe said that the ratio of positive coronavirus tests increased from 3 percent to 10 percent which was an alarming.\nHe said that more than 2000 smart lockdowns were imposed in Punjab, including more than 625 in Lahore.\nHe said that number of coronavirus patients in Lahore had increased and this city was on top of the list with regard to coronavirus patients.\nUsman Buzdar said the government was taking serious measures for protecting the people from coronavirus.\nHe said that even the makeshift hospitals for the treatment of COVID-19 patients have been made re-functional. Ventilators and other facilities were being provided in these hospitals, he said.\nHe said that funds of more than one billion rupees had been provided to the health department and all the teaching hospitals had been restored to their “position of June” , while High Dependency Units HDUs had been restored in the hospitals.\nThe chief minister said the order had been given to procure more anti-coronavirus injections.\n“Field hospitals of 300 oxygen beds have been reactivated in EXPO centre here”, he added.\nHe said that Punjab had 1400 ventilators out of which 600 had been reserved for the coronavirus patients.\nIn response to a question, the CM said that more good news would be given about the provincial capital soon, adding that major initiatives would be taken for the development of Lahore.\nProvincial Ministers Raja Basharat, Dr Yasmin Rashid and SACM on Information Dr Firdos Ashiq Awan were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:06:00.912Z"
}
