{
  "title": "SAPM Dar meets CM Buzdar",
  "link": "https://www.app.com.pk/national/sapm-dar-meets-cm-buzdar/",
  "date_published": "2020-12-05T16:01:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 05 (APP):Special Assistant to the Prime Minister (SAPM) on Youth Affairs Usman Dar called Punjab on Chief Minister Sardar Usman Buzdar at CM’s Office.\nMatters regarding mutual interest including political situation, affairs of the Tiger Force and the arrangements for Prime Minister Imran Khan’s visit to Sialkot came under discussion during the meeting.\nSAPM Usman Dar briefed the Chief Minister on Kamyaab Nojawan Programme and the performance of Tiger Force.\nHe also apprised him about the preparations made for Prime Minister Imran Khan’s visit to Sialkot.\nUsman Dar said that Kamyaab Nojawan Programme was a flagship project of Pakistan Tehreek-e-Insaf (PTI) government as the youth were being empowered through it.\nThe youth of the Tigers Force was our strength and it had set a new example by serving the people, he added\nUsman Dar said the PDM was engaged in a preposterous agenda of enemies of weakening the country. He said that opposition was hatching conspiracies to disable the national progress and prosperity.\nHe said the fake and impractical leaders of opposition were not aware about the situation.\nThe Chief Minister said that politics was not about spreading chaos and unrest but to serve the people selflessly. He slammed the opposition and said that the rejected elements wanted to create hurdle in the national development.\nThis gang of cabal had gathered only to save its corruption as they had nothing to do with the problems of a common man, Usman Buzdar maintained.\nHe said that the government was taking practical steps to protect the people from coronavirus but unfortunately, PDM was trying to foil government initiatives by holding public gatherings.\nThe destiny of these elements was nothing else but creating hue and cry and they would continue to do so.\nHe said that the government was not going anywhere and it will complete its tenure.\nThe youth of Tiger Force was actively participating in the welfare of the people and they have given their best in serving suffering humanity during the coronavirus pandemic.\nPrime Minister Imran Khan will never give NRO to those who looted Pakistan mercilessly, he added.",
  "retrievedAt": "2025-08-11T20:06:00.879Z"
}
