{
  "title": "Governor lauds setting up of 5,000 community emergency response teams",
  "link": "https://www.app.com.pk/national/governor-lauds-setting-up-of-5000-community-emergency-response-teams/",
  "date_published": "2020-12-05T14:14:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 05 (APP):Punjab Governor Chaudhry Mohammad Sarwar has appreciated the Punjab Emergency Service and its team for the establishment of over 5,000 community emergency response teams (CERTs) in all union councils of Punjab for saving lives and promoting safety.\nHe was addressing a prize/certificate distribution ceremony of the CERTs 2020, held here on Saturday.\nHe congratulated all volunteers on the International Volunteers Day and said that volunteers were great asset to their countries the world over.\nRescue volunteers assisted the government in food packs distribution among the deserving families during COVID-19. He also appreciated the Voluntary Service Overseas (VSO) Pakistan, which supported Rescue Service for organising the event and providing response kits to volunteer teams for promoting volunteerism in Pakistan.\nHe said that the foundation of Rescue-1122 was laid by Chaudhry Pervaiz Elahi, and Dr Rizwan Naseer played a great role in making Rescue-1122 the best institution. He said that he was always with Rescue Service whether he was in the government or opposition, because it was the service to humanity.\nPunjab Governor Ch Sarwar, along with DG Rescue-1122 Punjab Dr Rizwan Naseer, reviewed the volunteer team and presented certificates to all 39 participating volunteer teams. They presented cash prizes and trophies to the top three volunteer teams including Layyah with the first prize, Multan with the second and Kasur with the third prize.\nDistrict Layyah won the title “CERT of the Year” whereas Disaster Response Kits and personal kits among 24 members of CERTs and symbolic key of the Response Kits were also handed over to District Emergency Officers of Multan and Jhang.\nTalking to the media, Ch Sarwar said that the government had a clear policy and would not obstruct the Pakistan Democratic Movement (PDM) rally on Dec 13. The opposition wanted a confrontation with the government but Pakistan could not afford any confrontation. The opposition was pursuing a policy of playing with people’s lives and the nation would hold them accountable for it. Spike in corona cases is worrisome for all of us, he added.\nEarlier, Dr Rizwan Naseer welcomed all participants and paid rich tribute to all volunteers.\nPTI MPA Musarrat Jamshed Cheema and others were present.",
  "retrievedAt": "2025-08-11T20:06:02.335Z"
}
