{
  "title": "Privilege motions against President NBP and DG CAA referred to committee",
  "link": "https://www.app.com.pk/national/privilege-motions-against-president-nbp-and-dg-caa-referred-to-committee/",
  "date_published": "2023-11-13T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): The Senate Monday referred a privilege motion lodged by Independent Senator Naseebullah Bazai against the President of the National Bank of Pakistan (NBP) to the Committee on Rules of Procedure and Privileges.\nSenator Bazai, who heads a sub-committee addressing NBP employee issues, visited the bank’s head office along with two other committee members.\nHe called for the removal of the NBP president, alleging a lack of respect for members of the Senate.\nOther committee members including Senators Tahir Bizenjo (NP) and Shafiq Tareen (PkMAP) also criticized the NBP head’s behavior, advocating against assigning important portfolios to individuals with such attitudes.\nLeader of the House, Senator Ishaq Dar, condemned the NBP head’s conduct and suggested summoning officers to Parliament in the future with a proper mechanism in place.\nOther senators, including Senator Kamil Ali Agha, also supported taking appropriate action against the NBP head and making him an example.\nMinister for Interior Sarfraz Bugti emphasized the supremacy of Parliament and expressed the intention to raise the issue with the Prime Minister personally.\nChairman Senate, Sadiq Sanjrani referred the motion to the committee.\nHe instructed the Senate Secretary to send the motion to the Principal Secretary of the Prime Minister and the Ministry of Finance for action against the official.\nAnother privilege motion against Direction General Civil Aviation Authority regarding his misconduct with Senators Saleem Mandviwala and Faisal Saleem Rehman and Syed Muhammad Sabir Shah was also also referred to the committee.\nA privilege motion of PPPP Senator Taj Haider against misconduct of police official with him was also referred to the committee.",
  "retrievedAt": "2025-08-11T10:29:53.220Z"
}
