{
  "title": "3-day expo on Seerat-e-Tayyaba concludes",
  "link": "https://www.app.com.pk/national/3-day-expo-on-seerat-e-tayyaba-concludes/",
  "date_published": "2023-11-13T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP):A three-day educational ‘Seerat-e-Tayyaba Expo’ concluded here on Monday, highlighting the importance of being fully aware and guided by the life and teachings of Holy Prophet Muhammad (Peace Be Upon Him).\nUnder the auspices of US International Schools at Multi Garden B-17, the expo was held at PIPS Schools B-17 Campus Islamabad from November 11 to 13.\nA large number of people from various strata of the society, including teachers, students, parents, and political, social and academic personalities from different cities, including Rawalpindi and Islamabad, visited the exhibition to show their love for the Holy Prophet (PBUH).\nAccording to the organizers, the main objective of the exhibition was to highlight various aspects of the Holy Prophet’s life so that the people, particularly the youth, could follow his footsteps.\nDirector of US International Schools Dr Sumera Gull said the students and the staff of different schools put in a lot of hard work of weeks to prepare research papers, models and presentations to highlight the Holy Prophet’s life and teachings.\nThe Makki and Madani periods of the Holy Prophet (PBUH) life, Ghazwat, Hajjatul Wida, Treaty of Hudaybiyah, Hijrat (Migration), Miraj-ul-Nabi, Ghar-e-Hira and Gha-e-Sor were particularly highlighted through models, presentations and research papers, she added.\nAll Pakistan Colleges and Academies Association Chairman Rana Ansar Mahmood appreciated the organizers for holding a unique exhibition, which was a good effort to make the new generation aware of the Seerat-e-Tayyaba.\nHe said following every aspect of the life and teachings of the Holy Prophet (PBUH) would bring about a significant change in one’s personal life as well as the country’s development.\nThe characteristics like tolerance, patience, struggle, honesty, truthfulness and above all ‘the fear of the Almighty’ should be inculcated by all for success in the life here and hereafter, he added.\nRana Ansar Mahmood said the Holy Prophet (PBUH) through his teachings and practical life revolutionized the lives of the people of an astrayed Arab society and transformed them into a position to rule the world.\nVarious placards and posters were also displayed at the exhibition to highlight the Palestine issue and the current situation in Gaza, whose residents were suffering from the worst Israeli bombardment.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:30:17.304Z"
}
