{
  "title": "World Children’s Day to be marked on Friday",
  "link": "https://www.app.com.pk/national/world-childrens-day-to-be-marked-on-friday/",
  "date_published": "2020-11-19T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 19 (APP): Like other parts of the globe,United Nations’ (UN) Universal Children’s Day will be marked on November 20 across the globe including Pakistan to promote international togetherness and awareness among children worldwide.\nUNICEF, the United Nations Children’s Fund, promotes and coordinates this special day, which also works towards improving children’s welfare.\nWorld Children’s Day is UNICEF’s annual day of action for children, by children.\nAccording to UNICEF, this year, the COVID-19 crisis has resulted in a child rights crisis. The costs of the pandemic for children are immediate and, if unaddressed, may last a lifetime.\nIt’s time for generations to come together to reimagine the type of world we want to create. On 20 November, kids will reimagine a better world.\nUniversal Children’s Day promotes the welfare of and understanding between children.\nMany schools and other educational institutions make a special effort to inform children of their rights according to the Declaration of the Rights of the Child and the Convention on the Rights of the Child.\nTeachers stimulate their pupils to think about the differences between themselves and others and explain the idea of “rights”.\nIn countries where the rights of children are generally well-respected, teachers may draw attention to situations in countries where this is not the case.\nIn some areas UNICEF holds events to draw particular attention to children’s rights. These may be to stimulate interest in the media around the world or to start nationwide campaigns, for instance on the importance of immunizations or breastfeeding.\nMany countries, including Canada, New Zealand and the United Kingdom, hold Universal Children’s Day events on November 20 to mark the anniversaries of the Declaration of the Rights of the Child and the Convention on the Rights of the Child.\nHowever, other countries hold events on different dates, such as the fourth Wednesday in October (Australia) and November 14 (India). Universal Children’s Day is not observed in the United States, although a similar observance, National Child’s Day, is held on the first Sunday in June.\nOn December 14, 1954, the UN General Assembly recommended that all countries should introduce an annual event from 1956 known as Universal Children’s Day to encourage fraternity and understanding between children all over the world and promoting the welfare of children.\nIt was recommended that individual countries should choose an appropriate date for this occasion.\nAt the time, the UN General Assembly recommended that all countries should establish a Children’s Day on an “appropriate” date. Many of the countries respected this recommendation and the Universal Children’s Day has since been annually observed on November 20.\nThere are however, some countries, such as Australia and India, which still chose various different dates during the year to celebrate this day.\nOn November 20, 1959, the UN General Assembly adopted the Declaration of the Rights of the Child and on November 20, 1989, it adopted the Convention on the Rights of the Child.\nSince 1990, Universal Children’s Day also marks the anniversary of the date that the UN General Assembly adopted both the declaration and the convention on children’s rights.",
  "retrievedAt": "2025-08-11T20:02:07.665Z"
}
