{
  "article_id": "2025-03-10_e65e3292408cfb12c9bd0416ddd09dbe",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/twin-cities-abuzz-with-eid-preparations-as-second-ashra-commences/",
    "retrieved_at": "2025-08-27T13:32:17.388Z"
  },
  "metadata": {
    "title": "Twin cities abuzz with Eid preparations as second ashra commences",
    "author": null,
    "date_published": "2025-03-10T09:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 312,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 10 (APP):As the second ashra of Ramazan commences, Eid preparations have shifted into high gear in the twin cities of Rawalpindi and Islamabad. The streets were abuzz with activity, and the festive atmosphere was palpable. Residents were thronging markets and shopping centers to purchase new clothes, shoes, and accessories for the upcoming Eid-ul-Fitr celebrations. The city administrations have also swung into action, with sanitation teams working to ensure that the streets and markets are clean and tidy for the Eid celebrations. Kosar Tareen a local resident said aIam excited to buy new clothes and shoes for my family and Eid is a time for celebration and joy, and I love the festive atmosphere in the markets.a She said Eid shopping was a family tradition for them adding that they love coming to the markets together and finding new things to wear and decorate our home. The markets were so crowded and lively during Eid shopping season and itas a great time to catch up with friends and family whileA shopping,she stated. Zaheer, clothing store owner said aEid is our busiest time of the year and we start preparing months in advance to make sure we have enough stock to meet the demand.a He said their sales increase by at least 50% during Eid adding that itas a great time for business, and they are grateful toA customers for their support. He further stated that they love decorating store for Eid adding that Itas a great way to get into the festive spirit and attract customers. He added Eid is a time of celebration and generosity and they offer special discounts and promotions toA customers during this time. aWe work hard all year round, but Eid is the highlight of our business. We enjoy serving our customers and helping them find the perfect gifts and outfits for the occasion, he stated.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}