{
  "title": "Pakistan to share its COVID-19 experience at a high-level CGD event",
  "link": "https://www.app.com.pk/national/pakistan-to-share-its-covid-19-experience-at-a-high-level-cgd-event/",
  "date_published": "2020-09-21T09:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP):Pakistan will feature its COVID-19 response at a high-level event titled ‘Coping with COVID-19: The Pakistan Experience’ on Tuesday to be hosted by the Center for Global Development (CGD), a think-tank based in Washington D.C. and London.\nIt has been observed that many countries, international development institutions and global experts have been struck by the exceptional experience of Pakistan during the period of COVID-19, said the official handout issued on Monday.\nPakistan has been able to demonstrate better outcomes than most other emerging market countries both in terms of being able to control the spread of the virus and in managing its economic consequence.\nThree government officials including Federal Minister for Planning, Development, Reforms and Special Initiatives Asad Umer, Special Assistant to the PM on Social Protection and Poverty Alleviation, Dr. Sania Nishtar and Governor of the State Bank of Pakistan Dr. Reza Baqir will speak at this high-level panel discussion.\nDr. Dania Nishtar will apprise the participants of the program about the country’s largest social safety program of Ehsaas.\nShe will highlight the challenges and outcomes of the Ehsaas Emergency Cash Program which was launched within 10 days of the lockdown.\nShe will share how Ehsaas Emergency Cash Program successfully disbursed 1.3 billion US dollars among those daily wagers and piece rate workers whose livelihoods were badly affected during the COVID-19 lockdown.\nThe discussion will be joined by Dr. Kalipso Chalkidou, who leads the Global Health team at CGD and has written extensively on the international response to COVID; and Dr. Alan Gelb, who has been leading a work stream on the use of digital ID systems in Pakistan and elsewhere to scale up the social safety net in response to the crisis.",
  "retrievedAt": "2025-08-11T19:49:29.924Z"
}
