{
  "title": "Terrorism, extremism, sectarian violence in name of religion declared anti-Islam",
  "link": "https://www.app.com.pk/national/terrorism-extremism-sectarian-violence-in-name-of-religion-declared-anti-islam/",
  "date_published": "2020-09-21T18:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Leaders of all schools of thought Monday said acts of terrorism, extremism, sectarian violence and murders were “anti-Islam.”\nThis was stated in a joint declaration issued at the conclusion of Wahdat-e-Ummat Conference held here at the Aiwan-e-Sadr and was attended by Ulema and Mashaikh belonging to various schools of thought.\nThe conference among others was addressed by President Dr Arif Alvi, Minister for Religious Affairs and Inter-Faith Harmony Pir Noorul Haq Qadri as well as Ulema and Mashaikh belonging to various schools of thought.\n“No Speaker, Khateeb, Zakir, Preacher will indulge in the disrespect or blasphemy of Prophets (AS), Ahle Bait, (RA), Sahaba-e-Rasool (RA), Khulfai-e-Rashideen (RA), Azwaj-e-Mutaharat (RA), Aima-e-Athar (AS) and Hazrat Imam Mehdi (AS), and if anybody indulges in this, all schools of thought announce their detachment from it. Such a person will be proceeded against under the law,” the declaration said.\n“No Islamic sect should be declared as non-believer and no Muslim or non-Muslim person should be declared as liable to extrajudicial killing, and the people belonging all religions and sects should lead their personal and religious lives in accordance with Pakistan’s Constitution,” it added.\n“There should not be any publication and distribution of books, pamphlets and writings, which promote hatred and hurt religious sentiments. Cassettes and Internet websites based on provocative and hate materials should be completely banned. Provocative slogans which promote hatred and hurt sentiments would be completed desisted, and Aima, Fiqh and Mujtahideen should be respected and not be disrespected,” the declaration said.\n“A joint public meeting will be held to express solidarity with each other,” it added.\n“Since besides the Muslims, non-Muslims also reside in Pakistan, as per Islamic Sharia, the protection of their worship places, sacred sites as well as life and property is also the duty of Muslims and the government. Therefore, those indulging in the disrespect for worship places of non-Muslims, their sacred places and life and property should be dealt with sternly by the government,” the declaration stated.\n“The government should get the implementation of National Action Plan without any discrimination,” it added.\n“As Paigham-e-Pakistan is a consensus document, consultation process for its legalization should immediately be initiated,” the declaration said.\n“With Fatwah (edict) having great importance in Islamic Shariah, only a Fatwah given in the light of Quarn and Sunnah will be credible. Immediate action will be taken against the Fatwahs, to be contrary to the teachings of Quran and Sunnah,” it added.\n“Elements involved in the disrespect of sacred personalities during or before Muharram-ul-Haram should be proceeded against immediately and the culprits be punished soon,” the declaration concluded.",
  "retrievedAt": "2025-08-11T19:49:26.749Z"
}
