{
  "title": "Indian media celebrated Nawaz”s anti-institutions speech at APC: Asad Umar",
  "link": "https://www.app.com.pk/national/nawaz-adopted-indian-narrative-against-state-institutions-asad/",
  "date_published": "2020-09-21T09:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP):Minister for Planning, Development and Special Initiatives Asad Umar said on Monday the Indian media celebrated Nawaz Sharif’s anti-state institutions address at the opposition’s all parties conference (APC).\nNawaz Sharif, he said, attacked almost all the state institutions, including the Pakistan Army and the National Accountability Bureau (NAB).\nAsad Umar was addressing here a press conference flanked by Minister for Foreign Affairs Shah Mahmood Qureshi, Minister for Information and Broadcasting Shibli Faraz, and Minister for Science and Technology Chaudhry Fawad Hussain.\nAsad Umar said the APC was given an extraordinary coverage by the Indian media, which manifested the fact that the enemy states were disturbed over Pakistan’s journey towards economic and political stability.\nHe said Pakistan’s armed forces had rendered a lot of sacrifices to make the country secure and peaceful. Some 150 army troops laid down their lives during the current year only. The erstwhile Federally Administered Tribal Areas (FATA) were now peaceful while the situation in Karachi was far better.\nHe said a special development package was unveiled recently for the port city and another one would be announced for Balochistan by Prime Minister Imran Khan soon.\nThe minister said Imran Khan had been advocating the solution of Afghan crisis through talks since long, which had now been accepted by the international powers and negotiations were underway to restore peace in that country.\nHe said the enemies did not want Pakistan coming out of the crises and moving fast on the path to development, and the opposition was working on their agenda.\nAsad Umar said the government and the Pakistan Army were working together for the country’s development, and they were handling all the crises, including the COVID-19 pandemic, locusts etc in close coordination.\nHe said the prime minster had repeatedly told the nation that the opposition’s politics of stealing the public wealth was at stake and they would get together to save the looted money.\nThe APC proved what the PM had predicted, he added.\nThe minister said it was an irony that the opposition did not talk about the the global issue of COVID-19. The incumbent government’s successes in controlling the pandemic were being commended across the world.\nAbout the legislation related to the Financial Action Task Force, he said the law was aimed at bringing the country out of the FATF’s grey list. There should have been no politicking over it, but the opposition tried to blackmail the government for an NRO (National Reconciliation Ordinance) in return for getting the relevant bills passed from the Parliament.\nHe said since they had failed in their attempts to get an NRO and were in panic particularly after the passage of anti-money laundering bill, they were now using various tactics to pressurize the government.\nTo a question, the minister said the CPEC Authority was being supervised by a best officer and under his supervision the China Pakistan Economic Corridor (CPEC) projects were moving forward fast.",
  "retrievedAt": "2025-08-11T19:49:30.782Z"
}
