{
  "title": "CM directs expediting of work on all ongoing mega schemes",
  "link": "https://www.app.com.pk/national/cm-directs-expediting-of-work-on-all-ongoing-mega-schemes/",
  "date_published": "2020-09-21T09:31:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Sep 21 (APP):Khyber Pakhtunkhwa Chief Minister Mahmood Khan Monday directed the authorities of the Communication and Works (C&W) Department to expedite work on all ongoing mega schemes in communication sector and assured that the provincial government would provide required resources for the purpose.\nHe particularly stressed upon the expeditious completion of financial and commercial feasibility studies of Swat Motorway phase-II, Peshawar-D.I.Khan Motorway and Dir Motorway so that public could be facilitated through such mega development projects as soon as possible.\nPresiding over a high level meeting of Communication and Works Department here in Chief Minister’s House, Mahmood Khan said the provincial government was committed to boost industrial and tourism activities in the province for which different Communication schemes had been initiated.\nThe meeting was attended by Special Assistant to the Chief Minister Riaz Khan, Principal Secretary to the CM Shahab Ali Shah, and other high officials.\nThe meeting was told that Executive Committee of the National Economic Council (ECNEC) had approved the acquisition of land scheme for Swat Motorway phase-II whereas public private partnership unit had recommended the financial and commercial feasibility of project.\nThe meeting was told that consultancy would be awarded next month for commercial and financial study of Dir Motorway. Similarly, financial and commercial feasibility of Peshawar-D.I.Khan motorway would be completed by the next month.\nThe meeting was apprised that PC-II of 29-km long road from Baba Sarai (Buner) to Katlang interchange had been prepared and would be submitted to relevant forum for approval.\nThe meeting was informed that under the Khyber Pakhtunkhwa Integrated Tourism Development Project (KITE), the work was in progress on 50-km long nine different access roads to tourist areas in Malakand division. Similarly, construction of five access roads to tourist areas in Hazara division was also part of current development portfolio whereas construction of 30-KM long approach road to Sheikh Badeen Tourist site had reflected in ADP 2020-21.\nThe meeting was told that so far 33 developmental schemes in road sector had been completed during financial year 2019-20. This time 114 schemes were due for completion in road sector and Rs 28522 million had been allocated for total 507 schemes in current Annual Developmental Program.\nBriefing about the progress made so far by Pakhtunkhwa Highways Authority, it was informed that the authority had constructed 170 km long new highways and 79 bridges.\nSimilarly, dualization of various roads having the total length of 272-KM had also been completed. In the current ADP, Rs. 1824.758 million had been allocated for 32 ongoing schemes of Pakhtunkhwa Highways Authority and Rs. 215 million had been allocated for six new schemes. Rs. 800 million has been allocated for five schemes under Accelerated Implementation Program of merged areas.\nThe meeting was also briefed about the reforms introduced by the communication and works department and told that e-bidding and e-billing system had already been introduced in the department whereas work on human resource development and restructuring of C&W department was in progress.",
  "retrievedAt": "2025-08-11T19:49:32.921Z"
}
