{
  "title": "PM appreciates Chinese leadership for socio-economic priorities",
  "link": "https://www.app.com.pk/national/pm-appreciates-chinese-leadership-for-socio-economic-priorities-2/",
  "date_published": "2020-09-21T17:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Prime Minister Imran Khan Monday lauded the Chinese leadership’s priorities for its people as the same had played a remarkable role in China’s socio-economic transformation.\nThere was a lot to learn from Beijing’s example of economic development and poverty alleviation, he said while talking to Chinese Ambassador Yao Jing, who paid a farewell call on him, according to a PM Office Media Wing press release.\nDuring the call, the prime minister lauded efforts of Ambassador Yao in further deepening and strengthening Pakistan-China “All-Weather Strategic Cooperative Partnership”.\nHe conveyed that the people of Pakistan were keenly looking forward to welcoming President Xi Jinping to their country.\nThe prime minister underlined that during the ambassador’s tenure, China Pakistan Economic Corridor (CPEC) had entered the second phase focusing on industrialization, agriculture and socio-economic development, and it would play a key role in promoting regional growth and prosperity.\nAmbassador Yao thanked the prime minister for the leadership role he had played in further solidifying and deepening Pakistan’s relationship with China, which was greatly valued by the Chinese leaders at the highest level.\nHe underlined that the prime minister’s vision and leadership was instrumental in Pakistan’s transformation.\nHe emphasized that with the prime minister’s personal focus on poverty alleviation and people-centered approach, CPEC had entered into its second phase, and would deliver substantial and immense benefits not only to the people of Pakistan but also the entire region.\nAmbassador Yao said Pakistan’s policy of “smart lockdown” in containing COVID-19 was internationally recognized and could be followed as a model by others to deal with its possible second wave.\nHe maintained that he would have very fond memories of Pakistan and would wish to see Pakistan-China relationship further strengthened.\nHe emphasized that China would continue to support Pakistan in pursuit of its national development and objectives.\nThe prime minister appreciated Ambassador Yao Jing’s overall contribution to the Pakistan-China partnership and wished him well in his future endeavours.\nAmbassador Yao Jing has served in Islamabad from October 2017 to September 2020. This was his third assignment in Pakistan.",
  "retrievedAt": "2025-08-11T19:49:26.727Z"
}
