{
  "title": "Opposition’s APC gathering of corrupts, looters: Murad Saeed",
  "link": "https://www.app.com.pk/national/oppositions-apc-gathering-of-corrupts-looters-murad-saeed/",
  "date_published": "2020-09-21T12:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Minister for Postal Services and Communication, Murad Saeed on Monday termed the opposition All parties Conference (APC) as a gathering of corrupt, looters and thieves.\nTalking to a private news channel, he said opposition was speaking language of enemies against the country and its law enforcement agencies.\nThe minister said Pakistan was included in the Financial Action Task Force (FATF) gray list during the Pakistan Muslim League Nawaz (PML-N) government.\nHe said Pakistan Peoples Party (PPP) and PML-N had destroyed national economy and institutions by adopting redundant policies during their governments.\nMurad Saeed said the present government under the dynamic leadership of Prime Minister Imran Khan had moved the country on the path of development and prosperity, adding the Pakistan Tehreek-e-Insaf (PTI) government was utilizing its all out efforts for improving economy and strengthening institutions through the prudent policies.\nHe said the prime minister had adopted comprehensive strategy to contain the coronavirus pandemic and the country emerged as successful to overcome on the pandemic with effectively.\nHe said World Health Organization (WHO) and other international community were praising the present government policies against coronavirus and advising the rest of world to learn from Pakistan for the purpose.\nReplying to a question, he said every sector of the country was improving under the charismatic and honest leadership of Prime Minister Imran Khan, adding international community was demanding from Pakistan do more before PTI government.\nHe said Pakistan had played a pivotal role for establishing peace in Afghanistan and it was acknowledged at world level.\nThe minister said the China Pakistan Economic Corridor (CPEC) project was moving forward with successfully and civil military leadership was on same page.\nHe said the prime minister had highlighted the Kashmir issue in the United Nations General Assembly (UNGA) session with courageously and in effective manner.",
  "retrievedAt": "2025-08-11T19:49:28.156Z"
}
