{
  "title": "Refrain from dragging state institutions into politics, Qureshi tells opposition",
  "link": "https://www.app.com.pk/national/refrain-from-dragging-state-institutions-into-politics-qureshi-tells-opposition/",
  "date_published": "2020-09-21T15:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 21 (APP): Foreign Minister Shah Mehmood Qureshi on Monday, while terming the all parties conference (APC) a ‘show of disappointment’, asked the opposition to “refrain from dragging state institutions into politics on the behest of Pakistan’s enemies”.\n“Governments come and go, but the opposition is in fact playing to the tunes of those desiring ill of the country,” the foreign minister said here at a news conference, flanked by Information Minister Senator Shibli Faraz, Planning Minister Asad Umer and Minister for Science and Technology Fawad Chaudhry.\nQureshi criticized the opposition’s open targeting of state institutions, including the army, the judiciary and the National Accountability Court (NAB), which, he said, was contrary to the national interest.\nThe opposition attacked an institution that always remained vigilant for defending the country’s sovereignty and laid immense sacrifices of lives.\nHe said the main motive behind the APC was the opposition’s failed attempt to get the National Accountability Bureau (NAB) rolled back.\n“For the opposition, the rollback of NAB is an NRO (National Reconciliation Ordinance) of the time,” he said, referring to the deal made to accommodate the financially corrupt in the past.\n“On being unsuccessful to pressurize Prime Minister Imran Khan for the NRO, the APC was called, which turned out to be a ‘mix of contradictions’,” he said, stressing that the government would not to succumb to any pressure in that regard.\nThe foreign minister said the people were wise enough to judge the mala fide behind the APC that levelled incorrect allegations against the government and criticized the foreign policy.\n“This is not a pain for democracy, but an expression of self-centred vested interests,” he said, terming APC an “insult to the voters’ mandate”.\nOn the opposition’s criticism of the Kashmir policy, he said the government effectively highlighted the issue of Jammu and Kashmir at all forums and supported the cause of its people.\n“In their (PML-N) tenure, the use of word ‘Kashmir’ was prohibited to appease the neighbouring India,” he recalled.\nThere was the ‘contradiction’ in the stance of opposition political parties, which were part of the unanimous passing of resolutions in the Parliament tabled by the government on the Kashmir, Qureshi said.\nThe foreign minister categorically rejected the opposition’s claims of winding up the China- Pakistan Economic Corridor (CPEC), which, he said, had successfully entered into the second phase.\nRecalling his meeting with his Chinese counterpart on August 21 in Beijing, Foreign Minister Qureshi said complete satisfaction was expressed from the other side over the pace of work on CPEC projects being carried out by the Government of Pakistan.\nHe said the opposition’s charge-sheet against economic situation was incorrect as Pakistan, even after the pandemic situation, was effectively recovering from the financial impact.\nHe mentioned that with the blessings of Almighty Allah, assistance by the friendly countries and an agreement with the International Monetary Fund (IMF), the country witnessed significant improvement in overall economic indicators.\nHe said the Pakistan Muslim League-Nawaz (PML-N) had left the country with an economic disaster that required time and strategy to deal with.\nOn the opposition’s call for a demonstration in January, Qureshi said those, who supported a strict lockdown, were planning a get-together as the world warned of the second wave of COVID-19 during the winter.\n“Giving resignations or not is up to them, but still there is enough time for them as usual to change their minds and end up with lame claims,” he said.\nThe minister said on the issue of Financial Action Task Force, the government put its best efforts to get the country out of grey list.\nThe opposition should “check within its ranks” to ascertain the cause of their embarrassment in the joint sitting of Parliament, he added.\nTo a question regarding any move to make Gilgit-Baltistan the fifth province, he said discussion would be held with the stakeholders keeping in view the longstanding demand of the people of GB.\nThe foreign minister said the world had acknowledged Pakistan’s role as a facilitator in restoration of peace process in the region.\nReferring to the peace deal inked between the United States and Afghan Taliban in Qatar’s capital Doha this February, he said Pakistan had to its credit the historic resumption of Intra-Afghan Negotiations.",
  "retrievedAt": "2025-08-11T19:49:26.751Z"
}
