{
  "title": "PM terms political stability vital for economic prosperity; advises political opponents not to create upheaval",
  "link": "https://www.app.com.pk/national/pm-terms-political-stability-vital-for-economic-prosperity-advises-political-adversaries-not-to-create-upheaval/",
  "date_published": "2022-12-17T06:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 17 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday termed political stability a vital condition for economic prosperity and ridding the people of price hike.\n“It is required for the sake of loyalty to Pakistan and allegiance, that there must be economic stability,” he said.\nIn a press statement shared by PM Office Media Wing, the prime minister said it was the desire of someone that Pakistan might be pushed into default, but neither it would happen, nor they would let it happen, Insha’Allah.\n“The people who had laid land mines in the economic foundations of the country, are out to do the same in the political foundations of the country,” the prime minister in a veiled reference to the political opponents of Pakistan Tehreek-I-Insaf, said.\nThe people who had hurt public confidence, were now out to dissolve assemblies, he said, adding their objective was to create political instability.\n“Political stability and economic charter can only strengthen Pakistan’s national solidarity,” he opined.\nThe prime minister vowed that they would rid the public of the problems of food inflation and employment like the way they delivered by removing ‘a liar and corrupt government’ with the power of the constitution.\nThe political miscreants by spreading anarchy wanted to force the world not to invest in Pakistan, besides hampering the efforts for rehabilitation of the flood-affected people, he added.\nHe said these political mischief makers were not concerned about the plight of flood-affected population and the efforts to save them from winter, hunger and diseases, as they were only self-centric and interested in their political interests.\nThe prime minister said for providing employment to the youth, it was necessary to get rid of ‘the political unemployed’.\nHe called upon the nation to ponder whenever the country was taken on the path of economic prosperity, why the wrongdoing junta suddenly swung into action!\n“There is no doubt that economic havoc was brought under an agenda and the political instability is a continuity of that action,” he opined.\nThe prime minister advised the political opponents to take pity on the condition of the people of Pakistan. To bring the public out of the curse of poverty and unemployment were the real politics, he observed.\nHe further said that during the past four years of the previous government’s tenure, the people had braced the economic turmoil and exhorted the PTI leaders not to create hurdles in the economic prosperity of the public.",
  "retrievedAt": "2025-08-11T16:01:54.733Z"
}
