{
  "title": "CM Afridi’s confrontational approach likely to plunge KP into governance turmoil: Experts",
  "author": null,
  "content": "PESHAWAR, Oct 21 (APP):As Khyber Pakhtunkhwa grapples with serious challenges, including terrorism, illiteracy, unemployment and the aftermath of devastating floods, many observers warned that Chief Minister (CM) Sohail Afridi’s confrontational stance towards the federation could plunge the province into deeper governance and security turmoil.\\n\\nIn a recent statement, CM Sohail Afridi announced his decision to return bulletproof vehicles, provided by the Interior Ministry, back to the federal government, sparking widespread criticism in KP. Many experts argued that such an irrational move may undermine the morale and operational capacity of the provincial police and counter terrorism department at a time of rising terrorist threats, especially in southern and tribal districts.\\n\\n“The decision of CM Afridi to return bulletproof vehicles amid a surge in terror incidents in southern and merged tribal districts is not only irrational but dangerous from a security point of view,” said Wajid Ali Khan, former provincial minister for Forests and Environment, while speaking to APP.\\n\\nHe emphasized the sacrifices made by the police in KP, including high-profile martyrs like FC Commandant Sifwat Ghayyur and DIG Malik Saad. “These vehicles, provided to protect our frontline officers, are vital in combating terrorism. The federal government’s support in this regard was highly commendable, and rejecting it would send a negative message,” he added.\\n\\nWajid Khan, a senior leader of the Pakistan Muslim League-Nawaz (PML-N), pointed out that many district-level police officers remain without secure transport in KP despite facing repeated attacks.\\n\\nHe accused the PTI-led provincial government of failing to equip police and civil armed forces adequately during its previous tenure, despite receiving over Rs600 billion in federal funds allocated for counter-terrorism efforts in KP.\\n\\nHe questioned where these huge anti-terror funds were utilized in KP, criticizing CM Afridi for acting more like a party figure than the chief executive of the province. “As CM, Sohail Afridi must build bridges with the centre, not burn them. The people of KP expect good governance and health relations with centre, not confrontation,” Wajid Khan stressed.\\n\\nProfessor Dr A.H Hilali, former chairman of the Political Science Department at the University of Peshawar, raised similar concerns, saying the Chief Minister’s decision to boycott official meetings and challenge the federal government’s decisions would serve nothing but add to KP problems.\\n\\n“With terrorism resurging in the wake of Fitnaul Khwarai attacks and governance already strained in KP, CM Afridi must choose whether to focus on public welfare or continue his confrontational path that may lead to Governor Rule.”\\n\\nDr Hilali said that the real test for CM Afridi will be how he handles pressing issues ranging from law and order to restoring cooperation with Islamabad, combating corruption, terrorism, illiteracy, unemployment and improving public service delivery. “His ability to bring transparency, counter corruption, and work across political divides will determine the success of his tenure,” he said.\\n\\nHe also emphasized the importance of addressing issues in the tribal belt, warning that Afridi’s approach could derail much-needed development efforts there. “Following Pakistan’s recent successful strikes on banned TTP hideouts in Afghanistan and the clear message from the military leadership that terrorism will not be tolerated, it is crucial that the provincial leadership aligns its strategy with national security priorities.\\n\\nDr Hilali suggested that CM Afridi’s policies may closely follow those of the PTI Chairman, especially after the CM’s anticipated visit to meet Khan in Adiala Jail. “Unlike his predecessor, Gandapur, who occasionally showed independent thinking, Afridi appears more inclined to toe the party line and in such a scenario, KP people will adversely suffer,” he observed, adding that Aleema Khan, sister of PTI founder, is expected to wield greater influence in KP affairs under Afridi’s leadership.\\n\\nReflecting on past PTI appointments, Dr Hilali said the PTI chairman’s decision-making on chief ministers has been inconsistent and illogical. While Pervez Khattak served successfully between 2013 and 2018, later choices like Mahmood Khan and Ali Amin Gandapur were marked by internal dissent and controversy. Gandapur’s ouster, he said, was partly attributed to his fallout with Aleema Khan following the events of November 24, 2024, when he allegedly abandoned a protest march mid-crisis.\\n\\nHe reiterated that PTI’s success in KP had historically rested on initiatives like Sehat Card and advocating viz a viz engagement in dialogue for peace in tribal areas, as efforts now overshadowed by deepening political strife and confrontation approach.\\n\\nHe questioned how talks would be held with terrorists, who were killing innocent people and attacking security forces in KP, adding there was no harm in engaging those unwanted elements, who laid down arms and surrendered before the government authorities without any condition.\\n\\n“Given the fragile political and security landscape in KP, Afridi’s next steps are critical. His actions will shape not only the future of KP but also PTI’s popularity trajectory,” Dr Hilali said. “If he pursues further agitation, such as another march on Islamabad as hinted in his inaugural address, it could deepen instability and the imposition of Governor’s Rule cannot be ruled out.”\\n\\nAs tensions mount, experts agree that only a shift toward constructive engagement with the centre and prioritization of governance over politics can prevent Khyber Pakhtunkhwa from descending into a deeper administrative and governance crisis.\\n\\nThe experts expressed the hope that CM KP will make decisions in the KP’s interest and focus on governance issues to address the above problems swiftly.\\n\\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:44:36.764Z",
  "source": "APP",
  "link": "https://www.app.com.pk/domestic/cm-afridis-confrontational-approach-likely-to-plunge-kp-into-governance-turmoil-experts/",
  "dateList": "2025-10-21",
  "date_published": "2025-10-21T16:22:00.000Z"
}
