{
  "title": "Sindhi for enhancing Pak-Turkiye cooperation in education, culture",
  "link": "https://www.app.com.pk/national/sindhi-for-enhancing-pak-turkiye-cooperation-in-education-culture/",
  "date_published": "2023-09-04T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): Caretaker Federal Minister for Education and Professional Training, Madad Ali Sindhi Monday emphasized enhancing cooperation between Pakistan and Turkiye in the fields of culture and education.\nHe was speaking during the event titled ‘One Hundred Years of Magnitude: Pak-Turk Affinity,’ organized by the National Institute for Historical and Cultural Research (NIHCR), Quaid-i-Azam University, and the Yunus Emre Institute, Turkish Cultural Center.\nThe minister stated that the fraternal relations between Pakistan and Turkiye were an unprecedented manifestation of brotherhood and love, which cannot be compared.\nHe said that the Muslims of the subcontinent actively participated in the Khilafat Movement and added that the new generation should be aware of their cultural identity.\n“We are proud that our region is home to the great civilizations of the world. Thousands of years ago, when the world was plunged into darkness, the civilization of Mohenjo Daro and Harappa were the cradles of knowledge and wisdom” he said.\nCaretaker Federal Minister for National Heritage and Culture, Jamal Shah while addressing the event said that a talented and creative mind was the hallmark of any nation. It is through the promotion of literature and art that nations come closer to each other and the intimacy between them increases.\nThe guest of honor, Ambassador of Turkiye, Prof. Dr. Mehmet Picaci said that Turkiye values and respects the evergreen relationship with Pakistan. In every field of life, both of them have supported each other wholeheartedly.\nHe said, “We should increase cooperation in education, health, tourism, and other matters of mutual interest so that the effectiveness and recognition of this relationship may become deeper and stronger.”\nSpeaking on the occasion, Vice-Chancellor, Quaid-i-Azam University, Professor Dr. Niaz Ahmad Akhtar (SI) elaborated on the profound connection between Pakistan and Turkey, rooted in the concept of ‘Tawheed’ a connection transcending time and space.\nHe highlighted the significance of the Memorandum of Understanding (MoU) signed between educational institutions in Pakistan and Turkey, foreseeing its benefits for students.\nDr Akhtar encouraged students to break free from the race for grades and to demonstrate their capabilities in practical fields.\nHe announced that Quaid-i-Azam University would soon offer advanced facilities for students interested in online business and attractive prizes to motivate outstanding students.\nDirector of Yunus Emre Institute, Prof. Dr. Halil Tokar stressed the strengthening of bilateral relations.\nReaffirming the strong ties between the two countries, the speakers emphasized the deep-rooted connection between the two nations and the need to expand cooperation in education and culture.\nDirector National Institute of Historical and Cultural Research, Centre of Excellence, Dr. Sajid Mahmood Awan underscored the importance of Memorandum of Understanding (MoU) , signed today between NIHCR and Yunus Emre Institute.\nHe said this step not only would promote creative and research aspects but students and scholars will also learn Turkish language to boost their abilities.",
  "retrievedAt": "2025-08-11T09:26:32.966Z"
}
