{
  "title": "Int’l workshop on “Advances in Nuclear Medicine and its Applications” from Sept 19",
  "link": "https://www.app.com.pk/national/intl-workshop-on-advances-in-nuclear-medicine-and-its-applications-from-sept-19-2/",
  "date_published": "2023-09-04T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 4 (APP):OIC Ministerial Sanding Committee on Scientific and Technological Cooperation (COMSTECH) in collaboration with Pakistan Nuclear Society (PNS) and Pakistan Society of Nuclear Medicine (PSNM) has planned to arrange an International Workshop on “Advances in Nuclear Medicine and its Applications” from September 19-20.\nAccording to the COMSTECH, the international and local experts of nuclear medicine and its applications will present lectures during the workshop while local faculty and researchers will share their research findings as contributed talks.\nThe theme of the workshop would be on the changing horizons of Nuclear Medicine, incorporating the translation of basic laboratory research to clinical practice, establishment of clinical and technical standards, and the translation of molecular technological advances in diagnostic and therapeutic nuclear medicine.\nNuclear technology has transformed health sector by advancements in diagnostic and therapeutic modalities for non-communicable pathologies.\nHybrid imaging, especially PET-CT has altogether changed the diagnostic horizon, especially in the management of cancer patients. However, not only Pakistan but most of the OIC countries are still lagging behind in hybrid imaging facilities, especially PET-CT imaging.\nThe indispensable role of PET-CT and hybrid imaging needs to be highlighted for the benefit of various stakeholders and patients.\nFurthermore, the emergent role of theranostics and advanced radionuclide therapies using alpha and beta emitters has given new insights in cancer treatment paradigms. These rapid advancements in the field of nuclear medicine warrant continual education of referring physicians, oncologists, nuclear physicians, medical physicists and technologists from OIC countries.\nClinical practitioners, Oncologists, Researchers and students in nuclear medicine and Medical technologists will attend the event which will be in hybrid mode.\nThe organizing committee of the event include Adviser COMSTECH, Prof. Dr. S. Khurshid Hasanain, President, Pakistan Nuclear Society (PNS), Dr. M. Tahir Khaleeq, Vice President, Pakistan Nuclear Society (PNS),  Waqar Ahmad Butt and Senior Director HR and Administration COMSTECH, Aftab Hussain Zaidi, General Manager Hospitality COMSTECH,  Naveed Aamer, Senior Manager IT COMSTECH,  Usman Quddus Malik, Programme Officer COMSTECH, Umer Ali and Media Coordinator COMSTECH, Shabbir Hussain.\nWhile the technical committee included Dr. Shazia Fatima, Director, Karachi Institute of Radiotherapy and Nuclear Medicine (KIRAN), Karachi. President Pakistan Society of Nuclear Medicine (PSNM), Dr. Muhammad Adnan Saeed, Head Nuclear Medicine Nuclear Medicine, Oncology and Radiotherapy Institute (NORI), Islamabad, Dr. Muhammad Babar Imran, Director Punjab Institute of Nuclear Medicine (PINUM) Faisalabad and Dr Arzoo Fatima, Head Nuclear Medicine and Molecular Imaging, Institute of Nuclear Medicine and Oncology Lahore (INMOL) Lahore.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:27:12.993Z"
}
