{
  "title": "Govt to come up with plan to resolve issue of electricity bills : PM",
  "link": "https://www.app.com.pk/national/govt-to-come-up-with-plan-to-resolve-issue-of-electricity-bills-pm/",
  "date_published": "2023-09-03T19:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 04 (APP): Prime Minister Anwaar-ul-Haq Kakar on Sunday said the government would come up with short, medium and long-term plans to resolve the issue of electricity bills and initiate reforms in the power sector.\nIn an interview with a private television, he also assured that the government would implement a plan for the conservation of electricity as was practiced in the Western world and taught by Islam.\nTo a question about public agitation on the issue of electricity bills, the prime minister said extreme political and social attitudes were not beneficial for society.\nHe said the system of taxation was meant to tax the rich and spend on the poor but at present the system was in the clutches of profiteers and was marred with inefficiency, adding indirect taxation system was responsible for many of the woes of the poor. “We needed to tax different sectors which are still not brought under the tax net.”\nHe said Pakistan’s economic conditions were affected by the international financial institutions and “we have to fulfil the agreements made with them.”\nThe government also had to fulfil the agreements made with the power companies in the past decades, he continued.\nHe said flaws in the power sector and generation and transmission system were acute, adding the issue of electricity bills was multidimensional and the government had held numerous meetings related to issues of taxation and the power sector.\nHe assured that the Finance Ministry would come up with recommendations to provide relief to vulnerable sections of society. He said he was misquoted about the recent protests on the issue of electricity bills.\nHe understood that there was a section of society which was heavily burdened with electricity bills and he could identify with the social and economic problems of people as he himself faced these problems in the past, he added.\nTo a question about privatization, he said the privatization of state sector entities including Pakistan International Airlines was on the agenda of the government and work was being done on it.\nHe said the caretaker government was the continuation of the constitutional order and it would not remain in place any extra time on the expiry of its term.\nHe clarified that the Election Commission would announce the date for the election.\n“According to the law of the land, Election Commission will decide about elections,” he said adding however, the superior judiciary after listening to the legal experts could decide about the elections.\n“Law and a binding judgment of the Supreme Court will decide. The respect and reverence of judiciary is important for democratic dispensation and social order and these should not be disturbed,” he remarked.\nHe said according to its constitutional role, the Supreme Court will remove any doubt about the timing of elections.\nHe agreed that because of the past circumstances, there were concerns among the political parties about the schedule of polls.\nResponding to a question, he said the situation in border areas was aggravated due to the situation emerging after the withdrawal of the United States and NATO from Afghanistan.\nThere was an inventory of weapons and equipment that was left by the US in Afghanistan and now the terror outfits were more equipped and were not only dangerous for Pakistan but also for China and other countries, he said adding the US should have handed over the inventory of weapons responsibly, but there was a rushed withdrawal by the US and now it was not clear who was in possession of these weapons and equipment.\nHe was of the view that the state had two tools including negotiations and the application of force against militants to achieve peaceful social order\n“We have to use both approaches to achieve our goals.”\nThe stability, prosperity and peace of Afghanistan were linked to peace, stability and prosperity of Pakistan, he opined.\nThe PM said the incidents of May 9 were watched by the whole world and the international media reported these incidents and analyzed them.\nSuch vandalism was not tolerable in any democratic dispensation, he said adding it was an attempt to lead to a civil war and mutiny and the target was the leadership of the army and the present chief of army staff.\nAnwaar-ul-Haq said due process of law was being followed after these incidents and there was a standard operating procedure everywhere in the world to legally deal with cases of attack on military installations.\nHe said the matter of cypher was sub judice and the best judicial minds would deliberate on it to come to a decision.\nThe foreign policy of Pakistan was aimed at friendship with the world including the United States and diplomacy needed wisdom and deliberation, he remarked.\nThe prime minister said that Pakistan historically did not have friendly relations with India, both countries became nuclear and India violated international principles and helped in the separation of East Pakistan.\nKashmir was an unresolved issue and the UN Security Council resolutions on plebiscite should be implemented, he said adding Kashmir was a core issue and relations could not become normal with India without resolving this issue.",
  "retrievedAt": "2025-08-11T09:26:59.261Z"
}
