{
  "title": "PM orders immediate action against power thieves, defaulters",
  "link": "https://www.app.com.pk/national/pm-orders-immediate-action-against-power-stealer-defaulters/",
  "date_published": "2023-09-04T14:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 4 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday ordered immediate action against those involved in power theft in the country and asked the relevant authorities to submit reports in this regard on daily basis.\nChairing a meeting here, the prime minister also directed to take swift actions against the electricity defaulters saying that there should not be any leniency towards the electricity thieves and the defaulters.\nDuring the meeting, the prime minister was briefed in detail about all sections of the energy sector.\nThe meeting was informed about the total installed capacity, actual generation and overall energy supply during various seasons.\nThe prime minister was also informed about the energy mix in the power production.\nPM Kakar stressed that in future, the renewable and hydel sources of energy should be given top priority to produce cheap and green energy in the country.\nHe also directed to take effective measures to reduce the line losses of the power distribution companies. “A comprehensive plan should also be prepared and presented to implement the transformer metering project.”\nHe said projects of small hydel power projects should be planned under the guidance of relevant experts.\nSuch projects will not only generate low-cost electricity but also help in reducing the harmful effects of climate change, he said adding that local coal should be preferred instead of expensive imported coal in coal power generation projects.\nThe prime minister also directed to immediately start work on the construction of 2400 MW solar power projects while ensuring transparency in the entire process.\nThe government, he said would take all possible steps to reduce the circular debt of the power sector.\nThe meeting was also informed about the progress on the establishment of the electricity energy market in the country.\nIt was informed in the meeting that with the establishment of energy market in the country, the performance and capacity of the power sector would be effectively increase that would help 27 million domestic consumers.\nIt was also told that most of the work by the power division have already been completed in this regard.",
  "retrievedAt": "2025-08-11T09:26:40.188Z"
}
