{
  "title": "PMC’s disciplinary committee suspends licenses of nine doctors",
  "link": "https://www.app.com.pk/national/pmcs-disciplinary-committee-suspends-licenses-of-nine-doctors/",
  "date_published": "2022-11-25T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): The Disciplinary Committee of the Pakistan Medical Commission (PMC) has suspended the licenses of nine doctors and imposed fines on 10 other medical practitioners in various cases of negligence and misconduct.\nSharing details with the media after a meeting of the Committee here Friday, Chairman Disciplinary Committee Prof. Dr. Naqib Ullah Achakzai said that multiple meetings of the Committee were held to address complaints of the public and patients against negligence and misconduct of doctors and decided all the cases of doctors pending with the Commission since long.\nHe said that the Disciplinary Committee also issued warnings to five doctors for their minor misconduct while 13 doctors had been exonerated by the Committee. He said that the PMC would not tolerate any negligence or misconduct on the part of any doctor and no doctor would be allowed to play with the lives of innocent patients.\nHe said the PMC Committee will keep on holding disciplinary committee meetings in all the provinces of the country to safeguard the public interest at large. For patients and the public, the Committee issued an advisory that they formally launch a complaint to PMC against any medical or dental practitioner on account of professional negligence and misconduct, he added.\nDr. Naqib Ullah Achakzai said that several meetings in all the provinces in just 30 days were held. The Disciplinary Committee heard 60 cases to resolve all pertaining complaints, he told and added that the Committee also discussed and resolved complaints against medical and dental colleges related to non-payment of stipends to doctors.\nHe said that the PMC Committee was responsible to probe or investigate and resolve all issues or cases pertaining to medical and dental negligence. The Committee is comprised of PMC Council members and senior experts of the profession from all specialties relevant to the cases being heard.",
  "retrievedAt": "2025-08-11T15:55:24.732Z"
}
