{
  "title": "PM visit to Turkiye to strengthen cooperation in exchange of defense products, technology transfer: Rana Ihsaan Afzal",
  "link": "https://www.app.com.pk/national/pm-visit-to-turkiye-to-strengthen-cooperation-in-exchange-of-defense-products-technology-transfer-rana-ihsaan-afzal/",
  "date_published": "2022-11-25T18:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Coordinator to Prime Minster of Pakistan on Commerce and Industry, Member ECC Pakistan Rana Ihsaan Afzal Khan on Friday said that there was a lot of potential for trade between Pakistan and Turkiye as Prime Minister Shehbaz Sharif’s visit to Ankara was to strengthen cooperation, especially in exchange of defense products and technology transfer, adding it would bear fruitful results.\nTalking to Pakistan Television (PTV), he said Prime Minister Shehbaz Sharif’s visit to Turkiye was very important owing to the fact that Ankara had always proved to be the best friend of Pakistan in the past as well.\nHe cited examples where Pakistan and Turkiye had collaborated in the past to deliver important public-related projects such as Solid Waste Management Project or Metro Project in Lahore city.\nRana Ihsaan Afzal Khan likened the third of four MILGEM Corvette Ships for the Pakistan Navy’s PNS Khaibar project with the second major project of the CAC/PAC JF-17 Thunder Project, saying it was jointly inaugurated by the PM Shehbaz Sharif and President Erdogan.\nTalking about Chairman Pakistan Tehreek-e-Insaf (PTI) Imran Khan’s long march, he said that the Ministry of Interior had offered PTI to resolve the issues through parleys. He added the current approach by PTI chief Imran Khan to exert pressure on the government in a bid to make his demand fulfilled was “unconstitutional”.\nHe further suggested the PTI to come back to the Parliament (National Assembly) and try to resolve the issues legally by playing the role of the opposition.\nReplying to a question, he said that a threat alert was issued to PTI chief by the Ministry of Interior, meanwhile advising the latter to call off the long march as terrorists could take advantage of it to spread chaos in the country.\nOn the contrary, if they take a long march, the federation would provide all possible security support with full responsibility, he added.\nQuipping Imran Khan for purportedly changing narratives and taking U-turns, he said that the people had realized that his (Imran) narratives were “false”, adding this had ended his popularity.",
  "retrievedAt": "2025-08-11T15:55:20.979Z"
}
