{
  "title": "PM suggests Turkiye to join CPEC for regional progress, poverty alleviation",
  "link": "https://www.app.com.pk/national/pm-suggests-turkiye-to-join-cpec-for-regional-progress-poverty-alleviation/",
  "date_published": "2022-11-25T17:46:00.000Z",
  "source": "APP",
  "content": "ISTANBUL, Nov 25 (APP): Prime Minister Shehbaz Sharif on Friday while vowing to boost Pak-Turkiye trade and defence cooperation, suggested that Turkiye should join the China-Pakistan Economic Corridor to bring about regional prosperity, alleviate poverty and empower the people through better education and health facilities.\nThe prime minister, addressing a joint press stakeout along with Turkish President Recep Tayyip Erdogan here, said Pakistan had been “experiencing and enjoying” the benefits of the CPEC under the Belt and Road Initiative of Chinese President Xi Jinping.\n“I would suggest that let this be a cooperation between China, Pakistan and Turkiye. This would be a wonderful joint cooperation. This will bring prosperity and progress to this entire region. This will help alleviate poverty and unemployment. This will certainly empower our poor people. This will promote education and health. This is how we can meet the challenges of today,” the prime minister remarked.\nHe said that he would be “happy” to discuss the matter with the Chinese leadership if Turkiye moved ahead on the idea of joining the CPEC.\nLauding President Erdogan’s warm hospitality, the prime minister started his remarks by conveying condolences over the loss of life in a recent terror incident in Istanbul and prayed for peace of the departed souls.\nHe said having sacrificed thousands of lives to terrorism, Pakistan could understand the feeling of the Turkish people and called for joint efforts to wipe out terrorism in all forms and manifestations, not only from Pakistan and Turkiye but the whole world.\nReferring to the launching ceremony of the third of the four MILGEM Corvette Ships for the Pakistan Navy, PNS Khaybar, the prime minister said the project was the manifestation of sincerity, purpose and commitment to enhance mutual cooperation.\nThe prime minister said at a time when the tensions were escalating in the world and the international prices of commodities were skyrocketing and going beyond the reach of developing countries, so it was important to take the defence cooperation to a higher level for defence of the two brotherly countries.\nHe said Pakistan and Turkiye’s defence cooperation should now meet new challenges and have a much bigger scale in terms of skills, expertise and cooperation.\nShehbaz Sharif said in their meeting the two leaders underscored the effective implementation of the trade and goods agreement the two countries had signed in August this year.\nHe said the trade volume of $1 billion between Pakistan and Turkiye did not reflect the brotherly relations and called for all-out efforts to achieve the target of $5 billion dollar trade.\nIn his remarks, Turkish president Erdogan said that both countries were hopeful of further increasing their relations in trade, defence and other sectors.\nHe said Turkiye fully supported Pakistan’s fight against terrorism and thanked Pakistan for supporting Turkiye against the terrorist act of the Fatih organisation.\nHe said 2022 marked the celebration of the 75th anniversary of diplomatic relations.\nExpressing grief over the deaths and destruction caused by floods, the Turkish president said, “Our solidarity has been shown to each other during challenging times… Pakistan’s joy is our joy and their grief is our grief.”",
  "retrievedAt": "2025-08-11T15:55:21.008Z"
}
