{
  "title": "Mushaal urges Int’l community to take notice of Indian brutalities in IIOJK",
  "link": "https://www.app.com.pk/national/mushaal-urges-intl-community-to-take-notice-of-indian-brutalities-in-iiojk/",
  "date_published": "2022-11-25T16:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Mushaal Hussein Malick, wife of jailed Kashmiri Hurriyat leader Yasin Mullick has appealed the International community to take notice of worst Indian brutalities in Indian Illegally Occupied Jammu & Kashmir (IIOJ&K).\nAddressing a seminar organised here on Friday by Islamabad Policy Research Institute (IPRI) on International day for the elimination of violence against women, she said that Indian occupying forces were using rape as a weapon of warto punish the entire Kashmiri community.\nChairperson Peace and Culture Organization Mushaal Malick said that India has been violating the clauses regulating sexual violence under international humanitarian law (IHL) and international human rights law (IHRL), said a press release.\nShe said that rape and violence used as a weapon of terror constitute a crime against humanity and those responsible should face criminal sanctions.\nMushaal said that the Indian army, police and paramilitary forces involved in sexual violence since 1989 and more than 11,000 women have been raped or gang-raped by Indian occupying forces in IIOJK.\nShe further said that most vulnerable people in war zones areas are women and children.\nMushaal explained that women in IIOJ&K have horrified titles of half-widow or half mothers and according to Kashmir human right organisation, around 2,500 women have been forced to live as half-widows.\nShe also cited the report of Kashmiri human rights organisations that revealed that 22,944 women have become widows as a result of the ongoing state terrorism by India since January 1989, as their husbands were killed by Indian forces or police.\nNarrating her own story, Mushaal said that she and her two-year-old daughter also faced a worst kind of mistreatment in IIOJ&K when she went there to meet her husband.\nShe asked the International community and global rights bodies to come forward as women in IIOJK have been enduring egregious human rights abuse, including sexual violence, rape, and molestation for over seven decades.",
  "retrievedAt": "2025-08-11T15:55:21.001Z"
}
