{
  "title": "Pak-Turkiye defence cooperation for peace, to ward off aggression: PM",
  "link": "https://www.app.com.pk/national/pak-turkiye-defence-cooperation-for-peace-to-ward-off-aggression-pm/",
  "date_published": "2022-11-25T14:07:00.000Z",
  "source": "APP",
  "content": "ISTANBUL, Nov 25 (APP): Prime Minister Shehbaz Sharif on Friday said that the promotion of defence cooperation between Pakistan and Türkiye was meant for peace and to ward off aggression.\n“Pakistan and Turkiye are deeply engaged in promoting our defence capabilities for peace and to ward off aggression. As they say, if you want to live in peace, you must be prepared for war,” he said addressing the launching ceremony of the third of the four MILGEM Corvette Ships for the Pakistan Navy, PNS Khayber, at the Istanbul Shipyard here.\n“So this [MILGEM corvette ships] is not for aggression. This is for defence,” he explained.\nHe said it was high time the two countries transformed their ties into a strategic partnership as the world was “envious” of the relationship between two brotherly countries.\nOn his arrival at the venue, the Turkish president welcomed the prime minister who was accompanied by a high-level delegation.The prime minister was given the guard of honor as the national anthems of the countries were also played.\nAccompanied by Turkish president Recep Tayyip Erdogan, the prime minister launched the ship which he said manifested deep bilateral engagement in defence cooperation.\nThe MILGEM project, based on joint collaboration between the two countries, represents a significant milestone in the Pakistan-Türkiye strategic partnership that continues to progress on an upward trajectory.\nThe PNS Khaybar was launched with a prayer by both leaders for its safe functioning. Both leaders also jointly performed keel laying and steel cutting of the offshore patrol vessels for the Turkish Navy.\nThe launching ceremony for the first Corvette for the Pakistan Navy, PNS Babur, was performed in Istanbul in August 2021while the groundbreaking for the Second Ship, PNS Badr, was held at Karachi in May 2022.\nHe called for further strengthening of joint defence production capabilities as Pakistan-Türkiye strategic partnership was a source of stability for the entire region.\nHe cited a huge potential in the field of alternate energy in both countries and called for Turkiye and Pakistan to join hands for the production of solar, wind and hydel energy to cut the carbon emission and open up new avenues of investment cooperation.\nCalling Turkiye his “second home” the prime minister recalled the support extended by the people of Pakistan at the time when Turkiye was fighting for freedom.\nHe said while supporting the Turkish people, our forefathers never knew that Turkiye would stand by Pakistan through thick and thin and all international platforms instead, they had done so out of their religious brotherhood.\nHe appreciated the “visionary leadership” of President Erdogan, the prime minister said he had transformed Turkiye into a modern society. He also spoke highly of the social welfare projects executed by the Turkish government even in far-flung areas besides transforming the agriculture and industrial sectors.\nThe prime minister also urged the defence experts from both sides to enhance their defense production capacity with a view to strengthening cooperation for peace in the region.\nHe appreciated the role of President Erdogan in brokering a deal between Russia and Ukraine for wheat export for the benefit of developing countries like Pakistan.\nHe told the gathering that Pakistan was recently hit by one of the most devastating flood and within no time, Turkiye sent 13 goods trains carrying 72,000 tons of humanitarian goods and 15 Turkish military aircraft carrying food, tent, medicines and medical teams.\nIn his address, Turkish President Erdogan said Turkiye had achieved great things in the field of defence cooperation.He told the gathering that four corvettes were being produced under MILGEM project – two locally and two in Pakistan. The final ship will be delivered in February 2025, he added.\n“MILGEM is one of our major projects of cooperation which crown our relations with the brotherly Pakistan in defense industry,” President Erdoğan underlined.\nUnderscoring that the Turkish nation never forget their Pakistani brothers and sisters support during the National Struggle, President Erdoğan said.\n“Pakistan has always had an exceptional place in the Turkish nation’s heart. The images that emerged following the flood that affected a significant part of Pakistan made our hearts bleed… We always have and always will stand with Pakistan so that it can overcome these difficult days.”\nNoting that 2022 marked the 75th anniversary of the establishment of diplomatic ties with Pakistan, President Erdoğan said: “Our solidarity continues to grow stronger with a strategic perspective in a way befitting our two countries’ history, friendship and potential. Defense industry is a major pillar of this cooperation.”\nThe Turkish president said his government would carry Turkiye to first place in the world’s defence industry super league as the country was expanding its domestic naval and air military projects. In 2023, Turkiye’s new homegrown drone and fighter jet will be launched, he added.\nEarlier, Minister for Defence Production Israr Tareen said the launch of the third MILGEM manifested brotherhood and strong defense collaboration.He appreciated the Turkish Navy and Istanbul Shipyard for ensuring the project’s completion within the timeframe.\nHe told the audience that Pakistan was blessed with immense resources and ongoing China Pakistan Economic Corridor was set to enhance regional connectivity and maximize trade with Gwadar Port being a focal point.\nChief of the Naval Staff Admiral Amjad Khan Niazi said the presence of Prime Minister Shehbaz Sharif and Turkish President Recep Tayyip Erdogan signified the importance of the close relations between the two countries.\nHe said Pakistan and Turkiye enjoyed long-lasting and deep-rooted ties resting firmly on trust and support based on the principles.\nHe said the induction of the MILGEM ship would strengthen the Pakistan Navy and acknowledged the commitment by the Turkish ministry of defense and the Turkish Navy for completing the project timely.\nSpeaker of Turkish Grand National Assembly Mustafa Şentop, Turkish Defence Minister Hulusi Akar, and Turkish Minister of Industry and Technology Mustafa Varank also attended the event.\nFrom Pakistan side, Minister of Defence Production Muhammad Israr Tareen, Minister of Commerce Naveed Qamar, Minister for Information and Broadcasting Maryum Aurangzeb, Special Assistant to the Prime Minister Syed Fahd Hussain, Special Assistant to the Prime Minister Syed Tariq Fatemi, and Chief of the Naval Staff of Pakistan Admiral M Amjad Khan Niazi attended the ceremony.",
  "retrievedAt": "2025-08-11T15:55:22.010Z"
}
