{
  "title": "AJK President rules out talks with India in prevailing circumstances",
  "link": "https://www.app.com.pk/national/ajk-president-rules-out-talks-with-india-in-prevailing-circumstances/",
  "date_published": "2020-10-24T15:51:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Oct 24 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Saturday ruled out talks with India in the present situation of Illegally Indian Occupied Kashmir (IIOJK).\nAddressing a function held here to mark the 73rd founding day of the Government of Azad Kashmir, he said that if India wanted to hold talks, it must withdraw all actions taken about Kashmir after August 5, 2019, cease military operation in the held territory, immediately stop settling non-Kashmiri subjects in the state, and release all political leaders.\nRejecting bilateral talks with India, the president said that Kashmir was not a bilateral dispute between Pakistan and India, but it had been debated thrice in the UN Security Council during the last one year, and we would never want the Kashmir issue to be dragged from the world body and confine it to Delhi.\nHe maintained that the talks if held with India would not be bilateral but trilateral under the supervision of the United Nations and with the involvement of the genuine representatives of Kashmiris.\nIndia, he said that since 1972, had very cleverly used the ploy of bilateral talks to keep Kashmiris and the United Nations away from the process and added that no talks between India and Pakistan could yield positive results without the participation of Kashmiris.\n“By declaring the international issue of Jammu and Kashmir a bilateral matter, India wants to exclude the people of Jammu and Kashmir, the key party to the dispute, and the United Nations or other actor representing the international community for the process for resolving the Kashmir dispute,” he emphasized.\nMasood Khan also rejected apprehensions about the division of Kashmir and said that division of Kashmir was an Indian agenda under which it had disintegrated the state into Jammu and Kashmir and Ladakh after August 5 last year, and had declared them part of the Indian Union.\n“We will never take any action about Azad Kashmir and Gilgit Baltistan which can hurt the ongoing Kashmir liberation movement or Pakistan’s longstanding stance on the Kashmir,” he added.\nStressing the need for dialogue between the political leaderships of Azad Kashmir and Gilgit Baltistan, Sardar Masood Khan hoped that they would be able to adopt some unanimous stand through dialogue and negotiations.\nHighlighting the importance of the founding day of the Azad Jammu and Kashmir, the president said that the territory liberated in 1947 and a government under the dynamic leadership of Ghazi-e- Millat Sardar Muhammad Ibrahim Khan was founded.\nHe said India had treacherously and illegally occupied one part of Kashmir, the entire state of Jammu and Kashmir would have been free and joined Pakistan.\n“Today, we mark the Foundation Day of Azad Jammu and Kashmir.\nThis day consecrates the heroic resolve of the people of the valiant people of Kashmir to raise the flag of liberty and self-determination high and to celebrate Kashmir’s eternal bonds with Pakistan,” he added.\nReferring to the situation in IIOJK, the president said India was implementing a vicious plan in Kashmir and wanted to eliminate the Kashmiris in the next two years.\nHe said after 1800,000 domiciles of Kashmir were issued to Indians, adding the Indian regime was planning to award citizenship rights to 5 to million Hindu citizens from India to change the demography of the disputed region.\nHe condemned Indian occupation, genocide, brutalization, and blinding in IIOJK; and resolve to continue to struggle to liberate the occupied territory and to attain Kashmiris’ right to self-determination.",
  "retrievedAt": "2025-08-11T19:56:09.748Z"
}
