{
  "title": "Samina Alvi inaugurates breast cancer awareness Helpline",
  "link": "https://www.app.com.pk/national/samina-alvi-inaugurates-breast-cancer-awareness-helpline/",
  "date_published": "2020-10-24T16:07:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 24 (APP): First Lady Samina Arif Alvi here on Saturday inaugurated the National Breast Cancer Awareness Helpline: 0213-873-7373.\nAddressing an event in connection with the breast cancer awareness at the Governor House, she expressed her gratitude that such a serious issue was being discussed publicly as the stigma attached to it had reduced to a major extent.\nShe informed that civil, military institutions and NGOs were also working jointly for the awareness of breast cancer.\nSamina Arif Alvi hoped that the awareness about the disease at major level would help reduce the death ratio in the country, as early detection was the best prevention.\nShe regretted that still in this era, women belonging to the rural areas of the country were reluctant to discuss their symptoms because of stigma attached to the breast cancer.\nThe first lady remarked that lack of health facilities to treat the disease and costly treatment were the challenges.\nShe announced that the work of compiling the data of infected patients of breast cancer would also commence soon.\nSamina Alvi emphasized upon the self examination and keeping the symptoms in mind and to spread the message.\nThe first lady, who had started the awareness campaign two years back, thanked the media for supporting the cause as the breast cancer issue was being given the space in broadcast and publications besides running of the public service messages.\nShe urged upon the media outlets to not limit the awareness about the disease to the month of October.\nAbout expansion of the awareness program, she said seminars should be held in that regard.\nShe apprised that provincial governments were also being approached for the cause.\nSamina Alvi said the Lady Health Workers would be trained to spread the message door-to-door.\nReema Imran wife of Sindh Governor speaking on the occasion said that biggest challenge in this connection was the unawareness among the masses which was not an incurable disease.\nShe also emphasized upon the expansion of awareness.\nReema Imran said that the disease was spreading rapidly in the region and in Pakistan also.\nShe thanked the first lady for initiating such a campaign and also felicitated her as the message had reached to greater extent.\nZarmina Bakhtiar, Dr. Rufina Soomro and Haseena Moin also spoke on the occasion.\nA play was also presented by the graduates of National Academy of Performing Arts (NAPA) in connection with the breast cancer awareness.",
  "retrievedAt": "2025-08-11T19:56:09.642Z"
}
