{
  "title": "Long march, rallies can’t force early general election: Chaudhry Sarwar",
  "link": "https://www.app.com.pk/national/long-march-rallies-cant-force-early-general-election-chaudhry-sarwar/",
  "date_published": "2020-12-27T06:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 27 (APP): Governor Punjab Chaudhry Mohammad Sarwar has said that the opposition may hold long march and rallies in month of its choice but general elections will be held as per schedule in 2023.\nTalking to various party delegations at the Governor’s House here on Saturday,he said January, February and March will also pass after December and the early general elections were not a possibility. “The government is strong and stable while the detractors who wish to halt progress of the country will fail,” he said.\nDeputy Secretary Information Central Punjab, Rana Akhtar Hussain and Mehr Naeemullah\nTaj called on Governor Punjab Chaudhry Sarwar.\nGovernor Sarwar said people were not with PDM instead they were with democracy,\nrule of law and with the government’s narrative.\nHe said the opposition should now reconsider its politics of protest.Chaudhry Mohammad Sarwar said that the previous governments destroyed every institution with their political interference but ever since PTI came to power, it had eliminated political interference in the institutions and was taking practical steps to strengthen all the institutions including Parliament.\n“Thanks to the successful strategy of the government, today Pakistan is successfully advancing on every front including economic and diplomatic,” he added.\nGovernor Punjab said Pakistan’s development in the economic field was also being recognized by the world.\nHe said for the first time in 30 years, industry was being fully restored in Punjab and new employment opportunities were being provided to the people despite all the negative propaganda of PDM.\nHe said Pakistan will continue to move\nforward on every front.\nChaudhry Mohammad Sarwar further said that today all institutions including Parliament and democracy were getting stronger.\nHe said the Prime Minister Imran Khan was\non a mission to make the country developed and prosperous.\nHe said the government was taking practical steps to solve the problems of the common man.\nHe said the nation had full confidence in Prime Minister Imran Khan, adding that opposition will face nothing but failure.\nHe said Prime Minister Imran Khan was a man of principle, he will not be blackmailed.",
  "retrievedAt": "2025-08-11T20:11:30.853Z"
}
