{
  "title": "UK based Pakistani Christians appreciate Punjab Police",
  "link": "https://www.app.com.pk/national/uk-based-pakistani-christians-appreciate-punjab-police/",
  "date_published": "2020-12-27T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):Councillor Dr. James Shera, former Mayor of Rugby, has appreciated the efforts undertaken by Deputy Inspector General (Operations) Lahore Punjab Police Ashfaq Khan for spreading the message of peace, love and sacrifice, on the occasion of Christmas.\nHe has also appreciated his kind gesture for showing affection and care for the Christian staff serving for Pakistan and inviting family of Martyr Nisar Mansha as special guest who gave his life in line of duty.\nIn his statement endorsed by various Pakistani Christian leaders based in the United Kingdom, Dr. Shera said, “This act of dedication for Christian staff members serving in the Police Service of Pakistan was vital to send a message of unity and solidarity to the larger society, and to the enemies of our country.\n“Celebrating the joys of Christmas with Christian staff members in Lahore, Gujranwala, Faisalabad and sharing presents with their families is an evidence that Punjab police department considers every citizen important regardless of the creed, colour, race or ethnicity”, he said.\n“DIG Ashfaq Khan’s efforts to provide a fool proof security for the Christian worship places, and protecting lives of all citizens are also praiseworthy. The enemy wanted to destroy the peace and harmony between different communities in the country, but we are proud that we got people like him who are a barrier to such evil plans, and are defending the nation untiringly”, Dr. Shera remarked.\nDr Shera further said, “I am pleased to know that both Prime Minister and the President of the Pakistan have shared the joys and holiness of Christmas and endorsed every contribution of Christians in various ways for the creation and development of Pakistan, and truly, endorsing the vision of the founder Quaid -e Azam Muhammad. Ali Jinnah.\nThe statement was also endorsed by the UK Pakistani Christian leaders including Dr Peter David, Dr Noshaba Khiljee, Councillor Morris Johns, Advocate Qamar Shams, Michael Massey, John Bosco, Samson Javed, Saleem Khokhar former Member Provincial Assembly, Qamar Rafiq, and Tahier Solomon.",
  "retrievedAt": "2025-08-11T20:11:30.333Z"
}
