{
  "title": "Common Asian Leopard preserve zone inaugurated at Trail 6",
  "link": "https://www.app.com.pk/national/common-asian-leopard-preserve-zone-inaugurated-at-trail-6/",
  "date_published": "2022-01-01T11:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 01 (APP):Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam on Saturday inaugurated the first-ever Common Asian Leopard preserve zone in the federal capital’s scenic Margalla Hills National Park Trail-6 that falls in Kalinjar area.\nAddressing the inaugural ceremony at Trail-6 visitors information center, the SAPM said the conservation site would help protect critically endangered wild cat species and promote wildlife tourism in the world’s one of the unique ecosystems lying close to a human settlement.\nAmin Aslam congratulated the Islamabad Wildlife Management Board (IWMB) for their concerted efforts to preserve the Common Leopard and successfully created a conservation reserve.   “Chairperson IWMB Rina Saeed Khan, Z.B. Mirza and IWMB worked a lot for making it a real,” he said while appreciating the IWMB efforts.\nHe added that it was imperative to create a balance with nature and adapt to nature as the prevailing COVID-19 era was reaction to human intrusion into nature.   It’s a reaction to human conflict with nature that transferred the zoonotic diseases to mankind, he underlined.   “We did not make it (Leopard Preserve) rather the nature helped it due to the nature protection efforts and favourable environmental conditions,” he said.   Amin mentioned that leopard was critically endangered as per the International Union for Conservation of Nature (IUCN) listing of various wildlife species.\nThe SAPM said leopard was the Prime Minister of this national park and it’s absence would disturb the entire ecosystem. “There are 300 birds, 350 plant and 20 snakes species are found in the Margalla Hills National Park that make it a biodiversity rich ecosystem,” he said.   He added that it was a nature’s gift for the nation and as per the Prime Minister’s vision, the government would protect it and make it a model national park.\nThe SAPM said there would be guided tours on Trail-6 from now onwards as it would no more be an open trail due to the presence of Leopards. “Though it’s a nocturnal animal and will not be visible during day times but through this wildlife tourism initiative, the youth and children would learn more about Leopard movement and it’s habitat,” he said.   It was an ecotourism promotion method that helped in generating healthy revenue for the national exchequer, he noted.\nWhile sharing his personal experience of spotting leopard footmarks at Trail-6 office, he said, “I myself spotted scats of leopard during hike at Trail-6 office which were later verified by the IWMB staff”.   A video documentary based on the IWMB’s journey of developing the Leopard Preserve  prepared by the board was depicted before the participants with the aim to create awareness and public knowledge on Margalla Hills National Park.   The six-minute documentary was prepared by IWMB on leopards titled Margalla Hills Leopard Kingdom.\nSpeaking on the occasion, Chairperson IWMB Rina Saeed Khan said IWMB protection efforts since 2015 help protect predator and prey number in the National Park.   “Leopard has become permanent residents of Margalla Hills National Park that earlier it used to descend from upper peaks in winter and leave Margallas in summers,” she added.\n“We did a proper scientific camera trap study and placed 20 camera traps in entire 17,000 hectare of national park. A minimum of seven leopards have been captured and there are more probably as all of them could not be captured by cameras,” the IWMB chair told the participants.   She informed that two males and a female were living in Kalinjar area of Trail-6.\nShe added that the Trail-6 was shut after spotting the first leopard and duringCOVID-19 lockdown the national park’s biodiversity thrived that increased theit’s population.\nShe mentioned that the Snow Leopard Foundation has offered to radio tag Trail-6 for study of leopards in the National Park.She informed that the board would launch a limited tour once a day with maximum 25 people as the objective was not to disturb leopards.\n“Leopards are very shy and move at nights. The tour will be paid and the Board was working out modalities for the initiative,” she added.A study for the scientific management of national park was also underway, she said.“Around 9 out of 20 camera traps captured leopard and one got an entire family captured,” she said.\nShe concluded that the leopard was the top predator of national park that controlled the entire population of wildlife in Margalla Hills National Park.The SAPM and participants went for a walk on Trail-6 to observe the conservation efforts, leopard scats and footmarks.",
  "retrievedAt": "2025-08-11T13:59:22.554Z"
}
