{
  "title": "September sees $110m current account surplus after 2 months",
  "author": null,
  "content": "September sees $110m surplus after two months\nShahid Iqbal Published October 21, 2025  Updated about 9 hours ago\n   \n0\nThis graphic shared by the State Bank of Pakistan shows the status of Pakistan’s current account since July 2024. — Photo courtesy SBP\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nKARACHI: The current account changed its track from deficit to surplus in September and foreign direct investment (FDI) plunged 34 per cent year-on-year during the first quarter of FY26, according to the State Bank of Pakistan (SBP) on Monday.\n\nThe SBP reported that the current account posted a surplus of $110 million in September against the deficits in July and August. This came as a surprise to many, who had predicted more deficits in the coming months.\n\nThe Sept result was much better than the same month of the previous fiscal year — FY25 — when the current account posted a deficit of $52m.\n\nHowever, the fiscal year FY25 had ended with a surplus of $1.932 billion, which was a pleasure for the government struggling for more dollars. The deficit in FY25 turned positive with the record inflows of $38bn in remittances. It supported both the exchange rate stability and foreign exchange reserves of the central bank.\n\nForeign direct investment tumbles by 34pc in first quarter of FY26\n\nThe SBP governor recently said the central bank purchased $20bn from the interbank currency market in the last three years to improve its reserves and make external payments.\n\nThe FY26 started with $379m current account deficit (CAD) in July which declined to $245m in August.\n\nThe July-Aug FY26 witnessed a cumulative CAD of $624m compared to $430m in the same period of the last fiscal year. However, the first quarter of FY26 — July-September — witnessed a cumulative CAD of $594m against $502m in the same quarter the preceding year.\n\nThe data show that the exports slightly improved in the first quarter to $7.9bn compared to $7.4bn.\n\nSimilarly, the imports increased by $1.2bn to $15.438bn against $14.255bn.\n\nThe export of services slightly increased to $2.2bn while the import of services increased to $3.2bn.\n\nAccording to Pakistan Bureau of Statistics data for the July-Sept period in FY26, the trade deficit stood at $9.37bn, up from $7.05bn in the same period last year.\n\nFood inflation fears\n\nIt is believed the country would need additional dollars to import food items like wheat, sugar and others because of the recent devastating floods to maintain a balance and stop the expected hike in food prices that might increase inflation.\n\nHowever, it requires more dollars which means the trade deficit could widen in the coming months.\n\nIn any case, the country succeeded in maintaining the exchange rate which supported the inflows particularly through the remittances.\n\nThe remittances during the first three months remained over $3bn indicating that current fiscal year would be able to receive at least the amount it had received in FY25 — $38bn.\n\nDecline in FDI\n\nAccording to the SBP data, FDI fell to $568.8m during the first quarter FY26 while it stood at $864.6m in the same period of last fiscal year — showing a 34pc decline this year.\n\nThe government has been struggling for the last three years to increase the inflows but foreign investors have not found Pakistan a suitable country to invest in.\n\nThe highest inflow was noted from China that fell sharply this year compared to the previous fiscal year.\n\nThe first quarter inflow from China was $188m compared to $502.6m in the same period of last fiscal year.\n\nIt was difficult for analysts to find the actual reason for this massive drop in FDI from China but some of them were sure that it would improve in the coming months.\n\nOther significant inflows were $96m from Hong Kong, $55m from Switzerland, $50m from the UAE and $53m from the UK.\n\nPublished in Dawn, October 21st, 2025\n\nNEWSPAPER\n   \n0\nRead more\nPakistan records annual current account surplus of $2.1bn: State Bank\nCurrent account gap narrows to $245m\nIMF warns of rising inflation, current account deficit\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:41:11.081Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950310",
  "dateList": null,
  "date_published": null
}
