{
  "title": "US, Australia sign pact on critical minerals - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: President Donald Trump and Australian Prime Minister Anthony Albanese signed a rare earths and critical minerals agreement on Monday aimed at ensuring a steady supply of the materials at a time when China is trying to tighten control over global supply.\\n\\nAs they met at the White House for their first summit, Trump said the deal had been negotiated over four or five months. Albanese described it as an $8.5 billion pipeline “that we have ready to go.”\\n\\nThe full terms of the agreement were not immediately available. The two leaders said part of the agreement had to do with processing of the minerals. Albanese said both countries will contribute $1 billion over the next six months for joint projects.\\n\\nThe United States has been looking for access to rare earths and critical minerals around the world as China tightens control over global supply. China has the world’s largest rare earths reserves, according to US Geological Survey data, but Australia also has significant reserves.\\n\\nThe two leaders also planned to discuss the $239.46 billion AUKUS agreement, reached in 2023 under then-President Joe Biden, in which Australia is to buy US nuclear-powered submarines in 2032 before building a new submarine class with Britain.\\n\\nNavy Secretary John Phelan told the meeting the United States and Australia were working very closely to improve the original AUKUS framework for all three parties “and clarify some of the ambiguity that was in the prior agreement.” Trump said these were “just minor details.” “There shouldn’t be any more clarifications, because we’re just, we’re just going now full steam ahead, building,” Trump said.\\n\\nAustralian officials have said they are confident AUKUS will proceed, with Defence Minister Richard Marles last week saying he knew when the review would conclude.\\n\\nCooperative and warm relationship\\n\\nAhead of Monday’s meeting between the two leaders, Australian officials have emphasized Canberra is paying its way under AUKUS, contributing $2 billion this year to boost production rates at US submarine shipyards, and preparing to maintain US Virginia-class submarines at its Indian Ocean naval base from 2027.\\n\\nThe delay of 10 months in an official meeting since Trump took office has caused some anxiety in Australia as the Pentagon urged Canberra to lift defence spending. The two leaders met briefly on the sidelines of the United Nations General Assembly in New York last month.\\n\\nAustralia is willing to sell shares in its planned strategic reserve of critical minerals to allies including Britain, Reuters reported last month, as Western governments scramble to end their reliance on China for rare earths and minor metals. Top US officials last week condemned Beijing’s expansion of rare earth export controls as a threat to global supply chains. China is the world’s biggest producer of the materials that are vital materials for products ranging from electric vehicles to aircraft engines and military radars.\\n\\nResource-rich Australia, wanting to extract and process rare earths, put preferential access to its strategic reserve on the table in US trade negotiations in April.\\n\\nTies with China\\n\\nThe United States has a large trade surplus with Australia, which is among the countries with the lowest US tariff.\\n\\nAustralia’s biggest trade partner is China, with exports of iron ore and coal long underpinning its national budget, despite efforts by Albanese’s government to diversify export markets after Beijing’s $20 billion boycott of Australian agriculture and coal from 2020 to 2023.\\n\\nPublished in Dawn, October 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/21080823b606977.webp",
  "retrievedAt": "2025-10-21T11:01:34.396Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950319/us-australia-sign-pact-on-critical-minerals",
  "dateList": "2025-10-21",
  "date_published": "2025-10-21T02:39:56.000Z"
}
