{
  "title": "South Africa grind to 86-2 at tea in reply to Pakistan’s 333 in second Test - Sport - DAWN.COM",
  "author": null,
  "content": "South Africa battled to 86-2 at tea on day two of the second Test in Rawalpindi after spinner Keshav Maharaj took seven wickets to dismiss Pakistan for 333 on Tuesday.\\n\\nTristan Stubbs and Tony de Zorzi were on 23 and 13 respectively at the break, with South Africa trailing the hosts by 247 runs on a day when Maharaj stole the limelight.\\n\\nThe left-armer, who missed the first Test defeat with injury, exploited the dry Rawalpindi pitch to maximum effect with figures of 7-102, his 12th five-wicket Test haul.\\n\\nIn South Africa’s reply fast bowler Shaheen Shah Afridi struck early to remove Ryan Rickelton caught behind for 14.\\n\\nVisiting skipper Aiden Markram tried to take the attack to the home spinners, clouting debutant Asif Afridi for a six before holing out off Sajid Khan at long-on for 32.\\n\\nEarlier, Pakistan resumed on 259-5 and reached 316 untroubled when the Maharaj show began.\\n\\nHaving taken two wickets on the opening day, he broke through the defence of Salman Agha, trapping him leg-before for 45 to give the World Test champions hope of wrapping up the innings quickly.\\n\\nAgha hit five fours and added 70 for the sixth wicket with Saud Shakeel. Shakeel looked steady and reached his 10th half-century with a couple off Maharaj.\\n\\nBut the spinner had him caught in the slips for 66 and it triggered a collapse. Maharaj bowled Shaheen for nought, completing his first five-wicket haul against Pakistan.\\n\\nMaharaj wrapped up the innings with the wickets of Sajid (five) and Afridi (four) as Pakistan lost their last five wickets for 17 runs.\\n\\nPakistan are attempting to sweep the two-match series after winning the first Test, in Lahore, by 93 runs.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/211531082291123.webp",
  "retrievedAt": "2025-10-21T11:00:57.555Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950364/south-africa-grind-to-86-2-at-tea-in-reply-to-pakistans-333-in-second-test",
  "dateList": "2025-10-21",
  "date_published": "2025-10-21T07:32:23.000Z"
}
