{
  "title": "8 militants gunned down in Dera Ismail Khan - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: At least eight alleged terrorists were gunned down by security forces in an operation on Monday, after a team from Sui Northern Gas Pipelines Limited (SNGPL) came under attack near the Kot Lalu area in Daraban, Dera Ismail Khan.\\n\\nThe action came in an apparent response to an attack on the SNGPL team, in which security forces reportedly also suffered casualties. However, there was no official word from Inter-Services Public Relations (ISPR) or other security agencies about their losses until going to press.\\n\\nSources said the militants were killed after intelligence reports were received about their presence in a nearby jungle, prompting the security forces to launch an offensive in which eight suspects were gunned down.\\n\\nFollowing the action, the forces cordoned off the area and initiated wide-ranging search-and-clearance operations in the surrounding terrain. Reinforcements were dispatched to secure the site and to pursue the fleeing suspects.\\n\\nTwo suspects killed in Swabi encounter; attack on Bannu police station repulsed\\n\\nOfficials told reporters that the slain militants allegedly were members of a cell that had been planning a direct attack on the pipeline project. They said the group intended to sabotage the installation — a project of national importance aimed at providing energy, employment and improved services to the people of Khyber Pakhtunkhwa.\\n\\nInvestigations were ongoing and local authorities said they would share further details as the clearance operation and forensic work proceeded.\\n\\nTwo killed in Swabi\\n\\nSeparately, two militants were killed in a joint operation conducted by the Counter Terrorism Department (CTD) Mardan and the Swabi district police before midnight, Ziauddin Ahmad, the district police officer, said on Monday. The incident took place three days after a hand grenade was hurled at the Kalabat police post by unidentified men, in which a constable was martyred.\\n\\nAccording to a separate press release, the CTD and Swabi police were engaged in an intelligence-based operation (IBO) in mountainous Maini village when four alleged militants riding two motorcycles opened fire on the law enforcers.\\n\\n“The CTD operation party retaliated with full vigour. As a result, terrorists were killed on the spot, and their two accomplices escaped, taking advantage of darkness,” said DPO Ahmad.\\n\\nSoon after the incident, a search and strike operation was launched in the area. The slain men allegedly belonged to the TTP Tayyip Akbar Group and were wanted in numerous cases, including attacks on the police.\\n\\nAttack repelled\\n\\nSeparately, an attack targeting the police station in the Bakkakhel town of Bannu district late Sunday night was thwarted by the police. A police official said that a group of militants attacked the police station with advanced light and heavy weapons in a bid to breach the building.\\n\\n“But the personnel deployed there were fully alert as they had noticed the terrorists’ movements with the help of thermal vision cameras,” he said, adding that the law enforcers countered the attack vigorously and forced the assailants to flee.\\n\\nThe official said that after hearing about the attack on the police station, local residents armed with weapons also came out of their houses and assisted police in their action against terrorists. He said that all policemen remain safe in the attack.\\n\\nMeanwhile, two policemen who had been kidnapped from the Peepal Bazaar in Bannu on Monday were freed by their captors. A police official said that two police officials, including Naheedullah and Eid Muhammad, were kidnapped by unknown armed men when they were returning to their duty place after performing their duty with the polio teams.\\n\\nPublished in Dawn, October 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-21T11:02:01.565Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950281/8-militants-gunned-down-in-dera-ismail-khan",
  "dateList": "2025-10-21",
  "date_published": "2025-10-21T01:58:00.000Z"
}
