{
  "title": "‘Smog theatre’: Will cannons and towers clear polluted air? - Pakistan - DAWN.COM",
  "author": null,
  "content": "As Lahore gears up for another smog season, an imposing new fleet of green trucks is making rounds across the city. Branded as “Anti-Smog Guns”, they spray a fine mist into the air in hopes of settling pollution.\\n\\nLaunched under the banner of Climate Resilient Punjab, the fog cannons promise cleaner skies.\\n\\nThey look like action. Do they deliver?\\n\\nThe science says no. A 2023 study from China tracked air along a road segment before and after a mist cannon passed. PM2.5 rose by up to 13 per cent about 25–35 minutes later, as the extra water accelerated chemistry that formed more fine particles. In other words, the cannon didn’t clean the air. It primed the air to make more pollution.\\n\\nIn Lahore, each fog cannon costs over Rs45 million, according to news reports. The machines were imported from China and formally handed over to the Pakistan Environmental Protection Agency (EPA) in a high-profile event attended by senior government leadership.\\n\\nRunning one unit continuously can consume up to 360,000 litres of water per day. Multiplied across 15 units (and possibly more to come), this represents a massive environmental and financial burden, especially in a water-stressed, smog-choked city.\\n\\nThe question then becomes: why invest in a solution that does not address the root causes of smog?\\n\\nLahore’s pollution comes from the familiar mix: exhaust from vehicles, industrial combustion, brick kilns, construction dust, open waste burning and seasonal crop fires.\\n\\nAddressing these requires stronger regulation, cleaner fuels, public transit investments and regional coordination with the agricultural sector. Not atmospheric firefighting.\\n\\nYet smog cannons persist because they look like action. Their towering presence and dramatic spray offer visual reassurance, especially when political pressure mounts.\\n\\nThey are, in effect, optics over outcomes. A show of effort rather than a solution. They are, effectively, ‘smog theatre’.\\n\\nSmog towers were last year’s spectacle. Installed with fanfare, they failed to dent Lahore’s ambient particulate matter, just as evaluations from experts warned they would. Different machine, same theatre.\\n\\nPakistan deserves better. Lahore deserves better. We need evidence-based air quality policy, not spectacles. The resources spent on fog cannons and smog towers would be far more effective if redirected toward emission controls, the release of real-time air quality data, cleaner fuels and public communication about air pollution risks.\\n\\nThe air doesn’t just need to look clean — it needs to be clean.\\n\\nThe true crisis runs much deeper. In 2024, Lahore had zero clean air days under World Health Organisation (WHO) standards.\\n\\nIts annual average PM2.5 concentration was 104.6 microgrammes per cubic meter, more than three times the Punjab NEQS legal limit and 21 times the WHO guideline.\\n\\nThis level of exposure reduces average life expectancy by seven years. This is not a seasonal phenomenon. It is a systemic failure with multiple sources.\\n\\nChina’s success offers a better model. As Ma Jun writes in The Economics of Air Pollution in China, authorities began by developing detailed emissions inventories, conducting cost-benefit analyses and targeting specific polluting sectors with enforceable regulation.\\n\\nThis data-driven approach helped Beijing significantly reduce smog within a decade.\\n\\nPakistan can do the same.\\n\\nBut only if we stop misting the symptoms and start making policy around the causes.\\n\\nWe need rigorous enforcement of diesel vehicle standards, identification of key emitters through real-world emissions testing, industrial emission controls, brick kiln modernisation and investment in clean public transit.\\n\\nUntil we confront the sources of pollution head-on, no amount of mist will clear the air.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/21161351db2812c.webp",
  "retrievedAt": "2025-10-21T11:31:14.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1950374/smog-theatre-will-cannons-and-towers-clear-polluted-air",
  "dateList": "2025-10-21",
  "date_published": "2025-10-21T11:19:10.000Z"
}
