{
  "title": "3 civilians killed in Muridke operation, claims Punjab minister",
  "author": null,
  "content": "3 civilians killed in Muridke operation, claims Punjab minister\nDawn.com Published October 21, 2025  Updated 15 minutes ago\n   \n0\nPunjab Information Minister Azma Bokhari gives a press conference in Lahore on October 21. — DawnNewsTV\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nPunjab Information Minister Azma Bokhari claimed on Tuesday that three civilians were killed during the operation in Muridke that dispersed Tehreek-i-Labbaik Pakistan (TLP) protesters.\n\nThe TLP, which began a protest march in Lahore earlier this month, was planning to reach Islamabad and stage a demonstration in support of Gaza and Palestine outside the US embassy. The march and sit-in, which reached Muridke, quickly turned into violent clashes between protesters and police before the protesters were dispersed, leading to a crackdown on the party and its supporters.\n\nAddressing a press conference in Lahore today, the Punjab information minister said “false stories” were being perpetuated about the operation in Muridke.\n\n“Three civilians were martyred in Muridke. These were people who were passing by or standing off to the side,” she said, adding that 48 civilians and 110 police officers were also injured. Eighteen out of 110 have sustained firearm injuries, she said.\n\nThe minister also said that police vans had been stolen and eight were set on fire. Referring to “exclusive” footage of the clashes that was aired at the press conference, she said, “They brought trolleys full of bricks … and the sad thing is, they did all of this in the name of religion, Palestine, and Gaza.”\n\nShe also displayed footage of valuable items recovered from the residence of the party’s leader, saying, “1.920 kilograms of gold; 898g of silver; 69 branded watches, 28 gold bracelets … in the name of charity, they bring it back home,” she said.\n\nShe urged children “who love their faith” not to be taken in by groups that use it for political or financial gain, and requested parents to not send their children to be involved in such activities.\n\n“Don’t be used in the political agendas of others,” she said. “Stories on social media are scripted.”\n\n“We are not moving or transferring anyone’s grave or shrine,” she said, adding, “But to use that grave to collect charity, to gather people and provoke violence — the Punjab government won’t allow that.”\n\nBokhari said that all the accounts of those who financed terrorist groups were frozen and that those who financed them, or supported them on social media, would be prosecuted and charged with terrorism.\n\n“No mosque is being demolished; what Muslim can even think of that?” she said, adding that the mosques and seminaries would be turned over to “righteous religious groups”.\n\nThe provincial information minister stressed that the government was “not against any sect”, but rather against “that mindset that makes people resort to violence”.\n\nShe further said that the government had now taken over 330 mosques that were under the TLP.\n\n“We are not against any group, but this is for the country,” she said. “The loudspeakers will be used only for azaan and the mosques only for prayers.”\n\nShe also said that 223 seminaries of the TLP had been geotagged and details of them obtained, adding that they would soon be reopened and that most had already reopened.\n\n“Six madressahs were built on government property, that had no records,” the minister pointed out, “and no one had the right to question it, because then a fatwa-i-qatal would have been announced.”\n\nShe said that those who had taken the law into their own hands and were responsible for the injuries and deaths of civilians and police would be prosecuted under anti-terror laws.\n\n“Both the brothers are being traced; they have not been shot or arrested,” she said, referring to Saad Rizvi and his brother Anas. “They have fled, and we will arrest them soon.”\n\nBokhari also said that the decision to ban the TLP is expected in the next few days.\n\nThe minister added that the time was “now or never” for Pakistan to decide if it wanted to be a democratic and progressive Islamic country.\n\n“The government has decided, now it is on the people.”\n\nAuthorities in Punjab claimed yesterday to have traced the whereabouts of Saad Rizvi and his brother Anas, saying the absconding leaders fled to Azad Jammu & Kashmir (AJK) after the crackdown in Muridke.\n\nTLP MARCH\nPAKISTAN\n   \n0\nRead more\nSuthra Punjab hailed as largest waste plan\nTensions simmer after crackdown on TLP protesters in Muridke\nTehreek-i-Insaf protests crackdown on TLP\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:50:33.631Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950373/3-civilians-killed-in-muridke-operation-claims-punjab-minister",
  "dateList": null,
  "date_published": null
}
