{
  "title": "Athapaththu conjures miracle as Sri Lanka snatch victory over Bangladesh",
  "author": null,
  "content": "Athapaththu conjures miracle as Sri Lanka snatch victory over Bangladesh\nAFP Published October 21, 2025  Updated about 16 hours ago\n   \n0\nSri Lanka’s captain Chamari Athapaththu (L) and her teammates celebrate after their team’s win in the ICC Women’s Cricket World Cup 2025 one-day international (ODI) match between Sri Lanka and Bangladesh at the DY Patil Stadium in Navi Mumbai on October 20, 2025. — AFP\nJOIN OUR WHATSAPP CHANNEL\n\nSri Lanka snatched victory from the jaws of defeat to record their first win of the ICC Women’s World Cup, edging out Bangladesh by seven runs in a nerve jangling finish in Navi Mumbai on Monday.\n\nWith Bangladesh cruising and only nine needed off the final over with five wickets in hand, having mustered just three runs off the penultimate over, skipper Chamari Athapaththu took the ball herself and turned the game on its head.\n\nFour wickets tumbled in four balls as Bangladesh collapsed, losing five wickets for just two runs.\n\nAthapaththu, calm amid the storm, finished with career-best figures of 4-42.\n\nThe drama began with Rabeya Khan trapped leg-before off the first ball, followed by a run-out next delivery.\n\nThen, Bangladesh’s hopes sank when their captain Nigar Sultana danced down the track only to find long-off lurking.\n\nWhen Marufa Akter was adjudged lbw next ball, Athapaththu had conjured the unthinkable, defending nine with a single run conceded in the over.\n\n“We handled the pressure well. We knew that if we took the game deep, teams could crumble,” Athapaththu said. “It wasn’t perfect, batting collapses and dropped catches hurt us, but luck smiled at us today.”\n\nFor once, fortune favoured Sri Lanka, whose campaign had been marred by rain, missed chances and misfiring batters.\n\nHasini Perera, who struck her maiden ODI half-century, made 85 off 99 balls, peppered with 13 fours and a six.\n\nShe was the backbone of Sri Lanka’s 202 all out as she reached the milestone of 1,000 runs in ODIs.\n\nA 74-run partnership with Nilakshika de Silva gave Sri Lanka a solid launch pad, before another collapse saw six wickets fall for 28 run.\n\nEven so, the Sri Lankans held their nerve in the death overs to seal the win and climb to sixth in the standings.\n\nWith four points, they are level with New Zealand and India, although will need results to go in their favour to grab the last semi-final spot.\n\nAustralia, South Africa and England have already booked their places in the last four.\n\n“We kept losing wickets at crucial times,” admitted Bangladesh skipper Sultana, whose fighting 77 was in vain as her side were eliminated.\n\n“I tried to take the pressure off with a boundary, but it just didn’t come off.”\n\nWOMEN'S WORLD CUP 2025\nSPORT\n   \n0\nRead more\nWeather out of our control but trying our best to make the semis, says Rameen ahead of South Africa clash\nEngland beat India by 4 runs in last-ball thriller to qualify for Women’s World Cup semi-final\nRain plays spoilsport yet again as Pakistan-New Zealand World Cup encounter ends in washout\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:42:36.065Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950188/athapaththu-conjures-miracle-as-sri-lanka-snatch-victory-over-bangladesh",
  "dateList": null,
  "date_published": null
}
