{
  "title": "Haaland, Kane and Mbappe battle to be Europe’s best",
  "author": null,
  "content": "Haaland, Kane and Mbappe battle to be Europe’s best\nAgencies Published October 21, 2025  Updated about 3 hours ago\n   \n0\nMANCHESTER: Players of Manchester City undergo drills during a training session at Etihad Campus on Monday.—Reuters\nJOIN OUR WHATSAPP CHANNEL\n\nMANCHESTER: Erling Haaland, Harry Kane and Kylian Mbappe are all scoring at better than a goal-a-game rates in a blistering start to the season from Europe’s top three marksmen.\n\nAhead of their return to Champions League action this week, the trio are already battling at the top of the charts to be the competition’s top scorer and making the early running in a World Cup campaign for next year’s Ballon d’Or.\n\nHaaland leads the way with 23 goals in 13 games to haul City back into contention for the Premier League and Norway to the brink of their first World Cup since 1998.\n\nOnly once has Haaland failed to find the net this season and he arrives for City’s league-phase match at Villarreal on Tuesday having scored 10 goals in his last five matches with City and Norway.\n\nThe 25-year-old scored twice against Everton on Saturday to take his Premier League tally for the campaign to 11. Haaland now boasts the three quickest occasions any Premier League player has reached 10 goals in a season after doing so in six matches in 2022 and five games last season.\n\nThe fastest player to 50 goals in the Champions League, Haaland also scored twice when City drew 2-2 at Monaco in the Champions League earlier this month. City had opened with a 1-0 win against Napoli.\n\nPreviously he has been questioned in his homeland for not reproducing his prolific club form for Norway. Those complaints have been washed away as Haaland has struck 12 times in six qualifiers to finally take a golden generation towards his first major international tournament.\n\nKane headed in his 22nd goal of the season to put Bayern on course for victory in Der Klassiker against Borussia Dortmund on Saturday.\n\nThe England captain has three goals in as many games for his country as the Three Lions became the first European team to qualify for the World Cup with a flawless qualifying record through six matches.\n\nKane has racked up incredible numbers since swapping his homeland for Bayern in 2023, even if it took until his second season to end a long wait to win a trophy.\n\nThe 32-year-old has 104 goals in 107 games for the German giants, including 19 in 11 at club level this season.\n\nBayern already look set to defend their Bundesliga title, making a first ever Champions League crown for Kane even more of a priority.\n\nHe has scored four times in wins over Chelsea and Pafos to begin their quest for European glory and will expect more when Club Brugge visit Bavaria on Wednesday.\n\nMbappe’s frustrating first few months following his dream move from Paris St Germain last year are now long forgotten in the Spanish capital.\n\nThe Frenchman racked up 44 goals in 59 games across all competitions last season and adapted to playing as the central striker in Carlo Ancelotti’s system.\n\nXabi Alonso has maintained Mbappe’s position and the 26-year-old has been Real’s key player during the opening weeks of the season.\n\nLightning quick, slick on the ball and capable of finishing lethally from outside the area, Mbappe has 15 goals in 11 matches between La Liga and the Champions League.\n\nHe is the Spanish top flight’s leading goalscorer with 10, while netting five goals in just two Champions League appearances. Mbappe has also netted three times for France this season in three appearances.\n\nHe has scored nine goals in his last six games, including the winner in Real’s 1-0 win at Getafe in La Liga on Saturday.\n\nReal, who also started the league phase with two victories, host Juventus on Wednesday. The Italians are coming off two draws in the Champions League, against Borussia Dortmund and at Villarreal. Juventus lost 2-0 at Como in Serie A on Sunday.\n\nDEMBELE RETURNS\n\nSix teams have started with victories in the first two rounds, including surprising Qarabag from Azerbaijan, who will go for three in a row when they visit winless Athletic Bilbao on Wednesday. Qarabag had never won in the competition proper before.\n\nAmong the others with two wins are defending champion PSG, who visit Bayer Leverkusen on Tuesday. Ballon d’Or winner Ousmane Dembele looks set to make his comeback for PSG after a six-week injury layoff.\n\nLeverkusen centre-back Loic Bade, Dembele’s teammate in the France squad, told reporters on Monday there was “no secret recipe” to stopping the PSG forward, calling him “a complete player with several qualities”.\n\nArsenal will try to extend their perfect start when they host Atletico Madrid on Tuesday.\n\nInter Milan, runners-up to PSG in last season’s final, visit Belgium’s Union Saint-Gilloise on Tuesday.\n\nLiverpool, enduring a four-game losing streak that includes a home defeat against Manchester United in the Premier League on Sunday, will try to rebound in the Champions League when they visit Eintracht Frankfurt on Wednesday.\n\nAmong Liverpool’s recent setbacks was a loss at Galatasaray in their second league-phase match.\n\nBarcelona are another team looking to make up some lost ground in the Champions League after a home defeat against PSG in the previous round. They host Olympiakos Piraeus at Montjuic stadium on Tuesday.\n\nChelsea, who also picked up only one league-phase win so far, host winless Ajax Amsterdam on Wednesday.\n\nAnother winless team, Jose Mou­rinho’s Benfica, visit New­castle United on Tuesday.\n\nPublished in Dawn, October 21st, 2025\n\nNEWSPAPER\n   \n0\nRead more\nPostecoglou sacked after Forest defeat, Haaland takes City top\nHaaland fires Norway closer to World Cup as Italy stay in hunt\nHaaland fires Manchester City to win at Brentford, Everton end Crystal Palace’s unbeaten run\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:42:01.073Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950265/haaland-kane-and-mbappe-battle-to-be-europes-best",
  "dateList": null,
  "date_published": null
}
