{
  "title": "India restores embassy in Afghanistan as ties improve",
  "author": null,
  "content": "India restores embassy in Afghanistan as ties improve\nDawn.com Published October 21, 2025  Updated about 5 hours ago\n   \n0\nAfghan policemen stand guard next to Indian and Afghan national flags, at a check point in Kabul, Afghanistan, May 12, 2011. — Reuters/File\nIndian Foreign Minister Subrahmanyam Jaishankar (right) and Afghanistan Foreign Minister Amir Muttaqi in New Delhi. — Photo courtesy Afghan foreign ministry/File\nAfghan policemen stand guard next to Indian and Afghan national flags, at a check point in Kabul, Afghanistan, May 12, 2011. — Reuters/File\nIndian Foreign Minister Subrahmanyam Jaishankar (right) and Afghanistan Foreign Minister Amir Muttaqi in New Delhi. — Photo courtesy Afghan foreign ministry/File\nAfghan policemen stand guard next to Indian and Afghan national flags, at a check point in Kabul, Afghanistan, May 12, 2011. — Reuters/File\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nIndia restored its embassy in the Afghan capital of Kabul on Tuesday following warming ties between the two nations.\n\nIndia had closed its embassy in Kabul after the Taliban seized power following the withdrawal of US-led Nato forces in 2021, but opened a small mission a year later to facilitate trade, medical support, and humanitarian aid.\n\nAbout a dozen countries, including China, Russia, Iran, Pakistan and Turkiye have embassies operating in Kabul, although Russia is the only country to have formally recognised the Taliban administration.\n\n“In keeping with the decision announced during the recent visit of the Afghan FM to India, the government is restoring the status of the technical mission of India in Kabul to that of embassy of India in Afghanistan with immediate effect,” said a press release issued today by India’s Ministry of External Affairs.\n\nIt added the decision underscored India’s resolve to deepen its bilateral engagement with the Afghan side in all spheres of mutual interest.\n\nThe MEA elaborated that the embassy will “further augment India’s contribution to Afghanistan’s comprehensive development, humanitarian assistance and capacity-building initiatives, in keeping with the priorities and aspirations of Afghan society”.\n\nIndian Foreign Minister Subrahmanyam Jaishankar had announced the embassy’s reopening earlier this month as he began talks with Afghan Taliban Foreign Minister Amir Khan Muttaqi on what was the first visit to India by a Taliban leader since 2021.\n\nNew Delhi does not officially recognise the Taliban government but has taken tentative steps to thaw ties with meetings and talks between senior officials in their respective foreign ministries.\n\nINDIA IN AFGHANISTAN\nWORLD\n   \n0\nRead more\nCeasefire might not hold as Afghan Taliban have become proxy for Delhi: Asif\nAfghan FM Muttaqi clarifies absence of women journalists from his press conference in India\nIndia to reopen its embassy in Kabul after 4 years\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nWhen Breathing Becomes a Privilege: Pakistan’s Fight for Climate Justice\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T20:05:48.401Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950392/india-restores-embassy-in-afghanistan-as-ties-improve",
  "dateList": null,
  "date_published": null
}
