{
  "title": "Notices issued to Adiala jail superintendent, others on KP CM’s plea seeking meeting with Imran",
  "author": null,
  "content": "Notices issued to Adiala jail superintendent, others on KP CM’s plea seeking meeting with Imran\nTahir Naseer Published October 20, 2025  Updated a day ago\n0\nA photo of KP chief minister Sohail Afridi. — Facebook/Muhammad Sohail Afridi\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nThe Islamabad High Court (IHC) on Monday removed the registrar’s objections on Khyber Pakhtunkhwa Chief Minister Sohail Afridi’s plea seeking a meeting with incarcerated PTI founder Imran Khan and issued notices to the Adiala jail superintendent and others for October 23.\n\nAfridi had filed the plea on Oct 17, two days after he was sworn in as the provincial chief executive on Oct 15. He had gone to Adiala jail — where Imran has been imprisoned since September 2023 — after getting protective bail from the Peshawar High Court on Oct 16. However, he was denied the meeting; Afridi has stated that he would announce his cabinet after consulting Imran. He had then filed a plea with the IHC, however, the registrar’s office had objected to the maintainability of the plea.\n\nToday, Justice Arbab Muhammad Tahir took up the matter and overruled the objections of the registrar office.\n\nAfridi’s lawyer Advocate Ali Bukhari said that the registrar’s office had raised the objection that the petition was filed “without the provincial cabinet and government’s decision”.\n\n“This objection has no standing as the cabinet has not been constituted as yet,” he contended.\n\nSubsequently, the court removed the objections and issued notices to the interior secretary, the Punjab Home Department secretary, the Punjab inspector general of prisons and the Adiala jail superintendent for Oct 23.\n\nThe petition filed by Afridi had contended that the KP government had earlier submitted formal requests to the federal interior ministry and the Punjab home department to allow a meeting with Imran, but no approval was granted.\n\nThe plea maintained that consultation with the PTI founder was “legally and ethically necessary” for the chief minister in connection with key administrative and political decisions, including cabinet formation.\n\nMeanwhile, in its objections the IHC registrar’s office had noted that the court had already adjudicated similar matters and had laid down a procedure for seeking permission to meet the PTI founder. The office questioned how a new petition could be filed without following the prescribed process.\n\nCorrection: This story previously incorrectly stated that the Islamabad High Court had issued a notice to the Punjab inspector general of police. However, the notice has been issued to the Punjab inspector general of prisons. The error is regretted.\n\nPAKISTAN\n0\nRead more\nKP CM Sohail Afridi files petition in IHC to meet Imran in Adiala Jail\nImran’s life ‘in danger’, moved to lower class cell in Adiala Jail: lawyer\nPM Shehbaz assures newly-elected KP CM Afridi of Centre’s willingness to work together\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:51:53.167Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950144/notices-issued-to-adiala-jail-superintendent-others-on-kp-cms-plea-seeking-meeting-with-imran",
  "dateList": null,
  "date_published": null
}
