{
  "title": "Notices issued to 14 medical colleges for overcharging fee: PMDC",
  "author": null,
  "content": "Notices issued to 14 medical colleges for overcharging fee: PMDC\nIkram Junaidi Published October 21, 2025  Updated about 6 hours ago\n0\nA file photo of the PMDC logo on a panel of glass, behind which doctors and students are visible. — Facebook/File\n1x\n1.2x\n1.5x\nJOIN OUR WHATSAPP CHANNEL\n\nISLAMABAD: While sharing details with the National Assembly’s Standing Committee on Health, Pakistan Medical and Dental Council (PMDC) President Dr Rizwan Taj on Monday disclosed that as many as 14 show cause notices have been issued to medical and dental colleges over receiving exorbitant fees from students.\n\nIntimating that the registration of colleges can be cancelled, he said that soon the list of colleges will be shared with the committee.\n\nThe meeting was chaired by MNA Dr Mahesh Kumar Malani and attended by MNAs Dr Shazia Sobia Aslam Soomro, Ms Sabheen Ghoury, Ms Zahra Wadood Fatemi, Ms Farah Naz Akbar, Dr Nikhat Shakeel Khan, Dr Darshan, Ms Aliya Kamran, Raja Khurram Shahzad Nawaz, Ms Shaista Khan and Syed Rafiullah. Health Minister Mustafa Kamal also attended the meeting.\n\nJust after the start of the meeting, Dr Shazia Sobia Aslam Soomro raised the issue of exorbitant fees of medical and dental colleges. She said that colleges were charging much more as compared to the existing fee which is capped at Rs1.8 million.\n\nSays colleges’ registration can be cancelled\n\nDr Rizwan said that the council has taken notice of the overcharging of fees.\n\n“It is correct that some of the colleges have been charging more. We have issued show cause notice to them. The matter will also be referred to the committee,” he said.\n\nHowever, the health minister Mustafa Kamal said that there was provision in the rules to increase fees but colleges have to provide a reason for it.\n\nHe said that out of 188 medical and dental colleges, 122 were private.\n\nHe said a national level survey would be held to look into the issue.\n\nHe said that show cause notices were issued to most of the medical colleges of Islamabad.\n\nPMDC Official Dr Rehan Naqvi also said that the show cause notices were issued to 14 colleges.\n\nWhile discussing the Medical and Dental College Admission Test (MDCAT), members raised concerns over the two-year validity of test results and the absence of a relative marking system.\n\nIt was observed that the policy discouraged high-achieving students from reapplying. The chair noted that thousands of students had secured above 95 percent marks, yet limited seats left many at a disadvantage.\n\nThe Committee advised that the policy be revisited to ensure fairness and equal opportunity for all candidates.\n\nThe minister explained that over six thousand standardised questions were prepared from a common syllabus, divided into sets to maintain transparency, and assured the committee that further consultations would be held with provinces and the National Academic Board to address concerns.\n\nFurthermore, members raised the issue of medicines being distributed [from public sector hospitals] under the names of Parliamentarians without proper verification.\n\nThe committee recommended that an online tracking mechanism be developed to ensure transparency, accountability, and to prevent any potential misuse.\n\nPublished in Dawn, October 21st, 2025\n\nNEWSPAPER\n0\nRead more\nPMDC caps fee of medical, dental colleges at Rs1.8m\nPMDC increases fee by 5pc, warns colleges against violation of notification\nPMDC, colleges’ body at loggerheads over fee issue\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:41:45.053Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950209/notices-issued-to-14-medical-colleges-for-overcharging-fee-pmdc",
  "dateList": null,
  "date_published": null
}
