{
  "title": "US sends nuke workers home as shutdown drags",
  "author": null,
  "content": "US sends nuke workers home as shutdown drags\nAFP Published October 21, 2025  Updated about 8 hours ago\n   \n0\nUS President Donald Trump speaks during a press conference in the Oval Office at the White House in Washington, DC, US on October 15. — Reuters\nJOIN OUR WHATSAPP CHANNEL\n\nWASHINGTON: The agency responsible for safeguarding the US nuclear stockpile began placing most staff on enforced leave on Monday, US media reported, as the government shutdown dragged into a fourth week.\n\nSome 1,400 workers at the National Nuclear Security Administration (NNSA) were due to receive notices telling them they had been placed on unpaid “furlough,” CNN reported, leaving just 375 at their posts.\n\n“Since its creation in 2000, NNSA has never before furloughed federal workers during funding lapses,” Energy Department spokesman Ben Dietderich told CNN. “We are left with no choice this time. We’ve extended funding as long as we could.”\n\nThe United States has an arsenal of 5,177 nuclear warheads, with about 1,770 deployed, according to the global security nonprofit Bulletin of the Atomic Scientists.\n\nThe NNSA is responsible for designing, manufacturing, servicing and securing the weapons, and oversees some 60,000 contractors.\n\nThe furloughs will initially hit sites that assemble nuclear weapons, forcing facilities such as Pantex in Texas and Y-12 in Tennessee into “safe shutdown mode,” CNN reported.\n\nAt 20 days, America is enduring the longest full government shutdown ever — the third-longest if partial stoppages are included.\n\nPresident Donald Trump has been ratcheting up pressure on Democrats to vote with his Republicans to reopen the government, with increasingly ominous threats to slash public services and start mass layoffs.\n\nKevin Hassett, the director of the White House National Economic Council, told CNBC that he expected the shutdown to end “some time this week” — but warned Democrats of “stronger measures… to bring them to the table” if it dragged further.\n\nSenate Republicans have offered a vote on renewing expiring health care subsidies for 24 million Americans — Democrats’ key condition for backing a House-passed funding resolution that would reopen the government.\n\nBut many Democrats insist that any deal in the upper chamber of Congress will be meaningless without the sign-off of House Speaker Mike Johnson and Trump.\n\nJohnson has vowed to keep the lower chamber of Congress closed until the shutdown ends, and it has already been out of session since September 19.\n\n“Every day that the government is shut down, it is a danger to the American people,” Johnson told reporters on Monday, when he was asked about the NNSA furloughs.\n\nHe warned that falling behind US adversaries in the nuclear arms race would be a “very serious” threat to America’s status as “the last great superpower.” Trump meanwhile has been clear that he believes Republicans are winning the messaging war and has not felt the need so far to intervene.\n\nPublished in Dawn, October 21st, 2025\n\nNEWSPAPER\n   \n0\nRead more\nTrump admin threatens mass sacking as shutdown looms\nUS Senate rejects plan to end government shutdown\nCourt allows Trump to deploy soldiers in Portland\nOn DawnNews\nمونسٹر سیریز: اپنے سفاک جرائم سے امریکی معاشرے کو بدلنے والا ایڈ گین کون تھا؟\n’بھٹو صاحب کو جب تک بلوچستان آپریشن کی غلطی کا احساس ہوا، بہت دیر ہوچکی تھی‘\nبدلتے ہوئے عالمی منظرنامے میں پاکستان اچانک اتنا اہم کیوں ہوگیا ہے؟\nDAWN NEWS ENGLISH \nSubscribe\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nASEAN Summit: Everything You Need To Know\nCan International Law Stop Wars?\nPakistan-Afghanistan Conflict Analysis\nTTP, Afghanistan & India: Inside Pakistan’s Shifting Security Strategy\nEx-Ukraine Minister Kuleba Doubts Trump-Putin Meeting Will End War\nFrom Power to EVs: HUBCO’s CEO on Fixing Pakistan’s Energy Market\nImpact of Tomahawks Not ‘Decisive’, Expert Warns, as Trump and Zelensky Set to Talk Missiles\nComments\n500 CHARACTERS COMMENT MOD POLICY",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-21T11:41:18.274Z",
  "source": null,
  "link": "https://www.dawn.com/news/1950316/us-sends-nuke-workers-home-as-shutdown-drags",
  "dateList": null,
  "date_published": null
}
