{
  "title": "PM arrives in Makkah after offering prayers at Masjid-i-Nabvi - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After offering Friday prayers at the Masjid-i- Nabvi, Prime Minister Shehbaz Sharif on Friday reached Makkah by train along with his delegation to perform Umrah.\n\nThe PM is currently on a four-day visit to Saudi Arabia. He will also meet businessmen during his stay in the holy land.\n\nOn the first day of his visit on Thursday, the prime minister met the Saudi crown prince.\n\nStay order\n\nIn a separate development, PM Shehbaz hailed vacation of the stay order by the Lahore High Court in a case regarding tax on windfall income of banks which resulted in a benefit of Rs11.5 billion to the national exchequer.\n\nHails vacation of stay order by LHC in tax case\n\nOn this account overall in a month, the national exchequer accrued financial benefit of Rs34.5 billion, says an official press release issued by the Prime Minister’s Office.\n\nThis success was gained due to the vision of economic reforms of the PM and improvement in the perform­ance of the Federal Board of Revenue (FBR), the press release said.\n\nIt said the prime minister had taken the notice of the stay order on cases related to tax on windfall income of banks under the Finance Act, 2023, and asked the minister for law, minister for finance, attorney general and chairman of FBR to constitute the best team to argue the federal government cases in the courts.\n\nIn the last month, due to efforts of the team, firstly Rs23 billion was recovered after the verdicts of Sindh High Court and now Rs11.5 billion was gained from the verdict of the Lahore High Court, it added.\n\nThe prime minister appreciated efforts of Minister for Law and Justice Azam Nazeer Tarar, Minister for Finance Muhammad Aurangzeb, Attorney General Mansoor Awan, FBR Chairman Arshad Mehmood Langrial, Finance Secretary Imdad Bosal and their team, the press release quoted the prime minister as saying.\n\nThe ministers of law and finance and the team of attorney general made the historic achievement possible with their hard work, the press release said.\n\nThe prime minister said that due to these creative and strong steps, tax collection could be increased and there would be hope for a better economy.\n\nA substantial amount of Rs34.5 billion was deposited in the national exchequer and this money could now be spent on projects of health, education and public welfare, the prime minister said.\n\nPublished in Dawn, March 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67de119b62a6a.gif",
  "retrievedAt": "2025-08-25T15:22:21.917Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899540/pm-arrives-in-makkah-after-offering-prayers-at-masjid-i-nabvi",
  "dateList": "2025-03-22",
  "date_published": "2025-03-22T01:33:55.000Z"
}
