{
  "title": "Jamaat-i-Islami condemns Muslim countries’ silence on Gaza - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Jamaat-i-Islami (JI) emir Hafiz Naeemur Rehman has condemned the silence of Muslim rulers over Israeli aggression in Gaza, calling it tantamount to supporting oppression under US patronage.\n\nAddressing a protest demonstration outside the US Consulate in Lahore against Israeli atrocities, he warned if the government failed to take concrete steps to support Palestinians and did not condemn the US, the next protest would be held inside the American embassy.\n\nRehman pointed out that Prime Minister Shehbaz Sharif was in Saudi Arabia and expressed hope that a joint declaration condemning the US and Israel would be issued.\n\nHe lamented that not only the government but also the opposition remained silent on the Palestinian issue, saying all political parties are competing for US approval. He urged the PML-N, PPP, and PTI to condemn the US.\n\nHe also called on the army chief to take a stance in favour of Palestine and with the government permission convene a meeting of Muslim military leaders to send a strong message to Israel.\n\n“I am certain that just such an announcement will be enough to halt Zionist brutality,” he asserted.\n\nReferring to reports circulating on social media about Pakistani journalists visiting Israel, he demanded that the government clarify its position. He warned if any secret deals were made with Zionists at the cost of Palestinian blood, the rulers would face public wrath.\n\nThe JI emir also called for a boycott of Israeli products and announced plans to hold million-man marches in major cities in solidarity with the people of Palestine.\n\nFollowing his call, demonstrations, rallies, and marches were held across Pakistan, including outside US embassies and consulates in Islamabad, Karachi, Peshawar, Rawalpindi, and Quetta.\n\nCriticising the ongoing Israeli attacks despite calls for a ceasefire, he revealed that 600 people, including 250 children, had been martyred in recent days. He condemned the closure of the Rafah crossing and said the US was fully supporting Israeli terrorism by providing weapons.\n\nHe decried the inaction of Muslim rulers, calling them equally responsible for Palestinian bloodshed.\n\n“Pakistan is a nuclear power, and the entire Muslim Ummah looks to us. Our leaders must break free from US subservience. The opposition must also speak out against Israeli and American aggression—the people are watching, and they know everything,” he warned.\n\nHe stressed that Palestine was a matter of faith for Muslims, recalling that on March 23, 1940, one resolution was passed for the creation of Pakistan, and another expressed solidarity with Palestine while condemning Israel. He reminded that Quaid-i-Azam Muhammad Ali Jinnah had called Israel the “illegitimate child of the West” and reaffirmed that Pakistan would never recognise it.\n\nDismissing arguments about Pakistan’s weak economy preventing it from taking a strong stance against the US, he held the ruling elite responsible for economic downfall.\n\n“Stop telling us we are weak. Our rulers must shed their cowardice,” he declared, urging them to learn from Hamas’s resistance. He concluded by paying tribute to Hamas for its struggle against Israeli occupation.\n\nPublished in Dawn, March 22nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/22122652b57a408.jpg",
  "retrievedAt": "2025-10-12T02:07:04.147Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1899463/jamaat-i-islami-condemns-muslim-countries-silence-on-gaza",
  "dateList": "2025-03-22",
  "date_published": "2025-03-22T01:34:47.000Z"
}
