{
  "title": "PTI erred in asking its members to join SIC: Supreme Court’s CB - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Supreme Court’s Constitutional Bench has questioned the PTI’s decision to “compel” its members — who won as independents in the Feb 8, 2024, elections — to join the Sunni Ittehad Council (SIC) which has no seats in parliament.\n\nJustice Aminuddin Khan, who headed the 11-judge bench, remarked that PTI had apparently misled the candidates into joining SIC, which was not even a parliamentary party.\n\nThe remarks were made on Thursday as the bench resumed the hearing of a set of review petitions filed against the court’s July 2024 order.\n\nFaisal Siddiqi, who was representing SIC, conceded some “mistakes were committed” by the party, but went on to add that “we all make mistakes”. He remarked that even great judges gave bad judgements in the past.\n\nJustice Hilali asks if eight judges amended Constitution by extending deadline for independents to join parties\n\nJustice Khan observed even if the court accepted the SIC’s contention that this confusion was entirely the Election Commission of Pakistan’s fault, the party has also admitted the wrong it committed.\n\nDuring the hearing, Justice Hilali wondered whether the majority judgement by eight judges in July 2024 had amended the Constitution by extending the requirement of joining a party after winning the election within 15 days.\n\nShe also questioned why the SIC chairman, Sahibzada Hamid Raza, who has had a political party since 2013, contested the election as an independent candidate.\n\n“How candidates who in their nomination forms mentioned them as independents were qualified for the rese­r­ved seats since these reserved seats were meant only for the political parties that contested elections and entered the parliament?” the judge questioned.\n\nThe PTI never entered the parliament as a party after its members contested elections as independents.\n\nDemocratic constitutionalism\n\nMr Siddiqi, the SIC lawyer, contended the majority judgement addressed all questions being raised by the bench.\n\nHe argued that courts have to adhere to the provisions of the Constitution, but those provisions have to be understood in terms of democratic constitutionalism.\n\n“If every judgement has to be democratic, then what will be the impact of the Constitution?” asked Justice Muhammad Ali Mazhar.\n\nHe wondered whether the counsel wanted judges to decide cases on the public’s will to save the democratic process even if it went beyond the Constitution.\n\nMr Siddiqi replied that while looking at the Constitution, one should keep in mind that this was a democratic document and that was why every provision “should enhance democratic norms”.\n\nAnother bench member, Justice Ali Baqar Najafi, observed that his reading of the judgment was that the judges expressed their views through certain observations without referring to the facts of the case.\n\nIt seemed that with this bias in their mind, the judges proceeded to discuss and concluded the case afterwards.\n\nThe counsel agreed that judges have laid the foundations of the judgment in the beginning and decided the case on these principles but disagreed that it amounted to bias.\n\nWhen the counsel stated that there were certain points in the judgment that had been agreed upon by all 11 judges, Justice Mazhar wondered whether these reviews pertained to all three judgments or to the eight-judge majority judgment.\n\nJustice Khan emphasised only the majority judgment was under review while the other two were intact.\n\nHe also said the counsel was “going beyond the scope of the case” before the court.\n\nThe counsel said the majority of the judges had agreed that a number of members contested elections as independent but were PTI-affiliated candidates.\n\nSecondly, all 11 judges held that the reserved seats belong to PTI.\n\nHe argued that petitioners who filed the reviews cannot argue that PTI was not a party and therefore, cannot be granted relief.\n\nThe lawyer added that Justice Mandokhail and former CJP Qazi Faez Isa, in their note, had granted relief to the PTI.\n\n“That is why their argument was self-destructive,” the counsel emphasised and recalled since PTI did not hold intra-party elections, they were not granted the election symbol, which led to “certain consequences” at the time of filing nomination papers.\n\nThe counsel argued the ECP, while misreading the decisions of the PHC and Supreme Court, considered PTI candidates as independents when the party was entitled to get 78 reserved seats in the national as well as provincial assemblies.\n\nSince the party could not get reserved seats, PTI members decided to join SIC, the counsel explained.\n\nAt this point, Justice Hilali again asked whether SIC had representation in parliament.\n\nThe majority of judges in the July 2024 order agreed several candidates in the parliament belonged to PTI but not to SIC. Therefore, they were entitled to reserved seats, the counsel argued.\n\nMeanwhile, the petitioners, PML-N, PPP and the ECP have already filed additional grounds before the bench.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:28.123Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914188/pti-erred-in-asking-its-members-to-join-sic-supreme-courts-cb",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:28:43.000Z"
}
