{
  "title": "Islamabad, Dushanbe to pursue new avenues for cooperation - World - DAWN.COM",
  "author": null,
  "content": "DUSHANBE: Prime Minister Shehbaz Sharif and Tajikistan’s President Emomali Rahmon on Thursday reviewed bilateral cooperation in different areas, including political, trade, economy, energy, defence, security, and regional connectivity.\n\nDuring the meeting, they agreed to pursue new avenues for cooperation with a focus on fostering investment opportunities, enhancing educational lin­kages, prompting cultural exchanges, advancing inf­o­rmation technology collaboration and strengthening people-to-people contacts.\n\nEarlier upon his arrival at the Palace of the Nation, the Tajik leader welcomed the premier and his delegation.\n\nPM Shehbaz arrived in Dushanbe at the invitation of government of Taji­kistan to participate in the International High-Level Conference on Glaciers Preservation (ICGP) being held on 29-31 May.\n\nHe is accompanied by a high-level delegation comprising Information Minister Attaullah Tarar, Special Assistant to PM Syed Tariq Fatemi, and senior officials.\n\nUpon arrival at Dush­anbe, the premier was received by his Tajik counterpart Qohir Rasulzoda.\n\nPM Shehbaz Sharif and President Rahmon while holding in-depth and wide-ranging discussions recalled the signing of the historic Strategic Partnership Agreement during the prime minister’s visit to Dushanbe in July 2024, which laid a strong foundation for strengthening bilateral relations and advancing shared interests.\n\nOn CASA-1000, the two leaders reaffirmed their commitment to positioning it as a pivotal project for regional integration. Wel­coming the holding of CASA-1000 Inter-Governmental Coun­cil in Dushanbe on May 15, the PM spoke of the shared commitment to its early operationalisation.\n\nRegarding economic cooperation, the two leaders, while ack­nowledging the untapped potential in bilateral trade, underscored the importance of actively pursuing new avenues of cooperation in line with the decisions taken during the 7th session of Pakistan-Tajikistan Joint Com­mission on Trade, Economic and Scientific Technical Cooperation, held in Islamabad in December.\n\nThey agreed to effectively leverage the existing institutional frameworks including 12 Joint Working Groups (JWGs) to enhance collaboration, especial­­ly in oil and gas and energy sectors.\n\nThey took note of growing bilateral cooperation in the field of defence and security and reiterated their resolve to boost the same to overcome the common security challenges. They emphasised the need to enhance cooperation in counterterrorism, combating cross-border organised crime and human and drug trafficking.\n\nThe two leaders expressed satisfaction on cooperation at the multilateral fora, including at the UN, OIC, SCO and ECO.\n\nPM Shehbaz reiterated\n\nPakis­tan’s commitment to strengthening connectivity linkages with Central Asia and highlighted China-Pakistan Economic Corridor as a linchpin of Pakistan’s connectivity with the region.\n\n‘Unlawful actions’\n\nHe briefed President Rahmon on the latest situation in South Asia. He said the region could not afford India’s irresponsible and unlawful actions since May 7, which amounted to acts of war and violation of the UN Charter and international law.\n\nHe also underscored that the resolution of Jammu and Kashmir dispute, in accordance with the Security Council resolutions, remains fundamental to securing lasting peace.\n\nPresident Rahmon said that as a staunch friend of Pakistan, he too was very worried at the events of early May, adding that he would always promote peace and stability in the region. He added he was impressed by the prime minister’s remarkable leadership that was critical to the restoration of peace and security in the region.\n\nPresident Rahmon reaffirmed Tajikistan’s desire for intensifying cooperation in all fields, terming Pakistan as a trusted partner. He underlined the im­portance of closer collaboration in the areas of science and technology, agriculture, industry, hyd­­­ropower generation, and tourism.\n\nThe PM extended invitation to President Rahmon for an official visit to Islamabad. President Rahmon also hosted a special reception in honour of Prime Minister Shehbaz.\n\nAzeri investment\n\nEarlier, the PM said Pakistan was ready to receive $2 billion investment from Azerbaijan in multiple sectors.\n\nThe prime minister, while talking to Azerbaijan TV prior to his departure from Lachin to Dushanbe, said: “Yesterday, [Azerbaijan’s] President Ilham Aliyev again reiterated his commitment to invest $2 billion in Pakistan. We are ready for this investment for mutual benefits,” he said.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683918cab7002.jpg",
  "retrievedAt": "2025-08-23T14:34:27.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914190/islamabad-dushanbe-to-pursue-new-avenues-for-cooperation",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:31:47.000Z"
}
