{
  "title": "Inflation may start rising after record lows - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Depicting a cautious outlook towards growth in Large-Scale Manufacturing (LSM), the Ministry of Finance (MoF) on Thursday presented a rising trajectory for inflation during May and June.\n\n“Inflation is projected to remain between 1.5-2.0 per cent in May, with a possible rise to 3.0-4.0pc by June”, significantly higher than a record low of 0.3pc in April, the MoF said in its Monthly Economic Update and Outlook for May.\n\nIt stated that the LSM activity remained sluggish so far, but its outlook may improve gradually in the coming months, with recovery expected to be gradual amid continued year-over-year (YoY) contraction and a recent month-over-month (MoM) decline. Nonetheless, improvements in high-frequency indicators — such as rising automobile output, raw material imports, and a more accommodative monetary stance — indicate cautious optimism, it said.\n\nThe MoF said the improved weather conditions and increased water availability were likely to support higher crop yields and better farming conditions, contributing to overall economic growth. Exports and remittances are expected to maintain their upward trend in the coming months, keeping the current account within a manageable range.\n\nGovt expects gradual recovery in big industry production\n\nIt stated that Pakistan’s rating upgrade by Fitch Ratings was an acknowledgment of macroeconomic stabilisation in the outgoing fiscal year, supported by improved fiscal performance, a current account surplus, and easing inflation.\n\nRevenue growth outpaced expenditure, reducing the fiscal deficit and further strengthening the primary surplus. The current account posted a $1.9 billion surplus, with a robust growth in exports and remittances. Inflation declined to a record low, paving the way for a more accommodative monetary policy stance. Climate finance initiatives, including the Resilient and Sustainable Facility from the IMF and the launching of the Green Sukuk, reinforced the path toward inclusive and sustainable growth.\n\nIt said the fiscal indicators demonstrated enhanced management discipline. During July-March FY25, total revenue grew by 36.7pc to Rs13.367tr, compared to Rs9.78tr last year, led by a 68pc rise in non-tax revenues which reached Rs4.23tr, mainly driven by SBP profits, petroleum levy, dividends, and surcharges.The Federal Board of Revenue collection, on the other hand, increased by just 26.3pc to Rs9.3tr during July-April FY25, up from Rs7.362tr last year, but significantly lower than budgeted target.\n\nTotal expenditures rose by 19.4pc to Rs16.34tr, with current spending increasing by 18.3pc and development expenditures by 32.6pc.\n\nAs a result, the fiscal deficit declined to 2.6pc of GDP (from 3.7pc) while the primary surplus improved to Rs3.469tr (3pc of GDP) from Rs1.615tr (1.5pc) last year.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:22:17.724Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914180/inflation-may-start-rising-after-record-lows",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:10:42.000Z"
}
