{
  "title": "Hospitals top list of SNGPL defaulters with Rs1.41 billion dues - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Sui Northern Gas Pipelines Limited (SNGPL) management says several departments of provincial and federal governments are defaulters and are liable for paying bills amounting to Rs3.7136 billion for which the reminder notices have been issued for clearance of all dues immediately.\n\nAmong all defaulters, hospitals remain on top of the list with the total outstanding dues amounting to Rs1.4125bn, Dawn has learnt.\n\nAccording to the company, the reminder notices have been issued to several public sector organisations and departments for the payment of dues. Therefore, the company urges all entities to settle their dues immediately to avoid further legal or administrative action. Final notices were earlier served on these defaulters during April 2025.\n\nThe hospitals under the federal government owe Rs183.62m, those under the Khyber Pakhtunkhwa (KP) government (Rs106.08m) and Punjab government hospitals owe Rs1.1228bn. The total outstanding dues from these hospitals amount to Rs1.4125bn.\n\nCompany issues reminders to defaulting depts after final notices for clearance of Rs3.71bn bills\n\nThe police department is also among the major defaulters. The federal police owe Rs141.5m, followed by KP police that owe Rs63.13m and Punjab police owing Rs295.04m, bringing the total outstanding dues from police departments to Rs499.7m.\n\nIn the prison sector, jails in KP owe Rs38.58m, while those in Punjab owe Rs569m. The total outstanding dues from jails come to Rs607.5m.\n\nThe Capital Development Authority (CDA) of the federal government owes Rs251.2m.\n\nThe Public Works Department (PWD) is another major defaulter. The federal PWD owes Rs118.46m, KP PWD (Rs5.028m), and Punjab PWD (Rs18.114m). The combined outstanding dues from all PWDs total Rs141.6m.\n\nEducational institutions have also accumulated unpaid dues. Federal institutions owe Rs65.58m, KP institutions (Rs17.14m) and Punjab institutions (Rs32.554m). The total outstanding dues from educational institutions stand at Rs115.28m.\n\nMiscellaneous government institutions owe substantial amounts as well. Federal institutions owe Rs198.88m, those in KP (Rs76.92m) and Punjab-based institutions (Rs410m). The total outstanding dues in this category amount to Rs685.8m.\n\nThe commandant police, Training College Sihala, Islamabad, owes Rs146.37m. MS General Hospital, Ferozepur Road, Lahore, has outstanding dues of Rs97.74m. The executive engineer (EXEN), Punjab House, Sector F-5, Islamabad owes Rs89.21m. The MS, Surgical Tower, Mayo Hospital, Lahore, is liable to pay Rs85.7m.\n\nThe deputy director, mechanical division 2 (Ministry of Foreign Affairs), room No. 1, Block Q, Pak Secretariat Building, Islamabad, for Pak House, owes Rs61.66m. Pakistan Institute of Medical Sciences (PIMS), G-8/3, Islamabad, has dues of Rs61.4m. The superintendent jail, Central Jail, Gujranwala, owes Rs60.99m. The medical director, Children Hospital, Ferozepur Road, Lahore, owes Rs60.3m.\n\nThe medical superintendent of Surgical Ward, ENT Ward, and Medical Wards No. 1 and 2, Bahawal Victoria Hospital, Bahawalpur, has outstanding dues of Rs55.21m. The assistant executive engineer, PM House Complex, Islamabad, owes Rs51.76m. The superintendent, Adiala Jail, Rawalpindi, is liable for Rs49.67m. The medical superintendent, District Headquarters Hospital, Mianwali Road, Sargodha, owes Rs44.26m.\n\nThe MS Services Hospital, Jail Road, Lahore, has dues of Rs42.06m. The superintendent jail, cook of food for inmates, Multan, owes Rs40.88m.\n\nThe deputy director, mechanical division No. 1, CDA, Islamabad, for the Prime Minister Secretariat, owes Rs40.39m. The superintendent jail, District Jail, Lahore, is liable for Rs40.28m. The director, Poultry Farms, Murree Road, Rawalpindi, has dues of Rs39.83m. The Airport Security Force at the New Islamabad International Airport owes Rs39.57m. The medical superintendent, Services Hospital, Radiology Department, Jail Road, Lahore, owes Rs38.46m. The MS, New OPD Block, Services Hospital, Lahore, owes Rs38.25m.\n\nThe MS, Children Hospital, Abdali Road, Chowk Fawara, Multan, is liable for Rs37.59m. The MS, Modern Burn Unit, Nishtar Hospital, owes Rs37.29m. The administrator, Lady Reading Hospital, Peshawar, has dues of Rs36.37m. The deputy director, E/M Maintenance Division, Parliament House, CDA Islamabad, owes Rs34.84m. The MS, Jinnah Hospital, New Campus, Lahore, owes Rs34.66m. MS Mayo Hospital, Lahore, has outstanding dues of Rs34.18m.\n\nThe deputy director, air-conditioning, CDA Secretariat, M Block, Islamabad, owes Rs34.07m. The superintendent jail, Central Jail, Residential Colony, High Security Prison, Mianwali, is liable for Rs29.22m.\n\nThe superintendent jail, Central Jail, Kot Lakhpat, Lahore, owes Rs28.86m. The deputy director, mechanical division 2, room No. 1, Block Q, Pak Secretariat Building, Islamabad, for Block K, owes Rs28.50m. Lady Wellington Hospital, Ravi Road, Lahore, has dues of Rs28.41m. The MS, Laundry Plant, Nishtar Medical College, Multan, owes Rs27.42m. The deputy director, Mechanical Division-I, Federal Government Services Hospital, G-6/3, Islamabad, is liable for Rs25.76m.\n\nThe deputy director (E/M), Maintenance Division, Parliament House, Islamabad, owes Rs25.17 million. The superintendent, Jail Mess, Shorkot Road, Toba Tek Singh, has outstanding dues of Rs24.19m. The MS, Mayo Hospital, Lahore, Mayo Kitchen, owes Rs23.93m.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:41.350Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914148/hospitals-top-list-of-sngpl-defaulters-with-rs141-billion-dues",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:10:54.000Z"
}
