{
  "title": "Armed robbers hold Dawn staffer’s family hostage, deprive them of valuables - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As many as eight armed robbers held the family of a Dawn staffer hostage and deprived them of cash, jewellery, cell phones, weapons and other valuables in the early hours of Thursday.\n\nThe incident took place in Sector D-17, located within the limits of Sangjani police station.\n\nAs many as eight armed dacoits barged into the house of Dawn’s Chief Reporter Syed Irfan Raza in Sector D-17, held the entire family hostage and looted valuables.\n\nThe robbers threatened the hostages with dire consequences, if the incident was reported to the police.\n\nThey remained in the house for over an hour, from 1:30am to 2:30am, with guns pointed at the heads of family members, including women and children, and took jewellery, cash and mobile phones.\n\nAccording to family members, they were awake at the time when the robbers broke the kitchen grill and entered the house.\n\nApparently, the robbers were acting on a tip-off. They snatched valuables and mobile phones and also removed the digital video recorder (DVR) attached to CCTV cameras before leaving.\n\nThey also took two licensed pistols with them.\n\nAlthough the robbers had covered their faces, some of them were speaking Pashto and one of them said that they had come from Kohat.\n\nThe Islamabad Police were informed about the incident. Officials of law enforcement agencies remained at the house, recording the statements of the family members, besides collecting other evidences till Thursday night.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:15.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914227/armed-robbers-hold-dawn-staffers-family-hostage-deprive-them-of-valuables",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T03:48:19.000Z"
}
