{
  "title": "Crypto policy in disarray as SBP, ministry insist ban is still in place - Pakistan - DAWN.COM",
  "author": null,
  "content": "• SBP exec says crypto transactions illegal, cases being referred to law enforcement\n• Finance secretary says legal framework will only be introduced if govt legalises crypto\n• Pakistan unveils first govt-led Strategic Bitcoin Reserve\n\nISLAMABAD: Amid growing official promotion of Bitcoin adoption, both the State Bank of Pakistan (SBP) and the Ministry of Finance (MoF) on Thursday said that cryptocurrency remains banned in the country and all its transactions are illegal under current regulations.\n\nDuring a meeting of the National Assembly’s Standing Committee on Finance and Revenue, Finance Secretary Imdadullah Bosal said that although the prime minister had recently formed a Crypto Council — chaired by the finance minister — through an executive order to explore digital asset policy, a cryptocurrency ban is intact under SBP and SECP regulations.\n\n“There will be a legal framework only when the government formally takes a decision, but the current legal status is that crypto is not a legal tender in Pakistan,” Mr Bosal said, conceding that no parliamentary backing exists for cryptocurrency use.\n\nMr Bosal also reconfirmed later to journalists that the federal budget would be announced on June 10 and discussions with the International Monetary Fund were ongoing virtually on budget estimates and proposed measures. He said the Asian Development Bank was expected to approve an $800 million loan to Pakistan on June 3.\n\nCommittee members expre­ssed confusion over the government’s approach. Mirza Ikhtiar Baig questioned why the public was being encouraged to invest in crypto when it remained legally banned, warning that investors could face serious consequences.\n\nMohammad Mobeen wondered why the government was dealing with the subject of Bitcoins and cryptocurrency instead of the SBP. He stressed that while the government was calling crypto illegal, it had simultaneously allocated power capacity for mining operations.\n\nFurther highlighting the policy inconsistency, he pointed out that Bilal Bin Saqib, CEO of the Pakistan Crypto Council (PCC), had been holding meetings with high-profile global leaders.\n\nShahram Tarakai said the country’s foreign exchange would flow out of the country very soon through cryptos and the government would then be in a fix.\n\nOther members raised questions about whether the crypto mining would be in government or private sector hands, and noted that illegal hawala channels would likely be replaced by unregulated digital transfers.\n\nSohail Jawad, an executive director of the SBP, said the central bank had issued a directive in 2024, declaring the legal status of Bitcoin and other cryptocurrencies illegal, and that stance was still intact.\n\nIn fact, the Financial Monitoring Unit (FMU) is still referring crypto-related cases to law enforcement agencies for further action, he said.\n\nHe said a national working group of digital currency had been established and suggestions had also been given to the Pakistan Crypto Council. He said El Salvador was the only country with legalised cryptocurrency in the world, and even that nation was reconsidering the decision.\n\nThe State Bank of Pakistan does not recognise crypto assets, which are digital currencies in which transactions are verified and recorded by a decentralised system. The SBP issued a formal notice in 2022 advising the general public to be cautious of and refrain from trading cryptocurrencies.\n\nNeed for regulation\n\nThe committee discussion on cryptocurrency was triggered by a bill on digital currency regulations proposed by MNA Sharmila Farooqi. She argued that Pakistan needed to regulate crypto to prevent money laundering, especially after its exit from the Financial Action Task Force’s grey list.\n\nThe Pakistan Crypto Council was officially launched in March this year to “regulate and integrate blockchain technology and digital assets” into the country’s financial landscape.\n\nStrategic Bitcoin Reserve\n\nThe debate coincided with the unveiling of the country’s first government-led Strategic Bitcoin Reserve by Pakistan Crypto Council CEO Bilal Bin Saqib, the newly promoted special assistant to the prime minister on crypto and blockchain.\n\nAn official statement released by the Ministry of Finance said the unveiling was held at Las Vegas, United States, at an event for an elite audience that included US Vice President J.D. Vance, and the sons of US President Donald Trump — Eric Trump and Donald Trump Jr.\n\n“This wasn’t just a policy moment — it was a rebranding of a nation,” the statement said, adding that Mr Saqib conveyed a bold message that Pakistan was no longer defined by its past.\n\nSpeaking at the event, Mr Saqib said Pakistan is “being reborn as a forward-looking hub of digital innovation — powered by its youth, sharpened by necessity, and led by a new generation of tech statesmen.”\n\nHe added, “I’m not just here as a minister. I’m here as the voice of a generation — a generation that is online, on-chain, and unstoppable.”\n\nA statement issued by Mr Saqib’s office said that while “other leaders talk about potential, Bilal is unlocking it — with bold national moves that put Pakistan at the centre of the global crypto conversation”.\n\nHe also announced the establishment of a national Bitcoin wallet, holding digital assets already in state custody — not for sale or speculation, but as a sovereign reserve signalling long-term belief in decentralised finance.\n\nHe also thanked President Trump for his role as a peacemaker in the recent India-Pakistan conflict and for his commitment to crypto adoption.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:26.895Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914192/crypto-policy-in-disarray-as-sbp-ministry-insist-ban-is-still-in-place",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:38:26.000Z"
}
