{
  "title": "Polio immunisation campaign enters final phase in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The third national polio immunisation campaign of the year that is deemed critical for interrupting the ongoing poliovirus transmission has entered its final phase in Punjab.\n\nAs of Thursday, polio teams conducted house-to-house visits during the designated catch-up days to reach children missed vaccination earlier.\n\nIn major urban centres and high-risk districts classified as ‘mega districts’, the campaign will continue for seven days, concluding on Sunday.\n\nIn other districts across the province, the drive will run for five days and end on Friday (tomorrow).\n\nA spokesperson for the programme has termed this campaign especially significant, given the onset of the high poliovirus transmission season, which typically lasts from May through September, coinciding with hot and humid conditions that are conducive to virus survival and spread.\n\nHe said the timing of the campaign was also strategic, preceding the Eid holidays — a period marked by extensive human mobility. This increased movement raises the risk of virus transmission from one region to another, particularly affecting unvaccinated or immunocompromised children. These children are at heightened risk of contracting and spreading the virus, potentially undermining the gains made in previous immunization rounds.\n\nIn the first three days alone, frontline polio workers successfully vaccinated over 15m children under the age of five.\n\nEmergency Operations Center (EOC) Coordinator Adeel Tasawar urged teams to intensify efforts during the catch-up days, emphasising the importance of revisiting homes where children were missed.\n\n“Achieving high coverage is the key to boosting herd immunity, ensuring the poliovirus has no sanctuary in our communities,” he said.\n\nMr Tasawar called on caregivers and parents to cooperate with polio teams and report any missed children or related issues by contacting the national helpline at 1166. He praised polio workers as national heroes, recognising their tireless efforts to go door-to-door with the sole mission of eradicating polio from Pakistan.\n\n“They deserve respect, support, and a glass of water if needed,” he added, encouraging the public to honor their dedication.\n\nPunjab, being the most populous province of Pakistan, plays a pivotal role in the national polio eradication strategy. With its dense urban centres and frequent population movements, the province is a key battleground in the fight against poliovirus. The current campaign, launched on May 26, aims to reach over 23m children under five years of age with the oral polio vaccine (OPV). More than 200,000 trained workers and district supervisors have been mobilised to ensure the campaign’s success.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:40.498Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914138/polio-immunisation-campaign-enters-final-phase-in-punjab",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:10:54.000Z"
}
