{
  "title": "Pakistan Post under fire over fund misuse, illegal hiring - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pub­lic Accounts Commi­ttee (PAC) on Thursday expressed serious concern over financial mismanagement and unlawful rec­r­u­itment within the Pakis­tan Post Office during a review of audit objections pertaining to the Ministry of Communications.\n\nDuring the session, chaired by Junaid Akbar Khan, the PAC also established a new subcommittee to address the matter further. Muneeb Amir Pirzada was appointed as its convener, with Nadeem Abbas, Khawaja Shiraz and Saleem Mandviwalla named as members.\n\nAudit officials highli­g­hted that the Pakistan Post Office Department ope­ned multiple accounts in the National Bank of Pakistan (NBP) without pr­o­per aut­h­orisation. While the Fina­nce Divi­sion had approved the opening of three accounts, the Post Office opened two additional ones without approval.\n\n“Despite the audit obje­ctions, no departmental action has been taken so far,” audit officials stated. Communi­cations Secretary Ali Sher Mehsud acknowledged that the Pakistan Post Office was facing significant operational challenges.\n\nHowever, the committee chair expressed frustration over the lack of coordination between the Finance Division and the department.\n\n“The Finance Division says it never received the request, while the secretary claims it was sent. Where is the disconnect?” asked Mr Akbar.\n\nThe committee has also officially sought a response from the Ministry of Finance.\n\nThe session also addressed allegations of illegal hiring within the Post Office.\n\nAudit officials reported that advertisements were issued for 4,252 positions, despite only 3,938 being officially sanctioned.\n\n“Most of the documents submitted by the hired individuals are fake. Jobs were sold, and you’re saying there’s a stay order?” remarked an outraged Mr Akbar.\n\nSenator Afnanullah Khan added, “Those who accepted bribes and those who offered them are both at fault. Legal action should be taken against both.”\n\nThe PAC decided to refer the matter to the NAB for investigation.\n\nMisuse of over Rs4bn funds\n\nThe committee also took up audit objections concerning the unauthorised use of over Rs4 billion in funds by Pakistan Post.\n\nThe committee members questioned how utility bill payments collected from citizens were misappropriated.\n\n“These were public funds submitted by people paying their electricity bills. How can you justify using them for other purposes?” questioned the chairman.\n\nCalling the act akin to “robbery”, PAC members demanded accountability. Khawaja Shiraz Mehmood asked what disciplinary measures had been taken against those responsible.\n\nIn response, the communications secretary claimed that internal disciplinary steps had been initiated and emphasised the need for financial reconciliation with the National Bank.\n\nThe PAC has summoned officials from the NBP to the next session for further clarification on the matter.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:27.769Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914189/pakistan-post-under-fire-over-fund-misuse-illegal-hiring",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:30:09.000Z"
}
