{
  "title": "Egypt denies court ruling threatens historic monastery - World - DAWN.COM",
  "author": null,
  "content": "Egypt and Greece sought to ease tensions over the historic St Catherine’s monastery in the Sinai peninsula on Friday after a controversial court ruling said it sat on state-owned land.\n\nCairo has denied that the ruling threatens the UNESCO World Heritage landmark after Greek and church authorities warned of the sacred site’s status.\n\nSt Catherine’s monastery was established in the sixth century at the biblical site of the burning bush in the southern mountains of the Sinai peninsula and is the world’s oldest continually inhabited Christian monastery.\n\nA court in Sinai ruled on Wednesday in a land dispute between the monastery and the South Sinai governorate that the monastery “is entitled to use” the land, which “the state owns as public property”.\n\nBut on Friday, in a phone call with Greek Prime Minister Kyriakos Mitsotakis, President Abdel Fattah al-Sisi said Cairo was “fully committed to preserving the unique and sacred religious status of Saint Catherine’s monastery, and ensuring it is not violated”.\n\nThe Greek premier’s office said Mitsotakis emphasised the importance of “preserving the pilgrimage and Greek Orthodox character of the monastery and resolving the issue in an institutional manner”, based on an agreement between the two countries.\n\nA Greek delegation is due to visit Egypt next week, the government in Athens said.\n\nSisi’s office has defended the court ruling, saying that it “consolidates” the site’s sacred status, after the head of the Greek Orthodox church in Greece denounced it.\n\nArchbishop Ieronymos of Athens called the court ruling “scandalous” and an infringement by Egyptian judicial authoriities of religious freedoms.\n\nHe said the decision means “the oldest Orthodox Christian monument in the world, the Holy Monastery of Saint Catherine in Mount Sinai, now enters a period of severe trial – one that evokes much darker times in history”.\n\nThe Saint Catherine area, which includes the eponymous town and a nature reserve, is undergoing mass development under a controversial government megaproject aimed at bringing in mass tourism.\n\nObservers say the project has harmed the reserve’s ecosystem and threatened both the monastery and the local community.\n\nArchbishop Ieronymos warned that the monastery’s property would now be “seized and confiscated”, despite “recent pledges to the contrary by the Egyptian President to the Greek Prime Minister”.\n\nGreek Foreign Minister Giorgos Gerapetritis contacted his Egyptian counterpart Badr Abdelatty on Thursday, saying “there was no room for deviation from the agreements between the two parties”, the ministry’s spokesperson said.\n\nIn a statement to Egypt’s state news agency, the foreign ministry in Cairo later said rumours of confiscation were “unfounded”, and that the ruling “does not infringe at all” on the monastery’s sites or its religious and spiritual significance.\n\nGreek government spokesman Pavlos Marinakis said, “Greece will express its official position … when the official and complete content of the court decision is known and evaluated”.\n\nHe confirmed both countries’ commitment to “maintaining the Greek Orthodox religious character of the monastery”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:33:57.998Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914313/egypt-denies-court-ruling-threatens-historic-monastery",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T15:14:20.000Z"
}
