{
  "title": "Cost of disasters exceeds $2.3 trillion annually: UN report - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The total cost of disasters now exceeds $2.3 trillion annually, factoring in cascading and ecosystem impacts, according to a UN report.\n\n“Global Assessment Report on Disaster Risk Reduction 2025” by the United Nations Office for Disaster Risk Reduction (UNDRR) finds that while direct disaster costs averaged $70 billion to $80bn a year between 1970 and 2000, these figures surged to $180bn to $200bn annually from 2001 to 2020. The growing economic burden highlights the intensifying impact of disasters worldwide.\n\nThe “big five” disasters — earthquakes, floods, storms, droughts and heatwaves — have accounted for over 95pc of direct recorded losses over the past 20 years. In 2023 alone, these hazards caused direct economic losses of more than $195.7bn, or about 0.015pc of global GDP. Extreme heat, once overlooked, is now included among these primary hazards due to its role in fatalities, reduced productivity, and lower well-being.\n\nPakistan’s 2022 floods, which killed more than 1,700 people and caused $30bn in damages, led to substantial impacts on capital markets and the country’s sovereign credit rating. “As climate change intensifies extreme events, future climate-induced rating downgrades may be more likely,” the report said. This poses a growing concern for economies and investors alike, including pension funds, insurers, and central banks that hold sovereign debt.\n\nWarns risk reduction critically underfunded at 2pc of aid\n\nBetween 1970 and 2023, geophysical disasters such as earthquakes caused approximately $1.59tr in economic losses. Another $5.18tr in losses came from 24,433 reports of floods, storms, droughts, and extreme heat, with other disasters contributing an additional $100bn.\n\nDespite the overwhelming evidence, only 2pc of development aid is allocated to disaster risk reduction. “Under-estimating the risk of disasters means under-valuing the benefits of risk reduction,” the report says. As populations and development increasingly concentrate in vulnerable areas, the exposure and vulnerability to hazards grow significantly.\n\nClimate-induced school disruptions are also rising. In 2024, at least 242 million students across 85 countries faced school closures due to climate events. Of these, 74pc were in low- and lower-middle-income nations, exacerbating educational inequalities and long-term impacts.\n\nFrom 2000 to 2023, earthquakes, extreme heat, storms, floods, and droughts were responsible for 90pc of disaster deaths — with earthquakes alone accounting for half. Since 1900, 12 earthquakes have killed more than 50,000 people each, five of which occurred after 2000.\n\nWater-related hazards dominated from 1970 to 2019, making up 50pc of all disasters and 45pc of disaster-related deaths. Floods have increased by 134pc since 2000, with Asia recording most of the associated deaths and economic losses. The number of people exposed to floods rose from 28.1 million in 1970 to 35.1m in 2020 — a 24.9pc increase.\n\nDroughts are similarly widespread. Between 2007 and 2017, they affected at least 1.5bn people and caused $125bn in losses. Most drought-related deaths since 2000 have occurred in Africa. As of 2025, over 920m children — more than one-third of the global child population — are highly exposed to water scarcity.\n\n“Agriculture is the most vulnerable sector to climate impacts,” the report notes, with 82pc of all drought-related losses between 2008 and 2018 occurring in agriculture in low- and lower-middle-income countries.\n\nBetween 1984 and 2023, regions such as central U.S., Argentina, Turkey, northwest India, Pakistan, the Horn of Africa, Central Asia, and parts of Australia experienced the highest frequency of severe agricultural droughts — around 8 to 12 events over the 40-year span. Much of this variation is linked to El Niño and La Niña cycles.\n\nPublished in Dawn, May 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:28.973Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914182/cost-of-disasters-exceeds-23-trillion-annually-un-report",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T02:18:47.000Z"
}
