{
  "title": "Human rights defenders Tahira Abdullah, Samina Omar released after brief detention in Islamabad: HRCP - Pakistan - DAWN.COM",
  "author": null,
  "content": "Human rights defenders Tahira Abdullah and Samina Omar were released following a short detention in Islamabad on Friday, a Human Rights Commission of Pakistan (HRCP) activist told Dawn.com.\n\nThe HRCP earlier condemned the “arbitrary arrest of human rights defenders Tahira Abdullah and Samina Omar in Islamabad” in a post on X. According to the post, the pair was taken into custody outside the National Press Club ahead of a protest in solidarity with the people of Gaza.\n\n“Given that neither of them was part of any public gathering at the time, their actions in no way constitute a violation of Section 144 as the police have alleged,” the statement said.\n\nSection 144 of the Criminal Procedure Code is a legal provision that empowers district administrations to prohibit an assembly of four or more people in an area for a limited period.\n\nThe statement said the commission was “concerned to learn that [the women] are allegedly not being given access to their legal counsel”.\n\n“Both Ms Abdullah and Ms Omar must be released immediately and unconditionally,” HRCP said.\n\nThe protest was organised by former Jamaat-i-Islami (JI) Senator Mushtaq Ahmad Khan. Earlier today, he announced the call for protest in a post on X, stating, “This is an appeal for participation.”\n\nPrior to their release, HRCP activist Tariq Mehmood Ghouri told Dawn.com that Abdullah and Omar were being held in custody at the women’s police station in Sitara Market, Islamabad, along with two other female activists belonging to the JI.\n\n“They have been charged under Section 188 (disobedience to order duly promulgated by public servant),” of the Pakistan Penal Code, he said, adding that one of the JI activists is Mushtaq’s daughter.\n\nTariq further said that seven men were also arrested and were being held at Kohsar police station.\n\nEx-senator Mustaq and other activists have been previously arrested as well for staging pro-Gaza protests in the federal capital for violating Section 144.\n\nIn September last year, police picked up Mushtaq, his wife and his son along with over two dozen protestors, during a march organised to express solidarity with the people of Gaza. The ex-senator had called for the rally and asked the people to gather at Express Chowk, one of the entry points of the high-security Red Zone from the D-Chowk side.\n\nIn March 2024, the capital police had booked the former senator and 350 others on several charges, including pelting the law enforcers with stones and threatening them with dire consequences, after they organised a protest at Express Chowk in connection with Palestine.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/301953143830f38.jpg",
  "retrievedAt": "2025-08-23T14:33:59.495Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914305/human-rights-defenders-tahira-abdullah-samina-omar-released-after-brief-detention-in-islamabad-hrcp",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T14:54:56.000Z"
}
