{
  "title": "Field Marshal Asim Munir assails India’s ‘hydro-terrorism’ during address to Quetta college - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) Field Marshal Asim Munir on Friday emphasised the need for a peaceful resolution to the Kashmir dispute, assailing India’s “unlawful and legally untenable hydro-terrorism,” a statement from the military’s media wing said.\n\nHis statement came during a visit to Quetta Command and Staff College where he addressed student officers and faculty of the college. The comments followed a recent military confrontation between India and Pakistan over New Delhi’s allegations against Islamabad, without evidence, about a deadly attack in occupied Kashmir’s Pahalgam.\n\nNew Delhi, based on the allegations, launched a series of air strikes in Pakistan in early May, killing civilians. Islamabad retaliated by downing five Indian jets. It took American intervention on May 10 for both sides to finally reach a ceasefire.\n\nIndia, however, is still weaponising the Indus Water Treaty — a water distribution deal between the two countries — saying that it will no longer abide by the treaty, placing the agreement in “abeyance”.\n\nAccording to a press release issued by the Inter-Services Public Relations (ISPR), the army chief emphasised the need for a peaceful resolution of the Kashmir dispute, and warned against India’s “unlawful and legally untenable ‘hydro-terrorism’.”\n\n“Commenting on the global and regional environment, the COAS shed light on the character of emerging conflict, with particular emphasis on India’s increasingly dangerous propensity to use unprovoked military aggression against Pakistan,” the statement said.\n\n“While reiterating the resolve to defeat any aggression and ability to deal with threats across the entire conflict spectrum, the COAS asserted that Pakistan will never be coerced and inimical designs to distract Pakistan’s efforts against the war on terrorism will be comprehensively defeated.”\n\nThe field marshal also paid tribute to the martyrs of Operation Bunyanum Marsoos against India and expressed complete solidarity with their family members.\n\nHe said that the Pakistani people became “a wall of steel for the defence of the motherland” under the national leadership.\n\nThe ISPR also said that the army chief highlighted the “Indian state’s role in sponsoring terrorism inside Pakistan”, adding that he spoke on the “reinvigorated counter-terrorism drive and expressed confidence that the nation’s fight against terrorism will be driven to a logical conclusion”.\n\nThe statement further said, “Talking about leadership, the Field Marshal advised the student officers to fulfill their obligations with utmost dedication, passion and resolve.\n\n“Emphasising the need for innovative thinking and research, he lauded the Command & Staff College Quetta for grooming future military leaders who uphold the highest standards of this sacred profession.”\n\nHe was quoted in the statement as saying, “Training must reflect not only the current realities but also prepare us for the future battlefield, one that demands agility, innovation, and unwavering resolve.”\n\nUpon his arrival in Quetta, the Field Marshal was received by Quetta Corps Commander and Quetta Commandant Command and Staff College, it added.\n\nLast week, the government promoted Gen Munir to the rank of field marshal in recognition of his “strategic leadership and decisive role” in defeating India during the military confrontation between the two countries that ended with a US-mediated ceasefire.\n\nField marshal is the highest rank in armies modelled after the British Army. In Pakistan, it was awarded only once before, to General Mohammad Ayub Khan in 1959.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/302156056fab848.jpg",
  "retrievedAt": "2025-08-23T14:33:57.250Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914324/field-marshal-asim-munir-assails-indias-hydro-terrorism-during-address-to-quetta-college",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T18:03:16.000Z"
}
