{
  "title": "Half the world faced an extra month of extreme heat due to climate change: study - World - DAWN.COM",
  "author": null,
  "content": "Half the global population endured an additional month of extreme heat over the past year because of manmade climate change, a new study found on Friday.\n\nThe findings underscore how the continued burning of fossil fuels is harming health and well-being on every continent, with the effects especially under-recognised in developing countries, the authors said.\n\n“With every barrel of oil burned, every tonne of carbon dioxide released, and every fraction of a degree of warming, heat waves will affect more people,” said Friederike Otto, a climate scientist at Imperial College London and co-author of the report.\n\nThe analysis — conducted by scientists at World Weather Attribution, Climate Central, and the Red Cross Red Crescent Climate Centre — was released ahead of global Heat Action Day on June 2, which this year spotlights the dangers of heat exhaustion and heat stroke.\n\nTo assess the influence of global warming, researchers analysed the period from May 1, 2024 to May 1, 2025.\n\nThey defined “extreme heat days” as those hotter than 90 per cent of temperatures recorded at a given location between 1991 and 2020.\n\nUsing a peer-reviewed modelling approach, they then compared the number of such days to a simulated world without human-caused warming.\n\nThe results were stark: roughly four billion people — 49pc of the global population — experienced at least 30 more days of extreme heat than they would have otherwise.\n\nThe team identified 67 extreme heat events during the year and found the fingerprint of climate change on all of them.\n\nThe Caribbean island of Aruba was the worst affected, recording 187 extreme heat days — 45 more than expected in a world without climate change.\n\nThe study follows a year of unprecedented global temperatures. 2024 was the hottest year on record, surpassing 2023, while January 2025 marked the hottest January ever.\n\nOn a five-year average, global temperatures are now 1.3 degrees Celsius above pre-industrial levels — and in 2024 alone, they exceeded 1.5C, the symbolic ceiling set by the Paris climate accord.\n\nThe report also highlights a critical lack of data on heat-related health impacts in lower-income regions.\n\nWhile Europe recorded more than 61,000 heat-related deaths in the summer of 2022, comparable figures are sparse elsewhere, with many heat-related fatalities misattributed to underlying conditions such as heart or lung disease.\n\nThe authors emphasised the need for early warning systems, public education, and heat action plans tailored to cities.\n\nBetter building design — including shading and ventilation — and behavioural adjustments like avoiding strenuous activity during peak heat are also essential.\n\nStill, adaptation alone will not be enough. The only way to halt the rising severity and frequency of extreme heat, the authors warned, is to rapidly phase out fossil fuels.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:34:03.313Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914278/half-the-world-faced-an-extra-month-of-extreme-heat-due-to-climate-change-study",
  "dateList": "2025-05-30",
  "date_published": "2025-05-30T08:52:49.000Z"
}
