{
  "title": "Hamas spokesperson killed in Israeli strike - World - DAWN.COM",
  "author": null,
  "content": "• Separate attacks kill seven in Gaza\n• UN agency says it has ‘two weeks’ of food supplies left\n\nCAIRO: Hamas spokesperson Abdel-Latif Al-Qanoua has been killed in an Israeli airstrike in northern Gaza, Hamas-affiliated media said on Thursday, the latest group figure to be killed since Israel resumed its operations in the enclave.\n\nAl-Qanoua was killed when his tent was targeted in Jabalia, Al-Aqsa television said. The same strike wounded several people, while separate attacks killed at least six in Gaza City and one in southern Gaza’s Khan Yunis, medical sources said.\n\nEarlier this week, Israel killed Ismail Barhoum, a member of Hamas’ political office, and Salah al-Bardaweel, another senior leader.\n\nBoth Bardaweel and Barhoum were members of the 20-member Hamas decision-making body, the political office, 11 of whom have been killed since the start of the war in late 2023, according to Hamas sources.\n\nLast week, Israel ended a two-month-old ceasefire by resuming bombing and ground operations, increasing pressure on Hamas to free the remaining prisoners in its captivity.\n\nAt least 830 people, over half of them children and women, have been killed since Israel resumed major military strikes in Gaza on March 18, according to Gaza’s health ministry.\n\nHamas accused Israel of jeopardising efforts by mediators to negotiate a permanent deal to end the fighting.\n\nFood stocks\n\nThe UN’s World Food Progra­mme warned on Thursday it had only two weeks’ worth of food left in Gaza, where “hundreds of thousands of people” are at risk of severe hunger and malnutrition.\n\n“WFP has approximately 5,700 tonnes of food stocks left in Gaza — enough to support WFP operations for a maximum of two weeks,” the Rome-based agency said in a statement.\n\nWFP said on Thursday that it and others in the food security sector had been “unable to bring new food supplies into Gaza for more than three weeks”.\n\n“Hundreds of thousands of people in Gaza are again at risk of severe hunger and malnutrition as humanitarian food stocks in the Strip dwindle and borders remain closed to aid,” it said.\n\n“Meanwhile, the expansion of military activity in Gaza is severely disrupting food assistance operations and putting the lives of aid workers at risk every day,” WFP added.\n\nThe agency said that due to the deteriorating security situation and rapid displacement of people, it will “distribute as much food as possible, as quickly as possible”. It is reducing individual rations so the agency can feed more people overall.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/280926274e76c39.jpg",
  "retrievedAt": "2025-10-12T02:14:35.851Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900754/hamas-spokesperson-killed-in-israeli-strike",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:50:42.000Z"
}
