{
  "title": "Turkish govt deports BBC reporter, bans TV channel - World - DAWN.COM",
  "author": null,
  "content": "ISTANBUL: Turkiye on Thurs­day stepped up a crackdown on media coverage of mass protests since the arrest of Istanbul’s popular mayor, deporting a BBC journalist and imposing a 10-day broadcast ban on an opposition TV channel.\n\nThe moves came after police detained 11 Turkish journalists, including AFP’s photographer, who were covering the worst street protests to hit Turkiye since 2013.\n\nThe photographer, Yasin Akgul, was freed on Thursday from an Istanbul jail, AFP correspondents said, though his lawyer said the charges against him remain.\n\nThe protests erupted on March 19 after the arrest and subsequent jailing of Istanbul mayor Ekrem Imamoglu, President Recep Tayyip Erdogan’s biggest political rival. Defying a protest ban, vast crowds have hit the streets daily, with the nightly rallies often descending into running battles with riot police, whose crackdowns have drawn international condemnation.\n\nThe moves come amid the worst agitation to have rocked Turkiye since 2013\n\nEarlier on Thursday, Turkiye deported a BBC journalist covering the protests on grounds he posed “a threat to public order”, the British broadcaster said.\n\nMark Lowen was taken from his Istanbul hotel on Wednesday and detained for 17 hours before being deported in what BBC News CEO Deborah Turness called “an extremely troubling incident”. So far, more than 1,879 people have been detained since March 19, Interior Minister Ali Yerlikaya said. By 1400 GMT, 10 of the 11 detained Turkish journalists had been freed.\n\nAkgul’s release\n\nAkgul was detained in a pre-dawn raid at his home on Monday and remanded in custody by an Istanbul court a day later. He was charged with “taking part in illegal rallies and marches”, drawing outrage from rights groups and the Paris-based news agency.\n\nOn Thursday, the court ordered that he and six other journalists be released from custody, the MLSA rights group said. Akgul’s lawyer said he would be unconditionally released but said that the charges against him had “not been dropped” and that the investigation would continue.\n\nThe 35-year-old father of two was released from Metris prison just before 1530 GMT, correspondents at the scene said.\n\n“Yasin Akgul’s release is welcome and constitutes redress for a monumental injustice,” Erol Onder­oglu of media watchdog Reporters Without Borders (RSF) said on Thursday. The arrests had sparked international condemnation, including from the United Nations.\n\nOf the nearly 1,900 people detained since March 19, Yerlikaya said 260 had been remanded in custody, 468 granted conditional release, 489 freed and another 662 cases were still being processed.\n\nMark Lowen, the BBC broadcaster, had been in Turkiye to cover mass street protests triggered by the arrest and jailing of Istanbul’s Mayor Ekrem Imamoglu.\n\nBBC News CEO Deborah Turness called the deportation “extremely troubling” and said the broadcaster would raise the issue with Turkish authorities. Lowen, who previously lived in Turkiye for five years, said his expulsion was “extremely distressing”, adding that press freedom is essential to democracy.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:31:05.891Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900746/turkish-govt-deports-bbc-reporter-bans-tv-channel",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:51:20.000Z"
}
