{
  "title": "UN report uncovers twin cities’ vulnerability to natural hazards - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A new United Nations report has revealed that Islamabad is experiencing localised flooding due to the lack of an adequate storm drainage system despite being a planned city.\n\nThe report said despite moderate rainfall, Islamabad and Rawalpindi faced growing water stress due to rapid urban expansion, deforestation and rising demand.\n\nThe crisis was compounded by groundwater depletion and higher temperatures, it noted.\n\nThe report titled, ‘Multi-Hazard Vulnerability and Risk Assessment (MHVRA)’, for Rawalpindi, Islamabad and Nowshera was launched in Islamabad on Thursday by the United Nations Human Settlements Programme (UN-Habitat) and the National Disaster Management Authority (NDMA).\n\nThe report highlighted Islamabad’s battle with localised flooding due to inadequate stormwater management systems and rapid land-use changes that increase surface run-off and flood exposure.\n\nIn Rawalpindi, urban flash floods were primarily due to the overflow of Nullah Leh - an already vulnerable natural drainage channel - during the monsoon season.\n\nPakistan Council of Research in Water Resources (PCRWR) and WASA presented their work done under the Adaptation Fund Project.\n\nPCRWR said it built the capacity of 107 government officials to plan, construct, operate, maintain and replicate flood-resilient water harvesting facilities to enhance capacity in developing spatial plans.\n\nWASA said it installed 33 rainwater harvesting facilities on public buildings in Rawalpindi.\n\nThe assessment marked a key achievement under the “Enhancing Community, Local and National-Level Urban Climate Change Resilience to Water Scarcity Caused by Floods and Droughts” project, funded by the Adaptation Fund Board.\n\nThe project is being implemented in collaboration with the Ministry of Climate Change, NDMA, PCRWR, WASA and TMA Nowshera.\n\nThe UN report highlighted that Nowshera, situated along the Kabul River, was highly vulnerable to riverine flooding, with past events such as the catastrophic 2010 floods demonstrating the need for urgent interventions. The study mapped high-risk flood zones in Nowshera and identified critical infrastructure vulnerabilities and potential flood inundation extents.\n\nTheir technical expertise and local knowledge have been integral in ensuring the quality and relevance of the assessment.\n\nPakistan, one of the most climate-vulnerable countries in the world, faces an increasing frequency and intensity of natural hazards - floods, droughts, landslides, glacial lake outburst floods, and more.\n\nThese threats are further exacerbated by unplanned urban growth, population pressure, settlement in high-risk areas and the impacts of climate change.\n\nIn Nowshera, reliance on rainfall for agriculture makes it highly vulnerable during dry spells, worsened by poor irrigation and deforestation.\n\nThe MHVRA recommended mitigation measures such as improved drainage, reinforced Kabul River embankments and nature-based flood absorption solutions.\n\nIts findings will inform national and local policies, strengthen capacity, and enhance disaster response planning.\n\nWith continued support from the Adaptation Fund Board, UN-Habitat said it remained committed to working alongside the Government of Pakistan and local implementation partners to strengthen community resilience and reduce the risks associated with climate-induced hazards.\n\nSpeaking at the launching of the assessment, UN-HABITAT Senior Advisor and Habitat Programme Manager, Jawed Ali Khan emphasised the importance of evidence-based tools like MHVRA for building climate resilience at all levels.\n\nThe MHVRA will provide a comprehensive analysis of climate-related risks and vulnerabilities in the selected districts and serve as a tool to guide urban resilience planning, risk-informed development and disaster preparedness, he said.\n\nNDMA Senior Plans Director Raza Iqbal highlighted that comprehensive risk assessments at the union council level in Islamabad, Rawalpindi and Nowshera enabled them to identify key vulnerabilities and hazards, particularly climate-induced disasters such as floods and droughts.\n\nHe also highlighted that the findings of the study served as a foundation for developing targeted disaster risk reduction strategies, updating infrastructure resilience measures and fostering community preparedness.\n\nNDMA Deputy Manager for GIS, Haris Mir, explained that for Rawalpindi, the MHVRA finds the city particularly prone to urban flash floods, primarily due to the overflow of Nullah Leh.\n\nEncroachments along its banks and limited drainage capacity have significantly increased flood risks and led to frequent damage to property and infrastructure.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:31:04.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900728/un-report-uncovers-twin-cities-vulnerability-to-natural-hazards",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:51:44.000Z"
}
