{
  "title": "Fear tactics - Newspaper - DAWN.COM",
  "author": null,
  "content": "TO say that the media fraternity’s worst fears are now coming true would be to suggest that there was a chance that they would not. This was simply never true. From the beginning, it had been clear that the recent Peca amendments, pushed hastily through parliament late January despite vociferous protests and dutifully signed by the president shortly thereafter, were aimed at critical voices in the media.\n\nWhat the fraternity has experienced over the past week in both Karachi and Islamabad is simply the law fulfilling its intended purpose. The regime now has legal cover to bully and harass working journalists for taking adversarial positions, and it has made it a point to turn it into a spectacle that can be cheered on and gloated over on social and mainstream media by its own supporters, as well as provide a demonstrative ‘lesson’ to those who still cling too tightly to their principles.\n\nThe highhandedness with which Farhan Mallick from Karachi and Waheed Murad from Islamabad have been treated over the past few days seems to be a message to the entire media community: fall in line, or else. It matters little what wrong they have committed or whether the charges against them will even stand in a court of law. One could safely presume that these likely do not matter to the authorities either. With the judiciary either unwilling or unable to uphold the principle of ‘innocent until proven guilty’, the legal process that these two journalists will be put through will be punishment enough. In the hands of the state, their ordeal will become the price they pay for the critical views both have previously expressed in public.\n\nMeanwhile, a journalist in Sahiwal faces Peca charges for defaming a lawyer after allegedly misreporting the circumstances of the latter’s removal from a position. In Lakki Marwat, a citizen has been booked under Peca for using “inappropriate language” against Bannu’s ulema for not announcing the moon sighting for Ramazan a day earlier. Model-turned-actor Nadia Hussain faces Peca charges for going public with the fact that she was approached for a bribe by a person claiming to be the director of FIA’s Karachi Zone. YouTuber Rajab Butt will be tried for Peca violations for giving his perfume a controversial name, while Mardan police are hunting for a local for using abusive language and spreading “negative propaganda” against the local press club.\n\nThis is the post-Peca amendments Pakistan that the state wants its citizenry to come to terms with. However, despite the intimidation and fear tactics, activists and the media fraternity must not give up. Ongoing efforts to challenge and repeal this black law must not falter. The courts hearing challenges to Peca amendments must be pressed into taking them up urgently.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:30:51.896Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900781/fear-tactics",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:58:19.000Z"
}
