{
  "title": "Contractor disappears as protesting CDA sanitation workers demand salaries - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Scores of sanitation employees associated with CDA’s contractor on Thursday staged a protest demonstration outside the office of the civic agency for release of their pending salaries.\n\nThe workers said that their salaries of around three months were pending. They demanded the CDA, the employer, to release their salaries.\n\n“Without salaries we are very upset. We are unable to feed our children,” said one of the protesters. He said the contractor was out of reach; therefore, it was the responsibility of CDA to pay them their pending salaries. The employees raised slogans against the CDA management and the contractor.\n\nThey said CDA was the employer of the contractor and it owed payment to contractor. The civic agency should pay them on behalf of the contractor.\n\n“This is grave injustice with poor employees like us. CDA is spending billions of rupees on development projects, but we are facing delay in release of our salaries from the contractor hired by CDA,” said another sanitation worker.\n\nWe are trying to trace contractor and ensure payment of salaries: officer\n\n“The CDA management should take notice of the issue. Sanitation workers have nothing to do with the issues of CDA and the contractor. Getting salaries is our right and CDA should pay us from the account of the contractor without any further delay,” he said, adding whenever they approached the contractor, he said he would pay the salaries as soon as the CDA released his payment.\n\nMeanwhile, a CDA officer said that the contract expired a couple of months ago and the protesting employees were liability of the former contractor. He said partial payment to the contractor was pending but he was out of reach.\n\n“Paying salaries on behalf of the contractor is difficult for us due to procedural issues. We are trying to trace the contractor and ensure he pays salaries to the workers otherwise we will go for paying the salaries directly,” the officer said.\n\nHe said after expiry of the contract, the CDA was doing cleanliness work in rural areas through the Rawalpindi Waste Management. In urban areas, the civic agency collects garbage through its own staff with hired machinery.\n\nThe officer said tendering process for outsourcing Islamabad Solid Waste Management was in a final stage and on April 10 bids would be opened to award a contract.\n\nEarlier, bids were supposed to be opened on March 26, but it was postponed till April 10.\n\nIn this contract, CDA will outsource primary and secondary collection of solid waste from rural and urban areas and its transportation to the landfill sites to a single firm for next seven years extendable for further three years. The estimated cost of the project is around Rs25 billion.\n\n“Instead of several contractors, the issue would be resolved for good as only one company will be responsible for picking and transporting trash from across the city,” said another official.\n\nOn the other hand, a source said outsourcing of the entire system to a single company was a good idea. “But there is a need to hold a special audit and an inquiry through Federal Investigation Agency (FIA) into the entire sanitation directorate of CDA. An inquiry of at least last five years should be conducted. During the last five years and so, billions of rupees were spent, but the outcome was not satisfactory,” said the source, adding that many officials managed their posting to the sanitation directorate during this period.\n\n“You know, many officers have been enjoying their posting in this directorate for years. FIA should check previous attendance of sanitation directorates and payment record. There are rumours that bogus payments were also released, but the picture will be clearer when an inquiry will be held” said the official source.\n\nCDA spokesperson Shahid Kiani said: “This is the issue between the ex-contractor and his private staff who has not paid their salaries.”  The staff is demanding the CDA to intervene.\n\nHe added: “CDA has his performance securities still with us and we have informed the sanitary workers that we won’t release them until he pays their due salaries. None of these people are working with CDA since the end of their contract.”\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:14:55.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900725/contractor-disappears-as-protesting-cda-sanitation-workers-demand-salaries",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:51:44.000Z"
}
