{
  "title": "Trump asks US Supreme Court to intervene in deportations fight - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump asked the Supreme Court on Friday to lift a temporary order blocking him from using a 1798 law to swiftly deport alleged Venezuelan gang members as part of his two-month-old administration’s hardline approach to immigration.\n\nThe Justice Department in a filing asked the court to lift Washington-based US District Judge James Boasberg’s March 15 order calling for a temporary halt of the summary removals of the Venezuelans while a legal challenge to Trump’s invocation of the Alien Enemies Act to justify the deportations plays out.\n\nThe 18th-century law historically has been used only in wartime.\n\nThe Justice Department said in its filing on Friday that the case presents the question of who decides how to conduct sensitive national-security-related operations, the president or the judiciary.\n\n“The constitution supplies a clear answer: the president,” the department wrote. “The republic cannot afford a different choice.”\n\nThe US Court of Appeals for the District of Columbia Circuit on Wednesday upheld the judge’s temporary block as proceedings continue in the case. The dispute has elicited Trump’s grievances toward federal courts, which have issued dozens of rulings impeding parts of Trump’s agenda.\n\nTrump invoked the Alien Enemies Act on March 15 to swiftly deport the alleged members of the Tren de Aragua gang, attempting to speed up removals with a law best known for its use to intern Japanese, Italian and German immigrants during World War Two.\n\nIn a legal challenge handled by the American Civil Liberties Union, a group of Venezuelan men in the custody of US immigration authorities on the same day sued on behalf of themselves and others similarly situated, seeking to block the deportations.\n\nThey argued, among other things, that Trump’s order exceeded his powers because the Alien Enemies Act authorises removals only when war has been declared or the US has been invaded.\n\nThe Alien Enemies Act authorises the president to deport, detain or place restrictions on individuals whose primary allegiance is to a foreign power and who might pose a national security risk in wartime. Boasberg, an appointee of Democratic president Barack Obama, temporarily blocked the deportations.\n\nBut Trump’s administration allowed two planes already in the air to continue to El Salvador, where American officials handed 238 Venezuelan men over to Salvadoran authorities to be placed in the Central American country’s ‘Terrorism Confinement Centre’.\n\nThe judge also has scrutinised whether the Trump administration violated his order by failing to return the deportation flights after his order was issued. Justice Department lawyers said the flights had left US airspace by the time Boasberg issued a written order and thus were not required to return.\n\nThey dismissed the weight of Boasberg’s spoken order during a hearing two hours earlier, calling for any planes carrying deportees to be turned around. Trump’s administration has argued that Boasberg’s temporary ban encroached on presidential authority to make national security decisions.\n\nOn March 18, Trump called for Boasberg’s impeachment by Congress — a process that could remove him from the bench — drawing a rebuke from US Chief Justice John Roberts.\n\nTrump on social media called Boasberg, who was confirmed by the US Senate in 2011 in a bipartisan 96-0 vote, a “radical left lunatic” and a “troublemaker and agitator”.\n\nThe DC Circuit upheld Boasberg’s order after holding a contentious hearing that involved heated language. Judge Patricia Millett told Justice Department lawyer Drew Ensign that “Nazis got better treatment under the Alien Enemies Act than has happened here”.\n\nEnsign responded, “We certainly dispute the Nazi analogy.”\n\nFamily members of many of the deported Venezuelan migrants deny the alleged gang ties. Lawyers for one of the deportees, a Venezuelan professional soccer player and youth coach, said US officials wrongly labelled him a gang member based on a tattoo of a crown meant to honour his favourite team, Real Madrid.\n\nTrump said he had a productive call today with Canadian Prime Minister Mark Carney and that the two leaders would meet after Canada’s election, which is scheduled for next month amid increased tensions between the neighbouring allies.\n\n“It was an extremely productive call, we agree on many things and will be meeting immediately after Canada’s upcoming election to work on elements of politics, business, and all other factors,” Trump wrote on his social media platform Truth Social.\n\nThat work “will end up being great for both the United States of America and Canada”, he added.\n\nCarney and his office have not yet released their take on the call, which comes one day after the new leader vowed to transform Canada’s economy to be less dependent on the US and ahead of Trump’s tariff announcement expected on April 2.\n\nThe US and its northern neighbour have long been close allies and trading partners. But relations have deteriorated after Trump, a Republican who took office in January, upended the relationship with tariff threats and repeated comments about making it the 51st US state.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/282109265622110.jpg",
  "retrievedAt": "2025-08-25T15:30:42.638Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900897/trump-asks-us-supreme-court-to-intervene-in-deportations-fight",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T16:22:26.000Z"
}
