{
  "title": "Rawalpindi authorities repatriated over 200 Afghans so far - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: As many as 213 Afghan nationals have been repatriated to their native country out of the 923 individuals arrested in Rawalpindi, sources said on Thursday.\n\nSince the drive against illegal foreigners was launched, as many as 923 Afghan nationals were shifted to the Afghan refugee holding centre near the Golra Mor.\n\nSources claimed that 22 of the arrested detainees escaped from the centre on Wednesday.\n\nBy Thursday, the centre had no inmates, they said.\n\nOf the total number of Afghan nationals detained, 86 had their visas expired, 116 had Afghan Citizen Cards (ACC) and 290 possessed Proof of Registration (PoR).\n\nThe government has set a March 31 deadline for Afghan nationals to leave Pakistan voluntarily. However, Afghan nationals holding PoRs issued by the National Database and Registration Authority (Nadra) will not be repatriated till June 30.\n\nRelations between Islamabad and Kabul are severed amid an uptick in terrorist attacks in Khyber Pakhtunkhwa and Baluchistan.\n\nPakistan accuses Afghanistan of harbouring terrorist groups like the Tehreek-i-Taliban Pakistan and Balochistan Liberation Army.\n\nPakistan’s western neighbour, however, rejects the allegations, calling for slow repatriation of its nationals.\n\nA senior police official told Dawn that they were very clear that ACC holders would be expelled from Rawalpindi and Islamabad before the deadline.\n\nHowever, those holding PoR cards will not be repatriated, he said.\n\nRawalpindi police had formulated a regular security plan for the Golra Mor camp, where a total of 40 officers and personnel, led by a superintendent of police (SP) had been deployed.\n\nAccording to the sources, work is ongoing in various stages to send the Afghans residing illegally back to their homeland.\n\nThe road on which the holding centre is set up has been declared a ‘Red Zone’ as part of tightened security.\n\nThe police officials have been asked to properly cordon off the area around the detention centre during the search operations and deploy personnel on the fence wherever the operation is intended so that the teams working inside the fence can carry out their work conveniently.\n\nComplete details and records of every Afghan resident found in the camp are being compiled, while no Afghan resident is allowed to have a mobile phone while staying in the camp.\n\nIn this case, the source said that if any illegal foreigner was found in the district, he/she would be rounded up and would be deported back to their home country.\n\n“Yes, all Afghans who are legal will be relocated from Rawalpindi-Islamabad after the deadline,” said the source.\n\nAs part of the move against illegal foreigners, including Afghan nationals, the intelligence agencies have been monitoring the implementation of the relocation plan of Afghan nationals.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:31:03.635Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900727/rawalpindi-authorities-repatriated-over-200-afghans-so-far",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:51:44.000Z"
}
