{
  "title": "US defence secy Pete Hegseth under fire yet again with ‘Islamophobic’ tattoo - World - DAWN.COM",
  "author": null,
  "content": "US Defence Secretary Pete Hegseth has once again drawn controversy and backlash over his new tattoo which spells ‘kafir’ (infidel), which many say is Islamophobic, various international media outlets reported on Friday.\n\nHegseth posted pictures on his X account where he joined the US Navy’s SEAL Delivery Vehicle Team One at a base in Pearl Harbour in Hawaii on Wednesday. One of the pictures showed a new tattoo on his arm that reads ‘kafir’, which according to Turkish outlet TRT World is the Arabic word for infidel or disbeliever.\n\nActivists and experts have argued that the tattoo is an Islamophobic symbol from the man overseeing the US military.\n\n“Hegseth just got a kafir tattoo under his Deus Vult tattoo — a Crusader slogan. This isn’t just a personal choice; it’s a clear symbol of Islamophobia from the man overseeing US wars,” Nerdeen Kiswani, a Palestinian activist, said on X.\n\n“’Kafir’” has been weaponised by far-right Islamophobes to mock and vilify Muslims,“ she added. “It’s not about his personal beliefs. It’s about how these beliefs translate into policy — how they shape military decisions, surveillance programmes, and foreign interventions targeting Muslim countries.”\n\nWriter Tam Hussain said the tattoo was “not a good look” for Hegseth, primarily when the term was used in the Quran to refer to someone who rejects God.\n\n“To the Muslim world, the tattoo will be seen as an open declaration of Hegseth’s enmity towards them, which will be confirmed by the bombing of a hospital in Yemen,” Hussain said on X.\n\nThe Council on American-Islamic Relations (CAIR) in a statement denounced the new tattoo, calling it “a sign of both anti-Muslim hostility and personal insecurity”.\n\n“Tattooing the Arabic word kafir — which essentially refers to a person who knowingly conceals or denies fundamental, divine truths — on his body is a sign of both anti-Muslim hostility and personal insecurity,” Nihad Awad, national executive director of CAIR, said in the statement, according to USA Today.\n\n“It appears Islam lives so rent-free in Pete Hegseth’s head that he feels the need to stamp himself with tattoos declaring his opposition to Islam alongside a tattoo declaring his affinity for the failed Crusaders.”\n\nThe council said that while Hegseth can tattoo himself all he wants, he should keep in mind that he leads the US military, where thousands of American Muslims are sworn to defend the country.\n\n“You don’t see American Muslims running around with tattoos declaring their opposition to Christianity because we are secure in our own faith, we respect the beliefs of our neighbours, and, in any case, most Muslims do not wear tattoos for religious reasons,” CAIR added.\n\nThis is not the first time Hegseth has drawn controversy and backlash, especially from Muslims.\n\nOn December 1, 2024, The New Yorker published a report that went through Hegseth’s past controversies. One of them cited a complaint from Concerned Veterans for America employees, which claimed that Hegseth shouted “kill all Muslims” while he was drunk at a bar in Ohio in 2015.\n\nTRT World reported that Hegseth was once again brought under scrutiny due to his ‘Deus Bult’ tattoo — Latin for “God Wills it” — which it says is a slogan used as a battle cry by the Crusaders as they “committed acts of genocide against Muslims and Jews”.\n\nThe outlet reported that Hegseth also has a tattoo of the Jerusalem Cross. “That cross has a long history in Christianity but has lately been co-opted by some far-right groups as a symbol of the fight for Western civilisation,” TRT World wrote.\n\nThe criticism of the tattoo comes at a time of increased scrutiny for the defense secretary, The Guardian reported. Members of Congress in the US are calling for an investigation into Hegseth and the other officials involved in the Signal leak that inadvertently exposed operational details of US plans to bomb Yemen as several representatives have called for him to resign, it added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/28172838989cc66.jpg",
  "retrievedAt": "2025-08-25T15:30:44.802Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900880/us-defence-secy-pete-hegseth-under-fire-yet-again-with-islamophobic-tattoo",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T12:53:22.000Z"
}
