{
  "title": "Bangladesh ex-PM Sheikh Hasina accused of plotting to overthrow govt - World - DAWN.COM",
  "author": null,
  "content": "Bangladeshi police said on Friday that they had filed a new criminal case against ousted premier Sheikh Hasina over an alleged plot to overthrow the government that replaced her.\n\nHasina is currently exiled in neighbouring India, her autocratic regime’s biggest patron and benefactor, after she was overthrown in a student-led revolution last August.\n\nNumerous criminal indictments have been issued against her and top loyalists of her Awami League party, including over a crackdown by security forces that killed hundreds of demonstrators during last year’s unrest.\n\nThe latest case centres on a virtual meeting attended by nearly 600 Awami League members in December, which police said had conspired to “wage civil war in Bangladesh” with the aim of restoring Hasina to power.\n\n“Many of them, both inside and outside the country, pledged to continue their fight until their last breath,” the case documents stated.\n\nPolice spokesman Jasim Uddin Khan told AFP that charges had initially been filed against Hasina and 72 others, but that the number of defendants may increase as the investigation progressed.\n\n“The number of participants in the virtual meeting was 577. We are investigating their roles, and if found complicit in the conspiracy, they will be charged,” he said.\n\nA report from the UN rights office earlier this year stated that Hasina’s government was responsible for systematic attacks and killings of protesters as it attempted to hold onto power last year.\n\nBangladesh is currently being led by an interim administration with Nobel peace laureate Muhammad Yunus, 84, at the helm.\n\nHis caretaker government is tasked with implementing democratic reforms ahead of fresh elections slated to take place by June 2026.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:30:46.483Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900844/bangladesh-ex-pm-sheikh-hasina-accused-of-plotting-to-overthrow-govt",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T07:53:13.000Z"
}
