{
  "title": "Depths of despair - Newspaper - DAWN.COM",
  "author": null,
  "content": "INSTEAD of becoming a harder state, why don’t we face the hard truth: a political dispensation widely viewed as illegitimate, and supported by the establishment and the deep state can never gain the trust of the citizens.\n\nThe law of harvest is immutable: we will always reap what we sow — no more, no less. Similarly, the law of justice is inviolable, and the closer we align ourselves with the correct principles, the better our fate as a nation will be. The solution lies in the ballot box. It is our best hope. There are limits to tolerance. With the current problem of brutal control, our fate is sealed. This predatory environment can only lead to violence.\n\nBalochistan has descended into a fog of grief — the province’s desolate and vast terrain has been reduced to a living hell. There are inequalities, unfairness, socioeconomic distortions, and violations of rights and justice.\n\nMarch 11 was another wake-up call for the nation, like the APS tragedy in Peshawar on Dec 16, 2014. A train full of passengers including civilians, soldiers and law-enforcement officials, along with their families, was ambushed in a desolate tract in Bolan. Unarmed passengers were taken hostage and mostly those from Punjab were identified and massacred. This incident was the most brutal of its kind in the recent past, especially with the escalation of militancy and violence in Balochistan over the last few years.\n\nThe current phase of insurgency has been the longest since it began in 2003 with the allegation of rape of a woman doctor by an army officer in Sui. The resulting stand-off between Nawab Akbar Bugti and then army chief Gen Pervez Musharraf was aggravated by a rocket attack on the latter near Kohlu in 2005 and the tragic death of Bugti in a cave near Kohlu on Aug 26, 2006. On an invitation from the president Gen Musharraf, Bugti had agreed to meet him in Islamabad. He was ready to board a plane from Sui to Islamabad when a sudden change of heart occurred.\n\nBalochistan’s desolate and vast terrain has been reduced to a living hell.\n\nIt was decided by the security establishment not to permit him to meet the president. He was told that the plane at Sui airport had developed a technical fault and that his journey to Islamabad was postponed. When he saw the plane take off without him, he abandoned any negotiation plans with the military-led regime and headed on a camel from his fort in Dera Bugti to a cave near the hills of Kohlu.\n\nAs former district SP of Sibi, Dhadar, Kohlu and Dera Bugti in 1984, I had dealt with Bugti. He was stubborn and idiosyncratic but never uttered a word against Pakistan. He would collect gas royalties from the state and distribute the money among his tribesmen.\n\nHe was not corrupt. Similarly, my experience of serving in Balochistan during the 1980s convinced me that Baloch chiefs like Nawab Khair Baksh Marri, Nawab Bugti and Sardar Ataullah Mengal were not financially corrupt leaders of their clans. People like Bugti, Mengal and Ghous Bakhsh Bizenjo had served as chief ministers and governors. We civil servants hardly found any instances of corruption or misuse of authority. However, resentment and ill feeling against the security establishment, including the deep state, which was identified as dominated by Punjab, was always there.\n\n“The people have no say… . It is the army and arms that rule. … There is no place for any other community in this government, be it the Baloch, the Sindis, the Afghans, or the Bengalis…,” wrote Prince Abdul Karim Khan to his brother, the Khan of Kalat in 1948, as he lamented what he termed as the “fascism” of one province.\n\nSuch negative perceptions must be addressed. After my last visit to Quetta in August 2024, I had warned the people in the corridors of power through a piece in this paper Quest for justice that the state had almost lost its narrative and its institutions were working under a siege mentality. The Baloch youth, especially the women, were thoroughly disillusioned. Dr Mahrang Baloch had captured the imagination of the younger generation that was born during the over two-decade phase of the current insurgency. The sardars — the Bugtis, the Marris and Mengals — were no longer calling the shots.\n\nThe solution was simple: fair and free elections. Those who contested the national polls on Feb 8, 2024, were not against the state of Pakistan. They wanted to be part of the solution by opting for a clear distinction between the ballot and the bullet. They were denied their mandate. The massively rigged election of Feb 8 will go down in history as the trigger for arbitrary and authoritarian rule by the state. Judicial independence stands compromised. Freedom of speech has been curbed. No one is safe from the forces of tyranny and coercion. The police have become an instrument of oppression.\n\nHere is my plea for immediately adopting a saner course: The revised CT National Action Plan reiterated reconciliation with Baloch dissidents and activists, not with the militants of proscribed groups like the BLA, BLF and BRA. The leadership of mainstream political parties including the PPP, PML-N, PTI and JUI must engage constructively with the disillusioned politicians of Balochistan who want a resolution within the constitutional framework.\n\nSecondly, the recommendations of Islamabad High Court’s Missing Persons Commission, headed by Akhtar Mengal, should be implemented forthwith. Thirdly, a policy group of professionals must be activated by the government to make recommendations related to the province’s economic, security, governance, and development challenges. It is important to emphasise this even if no one in the current ruling elite pays heed to these suggestions.\n\nThe words of Leo Rosten make sense: “It is the weak who are cruel. Gentleness can only be expected from the strong.” We need strong gentlemen and women of integrity as our rulers, who can uphold the rule of law. Let them be elected afresh through a fair and free process.\n\nThe writer is a former inspector-general of Balochistan Police.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e61143be305.jpg",
  "retrievedAt": "2025-08-25T15:30:51.484Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900787",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T03:03:34.000Z"
}
