{
  "title": "US VP Vance lands in Greenland as anger mounts over Trump takeover bid - World - DAWN.COM",
  "author": null,
  "content": "United States Vice President JD Vance landed in Greenland on Friday for a visit to a military base viewed by Copenhagen and Nuuk as a provocation at a time when President Donald Trump is seeking to annex the strategically placed, resource-rich Danish territory.\n\nTrump argues that the US needs the vast Arctic island for national and international security and has refused to rule out the use of force to get it.\n\n“We have to have it,” the US president reiterated on Wednesday.\n\nThe US delegation — which included National Security Adviser Mike Waltz and Energy Secretary Chris Wright — landed at the Pituffik Space Base in northwestern Greenland at 12:52pm (1552 GMT), according to journalists on board the flight from Washington.\n\n“The president is really interested in Arctic security, as you all know, and it’s only going to get bigger over the coming decades,” Vance said as he arrived at the mess hall of the base. He was also accompanied by his wife Usha, Utah Senator Mike Lee and former homeland security adviser Julia Nesheiwat, who is Waltz’s wife.\n\nThey were due to meet US Space Force members and “check out what’s going on with the security” of Greenland, Vance said in a video message this week.\n\nDanish and Greenlandic officials, backed by the European Union, have insisted the US will not get Greenland.\n\nDanish Prime Minister Mette Frederiksen has condemned the US decision to visit the Arctic island uninvited — for what was initially a broader visit to Greenlandic society — as “unacceptable pressure” on Greenland and Denmark.\n\nA majority of Greenlanders oppose US annexation, according to a January poll.\n\nThe US vice president angered Danes in early February when he claimed Denmark was “not doing its job” protecting Greenland and was “not being a good ally”.\n\nA fuming Frederiksen quickly retorted that Denmark had long been a loyal US ally, fighting alongside the Americans “for many, many decades”, including in Iraq and Afghanistan.\n\nThe Pituffik base is an essential part of Washington’s missile defence infrastructure, its location in the Arctic putting it on the shortest route for missiles fired from Russia at the US.\n\nKnown as Thule Air Base until 2023, it served as a warning post for possible attacks from the Soviet Union during the Cold War. It is also a strategic location for air and submarine surveillance in the northern hemisphere, which Washington claims Denmark has neglected.\n\nVance is “right in that we didn’t meet the American wishes for an increased presence, but we have taken steps towards meeting that wish”, Marc Jacobsen, a senior lecturer at the Royal Danish Defence College, told AFP.\n\nHe said the Trump administration needed to present more specific demands if it wanted a proper Danish response.\n\nIn January, Copenhagen said it would allocate almost $2 billion to beef up its presence in the Arctic and North Atlantic, acquiring specialised vessels and surveillance equipment.\n\nRussian President Vladimir Putin said on Thursday he considered Trump’s plans for Greenland “serious”. He voiced concern that “Nato countries, in general, are increasingly designating the far north as a springboard for possible conflicts.”\n\nGreenland is home to 57,000 people, most of them Inuits. It is believed to hold massive untapped mineral and oil reserves, although oil and uranium exploration is banned.\n\nUS Energy Secretary Chris Wright, a former mining executive, told Fox News on Thursday he hoped the United States and Greenland could cooperate on mining to “bring jobs and economic opportunity to Greenland and critical minerals and resources to the United States”.\n\nTrump’s desire to take over the ice-covered territory, which is seeking independence from Denmark, has been categorically rejected by Greenlanders, their politicians and Danish officials.\n\nWhile all of Greenland’s political parties are in favour of independence, none of them support the idea of becoming part of the US.\n\nA new broad, four-party coalition government was announced in Greenland just hours before the US delegation’s arrival, following elections earlier this month.\n\nIncoming prime minister Jens-Frederik Nielsen said the territory needed unity at this time.\n\n“It is very important that we put aside our disagreements and differences … because only in this way will we be able to cope with the heavy pressure we are exposed to from outside,” he said when he unveiled his government.\n\nNielsen said that by visiting Greenland when there was no government in office there, the US administration was “not showing respect to an ally”.\n\nInitially, Vance’s wife Usha had initially been due to travel to Greenland just with her son and attend a dogsled race in the town of Sisimiut. Locals said they had planned to give her a frosty reception, with several protests scheduled.\n\nThe visit to Sisimiut was then cancelled and replaced with a visit to the military base.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/28230001e1503f9.jpg",
  "retrievedAt": "2025-08-25T15:30:42.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900902/us-vp-vance-lands-in-greenland-as-anger-mounts-over-trump-takeover-bid",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T18:19:18.000Z"
}
