{
  "title": "Trailer kills teenage motorcyclist on Karachi’s Northern Bypass - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Reckless driving claimed life of another teenage boy in Surjani Town on Thursday evening, police said.\n\nSurjani SHO Ghulam Husain Pirzada said that five friends riding two motorcycles were on their way for a picnic at Hub River. When they reached a petrol pump on Northern Bypass near Manghopir, a trailer truck hit their bikes. As a result, 17-year-old Awais was critically injured. He was taken to a hospital where doctors pronounced him dead on arrival.\n\nThe driver responsible for the incident fled from the scene along with the heavy vehicle. The deceased was a resident of Gulshan-i-Maymar.\n\nPMA seeks action against ‘inefficient’ traffic officers\n\nCondemning the persistent failure of the government to enforce traffic rules — resulting in the loss of precious lives and road injuries on a daily basis — the Pakistan Medical Associa­tion (PMA) on Thursday demanded strict action against “inefficient and corrupt traffic officials” following a transparent investigation into their cases.\n\nAccording to media reports, 207 people — 185 men, 11 women, two young girls and nine children — have lost their lives in road accidents across Karachi this year, while over 900 people have been injured, including more than 100 women.\n\nThe MPA attributed the alarming situation to the complete failure of the responsible traffic authorities to discharge their duties effectively.\n\nIt demanded an impartial investigation into the alleged corruption and a thorough inquiry into reports of bribery within the traffic police, followed by swift disciplinary action against those found guilty.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:14:58.514Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900700/trailer-kills-teenage-motorcyclist-on-karachis-northern-bypass",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:51:30.000Z"
}
