{
  "title": "Doctor among three killed in Quetta blast - Newspaper - DAWN.COM",
  "author": null,
  "content": "QUETTA: At least three people, including a leading oncologist, were killed and 21 injured in a bomb blast on a major road of the provincial capital on Thursday.\n\nOfficials said the target was a police mobile patrolling the area.\n\nFour cops were also injured in the attack.\n\nPolice said unknown mis­creants planted explosives in a motorcycle and parked it on the Double Road.\n\nThe explosives were detonated via remote control as the police vehicle reached the site.\n\nPolice cordoned off the area and moved the victims to the Civil Hospital.\n\n“We received three bodies and 21 injured in the Trauma Centre,” Dr Wasim Baig, the spokesman for the Civil Hospital said.\n\nHe added that the condition of four injured was critical.\n\nThe doctor who was killed in the attack was identified as Dr Mehar­ullah Tareen, woking at a local cancer hospital.\n\nDr Tareen was getting his car serviced at a workshop near the attack site at the time of the explosion.\n\nThe second deceased was identified as Abdul Jabbar, while the identity of the third was unknown.\n\nFifteen out of the 21 injured have been identified as Ahmed Khan, Sur Gul Khan, Jameel Ahmed, Muhammad Hussain, Shafiq Ahmed, Abdul Razzaq, Hayatullah, Attaullah, Habibullah, Muhammad Bilal, Khalil Ahmed, Noor Ahmed, Faraz Ahmed and Muhammad Yasin.\n\nPolice said the powerful blast also damaged se­­veral shops in the vicinity.\n\nA fire broke out in the police vehicle after the blast, which was extinguished by firefighters.\n\nThe bomb disposal squad also examined the blast site and collected evidence. An investigation has been launched into the attack, while no group has claimed responsibility for it.\n\nOther attacks\n\nAt least 14 people have been killed in separate attacks across Balochistan in the past 24 hours.\n\nIn Turbat, five people, including a couple and three children, were killed in a grenade attack at their house.\n\nEarlier, six people were killed in an overnight attack on the Coastal Highway in Gwadar.\n\nThe attackers blocked the highway and killed the victims — all hailing from Punjab — after disembarking them from a Karachi-bound bus.\n\nTheir bodies were sent to their native areas.\n\nThree officials, including an officer of the Counter Terrorism Department, were killed by unidentified attackers in Mastung.\n\nAccording to Levies officials, two drivers who belonged to Punjab were also kidnapped by armed men in Mastung.\n\nMeanwhile, security forces foiled an attempt to blow up two bridges at the Quetta-Karachi Highway in Mastung.\n\nThe explosives planted under the bridge were defused by the bomb disposal squad.\n\nSources said that unkn­own men threw a hand grenade at a police station in Hub, which exploded at the gate. No casualty was reported in the attack.\n\nArmed men also opened fire at Attaullah Rind, the sub-dvisional officer of the Panjgur grid station. He was injured in the attack and moved to a hospital.\n\nCondemnation\n\nPresident Asif Ali Zardari condemned the blast and expressed “deep sorrow and regret over the precious loss of lives in the blast”, Dawn.com reported while quoting a statement issued by the PPP.\n\n“Such reprehensible actions during the blessed month of Ramadan reflect the sinister motives of terrorists,” the president was quoted as saying.\n\nThe statement added that President Zardari was “praying for the speedy recovery of the injured”.\n\nPrime Minister Shehbaz Sharif also condemned the blast.\n\nAccording to the statement, shared by state broadcaster PTV on X, the PM expressed grief and offered prayers for the families of the deceased and injured.\n\nHe also ordered that authorities “immediately investigate the incident, identify those responsible and bring them to justice”.\n\nThe statement added that the PM would “continue the war against the scourge of terrorism until it is completely eradicated from the country”.\n\nBalochistan Chief Minister Sarfraz Bugti condemned the overnight attack in Gwadar.\n\nThe chief minister said the targeting of innocent citizens was a “brutal and unforgivable crime”.\n\nThe perpetrators would not be able to escape justice, he vowed.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e5c16fcf006.gif",
  "retrievedAt": "2025-10-12T02:14:04.145Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900758",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:50:32.000Z"
}
