{
  "title": "US aid cut for vaccine alliance may cause one million deaths, says Sania Nishtar - World - DAWN.COM",
  "author": null,
  "content": "PARIS: The United States cutting funding to Gavi, an organisation that provides vaccines to the world’s poorest countries, could result in more than a million deaths and will endanger lives everywhere, the group’s CEO warned on Thursday.\n\nThe news that Washington is planning to end funding for Gavi, first reported in the New York Times, comes as the two-month-old administration of President Donald Trump aggressively slashes foreign aid.\n\nThe decision was included in a 281-page spreadsheet that the severely downsised United States Agency for International Development sent to Congress on Monday night.\n\nGavi’s chief executive Sania Nishtar said the alliance had “not received a termination notice from the US government”. The alliance was “engaging with the White House and Congress with a view to securing $300 million approved by Congress for our 2025 activities and longer-term funding”, Nishtar said.\n\n“A cut in Gavi’s funding from the US would have a disastrous impact on global health security, potentially resulting in over a million deaths from preventable diseases and endangering lives everywhere from dangerous disease outbreaks,” she said.\n\nHealth experts and organisations have warned that cutting Gavi’s funding would ultimately cost the world more money and set back a quarter-century of progress in the fight against many deadly diseases.\n\nJennifer Nuzzo, a professor of epidemiology at Brown University in the United States, said the “mind-bogglingly short-sighted proposal” would have “devastating consequences for the health of children everywhere”.\n\n“US support for Gavi’s vaccination efforts is not charity — it’s a cost-effective investment to prevent deadly and costly outbreaks that can come here,” she said.\n\n‘Cruel’\n\nGavi says it helps vaccinate more than half the world’s children against infectious diseases including Covid-19, Ebola, malaria, rabies, polio, cholera, tuberculosis (TB), typhoid and yellow fever.\n\nThe United States currently provides around a quarter of the budget of Gavi, a public-private partnership headquartered in Geneva. David Elliman, a child health researcher at University College London, said cutting funding “is not only cruel, but is not in the interests of anyone”.\n\n“If diseases such as measles and TB increase anywhere in the world, it is a hazard to us all,” he told the Science Media Centre, adding that measles was already rising in the United States, Europe and elsewhere.\n\nIn the face of the Trump administration’s sweeping aid cuts, “institutions are reluctant to speak out in case they are targeted and individuals are self-censoring to protect themselves,” said Andrew Pollard, head of the Oxford Vaccine Group.\n\n“We must wake up to the moral case for supporting the remarkable global health efforts that help the poor of the world, but also remember that it is in our own interest,” he added. “As the Covid-19 pandemic reminds us, infectious diseases cross borders and put all of us at risk.”\n\n‘We will regret this’\n\nSeveral health researchers also said the cuts would be a poor return on investment. For every $1 spent on vaccinations in developing countries where Gavi operates, $21 will be saved this decade in “health care costs, lost wages and lost productivity from illness and death”, the vaccine group estimates.\n\nPublished in Dawn, March 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:14:20.552Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1900748/us-aid-cut-for-vaccine-alliance-may-cause-one-million-deaths-says-sania-nishtar",
  "dateList": "2025-03-28",
  "date_published": "2025-03-28T02:51:20.000Z"
}
