{
  "title": "CPEC’s projects enhancing developmental capacity for Pakistan: Chinese Ambassador",
  "link": "https://www.app.com.pk/national/cpecs-projects-enhancing-developmental-capacity-for-pakistan-chinese-ambassador/",
  "date_published": "2024-05-22T11:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):Chinese ambassador to Pakistan Jiang Zaidong Wednesday said CPEC’s various projects are continuously enhancing the capacity of sustainable development for Pakistan.\nA momentous occasion celebrated with warmth and gratitude, Chinese ambassador underscored the enduring strength of this friendship poised for unprecedented economic and strategic cooperation.\nSpeaking at a ceremony here at the73 rd anniversary of China Pakistan Diplomatic relations,  As the Chinese Embassy extends its sincere appreciation to all who have contributed to this cherished bond, the journey from the seed planted by Premier Zhou Enlai in 1964 to the towering symbol of unity represented by the pine trees planted by President Xi Jinping and Prime Minister Shehbaz Sharif in 2015 reflects the deep-rooted and flourishing alliance between these two nations.”, he remarked.\nThe ambassador said over the past 73 years, our all-weather friendship has increasingly been transformed into pragmatic cooperation, injecting inexhaustible impetus into the building of the community with a shared future.\nIn particular, the China-Pakistan Economic Corridor, from the initial layout of cooperation with focus on Gwadar Port, infrastructure development, energy and industrial cooperation, to the construction of an “upgraded version” with growth corridor, livelihood enhancing corridor, innovation corridor, green corridor and open corridor, it has now become an important platform and a well-known name card for all-round cooperation between the two countries, he said\nChinese Ambassador said,  as a landmark project of Belt and Road Initiative cooperation, batch after batch of projects have been launched, completed and put into operation under the framework of CPEC, which has brought a total of US $25.4 billion in direct investment, 236000 jobs, 510km of highways, more than 8000 megawatts of electricity and 886km of core transmission network, continuously enhancing the capacity of sustainable development for Pakistan. At the same time, counter-terrorism cooperation, defense cooperation and people-to-people exchanges are also fruitful, constantly enriching the connotation of all-weather strategic cooperation between the two countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:39:47.631Z"
}
