{
  "title": "ISSI hosts “Global Bridges” delegation from Germany",
  "link": "https://www.app.com.pk/national/issi-hosts-global-bridges-delegation-from-germany/",
  "date_published": "2024-05-22T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): The Centre for Strategic Perspectives (CSP) at the Institute of Strategic Studies Islamabad (ISSI) organized an in-House meeting with a delegation from ‘Global Bridges’, Germany here on Wednesday.\nThe 17-member delegation – including decision-makers from politics, business, academia and media – exchanged views with the ISSI side that included Director General Ambassador Sohail Mahmood, Chairman BoG Ambassador Khalid Mahmood, Director China Pakistan Study Centre (CPSC) Dr. Talat Shabbir; Director CSP Dr. Neelum Nigar; and other members of CSP and CPSC, a news release said.\nDr. Talat Shabbir presented an overview of the broad range of ISSI’s research work and outreach. Dr. Christian Altenhofen made remarks about Global Bridges’ mission and initiatives as well as the purpose of its study tour to Pakistan.\nIn his remarks, DG ISSI Ambassador Sohail Mahmood shared perspective on the evolving global geopolitical landscape, noting the key economic, security and power dynamics influencing international relations.\nHe highlighted the broad spectrum of traditional and non-traditional security threats and challenges at the global level, underlined the transformation visible in the global order, and stressed the importance of addressing global issues through a collaborative rather than combative approach.\nHe also highlighted how Pakistan was navigating this complex web of geopolitics and was focused on accentuating its pivot to geo-economics.\nDr. Talat Shabbir spoke on the salience of China-Pakistan Economic Corridor (CPEC) and aspects of Pakistan’s ties with regional countries. Dr. Neelum Nigar touched on Pakistan’s National Security Policy and the importance of international cooperation in tackling climate change and other non-traditional security challenges.\nRepresentatives from the delegation, including Ambassador Wolfgang Ischinger and Dr. Hans Albrecht, highlighted Global Bridges’ emphasis on dialogue and mutual understanding; stressed the importance of addressing the key drivers behind global changes; and underscored the need for pursuing approaches that help foster peace regionally and globally.\nThis was followed by an absorbing interactive session. Ambassador Khalid Mahmood presented memento to the visiting delegation.",
  "retrievedAt": "2025-08-11T02:39:06.149Z"
}
