{
  "title": "Improvement in Pakistan’s ranking reflects tourism sector’s growth: PTDC MD",
  "link": "https://www.app.com.pk/national/improvement-in-pakistans-ranking-reflects-tourism-sectors-growth-ptdc-md/",
  "date_published": "2024-05-22T14:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): Pakistan Tourism Development Corporation (PTDC) Managing Director Aftab Rana on Wednesday felicitated the nation on significant improvement in Pakistan’s ranking in he World Economic Forum’s Travel & Tourism Development Index that reflected growth in its tourism sector.\n“This is the result of collective efforts of public and private sector partnered under the umbrella of PTDC to make Pakistan an outstanding tourist destination,” the PTDC managing director said in a news statement.\nHe said Pakistan had improved its ranking in the WEF’s Travel & Tourism Development Index for 2024, moving up to 101st place.\n“This is a significant improvement of 20 positions compared to its ranking in 2019,” he added.\nAftab said the joint efforts of the PTDC, provincial tourist departments, private sector partners, tourism educational institutions and development partners such as the World Bank had played a pivotal role in the tourism sector’s growth.\nHe further said that recently the United Nations World Tourism Organization (UNWTO) had also acknowledged Pakistan’s outstanding performance in tourism, marking a remarkable 92 percent recovery to the pre-pandemic levels in 2023.\nThe country experienced a 115 percent surge in foreign tourist arrivals compared to the previous year, signaling a robust comeback in the post-Covid-19 era, he noted.\nAftab Rana said that the PTDC during the last year had actively participated in six major global tourism events such as World Travel Mart London, ITB Berlin, New York Travel and Adventure Show, Arabian Travel Mart Dubai, Seoul Travel Mart Korea, and Travel Mart in Vietnam, fostering essential B2B connections with foreign tour operators.\n“A special tourism promotion campaign ‘Salam Pakistan’ has been launched to project the soft image of the country at global and national levels,” he added.\nHe said the initiatives of PTDC on the National Travel and Tourism Competitiveness Index (NTTCI) and development of the National Minimum Standards for Tourism and hospitality sector had also played a key role in building the capacity of industry stakeholders to work for the quality assurance in the tourism industry.\nAftab Rana said that there was a strong need to improve the safety and security of visitors, increase air connectivity of Pakistan with rest of the world, invest on quality tourism infrastructure, adoption of ICT (information communication technology) in tourism, besides ensuring proper utilization skilled human resources to further improve the progress of Pakistan on the global travel and tourism index.",
  "retrievedAt": "2025-08-11T02:39:05.226Z"
}
