{
  "title": "Punjab Wildlife Department celebrates int’l Biodiversity Day with staff",
  "link": "https://www.app.com.pk/national/punjab-wildlife-department-celebrates-intl-biodiversity-day-with-staff/",
  "date_published": "2024-05-22T15:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): The Punjab Wildlife Department Rawalpindi marked the international biodiversity day here on Wednesday at its office to raise awareness among the staff on challenges to dwindling biodiversity reserves.\nThe world biodiversity day is celebrated on May 22 whereas the theme for this year was “Be part of the Plan”, which is a call to action for all stakeholders to halt and reverse the loss of biodiversity by supporting the implementation of the Kunming-Montreal Global Biodiversity Framework, also referred to as the The Biodiversity Plan.\nThe Biodiversity Plan offers opportunities for cooperation and partnerships among diverse actors including governments, indigenous peoples and local communities, non-governmental organizations, lawmakers, businesses, and individuals who are encouraged to highlight the ways in which they are supporting the implementation of the Biodiversity Plan.\nThis year the celebration of Biodiversity Day coincided with two meetings of Subsidiary Bodies of the Convention on Biological Diversity both taking place in Nairobi, namely: the twenty-sixth meeting of the Subsidiary Body on Scientific, Technical and Technological Advice (SBSTTA, 13-18 May) and the fourth meeting of the Subsidiary Body on Implementation (SBI, 21-29 May).\nThe Day was expected to increase the visibility momentum in the lead-up to the sixteenth meeting of the Conference of the Parties to the Convention on Biological Diversity (COP 16), to be held in Colombia from 21 October to 1 November 2024.\nAssistant Director Wildlife, Loi Bher Wildlife park, Rizwana Aziz told APP that the Wildlife staff led by her held an awareness walk on the occasion with special banners and placards demanding public and stakeholders attention towards decreasing biodiversity due to climate change impacts.\nA briefing was also given to the staff about the Day whereas seed balls were also thrown in the national park to demonstrate commitment towards protecting the plant species of the national park.\nThe wildlife staff also distributed pamphlets among the general public on the occasion to create awareness on biodiversity, it’s importance in the environment and human life as a whole.",
  "retrievedAt": "2025-08-11T02:39:04.109Z"
}
