{
  "title": "CDA chairman directs increased water supply in densely populated areas",
  "link": "https://www.app.com.pk/national/cda-chairman-directs-increased-water-supply-in-densely-populated-areas/",
  "date_published": "2024-05-22T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP):Chairman CDA Muhammad Ali Randhawa on Wednesday directed a daily increase of 6 million gallons of water from Simly Dam and extended the duration of water supply in densely populated sectors and areas to meet the summer demands of citizens.\nChairing a key water management meeting at CDA headquarters, Chairman CDA Chaudhary Muhammad Ali Randhawa cancelled staff leaves to ensure an uninterrupted water supply for citizens.\nChairman CDA, while praising the performance of the water supply wing, urged the staff to maintain their hard work and dedication to ensure that citizens do not face water problems.\nAttended by senior officers from the Water Supply Wing, the meeting resolved to keep the tanker service on high alert around the clock and to address all pipeline leakage complaints immediately.\nChairman CDA emphasized the need for long-term solutions to address water issues. He also instructed immediate action on Shahdara, Tarbela, Chiniot, and Khanpur dams to provide a permanent resolution to the water problem.\nChairman CDA expressed his anger over the theft of 40% of the water from Khanpur Dam to Sang jani Plant Canal. During the briefing, it was mentioned that control of the canal now falls under the authority of each province, a responsibility previously held by WAPDA.\nChairman CDA instructed that a proposal be drafted and submitted to address this issue, enabling discussions with WAPDA and other relevant organizations to find a solution.\nChairman CDA  instructed that a proposal for installing solar systems at water pumping stations be submitted within three days. This measure aims to redirect the substantial energy costs towards other city development projects.\nChairman CDA, in issuing instructions, emphasized the transfer of all filtration plants to modern automation systems. This move aims to assess water quality through online data and measure water consumption and supply. Additionally, he mentioned plans to visit the water supply wing soon.\nDuring the briefing to Chairman CDA, it was explained that all complaints received are being resolved within a 24-hour.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:39:30.023Z"
}
