{
  "title": "PM attends memorial ceremony of late President Raisi, FM Abdollahian; expresses condolences",
  "link": "https://www.app.com.pk/global/pm-attends-memorial-ceremony-of-late-president-raisi-fm-abdollahian-expresses-condolences/",
  "date_published": "2024-05-22T14:55:00.000Z",
  "source": "APP",
  "content": "TEHRAN, May 22 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday attended the memorial ceremony of late President of Iran Dr. Seyyed Ebrahim Raisi, late Foreign Minister Hossein Amir-Abdollahian and their companions, who embraced martyrdom in a tragic helicopter crash in the eastern province on May 19.\nDuring the ceremony, the prime minister arrived at the hall where the body of late president was placed.\nThe prime minister prayed for the high ranks of the departed soul and paid tribute to President Raisi’s contributions towards progress and prosperity of the Iranian nation, promotion of Pak-Iran bilateral ties and efforts for the region.\nPrime Minister Shehbaz Sharif also expressed condolences, on behalf of the people and Government of Pakistan, to Acting President Dr. Mohammad Mokhber, PM Office Media Wing said in a press release.\nThe prime minister was accompanied by Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar, Federal Interior Minister Syed Mohsin Naqvi, Federal Minister for Commerce Jam Kamal Khan, Federal Minister for Information and Broadcasting Attaullah Tarar and SAPM Tariq Fatemi.\nOn the occasion, the prime minister said that the government and people of Pakistan received the news of martyrdom of President of Iran Dr. Seyyed Ebrahim Raisi, late Foreign Minister Hossein Amir-Abdollahian and their companions with huge shock and grief.\nThey shared the grief and sorrow of the bereaved families and the people of Islamic Republic of Iran and offered their sincere condolences, he added.\nHe further expressed sympathies with the bereaved families and the Iranian nation, adding the entire Pakistani nation stood with the brotherly country of Iran in these difficult moments.\nLauding the contributions of late Iranian president, the prime minister said that Dr Raisi was a great friend of Pakistan, adding the memorable time he spent among the people of Pakistan during his last month’s visit, would always be remembered.\nHe also conveyed good wishes to the Iranian Vice President on assuming the office.\nEarlier, upon arrival at the airport, Iranian Minister for Road and Urban Development Mehrdad Bazrpash and Ambassador of Pakistan in Tehran Mr. Mudassir Tipu received the prime minister.",
  "retrievedAt": "2025-08-11T02:39:04.677Z"
}
