{
  "title": "Interior Minister visits Capital Hospital",
  "link": "https://www.app.com.pk/national/interior-minister-visits-capital-hospital/",
  "date_published": "2024-05-22T06:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): Federal Interior Minister Mohsin Naqvi on Wednesday visited Capital Hospital to review the treatment facilities including the condition of operation theaters in the hospital.\nMohsin Naqvi also visited the patients under treatment in the emergency block and inquired about the treatment facilities.\nHe asked for a master plan from Chairman CDA and Chief Commissioner Islamabad Mohammad Ali Randhawa and ordered to upgrade emergency block and lab of the hospital.\nMost of the patients expressed satisfaction with the facilities provided in the hospital, however, some patients complained of lack of medical facilities.\nRaheela, a cancer patient, cried while telling Federal Interior Minister Mohsin Naqvi about the disease.\n“I have been coming here for 3 months, no one pays attention” she told the minister upon which the Naqvi consoling with the patient asked the executive director to provide best treatment to the patient.\n“Do not worry. No effort will be spared in your treatment” Mohsin Naqvi assured the patient.\nThe minister also met the doctors and asked their problems while he inquired about the facility of free medicines and free tests to the patients.\nThe minister inspected water plant, dialysis unit, and other wards of the hospital checked the records of dialysis patients.\nNaqvi also reviewed the situation of laundry room and cleanliness in the hospital and directed to improve the condition.\nHe also inspected MRI, CT scan, x-ray and angiography room and met the patients under treatment in the medical block and asked for medical facilities.\nTaking urgent notice of the elderly woman’s complaint for not being check-up by the doctors, he directed the Executive Director to treat the elderly patient under his supervision.\nHe also directed Chairman CDA to improve 500-bed hospital. Federal Interior Secretary Khurram Agha, Chairman CDA and Chief Commissioner Islamabad Mohammad Ali Randhawa, Executive Director Capital Hospital were also present during the visit.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:39:03.634Z"
}
