{
  "title": "Green Energy Transition to help Pakistan build sustainable economy: Experts",
  "link": "https://www.app.com.pk/national/green-energy-transition-to-help-pakistan-build-sustainable-economy-experts/",
  "date_published": "2024-05-22T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 22 (APP): The experts at the Green Financing Summit held here on Wednesday underscored the need for Pakistan to embrace a paradigm shift in its policy to achieve renewable energy transition through subsidized energy frameworks helping to achieve a sustainable economy.\nThe Sustainable Development Policy Institute (SDPI) under its Network for Clean Energy Transition organized the virtual conference titled “Green Financing Summit: Driving Energy Transition through alternate and Green Financing Mechanisms”.\nIn his opening remarks, Deputy Executive Director, SDPI, Dr Sajid Amin said the discourse on clean energy transition was crucial as shift over green energy was the country’s journey towards a sustainable economy.\nHe added that the transition to green energy required huge capital that could not be left alone on the government and the larger firms.\nThe green energy transition would need a robust and sound financial market that supports, derisks and enables the energy transition.\nThe green markets, and financial instruments by the size of each sector associated to energy transition is important, whereas every investor and critically the smaller investors investing in green instruments will play a critical role in this regard, especially the State Bank of Pakistan, Dr Sajid said.\n“It should not be a residual but the mainstream focus of the central and commercial banks with respect to green financing.\nWe need to have a clear set of policies and frameworks driving our financial and commercial banking systems, create environment for innovative financial and commercial instruments, and clear mapping of the sectors in green investment and financing,” he added.\nFaisal Shafaat, Additional Director, SME, Housing & Sustainable Finance Department, State Bank of Pakistan said the renewable energy is cheaper to fossil fuels and for Pakistan it offers more than just cost and environmental impact as it not only provides energy security but rather and saving in terms of foreign exchange.\nHe added that SBP had launched initiatives like ESRM and Green Financing guidelines and was also developing national green taxonomy that is being co-chaired by ministry of climate change and would be taken as a reference point for investors and financial institutions to develop specific sectoral products to promote eco-friendly practices for efficient renewable energy.\nShafaat said that by December 2023 a total outstanding amount of Rs94 billion have helped finance more than 3,160 projects of 1830 MW capacity in the country.\nHe suggested that the Banks must develop innovative products and the tenor of the loans of RE projects can be lengthened with a certain grace period for principle amount.\nUbaid Ur Rehman Zia, Head Energy Unit in his remarks said Pakistan has not been able to tap global green energy transition finances due to lack of technical expertise that needs to be enhanced.\nHe also presented the prevailing climate finance landscape and green financing needs in line with the NDC targets. “It would combine cost some $115.7 billion in achieving Pakistan’s renewable energy transition by 2030. The NEECA stats show Pakistan’s energy efficiency targets in industries will cost $9.8 billion and energy efficient buildings would require $5.5 billion,” he added.\nMoreover, he said as per the NDCs, Electric Vehicle (EV) sector would need a substantial investment of $48-63 billion by private sector through equities to achieve its NDCs’ based targets.\nZainab Naeem, Associate Research Fellow moderated the first session.\nUmer Khan, Head of Investment Banking – SEVP, Bank of Punjab said in Pakistan investment in power sector has halfen primarily over the past 10 to 12 years, whereas the commercial banks again raised Pakistani rupees deposits and the local commercial banks could improve this profile.\nHe added that the commercial banks were looking for competitive bidding in renewables on the energy side that will help decease tariff substantially.\nKhan demanded that the domestic partners needed to venture into innovation in the green finance sector by exploring opportunities in green bonds and other instruments.\nKhowla Shoaib, Head of Strategy and Sustainability, Mobilink Microfinance Bank Limited (MMBL) said the Bank was promoting education on clean energy loans among the masses particularly the female customers on the benefits of the facility.\nShe added that the Bank was also undertaking climate resilience partnerships with partner organizations to help them adopt sustainable practices to enhance their climate resilience and use of clean energy.\nDr. Majid Bilal Khan, Manager of Just Energy Transition, Indus Consortium said energy transition globally is driven by climate change which is caused by CO2 emissions that are mainly due to burning coal, oil and gas.\nHe added that the country needed subsidized financing frameworks with its implementation across the board whereas the commercial banks involved in it should share it with CSOs and general public while ensuring data transparency.\nMehboob Alam Khan, Head of MEP-Engineering Sustainability and HSE, Meezan Bank Limited said green financing is one of the burning topic under discussion whereas the Green Energy Transition is important due to environmental factors.\nIn order to have a clean energy transition, he said the country will have to have a paradigm shift towards clean energy namely solar, hydro and wind.\n“Meezan Bank took it seriously, the clean energy concept and have different initiatives during 2023 in which financing for five megawatts plus residential consumers to switch over solars, over Rs458 million commercial solar financing and also large corporate sector hydel and wind projects financing,” he added.\nSenior Energy and Economy Expert SDPI, Dr Khalid Waleed said the role of capital markets and indexes can be discussed in Pakistan context that can bring green revolution in the market.\nThe SDPI and banking institutions can gather green investors under some networks to discuss the capabilities and broader contours of green industry financing, he added.\n“Whole of a sector approach needs to be adopted that can complement other sectors through inclusive policy endeavours in clean energy transition,” he added.\nDr. Christoph Nedopil Wang, Griffith Asia Institute (GAI) said the global financing costs are very high for clean energy transition and reorientation of existing debt is quite relevant in this regard.\nHowever, he said the debt for nature swaps are important for biodiversirty conversation but there are others debts swaps for different sectors, for example the debt for climate swap that could be one of the options for just energy transition.",
  "retrievedAt": "2025-08-11T02:39:05.781Z"
}
