{
  "article_id": "2025-04-30_e3eaa56903850a94dbe276b73597b2d6",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nine-held-dairy-farms-sealed-over-dengue-violations-in-ict/",
    "retrieved_at": "2025-08-27T15:04:09.033Z"
  },
  "metadata": {
    "title": "Nine held, dairy farms sealed over dengue violations in ICT",
    "author": null,
    "date_published": "2025-04-30T10:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 555,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP):In a drive to control the spread of dengue, the district administration has arrested nine individuals and sealed multiple sites found responsible for breeding dengue larvae. According to the spokesman of ICT administration, this action is part of an ongoing campaign to reduce the risk of dengue fever, which is caused by mosquitoes breeding in stagnant water. He said that the district administration teams also sealed two dairy farms where dengue larvae were found. These farms were reportedly not maintaining proper hygiene and had open water sources-ideal conditions for mosquito breeding. Another site sealed was a private factory located in the industrial area of Sector I-9. Health teams discovered larvae in open containers and near water collection points inside the factory premises. On the occasion, Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon, said the administration is intensifying its efforts to prevent the spread of dengue. He stated that strict monitoring would continue and those who fail to follow safety measures would face legal action. \"Those responsible for creating mosquito breeding grounds will not be spared. Our teams are working daily to check locations where dengue larvae are most likely to be found,\" he said. The deputy commissioner also made a public appeal, asking residents to support the campaign by keeping their homes and surroundings clean. He urged people to avoid storing water in open containers and to regularly check rooftops, backyards, and storage areas. He said that the dengue control teams are visiting residential areas, industrial zones, and open plots on a daily basis. Areas at high risk are being checked more frequently. In recent weeks, several warnings were issued to property owners, but a lack of cooperation led to direct action in some cases. Health experts said that dairy farms and industrial areas are especially concerning because of large water storage facilities and poor drainage systems. When owners fail to maintain cleanliness, these sites become breeding grounds for mosquitoes. \"Our teams are trying to educate the public as well as enforce the law. But repeated violations have left us with no choice but to arrest and seal,\" said a member of the anti-dengue task force. In Islamabad, dengue cases tend to rise during the warmer months. Health authorities are working with local governments to raise awareness about the disease and stop its spread before the peak season begins. Meanwhile, residents are being asked to allow health teams to inspect their properties. Officials said that cooperation is key in controlling the disease. The district government has also increased the number of teams conducting inspections. More staff have been deployed in urban and rural zones to ensure quick response. So far, several awareness drives have been held in schools, offices, and community centres. Officials believe that public participation is the most effective tool in fighting dengue. \"Without community support, this campaign will not succeed. Every household must take responsibility,\" the deputy commissioner added. The administration plans to continue inspections over the coming weeks. Areas found violating safety protocols will be dealt with under the law, and more arrests could follow if warnings are ignored. Furthermore, health experts advised the public to wear protective clothing, use mosquito repellents, and keep their surroundings dry. They also urge people to seek medical help immediately if they notice symptoms such as high fever, body pain, or rashes.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}