{
  "article_id": "2025-04-30_b3b5f71344667a1afb0716a6ed3d9b9e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pak-armed-forces-fully-prepared-to-respond-to-any-aggression-by-india-dg-ispr/",
    "retrieved_at": "2025-08-27T15:02:03.032Z"
  },
  "metadata": {
    "title": "Pak armed forces fully prepared to respond to any aggression by India: DG ISPR",
    "author": null,
    "date_published": "2025-04-30T16:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 947,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP): Director General of Inter-Services Public Relations (ISPR), Lt Gen Ahmed Sharif Chaudhry Wednesday vowed that the Pakistan Armed Forces are fully prepared to respond to any aggression by India. Addressing a press conference alongside Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar and the Foreign Office Spokesperson Shafqat Ali Khan, the DG ISPR reiterated that the Pakistani nation and armed forces are determined to defend the country's territorial integrity and sovereignty at all costs. He emphasized that the entire nation is united, and all political parties have already expressed their resolve to respond with full force in case of any Indian aggression. The DG said that Pahalgam is 230km from the Line of Control (LoC) and questioned how it's possible for someone to reach such a remote area within 10 minutes. \"We will focus on facts, not accusations,\" he said, adding that Pakistan was presenting evidence rather than engaging in baseless allegations. He noted that the alleged attack site is far from the nearest town of Bagh in Azad Jammu and Kashmir. Displaying various visuals of the area's geography, Lt Gen Ahmed explained that the distance from the incident site to the nearest police station was approximately 30 minutes. He questioned how an FIR could be registered in just 10 minutes. He also criticized the Indian media for prematurely blaming Pakistani agencies within minutes of the Pahalgam incident, citing a zipline operator's video to support what he called a false narrative. \"Why did India's narrative immediately claim that Muslims attacked Hindus?\" he asked, noting that the prime minister had also expressed concerns over the matter. The DG ISPR said that India was using the Pahalgam incident as a pretext to suspend the Indus Waters Treaty. \"India itself is a terrorist state and detains Pakistani and Kashmiri individuals in jails, where they are tortured to make forced statements,\" he said. Lt Gen Ahmed Sharif said that hundreds of Pakistanis are being held illegally in Indian prisons. \"India is using these detained Pakistanis in fake encounters. In Uri, Muhammad Farooq was martyred in a staged encounter,\" he added. He said they have credible intelligence indicating that following the Pahalgam incident, India has tasked all its proxies to carry out terrorist acts everywhere in Pakistan. \"Whether these proxies are operating in Balochistan or other parts of Pakistan,\" he questioned. DG ISPR said that since January 24, Pakistan has witnessed 3,700 terror incidents, resulting in 3,896 casualties. He said that 77,816 operations have been conducted in which 1,666 terrorists have been eliminated. \"This is terrorism that is being abetted and sponsored by India. The whole world can see and feel its effects. We must be cognizant that Pakistan remains the last bulwark standing against this scourge of terrorism,\" DG ISPR said. He said, \"India is facilitating terrorism for the sake of its short-term, myopic political objectives. Terrorism and extremism are internal problems of India. Instead of addressing these issues, India is externalizing them. This cycle is manifesting itself in the Pahalgam incident.\" A similar pattern was observed in the Jaffar Express case, where a specific Indian account predicted the attack beforehand and later 'confirmed' it post-incident-a narrative boosted by Indian media. Responding to a question, the DG ISPR stated, 'We are closely monitoring the situation with a prepared response. As per the National Security Council's deliberations, multiple options are available-Pakistan will be defended at all costs. He said the Pulwama attack was exploited for political gains, and now Indian analysts are citing the Pahalgam incident as a security failure. He stated that India's objective is to falsely implicate Pakistan and exploit these allegations for electoral gains. By accusing Pakistan of infiltration, India justifies the killing of innocent civilians-such as the martyrs of Kupwara on April 23. There is irrefutable evidence confirming India's involvement in terrorist activities within Pakistan. Lt General Ahmed Sharif said that Indian intelligence-run social media accounts, which accused Pakistan of the Pahalgam incident, had also made suspicious predictions before the November 4, 2023, Mianwali attack. A day before the attack, these accounts posted, \"Tomorrow is a big day, so we are going to bed early today,\" and the next morning, they wrote, \"Good morning Mianwali.\" DG ISPR, said the terrorist attack in Mianwali was carried out by Fitna Al-Khawarij, Later, on October 6, 2024, Chinese citizens were targeted in Karachi. Before this attack, the same Indian intelligence-linked social media accounts posted: \"Big day in the next few hours.\" - Followed by: Big explosion in Karachi, more details are coming. On the morning of October 7, another tweet appeared: An IED explosion took place near Karachi Airport; a vehicle was carrying foreigners-one injured, one dead. This pattern suggests prior knowledge of the attacks, raising concerns about possible foreign involvement in destabilizing Pakistan. The DG ISPR said that the same suspicious pattern was observed before the Jafar Express attack, Social media accounts linked to foreign intelligence agencies posted messages such as: \"Keep your eyes on Pakistan today and tomorrow.\" Shortly afterward, the Jafar Express was attacked, reinforcing concerns about prior knowledge and possible foreign involvement in orchestrating terrorism in Pakistan. This recurring tactic highlights a deliberate hybrid warfare campaign, where propaganda and terror attacks are coordinated to destabilize the country. He said India has orchestrated over 3,000 terrorist attacks in Pakistan since 2024, making it the primary sponsor of terrorism in the region. Before major attacks-such as Mianwali (November 2023), Karachi (October 2024), and Jafar Express - Indian-linked social media accounts posted suspicious warnings, indicating prior knowledge. India has also exploited incidents like Chhattisgarh Pura and Pulwama for political gains. He said Pakistan's nation and institutions remain resolute in eradicating terrorism and countering foreign-sponsored threats.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}