{
  "article_id": "2025-04-30_4e7f8e46fe5da2ea1518ed3add0ffc42",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-adopts-civil-servants-amendment-bill-2025-unanimously/",
    "retrieved_at": "2025-08-27T15:02:27.216Z"
  },
  "metadata": {
    "title": "NA body adopts Civil Servants Amendment Bill 2025 unanimously",
    "author": null,
    "date_published": "2025-04-30T16:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 313,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP):The National Assembly Standing Committee on Law and Justice on Wednesday considered the Civil Servants (Amendment) Bill, 2025 after detailed deliberations. However, Changaze Ahmad Khan, Ali Muhammad Khan, Umair Khan Niazi, Aliya Kamran, Sohail Sultan, and Sardar Muhammad Latif Khan Khosa submitted proposed amendments to be recorded as a note of dissent. The meeting was held under the Chairmanship of MNA Ch. Mahmood Bashir Virk at Parliament House, Islamabad. The NA body also adopted 'The Qanun-e-Shahadat (Amendment) Bill, 2025 (moved by Shazia Marri, MNA) after thorough deliberations on the contents and implications of the proposed amendments. The Committee decided to defer further consideration of the Bill to the next meeting. The decision was taken to allow the Ministry of Law and Justice sufficient time to furnish a comprehensive comparative analysis of relevant legal provisions across selected Commonwealth countries, with a focus on best practices and alignment with international standards. Additionally, during the discussion, the Ministry of Law and Justice highlighted that the proposed amendments, if enacted, would be uniformly applicable to all provinces. In light of this, the Committee emphasized the importance of obtaining input from all provincial governments to ensure inclusivity and to account for regional perspectives. Therefore, it was recommended that the Ministry formally seek and compile the views and comments, of all four provinces before the next meeting. The committee, however, deferred 'The Constitution (Amendment) Bill,2025 (Article-59) (moved by Naveed Aamir, MNA) due to non availability of the mover. The meeting was attended by Members/MNAs including Rana Muhammad Qasim Noon, Zara Wadood Fatemi, Kiran Haider, Dr. Nafisa Shah, Syed Abrar Ali shah, Syed Naveed Qamar, Syed Hafeezuddin Changaze Ahmad Khan, Ali Muhammad Khan, Umair Khan Niazi, Hassaan Sabir, Aliya Kamran, Sohail Sultan, Sardar Muhammad Ltif Khan Khosa, Shazi Marri, Minister of State for Law and Justice and Secretary, Ministry of Law and Justice and Special Secretary Establishment.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}