{
  "article_id": "2025-04-30_4298ed584637526edb99fced3af390ad",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dr-naeemi-appointed-chairman-of-sbps-shariah-advisory-committee/",
    "retrieved_at": "2025-08-27T15:02:04.485Z"
  },
  "metadata": {
    "title": "Dr. Naeemi appointed ‘Chairman of SBP’s Shariah Advisory Committee’",
    "author": null,
    "date_published": "2025-04-30T16:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 212,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP): Renowned Islamic scholar Dr. Raghib Hussain Naeemi has been appointed Chairman of the Shariah Advisory Committee of the State Bank of Pakistan (SBP). The official notification has been issued by SBP Deputy Governor Saleem Ullah. Dr. Naeemi currently serves as the head of Jamia Naeemia, Lahore, and is also the Chairman of the Council of Islamic Ideology. An alumnus of Government College Lahore, he holds a Master's degree in Arabic from Punjab University, where he was a gold medalist, and another Master's in Economics. He earned his PhD in Islamic Economics and received his religious education from Darul Uloom Jamia Naeemia, Lahore. Dr. Naeemi holds multiple prominent positions in religious and academic circles. He has previously served as Chairman of the Punjab Quran Board and the United Ulema Board Punjab, and as a member of the Punjab Zakat Council. He is also a sitting member of the Central Ruet-e-Hilal Committee. In addition, Dr. Naeemi is a member of the syndicates of Punjab University, Lahore, and the University of Agriculture, Faisalabad. His contributions to promoting education, peace, and interfaith harmony are widely recognized across the country. In acknowledgment of his religious, educational, and social services, Dr. Naeemi was conferred with the Sitara-i-Imtiaz by the President of Pakistan last year.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}