{
  "article_id": "2025-04-30_ca5f354d5c29de52785e39c7189acc9b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-meets-deputy-speaker-of-qatars-shura-council/",
    "retrieved_at": "2025-08-27T15:03:44.316Z"
  },
  "metadata": {
    "title": "Gilani meets Deputy Speaker of Qatar’s Shura Council",
    "author": null,
    "date_published": "2025-04-30T12:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 841,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP):Chairman Senate of Pakistan, Syed Yousaf Raza Gilani and Deputy Speaker of the Shura Council of Qatar, Dr. Hamda Bint Hassan Al-Sulaiti discussed matters of mutual interest including bilateral relations, parliamentary engagement, investment, culture, trade, and peace in the Middle East. According to a news release, during the meeting, the Chairman said that Pakistan attaches great importance to its brotherly and cordial relations with Qatar. He emphasized that Pakistan-Qatar relations are founded on deep-rooted religious, cultural, and historical ties, and that the parliamentary, trade, and economic cooperation between the two countries stands on a firm footing. He further noted that the long-standing and close people-to-people contacts between Pakistan and Qatar have continuously strengthened bilateral ties. Referring to the visit of Prime Minister of Pakistan, Muhammad Shehbaz Sharif, to Doha last year at the invitation of Sheikh Tamim bin Hamad Al-Thani, the Amir of the State of Qatar, Chairman Senate said the visit contributed significantly to enhancing bilateral relations and exploring new avenues of cooperation across diverse sectors. He expressed keen interest in the upcoming visit of His Highness the Amir of Qatar to Pakistan, terming it a significant opportunity to elevate bilateral ties to new heights. Chairman Senate affirmed that Pakistan considers Qatar to be one of its most important partners and a trusted friend in the region. He reiterated Pakistan's firm commitment to further deepening bilateral ties in all areas, particularly in the political, economic, and cultural domains. He also appreciated the efforts of Her Excellency Sheikha Al Mayassa bint Hamad Al-Thani in organizing the \"Manzar\" exhibition in Pakistan, which showcased Pakistan's rich artistic and cultural heritage. He added that Qatar's involvement in initiatives such as Qatar Charity, the Qatar Fund for Development, and Education Above All reflects the close and growing affinity between the two countries. He further underlined the importance of regular institutional-level engagements to strengthen parliamentary relations. Stressing the need for expanding parliamentary diplomacy and holding consultative meetings between the two countries, Chairman Senate called for the signing of additional Memorandums of Understanding to facilitate these objectives. He termed the recently held second session of Pakistan-Qatar Bilateral Political Consultations as a positive step towards bolstering bilateral relations. He also underscored the need to convene all institutional mechanism meetings-including the Joint Ministerial Commission, the Joint Working Group on Trade and Investment, and the Joint Committee on Labour-prior to the upcoming visit of His Highness the Amir of Qatar. Referring to the first meeting held on 18 February 2025 between the Special Investment Facilitation Council (SIFC) and the Qatar Investment Authority (QIA), he praised the engagement and noted that the visit of delegations from QIA and the Qatar Business Association (QBA), alongside the Qatar Amir, would further strengthen economic cooperation between the two nations. He also identified vast potential for bilateral cooperation in the fields of Information Technology, pharmaceuticals, construction, shipping, and maritime industries. In particular, he described the IT sector as highly promising for joint investment. He appreciated the 134.5% increase in Pakistan's IT exports to Qatar, which reached USD 9.37 million in fiscal year 2024. Chairman Senate noted that the establishment of two direct shipping lines between Karachi and Hamad Port had significantly benefited bilateral trade. He further stated that recent institutional and policy reforms in Pakistan have created an investor-friendly environment and expressed confidence that more investors would be encouraged to invest in Pakistan. He also extended congratulations to Qatar on the successful hosting of the FIFA World Cup. Commending Qatar's mediation role in the Middle East, particularly in Gaza and Syria, Chairman Senate praised Qatar's efforts to promote peace and its successful facilitation of the Gaza ceasefire and prisoner release negotiations. He expressed Pakistan's appreciation for these constructive efforts. Highlighting the presence of over 100,000 Pakistani expatriates in Qatar, he acknowledged their vital role in Qatar's economic development and termed the diaspora as a strong bridge between the two countries. He reaffirmed Pakistan's commitment to supporting ongoing projects under Qatar National Vision 2030. Chairman Senate stated that Pakistan is fully prepared to provide skilled human resources for Qatar's development in the sectors of IT, medicine, and infrastructure. He recognized the significance of Qatar Visa Centers operating in Islamabad and Karachi since 2019 in streamlining visa procedures and proposed the opening of additional centers in Peshawar and Lahore. During the meeting, Deputy Speaker of the Shura Council of Qatar, Dr. Hamda Bint Hassan Al-Sulaiti, emphasized that Qatar greatly values its relations with Pakistan. She described Pakistan as a key country in the Muslim Ummah and highlighted the deep religious, cultural, and historical bonds between the two nations. She acknowledged the Pakistani diaspora's active role in contributing to Qatar's economic, social, and IT development. She added that both countries share a common vision of Muslim unity, brotherhood, and solidarity. She appreciated Pakistan's efforts in promoting regional peace and its significant role in the fight against terrorism. She stated that Qatar seeks to further enhance parliamentary and people-to-people contacts with Pakistan and reaffirmed Qatar's commitment to continued mediation efforts for international harmony and regional peace.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}