{
  "article_id": "2025-04-30_891c05508245e6523c169d371f5ffb56",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/turkish-envoy-inaugurates-anadolu-creator-lab-at-nust-highlights-deepening-academic-ties/",
    "retrieved_at": "2025-08-27T15:04:07.748Z"
  },
  "metadata": {
    "title": "Turkish envoy inaugurates ‘Anadolu Creator Lab’ at NUST, highlights deepening academic ties",
    "author": null,
    "date_published": "2025-04-30T10:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 306,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP):Ambassador of Turkiye to Pakistan, Dr. Irfan Neziroglu on Wednesday inaugurated the 'Anadolu Creator Lab' at the National University of Sciences and Technology (NUST), reaffirming Turkiye's commitment to strengthening academic and technological collaboration with Pakistan. The state-of-the-art facility, established within the National Science and Technology Park (NSTP), has been set up with the support of the Turkish Cooperation and Coordination Agency (TIKA). The lab is to foster innovation and interdisciplinary research in fields such as robotics, electronics, coding, algorithmic thinking, and design. Addressing the inauguration ceremony, Dr. Neziroglu underscored the strategic importance of the initiative. \"The Anadolu Creator Lab represents a major step forward in our shared vision of technological advancement. It will empower students and researchers to innovate, prototype, and explore new frontiers in science and technology,\" he added. Federal Minister for Communications Abdul Aleem Khan, NUST Rector Dr. Muhammad Zahid Latif, and the Ambassador of the Turkish Republic of Northern Cyprus were also present on the occasion, alongside students and faculty members. Highlighting TIKA's growing footprint in Pakistan's academic landscape, Dr. Neziroglu noted that the agency had completed several high-impact laboratory projects in the past year alone. These include quantum optics labs, high-tech media labs, and zoological diversity labs across top Pakistani universities, he maintained. He said, \"These efforts reflect TIKA's dedication to empowering Pakistani youth and promoting scientific excellence. It is also a testament to the strong and historic ties between our two brotherly nations.\" Referring to the enduring bond between Turkiye and Pakistan, the ambassador described the bilateral relationship as one rooted in 'eternal brotherhood'. He said, \"For 78 years, our relations have remained excellent and uninterrupted. We celebrate each other's successes, share each other's sorrows, and stand together in every challenge.\" Dr. Neziroglu also thanked Pakistani authorities and TIKA officials for their continued support in advancing academic cooperation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}