{
  "article_id": "2025-04-30_5a7fcb98b932df14174743e2c3e6862a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/interior-minister-visits-jinnah-square-underpass-project-in-islamabad/",
    "retrieved_at": "2025-08-27T15:04:11.565Z"
  },
  "metadata": {
    "title": "Interior Minister visits Jinnah Square underpass project in Islamabad",
    "author": null,
    "date_published": "2025-04-30T10:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 326,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 30 (APP):Federal Interior Minister Mohsin Naqvi paid a late-night visit to the Jinnah Square Murree Road Underpass Project to review the ongoing construction work. During his visit, he expressed satisfaction with the pace of the project and directed that it be completed within the set timeline. Accompanied by senior officials, Minister Naqvi also inspected Shaheen Chowk on Margalla Road and the Faizabad Interchange - two key traffic points in the federal capital. He emphasized the need to use all available resources to ensure timely completion of the underpass, which is aimed at easing traffic congestion on Murree Road. Speaking to the media and officials on-site, Mohsin Naqvi said that the stretch from Jinnah Square to Faizabad Chowk would be developed as a model road. He instructed that this road should include beautiful lighting and proper landscaping to enhance its appearance and improve the driving experience for commuters. The minister also announced that Margalla Road will be made signal-free in phases to help reduce traffic pressure, particularly around Shaheen Chowk, which is currently one of the busiest intersections. He stressed that the construction of an underpass at this location will play a key role in managing traffic flow more efficiently. Regarding the Faizabad Interchange, which connects Islamabad and Rawalpindi, Minister Naqvi directed that remodeling work should begin soon. He said that the interchange would be widened to improve traffic movement between the twin cities. \"Our goal is to make Islamabad a world-class city in terms of public facilities and infrastructure,\" said Mohsin Naqvi. Chairman of the Capital Development Authority (CDA), Muhammad Ali Randhawa, briefed the minister during the visit. He informed that work on the underpass is progressing rapidly and, God willing, it will be completed on time. He added that efforts are underway to reduce traffic congestion and provide better facilities to citizens. The visit highlighted the government's focus on improving infrastructure and ensuring better urban planning for the residents of Islamabad and Rawalpindi.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}