{
  "title": "Air Chief reaffirms PAF’s commitment to fostering robust partnership with Turkish Air Force",
  "link": "https://www.app.com.pk/national/air-chief-reaffirms-pafs-commitment-to-fostering-robust-partnership-with-turkish-air-force/",
  "date_published": "2023-09-01T15:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): Chief of Air Staff, Air Chief Marshal Zaheer Ahmed Baber Sidhu on Friday expressed his gratitude to the Turkish President, Recep Tayyip Erdogan, for extending a warm invitation to attend Graduation and Flag Detachment Ceremony and reaffirmed Pakistan Air Force’s commitment to fostering a robust partnership with the Turkish Air Force.\nConsequent to a special invitation by the Turkish Presidency, Air Chief Marshal Zaheer Ahmed Baber Sidhu made a landmark visit to Turkiye to attend the prestigious Graduation and Flag Detachment Ceremony, as Guest of Honour, which was held at Turkish Air Force Academy, a Pakistan Air Force (PAF) news release said.\nThe ceremony was also attended by Minister of State for Defence & Deputy Prime Minister of the State of Qatar, Dr Khalid Bin Mohammad Al-Attiyah and Minister of Defence of the Republic of Azerbaijan, Colonel General Zakir Hasanov along with senior military commanders and high level state officials from across the world.\nThe Graduation and Flag Detachment Ceremony, held at the Turkish Air Force Academy, is a moment of immense pride and accomplishment for the graduating cadets, as they mark the culmination of their rigorous training and embark on their journey as officers of the Turkish Air Force.\nThe presence of Air Chief Marshal Zaheer Ahmed Baber Sidhu as the Guest of Honour adds to the significance of this event and underscores the deep-rooted camaraderie between the two air forces.\nDuring the event, the chief of the air staff interacted with various high-level dignitaries including General Ziya Cemal KADIOGLU, Commander of Turkish Air Force.\nHe also emphasized the shared values and aspirations that form the foundation of the deep-rooted friendship between Pakistan and Turkiye.\nThe chief of the air staff expressed his unwavering commitment to enhance the existing bilateral ties in military-to-military cooperation with Turkiye especially in the field of defence production, two way sharing of technology and the joint development of fifth generation fighter aircraft.\nHe also reiterated his resolve to further deepen the strong bond of friendship that united the two nations in the face of shared challenges and wished to explore further avenues of collaboration in the defence and aviation sector.\nA follow up to the recent Strategic Framework Agreement on Defence Collaboration, the visit serves as a testament to the deep-rooted historical, religious, cultural and strategic bonds shared between the two nations. Owing to this strategic frame work, Turkiye’s leading firms have already commited to strategic partnership by establishing their offices in the recently inaugurated “Alpha Techno Square” of Pakistan’s esteemed National Aerospace Science and Technology Park. Subject framework has the potential to pave the way for enhanced cooperation and exchange across various sectors, particularly in aerospace and technology. The collaboration has also opened doors for joint ventures, technology transfer and knowledge sharing between the two countries, fostering growth and innovation in the aerospace industry.\nDuring his trip abroad, the Air Chief also called on General Gabor Böröndi, Chief of General Staff, Hungarian Defence Forces. The meeting provided a valuable opportunity for military leadership of both sides to engage in fruitful discussions concerning mutual interests, strategic objectives and exploring avenues for enhanced cooperation. The Air Chief conveyed Pakistan’s commitment to strengthening the existing partnership between the two countries and exploring possibilities for further collaboration in the defence sector.\nThe historic visit of Air Chief Marshal Zaheer Ahmed Baber Sidhu to Turkiye not only strengthens the existing ties between the two brotherly countries but also signifies the enduring commitment of both nations to work collaboratively towards a more secure and prosperous region.",
  "retrievedAt": "2025-08-11T09:24:59.131Z"
}
