{
  "title": "JKLF seeks Saudi Crown Prince’s due influence to save life of  jailed Kashmiri leader Yasin  Malik",
  "link": "https://www.app.com.pk/national/jklf-seeks-saudi-crown-princes-due-influence-to-save-life-of-jailed-kashmiri-leader-yasin-malik/",
  "date_published": "2023-09-01T07:33:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): , Sep 01 (APP):: US-based acting Chairman of JKLF, (Yasin Malik Group) Raja Muzaffar has appealed to Saudi Arabia’s Ruler Crown Prince Muhammad bin Sulaiman to use his due moral and diplomatic influence to save the life of prominent Kashmiri leader-the Chairman of Jammu Kashmir Liberation Front, Muhammad Yasin Malik, who is imprisoned in India.\nRaja Muzaffar, a close associate of Malik, based in America, lodged an appeal to the Saudi ruler as saying “Saudi Arabia has good relations with India and according to the news, his excellency is scheduled to visit Delhi on the special invitation of the Indian government”, says a message reaching from Dallas, Texas, released to the media here on Friday.\nThe JKLF prayed in his appeal as saying, “On this occasion, the people of Kashmir appeal to you to use your influence to save the life of prominent Kashmiri leader Muhammad Yasin Malik.\nAccording to reports, the ruler of Saudi Arabia is going to India on September 11 at the invitation of Indian Prime Minister Narendra Modi.\nAn appeal sent to prince through Saudi Arabian embassy in Washington DC states that Kashmiri leader Yasin Malik\nIn addition to meetings with former Prime Ministers of India and Pakistan for a peaceful solution to the Kashmir issue, also met with American officials during his visit to the United States and with Saudi officials at the OIC Secretariat during his visit to Saudi Arabia. The current government of India arrested Yasin Malik before the abrogation of Article 370 and filed cases against him for political revenge and malice, and in one such case, Yasin Malik was sentenced to life imprisonment by the government of India. Considering the punishment of life imprisonment as insufficient, it has appealed to change the punishment to death.\nThere is no hope of Yasin Malik getting justice due to the rising tide of hatred against Muslims in India. The life of the Kashmiri leader has become a threat and apart from both parts of Kashmir, the concern of Kashmiri Muslims around the world has also increased. Referring to the meeting of the late Saudi ruler Shah Faisal with the late Kashmiri leader Sheikh Abdullah in Riyadh in 1963, Raja Muzaffar reminded in his letter that Sheikh Abdullah was arrested on his return to India after the meeting with the Saudi ruler.\nRaja Muzaffar has further reminded in his letter that the behind-the-scenes efforts of the Saudi government also played a major role in the Indian government’s decision to release Sheikh Abdullah and then send him to negotiate with Pakistan in 1964.\nRaja Muzaffar added copies of his interviews and articles published in the Saudi Arabian newspapers Arab News, Saudi Gazette and Al-Muslimun along with his letter, appealing to the Saudi ruler to intervene to save Yasin Malik’s life on humanitarian grounds. That the people of Jammu and Kashmir, who love Saudi Arabia very much, hope that Kingdom of Saudi Arabia will play a role in saving the life of the beloved leader of Kashmiris. Raja Muzaffar said in his letter that ; Yasin Malik and his party are demanding independence from both , India and Pakistan”, Muzaffar concluded.\nRaja Muzaffar said that he is also drawing the attention of other international human rights organizations in this direction. AHR.",
  "retrievedAt": "2025-08-11T09:24:53.000Z"
}
