{
  "title": "Glowing tributes paid to iconic Kashmiri leader Geelani",
  "link": "https://www.app.com.pk/national/glowing-tributes-paid-to-iconic-kashmiri-leader-geelani/",
  "date_published": "2023-09-01T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): Late iconic leader Syed Ali Shah Geelani was paid rich tribute on his second martyrdom anniversary on Friday for his commitment and unflinching stance for the Kashmiris’ right to self-determination and raising voice against occupation forces’ atrocities in the Indian Illegally Occupied Jammu & Kashmir (IIOJK).\nDifferent seminars and rallies were organized across Pakistan, including Azad Jammu & Kashmir while prominent leaders world over commemorated late Ali Geelani for his contribution to the cause of Kashmir and human rights.\nCaretaker Prime Minister Anwaar-ul-Haq Kakar, in his remarks on his social media account on X (formerly known as Twitter), said: “My respects to iconic Kashmiri leader, Syed Ali Shah Geelani, on his second death anniversary.”\nHe said in the face of persecution and hardship, his commitment to the Kashmir cause was unparalleled. “I pay homage to his life-long struggle for freedom and justice.”\nCaretaker Foreign Minister Jalil Abbas Jilani, paying tribute to the iconic leader in a post on X, said,”He was a brave and steadfast leader. He inspired generations of Kashmiris in their struggle for realization of their right to self-determination in accordance with the relevant UN resolutions.”\nForeign Office spokesperson Mumtaz Zahra Baloch, in a statement, also remembered the life and legacy of Syed Ali Shah Geelani. “A courageous leader, he continues to inspire generations of Kashmiris who remain steadfast in their just struggle for the realization of the right to self-determination.”\nMeanwhile, the Kashmir Institute of International Relations (KIIR) organized a seminar in Islamabad during which supreme sacrifices and indomitable role of the towering resistance leader were highlighted. The speakers said that the life-long struggle of the martyred leader for the cause of Kashmir would be remembered for a long time in the annals of Kashmir history.\nOn the occasion young scholars from different universities of the Federal Capital made a pledge to spread the mesaage of Ali Geelani to every nook and cranny of Pakistan and to international audience through their writings.\nIn Washington, Secretary-General of World Kashmir Awareness Forum,, Ghulam Nabi Fai, while paying tribute to the late leader, said Geelani was “incorruptible and conscientious”.\nHe said Geelani stood firm in the struggle for the freedom of Kashmir, “the paradise on earth ,” despite India’s oppressive measures, including 12 years prolonged house arrest.\nIn Azad Jammu & Kashmir, mammoth rallies were taken out at Lal Chowk, Upper Adda, in Muzaffarabad and Bagh to commemorate the icon of Kashmir resistance movement on his second martyrdom anniversary. Hurriyat leaders led the rally, participated by various political, religious and social organizations.\nOn the occasion, the speakers paid glowing tributes to Syed Ali Geelani for his unparalleled and eternal sacrifices during the freedom movement.\nLikewise, speakers at a seminar organized by the Institute for Dialogue, Development, and Diplomatic Studies (IDDDS) at Scholars School of Sciences and Information Technology, Muzaffarabad termed Ali Geelani a towering political leader and unwavering champion of the Kashmiri cause who left an indelible mark on the socio-political landscape of Jammu and Kashmir.\nThe All Parties Hurriyat Conference had given a call for the ‘Hyderpora Chalo’ in Srinagar on the second martyrdom anniversary of veteran Kashmiri leader. However, the Indian authorities imposed restrictions around the grave of martyred leader to prevent people from offering Fateha.\nMeanwhile, posters were pasted on walls, pillars and electric poles in different areas of the occupied territory urging the people to march towards Hyderpora to pay tribute to the veteran leader.",
  "retrievedAt": "2025-08-11T09:24:44.202Z"
}
