{
  "title": "Interior Minister reiterates resolve for elimination of terrorism from country",
  "link": "https://www.app.com.pk/national/interior-minister-reiterates-resolve-for-elimination-of-terrorism-from-country/",
  "date_published": "2023-09-01T08:40:00.000Z",
  "source": "APP",
  "content": "KARACHI, Sep 01 (APP): Caretaker Interior Minister Senator Sarfaraz Bugti Friday while reiterating the resolve for the elimination of terrorism from the country said that all possible measures would be taken for maintaining peace to achieve the goals of development and prosperity of the nation.\nThe minister, while addressing the passing out Ceremony of Pakistan Coast Guard’s 43rd Basic Recruit Training Course here, said that valiant nations face difficult situations gallantly and Pakistani nation’s unwavering resolve against violence and terrorism could not be shattered.\n“Terrorists wanted to impose their extremist ideology on 240 million people of Pakistan by violence and acts of intimidation but we will not surrender and encounter all forms and manifestations of violence with courage and unity,” he vowed and urged that the entire nation should demonstrate unity in the war against terrorism and bust the nefarious designs of anti-Pakistan forces.\nSarfraz Bugti expressing condolence to the families of Jawans of the Pakistan Army who embraced martyrdom in the line of duty said, “The entire nation is proud of unmatched sacrifices of valiant armed forces and law enforcement agencies for the safe, secure, and prosperous future of Pakistan.”\n“Sacrifices rendered by the Pakistan Army, para-military forces, Police, Levies, and people of Pakistan in the war against terrorism will be remembered forever,” he maintained.\nThe interior minister said, “The government envisions Balochistan as the future of Pakistan and a peaceful Balochistan is a beacon of hope for strong Pakistan as this vast province was bestowed with precious natural resources and could attain the status of the jugular vein in the economy of the country.”\nUnfortunately, some terrorist elements and their anti-state activities were not only obstructing the development of the province but they were also trying to delude the youth, he noted.\nHe said, “Their malicious designs will not succeed.”\nCommending Pakistan Coast Guard’s efforts and endeavor to make the country’s coastline safe and secure, the minister said that PCG in collaboration with Pakistan Army and civil armed forces was striving hard to maintain law and order in the entire coastal belt particularly in Balochistan and over 50 jawans of PCG had laid their lives for maintaining peace and foil the nefarious designs of the enemy.\n“The situation has greatly ameliorated and trade and economic activities were flourishing in coastal areas due to the efforts of PCG,” he observed.\n“PCG has successfully accomplished with professional excellence important responsibilities of prevention of smuggling of drugs, movement of illegal immigrants and activities of anti-state elements and terrorists.”\nThe coast guard, during various actions against smugglers in the previous year, forfeited 18000 tons of drugs worth millions of dollars in the international market besides other contraband items worth Rs1000 million, the minister informed.\nAbout 400 illegal immigrants were also captured in the period while a number of criminals were taken to task, he added.\nThe PCG also played a remarkable role in serving the local communities of the coastal belt by taking an active part in the repair and renovation of schools, provision of clean drinking water, and arranging free medical camps, Sarfaraz Bugti highlighted.\nHe said that PCG also conducted rescue operations during flood situations and not only evacuated stranded populations to safer areas but also provided food supplies.\nThe minister said that recognizing the important role of PCG the government provided the organization with state of a art communication system, necessary equipment, and arms while several measures were taken as well for the welfare of PCG personnel and officers.\nThe minister also announced at the occasion that steps would be taken for the addition of a 15% special allowance in salaries of PCGs like FC.\nEarlier, Director General (DG) of PCG Brigadier Ghulam Abbas welcomed the Interior Minister on his arrival at the headquarters of Pakistan Coast Guards.\nA smartly turned-out contingent of PCG presented a guard of honour to the minister.",
  "retrievedAt": "2025-08-11T09:24:50.877Z"
}
