{
  "title": "Leopard spotted in QAU, varsity warns students, faculty to be watchful",
  "link": "https://www.app.com.pk/national/leopard-spotted-in-qau-varsity-warns-students-faculty-to-be-watchful/",
  "date_published": "2023-09-01T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 1 (APP): A common Asian Leopard the apex predator of the Margalla Hills National Park (MHNP) on Friday was spotted near the Earth Sciences Department building early in the morning that rang the alarm bells for the varsity administration that advised its students and faculty to remain watchful.\nThe Islamabad Wildlife Management Board (IWMB) and Islamabad Capital Territory Police were informed by the University administration and a team of the Board paid a visit to the QAU to confirm the presence of the wildcat.\nAn IWMB official told APP that the leopard might have descended from the hills of the national park to drink water and probably returned to its natural environment afterwards.\nThe Board official informed that the University’s security staff at 0830 hours observed the movement of the wildcat near the Earth Sciences Building.\n“Our team went and scanned the entire area but did not find the animal at that site. Probably, the leopard moved back to its natural habitat that is very near to the QAU’s backside,” he added.\nA picture captured on the site projected a pug mark of the Leopard which was being examined by the Board team to ascertain the wildcat’s presence.\nAccording to the Senior IWMB Member, Z.B. Mirza leopards are very shy animals from the cat family that abstain from any human encounter and used to live an elusive life in their natural habitat. However, it is the top predator of the national park and could harm humans if provoked or instigated in its natural habitat.\nHe had also prepared detailed guidelines for the masses venturing into the national park to take precautionary measures in case of any encounter with the wildcat.\nThe crux of those guidelines was to avoid venturing into the jungle after sunset and before sunrise, as these were the ideal timings for the leopard to patrol in the national park, he added.\nA recent video by a local hiker at Trail-5 captured during Ramazan spotting a leopard that scarcely focussed on human presence in the environment and left the spot without any damage to the individual who was at a long distance from the wildcat.\nChairperson IWMB, Rina Saeed Khan condemned that act of the citizen and urged the masses to avoid disturbing the wild animals as the national park belonged to them and human intrusion would impact their habitats which should remain confined and responsible.",
  "retrievedAt": "2025-08-11T09:24:41.494Z"
}
