{
  "title": "Farrukh asks ECP to hear political parties’ foreign funding cases simultaneously",
  "link": "https://www.app.com.pk/national/farrukh-asks-ecp-to-hear-political-parties-foreign-funding-cases-simultaneously/",
  "date_published": "2022-01-04T17:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Tuesday urged the Election Commission of Pakistan (ECP) to hear cases of all political parties related to foreign funding simultaneously in light with the directions of the apex court.\n“We have no objection if the ECP hears all three parties cases in open court, as PTI fully believed in transparency,” he told media here.\nThe cases of all three parties including PTI, PML-N and PPP were of ‘same nature’, and the scrutiny committees were formed in light of the apex court’s decision which stated that all the parties’ bank accounts would be scrutinized in accordance with the law and without any discrimination, he added.\nFlanked by Minister for Information and Broadcasting Chaudhry Fawad Hussain, he said, he had asked the ECP to direct its scrutiny committees to submit audited reports of bank accounts relating to foreign funding of different political parties including Pakistan Peoples Party (PPP) and Pakistan Muslim League-Nawaz (PML-N).\nHe appealed the media houses to avoid spreading fake news about Pakistan Tahreek-e-Insaaf (PTI) party accounts, adding that it should confirm the facts and figures after going through the report of Election Commission’s scrutiny committee before filing the news.\nHe said, suspicious revelations relating to secrete bank accounts of both the PML-N and PPP’s were traced when the financial experts and chartered accountants of ruling party PTI were given access to the records submitted by the parties’ bank accounts to the ECP’s scrutiny committee.\nThe perusal of PML-N financial documents had revealed nine accounts hidden by the party from the ECP, adding that it [ PML-N] only managed to submit bank statements of two of such accounts when it was revealed that the party kept nine secret accounts.\nFarrukh said the PPP, out of the total 12 party accounts kept nine accounts secret from the ECP in 2013, 11 in 2014 and 10 in 2015.\nHe said PPP continued the practice to conceal bank accounts from ECP, adding that it had failed to produce any financial records of donations worth Rs 350 million. They [PPP]did not have any receipt or other document to prove source of donations, he added.\nHe said according to article 6 of election act 2006 no political party can bear the expenditure of another party neither it can performed fund raising for one another.\nHe said both Pakistan Peoples Party Parliamentarians (PPPP) and Pakistan Peoples Party are two different political parties registered with ECP, But transferring funds from one party account to another in sheer violation of Political Parties Order, 2002.",
  "retrievedAt": "2025-08-11T14:00:39.609Z"
}
