{
  "title": "Pakistan strongly condemns “despicable harassment”, insult of Muslim women on internet, SM sites in India",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-despicable-harassment-insult-of-muslim-women-on-internet-sm-sites-in-india/",
  "date_published": "2022-01-04T12:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP): Pakistan on Tuesday strongly condemned the “despicable and totally unacceptable harassment and insult” of Muslim women on the internet and purpose-built online application in India.\nA statement from the foreign office took strong exception of the incident in which a journalist from Kashmir – Quratulain Rehbar’s photograph was put on sale on ‘Bulli Bai’ –  an app made to auction Muslim women online.\nThe app was made by right-wing Hindus where photos of vocal Muslim women were put up for sale in an “online auction”, generating a furore, particularly amongst the human rights organisations and women across the world.\nThe statement from the office of the spokesperson termed it “a completely obnoxious and repugnant act, aimed at humiliating, harassing and insulting Muslim women.”\nIt pointed that the doctored images of the women have been placed on the internet application with outrageous captions for “auction”.\nHate-mongering followers of such applications attacked the dignity of nearly 100 influential Muslim women by “bidding” on them with deeply offensive remarks, the foreign office spokesman said.\n“This is the newest low in the violent streak of hate attacks against minorities in India whereby cyberspace – with purpose-built online platform(s) and social media – has been used yet again, to demean and harass women, particularly Muslim women, to create a feeling of fear and shame amongst the Muslim community.”\n“These horrifying occurrences have left Muslim women traumatized and in deep fear,” the Foreign Office said.\nIt also pointed how under the Hindutva-inspired BJP-RSS combine dispensation in New Delhi, space for minorities particularly Muslims was continuously shrinking in India.\n“It is reprehensible that no action has been taken against the perpetrators of similar abhorrent act six months ago auctioning dozens of influential Muslim women in India on a social media platform.”\nThe spokesperson said deafening silence of the BJP leadership and absence of discernible action against ‘Hindutva’ proponents openly calling for genocide of Muslims should send alarm bells across the international community about the gross and systematic human rights violations of minorities particularly Muslims in India.\nPakistan reiterated its calls on the international community, particularly the United Nations and relevant international human rights and humanitarian organizations to fulfill their responsibilities to stop the rising xenophobia, Islamophobia and violent attacks against minorities in India and ensure their safety, security and well-being.",
  "retrievedAt": "2025-08-11T14:00:43.121Z"
}
