{
  "title": "Kashmiris to observe Right to Self-Determination Day on Wednesday",
  "link": "https://www.app.com.pk/national/kashmiris-to-observe-right-to-self-determination-day-on-wednesday/",
  "date_published": "2022-01-04T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP): Kashmiris on both sides of the Line of Control and the world over will observe the Right to Self-Determination Day on January 5 to remind the United Nations to implement its own resolutions on the dispute passed this day in 1949.\nIt was on 5th January 1949, when the United Nations Commission for India and Pakistan adopted a resolution that guaranteed the Kashmiris right to self-determination through an impartial plebiscite.\nPakistan observes the Kashmir Solidarity Day on this day to express support for the  Kashmiri brethren and remind the international community of its commitments made to the people of Indian Illegally Occupied Jammu and Kashmir (IIoJK).\nThe day will be marked by various activities, including rallies, seminars and conferences across the world to remind the UN that it must implement its relevant resolutions to settle the Kashmir dispute to save the Kashmiris from the Indian brutalities.\nThe special meetings will highlight the importance of early grant of the right to self-determination to the Jammu & Kashmir people – which was being suppressed and denied by India for over last seven decades.\nSpeakers in these meetings will reiterate the Kashmiris’ just and principled stance before the world that they (Jammu Kashmir people) will continue their struggle for right to self-determination till the achievement of the ultimate goal.\nThey will particularly highlight the reality with the earnest demand about early grant of the birth right of self-determination to the Kashmiris without further delay, which is being denied by India for the past over 70 years because of her traditional hostile and stubborn attitude.\nAccording to analysts, despite the UN guarantees, India has not held a free and fair plebiscite in Kashmir even after 75 years, which is an utter violation of international law.\nInstead, the people of Kashmir are suffering systematic persecution at the hands of Indian occupational forces for demanding their right to self-determination, while the international community, especially the UN, has failed to implement its resolutions.\nThey urged the world to stand up against Indian tyranny and its rouge behaviour. They said the right to self-determination, a universally recognized  basic norm of democratic society “provides a choice to the certain individuals to decide about their future according to their own wishes. But this right is completely denied by the so-claimed largest democratic India.”\nThey said that the Indian government’s point of view, that its constitution barred holding of a plebiscite in Kashmir, could be negated while examining the provisions of its Article, which “invests the Indian parliament with the power to create new states and alter the areas, boundaries and names of the existing ones”.\nThere was no provision in the Indian constitution for the final decision of Jammu & Kashmir, they added. The analysts said the Indian state was bound to observe the international norms as referred by the Vienna Convention on the Law of Treaties.\n“Article 27 of this convention declares that a party cannot invoke the provisions of its internal law as justification for its failure to perform a treaty. This article shows that the state cannot back out from the international commitment on the ground that it is the violation of its national law.”\nThey opined that the only way forward to end the Kashmir dispute was to give the people of Kashmir free will to decide their future, as guaranteed by the UN Security Council resolutions.\nThe international community, especially the West, must rise above their economic and strategic interests and put pressure on the Indian government to withdraw its illegal forces from the IIOJ&K and give the people their right to self-determination, they stressed.\nNew Delhi’s allegation of assistance to the Kashmiri people from the Pakistan side is unfounded. Objective reports in foreign media testify that the Kashmiri agitation is indigenous.\nPakistan upholds the right of the people of Jammu and Kashmir to self-determination in accordance with the UNSC resolutions of 1948 and 1949, which provide for the holding of a free and impartial plebiscite for the determination of the future of the state by the people of Jammu and Kashmir.\nDespite suffering for 75 years under illegal Indian occupation, the Kashmiri people remain committed to their demand for right to self-determination. Pakistan stands with them unequivocally in their rightful struggle for freedom from Indian tyranny and repression.",
  "retrievedAt": "2025-08-11T14:00:39.610Z"
}
