{
  "title": "The Millennium Education wins GDEIB Award 2021-22",
  "link": "https://www.app.com.pk/national/the-millennium-education-wins-gdeib-award-2021-22/",
  "date_published": "2022-01-04T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 4 (APP):The Millennium Education (TME) Pakistan won the prestigious Global Diversity, Equity, and Inclusion Benchmark GDEIB Award 2021-22 under the category of recruitment, DEI Communications and DEI Learning and Development.\nGlobal Diversity, Equity and Inclusion Benchmark awards are standards around the world which help determine strategies and measure progress in managing diversity and fostering inclusion, said a press release issued here on Tuesday.\nGDIB awards recognizes and encourage progressive organizations who use GDEIB standards to align Diversity, Equity, and Inclusion with organizational policies for sustainable financial, human resource and social performance.\nThe prestigious GDEIB awards are annually awarded to companies which demonstrate and reflect equity, diversity, and inclusion. A jury panel reviewed award submissions by companies and organizations across Pakistan selecting 30 organizations including The Millennium Education, Pakistan.\nThe Millennium Education, Pakistan K-12 is committed to diversity and inclusion of education, literacy, and professional development. The Millennium Education strives to recognize staff contribution in developing an effective, adaptable, and capable educational eco-system. It is centered around a culture of pride, innovation, performance, diversity, creativity, entrepreneurship, and excellence.\nThe Millennium Education is inclusive and aspires to be a recognized leading institute of border less professional development opportunities provided through an adaptive environment where our talented, motivated staff, effective governance, management, and leadership benefit from collaborative professional development courses.\nFounder & CEO The Millennium Education Dr. Chaudhary Faisal Mushtaq believes that enrichment and skill development is the only constant in contemporary educational world. The Millennium Education is diverse and is determined to build a strongly inclusive culture which respects every employee, he added.",
  "retrievedAt": "2025-08-11T14:00:31.863Z"
}
