{
  "title": "Saudi FM Prince Faisal bin Farhan Al Saud arrives on Tuesday: FO",
  "link": "https://www.app.com.pk/national/saudi-fm-prince-faisal-bin-farhan-al-saud-arrives-on-tuesday-fo/",
  "date_published": "2021-07-26T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 26 (APP): Minister for Foreign Affairs of the Kingdom of Saudi Arabia Prince Faisal bin Farhan Al Saud will be visiting Pakistan on Tuesday (July 27, 2021).\nThe Saudi Foreign Minister, visiting Pakistan on the invitation of Foreign Minister Makhdoom Shah Mahmood Qureshi, will be accompanied by a delegation comprising senior officials of the Saudi Government.\nDuring the visit, the two Foreign Ministers will exchange views on the entire gamut of bilateral relations and regional and international issues. The Saudi Foreign Minister will call on other dignitaries as well during the visit, Foreign Office said in a statement issued here on Monday.\nThe visit of Saudi Foreign Minister holds special significance in the backdrop of the recent visit of Prime Minister Imran Khan to Saudi Arabia in May 2021. It will provide a timely opportunity to review progress in bilateral cooperation in line with the vision of the leadership of the two countries, the statement added.\nPakistan and Saudi Arabia have long-standing and historic fraternal relations, rooted deep in common faith, shared history and mutual support.\nThe relationship is marked by close cooperation in all fields and mutual collaboration on regional and international issues.\nSaudi Arabia is a member of the Organization of Islamic Cooperation (OIC) Contact Group on Jammu and Kashmir and had steadfastly supported the Kashmir cause, it added.\nFrequent high-level visits were a key feature of the relationship that served to further deepen and broaden the relationship in myriad dimensions.\nThe visit of the Saudi Foreign Minister will reinforce the positive momentum in high-level exchanges and the deepening of bilateral cooperation in diverse fields, the statement maintained.",
  "retrievedAt": "2025-08-11T21:00:25.089Z"
}
