{
  "title": "COVID-19 national tally reports highest positivity ratio since July 1",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-reports-highest-positivity-ratio-since-july-1/",
  "date_published": "2021-07-26T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):The national tally of total active COVID-19 cases was recorded as 57,799 on Monday with 3,752 more people testing positive for the deadly virus and 1,641\npeople recovering from the disease during the last 24 hours.\n32 corona patients have died during past 24 hours, 31 of whom were under treatment in the hospitals and one of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Punjab.\nOut of the total 32 deaths occurred, 21 of them died were under treatment on ventilators.\nThere were 2,677 Covid infected patients under treatment in critical condition with 104 of them admitted during past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 7.51 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad\n38 percent, Lahore 20 percent, Peshawar 17 percent and Multan 15 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 51 percent, Karachi 47 percent, Rawalpindi 24 percent and Muzaffarabad 30 percent.\nAround 277 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan.\nSome 49,947 tests were conducted across the country on Sunday, including 18,122 in Sindh, 17,751 in Punjab, 8,311 in Khyber Pakhtunkhwa (KP), 2,383 in Islamabad Capital Territory (ICT), 1,727 in Balochistan, 740 in GB, and 913 in AJK.\nAround 927,599 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,008,446 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 23,093, Balochistan 29,571, GB 7,747, ICT 85,780, KP 141,925, Punjab 353,238 and Sindh 367,092.\nAbout 23,048 deaths were recorded in country since the eruption of the contagion. Around 5,833 people perished in Sindh, 19 of them died in the hospitals on Sunday.\n10,944 people died in Punjab died with five deaths occurred in past 24 hours. Four individuals died in the hospitals and one out of the hospital.\nAs many as 4,420 people expired in KP, three of them died in hospitals on Sunday, 793 individuals died in ICT, one of them died in the hospitals in past 24 hours, 325 people died in Balochistan, three of them died in the hospitals on Sunday, 123 infected people perished in GB, one of them died in the hospitals in past 24 hours and 610 people in AJK succumbed to the deadly virus.\nA total of 15,717,061 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 3,045 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:00:24.042Z"
}
