{
  "title": "Ashrafi demands speedy trial of culprits involved in heinous crimes against women",
  "link": "https://www.app.com.pk/national/ashrafi-demands-speedy-trial-of-culprits-involved-in-heinous-crimes-against-women/",
  "date_published": "2021-07-26T15:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Special Representative to the Prime Minister on Religious Harmony and Middle East Hafiz Tahir Mehmood Ashrafi on Monday demanded to public hanging of the perpetrators of heinous crimes against women.\nAddressing a news conference, Tahir Ashrafi, who is also chairman of Pakistan Ulema Council (PUC) appealed Chief Justice of Pakistan and Prime Minister to order speedy trial of Noor Muqaddam murder and Usman Mirza cases and stressed public hanging and stoning to death of the culprits.\nHe said the state is standing with the innocent victims of heinous crimes and justice system should be amended drastically to pave way of prompt punishments of such culprits of heinous crimes. He urged parents to strive bridging the ever widening gap in the relationship with their children.\nHe said terrorism in its all forms is prohibited in Islam. He said he along with leading Ulema and religious scholars would start a country wide journey from Wednesday for promoting interfaith harmony.\nCommenting on the victory of PTI in Azad Jammu and Kashmir (AJK) elections, he said the people of Indian Illegally Occupied Jammu and Kashmir (IIOJ&K) were jubilant on this victory. He hoped that the people of Kashmir would win the right to self determination. Prime Minister was representing the Kashmir issue in an impressive way.\nRegarding foreign policy, he said Pakistan warmly welcomes Saudi Foreign Minister Prince Faisal Bin Farhan Al-Saud, who is coming to country on the invitation of Foreign Minister Shah Mehmood Qureshi. He lauded Saudi Arabia for making excellent arrangements of Hajj and opening of Umrah for pilgrims.\nResponding to a question, he said religious scholars and Ulema had already agreed on Paigham-e-Pakistan narrative. He urged the nation to plant at least two saplings at suitable place on August 14.",
  "retrievedAt": "2025-08-11T21:00:22.985Z"
}
