{
  "title": "Fiery speeches, personal attacks, foreign agenda led to routing of PML-N in AJK",
  "link": "https://www.app.com.pk/national/fiery-speeches-personal-attacks-foreign-agenda-led-to-routing-of-pml-n-in-ajk/",
  "date_published": "2021-07-26T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 26 (APP): Despite ruling the AJK for five years, large gatherings, tall claims, fiery speeches, and personal attacks, the PML-N lost the election, and that too poorly, by managing to barely get only 6 seats, out of 45.\n“Anti-state agenda, targetting State institutions, pursuing foreign agendas has led to routing of PML-N from Kashmir,” Information Minister Fawad Chaudhry said Monday.\nHe was commenting on reasons leading to the fall of the ruling party and said the results clearly reflected that the people of Azad Jammu and Kashmir had refused to accept the PML-N narrative, led by Maryam Nawaz Sharif, and opted for the bold stance adopted by Imran Khan on the issue of Kashmir.\nThe PTI won 24 of the 45 seats, followed by 11 by the Pakistan Peoples Party and six by the Pakistan Muslim League (Nawaz).\nFawad and other political analysts termed the recent meeting of the Afghan NSA Hamdullah Mohib with the former Prime Minister Nawaz Sharif in London’s Avenfield apartments the breaking point, which prompted the people of Azad Kashmir to realise that they were being taken in for a  ride.\nCongrats to @ImranKhanPTI for a convincing victory in AJK polls. After PPP, PMLn , Kashmiris eager for change which they will get. BBZ left campaign to deal with AAZ's US secret assets. MN is sure recipe for defeat. NS destroyed Pmln chances by meeting Afghan NSA, friend of Modi\n— Farooq Hameed Khan (@FarooqHKhan) July 26, 2021\nAnother Twitterati Anjum Kiani attributed the routing to PMLN’s failure to condemn Indian brutality and raising of the Kashmir issue during the election campaign.\nHe too pointed that the meeting of Nawaz Sharif with the Afghan NSA who termed Pakistan as a “brothel house” some time back would wipe PMLN out of the AJK Elections2021.\nPMLN's failure to condemn Indian brutality & raise Kashmir issue during AJK election campaign, Nawaz Sharif & Afghan NSA meeting will wipe PMLN out of #AJKElections2021 whereas PTIs consistently being advocate of Kashmir & IKs development plans made heart in Kashmiri voters.\n— Anjum Kiani (@AnjumKiani) July 25, 2021\nThe people of Kashmir also recalled how Nawaz Sharif during his visit to India refused to meet with the leaders of the Hurriyat Conference and instead opted to hold closed-door meetings with Indian businessmen who were in partnership with his steel mills.\nThe role of Imran Khan in highlighting the Kashmir issue at all international fora, discussing it with every world leader that he met, and efforts to seek a solution to the simmering dispute got due acknowledgment as the people voted into power the Pakistan Tehreek-e-Insaaf\nAccording to a seasoned former diplomat and columnist Zafar Hilaly, Nawaz Sharif’s meeting with the Afghan NSA, only a few days after he called Pakistan a ‘brothel’ was a terrible insult to the Pakistani nation.\n“Now, more than ever before, it is clear to me that we are well rid of this man,” he said.\nFor Nawaz Sharif to meet the Afghan NSA, Munib, only a few days after Munib called Pakistan a ‘brothel’ was a terrible insult to the Pakistani nation. Now, more than ever before, it is clear to me that we are well rid of this man.\n— Zafar Hilaly (@ZafarHilaly) July 23, 2021\nHowever, the PML-N Vice President Maryam Nawaz expressed the belief that the PTI government could not “comprehend” the “essence of diplomacy”, as well as she can understand.\n“Pakistan’s peaceful existence with its neighbours is the very foundation of Nawaz Sharif’s ideology for which he has worked tirelessly,” Maryam said in a tweet in response to the harsh criticism her party received after Nawaz Sharif’s meeting with top Afghan officials in London.\nIt is the very essence of diplomacy to talk to everyone, listen to their point of view and convey one’s own message across: something this government doesn’t comprehend and hence is a complete failure on the international front. https://t.co/ZWwXXDf8iz\n— Maryam Nawaz Sharif (@MaryamNSharif) July 24, 2021\nSoon after the meeting in London, Minister for Information and Broadcasting Fawad Chaudhry said whether it was Indian Prime Minister Narendra Modi, Afghan National Security Adviser Hamdullah Mohib or Afghanistan Vice President Amrullah Saleh, “every enemy of Pakistan is a close friend of Nawaz Sharif.”\nنواز شریف کو پاکستان سےباہر بھیجنا اس لئے خطرناک تھا کہ ایسے لوگ بین الاقوامی سازشوں میں مددگار بن جاتے ہیں نواز شریف کی افغانستان میں RAW کے سب سے بڑے حلیف حمداللہ محب سے ملاقات ایسی ہی کاروائ کی مثال ہے، مودی ، محب یا امراللہ صالح ہر پاکستان دشمن نواز شریف کا قریبی دوست ہے\n— Ch Fawad Hussain (@fawadchaudhry) July 24, 2021\nPakistan’s National Security Advisor Moeed Yusuf said the Afghan NSA used “vitriolic and unacceptable language against Pakistan and our people.”\nHe termed the meeting of “Kabul regime officials” with Nawaz Sharif an attempt to further poison the atmosphere between the people of two countries.\n“I can see what Mohib and company were trying to achieve. But what is the other side gaining except trying to embarrass his own country? Deplorable,” he added.\nAfghan NSA has used vitriolic and unacceptable language against Pakistan and our people. The meeting of Kabul regime officials with MNS in UK is an attempt to further poison the atmosphere between the people of two countries.\n— Moeed W. Yusuf (@YusufMoeed) July 24, 2021\nAt the end of the day, it was the PML-N that paid a heavy price for pursuing an agenda, set by those who never missed a chance to stab Pakistan in the back.",
  "retrievedAt": "2025-08-11T21:00:23.155Z"
}
