{
  "title": "Govt pledges support for inclusive education of children with disabilities at Global Education Summit: Shafqat",
  "link": "https://www.app.com.pk/national/govt-pledges-support-for-inclusive-education-of-children-with-disabilities-at-global-education-summit-shafqat/",
  "date_published": "2021-07-26T17:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Minister for Federal Education and Professional Training, Shafqat Mahmood pledged on Monday that the government will support institutions to provide quality education for children with disabilities.\nAccording to a press release, he stated this while emphasizing on inclusive education for children with disabilities.\nShafqat Mahmood will be representing Pakistan at Global Education Summit on 28 and 29 July where he will support a pledge.\nThe pledge promotes the education of children and will contribute to the Global Partnership of Education (GPE).\nShafqat Mahmood will be endorsing ‘Equal World’ campaign of sight savers which is calling on each participating government at the Summit to commit to children with disabilities benefiting from quality and accessible education.\nIn response to the campaign, Shafqat Mahmood has said “Equal World campaign has raised the significance of equity and inclusion in education systems for marginalized children, especially children with disabilities“.\nAround the world children with disabilities have faced some of the worst effects of COVID-19 and subsequent school closures. To counter this the government of Pakistan plans to increase investment in inclusive education.\nMunazza Gillani, Country Director at Sightsavers Pakistan, said, “This is a critical moment for the government of Pakistan to make ambitious, bold and specific commitments on inclusive education and it’s great to work with them on doing this. These policy commitments will help to ensure that no child is left behind in learning”.\nSightsavers is currently partnering with the Ministry of Education on programmes that promote school eye health and the inclusive education of children with disabilities in mainstream schools.\nThese projects train teachers on disability inclusion and screen thousands of children for eye health problems.\nPakistan has the world’s second-highest number of out-of-school children, around 22.8 million, and it is very likely that large numbers of these are children with disabilities.\nThe Summit will provide an opportunity to global community to come together and support quality education for all children and pledge their support to transform education systems in their countries and territories.",
  "retrievedAt": "2025-08-11T21:00:20.681Z"
}
