{
  "title": "PM Imran Khan for full utilization of country’s tourism potential",
  "link": "https://www.app.com.pk/national/pm-imran-khan-for-full-utilization-of-countrys-tourism-potential/",
  "date_published": "2021-07-26T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 26 (APP): Prime Minister Imran Khan Monday said that Pakistan was immensely blessed with the tourism potential when compared with the entire region and resolved that the government would ensure its full utilization.\nHe further stressed that steps should be taken within the stipulated time to make Pakistan a tourists’ destination in the region which would bring investment and foreign exchange.\nThe prime minister was chairing a review meeting on the progress made so far for the promotion of tourism in Pakistan.\nPrime Minister’s Special Assistant Dr. Shahbaz Gill, Chief Minister Khyber Pakhtunkhwa Mehmood Khan, Asif Mehmood Khan Advisor to Chief Minister Punjab for Tourism, chief secretaries of all four provinces and concerned officers participated through a video link.\nThe meeting was briefed on the progress made so far on various points of the roadmap for the promotion of tourism.\nStressing on the importance of tourism, the prime minister directed that the calendar of cultural festivals should be prepared keeping in view their importance, so that tourists could participate in these festivals without any hassle.\nThe meeting was informed that geo-mapping of tourist destinations in all the provinces had almost been completed, which would help to develop and attract investment at the tourist destinations.\nIn addition, a calendar of cultural festivals was being prepared and all details would soon be uploaded on tourist websites and tourism e-portal.\nRegarding the development of tourist destinations in accordance with international standards, it was informed that feasibility of various projects had been prepared in Khyber Pakhtunkhwa, Punjab and Azad Kashmir.\nThe meeting was also apprised of the commencement and progress of development work in Nandana Fort.\nThe meeting was also briefed in detail about the steps taken by the Ministry of Foreign Affairs to promote tourism in the country\nIt was informed that due to the efforts of Pakistani embassies, over a dozen countries had made positive changes in their travel advisory regarding Pakistan, while provision of promotional materials by the Pakistan Tourism Development Corporation (PTDC) to 24 embassies, to promote tourism in Pakistan, was ensured.\nIt was further informed that special desks had been set up in 27 embassies for the promotion of tourism and assistance was provided to about 133 foreign tourism companies for operation in Pakistan.\nIn addition, the issuance of e-visa has been reduced to 7-10 days only to facilitate the foreign tourists.  More than 71,000 foreign tourists have so far availed the e-visa facility.\nThe meeting was also apprised of the steps taken for the promotion of coastal tourism in Balochistan.\nInstructing to identify the areas for tourism in Balochistan with a plan for their development, the prime minister observed that the coastline of Balochistan was very beautiful and full of natural beauty.  There were countless investment opportunities that should be utilized, he stressed.\nReferring to government’s rest houses, the prime minister said that not only public access to these public-funded buildings should be ensured, but also plans for their better utilization should be implemented in the earliest to facilitate tourists.\nThe meeting was informed that approval has been given to build tourists’ resorts at Kand Malir and Marine Drive Gwadar, besides, the construction of fish landing sites, floating jetties, small fishing boats, rest areas on coastal highways and coastal parks were included in the project.\nThe meeting was informed that special desks have been set up at airports in Chitral, Saidu Sharif, Islamabad and Skardu for the convenience of tourists.  PIA’s Air Safari was also operational and a large number of tourists were benefitting from it.",
  "retrievedAt": "2025-08-11T21:00:22.531Z"
}
