{
  "title": "PTI to fulfill promises with Kashmiris : Gandapur",
  "link": "https://www.app.com.pk/national/pti-to-fulfill-promises-with-kashmiris-gandapur/",
  "date_published": "2021-07-26T15:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 26 (APP):Minister for Kashmir and Gilgit-Baltistan Affairs Ali Amin Khan Gandapur Monday said the forthcoming government of Pakistan Tahreek-e-Insaf (PTI) in Azad Jammu and Kashmir (AJK) would fulfill promises made to Kashmiris during election campaign.\nAddressing a press conference here, he said the PTI government would announce a complete package at par with GB, based on transport infrastructure development, tourism and uplift of poor people.\nFlanked by Minister for Information and Broadcasting Chaudhry Fawad Hussain, he said the PTI had provided opportunity to new party workers to contest AJK elections so that they could highlight the case of Kashmir effectively after becoming the member of legislative assembly.\nOn the contrary, he said both the political parties Pakistan Muslim League Nawaz (PML-N) and Pakistan Peoples Party (PPP) opted for old horses which increased sense of deprivation among the locals.\nThe PPP despite remaining into power for three times in AJK had failed to deliver the public, that eventually caused party defeat in the general elections.\nTo a query, he said Prime Minister Imran Khan would nominate AJK Prime Minister and President after consultation with party leadership.\n“The AJK election commission had banned my entry in Kashmir despite the fact that my stance was not harsher than the PPP chairman Bilawal Bhutto and PML-N vice-president Maryam Nawaz ,” he said in response to another question.\n“We respect the election commission and will accept the decision whatever it is,” he added.\nThe minister said he had informed the public before poll that PML-N and PPP would create law and order situation during Azad Jammu and Kashmir polls.\nGandapur said at least two PTI workers were killed and dozens other injured during clashes at various polling station of Azad Jammu and Kashmir.\nHe expressed the gratitude to the people of Kashmir for showing complete confidence in the leadership of Prime Minister Imran khan in recent polls.\nHe said Kashmiris had shown political maturity in the general elections by rejecting the corrupt leaders and their followers.\nHe also thanked the Minister for Communication and Postal Services Murad Saeed and other party workers who run the election campaign successfully across the valley that help securing a thumping victory for PTI.",
  "retrievedAt": "2025-08-11T21:00:22.216Z"
}
