{
  "title": "CM Balochistan instructs to initiate relief activities in rain affected areas",
  "link": "https://www.app.com.pk/national/cm-balochistan-instructs-to-initiate-relief-activities-in-rain-affected-areas/",
  "date_published": "2020-08-28T11:17:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 28 (APP):Chief Minister Balochistan Mir Jam Kamal Khan on Friday instructed concerned departments and commissioners to initiate relief activities to help people in rain affected areas beside rehabilitation of damaged National Highways and roads in various parts of the province.\nHe gave these instructions while chairing a meeting to review flood situations, rain affected areas and relief activities in rain hit areas of the province.\nPersonnel of Irrigation Department, Communication and Works (C&W) Provincial Disaster Management Authority (PDMA), National Highway Authority (NHA), QESCO and Divisional Commissioners attended the meeting.\nThe Chief Minister was also briefed about recent rain flood and affected areas of the province.\non the occasion, Mir Jam Kamal Khan directed relevant departments to remain functional to address problems of public in rain affected areas. “Rehabilitation of rain affected National Highway and roads should be ensured as soon as possible for provision of facilities in the areas”, he directed saying that Irrigation Sector would continue monitoring water level of dams and Spillway of Hub Dam to release extra water timely.\nProvision of relief goods in the affected districts should be started immediately, he directed adding that the NHA and Department of Communication would utilize all available resources to rehabilitate affected highways, roads and bridges.\nHe also instructed relevant department to provide funds to commissioners and deputy commissioners as per their requirement to deal with the emergency situation so that deserving people would not suffer more difficulties in the areas.",
  "retrievedAt": "2025-08-11T19:43:54.547Z"
}
