{
  "title": "National unity vital to foil evil designs of enemies: AJK President",
  "link": "https://www.app.com.pk/national/national-unity-vital-to-foil-evil-designs-of-enemies-ajk-president/",
  "date_published": "2020-08-28T11:18:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 28 (APP): Azad Jammu & Kashmir President Sardar Masood Khan Friday prevailed upon the people to thwart conspiracies of the enemies through faith and unity.\nHe underlined that the Muslims were the followers of Prophet The Great (Peace be upon him), who emerged from Hira cave all alone, and had compelled the then superpower to surrender, and now the number of his followers had exceeded two billion and the echo of Allah o Akbar had risen today throughout the world right from North America up to Asia and Africa to Europe.\nTalking to an an18-member delegation led by Sardar Mohammad Altaf Khan and Maulana Abdur Razzak in Rawalakot city , he said that we were the followers of a great religion that united mankind in the bond of unity and we must not develop differences for the sake of minor interest, AJK President office told media.\nThe president said that we needed not be apologetic against India as it had not only occupied our territory but had attacked our culture, civilization and religious values, which was intolerable.\nHe advised the people to renounce from narrow view and intolerance while remaining in different political parties, and join hands for a common and greater cause of Kashmir’s liberation from a tyrant power.\nQuoting his own example, Sardar Masood Khan said that he had been struggling for the Kashmir cause on the diplomatic fronts since 1990, and wherever he had gone, he had compelled the Indians to retreat on every forum, and had exposed their false narrative.\nThe president realized that the people of Thorarr including a woman Hussain Bibi had offered great sacrifices in the Kashmir liberation war, and had written a history of valour and courage.\nHe warned India to think ten times before the attack on Azad Kashmir that not only the men but women were also ready to inflict a severe blow on the aggressor.\nOn the occasion, leader of the delegation and the PML-N leader Sardar Altaf paid tributes to the AJK president for his political and diplomatic services on the global level.\nLater, the delegations led by Sardar Ashiq, Sardar Javed and Mumtaz separately called on the AJK President and apprised him of the problems of their respective areas. The president assured to resolve all their legitimate issues.\nThe AJK president earlier also inaugurated recently constructed two link roads at Gali Trar and Tarnoti areas located in the outskirt of Rawalakot.",
  "retrievedAt": "2025-08-11T19:43:52.249Z"
}
