{
  "title": "Nawaz Sharif should return to face cases against him: Qureshi",
  "link": "https://www.app.com.pk/national/nawaz-sharif-should-return-to-face-cases-against-him-qureshi/",
  "date_published": "2020-08-28T11:21:00.000Z",
  "source": "APP",
  "content": "MULTAN, Aug 28 (APP): Foreign Minister Shah Mahmood Qureshi Friday said that PML-N chief Muhammad Nawaz Sharif should return to country to face cases against him because he was morally and legally bound to come back.\nTalking to media persons here, he said the health condition of Nawaz Sharif had improved as he was doing politics while sitting in the United Kingdom, where he had gone for medical treatment. He was allowed to leave the country on compassionate ground, besides medical experts recommendations, he added.\nPakistan Muslim League- Nawaz (PML-N) leaders were not sharing medical reports of Nawaz Sharif though his brother Shehbaz Sharif was the guarantor in that connection.\nTo a question, he said that heavy rains had damaged the routine life in Karachi and created troubles for the citizens.\nThe foreign minister said that the drainage system in Karachi had deteriorated and that Federal and Sindh governments should sit together and make future plan for betterment of the city and to ease the miseries of citizens.\nHe said Prime Minister Imran Khan had directed all federal departments including National Disaster Management Authority (NDMA) to take all possible steps for mitigating the problems faced by Karachites for which all resources would be extended.\nTo another question about release of water from India and flood situation, Qureshi said that India had never left any opportunity to put Pakistan in trouble.\nWhenever Pakistan needed water, India stopped it and released it without any warning when its reservoirs were filled, he added.\nTo a question about coronavirus, Shah Mahmood said that the virus cases were gradually decreasing and it was nearing to end with the blessings of Allah.\nHe however, urged the masses to follow the standard operating procedures issued by the government to avert COVID-19.\nWhile the virus was spreading speedily in India and it was believed that India could become most affected country across the world.\nQureshi said that Muharram was being observed with religious fervor and majalis and mourning processions were being held.\nThe whole world acknowledged the Shahadat of Hazrat Imam Hussain (RA) and their role in survival of Islam.\nHe said that like other parts of the country, peace in Multan was exemplary and urged the citizens to cooperate with district administration and police so that Youm-e-Ashure could pass peacefully.\nAbout All Parties Conference, he said that it was right of the Opposition to hold it.\nLater, Shah Mahmood Qureshi visited Imam Bargah Hussainabad where administration briefed him about the initiatives taken regarding Muharram ul Haram.\nOn this occasion, he offered dua for the progress and prosperity of the country.",
  "retrievedAt": "2025-08-11T19:43:45.940Z"
}
