{
  "title": "Pakistan Army Flood Emergency Control Centers functional in Karachi",
  "link": "https://www.app.com.pk/national/pakistan-army-flood-emergency-control-centers-functional-in-karachi/",
  "date_published": "2020-08-28T08:56:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 28 (APP): Pakistan Army under its ongoing relief and rescue operations in flood hit areas of Karachi has established flood emergency control centers with an aim to assist affected population in every possible manner.\nAccording to ISPR since different parts of the metropolis have been been badly affected due to heavy rains and people are virtually turned stranded Pakistan Army has thus besides evacuation of the affected population was equally attentive towards their medical care needs besides arranging food for them.\nIn this context medical camps were said to be established at Gulberg, Liaqatabad and New Karachi areas in Central district and also in other districts accordingly, providing necessary and urgently needed assistance to the affected population while cooked meal was also distributed among10,000 flood victims.\nPeople in need could also approach Army Flood Control Centers functional in Karachi via phone numbers 012-34491082, 021-99247267 and 021-99207795.\nDe-watering of more than 36 sites in Karachi was said to have also been ensured and this was further underway in other areas in need.\nEnhancement of small sized dam along M9 near Northern Bypass was further ensured by Pakistan Army Engineers coupled with de-watering of KE grid station, Saadi Town and Malir Cantonment located in the vicinity as to not only avert inundation but also protect the facilities exposed to serious risks.\nPakistan Army troops also filled the breach caused in the surrounding infrastructure due to heavy flood in Malir River, the army engineers constructed makeshift dams as barriers to protect residential areas at risk of being inundated.\nPakistan Army Engineer boats were said to be busy in shifting people to safer places.\nMeanwhile Pakistan Navy Emergency Response teams along with Pakistan Navy divers recovered two bodies from Shah Faisal Town and Korangi crossing.",
  "retrievedAt": "2025-08-11T19:43:56.287Z"
}
