{
  "title": "NDMA asks provincial authorities to take preventive measures to avoid flood losses",
  "link": "https://www.app.com.pk/national/ndma-asks-provincial-authorities-to-take-preventive-measures-to-avoid-flood-losses/",
  "date_published": "2020-08-28T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): National Disaster Management Authority (NDMA) has asked the provincial authorities to take preventive measures to avoid loss of life and damage to property as Pakistan Meteorological Department (PMD) forecast rains and thunderstorms in most parts of the country from Saturday to Monday.\nAccording to NDMA weather advisory, PMD has predicted that heavy downpour may generate flash flooding in Sibbi, Kalat, Khuzdar, Lasbella and Dera Ghazi Khan and existing urban flooding/water logging in Karachi, Hyderabad, Thatta, Mirpurkhas and Badin may be aggravated on Sunday and Monday.\nNDMA has asked National Highway Authority (NHA), Water and Power Development Authority (WAPDA), National Transmission and Dispatch Company (NTDC), Frontier Works Organisation (FWO) and Communication and Works Departments of respective provinces, regions to remain vigilant in restoring road links for ensuring smooth flow of traffic.\nTourists be apprised, availability of emergency services staff be ensured to cope with any eventuality besides sharing weather updates with WAPDA twice a day to avoid losses.\nThe advisory said Met office has informed that another monsoon rain bearing system is likely to enter in Sindh on Saturday and rain/wind-thundershowers, with isolated heavy to very heavy falls, are expected in Karachi, Hyderabad, Thatta, Badin, Shaheed Benazirabad, Dadu, Tharparker, Nagarparker, Mirpurkhas, Islam Kot, Umar Kot, Sanghar, Sukkur and Larkana from Saturday (evening) to Monday.\nRain-thundershowers with isolated heavy falls are also expected in Lasbella, Khuzdar, Awaran, Barkhan, Zhob, Musa Khel, Loralai, Kohlu and Sibbi during Sunday and Monday. Rain-thundershower are also expected in Bahawalpur, Rahim Yar Khan, Khanpur, Rajanpur, Dera Ghazi Khan, Multan, Khanewal and Sahiwal during the period.\nIn case of mass gathering/rescue operations, the advisory said, COVID-19 guidelines be followed strictly to avoid transmission of this pandemic among the mass interactions.",
  "retrievedAt": "2025-08-11T19:43:51.189Z"
}
