{
  "title": "415 people tested corona positive in past 24 hours, 9 die: NCOC",
  "link": "https://www.app.com.pk/national/415-people-tested-corona-positive-in-past-24-hours-9-die-ncoc/",
  "date_published": "2020-08-28T08:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): As many as 445 people were tested COVID-19 positive and nine people died due to coronavirus in the past 24 hours across the country.\nNo COVID-19 affected patient was on ventilators in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan.\nNational Command and Operation Centre (NCOC) Friday issued the latest statistics of COVID-19 deaths, positive cases and recovered patients across the country.\nAs many as nine people have lost their lives due to COVID-19 during last 24 hours. Out of the total deceased 8 died in hospitals and one died out of the hospital on August 27.\nAlmost 110 ventilators were occupied across Pakistan out of 1920 ventilators allocated for COVID-19 patients.\nDuring the last 24 hours, 415 people were tested COVID-19 positive where the total active COVID-19 cases in Pakistan were 8,833 on August 27.\nHowever, 23,483 tests were conducted on August 27 across the country, including 6,337 in Sindh, 9,939 in Punjab, 2,929 in Khyber Pakhtunkhwa (KP), 3626 in Islamabad Capital Territory (ICT), 167 in Balochistan, 295 in Gilgit Baltistan (GB) and 190 in Azad Jammu and Kashmir (AJK).\nAround 279,937 people had recovered so far across the country making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out a total of 295,053 cases detected so far including 2277 in AJK, 12742 in Balochistan, 2816 in GB, 15578 in ICT, 35923 in KP, 96636 in Punjab and 129081 in Sindh.\nSince the contagion clutched masses across the country around 6283 deaths were recorded. In Sindh 2394 have died where 5 lost their lives in hospital and one out of hospital on August 27.\nIn Punjab 2195 had died where two died in hospital on August 27, in KP 1250 were died while one died in hospital on August 27. However, in ICT 175 deaths were recorded, in Balochistan 141, in GB 67 individuals had died whereas the lowest deaths occurred in AJK which were 61.\nAfter tireless strides since the first coronavirus case reported in the country a total of 2,559,261 tests were conducted so far. Around 735 hospitals were equipped with COVID-19 facilities with 1,083 patients admitted across the country.",
  "retrievedAt": "2025-08-11T19:43:56.374Z"
}
