{
  "title": "President directs Pakistan Post to appoint disabled staffer’s son within 45 days",
  "link": "https://www.app.com.pk/national/president-direction-pakistan-post/",
  "date_published": "2020-08-28T11:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 28 (APP): President Dr Arif Alvi has directed the Pakistan Post to recruit the son of a disabled employee within 45 days, rejecting the department’s plea and reprimanding it for unnecessarily complicating the routine procedure on frivolous excuses.\nA resident of old Sukkur and retired employee of the Pakistan Post had lodged a complaint with the Wafaqi Mohtasib against the rejection of his request for his son’s appointment by the Pakistan Post department against the quota of retired and disabled employees on the pretext of him being overage by seven months and 16 days.\nTaking exception to the extraordinary delay in resolving the matter, the President rejected the representation of the agency with a note of disappointment.\nEven the Pakistan Post had also made the representation after expiry of the 30-day time limit, he noted.\n“A routine procedure has been made complicated on a frivolous excuse and that too to reject a matter of service of son of a disabled person,” the President said.\nComplainant Muhammad Shahid S/o Hakmat Khan had been retired from service of the Agency on January 29, 2019 on the recommendation of a medical board, following which he applied for appointment of his son on the employees’ children quota.\nIn response to the agency’s objection, the complainant submitted copy of CNIC of his son showing his date of birth as “07-07-1988” and also referred to the Establishment Division rules allowing five-year age relaxation.\nThe agency’s representative could not produce any justification regarding delay in appointment of complainant’s son on contract basis in the light of the above mentioned documentary justification provided by Muhammad Shahid.\nThe President referred the case to Director General, Pakistan Post to consider the case of the complainant for contractual appointment of his son.\n“Such attitude must be discouraged,” the President said and directed the Pakistan Post to submit a report as to how many employment have been given to children of disabled employees and what were they doing to bring them up to the legal age.\nHe directed the Pakistan Post to ensure compliance and give employment to the complainant’s son within 45-days.\nHe said the policy of the federal government regarding employment of children of retired employees was a humanitarian initiative which needs to be implemented in the same spirit.\nThe President also rejected as “misconceived” the agency’s objection to Wafaqi Mohtasib’s jurisdiction as the matter pertained to agitated discriminatory treatment and arbitrary application of relevant law/policy by the agency which fall within the ambit of maladministration, defined vide Article 2 of P.O. No.1 of 1983.",
  "retrievedAt": "2025-08-11T19:43:43.871Z"
}
