{
  "title": "Ministers for strengthening edible oil sector",
  "link": "https://www.app.com.pk/national/ministers-for-strengthening-edible-oil-sector/",
  "date_published": "2023-10-06T17:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 06 (APP):Federal Caretaker Minister for Industries and Commerce Gohar Ijaz and Provincial Minister for Industries and Commerce SM Tanveer chaired a meeting here to focus on strategies to curtail the import expenditure on edible oil while augmenting the production of oil-based products.\nAs per a DGPR handout issued on Friday, the meeting reviewed various proposals with a unanimous commitment to collaborative action in achieving the set targets.\nAddressing the meeting, Federal Minister for Industry and Commerce Gohar Ijaz emphasized the caretaker government’s resolution to harness the agricultural potential of the nation. He underscored that fair compensation for farmers’ toil would drive an upsurge in the country’s exports.\nHe assured that the government would staunchly safeguard the interests of farmers, highlighting the willingness of oil farmers to allocate the necessary acreage for commodity cultivation. He urged close coordination between the Dalda Board and the Punjab government in identifying suitable areas for oilseed cultivation.\nGohar Ijaz stressed that elevating local oil production is imperative, affirming that collective endeavors would render edible oil exportable. He concluded with an encouraging note, emphasizing that progress comes to those who relentlessly strive forward.\nProvincial Minister for Industry and Commerce SM Tanveer in his address acknowledged the diligence of Pakistan’s scientists, farmers, and citizens but lamented the lack of an efficient system. He pointed out that 58 small dams in the Pothohar region lie dormant, and the Greater Canal Thal project remains idle, with machinery gathering rust.\nSM Tanveer shared that an intensive effort is underway to draft a 10-year master plan for agricultural sector development, with a comprehensive roadmap expected before the upcoming elections.\nHe highlighted the government’s all-out mobilization to combat smuggling, foreseeing a potential industrial renaissance once smuggling is curtailed.\nTanveer stressed that the nation spends a significant $5 billion annually on edible oil imports, a gap that the oil industry aims to bridge by escalating commodity production. The business community pledged its unwavering support to the government’s pursuit of self-sufficiency.\nThe department of Agriculture officials presented an extensive briefing on the measures taken to augment oilseed production.\nThe meeting was attended by Chairman Dalda Board, CEO Board, Board Members, DG Extension Agriculture, DG Industries, DG Research, Chief Scientists, Agronomists, and concerned officers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:58:53.410Z"
}
