{
  "title": "KSRelief to donate 50,000 shelter NFIs, winter kits to Pakistani citizens",
  "link": "https://www.app.com.pk/national/ksrelief-to-donate-50000-shelter-nfis-winter-kits-to-pakistani-citizens/",
  "date_published": "2023-10-06T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 6 (APP): King Salman Humanitarian Aid and Relief Center (KSrelief) has initiated a vital project aimed at distributing 50,000 kits including 25,000 shelter NFls (Non-Food Items) and 25,000 winter kits across Pakistan.\nThe project is planned to be implemented in four phases providing help to individuals who have been affected by recent floods and need assistance. This collaborative effort is being conducted in partnership with the National Disaster Management Authority (NDMA).\nSpeaking on the occasion, chief guest Caretaker Federal Minister for Religious Affairs and Interfaith Harmony Aneeq Ahmed thanked the Saudi Ambassador for providing 25,000 Shelter NFls (Non-Food Items) and 25,000 winter kits across Pakistan and said that both countries enjoy strong bilateral relations.\n“He said that somebody said that we are like brothers. We are not like brothers. We are brothers”, he added.\nSaudi Ambassador to Pakistan Nawaf bin Said Al-Malki, speaking on the occasion said that the Kingdom of Saudi Arabia is handing over fifty thousand kits as a gift to the brotherly country. This winter aid will be distributed in four phases in all provinces of Pakistan.\nThis gift is presented through the King Salman Humanitarian Aid and Relief Center which is at the forefront in the service of humanity. The King Salman Relief Center office in Pakistan also performs noble services to the brotherly country of Pakistan and its people standing by them through thick and thin, he added.\nThe Envoy further said “ I would like to make sure to our Pakistani brothers the firm commitment of the Government of the Kingdom of Saudi Arabia to always stand by our Pakistani brothers to take our brotherly relations to new heights.\nIn the first phase of the winter package, KSRelief distributed a total of 25,000 winter kits across three provinces. These kits will be strategically allocated as follows: In Khyber Pakhtunkhwa (KP), we aim to provide 11,000 kits to communities residing in five districts, including Chitral Upper, Chitral Lower, Dir Upper, Kohistan Upper, and SWAT Upper. Meanwhile, in the province of Baluchistan, 8,000 kits will be dispatched to areas encompassing Kalat, Surab, Killa Saifullah, and Ziarat.\nFurthermore, in the coldest region of Gilgit Baltistan, 6,000 kits will be distributed, catering to the needs of Ghizer, Astor, and Gupis Yasin.\nThese essential packages encompass a total of 50,000 Polyester Quilts and 25,000 winter kits, thoughtfully designed to include warm shawls for both men and women, as well as clothing tailored to keep children and adults warm during the cold winter months.\nThis project will be executed with utmost transparency, in close collaboration with key stakeholders including NDMA, UN missions, and provincial government authorities.\nThis collaborative effort aims to ensure that the benefits of this project reach well over 350,000 individuals in need.",
  "retrievedAt": "2025-08-11T09:58:56.278Z"
}
