{
  "title": "Speakers stress Pakistan to adopt regional approach, actively participate in multilateral forums",
  "link": "https://www.app.com.pk/national/speakers-stress-pakistan-to-adopt-regional-approach-actively-participate-in-multilateral-forums/",
  "date_published": "2023-10-06T11:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 06 (APP): The Speakers at the two-day ISSI Conference stressed the need for Pakistan to adopt a regional approach and actively participate in regional multilateral forums and institutions to enhance its influence amidst the changing global order.\nThe Centre for Afghanistan Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with the United States Institute of Peace (USIP), hosted a two-day International Conference on “Navigating Peace & Security in the Region & Beyond: Pakistan’s Role.”\nThe first working session, titled, Building Sustainable Peace in Afghanistan was moderated by Amina Khan, Director CAMEA. The speakers included Ambassador Mansoor Ahmad Khan, former Ambassador of Pakistan to Afghanistan, Nargis Nehan, Former Afghan Minister for Mines, Ambassador Omar Samad, Non-Resident Senior Fellow Atlantic Council, Washington DC, Graeme Smith, Senior Consultant for Crisis Group’s Asia Program, International Crisis Group and Asfandyar Mir, Senior Expert South Asia Programs, USIP.\nThe speakers were of the view that economic isolation, sanctions, the Taliban`s ideological rigidity, large-scale migration, and proliferation of terrorist groups are major challenges in post-US/NATO Afghanistan. The great power competition, internal power struggles, regional fault lines, and ethnic clashes, further aggravate these challenges.\nIt was also said that peace is not only the absence of war, but also the presence of development, prosperity and an open society, which are all absent in Afghanistan today. She also said that Afghanistan’s conflict has domestic, regional and international dimensions and for sustainable peace, there needs to be consensus for a political pathway.\nIt was agreed that Pakistan and Afghanistan could do more on the new and old issues by negotiations, bilateral talks and cooperation. It was further said that both states have issues that bind them together more than ever and on the economic side, connectivity, transit and other topics have broader scope.\nIt was also emphasized that human life in Afghanistan has a greater value than politics. A really fragile equilibrium has emerged as the Afghan economy stopped shrinking. Humanitarian organizations are disappointed due to the Taliban`s refusal to compromise their heterodox vision of cultural and religious purity, especially on gender issues.\nSpeakers also highlighted that the issue of terrorism lies at the intersection of both internal and external challenges to peace in Afghanistan. There are concerns and anxiety in Washington and Islamabad regarding the Taliban’s growing alignment with terrorist groups, especially Al-Qaida and TTP.\nThe second working session titled, “Building Regional Peace: Pakistan, The Middle East and Beyond” was moderated by Hamayoun Khan, Program Advisor, Fredrich Ebert Stiftung (FES) Pakistan. Speakers of the session included Dr Sayed Kazem Sajjad Pour, Distinguished Fellow, The Institute for Political and International Studies (IPIS), Iran, Dr Muhammet Kocak, Professor, Social Sciences the University of Ankara Institute for Area Studies, Turkiye, Dr. Ali Bakir, Professor, Ibn Khaldon Centre for Humanities and Social Sciences, Qatar University Doha, Dr. Wafaa Alaradi, Associate Professor, Political Science Department, Kuwait University, and Ambassador Riffat Masood, Pakistan’s Former Ambassador to Iran.\nSpeakers emphasized the importance of Pakistan’s engagement in managing its role amidst the changing global order. They stressed the need for Pakistan to adopt a regional approach and actively participate in regional multilateral forums and institutions to enhance its influence.\nThe primary emphasis was on the fact that as the international system experiences substantial transformations, the interactions between regional players like Iran, Saudi Arabia, Turkiye, Pakistan, and India will not only impact the region but also the global landscape.\nFurthermore, the speakers acknowledged the diverse challenges, including traditional and non-traditional security concerns that regional countries are facing. The speakers underscored the responsibility of regional powers to play a pivotal role in bringing peace to the region, with a focus on addressing longstanding issues and fostering cooperation.\nAdditionally, they recognized the economic, environmental, and social challenges that require attention and urged governments to align their policies with the pursuit of peace while advancing national interests.\nLastly, Pakistan’s unwavering commitment to promoting peace and stability, prioritizing economic development, and fostering positive relations with neighbouring countries in the context of a rapidly changing global environment was also stressed.\nThe third working session titled, “Pakistan and the United States: Strengthening Bilateral Cooperation” was moderated by Hamza Ijaz, Senior Program Officer USIP, Pakistan. The speakers included Dr. Asad Majeed Khan Former Foreign Secretary of Pakistan; Michael Kugelman, Director of South Asia Institute at the Wilson Institute, Washington DC, Adam Weinstein, Deputy Director of the Middle East Program, Quincy Institute of Responsible Statecraft, Washington DC, and Dr. Daniel Markey, Senior Advisor South Asia Programs, USIP.\nThe speakers elaborated upon the challenges as well as strengths of US-Pakistan relations. They were of the view that, despite challenges, Islamabad-Washington ties have been resilient enough to thrive and it is due to this history that both countries have collaborated in various partnerships over the years.\nThey underlined how the regional instability and, political and economic instability in Pakistan, could serve as a challenge in the bilateral ties. They opined that there was a gap between the strategic preoccupations of the US and Pakistan and hence a closer strategic alignment did not appear feasible at this point.\nHowever, the speakers agreed that US-Pakistan relations, though downgraded, were not in any crisis, which was a positive indicator. They argued that there was scope for enhanced cooperation in areas such as trade and investment, climate change, clean energy, educational exchanges, and people-to-people contacts.\nThe pressure points of the relations between Washington and Islamabad included India’s positioning as a ‘net security provider’ in the ‘Indo-Pacific’ Strategy. They reiterated that there was a need to free US-Pakistan relations from the lens of third countries; India, China, Russia or Afghanistan. There was also a need for the two countries to set a new tone for the relations in this era and suggested developing a new attractive narrative of Pakistan.",
  "retrievedAt": "2025-08-11T09:58:57.564Z"
}
