{
  "title": "AJK to commemorate 18th anniversary of Oct. 8 earthquake",
  "link": "https://www.app.com.pk/national/ajk-to-commemorate-18th-anniversary-of-oct-8-earthquake/",
  "date_published": "2023-10-06T14:07:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK): Oct 06 (APP) :: In Azad Jammu Kashmir all is set to commemorate the 18th Anniversary of history’s worst deadly earthquake of October 8, 2005, on Sunday with due feelings of seriousness, respect and determination as the National Disaster Awareness Day with the glowing tributes to be paid to the martyrs and other victims of the history’s first-ever most-worst deadly catastrophe in the region.\nA grand ceremony to be hosted by the Kashmir Orphan Relief Trust (KORT) and Educational Complex Mirpur AJK, in Swabi on October 8 evening.\nKORT, which houses hundreds of children who had fallen orphaned and shelterless in the deadly earthquake will be the hallmark of the Anniversary.\nThe ceremony will begin at 6.00 a.m. on Sunday in Swabi, said Ch. Akhter, the founder of the KORT, the largest shelter home in South Asia, housing over 450 orphan and shelterless children – mostly those who were rendered homeless and orphan following the killer earthquake in Muzaffarabad and various adjoining parts of AJK and KPK.\nTalking to APP here Friday, Akhtar said that the grand ceremony to pay rich tributes to the victims of the catastrophe will be attended among others by the dignitaries – besides social workers, volunteers and heads of various nation-building institutions will attend to observe the anniversary with due respect and prayers for the victims of the devastating calamity.\nThis year Mirpur city of AJK will observe the anniversary of when it met the same fate in the form of Sept. 24, 2019, devastating earthquake of moderate magnitude measuring 5.8 on the Richter scale that left at least 45 people dead and over 1000 injured besides huge damaging of the buildings across Mirpur city and adjoining areas of Jatlaan leaving hundreds of thousands of the people shelter less badly affecting the daily life.\nThe anniversary will be observed as the national day of awareness about safety from the national disasters to mark the 18th anniversary of the calamity as a ‘day of firmness and determination for reconstruction – in memory of earthquake martyrs’ coupled with special prayers for the rest of the departed souls of the quake victims in eternal peace and to express complete solidarity and sympathies with the survivors of the history’s worst natural catastrophe.\nThe day will dawn with special prayers in the mosques at Fajr across AJK for the departed souls of the earthquake victims. It will be a gazetted holiday throughout AJK State.\nA major ceremony to mark the day will be held at the capital city of Muzaffarabad, with the sign of deep-rooted love and affection by the government and the people of Pakistan as well as the national and international NGOs and brotherly foreign countries who contributed their exceptional share for the rebuilding and rehabilitation of the quake-hit zone of AJK, the State Disaster Management Authorities sources told APP.\nBesides, special functions in various parts of AJK to pay glorious tributes to the victims of the killer catastrophe and to raise awareness among the people about the adoption of per-cautionary measures to avert losses in case of any natural catastrophe, will be the hallmark of the 18th anniversary of the deadly earthquake which had turned bulk of AJK into rubble this day 18 years ago”, the sources added.\nIn Mirpur, the major ceremony will be held where fateha Khawani will be offered for the martyrs and simultaneously with the rest of the country sirens was blown at 8.52 a.m. and two minutes silence will be observed in the mourning of the victims of the catastrophe at a ceremony to be started at Quaid-e-Azam Cricket Stadium in the morning of October 8, local authorities said when contacted here on Friday confirmed about the programs of the anniversary of deadly catastrophe in all three districts of Mirpur division including Mirpur, Kotli and Bhimbher districts.\nConcerned district authorities in all three districts of the Mirpur division are giving the final touches to the programs for the anniversary in the division.\nSeveral of the mega Development Projects of public welfare have been completed in the AJK State metropolis in the wake of the broad-based phased plan to rehabilitate the AJK metropolis on the latest grounds comprising modern civic and other infrastructural facilities.\nSimilar special ceremonies including walks for awareness, seminars and symposiums will also be held in all other parts of AJK in memory of the martyrs of the devastating quake which left over 75 thousand people dead and lakhs of others injured in Khyber Pakhtunkhwa and Azad Jammu & Kashmir.\nThe ceremonies will be attended by people representing all walks of life including social and political workers, lawyers, journalists and members of the business fraternity to pay glorious tributes to the victims of history’s worst catastrophe this day 18 years ago in 2005.",
  "retrievedAt": "2025-08-11T09:58:36.777Z"
}
