{
  "title": "Political forces should sign CoE for stable country :  Mandviwalla",
  "link": "https://www.app.com.pk/national/political-forces-should-sign-coe-for-stable-country-mandviwalla/",
  "date_published": "2023-10-06T13:22:00.000Z",
  "source": "APP",
  "content": "MULTAN, Oct 06 (APP): Chairman Senate Standing Committee on Finance & Revenue, Saleem Mandviwalla on Friday said mainstream political parties should come forward to sign Charter of Economy (CoE) which was the dire need of the hour.\nHe said it was imperative for a stable Pakistan which would eventually help tackle challenges on the economic front, besides ensuring the interests of people.\nAddressing a news conference with PPP leaders Khawaja Rizwan Alam, Ali Qasim Gilani and others at Multan Press Club , he stated that inflation was at its peak and there was a need to bring rates of commodities down to ensure relief for people.\nThe Senator said that he had met Faisalabad and Multan business community on Thursday adding their issues would be resolved on priority.\nHe noted that Pakistan People’s Party wanted general elections on time and added that PPP co-chairman Asif Ali Zardari and he were meeting with the business fraternity to find solutions to the economic woes of the country.\nReplying to a question, the Senator said that whosoever party assumed power after the elections, should act upon CoE.\nHe said that the masses would decide who should be the winner in the election.\nEarlier, speaking to the executive committee at Multan Chamberof Commerce & Industry (MCCI) late on Thursday night, he said that businessmen were the most important people of the country.\nHe said though the standing committee had an oversight role for the govt departments, even then it took up issues of the business community and got them resolved.\nMandviwalla announced that the committee would take up the Model Customs Collectorate issue and would get it restored for both appraisement and enforcement soon.\nThe Senator said that  FBR’s Alternative Dispute Resolution Committees(ADRCs) would be made functional soon adding that cess did not fall in the purview of federal governments rather it was a matter of provincial governments.\nHe foresaw that the dollar would settle around Rs 250 in the country. In his welcome address, president  MCCI, Mian Rashid Iqbal highlighted host of issues the business community of Multan was facing.\nHe stated that the industrial sector was undergoing troubled times and it was unwise to end the subsidy on export-oriented units adding that the subsidy should continue.\nVice president MCCI, Sheikh Asim Saeed presented a vote of thanks to visiting dignitaries.",
  "retrievedAt": "2025-08-11T09:58:56.834Z"
}
