{
  "title": "2-Day int’l conference on Social Science Kicks off at NUML",
  "link": "https://www.app.com.pk/national/2-day-intl-conference-on-social-science-kicks-off-at-numl/",
  "date_published": "2023-10-11T11:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):First 2-day International Conference on Social Sciences (ICoSS-2023) with the theme “Reconsidering Social Sciences Paradigms for Global Citizenship & Sustainable Development” organized by the faculty of social sciences, kicked off at the National University of Modern Languages (NUML) on Wednesday.\nThe chief guest of the inaugural session was the caretaker federal minister for Religious Affairs and Interfaith Harmony Mr. Aneeq Ahmed, while Prof. Dr. Nasir Mahmood Vice Chancellor Allama Iqbal Open University was the keynote speaker.\nThe Rector NUML Major General (Retd) Muhammad Jaffar, Director General NUML Brig Shahzad Munir, Pro Rectors, Deans, Directors, guest speakers, faculty members and students also attended the session.\nSpeaking on the occasion federal minister Aneeq Ahmed said that according to Quran seeking knowledge is obligatory for Muslims and it is time to differentiate knowledge and information. Human psychology is the main topic of the Quran, and the Quran encourages self-reflection, mindfulness, and self-control.\nHe said that we are facing many issues, and we can only tackle those with knowledge. Minister was of the view that Islam teaches its followers, a peaceful coexistence with other societies and it is our duty to follow the life of Holy Prophet Muhammad SAWW.\nThe keynote speaker VC AIOU Prof. DR. Nasir Mahmood in his address highlighted the social science paradigms and elaborated the total concept of the conference in detail.\nEarlier, Rector NUML Major General (Retd) Muhammad Jaffar welcomed the honourable chief guest, keynote speakers and thanked all the worthy guests for attending the conference.\nHe said that this conference has gained more relevance in prevailing challenges.\nHe hoped that in the conference’s productive discussions, some workable solutions would be produced to construct bridges across nations and diverse cultures.\nIt is important to mention that along with national, scholars from USA, UK, Malaysia and Canada will participate online.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:02:28.588Z"
}
