{
  "title": "Catastrophic nationwide floods in 2022, floods in Punjab, climate change a timely topic: Bilawal Bhutto",
  "link": "https://www.app.com.pk/national/catastrophic-nationwide-floods-in-2022-floods-in-punjab-climate-change-a-timely-topic-bilawal-bhutto/",
  "date_published": "2023-10-11T18:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):Chairman Pakistan People Party (PPP) Bilawal Bhutto Zardari Wednesday said the catastrophic nationwide floods in 2022 and the recent floods in Punjab, climate change is a timely topic.\nHe was addressing a seminar on ‘The Urgency of Action: Climate Change and its implications on Human Rights in Pakistan’ hosted by the PPP Human Rights Cell  via video-link .\nAddressing the audience, he reminded us of the gravity of our shared responsibility. While we represent our party, these challenges transcend party lines. They resonate with every person who calls Pakistan home and in many ways, every inhabitant of our planet. We are living in an age of unparalleled change and nowhere is this change more palpable than in the realms of climate and societal structures. These two might seem distinct at the outset but they are intrinsically linked, forming the very fabric of our current challenges.\nHe said that Pakistan, with its vast landscape and rich history is sadly an epicenter of the climate crisis. The evidence is clear and cannot be ignored, adding that the glaciers of the north are receding at alarming rates. The south’s fertile land is giving way to desertification. These are not just climate calamities but stories of families and communities of the nation’s fabric being torn apart, where erratic weather spells destroy harvests, relentless floods ravage our homes.\nHe said that the heartbeat of our nation, of the common man and woman that suffer the most. Let us pause and consider, is it not rather limiting to view this issue as that of melting ice and shifting sands, when this crisis at its core is about the countless people who stand to lose their rights, hopes and futures, the same goes for the marginalised communities who have been pushed further into the peripheries as well as the youth which is inheriting a world that is vastly different.\nHe said that our party, has a proud history of being the torchbearer of human rights. Today, I implore you to expand your understanding of these very rights. Access to clean air, safe drinking water and a stable are not luxurious but basic human rights as essential as the freedom of speech, the promise of a good education and the assurance of a fair trial.\nWith this expanded understanding, the Pakistan Peoples Party makes the following commitments:\n1. Harmonising climate policies with human rights: We will not just draft policies but create holistic solutions. Every environmental measure will inherently prioritise the well-being and rights of the people.\n2. Empowering the voiceless: No longer will the most vulnerable communities be passive observers but will play an active and important role in shaping decisions and charting the path forward.\n3. Driving the Green Revolution through jobs: As a pivot to a greener and more sustainable future, we pledge to ensure that the youth is at the forefront of this transformation. They will play an important role in shaping decisions and charting the path forward.\nOur vision does not stop here. We must invest in education that emphasises the importance of sustainability. We need infrastructure that is resilient to the challenges of the future. We must foster international partnerships because the battle against climate change is not one nation’s fight but collective endeavour.\nWe envision a nation where the well-being of its land and people are given equal importance and opportunity to live their lives to the fullest possible extent. Let’s shape the future of Pakistan and by extension, our world, together, Chairman Bilawal resolved.\nThis is our message on the issue of human rights and climate, but while we speak, we do not just speak of a rhetoric. We have an example to show the people of Pakistan where we have delivered on this rhetoric in the shape of projects. We have the Sindh’s ‘Apni Zameen Apna Makaan’ programme which is reconstructing the 2.1 million homes destroyed due to climate catastrophes.\nWe are not only providing homes but also ownership of the land to the women of the households to empower them. Hence, we are not only providing shelter to these families but also empowering them. We are including women’s empowerment in our initiatives. We wish to take this initiative across the country so that the victims of climate change are provided not only with climate-resilient reconstruction to help reconstruct their lives but also development initiatives that communities, families but more importantly empower women while we are building a more sustainable future.\nThe conference was attended by the President of the PPP Human Rights Cell, Farhatullah Babar, former federal minister for Climate Change and Vice President PPPP Senator Sherry Rehman, General Secretary Human Rights Cell PPP Syeda Malaika Raza, General Secretary PPP Punjab Syed Hassan Murtaza, PPP Central Secretariat In-charge Sibtul Hassan Bukhari, Advocate Shakeel Abbasi who also spoke on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:02:14.126Z"
}
