{
  "title": "Don’t see any possibility of delay in polls: PM",
  "link": "https://www.app.com.pk/national/dont-see-any-possibility-of-delay-in-polls-pm/",
  "date_published": "2023-10-11T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday ruling out the possibility of any delay in general elections, said that the polls would be announced and conducted on time.\n“I don’t see any possibility (of delay in elections). I don’t have any confusion at all. I feel the elections will be announced and conducted on time,” the prime minister said in an interview with a private television channel.\nReiterating his government’s resolve to hold free and fair elections, he said all the registered political parties had legal and constitutional rights to canvass, mobilize people and attract public support.\nHowever, he said the government would not be responsible if someone was legally barred from the political process.\nTo a question, he emphasized effective law enforcement saying that his government, with the cooperation from military leadership, had implemented the existing laws to crack down the illegal currency businesses and hoarders. He also called for the capacity building of the civilian institutions for the implementation of the law.\nThe prime minister said the establishment of the democratic system within the political parties was essential for democracy in the country.\nTo a question, he said being a political player, he had interacted with all political leaders before assuming the office but never thought of joining any party, though being a citizen, he had the right to join a party or form his own.\nRubbishing the allegations of the caretaker government’s tilt towards the PML-N, he said the political parties usually create such impressions before the elections with a view to attracting public support.\nPrime Minister Kakar appreciated the leadership qualities of Chief of Army Staff General Syed Asim Munir and said that Pakistan’s future was in capable and committed hands.\nTo a question, he said he was comfortable with the military leadership and that the caretaker government had the final say in the decision-making.\nAsked whether Nawaz Sharif was victimized, the prime minister said the questions were always raised about the judicial interventions as different parties had varying views on the respective subjects.\nComing to the cipher issue, Kakar said it was a state’s property, and exposing it for other than the prescribed usage was unjustified, though the court has yet to ascertain its illegality.\nThe prime minister said in the 2013 and 2018 elections, he had voted for PTI to seek solutions for the country’s issues like infrastructure, economy, foreign policy and branding of Pakistan, not for attacking the GHQ.",
  "retrievedAt": "2025-08-11T10:01:53.170Z"
}
