{
  "title": "OIC’s special envoy asks India to reverse illegal change of Jammu & Kashmir’s status",
  "link": "https://www.app.com.pk/national/oics-special-envoy-asks-india-to-reverse-illegal-change-of-jammu-kashmirs-status/",
  "date_published": "2023-10-11T10:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): The Organization of Islamic Cooperation’s (OIC) Special Envoy on Jammu and Kashmir, Yousef M Al-Dobeay on Wednesday demanded India to reverse its illegal and unilateral action of changing the autonomous status of J&K and grant the people of the valley their due rights.\nIn a joint press stakeout along with Foreign Secretary Syrus Sajjad Qazi here at the Ministry of Foreign Affairs, the visiting OIC envoy said the OIC would continue to support Kashmiris for their right to self-determination.\nThe OIC’s Special Envoy is in Pakistan and will also visit Azad Jammu and Kashmir to undertake a first-hand assessment of the human rights and the humanitarian situation in the valley.\nYousef Al-Dobeay expressed concern over the illegal and unilateral actions taken by India on August 5, 2019, that turned the Kashmiris into a marginalized minority.\nHe said his visit to AJ&K was about getting knowledge about the factual and on-ground situation in the valley ahead of the upcoming 15th OIC Islamic Summit to be held in Gambia this December.\nHe mentioned that Jammu and Kashmir was an old agenda at the platform of OIC, where the organization from time to time strongly condemned the human rights situation in the Indian-held Kashmir.\nThe OIC envoy recalled that the OIC Contact Group on Jammu and Kashmir that met on the sidelines of the 78th session of the United Nations General Assembly in New York in September reaffirmed the inalienable right to self-determination of the people of J&K.\nHe said the meeting also expressed deep concern over the persistent curbs on the fundamental rights and freedom of the people in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe OIC envoy appreciated the government of Pakistan in highlighting the issue of Jammu and Kashmir at the international fora and expressed the OIC’s resolve of its continued support to the cause.\nForeign Secretary Syrus Sajjad Qazi said the meeting with the OIC envoy focused on a comprehensive discussion on the Jammu and Kashmir dispute and the ongoing human rights violations committed by India in IIOJK.\nHe said the OIC envoy will visit the Line of Control (LoC) where he will receive a briefing on the on-ground situation. He would also interact with the Kashmiri representatives to gain a better understanding of their plight, he added.\nThe foreign secretary mentioned that OIC’s Special Envoy on Jammu & Kashmir was tasked with a significant mission.\n“He serves as a vital bridge with the OIC General Secretariat, OIC mechanisms like the Independent Permanent Human Rights Commission (IPHRC) and Islamic Development Bank, OIC Contact Group on Jammu & Kashmir, broader membership of the OIC, other regional and international organizations and the international community, on matters relating to the Jammu & Kashmir dispute, he added.\nHe said the curbs on fundamental rights and freedoms of the Kashmiri people remained persistent. He pointed out that the entire Hurriyat political leadership – the genuine voice of the Kashmiri people – had been arbitrarily incarcerated for the past several years.\nThe total number of detained political activists and human rights defenders comes to around 4,000, he added.\nHe mentioned that the Indian authorities had sought the death penalty for one of the most renowned Kashmiri leaders, Yaseen Malik, who was awarded a life sentence, last year. Another Kashmiri leader, Shabbir Ahmed Shah, has spent over half of his 70 years’ life in jails, he added.\n“India’s unilateral and illegal actions of 5 August 2019 have opened a new chapter of oppression. The ultimate aim of these steps is to convert Kashmiris into a disempowered minority in their own land,” he said.\nHe said Pakistan expressed gratitude to OIC for its profound support to the Kashmiri people through its resolutions demanding a lasting solution to the J&K dispute.\nThe OIC Special Envoy Yousef M Al-Dobeay is visiting the region under the OIC Plan of Action on Jammu and Kashmir. Earlier, he visited the region in November 2021 accompanying the OIC Secretary General and in March 2020.",
  "retrievedAt": "2025-08-11T10:02:09.937Z"
}
