{
  "title": "Federal Cabinet calls for immediate halt of Israel’s bombing on Gaza: Solangi",
  "link": "https://www.app.com.pk/national/federal-cabinet-calls-for-immediate-halt-of-israels-bombing-on-gaza-solangi/",
  "date_published": "2023-10-11T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi on Wednesday said the Federal Cabinet had called for an immediate halt to Israeli bombardment of civilian areas of Gaza, in addition to lifting of blockade for the provision of relief items to the civil population.\nHe said the Cabinet meeting, presided over by Caretaker Prime Minister Anwaar-ul-Haq Kakar, also called for prompt measures to allow international aid to reach the civilians in the Gaza.\nAddressing a news conference along with Minister for Privatization Fawad Hassan Fawad, he said the forum strongly condemned Israel’s bombardment, particularly targeting civil population in Gaza besides expressing concern over the volatile situation, stemming from Israel’s illegal occupation, oppression of Palestinians for decades, and blatant violations of United Nations Security Council Resolutions in this regard.\nThe Federal Cabinet stressed that the issue of Palestine should be resolved in accordance with relevant UNSC resolution, he said, adding it also called for the restoration of pre-1967 status of Palestine.\nHe said the Federal Cabinet reiterated Pakistan’s principled stance for the resolution of the Palestine issue in line with the aspirations of its people.\nSolangi said the forum reiterated the proposal for the establishment of an independent Palestinian state with its borders predating Israel’s illegal occupation in 1967 as well as Bait-ul-Quds (Jerusalem) as its capital.\nHe said the prime minister had directed the federal ministers to undertake only essential foreign visits.\nThe Federal Cabinet had approved the appointments of former Lahore High Court judge Sohail Nasir as Deputy Chairman of NAB and Syed Ehtesham Qadir Shah as NAB Prosecutor General Accountability, he added.\nIn the Cabinet meeting, he said the approval was also accorded to the proposal of hiring services of the Consortium for Financial Advisory for the Pakistan International Airlines’ (PIA) privatization.\nOn the recommendation of the Ministry of Foreign Affairs, he said the Cabinet had approved the receipt of the PLA Commemorative Award Medal from China to Brigadier Shahid Amir for his services for the promotion of Pakistan-China relations.\nThe minister said on the recommendation of the Ministry of Interior, the Cabinet approved the extradition of Pakistani citizen Shahzad Ahmed S/o Wali Muhammad Qureshi to the United Arab Emirates in a fraud case. Similarly, approval for extradition Arshad Ali S/o Mazhar Ali to Kuwait was also given during the meeting.\nHe said both the accused would be extradited to these countries in line with the extradition agreements signed by Pakistan with them.\nSolangi said the Cabinet had ratified the decisions made during the Economic Coordination Committee meeting held on October 3, 2023.\nLikewise, the decisions taken in the meetings held on January 21 and 28 regarding the State-Owned Enterprises were also ratified by the cabinet, he added.\nNo action was being taken against Afghan citizens who had Proof of Registration Cards and residing in Pakistan for the last 40 years, he said, while responding to a query.\nHe said the government would not take any action against those who had Afghan citizen cards that were verified by the previous Afghan government.\nThe deadline of October 31 for voluntary return was only applicable to those individuals who did not possess any legal document, he said adding thousands of illegal residents had started returning to their countries.\nTo another query, he said the electoral history of the country suggested that polls were held in extreme cold and hot weather.\nElections would be held as per the schedule, issued by the Election Commission of Pakistan, he said, adding the caretaker government would provide all-out assistance to the electoral body in this regard.",
  "retrievedAt": "2025-08-11T10:02:00.465Z"
}
