{
  "title": "Tyrian White Case: IHC forms larger bench to hear case against Imran",
  "link": "https://www.app.com.pk/national/tyrian-white-case-ihc-forms-larger-bench-to-hear-case-against-imran/",
  "date_published": "2023-02-02T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 02 (APP): Chief Justice Islamabad High Court (IHC) Aamer Farooq on Thursday formed a larger bench to hear a petition seeking the disqualification of Pakistan Tehreek-e-Insaf Chairman Imran Khan for concealing information about his alleged daughter Tyrian White in his nomination papers submitted to the Election Commission of Pakistan.\nThe IHC resumed hearing today, filed by a citizen Sajid Mehmood seeking the disqualification of Imran Khan under article 62(i)(f) of the Constitution.\nThe counsel for Imran Khan, Salman Akram Raja, couldn’t appear before the court due to engagements in the top court.\nThe associate lawyer said that the reply had been submitted to the court on the behalf of Imran Khan.\nThe chief justice noted that Imran Khan had stated in his reply that he ceased to be a member of Parliament, therefore the court could not proceed against him.\nHe also added that the furnished affidavit [of Imran Khan] against which the case was filed belonged to 2018.\nThe chief justice noted that an objection was also raised against the IHC’s bench hearing this case. He remarked that he had not recused as one of the judges hearing the same case in 2018 [filed by Abdul Wahab Baloch] on personal reasons, instead, the petitioner had then prayed to the court to fix the case before a certain bench.\nIt is pertinent to mention that Imran Khan had contested in his written reply, submitted before the court on Wednesday, that the incumbent chief justice could not hear the same case owing to his withdrawal back in 2018 [filed by a different petitioner].\n“It is established law that a judge who has once considered it improper to proceed with a matter on account of personal reasons may not then entertain the same matter,” the reply stated.\nMeanwhile, the chief justice said that he was forming a larger bench as the objection had been raised against him by the respondent.\nThe lawyer said that the ECP had de-notified his client after he resigned from the national assembly seat. He prayed the court to adjourn the case till March as there was no need to show haste in this particular case.\nAssociate lawyer Salman Abuzar Niazi said that they respect the honourable judge and they had just presented some information. The further hearing of the case was then adjourned till February 9.",
  "retrievedAt": "2025-08-11T05:53:58.450Z"
}
