{
  "title": "Religious scholars highlight Pakistan’s initiatives for religious freedom in IRF summit 2023",
  "link": "https://www.app.com.pk/national/religious-scholars-highlight-pakistans-initiatives-for-religious-freedom-in-irf-summit-2023/",
  "date_published": "2023-02-02T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP): A delegation of Pakistani religious scholars including the minority community representatives participated in the International Religious Freedom (IRF) Summit 2023 recently held in Washington D.C. United States (US) and highlighted Pakistan’s constructive initiatives for religious freedom.\nThe delegation comprised of Central Ruet-e-Hilal Committee Chairman Maulana Syed Abdul Khabir Azad, founder of Bilal Institute and eminent personality Allama Pir Shafaat Rasool Qadri, Pastor James Chanan, Kashif Mirza and Seemab Asif attended the summit while Interfaith Commission for Peace and Harmony Chairman Ambassador Imam Allama Ahsan Siddiqui participated virtually.\nThey were of the view that Pakistan had taken some significant initiatives for religious freedom, but unfortunately, they had not received much attention at international level.\nThey apprised the summit that Despite tens relations with India, Pakistan opened Kartarpur Corridor for the Sikh community from all over the world. It was the biggest project in this region regarding religious freedom and it should have been acknowledged and presented as an example in the US and other countries on the globe.\nThey said in recent years, Pakistan had introduced a single national curriculum for the first time for the five religions by engaging their religious leaders and creating separate curricula for Christians, Hindus, Sikhs, Parsis and even the Kailash community.\nReferring to the two judgments of the Supreme Court, the scholars said it was not easy to fight the extremist organizations and to protect the basic human rights of Ahmadi community, including the protection of their lives and property, and the release of Asia Masih but Pakistan as a state stood by it and paid a heavy price for freedom of religion.\nThe expressed their dismay over a resolution presented by the European Union to ban Pakistan’s exports to European countries and said Such debates on the one hand give justification to the extremist forces against the state and on the other hand those working for human rights and religious freedom also face difficulties.\nTalking to media, a minority representative said for the past several years, Pakistan, China, and some countries in the Middle East had been harshly criticized for issuing US Commission on International Religious Fredom’s annual report.\n“As in recent days, the US Secretary of State criticized other countries including Pakistan, China and some middle eastern countries, but completely ignored a country in South Asia and did not even mention the name. However, in the same report, there was a mention of the terrible situation with the minorities there.\n“Similarly, after the release of the recent BBC documentary regarding the neighboring country, the American government officials did not say a word of condemnation. Due to which many circles feel as if the American and Western nations use such reports for political causes.\nThey said there could be many problems in China, Iran and South Asia including Pakistan, but there were also many examples of tolerance and religious freedom. “Why do we ignore these good examples? why do they exaggerate an incident so much? And are there no such problems in the West?” they questioned proposing that with praise and support of good examples, we could further discuss the dimensions of mutual benefits.\nAllama Ehsan Siddiqui while talking to APP said institutions and organizations working on religious freedom should adopt a moderate attitude and should not indulge in any kind of politics.\nHe said there was a need to work together with mutual understanding instead of politics on all issues of human rights and religious freedom.",
  "retrievedAt": "2025-08-11T05:53:50.417Z"
}
