{
  "title": "ECP appoints DROs, ROs and AROs for conducting bye elections in 33 constituencies of National Assembly",
  "link": "https://www.app.com.pk/national/ecp-appoints-dros-ros-and-aros-for-conducting-bye-elections-in-33-constituencies-of-national-assembly/",
  "date_published": "2023-02-02T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 2 (APP): The Election Commission of Pakistan (ECP) on Thursday appointed District Returning Officer (DROs), Returning Officers (ROs) and Assistant Returning Officers (AROs) for conducting bye elections in 33 constituencies of National Assembly on March 16, said a notification issued here.\nAccording to a notification, District Election Commissioner, Swat, Farid Ullah, Election Officer Strong Room, Malakand, Muhammad Arif and Assistant Commissioner, Matta, Swat, Abdul Qayum, SDEO (Male), Matta, Swat Nazar Ul Islam have been appointed as District Returning Officer (DRO), Returning Officer (RO) and Assistant Returning Officer (ARO) respectively for conducting NA 04, Swat-III bye elections.\nDistrict Election Commissioner, Haripur, Shaukat Hussain; Election Officer, Haripur, Umer Salim, Assistant Commissioner, Haripur, Miss Labiqa Akram; Sub-Divisional Education Officer (Budget and Accounts), Haripur, Mumtaz Ahmed Khan would perform the duties of DRO,RO and ARO respectively in NA 17, Haripur-I.\nSimilarly, NA 18, Swabi bye elections would be conducted by District Election Commissioner, Swabi, Raham Zada; Election Officer, Swabi, Tanzeel Yasin, Additional Assistant Commissioner, Swabi Allah Nawaz Khan, AEDO (sports) Education OIfficer, Swabi, Irshad Khan would conduct the bye elections as DRO, RO and ARO respectively.\nSimilarly, the bye elections in NA 25, Nowshera-I would be supervised by Regional Election Commissioner, Bannu Division, Abdus Samad Khan; District Election Commissioner, Nowshera Muhammad Zahir Khan; Additional Assistant Commissioner-I Nowshera, Abdul Qayum; ADEO office of the District Education officer (Male) Nowshera Muhammad Yousaf Shah as DRO, RO and ARO respectively.\nLikewise, NA 26 bye election would be conducted by Regional Election Commissioner, Bannu Division, Election Officer, Kohistan Upper, Syed Hassan Raza; Additional Assistant Commissioner, Pubbi, Touseef Ur Rehman; SCT, GHSS, No 1, Nowshera Cantt as DRO, RO and ARO respectively.\nNA-32 by elections would be supervised by District Election Commissioner, Kohat Anwar Iqbal; Additional Assistant Commissioner-I, Kohat; Election Officer, Kohat, Muhammd Kareem, ADEO (P&D) Muhammad Tariq Awan as DRO, RO, ARO respectively.\nNA 38 bye elections would be conducted by Regional Election Commissioner, DI Khan Division Ijaz Ahmed; District Election Commissioner DI Khan Abdul Rauf Khan; Assistant Commissioner, DI Khan Farhan Ahmed; Head Master, GHS Budh, D IKhan Tariq Javed to act as DRo, RO and ARO respectively.\nNA-43 bye elections would be looked after by District Election Commissioner, Khyber, Shahid Ali ;election Officer, Bannu, Shahab Saddique; Additional Assistant Commissioner, Jamrud, Shahid Ali as DRO, RO and ARO respectively.\nThe bye elections in NA-52,53 and 54 would be conducted by Director PEC, IslamabadAbdul Wahid as DRO, while DEC Islamabad, Waqas Ahmed Malik has been appointed as RO, Assistant Commissioners, Industrial Areas, Saddar, Islamabad, DC, Islamabad, Ali Javed, Naib Tehsildar, Islamabad, SST In charge, Principal IMSB Khana Dak, Islamabad, Syed Azhar Abbas Shah, SST, IMCB, Islamabad, Umer Hayat; Naib Tehsildar DC, Islamabad Ch Manzoor Ahmed; Community Development officer , LG, RD, Islamabad Mazhar Ali; SST, IMSB, Koral, Islamabad Jamil Afzal to act as AROs respectively in three constituencies of federal capital.\nNA 57,59, 60,62 and 63 bye elections would be overseen by REC Rawalpindi Aleem Shahab as DRO and Additional deputy Commissioner (Revenue) Murree, DEC-I, Rawalpindi Roy Sultan Bhatty and DEC-II, Rawalpindi Mrs Shaheen Ghazal; Additional Deputy Commisisoner (G) DC, Rawalpindi; Election Officer, Attock, Robeel Zafar to work as ROs respectively and Assistant Commissioner Kotli Sattian, Farwa Batool; Assistant Commissioner, Kahuta, Seemal Mushtaq; Assistant Commissioner (Saddar), Rawalpindi, Jamil Haider Shah; Deputy District Education Officer (Development), DEO, Secondary Bagh Sardaran, Rawalpindi Waheed Afzal Asad; Assistant Commissioner (City), Rawalpindi, Shagufta Jabeen; DEO, Rawalpindi, Malik Asif; Headmaster Govt MC boys Central Model High School, Millat Colony, Rawalpindi, Sajid Masud abbasi; Tehsildar (City), Rawalpindi, Zafar Abbas; Municipal officer (infrastructure) Chief officer,Tehsil Municipal Administration (TMA), Taxila, Khalil Ur Rehman’ Deputy District, Education officer (male) Taxila Tahir Aziz to act as AROs in three constituencies respectively.\nNA 67 Jhelum bye elections would be conducted by DEC, Sahiwal Shakeel Ahmed; DEC JhelumMuhammad Irfan, DEC, Jhelum; Assistant Commissioner, Jhelum Muhammad Aamir, District Education officer (Secondary), Jhelum Syed Walayat Ullah Shah to perform duties of AROs, respectively.\nFor conducting bye-elections in NA 97, REC, Nasirabad (Balochistan) Abdullah, DEC Bhakkar, Aaber Farooque, District Education Officer (SE), Bhakkar, Ch Abdur Rehman, Sub-Divisional officer, Highway Kallurkot, Muhammad Ashraf have been assigned the duties of DRO,RO and AROs respectively.\nSimilarly the DROs, ROs and AROs have been appointed for bye elections in NA 126;NA 130; NA 155; NA 156; NA 191; NA 241; NA 247; NA 242; NA 243; NA 244; N A 250; NA 252; NA 254; NA 256 and NA 265.",
  "retrievedAt": "2025-08-11T05:54:05.825Z"
}
