{
  "article_id": "2025-04-29_ff6f405b591011e1d3b4de8a864cf0e2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/rain-thunderstorms-and-hailstorm-expected-in-upper-and-central-pakistan-from-may-1-4/",
    "retrieved_at": "2025-08-27T14:59:39.138Z"
  },
  "metadata": {
    "title": "Rain, thunderstorms, and hailstorm expected in upper and central Pakistan from May 1- 4",
    "author": null,
    "date_published": "2025-04-29T15:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 288,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 29 (APP): The Pakistan Meteorological Department (PMD) has forecast a spell of wind, thunderstorm, and rain,accompanied by isolated hailstorms, in various parts of the country from May 1-4, as a westerly wave is expected to enter the upper regions on the evening of April 30. According to the Met Office, moist currents from the Arabian Sea will also penetrate northeast Punjab starting May 1, enhancing the chances of scattered rainfall and thunderstorms. From April 30 to May 4, weather disturbances are expected in Azad Kashmir including Neelum Valley, Muzaffarabad, Rawalakot, Poonch, Hattian, Bagh, Haveli, Sudhanoti, Kotli, Bhimber, and Mirpur; parts of Punjab including Islamabad/Rawalpindi, Murree, Galliyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujrat, Gujranwala, Hafizabad, Sialkot, Narowal, Lahore, Sahiwal, Kasur, Okara, Faisalabad, Toba Tek Singh, Jhang, Khushab, Sargodha, and Mianwali; as well as regions in Khyber Pakhtunkhwa including Chitral, Dir, Swat, Abbottabad, Mansehra, Haripur, Kohistan, Shangla, Buner, Malakand, Waziristan, Kohat, Lakki Marwat, Bajaur, Mohmand, Karak, Khyber, Peshawar, Mardan, and Kurram. Gilgit-Baltistan areas such as Diamir, Astore, Ghizer, Skardu, Hunza, Gilgit, Ghanche, and Shigar are also likely to be affected. Meanwhile, from the night of May 2 to May 5, duststorms and thunderstorms are expected in parts of southern Punjab, Sindh, and Balochistan, including Multan, DG Khan, Bahawalpur, Bahawalnagar, Sukkur, Mirpurkhas, Khairpur, Tharparkar, Sanghar, Umerkot, Zhob, Khuzdar, Musakhel, and Barkhan. Strong winds, hail, and lightning may damage loose structures such as electric poles, trees, vehicles, and solar panels. Farmers are advised to adjust their wheat harvesting schedules in view of the forecast. Heatwave conditions prevailing in various parts of the country are likely to ease from May 1 onwards. The authorities have been urged to remain on high alert and take precautionary measures to avoid any untoward situation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}