{
  "article_id": "2025-04-29_ead2afac5d10946a1b5bd6e0f3dffee1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-welcome-investment-in-value-addition-dairy-products-pm/",
    "retrieved_at": "2025-08-27T14:59:43.062Z"
  },
  "metadata": {
    "title": "Pakistan to welcome investment in value-addition dairy products: PM",
    "author": null,
    "date_published": "2025-04-29T15:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 226,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, April 29 (APP): Prime Minister Muhammad Shehbaz Sharif Tuesday said that Pakistan, being among the top milk-producing countries in the world, would welcome investment in the value-addition of dairy products. The prime minister met with a delegation led by Jan Derck van Karnebeek, Global CEO of Royal Friesland Campina and Engro Pakistan that called on him. The prime minister said that Pakistan would collaborate with companies like Friesland Campina for the development of the dairy sector and they would encourage steps to enhance the safety and nutrition of milk in order to boost dairy exports. \"The sustainable development of the dairy industry and improving the livelihoods of farmers are among our top priorities,\" PM Office Media Wing, in a press release, quoted the prime minister as saying. The meeting was attended by Minister for National Food Security Rana Tanveer Hussain, Minister for Finance and Revenue Muhammad Aurangzeb, Special Assistant to the PM Haroon Akhtar and other senior government officials. The prime minister further observed that Friesland Campina Engro Pakistan could provide technical assistance to align Pakistan's dairy regulations with the international best practices. They appreciated Friesland's support in developing a pilot dairy supply chain traceability system in Punjab and Sindh provinces to enhance milk safety and consumer confidence, he added. The Friesland Campina delegation expressed interest in increasing investment in Pakistan's livestock and dairy sector.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}