{
  "article_id": "2025-04-29_a5aa00c3994e41459fee29e672771dc0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/turkmen-nation-loves-literature-art-music-integrates-with-glorious-past-ambassador-movlamov/",
    "retrieved_at": "2025-08-27T15:01:30.262Z"
  },
  "metadata": {
    "title": "Turkmen nation loves literature, art, music, integrates with glorious past: Ambassador Movlamov",
    "author": null,
    "date_published": "2025-04-29T09:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 615,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 29 (APP):Ambassador Extraordinary and Plenipotentiary of Turkmenistan, Atadjan Movlamov on Tuesday while shedding light on the past and glorious history of the Turkmen nation said that the Turkmen nation is a nation that loves literature, art and music. Due to the glorious past of the Turkmen nation, their love for literature, poetry, music and art, the compatibility of the past with the present of this nation is still the torch bearer of peace and brotherhood and friendship, harmony, universalism and neutrality, the Ambassador said. The Embassy of Turkmenistan in Islamabad organized a presentation of the book \"Jewel of the Mind\" written by the National Leader of the Turkmen people, Chairman of the Halk Maslahaty of Turkmenistan Gurbanguly Berdimuhamedov, for the representatives of local media. \"Our glorious history and rich cultural heritage preserved by our people as an apple of their eyes are a single system of the unique material and spiritual values that have reached our days. Some of these values have also been widely recognized as world heritage treasures. The glorification of the sacred values of the Turkmen people is reflected in the content of the great book \"Jewel of the Mind\" created by the wisdom of our HeroArkadag,\" - said the Ambassador Extraordinary and Plenipotentiary of Turkmenistan, Atadjan Movlamov, addressing the audience. At the beginning of the event, it was noted that as part of the celebrations of the 300th anniversary of the birth of the great poet and philosopher Magtymguly Fragi lasted during 2024, a new work by the National Leader of the Turkmen people, Chairman of the Halk Maslahaty Gurbanguly Berdimuhamedov - the book \"Jewel of the Mind\" was presented in November that year. The Ambassador has given a detailed presentation to the representatives of Pakistani Media, explaining not just the contents of the book, but also its concept and philosophy, which motivated the Turkmen National Leader to pen it down. The book was published last year in November and contains an introduction and two chapters, he said. The envoy said the first chapter of the book, Travel to History, describes Turkmenistan's history, how it started and how far it has come, while its second chapter, Spiritual Heritage, exclusively brings to life the values of Turkmen culture and the spiritual facets of Turkmen heritage. The book, which highlights ancient civilizations and their ties with neighbours, emphasizes the peace-loving traditions of the Turkmen people, as well as their contribution to the development of science and culture, he said. The Ambassador said that this valuable publication is a significant contribution to understanding the historical and spiritual heritage of Turkmenistan. He said that it contains rich information about the political, trade and cultural ties of the ancient civilisations of Anau, AltynDepe, Margush, states of Seljuks and Khorezmshahs. Turkmen envoy said that the book will allow foreign readers to get acquainted with interesting information about the history of the Turkmen people, moral values, the evolution of science, education, and culture in Turkmenistan, and the principles of peacefulness and creation inherited from the Oguzhan era. In 2024, named \"Fount of wisdom Magtymguly Fragi\", significant events took place, including the opening of the Magtymguly monument at the foot of the Kopetdag mountains and the International Forum \"Interrelation of Times and Civilizations - the Basis of Peace and Development\", which is also reflected in the book, he said. At the end of the event, attention was focused on upcoming international events within the framework of 2025, declared the International Year of Peace and Trust, and the 30th Anniversary of the Permanent Neutrality of Turkmenistan. The culmination of these events will be the Representative Forum, scheduled for December 12, 2025, in the white marble city of Ashgabat.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}