{
  "article_id": "2025-04-29_b0cbfb6b41b5234ac4892d13767290dd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/interior-minister-meets-ji-ameer-in-lahore/",
    "retrieved_at": "2025-08-27T15:00:57.565Z"
  },
  "metadata": {
    "title": "Interior Minister meets JUI-F chief, discuss regional security",
    "author": null,
    "date_published": "2025-04-29T12:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 211,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE, Apr 29 (APP):Federal Interior Minister Mohsin Naqvi held an important meeting with Jamiat Ulema-e-Islam (JUI-F) chief Maulana Fazlur Rehman to discuss the escalating tensions between Pakistan and India, the current border situation, and developments in the wider region, including the humanitarian crisis in Palestine.During the meeting, Minister Mohsin Naqvi briefed Maulana Fazlur Rehman on the recent decisions of the National Security Committee (NSC) and Pakistan's principled stance in response to India's unilateral and provocative actions. He emphasized that Pakistan is committed to peace but will not hesitate to respond decisively to any act of aggression.Maulana Fazlur Rehman extended his full support to the government's position and national security policy. He strongly condemned India's aggressive posture and stated, \"Modi is an enemy of Muslims. Wherever there is a front against Muslims, Modi will be found standing there.\"Mohsin Naqvi warned that India is actively engaged in efforts to destabilize the peace of the region, stating, \"India is playing with fire. Any misadventure will be met with full force. Our brave armed forces are fully prepared to defend the homeland.\" He added that Pakistan's political leadership and its people stand united against any form of Indian aggression.The interior minister also inquired after Maulana Fazlur Rehman and conveyed his best wishes for his well-being.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}