{
  "title": "Hearing of cases against Imran Khan should be conducted on day to day basis, demands Tarar",
  "link": "https://www.app.com.pk/national/hearing-of-cases-against-imran-khan-to-be-conducted-on-day-to-day-basis-demands-tarar/",
  "date_published": "2023-02-09T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): Special Assistant to the Prime Minister (SAPM) on Interior Attaullah Tarar on Thursday demanded the hearing of cases against Imran Khan on day to day basis and live broadcast of their proceedings so that nation know about his real face.\nTalking to media persons here, he appealed the relevant courts to ensure hearing of the cases against Imran Khan on day to day basis as the PTI chairman had been using delaying tactics instead of facing them.\nIt is to mention that IHC had to hear a petition on Thursday seeking former prime minister Imran Khan’s disqualification for concealing his alleged daughter Tyrian White in his nomination forms submitted to contest the 2018 general election.\nTarar said Imran Khan had been using delaying tactics instead of making arguments and resorting to technicalities for the delay. During the trials against PML-N leadership in past, Attaullah Tarar said that the hearing was conducted on day to day basis but Imran Khan had been avoiding to argue the cases on merit and trying to challenge the jurisdiction of the court.\nHe said that Imran Khan delayed the foreign funding case with Election Commission of Pakistan (ECP) for six years and the same tactics were being used by him in Toshakhana and Tyrian White cases.\nThe SAPM said that PTI leadership considered itself as `untouchable’ but it would have to be accountable for their deeds. Attaullah Tarar said that an affidavit was submitted in the court declaring the aunt of Tyrian White as her guardian but Imran Khan had now challenged the jurisdiction of the court instead of facing the case about it.\nIn both aspects of this particular case, Attaullah Tarar viewed that Imran Khan would be disqualified because he had concealed facts being a public figure and party leader as information about kids was necessary to be submitted to the ECP before contesting elections.\nHe said that different delaying tactics were being used in this case by challenging the jurisdiction of the court and non-availability of lawyers. “The next hearing of the case would be held on March 1 and we demand to ensure hearing of the case on day to day basis and its proceeding to be broadcast live,” he maintained.\nTo a question about Avenfield reference case, he said that PML-N leadership faced this false case and IHC set aside the conviction of PML-N leader Maryam Nawaz in it.\nTo another question about the announcement of election date in Punjab, he said “I have the opinion as a student of law that Governor gives the data if he dissolves the assembly. But it is a legal issue in case the Assembly is dissolved after 48 hours”.\nTarar said that Imran Khan destroyed the economy of the country during his three and half years tenure and rolled back the project of China Pakistan Economic Corridor. He said that the incumbent government came into power to save the country from bankruptcy and it would put the economy on right track.",
  "retrievedAt": "2025-08-11T05:59:53.672Z"
}
