{
  "title": "HEC invites applications from Afghan students for short documentary contest",
  "link": "https://www.app.com.pk/national/hec-invites-applications-from-afghan-students-for-short-documentary-contest/",
  "date_published": "2023-02-09T10:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): The Higher Education Commission (HEC) has called for applications for Afghan Short Documentary Contest and invited all enthusiastic Afghan students studying in Pakistan under Allama Muhammad Iqbal Scholarships for Afghan Students to submit a short documentary video sharing their higher education experiences in Pakistan using high-resolution cameras or smart phones.\nAccording to official sources from HEC, the theme of the short documentary contest is “Education Experiences of Afghan Youth studying in Pakistan”\nAs per details of the application process, initially in step one, submit an original idea based documentary no longer than 40 – 60 seconds in duration on the given theme using smart phone or high resolution cameras.\nWhile in step 2, the jury members will shortlist top 10 Afghan students’ entries to showcase and will inform students and their universities’ nominated Public Relations Officers (PROs)/Mass Communication Department Faculty Members to participate as their Mentors to submit short documentary of 4 – 6 minutes using only high resolution cameras (please refer to technical requirements) on the given theme in English language with subtitles translated into 2 languages (Urdu & Dari).\nThe deadline to submit initial applications is 21-02-2023, while announcement of top 10 shortlisted finalists will be announced on 24-02-2023 and final documentary will be submitted on 10-03-2023. Meanwhile the event will be held (Tentatively) on 15/17-03-2023.\nHowever, final top 10 shortlisted submissions must be in the horizontal format of at least standard HD (1280 x 720 pixels) encoded in H264 (.mp4, .mov). However, for better viewing quality, a full HD (1920 x 1080 pixels) format is recommended. Every video submitted must be a final edited product without any rough-cuts. All submissions must include closing credits with the following information: name(s) of the filmmaker(s), script writer, all participants, stakeholder(s) etc.\nA short documentary covering Afghan students’ access to higher education in Pakistan, day-to-day campus life, advanced teaching faculty, research and lab facilities, hostels, financial, socio-cultural, communication, psychological, and education adjustments, individual experiences, sports and other extra-curricular activities on campus, interviews with university rector/VC etc.\nThe students are asked to submit your entry by any of the following means, i.e email your submission to Ms. Amina Munir, Project Manager, Allama Muhammad Iqbal Scholarships for Afghan students via Google Form at https://shorturl.at/FHI68? OR ?Mail your documentary video on a USB to the Jehanzeb Khan, Project Director, Human Resource Development Division, Higher Education Commission, H-8, Islamabad. Ph: 051-9040 8036.\nAs per terms & conditions, all entries must reflect the original work of the student, while female Afghan students are highly encouraged to participate. By submitting your application to Higher Education Commission (HEC), you agre?e to give a license to the HEC for its public screening, including distribution via various social media, digital, and web platforms etc.\nTop 10 shortlisted Afghan students’ entries will be called on the day of event and winners will be decided by jury members on the day of event. Entering this competition does not guarantee that you will win a prize or derive any other benefit, however, final prizes will be awarded in a grand ceremony held at HEC, Islamabad. The first prize winner will be awarded Rs 70,000 , while second prize winner Rs 50,000 and third winner will get Rs 35,000.",
  "retrievedAt": "2025-08-11T06:00:07.859Z"
}
