{
  "title": "President stresses parliamentary cooperation among IPU states",
  "link": "https://www.app.com.pk/national/president-stresses-parliamentary-cooperation-among-ipu-states/",
  "date_published": "2023-02-09T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 09 (APP): President Dr Arif Alvi on Thursday underscored the need for increasing parliamentary cooperation among the member countries of the Inter-Parliamentary Union (IPU) to promote peace, democracy and sustainable development around the world.\nHe reaffirmed Pakistan’s commitment to IPU’s mission to work for peace, democracy, human rights, youth empowerment and sustainable development through political dialogue and parliamentary action.\nThe president made these remarks while talking to the President of the Inter-Parliamentary Union Duarte Pacheco, here at the Aiwan-e-Sadr.\nTalking to Duarte Pacheco, the President said that parliamentarians could play a significant role in promoting international peace and conflict resolution.\nHe emphasized that the world collectively needed to take steps to stop wars and bring peace to the world.\nHe urged that parliamentarians of the world should work for global peace and prosperity.\nThe president briefed the visiting dignitary about the contribution made by Pakistan in the war against terror.\nHe said that Pakistan had lost thousands of people and security forces, besides suffering economic losses of over $100 billion while fighting a long battle against terrorist elements.\nHe highlighted that Pakistan had successfully defeated the terrorists and had achieved major successes in this regard.\nThe president stated that Pakistan had hosted millions of Afghan refugees for over four decades which spoke volumes of the humanitarian spirit of the country.\nHe expressed the hope that the visit of Duarte Pacheco would help to further strengthen parliamentary relations between the Parliament of Pakistan and IPU’s member Parliaments.\nPresident IPU informed that IPU was an important platform, as it shared its experiences and knowledge with other member countries.\nHe expressed his heartfelt condolences over the recent terrorist attack on a mosque in Peshawar and condemned the barbaric attack.",
  "retrievedAt": "2025-08-11T05:59:40.162Z"
}
