{
  "title": "PMD refutes misleading information about earthquake occurrence in Pakistan",
  "link": "https://www.app.com.pk/national/pmd-refutes-misleading-information-about-earthquake-occurrence-in-pakistan/",
  "date_published": "2023-02-09T10:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): The Pakistan Meteorological Department (PMD) on Thursday refuted the misinformation created through social media predicting the occurrence of any major earthquake in Pakistan in the coming days, saying “there is no relation between Turkish earthquake and Pakistan scientifically”.\nThe devastating earthquake with magnitude 7.8 which occurred in southern Turkey created panic in Pakistan by some social media stating that “the earthquake with the same magnitude may occur in Pakistan in few days”.\nHowever, the PMD clarified that there is no connection between the Turkish earthquake and Pakistan scientifically.\nThere is no direct fault link between Turkey and Pakistan that could trigger faults in Pakistan/Iran or Afghanistan.\nPMD is running its seismic monitoring network comprising thirty remote monitoring stations and is recording earthquakes occurring within and surrounding areas every day which are of small to medium range magnitudes.\nIt is worth mentioning that earthquake is purely a natural phenomenon. Pakistan and neighbouring countries like Iran, Afghanistan, and Tajikistan have experienced many major damaging earthquakes in past. These countries are earthquake-prone countries and PMD seismic monitoring network is recording more than 100 quakes every day.\nThe possibility of occurrence of major earthquakes in Pakistan and surrounding countries is always there but when and where or the timeline of happening is beyond the reach of existing technology.\nThe prevailing method is to find the seismic hazard of the areas by using previous seismic data which explores the potential of earthquake fault.\nSeismic hazard assessment is an effort by earth scientists to quantify seismic hazard and its associated uncertainty in time and space and to provide seismic hazard estimates for seismic risk assessment and other applications but nothing concerned with the prediction of earthquakes.",
  "retrievedAt": "2025-08-11T06:00:07.948Z"
}
