{
  "title": "President for greater cooperation with Sri Lanka in trade, economy & education",
  "link": "https://www.app.com.pk/national/president-for-greater-cooperation-with-sri-lanka-in-trade-economy-education/",
  "date_published": "2023-02-09T12:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 09 (APP): President Dr Arif Alvi on Thursday called for promoting greater cooperation between Sri Lanka and Pakistan in the fields of trade, economy and education.\nHe said that both brotherly countries enjoyed cordial relations that needed to be further expanded for the mutual benefit of the two countries.\nHe underscored the need for increased cooperation in the areas of higher education, academia, and research to promote mutual understanding between the people of both countries.\nThe president expressed these views while talking to a delegation of senior civil servants of Sri Lanka here at Aiwan-e-Sadr.\nCurrently, twenty Senior Civil Servants of Sri Lanka are attending a two-week training programme related to International Relations, Peace and Strategic Studies, Public Policy, Leadership and Management, at the National Defence University, Islamabad.\nThe president urged bureaucracy to be responsive to people’s needs, improve the system’s efficiency, and their capacity and intellect for ensuring fast-paced development.\nHe said that developing countries should focus on the development of education and health sectors, besides making fast decisions to help address the challenges being faced by them.\nThe president said that bureaucrats and politicians must adapt emerging technologies and make timely decisions to build intellectual pathways for the development of the IT sector.\nHe said that the intellectual edge made nations great, and countries should focus on developing knowledge economies and investing in the intellectual development of their people.\nHe stated that developing countries could achieve accelerated economic growth by focusing on the development of the IT sector and adopting conducive business policies.\nThe president also highlighted the need to become more financially disciplined to overcome perennial financial issues of developing countries.\nHe added that common people alone could not be burdened again and again to bear the brunt of bad economic decisions and the elites must also share the burden for the greater good of the country.\nHe further stated that decision-makers and bureaucracy must change their attitude and mindset to help resolve people’s issues.\nWhile responding to a question about regional cooperation, the president stressed the need for greater economic cooperation among the South Asian countries that would bring greater prosperity to the people of the region.\nHe stated that developing countries should stay away from the new global polarization and focus on issues like literacy, health, climate change, global warming, and improving regional cooperation.\nThe participants of the training appreciated the efforts of the Higher Education Commission and National Defence University for taking the initiative to provide training opportunities to civil servants of friendly countries.\nThe Senior Civil Servants from Sri Lanka are currently attending an Executive Training Program which aims to impart modern knowledge and techniques to Civil Servants to ensure good governance and efficient service delivery, besides promoting mutual understanding among civil services and academia of Pakistan and Sri Lanka.",
  "retrievedAt": "2025-08-11T05:59:42.489Z"
}
