{
  "title": "23 Pakistanis evacuated from quake-hit Turkiye: FO",
  "link": "https://www.app.com.pk/national/23-pakistanis-evacuated-from-quake-hit-turkiye-no-casualties-fo/",
  "date_published": "2023-02-09T08:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): The Foreign Office on Thursday confirmed that 23 Pakistani nationals were evacuated from the quake-hit Turkiye, while no casualties were reported so far.\n“So far, we have no news of casualty of any Pakistani in Turkiye or Syria,” the Foreign Office spokesperson said at a weekly press briefing.\nSpokesperson Mumtaz Zahra Baloch said the Pakistanis were evacuated from Gaziantep University and accommodated in Adana city. The devastated city of Gaziantep, located about 33km from the epicentre, suffered heavy loss of life and infrastructure during the earthquake.\n“Sixteen of these evacuated persons will be brought back to Pakistan, while the rest will be shifted to Istanbul city of Turkiye,” she said.\nShe said the country’s missions in Turkiye and Syria remained in constant touch with the relevant authorities to provide relief to Pakistanis affected by the earthquake.\nIn response to a question regarding the outcome of Pakistan’s series of meetings with Afghanistan and Iran, she said the multifaceted dialogue with the neighbouring states would lead to positive development.\nAsked why Pakistan stayed away from the Multilateral Security Dialogue on Afghanistan in Russia’s capital Moscow, she said, “Our decision not to participate in the instant meeting was made in light of our consideration that Pakistan can make a better contribution in formats and forums which can contribute constructively to peace in Afghanistan.”\nShe mentioned that Pakistan was party to several bilateral, trilateral, quadrilateral, and multilateral mechanisms for dialogue and these include the Moscow format and the SCO Contact group on Afghanistan.\n“We will continue to participate in all these mechanisms to their full potential and will continue to engage with our partners to contribute to peace and stability in Afghanistan,” she added.\nThe spokesperson said Director General of International Atomic Energy Agency (IAEA) Rafael Mariano Grossi will visit Pakistan from February 15-16.\n“The visit will provide an opportunity for Pakistan and the IAEA to explore avenues to advance cooperation in peaceful applications of nuclear technology for socio-economic development,” she said.\nBaloch said Foreign Secretary Dr Asad Majeed Khan would visit France to meet his counterpart on February 10 for the 14th Round of Bilateral Political Consultations.\nA roadmap for bilateral cooperation between Pakistan and France will also be signed, she said.\nAbout the eviction of Kashmiri Muslims from the Indian Illegally Occupied Jammu and Kashmir (IIOJK), she said in some states of India, bulldozers were used to demolish the properties of Muslims to terrorize them.\n“It is unfortunate that Indian authorities are using land as a weapon to intimidate the people of IIOJK,” she said.\nShe condemned the recent attack by the Indian occupation authorities at the office building of the Parties Hurriyat Conference (APHC) in Rajbagh, Srinagar, terming it an oppressive act and yet another assault on political freedom in the IIOJK.\nShe said Pakistan would continue to extend political, diplomatic, and moral support to Kashmiris for the just and peaceful settlement of the Jammu and Kashmir dispute in accordance with the UN Security Council Resolutions.",
  "retrievedAt": "2025-08-11T06:00:02.166Z"
}
