{
  "title": "HEC revises Business Administration curriculum to align with national and global standards",
  "author": null,
  "content": "ISLAMABAD, Jun 03 (APP):The Higher Education Commission (HEC) has revised the curriculum for Business Administration degree programs in a comprehensive two-day meeting held at the Institute of Management Sciences (IMSciences), Peshawar.\nThe meeting of the National Curriculum Revision Committee (NCRC) brought together leading academic experts, senior faculty members, representatives from the Business Council through NBEAC, and industry professionals. The collaborative review aimed to align academic standards with the HEC’s Undergraduate and Graduate Education Policy 2023, ensuring relevance to both local needs and global market demands.\nDirector IMSciences, Professor Dr. Usman Ghani, welcomed the participants on behalf of the host institution. Mr. Nasir Shah, Director General of HEC’s Regional Center in Peshawar, expressed full support for the smooth execution of the meetings. Dr. Farida Anjum, Director Curriculum HEC, emphasized the national importance of the curriculum revision process.\nThe committee unanimously elected Professor Dr. Naukhez Sarwar of NUST Business School as Convener, while Professor Dr. Farooq-e-Azam Cheema of Karachi School of Business and Leadership (KSBL) was chosen as Co-Convener. Mr. Hidayatullah Kasi, Deputy Director (Curriculum), facilitated the sessions as Secretary.\nThe revised curriculum covers key academic components including uniformity in the nomenclature of degree programs, eligibility criteria, program learning outcomes, model schemes of study, course learning outcomes, degree award requirements, and elective options. These updates are designed to incorporate high-demand specializations aligned with international benchmarks, indigenous priorities, and industry expectations.\nThe revised framework also provides guidance for Level 6 and Level 7 qualifications as defined by the National Qualifications Framework, marking a significant step forward in standardizing and elevating the quality of business education across Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:45:07.135Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/hec-revises-business-administration-curriculum-to-align-with-national-and-global-standards/",
  "dateList": "2025-06-03",
  "date_published": "2025-06-03T14:06:00.000Z"
}
