{
  "title": "Central committee of Chinese Communist Party sends food packs for flood victims",
  "link": "https://www.app.com.pk/national/central-committee-of-chinese-communist-party-sends-food-packs-for-flood-victims/",
  "date_published": "2022-09-18T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):The International Department of the Central Committee of the Communist Party of China (ID-CPC), through the embassy of China in Pakistan, has donated food pack assistance to the flood-affected people of Balochistan through national and regional level political parties.\nThe ID-CPC, in a news release issued here on Sunday, noted that Pakistani people were facing a disastrous situation due to the massive floods, which affected their livelihoods on all levels by causing heavy damages to road connectivity, infrastructure, and food supply chain.\nIn this time of trouble for the country, China again provided all kinds of support to the people of Pakistan in terms of financial assistance, medical services, tents, food for the needy and much more, the release said.\nflood relief assistance, the ID-CPC, through its embassy donated food packs to needy families.\nThe political parties getting flood relief assistance from the ID-CPC through the Chinese embassy include JWP (Jamhoori Watan Party), PKMAP (Pashtoonkhwa Milli Awami Party), HDP (Hazara Democratic Party), BAP (Balochistan Awami Party), ANP (Awami National Party), and MQM-P (Mutahida Quami Movement-Pakistan).\nThe department was also in process of providing more food pack assistance to other parties in the coming days, the release added.\nThe food packs were donated in different affected areas of Quetta city, Pashtoon Abad, Hanna Urak, Saryab, Marriabad, Hazara Town, Kalat, Kharan, Naseerabad, Jaffarabad, Usta Muhammad, Karachi, Hyderabad, Charsadda, Peshawar and many more areas.\nThousands of recipients of this assistance have shown a lot of trust in the true, strong and everlasting friendship and companionship of Pakistan and China and extended best wishes for the future of both brotherly countries.\nMoreover, the leadership of these political parties and the people of the respective areas thanked the Chinese people for their timely support, and for proving it to the entire world that regardless of the situation, China and Pakistan would always stand by each other and always work together for the betterment of their citizens.",
  "retrievedAt": "2025-08-11T15:36:00.679Z"
}
