{
  "title": "President declares CDNS’ retrospective downward profit revision rate to a complainant ‘as maladministration’",
  "link": "https://www.app.com.pk/national/president-declares-cdns-retrospective-downward-profit-revision-rate-to-a-complainant-as-maladministration/",
  "date_published": "2022-09-18T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP: While accepting a representation of an aggrieved citizen against a decision of the Wafaqi Mohtasib, President Dr Arif Alvi has directed the Central Directorate of National Savings (CDNS) to pay profit on the Special Saving Certificates (SSCs) as per the profit rate prevailing at the time of purchasing the certificates.\nHe said that CDNS had committed maladministration by revising the profit rates retrospectively and in contrary to the existing law, thus causing the citizen a loss of Rs 5.3 million, President Secretariat Press Wing said in a press release on Sunday.\nThe president issued these directions while deciding on a representation preferred by Yasmeen Merchant, who had purchased six SSCs from CDNS on 01.11.2019 at a profit rate of 12.7% for five certificates and 13.9% profit rate for the sixth certificate. Four days later on 05.11.2019, however, Finance Division issued a notification reducing the profit rates from 12.7% to 11% and 13.9% to 11.8% with retrospective effect from 01.11.2019, causing her a loss of Rs 5.3 million.\nThe president accepted her representation and held that the complainant was entitled to the profit rate prevailing on the date of issuance of certificates and that the change made through the notification did not apply to her investment in retrospective and, therefore, it could not affect her duly earned right of profit nor it can nullify it to her disadvantage.\nHe said that the notification issued was in the nature of subordinate or delegated legislation and took effect from the date of its publication in the official gazette and not from any prior date.\nThe president said that the rationale behind it was that only the parliament/legislative bodies could enact a law from a date prior to its enactment i.e., retrospectively and the government by itself, unless authorized by the statute, had no such authority or power to issue a notification operative from a date different from the date of its publication in the official gazette.\nHe further highlighted that a person may feel allured by the incentives floated by the government and act upon it, and it did not behoove the government to recant on its commitment as it may erode the confidence of the general public in the government bodies and may also negatively affect the credibility of the government.\nHe further said that such law was based on settled legal principles and Quranic injunctions as per the 1st verse of Surah Al-Maida “O ye who believe! Fulfil your undertakings”.\nThe president held that it was not only logical, fair and just to fulfil promises, undertakings and agreements but was also a universally accepted norm.\nHe further declared that both sides were bound by the commitments made at the time of issuance of certificates and directed CDNS to pay the profit as per the promised profit rates of 12.7% and 13.9% on the purchased certificates.\nAs per details, the citizen’s grievance was that she had purchased the SSCs because of the prevailing profit rate whereas the notification gave retrospective effect to the profit rates and was issued after investment to her disadvantage. She approached CDNS and later the Wafaqi Mohtasib for redressal of her grievance but to no avail. She then filed a representation with the president, which was accepted.",
  "retrievedAt": "2025-08-11T15:36:00.866Z"
}
