{
  "title": "Capital maintains clean air for two consecutive days",
  "link": "https://www.app.com.pk/national/capital-maintains-clean-air-for-two-consecutive-days/",
  "date_published": "2024-03-19T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP): The air quality of the federal capital remained healthy for the second consecutive day on Tuesday as the atmospheric pollutants remained below the threshold of the national environmental quality standards.\nThe Pakistan Environmental Protection Agency (Pak-EPA) daily air quality report indicated a reduced ratio of air pollutants, recorded below permissible limits. The agency is responsible to ensure the protection of the environment under the Pakistan Environmental Protection Act 1997.\nThe hazardous air pollutant particulate matter of 2.5 microns (PM2.5), which was a hazardous atmospheric contaminant, remained 29.04 micro grammes per cubic meter on average which was lower than the national environmental quality standards (NEQS) of 35 mic-programmes per cubic meter and denoted the air quality healthy.\nPM 2.5 is generated through the combustion of an engine, industrial emissions, burning garbage or inflammable material and dust blown up by fast-moving cars plying on non-cemented patches of the roads.\nThe ratio of nitrogen dioxide and sulphur dioxide (NO2&SO2 respectively) also remained below the NEQS that were mostly produced during the industrial emissions from the factories involving complex and extraordinary chemicals’ use in production processes.\nThe NO2 remained 12.04 microgrammes per cubic meter and SO2 was 12.8 microgrammes per cubic meter.\nThe EPA officials claimed that the vehicular emissions due to increased automobiles was one of the leading cause of bad air quality. Industrial emissions were already subsided due to carbon-absorbing advanced technology installed at various steel manufacturing units.\nAccording to health experts, the prolonged dry winters resulted in the perpetuated presence of hazardous air contaminants in the atmosphere that made respiratory diseases and pneumonia endemic in the federal capital.\nThe population of the metropolis witnessed an abnormal rise in fog as well which was thicker and more adamant then the previous years.\nOfficial of the Ministry of Climate Change and Environmental Coordination told APP that there was no let up in air pollution and fog since the onset of the winters due to dry weather, increased anthropogenic activities and shifts in the weather pattern resulting in unprecedented polluted air in the federal capital.\nClimatologists and weather experts are compiling the data on the phenomenon to track and trace the exact causes of the peculiar weather occurrence that resulted in losses due to air and land route disruption, health impacts and social disruption due to halt or closure of educational institutions.",
  "retrievedAt": "2025-08-11T01:25:46.075Z"
}
