{
  "title": "Cars, spectators gather along expressway to observe PAF aerial acrobats",
  "link": "https://www.app.com.pk/national/cars-spectators-gather-along-expressway-to-observe-paf-aerial-acrobats/",
  "date_published": "2024-03-19T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 19 (APP): Dozens of cars and spectators have gathered along the Expressway to observe the aerial acrobats of the fighter aircraft of the Pakistan Air Force (PAF) busy in rehearsals for the National Day parade on March 23rd.\nThe Shakarparian Parade Ground has become the center of attraction of every commuter entering the federal capital for their daily chores and employment purposes that pause and rest at the road sides to observe the thundering fighter jets hovering over scenic Parade Ground surrounded by thick green cover.\nAbsa Alam, a female entrepreneur told APP that she was heading towards her office when she heard the roaring sounds of the JF-17 Thunder. “I can assume that its the pride of the nation JF-17 thunder because it had the loudest engine sound that deafened everyone’s ears. But, I must say that there is an unexplainable motivation and pleasure to witnesses the armed forces troops and PAF fighter jets doing aerial acrobats,” she said.\nAlam said it took a great deal of motivation to join this sacred duty of defending your motherland in khaki as it was a noble yet thrilling and daring task. “I captured many spectacular views of the F-16, J-17 and the team Sherdil of PAF that left the sky painted with different colours during the acrobats,” she added.\nNasir Ali, a tourist said he was going to Blue Area for his office work but the roars of fighter jets glued him to the roadside to stay and witness the aerial acrobats. “I really found it motivating and energizing as I got goosebumps on my skin. My daughter admires Shaheed PAF fighter pilot Marium Mukhtiar and wants to become a fighter pilot too. I captured a few visuals to show that she would really love to watch on my mobile phone,” he added.\nTayyab and Muttayab, twin brothers said that they had bunked their college to see the aerial acrobats. “It is one of the rare occasions as it will again take place after an year near next Pakistan Day. We really loved the Team Sherdil acrobats and other fighter jets. We find every fighter jet one of the best but its hard to differentiate or identify between any because for us every jet is F-16 or JF-17 Thunder,” he added.\nThe twins also captured visuals and pictures of the aircraft performing aerial acrobats and drills over the Parade Ground and claimed that it would be great memory for them.\nAkram Abbas, an elderly who was standing on the overhead bridge told that he was going to cross the road to catch Metro Bus but waited to witness the fighter jets. “Every passing aircraft sound warms your blood because it reminds us of our brave sons of the soil who had sacrificed for the defence of our motherland. Our prayers, regards, emotions and love always remain with every soldier, sailor and pilot who takes up his or her task in the field to protect the country,” he added.",
  "retrievedAt": "2025-08-11T01:25:24.162Z"
}
