{
  "title": "Federal cabinet ratifies defence agreement between Pakistan, Saudi Arabia",
  "author": null,
  "content": "ISLAMABAD, Oct 10 (APP): The federal cabinet in its meeting on Thursday ratified the Strategic Mutual Defence Agreement between Pakistan and Saudi Arabia.\nOn this occasion, the cabinet members paid tribute to the leadership of Pakistan and Saudi Arabia.\nPrime Minister Muhammad Shehbaz Sharif chaired the cabinet meeting during which he informed in detail about his official visits to Saudi Arabia, Qatar, the United Nations General Assembly and Malaysia.\nThe federal cabinet, on the recommendation of the Ministry of National Food Security and Research, approved the donation of 15 unflyable aircraft (8 Cessna and 7 Fletcher) of the Plant Protection Department to various institutions for educational, commemorative or exhibition purposes.\nThe remaining four flyable Beaver aircraft will continue to be used by the Department of Plant Protection for operations against locusts. It may be recalled that earlier attempts to auction these aircraft had not been successful, after which this step has been taken.\nThe federal cabinet, on the recommendation of the Ministry of Water Resources, in principle gave approval to the enactment of the WAPDA Security Force Act, 2025 to establish a special security force to protect important dams and hydropower projects managed by WAPDA.\nThe cabinet also ratified the decisions taken in the meeting of the Economic Coordination Committee (ECC) on October 2, 2025.\nThe cabinet also ratified the decisions taken in the meeting of the Cabinet Committee on Legislative Cases held on September 22, 2025. However, the Special Cabinet Committee will consider the proposed amendments in the Alternate Medicines and Health Products Enlistment Rules 2014.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:03:21.284Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/federal-cabinet-ratifies-defence-agreement-between-pakistan-saudi-arabia/",
  "dateList": "2025-10-10",
  "date_published": "2025-10-09T23:29:00.000Z"
}
