{
  "title": "Literary circles, mental health experts highlight books as stress-relief tool on “World Mental Health Day”",
  "author": null,
  "content": "ISLAMABAD, Oct 10 (APP): World Mental Health Day on Friday was celebrated around the globe, including in Pakistan, with enthusiasm and fervor.\nOn this occasion, literary organizations and mental health experts united to spotlight the healing power of books. From quiet reading corners to public libraries and online campaigns, advocates emphasized that reading is not just a pastime—it is a proven tool for stress relief and emotional balance.\nMuhammad Akbar Niazi, Vice President of the literary, social, and cultural organization Soach and former Joint Secretary of the literary circle Halqa Arbab-e-Zauq, said that books have always been silent therapists. “Reading allows the mind to detach from external pressures, creating a safe emotional space where empathy and calm can grow,” he said.\n“The act of reading slows the heartbeat and softens anxiety. Even ten minutes spent reading a favorite novel or poem can reduce stress hormones and restore focus. Promoting a reading culture is, in fact, promoting mental well-being,” he noted.\nHe added that World Mental Health Day reminds us that healing can come not only from medicine but also from meaning—and books remain one of the richest sources of that meaning.\nTalking to APP, Zohaib Chaudhry, Director of Planning and Promotion at the Pakistan Sadequain Foundation, emphasized that literature and art are not merely forms of entertainment but essential tools for emotional healing and personal growth.\nHe noted that reading and artistic engagement provide individuals with a safe space to explore their feelings, understand their inner struggles, and find strength through reflection and imagination.\nSpeaking about the broader role of culture in society, he said that literary institutions must take the lead in shaping conversations about mental health.\nZohaib Chaudhry also praised initiatives by educational and literary organizations that promote reading habits and book therapy, calling them a vital step—not only toward building a more mentally aware society but also as a stress-relief tool for the community.\nAccording to a 2009 study conducted by the University of Sussex in the United Kingdom, reading can reduce stress levels by as much as 68 percent—more than listening to music or going for a walk.\nIn a conversation with APP, Sidra-tul-Muntaha, a clinical psychologist, counselor, and Mental Health and Psychosocial Officer, said, “I’ve often witnessed how reading becomes a quiet refuge for many of my clients, especially adolescents. Books allow them to process emotions, find characters they relate to, and rebuild inner strength through words.”\nShe observed that, alongside professional treatment, introducing complementary practices such as reflective reading and expressive writing can ease anxiety and foster resilience. “Literature truly holds therapeutic power, reminding us that healing doesn’t always require noise—sometimes it begins in silence and stories,” she added.\nDr. Ahad, a clinical psychologist at a private clinic in Sector G-7, said that reading can lower stress hormones, improve focus, and foster a sense of belonging by connecting readers to characters and experiences similar to their own.\nHowever, he emphasized that book reading is not a substitute for professional treatment in severe mental health conditions. Rather, it serves as a complementary practice—one that empowers individuals to take small, restorative steps toward inner balance.\nIt is pertinent to mention here that World Mental Health Day is an international day dedicated to global mental health education, awareness, and advocacy against social stigma. It was first celebrated in 1992 at the initiative of the World Federation for Mental Health (WFMH), a global mental health organization with members and contacts in more than 150 countries.\nThe 2025 World Mental Health Day theme, “Access to Services – Mental Health in Catastrophes and Emergencies,” focuses on the critical need for accessible mental health support during crises such as natural disasters, conflicts, and pandemics.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:03:10.271Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/literary-circles-mental-health-experts-highlight-books-as-stress-relief-tool-on-world-mental-health-day/",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T15:43:00.000Z"
}
