{
  "title": "ITP issues diversion plan for Faizabad amid law & order measures",
  "author": null,
  "content": "ISLAMABAD, Oct 10 (APP): Islamabad Traffic Police (ITP) has announced a special diversion plan to manage traffic flow around Faizabad in view of law and order arrangements. Citizens have been urged to use alternate routes to avoid inconvenience.\nAn official told APP on Friday that entry of all kinds of heavy traffic into Islamabad will remain suspended until further orders, while diversions for light traffic have been placed at multiple points.\nRawal Dam Chowk\nTraffic towards Faizabad from both sides will be diverted. Vehicles coming from Bhara Kahu, Murree, and Islamabad towards Rawalpindi should use Park Road, Captain Naeem Tufail Shaheed Chowk (Tramri), Lehtrar Road, Khanna, and Expressway. Those heading to the Airport are advised to use Kashmir Chowk and Srinagar Highway.\nGarden Flyover\nTraffic towards Faizabad from both sides will be diverted. Residents of I-8 should use Zero Point, Srinagar Highway, Club Road, and Park Road.\nKhanna Pull (Expressway)\nBoth sides towards Faizabad will be diverted. Traffic from Koral should use Lehtrar Road, Tramri Chowk, Park Road, and Rawal Dam Chowk.\nNinth Avenue / IJP Road\nTraffic towards Faizabad from both sides will be diverted. Vehicles from IJP Road should use Gohar Shaheed Chowk (Gandum Godown), Faqir Aipee Road, and Srinagar Highway. Alternatively, drivers may use CDA Double Road via I-10 Service Road to Ninth Avenue and Srinagar Highway.\nZero Point (Expressway / Faisal Avenue)\nTraffic from Zero Point towards Faizabad and Faisal Avenue will be diverted. Vehicles from Islamabad towards Rawalpindi should use Srinagar Highway and Ninth Avenue.\nResidents of F-8, F-9, F-10, F-11, G-10, and G-11 sectors may use Golra Mor via Srinagar Highway to travel to Rawalpindi.\nThe official added that citizens can stay updated through FM 92.4 and the official WhatsApp channel of ITP for the latest traffic advisories.\n/APP – rzr",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-12T00:03:16.129Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/itp-issues-diversion-plan-for-faizabad-amid-law-order-measures/",
  "dateList": "2025-10-10",
  "date_published": "2025-10-10T10:04:00.000Z"
}
