{
  "title": "Regional countries shows keen interest to become part of CPEC: Speaker NA",
  "link": "https://www.app.com.pk/national/regional-countries-shows-keen-interest-to-become-part-of-cpec-speaker-na/",
  "date_published": "2020-11-13T11:31:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 13 (APP): Speaker National Assembly, Asad Qaiser here on Friday said that regional countries including Afghanistan have showed keen interest to become part of China Pakistan Economic Corridor (CPEC).\nAsad Qaiser said CPEC has attracted a number of countries of the region and showed strong commitment to become part of the multi-billion dollar project due to its enormous economic and trade benefits. Likewise, he added that Afghanistan Government had also expressed commitment to become a partner in the mega project.\nHe was addressing the dialogue titled “ Role of Parliament in promoting Investment, Trade and People to People exchange under the CPEC,” organized by National Assembly Secretariat, Islamabad here at local hotel. The function was also addressed by KP Chief Minister, Mahmood Khan, Chief of Parliamentary Committee on CPEC, Sher Ali Arbab and others speakers.\nThe Speaker National Assembly said CPEC project was a multifaceted project that would change the destiny of people of the region including Pakistan by ushering a new era of progress, prosperity and development.\nHe said KP was located in strategic position that would largely benefited from CPEC. He said solid efforts would be made on Parliament level to ensure maximum benefits from projects under the CPEC for KP. Similarly he was also playing part in getting due rights of the province including its share on account of the hydel power profit.\nAsad Qaiser said administrative officers concerned were directed to expedite work on their part on cases pertaining to KP’s rights and CPEC projects and forward it to Islamabad at earliest for further progress in this regard.\nHe said this region had suffered the most due to Afghanistan conflict and resultantly business and trade activities got adversely affected in the entire region including KP.\nAsad Qaiser said Peshawar used to be a trade and business center in the past and constructive efforts were being made to make it again a hub of business and trade. In this regard, he added that a friendship Group had been revived with Afghanistan. He said lasting peace in Afghanistan was vital to take full advantage of CPEC by Central Asians Republics (CARs) and Kabul.\nThe Speaker said the government was committed to promote trade and business relations with neighboring countries including Afghanistan. Asad Qaiser added that he would be visiting Afganistan along with a delegation in December that would help further strengthen relations between the two countries.\nDuring the visit, the NA speaker said a gamut of issues would be discussed with Afghan officials concerned regarding trade relations and matters with regard to inclusion of Afghanistan in CPEC during his visit.\nChief of Parliamentary Committee on CPEC, Sher Ali Arbab said CPEC was a key project that would open up a new chapter of prosperity and development in the entire region including Pakistan.\nIn the first phase of CPEC, focus on strengthening of infrastructure was made while in the second phase the attention was being made to investment and trade.\nPakistan is looking forward to Afghanistan becoming a partner in CPEC like China. He said every part and province of the country would be visited to get people feedback on this vital project.",
  "retrievedAt": "2025-08-11T20:00:55.461Z"
}
