{
  "title": "FJWU organizes Seerat un Nabi (SAW) conference",
  "link": "https://www.app.com.pk/national/fjwu-organizes-seerat-un-nabi-saw-conference/",
  "date_published": "2020-11-13T16:48:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 13 (APP): Fatima Jinnah Women University organized one-day conference titled “Peace and Reconciliation in the Light of Prophetic Teachings (PBUH)” to commemorate the ‘Shan-e-Ramat ul Lil Alameen’ week.\nFJWU Islamic Studies Department Incharge Dr. Shehzadi Pakeeza was the conference coordinator for the Seerat conference. Senator Sitara Ayaz was the chief guest of the conference while Council of Academic Ideology Secretary Dr. Zia-ul-Haq, Director General of the Islamic Research Institute Professor Dr. Muhammad Zia-ul-Haq were also present on this occasion.\nSpeaking on the occasion, Sitara Ayaz said that Islam was the biggest ambassador of female rights. The Holy Quran was the source of information for all of us irrespective of times and ages, she said and added that all our problems could be resolved by following the teachings of Holy Quran and Holy Prophet (SWA).\nDr. Zia-ul-Haq said that the role of the Holy Prophet (PBUH) was exemplary for all of us. He shed light on the economic, social, religious and political life of the last Holy Prophet (PBUH).\nDr. Ikraam-ul Haq stressed upon converting our differences into diversity if we want to excel as a whole and hoped that female students would be the best ambassadors of the peace and conciliation in their societies, as well as to serve their communities and to employ their education, training and experience in the service of their people and their communities. He quoted the Prophet (SAW) as saying “The best people are those who are most beneficial to other people.”\nDr. Shehzadi Pakeeza said that her department was providing religious as well as scientific education to national and international students and FJWU has gained a significant place as an international educational institution.\nRenowned scholars from different Universities, Faculty members of Fatima Jinnah Women University, research students of different Universities presented their research papers and shared their knowledge.",
  "retrievedAt": "2025-08-11T20:00:49.808Z"
}
