{
  "title": "1,100 km roads, 3,5000 youths training among PM’s development package for South Balochistan",
  "link": "https://www.app.com.pk/national/1100-km-roads-35000-youths-training-among-pms-development-package-for-south-balochistan/",
  "date_published": "2020-11-13T18:45:00.000Z",
  "source": "APP",
  "content": "TURBAT, Nov 13 (APP): Prime Minister Imran Khan Friday announced a mega development project for South Balochistan areas featuring construction of 1,100 kilometer roads, skill training to 3,500 youth and expansion of power and gas supply networks.\nDuring his day long visit here, the prime minister also inaugurated Daar-ul-Ehsaas facility for the orphan and other poor children to provide them free shelter, food and education.\nThe Waseela-e-Taleem program, also launched by the prime minister, would help enroll additional 83,000 children in the schools. Moreover, 640,000 children, including 360,000 out of school and 280,000 school going, would be facilitated through accelerated and distance learning programs.\nOn the occasion, the prime minister also kicked off the nationwide Waseela-e-Taleem Digital Program for primary school going students.\nThe plan also contains Ehsaas’ Educational Scholarships for the deserving primary school girls and undergraduates of the area.\nSpecial Assistant to the PM on Poverty Reduction Dr. Sania Nishtar briefed the prime minister on Daar-ul-Ehsaas and Ehsaas’ Educational Scholarships programmes.\nThe prime minister performed the ground-breaking of various development projects, including Extension of Turbat Airport, 200- bed Makran Medical Teaching Hospital, University of Turbat, Phase-II, and Hoshab-Awaran section of M-8 (146 km two-lane road).\nOn this occasion, he was also briefed and updated by the National Highway Authority (NHA) officials about the progress on Basima-Khuzdar Road N-30 (106 km two-lane road).\nUnder the development package, around 320,000 additional households would be supplied electricity besides enhancing electricity network from existing 12 percent to 57 percent of the households. Around 15 percent of the Ehsaas beneficiary families would get subsidized LPG at 33pc of the cost.\nThe package comprises construction of 210 basic health units, annual addition of 150 local nurses and improved nutrition for 7000 households under Ehsaas Nashonuma program.\nEstablishment of six border markets, cash transfer to additional 25,000 families, loan for 2,000 fishermen, three dates processing units and an olive extraction unit are also part of the development package besides technological support for marble and mineral industry.\nUnder the plan, 35,000 youth would be imparted skill training to enable them earn as freelancer besides extending internet facility to another 0.5 million people.\nMoreover, 0.15 million acres land would be cultivated and 16 dams to be constructed to add 0.5 million acres feet of water storage.\nWith the construction of 1,100 kilometer road network, 1.9 million people would get access to larger market.\nThe development plan is expected to create more than 120,000 jobs for the area where 0.7 million people of up to 35 years are unemployed.",
  "retrievedAt": "2025-08-11T20:00:48.564Z"
}
