{
  "title": "PNS Tabuk joins naval fleet after commissioning ceremony at Romania",
  "link": "https://www.app.com.pk/national/pns-tabuk-joins-naval-fleet-after-commissioning-ceremony-at-romania/",
  "date_published": "2020-11-13T12:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): The newly built Pakistan Navy Ship (PNS) TABUK joined the naval fleet after its commissioning ceremony was held at Black Sea port of Constanta, Romania.\nThe contract for two Corvettes for Pakistan Navy was signed between Ministry of Defense Production Pakistan and M/s DAMEN, Romania, said a Pakistan Navy press release.\nFirst ship of class, PNS YARMOOK was commissioned earlier this year, whereas, PNS TABUK has also joined Pakistan Navy Fleet.\nPNS TABUK was a multipurpose and highly adaptive platform of medium size and tonnage.\nThe ship was equipped with state of the art electronic warfare, anti-ship and anti-air weapons and sensors along with modern self-protection and terminal defense systems.\nThe ship was capable to perform a variety of maritime operations in a complex maritime environment and could embark multi role helicopter and an Unmanned Aerial Vehicle (UAV) simultaneously.\nWhile addressing the ceremony, the Commanding Officer of PNS TABUK, stressed upon the significance of this project and laid emphasis on the additional set of capabilities added to the Pakistan Navy sphere of operations with the induction of these potent platforms.\nHe further highlighted the impact of these platforms to ensure forward presence and perpetual readiness in the area of operations while being deployed on PN’s initiative of Regional Maritime Security Patrols in the Indian Ocean Region.\nHe also acknowledged the professional competence and shipbuilding acumen of DAMEN Shipyards and showed confidence in prospects of future cooperation in delivering cutting edge naval technologies to Pakistan Navy.\nThe impressive ceremony was attended by Chief Naval Overseer (Romania), Ship’s Crew and Senior Management of DAMEN Shipyards, Gorinchem and Galati.",
  "retrievedAt": "2025-08-11T20:00:53.724Z"
}
