{
  "title": "Pakistan’s economic recovery pace fastest in Sub-continent: PM",
  "link": "https://www.app.com.pk/national/pakistans-economic-recovery-pace-fastest-in-sub-continent-pm/",
  "date_published": "2020-11-13T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Prime Minister Imran Khan Friday said Pakistan was moving towards economic recovery faster than any other country in the Sub-continent.\n“Masha Allah (Pakistan) moving towards economic recovery faster than any country in Sub-continent & this despite having to deal with COVID-19 challenge,” the prime minister said on Twitter while sharing a media report showing growth of large scale manufacturing (LSM) sector by 4.8 per cent in the first quarter of current fiscal.\nMashaAllah Pak moving towards economic recovery faster than any country in subcontinent & this despite having to deal with Covid 19 challenge. LSM's impressive growth of 7.7% in Sept. Our Industrial Energy Package will help add capacity & raise production.https://t.co/sjRHDxIzwE\n— Imran Khan (@ImranKhanPTI) November 13, 2020\nAccording to the media report, the 4.8pc growth rate gave a ray of hope for the revival of economic activities as out of 15 major industries, nine saw a surge in production. It said the LSM sector recorded 7.7% year-on-year growth in September, after it contracted more than 10% in the previous fiscal year.\nThe prime minister, while calling the LSM sector’s 7.7pc growth in September as “impressive”, hoped that the Industrial Energy Package announced by the government would help add capacity and raise production.\nOn November 3, the prime minister had announced a relief package for the industrial sector with 50 percent reduction in rate of commercial electricity on additional usage by Small and Medium Enterprises.\nMoreover, for next three years, all industries on additional usage of electricity would be provided 25 percent relief considering their previous bills, besides ending peak-hour system for commercial electricity users.",
  "retrievedAt": "2025-08-11T20:00:50.415Z"
}
