{
  "title": "Worse Covid-19 situation ahead, minister advises to follow SOPs strictly",
  "link": "https://www.app.com.pk/national/worse-covid-19-situation-ahead-minister-advises-to-follow-sops-strictly/",
  "date_published": "2020-11-13T07:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Minister for Health in Punjab Dr Yasmin Rashid on Friday warned the public about the worse Covid-19 situation ahead which could be further deteriorated if they would not practice precautionary measures.\nTalking to a private news channel, she expressed her serious concern over the spread of second wave of Covid -19 pandemic and advised to follow government’s SOPs strictly as our hospitals may not be able to cope with the fast increasing number of patients.\n“The second wave of coronavirus will be more dangerous than the previous one due to changing weather conditions; the threat is real but no one seems to be taking it seriously,” she remarked.\nShe said the provincial government had yet not taken any decision on the closure of markets and we are not in favour of market closure but if business community would not follow government guidelines then we definitely will move for this step as well.\n“The government will go for closing of the shops, even bazaars and markets in case of non-observance of SOPs,” she warned.\n“Everybody should realize their responsibility and ensure social distancing,” she said.\nYasmin said the traders association were responsible to ensure compliance of SOPs but those were being violated in the markets and thus increasing risk of the outbreak.\n“An effective media campaign is also going to be launched across the country to create education and awareness among the masses for voluntary compliance of SOPs”, she added.\nReplying to a question, she said the political leadership across the political spectrum need to demonstrate message to the entire nation for taking preventive steps and follow sop’s.\nShe said the National Command and Operation Centre (NCOC) also suggested to enhance restrictions on high-risk sectors, particularly large public gatherings, and called for early approval of the measures after reaching a consensus with the stakeholders.\nShe said in Punjab more than 600 areas were under smart lockdown and contact tracing was also started there.\nThe Punjab government also decided to reimposed ‘micro-smart lockdowns’ in the city’s virus hot spots, she added.",
  "retrievedAt": "2025-08-11T20:00:55.862Z"
}
