{
  "title": "Zulfi pledges massive jobs through tourism promotion in GB",
  "link": "https://www.app.com.pk/national/zulfi-pledges-massive-jobs-through-tourism-promotion-in-gb/",
  "date_published": "2020-11-13T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): National Tourism Coordination Board (NTCB) Chairman Sayed Zulfikar Abbas Bukhari Friday pledged to create massive job opportunities by fast-tracking tourism development in Gilgit Baltistan (GB) in coming days.\nMustering the public support for PTI candidates in the GB elections, scheduled to be held on November 15, he assured a mammoth gathering in the Gilgit City that his party would roll out a comprehensive tourism development package for the area after coming into the power.\nUnder the package, he said ten recreational areas had been identified for setting up tourism zones in the GB. The feasibility report of four zones had already been finalized while the rest of them were expected to be completed by the next month.\nThe tourism zones spanning over 100 kilometers area would be established in various localities including Hunza, Diamer, Ghizer, Shigar and Skardu with quality restaurants, tourism police and proper road infrastructure.\nZulfikar Bukhari, who also holds the Prime Minister’s Special Assistant (SAPM) on Overseas Pakistanis and Human Resource Development portfolio, said the initiative was meant to create a lot of employment opportunities for the people of the GB.\nMentioning the tourism authority created in Khyber Pakhtunkhwa by the provincial government, he said efforts were afoot to set up such authorities in Punjab and the GB on same pattern for reforming the tourism sector.\nThe NTCB chairman said concerted efforts were being made to revamp hotels of Pakistan Tourism Development Corporation (PTDC) at par with international standards to spur economic activities and job creation in GB.\nHe said the PTDC would soon issue tender for hiring professional consultant to transform all of its GB-based hotels into top-class facilities.Each hotel, after transformation, was expected create 150 direct jobs for locals, he added.\nHe also informed the GB dwellers about the federal government’s plan of setting up vocational and technical training institutions in the area to increase skilled workforce by imparting skills to the youth in the high tech and traditional trades.\nZulfikar Bukhari said his ministry would set up a branch of Overseas Pakistanis Foundation and a protectorate office to send maximum number of youth abroad for foreign employment.\nHe said mountaineering and trekking club, and museum were among other initiatives under the comprehensive plan formulated for uplifting tourism sector in the GB.\nThe SAPM said the federal government, after winning the GB elections, would set up sports complex in its three divisions.Each complex would have hockey, football and cricket stadiums, he added.\nHe regretted that the past governments had failed to provide basic amenities to the people of GB despite ruling the area for last several years.\nZulfiakr Bukhari criticized Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto Zardari for his party’s bad governance in Sindh.\nHe believed that Bilawal could not ensure development of the GB as he even could not uplift the living standards of his constituency despite winning elections from there.\nHe assured that the Pakistan Tehreek-e-Insaf (PTI), after coming into power, would make all-out efforts to remove sense of deprivation from the people of GB.\n“It is only Prime Minister Imran Khan who will grant provisional provincial status to the GB,” he maintained.",
  "retrievedAt": "2025-08-11T20:00:54.683Z"
}
