{
  "title": "MoCC committed to enhanced research and monitoring of forests, wildlife resources",
  "link": "https://www.app.com.pk/national/mocc-committed-to-enhanced-research-and-monitoring-of-forests-wildlife-resources/",
  "date_published": "2020-11-13T12:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Special Assistant to Prime Minister on Climate Change (SAPM) Malik Amin Aslam Friday said boosting forestry and wildlife research in the country can significantly help stem over-exploitation of forest and wildlife resources and promote their sustainable management.\nHe remarked that low policy priority, lack of development vision on the part of forest planners and managers, lack of funds for forestry and wildlife research and capacity-building of forest experts during years of preceding governments have long blocked efforts for the conservation and protection of the country’s forest and wildlife resources, the development of effective research and development, said a news release issued here.\n“Given the reasons of research and monitoring gaps, the forest and wildlife resources, which feed various socio-economic goals including poverty reduction, environmental development and climate change resilience, have suffered only over-exploitation, increasing country’s vulnerability to climate change-induced disasters, air pollution and loss of overall biodiversity in the country,” the PM’s aide pointed out.\nHe emphasized that however removing the constraints to the enhanced forestry and wildlife research is vital to enabling research institutions and researchers to plug the forestry research gaps to meet sustainable forestry and wildlife for achieving various socio-economic and environmental development goals through sustainable management of the forest and wildlife resources in the country.\n“Bringing the issues that hold back forestry and wildlife research to the attention of wider audiences, of policy-makers and planners is key to drawing attention to identifying appropriate solutions to the problems that forestry and wildlife research is presently facing the country,” Malik Amin Aslam suggested.\nHe told media further that as a part of the Prime Minister Imran Khan’s vision and programmes for protection and conservation of country’s ailing forestry and wildlife resources through research-based sustainable management, a national forest and wildlife research and monitoring center has been established in picturesque Nadi Banglow forest area of Balakot town in Mansehra district, which he inaugurated recently to plug the research and monitoring gaps.\nThe forest and wildlife research center has been established jointly by the Ministry of Climate Change Khyber-Pakhtunkhwa Forest and Wildlife Department in collaboration with the UN Development Programme Funded Sustainable Forest Management project.\n“I pushed for the case with the Prime Minister Imran Khan and persuaded him for establishing a much-needed forest and wildlife research center, which could meet global research standards and help promote the enhanced protection and conservation of the country’s forest and wildlife resources,” he recalled.\nPakistan is home to rich and diverse flora and fauna in a wide range of habitats from sea level to high elevation areas in the mountains, including around 177 mammal and 660 bird species.\n“But these flora and fauna resources are at risk of unsustainable use, hunting and poaching, which has badly disturbed the very balance of the biodiversity in the country, resulting in various environmental, climate change and socio-economic challenges,” Malik Amin Aslam highlighted.\nMeanwhile, spelling of out the goals and roles of the newly-established forest and wildlife research and monitoring center of global significance, the PM’s aide Malik Amin told media that besides being a research and capacity-building institution of global standard, the mission research center is to expand through research the fundamental and applied knowledge upon which forestry, forest products, wildlife and fisheries sectors are dependent.\nThe center would also be of unprecedented help in conserving, protecting, developing and using the forest, forest products, wildlife and fisheries resources of the country through research, technology transfer and other service activities.\nIt would also have identified opportunities for collaboration with various countries, which are known for effective forest and wildlife resources’ management to conduct joint research and monitoring of the natural resources for their overall environmental and climate sustainability, he added.\nHe said further that the center would focus on various sub sectors of forest and wildlife including forest biology, wildlife, forest economics, fisheries and watershed management, forest carbon sequestration measurements, human-wildlife conflicts and human-forest socio-economic relationship.\nMalik Amin Aslam noted that today foresters and wildlife researchers, experts, scientists, biologists and policymakers are confronted with new challenges and new expectations from society.\n“These experts are expected to provide an increasingly wide variety of goods and services from ecosystems at a time when natural systems are under mounting pressures from both environmental and economic forces,” he emphasised.\nThe PM’s aide however suggested that the challenge, however, can be coped with through significant increase in the efficiency of both research capacity of these experts and sustainable forest resources’ management.\nHe highlighted that it is particularly of an unprecedented importance that research and management work inter-connectedly to provide a scientific basis for sustainable management of the forest and wildlife resources.",
  "retrievedAt": "2025-08-11T20:00:53.985Z"
}
