{
  "title": "Masjid-e-Nabvi’s sanctity violated on purpose: Ashrafi",
  "link": "https://www.app.com.pk/national/masjid-e-nabvis-sanctity-violated-on-purpose-ashrafi/",
  "date_published": "2022-05-01T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Tahir Mehmood Ashrafi on Sunday said the sanctity of Masjid-e-Nabvi was violated on purpose in a bid to achieve political mileage.\nAddressing a press conference, he said he was eye-witness of the entire scenario as some agitators were deputed in groups at various places in Masjid-e-Nabvi as preplanned by their masterminds.\nHe said when the delegation of Prime Minister Muhammad Shehbaz Sharif arrived in Masjid-e-Nabvi to pay homage at the mausoleum of the Holy Prophet Mhammad (Peace Be Upon Him), the politically and religiously sick people chanted full-throat indecent slogans violating the reverence of the most sacred place after the Khana-e-Kaba.\nHe, with tearful eyes, lamented that the uproar was continued even during the call to Maghrib prayer.\nAshrafi, who is also the chairman of Pakistan Ulema Council, said this disgraceful incident had printed a bad impression of Pakistan all over the Muslim world and it would increase difficulties for the Pakistani diaspora in Saudi Arabia.\nInstead of condemning the immoral activity conducted by their workers in the Masjid-e-Nabvi, the Pakistan Tehreek-e-Insaf leaders were defending their ill-mannered and unruly behavior through illogical reasoning, he regretted.\nHe said the way PTI workers manhandled Federal Minister for Narcotics Control Nawabzada Shazain Bugti and Federal Minister for Information and Broadcasting Mariyyum Aurangzeb, it was highly condemnable and against the social, moral and religious ethics.\nHe said the people affiliated with Pakistan Muslim League-Nawaz and other coalition partners in Madina Munawara could have responded in befitting manner but the prestige and sanctity of the holy land was the topmost priority for us.\nClarifying his significant position, Ashrafi said he was not scared of any malicious social media campaign against him as he worked for the peace, progress and prosperity of the country and would keep on till his last breath of life.\nHe said he had no personal agenda but the sanctity of Roza-e-Rasool would not be compromised at all costs.\nHe said the prime minister and his team had forgiven those who misbehaved with them but the law would take its course.\nHe said he was grateful to Saudi leadership for according warm welcome to Prime Minister Muhammad Shehbaz Sharif and opened the doors of Khana-e-Kaba and Roza-e-Rasool in his and colleagues’ honour.\nAshrafi said it was a successful visit and expressed the hope that Pak-Saudi relations would attain new heights of glory in the present set-up as both the brotherly countries were standing by each other through thick and thin.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:48:16.136Z"
}
