{
  "title": "IWMB catch hunters involve in hunting Barking Deer at Trail-6",
  "link": "https://www.app.com.pk/national/iwmb-catch-hunters-involve-in-hunting-barking-deer-at-trail-6/",
  "date_published": "2022-05-01T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 01 (APP): The Islamabad Wildlife Management Board (IWMB) on Sunday caught two hunters red-handed at the Leopard Preserve Zone Trail-6 of Margalla Hills National Park while hunting a Barking Deer.\nThe alleged hunters were trapped after receiving reports from the Board's informers that disclosed that two days back some hunters had hunted a Barking Deer at Trail-6 Leopard Preserve Zone, IWMB Chairperson Rina Saeed Khan told APP while revealing the attempt of violence against preserved wildlife of the National Park.\nKhan said the IWMB patrolling teams were busy amid fire season at the higher sites of the National Park to contain fire incidents.\nThe hunters who hail from local Talhar village lying close to the Margalla Hills National Park were professional hunters and belong to a racket of hunters as there were three different hunter groups reported in the area, she added.\n\"The hunters taking advantage of the IWMB staff's presence in far-flung areas sneaked into the Leopard Preserve Zone and hunted the Barking Deer. However, taking care of their manner the Board team planned to catch them red-handed and got themselves hidden near the water tank in civil dress\", the IWMB chair said.\nAdeel, an IWMB undercover staffer while breaking into the scene made hair breadth escape from the hunter's fire as he was about to shoot him. The IWMB official successfully grabbed the rifle from the Hunter Ayass Khan whose accomplice Khan ran away from the scene on founding himself trapped.\nThe IWMB officials contacted the Islamabad Capital Territory Police to handover the culprits with the weapon used to illegally hunt the Deer. The Margalla Police Station team reached the spot and arrested the culprit and registered a First Information Report (FIR) for violating Islamabad Wildlife Protection Act Section 5-6-21-21 and possessing an illegal 12-Bore rifle for hunting a banned wildlife species.\nThe arrested hunter would face two years imprisonment as per the law and he would be made an example for the rest of the violators to abide by the law, said the IWMB chair.\nShe informed since the inception of the IWMB the precious wildlife of the Margalla Hills National Park was preserved after myriads of efforts to control the illegal hunters operating in the national park.\nKhan added that almost 19 additional wildlife guards have been recruited recently in the Board and their training was underway.\n\nShe said the Trail-6 area behind Faisal Mosque and the adjoining Kalinjar Valley had thriving number of wildlife species that were on at the target of hunters which would be taken to task at all costs.\nShe hoped that the arrest of this hunter would help in busting the remaining gangs of hunters present in the national park vicinity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:48:16.179Z"
}
