{
  "title": "ANF recovers over 396 kg narcotics, 1,012 liters chemical; arrests 21",
  "link": "https://www.app.com.pk/national/anf-recovers-over-396-kg-narcotics-1012-liters-chemical-arrests-21/",
  "date_published": "2022-05-01T10:35:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 01 (APP): Anti-Narcotics Force (ANF) Pakistan while conducting counter-narcotics strikes in different areas of the country managed to recover over 396 kg narcotics, 15,000 intoxicated tablets, 1,012 liters prohibited chemical besides netting 21 accused during last seven days.\nAccording to an ANF headquarters spokesman, ANF Rawalpindi in an operation conducted at Islamabad International Airport recovered 9000 intoxicated tablets weighing 1.620 kg and 1.210 kg narcotic substance from the possession of a passenger.\nThe accused namely Faryad Ali resident of Nowshera was going to Madina through PIA flight no PK-9713.\nIn another operation, ANF Rawalpindi recovered 6,000 intoxicated tablets weighing 2,680 grams from a passenger namely Tariq Khan at Islamabad International Airport.\nThe accused was going to Manchester through flight no VS-362 of Virgin Atlantic.\nANF Rawalpindi and ANF Intelligence in an operation foiled a bid to smuggle narcotics and recovered over 81 kg drugs from Honda Civic Reborn car.\nThe operation was conducted on Srinagar Highway near ‘Tablighi markaz’ and the raiding team recovered 81.800 kg narcotics including 62.400 kg charras and 19.200 kg opium besides arresting Muhammad Sajawal and his wife namely Bahisht.\nANF Rawalpindi in an operation recovered 630 grams charras from the possession of a passenger namely Afsar Khan, resident of Waziristan going to Abu-Dhabi through PIA flight no PA-230.\nANF Rawalpindi and ANF Intelligence in an operation foiled a bid to smuggle narcotics and recovered over 50 kg drugs from a car.\nThe raid was conducted near Islamabad Motorway Toll Plaza and ANF recovered over 46 kg charras, two kg opium and over two kg prohibited chemical from a car besides netting three accused namely Waqas Ali, Ghulam Murtaza and a female namely Yasmeen Manzoor.\nIn another operation conducted at Lahore Railway Station, ANF Punjab recovered 18 kg charras from a consignment of auto parts, sent from Quetta to Lahore through Railway Cargo.\nTwo persons namely Faryad and Amjad who received the consignment were arrested.\nANF Punjab in an operation conducted near Quaid-e-Azam Interchange, Ring Road Lahore arrested two accused namely Muhammad Israr and Faisal Khan for possessing 34.8 kg charras and 27.6 kg opium.\nIn another operation, ANF Lahore recovered nearly 900 grams heroin from a suspicious parcel being sent to London.\nThe parcel was booked by an accused namely Muhammad Asad for Muhammad Latif at an address of London.\nANF Punjab and ANF Intelligence in a joint operation conducted on Allama Iqbal International Airport, Lahore foiled a bid to smuggle narcotics and recovered heroin filled capsules from the possession of a passenger namely Shakeel Anjum resident of Sargodha going to Bahrain through PIA flight no PK-189.\nANF Punjab and ANF Intelligence in another operation conducted near Ravi Toll Plaza Motorway Lahore recovered nearly 18 kg heroin concealed in secret cavities of a car.\nAn accused namely Shehryar Ashraf resident of Rawalpindi was also arrested on the spot.\nANF Punjab conducted an operation at Allama Iqbal International Airport, Lahore and foiled a bid to smuggle narcotics to London.\nANF recovered over one kg heroin from a parcel containing gloves which was booked for London.\nANF Punjab while conducting raids in different areas of Multan recovered a large number of intoxicated tablets from a passenger namely Khadim Hussain resident of Bahawalpur, going to Jeddah through PIA flight no PK-8739. The tablets were concealed in women’s shoes.\nSecond operation was conducted by ANF Multan near timber market on Vehari Road Multan and ANF team recovered over one kg charras from the possession of an accused namely Javed Hussain resident of Multan.\nIn third operation, ANF Multan netted two accused namely Maqbool Hussain and Muhammad Nadeem for possessing nearly 1.2 kg charras.\nANF Sindh in an operation foiled a bid to smuggle drugs and recovered 12 kg charras concealed in auto parts sent from Quetta to Karachi through Al-Hikmat Cargo Bus Service. An accused namely Azhar was arrested on the spot.\nANF Balochistan conducted a raid and recovered 750 liters chemical used to produce heroin. ANF in a raid conducted in Chaghi, an area of Balochistan managed to recover over 750 liters chemical used to produce heroin.\nANF also recovered 1200 kg material used to produce opium and 750 kg poppy seeds.\nIn another raid, ANF Balochistan and ANF Intelligence recovered 149 kg drugs and 260 liters prohibited chemical from Alizai forest area on Quetta-Chaman Road.\nIn another operation, ANF Intelligence and ANF Peshawar recovered 103 heroin filled capsules containing 721 grams heroin from a passenger namely Muhammad Shoaib resident of Khyber Agency, going to Bahrain through Gulf Airline flight no GF-787.\nSeparate cases have been registered against the accused while further investigations are underway.",
  "retrievedAt": "2025-08-11T14:48:05.303Z"
}
