{
  "title": "President upholds major penalty against a woman harasser",
  "link": "https://www.app.com.pk/national/president-upholds-major-penalty-against-a-woman-harasser/",
  "date_published": "2022-05-01T07:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): President Dr Arif Alvi has rejected a petition of Dr Humayun Iqbal for setting aside the orders of conducting a denovo inquiry against him and upheld the major penalty of termination of service imposed upon the accused by the Anti-Harassment Committee and Syndicate of the Shaheed Zulfikar Ali Bhutto Medical University, Islamabad.\nThe accused had filed an appeal against the decision of Federal Ombudsman for Protection against Harassment of Women at Workplace to the extent of conducting denovo inquiry against him.\nThe ombudsman had set aside the findings/recommendations of the anti-harassment committee and sent the case back to the University for conducting denovo inquiry.\nMoreover, in a similar petition complainant had also requested to set aside the impugned order of the ombudsman and uphold the recommendations of the anti-harassment committee.\nAccording to the background of the case, the complainant, a graduate trainee, had filed a harassment complaint against the accused before the VC of Shaheed Zulfikar Ali Bhutto Medical University, Islamabad, who referred the matter to the anti-harassment committee of the University.\nThe Committee imposed a major penalty of termination of service upon the accused in 2018.\nFurthermore, the Syndicate of the University approved the recommendations of the committee and terminated the accused from the service.\nThe accused filed an appeal before the Ombudsman assailing the said penalty. The learned Ombudsman set aside the findings/recommendations of the anti-harassment committee and ordered to send the case back to the organization for conducting a denovo inquiry to provide both the parties full opportunity of hearing and producing the evidence.\nSubsequently, both the accused and the complainant filed the representations with the president against the decision of the Ombudsman. The accused prayed to set aside the order of the Ombudsman to the extent of conducting the denovo inquiry against him while the complainant requested to uphold the recommendations of the Anti-Harassment Committee.\nDuring the course of proceedings, it was informed that the previous conduct history of the accused reflected that he had sexually assaulted women in the past.\nHe was removed from being a registered doctor in the United Kingdom and also expelled from service by the Rawalpindi Institute of Cardiology on similar allegations of sexual harassment.\nThe president observed that very few women come forward with the complaint of harassment and those who do so have to face an uphill task of proving it.\nHe further observed that the said case has been lingering on since 2017 and it would be unfair to delay it further.\nHe maintained that the decision of the inquiry committee regarding the imposition of major penalty of termination of service was well constituted which was also upheld by the Syndicate of the University.\nThus, the instant petition of the accused was dismissed by the president upholding the recommendations of the inquiry committee and maintaining the orders of the Syndicate of the University to terminate the services of the accused.",
  "retrievedAt": "2025-08-11T14:48:06.980Z"
}
