{
  "title": "NUMS will lay research base for country’s indigenization of vaccines: NUMS VC",
  "link": "https://www.app.com.pk/national/nums-will-lay-research-base-for-countrys-indigenization-of-vaccines-nums-vc/",
  "date_published": "2022-01-11T10:15:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 11 (APP): Vice Chancellor National University of Medical Sciences (NUMS) Lt Gen Syed Muhammad Imran Majeed (Retd) said on Tuesday days were not far off when Pakistan would be making its own vaccines and NUMS Institute of Advanced Studies and Research (NIASR) would provide the research base for indigenization of vaccines and manufacturing of ingredients for essential drugs.\nHe was making these remarks in a TV programme on surging Omicron virus, medical education and production of local vaccines. He thanked the Planning Commission for approving Rs 3.488 billion to set up state-of-the-art research facilities at NIASR.\nNUMS is ready to start construction of this institute in Rawalpindi which would be a leap forward in bolstering the country’s research facilities.\nNUMS has already constituted its Task Forces under the Office of Research, Innovation and Commercialization (ORIC) and NUMS scholars were engaged with both national and international institutions to boost the country’s efforts in development of vaccines, pharmaceutical agents and on ensuring good nutrition.\nIndigenization of vaccines are national requirement and as viruses keep on mutating hence strain-specific vaccines  as required should be prepared , he added.\nSprawling over an area of 3.99 acres, NIASR has planned to train PhD scholars and researchers at world renowned research institutions in areas like Molecular Basis of Disease, Infectious Diseases, Vaccine Design, Cancer Biology, Animal Model of Disease, Pharmacogenomics, Epigenetics, Biotechnology & Drug Development, Bio Banking, Clinical Trials and Bioequivalence Studies.\nThe Vice Chancellor said the job of the universities is to do research and work out a strategy to develop  required technologies. He emphasized the need to establish strong linkages between the academia and the Private Sector.\nThe Private Sector needs to be encouraged and incentivized by the Govt. by formulating required policies and creating a conducive environment in this regard.\nSars COV 2, the virus that causes COVID-19, has a greater ability to multiply as compared to influenza and is tackled by those who had  strong immune system hence good nutrition was very important.\nAnswering another question on National Licensing Examination (NLE), he said it was an internationally accepted standard to  pass it before  practicing as a registered doctor.\nIt was introduced by Pakistan Medical Commission in the country in view of the mushroom growth of medical colleges in Private Sector to ensure quality of medical services.",
  "retrievedAt": "2025-08-11T14:05:02.901Z"
}
