{
  "title": "Consolidation of peace, stability in Afghanistan to help prevent possible exodus of Afghans: FS",
  "link": "https://www.app.com.pk/national/consolidation-of-peace-stability-in-afghanistan-to-help-prevent-possible-exodus-of-afghans-fs/",
  "date_published": "2022-01-11T16:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): Foreign Secretary Sohail Mahmood on Tuesday emphasized that consolidation of peace and stability in Afghanistan, including by ensuring the averting of a humanitarian crisis and economic collapse, would go a long way in preventing a possible exodus of Afghans from their country.\nHe expressed these views during the meeting with a delegation from European countries here at the Foreign Office.\nThe delegation is on a study visit to Pakistan, organized by the International Centre for Migration Policy Development (ICMPD), to assess the opportunities for support and cooperation in the realm of migration management.The Foreign Secretary interacted with members of the delegation and exchanged views on the regional situation, especially with respect to the developments in Afghanistan.\nHe also highlighted Pakistan’s unwavering commitment and hospitality in hosting more than 3 million Afghan Refugees for over 40 years.\nThe Foreign Secretary called for greater support from the international community to the refugee hosting countries in accordance with the principle of international burden and responsibility sharing.\nAppreciating ICMPD’s work in Pakistan in the areas of awareness raising and capacity building, the Foreign Secretary underscored the importance of safe, affordable and legal pathways to migration. Such open channels would help in curbing irregular migration, he added.\nThe Foreign Secretary also welcomed the engagement between countries of origin and countries of destination to better understand each other’s requirements and concerns.He noted Pakistan’s active participation as a responsible member of the ‘Budapest Process’ which is working towards controlling illegal migration and facilitating the reintegration of returnee migrants.The Foreign Secretary lauded the efforts of ICMPD in organising the study visit which provided a valuable opportunity for Pakistani stakeholders to interact with their European partners.\nHe reaffirmed Pakistan’s commitment to continue supporting ICMPD in the fulfillment of its mandate in line with national priorities.",
  "retrievedAt": "2025-08-11T14:04:58.698Z"
}
