{
  "title": "PM underpins efforts to boost exports, tax collection",
  "link": "https://www.app.com.pk/national/pm-underpins-efforts-to-boost-exports-tax-collection/",
  "date_published": "2022-01-11T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD Jan 11 (APP): Prime Minister Imran Khan Tuesday underlined that exports and tax collection were the two main driving agents to boost the country’s economy, over which the present government was fully focused.\nHe said the government was making strenuous efforts to remove all hurdles and bottlenecks faced by exporters, investors and businessmen and to give a spur to the exports industry.\nThe prime minister was addressing at an inaugural ceremony of 14th International Chambers Summit 2022 arranged by the Rawalpindi Chamber of Commerce and Industry (RCCI).\nThe prime minister said that in the past, no attention was paid to these sectors of the economy which were vital for wealth creation.\nHe said the exports sector was stagnant in the past, but the incumbent government was providing all facilitation to the exporters and stressed that exporters should be encouraged with awards and other incentives.\nHe observed that if the country’s exports were not increased, it could again put pressure on the current account and currency.\nThe summit was being attended by presidents of more than 54 regular chambers, 10 small chambers, 13 women chambers and representatives from the development partners, international business community, political parties, ministries and the government institutions.\nThe summit will provide an opportunity to the businessmen to seek resolution of their issues besides, presentation of solid proposals to the stakeholders for the formulation of the business-friendly policy of the country.\nThe prime minister said the government was constantly endeavouring to introduce incentives for ease of doing business and remove all bottlenecks which would help increase businessmen’s profits and develop a tax culture.\nHe also termed the introduction of mini-budget as an effort to document the economy. Out of the total estimated Rs11 trillion retail market, only Rs3 trillion market was registered.\nThe government was also working on full tax automation, he added.\nThe prime minister said “No government in Pakistan ever faced such big challenges like the fiscal and current account deficits. If our friends, Saudi Arabia and China would not have helped us, we would have defaulted due to our liabilities. We had no reserves to stem the depreciation of rupee.”\nHe said the country’s economy was going through a stabilization phase, but unfortunately, then came the Covid 19 which posed the century’s biggest challenge.\nIt was worth appreciable how Pakistan was out of the woods. The government not only saved the economy but also the lives of the people, he said, adding, the pandemic brought havoc across the world. In India, its economy was badly impacted with a huge death toll.\nThe prime minister said that he was criticized by the political opponents for not clamping a complete lockdown. But their decision of smart lockdown was being followed by the British prime minister Boris Johnson.\nThen came the challenge of Afghanistan and the flight of dollars which put pressure on rupee, he further added.\nThe prime minister said the world also witnessed a record surge in commodity prices as the supply and demand lines were disrupted by the pandemic. The people all over the world had been facing problems, he added.\nAbout commodity prices, the prime minister expressed the confidence that it would ease soon.\nThe prime minister further stressed upon developing a tax culture like the Scandinavian countries that have the highest tax ratio.\nHe observed that tax culture could not evolve in the country as the people were reluctant to pay taxes in the past, due to lack of trust over rulers who spent the public tax money on their luxurious living.\nHe said the present government was making efforts to spend available resources on the poor segments of society.\nHe referred to the health cards initiative under which each family was getting free health facility worth 1 million rupees. Such a health insurance was never thought of in the world.  To lift the living standards of poor segments of society, the government also launched Ehasaas programme and stipends.\nThe prime minister recounted that country’s exports for the first time in history reached to $31 billion, remittances recorded $32 billion, tax revenues reached to around Rs6000 billion.\nThe prime minister said the expansion of industry was vital for a country’s economy. In Pakistan, large-scale manufacturing (LSM) witnessed a growth by 15 percent. The corporate profits reached Rs930 billion while private sector offtake touched Rs1138 billion. IT sector exports recorded 70 percent increase reaching to about $3 billion, the prime minister said while enumerating the growth of the economy due to the government’s business-friendly policies.\nHe said the construction sector was also on the boom while the rural agriculture economy earned Rs1100 billion where 60 to 65 pc population of the country was residing. The change in their economic condition could be gauged from the increased sale of motorcycles.\nThe prime minister said Pakistan was still a cheaper country when compared with petroleum product prices in India and others in the region.\nAbout state of Madina, the prime minister said it had brought the biggest revolution in the world, transforming the humble people as the leaders of the world.\nHe also shared Allama Iqbal’s opinion that a Muslim society would always rise to prominence when it followed the model of Riyasat-e-Madina.\nThe prime minister further said that rule of law in a society was critical as in its absence, corruption would assume the role of cancer.\n“Corruption is a symptom of lack of rule of law in a society. Our fight is for the rule of law in Pakistan. It is a difficult one because of different cartels and mafias who did not want the rule of law,” he said terming it a ‘Jihad’ against these mafias to secure future of the country.\n“In a banana republic, there are two sets of laws for the powerful and the weak,” he maintained.\nThe prime minister stressed that alongside him (Imran Khan), the society would have to carry out this struggle because it was connected with the economic prosperity. “Nations had been destroyed due to corruption and lack of rule of law,” he added.\nThe prime minister said Pakistan had huge potential to excel on the economic front and, in tourism sector alone, they could earn to meet the current account deficit.\nHe also assured the participants that all facilities and utilities would be provided for setting up industrial zones along the Rawalpindi Ring Road project.\nHe informed that the project was in the final stages which was delayed due to corruption that changed its alignment.\nHe also regretted that any initiatives like this one always drew speculations only for the real estate business, shooting up prices of lands.\nHe assured that government would ensure provision of lands on lease at affordable prices to set up economic zones.",
  "retrievedAt": "2025-08-11T14:05:02.929Z"
}
