{
  "title": "KP CM directs stern action against profiteers, monitoring of prices",
  "link": "https://www.app.com.pk/national/kp-cm-directs-stern-action-against-profiteers-monitoring-of-prices/",
  "date_published": "2022-01-11T13:24:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jan 11 (APP): Khyber Pakhtunkhwa Chief Minister Mahmood Khan has directed the district administration to take stern action against overcharging and ensure implementation of the officially fixed price list in their respective districts.\nHe issued these directives while presiding over a meeting to review latest prices of food items and administrative measures to control the rates of edibles here on Tuesday.The meeting reviewed the latest prices of 17 essential kitchen items including wheat flour and sugar etc.\nBesides, Chief Secretary Dr. Shehzad Bangash, Principal Secretary to CM Amjad Ali Khan, Secretary Home Khushal Khan and Secretary Food Dr. Kazim Hussain, other concerned authorities also attended the meeting.\nThe chief minister on the occasion directed the quarters concerned to generate reports regarding prices of food items across the province on a monthly basis and strictly monitor hoarding and over pricing.\nThe chief minister further directed the authorities concerned to put in place an effective mechanism to ensure provision of urea to farmers at government fixed rates.\nThe meeting made a comparative analysis of prices of food items in Khyber Pakhtunkhwa and other federating units. The meeting was told that as compared to other provinces of the country, the prices of most of the food items were on lower side in Khyber Pakhtunkhwa adding that during the last week price of seven items had decreased which include Irri, Masoor, Mong, Mash, Potatoes, Tomatoes and Sugar while price of six items remained unchanged.\nMoreover, the price of four items slightly increased. Briefing the meeting about wheat reserves in the province, it was informed that a huge stock of wheat was available in provincial reserve centres, which was sufficient upto the upcoming harvesting season. A total of 7000 metric tons was being released to flour mills on a daily basis.\nThe participants were told that, in the month of December, a total of 6722 shops and 479 mills were checked while actions had been taken against 735 shops which violated the relevant laws.It was added that fines worth Rs. over 1.9 million had been imposed on violators.\nBriefing about the sugar stock situation in the province, it was told that over 85 thousand metric tons of sugar was available in stock. In order to control sugar prices, since 1st January a total of 2423 units had been checked and warnings to 358 shops were issued while FIRs had been registered against 17 shop owners.",
  "retrievedAt": "2025-08-11T14:04:56.049Z"
}
