{
  "title": "HR violations reach alarming proportions in IIOJK: Report",
  "link": "https://www.app.com.pk/national/hr-violations-reach-alarming-proportions-in-iiojk-report/",
  "date_published": "2023-03-24T07:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): The worst human rights violations perpetrated by Indian troops in Indian illegally occupied Jammu and Kashmir (IIOJK), paramilitary and police personnel have reached alarming proportions since the Bharatiya Janata Party (BJP) Indian government repealed the territory’s special status in August 2019.\nAccording to a report compiled by Kashmir Media Service, it said that though Amnesty and US annual reports have been raising alarm about rights violations in IIOJK yet Indian troops, paramilitary and police personnel were arbitrarily arresting, torturing and killing Kashmiris on a daily basis during so-called cordon and search operations (CASOs).\nIt said over 96,000 people, including young boys and women, had fallen to Indian bullets since January 1989 till date in IIOJK, adding India is using draconian laws, Armed Forces Special Powers Act (AFSPA), Public Safety Act (PSA) and Unlawful Activities Prevention Act (UAPA) to stifle political dissent in the territory.\nThe report said that the Indian government while violating international laws, is not listening to the global calls to stop human rights violations in IIOJK.\nThe report maintained that the United Nations must take notice of heinous rights abuses in the occupied territory and bring Indian troops and all its men in uniform as well as the Indian government to book for their crimes in the occupied territory.\nMeanwhile, APHC spokesman in a statement issued in Srinagar has deplored that India wants to crush the Kashmiris freedom struggle with military might and appealed to the world human rights organizations to impress upon India to stop violating the basic rights of the detainees.\nHe said people’s struggles for the realization of their political will can never be crushed through force, illegal detentions and the strength of military might.\nHe added that the Kashmiris would stay united and would continue their struggle till the ongoing freedom movement reached its logical conclusion.\nHe said all outstanding issues between India and Pakistan, including the Kashmir dispute, can be resolved through meaningful dialogue.",
  "retrievedAt": "2025-08-11T08:07:01.771Z"
}
