{
  "title": "President confers military awards on armed forces personnel",
  "link": "https://www.app.com.pk/national/president-confers-military-awards-on-51-armed-forces-personnel/",
  "date_published": "2023-03-24T08:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): President Dr Arif Alvi on Friday conferred military awards on the serving and martyred armed forces personnel at a Pakistan Day investiture ceremony held here at the Aiwan-e-Sadr.\nA total of 49 officers and soldiers of the Pakistan Army, Navy and Air Force received the military awards including the families of four martyred troops in the categories of Nishan-i-Imtiaz, Hilal-i-Imtiaz, and Sitara-i-Basalat. Two foreign dignitaries from friendly countries also received prestigious awards.\nChairman Joint Chiefs of Staff Committee Lt Gen Sahir Shamshad Mirza, Chief of the Army Staff General Asim Munir, Chief of the Naval Staff Admiral Amjad Khan Niazi, Chief of the Air Staff Air Chief Marshal Zaheer Ahmed Babar Sidhu, diplomats and senior official attended the ceremony.\nCommander of Bahrain National Guards Shaikh Mohammed Bin Salman Al-Khalifa was awarded Nishan-i-Imtiaz (military) and Defence Attache of Saudi Arabia Major General (Pilot) Staff Awad Bin Abdullah Alzahrani was given Hilal-i-Imtiaz (military) in recognition to their illustrious services of strengthening defence ties with Pakistan.\nThe president conferred Sitara-i-Bisalat on the martyrs of the Pakistan Army in recognition of their valour demonstrated while fighting terrorists in operation areas. The awards were received by the family members of the martyrs, including Major Shujaat Hussain (30 Baloch Regiment, martyred in Angoor Adda, South Waziristan); Captain Bilal Khalil (Army Medical Corps, martyred in Noshki, Balochistan); Captain Faheem Abbas (72 Punjab Regiment, martyred in Jani Khel area of Bannu); and Sepoy Muhammad Waqas (18 Frontier Force Regiment, martyred in North Waziristan).\nPresident conferred Hilal-i-Imtiaz (military) on Air Marshal Chaudhry Ahsan Rafiq (Air Headquarters), Air Marshal Waqas Ahmed Sulehri (AHQ), Maj Gen Khurram Nisar (Joint Services HQ), Maj Gen Qamar un Nisa Chaudhry (Army Medical Corps), Maj Gen Irfan Ali Mirza (AMC), Maj Gen Muhammad Rafiq Zafar (AMC), Rear Admiral Javed Iqbal (Naval Headquarters), Rear Admiral Muhammad Sohail Arshad (NHQ), Rear Admiral Salman Ilyas (NHQ), Air Vice Marshal Muhammad Nadeem Sabir (AHQ), Maj Gen Syed Khurram Shahzad (AMC), Maj Gen Bilal Umair (AMC), Maj Gen Muhammad Wasim (AMC), Maj Gen Muhammad Suhail Amin (AMC), Maj Gen Ariq ur Rehman Sulehria (AMC), Maj Gen Muhammad Aleem (AMC), Air Vice Marshal Salman Abbas Shah (AHQ), Maj Gen Muhammad Avais Dastgir (General Headquaretrs), Maj Gen Ahmed Sharif Chaudhry (JS HQ), Rear Admiral Muhammad Faisal Abbasi (NHQ), Maj Gen Omar Ahmed Bokhari (GHQ), Maj Gen Inayat Hussain (GHQ), Maj Gen Kamal Azfar (Frontier Works Organization), Maj Gen Muhammad Aamer Najam (National Defence University), Maj Gen Adil Yameen (GHQ), Maj Gen Fahim Amer (Inter Services Intelligence), Maj Gen Shahid Manzoor (JS HQ), Maj Gen Muhammad Kashif Azad (ISI), Maj Gen Tabassum Habib (GHQ), Maj Gen Kamran Ahmed Satti (GHQ), Maj Gen Adil Rehmani, Maj Gen Muhammad Hassan Khattak (ISI), Maj Gen Muhammad Shuja Anwar (General Officer Commanding), Maj Gen Majid Jahangir (JS HQ), Maj Gen Azhar Waqas (Rangers), Maj Gen Asif Mahmood Goraya (Army Air Defence), Maj Gen Akif Iqbal (ISI), Maj Gen Rashid Mahmood, Maj Gen Muhammad Irfan (GOC), Maj Gen Dilawar Khan (JS HQ), Maj Gen Abdul Moeed (GOC), Rear Admiral Muhammad Saleem (NHQ), Air Vice Marshal Shams ul Haq (AHQ), Maj Gen Chaudhry Muhammad Qamar ul Haq Noor, and Air Vice Marshal Muhammad Qaiser Janjua (AHQ).",
  "retrievedAt": "2025-08-11T08:07:01.106Z"
}
