{
  "title": "Govt welcomes comprehensive not transactional dialogue with PTI: Kh Asif",
  "link": "https://www.app.com.pk/national/govt-welcomes-comprehensive-not-transactional-dialogue-with-pti-kh-asif/",
  "date_published": "2023-03-24T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP):Minister for Defence, Khawaja Muhammad Asif on Friday said the government was ready to hold a comprehensive dialogue with the Pakistan Tehreek-e-Insaf (PTI) for the sake of the country’s prosperity and national interest.\nThe government would not oblige by entering into any transactional dialogue with the opposition, as nothing would come out of it, he said.\nAddressing a news conference with the foreign media flanked by the Minister for Information and Broadcasting, Marriyum Aurangzeb, the Defence Minister briefed the foreign correspondents on the so-called PTI narrative and subversions of the constitution.\nKhawaja Asif said, “We assumed this govt almost a year back. We are completing one year in power as a result of the successful vote of no confidence against the then government.”\n“To prevent that vote of no confidence different unconstitutional actions were taken by Imran Khan’s government and his collaborators were the President and Deputy Speaker.”\nHe added that around midnight the decisions of dissolution of the assembly and other decisions were overturned by the Supreme Court.\n“That fateful night the constitution was undermined and violated and thankfully Supreme Court intervened and set things right and we are in the government today,” he added.\nThe Minister said a lot had happened over the last year in the political journey of the opposition. “Imran Khan’s political journey started with a cypher.\nToday Shireen Mazari has written a letter to the US raising the issue of so-called human rights violations in Pakistan.\nThis is the same country which was accused of conspiracy against Pakistan and Imran Khan’s government. The same people are asking for help from the alleged perpetrators of the foreign conspiracy.\nThis is the sum total of Imran Khan’s political journey. His dismissal from the government and SOS to the US,” he said.\nThe Minister maintained that nowhere in the world an accused had ever refused to appear in court. “Imran Khan refused to appear in the courts on different pretexts and security reasons or reasons of being victimized.\nAnd then his appearance is accepted in the court while he still sits in the car and he actually attacks the courts or the courts are mocked by his supports,” he added.\nKhawaja Asif alleged that every time he appeared in the courts, the judiciary was intimidated.\nHe informed that when the police team was sent to his residence to arrest him and produce him in the court, adding, “The police were attacked as a result at least 70 to 80 police officers, including senior officers, were injured trying to arrest him. They pitched battle outside his (Imran Khan’s) house. This has never happened in Pakistan.”\nThe Minister said during his (Imran Khan) regime and in the past also opposition workers and leaders were arrested and they always submitted in a very graceful, and dignified manner as political workers. “They never contested their arrest physically, never abused and maligned the courts.\nDuring the last four years of his (Imran Khan) rule as Prime Minister, almost the whole of the top leadership of PML-N was arrested.”\n“Our leader Mian Muhammad Nawaz Sharif got arrested when he came back from the UK to surrender, his daughter, sons and nephews were arrested. But they never resisted their arrest.”\nThe Minister while sharing his account claimed that he got picked up from Embassy Road and remained in jail for almost six months. “My wife appeared in the courts.\nAlmost for three years my wife and sons appeared in the court.\nThe victimisation of the opposition was unprecedented in Khan’s era. We have seen that when politicians were victimized during martial law and military governments.\nBut this sort of victimization and hounding was never there. The politicians were hanged like Zulfiqar Ali Bhutto was hanged and it was a judicial murder. Mohatarma Benazir Bhutto was martyred by the terrorists.”\nThe Minister further stated that Nawaz Sharif was removed from the government thrice but his party and workers never resorted to the methods or sort of things taking place for the past three to four weeks.\nKhawaja Asif noted that the coalition government was governing the country under circumstances which were pretty difficult both administratively and financially and ultimately politically as well.\n“This is the backdrop in which we are at the moment governing the country and trying to give the best. We do realise that the political capital we had when we took over or when moved the vote of no confidence has depleted. We paid a cost for it,” he added.\nHe said the Pakistan Democratic Movement (PDM-a coalition of 11 political parties) had the option after the dissolution of the assembly or after the vote of no confidence to dissolve the assembly and go for new elections.\n“But we were in the middle of negotiating arrangement with the IMF and an interim government perhaps could not do that as effectively as the elected government in power and it was a difficult decision and we decided to risk our political capital and stayed in the government. Despite the fact that we knew the risk of losing the political capital was there,” he added.\nHe added that the coalition government was trying to manage the crisis but every day there was a crisis precipitated by Imran Khan and the government was handling it.\nPrior to the question-answer session, the Information Minister intervened to present a video of police officials visiting Imran Khan’s residence depicting how his party workers attacked the police team, and the women and mauled the police assets.\nKhawaja Asif noted that the coalition government was governing the country under circumstances which were pretty difficult both administratively and financially and ultimately politically as well. “This is the backdrop in which we are at the moment governing the country and trying to give the best. We do realise that the political capital we had when we took over or when moved the vote of no confidence has depleted. We paid a cost for it,” he added.\nResponding to various media queries, he said when he was in power they offered him to build some consensus on economic policies but that offer was rejected and burnt by the then Prime Minister.\nDuring the past year, he said, Khan made several talk offers to the establishment, the military leadership but not to political leadership.\nDespite the fact that the opposition and the present government were willing to talk on so many occasions but he (Imran Khan) kept on insisting to approach the present leadership of the Pakistan Army but they were not responding.\nThe Defence Minister added that Imran Khan had approached former Army Chief General Bajwa through the president and met him twice. Khan tried to negotiate with him (Gen Bajwa) and even offered him an extension for life.\n“We are ready to talk for the sake of peace in our country, not only for the present government but for coming generations we must have some sort of consensus on major issues that we are facing for the past many decades. We are not in favour of any transactional dialogue.\nWe need something which is comprehensive and covers everything,” the Minister said. Khawaja Asif noted that the situation was getting worse with every passing day as the violence could escalate and things could take an ugly turn.\n“But this sort of organized violence against state machinery is unprecedented in national history.\nThe govt has the power and will to control any violence which is triggered by Imran Khan and his supporters,” he maintained.\nThe Defence Minister termed the allegations levelled against the Inspector Generals of Islamabad and Punjab police, and the interim Chief Minister of Punjab as “scandalous”.\n“He (Imran Khan) is just trying to create an atmosphere where his followers are ready to believe anything he says. This sort of cult is prevailing in Pakistan these days but it would fizzle out soon.\nOn one hand, he said, Khan was accusing General Bajwa of conspiring against him and aiding his opponent and on the other, he was offering him lifetime extensions.\n“Then accusing the US of conspiring against him taking even names and now he is again flirting with the US govt through lobbyists and approaching them for some sort of intervention, aid or help,” he added.\nThe Minister said: “Perhaps his followers do believe but most of the people have lost track of what he has been saying for the past year.”\nOn the query of elections, he said the National Elections were due in October and would be held on time. The decision had been taken by the Election Commission of Pakistan which was the empowered body as per the constitution to hold the elections.\nHe noted that since February last the security situation had deteriorated. “We lost a senior army officer a day before yesterday and the terrorist incidents have escalated over the last two to three months. The evidence is there and it is not concocted.”\nHe also informed that he was aware of the fact that the Ministry of Finance had said it was not able to provide funds for the elections on 30th April due to the economic situation.\n“I have a parliamentary career of 33 years and I have never approached any foreign government. I was detained in Attock Fort by General Musharraf which was a harsh experience but I did not approach the US or any foreign government,” he added.\nThe Minister pointed out that the PTI after accusing the US for a year, sought help from the same.\n“It’s a disgrace for any political party and worker to seek foreign help for whatever he is following or believing in.\nMy commitment to whatever I believe in should be sacrosanct and that should be within the ambit of my commitment to my country and ideology and seeking help from abroad is treacherous,” he noted.",
  "retrievedAt": "2025-08-11T08:07:00.872Z"
}
