{
  "title": "Pakistan to continue raising voice against HR abuses in IIOJK: FO",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-raising-voice-against-hr-abuses-in-iiojk-fo/",
  "date_published": "2023-03-24T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 24 (APP): Pakistan will continue to raise its voice against grave and systematic human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Foreign Office Spokesperson said here on Friday.\nAddressing the weekly press briefing, the spokesperson Mumtaz Zahra Baloch said, “We will also continue to extend political, diplomatic and moral support to our Kashmiri brothers and sisters for the just and peaceful settlement of the Jammu and Kashmir dispute in accordance with the UN Security Council Resolutions.”\n“Last week in Srinagar in IIOJK, India’s National Investigation Agency (NIA) arrested senior journalist and human rights defender, Irfan Meraj. We are concerned about the safety and well-being of Irfan Meraj and dozens of Kashmiri journalists and human rights defenders, including Khurrum Perviaz, who are under incarceration in prisons across IIOJK and India.”\n“They are prisoners of conscience who are being victimized for shining a spotlight on the dire situation of human rights and fundamental freedom in IIOJK. We urge India to bring an end to the suppression of journalists and human rights defenders and to its policy of stifling freedom of expression and assembly in the occupied territory,” she added.\nTalking about the upcoming diplomatic engagements, the spokesperson said Pakistan-Malaysia Bilateral Political Consultations will be held next week in Kuala Lumpur.\n“Agenda includes discussion on political, security and military cooperation, trade and investment ties, cooperation in science and technology, health, tourism and culture. The two sides will also exchange views on the regional and global issues including developments in the Asia-Pacific region, Climate Change, and Islamophobia.”\nTo a question, she said Pakistan was in contact with the Afghan interim authorities on security and counter-terrorism matters including concerns regarding terrorist entities which had hideouts in Afghanistan.“Our security agencies are in contact. If you recall, our Minister for Defence visited Afghanistan very recently, and all these matters were discussed. We expect the Afghan authorities to take action against these terrorist entities and to ensure that they do not pose a threat to Pakistani people and Pakistani security forces.”\nTo another question, she said Pakistan and China were all weather strategic cooperative partners and the two countries cooperated on a range of issues including economic and financial matters.\n“We are grateful to the Chinese government and people for the economic and financial support that China has provided to us in these difficult times. People of Pakistan will remember this for a long time.”\nExchange of high-level visits was a hallmark of Pakistan–China friendship, she said adding, “Our two countries have been exchanging these high-level visits throughout the last seven decades. Now that COVID restrictions have been lifted, these contacts and engagements will pick up.”",
  "retrievedAt": "2025-08-11T08:06:51.864Z"
}
