{
  "title": "PM Sharif’s wakeup call drives world into action to tackle climate changes",
  "link": "https://www.app.com.pk/national/pm-sharifs-wakeup-call-drives-world-into-action-to-tackle-climate-changes/",
  "date_published": "2023-05-04T07:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 4 (APP): Prime Minister Muhammad Shehbaz Sharif, through his ardent and relentless efforts, has successfully driven the world community to immediately address the catastrophic climate change impacts that brought unprecedented devastation to Pakistan in the shape of historic monsoon flooding.\nAs the monstrous monsoon deluge burst out inundating huge chunks of land across Pakistan, causing human casualties, affecting 33 million people besides, colossal damages amounting to over $30 billion, the prime minister effectively and vociferously reminded the world that the natural catastrophe triggered by climate impacts of the developed countries which hit Pakistan could engulf the other regions in future.\nThe prime minister had attended and co-chaired the Sharm El Sheikh United Nations Climate Change Conference (COP27) last year where he enlisted international community support.\nEarlier, as an acknowledgment of the proactive leadership and the global efforts of the prime minister on the climate change action plan, the United Nations Climate Change Conference – COP27, had announced to hand him over the vice-chairmanship of the conference, jointly chaired by the prime minister along with the Egyptian president and the Norwegian prime minister.\nBecoming a vice president of the UN Conference of Parties (COP27) had been a global recognition for the efforts led by Pakistan over the drastic measures to cope with climate change.\nAmong 195-member countries of the United Nations, Pakistan received the honour due to efforts of PM Shehbaz Sharif at the global and regional forums, regarding the need for an urgent climate action plan.\nDifferent heads of government, in their interaction with the premier on the sidelines of the mega climate change summit, termed his continued presence in flood-affected areas as an “extraordinary gesture”.\nThe prime minister in his meetings with United Arab Emirates Sheikh Mohammed bin Zayed al-Nahyan, Tajikistan’s President Emomali Rahmon, Indonesian Vice President Maruf Amin, Iraq’s President Abdul Rasheed Rashid, and Lebanon’s Prime Minister Najib Mikati drew the attention of the international community to help Pakistan overcome the risks posed by the climate change.\nDuring his speeches, the prime minister highlighted the damage suffered by Pakistan in the wake of flash floods and emphasized transforming the key climate-related decisions into concrete actions and credible plans.\nPM Shehbaz stressed that as a developing country, most affected by the phenomenon, Pakistan needed ‘urgency of climate solidarity and climate justice’.\nHe also expressed the hope that the 27th UN Climate Change Conference (COP27) would prove to be a milestone in bringing climate justice.\nDelegates from nearly 200 countries attended the UN climate summit in Egypt with an agreement to discuss compensating poor nations for mounting damage linked to global warming, placing the controversial topic on the agenda for the first time since climate talks began decades ago.\nThe agreement set a constructive tone for the COP27 summit in the seaside resort town of Sharm el-Sheikh, where governments committed to avert the worst impacts of planetary warming with collective endeavours.\nThe prime minister highlighted that nature-based solutions were at the heart of Pakistan’s “ambitious” climate action agenda under the convention and Paris Agreement.\nHe also thanked the international community for helping Pakistan’s flood victims and discussed bilateral, regional and global issues with them.\n“The international community must come together to create a common charter for the survival of the planet,” he reiterated during his engagements\nPrime Minister Shehbaz Sharif, sensitising the international community on the plight of flood-hit Pakistan, said the country needed additional funding, not debts.\n“We have to fight and rebuild a resilient and adaptive infrastructure which can only be done through additional funding, not loans and debt… but the gap is widening by the day. It is the duty of the global north to understand our plight,” the prime minister said in his statement at the COP27 summit.\nHe said that the floods had destroyed over 8,000 kilometers of highways, damaged more than 3,000 kilometers of railway tracks and washed away crops over four million acres.\nHe said Pakistan suffered the manmade disaster despite less than one percent contribution to the global carbon footprint.\nHe said Pakistan was spending billions of dollars from its own resources to provide shelter, homes, medical aid, and food package to millions of people.\n“How one can expect us to carry out this gigantic task on our own,” he remarked.\nThe prime minister emphasised prioritizing the Global Goal on Adaptation both in terms of financing and timelines.\nThe current financing gap was too high to sustain any real recovery needs of those on the frontlines of climate catastrophe, he added.\nSecondly, he said the loss and damage needed to be part of the core agenda of COP27 to meet the pressing humanitarian needs of those who were trapped in a crisis of public financing fueled by debt and yet have to fund climate disasters on their own.\nThirdly, he called for clearly defining climate finance as new, additional and sustained resources with a transparent mechanism to meet the needs of developing and vulnerable countries with the required speed and scale.\n“We have been talking for years. But have failed to even agree on the basics. Pledges made at the Copenhagen COP 15 in 2009 for mobilising $100 billion annually by 2020 have still not been realized. They need to be enhanced given the increased frequency and intensity of climate extreme events,” he urged.\n“The COP might have a real chance to find common ground toward achieving the objectives of the Convention and the Paris Agreement,” he stated, stressing that “it is now or never”.\n“For us, there is indeed no Planet B,” PM Shehbaz maintained.\nDue to these efforts, the 27th Conference of the Parties to the United Nations Framework Convention on Climate Change (COP27) concluded with a historic decision to establish and operationalize a loss and damage fund.\nFrom 6 to 20 November, COP27 held high-level and side events, key negotiations, and press conferences, hosting more than 100 heads of state and governments, over 35,000 participants and numerous pavilions showcasing climate action around the world and across different sectors.",
  "retrievedAt": "2025-08-11T08:26:00.119Z"
}
