{
  "title": "NA unanimously passes resolution commending armed forces for defending country’s territorial integrity",
  "author": null,
  "content": "ISLAMABAD, May 12 (APP): The National Assembly on Monday unanimously passed a resolution praising the armed forces of Pakistan for their outstanding professionalism, alertness, and bravery in defending the country’s sovereignty.\nThe resolution, moved by Federal Minister for Law and Justice Azam Nazeer Tarar in the House.\nThe resolution commends armed forces of Pakistan for their exemplary professionalism, vigilance and courage in defending the sovereignty of Pakistan in response to unprovoked Indian aggression with exceptional restraint and responsibility, and through a measured and befitting response.\nIt said that the nation bows its head in humility before the Almighty for granting the Pakistani nation the dignity and honour in defending the motherland’s territorial integrity against naked Indian aggression.\nIt congratulated the entire nation, which rose above all differences and stood united behind its leadership across the political spectrum with one voice — Pakistan.\nRich tribute was paid to the brave martyrs who laid down their lives in defence of the motherland, solemnly acknowledging their supreme sacrifice as a symbol of national pride, resilience, and unity.\nThe resolution also expressed sincere gratitude to friendly countries for their support to Pakistan at this critical juncture.\nReiterating its pledge to regional and global peace with dignity and honour, the House emphasized that democracies are committed to dialogue, not conflict.\nIt underscored that a secure neighbourhood and long-term stability in South Asia could only be achieved through sincere and structured negotiations.\nThe resolution urged authorities to actively engage the international community to resolve the Jammu and Kashmir dispute in accordance with the aspirations of the Kashmiri people and relevant United Nations Security Council resolutions.\nIt further stressed the importance of ensuring the full implementation of the Indus Waters Treaty and affirmed that safeguarding Pakistan’s water rights is a critical component of national security.\nThe House reaffirmed that it would continue to play its constitutional role in protecting national interests and promoting peace, unity, and security for the people of Pakistan.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:22:48.176Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-unanimously-passes-resolution-commending-armed-forces-for-defending-countrys-territorial-integrity/",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T14:24:00.000Z"
}
