{
  "title": "Pakistan marks Int’l Nurses Day 2025 with focus on decent work for nurses",
  "author": null,
  "content": "ISLAMABAD, May 12 (APP): The International Labour Organization (ILO) commemorated International Nurses Day 2025 with a national webinar held on the theme “Decent Work for Nurses – Investing in Safety and Economic Growth.”\nThe event brought together representatives from key institutions including the Pakistan Nursing and Midwifery Council (PNMC), the Ministry of National Health Services, Regulations & Coordination (MoNHSR&C), the Ministry of Overseas Pakistanis & Human Resource Development (MoOPHRD), and technical experts from ILO to reflect on the urgent need to invest in Pakistan’s nursing workforce and align national frameworks with international labour standards.\nWelcoming the speakers and the audience, Geir Tonstol, Country Director, ILO Country Office for Pakistan, paid tribute to nurses as the backbone of the healthcare system and champions of the care economy, said a statement issued by ILO.\nHe emphasized that decent work for nurses must include fair pay, safe and respectful workplaces, social protection, career growth, and the right to freedom of association.\nCiting Pakistan’s nurse-to-population ratio of 0.5 per 1,000, he called for greater investment and policy reforms to address workforce shortages and promote gender-responsive healthcare systems.\nGeir also highlighted ILO’s contributions through the ILO-OECD-WHO Working for Health Programme in Pakistan and reaffirmed the organization’s support to the Government of Pakistan in the ratification of ILO Convention 149.\nMusarrat Rani, Member PNMC, shed light on the multiple challenges nurses face in Pakistan. She said that migration of the workforce has led to a shortage of 1.3 million nurses in the country.\nShe appreciated the initiative of the implementation of the Pakistan Nursing and Midwifery Policy Framework (2023–2035) and recent reforms under the PNMC Act and called for stronger partnerships with organizations like the ILO, more budgetary support for the capacity-building of nurses, and the empowerment of professional associations to safeguard the future of the profession.\nDr Sabeen Afzal, Director Regulations/Council, MoNHSR&C, presented the government’s vision to close the nursing workforce gap and improve healthcare delivery.\nShe reported a 29 percent increase in nursing institutions and growing youth interest in the profession. Yet, she acknowledged persistent issues, including faculty shortages, weak quality assurance, and urban-centric deployment.\nDr Afzal highlighted that the Pakistan Nursing and Midwifery Policy Framework (2023–2035) is a strategic response to these challenges, focusing on four key pillars: governance and regulation, education and training, labour market dynamics, and quality assurance.\nShe also shared the Ministry’s Enhancement Roadmap, which includes expanding nursing education infrastructure, introducing evening shifts, offering more scholarships, and enabling international employment through Mutual Recognition Agreements (MRAs) with countries like the US, Canada, Australia and the Netherlands, National Council Licensure Examination (NCLEX) preparation, and targeted training.\nMaren Hopfe, Technical Officer, Health Service Sector from ILO Geneva, provided an overview of key international labour standards relevant to the nursing sector.\nShe highlighted the importance of the Nursing Personnel Convention, 1977 (No. 149)and the Violence and Harassment Convention, 2019 (No. 190) in healthcare settings and promoted the ratification of both conventions to  to strengthen national frameworks that uphold workers’ rights, ensure safe and decent working conditions, and protect health and care workers against violence and harassment.\nRabia Razzaque, Senior Programme Officer at ILO Pakistan, presented the findings of a legal gap analysis comparing Pakistan’s laws with ILO Convention 149, which was conducted with the support of the ILO-OECD-WHO Working for Health Programme.\nShe noted that while the new nursing policy incorporates some articles of the convention, existing frameworks are fragmented and do not sufficiently cover private sector or voluntary nursing roles. She emphasized the need for a unified, inclusive policy that ensures fair working conditions, professional development, and collective bargaining rights for nurses aligned with international labour standards.\nShe also advocated for the integration of occupational safety and health (OSH) protections, especially given the increased risks faced by nurses during health emergencies like COVID-19, emphasizing that a safe and healthy working environment is a fundamental principle and right at work.\nConcluding the session, Raja Shahroze Abbas (MOPHRD) reaffirmed the ministry’s commitment to advancing decent work for nurses, both domestically and abroad. He confirmed that the ratification of Convention 149 is a priority and that stakeholder consultations will be launched.\nThe updates were also shared on efforts to align nursing education with international standards, develop targeted certification pathways with National Vocational and Technical Training Commission (NAVTTC) and map international labour markets to facilitate safe and structured migration through the Overseas Employment Corporation.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:22:37.390Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-marks-intl-nurses-day-2025-with-focus-on-decent-work-for-nurses/",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T14:38:00.000Z"
}
