{
  "title": "In’t community should play its vital role for durable solution of Kashmir issue: Mushaal Mullick",
  "author": null,
  "content": "ISLAMABAD, May 12 (APP):Mushaal Hussein Mullick Chairperson Peace and Culture Organisation and wife of Jailed Kashmiri Hurriyat Leader Mohammad Yasin Malik has suggested that it was a suitable time for international community to play its vital role for the durable solution of longstanding Kashmir issue of this region.\nAddressing at a press conference here on Monday, she said that without solution of Kashmir issue peace is not possible in this region as India has always violated all peaceful efforts and human rights in IIOJK.\nMushaal has welcomed and thanked to all international community for playing role for ceasefire between Pakistan and India and highlighting Kashmir issue.\nShe strongly condemned the Hindutva ideology of the Bharatiya Janata Party (BJP) in India as minorities are insecure and day by day many incident reported about the killing and looting of innocent peoples.\nShe also give the suggestion to the government of Pakistan to demand the release of all political prisoners from India.\nThousands of Kahmiris had offered sacrifices their lives in the movement of Kashmir freedom and now the time has come to resolve this issues for durable peace in the region.\nShe said that Narendra Modi is not mentally fit to run the country as pushing the state into the war.\nMushaal also show the solidarity with Afghan people as India has fired many missiles on the territory of Afghanistan to defame Pakistan but badly exposed badly in this nefarious act.\nShe appreciated the role of social media activist in this current situation. She commended armed forces for giving a befitting response to India in coordinated manner.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:23:57.967Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/int-community-should-play-its-vital-role-for-durable-solution-of-kashmir-issue-mushaal-mullick/",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T09:08:00.000Z"
}
