{
  "title": "COVID-19 national tally of active cases plummets below 77,000",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-plummets-below-77000/",
  "date_published": "2021-09-16T08:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP):The national tally of total active COVID-19 cases was recorded 76,581 on Thursday with 3,012 more people testing positive for the deadly virus and 3,897 people recovering from the disease during the last 24 hours.\nSixty-six corona patients have died during past 24 hours, 58 of whom were under treatment in the hospitals and eight of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Punjab followed by Khyber Pakhtunkhwa (KP) .\nOut of the total 66 deaths occurred, 19 of them died were under treatment on ventilators.\nThere were 5,039 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 5.3%.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Sargodha 55%, Bahawalpur 69%, Lahore 49% and Multan 76%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Bannu 67%, Swabi 63%, Sargodha 57%, and Gujrat 63%.\nAround 553 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan and Gilgit Baltistan (GB).\nSome 56,778 tests were conducted across the country on Wednesday, including 18,225 in Sindh, 18,399 in Punjab, 12,207 in Khyber Pakhtunkhwa (KP), 5,135 in Islamabad Capital Territory (ICT), 1,289 in Balochistan, 544 Gilgit Baltistan (GB) and 979 in AJK.\nAround 1,112,236 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,215,821 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 33,551, Balochistan 32,671, GB 10,204, ICT 103,549, KP 169,972, Punjab 418,196 and Sindh 447,678.\nAbout 27,004 deaths were recorded in country since the eruption of the contagion.\nAround 7,210 people perished in Sindh, 16 of them died in the hospitals and two out of the hospitals on Wednesday.\n12,319 people died in Punjab died with 28 deaths occured in past 24 hours. Some 22 individuals died in the hospitals and six out of the hospitals.\nAs many as 5,329 people expired in KP, 19 of them died in hospitals on Wednesday, 893 individuals died in ICT, one of them expired in the hospital on Wednesday, 344 people died in Balochistan, 182 infected people perished in GB, and 727 people died in AJK.\nA total of 18,682,730 corona tests have been conducted so far, while 640 hospitals are equipped with COVID facilities across the country.Some 5,590 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:15:17.115Z"
}
