{
  "title": "Kashmiris continue to suffer despite UN’s repeated concerns, call for inquiry",
  "link": "https://www.app.com.pk/national/373548/",
  "date_published": "2021-09-16T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 16 (APP): As a United Nations report seeking an international inquiry into multiple human rights violations and abuses and deliverance of justice for people in Kashmir gathers dust, the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) continue to suffer in silence.\nUnited Nations High Commissioner for Human Rights Michelle Bachelet at the start of the 48th session (2021) of the UN Human Rights Council on human rights developments around the world voiced her continued concern over the situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), saying the ongoing use of a tough law, was aimed at quelling dissent, was “worrying.”\n“Indian authorities’ restrictions on public assembly, and frequent temporary communication blackouts, continue in Jammu and Kashmir, while hundreds of people remain in detention for exercising their right to the freedom of expression, and journalists face ever-growing pressure.”\n“Ongoing use of the Unlawful Activities (Prevention) Act throughout India is worrying, with Jammu and Kashmir having among the highest number of cases in the country,” the UN rights chief said in the session on the disputed territory, adding that “such restrictive measures can result in human rights violations and foster further tensions and discontent.”\nMichelle Bachelet has been expressing her concerns regarding the plight of people in IIOJK since 2018 after the first-ever report of the UN on the human rights situation in Jammu and Kashmir was issued by the world body.\nThe UN report also expressed an urgent need to address past and ongoing human rights violations and abuses and deliver justice for all people in Kashmir, who for seven decades have suffered a conflict that has claimed or ruined numerous lives.\nThe main focus of the report was the human rights situation in the Indian Illegally Occupied Jammu and Kashmir from July 2016 to April 2018.\nThe Indian government on August 5, 2019, revoked Articles 370, 35A and other related provisions from its Constitution. The Narendra Modi regime locked down the region, detaining thousands of people, imposing movement restrictions, and enforcing a communications blackout.\nWhat is happening in IIOJK post-August 2019 is nothing new. In the past, the valley witnessed coercive measures that caused killings, debilitating pellet injuries, unlawful detention and torture, sexual violence, enforced disappearance, etc.\nThe members of civil society and international humanitarian agencies have documented and campaigned around some of the gravest forms of human rights violation in Kashmir.\nThe partition of the subcontinent in 1947 plan gave the right of self-determination to the people to decide their future.\nIronically, India forcefully and illegally annexed Kashmir and took the matter to the United Nations, prompting the world body to declare that a plebiscite was the only legitimate solution to the problem.\nHowever, India backed off its own commitment and started to dilly-dallying the implementation of the UN Resolutions.\nKashmir, today, is the most militarized zone in the world. Illegal and draconian laws like PSA fully provide the cover to the Indian Occupation Forces to torment the innocent civilians and make them yield to the demands of India.\nIndian forces have resorted to lockdowns, curfew, communication blackouts, rape, arson, kidnapping, illegal detentions etc.\nThe international organisations, watchdogs, and stakeholders are fully cognizant of Indian brutalities in IIOJK.\nIndia has converted Kashmir into a Nazi concentration camp where Kashmiris are dealt with like convicts without the exception of women and children.\nMainstream media and social media continue to report grave violations of human rights by the Indian forces and has been warning the international community of dire consequences for regional and international peace.\nThe voices of dissent can be heard from Indian scholars, HR activists, analysts, and important media personalities from the mainland cautioning the Indian govt with demands of peaceful resolution of the problem.\nIn a recent grave violation of human rights, the family of an iconic Kashmiri leader was even denied their basic right of performing the last rites.\nAs the family was preparing for the last rites of Syed Ali Geelani, a heavy contingent of the Occupation Forces raided his residence in Srinagar, harassed the family members, and snatched Syed Geelani’s body. He was laid to rest in a tight military siege at Haiderpora in Srinagar. The Modi government was so terrified of Geelani that they even feared a dead body.\nThe serious Human Rights Violation by the Indian government in performing last rites and burial of the 92 years old veteran Kashmiri leader was widely condemned including by the OIC and reported by international news agencies and papers like Reuters, Washington Post, and France 24.\nThe UNSC is the appropriate platform of UN for conflict resolution and implementation of its resolutions. The Council has a unique responsibility and decision-making powers and has a range of tools at its disposal to forcefully implement its passed resolutions.\nIt was India that took the Kashmir issue to the UN which is now the oldest issue on the UN list of non-implementation. The UNSC tried to resolve this dispute through various resolutions, including UNSC Resolution 47 (1948) that gave the people of Kashmir their right to self-determination through a plebiscite.\nBut India has disrespected the UN resolutions and displayed total disregard. Indian mal-intentions and high handedness in Kashmir has resulted in the armed resistance from Kashmiris against the Indian occupational forces.\nResultantly India resorted to grave human rights violations and illegal actions to suppress the just demands of Kashmiris.  The UN has failed to keep its promises that it made to the people of Kashmir.\nThis is high time the UN and international stakeholders pressurized India to fulfill its international obligations.\nHistorically, there is a long list of precedence in which UN had authorised use of force e.g financial sanctions, deployment of UN forces to resolve issues resulting in serious human rights abuses.\nPakistan has time and again reiterated its stance on all international forums and has highlighted Indian brutalities in Kashmir to the world to act and end Indian atrocities by immediate implementation of UN resolutions.\nPakistan may also consider the possibility of forcing a vote after discussions on Kashmir at the UN in light of UNHCR Reports 2018 and 2019.\nThe repeated concerns expressed by Michelle Bachelet, UN High Commissioner for Human Rights regarding grave human rights abuses in IIOJK duly augment Pakistan’s arguments on the issue.",
  "retrievedAt": "2025-08-11T21:15:16.152Z"
}
