{
  "article_id": "2025-04-08_61e0b66edb56d37e1a7c8d6b347b81f8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ig-rizvi-reviews-security-plan-for-key-events/",
    "retrieved_at": "2025-08-27T14:17:16.760Z"
  },
  "metadata": {
    "title": "IG Rizvi reviews security plan for key events",
    "author": null,
    "date_published": "2025-04-08T13:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 217,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 08 (APP):Inspector General (IG) Police Syed Ali Nasir Rizvi, chaired an important Operational Commanders' Conference on Tuesday to finalize security strategies for upcoming high-profile events. A public relations officer told APP that the conference was attended by all Deputy Inspectors General (DIGs), Senior Superintendents of Police (SSPs), and Superintendents of Police (SPs), during which the IG reviewed detailed security plans for key upcoming events including foreign delegations' visits, Pakistan Super League (PSL) matches, and parliamentary sessions. IG Rizvi said that all these events are of critical national importance and require foolproof security arrangements. IG Rizvi directed all commanders to finalize their plans in complete coordination with relevant departments and law enforcement agencies. IG Rizvi said that special security cards will be issued to personnel deployed for event-specific duties, and added that the Safe City Project will play a vital role in monitoring and surveillance operations. He said that all DIGs must also hold their own meetings to ensure preparedness and efficiency in the field. IG said that a concrete strategy must be developed to curb crime in the federal capital, emphasizing a large-scale crackdown on drug dens, suppliers, and consumers. He said every possible step should be taken to secure the future of the youth and ensure a safe, drug-free environment for the next generation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}