{
  "article_id": "2025-04-08_5ad263c1841a2287b30ee739e7975580",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/eid-special-trains-receive-travelers-overwhelming-response/",
    "retrieved_at": "2025-08-27T14:17:39.497Z"
  },
  "metadata": {
    "title": "Eid Special Trains receive travelers’ overwhelming response",
    "author": null,
    "date_published": "2025-04-08T09:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 496,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 8 (APP):The special trains on Eid-ul-Fitr introduced by Pakistan Railways had received an overwhelming response from thousands of travelers who visited their loved ones in their native towns through having a comfortable traveling experience. The travelers have expressed their gratitude to Pakistan Railways for facilitating them on Eid-ul-Fitr through special trains which saved their precious time and money, making their journeys memorable. A large number of passengers with families were seen at the railway stations according to whom the staff at the stations was quite helpful in informing them about timing of trains, platforms numbers, ticketing and booking issues. Talking to APP Sobia Nasir who arrived at Rawalpindi Railway Station from Lahore said that Pakistan Railways had won the passengers' hearts through completing Eid trains operation with a lot of improvement. Another passenger, Mirza Naseer said that the services being provided by the management were very much improved while all the railway stations were neat and clean. Mirza Naseer said that although the tracks were not in good condition across the country, the timing of the trains was also improved as compared to the previous years. It is pertinent to mention here that Pakistan Railways had run five special trains on the occasion of Eid-ul-Fitr to facilitate the passengers leaving for their native towns to celebrate the auspicious occasion with their dear ones. The initiative had taken on the directives of Prime Minister Muhammad Shehbaz Sharif which was announced by Federal Minister for Railways Muhammad Hanif Abbasi. The special Eid trains aim to enhance passenger convenience, ensure safe travel, and provide timely transportation, allowing thousands to reach their hometowns and celebrate the festive occasion with their families. The passengers will have the option to travel in economy class, AC business, and AC standard class coaches, ensuring a range of choices to suit different budgets and preferences. To further facilitate the passengers, Pakistan Railways had also announced 20 percent discount on train fares across all the classes and the discount had been available for the first three days of Eid and will apply to mail, express, passenger, and intercity trains. The initiative, introduced on the directives of Prime Minister Shehbaz Sharif, aims to reduce travel costs and help people celebrate with their families. On the other hand, Pakistan Railways Police had also tightened security arrangements in trains as well as at stations to avoid any untoward incident during Eid-ul-Fitr vacations. The department had directed all superintendents (SPs) of Railways Police to depute sufficient force at exit and entry points of all railway stations and strictly watch to be carried out of suspicious persons, he added. Pakistan Railways Police Commando Force had been deputed at vulnerable installations and in trains, while bomb disposal staff was also kept on alert for the search of luggage and passengers at railway stations. \"The SPs of Railways Police directed a complete check and search of empty racks before trains reach the platforms for departure towards their destinations,\" the official added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}