{
  "title": "Govt plan to privatize 19 public sector deptts: Soomro",
  "link": "https://www.app.com.pk/national/govt-plan-to-privatize-19-public-sector-deptts-soomro/",
  "date_published": "2020-09-09T13:20:00.000Z",
  "source": "APP",
  "content": "LAHORE, Sep 09 (APP): Federal Minister for Privatization Mohammed Mian Soomro\nsaid on Wednesday the government had a plan to incur Rs 100 billion through privatization of 19 public sector departments during the current fiscal year.\nThose departments would be privatized include: Steel Mill, Mari Gas Field, Convention Centre Islamabad, Services Hotel, SME Bank, PPL, Guddu Power Plant and other Power companies.\nTalking to the media during the second phase of auction of the state owned properties at a local hotel, the federal minister said the privatization was being carried out as per the plan\nand Privatization Ordinance, adding the third phase auction of government properties would be held in Gujranwala.\nHe said the main purpose of auction was to reduce the burden of debt of the country and raise the living standard of the people.\nHe said the government had to face some financial problems due to COVID-19, adding the government now on the track of progress and the exports of the country were increasing.\nTo a question, the Minister said the PTI government was taking effective measures to meet the requirements of Financial Action Task Force (FATF) to come out of grey list.\nHe said the China-Pak Economic Corridor (CPEC) was moving ahead as per its plan and CPEC Authority Chairman Lt Gen (Retd) Asim Saleem Bajwa had already stated\nabout the project.\nThere would be no repercussions of All Parties Conference (APC) on the government, he said and suggested the opposition to work together with the government for the development of the country.\nLater, the second phase of auction of the government properties was held under the supervision of Federal Minster Mohammed Mian Soomro, during which, 13 properties were auctioned in the provincial capital and raised Rs 179.354 million against the\nreserved price of Rs 175 million.\nThe auctioned properties include: three shops at Vouge Tower MM Alam road, 9 flats at Shama Apartments on Ferozepur road and WAPDA leftover building at Nicolson road.",
  "retrievedAt": "2025-08-11T19:47:25.112Z"
}
