{
  "article_id": "2025-10-13_eb504f78dab13eb33a98e19afc525cf9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/global/pm-arrives-in-sharm-el-sheikh-among-world-leaders-to-attend-gaza-peace-summit/",
    "retrieved_at": "2025-10-16T23:59:04.575Z"
  },
  "metadata": {
    "title": "PM arrives in Sharm El Sheikh, among world leaders to attend Gaza Peace Summit",
    "author": null,
    "date_published": "2025-10-13T15:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 448,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 13 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday arrived in Sharm El Sheikh, the Egyptian Red Sea resort town, to join more than 20 world leaders in the 'Gaza Ceasefire and Peace Summit'. Upon arrival at the airport, the prime minister was received by Dr. Ashraf Sobhy, Minister of Youth and Sports for Egypt. Egyptian President Abdel Fattah al-Sisi and his US counterpart Donald Trump are co-chairing a gathering of the world leaders in \"the Summit for Peace\" to ensure ending a more than two-year war in Gaza after a breakthrough ceasefire deal brokered by US President Trump. The summit in the Egyptian Red Sea resort town of Sharm el-Sheikh is being held at a day when Hamas released 20 remaining living Israeli hostages and Israel set free hundreds of Palestinians, a significant condition of the ceasefire pact. On Monday, a number of heads of state and governments, besides, key officials from several countries began arriving in Sharm el-Sheikh. Palestinian President Mahmoud Abbas will attend the summit along with other leaders to finalise an agreement aimed at ending the war in Gaza, his office has said. Egypt's state-run Al-Qahera news channel said French President Emmanuel Macron, Indonesian President Prabowo Subianto, Pakistan Prime Minister Muhammad Shehbaz Sharif, UN Secretary-General Antonio Guterres, and the Arab League Secretary-General Ahmed Aboul Gheit arrived at the venue. According to the official Egyptian news agency, the Arab and Muslim countries leaders expected to attend the summit included Turkish President Recep Tayyip Erdogan, Qatar's Emir Sheikh Tamim bin Hamad Al Thani, Jordan's King Abdullah II, Kuwait's Prime Minister Ahmad Al Abdullah Al Sabah, Bahrain's King Hamad bin Isa Al Khalifa, Azerbaijani President Ilham Aliyev, Iraqi Prime Minister Mohammed Shia al-Sudani, United Arab Emirates Vice President Mansour bin Zayed Al Nahyan and Omani Foreign Minister Badr Al Busaidi. Italian Prime Minister Giorgia Meloni, Spanish Prime Minister Pedro Sanchez, Greek Prime Minister Kyriakos Mitsotakis, Armenian Prime Minister Nikol Pashinyan, Hungarian Prime Minister Viktor Orban, Norwegian Prime Minister Jonas Gahr Store would be the other attendees. Canadian Prime Minister Mark Carney, French President Emmanuel Macron, German Chancellor Friedrich Merz, Britain's Prime Minister Keir Starmer are the other prominent leaders to participate. UN Secretary-General Antonio Guterres, European Union President Antonio Costa and Italian Prime Minister Giorgia Meloni have also indicated to attend. Sharm el-Sheikh, the famed Red Sea resort, located at the tip of the Sinai Peninsula, had in the past, hosted key peace negotiations. Since October 2023, Israeli attacks had killed more than 68,000 Palestinians in Gaza, most of them women and children, leaving the area in ruins and rubble. The first phase of the Gaza ceasefire agreement took effect on Friday under Trump's plan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}