{
  "article_id": "2025-10-13_aa573ce8127f12022214565500517085",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/108942-children-vaccinated-on-1st-day-of-anti-polio-campaign-in-ict-2/",
    "retrieved_at": "2025-10-16T23:57:49.930Z"
  },
  "metadata": {
    "title": "108,942 children vaccinated on 1st day of anti-polio campaign in ICT",
    "author": null,
    "date_published": "2025-10-13T22:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 483,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 13 (APP): Islamabad's ongoing polio eradication drive completed its first day on Monday, with health teams administering vaccination drops to 108,942 children across the capital, achieving 24 percent of the overall target. According to a briefing presented during a review meeting chaired by Deputy Commissioner (DC) Irfan Nawaz Memon, the total vaccination target for the city stands at 461,125 children. The meeting reviewed the progress of the first day and discussed strategies to ensure complete coverage in the coming days. Health officials informed the DC that 176 refusal cases were reported during the first day of the campaign, which were promptly resolved on the spot by field teams. The administration said the quick response from health workers helped maintain the momentum of the campaign and kept the vaccination process on track. DC Memon directed the field staff to maintain focus on full coverage across all urban and rural sectors, emphasizing that every eligible child must receive polio drops during the campaign. He appreciated the efforts of the teams and urged them to continue their work with the same commitment throughout the week. \"The eradication of polio is a national responsibility, and everyone must contribute actively to achieve a polio-free Pakistan,\" said DC Memon. He called on parents to ensure their children are vaccinated and to support the campaign teams working in their neighborhoods. The district administration stated that field activities are being carried out across Islamabad's rural and urban areas, including door-to-door visits, mobile teams, and fixed vaccination sites. Special attention is being given to high-risk areas identified through surveillance data. Health officials explained that each team has been assigned daily targets, and monitoring mechanisms are in place to track performance in real-time. Supervisors are ensuring proper coordination among field workers, health departments, and local administration to remove any hurdles faced by vaccination teams. The DC also instructed that refusal cases should be handled immediately through engagement with parents and community elders, while awareness efforts should continue to highlight the importance of immunization for children's health. He said the administration remains committed to ensuring that every child in Islamabad is vaccinated, adding that coordination between district officials, health departments, and local communities will be key to the campaign's success. The week-long anti-polio drive will continue until full coverage of the target population is achieved. Health teams will revisit households where children were missed on the first day to ensure no child is left unvaccinated. Officials further said that surveillance, data collection, and team performance will be evaluated daily to identify gaps and improve implementation. Awareness campaigns through social media, schools, and mosques are also being run alongside field operations to encourage maximum participation from the public. The district administration reaffirmed that the objective of a polio-free Islamabad is achievable only with the cooperation of parents and communities. \"Our collective effort today will secure the health of future generations,\" the DC added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}