{
  "article_id": "2025-10-13_c07bdf6d28a5aaf29f34c4f6aee46b61",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/global-experts-unite-in-sochi-to-advance-earthquake-resilient-engineering/",
    "retrieved_at": "2025-10-16T23:59:48.641Z"
  },
  "metadata": {
    "title": "Global experts unite in Sochi to advance Earthquake-Resilient Engineering",
    "author": null,
    "date_published": "2025-10-13T14:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 164,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 13 (APP):In a major stride toward enhancing global preparedness against seismic disasters, the OIC Ministerial Standing Committee on Scientific and Technological Cooperation (COMSTECH) and the Russian Association for Earthquake Engineering and Protection from Natural and Manmade Hazards (RAEE) jointly convened the XVI National Conference on Earthquake Engineering and Seismic Zoning: \"Safety and Reliability in Every Building\". The landmark event, held from October 5-11 in Sochi, Russia, gathered world-renowned scientists, engineers, and policymakers to deliberate on innovative solutions for earthquake-resistant infrastructure and to strengthen international collaboration in seismic research and risk mitigation. In alignment with COMSTECH's mission to promote scientific advancement across OIC member states, four Pakistani experts from NUST University Islamabad, UET Peshawar, NED University Karachi, and the National Centre of Earth Sciences Islamabad participated in the conference as COMSTECH nominees, said a news release. The conference provided a robust platform for knowledge exchange, interdisciplinary dialogue, and the formulation of practical strategies to enhance structural safety and resilience in earthquake-prone regions worldwide.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}