{
  "article_id": "2025-10-13_dfbe494d9299f3be0a9da09180a48bd5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-turkiye-azerbaijan-pledge-stronger-parliamentary-ties-for-regional-peace-prosperity/",
    "retrieved_at": "2025-10-16T23:59:53.007Z"
  },
  "metadata": {
    "title": "Pakistan, Türkiye, Azerbaijan pledge stronger parliamentary ties for regional peace & prosperity",
    "author": null,
    "date_published": "2025-10-13T14:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 911,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 13 (APP):Pakistan, Turkiye, and Azerbaijan on Monday reaffirmed their resolve to strengthen parliamentary ties, bolster defense collaboration, and work in unison for lasting peace, stability, and prosperity across the region.The resolve was expressed during the Third Trilateral Speakers' Conference, held at Parliament House here, and chaired by Speaker of the National Assembly Sardar Ayaz Sadiq.Chairman Senate Syed Yousuf Raza Gilani and parliamentary delegations from the three countries were also present. In his opening remarks, Speaker National Assembly Sardar Ayaz Sadiq warmly welcomed the visiting Speakers and termed the trilateral parliamentary cooperation among Pakistan, Turkiye, and Azerbaijan as a unique manifestation of strategic partnership and fraternal unity among the three brotherly nations.He said that this partnership is not merely between governments but represents the collective will of the peoples of all three nations and the voice of their parliaments. Highlighting the theme of the conference \"Strengthening Fraternal Ties: Parliamentary Cooperation for Regional Peace, Security, and Prosperity,\" Speaker NA emphasized that it truly reflects the shared vision and spirit of brotherhood among Pakistan, Turkiye, and Azerbaijan.Speaker Sardar Ayaz Sadiq noted that the global security order is under immense strain, with increasing violations of sovereignty and territorial integrity across the world. Referring to the ongoing humanitarian tragedy in Gaza and the long-standing denial of the right to self-determination to the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK), he said that these injustices remain indelible scars on the conscience of humanity.He strongly condemned India's continued human rights violations in IIOJK and its recent act of aggression against Pakistan, which was effectively countered through Operation Banyan um-Marsoos. He paid tribute to Pakistan's Armed Forces for their courage and for safeguarding the nation's sovereignty.Speaker NA said that India's propaganda and falsehoods have been globally exposed. He expressed gratitude to Pakistan's friends, particularly Turkiye, Azerbaijan, China, and Saudi Arabia, for their consistent support in difficult times. He also criticized India's breach of the Indus Waters Treaty and termed its water terrorism as part of a dangerous strategy that undermines regional stability.On regional security, he stressed that terrorism has no religion and must be countered collectively. Despite repeated provocations and cross-border attacks from Afghan soil, Pakistan has shown restraint. He lauded the armed forces for their precise and effective operations against terrorists, reaffirming that the sacrifices of Pakistan's martyrs will never go in vain.Touching upon climate change, Speaker NA noted that Pakistan remains among the most climate-vulnerable nations. He said that the devastating floods of 2022 and 2025 highlight global climate injustice, calling for greater regional cooperation and a unified parliamentary framework for climate action.He underscored that parliaments are the true representatives of the people and play a guiding role in promoting peace and development. The trilateral parliamentary cooperation, he said, will open new avenues for peace, stability, and shared prosperity in the region.Expressing appreciation to his counterparts for their participation, Speaker Sardar Ayaz Sadiq said that the friendship among Pakistan, Turkiye, and Azerbaijan is rooted in mutual trust, affection, and brotherhood.In her address, Speaker of the Milli Majlis of Azerbaijan, Sahiba Gafarova, congratulated Speaker Sardar Ayaz Sadiq on successfully convening the Trilateral Speakers' Conference in Islamabad. She termed the conference a continuation of the initiative launched by the Azerbaijani Parliament in Baku in 2021 and a manifestation of the growing parliamentary cooperation framework for regional peace and security.She appreciated the parliamentary exchanges between Pakistan, Turkiye, and Azerbaijan during 2021-2025 and highlighted the establishment of the Non-Aligned Movement Parliamentary Network, an initiative of President Ilham Aliyev, as a historic step towards strengthening parliamentary multilateralism.Speaker Sahiba Gafarova underlined that the cooperation among the three nations is based on shared history, culture, and moral values. She expressed gratitude to Pakistan for its unwavering support during Azerbaijan's 44-day Patriotic War and reaffirmed Azerbaijan's continued support for Pakistan's principled stance on the Jammu and Kashmir dispute. She also condemned Israeli aggression in Gaza and stressed the importance of implementing the ceasefire agreement to uphold Palestinian sovereignty.Addressing the session, Speaker of the Grand National Assembly of Turkiye, Numan Kurtulmus, expressed his deep appreciation to Speaker Sardar Ayaz Sadiq for hosting the trilateral conference, calling the initiative timely and significant.He said the themes discussed today are critical for ensuring regional peace, security, and development. He underscored the need for regular parliamentary exchanges and institutionalized cooperation among the three countries, describing them as \"three states, one nation.\"Expressing condolences over the loss of lives and economic damage caused by Pakistan's 2022 and 2025 floods, the Turkish Speaker reaffirmed Turkiye's solidarity with Pakistan. He emphasized that there can be no compromise in the fight against terrorism and that collective defense and security cooperation are essential.Speaker Numan Kurtulmus condemned foreign aggression faced by the three countries and appreciated the exemplary struggle of Turkiye against terrorism both within and beyond its borders. He urged the reform of the United Nations to ensure effective resolution of disputes such as Kashmir, Palestine, India's and Afghanistan's aggression towards Pakistan, and on-going terrorism in Africa.He further disclosed that joint efforts by Pakistan, Turkiye, and Azerbaijan had led to 11 countries recognizing Palestine as a sovereign state for the first time ever and which could not have been possible earlier. He called for Netanyahu and Zionist leaders to be held accountable before the International Criminal Court for crimes against humanity.He announced that the next trilateral parliamentary meeting would be hosted in Istanbul, focusing on the Palestinian issue, and would mark a milestone in advancing the collective voice of the Muslim world.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}