{
  "title": "Experts calls for accelerated efforts to meet SDGs for sustainable progress",
  "link": "https://www.app.com.pk/national/experts-calls-for-accelerated-efforts-to-meet-sdgs-for-sustainable-progress/",
  "date_published": "2022-06-13T13:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP): In order to achieve the Sustainable Development Goals (SDGs), representatives of civil society at a consultation session have called for accelerated efforts to meet these goals within the stipulated timeframe as it would ensure sustainable progress.\nThey highlighted and discussed the bottlenecks, lacunas and challenges in the budgets, policies and strategies towards achieving the SDGs, said a news release.\nPurpose of the consultation, organized jointly by Awaz CDS and UGOOD in Islamabad, was to review the progress on government’s official Voluntary National Review (VNR) through Peoples Scorecard and collect input from the civil society organizations on the subject.\nThe event was part of the series of consultations which will be organized countrywide to gather information from informed civil society about the government’s performance on achieving the SDGs.\nAround 35 members from civil society organizations (CSOs) participated in the consultation, mostly from organizations led by women, youth, transgender, people living with disabilities and minority groups. The consultation was supported by Sightsavers Pakistan, VSO and A4SD.\nIn his opening remarks, CEO UGOOD Syed Ishtiaq Gilani appreciated the participants for attending the consultation and hoped their valuable findings would help in shaping the accurate data base on SDGs.\nParticipating in the consultations, Country Director Sightsavers Munazza Gillani praised Awaz CDS-PDA and UGOOD for arranging such an inclusive event representing all, PLWDs, trans genders, youth and men and women.\nShe shared Sightsavers’ initiatives and collaborations with both CSOs and government to make the entire SDGs process inclusive. She emphasized on inclusion as well as availability of PLWDs disaggregated data for all goals.\nChief Executive Awaz CDS Pakistan Zia ur Rehman gave a detailed orientation about the event’s objectives and deliberations. He informed the participants about AwazCDS and Pakistan Development Alliance (PDA), on behalf of civil society, are in the process of developing a spotlight report on SDGs parallel to government’s official VNR report which it intends to present in the UN.\nSimilarly, the spotlight report which will be developed through gathering information from people and depicting real, on ground situation with regard to performance and progress of Pakistan on SDGs at the same forum, he said.\nZia ur Rehman also apprised the audience that the process of data collection was a two-pronged activity, an online survey which has been uploaded on PDA website and a series of consultations in provincial capitals and regions i.e. AJK and GB.\nHe shared that AwazCDS is engaging with civil society through people’s scorecard to reach out to informed citizens who are unable to contribute to national or official VNR report process. The spotlight report will collect voices of citizens to achieving SDGs whereas the official process relies on secondary data.\nHe expressed concern over the delay by the government in making the VNR public and called for speedy completion of this process.\nHe gave a quick rundown of the online survey and the indicators which would be used to assess specific goals CSOs are working on. He shared the link and urged the audience to fill up the online survey as well.\nAn hour-long group work was also conducted where findings, views and assessment of the discussants were presented. Overall they depicted dismal picture of performance of the government on SDGs they are working on. The information gathered in this consultation will be combined with the findings of planned consultations and consolidated spotlight report will be developed.",
  "retrievedAt": "2025-08-11T15:04:50.479Z"
}
