{
  "article_id": "2025-02-21_bd846c204ba2441e962da8484e468687",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/brotherly-ties-with-bahrain-based-on-common-faith-history-culture-tarar/",
    "retrieved_at": "2025-08-27T12:59:11.785Z"
  },
  "metadata": {
    "title": "Brotherly ties with Bahrain based on common faith, history, culture: Tarar",
    "author": null,
    "date_published": "2025-02-21T03:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 227,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RIYADH, Feb 21 (APP): Federal Minister for Information,Broadcasting, National Heritage and Culture Attaullah Tarar said on Friday that brotherly relations between Pakistan and Bahrain were very strong and based on common faith, history and culture. During a meeting with Bahraini Minister for Information Ramzan bin Abdullah Al Noaimi in Saudi Capital Riyadh he said exchanges of media delegations were very important to further strengthen ties in the media sector. The meeting expressed the determination to expand media cooperation, exchange skills and promote joint projects between the two countries. The federal minister for information stressed the need to promote cooperation between the state media institutions of Bahrain and Pakistan. He suggested sharing of news between Bahraini News Agency BNA and Pakistan's state news agency Associated Press of Pakistan. Both sides welcomed regular exchanges of high-level delegations in recent years. Tarar said a parliamentary delegation from Bahrain currently visiting Pakistan today had an important meeting with Prime Minister of Pakistan Muhammad Shehbaz Sharif. He said national economy was in the right direction and moving forward and Pakistan was a great investment opportunity for global investors. Bahrain Minister said that they valued relations with Pakistan. Bahrain-Pakistan relations are continuously developing in various fields under the wise guidance of the leadership, he remarked. Bahrain Information Minister reiterated Bahrain's commitment to further strengthen cooperation in the media sector and promote joint achievements.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}