{
  "article_id": "2025-02-21_b62e8d42db3285f7756cb00cf442fb6b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-body-expresses-concern-on-selection-process-of-moavineen-e-hujjaj/",
    "retrieved_at": "2025-08-27T12:57:05.554Z"
  },
  "metadata": {
    "title": "NA body expresses concern on selection process of Moavineen-e-Hujjaj",
    "author": null,
    "date_published": "2025-02-21T18:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 511,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 21 (APP):The National Assembly Standing Committee on Religious Affairs and Interfaith Harmony on Friday expressed its concern regarding the selection process of Moavineen-e-Hujjaj and discussed its drawbacks in detail. The meeting, held under the Chairmanship of Malik Muhammad Aamir Dogar in the Parliament House, directed the ministry to submit the NTS exam paper, the list of selected Moavineen, and details of the selection process in other Muslim countries at the next committee meeting. The committee members urged the ministry to closely review the current process and eliminate unnecessary obstacles for Moavineen who wish to serve pilgrims with a religious spirit. They emphasized the need for the ministry to adopt a more practical selection process from the next year instead of relying on NTS, which imposes a high-test fee and other expenses. They recommended that the ministry arrange proper training courses for the selected candidates in accordance with Hajj Ta'leemaat. The committee reviewed the Public Sector Development Program (PSDP) of the ministry for the financial year 2025-2026. Additional Secretary, Dr. Syed Atta-ur-Rehman informed the committee that the ministry's various wings and all Haji Camps are in the process of preparing proposals for new projects. Once finalized, these proposals will be presented before the committee. He briefed the committee on ongoing project - the construction of the Hajj Complex in Lahore. He also briefed the committee on the establishment of a recycling plant for sacred papers which is being constructed in accordance with Shariah principles and modern scientific standards, is expected to be completed by June 2025. He informed the committee that the plant is being set up at the Haji Camp in Islamabad, which is the ministry's own property. The committee expressed strong interest in the recycling plant for sacred papers and directed the ministry to arrange a visit to the Haji Camp Islamabad, along with a detailed briefing on the plant, in the next meeting. The chair emphasized the need for similar plants in provincial headquarters and recommended their eventual expansion to the city level. The committee directed the ministry to develop an alternative plan and explore options for Hajj pilgrims who wish to perform Hajj by road or by sea, and present its plan in the next meeting of the committee. The committee adopted the report of the sub-committee on 'The Service Provider Agreement (SPA) 2025' along with the Hajj Policy 2025. The chairman and members expressed satisfaction with the consensus deliberations of the sub-committee and its implementation in letter and spirit. The committee deferred the briefing on the interfaith harmony wing for the next meeting of the committee. The committee unanimously approved minutes of its previous meeting. The meeting was attended by MNAs Sardar Muhammad Yousaf Zaman, Seema Mohi-ud-Din Jamili, Asiya Naz Tanoli, Muneeba Iqbal, Dr. Nelson Azeem, Pir Fazal Hussain Shah Jillani, Shagufta Jumani, Mussarat Rafique Mahesar, Samina Khalid Ghurki, Muhammad Ijaz-ul-Haq, Muhammad Bashir Khan, Mujahid Ali, Fazal Muhammad Khan, Nasim Ali Shah, and Syed Sami Ullah. The meeting was also attended by secretary and senior officers from the Ministry of Religious Affairs and Interfaith Harmony.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}