{
  "article_id": "2025-02-21_d7a81e69175fe056bc7e10ffe625cc30",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-presented-three-year-plan-for-professional-training-of-youth-employability/",
    "retrieved_at": "2025-08-27T12:57:39.412Z"
  },
  "metadata": {
    "title": "PM presented three year plan for professional training of youth, employability",
    "author": null,
    "date_published": "2025-02-21T16:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 569,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 21 (APP):Prime Minister Muhammad Shehbaz Sharif Friday chaired an inter-ministerial meeting on a three year plan regarding professional training of youth and their employability. During the meeting, he was presented the plan about professional training of manpower in the fields of information technology, industry, nursing and other areas for seeking jobs in Pakistan and abroad. He said the capable manpower of Pakistan was a real asset. It was priority of the government to equip the youth with professional training according to the demand at the international level, he added. He directed an increase in the institutions for training of nurses. He said training of nurses according to international level should be ensured, adding while providing professional training to youth in different fields, the demand in local industries and international market should be kept in view. He assured that National Vocational and Technical Training Commission (NAVTTC) would be given all required funding for the professional training of youth. NAVTTC should blacklist the training institutions which had bad performance and encourage those showing good results, he added. NAVTTC, ministries of information technology, overseas Pakistanis and health presented their programmes for the professional training of youth. The meeting was informed that during the current year, NAVTTC had provided training to 60,000 youth and by June 2025, it would impart training to 141,000 more youth. While in 2026, 250,000 and in 2027, 337,000 youth would be trained in different fields. It was also told that under NAVTTC, more than 29000 persons were trained and subsequently they got jobs in Saudi Arabia while a target is set to provide professional training to 40,000 youth in 2025, 100,000 in 2026 and 150,000 in 2027 for acquiring jobs in Saudi Arabia. Similarly, according to the target, by December 2025, 50,000 trained Pakistanis would get jobs in other countries while 100,000 would be employed abroad in 2026 and 200,000 in 2027. It was briefed that the accreditation of Pakistani training institutes under NAVTTC, with international institutions was continuing rapidly. By June 2025, according to the target, accreditation from 72 institutions would be acquired. The meeting was apprised about the progress regarding the survey for demand of skills in the industries and professional training, application of modern curriculum, accreditation of local institutions and licensing of trainers. More than 2500 students of madaris were given training in different programmes while professional training would be ensured to 3,000 students of seminaries by June 2025, 20,000 in 2026, and 30,000 in 2027 in different fields. These training programmes were also made available in the four provinces, Gilgit Baltistan and Azad Kashmir. The ministry of information technology informed it was taking steps to meet the target of training more than 92,000 youth in the latest IT courses and training of 2.1 million freelancers in the next three years. The meeting was also given detailed briefing about the establishment of National ICT Skills ecosystem which would help youth in getting jobs in the local industry and abroad. Detailed briefing was also given about the training programmes in the nursing field, demand for nursing and the employability of Pakistani nurses abroad. A roadmap for reforms in the nursing field was also laid down. Federal ministers Ahad Khan Cheema, Chaudhry Salik Hussain, Minister of State for IT Shaza Fatima Khawaja, Prime Minister's Coordinator for Health Dr Mukhtar Ahmed Bharath, Chairman Higher Education Commission Dr Mukhtar Ahmed and high level officers attended the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}