{
  "article_id": "2025-02-21_ee4635f6352f7d3679a73b9510d61c81",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/exchange-of-shakil-afridi-with-dr-aafia-not-feasible-ihc-told/",
    "retrieved_at": "2025-08-27T12:58:05.780Z"
  },
  "metadata": {
    "title": "Exchange of Shakil Afridi with Dr Aafia not feasible: IHC told",
    "author": null,
    "date_published": "2025-02-21T15:17:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 221,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 21 (APP):The additional attorney general on Friday informed the Islamabad High Court (IHC) that the suggestion of the exchange of Dr Aafia Saddiqui with Shakil Afridi with United States (US) is not feasible as there is no prisoners exchange treaty between the two countries. IHC's Justice Ijaz Ishaq Khan heard the case regarding release and repatriation of Dr Aafia from a US jail. At the outset of hearing, the additional attorney general Dr Aafia's American Lawyer Clive Smith had given suggestion for the exchange his client with Shakil Afridi, but the idea is not feasible. The AAG said that we have some objections on the draft of petition filed by Dr Aafia in an US court. At this, the court sought the response from federal government regarding its objections against Dr Aafia's petition. The court asked the AAG to take instructions from the government and informed us on next hearing. The AAG said that Dr Aafia and Shakil Afridi both are Pakistanis and we have no any agreement with US regarding the exchange of prisoners. He said that US president has dismissed the mercy request for Dr Aafia and they had submitted a response to the court on February 19. However, the US didn't answer to the letter in this regard. The court adjourned the case with above instructions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}