{
  "title": "Jazz witnesses  over 19% USD revenue growth in 1Q24",
  "link": "https://www.app.com.pk/national/jazz-witnesses-over-19-usd-revenue-growth-in-1q24/",
  "date_published": "2024-05-21T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP):After eight consecutive quarters of negative USD revenue growth, Jazz, one of Pakistan’s leading digital operators reported a notable 19.2% revenue increase in USD for the first quarter of 2024 (1Q24).\nSince its inception, the telco has invested USD 10.6 billion in Pakistan. Its most recent investment of over Rs 5.3 billion in 1Q24 shows its focus on strengthening its digital presence and transitioning into a tech-focused company.\nDescribing the development as the first sign of Pakistan’s recovering economic climate in a post on X, Jazz CEO Aamir Ibrahim said that long-overdue regulatory and policy reforms are needed to sustain this growth.\nThese reforms, he said would unlock the telecom sector’s potential in accelerating the government’s vision of digital transformation for socioeconomic growth. The telecom giant maintains that it continues to navigate challenges impacting its growth, including the year-over-year devaluation of the Pakistani Rupee (PKR), an unprecedented surge in business costs, significant increases in interest rates, and a substantial rise in network energization costs due to higher fuel and electricity prices.\nIn recent years, Jazz’s strategic transition from a telecom operator to a technology company has played a pivotal role in reversing the trend while enabling it to uphold and expand its market leadership.\nThe company’s digital verticals – JazzCash, Tamasha, Garaj, and SIMOSA (formerly Jazz World) – continue leading the local fintech, entertainment, cloud & cybersecurity, and self-care sectors.\n“We are expanding the outreach and capacity of our 4G network, especially in semi-urban and rural areas. In addition to maintaining our leadership position in fin-tech, cloud, entertainment, and self-care domains, we’re also venturing into EdTech and HealthTech,” Aamir said in a statement on the company’s first-quarter results.\nHe added that to tackle the AI language gap in Pakistan, Jazz is also working on developing Gen AI-powered Urdu language models and creating locally relevant AI applications, all to provide a more comprehensive and accessible digital experience for customers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:38:24.269Z"
}
