{
  "title": "NA Speaker expresses condolences over President Raisi’s death",
  "link": "https://www.app.com.pk/national/na-speaker-expresses-condolences-over-president-raisis-death/",
  "date_published": "2024-05-21T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): National Assembly Speakers Sardar Ayaz Sadiq has expressed profound sadness and condolences over the sad demise of the Iranian President Ebrahim Raisi, Foreign Minister Dr Hussein Amir Abdollahian and other dignitaries in the tragic helicopter crash.\nSardar Ayaz Sadiq, in a letter addressed to Dr. Mohammad Bagher Ghalibaf, Speaker of the Islamic Consultative Assembly of Iran, conveyed his heartfelt sympathies with the people of Iran.\nHe said, “The news of this heartbreaking incident has deeply saddened the entire global community. Pakistan stands in solidarity with Iran during this period of immense grief. The loss of such eminent leaders is not only a tremendous loss for the people of Iran but also the entire Muslim Ummah.”\nReferring to the significant contributions of the deceased leaders, he said,”We mourn the departure of visionary leaders who dedicated their lives to the service of their country and the Muslim world. Their loss is irreparable, and our thoughts and prayers are with the bereaved families and the Iranian nation as they navigate through this tragedy.”\nSardar Ayaz Sadiq, while recalling the recent visit of late President Raisi to Pakistan, highlighted the strong bonds of friendship and cooperation between the two nations.\n“His visit was a testament to our shared commitment to further strengthening bilateral ties and promoting peace, stability, and prosperity in the region,” he added.\nAs a mark of respect and in honouring the legacy of the late leaders, Sardar Ayaz Sadiq called for reaffirming the commitment to advancing the cause of peace, unity, and cooperation among the Muslim nations.\n“May their souls rest in eternal peace, and may Allah grant patience and fortitude to the bereaved families and the Iranian nation during these testing times,” he concluded.",
  "retrievedAt": "2025-08-11T02:37:39.314Z"
}
