{
  "title": "Cabinet expresses dissatisfaction over probe Commission’s report on Faizabad sit-in",
  "link": "https://www.app.com.pk/national/cabinet-expresses-dissatisfaction-over-probe-commissions-report-on-faizabad-sit-in/",
  "date_published": "2024-05-21T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 21 (APP): The federal cabinet, with Prime Minister Muhammad Shehbaz Sharif in the chair, on Tuesday expressed its dissatisfaction over a report of an Inquiry Commission into Faizabad sit-in (dharna) by observing that the commission had not adhered to its Terms of Reference (ToR).\nThe meeting directed to constitute a special committee of the cabinet that would submit its recommendations in this regard.\nThe Attorney General for Pakistan submitted an inquiry report over the matter and gave a detailed briefing to the cabinet, PM Office Media Wing said in a press release.\nThe cabinet also adopted a resolution expressing condolences on the shahadat of Iranian President Ebrahim Raisi, Foreign Minister Hossein Amir-Abdollahian and their companions in a helicopter crash.\nThe meeting also granted its approval to the recommendation of Ministry of Interior for duty and tax exemption on the equipment donated to Balochistan police by Guangdong Public Security Department, China. However, under Federal Excise Tax 2005, the federal excise duty would be imposed on these items.\nThe cabinet directed that in future, such like donations and grants would be exempted from taxes.\nIt also approved signing of memorandum of understanding between Pakistan and the United Kingdom with regard to handing over of three accused of Pakistani nationality on the recommendation of the ministry of interior.\nDuring the meeting, the National Livestock Breeding Policy, 2022 was presented by the Ministry of National Food Security and Research and the cabinet directed it to resubmit it after holding consultations with the private sector.\nWhile on the recommendation of ministry of national food security and research, the cabinet approved in principle the legislation work related to National Animal Health, Welfare and Veterinary Public Health Act 2024. A Cabinet Committee on Legislative would comprehensively look into the matter.\nThe prime minister also directed for formulation of a mechanism under a private-public partnership project for establishing a quality slaughterhouse for Islamabad and its surrounding areas.\nThe cabinet on the recommendation of National Disaster Management Authority (NDMA) granted its approval to ex-post facto on the relief goods dispatched to the Palestinians by the NDMA.\nThe meeting was apprised that the government of Pakistan had sent 931 tons of relief goods via six airplanes and two ships.",
  "retrievedAt": "2025-08-11T02:37:39.967Z"
}
