{
  "title": "LFOVK condemns arrests human rights activist in IIOJK",
  "link": "https://www.app.com.pk/national/lfovk-condemns-arrests-human-rights-activist-in-iiok/",
  "date_published": "2021-11-23T14:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Legal Forum for Kashmir (LFOVK) on Tuesday condemned the arrest of a resident of Indian Illegally Occupied Jammu and Kashmir (IIOJK) Khurram Pervez by National Investigation Agency (NIA) India from his residence in Sonwar Srinagar.\nNIA arrested Khurram Parvez from his residence. As per the family sources, the agency raided his home and office and confiscated some of his books, phone and laptop, said a press release. Khurram Parvez, is Program Coordinator of the JKCCS (Jammu Kashmir Coalition of Civil Society: a Srinagar based organisation that monitors and investigates human right abuses) and the Chairperson of the AFAD (Asian Federation Against Involuntary Disappearances: a consortium of 13 NGOs from 10 Asian countries that campaign against enforced disappearances).\nOn 14 September 2016 Parvez was stopped from traveling to Geneva to participate in the United Nations Human Rights Council on orders from the Intelligence Bureau, and was later booked under draconian law.\nLegal Forum for Kashmir (LFOVK) denounce this abuse of the UAPA and other draconian laws by the Indian authorities to silence human rights defenders and dissidents under the guise of national security.\nAlmost 2300 people have been arrested in Indian occupied Kashmir since disputed region’s semi-autonomous status was unilaterally revoked by government of India. The press release said that LFOVK condemned the arbitrary use of anti-terrorism law against Mr. Parvez and call for his immediate and unconditional release.\nAdditionally, we demand an end to the harassment of human rights defenders, political activists and journalists.  The government of India must remove all legal and administrative barriers that impede their legitimate work.\nWe also call on the international community, notably the other members of the United Nations Human Rights Council of which India is currently a member, to insist that India comply with its human rights obligations, including by allowing Indian human rights defenders to freely engage in their work and to enjoy their rights to free expression, peaceful assembly, and association.",
  "retrievedAt": "2025-08-11T21:39:01.636Z"
}
