{
  "title": "Next elections to be held through EVMs at all cost: Fawad",
  "link": "https://www.app.com.pk/national/next-election-to-be-held-through-evms-at-all-cost-fawad/",
  "date_published": "2021-11-23T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP):Minister for Information and Broadcasting Chaudhry Fawad Hussain on Tuesday reiterated the government’s resolve for holding the next general election through Electronic Voting Machines (EVMs) at all cost.\nAddressing the media persons about decisions taken in the Federal Cabinet meeting chaired by Prime Minister Imran Khan, he said a ministerial committee had been constituted to liaise with the Election Commission of Pakistan (ECP) for ensuring implementation of the recently passed laws on electoral reforms.\nThe committee would finalize all the nitty-gritty on use of the EVMs in the next election such as cost, numbers of machines and others, he added.\nThe minister said the committee would comprise Adviser on Parliamentary Affairs Dr Babar Awan, Minister for Railway Azam Swati, Minister for Science and Technology Shibli Faraz, Minister for Information Technology Aminul Haq and Attorney General.\nThe minister said it was imperative that next general election should be and would be held with help of EVMs at all the cost and 9 million overseas Pakistanis would exercise their right of franchise.\nTo a query, the minister said the government had reached out to the opposition many a time and asked them to share their suggestions on the electoral reforms as it wanted consensus on the matter.\nThe entire nation including government, opposition and public had consensus over reforming the existing electoral system, he said, stressing the need for use of the EVMs to end rigging for once and all.\nHe said it had been observed that a series of seminars were held in Lahore and Islamabad during the last week and funded from abroad.\nMinister for Information and Broadcasting Chaudhry Fawad Hussain said the issue of conferences also came under discussion during the cabinet meeting. The Foreign Office would finalize a policy to take up the issue under the Geneva Convention.He said the Supreme Court Bar Association, in its press release, distanced itself from the speeches made against judiciary at a conference at Lahore.\nThe minister welcomed the step taken by the bar association and said he had already advised them to show impartiality in this matter, besides playing their role as defined in the Constitution.\nHe appreciated a leading television news channel for releasing a video which exposed the Pakistan Muslim League-Nawaz’s (PML-N) ploy against judiciary.It was not the first time that the PML-N had released such video which solely aimed at pressurizing the judiciary, he added.\nWhenever the courts took up cases against the Sharif family, such tactics were opted to pressurize the government and courts, he said, expressing the hope that judiciary would reject such pressure.\n“This issue should not stop here and those involved in this activity should be taken to task,” he added.\nPointing to negative role of Maryam Nawaz in politics, the minister said she had remained involved in producing fake videos and formed a special team for the purpose.\nHe said she might have prepared videos of some PML-N leaders to keep them under her control.\nIn Pakistan’s history, no political party had indulged in any such ‘unholy’ activities like Maryam Nawaz group of the PML-N, Fawad noted.\nHe said the Pakistan Tehreek-e-Insaf (PTI) strongly condemned this act and hoped that the issue would reach to its logical conclusion and the government would follow the courts directives on such matter.\nTaking a jibe at the PML-N, he said its leadership should thank the government that now sons of Nawaz Sharif would be able to cast their votes in Pakistan’s elections.About the role of media, he said it was unfortunate that the news were splashed on increase in rates of sugar and tomatoes, but no coverage was given when their prices fell.\nHe said sugar was being sold at Rs 90 to 95 and it was expected that in coming weeks, the price of sweetener might came down to Rs 80 to 85 per kg.\nThe minister said prices of tomato, onion and garlic had decreased substantially with the food basket witnessed balance.\nHe said the government had launched two programmes to provide relief to the masses. The biggest issue right now was high prices of commodities in Sindh, especially in Karachi, he added.\nFawad said after 18th amendment, the federal government could only give policy on certain matters which the provinces had to implement.\nHe said Sindh was asked to release wheat and start sugarcane crushing in time but they did not follow the directives.\n40 per cent of inflation data of Sensitive Price Index issued was consist of Karachi figures, he added.\nHe said in Lahore, wheat flour bag of 20 kg was available at Rs 1,100, whereas the same was available in Karachi at Rs 1460.\nSugar price in Karachi was Rs 107, whereas in major cities of Punjab and KPK, the commodity was being sold at Rs 90 per kg.\nHe urged the media to pressurize the Sindh government so that it could take action for providing relief to the people.\nHe said the federal government had been importing wheat worth $ 700 million, while on the other hand, the Sindh government said that the wheat was stolen from the province.\nHe said if the Sindh government failed to take any action then the federal government had to take the matter in its own hands.\nFawad Hussain said the cabinet was briefed on vacant seats in the ministries of Federal Education and Professional Training, and Industries and Production.\nApproval for establishing Gems and Jewelry Development Authority had also been given to earn precious foreign exchange by boosting its export, he added.\nThe cabinet had accorded approval for a framework between Civil Aviation Authorities of Pakistan and the United Kingdom, he said, adding the agreement would be for three years to improve standards of commercial air lines.\nThe minister advised media to abstain from issuing stories on the cabinet’s agendas without confirmation.\nHe said the cabinet okayed appointments of the Electronic Certification Accreditation Council’s members for a period of three years.\nShehzad Sami Abdul Wahid Khan and Advocate Ghulam Mustafa were appointed members of the National Telecom Corporation, he said, adding Mian Muhammad Ahmed was appointed member of the Port Qasim Authority on temporary basis.\nFawad said the cabinet had given approval for inclusion of Pakistan into Riyadh MoU on Port State Control. It would enable direct communication between Karachi and Riyadh ports, he added.\nHe said the cabinet gave approval for determining prices of 38 new medicines.The pharma sector of Pakistan had posted substantial growth after price adjustments in medicine prices.\nThe minister said he had requested Special Assistant to the Prime Minister on Health Dr Faisal Sultan to inform the public as to how the present government uplifted the pharma sector.\nThe Federal Cabinet, he said approved appointment of Saeed Ahmed as Chief Executive Officer (CEO) of Sukkur Electric Power Company for three years.The CEO of Hyderabad Electric Supply Company had been removed, while Noor Ahmed Soomro was appointed in his place, he added.\nHe said Jameel Akhtar had been appointed as member power of the WAPDA, whereas approval for Javed Akhtar Latif as its Member Water had been given by the cabinet.\nThe decisions taken by the Cabinet Committee on Energy (CCoE) on November 4 and 11 were approved by the cabinet, said Fawad, adding the government had ordered two inquiries one against sugar, while other on hoarding of fuel products by some Oil marketing companies (OMCs).\nHe said the inquiry against OMCs had been concluded. The details would be shared shortly, he added.\nThe minister said the government had taken various measures to strengthen Oil and Gas Regulatory Authority (OGRA).\nThe government has sealed over 2,000 petrol pumps during the campaign. ORGA has stopped the issuance of licenses to more oil marketing companies.\nHe said a system had been devised to determine exact amount of oil reserves in the country and including its location.\nSharing brief detail of the inquiry committee, he said the OMCs had illegally earned Rs 5.52 billion by hoarding the oil.\nAfter the inquiry, he said one CEO of an OMC had been apprehended, while four senior officers including Director General (Oil), OGRA were in jail.\nOMCs assets worth Rs one billion had been frozen, he said, adding in second phase, the cases of seven OMC would be taken to logical conclusion.\nFawad said the cabinet okayed the decisions taken by the Economic Coordination Committee on November 15.\nHe said the cabinet green lighted the payment of Rs 134 billion to Independent Power Producers as second installment.\nLikewise, it had been decided to release funds worth Rs 10 billion for completing sustainable development goals initiatives, he added.\nHe said the cabinet okayed release of funds for establishing ‘Rehmatulil Alamin’ Authority in the country.\nPublic Procurement Regulatory Authority’s rules for urea had been relaxed to avoid creating any dearth of fertilizer in the country, he added.\nA sum of Rs 4.7 billion was being released to Election Commission of Pakistan (ECP) for conducting Local Government elections in the country, he said, adding Islamabad Capital Territory Local Government Ordinance 2021 also got approval to pave way for holding LG elections in federal capital.\nHe said the cabinet approved appointment of members for the board of governor of Federal Government Properties Management Authority’s (FGPMA).\nIts members included BOI Chairman, Naya Pakistan Housing Authority Chairman, Finance Secretary and Secretary Housing or their representatives.\nAbout cadastral mapping of the state land, he said the Sindh government had refused to share data in that regard.\nThe reason of refusal was that the state’s forest land worth over Rs 5,000 billion was in illegal occupation in Sindh province, he added.\nThe state land worth Rs 5.6 trillion had been retrieved and forest would be grown on that land, he said.\nTo another query, the minister said Minister for Economic Affairs Omar Ayub Khan had informed the State Bank of Pakistan through a letter that funding of a programme recently held in a local hotel in Islamabad was ‘illegal’.\nHe reiterated that a thorough investigation would be conducted in the funding of that programme.\nTo another query, he said the PTI was the only party which had submitted complete record on foreign funding in the ECP.\nLikewise, PM Imran Khan had also presented his money trail in the court, he added.He said the ECP should also seek details of foreign funding from other political parties.\nThe minister said the federal cabinet had allowed transportation of Indian food assistance to Afghanistan via Pakistan.",
  "retrievedAt": "2025-08-11T21:39:02.044Z"
}
