{
  "title": "TBTTP as major ecosystem restoration initiative termed global success story at COP26: Zartaj",
  "link": "https://www.app.com.pk/national/tbttp-as-major-ecosystem-restoration-initiative-termed-global-success-story-at-cop26-zartaj/",
  "date_published": "2021-11-23T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Minister of State for Climate Change Zartaj Gul on Tuesday said the success of Ten Billion Tree Tsunami Programme (TBTTP) project was a major ecosystem restoration initiative of the government and was termed as a global success story during the global environmental moot (COP26) held at Glasgow past week.\nAddressing the one-day session organized by the Ministry of Climate Change (MoCC), IUCN Pakistan and EMC Pakistan for the Private Sector’s orientation and engagement on REDD+ the Minister of State as chief guest underlined the untapped investment opportunities in the carbon stocks of the country.\n“The world has recognized the efforts of Pakistan for restoration of nature,” Zartaj underscored. She quoted that the Nationally Determined Contributions (NDCs) of Pakistan have been presented by the MoCC at the COP26. Zartaj Gul apprised the private sector about the investment potential in Pakistan with a focus on reducing emissions from deforestation and forest degradation (REDD+) framework and the available Carbon Stock.\nShe added that the International Union for Conservation of Nature (IUCN Pakistan), Word Wild Fund for Nature (WWF Pakistan) and UN’s Food and Agriculture Organization (FAO) would undertake the independent third party monitoring of the TBTTP.\nThe purpose of this session was to orient the private sector on the importance of REDD+ and investments in forests which is becoming more rewarding. A large number of representatives of the Private Sector entities, government officials, IUCN and EMC staff members attended the event.\nIn his welcome remarks, Country Director Mahmood Akhtar Cheema informed the participants that IUCN was the world’s oldest and largest global environmental organization, and one that was science based, policy-focused and membership driven. He said that the REDD+ Awareness project at IUCN focused on creating general awareness and knowledge of REDD+.\nUnder the project, IUCN has organized trainings and workshops and produced awareness material with the sole intention of helping streamline REDD+ understanding in Pakistan, for stakeholders.\nNational Coordinator REDD+, Ghulam Qadir Shah noted that the private sector “is a critical stakeholder in REDD+ and many different types of businesses can create and sell carbon credits by reducing, capturing, and storing emissions through different processes.  He added that “the private sector is a source of implementation, innovation and investment and engagement must be broadened to slow, halt and reverse forest loss.”",
  "retrievedAt": "2025-08-11T21:39:06.611Z"
}
