{
  "title": "Govt taking steps on priority basis to enhance economic activity: PM",
  "link": "https://www.app.com.pk/national/govt-taking-steps-on-priority-basis-to-enhance-economic-activity-pm/",
  "date_published": "2021-11-23T08:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP): Prime Minister Imran Khan on Tuesday said that with focus on increasing investments in export industry for creating employment opportunities, the government was taking steps on priority basis to enhance economic activity in the country.\nAll government institutions were working together to provide a conducive environment for investors, he said and added that the government was also taking steps to speed up work on Phase II of China Pakistan Economic Corridor (CPEC).\nThe Prime Minister was chairing a review meeting of PM’s Priority Sectors during which a detailed briefing was given on the progress of Phase II of CPEC.\nThe meeting was informed that work on gas and electricity supply in Rashakai, Dhabeji, Allama Iqbal and Bostan Special Economic Zones (SEZs) was in full swing.\nElectricity and gas were mainly available for the construction of industries while the rest of the required electricity and gas will be supplied with further development of industries.\nIn this regard, Plug and Play Model had been proposed by CPEC Authority, which was being worked on. Under the model, all the requirements of the investors will be met through one window operation to ensure speedy construction of industries in these areas.\nAt the same time, the Board of Investment (BOI) was working on a portal to provide investors with information related to construction of industries, approvals from various institutions and other ancillary information, which will be launched soon.\nThe meeting was also informed that a comprehensive system has been launched to review the progress of projects under CPEC and to expedite the development work.\nIn addition, steps were being taken to increase investment in SEZs by identifying export industries. In the agriculture sector, not only work on corporate farming was in full swing, but also agreements were being made to increase the exports of the sector.\nThe prime minister directed authorities concerned to complete all the steps related to CPEC Phase II within the stipulated time.\nThe meeting was attended by Federal Ministers Asad Umar, Hamad Azhar, Advisers Shaukat Fayyaz Tarin, Moeed Yousuf, Special Assistant Dr Shahbaz Gill, Chairman CPEC Khalid Mansoor, Chairman Board of Investment Azfar Ahsan and relevant senior officers.",
  "retrievedAt": "2025-08-11T21:39:09.171Z"
}
