{
  "title": "Senate body urges Islamabad police for provision of security to citizens",
  "link": "https://www.app.com.pk/national/senate-body-urges-islamabad-police-for-provision-of-security-to-citizens/",
  "date_published": "2021-11-23T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 23 (APP):The Senate Standing Committee on Interior Tuesday expressed grave concern over the rising incidents of law and order including theft, robbery and other crimes in the federal capital and said that the concerned agencies should be properly mobilized to provide security to the citizens.\nThe committee met under the chairmanship of Senator Mohsin Aziz and discussed the steps taken by the Islamabad Police to maintain law and order and curb crime in Islamabad.\nThe incident of robbery at the residence of Nuzhat Sadiq in F-10 sector and the unprofessional behavior of the police regarding theft in sector G-13 of Islamabad and the implementation of the recommendations of the Standing Committee for the same were reviewed in detail during the meeting.\nThe chairman said that everyone was worried about the deteriorating law and order situation in the capital and the incidents of theft, robbery, murder and abuse in the posh areas of Islamabad have become a question mark on the performance of the concerned agencies.\nRegarding the robbery at the residence of Senator Nuzhat Sadiq, she said that five to six persons entered the house in a white car at around 1.30 pm. Her husband was also present at the house and he along with servants were taken hostage and robbed.\nNuzhat Sadiq said there have been several robberies in sector F-10 in the last few days which was a matter of grave concern for the government, adding that she called helpline 15 but the number was also busy and no one called back from 15.\nInspector General Islamabad Police Qazi Jameel ur Rehman informed the committee that it was the duty of the police to provide security to the citizens and every effort was being made to keep the crime rate in Islamabad as low as possible.\nHe said that things were changing very fast and countless groups and new gangs had sprung up, adding that the police department was implementing new reforms to maintain law and order and security to the citizens.\nQazi Jameel said that systems were being set up for immediate action, the trackers were being installed on police vehicles and bikes while the number of mobile vehicles were also being increased.\nHe said the Safe City project was launched in 2008 which was completed in 2018 and around 1900 cameras were installed, while at present only 96 percent cameras were in working condition.\nQazi Jameel said now Islamabad was spreading very fast and only 30 percent coverage was being provided with existing cameras. He said plans for installation of 1900 more cameras have been sent to ensure better security and safety of the citizens.\nHe said the department was going to procure smart vehicles and consultations were also being held with Khyber Pakhtunkhwa, Punjab and Sindh to collect data of criminal people.\nThe body was informed that the police department had 49 vehicles and 130 motorcycles for patrolling and steps were being taken against policemen who harass the general public.\nAbout the incidents of aerial firing and fireworks in Sector G-9 of Islamabad, Mohsin Aziz said that strict action should be taken against the culprits to control these types of incidents in future.\nSenator Samina Mumtaz Zehri, Saifullah Abro, Rana Maqbool Ahmed, Shahadat Awan, Muhammad Talha Mahmood, Fauzia Arshad, Dilawar Khan and Nuzhat Sadiq, IG Islamabad Police Qazi Jameel ur Rehman, DIG Operation Islamabad, DIG Safe City, Joint Secretary Ministry of Interior, DC Islamabad Hamza Shafqaat and other senior officials attended the meeting.",
  "retrievedAt": "2025-08-11T21:39:01.819Z"
}
