{
  "title": "Realms of spiritual thought: Iqbal’s concept of selfhood ‘Khudi’ encompassing youth’s ideology",
  "link": "https://www.app.com.pk/national/realms-of-spiritual-thought-iqbals-concept-of-selfhood-khudi-encompassing-youths-ideology-dr-saeed-ahmad-ali/",
  "date_published": "2023-11-09T15:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 09 (APP):Khudi-Iqbal’s concept of selfhood and self-esteem shows great depth of conscience, perspective, and feeling.\nThis word is translated to selfhood – in Urdu and Persian is a principle thought outlined in the impressive writings, poems, and philosophic thoughts of Allama Muhammad Iqbal.\nDr Allama Muhammad Iqbal is one of the founders of Pakistan, who submitted the concept of khudi – including self-respect, self-reliance, self-preservation, self-confidence, and even self-assertion -, experts told APP on Thursday, in connection with Iqbal Day.\nMian Iqbal Salahuddin, son-in-Law of Allama Iqbal told APP that Iqbal was an outstanding poet-philosopher, perhaps the most influential Muslim thinker of the twentieth century.\nAllama Muhammad Iqbal is rightly considered the poet of the East, he said. He influenced the thought, the history, and the lives of the people of the Sub-continent to a great extent to mature their multi-dimensional thought, Salahuddin said.\nWith his powerful poetry, written in the classical style for easy and public recitation, Iqbal introduced the concept of Khudi and led Muslims to rethink their standing in the world, he said.\nHe was deep in the realms of spiritual thought drawing great inspiration from Jalal-ud-Din Rumi, he said.\nTo a query, Salahuddin said that Iqbal’s philosophy, showed the influence of Muslim thinkers such as al-Ghazali and Rumi as well as Western thinkers such as Nietzsche and Bergson.\nDirector of the Institute of Urdu Language and Literature, Oriental College, University of the Punjab, Prof. Dr. Muhammad Kamran said that Iqbal read with the sensitivity of a poet and the insight of a mystic.\nThe great Iqbal’s philosophy is known as the philosophy of Khudi or Selfhood.\nTo Iqbal, human beings are not mere accidents in the process of evolution, Kamran said, adding, according to Iqbal, the cosmos exists in order to make possible the emergence and perfection of the Self.\nThe purpose of life is the development of the Self, which occurs as human beings gain greater knowledge of what lies within them as well as of the external world, he added.\nIqbal’s philosophy of Khudi is essentially a philosophy of action, and it is concerned primarily with motivating human beings to purposefully strive to actualize their God-given potential and hidden insight to the fullest degree, Dr Kamran said.\nNoted intellectual, critic, and poet Mansoor Afaq said the greatest tribute to his stature among poets is that even to this day, poets, researchers, academicians, and scholars of Urdu, Persian, poetry, and philosophy, the world over, simply can not approach his works except with the deepest of admiration and awe at the depth of his insight and thoughts.\nIn 1915, Iqbal published his collection of poetry, the Asrar-e-Khudi (secrets of the self) in Persian.  The feature points emphasize the spirit and self from a religious, spiritual perspective, Afaq said.\nIt is worth mentioning here that many critics have called Asrar-e-Khudi, the Iqbal’s finest poetic work.\nIn this book, Iqbal has explained his philosophy of Khudi or self.\nMansoor Afaq further explained the term Ruh in Iqbal’s poetry saying that it is that divine spark that is present in every human being and was present in Adam for which God ordered all the angels to prostrate in front of Adam.\nHowever one has to make a great journey of transformation to realize that divine spark which Iqbal calls Khudi.\nIn Asrar-e-khudi, Iqbal has explained his philosophy of proving by various angels that the whole universe obeys the will of the self.\nMoreover, he said that Iqbal condemns self destruction. For him the aim of life is self-realization self respect and and self -knowledge.\nNoted educationist poet and critic Prof. (Retd) Dr Fakhar-ul-Haque Noori said that Iqbal’s concept of ‘Khudi’ has  to be conceptulised in relation to a set of other concepts like affection, love, God, Freedom, Creativity dynamism, the perfect man (insan-e Kamil or Mard-e-Momin) and time and eternity.\nHe said that in his long poem Asrar-e-Khudi, Iqbal often sings of these features of Khudi and also of the infinite possibilities of thought development and progress hidden in it.\nAsrar-e-Khudi valuable ‘theme’ concerning khudi is two-fold : that the reality underlying the system of the universe is khudi as a creative principle and that the limits and the determinants of khudi depend upon the strength of khudi itself.  The opening verses of Asrar-e-Khudi  read as :\nThe forms of life are the manifestations of Khudi,\nWhatever I behold is due to the effects of Khudi\nIt made manifest the phenomenal world to me.\nHundred worlds are hidden within your essence.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:26:45.004Z"
}
