{
  "title": "PM Kakar, President Aliyev discuss bilateral, regional matters including Gaza, Kashmir",
  "link": "https://www.app.com.pk/national/pm-kakar-president-aliyev-discuss-bilateral-regional-matters-including-gaza-kashmir/",
  "date_published": "2023-11-09T06:26:00.000Z",
  "source": "APP",
  "content": "TASHKENT, Nov 09 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday held a meeting with President of Azerbaijan Ilham Aliyev wherein they discussed the bilateral cooperation and regional issues including humanitarian situation in Gaza and Indian atrocities in IIOJK.\nThe meeting took place on the sidelines of 16th Summit of Economic Cooperation Organization being held in here.\nThe two leaders reviewed the progress in bilateral relations especially in the domains of trade, defence and energy.\nConstructive interaction with President @presidentaz of Azerbaijan on sidelines of #ECOSummit2023. Our trade, defence, and energy ties are growing. The launch of direct AZAL flights will bolster our connectivity. Together, we address global issues like Islamophobia and climate… pic.twitter.com/0yFsz7qjEd\n— Anwaar ul Haq Kakar (@anwaar_kakar) November 9, 2023\nPrime Minister Kakar welcomed the announcement of direct flight operations of Azerbaijan Airline (AZAL) to Pakistan terming it a positive development in people to-people exchanges and to advance two-way business and tourism.\nPrime Minister Kakar and President Aliyev discussed common challenges including Islamophobia and climate change and the critical role of ECO to promote regional cooperation and collective prosperity.\nThe global and regional developments including the dire humanitarian situation in Gaza and persistent Indian atrocities in Indian Illegally Occupied Jammu & Kashmir (IIOJK) were also discussed.\nPrime Minister Kakar reaffirmed Pakistan’s unwavering support for the sovereignty and territorial integrity of Azerbaijan, especially with respect to Karabagh.\nLater, the prime minister referring to his “constructive” interaction wrote on social media platform X that Pakisan-Azerbaijan trade, defence, and energy ties were growing.\nHe viewed that the launch of direct AZAL flights would bolster bilateral connectivity.\n“Together, we address global issues like Islamophobia and climate change,” he wrote on X.",
  "retrievedAt": "2025-08-11T10:26:56.642Z"
}
