{
  "title": "Jazz CEO commends SBP, PTA for driving digital, financial inclusion at World Economic Forum Webinar",
  "link": "https://www.app.com.pk/national/jazz-ceo-advances-financial-inclusion-agenda-at-wefs-spotlight-pakistan-day/",
  "date_published": "2023-11-09T12:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 9 (APP):Chief Executive Officer (CEO) Jazz and Chairman Mobilink Microfinance Bank (MMBL) Aamir Ibrahim has expressed high praise for the pivotal roles played by the State Bank of Pakistan (SBP) and the Pakistan Telecommunication Authority (PTA) in propelling digital and financial inclusion across the nation through enabling policies. He also lauded the successful implementation of the Asaan Mobile Account (AMA), citing it as a shining example of the cooperative efforts among industry stakeholders to combat challenges posed by a cash-based economy, unbanked population, and limited credit access for small businesses.\nAamir made these remarks during the ‘Spotlight Pakistan Day’ webinar, hosted by the World Economic Forum (WEF) and Virtual Remittance Gateway (VRG), where VRG serves as Pakistan’s partner in the Edison Alliance – a WEF initiative dedicated to advancing digital inclusion and supporting underserved communities globally.\nDignitaries at the webinar included Caretaker Prime Minister Anwaar-ul-Haq Kakar, Caretaker Federal Minister for Finance, Revenue, and Economic Affairs Dr. Shamshad Akhtar, VRG and Pathfinder Group Chairman Zarrar Sehgal, and VRG CEO Muhammad Salman Ali. They all shared valuable insights on the progress of financial inclusion in Pakistan.\nDuring the event, Aamir Ibrahim reaffirmed JazzCash’s commitment to leveraging technology for the betterment of lives and livelihoods in Pakistan, especially for women and marginalized communities. He highlighted how the platform, boasting a user base of 44 million, is actively reducing women’s financial exclusion and providing them with tailored financial solutions. Aamir also discussed the positive trend of digital financial inclusion in Pakistan, where mobile wallets are surpassing traditional bank accounts and Raast is reaching millions of users.\nDelving into strategies for promoting financial inclusion, with a special focus on women, rural, and low-income communities, Aamir proposed crucial policy recommendations. These included utilizing real-time data for targeted policy interventions, broadening SME access to credit through digital lending platforms, and enhancing handset affordability for the masses.\nAamir emphasized the vital role of financial literacy and empowering women through enhanced awareness and access to financial services. He also stressed the importance of public-private collaborations in crafting resilient and sustainable financial solutions tailored for women, with an aim to foster women’s entrepreneurship.\nRecognizing the substantial contributions of Asaan Mobile Accounts (AMA) and Raast in ongoing financial inclusion endeavors in Pakistan, Aamir called upon both the government and key stakeholders, from both domestic and international spheres, to explore fresh opportunities in Pakistan’s burgeoning fintech landscape.",
  "retrievedAt": "2025-08-11T10:26:49.451Z"
}
