{
  "title": "Embracing Iqbal’s Khudi philosophy vital to overcome Muslim Ummah, Pakistan’s challenges: President",
  "link": "https://www.app.com.pk/national/embracing-iqbals-khudi-philosophy-vital-to-overcome-muslim-ummah-pakistans-challenges-president/",
  "date_published": "2023-11-09T05:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 09 (APP): President Dr Arif Alvi on Thursday said that adherence to Allama Iqbal’s philosophy of Khudi (self-esteem) was direly needed to overcome the challenges faced by the Muslim Ummah as well as Pakistan.\nThe president, in his message to the nation on the birth anniversary of Pakistan’s national poet Allama Muhammad Iqbal annually observed on November 9, said the Iqbal Day was a reminder to be aware of his message and adopt it at the individual and national levels.\nPaying tribute to the noted poet and philosopher for his services, President Alvi called for reaffirming the commitment to follow Iqbal’s message and making his ideas and thoughts a guiding principle to make Pakistan a modern Islamic welfare state.\nMentioning the global recognition of Allama Iqbal’s intellectual and political services, he said Allama Iqbal’s poetry had a unique distinction in Urdu language which gave political awareness to the Muslims of the subcontinent.\nMoreover, the great poet also awakened the nation and persuaded it to decide its own destiny, he added.\nThe president said that by addressing the youth in his poetry, Iqbal taught them to revive the spirit of self-esteem as he desired the Muslims of the subcontinent, especially the youth, to adopt the philosophy of self-reliance to change their destiny.\nBesides being a great supporter of the acquisition of modern education, Allama Iqbal also taught the youth to adhere to the Holy Quran.\nHe said Iqbal’s philosophy gave a message that bravery, modesty, wisdom, great character and morals, self-respect, foresight and self-confidence were the highest human qualities to revitalize not the individuals but the nation.\nThe president said Allama Iqbal’s philosophy was universal and revolutionary which gave a message of hope, unity and solidarity to Muslims, besides identifying the major challenges being faced by the nation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:27:20.132Z"
}
