{
  "title": "90% of the imported waste ends up in oceans: Sherry",
  "link": "https://www.app.com.pk/national/90-of-the-imported-waste-ends-up-in-oceans-sherry/",
  "date_published": "2022-06-06T16:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 6 (APP):”90% of the imported waste ends up in oceans and other water bodies. Which then breaks down into microplastics which are ingested by aquatic creatures.”\nThis was stated by Federal Minister for Climate Change Senator Sherry Rehman, who spoke as the Chief Guest at the World Environment Day-2022 webinar hosted by National Institute of Maritime Affairs (NIMA) on the theme of ‘Restoring and Protecting Pakistan’s Environment-Way Forward towards Only One Earth’.\nShe started by recognizing World Environment Day 2022 as a pivotal moment in Pakistan’s encounter with the environment, “This year’s theme of ‘Only One Earth’ should be a jolt to us. Pakistan has been taking the environment for granted.\nThe loss of biodiversity, climate change, and pollution are the three key drivers of the change in our environment. We suffer such a climate catastrophe due to anthropogenic activities that have been ongoing for more than a millennia.\nThe country is at the tipping point in its climate history. It is home to a few of the hottest urban dwellings for the last three years. This year we surpassed 51 degrees in some areas of the country, which is quite uninhabitable.”\nShe continued, “The country’s environment is being degraded in a multitude of ways, one of these is oceanic pollution. Pakistan in 2020 generated 3.9million tonnes of plastic waste of which only 30% is recycled.\nWe import an additional 65,000 metric tons of plastic waste annually which is used by local manufacturers to produce ‘recycled’ products. However, 90% of the imported waste ends up in oceans and other water bodies.\nWhich then breaks down into microplastics which are ingested by aquatic creatures. The world bank found that the Indus carries 10,000 metric tonnes of microplastics to the Arabian sea. It is not just micro-plastics which make their way to the water bodies, it’s plastic bottles, bags, sewage and potentially infectious medical waste.\nIt’s not just the coastline, there has been a fatal blow to the Indus, the delta which was once biodiversity-rich providing shelter and a natural breeding ground for migratory birds and other animals is now increasingly saline. World Wildlife Fund (WWF), and local organizations like Sindh Forest Department have and continue to do a wonderful job to increase the forest cover of mangroves in the Indus delta region.\nA total of 14,000 mangroves have been conserved and co-managed in the delta. Mangroves are hubs of biodiversity that we cannot afford to lose.\nThere was once a time when Indus dolphins swam across the Indus River and its tributaries freely, from the Indus delta near the Arabian Sea to the Snowcapped Himalaya. Today they occupy only 20% of its range.\nThe few remaining Indus dolphins are concentrated in Sindh, in the river between the Guddu and Kotri dams.”\nShifting the focus towards Pakistan’s maritime zone she said, “Pakistan’s coastline is about 990 km long, extending from the Indian border in the east to the Iranian border in the west.\nThe Exclusive Economic Zone (EEZ) of Pakistan is about 240,000 sq. km, with an additional continental shelf area of about 50,000 sq. km. The total maritime zone of Pakistan is over 30% of the land area.\nIn the old ‘business-as-usual’ model, nations develop their ocean economies through the exploitation of maritime and marine resources – for example, through shipping, commercial fishing, and oil, gas, and mineral development.\nOften, they don’t pay adequate attention to the effect of these activities on the future health or productivity of the same resources and the ocean ecosystems in which they exist.\nThe ‘blue economy’ concept provides a more holistic vision that embraces economic growth – when it is sustainable and does not damage other sectors. Similar to the ‘green economy, the blue economy brings human well-being, social equity and environmental sustainability into harmony.\nThe blue economy embraces economic opportunities. But it also protects and develops more intangible ‘blue’ resources such as traditional ways of life, carbon sequestration and coastal resilience in order to help vulnerable states mitigate the devastating effects of poverty and climate change.\nWhen I talk about the Blue Economy, I talk about all economic activity relating to oceans, seas and coasts, from fishing to renewable marine energy to coastal tourism. The requisite changes do not come from laws and policies alone. It has to be an overall effort where all stakeholders work towards improving both the blue and green economy.”\nShe further elaborated, “According to available data we haven’t reached the threshold after which it will become irreversible to control the damage done to our environment, so the right time to act is now.\nWe need to act as a whole with the citizens, civil society, private sector and government institutions coming together as agents of change. We must take steps to move the needle on change, and this can only be done when everyone fulfils their collective roles.\nWe have come to a moment of clear reckoning in terms of biodiversity loss, climate crises and pollution. Pakistan is one of the ten most vulnerable countries in the world.\nOur glaciers are rapidly melting. The Indus, which is the jugular of the river system and feeds 90% of our agricultural sector, which coincidentally uses 85% of Pakistan’s total water supply, is rapidly drying.\nThe UN has predicted we will be water-scarce by 2025. This is not some remote future; rather it is a looming crisis, for which we do not have to make a quantum jump to make a change but we will have to consider ways to manage our crop diversity, irrigation, and water used in manufacturing and domestic & other public consumption.”\nShe concluded, “Since I’ve come into the office, I’ve been repeatedly insistent on recognizing the urgency of the climate crisis through behavioral change messaging in sensitizing the general public; for them to understand that our futures are endangered if there is no change. Pakistan needs to invest in intellectual and material resources.\nIssues such as poor infrastructures, red-tapism within the system, bureaucratic bottlenecks, regional instability especially bad law and order situation in Baluchistan, and lack of coordination and awareness between departments and ministries need to be rectified.\nAll-encompassing policies should be introduced and concerted efforts, small or large, should be made in line with the concept of the blue economy. We need to build economic instruments to leverage environmental protection, such as blue carbon, blue bonds and coastal resilience insurance.”",
  "retrievedAt": "2025-08-11T15:02:17.141Z"
}
