{
  "title": "Civic bodies put out Trail-3 inferno after strenuous efforts",
  "link": "https://www.app.com.pk/national/civic-bodies-put-out-trail-3-inferno-after-strenuous-efforts/",
  "date_published": "2022-06-06T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 6 (APP): The civic bodies have put out the fire that broke out on Sunday at Trial-3 of the Margalla Hills National Park after strenuous efforts of over 150 fire fighters continued for almost 15 hours.\nThe Capital Development Authority (CDA), Islamabad Wildlife Management Board and Pakistan Army jointly assisted the firefighting operation.\nThe National Disaster Management Authority also assisted the Capital’s district administration in getting two helicopters to expedite the fire extinguishing efforts.\nA CDA official told APP that the firefighting operation concluded at 0500 hours early in the morning. Around 150 individuals took part in the effort to douse the massive fire.\nThe heavy fire affected a huge area of the protected forest where Pakistan Army on the special directions of the prime minister provided two helicopters to assist civil administration in the operation.\nThe Inter Services Public Relations (ISPR) also in its news release informed that the Army was assisting civil administration in extinguishing the fire on Margalla Hills.Two helicopters of Pakistan Army Aviation were flown to the affected area.The helicopters through multiple sorties used bambi buckets carrying water for extinguishing the fire.\nAn official of Islamabad Wildlife Management Board (IWMB) told APP that the fire was reported around 02:00 p.m. to 02:30 p.m. at Trail-3.Almost 25 fire fighters of IWMB initially rushed to the scene to put out fire whereas 20 fire fighters of the CDA were working jointly to extinguishing the fire, he added.\nThe official added that the CDA had also called a reinforcement of its additional firefighting staff that comprised of around 25 fire fighters to join the efforts in dousing the fire.He said the fire was massive and probably man-made as every year forest fire used to erupt in this area during peak season.\nIt may be mentioned here that fire season starts from April in Margalla and badly damages biodiversity and environment. The IWMB and CDA officials set up fire fighting pickets to patrol the area to contain forest fires in the national park.",
  "retrievedAt": "2025-08-11T15:02:24.908Z"
}
