{
  "title": "PM, Saudi Crown Prince reaffirm commitment to deepen bilateral ties",
  "author": null,
  "content": "MAKKAH, Jun 06 (APP): Prime Minister Muhammad Shehbaz Sharif Friday met with His Royal Highness Prince Mohammed bin Salman bin Abdulaziz, the Crown Prince and the Prime Minister of Saudi Arabia, in Makkah al-Mukarramah and discussed matters of mutual interest.\nThe meeting reaffirmed the deep-rooted, strategic and fraternal ties between Pakistan and the Kingdom of Saudi Arabia.\nThe Prime Minister was accompanied by a high-level delegation comprising Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar, Chief of Army Staff Field Marshal Syed Asim Munir, Minister for Interior Syed Mohsin Raza Naqvi and Minister for Information Attaullah Tarar.\nOn behalf of the government and people of Pakistan, Prime Minister Shehbaz Sharif extended warm Eid greetings to His Majesty King Salman bin Abdulaziz and His Royal Highness Mohammed bin Salman the Crown Prince and commended the Kingdom’s hospitality and service to the pilgrims from around the world who are in Saudi Arabia to perform Hajj.\nHe expressed gratitude for the remarkable efforts of the Custodian of the Two Holy Mosques and the Crown Prince in ensuring a safe and spiritually fulfilling pilgrimage experience.\nThe Prime Minister expressed appreciation for the Kingdom’s proactive role during recent tensions between Pakistan and India, and its steadfast commitment to promoting peace and stability in the region and beyond. He underscored Pakistan’s policy of responsible restraint in the face of Indian aggression, emphasizing that sustainable peace in South Asia is achievable only through dialogue.\nThe two leaders also held detailed discussions on the dire humanitarian situation in Gaza.\nThey stressed the imperative for the international community to fulfill its moral and legal obligations and reiterated their unwavering support for a just and durable resolution to the Palestinian question, grounded in the Arab Peace Initiative and the relevant United Nations Security Council resolutions.\nPrime Minister Shehbaz Sharif expressed satisfaction on the growing momentum of bilateral cooperation in the political, economic and security domains. Both leaders agreed to further elevate this strategic partnership in accordance with the shared vision of the leadership and the aspirations of the brotherly people of the two countries.\nBoth leaders reaffirmed their mutual commitment to deepening the multifaceted relationship between Pakistan and Saudi Arabia.\nPrime Minister Shehbaz Sharif extended a cordial invitation to His Royal Highness the Crown Prince to undertake an official visit to Pakistan at his earliest convenience, which the Crown Prince graciously accepted.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:51:42.338Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-saudi-crown-prince-reaffirm-commitment-to-deepen-bilateral-ties/",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T16:22:00.000Z"
}
