{
  "title": "Motorway Police continue crackdown against overcharging on Eidul Azha",
  "author": null,
  "content": "ISLAMABAD, Jun 06 (APP): The National Highways and Motorway Police (NHMP) have continued their enforcement drive during Eid holidays to curb overcharging and overloading on highways and motorways across the country.\nAccording to an official spokesperson, the NHMP responded to various complaints from passengers and took action against transporters violating fare and load regulations. As a result, more than Rs 31,64000 were refunded to overcharged passengers traveling in different cities. In addition, authorities imposed fines exceeding Rs 18.1 million on vehicles found guilty of overloading.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/06/WhatsApp-Video-2025-06-06-at-8.05.48-PM.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nOfficers are conducting strict checks on vehicles to ensure compliance with safety and fare regulations. These checks are in effect on both motorways and national highways, and efforts are underway to maintain smooth and safe travel during the Eid rush.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/06/WhatsApp-Video-2025-06-06-at-8.05.46-PM-2.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nNHMP teams are also holding roadside safety briefings to raise awareness among drivers and passengers. Drivers are being reminded to always wear seat belts, observe speed limits, avoid driving while tired, and follow traffic rules.\nThe NHMP has urged the public to report any incidents of overcharging, overloading, or unsafe driving. Complaints or requests for assistance can be made by calling the Motorway Police Helpline at 130, which remains active throughout the holiday period.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:51:18.752Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/motorway-police-continue-crackdown-against-overcharging-on-eidul-azha/",
  "dateList": "2025-06-06",
  "date_published": "2025-06-06T16:44:00.000Z"
}
