{
  "title": "Mushaal urges world for urgent steps to stop HR violations in IIOJ&K",
  "link": "https://www.app.com.pk/national/mushaal-urges-world-for-urgent-steps-to-stop-hr-violations-in-iiojk/",
  "date_published": "2023-06-03T04:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP):Chairperson of Peace and Culture Organization, Mushaal Hussein Mullick, Saturday urged the global community, especially the European Union to take urgent steps to stop the human rights violations and crimes against humanity in the Indian-occupied Jammu and Kashmir(IIOJ&K).\nTalking to a private news channel here, she said that “The Modi regime is attempting to silence the legitimate political voices of the people in IIOJK through such brutal measures”.\nModi-led Hindutva government has miserably ruined the lives of innocent people of occupied Kashmir, she added.\n“The people of IIOJK were continuously facing the worst form of brutalization and abuses by Indian occupation forces”, she added.\nShe further said that her husband Yasin Malik was facing life imprisonment in Tihar Jail and India was subjecting him to vengeance to break his resolve of freedom, but he is firm in his stand on the Kashmir dispute.\nIndia has a long history of using the judiciary and other state apparatus to suppress the political and democratic dissent and legitimate political voices in the occupied Kashmir, she said.\n“Yasin Malik is being targeted merely for his political beliefs. His only crime is that he refused to accept the Indian dictation on Kashmir”, she said.\nThe Modi leadership has totally failed to fulfill people’s aspirations, adding, most parts of Jammu are facing scarcity of potable water and power and dilapidated condition of lanes as well, she mentioned.\nShe also urged the international community especially the EU to play its role in facilitating a just and peaceful settlement of the Kashmir dispute in accordance with the relevant UN Security Council resolutions and the wishes of the Kashmiri people for ensuring durable peace in South Asia.",
  "retrievedAt": "2025-08-11T08:36:57.604Z"
}
