{
  "article_id": "2025-10-28_6917539fe309c4c429238d23307b30c2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/romanian-culture-days-begin-in-pakistan-to-strengthen-cultural-edu-ties/",
    "retrieved_at": "2025-11-01T14:08:32.493Z"
  },
  "metadata": {
    "title": "“Romanian Culture Days” begin in Pakistan to strengthen cultural & edu ties",
    "author": null,
    "date_published": "2025-11-01T14:04:21.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/11/rom-e1761985904576.jpg",
    "categories": [
      "National"
    ],
    "word_count": 491,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Nov 01 (APP):The Embassy of Romania in Pakistan has launched the first-ever Romanian Culture Days in Pakistan, a celebration of Romanian heritage, art, and cultural diplomacy aimed at building cultural bridges and promoting people-to-people connections between the two countries. The month-long festival will be held across Islamabad, Karachi, and Peshawar throughout November, said a press release issued on Saturday, said a press release. The event series opened in Karachi with an early celebration of Romania's National Day and a photo exhibition marking 61 years of diplomatic relations between Pakistan and Romania. Organized with the support of the Romanian National Archives and the Ministry of Foreign Affairs of Romania, the exhibition presents a visual journey through key milestones in bilateral friendship and cooperation. The exhibition will later travel to Islamabad and Peshawar. Romanian opera and dance will also feature prominently, with renowned soprano Georgiana Costea Gluga performing at the World Culture Festival in Karachi on November 4, followed by an opera workshop and Romanian film screenings at the Arts Council of Pakistan on November 5. Ballet Beyond Borders will showcase a dynamic dance performance promoting artistic excellence and cultural exchange. As part of its commitment to education and cultural diplomacy, the Embassy of Romania will donate a rich collection of Romanian literature, art, and history books to the National Library of Pakistan and the National University of Modern Languages (NUML) in Islamabad, with support from the Romanian Cultural Institute. Later this month, NUML will inaugurate the Romanian Language Lectorate under Professor Dr Oana Ursache, providing Pakistani students with an opportunity to learn the Romanian language and explore its rich cultural, artistic, and cinematic heritage. The Romanian Lectorate at NUML is fully funded by the Romanian state, through the Romanian Language Institute (Institutul Limbii Romane ILR) and the Romanian Ministry of Education and Research. On this occasion, Professor Ursache will deliver a lecture dedicated to Queen Marie of Romania, highlighting Her Majesty's personality and diplomatic legacy, on the 150th anniversary of her birth. The lecture will be accompanied by a screening of the acclaimed documentary \"Marie Heart of Romania\", which portrays Queen Marie's remarkable political influence and captivating personal story. On November 15, the award-winning Romanian film \"The New Year That Never Came\" (Anul Nou care n-a fost, 2024), written and directed by Bogdan Muresanu, will be screened at the Karachi Film School at 7:00 PM, as part of the European Film Festival. The film is a powerful historical tragicomedy set in the final days of 1989 Romania, when six lives intertwine amid protests, hopes, and the fall of the communist regime. The Embassy of Romania reaffirmed its commitment to strengthening bilateral relations built over six decades of friendship, mutual respect, and cooperation. The events are being organized in collaboration with the Romanian Cultural Institute, Romanian Language Institute, Romanian National Archives, Pakistan-Romania Business Council, and the Pakistan-Romania Friendship Association. Discover Pakistan and HUM News are serving as media partners for the initiative.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}