{
  "article_id": "2025-10-28_330cf32be46e5ae15f40e68c82de53f3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-zardari-stresses-upon-collective-resolve-for-making-gilgit-baltistan-a-model-of-development/",
    "retrieved_at": "2025-11-01T14:08:33.713Z"
  },
  "metadata": {
    "title": "President Zardari stresses upon collective resolve for making Gilgit Baltistan, a model of development",
    "author": null,
    "date_published": "2025-11-01T14:04:21.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/11/videoframe_46782916-e1761989272223.png",
    "categories": [
      "National"
    ],
    "word_count": 875,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "GILGIT, Nov 01 (APP):: President Asif Ali Zardari, Saturday, stressed upon renewing their collective resolve of making Gilgit Baltistan a model of development, justice and equality. Addressing a ceremony here to mark 78th Independence Day of Gilgit Baltistan from Dogra Rule, the president said over the last seven decades, people of Gilgit Baltistan had marched shoulder to shoulder, with the rest of Pakistan. \"You have guarded the borders, advanced the progress and carried flag of Pakistan to the world's highest peaks. This region is not only a crown of Pakistan but also our northern gateway; a symbol of lasting friendship with China,\" he added. The president said Karakorum Highway was a living memento to this partnership, adding the China Pakistan Economic Corridor (CPEC) had brought new opportunities of livelihood, trade and connectivity for the people of GB. He further emphasized that it should be their collective task that its dividends reached every valley and village, creating shared prosperity for all. The president opined that the region offered best to the rest of the country and to the world at large. President Zardari said that freedom of Gilgit Baltistan people also reminded them of the unfinished journey of their brothers and sisters in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). \"While you enjoy liberty and rights under the flag of Pakistan, they continue to face occupation and repression. We stand with them too till they get freedom in accordance with the UNSC resolutions and their aspirations,\" he added. Terming Gilgit-Baltistan his \"second home\", President Zardari said the brave people of this region gained their freedom through their own efforts and chose to join Pakistan. He paid glowing tribute to the martyrs of the Gilgit-Baltistan freedom movement in his address at the central ceremony marking the 77th Independence Day of Gilgit-Baltistan, held here at the Army Helipad Ground. The President said for the last 70 years, the people of Gilgit-Baltistan stood shoulder to shoulder with Pakistan. \"This region is not only the crown of our heads but also a vital land route linking Pakistan with China, bringing prosperity to the nation,\" he remarked. He added that November 1 is not only the Independence Day of Gilgit-Baltistan but of the entire Pakistan. The event was attended by the governor, chief minister, members of the legislative assembly, military, civil officials and a large number of people. President Zardari also expressed his pleasure at witnessing the affection and love of the gathering and said that the region was like a home to him. He said the history of the region had been marked with incidents of unforgettable bravery and sacrifices. During liberation movement from Dogra Rule in 1947, 1,700 inhabitants sacrificed their lives while 30,000 other were wounded, he said, adding that they saluted them for their heroic struggle and sacrifices. The president mentioned that the PPP governments had always focused on the progress and prosperity of the region. Shaheed Zulfikar Ali Bhutto showed affection for the Gilgit Baltistan people and in 1974, abolished FCR while princely states were brought into one single administrative unit while Shaheed Benazir Bhutto had introduced structural governance system. The PPP federal government made constitutional amendments to introduce legislative assembly, and the offices of the governor and the chief minister. In democratic movement, he said the PPP workers from this region, embraced martyrdom in Karachi and Rawalpindi. The president also underlined the need of providing facilities for education and health at every place of the region. He observed that Gilgit Baltistan was blessed with vast natural resources, including water which could be utilized for power generation, while tourism also had immense potential. He suggested that the area could have its airlines for the promotion of tourism. The president said in India, Muslim minority was facing worst persecution at the hand of ruling majority. He praised Quaid e Azam Muhammad Ali Jinnah, founder of Pakistan, for the creation of a separate homeland. Chief Minister Haji Gulbar Khan, in his remarks, said that they had liberated the region from Dogra rule in 1947 and paid tributes to the shuhada of the movement. He said the residents of Gilgit Baltistan had been making valuable contributions for the country in different spheres of life. He thanked President Zardari for attending the Independence Day celebrations. He said that the PPP gave Gilgit-Baltistan its identity in 2009, for which the people would always remain grateful. The Chief Minister further said that integrating Gilgit-Baltistan into the constitutional framework without affecting the Kashmir issue would foil India's malicious designs. He paid tribute to the martyrs of the Pakistan Armed Forces and lauded the leadership of Field Marshal General Syed Asim Munir, stating that Operation Bunyan al-Marsus has further enhanced the prestige of Gilgit-Baltistan. President Zardari also reviewed the parade and witnessed the march past. Cultural floats representing all three divisions of Gilgit-Baltistan were also presented at the ceremony that received great applause from the participants. The event was attended by Commander X Corps Lieutenant General Ahsan Amir Nawaz, Force Commander Northern Areas Major General Syed Imtiaz Gilani, other senior civil and military officials, and a large number of citizens. Earlier, upon his arrival at Gilgit Airport, President Zardari was warmly received by Governor Gilgit-Baltistan Syed Mehdi Shah and Chief Minister Gulbar Khan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}