{
  "title": "Musk creates new power base in Washington with takeover of agencies - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Elon Musk’s rapid takeover of two US government agencies has enabled the South African-born billionaire to exert unprecedented control over America’s 2.2-million-member federal workforce and begin a dramatic reshaping of government.\n\nThe world’s richest man and an ally of President Donald Trump, Musk, 53, has in two weeks created a new centre of power in Washington as he executes Trump’s cost-cutting initiative to reduce the size of the US government.\n\nThe CEO of Tesla and founder of SpaceX, Musk has acted swiftly since Trump’s Jan 20 inauguration, deploying teams of current and former employees of his companies as his agents. Musk’s actions have fostered a wave of panic among government workers and public protests in Washington and at times have threatened to overshadow Trump’s own agenda.\n\nMusk’s efforts are part of a massive government restructuring by Trump, who has fired and sidelined hundreds of civil servants in his first steps toward downsizing the bureaucracy and installing more loyalists.\n\nAmericans are witnessing “an extraordinary centralisation of power in someone who lacks a top-level security clearance and has not been subject to any Senate confirmation process,” said Don Moynihan, a professor at the Ford School of Public Policy at the University of Michigan. “Musk has unprecedented and centralised control of the basic plumbing of government,” he added.\n\nAsked who they are more worried about when it comes to the prospect of being fired, an employee of the General Services Administration that manages federal property and services said: “Musk. No one is really talking about Trump.” Trump has put Musk in charge of what both men call the Department of Government Efficiency.\n\nDespite its name, it is not a department, Musk does not draw a government salary, and DOGE’s creation immediately drew lawsuits from government unions, watchdogs and public interest groups. Exactly who makes up DOGE is unclear. The Trump administration has not released a list of DOGE employees. Nor has it said how they are being paid, how many have entered each agency, and whether they are government workers.\n\nThat raises questions about who they are answerable to — Musk or Trump as head of the executive branch. Musk and his DOGE lieutenants have taken over the Office of Personnel Management and the General Services Administration along with their computer systems. OPM is the human resources arm of the US government, overseeing 2.2 million government workers.\n\nFrom there, emails have been sent out in the past week offering federal employees financial incentives to quit. The GSA oversees most government contracts and manages federal property.\n\nAt least four current and former Musk aides are part of a team that has taken over OPM, shutting out some senior managers from their own computer systems, sources said.\n\nMichael Linden, a senior official during the administration of former President Joe Biden at the Office of Management and Budget, a powerful agency that oversees the federal budget, said the access by Musk’s aides to payment systems gives them extraordinary potential power.\n\n“They could get to pick and choose which payments the federal government makes,” Linden said in an interview.\n\nPublished in Dawn, February 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/061022486bf1b08.jpg",
  "retrievedAt": "2025-10-12T01:17:50.778Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890034/musk-creates-new-power-base-in-washington-with-takeover-of-agencies",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T02:28:38.000Z"
}
