{
  "title": "Bangladesh protesters torch home of country’s founding leader Sheikh Mujibur Rahman - World - DAWN.COM",
  "author": null,
  "content": "Thousands of protesters set fire to the home of Bangladesh’s founding leader, as his daughter, ousted former Prime Minister Sheikh Hasina delivered a fiery social media speech calling on her supporters to stand against the interim government.\n\nWitnesses said several thousand protesters, some armed with sticks, hammers, and other tools, gathered around the historic house and independence monument, while others brought a crane and excavator to demolish the building.\n\nThe rally was organised alongside a broader call, dubbed “Bulldozer Procession”, to disrupt Hasina’s scheduled 9pm online address on Wednesday.\n\nProtesters, many aligned with the “Students Against Discrimination” group, had expressed their fury over Hasina’s speech, which they viewed as a challenge to the newly formed interim government.\n\nTensions have been escalating in Bangladesh since August 2024, when mass protests forced Hasina to flee to neighbouring India.\n\nThe interim government, led by Nobel laureate Muhammad Yunus, has struggled to maintain control as protests and unrest have continued. Demonstrators have attacked symbols of Hasina’s government, including the house of Sheikh Mujibur Rahman, which was first set ablaze in August.\n\nA symbol of the country’s establishment, the house is where Bangabandhu (friend of Bengal), as he is popularly known, declared Bangladesh’s independence in 1971.\n\nA few years later, it became the site of a national tragedy. Mujibur Rahman and most of his family were assassinated at the house in 1975. Hasina, who survived the attack, later transformed the building into a museum dedicated to her father’s legacy.\n\n“They can demolish a building, but not the history. History takes its revenge,” Hasina said in her speech on Wednesday.\n\nShe urged the people of Bangladesh to stand against the interim government, accusing them of seizing power unconstitutionally.\n\nThe student-led movement behind the protests has voiced plans to dismantle the country’s 1972 Constitution, which they argue embodies the legacy of her father’s rule.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/061251147cedf7c.jpg",
  "retrievedAt": "2025-08-25T19:23:29.374Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890139/bangladesh-protesters-torch-home-of-countrys-founding-leader-sheikh-mujibur-rahman",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T08:00:18.000Z"
}
