{
  "title": "Trump’s proposal for Gaza takeover sparks global outrage - World - DAWN.COM",
  "author": null,
  "content": "• President wants to build a resort in the enclave\n• Palestinians in Gaza say ‘we are going nowhere’\n• Hamas official terms proposal ‘ridiculous and absurd’\n\nWASHINGTON: President Donald Trump’s proposal for the US to take over Gaza and create a “Riviera of the Middle East” after resettling Palestinians elsewhere has shattered US policy on the Israeli-Palestinian conflict, sparking widespread condemnation.\n\nThe shock move from Trump, a former New York property developer, drew rebukes on Wednesday from Russia, China, Britain, France and Germany, which said it would bring new suffering and new hatred. Saudi Arabia rejected the proposal outright.\n\nTrump provided no specifics as he announced his proposal while welcoming Israeli Prime Minister Benjamin Netanyahu to the White House on Tuesday.\n\nHe said he and his team had been discussing the possibility with Jordan, Egypt and other regional countries.\n\nNetanyahu would not be drawn into discussing the proposal, other than to praise Trump for trying a new approach.\n\nPresident Trump, in his first major Middle East policy announcement, said he envisioned building a resort where international communities could live in harmony after over 15 months of Israeli bombardment devastated the tiny coastal enclave and killed more than 47,000 people.\n\nIt was not clear whether Trump will go ahead with his controversial proposal or is simply taking an extreme position as a bargaining strategy. Trump said that he plans to visit Gaza, Israel and Saudi Arabia, but did not say when he will go.\n\nMichael Milshtein, a former intelligence officer and one of Israel’s leading specialists on Hamas, said the US president’s comments put Israel on a collision course with its Arab neighbours.\n\n“Maybe Trump is trying to promote pressure on the Arab states (so) they will not create any obstacles if he tries to promote a normalisation between Saudi Arabia and Israel,” he said.\n\nJordan’s King Abdullah said he rejected any attempts to annex land and displace Palestinians. Egypt said it would support Gaza recovery plans without Palestinians leaving the territory.\n\nIn Gaza, Palestinians living among the wreckage of their former homes said they would never accept the plan.\n\n“Trump can go to hell, with his ideas, with his money, and with his beliefs. We are going nowhere. We are not some of his assets,” said Samir Abu Basel in Gaza City.\n\nThe casual proposal sent diplomatic shockwaves across the Middle East and around the globe. World leaders said they continued to support the two-state solution that has formed the basis of Washington’s policy in the region for decades. The plan envisages that Gaza would be part of a future Palestinian state that includes the occupied West Bank.\n\nIn his first two weeks in office, Trump has talked about a US takeover of Greenland, warned of the possible seizure of the Panama Canal and declared that Canada should be the 51st US state.\n\nSome critics have said his expansionist rhetoric echoes old-style imperialism, suggesting it could encourage Russia in its war in Ukraine and give China justification for invading Taiwan.\n\nAn official from Hamas, which has ruled the Gaza Strip since 2007, said Trump’s proposal was “ridiculous and absurd”.\n\nPublished in Dawn, February 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/06091457d44ea8f.jpg",
  "retrievedAt": "2025-10-12T01:17:34.251Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890028/trumps-proposal-for-gaza-takeover-sparks-global-outrage",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T02:28:09.000Z"
}
