{
  "title": "On mandatory training, well-connected bureaucrats retain key positions in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Some politically well-connected bureaucrats in Punjab continue to hold their current positions despite being on a four-month National Management Course at the National School of Public Policy in breach of clear instructions that the provincial government is bound to relieve such officers “on their selection for training course without fail”.\n\nThe prime minister’s directive also says the provincial governments shall make stopgap arrangements, as the nominated officers are not required to attend their offices while undergoing training. Non-compliance of the directions of the Prime Minister can attract disciplinary proceedings under the Civil Servants (E&D) Rules, 2020.\n\nThe NMC, which started on Jan 13 and ends on May 16, is being attended by finance department secretary Mujahid Sherdil, secretary services (S&GAD) Shaukat Ali, forestry, wildlife and fisheries secretary Muddasir Waheed Malik, excise and taxation department secretary Masood Mukhtar and industries, commerce, investment and skills development secretary Ehsan Bhutta. Mr Bhutta, however, was transferred and posted as member P&D Board.\n\nWhile the government spends Rs2.2 million fee for each trainee for the course – which is mandatory for their promotion from BS-20 to BS-21 – the bureaucrats still manage their `lucrative’ postings to ensure that they should not surrender their perks and privileges.\n\nCS says officials are working on 200 initiatives\n\nThe Punjab government and the NSPP have also closed their eyes and violating prime minister’s directions as well as NSPP’s own instructions – notified in officers’ nomination notifications.\n\nSimilarly, Punjab health secretary Nadia Saqib, implementation and coordination (I&C) S&GAD secretary Rafaqat Ali and finance department (budget and resource) special secretary Syed Muhammad Masood Nouman are attending Senior Management Course (SMC) while holding their administrative posts.\n\nThe SMC is mandatory for the officers for their promotion from BS-19 to BS-20 and the government is paying a course fee of Rs350,000 each for their boarding and lodging at the National Institute of Management, Lahore.\n\nThe course, being run from Jan 27 to May 16, has notified similar conditions that the officer attending the SMC will be relieved and not required to attend their offices while undergoing training.\n\nSources in the bureaucracy say lobbying is playing a major role in facilitating these bureaucrats, which is generally visible in the posting of “favourite” bureaucrats against important positions, while others are sidelined.\n\nDawn tried to seek comments from NSPP Rector Dr Ijaz Munir but he did not respond.\n\nPunjab Chief Secretary Zahid Akhtar Zaman responded to the questions and said: “We do not want to change the secretaries because Punjab is working on some 200 initiatives. Should we block the massive work going on in Punjab?” he asked.\n\nWhen asked if their presence was required, they might have been retained and sent for courses in the upcoming opportunities, the chief secretary said the administrative secretaries, as required by the NSPP and PM directions, do not work as all powers had been handed over to special secretaries as a stopgap arrangement.\n\n“The secretaries, while on the course, have no responsibility. They have been retained so that they should come to the office and supervise whether the CM initiatives are progressing accordingly,” the chief secretary explained.\n\nMr Zaman said the government was not expecting any work from the administrative secretaries on course but wanted them to stay in the picture and continue upon their return.\n\nWhile several other bureaucrats are also attending the NMC and SMC, Mr Zaman said that no other bureaucrat had been retained.\n\nPublished in Dawn, February 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:17:49.916Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890098/on-mandatory-training-well-connected-bureaucrats-retain-key-positions-in-punjab",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T03:13:34.000Z"
}
