{
  "title": "Iran calls for unity against potential US oil sanctions - World - DAWN.COM",
  "author": null,
  "content": "DUBAI: Iran’s President Masoud Pezeshkian urged Opec members to unite against possible US sanctions on the major oil producer, after US President Donald Trump said he would seek to drive Tehran’s oil exports to zero.\n\nIranian crude oil exports currently stand at around 1.5 million barrels per day, with the majority going to China. The loss of such a volume, equal to about 1.4pc of total world supply, would be significant for markets.\n\nPezeshkian made the comments at a meeting with Opec Secretary General Haitham Al Ghais. Opec’s X account on Wednesday showed Al Ghais on a visit to Iran, which assumes the rotating Opec presidency this year.\n\n“I believe that if Opec members are united and work together, the US would not be able to sanction and pressure one of them,” Pezeshkian said at the meeting with Al Ghais, according to Iran’s state media.\n\nTrump on Tuesday restored his “maximum pressure” campaign on Iran, aimed at stopping Tehran from obtaining a nuclear weapon. Iran’s oil exports rose to the highest since 2018 during the term of President Joe Biden, despite US sanctions. Iran remains exempt from output curbs agreed to by Opec+ oil-producing nations.\n\nIranian oil minister Mohsen Paknejad told Al Ghais that imposing unilateral sanctions on crude producers would destabilise energy markets, the oil ministry’s SHANA news outlet reported earlier on Wednesday.\n\n“Depoliticising the oil market is a vital issue for energy security. Imposing unilateral sanctions against major oil producers and putting pressure on Opec will destabilise oil and energy markets as well as harm consumers around the world,” Paknejad said.\n\nSimilar policies during Trump’s first term led to a sharp drop in Iranian oil exports to as little as 200,000 bpd in some months of 2020. In 2018, Opec and allies agreed to boost supply after Trump urged producers to offset losses caused by the sanctions on Iran.\n\nPublished in Dawn, February 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:23:38.391Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890077/iran-calls-for-unity-against-potential-us-oil-sanctions",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T02:53:46.000Z"
}
