{
  "title": "Breathe Pakistan: Experts call for urgent adaptation funding to address climate threat - Pakistan - DAWN.COM",
  "author": null,
  "content": "A global climate conference under DawnMedia’s ‘Breathe Pakistan’ initiative on Thursday brought together experts and leaders to find solutions to climate change with them calling for urgent funding to power adaptation initiatives to respond to threats posed by changing environmental and climatic conditions.\n\nDay one of the moot began at 10am and concluded past 6pm at Islamabad’s Jinnah Convention Centre after a marathon session of discussions, keynote addresses, and speeches by various experts and dignitaries elaborating on issues, challenges, opportunities and solutions related to climate change and pollution.\n\nExperts and policymakers shed light on the need for stronger policies, technological innovations and collaborative efforts to tackle the challenges while stressing the role of urban planning, renewable energy and public awareness in dealing with environmental issues.\n\nThe two-day moot aims to make Pakistan climate-resilient by 2047 while fostering regional cooperation across South Asia, where countries face shared challenges of rising temperatures, water scarcity and increasing natural disasters.\n\n6:23pm — Himal Southasian founder closes today’s final session\n\nConcluding today’s discussion, Dixit said, “Let me compliment the audience because this audience is nothing if not steadfast.\n\n“You stayed on all these hours mainly because you understand the gravity of the issue.”\n\n6:21pm — Indrika Ratwatte, UN Resident Coordinator Afghanistan\n\nThe UN official talked about securing localised energy and alternative options at a community level, saying that while developing countries had the potential, they needed to scale up such solutions.\n\nHe also stressed the need to build trust and create awareness and lauded the organisers for holding today’s moot.\n\n“This is one of the first opportunities bringing us all together to have this conversion as South Asia and take it to the next level.”\n\n6:10pm — Rakshya R Thapa, South Asia Climate Change and Energy Adviser & Carbon Finance Specialist, Unicef\n\nThe Unicef official began by sharing good news related to the latest data on renewable energy. She said that renewable energy grew by a record 36 per cent in terms of capacity and generation in 2023,\n\n“While it may sound like a small number, it’s a record made after almost a decade. Similarly, renewable energy jobs concurrently increased by almost 8 to 10pc. And for people who have been without reliable sources or access to energy, the number of those people has marginally declined.\n\n“We haven’t done a great job when it comes to meeting SGD 7, which is environmental conservation, but we are progressively getting there, hopefully.\n\n“Another good news is that Asia, overall, is leading when it comes to energy generation globally. So, I think this is something for us to celebrate during these dull times. In South Asia, we are not doing very badly, as 20pc of our total energy generation comes from renewable sources.”\n\nShe pointed out that challenges still persisted as 70-80pc of energy generation was still fossil fuel-based, saying that it was a “significant number”.\n\n5:57pm — Harjeet Singh, Global Engagement Director for Fossil Fuel Non-Proliferation Treaty Initiative\n\nIn response to Dr Suleri, panellist Harjeet Singh, the global engagement director for Fossil Fuel Non-Proliferation Treaty Initiative, said, “Our thinking over the last few years has evolved. And it’s not the environment versus development anymore. At least at the conceptual level, we have resolved that. On the ground, however, there are still many challenges, and that is where we need to be really moving forward from that narrative to implementation. And that’s why we also moved from MDGs to SDGs (sustainable development goals), where the focus is on sustainability.”\n\nHe said that no development activity could be sustainable if it was done at the cost of the environment and degradation of nature.\n\n5:53pm — Dr Abid Qaiyum Suleri, Executive Director, SDPI, session moderator\n\nDiscussing the decarbonisation of economies and the impact of fossil fuel use on climate change, Sustainable Development Policy Institute Executive Director Abid Qaiyum Suleri said, “Many developed nations, including the United States, are shying away from decarbonisation.”\n\nHe then asked the panellists how countries should navigate the challenge of balancing two conflicting Millennium Development Goals (MDGs): economic prosperity (Goal 1) and environmental conservation (Goal 7).\n\n5:51pm — Panel begins on fossil fuels and balancing development with carbon reduction\n\n5:48pm — Sunita Narain, Director General, Centre for Science and Environment India\n\nThe non-profit’s director general proposed the need for localised solutions to tackle air pollution.\n\n“The air pollution problem in our cities will grow until we find local solutions to traffic, congestion, the use of coal-burning in factories and garbage that is burnt because we are not segregating the wet from the dry,” she said.\n\nNarain further added: “Please let us recognise that this is our challenge and also our opportunity to do things differently, to build an urban future which is resilient because the solutions we have chosen are affordable and inclusive and because of that, they are sustainable.”\n\n5:32pm — UN resident coordinator stresses need for regional air-quality framework\n\nEchoing Marriyum’s concerns, Special Representative for Afghanistan Indrika Ratwatte also talked about the need for transboundary-level solutions to tackle air pollution.\n\nHe emphasised the need to establish a regional air-quality framework, carry out cross-border monitoring and data-sharing, harmonise air-quality standards, coordinate policy action and emission control measures and incentivise alternatives.\n\n“[We also have to look at] the role of international institutions […] and financial and technical assistance going hand in hand with multinational banks and IFI.”\n\n5:20pm — WHO official warns about climate change’s risk to life\n\nEllen Mpangananji Thom, WHO’s deputy representative in Pakistan, is currently speaking about the impacts of air pollution on health.\n\n“WHO estimates that between 2030 and 2050, climate change will cause an additional 250,000 a year worldwide due to malnutrition, malaria, diarrhoea and heat stress alone.”\n\nShe said that air pollution was not an issue that should be isolated from conversations on climate change.\n\n5:05pm — Panel on air pollution faced by South Asia begins\n\nThe symposium’s second panel discussion, titled ‘South Asian air pollution: A threat to public health’, is now underway.\n\nPunjab senior minister Marriyum Aurangzeb is addressing the conference via a video link as part of the discussion, highlighting the smog crisis faced by her province recently.\n\n“Of course, it’s a regional issue and a national issue, so Lahore is not the only city affected by smog and bad air quality, but other parts of the country [are also affected], as well as the region. So whatever happens in India, it transcends borders,” she said, referring to the issue’s transboundary nature.\n\n4:47pm — Short break\n\n4:42pm — Aisha Khan stresses need to ‘do more with less water’\n\n4:37pm — Indian engineer tells about his glacier-creating project\n\nSonam Wangchuk has spoken about his Ice Stupa project, which since since 2019 has scaled to 52 functioning artificial glaciers in Ladakh and 14 more across the world, according to Council on Energy, Environment and Water.\n\n4:29pm — Climate expert Aisha Khan says mountains are ‘sacred places’\n\nAisha Khan, chief executive of the Civil Society Coalition for Climate Change, terms mountains “sacred places”.\n\n“This is the year of glacial preservation. So, I begin by saying that mountains are marvels of nature. They are sacred places and home to mountain communities. We have tourists who flock to these places; they go there for adventure sports and recreation, perhaps sometimes for spiritual healing as well, but they leave the place degraded. They don’t understand that mountain communities rely on these ecosystems for their ecological goods and services to survive.\n\n“So, it is very important to understand that when we enter a sacred domain — and mountains are sacred domains to me. For us in South Asia, it’s very, very important to remember that these mountains are a source of water for us.\n\nWhen we talk about the Himalayas, the Karakoram, and the Hindukush, they directly supply water to 240 million people and indirectly to 1.8 billion people who rely on these water supplies. So, if we do not take an integrated approach to their management, we will not be able to retain the flows that we are getting.“\n\n4:22pm — Indian engineer Wangchuk speaks on artificial glaciers\n\nSonam Wangchuk, an Indian engineer who received the Ramon Magsaysay Award in 2018, has detailed how the challenge of melting glaciers could be tackled.\n\n“I think water towers is a very apt term. I think the best way to deal with the water is to stop it at the height where it is. Height is a great resource — more than oil, I would say. Mountains are what give height to water in frozen form, in the form of permafrost or flowing water,” he said.\n\nHe said glacial flows from the mountains should be frozen when water flows in cold mountains so that they can be used when in spring and summer when farmers need it.\n\n“In other words, creating artificial glaciers. That is what we do in Ladakh. You can refreeze the glacial lakes, which serve as ticking time bombs, using various technologies and we are working on them. You siphon them out and refreeze them. So, freeze, freeze, and freeze should be the strategy to keep it at the height where it should be.”\n\n4:18pm — Romina Alam calls for ‘more regional solutions’\n\nRomina Khurshid Alam, PM’s coordinator on Climate Change, said: “When we talk about the glaciers, when we talk about Pakistan, and when we talk about the region, what I have learned is […] the greatest need is to first come up with global solutions, but more regional solutions.”\n\n“In Pakistan, we have a total of 13,032 glaciers across the country — the largest number outside the polar region. […] So, of course, when we talk about the rapid melting of [the glaciers] due to the rising temperatures and how it poses risks of glacial lake outburst floods, affecting millions of people.\n\nAlam also highlighted the “missing component” of collaboration, saying that developing countries need to sit together and come up with solutions.\n\n“Because until and unless we are not going to do that, there are lots of challenges which are going to continue.”\n\n4:16pm — PM’s aide Romina Alam calls for global media moot on climate\n\nSpeaking on the mike is now Romina Khurshid Alam, the premier’s climate change coordinator.\n\nShe underscored that it was a great need of the time that an international climate caucus of the media be held.\n\n“Without that, things won’t get resolved. […] There are so many things which are being said but they are not being known to the people.”\n\n4:12pm — UN Afghanistan coordinator says climate impacts ‘turbo-charged’ glacial melt\n\nIndrika Ratwatte, UN’s resident coordinator in Afghanistan, has noted the framing of glacial melting as a “cross-cutting transboundary challenge”.\n\n“Impacts of climate change have really turbo-charged glacial melt. As you have seen, temperatures have accelerated, and today, we are looking at a retreating average of 5.3 metres per year,” Wangchuk said.\n\nHe noted that over the last four decades, about 15pc of glacial ice has been lost: “That’s an incredible amount of glacial degradation. And this rapid glacial melting had one immediate knock-on effect — […out of] 3,000 glacial lakes, 33 have been considered to be classified as highly hazardous.\n\n“So the water is melting and collecting, lakes are forming, and the impacts are posing serious threats [in the form of] glacial lakes outburst floods.”\n\n4:10pm — Dixit opens session’s first panel discussion\n\nBeginning the panel discussion, Himal editor Kanak Mani Dixit suggested to UNEP’s Tsering to establish a “Himalaya Kindu-Kush Council” to highlight the melting glaciers there.\n\n3:53pm — UNEP Asia Pacific official delivers keynote address\n\nDechen Tsering, director of United Nations Environment Programme’s (UNEP) climate change division as well as head of its Asia Pacific regional office, is now delivering the session’s keynote address.\n\nSpeaking about the impact of climate change, specifically concerning glacial lakes, decarbonisation, and air pollution, Tsering said: “If you start looking at the three crises — what they call the triple planetary crisis — it relates to the impact [of climate change] on water.\n\n“The glacial melt has increased from 1998 to 2000, and it will further increase till 2050. It has far-reaching impacts on agriculture, such as food security, as the livelihoods of millions that depend on farming. We see economic strain, and again, the damage to infrastructure.\n\nReferring to the 2022 superfloods faced by Pakistan, Tsering said: “We have seen what we call ‘monsoon on steroids’, [leading] to devasting impacts — including health impacts like water-borne diseases, compromising water and sanitation, public health challenges, and of course energy security.”\n\n3:41pm — Himal Southasian founder speaks onreporting climate change stories\n\nKanak Mani Dixit, the founder and editor of Himal Nepal, is addressing the day’s sixth and last session as its chairperson.\n\n“When we speak of climate change, we had the code words: we had global warming, then we got climate change, then we started saying climate crisis, and then we started saying climate emergency.\n\n“But that’s certainly not enough.”\n\nDixit said that even using the term Glacial lake outburst floods (Glofs) was now “not enough because in the high Himalayas, from the Karakoram-Hindu Kush all the way to Namcha Barwa in the eastern-most tip of the Himalaya, you have permafrost melting”.\n\n“The frozen stones, boulders, dust, and detritus are loosening up,” the journalist highlighted.\n\nRecalling heavy rainfall and landslides in northern India’s Sikkim last year and 2021 flooding in Nepal’s Melamchi River, he said ahead lay an “incredible crisis for which we already have the indicators in front of us”.\n\n3:35pm — ‘South Asian symposium on climate change’ begins\n\nThe last session of the day, titled ‘South Asian symposium on climate change’ has begun.\n\nThe session comprises three panel discussions, with notable climate activists and journalists from across South Asia participating in them.\n\nThe first panel, titled ‘Glacial Melt: A sustainable strategy for the water towers of South Asia’, will be moderated by Indrika Ratwatte, UN’s resident coordinator for Afghanistan.\n\nThe following are the speakers:\n\n3:11pm — World Bank’s Hickey says communication ‘original sin’ of climate community\n\nValerie Hickey, World Bank’s global director for climate change, is now talking about discussing climate change in terms that people can easily understand.\n\n“Why don’t we just talk about the weather?” she said, noting that how climate challenges are discussed with experts in public and private sectors was very different from how they are talked about with farming family.\n\n“Too often in the climate change community, we say the same thing to both the audiences and neither audience understands what we are talking about. So communication is really the original sin of the climate community,” she said.\n\nWATCH: Harjeet Singh stresses need to move away from fossil fuels\n\nHarjeet Singh, the global engagement director for Fossil Fuel Non-Proliferation Treaty Initiative, has highlighted the need for South Asia to move away from fossil fuels.\n\nIn an interview with DawnNews English, Singh said South Asia has “one-fifth of the world’s population and a “huge dependence on fossil fuels for energy, job, and even debts servicing”.\n\n“That reality shapes where we are and what kind of support we need to take a step which helps us move away from fossil fuels, adopt cleaner energy, but also ensure energy access.”\n\nWhile he pointed out that it cannot be done “at a time when the whole region is struggling to provide adequate amount of energy to its people”, Singh also underscored the need to do so, citing the air pollution crisis faced by South Asia.\n\n“We also know that burning of those fossil fuels causes problems like air pollution and lots of climate disasters like floods, cyclones, and wildfires, so we have to move away from fossil fuels.”\n\nWatch the full interview here:\n\n3:01pm — Lums professor Ijaz Nabi speaks as 5th session begins\n\nIjaz Nabi, an economics professor at the Lahore University of Management Sciences (Lums), is now speaking at the session ‘Climate mainstreaming and increasing the adaptive capacities of countries vulnerable to climate change’.\n\n2:52pm — Rehman speaks about Pakistan’s ‘water and food security nexus’\n\nSherry Rehman termed Pakistan’s “water and food security nexus” as the most important resilience-building problem.\n\n“Pakistan needs to change its relationship with water,” Rehman emphasised, noting that “all of Pakistan’s cities are clustered around the Indus River”. “And all of them dump toxic affluent into that river.\n\n“We are, I think, managing only 1pc of our solid waste water,” the senator said, urging media publications to “start putting [such stories] on page 2 at least”.\n\n2:39pm — ‘Climate denialism is coming back’\n\nRehman, the former climate change minister, also warned that “denialism” of climate change issues was coming back.\n\n“In Pakistan, in many countries, climate denialism is coming back — to define our responses — and that means we have an epistemic arrogance that it’s not going to happen to us.\n\n“It won’t happen again maybe then because we’re not really responsible. […] Who is going to take responsibility?”\n\nRehman then pointed out three “broad issues looming in front of Pakistan”, including looking at climate as an external problem.\n\n2:35pm — Sherry Rehman says climate change knows no borders\n\nRehman then highlighted that climate change knew no borders: Climate change, like it or not, goes from global to local. It knows no borders.“\n\nThe former climate change minister recalled that following the 2022 monsoon floods, she had warned the same.\n\nMentioning the recent wildfires in Los Angeles, which got widespread attention in international media, she said: “But you have not heard much about a similar fire that went on in Balochistan two years ago. That’s because the media wasn’t interested.”\n\nNoted that the fires burned down thousands of acres of pine cone forests, Rehman said: “The challenge is very very quantum […] meaning it is everywhere, at all places at the same time.”\n\n2:32pm — Sherry Rehman talks about Pakistan’s climate future\n\nSenator Sherry Rehman is now making her keynote address at the session, where she is speaking about Pakistan’s vision for 2047.\n\nHighlighting the importance of the conference, she said: “If legacy media tries to make climate and environmental issues a central part of the conversation, we’re halfway there.”\n\nQuoting Power Minister Awais Leghari, Rehman said: “Pakistan’s energy mix is now 55 per cent renewable. […] It’s a big statement to make. I can sort of break that down and disaggregate it but I think the media needs to ask inconvenient questions from all of us.”\n\nRecalling discussions from the World Economic Forum, she wondered why there was a “resistance” to countering climate change.\n\n2:28pm — Lums VC Cheema speaks on temperature rises in Pakistan\n\nLums Vice Chancellor Ali Cheema is now speaking about the temperature rises faced by Pakistan over the past decades.\n\n“By 2050, […] we would expect for there to be an addition of about a month where temperatures would exceed 37°C,” he noted, citing the data displayed.\n\nHe reiterated that early industrialisers did not face such a challenge and added that there were two more challenges which he said were related to public health and agriculture.\n\n2:18pm — Lums VC notes early industrialists didn’t face climate challenge\n\nAli Cheema, vice chancellor at Lums, is now chairing a session titled ‘Commemorating the 100th anniversary of Pakistan in 2047: a vision for climate resilience & climate justice’.\n\nWith graphs and statistics displayed on a screen behind him, Cheema is speaking about the historical evolution of the climate crisis. He noted that a graph showed the proportion of the global population living in poverty, adding that after the Industrial Revolution, the proportion started to decline.\n\nDescribing another graph, which plotted carbon dioxide emissions against average temperature rises, Cheema stated: “As early industrialisers started to grow, they were not confronted with a human-made global climate crisis.\n\n“So they could push on industrialisation and grow without having a climate challenge.”\n\n1:28pm: Lunch Break\n\n1:14pm: World Bank climate change head takes the podium\n\nValerie Hickey, the global director for climate change at the World Bank, is now speaking as the session ‘Pakistan’s critical need for climate finance’ continues.\n\nHickey appreciated the speakers’ insights as “brilliant inputs”, before speaking about the issue of climate funding.\n\n“We’re talking about money — whether it’s domestic or public budget, private finance, or international public finance. The truth is, there is not enough of it.”\n\nShe continued, “Even with climate finance, we have not optimised it. Seventy per cent of climate finance goes towards mitigation, but we heard today that mitigation isn’t really the issue […]. The issue is adaptation.\n\n“Out of all the climate finance, less than 20pc goes to the Global South, where the impacts of climate change are real,” she added.\n\n12:53pm: Former SBP governor Raza highlights importance of emission ceilings\n\nEx-SBP governor Raza spoke about how emissions ceilings have led to many companies searching for ways to cut emissions.\n\n“And if they’re over it, they have to pay a penalty, or they go and buy credit from someone who is under the gap — and that’s the carbon trading market.\n\n“That compliance trading market today is about worth $800bn. That is all private activity. This is the compliance market.”\n\nRaza further said there was a “voluntary trading market, which is not a regulated market, but it is for people who seek to buy carbon credits to offset their excess when they go outside their own countries”.\n\n“There’s a large part of the world covered by these requirements: all of the EU, Canada, China, Japan, New Zealand, and parts of America — California, 11 northeastern American states — all have this system of caps and trading.”\n\n12:51pm: Ex-SBP governor Salim Raza addresses the event\n\nEx-SBP governor Salim Raza is currently speaking on the theme of climate finance.\n\n“I want to point out one sole reality: which is the expectation that private finance — private finance, not public finance — is going to pull the cart. But they aren’t.”\n\nHe then showed on screen an estimate for how much private finance has to increase in the next five years compared to what it is today. “It is 15-18 times in external finance and five to seven times in money raised domestically.”\n\nWATCH: Shamshad Akhtar highlights Pakistan’s climate investment needs\n\n12:38pm: Ex-SBP governor Shamshad Akhtar says climate change ‘lethal threat’\n\nShamshad Akhtar, the former governor of the State Bank of Pakistan, spoke on climate finance, expressing that she was passionate about the topic.\n\n“I think unless we address this very lethal threat that faces the global community and the global landscape, we are not going to get anywhere, and we will face economic disruption.”\n\n12:35pm — Aurangzeb highlights funding for climate initiatives\n\nThe finance minister also spoke about the green climate funds, praising Acumen’s $90m initiative. “My only discussion with respect to green climate funds is that it just takes a long time.”\n\nHe added: “We have a bureaucracy here in Islamabad. But I do think the bureaucracy in Manila should think through it because we need to fast-track a few things. My humble request is that they should look at their accreditation process even before we come to the pledges and disbursements.”\n\nThe finance minister then walked the participants through other climate initiatives. On multilateral lenders, Aurangzeb said he met World Bank President Ajay Banga and talked about many things where they needed the Bank’s support.\n\nHe said: “We’re very grateful to the Asian Development Bank […] they announced $500m and climate is a big part of that theme. The second one is what was announced in January […] the 10-year country partnership framework with the World Bank group.”\n\n12:30pm: Finance minister says adaptation greater issue than mitigation\n\nAurangzeb: “While we need to deal with mitigation, the real issue — and bigger issue — is adaptation.\n\nOn climate financing, Aurangzeb said it was “good to see some level of operationalisation coming through in COP29 with about $720m in the Loss and Damage at least being pledged”.\n\n“Then the Baku finance goal itself, after long deliberations, about $300bn of annual outlays.\n\n“But of course, as you all know, the requirement was three to four times higher than this commitment,” he added, highlighting the low funds pledged at the COP29 in Baku last year.\n\n12:23pm: Minister Aurangzeb says tackling climate change about ‘how and who’\n\nFinance Minister Muhammad Aurangzeb has taken the stage now to detail Pakistan’s climate change issues as a session titled ‘Pakistan’s critical need for climate finance’ begins.\n\n“In terms of the sustainability of Pakistan, and our overall economic situation in the country, it will ultimately depend upon two existential issues and how we deal with those.\n\n“One is population control and population management. Unfortunately, we’re still growing at a rate of 2.5pc,” the minister noted.\n\nOn the issue of climate change, he said: “We’ve known the what and why. There’s no dearth of policy prescriptions. It’s ultimately about the how and who.”\n\nWATCH: Information Attaullah Tarar says Pakistan among worst-affected\n\n12:20pm — Break\n\n12:13pm — Justice Shah says some term lack of support from North ‘climate apartheid’\n\nDuring his speech, Justice Shah also called on the Global North to support the vulnerable countries in the Global South “not as charity but as a legal and moral obligation”.\n\nHe added, “The gap between developing and developed nations will grow, leading to what some people term ‘climate apartheid’, where wealthy nations protect themselves from climate impacts while poorer countries are left to bear the brunt.”\n\n12:00pm — Justice Shah says climate finance ‘critical’ to climate justice\n\nJustice Mansoor Ali Shah stated: “Climate justice today, how the judiciary feels, is [about] climate finance. Without adequate funding, adaptation remains an aspiration rather than a reality.\n\n“The most vulnerable country to bear the brunt of climate disaster, we soon realised after the devastating 2022 floods that the only way forward is through climate finance.”\n\n“Delay in financing is not just a policy failure, it is a denial of justice.”\n\nCalling climate financing a human rights issue for Global South, he said, “The ability to adapt, recover and rebuild in the face of climate disaster is not a privilege.”\n\nHe added: “The right to life and dignity in our constitutions and international frameworks must now include the right to climate finance. Without it, our people are left defenceless against a crisis they did not create.”\n\n11:50am — ‘Climate justice a multi-sectorial issue’\n\nJustice Mansoor Ali Shah pointed out that while the Global North focused on mitigation, which was emission control, the Global South had a “very broad canvas”.\n\n“This transformation makes climate justice a multi-sectorial issue for the Global South.\n\n“The ambit of climate justice […] now includes water security, agriculture, food security, disaster risk reduction, health, urban planning, infrastructure, ecosystems and diversity, energy, finance and climate. The scope totally changes.”\n\n11:47am — Justice Shah lists 9 ‘pillars’ for climate justice\n\nThe SC’s senior puisne judge further said: “We must realise that Global South faces dual injustice — first the disproportionate burden of climate impacts, and second, the structural barriers that limit their ability to respond effectively.”\n\nHe went on to list “nine pillars on how to structure climate justice” — the first being a “strong focus on adaptation and loss and damage”. “Mitigation is not our immediate issue.”\n\n“Second, a robust, active and well-informed judiciary, and I hasten to add: an independent one also, which is fast-eroding here,” Justice Shah said.\n\nOther points he mentioned included ensuring that climate finance was readily available, nature finance, climate science to ensure policies are evidence-based, and climate diplomacy to forge alliances.\n\nThe seventh “pillar” he highlighted, pertained to investing in home-grown solutions rather than waiting for external help, while the eighth and ninth were climate accountability and climate courts, respectively.\n\n11:43am — Justice Mansoor Ali Shah says heatwaves making some Sindh regions unliveable\n\nJustice Mansoor Ali Shah says: “Extreme heatwaves and droughts, rising temperatures such as 50°C plus heatwaves in Jacobabad are making some regions unliveable.”\n\nHe highlighted that “agriculture employing almost 40pc of the workforce was suffering from erratic monsoons, leading to food insecurity, displacement and economic instability”.\n\n11:41am — Justice Mansoor Ali Shah says melting glaciers put Pakistan at risk of water scarcity\n\nAddressing the event, Supreme Court senior puisne judge Justice Mansoor Ali Shah highlighted that the Hindu Kush Himalaya glaciers, which Pakistan relied upon, were melting at “alarming rates”.\n\n“This threatens the Indus River system, the lifeline of Pakistan’s agriculture, pushing the country to severe water scarcity.”\n\nThe judge said: Climate change is no longer a distant threat — this needs to be understood — it is a present and escalating crisis, particularly for countries in the Global South, and my emphasis is going to be on the Global South today.\n\nHe said the Global South, including Pakistan, contributed the least to the global emissions but bore the brunt of it.\n\n“Pakistan is a frontline state of climate catastrophe and is ranked among the top five most vulnerable countries experience extreme weather events.”\n\nJustice Shah said: “I don’t need to go into examples, but floods and disasters […] in 2022, floods submerged one-third of the country, displacing 33m people and causing $30bn in damages […] exposing the urgent need for climate adaptation and finance.”\n\n11:39am — UNDP Pakistan representative\n\nSpeaking at the event, UNDP Pakistan representative Samuel Rizk said “no amount of alarm, or advocacy is too much” to counter climate change.\n\n“It is no longer someone else’s business happening on the other side of the world; it is not something for tomorrow; it is something for now — something for all of us. It is everyone’s business.”\n\nHe appreciated the government’s efforts for “tackling climate change head-on”.\n\n“Pakistan’s voice on global climate diplomacy is clear,” Rizk said.\n\n“Beyond science, policy or activity, there is little doubt that climate justice and climate insecurity can be the new fault line. At the very least, it can be a new place of global convergence of the discourse.\n\n“To contextualise the discussion, the critical role of legal and institutional mechanisms in shaping climate justice cannot be overstated.”\n\n11:35am — KP CM says ex-premier Imran “championed” climate change\n\n“Our leader Imran Khan has championed climate change, nationally and internationally. Since 2017 until now, we have spent more than Rs675m in Khyber Pakhtunkhwa to improve and increase our forest area.\n\n“The international standard is 25pc but [Khyber] Pakhtunkhwa is now 26pc. It means we have achieved the international standards and are above it.”\n\n11:27am: KP CM Gandapur takes the podium\n\nKhyber Pakhtunkhwa Chief Minister Ali Amin Gandapur has taken the podium to address the event.\n\n“You must have heard about Khyber Pakhtunkhwa regarding terrorism […] but today, I am here to portray the contribution our province and our people are [making towards] the country,” CM Gandapur said.\n\nHe noted that 37pc of KP’s land comprised forest area, making up 40-45pc of the forest cover of Pakistan. He highlighted, “As a carbon sink, were are removing 50pc of the carbon of Pakistan.”\n\n“According to the UNDP and World Bank research, for this much forest area, we need at least Rs332bn per year. I am not able to invest this much money but at least my province and my people are able to perform a job that requires this big an amount.”\n\nWATCH: Interview with UN’s Mohamed Yahya\n\nUN Resident and Humanitarian Coordinator Mohamed Yahya is giving an exclusive interview to DawnNews English.\n\n“Not only are you not meeting the goals but are constantly being pushed back because of the climate change issues,” he said.\n\n“The mitigation part is important but the adaption is the biggest thing essentially,” he emphasised.\n\nWatch the full interview here:\n\n11:01am — 15-minute break\n\n10:48am: World Bank climate change head speaks\n\nValerie Hickey, the global director for climate change at the World Bank, has begun addressing the event.\n\n“There will be too many people who die if we wait for the Global North to put on the table all of the money that they morally probably should,” Hickey says.\n\nReferring to conversations under the Paris Agreement under the New Collective Quantified Goal, she said, “We’re great at coming up with acronyms on climate change — the NCQG.”\n\n“To move from $100bn to $300bn, it sounds like a lot of money. It’s not. Most of it is in lending. It’s not in grants. Most of it is already there. It’s not addition.”\n\n“I propose we change the name of this conference from Breathe Pakistan to Lead Pakistan,” says Hickey.\n\n10:40am — Yahya addresses the event\n\nMohamed Yahya, UN Resident and Humanitarian Coordinator, is now addressing the event.\n\n“Climate change is no longer a distant threat. It is happening now. […]\n\nQuoting UN chief Antonio Guterres, he said: “We are on the highway to the climate hell with our feet still on the accelerator.”\n\nNoting that global emissions were still on the rise, he highlighted how extreme weather events such as droughts, wildfires, and floods were becoming “more frequent, intense and more devastating”.\n\nRecalling the 2022 monsoon floods which submerged one-third of the country under water, Yahya asserted: “A disaster of this magnitude should have been a wake-up call for the world, yet the emissions continue to rise.”\n\n“We must demand climate finance that is predictable, accessible, adequate and fair. The era also of corporate and national impunity must come to an end. Our secretary-general has called on polluters to do more to be part of the solution.”\n\n10:31am — Ahsan Iqbal says climate change ‘lived reality’\n\nPlanning Minister Ahsan Iqbal tells the conference that climate change is not some distant challenge but a lived reality.\n\nReferring to the Breathe Pakistan conference, Iqbal said it was not just a discussion [but] a call to action.\n\n“We must move from awareness to impact, policy to execution and from independent efforts to collective responsibility,” the minister stressed.\n\nPointing out that the Global South contributed to less than 1pc to climate change but was still comprised of the most affected nations.\n\n“We have endured catastrophic floods, rapid glacial melts, scorching heat waves and crippling droughts — all intensifying in frequency and severity.”\n\n“As the renowned environmentalist Wendell Berry once said: ‘The earth is what we all have in common’ and yet this common home is under siege. Not just in Pakistan but across the world.’”\n\nHe continued: “Another stark reminder of our environmental crisis was smog, which has become a recurring national emergency. Smog is not just a national issue it is also a cross-border challenge as air pollution knows no borders.”\n\n10:26am — Hameed Haroon addresses the conference\n\nHameed Haroon, the CEO of the Dawn Media Group, is addressing the conference, alongside Nazafreen Saigol Lakhani, the CEO of Pakistan Herald Publications Private Limited (PHPL).\n\n“The amplification [of Breathe Pakistan] becomes important when you come here because your views and interaction with Pakistani policymakers and NGOs is what will determine the mix of opinions that this country will talk about,” Haroon stressed.\n\n“Climate change is not just an event. As Nazafreen’s idea […], it’s a belief, it’s an ideology and we hope to work with you in the next few years to make partial, if not highly achieved resilience through a very sharp system of climate mainstreaming, a reality.”\n\n10:18am — Conference kicks off\n\nThe conference has begun, with the national anthem being played, followed by the recitation of the Holy Quran.\n\n10:15am — Planning, information ministers arrive\n\nPlanning Minister Ahsan Iqbal and Information Minister Attaullah Tarar have also reached the centre to attend the conference.\n\n9:40 — Guests arrive at the venue\n\nGuests have started to arrive at the Jinnah Convention Centre as the conference is set to begin.\n\nHarjeet Singh, global engagement director for Fossil Fuel Non-Proliferation Treaty Initiative, has also arrived at the venue. He will be part of the third panel of The South Asian Symposium on Climate Change, which is scheduled from 3:30pm-6pm.\n\nThe conference will have a roundtable to inspire dialogue between the government and the corporate sector and explore sustainable public-private partnerships, which will be attended by Deputy Prime Minister Ishaq Dar and Planning Minister Ahsan Iqbal, among others.\n\nA session on agriculture, forestry, and food systems in climate change will be attended by agriculture and forestry experts at which Food and Agriculture Organisation (FAO) Representative Florence Rolle, Climate Change Ministry Secretary Aisha Humera Chaudhry, and former climate change minister Malik Amin Aslam will speak.\n\nIn the concluding session of the conference tomorrow (February 7), former prime minister and Senate Chairman Yousaf Raza Gilani will address the audience.\n\nOther speakers include climate expert Ali Tauqeer Sheikh, British High Commissioner Jane Marriott, Petroleum Minister Senator Musadik Malik, climate activist Karishma Ali, and youth activist Zunaira Qayyum Baloch, among others.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/0619334263fa10e.jpg",
  "retrievedAt": "2025-08-25T19:23:37.979Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890122/breathe-pakistan-experts-call-for-urgent-adaptation-funding-to-address-climate-threat",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T04:51:25.000Z"
}
