{
  "title": "Midnight attack on Bannu police station foiled - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: The police on Wednesday claimed to have repulsed a midnight terror attack on a police station in the Township area of Bannu district.\n\nAn official said that a group of militants attacked the police station at around 12.30am with light and heavy weapons. “The attack was multi-pronged aiming to take over the building of the police station,” said the official, adding that the cops deployed there retaliated effectively and forced the assailants to flee the place.\n\nThe official said that an effective response by the law enforcers foiled the militants’ bid to breach the police station. He said that all policemen remained safe in the attack.\n\nDistrict police officer Ziauddin Ahmed visited the police station, met cops and praised them for exhibiting bravery.\n\nHe announced commendation certificates and cash prizes for them from IGP Zulfiqar Hameed.\n\nMeanwhile, police swung into action when armed men attacked the cops escorting a polio vaccination team in remote Surki Lawaghar area of Karak district.\n\nA police official confirmed the attack and said that both the cops and vaccinators remained unhurt. He said that unknown armed assailants opened fire on the cops, who were on an escort duty with vaccinators in the remote and difficult mountainous region.\n\nThe official said a heavy police contingent led by district police officer Shahbaz Elahi along with SP investigations Mohammad Ashfaq Khan immediately reached there, surrounded the area and launched a search for the attackers.\n\nHe quoted the district police chief as saying that the miscreants targeting policemen performing security duty with polio teams would be dealt with sternly. He said the DPO asked the cops to remain alert and vigilant on duty and provide complete security to vaccinators engaged in performing the national obligation of immunising children against the crippling disease.\n\nPublished in Dawn, February 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:17:34.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1889977/midnight-attack-on-bannu-police-station-foiled",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T02:29:26.000Z"
}
