{
  "title": "Year begins with warmest January despite shift towards cooling La Nina - World - DAWN.COM",
  "author": null,
  "content": "Last month was the world’s warmest January on record, continuing a streak of extreme global temperatures despite a shift towards the cooling La Nina weather pattern, European Union scientists said on Thursday.\n\nJanuary extended a run of extraordinary heat, in which 18 of the last 19 months saw an average global temperature of more than 1.5 degrees Celsius above pre-industrial times, the EU’s Copernicus Climate Change Service (C3S) said in a monthly bulletin.\n\nThat was despite the world shifting from the El Nino warming pattern — which helped make 2024 the world’s warmest year on record — and turning towards its cooler La Nia counterpart, which involves the cooling of equatorial Pacific waters, and can curb global temperatures.\n\n“The fact that we’re still seeing record temperatures outside of the influence of El Nino is a little surprising,” said Samantha Burgess, Strategic Lead at the European Centre for Medium-Range Weather Forecasts, which runs the C3S service.\n\nEl Nino peaked more than a year ago, Burgess noted.\n\nThe global average temperature in January was 1.75C higher than in pre-industrial times.\n\nCopernicus assesses that La Nina has not yet fully developed, and the world is currently in neutral conditions between the two phases. Other data models can vary, with US scientists indicating last month that La Nina conditions had formed.\n\nEven if La Nina does fully emerge, Burgess said its cooling effect may not be enough to temporarily curb global temperatures — which are also affected by factors like the extreme heat seen in other ocean basins, and the main driver of climate change: emissions of heat-trapping greenhouse gases.\n\n“By far and away the largest contributing factor to our warming climate is the burning of fossil fuels,” she said.\n\nScientists at Berkeley Earth and the UK Met Office have said they expect 2025 to be the third-warmest year on record — cooler than 2024 and 2023 because of the shift towards La Nina, though uncertainties remain about how the phenomenon will develop.\n\nGlobally, average sea surface temperatures in January were the second-highest on record for the month, exceeded only by January 2024.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:23:25.430Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890153/year-begins-with-warmest-january-despite-shift-towards-cooling-la-nina",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T10:17:53.000Z"
}
