{
  "title": "Pakistan, China agree to strengthen anti-terror cooperation; say attempt to disrupt ties bound to fail - World - DAWN.COM",
  "author": null,
  "content": "Pakistan and China have agreed to strengthen their bilateral cooperation in counter-terrorism activities, reiterating that any attempt to undermine or disrupt their ties was bound to fail, the Foreign Office (FO) said on Thursday.\n\nThey also agreed to upgrade cooperation in various other sectors such as defence, agriculture and information technology. The bilateral ties and cooperation were discussed as President Asif Ali Zardari met Chinese President Xi Jinping, Premier Li Qiang and Chairman of the Standing Committee of the National Peoples Congress Zhao Leji during his visit to China.\n\nA joint statement issued today by the FO on the discussions and agreements reached during the visit said: “The Pakistani side reiterated its strongest condemnation of the terrorist attacks in Pakistan involving Chinese personnel. It reaffirmed that ensuring the safety and security of Chinese personnel, projects and institutions in Pakistan is the foremost responsibility of Pakistani government as China’s all-weather strategic cooperative partner and the host country.\n\n“The Chinese nationals in Pakistan have made important contributions to Pakistan’s national construction and the improvement of people’s livelihoods and serve as a strong force helping boost Pakistan’s development, progress and prosperity. The Pakistani side expressed its sincere gratitude to the leadership and the people of China for their longstanding and invaluable support to Pakistan.”\n\nIt added that the two sides reiterated their commitment to combatting terrorism in all its forms and manifestations with a “zero-tolerance attitude” and agreed to strengthen bilateral and multilateral cooperation on counter-terrorism.\n\n“The Pakistani side will continue to make all efforts to investigate into the terrorist attacks involving Chinese personnel and bring the perpetrators to justice. It will also further increase input into security, and take targeted and enhanced measures to effectively ensure the safety and security of Chinese personnel, projects and institutions in Pakistan, and create a safe environment for cooperation between the two countries.\n\n“The Chinese side spoke highly of Pakistan’s unremitting efforts and tremendous sacrifices in combatting terrorism and expressed its willingness to provide necessary support for Pakistan’s counter-terrorism capacity building,” the FO said.\n\nIt added that the Pakistani delegation also reaffirmed its firm commitment to the one-China principle, calling Taiwan an “inalienable part of the territory of China and the Taiwan question the core of China’s core interests”.\n\nThe FO said Pakistan firmly supported all efforts made by China to achieve national reunification and resolutely opposed all forms of Taiwan independence, adding that this support also extended to all issues related to Xinjiang, Xizang (Tibet), Hong Kong and the South China Sea.\n\n“The Chinese side reiterated its firm support for Pakistan in defending its national sovereignty, independence, territorial integrity and its support for Pakistan’s efforts to safeguard national security, stability, development and prosperity.”\n\nThe statement said the two sides agreed that the China-Pakistan “all-weather strategic cooperative partnership” was a “choice by history and by the people” that enjoyed “broad support from all walks of life” in both countries.\n\n“Having withstood the test of changing international circumstances, the enduring partnership and iron-clad friendship between China and Pakistan transcends geopolitical interests and is an important positive factor for regional peace, stability and development. The two sides have always understood and supported each other, and have been deepening strategic mutual trust and practical cooperation.\n\n“The two sides noted that while the transformation not seen in a century is accelerating, the China-Pakistan relationship remains of strategic significance and any attempt to disrupt or undermine it is bound to fail.\n\n“The Chinese side reiterated that the China-Pakistan relationship is a priority in its foreign relations and of special significance in China’s foreign policy. The Pakistani side underscored that the Pakistan-China relationship is the cornerstone of its foreign policy. The two sides will further deepen high-level political mutual trust, high-level practical cooperation, high-level security cooperation and high-level international coordination, accelerate efforts to build an even closer China-Pakistan community with a shared future in the new era, and contribute greater strength to common prosperity of the two countries and to peace and development of the region.”\n\nOn October 6 last year, a massive explosion occurred on a road near Jinnah International Airport, killing a total of three people — including two Chinese engineers — and injuring at least 11 others.\n\nThe attack was claimed by the banned outfit Baloch Liberation Army (BLA). Police registered a case against leaders of the BLA and others three days after the incident.\n\nDuring the visit, the two sides signed over a dozen documents covering cooperation on the China Pakistan Economic Corridor (CPEC), trade, science and technology, people’s livelihoods and media, etc.\n\nThe FO said President Zardari will also attend the opening ceremony of the Ninth Asian Winter Games during his stay in China.\n\nPresident Zardari also invited his Chinese counterpart to visit Pakistan at a mutually convenient time.\n\nThe two countries have had close ties underpinned by long-standing wariness of their common neighbour, India, and a desire to hedge against US influence across the region.\n\nChinese investment and financial support for Pakistan since 2013 have been a boon for its struggling economy. China has thousands of nationals working on projects grouped under CPEC.\n\nThe $65-billion investment is part of President Xi’s Belt and Road Initiative, designed to Beijing’s global reach by road, rail and sea.\n\nThe FO said that apart from enhancing cooperation in information technology (IT) and emerging areas such as artificial intelligence, big data and communication technology, the two sides also agreed to expand cooperation in education, media, think tanks, youth, films and television to strengthen the bond between the two peoples and enhance mutual learning between civilisations.\n\n“Pakistan and China agreed to conduct further consultation on trade liberalisation under the framework of the Phase-II of China-Pakistan Free Trade Agreement and actively explore the possible bilateral concessional arrangements based on the spirit of mutual benefit and win-win cooperation.\n\n“It was also agreed to promote the implementation of the eight major steps on high-quality Belt and Road cooperation in Pakistan and jointly build a growth corridor, a livelihood-enhancing corridor, an innovation corridor, a green corridor and an open corridor, to create an upgraded version of CPEC, in line with Pakistans 5Es framework.”\n\nThe government launched its 13th Five-Year Plan (2024-2029) in December called “Uraan Pakistan: Homegrown National Economic Plan”, which aims to address key economic challenges thro­ugh a targeted framework called the “Five Es” — Exports; E-Pakis­tan; Equity and Empo­werment; Environment, Food and Water Security; and Energy and Infrastructure.\n\n“Both sides reaffirmed to make efforts to advance the upgradation of ML-1 in a phased and secure manner and reiterated that the Karakoram Highway (Raikot-Thakot) realignment project is of great importance to the land connectivity between China and Pakistan, and agreed to reach an early consensus on its implementation and financing.”\n\nThe FO said the Pakistani side also highly commended and expressed strong support for President Xi’s Global Development Initiative, Global Security Initiative and Global Civilisation Initiative. It added that the two sides agreed to step up international cooperation in this regard to jointly tackle global challenges and foster a “community with a shared future for mankind”.\n\nPresident Zardari lauded the great development achievements made by the Chinese people and expressed firm support for the Chinese side in advancing the “great cause of building a great modern socialist country in all respects”.\n\nThe FO pointed out that the Chinese side gladly noted Pakistan’s National Economic Transformation Plan (Uraan), applauding the new achievements in economic reform and national development and wished stability, security, development and prosperity for its ally.\n\nRecalling the 13th CPEC Joint Cooperation Committee (JCC) meeting, the two sides reiterated their commitment to further leverage the body’s functions to strengthen the alignment of ideas and coordination of actions for CPEC’s high-quality development.\n\nThe two sides agreed to hold the 14th JCC meeting as early as possible at a mutually agreed date.\n\nBoth sides also welcomed the official inauguration of the new Gwadar International Airport and reaffirmed their commitment to promoting the Gwadar Port’s comprehensive development and operation further to leverage its role as a multimodal logistics hub.\n\nThe Pakistani side reiterated its commitment to continuing to improve its business environment and provide a favourable policy framework for Chinese investment.\n\nBoth sides expressed their willingness to encourage Chinese companies to engage in investment and cooperation in Pakistan’s mining industry and encourage relevant departments of both countries to carry out terrestrial and marine geological survey cooperation.\n\nThe two sides agreed to further strengthen agricultural cooperation and select the next batch of projects under the CPEC framework. The two sides welcomed the active participation of third parties in CPEC cooperation.\n\nIt was agreed that China would encourage its technology companies to actively expand their businesses in Pakistan to accelerate science and technology cooperation in the high-quality development of CPEC’s second phase and develop an innovation corridor.\n\nThe two sides noted with satisfaction their ongoing collaborative efforts to leverage joint ventures in priority areas to enhance the export-oriented industry in Pakistan and encouraged Chinese companies with capabilities to invest in these sectors under the concept of win-win cooperation.\n\nThe FO said they also agreed to strengthen joint support for business-to-business (B2B) cooperation in both countries and facilitate deeper exchanges and cooperation between their business communities.\n\n“The Pakistani side reiterated its high appreciation for China’s valuable support for the fiscal and financial stability of Pakistan.\n\n“Both sides reaffirmed their desire to further strengthen bilateral cooperation in the financial and banking sectors, and support each other within regional and international multilateral financial platforms.\n\n“They agreed to continue to cooperate on people’s livelihood in areas such as healthcare, agriculture, education, climate response, and disaster prevention and alleviation, and to deliver more small and beautiful projects beneficial for the people.\n\n“The Pakistani side spoke highly of the children’s congenital heart disease treatment project and health kits project carried out by the Chinese side in Pakistan. Both sides discussed ways to deepen cooperation in health sector, including in traditional and herbal medicine.”\n\nThe FO said the Chinese side also expressed readiness to actively support Pakistani students in learning the Chinese language as well as to explore avenues for promoting technical and vocational training.\n\nBoth countries expressed satisfaction at the existing level of cooperation in space and agreed to advance and pursue further progress in this important area for socio-economic purposes.\n\n“The two sides expressed satisfaction that the two militaries have long enjoyed high-level of mutual trust, high-level cooperation, and high-level coordination. The two sides agreed to maintain the momentum of high-level military-to-military visits and exchanges, and to continuously elevate cooperation in areas of joint training, exercises and military technology.”\n\nPakistan and China also expressed satisfaction with their close cooperation at the UN and other multilateral forums and expressed resolution to further deepen coordination on multilateral issues to uphold the common interests of developing countries and international equity and justice.\n\nOn regional matters, the FO said both countries believed that a peaceful and prosperous South Asia was in the common interest of all parties and reaffirmed the importance of maintaining peace and stability in the region and the need for resolution of all outstanding disputes, and their opposition to any unilateral action.\n\nThe Pakistani side briefed the Chinese leadership on the latest developments in the situation in Jammu and Kashmir.\n\n“The Chinese side reiterated that the Jammu and Kashmir dispute was left over from history and should be properly and peacefully resolved in accordance with the UN Charter, relevant UN Security Council resolutions and bilateral agreements,” the FO said\n\nThe two countries also agreed to strengthen high-level interactions, enhance exchanges and cooperation across various departments and at different levels between central governments, local authorities, legislative bodies and political parties, and carry out in-depth exchanges of governance experience.\n\nThey further agreed to maintain close communication and coordination on the issue of Afghanistan and play a constructive role in helping the country achieve stable development and integrate into the international community.\n\nThe two sides called on the Interim Afghan Government to take “visible and verifiable actions to dismantle and eliminate all terrorist groups based in Afghanistan which continue to pose a serious threat to regional and global security, and to prevent the use of Afghan territory against other countries”.\n\nPakistan and China also welcomed the ceasefire agreement in Gaza and expressed hope that the agreement would be implemented effectively, leading to a full and permanent ceasefire in the battered territory.\n\n“The two sides reaffirmed their support for the right of the Palestinian people to self-determination, including their right to establish an independent state of Palestine. The two sides will work with international community to make unremitting efforts for peace and stability in the Middle East.”\n\nMeanwhile, the official Xinhua news agency reported that the two sides will upgrade and reconstruct Pakistan’s railway network and further develop the Gwadar port with Chinese companies able to invest in the country’s offshore oil and gas developments.\n\nPakistan and China recognised the importance of Pakistan’s “Gwadar Port and agreed to fully unleash its potential as a key node for connectivity and trade”, Xinhua said quoting a joint statement from the two countries.\n\nChinese-funded enterprises would be encouraged to “carry out mining investment cooperation in Pakistan” and cooperate in terrestrial and marine geological resources.\n\n“Pakistan welcomes Chinese companies to participate in the development of offshore oil and gas resources in Pakistan.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/06134150b5bb547.jpg",
  "retrievedAt": "2025-08-25T19:23:29.085Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890144/pakistan-china-agree-to-strengthen-anti-terror-cooperation-say-attempt-to-disrupt-ties-bound-to-fail",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T09:17:42.000Z"
}
