{
  "title": "Trump says Israel would hand over Gaza after fighting, no US troops needed - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump said on Thursday Israel would hand over Gaza to the United States after fighting was over and the enclave’s population was already resettled elsewhere, which he said meant no US troops would be needed on the ground.\n\nA day after worldwide condemnation of Trump’s announcement that he aimed to take over and develop the Gaza Strip into the “Riviera of the Middle East”, Israel ordered its army to prepare to allow the “voluntary departure” of Gaza Palestinians.\n\nTrump, who had previously declined to rule out deploying US troops to the small coastal territory, clarified his idea in comments on his Truth Social web platform.\n\n“The Gaza Strip would be turned over to the United States by Israel at the conclusion of fighting,” he said. Palestinians “would have already been resettled in far safer and more beautiful communities, with new and modern homes, in the region”.\n\nHe added: “No soldiers by the US would be needed!”\n\nEarlier, amid a tide of support in Israel for what Prime Minister Benjamin Netanyahu called Trump’s “remarkable” proposal, Defence Minister Israel Katz said he had ordered the army to prepare a plan to allow Gaza residents who wished to leave to exit the enclave voluntarily.\n\n“I welcome President Trump’s bold plan. Gaza residents should be allowed the freedom to leave and emigrate, as is the norm around the world,” Katz said on X.\n\nHe said his plan would include exit options via land crossings, as well as special arrangements for departure by sea and air.\n\nTrump’s unexpected announcement on Wednesday, which sparked anger around the Middle East, came as Israel and Hamas were expected to begin talks in Doha on the second stage of a ceasefire deal for Gaza, intended to open the way for a full withdrawal of Israeli forces and an end to the conflict.\n\nRegional heavyweight Saudi Arabia rebuffed the proposal outright and Jordan’s King Abdullah, who will meet Trump at the White House next week, said on Wednesday he rejected any attempts to annex land and displace Palestinians.\n\nEgypt also weighed in, saying it would not be part of any proposal to displace Palestinians from neighbouring Gaza, where residents reacted with fury to the suggestion.\n\nRussia’s Foreign Ministry said that Trump’s remarks were shocking and would ramp up tensions in the Middle East.\n\n“The main thing now is to provide the necessary humanitarian assistance to all those in need,” Russian Foreign Ministry spokeswoman Maria Zakharova told reporters.\n\n“We believe that the main task today is to ensure the implementation of agreements between Israel and Hamas.”\n\n“Any populist, frivolous, or shocking arguments about any other palliative measures at the present stage are counterproductive and do not contribute to solving the problem, but only fuel tension in the region and to all the already extremely aggravated problems,” Zakharova said of Trump’s remarks.\n\n“We will not sell our land for you, real estate developer. We are hungry, homeless, and desperate but we are not collaborators,” said Abdel Ghani, a father of four living with his family in the ruins of their Gaza City home.\n\n“If [Trump] wants to help, let him come and rebuild for us here.”\n\nWhat effect Trump’s shock proposal may have on the ceasefire talks remains unclear.\n\nOnly 13 of a group of 33 Israeli hostages due for release in the first phase have so far been returned, with three more due to come out on Saturday. Five Thai hostages have also been released.\n\nHamas official Basem Naim accused Israel’s defence minister Katz of trying to cover up “for a state that has failed to achieve any of its objectives in the war on Gaza”, and said Palestinians are too attached to their land to ever leave.\n\nDisplacement of Palestinians has been one of the most sensitive issues in the Middle East for decades. Forced or coerced displacement of a population under military occupation is a war crime, banned under the 1949 Geneva Conventions.\n\nDetails of how any such plan might work have been vague. Israeli Foreign Minister Gideon Saar said different thinking was needed on Gaza’s future but that any departures would have to be voluntary and states would have to be willing to take them.\n\n“We don’t have details yet, but we can talk about principles,” Saar told a news conference with his Italian counterpart Antonio Tajani.\n\n“Everything must be based on the free will of [the] individual and, on the other hand, of a will of a state that is ready to absorb,” he said.\n\nA number of far-right Israeli politicians have openly called for Palestinians to be moved from Gaza and there was strong support for Trump’s push among both security hawks and the Jewish settler movement, which wants to reclaim land in Gaza used for Jewish settlements until 2005.\n\nGiora Eiland, an Israeli former general who attracted wide attention in an earlier stage of the conflict with his “Generals’ Plan” for a forced displacement of people from northern Gaza, said Trump’s plan was “logical” and aid should not be allowed to reach displaced people returning to northern Gaza.\n\nIsrael’s devastating military campaign killed over 47,000 people after Hamas’ October 7, 2023, cross-border attack on Israel touched off the fighting and has forced Palestinians to repeatedly move around within Gaza in search of safety.\n\nBut many say they will never leave the enclave because they fear permanent displacement, like the “Nakba”, or catastrophe, when hundreds of thousands were dispossessed from their homes in the war at the birth of the state of Israel in 1948.\n\nKatz said countries that have opposed Israel’s military operations in Gaza should take in the Palestinians.\n\n“Countries like Spain, Ireland, Norway and others, which have levelled accusations and false claims against Israel over its actions in Gaza, are legally obligated to allow any Gaza resident to enter their territories,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/06220310bca155c.jpg",
  "retrievedAt": "2025-08-25T19:23:24.156Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890200/trump-says-israel-would-hand-over-gaza-after-fighting-no-us-troops-needed",
  "dateList": "2025-02-06",
  "date_published": "2025-02-06T17:05:37.000Z"
}
