{
  "title": "CJP launches initiative for comprehensive jail reforms",
  "link": "https://www.app.com.pk/national/cjp-launches-initiative-for-comprehensive-jail-reforms/",
  "date_published": "2024-11-02T15:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP):Chief Justice of Pakistan Yahya Afridi on Saturday launched initiatives for comprehensive jail reforms for effective prison system to ensure a fair legal framework.\nA pivotal consultative meeting was held at the Lahore, presided over by the Chief Justice of Pakistan, Mr. Justice Yahya Afridi, with participation from the Honorable Chief Justice of the Lahore High Court, Ms. Aalia Neelum, Administrative Judge of the Lahore High Court, Mr. Justice Shams Mehmood Mirza, Secretaries of the Home and Prosecution Departments, Inspectors General of Police and Prisons departments, the Registrar, Supreme Court of Pakistan, the Secretary, Law and Justice Commission of Pakistan (LJCP), the Superintendent of Central Prison, Lahore,  Ms. Saima Amin Khawaja, human rights activist attended the meeting, said a press release.\nThe discussion was also attended by members from both treasury and opposition political parties Mr. Ahad Khan Cheema, Senator and Ms. Khadijah Shah who have experienced imprisonment in jail. This session marked the inaugural discussion for developing National Jail Reform Policy, focusing on prison reforms and the welfare of inmates as part of a broader criminal justice reform strategy for Pakistan.\nChief Justice Afridi shared his vision for modernizing Pakistan’s criminal justice system, stressing that a humane and effective prison system is essential to ensure a fair legal framework. He noted that data collected by the LJCP reveals a deeply concerning situation nationwide, with 108,643 inmates housed in facilities with an authorized capacity of only 66,625. Punjab faces particularly severe challenges, with 67,837 prisoners confined in prisons built to accommodate just 36,365. Further analysis shows that 36,128 of these are under-trial prisoners, many of whom have been awaiting trial for over a year, highlighting a critical issue for the justice system. Chief Justice Afridi emphasized the importance of addressing these urgent issues in Punjab, beginning a phased approach that will ultimately extend to the entire country. This strategic focus on Punjab underscores his commitment to impactful, sustainable reforms where it is most needed. This series of consultative meetings starts in Lahore—the capital of Punjab and the province with the most overcrowded prisons—and will continue across other cities in Pakistan to gather insights and build consensus on reform initiatives.\nThe agenda centered on the LJCP’s proposal, a National Jail Reform Policy in alignment with international standards, including the Nelson Mandela Rules, Bangkok Rules, and Beijing Rules, to ensure humane and rehabilitative management across Pakistan’s correctional facilities. This proposal received strong support from attendees, who considered a phased plan to promote alternative sentencing options and rehabilitation initiatives for under-trial prisoners.\nThe participants also discussed the possibility of establishing a Jail Reforms Committee, aimed at developing strategies to reduce overcrowding, enhance inmate welfare, and improve case processing efficiency.\nAdditionally, the Terms of Reference (ToRs) proposed for the National Committee will guide structured efforts to reduce under-trial detention, introduce case management improvements, and implement comprehensive rehabilitation programs. The Chief Justice of Pakistan constituted a sub-committee comprising Mr. Justice (R) Shabbar Raza Rizvi, Ms. Saima Amin Khawaja (Advocate), Senator Ahad Khan Cheema and Ms. Khadija Shah to inspect the jails across the province and to give recommendations to streamline processes to address the high numbers of under-trial prisoners and promote alternative sentencing options, including community service and probation. Further commitments include expanding rehabilitative initiatives within jails, such as vocational training, mental health support, and educational programs to aid inmates in successful reintegration upon release.\nUnder the guidance of Chief Justice Afridi, and with the dedicated data collection and analytical support provided by LJCP, these initiatives are intended to bring about transformative, systemic improvements within Pakistan’s prison system. By prioritizing humane treatment, rehabilitation, and efficient case management, this collaborative framework will set the stage for a sustainable and just prison system that upholds human dignity and fosters rehabilitation across the nation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:59:21.711Z"
}
