{
  "title": "Citizens urged to prioritize health, take precautionary measures against smog",
  "link": "https://www.app.com.pk/national/citizens-urged-to-prioritize-health-take-precautionary-measures-against-smog/",
  "date_published": "2024-11-02T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP): Healthcare specialists Saturday cautioned Punjab inhabitants to adopt protective measures to mitigate the harmful effects of escalating smog levels, emphasizing the potential for noxious chemicals to exacerbate respiratory issues and other health concerns.\nRenowned respiratory infection specialist, Dr. Azam Mushtaq talking to a private news channel sounded the alarm on the deteriorating air quality in the province, urging citizens to take immediate precautions to safeguard their health.\nThe worsening air quality poses significant health risks, particularly for vulnerable populations such as children, elderly individuals and those with pre-existing respiratory conditions, he added.\n“Inhaling smog-filled air can lead to severe respiratory complications, including asthma, bronchitis, and chronic obstructive pulmonary disease (COPD),” Dr. Mushtaq warned.\nBy taking proactive measures, citizens can protect themselves and their loved ones from the hazardous effects of smog, he added.\nDr. Azam Mushtaq has issued a smog safety advisory and recommends wearing face masks during any outdoor activities, washing mouths, avoid unnecessary outdoor activities, especially during peak pollution hours (10am-4pm).\nCitizens should also check smog timing before venturing out and consider staying indoors with windows and doors closed, using air purifiers, reducing physical activity, staying hydrated and monitoring air quality indexes, he suggested.\nVulnerable populations, such as children, elderly individuals, pregnant women and those with pre-existing respiratory conditions should be particularly cautious.\nIf symptoms like coughing, shortness of breath, chest tightness, irritation, headaches, or fatigue persist or worsen, seek immediate medical attention, he added.",
  "retrievedAt": "2025-08-10T14:59:23.569Z"
}
