{
  "title": "Acting President urges global community to hold Israel accountable for its crimes against journalists",
  "link": "https://www.app.com.pk/national/acting-president-urges-global-community-to-hold-israel-accountable-for-its-crimes-against-journalists/",
  "date_published": "2024-11-02T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 02 (APP): Acting President Syed Yousaf Raza Gilani on Saturday urged the international community to hold Israel accountable for its crimes against journalists.\nHighlighting the recent bombings in Gaza, where a significant number of journalists lost their lives due to Israeli attacks, the acting president said according to the United Nations, over 130 journalists had been killed in Gaza to date.\nIn his message in connection with the International Day to End Impunity for Crimes Against Journalists, he said that freedom of the press was not possible without ensuring safety of the journalists.\nHe said the journalists work in challenging conditions especially while reporting in conflict zones and during wars.\nThe acting president said that in such dangerous environments, journalists faced various risks, including censorship, violence, threats, abduction, and even murder.\nIn Pakistan, steps have been taken to ensure the safety of journalists and media workers, Yousaf Raza Gilani said adding that the constitution of Pakistan gives the right of access to information, freedom of expression and freedom of the press.\nHe emphasized that freedom of the press was essential for strengthening democracy and promoting transparency in Pakistan.\nActs of violence against journalists undermine democracy, he said.\nIn 2021, Pakistan passed the Journalists and Media Professionals Protection Act, demonstrating its commitment to safeguarding journalists, he noted.\n“Health insurance for journalists has also been introduced in Pakistan.”\nHowever, he acknowledged that more actions were required to protect journalists and media workers in Pakistan.\nHe also stressed the need to adopt a comprehensive strategy and system to ensure journalists’ safety.",
  "retrievedAt": "2025-08-10T14:59:36.431Z"
}
