{
  "title": "PTI emerges as single largest party in Senate: Murad Saeed",
  "link": "https://www.app.com.pk/national/pti-emerges-as-single-largest-party-in-senate-murad-saeed/",
  "date_published": "2021-03-04T13:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP): Federal Minister for Communications and Postal Services Murad Saeed Thursday said that PTI emerged as single largest party in the Senate election.\nAddressing a press conference, the minister said that Prime Minister Imran Khan is only leader standing against corrupt political practices and struggling to bring transparency in country’s electoral process.\nHe said as compare to opposition’s dirty politics, Prime Minister Imran Khan’s took a principle stand on high moral grounds to take a vote of confidence from the National Assembly.\nPrime Minister Imran Khan decided on high moral grounds to take fresh vote of confidence from the National Assembly whereas PML-N leader Nawaz Sharif escaped to England, said the minister adding entire opposition is a creation of dictatorship.\nMurad Saeed further said that opposition is celebrating victory on the general seat in Senate election which they won with the spending of ill gotten money belong to the poor people of Pakistan.\nInstead of denouncing the corruption, Chairman PPP Bilawal Bhutto Zardari’s and PML-N Leaderships are taking pride in such corrupt practices, said Murad adding that the opposition tried to blackmail the government on Financial Action Task Force (FATF) legislation and pressurized for National Reconciliation Ordinance (NRO) in corruption cases against them.\nHe said, the government of Sindh shall have to explain its position on the video of buying votes and misusing the public funds.\nMurad Saeed said that the corrupt elements will be held accountable at all costs. He said the credit goes to the government for strengthening the institutions and bringing transparency in the elections.",
  "retrievedAt": "2025-08-11T20:26:38.903Z"
}
