{
  "title": "Ehsaas Panahgah initiative serves 624,998 persons so fa",
  "link": "https://www.app.com.pk/national/ehsaas-panahgah-initiative-serves-624998-persons-so-fa/",
  "date_published": "2021-03-04T09:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP): The Ehsaas Panahgah initiative has facilitated a total of 624,998 persons till date including shelter provided to 67,717 persons and meals served to 55,7281 persons since September 2020 onwards.\nAccording to an official source, during this month, the Panahgah initiative has facilitated 17,231 persons including shelter provided to 1,452 persons and meals served to 15,779 persons.\nThe five Panahgahs in Islamabad Capital Territory region at Bara Kahu, Mandi Mor, Peshawar Mor, Tarlai and Tarnol so far benefited 562,963 including shelter provided to 66,348 persons and meals served to 496,615 people.\nDuring the last 24 hours, the Panahgahs in ICT have benefited 5,353 people including shelter provided to 467 and meals served to 3518 persons.\nThe four operational Panahgahs in Sindh have benefited 38,948 persons including shelter provided to 1303 persons and meals served to 37,645 persons. While during the last 24 hours, the Panahgahs in Sindh have served 1041 beneficiaries including shelter provided to 44 persons and meals served to 997.\nThe three Panahgahs in Balochistan have so far benefited 23,021 persons through serving meals to 23,021 persons and providing shelter to 66 persons. While during the last 24 hours, a total of 371 persons availed the shelter in Panahgahs situated at Balochistan.\nThe historic initiative of establishing shelter (Panahgah) and food points (Langar khana) was taken to facilitate urban and rural homeless, far away from homes, unemployed, labourers, daily wagers, poor and transit passengers, attendants of the patients, students etc.\nThe Panahgahs and Langar Khana provide them valued but temporary/ overnight stay with two-time meals in a respectable manner.",
  "retrievedAt": "2025-08-11T20:26:41.407Z"
}
