{
  "title": "Ehsaas working to improve ecosystem for Street Hawkers: Dr Nishtar",
  "link": "https://www.app.com.pk/national/ehsaas-working-to-improve-ecosystem-for-street-hawkers-dr-nishtar/",
  "date_published": "2021-03-04T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 04 (APP): The Poverty Alleviation and Social Safety Division Thursday signed a Memorandum of Understanding (MoU) with a multitude of stakeholders in a ceremony held here to set up a collaborative framework for the forthcoming Ehsaas Street Hawkers Initiative.\nSpecial Assistant to the Prime Minister on Social Safety and Poverty Alleviation, Dr. Sania Nishtar was also present on the occasion.\nAs per the memorandum, Ehsaas has joined hands with Capital Development Authority (CDA), Islamabad Capital Territory Administration (ICTA), Metropolitan Corporation Islamabad (MCI), and Pakistan Institute of Development Economics (PIDE) to collaboratively steer the design and execution of the Ehsaas Street Hawkers’ Initiative under Mazdoor Ka Ehsaas.\nThe memorandum is centred on improving the ecosystem for street vending.\nAccording to conservative estimates, there are around 20,000 street vendors operating in\nIslamabad, who are generating annual net income up to Rupees 9.6 billion.\nEhsaas’ support for street vendors is in line with the Prime Minister’s vision of the welfare state based on Riyasat-e-Madina model.\nIn this regard, PASSD is collaborating with city authorities and research institutes to organize street vending in a more sustainable manner.\nDr. Nishtar said in a statement after signing the MoU, “For the first time in Pakistan, the government is embarking upon the initiative for street vendors. This is a very difficult policy space; we are trying to work out solutions.”\nShe then continued, “The marginalized segment of street vendors is an integral part of the local economy, which cannot be wished away in a low-income country like Pakistan. The MoU will enable a more strategic and coordinated approach towards delivering impact.”\nThe memorandum was signed by Muhammad Ali Shahzada, Secretary PASSD; Amer Ali Ahmed, Chairman CDA and Chief Commissioner, ICT Administration; Syeda Shafaq Hashmi, Administrator MCI and Dr. Nadeem-ul-Haque, Vice Chancellor PIDE. “Ehsaas is determined to support this collaborative initiative and working with the stakeholders”, commented Secretary Shahzada.\nSecretary PASSD mentioned that a dedicated Vendor Support Group will be established at Ehsaas to cater for the coordination and sustainability of the ensuing interventions in street vending.\nUpon the success of the pilot project in Islamabad, it could potentially be scaled up in other areas of the city and to other cities of the country.\nAmer Ali Ahmad, Chairman CDA said that government does realize the importance of street livelihoods in poverty alleviation efforts. Syed Shafaq Hashmi, Administrator, MCI informed on the setting of Street Economy Unit and Municipality participation in a Global Mayors’ Challenge with the street vendors’ project. Dr. Durr-e-Nayab, Joint Director, PIDE also spoke on the occasion.\nZia Banday, Focal Person on the street vendors’ initiative, informed the participants that contours of this multi-stakeholder collaboration have been designed to support street hawkers.",
  "retrievedAt": "2025-08-11T20:26:39.071Z"
}
