{
  "title": "India downgraded from free to “partly free” owing to dismal human rights record: Freedom House",
  "link": "https://www.app.com.pk/national/india-downgraded-from-free-to-partly-free-owing-to-dismal-human-rights-record-freedom-house/",
  "date_published": "2021-03-04T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 4 (APP): Democracy research institute – Freedom House has downgraded India – the world’s largest democracy –  from free to partly free, due to legislation undermining political rights of Muslims, pressure on human rights organizations, and increased intimidation of journalists.\nThe report by Freedom House, an independent watchdog organization dedicated to the expansion of freedom around the world in its 2021 report said India dropped nine-points from 76th position in 2005 to 67 in 2021 – covering the year 2020, on a score of 0 to 100.\nThe report points out that India was descending into authoritarianism under Prime Minister Narendra Modi, marking a sharp rise in incidents of violence against Muslims and gross human rights violations.\nFreedom House is an independent watchdog organization dedicated to the expansion of freedom around the world. The democracy research institute pointed to incidents of mob violence against Muslims, intimidation of journalists, and rising judicial interference, and cited these as some of the key reasons.\n“Rather than serving as a champion of democratic practice and a counterweight to authoritarian influence from countries such as China, Modi, and his party are tragically driving India itself toward authoritarianism,” Freedom House said in its annual report.\n“Under Modi, India appears to have abandoned its potential to serve as a global democratic leader, elevating narrow Hindu nationalist interests at the expense of its founding values of inclusion and equal rights for all,” the report said.\nBREAKING: India is not rated \"Free\" in Freedom in the World 2021. Political rights and civil liberties have eroded in India since Narendra Modi became prime minister in 2014, causing the country to drop from Free to Partly Free in 2020. #FreedomInTheWorld https://t.co/HuNzEAc6Nw pic.twitter.com/mae0CmGpi5\n— Freedom House (@freedomhouse) March 3, 2021\nIt pointed that the government of Prime Minister Narendra Modi and its state-level allies continued to crack down on critics during the year, and their response to COVID-19 included a ham-fisted lockdown that resulted in the dangerous and unplanned displacement of millions of internal migrant workers.\nThe ruling Hindu nationalist movement also encouraged the scapegoating of Muslims, who were disproportionately blamed for the spread of the virus and faced attacks by vigilante mobs.\nThe report said with India’s decline to Partly Free, less than 20 percent of the world’s population now lives in a Free country, the smallest proportion since 1995.\n“As repression intensifies in already unfree environments, greater damage is done to their institutions and societies, making it increasingly difficult to fulfill public demands for freedom and prosperity under any future government.”\nThe Freedom House report categorically stated that political rights and civil liberties in India have deteriorated since Narendra Modi became prime minister in 2014, with increased pressure on human rights organizations, rising intimidation of academics and journalists, and a spate of bigoted attacks, including lynchings, aimed at Muslims.\n“The decline only accelerated after Modi’s reelection in 2019,” the report said.\n“Under Modi, India appears to have abandoned its potential to serve as a global democratic leader, elevating narrow Hindu nationalist interests at the expense of its founding values of inclusion and equal rights for all”\nLast year, the government intensified its crackdown on protesters opposed to a discriminatory citizenship law and arrested dozens of journalists who aired criticism of the official pandemic response.\nJudicial independence has also come under strain; in one case, a judge was transferred immediately after reprimanding the police for taking no action during riots in New Delhi that left over 50 people, mostly Muslims, dead.\nIn December, Uttar Pradesh, India’s most populous state, approved a law that prohibits forced religious conversion through interfaith marriage, which critics fear will effectively restrict interfaith marriage in general; authorities have already arrested a number of Muslim men for allegedly forcing Hindu women to convert to Islam.\n\"India’s status declined from Free to Partly Free due to a multiyear pattern in which the Hindu nationalist government and its allies have presided over rising violence and discriminatory policies affecting the Muslim population and pursued a crackdown…\" https://t.co/ZYiCNnCA8J\n— Sushant Singh (@SushantSin) March 3, 2021\nAmid the pandemic, the government imposed an abrupt COVID-19 lockdown in the spring, which left millions of migrant workers in cities without work or basic resources. Many were forced to walk across the country to their home villages, facing various forms of mistreatment along the way.\nThe report said the proportion of Not Free countries was now the highest it has been in the past 15 years. On average, the scores of these countries have declined by about 15 percent during the same period.\n-Report by Shafek Koreshe",
  "retrievedAt": "2025-08-11T20:26:36.127Z"
}
