{
  "title": "Ceasefire at LoC won’t affect international status of Kashmir dispute: AJK President",
  "link": "https://www.app.com.pk/national/ceasefire-at-loc-wont-affect-international-status-of-kashmir-dispute-ajk-president/",
  "date_published": "2021-03-04T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 4 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan Thursday said the decision to observe ceasefire along the Line of Control (LoC) taken by India and Pakistan would not affect the international status of the Kashmir dispute.\n“Kashmir is not a border dispute between India and Pakistan but it is a question of the future of over 15 million Kashmiris. The dispute is still on the agenda of the UN Security Council as an unresolved issue,” asserted the president while addressing a Kashmir seminar here.\nThe seminar organized by the Institute of Regional Studies was also addressed by Nadeem Riaz, President, Institute of Regional Studies, Ms Noorin Ibrahim, Member National Assembly, Ms Farzana Yaqub, Former AJK Minister and other speakers.\nIn his address, President Sardar Masood Khan said there was a positive aspect of the ceasefire between Indian and Pakistani forces along the LOC that killings will not happen on both sides of the LOC, said a press release.\n“This agreement in no way would make the issue (of Kashmir) a bilateral.” The Kashmir dispute is an international issue and we must realise that bilateral talks between India and Pakistan have always been a hoax.\nThe president said that the LOC is simply a ceasefire line. We will never in any legal framework accept it a (permanent) border between the two countries.\nApprising the participants of the seminar about the situation in Occupied Kashmir, the president said that the treatment of human beings by the 900,000 troops of India at present in Occupied Jammu and Kashmir is the worst example of bestiality.\nHe said the entire territory has been under an Indian siege since August 2019 and over nine million people of the occupied territory are forced to stay inside their homes.\n“Young men are being killed or made disappear and around 14,000 boys as young as 10, 11 and 12 have been abducted by the occupation forces and according to the Indian sources they are being kept in concentration camps.”\nThese camps, he said, are reminiscent of the concentration camps that were set up by Adolf Hitler in the last century to annihilate Jews, Romanis and political opponents,” Khan said.\nIndia is not only violating human rights but also committing war crimes in occupied Kashmir, he said adding that Indian Prime Minister Narendra Modi and Home Minister Amit Shah are responsible for committing these crimes against humanity in occupied Kashmir must be tried by the international war crimes tribunal.\nDescribing Hindutva as hate philosophy, the state President said that under the fanatic approach that the Muslims had no right to live in the subcontinent, the Indian rulers are settling hundreds of thousands of Hindus from India to the Muslim majority state of Kashmir so that the Muslims are either massacred or they are compelled to leave the territory.\nHe maintained that at present the Muslims in Jammu and Kashmir had been deprived of their language, religion, culture and livelihood.\nResponding to questions from the audience, the AJK President said that more than ten million Pakistani and the Kashmiri expatriates across the world, are a great asset for us, but unfortunately we have yet to fully tap the potential of the diaspora community for the Kashmir cause.",
  "retrievedAt": "2025-08-11T20:26:38.656Z"
}
