{
  "title": "Pakistan slams India at UNHCR on HR abuses",
  "link": "https://www.app.com.pk/national/pakistan-slams-india-at-unhcr-on-hr-abuses/",
  "date_published": "2021-03-04T13:37:00.000Z",
  "source": "APP",
  "content": "“India has failed and will continue to fail in hiding its brutal repression of Kashmiri people behind the self-serving smokescreen of terrorism,” Junaid Suleman, a Pakistani diplomat, told the Geneva-based Council in the exercise of his right of reply after an Indian representative made oft-repeated allegations about Pakistan’s involvement in terrorism.\n“As Pakistan highlights India’s atrocities in Occupied Jammu & Kashmir, which have been well-documented by the Office of UN High Commissioner for Human Rights, UN Mandate Holders (rights experts) and international NGOs, the Council has yet to hear any response from India- a country that claims to be world’s largest democracy but has shamelessly violated every human rights principle, norms and laws,” said Suleman, a second secretary at the Pakistan Mission in Geneva.\nThe Indian representative, Pawankumar Badhe, had reacted to Pakistan Ambassador Khalil Hashmi’s speech in which the Pakistani envoy had urged the UN right chief to conduct an impartial investigation into India’s multiple violations of human rights in the disputed territory.\nPakistani diplomat Suleman said New Delhi’s “compulsive obsession with Pakistan is neither new nor surprising”, and pointed that the Indian government had deployed tools of deflection, deception and disinformation as evident from the EU DisInfo Lab’s two investigative reports and the “infamous Goswami saga”.\nHe also mentioned the shuttering of Amnesty International’s office last year and vicious attacks on the UN Human Rights machinery.\n“Yet,”, Suleman said, “India’s façade of a practicing democracy stands exposed today … its representative can no longer mask the facts that it is in India only where dissent is sedition, where human rights activists are branded as terrorists and where peaceful protests are treated as part of an imaginary global conspiracy against a failing State.\nThe farmers in India were out in the streets and had placed New Delhi under siege for the past three months.\n“From forced conversion to arbitrary denial of citizenship rights, and from state-sanctioned communal violence to apartheid policies, the BJP-RSS regime has now codified the choice between extermination or total submission for India’s minorities, he said.\n“Under the leadership of Prime Minister (Narendra) Modi, Home Minister Amit Shah, and Chief Minister Yogi Adiyanath, the Indian state machinery has launched anti-Muslim campaigns such as Love Jihad, Land Jihad, incited public lynching and violence, and legislated mass ostracization under the patently discriminatory citizenship law,” the Pakistani diplomat said.\n“With a documented history of pogroms in Gujarat, Muzaffar Nagar, Malegnon, and most recently in Delhi, many independent observers have been obliged to conclude that in India, a cow is safer than an Indian Muslim.\n“No amount of empty rhetoric and dubious grandstanding can alter these hard facts,” Suleman said.\nPakistan also urged the UN Human Rights Council to step up efforts to get access for independent observers into Illegally-Occupied Jammu and Kashmir (IIOJ&K) to conduct an impartial investigation into reports of multiple violations of human rights in the disputed territory.\n“Failure to hold India accountable for human rights abuses in IIOJ&K will erode the credibility of this Council, its members, and the global human rights agenda,” Ambassador Khalil Hashmi, Pakistan’s permanent representative to the UN in Geneva, said in the 47-member body’s general debate.\nHe said the ‘UN Mandate Holders’ (independent rights experts) warned about continuing demographic changes in IIOJ&K on a religious and ethnic basis, as over three million illegal citizenship certificates were issued to non-Kashmiris.\nLast year, he added, the UN Experts had characterized the grim human rights situation in IIOJ&K “in a free fall” and called on the international community to “step up”.\n“India continues to use torture and brute force, including pellet guns and inflict collective punishments through house demolitions as well as cordon-and-search operations in IIOJ&K.”\nOver a thousand Kashmiri civilians are illegally imprisoned since August 2019, the Pakistani envoy said, adding that hundreds of habeas corpus petitions were pending before Indian courts.\n“Indian military and the deep State rule the Occupied Territory with a ‘license to kill’ any Kashmiri daring dissent.\n“Such a gross, systematic and continuing violations meet all the elements of objective criteria for a human rights situation warranting the Council’s attention and triggering its ‘prevention mandate’,” he said of the procedure to push for access for independent observers, accountability of perpetrators, and establishment of a commission of inquiry.\nThe UN High Commissioner for Human Rights, Michelle Bachelet also expressed her “concern” over the deteriorating situation in Indian occupied Kashmir and said that the farmers’ protest against farm laws around New Delhi calls for ensuring that legislations are based on consultations with stakeholders.\n“Despite the recent restoration of 4G access for mobile phones, the communications blockade has seriously hampered civic participation, as well as business, livelihood, education, and access to health-care and medical information,” she said.\nThe UN High Commissioner for Human Rights was also critical of action taken by Indian authorities against journalists covering the protests and efforts to curb freedom of expression on social media.\nMeanwhile the Organization of Islamic Conference (OIC) last week called for implementing recommendations made in two reports of the Office of the UN High Commissioner for Human Rights (OHCHR) that proposed the formation of a commission of inquiry into the grave rights abuses in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nPakistan’s Ambassador to the United Nations in Geneva, Khalil Hashmi, on behalf of the OIC demanded revocation of all illegal measures since August 5, 2019, when India illegally annexed the disputed state of Jammu and Kashmir.\n• India under Modi is using cyberspace to malign, target neighbouring and regional states",
  "retrievedAt": "2025-08-11T20:26:36.505Z"
}
