{
  "title": "Parliamentary Kashmir Committee Chairman visits LoC",
  "link": "https://www.app.com.pk/national/parliamentary-kashmir-committee-chairman-visits-loc/",
  "date_published": "2020-05-25T23:00:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): May 26 (APP):Chairman Special Parliamentary Committee on Kashmir Shehryar Khan Afridi visited Line of Control (LoC) along Chakothi Sector on Eid ul Fitr and paid glowing tribute to the Kashmiris for rendering matchless sacrifices for their just cause.\nDuring his visit to the Chokothi sector, the Chairman Special Parliamentary\nCommittee on Kashmir spent time with soldiers deployed at forward posts.\nGeneral Officer Commanding Muree Major General Amer Ahsan Nawaz accompanied him on the eve of his visit to LoC and briefed him on the situation, an official handout issued by AJK Govt. On Tuesday said.\nAddressing the troops, Shehryar Khan Afridi said that Kashmir beats in the heart of every Pakistani.\nHe said Prime Minister Imran Khan has emerged as a vibrant ambassador of Kashmir in the world, by presenting the case of Kashmir with a new angle and garnering attention.\nShehryar Khan Afridi urged the world community to take notice of the massive human rights violations by the Indian occupant forces in held valley and impose economic and military sanctions on India.\nHe said Kashmir is unfinished agenda of the subcontinent and added that Pakistan and Kashmir are inseparable.\nChairman Special Parliamentary Committee on Kashmir further said that Modi’s fascist policies and atrocities on the minorities particularly Muslims had vindicated the two nations theory once again. “If such discriminatory attitude against the minorities didn’t stop, no power could stop the further division of the India”, he added.\nAfridi also condemned the Indian nefarious designs against Kashmir and Pakistan and said that India, since August 5 last year trying to change the demographic composition of the disputed territory.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:39.502Z"
}
