{
  "title": "No dearth of ventilators to treat COVID-19 patients: NDMA chairman",
  "link": "https://www.app.com.pk/national/no-dearth-of-ventilators-in-pakistan-chairman-ndma/",
  "date_published": "2020-05-26T10:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 26 (APP):National Disaster Management Authority (NDMA) Chairman Lt Gen Muhammad Afzal on Tuesday said there was no dearth of ventilators in the country to treat COVID-19 patients.\nAround 4,00 ventilators were available in public and private sector hospitals while the NDMA had placed orders for procurement of 1,310 more ventilators, he said addressing a press conference here.\nThe NDMA chairman said trained staff was required to operate the ventilators and agreements regarding training of staff, their installation and 1-3 three years maintenance were also ensured with suppliers.\nHe said the United States of America had also offered to donate 200 ventilators and half of them would reach Pakistan shorty. Out of them, 30 each would be provided to Peshawar and Karachi, 15 to Balochistan, 10 to Faisalabad and 15 to Lahore.\nHe said currently only 128 patients were on ventilators. Occupancy of the ventilators in all cities remained below 50 per cent so far, he added.\nHe said 2,000 more ventilators would be required by June if the situation would worsen for which a contingency plan had already been chalked out.\nThe NDMA chairman said the Authority had 183 intensive care unit ventilators in its warehouses as well as oxygen, CPAP, and BiPAP ventilators.\nRefuting a news circulated on the social media about the shortage of ICU beds, Muhamamd Afzal said there were 10,944 ICU beds available in 365 public sector hospitals across the country. Only 2,211 beds were occupied, which were even less than 20 per cent of the available capacity while 679 ICU beds were also available in 52 private hospitals, he added.\nMoreover, 72,900 beds were available in public sector and around 6,000 beds in private sector hospitals, he said.\nThe NDMA chairman said any corona patient, who was denied a bed in any hospital across the country, could register a complaint at telephone number 111-157-157.\nHe said Pakistan had achieved self-sufficiency in manufacturing medical equipment to treat the COVID-19 patients.\nHe appealed to the masses to strictly adhere to the Standard Operating Procedure (SOPs) laid down by the Ministry of Health to prevent the spread of coronavirus and to protect themselves and others.\nRegarding the locusts attack in various parts of the country, the NDMA chairman said a massive operation was being carried out in four divisions, including Dera Ghazi Khan, Multan, Bahawalpur and Faisalabad along with Okara, Bhakar, and Layyah districts to combat the locusts.\nEnough stock of pesticides, he added, was available to check the locusts attack in the country.\nHe said China had also provided 100,000 liters Malathion and 75,000 liters Lambda, while Japan would also provide 50,000 liters Lambda. The NDMA had also placed orders to procure 100,000 liters each of the two pesticides to undertake spray against the locusts, he added.\nHe said the provinces were provided the pesticides as per their demand.\nMuhammad Afzal said the NDMA had also arranged nine aeroplanes for aerial spray in the affected areas of Sindh, Balochistan, Punjab, and Khyber Pakhtunkhwa.\nSpray kits were also imported to be fixed on army helicopters for carrying aerial spray against the locusts, he said, adding over 1,500 teams were working to carrying out manual spray in various parts of the country.\nHe said the swaths of locusts could enter Pakistan from Iran and Muscat in the first and second weeks of the next month and they had already deployed aircraft with sufficient spray equipment and pesticides in Dera Ghazi Khan, Dera Ismail Khan and along the Iran border to kill the insect then and there.\nArrangements had also been made to undertake anti-locust spray in the deserts of Thar and Cholistan, he added.\nThe NDMA chairman said six more aircraft were also being added to the fleet for aerial spray on the directives of government. The Pakistan Army had placed the services of its 5,000 personnel on the NDMA ‘s disposal to counter the locusts attack, he added.\nRegarding the preparation for floods, Muhammad Afzal said in winter some areas received 29-33 per cent more snow during the current year and they had prepared plans to meet any flood situation in coming days.\nReplying to a question, he said all the personal protective equipment (PPE), including N-95 masks, were being manufactured in Pakistan. The Pakistan Air Force had also provided medical equipment to the United States, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:15:33.288Z"
}
