{
  "title": "Campaign against over billing to continue: Mohsin Naqvi",
  "link": "https://www.app.com.pk/national/campaign-against-over-billing-to-continue-mohsin-naqvi/",
  "date_published": "2024-04-15T12:35:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 15 (APP):Federal Interior Minister Syed Mohsin Raza Naqvi said on Monday that steps were being taken to increase counters at the Lahore Airport so that time taking immigration process could be made easier for people.\nAddressing a press conference at the Federal Investigation Agency (FIA) regional office here, he said that he had also talked to Federal Aviation Minister Khawaja Asif in this regard, adding that electronic gates would be introduced so that passport scanning process could be done without immigration officer.\nRegarding over billing of electricity bills, Mohsin Naqvi said that he had talked to Prime Minister Shehbaz Sharif in this regard and he had assured that no pressure in this regard would be tolerated and extend full support to FIA to overcome this issue.\nHe said, “We have an evidence that 830 million units had been over billed in the LESCO and FIA Lahore has done good job in this regard.” He said this over billing was done in government offices, industry and even to a common man who consumed only 300 units.\nHe said that XEN had been arrested who used to over bill consumers using 300 units, adding that it was very unfortunate.\nThe federal minister said that campaign against over billing would continue till this practice come to an end and steps against over billing would be taken across the country.\nHe  said that as far as cyber side was concerened huge revamping would be carried out in FIA on cyber side.\nRecruitment process on vacant posts in FIA would be completed, he added.\nHe said that work against power theft was being carried out on a massive scale but still a lot more had to be done in this regard.\nThe interior minister said that steps to overcome power theft in Balochistan and Khyber Pakhtunkhwa would taken with the support of the Ministry of Power.\nAbout human trafficking, Mohsin Naqvi said that a lot of work was being carried out to stop it but more efforts were required in this regard.\nTo a question, he said that there would be no political pressure in FIA.\nRegarding question about Amir Tamba, he said that investigation was underway in this regard.\nHe said that there would no leniency with regard to over billing issue and action would taken without any discrimination.\nHe said that Karachi police and Sindh Police were working aggressively against street crimes in Karachi.\nHe said that there should be laws which could help to stop improper use of social media.\nEarlier, Mohsin Naqvi got the Shaheed Shahzad Younas Investigation block inaugurated from Sub Inspector Faiza Shahzad, the widow of Shaheed Shahzad.\nThe interior minister paid tribute to Shaheed Inspector Shahzad Younas.\nThe federal minister also visited different sections of the newly inaugurated investigation block.\nFederal Investigation Agency Director General Ahmad Ishaque Jehangir, FIA Lahore Director Sarfraz Virk and others were also present.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:51:37.691Z"
}
