{
  "title": "PM for maximum utilization of renewable energy resources, improving transmission system",
  "link": "https://www.app.com.pk/national/pm-for-maximum-utilization-of-renewable-energy-resources-improving-transmission-system/",
  "date_published": "2024-04-15T09:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 15 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday emphasising the improvement of power transmission network, directed the energy ministry to maximize the utilization of renewable energy resources to reduce the country’s oil import bill by billions of dollars.\n“Ultimately, we have to move to renewable energy. The oil import worth billions of dollars can be controlled by using alternative resources like solar, wind and hydel. Make cold calculations and I believe, you will be the winner in the long term,” he remarked addressing a meeting he chaired to review the power sector’s performance.\nThe prime minister said utilising renewable energy resources would also ensure riddance from the crude oil tanker mafia acting as parasites and eating up the national money.\nHe pointed out that the country currently imports oil worth $27 billion to meet its power and transportation needs, a figure that could be significantly reduced by transitioning to alternative energy sources.\nDiscussing the ongoing drive against power theft, he lauded the performance of the Punjab government and expressed the hope that the other provinces would also follow suit to overcome the challenge.\nPrime Minister Shehbaz said that strengthening the country’s power transmission system required utmost efforts and investment otherwise the power production and investments in the sector would go down the drain unless the flaws in the transmission network were removed.\nHe asked the energy ministry to engage world-class consultants to suggest the government ways forward to boost the country’s power transmission system.\nAdditionally, the prime minister mentioned the heavy rains affecting parts of the country and expressed condolences for the lives lost.\nPrime Minister Shehbaz told the participants that he had asked the Chairman of the National Disaster Management Authority (NDMA) to coordinate with the provinces and Provincial Disaster Management Authorities to dispatch relief items to the affected areas.",
  "retrievedAt": "2025-08-11T01:51:40.125Z"
}
