{
  "article_id": "2025-08-22_d76edc76f11645065d89cd2daec9b778",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-china-reaffirm-all-weather-strategic-partnership-during-6th-strategic-dialogue-fo-spox/",
    "retrieved_at": "2025-08-23T07:58:25.113Z"
  },
  "metadata": {
    "title": "Pakistan, China reaffirm âAll-Weather Strategic Partnershipâ during 6th Strategic Dialogue: FO Spox",
    "author": null,
    "date_published": "2025-08-22T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1101,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 22 (APP):Foreign Office (FO) Spokesperson, Ambassador Shafqat Ali Khan, on Friday, said Pakistan and China have reaffirmed their commitment to further deepening their aAll-Weather Strategic Cooperative Partnershipa through enhanced bilateral, regional, and multilateral cooperation. Addressing the weekly press briefing, Foreign Office Spokesperson Ambassador Shafqat Ali Khan stated that Chinese Foreign Minister and Member of the Political Bureau of the Communist Party of China, Wang Yi, visited Islamabad on August 21, 2025, on the invitation of Pakistanas Deputy Prime Minister and Foreign Minister, Senator Mohammad Ishaq Dar, to co-chair the 6th PakistanaChina Foreign Ministersa Strategic Dialogue. aBoth sides comprehensively reviewed the entire spectrum of bilateral relations, including CPEC Phase-II, trade and economic ties, multilateral cooperation, people-to-people exchanges, and important regional and global issues,a Ambassador Khan said. He added that the two ministers agreed to maintain close coordination and communication at bilateral and multilateral forums. During his visit, Foreign Minister Wang Yi also called on President Asif Ali Zardari, Prime Minister Shehbaz Sharif, and Chief of Army Staff Field Marshal Syed Asim Munir. In his meeting with the President, Asif Ali Zardari expressed gratitude for Chinaas aconsistent support for Pakistanas sovereignty, territorial integrity, and national development,a and appreciated Beijingas principled stance on the Jammu and Kashmir dispute, he added. He also highlighted the strategic significance of the ChinaaPakistan Economic Corridor (CPEC) as part of President Xi Jinpingas Belt and Road Initiative. During the Chinese Foreign Ministeras interaction with Prime Minister Shehbaz Sharif, both leaders reaffirmed mutual support on core national interests. The Prime Minister reiterated Pakistanas resolve to expand cooperation with China in trade, ICT, agriculture, industrialization, mines and minerals, and other sectors under CPEC Phase-II, he added. Ambassador Khan added that during the Chinese Foreign Ministeras meeting with the Chief of Army Staff, discussions focused on regional security, counterterrorism, and defense cooperation. Both sides underscored their resolve to strengthen coordination at regional and international platforms. The FO spokesperson said the visit was part of regular high-level exchanges aimed at consolidating the PakistanaChina partnership. Ambassador Khan also informed that the 6th Trilateral Meeting of the Foreign Ministers of Pakistan, China, and Afghanistan was held on August 20, 2025, in Kabul. Deputy Prime Minister and Foreign Minister Ishaq Dar, Foreign Minister Wang Yi, and Afghanistanas Acting Foreign Minister Mawlawi Amir Khan Muttaqi participated. aThe three sides committed to strengthening joint counterterrorism efforts and agreed to enhance collaboration in trade, transit, health, education, culture, combating drug trafficking, and extending CPEC to Afghanistan,a he said. On the sidelines, DPM/FM Dar held a bilateral meeting with Acting Foreign Minister Muttaqi, noting progress in political and economic areas but raising concerns over insufficient cooperation in counterterrorism. The FO further highlighted that Deputy Prime Minister and Foreign Minister Ishaq Dar paid an official visit to the United Kingdom (17a19 August 2025), where he met: Hamish Faulksner, UK Parliamentary Under-Secretary of State for the Middle East, Afghanistan, and Pakistan; Several British-Pakistani Members of Parliament, including Mohammad Yasin, Tahir Ali, Imran Hussain, Ayub Khan, and Adnan Hussain; Lord Qurban Hussain and Kashmiri community leaders; Baroness Shirley Botchwey, Commonwealth Secretary-General, who accepted an invitation to visit Pakistan. During the visit, DPM/FM Dar also inaugurated digital land record services and a one-window passport system at the Pakistan High Commission in London to facilitate the diaspora. He also addressed the British Pakistani Lawyers Forum, warning against Indiaas unlawful attempts to suspend the Indus Waters Treaty, terming them an aexistential threata to Pakistan. The spokesperson confirmed that on August 12, 2025, Deputy Prime Minister Dar met Gregory LoGerfo, Acting Coordinator for Counterterrorism at the U.S. State Department, as part of the PakistanaU.S. Counterterrorism Dialogue. Both sides reaffirmed their shared commitment to combating terrorism, including threats posed by the Balochistan Liberation Army (BLA), ISIS-Khorasan, and other groups. Ambassador Khan also welcomed the U.S. decision to designate the BLA and its Majid Brigade faction as Foreign Terrorist Organizations, calling it aa recognition of Pakistanas sacrifices and counterterrorism efforts for global security.a Pakistan and China also held the 10th Round of Bilateral Consultations on Arms Control, Non-Proliferation, and Disarmament in Beijing on August 18, led by Ambassador Tahir Andarabi, Additional Secretary, Ministry of Foreign Affairs, and Sun Xiaobo, Director-General of the Department of Arms Control at Chinaas Ministry of Foreign Affairs. Both delegations discussed global and regional security, South Asiaas strategic stability, and peaceful uses of nuclear technology and outer space. The next round will be hosted by Pakistan in 2026. Ambassador Khan welcomed the August 8, 2025 award by the Court of Arbitration on the Indus Waters Treaty, which upheld Pakistanas interpretation of critical provisions and ruled against Indiaas attempts to maximize pondage volumes and bypass treaty restrictions. aThis ruling reaffirms the final and binding nature of the treaty and exposes Indiaas unilateral attempts to suspend its obligations,a he said. The spokesperson strongly condemned Israeli statements about creating a so-called aGreater Israela and displacing Palestinians from Gaza, calling them aa flagrant violation of international law and UN resolutions.a Responding to a question on the recent statement by the Indian Ministry of External Affairs, Ambassador Shafqat Ali Khan said that Pakistan outrightly rejects the baseless insinuations, terming them yet another example of New Delhias achronic tendency to distort facts and twist statements out of context.a aThe Indian narrative of so-called nuclear blackmail is a self-serving construct, misleading in nature, and aimed at maligning Pakistan,a the spokesperson said. He stressed that Pakistan is a responsible nuclear-weapon state with a robust command-and-control system under full civilian oversight and has aalways exercised restraint and discipline on matters of such importance.a Ambassador Khan underscored that Pakistanas asustained and credible counterterrorism efforts are internationally recognized,a noting that its security forces have acted as a bulwark against terrorism not just for Pakistan but also for regional stability and global security. He further criticized Indiaas asabre-rattling and war-mongering whenever confronted with inconvenient facts,a adding that unfounded allegations and fabricated narratives areflect New Delhias lack of diplomatic confidence.a He said Indiaas attempt to involve third countries in its propaganda ais a futile effort to exert pressure on Pakistan through distortion of facts.a Contrasting Indiaas approach with Pakistanas, the FO Spokesperson emphasized: aPakistan shall continue to act as a responsible member of the international community. However, any act of Indian aggression or violation of Pakistanas sovereignty and territorial integrity will be met with an immediate and matching response. The onus of any escalation will rest squarely with the Indian leadership.a Ambassador Khan concluded that instead of aprovocative rhetoric,a India should focus on fulfilling its international obligations, particularly on issues of regional peace, counterterrorism and adherence to binding international treaties such as the Indus Waters Treaty.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}