{
  "article_id": "2025-08-22_e786bd832736c9a657a9a170a7858cd9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-strengthens-media-education-by-updating-curriculum/",
    "retrieved_at": "2025-08-23T07:58:21.742Z"
  },
  "metadata": {
    "title": "AIOU strengthens media education by updating curriculum",
    "author": null,
    "date_published": "2025-08-22T11:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 399,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 22 (APP):Keeping in view the evolving demand of media industry, Allama Iqbal Open University (AIOU) strengthened media education, bringing updates to the curriculum and launching new program. According to press release, AIOU has approved the launch of a new BS (Face-to-Face) Media and Communication Studies program along with 10 certificate courses. This decision was made in a meeting of the \"Committee of Courses of the Department of Mass Communication\" held here on Friday under the chairmanship of the head of department, Dr. Bakht Rawan. Along with this, amendments were also made in the already running BS, MPhil and PhD programs in accordance with the policies of the Higher Education Commission (HEC) and the recommendations of the National Curriculum Review Committee (NCRC). The Committee also formally approved the new course outlines for all three levels (BS, MS, and PhD). The Dean, Faculty of Social Sciences, Professor Dr. Abdul Aziz Sahir, also attended the meeting. He appreciated the services of the department of mass communication, saying that I congratulate the Head of Department, Dr. Bakht Rawan and his team for including contemporary courses and launching new programs. \"This development will prove to be a guarantee of success for students in the professional field,\" he said. He further stated that the participation of the Vice Chancellor of Gomal University, Professor Dr. Zafar Iqbal, was commendable and would help promote collaboration between educational institutions. Professor Dr. Zafar Iqbal showed deep interest in the proceedings of the committee, played an active role and presented several important and forward-looking suggestions which were highly appreciated by the members of the Committee. Other external experts present at the meeting included Professor Dr. Zafar Iqbal (Vice Chancellor, Gomal University, Dera Ismail Khan), Professor Dr. Noshina Saleem (Chairperson, Department of Communication and Media Research, Punjab University), and Professor Dr. Zahid Yousaf (Dean, Faculty of Arts, University of Gujrat). On this occasion, Director Academic Planning and Course Production, Dr. Zahid Majeed, provided detailed guidance to the Committee regarding the University's policies and academic development. At the beginning of the meeting, Head of the Department of Mass Communication, Dr. Bakht Rawan, said: \"In view of the rapid development of media and its changing requirements, curriculum reforms are the need of the hour. Our objective is to equip students with modern media technology, research, and professional skills so that they can become more effective and productive in the professional field.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}