{
  "article_id": "2025-08-22_f2555717dea7f0db85f9297391b34e8c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/islamabad-to-get-two-bin-three-bin-waste-collection-system/",
    "retrieved_at": "2025-08-23T07:57:37.096Z"
  },
  "metadata": {
    "title": "Islamabad to get two-bin, three-bin waste collection system",
    "author": null,
    "date_published": "2025-08-22T15:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 279,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 22 (APP): Capital Development Authority (CDA) has decided to introduce new bin models, stricter enforcement, and international-standard service providers to improve cleanliness across the federal capital. The decision was taken at a high-level meeting chaired by CDA Chairman and Chief Commissioner Islamabad, Muhammad Ali Randhawa, at CDA Headquarters on Friday. Senior CDA members, including those from administration, engineering, planning, and environment, along with directors of solid waste management and other officers, attended the session. According to the briefing, Islamabad has been divided into two operational packages: one covering sectors and urban zones (1, 2, and 3) and the other comprising rural areas (Zones 4 and 5). A two-bin waste collection system will be introduced in residential areas, while a three-bin system will be implemented in commercial centers and markets after a feasibility study. Randhawa directed officials to speed up the formal bidding process for selecting waste management companies, stressing transparency and open competition. \"The bidding must be merit-based and attract financially sound national and international firms to ensure high-quality services,\" he said. The chairman further instructed that best practices from Punjab and other provinces be incorporated into Islamabad's model. He also emphasized enforcement, directing the introduction of fines for littering. Additional measures include the establishment of a Material Recovery Facility for sorting waste, segregation of green waste at the wholesale vegetable market, and a central control room for real-time monitoring of the new system. Randhawa underscored that the entire process must be completed swiftly to deliver tangible improvements for residents. \"The citizens of Islamabad deserve a high-quality, optimal cleanliness and waste management system, and it is our responsibility to ensure this is implemented without delay,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}