{
  "article_id": "2025-08-22_f3e65347ab643683365c873656c44a2f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nccia-pta-coordinating-to-curb-misuse-of-illegal-sims/",
    "retrieved_at": "2025-08-23T07:58:00.403Z"
  },
  "metadata": {
    "title": "NCCIA, PTA coordinating to curb misuse of illegal SIMs",
    "author": null,
    "date_published": "2025-08-22T14:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 198,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 22 (APP):The National Assembly Standing Committee on Parliamentary Affairs, on Friday was informed that the National Cyber Crime Investigation Agency (NCCIA) has enhanced coordination with the Pakistan Telecommunication Authority (PTA) to curb the misuse of illegal SIMs. The meeting, chaired by MNA Rana Iradat Sharif Khan, was apprised that NCCIA is expanding its operational capacity. Members expressed concerns over financial crimes, fraudulent activities targeting the Benazir Income Support Programme (BISP), and security risks posed by cross-border radio transmissions. It was assured that NCCIA is actively working to strengthen safeguards against such vulnerabilities. The Committee resolved to hold a dedicated briefing on financial crimes in coordination with NCCIA and PTA in a future meeting. The Committee also considered \"The Election (Amendment) Bill, 2025,\" introduced by MNAs Shazia Marri and Syed Naveed Qamar. After substantive discussion, it deferred consideration of the Bill to allow further deliberations. The meeting was attended by MNAs Shaikh Aftab Ahmed, Raja Qamar-ul-Islam, Naveed Aamir, Sahibzada Sibghatullah, Mujahid Ali, Ali Muhammad, Hameed Hussain, Khurram Shahzad Virk (via Zoom), Shazia Fareed, and Naeema Kishwar Khan, along with the Secretary, Ministry of Parliamentary Affairs, senior officials of the Ministry, and the Election Commission of Pakistan (ECP).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}