{
  "title": "AIOU holds admissions’ test of its M.Phil and Ph.D programs",
  "author": null,
  "content": "ISLAMABAD, Mar 03 (APP):Under the directive of Vice Chancellor Professor Dr. Nasir Mehmood, the admission tests for MPhil and PhD programs offered in the Spring 2025 semester were conducted at the main campus of Allama Iqbal Open University(AIOU), as well as at its regional offices in Quetta, Karachi, Multan, and Gilgit-Baltistan.\nThe primary objective of this initiative was to facilitate local candidates who were unable to travel long distances.\nAccording to details, the Directorate of Regional Services, in collaboration with the Board of Advanced Studies and Research (BASR) and relevant faculties, conducted online monitoring of the admission tests from February 24 to February 27, 2025, ensuring transparency in the process.\nTo enhance efficiency, coordination meetings were held at the Directorate of Regional Services, and pre-test arrangements were completed under the supervision of Deputy Director Regional Services (DDRS) Dilawar Sultan.\nTo ensure a fair testing environment, CCTV cameras were installed in the test halls, and continuous monitoring was carried out for three days from the Council Hall of the Directorate of Regional Services.\nAdmission tests were conducted for various faculties, including the Faculty of Education, Faculty of Social Sciences and Humanities, Faculty of Arabic and Islamic Studies, and Faculty of Sciences.\nDirector General of Regional Services, Dr. Malik Tauqeer Ahmad Khan, appreciated the entire process and acknowledged the efforts of all stakeholders in ensuring the successful organization of the admission tests.\nAdditionally, he expressed gratitude to the Vice Chancellor, Professor Dr. Nasir Mehmood, for his trust and support in the directorate and regional network.\nA total of 158 candidates participated in the admission tests, comprising 25 PhD and 133 MPhil applicants.\nThis initiative marked a significant milestone in making higher education more accessible to students from different regions, reinforcing the institution’s commitment to academic excellence and inclusivity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:18:58.846Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/aiou-holds-admissions-test-of-its-m-phil-and-ph-d-programs/",
  "dateList": "2025-03-03",
  "date_published": "2025-03-03T11:59:00.000Z"
}
