{
  "title": "PBM to confer 50 each scholarships to five universities of Sindh",
  "link": "https://www.app.com.pk/national/pbm-to-confer-50-each-scholarships-to-five-universities-of-sindh/",
  "date_published": "2021-06-18T11:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): The Pakistan Bait-ul-Mal (PBM) would confer annual scholarships to 50 deserving postgraduate students of five major universities of Sindh province.\nPBM Managing Director Malik Zaheer Abbas Khokhar inked the agreements with the vice chancellors of Mehran University of Engineering and Technology, Sindh University, Liaquat University of Medical and Health Sciences, Government College University and NUML University for awarding scholarships to the deserving students.\nAddressing the signing ceremonies, the PBM managing director said that, under the Prime Minister’s Ehsaas Programme, all possible steps were being taken to keep the deserving but promising students of the country on their educational journey by removing financial barriers to their education.\nOn the occasion of his visit to Sindh Province, Malik Zaheer Abbas Khokhar also inaugurated a ‘Panahgah’ in Asia’s largest slum area Orangi Town, and one ‘Panahgah’ in Korangi. He also inaugurated a ‘Panahgah’ for the needy persons of Hub, Lasbela in Balochistan province as well.\nThe PBM managing director along with PBM Board Member from Sindh, Hunaid Lakhani also met with the Chairman Saylani Welfare Trust, Muhammad Bashir Farooqi.\nThe PBM managing director, applauding the humanitarian services of the trust, thanked the chairman for joining Prime Minister’s Ehsaas program. The commitment was also reiterated to ensure the provision of hygenic food in ‘Panahgah’ centers.\nOn this occasion, Malik Zaheer Abbas Khokhar also attended the award ceremony as a special guest at the educational institution of Saylani Welfare Trust and distributed certificates among the students who secured prominent positions.",
  "retrievedAt": "2025-08-11T20:51:42.004Z"
}
