{
  "title": "Power Division, GIZ Pakistan sign IA to unveil REEE II project",
  "link": "https://www.app.com.pk/national/power-division-giz-pakistan-sign-ia-to-unveil-reee-ii-project/",
  "date_published": "2021-06-18T07:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): A new implementation agreement (IA) between GIZ Pakistan and the Ministry of Energy (Power Division) signed here Friday to unveil the Pakistani Renewable Energy and Energy Efficiency II (REEE II) 8.1 million Euros project.\nUnder the agreement, GIZ Pakistan will conduct the so-called Renewable Energy and Energy Efficiency (REEE II) project that will provide technical support to the Ministry of Energy –(Power Division) and its associated Alternative Energy Development Board (AEDB), said a press release.\nThe project aimed at contributing effectively to the energy transition in Pakistan.\nThe 8.1 million Euro project is commissioned by the German Federal Ministry for Economic Cooperation and Development (BMZ).\nDuring the ceremony, Secretary Power Division, Ali Raza Bhutta, and Tobias Becker, Country Director GIZ Pakistan, reiterated the commitment to strengthen their cooperation.\nCEO AEDB, Shah Jahan Mirza, and other notables from both sides were present on the occasion.\nSpeaking on the occasion, Ali Raza Bhutta said, “A major milestone in the energy transition in Pakistan is the new Renewable Energy Policy approved by Council of Common Interest in August 2020 the Alternative and Renewable Energy (ARE) Policy.\nThe policy aims for a substantial shift in the power generation capacity to RE sources, moving from a current 6% to 20% by 2025 and 30% by 2030”.\nHe emphasized on building the capacity of Pakistan’s RE & energy efficiency related organization.\nHe also appreciated GIZ to cooperation in adopting best energy efficiency practices while learning from German experience.\nHe expressed the desire that the current cooperation between GIZ and Ministry of Energy would go a long way towards improving Pakistan’s utilization of its great renewable energy potential.\nTobias Becker said that this intervention would support the increased deployment of clean energy technologies. It will promote distributed solar PV power plants connected to the electricity grid, as well as the rural electrification strategy of the country.\nHe also emphasized the importance and contribution of Pakistan-German Renewable Energy Forum (PGREF).\nThe REEE II project responds to the national priority area of the Government of Pakistan, i.e, The Alternative and Renewable Policy 2019 and National Energy Policy 2021.\nThrough bilateral cooperation agreements, Germany and Pakistan have been working together to address the impacts of climate change and to ensure access to affordable, reliable and sustainable energy. In line with this, the Pakistan-German Renewable Energy Forum (PGREF) will continue to serve as a connecting bridge between both countries, implementing concrete actions and providing technical advice to enhance collaboration, promote dialogue, facilitate investment and exchange knowledge.\nGIZ Pakistan shares a cordial relationship in development cooperation with the Government of Pakistan for over 60 years. It has been a key partner in supporting the GoP to achieve its national priority policies since the 1960s in different development sectors.",
  "retrievedAt": "2025-08-11T20:51:43.784Z"
}
