{
  "title": "Pakistan resolves to deepen ties with Niger, promotes “Engage Africa” initiative",
  "link": "https://www.app.com.pk/national/pakistan-resolves-to-deepen-ties-with-niger-promotes-engage-africa-initiative/",
  "date_published": "2021-06-18T18:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): Foreign Secretary Sohail Mahmood Friday said that Pakistan was resolved to deepen cooperation with the African continent underpinned by enhanced diplomatic footprint with economic and commercial engagement, under Prime Minister Imran Khan’s “Engage Africa” Initiative.\nDuring a meeting with Niger’s Ministers for Industry and Investment, Gado Sabo Moctar and Zakari Wargo Boubacar at the Foreign Office, the foreign secretary expressed satisfaction at the close brotherly ties between the two countries, marked by common faith, convergence of views and shared perspectives.\nWide-ranging discussions were held on Pakistan-Niger bilateral relations and issues of common interest, a Foreign Office statement said.\nOn behalf of Pakistan’s leadership and the foreign minister, the foreign secretary extended cordial greetings to the newly elected president and the people of Niger and congratulated the delegation on the historic democratic transition of power.\nUnderling Pakistan’s resolve to deepen and broaden Pakistan-Niger fraternal cooperation in all dimensions, the foreign secretary stressed the importance of regular exchanges at the leadership, ministerial, business and people-to-people levels.\nThe foreign secretary expressed gratitude to the government of Niger for its support at 47th Session of Council of Foreign Ministers (CFM) in Niamy, for the people of Indian Illegally Occupied Jammu & Kashmir.\nHe also thanked Niger for its contributions as member of the OIC Contact Group on Jammu and Kashmir.\nBoth sides expressed satisfaction on signing of bilateral agreements for supplying Pakistani tractors, motorcycles, pharmaceuticals, seeds and pesticides.\nThe foreign secretary expressed the hope that the delegation’s visit to Pakistan would provide basis to further reinforce an already growing Pakistan-Niger economic partnership.\nThe delegation is on a week-long visit to Pakistan in which they would visit Lahore, Islamabad and Karachi to have interactions with ministers, senior officials and business enterprises.\nThis is the first visit by a Niger ministerial delegation to Pakistan since the new government assumed office in Niamey in April 2021.",
  "retrievedAt": "2025-08-11T20:51:34.971Z"
}
