{
  "title": "EU welcomes Pakistan’s engagement with FATF for different issues",
  "link": "https://www.app.com.pk/national/european-union-eu-welcomed-the-progress-made-by-pakistan-implementation-financial-action-task-force-fatf/",
  "date_published": "2021-06-18T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 18 (APP): European Union (EU) on Friday welcomed the progress made by Pakistan in the implementation of the Financial Action Task Force (FATF) and it’s commitment to continue the engagement with the FATF to address all of the remaining issues.\nEU also appreciated Pakistan’s efforts towards full implementation of the 27 international conventions stipulated under the EU’s unilateral trade preferences scheme, the Generalised Scheme of Preferences Plus (GSP+).\nThe EU and Pakistan agreed to enhance bilateral trade, investment for improving the business climate.\nA meeting of Pakistan-European Union Joint Commission was held here at EU Commission Office.\nA meeting of Pak-EU Joint Commission was co-chaired by Gunnar Wiegand, Managing Director for Asia and the Pacific in the European External Action Service, and Noor Ahmed, Secretary of Economic Affairs Division, however, representatives of relevant ministries of the government of Pakistan, the European Ambassador to Pakistan, Pakistan’s Ambassador to the EU and observers from EU Member States were also participated in the meeting.\nThe Joint Commission aimed to provide an opportunity to deliberate and exchange views on all existing areas of cooperation between the EU and Pakistan.\nDuring the meeting, they have discussed the long-term socio-economic impact of the COVID-19 pandemic and ongoing vaccination cooperation between EU and Pakistan for wiping out the pandemic, besides appreciating Pakistan’s efforts for sustainable economic recovery after pandemic.\nThey have also exchanged views on climate change, where the EU informed Pakistan about the European Green Deal, connectivity and digitalisation.\nFrom Pakistan’s side, the delegation briefed about various ongoing climate projects, including eco-system restoration, green stimulus and national electric vehicle policy. They also discussed cooperation in the fields of education, culture, science and technology.\nWhile recalling the joint declaration on Afghanistan during the 5th session of the Pakistan-EU Strategic Dialogue, the EU and Pakistan reaffirmed their strong support for an Afghan-led and Afghan-owned peace process and encouraged the stakeholders to resume negotiations in earnest to achieve lasting peace and stability in Afghanistan.\nThe EU has also appreciated Pakistan’s hosting of millions of Afghan refugees for past two decades and assured Pakistan of its cooperation and ongoing work towards a durable solution, including through assisting and promoting the safe and dignified return of Afghan refugees to their homeland.\nPakistan briefed the EU on the recent developments in the region and reiterated its concerns regarding the human rights and humanitarian situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nReported By Shabbir Hussain\nAPP, Digital News Service",
  "retrievedAt": "2025-08-11T20:51:37.750Z"
}
