{
  "article_id": "2025-09-04_9bef96ee9a8ab948ca4f7eb0172a08bc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/court-adjourns-pre-arrest-bail-petitions-of-9-accused-in-app-mega-corruption-case/",
    "retrieved_at": "2025-09-06T10:54:50.771Z"
  },
  "metadata": {
    "title": "Court adjourns pre-arrest bail petitions of 9 accused in APP mega corruption case",
    "author": null,
    "date_published": "2025-09-04T08:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 668,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 04 (APP):A special court on Thursday adjourned the hearing till September 16, on pre-arrest bail petitions of nine accused named in the multi-million rupees corruption scandal in the national news agency Association Press of Pakistan Corporation (APP). Special Judge Central Humayun Dilawar heard the interim bail petitions of nine accused. During the hearing of the case, APP's legal advisor, Khurram Baig appeared in the court and took the position that our preparations are complete and we want to argue on the petitions. Three lawyers including Khurram Baig Advocate and Hasnain Haider Thahim submitted their power of attorney to the court on behalf of APP. The court marked the attendance of all the accused. The accused who appeared included former APP Executive Director Adnan Akram Bajwa, former account managers Imran Munir, Sajid Ali, former in-charge audit Tahir Ghuman, former assistant manager budget Murtaza, Khurram Shahzad, former secretary to MD Ejaz Maqbool, Idrees Chaudhry, and Shahid Latif. On the occasion, the judge inquired whether the lawyers of all the accused were present. On this, a lawyer told the court that some lawyers were busy in the High Court. On which, the judge Humayun Dilawar expressed his annoyance and remarked that \"no excuse will work, if the lawyer of any accused is absent in the future, I will reject the bail in a minute.\" Adnan Akram Bajwa's lawyer requested the court to hear his client's plea separately; however, the court clarified that all the bail petitions would be heard simultaneously. The judge remarked that this is not a retail shop, I will not listen to the arguments one by one, all the lawyers should come prepared, and I will not tolerate frivolity. During the hearing, the lawyer of the accused Khurram Shahzad took the position that he was not aware of the charges against his client. On which the court directed FIA investigation officer Muhammad Junaid to inform the accused of the charges. Investigation officer Muhammad Junaid told the court that accused Ijaz Maqbool, as a former Secretary to MD, illegally received cheques of Rs 750,000 and Rs 200,000, of which there is no record of official use. Accused Khurram Shahzad cashed a cheque of Rs 22.7 million from the salary credit sheet. More than Rs 7.9 million was transferred to the personal account of accused Murtaza, while millions of rupees were deposited in another account. Accused Imran Munir was a former manager account. During his tenure on the post, cheques of Rs 1.8 million, 2 million, 1.78 million and 1.47 million were illegally cashed, of which there is evidence of embezzlement. Accused Sajid Ali was also a former manager account. During his tenure, Rs 22.7 were transferred from the Provident Fund, while cheques worth more than Rs 9.8 million were also issued illegally. Accused Shahid Latif is accused of transferring pension funds to the accounts of serving employees, thus causing irreparable loss to the corporation's funds. Accused Tahir Ghuman, as the in-charge of audit, could not fulfill his responsibility. Every cheque issued should be checked against the ledger and the payment from the government bank account and the approved amount should be mutually the same. An FIR was registered against him for failure to fulfill official duties and facilitation. The investigation officer of the case, Muhammad Junaid, told the court that former Executive Director Adnan Akram Bajwa was responsible to monitor the financial affairs of the institution but he failed to fulfill it due to which the financial matters were not only mismanaged but also provided free opportunities for loot to the co-accused. On this occasion, the learned judge ordered that the hearing of the pre-arrest bail petitions of all the accused will be held together on September 16, and all the lawyers will come with case preparations. The bail will be rejected in case of absence. It should be noted that the FIA has registered a case against a total of 16 accused for embezzlement and corruption of millions of rupees in the national news agency APP.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}