{
  "article_id": "2025-09-04_239278e4b55287cccc2815f8134ab16c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/muqam-hands-over-huge-consignment-of-relief-goods-to-afghans-authorities/",
    "retrieved_at": "2025-09-06T10:54:09.339Z"
  },
  "metadata": {
    "title": "Muqam hands over huge consignment of relief goods to Afghans authorities",
    "author": null,
    "date_published": "2025-09-04T11:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 333,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Sep 04 (APP): Federal Minister for States and Frontier Regions, Kashmir and Gilgit Baltistan Affairs, Engr Amir Muqam here Thursday handed over a huge consignment of relief goods to Afghans authorities for assistance of the earthquake victims. On the direction of Prime Minister Muhammad Shehbaz Sharif, Federal Minister Engr Amir Muqam went to Torkhum border in Khyber tribal district where he delivered huge consignment relief goods containing necessary daily use items, food and medicines to authorities of Afghanistan for earthquake victims. Talking to media persons, Engr Amir Muqam said that the people and government of Pakistan stand with Afghans brothers and sisters in these hours of difficulty and this massive relief package was aimed to help the earthquake victims. At least 1469 people in Afghanistan were killed and around 3700 injured besides nearly five million affected in eastern Afghanistan when a 6 magnitude quake struck it on Sunday, collapsing mud-brick homes on sleeping families. He said Prime Minister Muhammad Shahbaz Sharif has expressed deep condolences and sorrow over loss of lives and properties during the earthquake in Afghanistan. On the Prime Minister's directions, Engr Amir Muqam said the relief goods consignment was handed over to Afghans authorities at Torkham border that connects Pakistan and Afghanistan. Soon after the powerful earthquake, the Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar talked to his Afghan counterpart and assured every possible assistance and support. He said Pakistan has also suffered colossal losses due to natural calamities including foods that wreaked havoc first in Khyber Pakthunkhwa and later Gilgit Balistan and Punjab province. Besides loss of lives and properties due to floods, he said that livestock, agriculture products, and communication infrastructure including roads and bridges were largedly affected in Pakistan. Engr Amir Muqam appreciated the support of national building departments including NGOs and philanthropists organizations for assistance of flood victims. Besides representatives of National Disasters Management Authority (NDMA), Pakistani Consul General at Jalalabad Shafqatullah and Afgan Consul General at Peshawar Hafiz Mohibullah were also present.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}