{
  "article_id": "2025-09-04_8e43356f86b0b4b387374745525ea717",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/three-commodores-promoted-to-rank-of-rear-admiral/",
    "retrieved_at": "2025-09-06T10:53:46.464Z"
  },
  "metadata": {
    "title": "Three commodores promoted to rank of Rear Admiral",
    "author": null,
    "date_published": "2025-09-04T13:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 423,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 04 (APP): Commodore Muhammad Shahnawaz Khan, Commodore Asim Sohail Malik and Commodore Sohail Ahmad Azmie of Pakistan Navy have been promoted to the rank of Rear Admiral. According to a press release of Directorate General Public Relations (Pak Navy), Rear Admiral Muhammad Shahnawaz Khan was commissioned in Supply Branch of Pakistan Navy in 1993. The Flag Officer is a graduate of Pakistan Navy War College, Lahore and National Defence University, Islamabad. The Admiral has an illustrious career covering vast experience of various Command and Staff appointments including Commanding Officer General Stores Depot, Commanding Officer PNS RAZA, Director Procurement (Navy), Directing Staff PN War College at Lahore, Director Pay, Pension & Accounts and Assistant Chief of Naval Staff (Education) at Naval Headquarters. The Admiral is currently serving as DG Munitions Productions (DGMP) at Ministry of Defence Productions Islamabad. Rear Admiral Asim Sohail Malik was commissioned in Operations Branch of Pakistan Navy in 1995. The Flag Officer is a graduate of Pakistan Navy War College, Lahore and National Defence University, Islamabad. He has also done Defence Services Command & Staff Course from Bangladesh, Defence & Strategic Studies Course and Masters in operational research & analysis from China. The Admiral has an illustrious career covering vast experience of various Command and Staff appointments including Commanding Officer PNS ZARRAR and PNS SHAMSHEER, Commander 9 Auxiliary and Mine Warfare Squadron, and Chief Staff Officer to Commander Pakistan Fleet. He served at Naval Headquarters as Director Operational Research, Director Naval Operations, and Assistant Chief of Naval Staff (Operational Plan). The officer has also served as Commander Combined Task Force 150 at Headquarters Combined Maritime Forces (CMF) Bahrain. The officer is currently serving as DG C4I at Naval Headquarters Islamabad. Rear Admiral Sohail Ahmad Azmie was commissioned in Operations Branch of Pakistan Navy in 1996. The Flag Officer is a graduate of Britannia Royal Naval College Dartmouth, UK, Pakistan Navy War College, Lahore and National Defence University, Islamabad. The Admiral has an illustrious career covering vast experience of various Command and Staff appointments including Directing Staff at PN War College, Commanding Officer of PNS NASR, Commander AUXMIN - 9 Squadron, Commandant Pakistan Naval Academy and Assistant Chief of Naval Staff (Operational Plans) at Naval Headquarters. The Admiral also served as Commander Combined Task Force 151 at HQ Combined Maritime Forces (CMF) Bahrain and Deputy Commandant Pakistan Navy War College. He is currently serving as Commander Central Punjab and Commandant Pakistan Navy War College Lahore. In recognition of their meritorious services, the Flag Officers have been awarded Sitara-i-Imtiaz (Military).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}