{
  "article_id": "2025-09-04_1046a913a8189dfd3bfe50404d8682dd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-to-continue-political-moral-diplomatic-support-for-palestine-sardar-yousaf-2/",
    "retrieved_at": "2025-09-06T10:53:15.130Z"
  },
  "metadata": {
    "title": "Pakistan to continue political, moral, diplomatic support for Palestine: Sardar Yousaf",
    "author": null,
    "date_published": "2025-09-04T15:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 309,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, September 04 (APP): Federal Minister for Religious Affairs and Interfaith Harmony, Sardar Muhammad Yousaf on Thursday reiterated Pakistan's firm political, moral, and diplomatic support for Palestine during a meeting with a four-member delegation led by Palestinian Supreme Judge, Dr. Mahmoud Sidqi Abdul Rahman Al-Habbash. The Palestinian delegation, which also included the Imams of Al-Aqsa Mosque and the Ibrahimi Mosque, expressed deep sorrow over the loss of lives and property in Pakistan's flood-hit areas. Sardar Yousaf strongly condemned the ongoing massacres in Gaza, calling them grave violations of humanity and sanctity. He stressed that support for the Palestinian cause transcends religion, ethnicity, or culture, describing it as a fundamental human and moral responsibility. He reaffirmed Pakistan's resolve to stand by Palestine under all circumstances, noting that on Prime Minister Shehbaz Sharif's directives, humanitarian aid was being dispatched to Gaza. Dr. Al-Habbash thanked Pakistan for consistently raising its voice against Israeli aggression and expressed hope that several countries would recognize Palestine as an independent and sovereign state within the month. \"The day is near when the leaders of the Muslim Ummah will gather at Al-Aqsa Mosque to offer prayers of gratitude,\" he said. Both sides agreed to work together on promoting dialogue and exchanges among religious scholars to further strengthen ties and cooperation. Meanwhile, Bangladesh's Advisor to the President on Religious Affairs, A.F.M. Khalid Hussain, arrived in Islamabad to attend the 50th International Seerat-un-Nabi Conference. He was warmly received at the airport by Federal Secretary for Religious Affairs, Dr. Syed Atta-ur-Rehman along with Bangladeshi High Commissioner to Pakistan, Md. Iqbal Hussain Khan. The Bangladeshi advisor will remain in Pakistan for nine days, during which he will hold multiple meetings and participate in the international conference, which focuses this year on: \"State Responsibilities in Educating for the Positive Use of Social Media in the Light of Seerat-un-Nabi (Peace Be Upon Him).\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}