{
  "article_id": "2025-09-04_894b77dd0ec19427c172e71f4ac1f479",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/iesco-on-high-alert-to-ensure-power-supply-during-possible-rains-flooding/",
    "retrieved_at": "2025-09-06T10:55:15.715Z"
  },
  "metadata": {
    "title": "IESCO on high alert to ensure power supply during possible rains, flooding",
    "author": null,
    "date_published": "2025-09-04T17:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 259,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 04 (APP):Islamabad Electric Supply Company (IESCO) has placed its field formations on high alert in view of possible rains and flooding in streams and nullahs, Chief Executive Officer Engineer Chaudhry Khalid Mahmood said on Thursday. In line with directions from the Government of Pakistan and the Ministry of Energy (Power Division), the IESCO chief chaired a meeting where necessary instructions were issued to field formations to ensure uninterrupted power supply in the IESCO region during possible rains and flooding in nullahs, timely clearance of system faults, and controlling any potential damage to the system, said a press release. He directed the line staff to strictly follow safety principles 100% during work, while field officers were instructed to remain in full coordination with the district administration and the National Disaster Management Authority (NDMA). Engineer Khalid Mahmood said that uninterrupted electricity supply to valued consumers is our foremost responsibility, and IESCO officers and staff have always proved their professional capabilities in every situation. He also directed the Chief Engineer Material Management to ensure provision of additional electricity poles, wires, meters, transformers, and other required material to field offices in case of any emergency situation. The IESCO Chief informed that from the Central Control Room in Islamabad, all 132 kV grid stations, feeders, and power transmission are being monitored 24 hours. The Operations, Construction, GSO, and GSE formations are working with complete coordination under a joint strategy and action plan. Engineer Khalid Mahmood also visited to different offices and directed that complaint offices and customer facilitation centers remain fully functional.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}