{
  "title": "President directs SNGPL to rectify gas bill, apologize to consumer",
  "link": "https://www.app.com.pk/national/president-directs-sngpl-to-rectify-gas-bill-apologize-to-consumer/",
  "date_published": "2023-06-24T07:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 24 (APP): President Dr Arif Alvi has directed the Sui Northern Gas Pipelines Ltd (SNGPL) to rectify the gas bill of a consumer and apologize to him as he had been wrongly billed for two solar geysers instead one at his residence.\nThe contractor had wrongfully mentioned the installation of two geysers in forms, provided his own contact number to manipulate the verification process, submitted the documents to the SNGPL office and then absconded after committing fraud, President Secretariat Press Wing said in a press release on Saturday.\n“It is shameful that the management is ignoring corruption within SNGPL and harassing the members of the public. Rather than investigating its contractor, SNGPL is further burdening the public because of its incompetence and connivance by defending its illegal action. An inquiry must be done and persons involved be brought to justice”, president ordered while rejecting a representation filed by SNGPL against a decision of the Wafaqi Mohtasib.\nAs per the details, Tahir Hussain (the complainant) had lodged a complaint with Wafaqi Mohtasib saying that an SNGPL official installed one solar geyser in his house and told him that the payment for the geyser would be claimed in installments in bills.\nThe SNGPL, however, issued him the bill with two solar geysers. He visited the office where he was told that, as per documents, two geysers were installed at his residence.\nHe was informed by the SNGPL’s Supervisor that the contractor (Shafqat), who had installed the geyser, had absconded after committing fraud.\nHe contacted the police who did not intervene in the matter saying that it was an internal issue of the Sui Gas staff and the contractor.\nFeeling aggrieved, he approached Mohtasib who directed SNGPL to take corrective measures for the rectification of maladministration and correct the bill amount in line with the prescribed procedure. The president rejected the representation and upheld Mohtasib’s observation that the contractor could not have committed fraud without the connivance of the Sui gas staff, and if he had done so, SNGPL would have proceeded against him, which was not the case.\nHe noted that SNGPL’s representative defended the illegal action without going into the details of the case which was its prime responsibility.\nHe further observed that SNGPL failed to follow its own procedure and had billed the complainant arbitrarily in violation of the law and the prescribed OGRA rules.",
  "retrievedAt": "2025-08-11T08:47:03.314Z"
}
