{
  "title": "Steady progress underway to establish Minerals & Natural Resources University in Balochistan",
  "link": "https://www.app.com.pk/national/steady-progress-underway-to-establish-minerals-natural-resources-university-in-balochistan/",
  "date_published": "2021-04-18T09:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):Students of Balochistan provinces would soon have a full-fledged university to get higher education in the field of minerals and natural resources as the authorities concerned are making steady progress on the project.\nThe ‘Umer Khan Sanjrani Minerals and Natural Resources University’ would be established in Nok Kundi, Chaghi area of the provin\nce on 500 acres of land, a senior official aware of the project developments told APP.\nHe said the PC-II of the university project had already been approved by the Central Development Working Party (CDWP), while services of a consultant were hired for the feasibility study of the construction work.\nThe consultant, hired through the tendering process, had been given the task of completing the feasibility of the project at the earliest after visiting the site, reviewing the nature of the construction work and other related matters.\nFollowing the feasibility study,  the Project Review Report and final report about the commencement of the construction work were scheduled to be submitted before the quarters concerned.\nThe university, he said, would prove to be a milestone in imparting quality education and producing skilled youth in the field of minerals.\nReplying to a question, the official said the federal government was also working on an effective strategy to identify the unexplored potential of the minerals that existed in Balochistan province, which possesses a variety of valuable ore resources.\nAccordingly, he said, an approval had recently been granted for setting up a new public sector company in the province to accelerate minerals’ exploration activities, besides giving a task to the Geological Survey of Pakistan (GSP) to map 50 Toposheets of ‘outcrop area’ to identify hidden resources in Balochistan.\n“The new entity titled ‘Balochistan Mineral Exploration Company Limited (BMEC)‘ will be a joint venture of the Federal and Balochistan governments with 10 per cent and 90 per cent shares respectively.”\nHighlighting the company prospects, he said a part of continental-scale Tethyan Copper Belt was located in Chaghi district of the province that had tremendous economic mineral potential as “a number of promising ore deposits including of copper (along with associated gold and silver), iron, lead and zinc have already been discovered.”\nThis year, the official said, the federal government had allocated Rs20 million in the Public Sector Development Programme (PSDP 2020-21) for geological mapping of the 50 Toposheets, out of 354 unmapped Toposheets of Balochistan.\nThe geological maps provide a bird’s eye view of the surface and (subsurface) distribution of various types of rocks and economic minerals that are found in a particular region.\nThrough the mapping, the GSP wanted to maintain a database for future exploration of the occurrences of metallic and non-metallic minerals potential, dimension stones, aggregates and limestone reserves for the industry at a total cost of Rs127.595 million during a three-year period.\n“These maps are essential for all future detailed geological works including, minerals’ exploration, civil engineering, soil surveys, land use, town planning, groundwater, earthquake hazards; environmental geology and soil conservation projects,” the GSP said in the project detail.\nWorldwide experience suggests that geological maps of 1:50,000 scale provide the most useful information and meet the basic requirements of the majority of the demands, involving research in ‘stratigraphy’, structure & tectonics, sample collection for laboratory studies, mineral evaluation and identification of promising areas for further exploration of natural resources.\nThe total outcrop area of Balochistan is 335,360 Square Kilometers (524 Toposheets) out of which 108,800 Sq Km. (170 Toposheets) have been mapped and published on 1:50,000 scale and the maps are available.",
  "retrievedAt": "2025-08-11T20:38:16.791Z"
}
