{
  "title": "No negotiations underway with TLP: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/no-negotiations-underway-with-tlp-sheikh-rashid/",
  "date_published": "2021-04-18T14:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Minister for Interior Sheikh Rashid Ahmed on Sunday said the government was not negotiating with the outlawed Tehreek-i-Labbaik Pakistan (TLP) and no one would be allowed to challenge the writ of the government.\n“No negotiation process is underway with the TLP. We have been trying to reach a consensus with them for the past two months but they are not ready to compromise on\ntheir demands,” he said while talking to media here on Sunday.\nHe explained when an organisation was proscribed, bank accounts and identity cards of its stakeholders were blocked and their movement was restricted.\nRegarding blockage of roads and highways across the country by the supporters of the proscribed organization, the minister said 192 locations across the country had been sealed by the banned outfit, out of which 191 had been cleared.\n“The situation is a bit tense at Yateem Khana Chowk in Lahore where the Jamia Masjid Rahmatul Lil Alameen is located,” he said adding, “Currently, all roads including the GT Road and the Murree Expressway are open for traffic”.\nThe minister said the GT Road and all main arteries of the country would remain open on April 20.\nThe minister was referring to the date as the banned outfit had planned a protest on April 20 over the alleged non-fulfillment of their demands.\nThe minister said blasphemy was unacceptable and Imran Khan also gave the message to the world that disrespect towards the prophet would not be tolerated.\nThe Interior Minister said TLP would be completely banned by April 20 and the government might make a decision regarding disbanding the party. “If this happens, the law ministry and Attorney General Farogh Naseem will be working on this and a reference will be filed.”\nThe policemen were martyred in violent activities while some person on their sides also lost lives, he said adding that no one would be allowed to challenge the writ of the government.\nResponding to a question, the minister hoped that Mr. Tareen would not deflect\nfrom the Pakistan Tehreek-e-Insaaf.\nEarlier, Sheikh Rashid conducted the visit of Sasta Ramadan Bazaar in sector G-7/2.\nHe said ten bazaars were set up by Capital Development Authority (CDA) and five by district administration during Ramadan.\nMoreover, he said 25 mobile bazaars were also operation in the holy month to provide relief to people",
  "retrievedAt": "2025-08-11T20:38:13.905Z"
}
