{
  "title": "Mazari asks Dutch lawmaker to educate himself on ‘freedom of speech’",
  "link": "https://www.app.com.pk/national/mazari-asks-dutch-lawmaker-to-educate-himself-on-freedom-of-speech/",
  "date_published": "2021-04-18T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Federal Minister for Human Rights Dr Shireen Mazari has asked Geert Wilders, far-right Dutch lawmaker and chairman of the Party for Freedom (PVV), to educate himself on freedom of speech as even Article 10 of Europe Convention on Human Rights did not give absolute freedom of speech.\nThe minister said in a tweet addressing to @geertwilderspvv, official twitter account of Wilders, said: “Your fascism & hate-filled intent to violence has a questionable indulgence in Europe – given that even Article 10 of Europe Convention on Human Rights does not give absolute freedom of speech.\nTime to educate urself on “freedom of speech. But be clear on why we banned Tehreek-i-Labaik Pakistan.”\nPerhaps one day u & those of ur ilk will find a modicum of courage to apologise for your Islamophobic hate & abuse causing hurt to Muslims across the world incl your own Muslim fellow citizens & European Muslims. Bet that unsettled ur ignorant fascist mind! Ignorance breeds hate.\n— Shireen Mazari (@ShireenMazari1) April 17, 2021\n“Perhaps one day you those of your like will find a modicum of courage to apologise for your Islamophobic hate & abuse causing hurt to Muslims across the world including your own Muslim fellow citizens and European Muslims. Bet that unsettled your ignorant fascist mind! Ignorance breeds hate.”\nDr Mazari also tagged a tweet of Prime Minister Imran Khan: “Let me make clear to people here & abroad:\nOur govt only took action against TLP under our anti-terrorist law when they challenged the writ of the state and used street violence & attacking the public and law enforcers. No one can be above the law and the Constitution.”",
  "retrievedAt": "2025-08-11T20:38:12.645Z"
}
