{
  "title": "COVID-19 claims 149 lives, infects 6,127 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-149-lives-infects-6127-more-people/",
  "date_published": "2021-04-18T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):The national tally on Sunday of total active COVID-19 cases recorded 80,559 with 6,127 more people tested positive for the deadly virus and 4,527 people recovered from the disease during the last 24 hours.\nOne hundred and twelve corona patients have died during past 24 hours, 131 of whom were under treatment in hospital and 18 out of the hospital in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 149 deaths occurred in the last 24 hours 56 of them had died who were under treatment on ventilators.\nThe maximum ventilators were occupied in four major areas including Multan 81 percent, Mardan 60 percent, Gujranwala 88 percent and Lahore 80 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Swat 67 percent, Gujranwala 85 percent, Peshawar 73 percent and Gujrat 71 percent.\nAround 528 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Gilgit Baltistan (GB) and Balochistan.\nSome 71,836 tests were conducted across the country on Saturday, including 12,022 in Sindh, 44,626 in Punjab, 7,382 in Khyber Pakhtunkhwa (KP), 5,507 in Islamabad Capital Territory (ICT), 641 in Balochistan, 390 in GB, and 1,268 in AJK.\nAround 659,483 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 756,285 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 15,524, Balochistan 20,822, GB 5,176, ICT 69,556, KP 105,438, Punjab 267,572 and Sindh 272,197.\nAbout 16,243 deaths were recorded in country since the eruption of the contagion. Around 4,551 have perished in Sindh among six of them died in hospital and one out of hospital on Saturday.\n7,430 in Punjab had died with 97 deaths occurred in past 24 hours. 82 of them in the hospital and 15 out of hospital. 2,867 in KP where 33 of them died in hospital and two out of hospital on Saturday, 636 in ICT among five of them died in hospital on Saturday, 223 in Balochistan, 103 in GB and 433 in AJK among five of them succumbed to the deadly virus in hospital on Saturday.\nA total of 11,144,367 corona tests have been conducted so far, while 630 hospitals are equipped with COVID facilities. Some 5,285 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:38:16.032Z"
}
