{
  "title": "AJK President lauds UN report on human rights situation in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-president-lauds-un-report-on-human-rights-situation-in-iiojk/",
  "date_published": "2021-04-18T13:33:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Apr 18 (APP): Welcoming a letter written by the UN human rights experts to the Indian government regarding the human rights situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK), AJK President Sardar Masood Khan said that the situation is far worse than the human rights violations mentioned in the letter.\nHe said that the UN rapporteurs have confined their report to mentioning only the violation of some of the rights of Muslims and other minorities, while we believe that the Modi government of India is engaged in hatching conspiracies against the very existence of Muslims in Jammu and Kashmir, AJK President office said Sunday evening.\nThey want to turn the Muslim majority into a minority and make the territory of Kashmir a complete Hindu state, Khan added,\n“India is trying to reduce the occupied state of Jammu and Kashmir to a political nonentity, reinforce religious and colonial othering of its people and finally strip off their defences. Well, Kashmiris will never cease defending themselves,” the President said.\nFive United Nations human rights experts, through a letter to the Indian government, have voiced their concern over India’s decision to revoke Kashmir’s special status and enact laws that could curtail the political participation of Muslims and other minorities.\nThe special rapporteurs were for minority issues, promotion, and protection of the right to freedom of opinion and expression; the rights to freedom of peaceful assembly and association; contemporary forms of racism, racial discrimination, xenophobia and related intolerance; and the special rapporteur on freedom of religion or belief.\nPresident Masood strongly condemned the latest restrictions imposed by the Indian government on Kashmir based journalists for reporting facts about the incidents of violence in IOJK, he appealed to the global journalist’s bodies to raise their voice against the unjustified restrictions on journalists and media outlets in IOJK.\n“Voices for freedom won’t be muzzled; staged encounters won’t be masked by cutting off information. Truth is out; will be out. Don’t coerce media persons into not reporting on these crimes. Such restrictions betray insecurity and panic,” Khan said.\nHe said restrictions on independent reporting by journalists as an attempt by the Delhi government to infringe on human rights and freedom of expression. Sardar Masood added that journalists in Occupied Kashmir would never accept and endorse the Indian government’s illegal activities.\nSardar Masood Khan further said that now the situation in IOJK had reached the point that Indian military and para-military troops stationed in Kashmir have started disobeying the illegal orders.\nThe latest example of which is he female police officer who said that this is my Kashmir and I cannot be a part of the persecution against the people here. The female police officer’s bold statement cost lost her job.\n“The day is not far when cops and soldiers in Kashmir will start asking themselves how they would redeem their souls if they continue to be part of these killing sprees at the behest of fascists of a distant, foreign land,” the state President concluded.",
  "retrievedAt": "2025-08-11T20:38:14.648Z"
}
