{
  "title": "Shehbaz Sharif meets UN Secretary General, discusses climate change challenges",
  "link": "https://www.app.com.pk/national/shehbaz-sharif-meets-un-secretary-general-discusses-climate-change-challenges/",
  "date_published": "2023-06-22T11:48:00.000Z",
  "source": "APP",
  "content": "PARIS, Jun 22 (APP):Prime Minister Muhammad Shehbaz Sharif on Thursday met with United Nations Secretary General Antonio Guterres on the sidelines of Summit for New Global Financing Pact here and discussed the challenges of climate change being faced by the world especially Pakistan.\nThe prime minister warmly welcomed the UN Secretary General and expressed his best wishes for him. In response the Secretary General also expressed goodwill to PM Sharif.\nShehbaz Sharif told the UN Secretary General that he considered him the benefactor of Pakistan as “we cannot forget your help during the last year’s floods”.\nHe said the UN Secretary General was the witness of devastation caused by the climate change in the country.\nHe also informed the UN Secretary General about measures taken by the government for rehabilitation and reconstruction of the flood hit areas in Pakistan.\n“Reconstruction of the infrastructure affected by the floods and rehabilitation of the flood affected people is the government’s top priority,” he added.\nHe said due to the climate changes, financial burden on the developing countries has been increased manifold as they were facing new challenges to increase the economic growth and maintaining fiscal balances.\nPM Sharif urged to utilized the Loss and Damage Fund to provide financial assistance to the developing countries.\nThe summit in Paris for the New Global Financing Pact is a good start in the right direction, he added.\nHe said along with climate justice, a fair attitude is also required in the distribution of global financial resources with developing countries.\nThe UN Secretary General appreciated the commitment of the prime minister and his government for the rehabilitation of the flood victims.",
  "retrievedAt": "2025-08-11T08:46:19.301Z"
}
