{
  "title": "Pakistan Learning Conference concludes with plan to transform ECE",
  "link": "https://www.app.com.pk/national/pakistan-learning-conference-concludes-with-plan-to-transform-ece/",
  "date_published": "2023-06-22T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 22 (APP):The two-day Pakistan Learning Conference 2023: Building Foundations organized by the Ministry of Federal Education and Professional Training concluded on Thursday with a comprehensive action plan to transform Early Childhood Education (ECE) and foundational learning.\nThe diverse gathering of global educators, policymakers, and experts delved into crucial topics, fostering the development of a bright future for children.\nFederal Minister for Planning, Development and Special Initiatives Ahsan Iqbal congratulated the Education Ministry for addressing the crucial topic of Early Childhood Education (ECE) and foundational learning.\nHe emphasized that we were currently in an era of knowledge revolution, innovation, and creativity, and highlighted the significance of the first 1000 days of a child’s life as the most productive period for skill development.\nFurthermore, he stressed the importance of combining both formal and informal education within ECE and the strong connection that existed between early education and the nation’s progress.\nThe minister highlighted that a country’s future was reliant on the extent to which creativity and innovation were integrated into the classroom and laboratory.\nHe also emphasized the importance of fostering observational skills and critical thinking abilities in children.\nAhsan shared with the participants that a fund of Rs 25 billion had been established specifically for Out of School Children (OOSC) and added that a significant portion should be allocated for Early Childhood Education (ECE).\nHe provided reassurance on behalf of the Prime Minister, affirming the government’s unwavering commitment to ensuring that out-of-school children were enrolled in schools.\nSecretary Education, Waseem Ajmal Chaudhary talked about carrying the spirit of this conference forward through fostering innovation, inclusivity, and equity in early childhood education.\nHe spoke about translating the event into “Pakistan Learning Movement”.\nThe secretary said that with the movement, the education ministry could create an educational landscape to empower the children, equip them with essential skills, and nurture their curiosity and love for lifelong learning.\nHe informed that MoFEPT would receive feedback and inputs for aggressively contributing towards the movement.\nHe thanked all the international and national participants for their dedication to advancing early childhood education and foundational learning.\nHe also appreciated them for their commitment to shape a brighter future for children.\nBefore the closing session, Gailius Draugelis (World Bank Group), Jo Moir (FCDO), Salman Naveed Khan (PAMS) spoke about next steps and conference reflections.\nTheir collective emphasis highlighted the importance of working together to address issues with regards to ECE and foundational learning.\nThey stressed upon adopting the recommendations that were devised during the conference and incorporating them into approaches at national scale for taking meaningful strides towards ECE.\nJo Moir said that Foundational learning could keep children in school and put them on a different learning trajectory.\nThe notable speakers included Mark Hubert (British Council), Meredith McCormac (RTI), Toby Linden (World Bank Group), Mohiyuddin Wani (Chief Secretary-GB), representatives of provinces, educationists, policy makers etc.\nThe conference showcased a total of 9 international and 37 national speakers from various educational fields, presenting a wide range of perspectives.\nThis diverse lineup of speakers contributed to the conference’s wealth of knowledge and offered valuable insights, inspiring concepts, and worldwide best practices, enhancing the overall experience for all participants.",
  "retrievedAt": "2025-08-11T08:46:08.042Z"
}
