{
  "title": "Pakistan stands with people of Turkiye in testing times: PM",
  "link": "https://www.app.com.pk/national/pakistan-stands-with-people-of-turkiye-in-testing-times-pm/",
  "date_published": "2023-02-13T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Prime Minister Shehbaz Sharif Monday assured Turkish ambassador Mehmet Paçaci that in the testing times, the government and the people of Pakistan stood in strong solidarity with the people of Turkiye.\nHe made the remarks during his visit to the Turkish Embassy here to express condolences over the loss of life and property in the devastating earthquake in Turkiye.\nThe Prime Minister was accompanied by Foreign Minister Bilawal Bhutto Zardari, Finance Minister Ishaq Dar, Minister for Economic Affairs Sardar Ayyaz Sadiq, Minister for Law Azam Nazeer Tarrar, Special Assistants to the Prime Minister Attaullah Tarrar and Tariq Fatemi.\nThe Prime Minister conveyed his condolences to the Turkish ambassador and prayed for the victims of the earthquake in Turkiye.He reiterated that Pakistan will continue its rescue and relief efforts for Turkish brothers and sisters until the last affected person was rehabilitated.\nThe Prime Minister also highlighted the relief efforts of Pakistan for the earthquake victims of Turkiye. He told that Pakistan was sending winter tents, blankets, warm clothes and other essential items for the people of Turkey.\nThe PM said brothers in Turkey were sent assistance through air, sea and road while the government was also considering to send aid through trains.He informed that assistance was being provided on the basis of daily reports from the Ministry of Foreign Affairs and Pakistan’s ambassador to Turkey.\nThe government of Turkey fully helped Pakistan during the earthquake of 2005, floods in 2010 and in the recent floods, he noted.He asked the Turkish ambassador to inform about the needs of people of Turkey so that Pakistan could arrange assistance accordingly.\nThe ministers who accompanied the prime minister also offered their condolences. They said the public and private sectors of Pakistan were ready to extend assistance to people of Turkey.  He also recorded his remarks in the condolence book.\nThanking the Prime Minister and the people of Pakistan, the ambassador of Turkiye said that they were touched by the outpouring of sympathy and support from the entire Pakistani nation.",
  "retrievedAt": "2025-08-11T08:03:18.752Z"
}
