{
  "title": "Bilawal calls for ‘national consensus’ to confront economic challenges",
  "link": "https://www.app.com.pk/national/bilawal-calls-for-national-consensus-to-confront-economic-challenges/",
  "date_published": "2023-02-13T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Foreign Minister Bilawal Bhutto Zardari on Monday urged the country’s leadership and other stakeholders to develop a ‘national consensus’ to confront challenges posed by the economy and others.\nSpeaking in the inauguration ceremony of golden jubilee celebrations of the Constitution of 1973 at Parliament House , he said the Central Executive Committee (CEC) of Pakistan Peoples Party (PPP) had decided to constitute a committee and assigned it task to evolve consensus among stake holders on devising code of conduct for resolving all issues of the country and moving forward with the aim to resolving issues of the countrymen.\nThe foreign minister said the PPP committee would approach all political parties for devising rules of the game to contest polls and smooth functioning of the country. Political parties should come on one page to overcome crises being confronted the country, he added.\nBilawal said the stubborn attitude of Imran Khan and his non cooperation was damaging the interests of masses.\nHe said for smooth running of the country, rules of the games must be devised and all stake holders must agree on it for smooth functioning of the country.\nHe urged peoples representatives to evolve consensus on a code of conduct and implement it.\nLamenting the behavior of PTI Chairman Imran Khan, the foreign minister observed the PTI Chairman was ready to hold negotiations with anti state elements but allergic to sit with fellow politicians.\nHe said the constitution guaranteed the rights to people, journalists and others, adding the 1973 constitution had provided freedom of expression and right to vote to the ordinary people.\nHe said before that only rich and mighty was given the right to vote.\nThe constitution of 1973 forced the powerful elites to approach the common man to beg for votes, he said adding that former Prime Minister Zulfikar Ali Bhutto brought a revolution overnight and empowered common masses.",
  "retrievedAt": "2025-08-11T06:03:30.219Z"
}
