{
  "title": "PM asks provinces to submit strategy on subsidized essential items during Ramazan",
  "link": "https://www.app.com.pk/national/pm-asks-provinces-to-submit-strategy-on-subsidized-essential-items-during-ramazan/",
  "date_published": "2023-02-13T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): Prime Minister Shehbaz Sharif on Monday asked the provinces and administrative units to submit a comprehensive strategy to the federal government on the provision of food items at subsidized rates during the holy month of Ramazan.\nChairing a meeting on the availability of essential commodities and food items, he stressed using technology to control the rates in Ramazan bazars. He also emphasized putting in place effective measures for security.\nThe prime minister directed to increase the number of Ramazan bazars in big cities to accommodate the maximum population.\nHe said ensuring the supply of essential items to citizens was the basic responsibility of the federal and provincial governments.\nIn this regard, he called for improving liaison between centre and provinces and directed strict action against the hoarders.\nHe stressed removing hurdles in import of necessary items on a priority basis.\nHe said special committees would be set up to improve the supply chain of commodities and maintain their prices.\nThe meeting was told that necessary steps were being taken to ensure the supply of commodities including wheat, pulses and edible oil, and other items.\nIt was highlighted that the federal government was supplying the required wheat to the provinces. Some provinces are using mobile phone applications to reach out to the citizens for the supply of essential items at reduced rates.\nThe meeting was attended by Finance Minister Ishaq Dar, Minister for National Food Protection and Research Tariq Bashir Cheema, Planning Minister Ahsan Iqbal, the chief secretaries of four provinces, Gilgit Baltistan and Azad Kashmir, the chief commission of Islamabad, and senior officials.",
  "retrievedAt": "2025-08-11T06:03:47.086Z"
}
