{
  "title": "President emphasises enhanced trade, education cooperation with Senegal",
  "link": "https://www.app.com.pk/national/president-emphasises-enhanced-trade-education-cooperation-with-senegal/",
  "date_published": "2023-02-13T12:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 13 (APP): President Dr Arif Alvi on Monday underlined the need for enhanced cooperation with Senegal in the areas of trade, economy, and education.\nThe president, talking to Pakistan’s Ambassador-designate to Senegal, Saima Sayed, who called on him here, said that both countries had great potential to increase bilateral trade and economic relations for the mutual benefits of the two sides.\nHe said that Pakistan considered Senegal as an important country in the West African region, and asked the ambassador to make concerted efforts towards further expanding the bilateral ties.\nHe urged the ambassador to work on arranging bilateral exchanges at the ministerial level between the two countries.\nThe president expressed satisfaction over the participation of Pakistani businessmen in Trade Fairs (Dakar International Trade Fair-FIKDAK) in Dakar for many years,. Such exhibitions would help in further promoting trade relations between the two countries.\nPresident Alvi asked the ambassador-designate to arrange more trade exhibitions in collaboration with the concerned ministries to boost bilateral trade volume.\nHe called for increased cooperation between Pakistan and Senegal in the area of education.\nHe said that 8000 foreign students were currently enrolled in different programmes of the Virtual University of Pakistan (VU), and Senegalese students could also benefit from the online and distance education being offered by VU and Allama Iqbal Open University.\nPresident Alvi also asked Saima Sayed to highlight India’s anti-minority and anti-Muslim policies as well as the reign of terror unleashed by her against the innocent people of Indian Illegally Occupied Jammu and Kashmir for over seven decades.",
  "retrievedAt": "2025-08-11T06:03:37.799Z"
}
