{
  "title": "D-Chowk hosts Pakistan’s Diamond Jubilee Celebrations",
  "link": "https://www.app.com.pk/national/d-chowk-hosts-pakistans-diamond-jubilee-celebrations/",
  "date_published": "2022-08-13T10:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP): The D-Chowk, Islamabad, which was mostly in the highlights for hosting protests of different political parties, Saturday, saw stunning pictures of Pakistani flag and Minar-e-Pakistan painted by children of different schools, to express solidarity with their homeland and marking the Diamond Jubilee (75th anniversary) of Pakistan.\nIn the national flag painting ceremony, children from different schools of the federal capital Islamabad painted the Pakistani flag and Minar-e-Pakistan with their own hands showing love and enthusiasm for their homeland.\nOn the occasion, troops of Islamabad, Punjab, Sindh, Balochistan, Khyber Pakhtunkhwa and Azad Kashmir police, and Frontier Corps paraded on the D-Chowk to celebrate Pakistan’s Diamond Jubilee celebrations.\nBesides, singing the national anthem, children sang national songs including ‘Sohni Dharti Allah Rakhe’, ‘Ae Watan Pyare Watan’ and ‘Dil Dil Pakistan’. Anchors Nadeem Jafferi and Asma Iqbal also cheered children by asking them questions on what the Pakistani flag colours stands for, to which they replied, ‘The white and dark green field represents Minorities and Muslim majority, respectively. While the crescent on the Flag represents progress and the five-rayed star represents light and knowledge.”\nThe troops of Police force, Frontier Corps, Special Security Unit Sindh Police and Counter-Terrorism Department saluted the distinguished guests while raising slogans of “Allah Ho Akbar (Allah is great)”.\nAfter the parade, traffic transport fleets of different divisions of Islamabad Police passed in front of stage while marching with flags.\nFederal Minister for Information and Broadcasting Marriyum Aurangzeb, who graced the occasion as chief guest, was surrounded by children who were so excited to take selifies, picture and autographs of her.\nShe also encouraged the children for their passion and zeal for making all-out participation and contribution in painting the Pakistani flag and marking the diamond jubilee celebrations.\nThe flag painting ceremony was organized by the Ministry of Information, Capital Development Authority (CDA) and Federal Directorate of Education which was participated by a large number of people participated in the event.\nPakistan Muslim League Nawaz (PML-N) leader Saira Afzal Tarar, Secretary Information Shahera Shahid, Principal Information Officer Mubashir Hasan and senior officials of Islamabad Police were also present in the ceremony.",
  "retrievedAt": "2025-08-11T15:23:42.399Z"
}
