{
  "title": "Parliamentary leaders in NA cut ribbon of Quaid-e-Azam’s restored portrait",
  "link": "https://www.app.com.pk/national/parliamentary-leaders-in-na-cut-ribbon-of-quaid-e-azams-restored-portrait/",
  "date_published": "2022-08-13T18:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP):Parliamentary leaders of political parties in National Assembly on Saturday cut the ribbon to inaugurate the portrait of Quaid-e-Azam placed at the chamber belonging to the first directly-elected Legislative House and created by renowned Pakistani artist Prof Saeed Akhtar.\nParliamentary leaders of various political parties including Bilawal Bhutto Zardari of PPP, Khawaja Asif of PML-N, Maulana Asad Mehmood of MMAP, Ghous Bux Mehar of GDA, Ahmed Hussan Dehar of PTI, Shah Zain Bugti of JWP,  and Aslam Bhootani (Independent) were invited by Speaker National Assembly Raja Pervaiz Ashraf to come to dais and cut the ribbon of portrait placed in the chamber.\nSpeaker Raja Pervaiz said renowned artist of the country Prof Saeed Akhtar was entrusted with the task of creating a portrait of Quaid-e-Azam for the first directly elected Legislative House.\nHe said that in the shadow of Saeed Akhtar’s artwork, the first directly elected Assembly not only took oath but also made the constitution; the first elected Prime Minister Shaheed Zulfikar Ali Bhutto and Muhammad Khan Junejo also took oath under the same picture in 1977 and 1985 assemblies.\nHe informed that When this new House was built in 1986, that image remained in the State Bank Building and was later destroyed due to the events of time.\n“The National Assembly Secretariat was fighting the case for getting this picture for the last 12 years which finally succeeded after I became speaker and under my personal supervision, this picture was finally restored after thirty five years with the advice of Saeed Akhtar,” he added.\nThe original picture had been re-displayed in this esteemed House, the Speaker said, adding that Saeed Akhtar was especially invited to the convention to acknowledge his services.",
  "retrievedAt": "2025-08-11T15:23:35.185Z"
}
