{
  "title": "188 people killed, 40,000 houses damaged due to rain incidents in Balochistan: Ziaullah",
  "link": "https://www.app.com.pk/national/188-people-killed-40000-houses-damaged-due-to-rain-incidents-in-balochistan-ziaullah/",
  "date_published": "2022-08-13T15:26:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 13 (APP): Adviser to Chief Minister Balochistan for Home and Tribal Affairs, PDMA Mir Ziaullah Langu on Saturday said that 188 people have died so far due to monsoon rain incidents in respective areas of Balochistan.\nHe expressed these views while addressing a press conference here.\nMir Ziaullah Langu said that about 40,000 houses were damaged by the heavy rains in the province.\nHe said that this time, northern areas of Balochistan received heavy rains saying that agricultural land spread over 0.5 million acres has been damaged in the areas by recent rains.\n“21 hundred kilometres of national highways and 25 bridges were damaged by monsoon rains across the province,” he said, adding that around 4 big and small dams were wrecked.\nHe further said that Provincial Disaster Management Authority (PDMA) teams had reached Killa Abdullah district last night to deal with the flood situation.\nHe said so far, tents were distributed among 20000 people in rain hit areas of Balochistan despite 30 thousand people were provided with food and drink ration for one month by PDMA.\nMir Ziaullah Langu said National Disaster Management Authority ( NDMA), Khyber Pakhtunkhwa and Sindh government have given relief materials to Balochistan regime for flood victims saying that relief activities were being continued in respective areas of province through contribution of Pakistan Army, Navy,  FC, Levies Force, police and district administration.\n“Emergency has been imposed in 26 out of 34 districts, treatment facilities have been provided to 90000 people in various set up medical campuses in rain hit areas”, he underlined.\nHe also thanked to Pak forces, rescue teams and PDMA for doing a better job with limited resources in flood affected areas of Balochistan, saying that Balochistan government was utilizing all available resources to provide maximum facilities to people in rain hit areas of the province.",
  "retrievedAt": "2025-08-11T15:23:38.291Z"
}
