{
  "title": "Petroleum SAPM chairs meeting on building ‘Strategic Underground Gas Storages’",
  "link": "https://www.app.com.pk/national/petroleum-sapm-chairs-meeting-on-building-strategic-underground-gas-storages/",
  "date_published": "2020-09-28T04:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Special Assistant to the Prime Minister (SAPM) on Petroleum Nadeem Babar Monday chaired a meeting on development of Strategic Underground Gas Storages (SUGS) aimed at meeting the country’s growing domestic and commercial needs especially during the winter.\n“The construction of SUGS is part of the government’s policy to improve energy security and affordability in the country,” a Petroleum Division news release said.\nThe initiative is being supported by the Asian Development Bank (ADB), while a consortium of European oil & gas equipment companies is leading the study, a Petroleum Division news release said.\nExplaining the rationale for building the SUGS, the SAPM said that Pakistan had considered building emergency stockpiles of gas “to deal with supply disruption amid country’s growing domestic and commercial demand especially in winter.”\nThe meeting agreed to expeditiously complete the study report on methodology of underground gas storages till May 2021, so that, availability of funds for facility will be met in due course of time. “Final report will provide blueprint for facility with respect to size, modulation and security supply of gas.”\nEarlier, in 2019, Minister for Energy Omar Ayub Khan and Petroleum SAPM Nadeem Babar had discussed the SUGS with ADB, who agreed to undertake a feasibility study for the project and allocated a grant.\nInter State Gas Systems (Pvt) Ltd., a fully government owned entity, would be the focal agency for the project.\nRecently, the ADB has completed its competitive bidding process and appointed the international consultant for preparing a feasibility study. Project infrastructure could be funded through Gas Infrastructure Development Cess (GIDC).\nThe SUGS facilities are crucial for the country in view of the committed supplies of imported gas under the international gas agreements and fast-growing gas demand in the country to keep pace with the economic progress.\nThe project would also significantly enhance Pakistan’s capability to provide uninterrupted gas supply for sustainable economic growth.",
  "retrievedAt": "2025-08-11T19:50:56.173Z"
}
