{
  "title": "PM approved package for Southern, Northern Balochistan: Senate body told",
  "link": "https://www.app.com.pk/national/pm-approved-package-for-southern-northern-balochistan-senate-body-told/",
  "date_published": "2020-09-28T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Minister for Power Division Omar Ayub Khan on Monday informed the Senate’s Standing Committee on Power that Prime Minister Imran Khan had approved a package for Southern and Northern Balochistan through the National Developmental Council (NDC).\nHe assured the committee that he would speak to Minister for Planning, Reforms and Development Asad Umar to get it approved either from the NDC or have it included in the PSDP.\nThe committee, which met here with Muhammad Fida in the chair, was briefed about alleged removal of domestic meters of small farmers for running mono motors on single phase domestic connections by GEPCO.\nFurther discussion on points of public importance regarding provision of electricity to chromite mining area of Muslim Bagh, Qilla Saifullah district, Balochistan raised by Senator Muhammad Usman Khan Kakar, and transparency in the PESCO’s recruitment process of meter readers raised by Senator Mushtaq Ahmed resumed.\nAs regards provision of electricity to chromite mining areas of Muslim Bagh, the committee was informed that in compliance of its directives given during the meeting held on August 18, 2020, the revised PC-1 amounting to Rs 258,075 million with 20 percent grid sharing cost had been prepared.\nSince the electrification was beyond QESCO’s scope, the Power Division was of the view that funds might be arranged and remitted to the company for provision of electricity to chrome mines in Muslim Bagh Tehsil.\nThe committee was informed that running mono motors on single phase domestic connections was illegal and for that purpose the consumers needed to apply for three phase agricultural tube well connections.\nIt was further informed that agricultural connections would benefit the consumers immensely since their tariff was subsidized.\nThe Power Division was directed to provide Agricultural Tube Well Connections Policy to the committee.\nDuring discussion on transparency in the recruitment process of meter readers and linemen in PESCO, the committee was informed that members of the informal sub-committee senators Nauman Wazir Khattak and Mushtaq Ahmed visited the PESCO Head Quarter.\nBoth the senators held detailed discussions with CEO and DG (HR) and analysed the information / data presented to them. It was asserted that recruitment rules and regulation had been ignored on a large scale. The irony of the matter was that those who did it had retired.\nWhile considering the petition of Dr Faiz Ahmed Chaudhary, Ex-MD, NTDC, the Secretary Power Division viewed that the NTDC had nothing to do with the case and that if Dr Faiz wished he should file a suit of defamation against the newspaper.\nDr Faiz was of the view that his contract was terminated vide clause 10.3 of the contract agreement that pertained to termination of contract without any reason.\nThe committee chairman opined that Dr Faiz had come to Pakistan to serve the country and was mistreated.\nThe Secretary Power apologised to Dr Faiz if his sentiments were hurt due to statement issued by the NTDC.\nThe report of the Senate Standing Committee on Power on a Point of Public Importance regarding ‘Exact figure of Circular Debt” raised by Senator Nauman Wazir Khattak was adopted.\nConvened by Senator Fida Muhammad, the meeting was attended by senators Moula Bux Chandio, Siraj ul Haq, Usman Khan Kakar, Mushahid Ullah Khan, Mirza Muhammad Afridi, Muhammad Akram, Molvi Faiz Muhammad and Mushtaq Ahmed, and senior officers from the Power Division along with all concerned.",
  "retrievedAt": "2025-08-11T19:50:48.831Z"
}
