{
  "title": "Govt to spend Rs18 bln on tackling urbanization challenges",
  "link": "https://www.app.com.pk/national/govt-to-spend-rs18-bln-on-tackling-urbanization-challenges/",
  "date_published": "2020-09-28T08:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): The government would spend around Rs18 billion during the current fiscal year for physical planning and housing sector programmes, which would be implemented by various ministries, divisions and departments to address the increasing urbanization issues and challenges.\nPakistan has the highest rate of urbanization in South Asia and as per Population Census of 2017, urbanization had increased from 32.52 percent to 36.38 percent during 1998 to 2017, according to an official document available with APP.\nHowever, based on a modified definition of urban settlements, ratio of urban to rural population could be 40 percent and even higher, therefore, it was estimated that, by 2025, nearly half of the country’s population would be living in cities, it added.\nThe document said rapid urbanization was already stretching cities’ resources in the country. The tremendous challenge of absorbing such a massive number of people in urban areas and providing them with shelter, food, employment, healthcare, education, municipal services and recreation facilities was made more difficult, causing shortage of urban facilities and resources, skilled manpower and good governance.\nDespite the challenges, urban areas demonstrate immense economic potential to generate growth in the country.\nThe federal government has also announced relief packages for construction and agriculture sectors and a subsidy of Rs 30 billion under Naya Pakistan Housing Scheme. The provincial governments also announced relief packages for vulnerable people and exemption in taxes.\nIn addition, the Naya Pakistan Housing and Development Authority (NAPHDA) had been established for undertaking Prime Minister’s Programme for construction of five million affordable houses to the general public.\nSpecial relief package for construction industry had been announced by the government to boost construction activity besides, Establishment of Construction Industry Development Board (CIDB) to facilitate the construction sector as well as to strengthen the regulatory framework.\nBesides, the Federal Government Employees Housing Authority (FGEHA) has launched two new projects in Islamabad and Rawalpindi for provision of apartments to the federal government employees under PM’s Naya Pakistan Housing Programme, it said.",
  "retrievedAt": "2025-08-11T19:50:54.719Z"
}
