{
  "title": "Maryam charges sheet uncle Shehbaz for ‘making compromises in politics’: Shahzad",
  "link": "https://www.app.com.pk/national/maryam-charges-sheet-uncle-shehbaz-for-making-compromises-in-politics-shahzad/",
  "date_published": "2020-09-28T10:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Advisor to the Prime Minister on Interior and Accountability Shahzad Akbar Monday said Maryam Nawaz had charged sheet her uncle Shehbaz Sharif that he had always made compromises in politics.\n“Shehbaz Sharif today faced two charge sheets. One was from the Lahore High Court which had rejected his plea for pre-arrest bail after his failure to satisfy the court and other was from his niece that he always made compromises in politics,” he said while addressing a press conference flanked by Minister for Information and Broadcasting Shibli Faraz.\nThe advisor said Shehbaz Sharif would now have sufficient time in the custody of National Accountability Bureau (NAB) to ponder over his way of politics. The Pakistan Muslim League-Nawaz (PML-N) should accept the court’s decision of his bail application rejection. The time for having separate laws for the rich and poor had lapsed.\nHe said PML-N Vice President Maryam Nawaz today claimed that she was born rich. There was nothing wrong in making money with hard work, but they did not answer when asked by an investigative agency about the sources and means of their income. “They consider themselves above the law and their attitude is even more arrogant than that of kings,” he added.\nShahzad Akbar said during the court proceedings, it was observed that Shehbaz Sharif was involved in organized money laundering. There were some 16 accused in the case.\nHe alleged that Shehbaz Sharif had laundered money using his wife’s account and bought lands and property for her.\nThe PML-N president formed companies in the name of his personnel servants for collecting funds and kickbacks from contractors, developers, builders and party members, he added.\nInformation Minister Shibli Faraz said Shehbaz Sharif was arrested after he failed to satisfy the court for extending his bail. Likewise, he said, Nawaz had earlier failed to do so.\n“Do they consider it an illegal act to answer the questions being asked by courts about their wealth?” he said.\nHe said Maryam Nawaz had claimed that they had inherited wealth from their forefathers, but ironically they were not giving money trail for the purchase of properties under question.\nThe minister said whenever the PML-N was out of power, its leadership started criticizing the state institutions. “However, they should know that today no one is above the law,” he added.\nThere were open-and-shut cases against them and they could easily avoid arrest by providing trail of the money used to purchase the properties, he said.\nShibli Faraz maintained that they accepted favorable court decisions and if, otherwise, they made a hue and cry of political victimization.\nHe questioned how Nawaz Sharif could serve the country as he and his sons made assets abroad.\nPrime Minister Imran Khan, he said, had built a house from his earnings made before joining politics and it was during the PML-N government that the Supreme Court had declared him honest and trustworthy.\nHe said the PML-N president could not present any evidence to support his case and that was why the Lahore High Court had dismissed his bail petition.\nTo a question about giving prior information to the National Assembly Speaker about arrest of a lawmaker, Shahzad Akbar said it was mandatory for the accused to be present in the court during consideration of his / her pre-arrest bail. The speaker might be informed after the arrest of lawmaker for investigation into the criminal case.\nTo another query, he said CPEC Authority Chairman Lt Gen (R) Asim Saleem Bajwa gave a detailed response to a controversial report.",
  "retrievedAt": "2025-08-11T19:50:48.863Z"
}
