{
  "title": "PTI, MWM join hands to contest upcoming elections in GB",
  "link": "https://www.app.com.pk/national/pti-mwm-join-hands-to-contest-upcoming-elections-in-gb/",
  "date_published": "2020-09-28T14:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP):Pakistan Tehreek-e-Insaf (PTI) and Majlis Wahdat-i-Muslimeen Monday announced electoral alliance to contest the upcoming elections for the legislative assemblies of Gilgit-Baltistan (GB).\nMinister for Kashmir Affairs and Gilgit Baltistan Ali Amin Khan Gandapur made a formal announcement here at a press conference along with the Minister for Information and Broadcasting Shibli Faraz and representatives of MWM.\nThe minister said negotiation with another major political party Tehreek-e-Islami Pakistan was underway, which might also ally with the PTI in the election.\nHe expressed the confidence that most of the political parties would contest election in coalition with PTI in larger interest of the region.\nThe minister said the government had decided to elevate Gilgit-Baltistan (GB) to the status of a full-fledged province with all constitutional rights, including its representation in the Senate and the National Assembly.\nGandapur said that voting would be held in mid-November. “Elections will be held on time and our preparations are complete,” he added.\n“After consultation with all stakeholders, the federal government has decided in principle to give constitutional rights to Gilgit-Baltistan,” he said.\nThe deprivation of the people of Gilgit-Baltistan of 73 years would come to an end. Besides the constitutional rights and the provincial setup, Gandapur said important steps were also being taken for the development of the region.\n“To provide better healthcare facilities to the people of Gilgit-Baltistan, the government will provide MRI and CT scan machines to all District Headquarters Hospitals, while the basic health units (BHUs) to be provided ultrasound machines,” he said.\n“Furniture will be provided to all schools. Rest houses will be set up at about 70 places to promote tourism. Loans will be provided to the locals to build huts and guesthouses at tourist destinations,” he said, adding that an agreement had been reached with the National Bank of Pakistan in that regard.\nTo improve the transport facilities, the minister continued, the government had decided to build a tunnel at the Babusar Top. “This will make the travel to Gilgit-Baltistan via Babusar Top possible throughout the year,” he added.\nHe said that medical and engineering colleges would be set up in the region, while a minerals policy would be formulated soon. In order to save forests and wildlife, entire Gilgit-Baltistan would be declared as protected area, he added.\nResponding to a question, Gandapur said the government would fully support the Election Commission of Pakistan (ECP) in conducting fair, free and transparent elections in the GB.\nHe said the government had made several attempts to develop consensus with the opposition parties over the electoral reforms to ensure transparency in GB elections, but they fled away from an issue of national importance.\nMWM, Secretary General, Nasir Sherazi, said the decision to contest the election in coalition with the PTI was taken to ensure provision of constitutional rights to the people of GB.\nThe people of GB had long been deprived of the basic rights as there was no representation of their public representative in the National Assembly and Senate, he added.\nHe said the GB had great importance in the China Pakistan Economic Corridor as this was the only land route between the two countries.\nMeanwhile, President, Parliamentary Board, GB, Arshad Dad announced the name of ticket holders for 24 constituencies of GB General Election 2020.\nFatehullah Khan for GBLA-2, Syed Jaffar Shah, GBLA-3, MWM candidate for GBLA-5, Col. Abaid Ullah Baig GBLA-6, Raja Muhammad Zakeria Khan Maqpoon GBLA-7, MWM for GBLA-8, Fida Nashad GBLA-9, Wazir Hussain GBLA-10, Syed Amjad Ali GBLA-11, Raja Muhammad Azam Khan GBLA-12, Muhammad Khalid Khurshid Khan GBLA-13, Shamsul Haq Lone GBLA-14, Noshad Alam GBLA-15, Ateequallah GBLA-16, Haider Khan, GBLA-17, Haji Gulbar Khan GBLA-18, Zafar Muhammad GBLA-19, Nazir Ahmead GBLA-20, Raja Jehan Zaib GBLA-21, Muhammad Ibrahim Sanal GBLA-22, Amina Ansari GBLA-23 and Syed Shamsuddin for GBLA-24.\nTicket holder for GBLA-1 and GBLA-4 was still pending.",
  "retrievedAt": "2025-08-11T19:50:45.813Z"
}
