{
  "title": "Parliament nothing in opposition’s eye except getting personal gains, NRO: Murad",
  "link": "https://www.app.com.pk/national/parliament-nothing-in-oppositions-eye-except-getting-personal-gains-nro-murad/",
  "date_published": "2020-09-28T09:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 28 (APP): Minister for Communications and Postal Service Murad Saeed on Monday said the opposition just wanted to get personal benefits and National Reconciliation Ordinance (NRO) through Parliament.\n“It has proven once again that in opposition’s eye, the Parliament’s purpose is nothing other than getting personal benefits and making demand for the NRO,” he said in a statement while commenting on opposition parties’ refusal to attend a parliamentary leaders meeting convened by National Assembly Speaker Asad Qaiser.\nHe regretted that the Zardari-League, as per its tradition, fled from the meeting, which was convened in consultation with Bilawal Zardari. “They always flee whenever invited for discussion on any important national issue.”\nMurad Saeed said they were pursuing the agenda of protecting their properties and had nothing to do with resolving national issues and evolving consensus on them.\nHe said the opposition had been talking about National Accountability Bureau (NAB) cases even during a joint sitting of the Parliament, which had been recently convened on the key issue of Kashmir.\nThe minister said they also refused to attend an important session, which was convened to discuss the matters related to Gilgit-Baltistan by the NA speaker, adding the opposition talked about the elections in a press conference, but fled away when suggestions were invited.\n“Once against non-seriousness of those, who give lectures on supremacy of the parliament in TV shows, has exposed,” he said, adding supremacy of the Parliament was reflected through legislation on important national issues and public importance matters, which was not the priority of opposition.\nHe said the opposition considered the Parliament just a place to seek NRO, blackmail the government on important national issues, deliver speeches and flee away.\nThe minister expressed confidence that the Gilgit-Baltistan would get its all rights under the leadership of Prime Minister Imran Khan by the grace of Allah Almighty.\nIn past, he said the previous governments had ignored the GB Assembly’s resolutions, but the Pakistan Tehreek-i-Insaf (PTI) government after coming into power started work on it.\nIn October 2018, he said, the Ministry of Kashmir Affairs and Gilgit-Baltistan had brought in the Federal Cabinet a summary in the light of GB Assembly’s resolutions.\nMurad Saeed said the PTI government was moving towards giving the ‘provisional provincial status’ to the GB by evolving consensus among all stakeholders.",
  "retrievedAt": "2025-08-11T19:50:54.702Z"
}
