{
  "title": "Imran says he is tasked by PM to address Sindh Govt’s reservations on island cities",
  "link": "https://www.app.com.pk/national/imran-says-he-is-tasked-by-pm-to-address-sindh-govts-reservations-on-island-cities/",
  "date_published": "2020-10-14T19:00:00.000Z",
  "source": "APP",
  "content": "KARACHI, Oct 15 (APP):Sindh Governor Imran Ismail on Thursday said Prime Minister Imran Khan had tasked him to address the reservations of Sindh Government about the planned model cities on two islands near Karachi.\n“Today, the prime minister had a detailed discussion on the plan. He directed me to talk to the Sindh Government and other stakeholders to win their support for the initiative undertaken by the Federal Government. We can also talk about issuance of an ordinance regarding the Islands Development Authority,” he told a press conference here at the Governor House.\nThe governor said both the Federal and Sindh governments could execute the development project in partnership. The prime minister was committed to provide the provincial government and the people a golden opportunity of developing the islands with building modern cities of international standard having the best hotels and recreation facilities.\nThe project would boost the economy of Sindh and the country as big foreign and local investment was expected to come, he said, adding the cities on the Bundal and Dingi islands spreading over around 8,000 acres would become attractive tourist sites, which would help earn big foreign exchange.\n“ China and Malaysia are interested in the plan,” he said, adding Malaysia, China and Sri Lanka had developed their islands with investment of billions of dollars, and were now earning a lot of foreign exchange through tourism.\nThe governor said the prime minister had a clear vision about development of the islands into modern cities. Sindh would be the main beneficiary, getting total revenue to be generated from the development activities on the islands. About 150,000 jobs were expected to be created through the development programme, besides increased activities in other industries.\n“The PM wants generation of foreign exchange through the development of these islands and setting up the Ravi River city,” he added.\nHe said till date no proper environment study was done on the islands. There were different informal opinions and speculations about their environment issues, which, however, would be taken care of before starting the development work.\nHe said the best sewerage system with treatment plant would be set up for the two cities. As part of the development plan, the government would set up a desalination plant to provide quality drinking water, he added.\nTo a question about law and order in Karachi, the governor said the issue could be better dealt with by converting the city into a smart one.",
  "retrievedAt": "2025-08-11T19:54:16.422Z"
}
