{
  "title": "Ministry of Human Rights launches ‘Zainab Alert’ on the Pakistan Citizen’s Portal",
  "link": "https://www.app.com.pk/national/ministry-of-human-rights-launches-zainab-alert-on-the-pakistan-citizens-portal/",
  "date_published": "2020-10-15T16:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP):Zainab Alert system will activate the state machinery at relevant regional and district levels for effective emergency response and recovery of missing children.\nFederal Minister for Human Rights Dr:Shrieen M Mazari said on Thursday at the launching ceremony of Zainab Alert” on the Pakistan Citizen’s Portal, in an event held at the Ministry of Human Rights.\nShe said that through integration with the Pakistan Citizen’s Portal, the alert mechanism will be instantly available to 2.9 million registered users.\nThis is a commendable effort on the part of the federal government to unify and strengthen efforts to track and trace missing children and child abuse cases in Pakistan, following the recent enactment of the Zainab Alert, Response and Recovery Act in March 2020, the minister said.\nSpeaking at the launch event, Minister for Human Rights, Shireen Mazari emphasized various other steps the federal government is in the process of implementing to institute stronger protections for the rights of children in Pakistan.\nShe elaborated on the progress that has been made in terms of the implementation of the Zainab Alert, Response and Recovery Act 2020, including the notification of ZAARA, as well as widespread awareness campaigns to sensitize the general public about the rights of children and attitudes and behaviours that can help create a more safe and enabling environment from them to grow up.\nZainab Ansari’s father, Amin Ansari attended the event as the guest of honor and personally launched the application on the Citizen’s Portal.\nThe event was attended by Asad Umar, Minister for Planning, Development, Reforms and Special Initiatives.\nUmar commended the move on the part of the Ministry of Human Rights, and appraised its integration with the Pakistan Citizen’s Portal, which will help ensure that it is effectively monitored and evaluated.\nDeputy Secretary of the Prime Minister’s Delivery Unit, Adil Saeed Safi, also attended the event and explained the technical aspects of the application and the system.\nCitizen’s who are illiterate or do not have access to the internet, can visit any government office or institution and request that an alert be generated on their behalf.\nThe application / alert mechanism was developed by the Ministry of Human Rights in collaboration with the Prime Minister’s Performance Delivery Unit.\nThe Zainab Alert utilises advanced technologies and packs in several key features such as AI Face Recognition, Geo tagging and mapping, and real time progress tracking and alerts in order to streamline and strengthen response and recovery alerts.\nIt will also establish a national reporting dashboard and a public web portal to allow both authorities and citizens to track and trace the progress of cases as well as the prevalence of incidents and reporting in regions / districts across Pakistan.\nThe system will be monitored by the Ministry of Human Rights.\nThe Director General of the newly constituted Zainab Alert, Response and Recovery Agency (ZARRA) will supervise the mechanism and dashboard at the Ministry of Human Rights. The system institutes a robust mechanism that will alert the District Police Officers (DPOs) and the Regional Police Officers (RPOs) through their respective dashboards, as well as through SMS notifications due to the urgent nature of response required.\nPolice officials after initial validation of alerts, shall mobilise immediately. Inspector Generals (IGs) will be responsible for following up in their provincial capacities, as well as the Chief Ministers and Provincial Home Secretaries.\nUltimately the mechanism and dashboard will be integrated with the Ministry of Human Rights’ 1099 helpline and application for reporting human rights abuses and violations in Pakistan.\nThese are important measures that will be integral in terms of strengthening mechanisms to report, track and trace cases of child rights violations in Pakistan.",
  "retrievedAt": "2025-08-11T19:54:06.975Z"
}
