{
  "title": "5th Gen War – Twitterati bust RAW’s #Fake letter attributed to COAS",
  "link": "https://www.app.com.pk/national/5gw-fake-letter-by-raw-attributed-to-coas-backfires/",
  "date_published": "2020-10-15T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 15 (APP): With the fifth generation warfare at its peak, a retired Indian army officer Thursday posted a fake letter attributed to Pakistan’s Chief of Army Staff General Qamar Javad Bajwa in an abortive attempt to create a wedge between the country’s armed forces and the people.\nThe fake letter posted at the micro-blogging site Twitter by Indian Journalist Major (Retired) Gaurav Arya, purportedly urges the Corps Commander Gujranwala to take necessary measures to avert any law and order situation as the PML-N workers would stage a protest outside his residence, while the PTI workers would target them.\nThe undated letter with a wrong logo at the wrong place, poorly aligned lines immediately became a hot favourite of twitterati who made fun of the person who created the fake document, with demands of sacking him of job for not even knowing the basics of photoshop.\nPak Army Chief Gen Qamar Javed Bajwa asking his Corps Commander to ensure protection of PML (N) cadres from PTI goons. Very interesting times ahead in Pakistan. This is not just a letter. This is the Pak Army fast losing patience with @ImranKhanPTI\nEk chaal sheh aur maat ♟ pic.twitter.com/a7n4PvyY0Z\n— Major Gaurav Arya (Retd) (@majorgauravarya) October 15, 2020\nAccording to a forensic document examiner, the poorly drafted letter with a fake signature of the Chief of Army Staff, use of different shades of green ink, printed on a doctored letterhead, showing visibly blurred address of the sender followed by a sharp printed address of the Corps Commander is the brainchild to be the idea of some Research and Analysis Wing (RAW) officer.\nThe fake document, released by the Indian journalist who operates with the handle @majorgauravarya is being seen by the Pakistani security experts as part of an ongoing campaign to defame Pakistan’s armed forces through building of a certain narrative and distribution of such documents on social media to create confusion amongst the masses.\nChief of Army Staff General Qamar Javed Bajwa in his recent address at the Pakistan Military Academy and earlier speeches has repeatedly warned the nation to be wary of such hybrid war.\nThe Army Chief in his address to the young cadets said the enemies who plotted Pakistan’s doom and destruction were watching it with disdain.\n“Having failed and feeling frustrated, they have now subjected us to a 24/7 hybrid war. This war is not fought in the battlefields but in the minds. In previous wars, soldiers were taking the brunt on the frontline; in this new war, however, leadership at all levels is the target,” he said.\nHaving failed and feeling frustrated, they have now subjected us to a 24/7 hybrid war. This war is not fought in the battlefields but in the minds: COAS\nThe #fake letter received a strong reaction from the Twitter users who pointed out that a COAS “directs” his Corps Commander and does not “request” him.\nAccording to defence experts, the hybrid warfare is a blend of conventional, unconventional and irregular warfare. It is where the battle of ideas is fought in the mainstream electronic and print media and social media. Also known as the Fifth-generation warfare (5GW) – it is the battle of perceptions and information designed to distort the perception of the masses so as to give a manipulated view of the world around and achieve certain desired objectives.\nAccording to experts well conversant with the methodology of the notorious Indian spy organisation, the people of Pakistan must remain very vigilant to the Indian designs and avoid sharing such information.\nMaj Gobria…God knows how did you manage to reach the Maj rank in army….a letter signed by COAS without date… Font changed..no symmetry..no alignment and the person who is putting on so much service is not smooth in own signature.jaisa jahil tera PM ha weisay tum sab ho pic.twitter.com/Ruz2WdjFaY\n— Let’s Get lost (@Fubar_10) October 15, 2020",
  "retrievedAt": "2025-08-11T19:54:08.740Z"
}
