{
  "title": "HEC, ANF to combat drug use among students",
  "link": "https://www.app.com.pk/national/hec-anf-to-combat-drug-use-among-students/",
  "date_published": "2024-08-29T14:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): The Higher Education Commission (HEC) and the Anti-Narcotics Force (ANF) will enhance collaboration to counter the growing menace of drug use among students in the universities.\nDuring a meeting between Director General ANF, Major General Abdul Moeed and Chairman HEC Dr. Mukhtar Ahmed here Thursday, the two sides discussed strategies to address the growing concern of drug abuse among university students. The DG ANF highlighted the alarming rise in drug-related arrests among students, faculty, and staff members.\nExecutive Director HEC Dr. Zia Ul-Qayyum, Member (R&I) HEC, Dr. Bushra Mirza, Brig. Rashid Mahmood, Director ANF and Consultant Quality Assurance HEC Dr. Anwar-ul-Hassan Gilani were also present on the occasion.\nDr. Mukhtar Ahmed expressed HEC’s unwavering commitment to curb drug usage in the higher education institutions. “HEC will ensure that universities implement robust measures to prevent drug abuse on campuses,” he said.\nThe Chairman further said that the Commission would soon conduct a virtual session involving vice chancellors, university faculty, deans, and security officials of HEIs to discuss strategies and foster cooperation. Additionally, the HEC will also collaborate with the office of the Prime Minister Youth Programme (PMYP) to create awareness among young people, he said.\nThe Director General ANF said that through collaboration with institutions like HEC, ANF aims to eradicate drug abuse from higher education institutions and promote a healthier and safer learning environment for students across Pakistan.\n“ANF has recently intensified its efforts to curb drug supply to higher education institutions,” he stated.\nHe further said that hundreds of individuals involved in this illicit trade, including students, teachers, administrative staff, and even delivery boys, have been arrested.\nTo combat this issue effectively, he said, the ANF plans to also leverage the power of social media and engage celebrities and influencers to raise awareness about the dangers of drug abuse.",
  "retrievedAt": "2025-08-11T05:07:27.403Z"
}
