{
  "title": "Finding Innovative and Creative Solutions concludes at NUST",
  "link": "https://www.app.com.pk/national/finding-innovative-and-creative-solutions-concludes-at-nust/",
  "date_published": "2024-08-29T11:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): The Grand Finale and Prize Distribution Ceremony of Finding Innovative and Creative Solutions (FICS 2024), a flagship initiative of NUST towards fostering social entrepreneurship, was held at the university’s main campus on Thursday.\nThe 11th edition of FICS expanded its international footprint to Turkiye and Azerbaijan in partnership with Azerbaijan Technical University and Altinbas University, Turkiye.\nThe robust competition witnessed as many as 800 project submissions from over 30 NUST Schools and Colleges, and national and international institutions.\nSecretary Ministry of Federal Education and Professional Training, Mohyuddin Ahmed Wani graced the event as chief guest.\nProminent amongst others were Lt Gen (Retd) Engr Javed Mahmood Bukhari, Rector NUST, and Ambassadors and esteemed educationists from Azerbaijan, Turkiye and Brunei Darussalam.\nThe overall national winner of FICS ’24 was Team Harassment Defender.\nIt is an indigenous, female-led initiative that seamlessly integrates hardware and app capabilities to address women’s safety concerns.\nThe winning team was awarded a cash prize of PKR 500,000. In addition, 1st and 2nd runner-ups were awarded cash prizes of PKR 300,000 and PKR 150,000, respectively.\nMeanwhile, the Global Champion Award of USD 5000 was conferred upon an international team ABC (Amyotrophic Brain Cube) from Azerbaijan State Oil and Industry University.\nThe team stood out amongst international contestants. A Special Award was also bestowed upon team Plastigate from NUST School of Civil and Environmental Engineering in the category of SDG 11 (Sustainable Cities and Communities).\nIn addition, a Social Impact Award was won by team Visionary from Azerbaijan Technical University (AzTU), Azerbaijan.\nThe chief guest, Mr Mohyuddin Ahmed Wani, Secretary Ministry of Federal Education and Professional Training, complimented the finalists of FICS ’24 and their mentors, particularly the winners for their ingenious ideas and solutions to address challenges facing the country and beyond.\nHe stressed the need for figuring out the real issues, and subsequently conceiving and materialising innovative ideas for poverty alleviation, disaster risk reduction, and fighting illiteracy in the far-reaches of the country.\nThe Federal Secretary also emphasized promotion of cost-efficient technology-driven solutions for catering to the educational needs of the underprivileged segments of the society, highlighting that NUST provides the perfect entrepreneurial ecosystem and a launching pad for innovative startups to thrive, succeed and contribute to national development.\nIn his address, Lt Gen (Retd) Engr Javed Mahmood Bukhari, Rector NUST, highlighted that FICS is the university’s flagship project that leverages upon NUST’s comprehensive startup ecosystem towards developing sustainable businesses, while manifesting 4th generation entrepreneurial character of the university.\nThe initiative, he maintained, is aimed at providing brilliant young minds with a chance to convert societal challenges into entrepreneurial opportunities.\nHe said, “Our faculty, in collaboration with our industrial partners, mentor the participants in refining their ideas while creating prototypes, systems, products and devices.”\nHe also highlighted that after a rigorous three-stage competition, the successful entrepreneurial ventures are offered free incubation services at the National Science and Technology Park (NSTP) based at NUST.\nHe made special mention of FICS ’24 marking a historic moment in the relationship between Pakistan, Turkiye, and Azerbaijan, paving the way for enhanced tripartite cooperation in youth entrepreneurship and innovation.\nFICS is fortunate to have the patronage of diverse industrial partners providing seed fund and cash prizes for promising projects.\nThe sponsors of FICS ’24 included National Radio Telecommunication Company (NRTC), Crescent Steel and Allied Products Ltd (CSAPL), Allied Bank Limited (ABL), Askari Bank Limited, and Central Asian Cellular Forum (CACF) and Alfoze Technologies Pvt. Ltd. Knowledge Partners for FICS 2024 included Intellectual Property Office (IPO) Pakistan, Pakistan Software Houses Association for IT and ITES (P@SHA), Change Mechanics Pvt. Ltd., Sustainable Development Policy Institute (SDPI), etc.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:07:40.211Z"
}
