{
  "title": "Pakistan calls for urgent UNSC actions to hold Israel accountable, protect Palestinians",
  "link": "https://www.app.com.pk/national/pakistan-calls-for-urgent-unsc-actions-to-hold-israel-accountable-protect-palestinians/",
  "date_published": "2024-08-29T08:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): Pakistan on Thursday reiterated its call for the UN Security Council to take immediate measures to stop the genocide of Palestinian people, end Israel’s blatant violations of international laws and the UN Charter, and hold it accountable for war crimes.\nForeign Office spokesperson Mumtaz Zahra Baloch, at her weekly press briefing, expressed grave concerns over the recent large-scale military incursion by Israeli forces in the northern part of the Occupied West Bank. This attack is another blatant violation of international law, including the 4th Geneva Convention, which prohibits indiscriminate targeting of civilians, she added.\nShe said that the repeated Israeli transgressions and the use of force, including airstrikes and drone attacks on populated areas was a blatant violation of the international humanitarian laws.\nThe spokesperson reiterated Pakistan’s strong condemnation of the bombing of the historic Grand Mosque in Khan Younis by Israeli forces, and said the assault on a place of deep cultural and religious significance was a clear violation of international laws and the Hague Convention.\nResponding to a question, the spokesperson said that the invitations had been sent to all heads of government of SCO member countries including India for the upcoming meeting of the Council of Heads of Government of Shanghai Cooperation Organization being held in Islamabad on October 15-16, 2024.\nShe said Pakistan had also received confirmation from some of the invited countries.\nThe spokesperson told the media that the third death anniversary of iconic Kashmiri leader Syed Ali Geelani would be observed on September 1, and remembered him as the true voice of the Kashmir struggle for self-determination.\nPaying rich tribute to Kashmir leader late Syed Ali Geelani’s struggle for Kashmiri’s right to self-determination, the spokesperson reaffirmed Pakistan’s commitment to political, diplomatic, and moral support to Kashmiris for a just and peaceful settlement of the Kashmir dispute as per UNSC resolutions.\nHighlighting the diplomatic engagements during the last week, she mentioned Foreign Secretary Muhammad Syrus Sajjad Qazi’s visit to Cameroon where he was leading a Pakistani delegation at the 50th session of the OIC Council of Foreign Ministers.\nAt the CFM, he will share Pakistan’s perspective on genocide in Gaza, dire humanitarian situation and Israeli adventurism in the region threatening regional peace. He will also highlight the Indian atrocities in IIOJK, the issues of Islamophobia and climate change.\nSpokesperson Baloch said that 8th session of Pakistan-Oman Bilateral Political Consultations (BPC) was held in Muscat earlier this week wherein two sides reviewed all aspects of bilateral cooperation including political relations, trade and investment, security and defense, culture, health, and consular matters.\nBesides, she said Speaker of the National Assembly Sardar Ayaz Sadiq led a parliamentary delegation on an official visit to Belarus at the invitation of the Chairman of the House of Representatives of Belarus. In Minsk, he met with the President, Chairman of the House of Representatives, Chairperson of the Council of the Republic of Belarus, and Minister for Agriculture.\nThe two sides affirmed their commitment to expand bilateral relations and enhance parliamentary exchanges and cooperation across various sectors including agriculture, industry, education, and culture with a focus on increasing bilateral trade.\nTo another question, Spokesperson Baloch said that the government had no plans to engage in any talks with the TTP. She said the presence of terror groups including the TTP in Afghanistan was also confirmed by multiple international reports including the United Nations.",
  "retrievedAt": "2025-08-11T05:07:50.795Z"
}
