{
  "title": "Milan university students’ delegation meets PM’s Climate Aide Romina Khurshid Alam",
  "link": "https://www.app.com.pk/national/milan-university-students-delegation-meets-pms-climate-aide-romina-khurshid-alam/",
  "date_published": "2024-08-29T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP):A four-member delegation of students from Italy’s Milan University called on Coordinator to Prime Minister on Climate Change Romina Khurshid Alam to discuss the pressing issue of climate change and its impacts on Pakistan.\nDuring the meeting held here on Thursday in the climate change and environmental delegation ministry, the students’ delegation was also apprised of the various socio-economic impacts of climate change and the government’s policy measures for building the country’s climate resilience, a news release said.\nOn the occasion, the PM’s climate aide welcomed the students’ delegation and said, “As we all know, climate change is one of the most critical challenges facing our world today, and its effects are increasingly evident in Pakistan.”\nRomina Khurshid Alam told the students that ranked among the world’s top ten climate-vulnerable country, Pakistan had been experiencing a rise in the frequency and intensity of extreme weather events, particularly unprecedented floods, intense monsoon rains, intense devastating heatwaves, rapid glacial melting and consequent glacial lake outburst floods.\nThe recent heatwave in June 2024 saw temperatures soar to record highs, impacting public health and agriculture, she highlighted.\nShe further said, “Floods, which are becoming more intense and frequent, displace thousands of families, damage infrastructure, and disrupt livelihoods, especially in rural areas.”\n“For resource-poor the country, managing these fallouts of climate change has become a grave challenge because of the frequency and magnitude at which they are occurring and inadequate financial and technical resources,” the PM’s climate aide said.\nTalking about impacts on agriculture sector, Romina Khurshid Alam told the students that climate change was also affecting crop yields and food security.\n“Unpredictable weather patterns and extreme temperatures are harming crops and reducing productivity to an extent that crop failures and fall in productivity of different crops had become new normal in the country, with significant implications for food prices and rural economies,” Ms Alam explained.\nChanges in temperature and precipitation patterns were aksi disrupting local ecosystems, badly affecting bio-diversity.\nSuch changes in weather patterns caused due to climate change, included shifts in bio-diversity and the health of key habitats such as mangroves and wetland, which provide environmental protection and livelihoods for the resource-dependent community.\nThe present government was implementing various adaptation strategies, including flood management projects, improved water resource management, and early warning systems. There are also initiatives to promote climate-resilient agriculture and sustainable land use practices.\nSharing details about the government’s coping strategy, she said that for addressing these climate risks and for building climate resilience of the people, their livelihoods, ecosystems and public infrastructure, the present government was implementing various adaptation strategies, including flood management projects, improved water resource management, and enhancing network of early warning systems across the country for improved and more reliable weather and disaster forecast.\nThere were also initiatives to promote climate-resilient agriculture and sustainable land use practices to enhance the agriculture sector’s climate resilience.\nShe apprised of the climate change and environmental coordination ministry’s various measures to secure funding for implementing various adaptation and resilience-building measures plans.\n“The ministry is working with international organizations and donors to secure funding and technical assistance for climate adaptation and mitigation projects. Efforts include collaborations with the UN and various environmental NGOs to address the immediate and long-term impacts of climate change,” she said.\nTalking about community awareness and engagement in various climate risk mitigation initiatives of the government, Romina Khurshid said that local communities were being increasingly engaged in climate action, with grassroots organisations working on disaster preparedness, reforestation, and sustainable farming practices.\nBesides, education and awareness campaigns through media, schools and other channels were also being conducted time to time to inform and empower individuals to take climate action, the PM’s climate aide added.\nRomina Khurshid Alam highlighted that climate change was the gravest global issue of the present century, which required international cooperation. However, as a responsible country, Pakistan would continue to engage with global partners for boosting climate action through implementation of the climate initiatives and advocating for the fair and effective climate action on the international stage.\nThe students thanked the PM’s climate aide Romina Khurshid and her team for informative briefing about the climate risks being faced by the country and the coping measures being taken by the present government for making Pakistan climate-resilient country.\nThey said that Pakistan’s commitment to global climate action was inspiring and a remarkable example for other countries to follow.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:08:05.397Z"
}
