{
  "title": "President Zardari awards Hilal-i-Imtiaz to Javelin star Arshad Nadeem",
  "link": "https://www.app.com.pk/national/president-zardari-awards-hilal-i-imtiaz-to-javelin-star-arshad-nadeem/",
  "date_published": "2024-08-29T13:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP):President Asif Ali Zardari on Thursday conferred the prestigious Hilal-i-Imtiaz on Javelin thrower Arshad Nadeem in recognition of his outstanding performance in Men’s Javelin throw in the Paris Olympics, 2024.\nThe award was presented at an investiture ceremony held at Aiwan-e-Sadr in Islamabad, attended by the Senate Chairman, cabinet members, diplomats, bureaucrats, parliamentarians, sports organization officials, athletes, and representatives from the Ministry of Inter Provincial Coordination.\nThe significance of Nadeem’s accomplishment was highlighted, noting that his historic performance has brought immense pride to the nation.\nArshad Nadeem ended Pakistan’s 40-year Olympic gold medal drought and became the country’s first individual Olympic gold medalist by winning gold at the Paris Olympics 2024 with a record-breaking throw of 92.97 meters.\nLater, the president also announced a Rs 100 million reward “from his side” for the athlete, according to press release issued by President House.\nArshad Nadeem also had a meeting with the president, which was attended by his coach Salman Iqbal Butt, Secretary of the Ministry of Inter-Provincial Coordination Nadeem Irshad Kayani, Director General of the Pakistan Sports Board Muhammad Yasir Pirzada, and other senior government officials.\nWhile congratulating Arshad Nadeem, President Asif Ali Zardari remarked that Nadeem had brought great pride to the nation by setting an Olympic record with a 92.97-meter throw.\nHe praised Nadeem’s outstanding accomplishment, acknowledging the hard work and dedication that elevated Pakistan’s stature and inspired countless young athletes nationwide.\nThe president said that Pakistan needed to promote other sports, especially the Singles. He remarked that children of sportsmen should be granted scholarships, saying that he would direct the Sindh Government to contribute Rs 250 million to Pakistan Sports Board’s Endowment Fund for the welfare of athletes.\nThe president said that Arshad Nadeem’s exemplary triumph encouraged our youngsters to break barriers and make their mark in the field of sports at the international level. He expressed the hope that the athlete would continue to win laurels for the country in future.\nArshad Nadeem thanked the president for conferring Hilal-i-Imtiaz and resolved to break the world record of Javelin throw. He also thanked his family and the nation for their prayers and wishes.\nThe president also appreciated the contributions of the athlete’s coach, Salman Iqbal Butt, for his guidance and contributions to Arshad’s success.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:07:51.204Z"
}
