{
  "title": "Widespread rain-windstorm/thundershower likely in various parts of country:PMD",
  "link": "https://www.app.com.pk/national/widespread-rain-windstorm-thundershower-likely-in-various-parts-of-countrypmd/",
  "date_published": "2024-08-29T15:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP): Pakistan Meteorological Department (PMD) has forecast more widespread rain-windstorm/thundershower in Sindh, Balochistan, Punjab, Islamabad, Khyber-Pakhtunkhwa, Gilgit-Baltistan and Kashmir during the next 24 hours.\nHeavyfalls are likely in Sindh, northeast/ south Balochistan, northeast/ central Punjab, Potohar region, Islamabad, Khyber-Pakhtunkhwa, Gilgit-Baltistan and Kashmir during the period.\nAs per synoptic situation, deep depression was present over Rann of Kutch, India and lies at a distance of 270km east/southeast of Karachi, and likely to intensify into a Cyclonic storm during next 24 hours. A westerly wave was also affecting upper parts of the country.\nWidespread rain/wind-thunderstorms with scattered heavy-very heavy to isolated extremely heavy falls likely in\nTharparker, Badin, Thatta, Sajawal, Hyderabad, Tando Muhammad Khan, Tando Allah Yar, Matiari, Umerkot, Mirpurkhas, Sanghar, Jamshoro, Dadu and Shaheed Benazirabad districts and Karachi division till August 31 with occasional gaps.\nTorrential rains may generate pluvial flood/inundation in low lying areas of Sindh, Balochistan and southern Punjab till August 31.\nTorrential rains may generate flash Flooding in Hill torrents of Dera Ghazi Khan and local nullahs/streams of Karachi, Hyderabad, Dadu, Kalat, Khuzdar, Jaffarabad, Sibbi, Naseerabad, Barkhan, Loralai, Awaran, Panjgur, Washuk, Mastung and Lasbela.\nHeavy rains may trigger Landslides in Murree, Galliyat, Mansehra, Kohistan, Chitral, Dir, Swat, Shangla, Buner, Kashmir and Gilgit-Baltistan.\nHeavy downpour may cause urban flooding in low lying areas of Lahore, Sheikhupura, Kasur, Gujranwala, Sialkot, Sargodha, Faisalabad, Multan, Sahiwal, Islamabad/Rawalpindi, Nowshera, Swabi and Peshawar.\nDuring the last 24 hours, rain-wind/thundershower with isolated heavyfall occurred in Sindh, upper Khyber-Pakhtunkhwa, Kashmir, Punjab, Islamabad, Gilgit-Baltistan and northeast Balochistan.\nThe rainfall recorded was Sindh: Mirpur Khas 107mm, Badin 95, Thar Park (Diplo 74, Mithi 72, Chachro 53, Kaloi 41, Dahli 39, Islamkot 38, Nagar Park 32), Hyderabad (Airport 67, City 54), Tando Jam 65, Thatta 60 , Chhor 35, Karachi (Sarjani 34, Gulshan-e-Hadid 18, Korangi 09, University Road 07, Nazimabad 06, Faisal Base, Kemari 05, Jinnah Terminal 04, Gadap, DHA, MOS, Quaidabad, Gulshan-e-Maymar 03, north Karachi, Saddar 02, Masroor Base, Bin Qasim 01), Shaheed Benazirabad 18, Sakrand 16, Padidan 05, Rohri, Khairpur 03, Mohenjo Daro 02, Khyber-Pakhtunkhwa: Kakul 84, Balakot 55, Pattan 08, Malam Jabba 01, Kashmir: Muzaffarabad (City 72, Airport 71), Garhi Dupatta 28, Kotli 13, Rawalakot 11, Punjab: Sargodha 63, Faisalabad 46, Toba Tek Singh 38, Gujranwala 35, Mandi Bahauddin 29, Hafizabad 27, Okara 24, Lahore (A/P 26, City 22), Narowal 23, Islamabad (City 22, Saidpur 20, Airport 15, Golra 13, Bokra 04), Rawalpindi (Chaklala 19, Shamsabad 17, Kacheri 09), Mangla 19, Kasur 18, Sheikhupura 17, Gujarat 16 , Sialkot (City 15, Airport 08), Jhelum 14, Attock 10, Bhakkar 07, Sahiwal 06, Murree 05, Chakwal 07, Bahawalnagar 03, Jhang 02, Joharabad 02, Gilgit-Baltistan: Astore 43, Bagrote, Bunji 21, Chilas 16, Hunza 15, Gilgit, Skardu 11, Balochistan: Kalat 01mm.\nThe highest maximum temperatures recorded were Sibbi 43C, Dalbandin and Turbat 41C.",
  "retrievedAt": "2025-08-11T05:07:25.091Z"
}
