{
  "title": "COAS calls for greater harmony, says nothing supreme than national security",
  "author": null,
  "content": "RAWALPINDI, Mar 18 (APP): Chief of Army Staff (COAS) General Syed Asim Munir on Tuesday called upon all elements of national power to demonstrate greater harmony among their ranks for lasting stability in the country and said that nothing was supreme than the national security.\n“There is no agenda, no movement and no individual greater than the security of the country, “he said while addressing the Parliamentary Committee on National Security.\nFor lasting stability, the COAS said all elements of national power must work in harmony “This [fight against terrorism] is a battle for our survival and the survival of our future generations.”\nHe stressed the need for better governance and to transform Pakistan into a resilient and tough State, questioning that “how long will we continue to make countless sacrifices and fill the governance gaps with the sacrifices of the Pakistan Armed Forces and the blood of our martyrs?”\nThe Army Chief urged the religious scholars to expose the distorted interpretations of Islam presented by the Khawarij, adding “Our existence is subject to the existence of our country; therefore, nothing is more important to us than the security of the country.”\nTo ensure Pakistan’s security, he called for adopting a unified narrative, rising above political and personal interests.\n“Those who believe they can weaken Pakistan through these terrorists, today’s message to them is clear: we are united, and together we will not only defeat them but also their facilitators,” the COAS reiterated.\n“We have complete faith in Allah Almighty. No matter what happens, God willing, we will succeed,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:47:46.278Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/coas-calls-for-greater-harmony-says-nothing-supreme-than-national-security/",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T15:53:00.000Z"
}
