{
  "title": "SCBAP regrets opposition boycott of National Security Committee meeting",
  "author": null,
  "content": "ISLAMABAD, Mar 18 (APP):President, Supreme Court Bar Association of Pakistan (SCBAP) Mian Muhammad Rauf Atta, has regretted the opposition restrain from attending meeting of the Parliamentary Committee on National Security, held on Tuesday at the Parliament House in Islamabad.\nThe President SCBAP, in a statement said that the focus of the meeting was to consider the current law and security situation in the country, particularly in light of recent untoward incidents in the provinces of Baluchistan and Khyber Pakhtunkhwa (KPK).\nThis important meeting was attended not only by parliamentary leaders from all political parties represented in the parliament and cabinet members but also by senior officials from the security establishment.\nIt is extremely disheartening to see that the opposition alliance (the opposition), chose to boycott this crucial meeting. This decision underscores the prioritization of their political agenda over the national interest. If the opposition believes their grievances are valid, they should have addressed them within the parliamentary forum.\nGiven the ongoing turmoil and law and order issues affecting key areas of the country, it is essential to foster a national consensus. A united front is necessary to send a strong message to irritants so as to demonstrate that all stakeholders-political parties and the security establishment alike-stand together in the fight against this menace of terrorism.\nIt is regrettable that the opposition chose to forgo this important opportunity to express national solidarity against the scourge of terrorism for reasons that appears to be purely political. This Association once again wants to assert that “a house divided against itself cannot stand. The opposition urgently needs to reevaluate its actions and recognize that enemies of this country.\nIt is imperative that the opposition or anyone else does not provide them with an opportunity to exploit the situation through irrational actions, such as those demonstrated today.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:48:42.709Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/scbap-regrets-opposition-boycott-of-national-security-committee-meeting/",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T14:00:00.000Z"
}
