{
  "title": "PNS ASLAT visits Maldives during deployment on regional maritime security patrol",
  "author": null,
  "content": "ISLAMABAD, Mar 18 (APP):Pakistan Navy Ship (PNS) ASLAT visited Maldives during Regional Maritime Security Patrol (RMSP) deployment.\nUpon arrival at Port Malé, the ship was warmly welcomed by officials of the Maldives National Defence Force (MNDF) and Coast Guard, according to a news release.\nDuring the port visit, the Commanding Officer of PNS ASLAT called on Chief of Defence Force Major General Ibrahim Hilmy and Commandant Coast Guard Brigadier General Mohammad Saleem. During these interactions, matters of mutual interest were discussed.\nThe Commanding Officer also conveyed warm wishes from Chief of the Naval Staff Admiral Naveed Ashraf to the people of Maldives.\nDuring its stay in the Maldives, the Chief of Defence Force, government officials, the High Commissioner of Pakistan, diplomats, and ambassadors/representatives from Australia, Bangladesh, China, Japan, Saudi Arabia, Malaysia, Russia, Sri Lanka, United Kingdom, and the United States, along with members of the local community, visited the ship.\nPakistan Navy ships are regularly deployed on RMSP missions to fulfil international obligations for maritime security, ensure freedom of navigation on the high seas, and protect global commons.\nAt the conclusion of the port visit, PNS ASLAT conducted a Passage Exercise (PASSEX) with the Maldives Coast Guard Ship SHAHEED ALI.\nThe exercise aimed to strengthen maritime cooperation and enhance interoperability between the two navies.  Pakistan and Maldives share friendly relations, which have strengthened over time.   The visit of PNS ASLAT to Maldives will further contribute to fostering naval collaboration between the two brotherly nations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:48:34.278Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pns-aslat-visits-maldives-during-deployment-on-regional-maritime-security-patrol/",
  "dateList": "2025-03-18",
  "date_published": "2025-03-18T15:05:00.000Z"
}
