{
  "title": "PM stresses provision of skills to manpower according to contemporary requirements",
  "link": "https://www.app.com.pk/national/pm-stresses-provision-of-skills-to-manpower-according-to-contemporary-requirements/",
  "date_published": "2023-10-02T15:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 2 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Monday stressed the need to work on war footing for provision of skills to the country’s manpower according to the contemporary requirements.\nHe said the professional education and vocational training programs should be prepared at par the needs of the international market.\nChairing the meeting of the federal cabinet here, the prime minister said steps should be taken to increase employment opportunities of skilled people abroad.\nOn recommendation of federal ministry of education and professional training, the federal cabinet also approved the service level amended agreement between National Vocational and Technical Training Commission and Saudi agency Takamol.\nThe prime minister directed that all existing centers of technical education and vocational training should be activated.\nOn the recommendation of the ministry of education and professional training, the Cabinet also approved the signing of the Memorandum of Agreement between the Area Studies Center, University of Peshawar and Central Asia Research Center of Corvinus University of Hungary.\nThe cabinet also approved the appointment of Lt. Gen. Munir Afsar as Chairman of National Database Registration Authority (NADRA) out of the three names proposed by the Ministry of Interior.\nThe cabinet was informed that the selection committee had shortlisted names of the three best candidates for the post of Chairman NADRA. After detailed consideration, the cabinet approved the appointment of Lieutenant General Muhammad Munir Afsar as the new Chairman of NADRA.\nThe Cabinet also extended approval to the name of Summit Bank Limited as Bank Mukarramah Limited on the recommendation of the finance ministry.\nOn the recommendation of the interior ministry, the Cabinet approved the agreement between the governments of Pakistan and Ecuador, under which diplomatic, officials and special passport holders of both countries would be mutually exempted from visa.\nThe Cabinet also gave assent to the decisions taken in the meetings of the Economic Coordination Committee (ECC) on September 6 and September 19, 2023.",
  "retrievedAt": "2025-08-11T09:54:49.145Z"
}
