{
  "title": "PBM extends aid to over 11.62 million needy individuals during current year : MD",
  "link": "https://www.app.com.pk/national/pbm-extends-aid-to-over-11-62-million-needy-individuals-during-current-year-md/",
  "date_published": "2023-10-02T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 2 (APP):Managing Director of Pakistan Baitul-Mal, Malik Amir Fida Paracha on Monday revealed that over the past year, Pakistan Bait-ul-Mal  assisted over 11.616574 million individuals in need, with more than 10 million finding shelter in homes, facilitated 68,272 educational scholarships and provided financial support to 250,000 individuals for medical treatment.\nDuring an interview with  “APP”  he stated that Pakistan Baitul-Mal was offering both housing and education to orphans through Sweet Homes.\nThese Sweet Homes are located in various regions across the country, comprising 11 in Islamabad and Azad Kashmir Region, 9 in Lahore, 5 in Multan, 3 in Gilgit-Baltistan, 11 in Sindh, 8 in KPK, and four in Balochistan.\nIn these homes, he said orphaned and homeless children receive a range of complimentary services, including standard accommodation, meals, education, uniforms, books, medical care, skill development programs, laundry services, religious education, and counseling.\nThe sweet homes admitted orphaned children between the ages of 4 and 6.\nPresently, there are 6,000 orphans residing in Pakistan Sweet Homes.\nAccording to the Managing Director of Baitul-Mal, as of September this year, 13.229739 million individuals had received assistance from shelter homes, while 12.2039 million had been provided with two daily meals, and 99,647 had found shelter.\nAmong the beneficiaries of Shelter Homes, 4.525 million are from Islamabad, 2.3 million from Sindh, 614,000 from Balochistan, and 2.2 million from Khyber Pakhtunkhwa.\nAddressing a query, he explained that Thalassemia is a hereditary disease. According to a report, Pakistan has approximately 100,000 individuals living with Thalassemia, and each year, around 5,000 children are born with this life-threatening condition.\nPatients with Thalassemia receive scheduled blood transfusions after consulting with a qualified hematologist, accompanied by routine diagnostic tests conducted on a monthly basis.\nConsidering the rising prevalence of thalassemia, Pakistan Baitul-Mal has established state-of-the-art Thalassemia-Centeres in Islamabad, Azad Kashmir, Northern Areas and Gilgit-Baltistan, where patients receive free treatment.\nOver the past three years, financial aid was extended to 3,000 patients. In the year 2020, blood support was offered to 9,330 Thalassemia patients.\nHe mentioned the establishment of Women Empowerment Centers by Baitul-Mal, aimed at empowering women through various skill-building courses. To date, these centers have provided training to 277,238 women, helping them attain self-sufficiency and improve their quality of life in society.\nMalik Amir Fida Paracha, the Managing Director of Baitul-Mal, said that during the fiscal year 2022-23, a total of 13.2 million beneficiaries have already received assistance from shelter homes. Among these beneficiaries, 8,390 individuals received medical aid, 4,391 were awarded educational scholarships, and 18,375 received educational stipend.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:55:13.591Z"
}
