{
  "title": "Bilawal, Blinken reiterate desire to strengthen multifaceted Pak-US relations",
  "link": "https://www.app.com.pk/national/bilawal-blinken-reiterate-desire-to-strengthen-multifaceted-pak-us-relations/",
  "date_published": "2022-05-18T16:14:00.000Z",
  "source": "APP",
  "content": "NEW YORK, May 18 (APP): Pakistan and the United States Wednesday reiterated their desire to strengthen bilateral ties in the fields of economy, investment, and regional security.\nThe expression of the desire was made by Foreign Minister Bilawal Bhutto Zardari and the United States Secretary of State Antony Blinken as they met on the sidelines of the ministerial summit on ‘Global Food Security Call for Action’ and the Security Council’s open debate on ‘Maintenance of International Peace and Security – Conflict and Food Security.’\nThis is the second interaction between the two counterparts as earlier, they had spoken telephonically on May 6 after Bilawal Bhutto had assumed the office.\nIn his brief remarks to the media prior to their meeting, Secretary Blinken said that it was an important opportunity for them to talk about the many issues they were working on together.\n“We want to focus on the work we’re doing to strengthen economic and commercial ties between the United States and Pakistan, of course, focused on regional security,” he remarked.\nBlinken said Pakistan was now holding the chair of the G77 and the United States was looking forward to strengthening its own relations and open dialogue communication with the G77. He said he looked forward to speaking with Foreign Minister Bilawal about that.\n“This is our first opportunity to be face to face. We spoke on the phone, we are greatly pleased to be working with the Foreign Minister, with the Government in Pakistan,” the Secretary of State said.\nAbout the meeting on food security, he said it was a challenge faced by the world.\n“There was a pre-existing condition as a world when it comes to food insecurity in many places. It’s been exacerbated dramatically by Russia’s aggression against Ukraine, adding another 40 million people to those who are food insecure,” he commented.\nHe thanked Pakistan for participating in the meeting and engagement on the matter to look at concrete steps to address the food insecurity issues, and to help people in need around the world.\nIn his remarks, Foreign Minister Bilawal said Pakistan desired to engage with the United States to create opportunities for American investors and Pakistani investors and Pakistani businessmen and American entrepreneurs to work together.\n“I also look forward to the opportunity to increasing engagement between Pakistan and the United States, working with yourself and your administration, to improve trade relations between Pakistan and the United States… “I really look forward to working with you on both these issues,” he remarked.\nRegarding the meeting on food security, he said, “this particular initiative is most welcome” and Pakistan looked forward to engaging on the series of events on global food security.\n“We are aware that recent geopolitical events have indeed aggravated the situation and countries like Pakistan have already been facing challenges in food security, water security, energy security because of a whole host of issues ranging from climate change to issues in our neighborhood,” Bilawal commented.",
  "retrievedAt": "2025-08-11T14:55:38.406Z"
}
