{
  "title": "‘Dialogue’ solution to conflict not use of weapons: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/dialogue-solution-to-conflict-not-use-of-weapons-ahsan-iqbal-2/",
  "date_published": "2022-05-18T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP):Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal said on Wednesday the solution to differences was dialogue not the use of weapons. He said that scientific research was needed to get rid of terrorism and extremism.\nWhile addressing a two-day International Islamic Conference on Peace organized by the Islamic Research Institute (IRI) of the International Islamic University Islamabad (IIUI), he said that the widespread access to social media has allowed extremist elements to propagate negative attitudes. He said today wars were being fought on a hybrid level.\nFederal Minister said that the main weapon of hybrid war was disseminating hatred. He said that few elements were attempting to pollute the minds of the people by spreading lies.\nAhsan Iqbal stressed upon the need of establishing institutions to curb the uncertainty caused by negative elements.\nTalking about the issues of peaceful coexistence with India, he said that the identity of Muslims and Islamic values were at stake in the neighboring country as Indian government was advocating actions based on prejudice against the Muslims. He also said that in this globalized era, a conflict or an act of hatred engulfs the whole world. He opined that effects of the conflict were global, as exemplified by the Russia-Ukraine war. He said that peace and justice were the guarantors of social development and prosperity.\nThe Federal Minister for Planning said that without empathy it was not possible to resolve conflicts and extremism. He said that misguided people have had hijacked the narrative of Islam and in order to protect the identity of the Islamic world “we have to formulate our own narratives.” Ahsan Iqbal further said that humanity was suffering from extremism all over the world.\nAppreciating the role of Islamic University in promoting peace, he said that they (government) were working together with Islamic University for the promotion of peace.\nAddressing the conference on the occasion, Rector of the Islamic University, Dr. Masoom Yasinzai said that the conference would be a source of preparing a roadmap for future peace strategy. He said that the graduates of Islamic University were holding prominent positions all over the world and spreading the message of peace imparted to them by the University.\nThe rector further announced to hold conference on peace ever year.\nAddressing the conference, the President of the Islamic University, Dr. Hathal Homoud Al-Otaibi, said that Islam promotes peace and peaceful co-existence. He said that the role of universities was pivotal in promoting harmony. He said that universities were the only institutions that can train the young generation in accordance with Islamic teachings and with the requirements of modern times.\nDr. Hathal said that Pak-Saudi relations were getting stronger with time. He said that the role of Islamic University in promoting peace was exemplary. He said that the newly formed five-year strategic plan of the university would open new avenues for development and quality education, while improving the real quality of education was the top priority of varsity’s management.\nInforming about the aims and objectives of the conference, Dr. Zia-ul-Haq, DG Islamic Research Institute said that the aim of the conference was to defeat hatred and establish peace. He thanked Prime Minister Shahbaz Sharif for supervising the conference and Federal Minister Ahsan Iqbal for his cooperation in organizing the conference.",
  "retrievedAt": "2025-08-11T14:55:39.876Z"
}
