{
  "title": "Federal Education Minister meets UNFPA, PBSA, ACT delegates",
  "link": "https://www.app.com.pk/national/federal-education-minister-meets-unfpa-pbsa-act-delegates-2/",
  "date_published": "2022-05-18T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP):Federal Minister for Federal Education and Professional Training Rana Tanveer Hussain Wednesday held a meeting with the delegation of United Nations Population Fund (UNFPA), Pakistan Boy Scouts Association (PBSA) and Aiming Change for Tomorrow (ACT International).\nThe meeting was attended by the senior officials of the ministry as well.\nRana Tanveer welcomed the delegation and assured them of full cooperation and support. He said that it is imperative to work together to ensure progress. Minister said we should leverage the global knowledge base and experience of UN and use it to our advantage. Minister said that youth is the future of Pakistan and a successful youth means successful Pakistan.\nHence, we should ensure that holistic life skills are incorporated in the youth. In this regard he said that cooperation between the ministry of Federal Education and Professional Training, UNFPA, PBSA and ACT International and can be highly productive.\nFederal Minister was briefed by the representatives of these organizations about the work they are doing in Pakistan. Minister appreciated the work done by them in providing life skills to teachers of primary schools in AJK, GB and South Punjab.\nMinister was told that life skills which include communication skills and negotiation skills have been on high priority in these trainings as these skills are imperative in producing successful and productive people that can contribute to the society’s welfare.\nAll the participants agreed in principle to sign an MoU so that the implementation and out-reach of these plans can be enhanced. At the end of the meeting Federal Minister Rana Tanveer presented a souvenir to the participants.",
  "retrievedAt": "2025-08-11T14:55:35.775Z"
}
