{
  "title": "Rapid development in IT, science vital for Pakistan’s progress: President",
  "link": "https://www.app.com.pk/national/rapid-development-in-it-science-vital-for-pakistans-progress-president/",
  "date_published": "2022-05-18T11:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP): President Dr Arif Alvi on Wednesday said rapid development in the fields of information technology and science was vital for the progress of Pakistan and urged the youth to contribute by excelling in contemporary fields of knowledge.\nHe was addressing the National Youth Convention 2022 here at the Jinnah Convention Centre, which was organized by Pakistan Institute for Conflict Studies (PICS) and attended by former Chief of the Air Staff Air Chief Marshal (retd) Sohail Aman, Director General PICS Major General (retd) Saad Khattak and a large number of students and youth leaders.\nBesides education, President Alvi also emphasized the importance of character-building and called upon the youth to adopt high morals in their lives by standing firm against dishonesty and corruption.\nHe stressed that the intellectual and financial corruption had immensely damaged Pakistan and called upon the youth to stay clear from it.\nThe president said to transform Pakistan in line with the vision of Quaid-e-Azam and Allama Muhamamd Iqbal, the contribution of youth through intellectual development was important.\nHe said Pakistan’s nuclear capability was a matter of pride for the Islamic world and recalled that the country had become a nuclear power within a short span of seven years in response to the atomic explosions by India in 1974.\nHe said the country’s nuclear deterrence not only kept the enemy at bay, but also made its defence stronger.\nPresident Alvi said Pakistan always emerged morally strong in the comity of nations by hosting four million Afghan refugees at its soil for over 40 decades.\nOn the other hand, he said, the world was demonstrating hypocrisy by denying assistance to migrants.\nHe said the Pakistani nation always exhibited resilience during tough times, may it be braving the challenges of terrorism or the dealing with natural disasters including the 2005 massive earthquake.\nHe mentioned that the armed forces rendered immense sacrifices for the solidarity of the country and helped eradicating the menace of terrorism and extremism.\nThe president highlighted the plight of Muslims and other minorities in India and also in the Indian Illegally Occupied Jammu and Kashmir where the government was denying basic human rights to the people.\nOn fake news, Dr Alvi said adhering to the principles based on truth could discourage the scourge, which was casting a negative impact on the society.\nHe encouraged the youngsters to explore the world of in-depth knowledge by adopting the habit of book-reading and practice effective communication to convey their message in the correct context.\nFormer Air Chief Sohail Aman said youth could greatly contribute towards the development of their motherland by working efficiently and with dedication.\nHe asked the youth to honour Pakistan as their identity and attain modern education and skills to  deal with emerging challenges.\nDirector General PICS Major General (retd) Saad Khattak said working since 2018, the institute was inculcating in youth the passion to make the future of Pakistan bright and glorious.",
  "retrievedAt": "2025-08-11T14:55:44.505Z"
}
