{
  "title": "Kaira strongly condemns questionable trail of Yaseen Malik",
  "link": "https://www.app.com.pk/national/kaira-strongly-condemns-questionable-trail-of-yaseen-malik/",
  "date_published": "2022-05-18T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 18 (APP):Adviser to the Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira has strongly condemned the questionable trail of the veteran Kashmiri leader Yaseen Malik.\nHe said, the politically motivated trail on baseless allegations is being carried out against Yaseen Malik at the behest of Modi led Indian government, said a press release issued here on Wednesday.\nThe Adviser said, India has failed to dismantle the firm resolve of Yaseen Malik after keeping him under illegal detention in Tihar Jail for the last many years. Now the Indain authorities have subjected Yaseen Malik to face a fake trail where he secures little chances of fair hearing.\nAs a result, Yaseen Malik hasn’t engaged any lawyer in defence of baseless charges against him, he added. Qamar Zaman Kaira said that each state department of the so called secular India is today following the unfortunate ideology of RSS in form of Hindutva.\nHe called upon the international community and international human rights organizations to take practical steps to stop India from carrying out this unjustified and unilateral trail against Yaseen Malik.\nHe reminded the world community that Indian had already committed the judicial murders of Kashmiri leaders Afzal Guru and Maqbool Bhatt in the past. He cautioned that Indian was unfortunately following the same path as it had followed against Afzal Guru and Maqbool Bhatt.\nKaira made it clear that such condemnable Indian actions would fail to suppress the Kashmiri people. Today the Kasmiri youth stand utmost resolved in their right to self determination and are sacrificing their precious lives on daily basis for their just cause, he said.\nThe Adviser said that he is hopeful that people of Indian illegally occupied Jammu and Kashmir will soon be able to secure their right of self determination.\nHe urged India to desist from carrying out barbaric policies against the Kasmiri youth and it’s leadership and would rather take partical steps for peaceful settlement of the Kashmir dispute according to the United Nations Security council resolutions in order to establish lasting peace in the region.",
  "retrievedAt": "2025-08-11T14:55:44.136Z"
}
