{
  "title": "Valour, sacrifices of Pakistani mothers reason for success in war on terror: COAS",
  "link": "https://www.app.com.pk/national/valour-sacrifices-of-pakistani-mothers-reason-for-success-in-war-on-terror-coas/",
  "date_published": "2022-05-18T16:26:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 18 (APP): Chief of Army Staff (COAS) General Qamar Javed Bajwa on Wednesday said the reason for Pakistan’s success in war against terror was the valour and sacrifices of Pakistani mothers and sisters who rendered their loved ones for the protection of the motherland.\nAddressing the GHQ Investiture ceremony held here, the Army Chief said the world queried that how Pakistan succeeded against the menace of terrorism where the rest of the world failed to cope with the challenge of extremism.\nThe Army Chief said, “So I always say that we have mothers who have sacrificed their loved ones, our sisters who have lost their husbands and the children who are ready to sacrifice their fathers in this country and as long as there are such mothers and our sisters. So I have no doubt that no harm can come to Pakistan”.\nHe said, “Today we are here again to acknowledge the sacrifices of our brave soldiers who sacrificed themselves for the sake of our motherland. We are gathered here to pay tribute to them. Pakistan which is safe today; has been made possible by the blood of these officers, Junior Commissioned Officers (JCs) and soldiers”.\n“I always say that our real heroes are our martyrs, our ghazis (soldiers returned from the war with honour) and the nations that forget their martyrs and heroes get vanished”.\nA martyr, he said would have his name shining as long as the world lasts. He earned his name in this world and in the hereafter, the COAS said, adding, “He is forgiven. He not only gets forgiveness for himself but also opens the way to heaven for his heirs”, he added.\nThe Army Chief said no nation, no country could offer compensation for the sacrifice of its martyrs. “No material power, wealth, money can be a substitute for their sacrifices. We have a responsibility to take care of the heirs of the martyrs, and their families, and also to take care of their widows and their parents.\nWhile taking care of their children, which we will do, God willing. But I believe that no care and no privilege can be a substitute for martyrdom of the martyrs”.\nHe mentioned that for a father, for a mother, as long as they live in this world, their child will surely come before their eyes every day, every day they will remember him.\n“A widow whose husband has passed away and whose children have lost their father’s affection will also miss him and there can be no substitute for him”, he added.\nThe COAS said, “But I say that this country is alive because of your sacrifices and I salute you that because of your sacrifices Pakistan is safe today”.\nThe Army Chief said it was the army that used to respond to disasters whether it is a flood, a hurricane, an earthquake or a tsunami, you would find army everywhere without warning.\nHe underlined that Cholera has spread in many places in Balochistan nowadays. “There is a shortage of water and the army has reached there and is serving those people without telling me. The Army is providing clean water and relief to the affected population”.\nHe said he felt proud on these efforts of the Army.\n“I assure the heirs of my martyrs that insha’Allah you will never be disappointed,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:55:37.788Z"
}
