{
  "title": "IESCO installs 8,702 net metering connections with 106.43 MW capacity so far",
  "link": "https://www.app.com.pk/national/iesco-installs-8702-net-metering-connections-with-106-43-mw-capacity-so-far/",
  "date_published": "2023-03-23T09:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP): The Islamabad Electric Supply Company (IESCO) has installed 8,702 net metering connections having a total generation capacity of 106.43 megawatts (MW) in various circles of the company from January 2016 to February 2023.\nManager Public Relations Asim Nazir Raja told APP here that the company had received 9,177 applications of net metering with 114.29 MW capacity during the said period.\nThe National Electric Power Regulatory Authority (NEPRA) issued licences to 9,122 net metering connections with an accumulative capacity of 113.68 MW so far, he added.\nHe said that the import and export of billing units had been started from 7781 net metering connections with a total capacity of 95.35 MW. The total exports and imports from these connections stood at 133,529,246 units and 167,307,686 units respectively, he said.\nAsim said that the company had paid an amount of Rs 2,327,559 to the connections’ holders up to June 2022.\nTo a question, he said that the company had authorised to grant licences up to 25 kilowatts (kW) capacity while over 25 kW capacity, NENPRA issued licenses for net metering connections.\nIt is pertinent to mention here that the net-metering project had been launched in 2016 countrywide. It allows any domestic, commercial, industrial and other consumers to have at least a three-phase meter connection.\nUnder the arrangements, such a consumer may sell the additional energy to the respective power distribution company and make stocktaking (calculations) with it at the end of the month.\nSince the system allows the consumers to generate electricity from one kilowatt to one megawatt, NEPRA issues licences to the applicants seeking generation below 25kW in the service area jurisdiction of all distribution companies.",
  "retrievedAt": "2025-08-11T08:06:41.341Z"
}
