{
  "title": "‘Double Standards’: Sherry picks apart PTI’s deal with another US lobbying firm",
  "link": "https://www.app.com.pk/national/double-standards-sherry-picks-apart-ptis-deal-with-another-us-lobbying-firm/",
  "date_published": "2023-03-23T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 23 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Thursday slammed the purported ‘U-turn’ made by Pakistan Tehreek-e-Insaaf (PTI) by signing a six-month agreement with a private US consulting firm, Praia Consultant, for using their services to promote party’s image and restoring its lost credibility.\nIn a flurry of tweets, the minister held the signing of the agreement exposing the PTI’s “double standards and hypocrisy”.\nThe federal minister said that many countries appoint lobbyists, and so do political parties, but this case was particularly bizarre because it came from a party that attempted to pose itself as a [political] martyr of the “US meddling”.\n“If that was the case, why are they now locked in a desperate attempt to buy the influence of the US decision-makers after the failure of the ‘Cipher Conspiracy’ narrative and earlier lobbying efforts? PTI’s double standards and U-turns have been exposed many times,” she said.\n“Now, they are constantly taking the services of lobbying companies for their publicity in the US. His[Imran Khan] concocted narrative has been exposed numerous times that show he was planning to ‘play’ with Pakistan’s interests for his own personal politics,” she alleged.\nThe minister continued, “Despite previously blaming the US for their ouster from politics, the PTI hired an American lobbying firm Fentone Arlook LLC in October of last year, only to quickly backtrack on their criticism of the US within a month. It’s now apparent that hiring of lobbyists is not with Pakistan’s interests and integrity in mind, but rather as a means to influence the country’s domestic politics for their own gain. This brazen use of self-interest above national interest is a clear indication of PTI’s willingness to compromise Pakistan’s interests for the sake of their own political agenda.”\nAccording to the agreement, it allows the consulting firm to arrange meetings between the PTI leaders and US decision-makers, and to provide guidance on the content of these meetings.\nThe minister highlighted that normally political parties engage in lobbying for improving relations between the two countries, but it’s the opposite case here.\n“What makes PTI different from others is the sheer hypocrisy of their actions. They[PTI] have actively campaigned against foreign influence in the past, while engaging in it themselves. Imran Khan must answer for his false narrative of an American conspiracy against him, which he peddled for months before suddenly retracting. His actions have impacted Pakistan’s foreign policy and image, and it is time for him to take responsibility for the damage caused, for which we are still paying. This Cyphergate scandal compromised Pakistan’s foreign relations with its key partners, which showed that Imran Khan is willing to sacrifice anything for personal gain and power.”\nThe agreements between PTI-USA and the consulting firms are publicly available on the U.S. Department of Justice Foreign Agents Registration Act (FARA) website and can be examined by anyone.\n“The people of Pakistan have the right to know who is representing them and what interests they are promoting. It is time for PTI to answer over their ‘two-faced behaviour’ and be held accountable for the showcasing faultlines between their words and deeds,” said the minister.",
  "retrievedAt": "2025-08-11T08:06:36.828Z"
}
