{
  "title": "Pakistan’s future lies in adhering to constitution: PM",
  "link": "https://www.app.com.pk/national/pakistans-future-lies-in-adhering-to-constitution-pm-2/",
  "date_published": "2023-03-23T04:56:00.000Z",
  "source": "APP",
  "content": "“I have no doubt that Pakistan is destined to achieve great heights. However, for this to become a reality, we have to forge unity in our ranks, equip ourselves with national purpose and vow to wage a struggle in line with the legacy of our forefathers,” the prime minister said in a message on Pakistan Day being observed on Thursday.\nThe prime minister said that the 23rd of March was an epoch-making day in their national history that reminded them of their past, invited them to ponder over the present state of affairs, and inspired them to build a prosperous future.\nAs they celebrate Pakistan Day and paid tribute to the sacrifices of their founding fathers, they should not lose sight of the challenges staring them in the face, he observed.\n“The challenges are topped by a combination of economic instability and the inability to settle the rules of the game. An environment of political chaos explains why we have failed to develop our economy on a sustainable basis,” PM OfficeMedia Wing in a press release quoted the prime minister as saying.\n“This day is also the day to renew our pledge,” he stressed.\nThe prime minister said that it took them back to 1940 when Muslims of the sub-continent approved a resolution for the establishment of a separate homeland they could call their own under the dynamic leadership of Quaid-i-Azam Muhammad Ali Jinnah.\nAllama Muhammad Iqbal’s dream of freedom manifested itself in the form of a resolution representing Muslims’ demands, and aspirations for a separate homeland, he added.\nThe prime minister said the consequential seven years witnessed history in the making as the Quaid-i-Azam led a relentless struggle to translate the dream of Iqbal into reality. The establishment of Pakistan was certainly a miracle of the 20th century.\n“The last seventy-five years of our journey have seen us fight many crises from wars to natural disasters. There have been many occasions when we overcame the odds and achieved many milestones,” he added.\n“Let us use this day to introspect and hold ourselves to account. Only those nations that are capable of analyzing their past, learning from their mistakes, and making amends can achieve true glory,” he added.\nAs a member of the international community, the prime minister said Pakistan had played the role of a responsible nation in the resolution of problems facing humanity and the establishment of global peace.",
  "retrievedAt": "2025-08-11T08:06:45.812Z"
}
