{
  "title": "FIA arrests Ex-CEO of Drug Regulatory Authority on Fake PHD Degree",
  "link": "https://www.app.com.pk/national/fia-arrests-ex-ceo-of-drug-regulatory-authority-on-fake-phd-degree/",
  "date_published": "2023-12-20T09:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): Federal Investigation Agency (FIA) on Wednesday arrested former Chief Executive Officer (CEO) of Drugs Regulatory Authority of Pakistan (DRAP) Sheikh Akhtar Hussain for holding a fake degree of Ph.D.\nFIA Islamabad had registered an FIR against Sheikh Akhtar for deceiving authorities by faking his death twice to escape a fake degree case against him, however Afzal Niazi, deputy director FIA Anti-Corruption Circle, upon conclusion of his investigations arrested him.\nA joint enquiry team was constituted by Rana Jabar, additional director general North FIA, to conduct enquiries on more than 100 different applications against various officials of the DRAP.\nAfzal Niazi constituted 12 teams to arrest Hussain and several raids were conducted on the house, offices, and factories to arrest Hussain but all efforts failed in the past.\nFIA had placed his name on the Stop List to leave Pakistan and also moved an application in court to block his CNIC for his unconditional surrender.\nHussain was accused of Mega corruption and accumulation of wealth of more than Rs100 billion along with fake death claims to save himself from arrest in two NAB cases No.40/2001 and 16/2004.\nOther charges included abuse of official powers, fake degree, Getting PhD allowance on fake degree since 2001 from taxpayers’ money, drawing salaries after the termination from government service since 17 March 2021.\nHe was drawing Leave Encashment Allowance of LPR more than Rs2.5 million after termination from government service.\nHe was also accused of increasing the prices of medicines, Promoting officials without DPC and management courses and embezzlement in the official record of the DRAP.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:07:00.343Z"
}
