{
  "title": "BNA Commander Sarfaraz Bangulzai, 70 companions surrender; join national mainstream",
  "link": "https://www.app.com.pk/national/bna-commander-sarfaraz-bangulzai-70-companions-surrender-join-national-mainstream/",
  "date_published": "2023-12-20T16:00:00.000Z",
  "source": "APP",
  "content": "QUETTA, Dec 20 (APP): In a major development towards restoration of peace in Balochistan, Commander of Baloch Nationalist Army (BNA) Sarfaraz Bangulzai, alias Murid Baloch, along with his 70 companions on Wednesday surrendered to the State and joined the national mainstream.\nThey made the announcement during a press conference here at the Sikandar Jamali Auditorium, Civil Secretariat.\nCaretaker Provincial Minister for Home and Tribal Affairs Captain (R) Zubair Ahmed Jamali, and Caretaker Provincial Information Minister Jan Achakzai were also present on the occasion.\n“We have decided to leave the path of violence and join the national mainstream to play a constructive role in the development of the province and the country,” Bangulzai said.\n“I was working in the Food Department in Balochistan, had a house and a car, and was living a comfortable life, but detracted by anti-peace elements in 2009,” he added.\nBangulzai admitted that he had committed heinous crimes “in the name of nationalism”. However, he realized that the so-called insurgent leaders were anti-peace and enemies of the country as they themselves were enjoying luxurious lives abroad.\nIt may be mentioned that Sarfaraz Bangulzai took over the reins of BNA after its Commander Gulzar Shambay was arrested, who later joined the national mainstream due to the positive response from the state institutions.\nShambay remained deputy to Brahamdagh Bugti in the Baloch Republican Army (BRA) till 2018, but on the creation of Baloch Raaji Ajoi Sangar (BRAS) he founded a new lethal militant outfit – Baloch National Army.\nFor being well-connected to the hostile intelligence agencies of enemy countries, including India, Shambay remained operational head of BRAS and thus was the main character behind violence and unrest in the province.\nHis arrest was a serious blow for the militant groups, especially the BNA and it encouraged others, including his second-in command Sarfraz Bangulzai to surrender before the State.\nBangulzai told the news conference that Indian’s intelligence agencies were responsible for the unrest in Balochistan.\n“India is behind all sabotage activities and every act of terror in the province,” he said, urging the youth to shun violence and join the peace process for the development and prosperity of the country in general and Balochistan in particular.\nHe regretted for being involved in terror acts on the pretext of so-called of nationalism. However, he had a change of heart when he observed the luxurious lifestyles of self-proclaimed nationalist leaders.\nHe said that during the last 20 years, the so-called nationalist outfits killed thousands of innocent Baloch people. He had some disagreement with the leadership on certain issues, particularly terror acts, and thus was sidelined, he added.\nBangulzai deplored that women were being used as a weapon in the so- called rights movements, which was totally against the Baloch traditions.\nHe appealed to the State to welcome the disgruntled Baloch people who wanted to quit violence and join the national mainstream .\nIt may be recalled that Sarfaraz Bangulzai was a junior clerk in the Food Department. He remained President of All Balochistan Clerks Association Quetta Division in 2007 and Chairman of All Balochistan Clerks Association in 2008.\nEarlier, Minister Jan Achakzai called for the inclusion of disgruntled Baloch individuals in the national mainstream.\nHe acknowledged the tireless efforts of Caretaker Prime Minister Anwaar-ul-Haq Kakar, and Chief of Army Staff General Syed Asim Munir in addressing the issue.\nHe specifically mentioned that Gulzar Imam Shambay had facilitated negotiations with the disgruntled elements for peace in the province.\nAchakzai voiced concerns about Indian attempts to create disturbance in Balochistan.\nMeanwhile commenting on surrender of another militant leader, political analysts said,”Whenever the State of Pakistan makes efforts to promote peace and security in Balochistan, anti-national elements and forces immediately start playing their negative role.”\nIt was a historic day in the history of the country, especially Balochistan to achieve peace when the most wanted militant BNA commander along with his 70 associates surrendered to the State, they added.\nThey noted that the it was evident from their confession that they were playing in the hands of anti-national elements, who were a threat to the peace in Pakistan.\nThey said it was appreciable that the State like a mother pardoned Gulzar Imam Shambe, who remained involved in massacre of people.\nThey said all the propaganda of anti-national elements, which was\nbased on lies, had now been negated. “Misinformation and statements spread through social media without verification lead to distortion of facts,” they added.",
  "retrievedAt": "2025-08-11T11:06:10.739Z"
}
