{
  "title": "Elections 2024: nomination papers acquiring, submitting process starts",
  "link": "https://www.app.com.pk/national/elections-2024-nomination-papers-acquiring-submitting-process-starts/",
  "date_published": "2023-12-20T09:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 20 (APP): The acquisition and submission of nomination papers for candidates intending to participate in the National and Provincial Assembly seats in the upcoming 2024 general elections commenced on Wednesday and will persist until Friday (December 22).\nAccording to the schedule issued by the Election Commission, candidates interested in contesting elections can obtain and submit their nomination papers from 8:30 am to 4:30 pm until December 22.\nThe initial list of candidates is set to be released on December 23, with the scrutiny of nomination papers scheduled to take place from December 24 to December 30. Electoral symbols will be assigned to candidates on January 13, and the general elections are scheduled to held on February 8.\nThe cost for acquiring the nomination papers is set at Rs. 100. Each candidate is allowed to submit a maximum of five nomination papers, each with different endorsers.\nFor those contesting a National Assembly seat, the non-refundable fee is Rs. 30,000. Meanwhile, candidates vying for a Provincial Assembly seat are required to pay a non-refundable fee of Rs. 20,000.\nCandidates must attach their income tax return documents from the past three years along with their nomination papers. The fundamental eligibility criteria for candidates include being a citizen of Pakistan and being at least 25 years old.\nAs per the Election Commission of Pakistan (ECP), individuals contesting National Assembly seats must be registered voters in any location within Pakistan.\nTo vie for a seat in the provincial assembly, the candidate is required to be a voter of the respective province. The nomination papers must include an attested copy of the identity card and vote certificate of both the candidate recommender and endorser.\nAdditionally, a copy of the passport on behalf of the candidate should be attached to the nomination papers. The nomination fee is to be deposited by the candidate directly to the Returning Officer (RO) or through a Bank Draft.\nFailure to comply with Articles 62 and 63 will result in the disqualification of a candidate. Additionally, the proposer for general seats must be a voter from the relevant constituency.\nFor women and non-Muslim seats in the National and Provincial Assembly, both the proposers and seconders must be voters of the respective province. However, nominators and supporters of candidates for non-Muslim seats in the Assembly can be voters from any part of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:06:38.032Z"
}
