{
  "title": "Child Rights labour survey to be completed this year: Malhi",
  "link": "https://www.app.com.pk/national/child-rights-labour-survey-to-be-completed-this-year-malhi/",
  "date_published": "2021-06-03T16:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP): Federal Parliamentary Secretary, Ministry of Human Rights Lal Chand Malhi on Thursday said that Child Rights labour survey started last in 2019, would be completed this year.\nHe highlights the government initiatives towards child rights with limited resources in a consultation with policy makers on child Rights organized by Society for the Protection of the Rights of the Child (SPARC) here at local hotel, said a press release.\nHe mentioned that The Zainab Alert, Response and Recovery Bill, 2020, and Ehsaas Undergraduate Scholarship Program as some key steps taken by the government to safeguard the rights of Pakistani children.\nHe also mentioned that the government is also keeping the damage caused by the COVID-19 pandemic in consideration.\nHe further added at legislative level, government supports private bills and bills tabled by opposition party members. On forced conversion issue in Sindh, he stated that report has been prepared after conducting at least 9 high level meeting at provincial level and report’s findings are submitted to Human Rights Commission of Pakistan (HRCP).\nParliamentary Secretary, Federal Ministry National Health Services Regulations and Coordination Dr Nausheen Hamid said that Pakistan has approximately 47 per cent of country’s total population comprised of children under the age of 18, which is half of the total population.\nShe mentioned that the government is very much aware of the issues and primally focusing on child health. “Measures are taken to provide quality health for children. A healthy mind resides in a healthy body,” she said.\nChairman National Assembly Standing Committee on Law and Justice, Riaz Fatyana said that the government has taken certain initiatives in law and Justice, he mentioned the Juvenile justice bill. He also mentioned the gradual behavioural shift towards child labour in society and the paradigm shift towards child protection.\nMehnaz Akbar Aziz, Member, National Assembly, Pakistan hassled that policy makers will have to set aside their differences and work together to protect the future of Pakistan which is possible only through the provision of child rights.\nShe mentioned policymakers need to ensure that overall spending on child rights especially the percentage of developmental budgets in education, child health and nutrition, and child protection are increased.\nChairperson Child Protection Authority, Shamim Mumtaz, Sindh stated that despite providing DNA evidence and confession, the perpetrators are set free due to mutual agreement between victim’s and perpetrator’s families.\nThere are numerous other ways where victims of child abuse are deprived of justice. Moreover, financial constraints to National Commission on the Rights of the Child (NCRC) are hampering valuable and critical service delivery to the vulnerable children.",
  "retrievedAt": "2025-08-11T20:48:23.192Z"
}
