{
  "title": "Govt approves new visa policy pertaining to CPEC projects; Sheikh Rashid",
  "link": "https://www.app.com.pk/national/govt-approves-new-visa-policy-pertaining-to-cpec-projects-sheikh-rashid/",
  "date_published": "2021-06-03T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP): Minister for Interior Sheikh Rashid Ahmed has said the government has approved a new visa policy regarding China Pakistan Economic Corridor (CPEC) projects for Chinese nationals.\nDuring a meeting with Chinese Ambassador Nong Rong here Thursday, the Interior Minister said the minimum period of new visas for Chinese nationals has been set at two years under the new policy.\nAccording to a statement issued by the Interior Ministry, the Minister and the Chinese Ambassador discussed issues of mutual interest including Pakistan-China bilateral relations, CPEC projects, Pak-China bilateral cooperation agreements and visa facilitation for Chinese citizens.\nThe Minister expressed pleasure over the completion of 70 years of diplomatic relations between Pakistan and China. On the occasion, the Minister said that the government has approved the new visa policy for Chinese citizens.\nSheikh Rashid said that Chinese nationals would now be issued two-year work visas within 48 hours from the respective missions, adding that a separate visa category has been created for Chinese citizens related to CPEC projects. Special desks are also being set up at airports to facilitate Chinese citizens.\nThe Chinese Ambassador said that he was grateful to the government of Pakistan for easing visa facilities for Chinese nationals, which would further enhance the relationship between the two countries, increase investment in CPEC related projects and create new job opportunities.\nThe Interior Minister thanked the Chinese government for providing the coronavirus vaccine to Pakistan while the Ambassador commended the arrangements made by Pakistan to control the pandemic.\nSheikh Rashid said that arrangements should be made for return of Pakistani students to China for study as they are facing risk of wasting precious academic year.\nThe Chinese Ambassador said that every possible effort would be made for return of Pakistani students as soon as possible.\nThe Minister said that friendship between Pakistan and China is based on mutual trust and Pakistan is proud of its friendship which will be made stronger.\nThe Chinese Ambassador said that CPEC related projects were the evidences of strong and old relationships between both the countries. He said, Pakistan is China’s Iron Brother and is proud of its bilateral relations.",
  "retrievedAt": "2025-08-11T20:48:25.207Z"
}
