{
  "title": "Shehryar Afridi pledges to include APHC component in global campaign on Kashmir",
  "link": "https://www.app.com.pk/national/shehryar-afridi-pledges-to-include-aphc-component-in-global-campaign-on-kashmir/",
  "date_published": "2021-06-03T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP): Chairman of the Parliamentary Committee on Kashmir Shehryar Khan Afridi on Thursday pledged to give representation to the All Parties Hurriyat Conference (APHC) leaders in the Kashmir Committee’s diplomacy with the global community on Kashmir.\nAddressing the central leaders of the All Parties Hurriyat Conference (APHC) at the headquarters of the APHC, Shehryar Khan Afridi said that since overtaking the affairs of the government, Prime Minister Imran Khan had transformed the country’s policy on Kashmir dispute and the PTI remains committed to the cause of Kashmir.\nHe said humanity is suffering even in the 21st century as Jammu and Kashmir is the place where barbaric crimes are being committed against humanity.\nHe said that Pakistan has a commitment towards the Kashmir cause and no one can change the love bond between the Kashmiri and Pakistani people.\nWhether it is PM’s statement in the UNGA in 2019 or today, the commitment of Imran Khan is unwavering towards Kashmir and its people.\nHe said that whether it was Indian Illegal occupation of Kashmir or the illegal Israeli occupation of Palestine, Pakistan had a principled stance against the occupational regimes and we will never compromise over our commitment with Kashmiris and Palestinian people fighting for freedom from occupational forces.\nHe said that in line with the directions of Prime Minister Imran Khan, he had activated the Kashmir Committee to help raise Kashmir dispute at all national and international forums.\nHe said though the Covid-19 Pandemic had badly hurt the campaign of Kashmir Committee on Kashmir still the Committee had adopted innovative measures to help connect with the international organisations and lawmakers of the world through virtual meetings.\nHe said the Kashmiris needed to be provided international platforms to build the case of Kashmiri freedom struggle and the Kashmiris could convince the world on our freedom movement.\nHe said that Pakistani and Kashmiri youth and rights campaigners must join hands and build campaigns on social and conventional media.\nHe said that he was engaging the Pakistani youth to sensitize them on the Kashmir dispute as due to the failure of past regimes, the youth stands disconnected from the Kashmir cause.\nHe said that Prime Minister Imran Khan’s recent statement on trade with India has left no doubt on Pakistan’s loyalty to Kashmiris.\nConvener APHC, Syed Faiz Naqshbandi said that APHC values steps taken by Kashmir Committee under the chairmanship of Shehryar Afridi.\nGhulam Mohammad Safi, Tehreek-e-Hurriyat (TeH) representative said that the TeH Chairman Ashraf Sehrai had led the freedom struggle by laying down his own life and his son.\nHe lauded the statement of Prime Minister Imran Khan and his commitment to the cause of Kashmir.\nSyed Yousaf Naseem said that the way Shehryar Khan Afridi was leading the struggle for Kashmir had rekindled hopes of the people of Indian Illegally Occupied Jammu and Kashmir. He said that the freedom fighters had took up arms against Indian Illegal occupation under the United Nations conventions.\nAPHC convener Muhammad Hussain Khateeb said that if past governments had tried projecting Kashmir issue as the current PTI government, it might have been possible to avoid incidents like August 5. He said that the Prime Minister had won hearts and minds of all Kashmiris.",
  "retrievedAt": "2025-08-11T20:48:25.744Z"
}
