{
  "title": "Two major ICT projects launched to provide high speed mobile broadband services in Swat",
  "link": "https://www.app.com.pk/national/two-major-ict-projects-launched-to-provide-high-speed-mobile-broadband-services-in-swat/",
  "date_published": "2021-06-03T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP): Ministry for Information Technology (IT) and Telecommunication has launched two major Information and Communication Technology (ICT) projects to provide high speed mobile broadband services in Swat and empower the communities.\nFederal Minister for IT and Telecommunication, Syed Amin Ul Haque and Federal Minister for Communications and Postal Services, Murad Saeed witnessed the contract signing ceremonies in Islamabad on Thursday.\nThe first project worth approximately Rs 781 Million was awarded through Universal Service Fund (USF) to Telenor for providing High Speed Mobile Broadband services in un-served and un-served areas of Swat district while the second project has been launched through the Pakistan Software Export Board (PSEB) to build a 22,000 square feet Software Technology Park (STP) in Mingora.\nThe provision of high speed mobile broadband services contract was signed by Haaris Mahmood Chaudhary, Chief Executive Officer, USF with Kamal Ahmed, Chief Corporate Affairs Officer, Telenor and the STP contract was signed by Usman Nasir, Managing Director, PSEB with Abdul Aziz, Chief Executive Officer, Vertexsoft Private Limited.\nFederal Secretary, IT and Telecommunication, Dr. Sohail Rajput, Chairman PTA, Major General (R) Amir Azeem Bajwa, Member Telecom, Muhammad Omar Malik and Member IT, Syed Junaid Imam were also present at the ceremony.\nAddressing the ceremony, Federal Minister for IT and Telecommunication, Syed Amin Ul Haque said, “Swat district is famous for its historical civilization and its most beautiful valleys, rivers and mountains which makes it a tourist paradise. We wanted to equip this beautiful district with ICT facilities to connect it to the digital world.\nThis dream is being realized today as we are digitally transforming the most remote and far-flung areas of Swat.”\nThe Federal Minister for IT and Telecommunication said that 65,695 people will benefit from High Speed Mobile Broadband services in 50 muazas spread over an area of ??1,501 sq. km. He also pointed out the multitude of challenges like mountains and difficult terrain in the area and considered it an important achievement of the USF.\nSyed Amin Ul Haque said, “A state-of-the-art STP is being set up in Mingora through a public-private partnership between PSEB and Vertexsoft. With the establishment of the STP, thousands of skilled youth from Swat and Malakand division, especially small and medium enterprises, will have the opportunity to connect with all the global market.\nThis is just the beginning! We want the youth of this most beautiful district to be provided with wonderful opportunities so they can earn respectable and attractive profits.”\nSyed Amin Ul Haque said that more than 500 IT professionals will be able to set up their startups in the software park, thus providing direct or indirect employment opportunities to almost 2,000 people.\nHe also said that we are establishing public-private partnerships to set up STPs and by the end of this year, there will be more than 25 STPs across the country.\nFederal Minister for IT and Telecommunication added that with an increase of 45.8% in the IT exports from July to April in the current financial year, exports have reached $1.7 Billion and expected to reach the target of $5 Billion by 2023.\nWhile addressing the ceremony, Federal Minister for Communications, Murad Saeed thanked the Federal Minister for IT and Telecommunication, Syed Amin Ul Haque for launching the ICT projects in Swat district.\nHe commended the Ministry of IT and Telecommunication’s dedication to achieve the Prime Minister’s Digital Pakistan vision. He also said that the people of Swat are not only friendly and hospitable but highly capable and skilled and through these ICT projects, the residents of Swat district will be able to showcase their talents and abilities to the rest of the world.\n“We believe ICT is one of the greatest equalisers in bridging the digital divide, said Kamal Ahmed, Chief Corporate Affairs Officer at Telenor Pakistan. “In today’s digital world, connectivity has become a fundamental right, an essential utility! We believe that digitisation and connectivity proliferation will fuel Pakistan’s national development. That is why every day Telenor strives to connect people to what matters most.\nOver the years, Telenor and USF have successfully teamed up in bringing digital connectivity to various underserved areas of the country. Today, Telenor Pakistan and USF have signed a contract that will bring state-of-the art cellular services to the underserved areas of Swat Valley; this will open up doors for the wonderful people of Swat to wonders of the digital world”.\nAlso, sharing his thoughts at the ceremony, CEO USF, Haaris Mahmood Chaudhary said, “USF is actively working to provide robust connectivity in Khyber Pakhtunkhwa province. We are playing our role in making Digital Pakistan vision a reality and bridging the digital divide. We look forward to working with Telenor to improve the lives of the un-served and under-served communities of the Swat district.”\nSharing his thoughts at the ceremony, Usman Nasir, Managing Director, PSEB said that on the direction of the Federal Minister for IT and Telecommunication, our first priority is to set up a network of STPs across the country and take IT exports to record levels.\nSenior officials of the Ministry of IT, USF, PSEB and Telenor were also present at the ceremony.",
  "retrievedAt": "2025-08-11T20:48:26.573Z"
}
