{
  "title": "Scheduled vaccination of 18-29 years citizens starts",
  "link": "https://www.app.com.pk/national/scheduled-vaccination-of-18-29-years-citizens-starts/",
  "date_published": "2021-06-03T17:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP): The scheduled vaccination has been started on Thursday for citizens of age group 18 to 29 years and the vaccination center and date will be communicated through SMS as per turn.\nAccording to an official of the Ministry of National Health Services, Regulations, and Coordination, the vaccination registration was already continued across the country as Pakistan’s vaccine supply continues to improve and the country’s vaccination capacity gets enhanced day by day.\nHe said that the country has locally finished a coronavirus vaccine with the help of Chinese experts as the vaccine named PakVac has passed rigorous internal quality control checks and testing at the National Institute of Health (NIH) with the help of Cansino Bio Inc. China.\nHe said that the first batch of bulk vaccines was processed at the NIH plant, which was set up for this purpose last month by having a specially trained team.\nHe said that due to the agreement on technology transfer, the National Institute of Health will be able to produce three million doses per month which will significantly reduce the country’s dependence on other countries.\nHe said that Pakistan will become largely self-sufficient in meeting its COVID-19 vaccine needs as it started producing the single-dose CanSino Bio vaccine locally. He said that China is a strong partner and has gone out of its way in keeping up a supply chain and transferring technology to Pakistan.\nHe said that out of the total stock of vaccine doses imported, ninety-one percent was purchased by the government while the remaining nine percent were gifted by China. He said that the government has planned to vaccinate 70 million population by the end of the year 2021.\nIt is pertinent to mention here that the government had started registration for persons aged 30 and above from May 16 while it had started registration for the coronavirus vaccination for people aged between 40 to 49 years across the country on May 3.\nMeanwhile, National Command and Operation Center (NCOC) on Thursday said that 89 new cases of Coronavirus were reported from the federal capital during the last 24 hours.\nAccording to an official of NCOC, as many as 100 cases were reported on Wednesday while 62 cases were reported on Tuesday.\nHe said so far 81,446 cases were reported from the federal capital while 763 deaths were reported from Islamabad Capital Territory (ICT). He added 76,485 patients had been recovered completely.",
  "retrievedAt": "2025-08-11T20:48:21.362Z"
}
