{
  "article_id": "2025-09-23_c8dc37d07a18ce3cc6464ecde88cde7d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-hails-saudi-leadership-reaffirms-pakistans-unwavering-support-on-kingdoms-95th-national-day/",
    "retrieved_at": "2025-10-11T23:26:10.670Z"
  },
  "metadata": {
    "title": "Gilani hails Saudi leadership, reaffirms Pakistan’s unwavering support on Kingdom’s 95th National Day",
    "author": null,
    "date_published": "2025-09-23T21:34:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 446,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, September 23 (APP):Chairman Senate Syed Yousaf Raza Gilani on Tuesday attended a ceremony at Jinnah Convention Centre as the chief guest to mark the 95th National Day of the Kingdom of Saudi Arabia, where he congratulated the Saudi leadership and people on the auspicious occasion. In his address, the Chairman Senate extended heartfelt felicitations to King Salman bin Abdulaziz, Crown Prince Mohammed bin Salman, and the people of Saudi Arabia, praising the visionary leadership of King Abdulaziz Al Saud whose struggle, he said, laid the foundation of modern Saudi Arabia. \"Saudi Arabia today stands as a beacon of stability, faith, and progress in the Islamic world,\" Gilani remarked, emphasizing that relations between Pakistan and Saudi Arabia were rooted in hearts, faith, and shared aspirations. \"Every Pakistani holds a spiritual bond with the Kingdom, as the Two Holy Mosques are the centre of devotion for all Muslims,\" he added. Recalling the historic 1974 Islamic Summit in Lahore, Gilani termed it a proud legacy of Muslim unity and reaffirmed Pakistan's unwavering commitment to the protection of Haramain Sharifain. He underscored that the Pakistan-Saudi strategic defence agreement would serve as a milestone, carrying a powerful message of unity and solidarity across the Muslim Ummah. \"Pakistan has always stood firm in safeguarding Saudi Arabia's sovereignty and territorial integrity. Protecting the Holy Mosques is not only a responsibility but also a sacred duty and honour,\" he stressed, while calling for greater solidarity against extremism, emerging threats, and Islamophobia. Sharing his personal experiences, Gilani said his visits to Saudi Arabia as Prime Minister in 2008 and 2011 were instrumental in strengthening bilateral trust and cooperation, while his recent visit as Chairman Senate further reinforced parliamentary diplomacy. He noted that Pakistan and Saudi Arabia were close partners in energy, economy, and human resource development. The investment initiatives under Saudi Vision 2030, he added, were opening new avenues for bilateral relations. \"The Pakistani community in Saudi Arabia is a living bridge of friendship between our two nations,\" he said. Paying tribute to Saudi Ambassador Nawaf bin Said Al-Maliki, Gilani lauded his diplomatic services for promoting bilateral relations. He reiterated that Pakistan and Saudi Arabia would continue to expand cooperation in defence, economy, culture, and people-to-people linkages. \"On Saudi Arabia's National Day, we renew the bonds of faith, trust, and brotherhood that define our relations,\" he concluded. Speaking on the occasion, Saudi Ambassador Nawaf bin Said Al-Maliki praised Chairman Senate Yousaf Raza Gilani and the people of Pakistan, describing Pakistan as one of Saudi Arabia's closest friends. He said the ties between the two brotherly nations had grown stronger over time and were of vital importance for peace, progress, and prosperity in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}