{
  "article_id": "2025-09-23_7b81d94832c46f0eb43d423eb8a878e8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/welfare-groups-distribute-over-7300-tons-humanitarian-aid-in-flood-hit-areas-ndma/",
    "retrieved_at": "2025-10-11T23:25:55.527Z"
  },
  "metadata": {
    "title": "Welfare groups distribute over 7,300 tons humanitarian aid in flood hit areas: NDMA",
    "author": null,
    "date_published": "2025-09-23T22:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 234,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 23 (APP): Welfare groups have distributed over 7,348 tons of humanitarian aid in flood-affected areas while the National Disaster Management Authority (NDMA) has facilitated the delivery of nearly 3,000 tons by mobilising private sector and industrial partners. Under NDMA's supervision, relief operations are actively underway in the flood hit areas with coordinated participation from government institutions and welfare organizations. Alkhidmat Foundation, Minhaj Foundation, Saylani Trust, JDC, Faizan Global Relief Foundation, Helping Hand for Relief and Development (HHRD), and KS Relief are among the key contributors providing essential supplies to flood victims. International partners including Islamic Relief Pakistan, Qatar Charity, Muslim Aid, WHH, and Muslim Hands are also engaged in delivering aid. Additional organisations such as Human Appeal, HANDS, Action for Humanity, SDF, Youth Social Ambassadors, IOM, WHO, and SRSP are supporting on-ground relief efforts. WFP, FAO, and the Aga Khan Agency for Habitat are undertaking targeted measures to assist affected communities. With NDMA's guidance, welfare organizations have set up medical camps and mobile health units, while distributing food, clean drinking water, tents, warm clothing, hygiene kits, mosquito nets, and ambulances to meet urgent needs. NDMA is also designating specific operational zones for welfare groups based on regional requirements and continues to monitor relief efforts under special instructions from the prime minister. These joint efforts aim to ensure that the needs of flood victims are met efficiently and comprehensively across all affected regions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}