{
  "article_id": "2025-09-23_2ea94bb08c9504d9c7b2e5a5b8fa8702",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/federal-minister-highlights-role-of-biosciences-in-strengthening-pakistans-agriculture/",
    "retrieved_at": "2025-10-11T23:26:12.009Z"
  },
  "metadata": {
    "title": "Federal Minister highlights role of biosciences in strengthening Pakistan’s agriculture",
    "author": null,
    "date_published": "2025-09-23T21:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 277,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 23 (APP): Federal Minister for National Food Security and Research, Rana Tanveer Hussain highlighted the role of biosciences in strengthening Pakistan's Agriculture, saying, \"Agriculture is the backbone of the economy and modern biosciences can give new life to this sector.\" This, he stated while addressing as a Chief Guest at the first international academic and research conference on biosciences held at Allama Iqbal Open University on Tuesday. The conference was organized by the Department of Biology, Faculty of Sciences, which was attended by renowned national and international scientists and experts. The Minister expressed regret that Pakistan was lagging behind India in this field, emphasizing that advancing biosciences would open new avenues for development, ensuring a bright future for coming generations. He also praised the university and Vice-Chancellor Dr Nasir Mahmood for their outstanding performance, noting that under his leadership, admissions increased from 800,000 to 1.2 million in a short period which was an extraordinary achievement. Vice-Chancellor Prof Dr Nasir Mahmood, in his address, stated, \"Pakistan is currently facing various serious challenges, including climate change, natural disasters, increasing environmental pollution, resource scarcity and socio-economic issues,\" emphasizing that integrative research could provide sustainable solutions to all these problems. He further stated that research should not be limited to theoretical aspects only; it should be directly linked to public welfare. He also focused that technological advancements and modern scientific knowledge should be harmonized with social and economic development to enhance national-level policymaking and enabling Pakistan to play a more effective role on the global stage. The Vice-Chancellor expressed heartfelt gratitude to the conference organizers and partner institutions, especially the Higher Education Commission, for their invaluable efforts and support.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}