{
  "title": "COVID-19: ILO requested to convene virtual session for resolving labourers issues",
  "link": "https://www.app.com.pk/national/covid-19-ilo-requested-to-convene-virtual-session-for-resolving-labourers-issues/",
  "date_published": "2020-04-30T21:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 01 (APP):Pakistan on Friday urged the International Labour Organization (ILO) to convene a virtual session of its member states to evolve a comprehensive strategy for betterment of the labourer community in the post-coroanvirus world.\nOn behalf of the government of Pakistan, Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari forwarded the request to ILO Director General Guy Ryder in writing, on the occasion of World Labour Day.\nIn a letter, a copy of which is available with APP, the SAPM highlighted the issues faced by the workers in Pakistan and across the globe due to the coronavirus pandemic.\nHe underlined the need for initiating a global dialogue to develop a way forward which could help minimize impact of the global pandemic on the working class.\nHighlighting the issues of Pakistan in the midst of coronavirus, he said it was not his country alone where the coronavirus posed a great challenge to the labourers. All the developing economies in the region and world faced the similar challenges, he added.\nZulfikar Bukhari passionately called for collective efforts to resolve the issue of labourers, who had been bearing the brunt of global pandemic worldwide.\nHe said: “This is an emergency situation for governments around the world, and on the occasion of labour day 2020, it is most important that there is start of a global dialogue leading to a global recovery.”\n“To enable a strategic dialogue to discuss ‘THE FUTURE OF WORK IN A POST-COVID WORLD’ for all workers specially those in the developing world, I urge you to call a special virtual session with representation from all ILO member countries, agencies, enterprises, organisations, groups/individuals to establish a way forward in a world emerging from a global crisis,” he maintained.\nThe SAPM also informed the Director General about the major concerns of his ministry regarding the Pakistani labourers.\nHe pointed out that a quarter of population in Pakistan lived below the poverty line and another portion of the society was prone to fell into the extreme poverty due to the virus impacts on economy.\n“This alone leads us far behind from achieving the ILO 2030 agenda,” he warned.\nHe said 7 out of every 10 workers were not part of the registered workforce in the country which might cause 74 per cent rise in relative poverty rates of the informal workers.\n“With 6.75% of Pakistan’s GDP coming from remittances of migrant workers, my third cause of concern is also the Pakistani workforce facing joblessness & salary cuts in foreign lands,” he added.\nThe SAPM, in the letter, told the Director General about the initaives taken by his government to protect downtrodden segments of the society and the Small and Medium Enterprises (SMEs) from the economical affects of the coronavirus.\n“Pakistan’s PKR 1.2 trillion stimulus package is not common for economies of our size. A major part of this package is tax relief, financial assistance to 3.5 Million SMEs & the facilitation of two of our biggest sectors of employment: construction & agriculture.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:10:12.894Z"
}
