{
  "title": "19 August to be remembered as Black Day in Parliamentary History: Ayaz Sadiq",
  "link": "https://www.app.com.pk/national/19-august-to-be-remembered-as-black-day-in-parliamentary-history-ayaz-sadiq/",
  "date_published": "2024-08-18T11:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Speaker of the National Assembly, Sardar Ayaz Sadiq on Sunday said that August 19 will always be remembered as the darkest day in the parliamentary history of the country.\nThe speaker said, “Ten years ago, on this day, a conspiracy against democracy was hatched, and the Parliament House was besieged and ransacked by the workers of so-called political parties.”\n“Shameful act is highly condemnable in every sense of the word. Parliament, being the supreme institution, deserves respect and dignity”, he expressed these views in his message on the eve of completion of 10 years of the attack on the Parliament. He also underscored that protecting the sanctity of the Parliament is a collective responsibility and violating the sanctity of Parliament is unimaginable for any democratic individual.\nHe lamented that the heartbreaking memories of the day would remain etched in the minds of the people and keep reminding them of the attack on democratic values and principles. He also noted that the attack on the parliament was not only an attack on democracy but also a blow to the basic pillars of the State.\nThe Speaker praised the bravery and perseverance of all the parliamentarians, staff and security personnel of the Parliament, for defending the Parliament under such hostile circumstances.\nThe Speaker also appreciated the role of the leadership and MPs of the then government, the largest opposition party in the Parliament including the Pakistan Peoples Party and other political parties as they played an active role in thwarting the attack on the Parliament and the heinous conspiracy against democracy.\nHe said that during the heinous attack on Parliament in August 2014 the passage of the MPs was blocked off and attempts were made to paralyze the democratic process.\nHe also said that an aborted attempt was made, but the Members of Parliament bravely foiled this nefarious conspiracy.\nHe also said that the 2014 protests and sit-ins compromised the image of Pakistan around the world. He said that because of sit-ins outside the Parliament, the President of China had to cancel his visit, and as a result, Pakistan lost foreign investments worth billions of dollars.\nHe remarked that such attacks have further strengthened our determination and resolve to protect democratic institutions. The Speaker urged the people to unite and keep on playing their constructive role to protect democracy in the country.\nDeputy Speaker Syed Ghulam Mustafa Shah in his message said that the attack on Parliament during 2014 was a tragic incident. He said that these attacks indicated the ill intentions of those involved in sit-ins, which were tantamount to weakening the democratic institutions and democratic system.\nThe Deputy Speaker stressed the need for all political parties to take essential steps to prevent such incidents in the future.",
  "retrievedAt": "2025-08-11T04:44:34.614Z"
}
