{
  "title": "PTI severely damaged country’s economic, political landscape: Talal",
  "link": "https://www.app.com.pk/national/pti-severely-damaged-countrys-economic-political-landscape-talal/",
  "date_published": "2024-08-18T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Senior leader of Pakistan Muslim League Nawaz (PML-N), Senator Talal Chaudhry said on Sunday that the Pakistan Tehreek-e-Insaf (PTI) government, during its four-year tenure, severely damaged the country’s economic and political landscape.\nReacting to an alleged chat with an Indian journalist by Raoof Hassan, Talal Chaudhry claimed that Hassan had been in contact with anti-Pakistan foreign journalists, including those from India.\nHe further alleged that PTI’s team was advising the IMF against making deals with Pakistan at the time, and that Hassan was sharing sensitive material with anti-Pakistan journalists.\nHe said that the chaos and divisive politics in Pakistan were not the result of a single individual, but involved various politicians, political parties, and even individuals within institutions. Chaudhry alleged that efforts to weaken Pakistan were orchestrated by multiple actors.\nHe asserted that now, there will be zero tolerance for anti-state elements.\nStressing the need to improve the quality of life for ordinary citizens, Talal Chaudhry said, “Pakistan is here to stay, and we must strengthen its economy once again.”\nHe urged other political parties and institutions to engage in the process of accountability, insisting that it is vital for the country. “If one key institution has initiated accountability from within, other institutions must follow suit,” he added.\nRecalling the period before the start of the China-Pakistan Economic Corridor (CPEC), he said that deliberate efforts were made to disrupt the country’s progress through sit-ins.\nRecalling the PML-N government led by Nawaz Sharif, he said, “at that time livelihood of the common man was stable, the stock exchange was thriving, the dollar was under control, and inflation was at its lowest.” However, he lamented that certain decisions led to a surge in protest politics, causing significant harm to the national economy.\nHe said that the current government is working for the welfare of the people and is determined to provide relief to them.",
  "retrievedAt": "2025-08-11T04:44:08.170Z"
}
