{
  "title": "Civil society activists demand regulatory body to resolve brick kiln worker issues",
  "link": "https://www.app.com.pk/national/civil-society-activists-demand-regulatory-body-to-resolve-brick-kiln-worker-issues/",
  "date_published": "2024-08-18T07:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Civil society activists had demanded a regulatory body to resolve the issues of brick kiln workers.\nTalking to App here on Sunday, Farzana Bari, a human rights activist, said that the majority of the brick kiln workers complained about the low wages of their work, violating the minimum level of wages under labor law and making it hard for them to meet both ends of their lives.\nShe added that it was revealed that bonded labor, harassment, child labor, exploitation, and not paying minimum wages to employees were common.\nShe said, “Workers are facing severe challenges, including lack of basic facilities, long working hours, leaves in emergencies, medical facilities, and hazardous working conditions.”\nAyub Malik, a human rights activist, said, “There are a number of women who are facing plenty of challenges but continue their work to feed their families.”\nAfshan Tehseen Bajwa, former Chairperson of the of the National Commission on the Rights of the Child (NCRC), said, “The brick kiln industry is actually run by businessmen, and owners don’t register their kilns with the labor department so that they don’t have to provide social security and old-age benefits to the workers.”\nShe said, “Their living condition is alarming, with a lack of basic amenities throwing them into a vicious cycle of poverty.”\nShe urged the proper implementation of existing laws towards the most neglected sector, whose workers are largely deprived of their legal rights and entitlements and forced to work in unhealthy and unsafe environments, and demanded new laws for their protection and safety.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:45:40.572Z"
}
