{
  "title": "Flash flood likely in Larkana, Jacobanad, Qamar Shandadkot in next 36 hours",
  "link": "https://www.app.com.pk/national/flash-flood-likely-in-larkana-jacobanad-qamar-shandadkot-in-next-36-hours/",
  "date_published": "2024-08-18T10:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): The Federal Flood Commission (FFC) has said that high-level flash flooding is expected in Sind {Larkana (Jacobabad & Qambar Shandadkot districts) and Hyderabad (Dadu & Jamshoro Districts) Divisions) during the next 36 hours.\nAccording to the daily FFC report on Sunday, the River Indus is flowing in “Medium Flood” in Guddu-Sukkur reach and “Low Flood” between Tarbela-Taunsa reach while the Kabul River also continue to run in “Low Flood” at Nowshera. Other main rivers (Jhelum, Chenab, Ravi & Sutlej including River Indus at Kotri Barrage) are flowing normally.\nThe combined live storage of the country’s major reservoirs (Tarbela, Chashma & Mangla) stands at 10.927 MAF which is 81.83% of the total available live storage capacity of 13.354 MAF.\nYesterday’s well-marked low-pressure system over the Bahawalpur Division has since\\weakened into a low-pressure area, now centred near the Larkana district. Trough of strong Westerly Wave that developed yesterday persists over the Northern Afghanistan and is expected to impact the upper catchments of rivers Indus, Jhelum and Kabul. Also, moderate to strong moist currents are penetrating Sindh, Southern Punjab and adjoining areas of Balochistan from the Arabian Sea up to 7000 feet, whereas light to moderate moist currents continue to influence upper parts of Pakistan upto 5000 feet.\nFurther, a fresh well-marked low-pressure area has developed over North Bay or Bengal and adjoining Bangladesh.\nFor the next 24 hours, Flood Forecasting Division (FFD), Lahore has predicted scattered thunderstorm rain of Moderate Intensity with isolated Heavy falls over Islamabad, Punjab (Rawalpindi, Sargodha, Gujranwala, Lahore, Faisalabad, Sahiwal, Multan & Bahawalpur Divisions), Khyber Pakhtunkhwa, Sindh (Mirpur Khas) and Balochistan (Quetta) including the upper catchments of all major rivers of 1RS.\nWidespread thunderstorm rain of Moderate to Heavy intensity with scattered Very Heavy and Isolated Extremely Heavy Falls may occur over Punjab (D.G. Khan Division) and Balochistan (Zhob, Nasirabad, Loralai, Sibbi, Kalat and Makran Divisions) during the same period. As a result of these conditions, High to Very High Level Flash Flooding is anticipated in the hill torrents of D.G. Khan Division (Punjab) and the Nullahs of Balochistan (Sibbi, Nasirabad, Loralai, Zhob & Kalat Divisions) over the next 36 hours.",
  "retrievedAt": "2025-08-11T04:44:36.399Z"
}
