{
  "title": "Lifting heavy objects can lead to ‘cardiac problems’ Dr Azhar Kiyani  warns",
  "link": "https://www.app.com.pk/national/lifting-heavy-objects-can-lead-to-cardiac-problems-dr-azhar-kiyani-warns/",
  "date_published": "2024-08-18T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Esteemed Cardiologist Major General (retired) Dr. Azhar Kiyani underscored the vital importance of awareness and healthy habits in preventing cardiac vein blockages while cautioning citizens against the perilous consequences of lifting heavy objects, which can significantly increase the risk of heart-related problems.\nTalking to PTV news channel, Azhar Kiyani urged individuals to prioritize their cardiovascular well-being through informed choices and mindful living.\nCardiologist Major General (retired) has shed light on a often-overlooked risk factor for heart problems, lifting heavy\nobjects and stressed public awareness campaign on national level.\nDr. Kiyani warned citizens that lifting heavy objects can lead to serious cardiac complications, including heart attacks, strokes, and even death.\nAccording to Dr. Kiyani, the physical strain of lifting heavy objects can cause a sudden spike in blood pressure, which can be catastrophic for people with pre-existing heart conditions.\nAdditionally, heavy lifting can also lead to cardiac arrhythmia, or irregular heartbeats, which can further increase the risk of heart-related problems, he added.\nDr. Kiyani emphasized that it is crucial for individuals to be mindful of their physical limitations and take necessary precautions when engaging in heavy lifting.\nHe advised citizens to avoid lifting objects that are too heavy, to bend at the knees instead of the waist, and to take regular breaks to avoid fatigue.\nBy raising awareness about this hidden danger, Dr. Kiyani hopes to empower individuals to take control of their heart health and reduce their risk of cardiac problems. Remember, a healthy heart is just a lift away.\nResponding a query, Dr. Kiyani further elaborated on the dangers of heavy lifting, explaining how it can lead to the blockage of heart veins.\nWhen you lift something heavy, your body’s blood pressure surges to compensate for the increased physical demand,” he explained.\n“This sudden spike in blood pressure can cause the veins in your heart to become blocked, leading to a range of serious health problems,” he added.\nDr. Kiyani emphasized that these dangers are not limited to people with pre-existing heart conditions, adding, anyone can be at risk, regardless of age or health status.",
  "retrievedAt": "2025-08-11T04:44:55.573Z"
}
