{
  "title": "Tourists, Murree residents urge CM Punjab for notice broken cable car, chair lift service in Patriata",
  "link": "https://www.app.com.pk/national/tourists-murree-residents-urge-cm-punjab-for-notice-broken-cable-car-chair-lift-service-in-patriata/",
  "date_published": "2024-08-18T14:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):The tourists and residents of Murree on Sunday decried the out of order cable car and chair lift service in Patriata demanding Chief Minister Punjab, Maryam Nawaz to take notice of the situation and negligence of the authorities concenred.\nThe Patriata Cable Car has broken down for a year but not a single effort was made by the Tourism Development Corporation of Punjab and the government of Punjab to fix the out of order tourism service, said Tariq Mehmood, a Murree resident and frequent tourist told APP who was heading a foreign tourists’ group that went disappointed after finding the service unavailable.\n“Murree is the most famous tourist destination of Pakistan and the closest to Islamabad where people from all over the country come to beat the heat during summers. The hotel industry here is thriving but there is lack of public washrooms provided by the government at such a big tourist destination and there is often a shortage of water here,” he added.\nTariq mentioned that Patriata which is one of the highest point of Punjab province has a chair lift and a cable car. The government of Punjab has spent crores of rupees on the cable works. The staff for managing this is drawing salaries sitting at home. This chair lift has been lying down inactive for a year and no one thought of repairing it. Due to which the department lost crores of revenue, he said.\nPunjab Chief Minister, Maryam Nawaz did a great job by announcing the glass train project but she should also pay attention on neglected important tourist sites so that the country’s resources were not wasted, he added.\nThe tourists while expressing their views mentioned that such places and facilities were important landmarks promoting culture, tourism potential and natural beauty that was tempting for every tourists but negligence of the official authorities was deplorable. They also urged the quarters concerned to take proactive action to address the issue and provide better tourism facilities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:44:31.536Z"
}
