{
  "title": "Govt taking steps to increase investment in petroleum sector: Dar",
  "link": "https://www.app.com.pk/national/govt-taking-steps-to-increase-investment-in-petroleum-sector-dar-2/",
  "date_published": "2024-08-18T09:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar on Sunday said the government was taking steps to increase foreign investment in the petroleum sector by resolving the key issues of the sector.\nThe Deputy PM, presiding over the first meeting of a committee, formed to consider the issues faced by the petroleum sector’s E&P companies and to resolve issues of the industrial sector, resolved to take every possible step to provide all facilities to the foreign companies that would help attract further investment in the country.\nThe meeting considered the recommendations to improve the financial system for off-shore exploration.\nDeputy PM also directed to prepare a framework to implement the recent amendments made in the Petroleum Policy 2012.\nHeads of local and foreign E&P companies, on the occasion, highlighted concerns about the security and stability of the sector due to increased circular debt.\nDeputy PM directed the relevant authorities to resolve the issue of circular debts in the power sector on priority.\nPrivate sector members of the committee also expressed their concerns regarding the downstream gas sector and stressed the need to open up the sector to private companies to improve its sustainability.\nAfter detailed discussions, the forum directed the Petroleum Division to work closely with the industry and other stakeholders.\nThe forum also directed the Petroleum Division to suggest appropriate amendments to the Ogra Ordinance to introduce a mechanism for the adjustment of gas rates on a monthly or quarterly basis.\nOn security issues, the Forum directed the Interior Division to work closely with E&P companies and other stakeholders.\nThe Interior Division was also mandated to develop a dedicated one-window facility system at the federal and provincial levels to ensure security for operations in challenging areas.\nThe meeting was attended by Minister for Petroleum Musadiq Malik, Minister for Power Awais Ahmed Khan Leghari and other members of the committee.",
  "retrievedAt": "2025-08-11T04:45:17.952Z"
}
