{
  "title": "People’s welfare top priority of govt: Kayani",
  "link": "https://www.app.com.pk/national/peoples-welfare-top-priority-of-govt-kayani/",
  "date_published": "2024-08-18T17:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Bilal Azhar Kayani, convener of the National Parliamentary Task-force (NPT) on Sustainable Development Goals (SDGs), said on Sunday that the despite of the current economic situation in the country, providing relief to the people was top priority of the government.\nTalking to a private news channel, he said that the Prime Minister initiated Rs 50 billion energy subsidy package for low-income households that consume less than 200 units of electricity.\nThe three-month subsidy package will help alleviate issues of around 86 percent of consumers using up to 200 units of electricity, he added.\nHe said that the Chief Minister Punjab also initiated electricity relief package for the commoners of the province.\nCustomers using up to 500 units will get a subsidy of Rs14 per unit in August and September, he added.\nThe relief plan, expected to cost Rs 45 billion, will be funded by reducing the province’s development expenditures, he further added.\nHe said that the government allocated development funds for the expansion of IT sector to increase IT exports.\nEstablishment of institutions like Universal Service Fund (USF) aimed at providing broadband availability across the country, he added.\nKayani said that institutes like Universal Service Fund (USF) were established to provide telecommunication services in un-served and under-served areas of the country\nProvision of Internet throughout the country is among the government’s priorities because it is fundamental requirement for any growing economy, he added.\nThe government, the information technology (IT) industry and all the stakeholders have to work together to solve the problems, he further said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:44:05.253Z"
}
