{
  "title": "Exorbitant prices of back-to-school supplies haunt inflation-stricken parents",
  "link": "https://www.app.com.pk/national/exorbitant-prices-of-back-to-school-supplies-haunt-inflation-stricken-parents-2/",
  "date_published": "2024-08-18T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):As back-to-school essentials shopping is picking up pace with reopening of the educational institutions in the country after summer vacations, parents are grappling with the higher prices on all the essential school items.\nMost of the private schools start their new academic session after the summer break and it is a common practice for many parents to buy the back to school essentials for their kids prior to the opening of the schools by physically visiting the designated stationary stores or ordering through the online suppliers.\nThe price of school supplies from glue, color pencils, markers, lunch box, water bottle, geometry box, school bags, and cut box to textbooks, notebooks and uniforms has registered a significant increase which made it difficult for families, especially salaried class, to manage the educational expenses.\n“I have spent around Rs 20,000 to purchase the textbooks and notebooks for my son promoted in Grade-III while the stationary, uniform and other essential stuff are still to be purchased which I will buy on weekend as the students can wear colored clothes during the first week”, Hammad Ali, a parent of two said.\nAlthough it has become difficult to bear the expenses of my one school going son who is studying in private schools but we have no option left when the government institutions lack facilities and educational standards, he lamented while talking to APP on Thursday.\nAyesha Malik, a mother of three kids, said, “I was shocked to hear the price of trolley bag during my visit to the school supplies shop what to talk of other items”.\nTalking to APP, she said, “The price of an ordinary trolley starts from Rs. 8,000 while those having fewer prices are not durable enough to be dragged in a long way in school premises. Getting education in a private school has become a luxurious practice keeping in view the increasing fee structure, expensive textbooks and a long list of stationary and other items”.\n“Not only the parents have to buy all the stationary themselves but these schools also grab annual charges for stationary too in the name of art work, overburdening the parents”, she observed.\nAnother parent, Farah Hamid said that instead of making things easier for the parents, the private schools provided a long list of stationary items to the parents for buying which is usually not fully utilized during the whole year.\nShe urged the concerned authorities to keep check on unusual increase in the prices of school items in the markets and take action against the unjust price hike.\nTahir Mehmood, who is associated with the profession of teaching for a long time, said that parents already struggling amid rising inflation and facing a cost of living are forced to pay high prices of the essential school items of their kids.\nHe said that back-to-school shopping is really stressful for them but they have to pay as being parents they consider these items as an essential category in their shopping list.\nThey are making some real sacrifices and leading uncomfortable life in these days due to soaring inflation, high priced fuel, electricity and gas.\nPrices of school items like shoes, uniform, backpack and lunch boxes, crayons, markers, notebooks, chart papers, binders, paper, pens, erasers and pencils have been increased substantially due to the prevailing inflation.\nZia Saleem, who is the owner of stationary shop in F-8 Markaz, said that the inflation has no only distressed the parents of the school going kids but every section of life.”\nHe revealed that the price of back to school essentials has registered a significant increase this year as compared to the last year. The notebooks which were sold at Rs. 250 each last year are now being sold at Rs. 500 due to increasing price of paper.\n“We cannot less the price of stationary items on our own as we are getting these items on increased prices too. Ultimately, we are left with no option but to shift this burden on the customers”, he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:44:53.308Z"
}
