{
  "title": "Efforts on to put economy back on track of sustainable growth: Dar",
  "link": "https://www.app.com.pk/business/efforts-on-to-put-economy-back-on-track-of-sustainable-growth-dar/",
  "date_published": "2023-03-26T10:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP):Minister for Finance and Revenue Senator Muhammed Ishaq Dar has said that the government is making all possible efforts to steer the economy of the difficult situation in order to put it on the path of sustainable economic growth.\nAddressing as chief guest an Iftar dinner hosted by the Islamabad Chamber of Commerce and Industry (ICCI) in honor of foreign diplomats, Dar said that friendly countries were expected to materialize their commitments with Pakistan that would pave the way to close the deal with the IMF and revive the economy.\nHe said that in 2016, Pakistan was a rising economy as it was expected to become the world’s 18th-strongest economy, but was now facing serious economic challenges.\nHe said that Pakistan would not default and the government was making all possible efforts to steer it out of a difficult situation in order to put it on the path of sustainable economic growth.\nHe lauded the initiative of ICCI for hosting an Iftar dinner for diplomats.\nSpeaking at the occasion, Ahsan Zafar Bakhtawari, President ICCI urged the government to ensure consistency in economic policies that would enable the business community and investors to invest in Pakistan with confidence.\nHe assured that the business community would fully support the government in its efforts to revive the economy.He highlighted the business and investment opportunities in Pakistan for diplomats and said that Pakistan was a huge market of over 220 million consumers and offered great investment opportunities in various sectors of its economy.\nHe said that foreign investors should transfer technology to Pakistan and explore joint ventures and investments in areas of interest.\nTariq Fazal Chaudhry, former federal minister said that the government was determined to promote ease of doing business and hoped that the current difficult phase would be over soon.\nFaad Waheed, Senior Vice President ICCI said that Pakistan needed exports to overcome its foreign exchange crisis and hoped that the foreign diplomats would fully cooperate with Pakistan in realizing this goal.\nEngineer Azhar ul Islam Zafar, Vice President ICCI thanked the chief guest, diplomats and all the participants for attending the Iftar dinner.\nHe said that if the government created a more conducive business environment, the private sector would be able to improve the health of the economy.\nJunaid Afzal, Chairman, Nova Group said that with the efforts of Ahsan Zafar Bakhtawari, President ICCI, Nova Group was working out on an attractive discounted package of residential and commercial plots for the members of the business community.\nHe said that Nova Group would cooperate with ICCI for the establishment of an industrial park in the region.Zafar Bakhtawari, former President ICCI said the business community is hopeful that Finance Minister Ishaq Dar will soon conclude a deal with the IMF that will enable Pakistan to cope with its current economic crisis.\nHe urged the government to work hard to end the country’s reliance on foreign loans and make it self-sufficient and assured that the business community would fully support in achieving this goal.\nAtadjan Movlamov, Ambassador of Turkmenistan,  Yerzhan Kistafin Ambassador of Kazakhstan, Khazar Farhadov Ambassador of Azerbaijan, Ulanbek Totuiaev Ambassador of Kyrgyzstan,Dr. Mehmet Pacaci Ambassador of Turkey,  Adam M. Tugio Ambassador of Indonesia, Dr. Ramez Alraee, Ambassador of Syria, and diplomats of many other countries including Saudi Arabia, Australia, Malaysia, Poland, Sri Lanka, Nepal, Republic of Turkish Northern Cyprus attended the Iftar Dinner.\nThey appreciated the ICCI for hosting a magnificent Iftar dinner for them.",
  "retrievedAt": "2025-08-11T08:07:26.134Z"
}
