{
  "title": "AJK PM directs authorities to use all available resources to serve masses during Ramazan",
  "link": "https://www.app.com.pk/national/ajk-pm-directs-authorities-to-use-all-available-resources-to-serve-masses-during-ramazan/",
  "date_published": "2023-03-26T12:42:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Mar 26 (APP):Azad Jammu and Kashmir Prime Minister Sardar Tanveer Ilyas Khan on Sunday directed the concerned state functionaries to use all available resources for the betterment of the people during the holy month of Ramazan.\nIn his statement issued here Sunday, the AJK prime minister directed the officials to discharge their responsibilities conscientiously and those who come to their offices in pursuit of their legitimate work should be treated equally with dignity and honour.\nStressing the need for addressing the masses’ problems without any delay, he said that during the holy month of Ramzan, the people should not be compelled to make rounds of government offices.\n“People who have voted PTI to power have attached high expectations on us”, he said, adding that the people had given us the mandate to change the outdated and corrupt system. He said that every officer should perform his/her duty with an enduring sense of responsibility and consider themselves as public servants.\n“People’s problems should be solved at their doorsteps by promoting a people-friendly attitude and simplifying the cumbersome procedures in government offices”, Sardar Tanveer Ilyas said and added, the system of forcing people to make rounds in offices should come to an end now. He said that everyone, regardless of his/her position or stature was bound to perform his/her duties with the utmost integrity and honesty. “We are all servants of the people, we all have to work with honesty and integrity”, he said.\nReferring to political interference in the posting and transferring of government officials, the Sardar Tanveer Ilyas said that the incumbent government had relinquished this insidious practice. “For us the most honorable is the one who works and serves the people the most”, he said.\nReiterating his government’s commitment to strengthen the state, he said, the state will be strengthened by strengthening the institutions.",
  "retrievedAt": "2025-08-11T08:07:27.011Z"
}
