{
  "title": "Imran does not want  elections, rather he wants  selection again: Marriyum",
  "link": "https://www.app.com.pk/national/imran-does-not-want-elections-rather-he-wants-selection-again-marriyum/",
  "date_published": "2023-03-26T16:45:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 26 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Sunday that Imran Khan was not interested in elections in the country, he actually wanted his selection as Prime Minister again.\nAddressing a press conference here, she said that Imran’s Khan’s tamashas of cypher, long march, avoid the jail campaign, elections, Zaman Park, attacks and threats to the courts have reached their conclusion.\nMarriyum said the people of Pakistan remember his tenure as a ‘black chapter in the history of the country as they were paying the price of Imran’s four year misrule which was marked by corruption, incompetence and inefficiency.\nPakistan Tehreek-e-Insaf Chairman Imran Khan did not have political issues, rather he was facing psychological problems.\nShe said last year Imran Khan had concocted the fake narrative of foreign conspiracy for toppling his government which was accepted by followers of his cult and PTI social media gang working from abroad claimed that imported government had been installed in Pakistan.\nThe narrative of international conspiracy started from cypher, blaming the United States, Nawaz Sharif, Shehbaz Sharif and then caretaker Punjab Chief Minister Mohsin Naqvi. Those who accused the US of conspiracy were now tendering apologies and seeking pardon, she said, ridiculing the PTI.\nShe wondered how the followers of PTI still believe in baseless allegations of Imran Khan. The minister said that yesterday the people of Lahore completely rejected Imran Khan and the PTI had to use old pictures and even Minar-e-Pakistan was removed from the pictures.\nThe minister said that on failure of the cypher narrative, Imran started a long march which was doomed while giving it Islamic touch, Jail Bharo movement was started after the long march disaster during which journalists and police personnel were martyred. The police officials were fired at from the houses of PTI leaders.\nShe said Imran was always ready to lead and address political rallies and marches but when the courts summoned him, he started making excuses of his old age, injury, diseases and above all threat to life.\nThe minister said that Imran, who refused to go to court, went to Minar-e-Pakistan to address a rally. She said he was neither sick, nor was he an elderly person, nor he faced any threat to life when going to address the rally but he will not go to court to face cases of foreign funding, Toshakhana and Tyrian Khan.\nMarriyum Aurangzeb said that the constitution and law of the land could not follow the dictates of a person who had the mindset of a devil. She said terrorists were present in Zaman Park from where petrol bombs were thrown at police and slingshots and stones were used.\nThe minister said that if Imran wanted fresh elections, why did he dissolve the National Assembly after no-confidence motion was tabled and why did he force the Speaker, deputy speaker and even the president to violate the constitution?\nCastigating Imran Khan’s so-called 10 point agenda, she said Imran Khan’s PTI ruled Khyber Pakhtunkhwa for ten years, it remained in power at Centre and Punjab for almost four years but set a record of bad governance and corruption.\nTaking a jibe at Imran, she said he was supposed to revive the national economy through ‘buffalos and eggs’ but the country’s loans were nearly doubled in only 4 years’ time.\nShe said when Imran Khan, Bushra Bibi, Farah Gogi and other looters from PTI would be brought to book, rule of law would be established in Pakistan.\nAbout Imran Khan’s claim of preparing a database of the poor, she said Benazir Income Support Program was a database which he shamelessly renamed as Ehsas program. She said if Imran would make a database, the beneficiaries would be Pinki Peerni, Farah Gogi and Shehzad Akbar etc.\nShe said during his tenure, Imran Khan only renamed the public welfare projects of the previous government. She said the PML-N health program was given the title of Health Insaf Card whereas PML-N youth programme was renamed as Kamyab Jawan programme but he could not run these programmes.\nShe said Imran claimed to provide 50,00,000 housing units to the poor segments of society and create 10 million jobs, but on the contrary, over 10 million people lost jobs during PTI rule and he failed to build housing units for the poor. She said that the house building scheme was taken over by Bushra Bibi through Al- Qadir Trust.\nInstead Imran Khan plunged the national economy in the Tsunami of unemployment and inflation dueto which the common man suffered badly.\nAbout Imran’s claims to control money laundering, she said that the PTI chairman should submit a reply to foreign funding case in the court, and the money laundering issue would get settled. She said it was ironic that a person who laundered money by using private jets was talking about controlling money laundering. She also said that Imran got approval from the cabinet to hand over $190 million public money to a private party.\nShe said when PML-N tenure ended in 2018, inflation related to edibles was only 2 percent and prices of wheat flour, sugar, ghee and cooking oil were controlled and tariffs of electricity and gas were reasonable despite IMF conditions.\nWhen the PTI came to power, growth rate fell to below zero whereas the assets of Imran Khan and his cronies multiplied.\nShe said that the PML-N leadership, which really strived for development of the country, focused on the China Pakistan Economic Corridor, LNG terminals, road infrastructure projects, farm-to-market roads, mega projects for power generation during their tenure.\nShe said unlike PML-N achievements, Imran could not accomplish even a single mega project for the welfare of the people.\n“Imran Khan during his tenure in power, only conspired against the country and its people and ruined its economy”, she said adding that the people of Pakistan were fully aware of Imran’s antics and they can no longer be befooled by Imran’s ten point agenda.\nShe said now Imran’s narrative has been buried and he was only trying to divert attention from the Toshakhana case, Tyrian White paternity issue and the foreign funding scam.\nLambasting Imran she said that Imran who committed robberies on the national exchequer during his rule and had given free hand to his cronies to loot and plunder, had the audacity to claim that he would bring all under the ambit of law. She said Imran used Zakat donations for political purposes and invested Shaukat Khanum Hospital charity money in the property business.\nShe said that PTI had claimed that the Minar-e-Pakistan rally was very successful but it had to delete old footage within minutes after uploading.\n” Imran Khan has no option left as his politics, narrative and conspiracies had failed and he had been pleading to the Chief of Army Staff to give him time for meeting”.\nTerming Imran as “Khatan Khan”, she said that he has been deceiving his own party leaders and workers by creating a narrative based on falsehood and lies.\nCriticizing Imran, she said now he was talking about human rights violations, but he had forgotten how he treated his political opponents and media professionals during his rule.\nShe said during the PTI regime, media persons were attacked and kidnapped and he earned the infamous title of predator of media at international level.\nShe recalled that Imran Khan put his political opponents in death cells, not even sparing the sisters and daughters of political adversaries.\nShe said that Imran who kept Tayyaba Gul illegally confined in the PM House to blackmail the then Chairman NAB was now talking about human rights abuses.\nShe said that the United Nations and United States were fully aware of the track record of Imran Khan as Prime Minister on human rights. She said Imran Khan, who has been doing politics over the dead bodies of his party activists, was accusing the present government of committing rights violations which was incorrect.\nShe said that human rights organizations like Human Rights Watch were aware of Imran’s fascist mindset as he had jailed the entire opposition leadership and looted national exchequer, ruined the economy, made a compromise of Kashmir and deprived the people of employment, electricity and gas.\nReplying to media persons’ questions, she said during the Imran era the political opponents were jailed first and then they were booked in fake cases, which were rejected by the courts. But the present government first held investigations, then cases were filed which were now in courts that had summoned Imran, but he was making lame excuses to avoid court cases. Imran should go to the courts and prove that he had done no money laundering in foreign funding case, he had notcommitted any irregularities in the Toshakhana gifts case and he was not the father of Tyrian White.\nShe said the PML-N was the only party that revived the national economy in the past and it would again provide relief to the masses by overcoming inflation and unemployment.\nTo a question, she said that over 80 million people would benefit from the free flour supply scheme during Ramazan. She said that Prime Minister Shehbaz Sharif was himself monitoring the scheme.\nThe minister said that the government was taking steps to stabilize the price of wheat flour in the market as well.\nReplying to another question, she said that Prime Minister Shehbaz Sharif had written a reply to President Arif Alvi’s letter. She questioned who was the president when the entire opposition leadership was sent to prison by Imran Khan and when Mir Shakeel was arrested and Matiullah Jan abducted and Absar Alam and Asad Toor attacked.",
  "retrievedAt": "2025-08-11T08:07:23.244Z"
}
