{
  "title": "Envoy for enhancing Indonesia-Pakistan cooperation in defence sectors",
  "link": "https://www.app.com.pk/national/envoy-for-enhancing-indonesia-pakistan-cooperation-in-defence-sectors/",
  "date_published": "2023-02-12T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 12 (APP): Indonesian Ambassador Adam Tugio has urged the Pakistani business community to look at Indonesia as a trade hub for expanding its export to the huge market of more than 640 million people in the Association of Southeast Asian Nations (ASEAN).\n“Participation of a frigate vessel of Indonesian Navy to AMAN Naval Exercise 2023 is an example of how Indonesia attaches great importance to its partnership with Pakistan to promote global peace and security” he said.During a discussion at Karachi Council for Foreign Relations (KCFR).\nThe Ambassador said that cooperation in defence sectors had the potential to grow beyond an exchange of military officers and capacity building programs, said a news release issued by the Indonesian Embassy here Sunday.\n“More than 50 percent of conflicts are taking place in OIC geographic. Indonesia and Pakistan are the two biggest UN troops contributing countries and the role of women peacekeepers of the two countries can give a significant contribution to creating an enabling environment for peace and reconciliation in such conflicts”, Tugio added.\nThe Ambassador specifically referred to the newly established mechanism of the Joint Ministerial Commission which would allow the two FMs to meet regularly for stocktaking progress of bilateral cooperation and give strategic direction to deepening bilateral relations.\nHe further mentioned that Pakistan has the full potential to develop its economy due to its geostrategic location to serve as a gateway to the broader region in Central Asia.\n“Pakistan has strong resilience to overcome the economic crises and make strong revival as attested through its history”, the envoy said.\nResponding to a question on a doable strategy for Pakistan to strengthen its partnership with ASEAN, he suggested a two-prong approach of institutional collaboration with the ASEAN Secretariat and bilateral processes with ASEAN members.\nThe envoy underlined the importance of deepening connectivity through hard elements, such as building infrastructure as well as increasing people-to-people connections as soft elements of connectivity.\n“Pakistan is blessed with scenic beauty landscapes and has the potential to become a centre for religious tourism since it has many heritage sites for Buddhism and Islam, noting that 24 percent of people in ASEAN are Buddhist and 46 percent are Muslim”, added the Envoy.",
  "retrievedAt": "2025-08-11T06:02:26.280Z"
}
