{
  "article_id": "2025-04-05_53f6a3f5d48ab03c1ea3fa53bec52efb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dig-tariq-chairs-crime-meeting-orders-crackdown-on-criminals/",
    "retrieved_at": "2025-08-27T14:13:54.984Z"
  },
  "metadata": {
    "title": "DIG Tariq chairs crime meeting, orders crackdown on criminals",
    "author": null,
    "date_published": "2025-04-05T18:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 232,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 05 (APP):A high-level crime meeting was held under the chairmanship of Deputy Inspector General of Police (DIG) Muhammad Jawad Tariq, to review the overall crime situation and operational performance across all police zones. A police spokesperson told APP that the meeting was attended by Zonal SPs, SP Dolphin, SDPOs, and SHOs. DIG Islamabad reviewed the performance of each zone and directed officers to strengthen crime control efforts and improve the quality of investigations. DIG Tariq emphasized that all pending case challans should be completed and submitted in a timely manner based on merit. He also underscored the importance of arresting proclaimed offenders and absconders without delay. He instructed that a comprehensive crackdown must be launched against those involved in car and motorcycle thefts, along with proactive measures against active criminal gangs. The DIG stressed that effective redressal of public complaints at the police station level must be ensured to build trust in the force. Highlighting the force's stance on vulnerable groups, he reiterated that there is zero tolerance for crimes against women and children, and strict action would be taken in such cases. He further pointed out that modern policing demands the integration of traditional investigative methods with the latest technology to boost efficiency and outcomes. DIG Muhammad Jawad Tariq reaffirmed that safeguarding the lives and property of citizens and eliminating criminal elements remain the top priorities of Islamabad Police.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}