{
  "article_id": "2025-04-05_b5dbb27acce12e7dfcdd476f45b15997",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/veteran-bureaucrat-khawaja-ejaz-sarwar-passes-away/",
    "retrieved_at": "2025-08-27T14:13:54.982Z"
  },
  "metadata": {
    "title": "Veteran bureaucrat Khawaja Ejaz Sarwar passes away",
    "author": null,
    "date_published": "2025-04-05T16:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 220,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 5 (APP):A senior bureaucrat and revered member of Information Group, Khawaja Ejaz Sarwar, died this week and will be buried in Islamabad on Sunday. The former Federal Secretary, known for his steadfast leadership, began his career in 1969 as part of Pakistan's Information Group, advancing to the role of Federal Secretary for Information and Broadcasting-the ministry's top position. He also headed the Population Welfare Department, influencing national strategies on public health and awareness. The Forum of Information Group Secretaries, where Sarwar served as Chair, acknowledged his role in maintaining ethical standards within the bureaucracy. \"His leadership prioritized transparency, even under pressure,\" the group noted. He is survived by his wife, two children, four grandchildren, and numerous colleagues. Funeral prayers will begin at 1:30 pm on April 6, 2025, at Islamabad's Markazi Jamia Masjid in the I-8/3 sector. The Forum urged public servants and citizens to attend, calling his death a \"loss to the nation's governance legacy.\" Sarwar's tenure spanned critical moments in Pakistan's history, including shifts in media regulation and population control efforts. As Information Secretary, he oversaw state-run broadcasting reforms, emphasizing factual reporting and public access to information. Later, as Population Welfare Secretary, he advocated for community-based health initiatives, which colleagues say reduced misinformation about family planning. Condolences poured in from civil servants, politicians, and media professionals.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}