{
  "title": "NCC starts coordination with stakeholders in development of SNC: Shafqat Mahmood",
  "link": "https://www.app.com.pk/national/ncc-starts-coordination-with-stakeholders-in-development-of-snc-shafqat-mahmood/",
  "date_published": "2020-10-29T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): Federal Minister for Education and Professional Training Shafqat Mahmood on Thursday said that National Curriculum Council (NCC) has started coordination in development of ‘Single National Curriculum’ (SNC) in the country with active participation of all provinces and other relevant stakeholders.\nThe Minister said that comparative studies were conducted to align SNC with international standards, adding that these includes analysis of Pakistan curriculum with Singapore and Cambridge Curriculum, Pakistan learners standards comparison with Singapore, Malaysia/Indonesia and UK Standards, adding that all the findings were incorporated in the SNC.\nThe minister further said that consultative process was carried out with engagement of stakeholders from all provinces and areas including public and private sector, the federal government educational institutions (FGEIs).\nHe said that under phase-1 first draft of SNC for Grade Pre I-V was developed and shared with all the provinces/ areas and Cambridge University for their input and feedback.\nProvincial and Area workshops were subsequently held in all federating units from November 2019 to January 2020.\nHe said that the services of Aga Khan University, Institute for Educational Development (AKU-IED) were hired to ensure value-addition of SNC and development of Teacher training modules and assessment framework.\n“Input and feedback received from all federating units, FGEIs, AKU-IED and Cambridge University were then collated and consolidated in the second draft of SNC.\nThis formed the basis for discussions and consensus building during the National Conference on SNC February 11-14, 2020” he said.\nThe minister further said that first phase Curriculum for Grade Pre-1 to V was presented to the Prime Minister on March 19, who expressed his satisfaction over the completion of the first phase within the given timeframe, adding that after completion of textbooks on the basis of SNC phase-1 for Grade Pre-1 to V, uniform curriculum at primary level will be implemented throughout the country from March 2021.\nSimilar to first phase, SNC for Grade 6 to 8 will be developed and implemented throughout Pakistan by March 2022 and for 9 to 12 by March 2023.",
  "retrievedAt": "2025-08-11T19:57:24.756Z"
}
