{
  "title": "MoI&B, RSIL sign MoU to promote awareness on laws, legal obligations",
  "link": "https://www.app.com.pk/national/moib-rsil-sign-mou-to-promote-awareness-on-laws-legal-obligations/",
  "date_published": "2020-10-29T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): The Ministry of Information & Broadcasting (MoI&B) and Research Society of International Law (RSIL) on Thursday signed a Memorandum of Understanding (MoU) to collaborate in promoting awareness about laws and legal obligations among public, business community and professionals besides other concerned persons and entities.\nJoint Secretary MoI&B, Qamar Bashir and RSIL President, Ahmer Bilal Sufi have singed MoU to encourage collaboration in research and expertise sharing, a news release said.\nSecretary I&B Akbar Durrani and Heads of Departments/Wings of the Ministry of Information and Broadcasting witnessed the signing ceremony.\nSpeaking on the occasion, Akbar Durrani said Prime Minister Imran Khan wanted to promote the country’s soft image as Pakistan was a pivotal nation in many ways.\nHe said that ministry under the leadership of Minister for I&B Senator Shibli Faraz was committed to project country’s positive image globally as per vision of Prime Minister Imran Khan.\nHe termed the signing of MoU an important initiative which would help in promoting Pakistan’s stance & view point on the basis of law and legal discourse. “Reference to law is the key to strengthening one’s argument,” he added.\nAhmer Bilal Sufi said all international issues had legal dimensions, emphasizing that the MoU would serve to link law as the basis to project Pakistan’s position at the international level.\nThe RSIL, he said, remained focused on state specific issues, no matter which government was in power.\nThe MoU aimed at working together on a range of measures intended to promote the knowledge of laws and legal obligations under Pakistani law through various modes of communication, including Digital Media, Print Media and Electronic Media.\nUnder the MoU, both the parties agreed to collaborate on research and the sharing of expertise in a variety of areas concerning international law, media, and the criminal justice sector of Pakistan.\nThe Research Society of International Law, Pakistan (RSIL) is a private sector, non-partisan think tank dedicated to the study and analysis of international law issues impacting Pakistan in order to provide the state and international organizations with policy input.",
  "retrievedAt": "2025-08-11T19:57:16.131Z"
}
