{
  "title": "AJK PM lauds sacrifices of AJK-LoC population for defense of motherland",
  "link": "https://www.app.com.pk/national/ajk-pm-lauds-sacrifices-of-ajk-loc-population-for-defense-of-motherland/",
  "date_published": "2020-10-29T15:39:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): , Oct 29 (APP): Azad Jammu & Kashmir Prime Minister Raja Muhammad Farooq Haider Khan on Thursday highly appreciated the unprecedented role of AJK population swelling along LoC including Leepa valley for offering unique sacrifices shoulder-to-shoulder with Pakistan Armed forces for the defense of motherland.\nAddressing a big public meeting in Leepa valley, close to the LoC, he paid rich tributes to Pakistan Armed forces for ensuring the defense of the ideological and geographical frontiers of the country.\nThe Prime Minister said Leepa has given a status of Thesil in order to resolve the problems of the masses at local level.\nHe said the road leading to Leepa will now remain open even in the snow fall season throughout the year and added that the government has implemented merit in all the departments and appointments were offered on merit through NTS .\nHe said a community infrastructure development programme was introduced to resolve the problems of the masses at local level .\nHe said steps were taken to increase the income of the state and the developmental budget was also increased manifold to complete the developmental targets.\nHe said the Pakistan government has provided 430 million rupees for the construction of bankers and the first installment has been given by the government of Pakistan and the credit of this amount goes to Pakistan Army and added that bankers will be constructed with the cooperation of Pakistan Army.\nHe said the government has taken solid measures for promotion of local industry as well the promotion of tourism in the area to boost economic and commercial activities in the area .\nReferring to the Kashmir issue the Prime Minister said that the people of Azad Kashmir will continue to extend all out support to the people of occupied Kashmir struggling for their internationally-acknowledged right to self determination.\nHe urged the people to vote for his party in next general elections to continue the developmental process in Azad Jammu & Kashmir.",
  "retrievedAt": "2025-08-11T19:57:18.225Z"
}
