{
  "title": "Imran Khan acquitted in Parliament, PTV’s buildings attacks case",
  "link": "https://www.app.com.pk/national/imran-khan-acquitted-in-parliament-ptvs-buildings-attacks-case/",
  "date_published": "2020-10-29T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 29 (APP): An Anti Terrorism Court (ATC) on Thursday acquitted Prime Minister Imran Khan in a case pertaining to attacks on buildings of Parliament and Pakistan Television during the sit-in of 2014.\nThe court, however, summoned federal ministers including Shah Mehmood Qureshi, Pervaiz Khatak, Shafqat Mehmood and Asad Umer on November 21, for indictment. The ATC separated the matter of President Arif Alvi and sent it to office due to his immunity.\nATC Judge Raja Jawad Abbas Hassan announced the judgment which was reserved in last hearing after conclusion of arguments from both sides.\nThe court also summoned provincial minister Aleem Khan, Shaukat Yousafzai and Jahangir Tareen on next hearing.\nThe court, however, acquitted Pakistan Awami Tehreek (PAT)’s leader Mubashir Ali from the case while PAT’s chief Tahirul Qadri was still absconder in the case.\nPakistan Tehreek e Insaf (PTI)’s header Imran Khan had stated in written arguments that he had been named in a baseless case as there was no evidence and witness against him.\nThe prosecutor had also supported the acquittal plea of Imran Khan and argued in last hearing that it was just a political fabricated case as there was no evidence against PTI’s chief.\nHe prayed the court to acquit him from the case as the trial would only waste the court time.\nThe prosecution had no objection if he was acquitted, he said.\nIt may be mentioned here that Secretariat Police Station had registered a first information report (FIR) against the PTI and PAT’s top leadership when the protesters entered the buildings of Parliament and PTV during the sit-in of 2014 against alleged rigging in general elections 2013.",
  "retrievedAt": "2025-08-11T19:57:22.137Z"
}
