{
  "title": "AJK journalists observe ‘Youm e Istehal’: Rejects Indian action of stabbing special status of dispute",
  "link": "https://www.app.com.pk/national/ajk-journalists-observe-youm-e-istehal-rejects-indian-action-of-stabbing-special-status-of-dispute/",
  "date_published": "2020-08-05T20:27:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 06 (APP): AJK journalists fraternity across the liberated territory observed the first anniversary of the last year’s Indian unlawful action-oriented bleak day of August 5 as Youm-e-Isotheral as the community’s main for a – Jammu & Kashmir Union of Journalists vehemently condemned the August 5 nefarious Indian action of abrogating the special status of the Internationally-acknowledged disputed Himalayan state of Jammu & Kashmir denying and violating all international norms and commitments including the United Nations resolutions on Kashmir issue.\nAddressing protesting Kashmiri journalists gathering here late Wednesday, belonging to the JKUJ speakers including President of the organization Hafiz Maqsood Mirza, the organizations’ supremo A. H. Nizami, Senior Vice President Raja Sohrab Ahmed Khan, Jehanzeb Khan, Rao Atiq ul Amin Khan, Asif Arbab, Umer Taqveem Jiraal and others declared that all sections of the society living either side of the LoC in Jammu & Kashmir State including journalists at either side of the Line of Control will never ever accept the nefarious Indian action of altering the status of the internationally-recognized disputed state.\nAiring his views on the current Jammu & Kashmir situation particularly in the back-drop of August 05, 2019 sinister move of Modi-led Indian fascist and extremist ruling junta abrogating the special status of the internationally-acknowledged disputed Indian-occupied Jammu and Kashmir state scrapping article 370 and 35-A of the Indian constitution, speakers declared that the internationally-recognized disputed Jammu and Kashmir state was the inalienable entity historically and geographically and no power on the planet could resort to any harm to the unity and integrity of the disputed Himalayan state.\n“Every attempt or any conspiracy to the division of the disputed Jammu and Kashmir state on permanent grounds would be frustrated with full vigor by the people of the state living both sides of the line of control and rest of the world”, the Kashmiri journalist community leaders said.\nSpeakers lambasted fascist Indian rulers for maneuvering the disintegration of disputed J & K state through the abrogation of special status of the disputed Himalayan state.\n“Kashmir issue will remain alive until a single Kashmiri is alive, speakers declared adding the people of the disputed state will continue their struggle with full vigor for securing their birth right of self determination to decide about their destiny in line with international norms and commitments including the UN resolutions”, they said.\nSharing their grave concern and protest against the continual nefarious Indian designs and move of bringing about the demographic changes of the internationally-acknowledged disputed Muslim-majority Jammu Kashmir state speakers called upon the comity of nations including theworld human rights organizations to take immediate action against the denial of the birth right to self determination to the people of Jammu and Kashmir by the Indian imperialism involved in ethnic cleansing of the population of the Muslim-majority Indian held Jammu Kashmir state, massive human rights abuses besides turning the turbulent state the largest prison on the planet for last one year.\nSpeaking on this occasion, JKUJ President Hafiz Maqsood said that the day of Aug. 05 , 2019 was the darkest day in the history of Jammu & Kashmir and the Kashmir freedom struggle when India, under the shadows of the occupation Indian guns, broke into the disputed occupied state through scrapping special status of the disputed IIOJK through abrogating article 370 and 35-A of her own constitution.\nHe said that the observance of the day as Kashmir Siege Day this year by the people of Pakistan and Jammu Kashmir were the unequivocal message to New Delhi that the people of Jammu & Kashmir will not ever accept the Indian forced and unilateral action of stabbing the special status of the disputed held state.",
  "retrievedAt": "2025-08-11T19:37:12.964Z"
}
