{
  "title": "Peace, development, economic prosperity common agenda of Pakistan, Afghanistan: Asad Qaiser",
  "link": "https://www.app.com.pk/national/peace-development-economic-prosperity-common-agenda-of-pakistan-afghanistan-asad-qaiser/",
  "date_published": "2020-08-06T02:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP): Speaker National Assembly, Asad Qaiser on Thursday said that peace, development, economic prosperity was common agenda of Pakistan and Afghanistan.\nThe speaker expressed these views during a video meeting with Speaker Afghan Wolesi Jirga Mir Rehman Rehmani, said a news release issued here.\nDuring the Tele-video conversation, important issues straddling bilateral relations and the regional situation came under discussion. The two leaders also congratulated each other on the Eid.\nAsad Qaiser said that Pakistan attached great importance to its relations with Afghanistan. Both the leaders agreed to further intensify efforts for regional development and prosperity.\nIt was concurred that like the National Assembly of Pakistan, the Wolesi Jirga would also set up Special Committee to promote Pak-Afghan relations and cooperation in diverse sectors.\nThe speaker invited the Afghan Speaker and Deputy Speaker to visit Pakistan along with a parliamentary delegation.\nAsad Qaiser said that Parliamentary Friendship Groups could play an important role in bringing the two countries closer.\nHe said that the two neighboring countries had vast opportunities for cooperation in the fields of agriculture and trade which could be utilized for welfare of the people of both the countries.\nSpeaker Wolesi Jirga commended keen interest taken by Asad Qaiser in removing obstacles in Afghanistan’s trade with Pakistan.\nHe said that it was an honor to be invited to visit the brotherly country of Pakistan and would be visiting with a delegation soon.\nHe appreciated Pakistan’s efforts for peace and social development in Afghanistan.\nThe Afghan Speaker said that bilateral relations could be further strengthened by promoting people-to-people and trade-related contacts.",
  "retrievedAt": "2025-08-11T19:37:06.781Z"
}
