{
  "title": "FO dismisses back channel diplomacy with India",
  "link": "https://www.app.com.pk/national/fo-dismisses-back-channel-diplomacy-with-india/",
  "date_published": "2020-08-06T07:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 6 (APP):The Foreign Office on Thursday dismissed any back channel diplomacy underway between Pakistan and India, saying it was out of question owing to worsening human rights situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“Not at all in the circumstances we are. Not in the face of the brutality that is happening in IIOJK,” Foreign Office spokesperson said in her last weekly briefing with media after her successor Zahid Hafeez Chaudri was appointed on the position.\nSpokesperson Farooqui said the situation of IIOJK was deteriorating day by day and Pakistan would not consider any back channel diplomacy in current scenario.\nThe FO spokesperson said Pakistan valued its longstanding relations with the Organization of Islamic Cooperation (OIC), however, the “people of Pakistan had some expectations from the body over the Jammu and Kashmir dispute”.\nAsked about the remarks of Foreign Minister Shah Mehmood Qureshi who mentioned the delay on the part of OIC to convene the meeting of Council of Foreign Ministers, she said Pakistan “acknowledged and deeply appreciated the OIC’s role in highlighting the issue”.\nShe said three meetings of the OIC Contact Group on Jammu and Kashmir were held in one year, two of ministerial level.\nAs regards Indian spy Kulbhushan Jadhav, Spokesperson Farooqui said Pakistan had conveyed India the August 3 directive of the Islamabad High Court (IHC).\nShe said as per the IHC, India had been communicated through diplomatic channels for engaging a lawyer for its serving Navy Commander.\nThe FO spokesperson said yesterday’s meeting of the United Nations Security Council (UNSC) on Jammu and Kashmir was a clear testimony that the dispute was “neither an internal matter of India nor a bilateral issue, but a matter of international significance.”\nShe rejected the impression that Pakistan’s new political map was a diversion from its 72-year-old stance.\n“Pakistan still supports the resolution of Jammu and Kashmir dispute in accordance with the resolutions of UNSC and as per the aspirations of Kashmiri people,” she said.\nOn Afghanistan, she said Pakistan was committed to the resumption of peace and reconciliation process in its neighbouring country as “any delay would help the spoilers to inflict damage upon the situation”.\nShe said the government was in touch with the stakeholders and interlocutors for early resumption of the Afghan peace process.",
  "retrievedAt": "2025-08-11T19:37:02.255Z"
}
