{
  "title": "PM welcomes UNSC for taking up Kashmir dispute, thanks its members for concern on HR abuses",
  "link": "https://www.app.com.pk/national/pm-welcomes-unsc-for-taking-up-kashmir-dispute-thanks-its-members-for-concern-on-hr-abuses/",
  "date_published": "2020-08-06T02:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP):Prime Minister Imran Khan Thursday welcomed the United Nations Security Council (UNSC) for taking up the Jammu and Kashmir dispute and thanked its members for showing concerns over the human rights abuses in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nOn Pakistan’s request, the 15-member body held a closed-door meeting Wednesday on the first anniversary of India’s “illegal” action to end the special status of the disputed state wherein it discussed the situation in Kashmir, and listened to the briefings from the UN Secretariat on the current situation and the work of UN Military Observer Group in India and Pakistan (UNMOGIP).\n“I welcome the UNSC for again taking up the Jammu & Kashmir dispute, which has been on its agenda for over 70 years,” the prime minister said on Twitter.\nHe said the UN Security Council, under the UN Charter, not only had the responsibility for maintaining international peace and security but also of ensuring implementation of its resolutions.\n“We thank the Council members, who expressed concern over the deteriorating human rights & humanitarian situation in IIOJK, advised against escalation of tensions, underscored the need for respecting international law & called for a peaceful resolution of the dispute,” he added.\nThe prime minister explained that Pakistan’s position on the Kashmir dispute remained clear and unambiguous.\nThe Jammu and Kashmir dispute must be resolved in accordance with the relevant UNSC resolutions granting the Kashmiri people the right of self-determination under a free and fair plebiscite.\n“Pakistan will continue to extend all possible support to the Kashmiri people until they secure this inalienable right,” the prime minister resolved.",
  "retrievedAt": "2025-08-11T19:37:04.411Z"
}
