{
  "title": "Kashmiri youth observe ‘Kashmir Siege day’ with renewed pledge",
  "link": "https://www.app.com.pk/national/kashmiri-youth-observe-kashmir-siege-day-with-renewed-pledge/",
  "date_published": "2020-08-05T22:32:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Aug 06 (APP):Kashmiri youth’s outfit – All Kashmir Forum observed “Kashmir Siege Day” with strong condemnation of of Aug. 5, 2019 Indian nefarious unlawful and immoral forced move aimed at to annex the disputed Indian Illegally occupied Jammu Kashmir state to the Indian union territory against the aspirations of the people of the internationally-acknowledged disputed IIOJK.\nProtest demonstrations were held on the first anniversary of the bleak August 5, 2019 day as ‘Kashmir Military Siege Day’ (Youm e Istehsal) by the All Kashmir Forum, a prestigious youth movement for the right of self determination, in various parts of the country including Lahore and Islamabad and AJK cities, the organization’s Supremo told APP here late Wednesday.\nSpeakers including Safeer Ahmed Khan, Sajjid Ahmed, Eng. Mustaq Mahmood, Naeem Abbasi, Muhammad Shahbaz, Riyasat Haneef, Raja Mazhar, Saddam Inqlabi, Najeeb ul Ghafoor, Abdul Hameed, FidaKiani and Abdul Basit Khan while addressing the anti-India rallies categorically rejected India’s so-called annexation through sinister act of scrapping special status of the disputed Indian Illegally occupied Jammu & Kashmir State.\nSpeakers termed Kashmir’s “military siege and communication blockade” a “crime against humanity.” AKF also said that “Eight million Kashmiris have been made prisoners in their own homes. Their communication with the outside world has been deliberately revoked to hide the scale of human rights violations being perpetrated against them by the Indian occupation forces”.\nSpeakers reiterated the Jammu Kashmir state peoples resole to continued condemning the abrogation of Article 370 scrapping special status of the Indian occupied state, till India was compelled to retrieve from her nefarious action. Narendra Modi’s government had repealed the law and changed Article 35(a) last year, they said lamenting the action.\nMeanwhile, All Kashmir Forum set a trend on twitter with hash tag #SaveKashmirForum. Since Tuesday– Aug. 4, All Kashmir Forum urged the international community including the United Nations and Organization of Islamic Countries to help resolve the issue of Kashmir as per the wishes of the people of Jammu Kashmir, Basir said.",
  "retrievedAt": "2025-08-11T19:37:12.920Z"
}
