{
  "title": "NCOC decides to gear up public awareness drive to contain coronavirus pandemic spread",
  "link": "https://www.app.com.pk/national/ncoc-decides-to-gear-up-public-awareness-drive-to-contain-coronavirus-pandemic-spread/",
  "date_published": "2020-08-05T22:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 06 (APP):The National Command and Operation Centre (NCOC) on Thursday decided to gear up media campaign for public awareness for containing the spread of coronavirus pandemic in the country.\nThe NCOC meeting chaired by Minister for Planning, Development and Special Initiatives Asad Umar discussed Epi Curve Chart data, recommendations for NCC meeting on negative list, standard operating procedures (SOPs) for opening of schools and comparative analysis.\nThe forum was briefed that since the visible decline in coronavirus pandemic in the country a general complacency in the masses was observed where no mask wearing and social distancing were observed outdoors. However, the media campaigns and messaging about COVID-19 on television channels should be enhanced and revitalized to ensure public adherence to safety guidelines.\nThe forum noted that the awareness campaign on COVID-19 to make the public realize that the deadly disease had not vanished rather lingering on which needed to be dealt with care and compliance of SOPs.\nThe NCOC was briefed that in mid-June, as the number of COVID-19 patients boomed and the burden on hospitals increased, the government took practical steps to add 2150 oxygenated beds across the country by July 31 to increase the capacity of hospitals. As a result of the visits of special teams to all the provinces including Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB), efforts were made to put in place practical measures to add 2850 oxygenated beds.\nSo far, 2608 new oxygenated beds have been added to hospitals across the country, including 80 in AJK, 264 in Balochistan, 100 in GB, 400 in Khyber Pakhtunkhwa, 787 in Punjab, 351 in Sindh and 626 in Islamabad.\nMoreover, ramp up was underway to add 242 more new oxygenated beds (10 in KP, 17 in Punjab and 215 in Sindh).\nFederal Minister for Interior Brig (Retd) Ejaz Ahmed Shah, Special Assistant to the Prime Minister on Health Dr Faisal Sultan, Federal Minister for National Food Security and Research Syed Fakhar Imam, Federal Minister for Education Shafqat Mahmood, Federal Minister for Economic Affairs Khusroo Bakhtiyar, Federal Minister for Industries and Production Hammad Azhar and other also attended the meeting.",
  "retrievedAt": "2025-08-11T19:37:11.811Z"
}
