{
  "title": "Time to turn a new page: President calls for meaningful dialogue, political reconciliation to end polarisation, overcome challenges",
  "link": "https://www.app.com.pk/national/time-to-turn-a-new-page-president-calls-for-meaningful-dialogue-political-reconciliation-to-end-polarisation-overcome-challenges/",
  "date_published": "2024-04-18T12:22:00.000Z",
  "source": "APP",
  "content": "President Zardari said that by embracing the visions of the great leaders Quaid-e-Azam Muhammad Ali Jinnah, Shaheed Zulfikar Ali Bhutto, and Shaheed Mohtarma Benazir Bhutto, “we can effectively tackle challenges and foster an atmosphere of mutual respect and political reconciliation”.\nThe president emphasised that in order to align the country with the 21st Century requirements, it was imperative to move forward on reforms with good governance for the provision of optimal social entitlements to the citizens.\nHe said besides working on economic reforms, spurring jobs, reducing inflation and expanding the tax net, the Federal Government should also promote positive working relationships and effective coordination, within the constitutional framework, with the provinces.\n“This is absolutely essential for promoting an inclusive national development agenda and rolling out policies that execute tangible action on the ground.”\nPresident Zardari stressed the government to intensify its efforts for attracting foreign direct investment, implementing comprehensive ease-of-doing-business reforms and simplifying the existing regulations to provide an enabling environment to both foreign and domestic investors.\nAt the same time, he also emphasised to diversify exports, enhance the competitiveness of domestic products in global markets, introduce value addition, and venture into new international markets. Similarly, the huge untapped potential in the agriculture, marine life, information technology and textile sectors should also be exploited to earn foreign exchange, he added.\nCommending the establishment of the Special Investment Facilitation Council (SIFC), he said it was a step forward in the right direction as it was aimed at attracting and facilitating investments in key sectors.\nAs regards climate change impacts, the president said Pakistan had been serially devastated by different impacts of climate change, especially in the shape of catastrophic floods in 2022. “We urgently need to invest in climate-friendly and climate-resilient infrastructure to mitigate the rapidly compounding risks of climate change.”\nSpeaking about the importance of the provision of primary & secondary education, President Zardari pointed out that as a massive number of children were out of school, all the provincial governments should focus their energy on transformative reforms in the education sector.\nHe also highlighted the urgent need of rebuilding and scaled-up expansion in the health sector, saying that regular investments in the primary and secondary health infrastructure, as well as human resources, were needed to ensure that every citizen had access to quality healthcare services and that no one lacked medical care.\nHe said a large number of population was slipping to extreme poverty due to a combination of factors including climate impacts and sheer cost-of-living pressures.\n“It is our responsibility to ensure that they move out of extreme vulnerability, with the ability to access opportunities for jobs, and resources to reinvest in farms, livestock and small businesses.”\nThe president viewed that the Benazir Income Support Programme (BISP) had been providing a lifeline to millions of vulnerable women across the country, offering them financial assistance and social protection, while giving many women the incentives and seed capital to start up small businesses.\nThe number of beneficiaries of the poverty alleviation programme had risen to over 9 million, he added.\nThe president expressed the hope that the new government would actively work to reduce social and economic fragility while aggressively promoting girls’ education and health, including programmes to reduce maternal mortality and enhance mother and child nutrition.\nHighlighting the Kashmir issue, the president reminded the world of the unsung sacrifices of Kashmiri people in their ongoing struggle for the freedom of Indian Illegally Occupied Jammu and Kashmir.\nHe said the revocation of Articles 370 and 35A was part of India’s strategy to reduce the Kashmiri Muslims to a minority in their own homeland, and called upon India to reverse all illegal measures taken on or after August 05, 2019.\n“I assure our Kashmiri brothers and sisters that Pakistan will continue to provide moral, political and diplomatic support to the people of occupied Kashmir until they get their right to self-determination,” he said and termed the implementation of the United Nations Security Council’s resolutions a key to durable peace in South Asia.\nPresident Zardari also expressed deep concerns over the tidal wave of indiscriminate killings of innocent Palestinians and genocide committed by the Israeli forces. He reiterated Pakistan’s condemnation of the brutality and impunity of the occupation forces and commitment to its principled support for the establishment of an independent and viable Palestine state, based on the pre-1967 borders, with Al-Quds Al-Sharif as its capital.\nReferring to the resurge of terrorism and its threats to the nation’s security as well as regional peace and prosperity, he called the menace a shared concern that required collective efforts. He urged the neighboring countries to take strong notice of terrorist groups involved in launching attacks against Pakistan’s security forces and people.\n“Today, I reaffirm the nation’s resolve to eliminate terrorist elements. My late wife, the twice-elected Prime Minister of Pakistan, Mohtarma Benazir Bhutto Shaheed, gave her life standing up to terrorists, so you will never find me wanting in building the unity and momentum behind such an effort,” he remarked.\nHe said the country’s armed forces and law enforcement agencies had rendered immense sacrifices and played a heroic role in the fight against terrorism and defence of national frontiers.\nComing to foreign policy, President Zardari thanked the friendly countries, particularly Saudi Arabia, United Arab Emirates, China, Turkiye, and Qatar for supporting Pakistan in difficult times. He also recognised the United States, European Union and United Kingdom having a history of cooperation with Pakistan in many sectors and hoped to grow that further.\nThe president particularly expressed gratitude to China for its unwavering support to Pakistan in various fields, and reiterated the country’s steadfast commitment to collaborating with it to advance shared goals of fostering regional peace, promoting connectivity, and stability, including the completion of the China-Pakistan Economic Corridor.\n“We will not allow hostile elements to jeopardize this vital project or undermine the strong bond between our two nations, and will take all necessary measures to ensure the security of our Chinese brothers and sisters.”\nPresident Zardari said he drew inspiration from Quaid-e-Azam Muhammad Ali Jinnah, Shaheed Zulfikar Ali Bhutto, and Shaheed Mohtarma Benazir Bhutto, who spent their lives being advocates for democracy, tolerance, and social justice.\nExpressing his complete faith in political leadership, public institutions, civil society and youth, he said, “I am certain that together, in a fresh start, we can chart a course towards a strong and prosperous Pakistan.”",
  "retrievedAt": "2025-08-11T01:56:02.835Z"
}
