{
  "title": "Pakistan, UK relations  based on mutual respect: Speaker",
  "link": "https://www.app.com.pk/national/pakistan-uk-relations-based-on-mutual-respect-speaker/",
  "date_published": "2024-04-18T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Speaker Sardar Ayaz Sadiq on Thursday said that Pakistan attached great importance to its longstanding relations with the United Kingdom (UK) which were based on mutual respect and shared perceptions on broad range of regional and international issues.\nIt is high time to further solidify this cordial bond through increased people-to-people interactions, enhanced parliamentary engagements, and bolstered economic ties for the mutual benefit of the two friendly countries, he expressed these views while talking to the British High Commissioner to Pakistan, Jane Marriott, who called on him.\nHighlighting the significance of parliamentary cooperation, Speaker Sadiq underscored that parliamentary diplomacy had historically played a pivotal role in strengthening bilateral relations.\nHe emphasized the continuous exchange and collaboration between the two parliaments through parliamentary friendship groups and high-level exchanges as avenues to foster mutual learning and benefit from each other’s experiences.\nIn this regard, invitation would be extended to the Speaker of House of Commons for visit to Pakistan along with the parliamentarians.\nRecognizing the significant contribution of the Pakistani diaspora, the speaker praised their involvement in the advancement and growth of both nations.\nHe described overseas Pakistanis as a priceless asset to the country and vowed to take measures in partnership with relevant stakeholders to facilitate overseas Pakistanis.\nHe urged that UK might consider offering more educational opportunities in the form of scholarships for pakistani students.\nJane Marriott thanked the Speaker of the National Assembly for his kind words and agreed to take up all matters of concerns with the relevant authorities.\nShe also expressed hope that both sides would continue to work together to further deepen the Pakistan-UK relations.",
  "retrievedAt": "2025-08-11T01:55:59.740Z"
}
