{
  "title": "Mohsin Naqvi orders to block Sims issued on invalid CNIC",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-orders-to-block-sims-issued-on-invalid-cnic/",
  "date_published": "2024-04-18T07:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP): Federal Minster for Interior Mohsin Naqvi on Wednesday directed the National Database Registration Authority (NADRA) to block mobile SIMs issued on invalid and expired identity cards.\nDuring his visit to the NADRA headquarters, the minister visited all sectors and instructed the authorities to set up NADRA offices across the country on the pattern of model police stations established in Punjab.He said that establishing a model NADRA office will improve service delivery and provide convenience to the public.\nNADRA Chairman Lieutenant General Muhammad Munir Afsar welcomed Federal Interior Minister Mohsin Naqvi on his arrival at NADRA Headquarters.\nDuring the meeting, the minister ordered to waive off the fee on the death certificates convenience of the public. The minister directed to ensure complete security of citizens’ data. He said that Model offices of NADRA should be built to provide fast service to the public.\nHe said that more facilities should be provided on mobile platforms for the convenience of the people and social media should be used effectively to promote the institution’s initiatives.\nFederal Interior Minister Mohsin Naqvi praised the excellent performance of the current Chairman NADRA Lieutenant General Muhammad Munir Afsar. He said that the chairman NADRA has made the organization a public-friendly institution.\nThe minister planted saplings in the lawn of NADRA headquarters as part of the plantation campaign.\nChairman Nadra presented NADRA’s Roadmap 2024- 25 in a briefing which included modern and phased security architecture, cyber security audits and employee cyber security awareness and the NADRA Strategic Plan.\nUpgradation of NADRA technology and infrastructure and online platforms of registration centres will also be improved by which Pakistanis living abroad including local citizens will also efficiently get access to these facilities, the chairman briefed the minister.\nHe said that NADRA plans to set up self-service kiosks at registration centres and provide mobile registration services.\nHe also briefed that plans are underway to extend the shift hours at selected centres and provide service on weekly holidays.",
  "retrievedAt": "2025-08-11T01:56:20.599Z"
}
