{
  "title": "Iranian envoy for making Pak-Iran border a’commercial gateway’",
  "link": "https://www.app.com.pk/national/iran-pakistan-ties-strengthen-amid-economic-and-regional-cooperation-ambassador/",
  "date_published": "2024-04-18T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):Iran’s Ambassador in Pakistan Dr. Reza Amiri Moghadam on Thursday proposed transforming the Pakistan-Iran border into a ‘commercial gateway” in a bid to strengthen trade ties between the two countries.\nAmbassador Moghadam suggested expanding border markets and opening new crossing points to facilitate trade.\nTalking to a private news channel, he expressed optimism about furthering Pak-Iran bilateral cooperation across various sectors.\nHe said strides had been made in enhancing economic, commercial, and cultural ties between the two nations.\nAmbassador Moghadam said that although Pakistan-Iran relations witnessed an improvement in recent years, there remained a significant untapped potential for deeper collaboration.\nHe underscored the need to elevate the trade volume between the two countries from the current $2.8 billion to a target range of $10 to $25 billion.\nAnticipating the upcoming visit of the Iranian President to Pakistan, he expressed hope that it would pave the way for overcoming obstacles hindering bilateral relations.\nHe said the Pak-Iran Gas Pipeline project held mutual benefits for both countries, expressing hope that ongoing negotiations would bring positive results towards the completion of the project.\nHe lauded Pakistan’s vocal denouncement of the recent attack on the Iranian embassy in Syria, viewing it as a tangible expression of solidarity between the two nations.\nOn Palestine issue, he stressed the collective responsibility of the Muslim Ummah.\nHe urged the Muslim-majority countries to actively contribute towards resolving the longstanding plight of the Palestinian people.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:55:51.588Z"
}
