{
  "title": "MoHR helpline received 1,460,460 calls since its inception",
  "link": "https://www.app.com.pk/national/mohr-helpline-received-1460460-calls-since-its-inception/",
  "date_published": "2024-04-18T15:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):Ministry of Huaman Right’s Helpline 1099 has received 1,460,460 calls since i has established providing services in 5,5323 relevant cases, said an official here on Thursday.\nTalking to APP, he said all callers being victim of human rights violation, received legal assistance and were referred to the concerned departments when necessary.\nDuring this period, 41,615 call backs and follow-up calls have been made to the victims.\nDuring the financial year 2022-23, individuals seek 131,309 inquiries 1,657 were provided with comprehensive legal advice and other essential support services.\nThe Helpline, diligently committed to ensuring the utmost efficacy and efficacy of its operations, further undertook 28,904 call backs and follow-up calls in relation to the pertinent cases during this specified period.\nTotal of 88 calls received relating to matters of rights and welfare of children.These inquiries are regarding child protection, education, health, and general well-being.\nThe helpline received 403 calls concerning to challenges faced by individuals with disabilities.\nThese inquiries cover accessibility, discrimination, employment opportunities, and the provision of adequate support and services.\nA significant number of 577 calls were received concerning governance-related human rights issues.\nThese inquiries encompassed issues such as transparency, accountability, corruption, and the protection of civil and political rights within the broad framework of governance and administration.\nThe helpline received a minimal number of 2 calls relating to land rights. These inquiries involved matters such as land ownership, disputes, and the protection of land rights for individuals and communities.\nThe helpline received 2 calls specifically requesting free legal assistance. These inquiries sought guidance and support on various legal matters, including criminal cases,civil disputes etc.\nHe further added that that a total of 288 calls fell under the miscellaneous category, encompassing a wide range of inquiries that did not fit into the other predefined categories. These inquiries covered topics such as employment rights, social welfare, consumer protection, and various other individual concerns.\nThe Helpline received 42 calls related to the protection of life and personal liberty. These inquiries encompassed concerns such as threats to personal safety,and violations of fundamental rights.\nAround 23 calls were received concerning transgender rights. They sought guidance and support on issues specific to the transgender community, such as discrimination, healthcare, and social inclusion.\nA solitary call was received addressing matters pertaining to the rights of minorities. This inquiry sought assistance and guidance on issues related to discrimination, religious freedom, and equal opportunities for minority communities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:55:53.463Z"
}
