{
  "title": "China corner-stone of Pakistan’s Foreign Policy with convergence of views on regional, global issues : Kh Asif",
  "link": "https://www.app.com.pk/national/china-corner-stone-of-pakistans-foreign-policy-with-convergence-of-views-on-regional-global-issues-kh-asif/",
  "date_published": "2024-08-26T12:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Minsiter for Defence and Defence Production, Khawaja Muhammad Asif on Monday, during a call on by People’s Liberation Army (PLA) Ground Forces Commander of China, General Li Qiaoming, said that friendship with China was a corner-stone of Pakistan’s Foreign Policy based on convergence of views on regional and global issues.\nThe Minister welcomed the Chinese Ground Forces’ Commander and appreciated long history of Pak-China relations in all fields, a news release said.\nHe said these relations were focused on welfare of peoples of both countries and not against any other country. He added that Pakistan attached great importance to its relations with China.\nThe Minister appreciated existing bilateral mechanisms, like Strategic Dialogue, Consular Consultations and Counter Terrorism Consultations. He mentioned that the strategic relations between the two neighbouring nations were based on mutual trust. He pointed out that Pakistan deeply appreciated China’s diplomatic and material support in its fight against terrorism at regional and international fora.\nKhawaja Muhammad Asif expressed the views that Pakistan-China Security Cooperation was pillar of regional stability. Cooperation in security/intelligence sharing had increased amidst growing threats and advent of CPEC, he added.\nHe reiterated that Pakistan was committed to stability and peace in the region with particular focus on its relations with Afghanistan. A peaceful Afghanistan was in the interest of Pakistan and to the whole region, he added.\nThe visiting dignitary commended Pakistan’s efforts in fostering regional peace and stability, as well as Pakistan Armed Forces’ role in combating terrorism.\nBoth sides acknowledged the strong relationship between their Armed Forces and committed to further expanding defense collaboration.",
  "retrievedAt": "2025-08-11T04:59:38.798Z"
}
