{
  "title": "Jamal Raisani condemns terrorist attacks in Balochistan",
  "link": "https://www.app.com.pk/national/jamal-raisani-condemns-terrorist-attacks-in-balochistan/",
  "date_published": "2024-08-26T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):Pakistan Peoples Party (PPP) leader Nawabzada Jamal Khan Raisani Monday expressed deep concern over the recent acts of terrorism in Musa Khel and Bolan Balochistan and called for immediate and decisive action against terrorists.\nIn a statement, he emphasized that the time has come for concrete steps to be taken to ensure peace and stability in the country, urging the nation to move beyond mere condemnations to practical measures.\nJamal Raisani condemned the recent terrorist attacks in Balochistan, stating that the people of the province have made countless sacrifices for the security and peace of the nation.\n“I have carried the coffins of my brother, father, and loved ones on my shoulders, so I am well aware of the pain experienced by the families affected by terrorism,” he said.\nHe said the terrorist incidents in Musa Khel and Bolan have shaken the entire nation, where 29 innocent civilians were brutally killed after their identification cards were checked.\n“Identification cards do not mention Baloch, Punjabi, Sindhi, or Pashtun, but the word ‘Pakistan.’ Terrorists have no religion, ethnicity, or language.”\nJamal Raisani described these incidents as cowardly acts and criticized certain elements for attempting to portray these events through a lens of nationalism to present themselves as heroes.\nHe said that their goal is to spread hatred and discord throughout Pakistan and Balochistan aiming to pit communities against each other.\nJamal Raisani urged the nation to unite against terrorism and stressed that the time has come to launch decisive action against terrorists to eradicate terrorism from its roots and steer the country towards peace.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:02:23.894Z"
}
