{
  "title": "Green Pakistan Upscaling Programme worth Rs 125.1843 bln under implementation to revive forestry, wildlife resources: NA told",
  "link": "https://www.app.com.pk/national/green-pakistan-upscaling-programme-worth-rs-125-1843-bln-under-implementation-to-revive-forestry-wildlife-resources-na-told/",
  "date_published": "2024-08-26T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Minister for Law and Justice Azam Nazir Tarar on Monday apprised the National Assembly that the ministry of climate change is implementing Green Pakistan- Upscaling Program Phase-I worth Rs 125.1843 billion across the country with the overall objectives to revive forestry and wildlife resources.\nReplying to various questions during Question Hour, he said that under the programme, plantation target of sowing, regrowing and distribution of 2.12 billion plants has been accomplished at national level. An independent third party consortium of IUCN, WWF and FAO conducted monitoring of the achievements with success rate ranging from 75% to 95%, he said.\nThe minister said Mangrove cover in Pakistan has recorded increase by 300% since 1990, making Pakistan the only country in region with expanding mangrove cover.\nThe minister said National level Tree Planting Campaigns are organized regularly during Spring and Monsoon Tree Planting seasons to encourage tree planting by different sections of the society. A National Forest Landscape Restoration Plan has been prepared through extensive consultations that targets restoration of 2.10 million hectare degraded land and 1.20 million hectare of degraded watersheds, increased landscape resilience against climate impacts and restoration of 0.7 million hector of community forests, woodlots, irrigated plantations and linear plantations by 2045.\nHe said a project on conservation of Chilgoza forests in Balochistan, KP and Gilgit Baltistan (GB) is being implemented in collaboration with FAO. The project has assisted natural regeneration over 2153 hectare (4 million seedlings) and plantation of fruit and forest seedlings on 653 hectares.\nAzam Nazeer said the respective Forest Departments of all four provinces, AJK and GB are mandated to control deforestation. At the national level, the Government has revived the Federal Forestry Board to discuss and resolve issues that cause deforestation.\nFor revival of forestry and wildlife sector of the country, Upscaling Green Pakistan Programme has been major initiative, he said.\nThe minister said new protected areas have been notified under this programme to provide safe habitat for wildlife species. Nationwide plantations are carried out in two seasons i.e. Spring and Monsoon. Since inception of the present government 85.58 million plantation has been carried out during Spring Season 2024. The Government has recently launched Monsoon Tree Plantation Campaign 2024 inaugurated by the prime minister on 7th August 2024 with target of 40.33 million plants across Pakistan, he added.\nTo a question, the minister said the geographical area of Islamabad is 90600 hectares and as per recent assessment carried with the technical support of WWF Pakistan forest cover area of Islamabad is 25,882 hectares area which forms 28.57% of the ICT area. There is no universally recommended minimum percentage of forest area that every country must adhere to, as the percentage of area under forest cover is subject to local environmental conditions.\nHe said globally, 30% of terrestrial land area is under forests. Under Sustainable Development Goals (SDG 15) countries are encouraged to protect, restore and promote sustainable use of terrestrial ecosystems, sustainably manage forests, combat desertification, and halt and reverse land degradation and halt biodiversity loss, he added.\nAzam Nazeer Tarar said the Capital Development Authority (CDA) is the regulatory authority for new housing societies in Islamabad. As per assessment carried out with technical support of WWF-Pakistan an estimated area of 448 hectare has been deforested in ICT area during 2016 to 2020 due to development activities.\nTo another question, he said the Ministry is responsible for national policy making and coordination related to forests, wildlife and biodiversity matters. The enforcement of forestry legislation lies with respective provincial/territorial forestry departments, and with CDA in ICT jurisdiction, he added.\nTo a separate question, he said under Green Climate Fund (GCF), Pakistan has a portfolio of USD 257.7 million with the GCF for eight projects that have been approved by the Fund for Pakistan. Moreover, the anticipated grants from the GCF are USD 1329 million.\nCurrently six projects amounting to USD 17.9 million are approved and under implementation. In addition to these projects, projects amounting to USD 30 million have been endorsed by the MOCC&EC, and currently submitted to the GEF secretariat for review and approval, he said.\nHe said currently, Pakistan has a portfolio of USD 257.7 million with the GCF. There are total of 8 ongoing projects. For GEF, six projects amounting to USD 17.9 million are approved and under implementation.",
  "retrievedAt": "2025-08-11T05:00:52.503Z"
}
