{
  "title": "Attaullah Tarar pays tribute to security forces for unmatched sacrifices",
  "link": "https://www.app.com.pk/national/attaullah-tarar-pays-tribute-to-security-forces-for-unmatched-sacrifices/",
  "date_published": "2024-08-26T17:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): Federal Minister for Information, Broadcasting, National Heritage, and Culture, Attaullah Tarar, on Monday paid glowing tribute to the personnel of security forces and law enforcement agencies for their unmatched sacrifices in maintaining law and order in the country.\nSpeaking on a point of order in the National Assembly, he said, “We pay tribute to the security forces, law enforcement agencies, and those injured while maintaining law and order in the country.”\nHe recalled that in 2013, under the leadership of Muhammad Nawaz Sharif, terrorism was eliminated from the country, and peace was restored in Karachi city.\nHe alleged that the Pakistan Tehreek-e-Insaf (PTI) government brought back the Taliban, disrupting law and order in Khyber Pakhtunkhwa. He further alleged that no meeting of the National Action Plan was held during 2018 to 2022, blaming the PTI for the current bloodshed in the country.\nHe held the previous PTI government responsible for the deterioration of law and order, accusing it of allowing the Taliban to settle in Pakistan.\nTarar stressed the need for national unity to address the law and order situation. He said that the Chief Minister of Khyber Pakhtunkhwa had been requested to establish a counter-terrorism department on modern lines and to install a safe city system in Peshawar.\nResponding to a point rose regarding the law and order situation in Kalabagh, he informed the National Assembly that the issue had been resolved peacefully. “I just spoke to the Inspector General of Police, Punjab; the issue was resolved peacefully, and the two groups have dispersed.”\nOn another point, the minister said that an operation against dacoits in the Kacha areas had been launched. He commended the efforts of the Sindh and Punjab governments working to eliminate dacoits from the region and expressed hope that the operation would successfully eradicate them.\nThe minister said that Karachi is a top priority for the incumbent government. He highlighted that during the Prime Minister’s recent visit to China, the Karachi Circular Railway and other projects for the city were discussed.\nHe also said that the Airport Authority has been established to improve airport operations and provide best possible facilities for passengers.\nAddressing energy concerns, he said that a National Task Force has been established to review Independent Power Producers (IPPs). The government has allocated Rs. 50 billion to provide relief to electricity consumers. The task force is expected to submit reports on IPPs, and solutions to related issues will be sought, he added.\nRegarding internet connectivity issues, the minister said that the Pakistan Telecommunication Authority (PTA) Chairman reported that the Web-Management System is currently being upgraded.\nHe explained that the use of the Web-Management System and VPNs had caused slow internet speed but assured that improvements would be seen in the coming days.\nHe also recalled that the previous PTI government had issued directives for the installation of a National Firewall System.\nHe said that the Chairman of the National Disaster Management Authority (NDMA) had been directed to provide relief to those affected by floods in Dera Ismail Khan. The NDMA has established a state-of-the-art digital visual center for weather forecasting.\nThe minister said that it is an honor for Pakistan that Benazir Bhutto was the first female elected prime minister of the country.\nOn the subject of law and order, the minister said that the federal government has the full support of the Khyber Pakhtunkhwa Chief Minister in maintaining law and order.\nHe said that during a meeting, the chief ministers of all four provinces were on one page to eliminating terrorism and improving law and order.\nHe said that there are “no-go” areas in the country. However, he said there is need for intelligence-based and targeted operations against terrorists. With the coordination of federal and provincial governments, he expressed confidence that terrorism would be eradicated from the country.",
  "retrievedAt": "2025-08-11T05:00:48.767Z"
}
