{
  "title": "HEC, PPRA conduct online training for procurement professionals",
  "link": "https://www.app.com.pk/national/hec-ppra-conduct-online-training-for-procurement-professionals/",
  "date_published": "2024-08-26T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The Monitoring and Evaluation (M&E) Division, HEC in collaboration with Public Procurement Regulatory Authority (PPRA), Pakistan conducted a one-day online training on “Procurement Regulatory Framework” for procurement professionals working in the higher education sector.\nIt was attended by over 130 officials of Higher Education Institutions (HEIs) from across the country through smart classrooms as well as HEC officials from different divisions. Dr. Mukhtar Ahmed, Chairman HEC was chief guest at the opening ceremony.\nSpeaking to the participants, he highlighted the roadmap of this initiative, outlining its objectives and potential impact on Pakistan’s higher education landscape within the procurement domain.\nHe emphasized the importance of such programmes to improve the procurement system within the higher education sector through understanding of rules and to avoid inaccuracies.\nSenior officials from PPRA delivered extensive lectures on procurement rules and demonstrated the advanced\ne-procurement process. The workshop explored roles, key activities and methods used to drive value from the procurement process.\nThe interactive sessions focused upon the efficient and effective tendering strategy, including the completion of pre-qualification questionnaires, invitation to tender documentation and evaluation methodologies under PPRA.\nThe training course provided the participants with an understanding of public sector procurement, providing an overview of key areas such as the legislative environment, rules, and documentation.\nThe forum also enabled the participants to discuss concepts and issues pertaining to procurement and audit through learning the key control issues in dealing with government resources and identifying the financial controls to prevent fraud, corruption and mis-procurement.\nHEC is committed to promote excellence in governmental and institutional procurement through education and professional development of professionals.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:02:20.056Z"
}
