{
  "title": "UN Rep lauds Pakistan Govt for hosting Afghan refugees for over 4 decades",
  "link": "https://www.app.com.pk/national/un-rep-lauds-pakistan-govt-for-hosting-afghan-refugees-for-over-4-decades/",
  "date_published": "2024-08-26T15:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP): United Nations high level delegation led by Indrika Ratwatte, Deputy Special Representative of the Secretary-General, called upon Federal Minister for States & Frontier Regions Division Engr Amir Muqam here on Monday.\nThe delegation comprised of Mohamad Yahya, Resident Coordinator, Ms. Philippa Candler, Country Representative UNHCR in Pakistan, Farman Khilji, Government Liaison Officer UNHCR, Fady El Meouchy, Special Assistant to the DSRSG, Malick Ceesay, UNAMA Head of Office, said a press release.\nEngr Amir Muqam welcomed the delegation and elaborated Pakistan’s role in hosting the Afghan Refugees for four decades. He also outlined the public sentiment after the recent events and Government of Pakistan’s stance on safe and voluntary return of Afghan Refugees.\nIndrika Ratwatte, DSRSG, lauded the Government of Pakistan for hosting the Afghan refugees for well over 40 years and acknowledged the fact that Pakistan has stretched its resources to share this burden.\nHe also informed that during his recent visit to Kabul, he has engaged with the Interim Afghan Government, and convinced them to create a conducive environment for the returning Afghan refugees so that they may reintegrate in their provinces of origin.\nFurthermore, he stressed that the Government of Pakistan, through Ministry of SAFRON may like to consider the Government of Afghanistan’s request for a dialogue in the Tripartite meeting which can be instrumental in finding a sustainable solution to the ongoing Afghan refugees’ safe return.\nEngr Amir Muqam agreed to the fact that the solution for Afghan refugees issues lies in a safe and peaceful Afghanistan.\nHe informed that Government of Pakistan has made all sincere efforts in providing extension to the registered Afghan refugees,however the international community should also share the burden now and fulfil its commitments especially with regards to the third country resettlement cases.\nThe meeting ended with a vote of thanks to the Chair.",
  "retrievedAt": "2025-08-11T05:01:36.680Z"
}
