{
  "title": "FFD forecasts flash flooding for Kirthar, Sulaiman Ranges",
  "link": "https://www.app.com.pk/national/ffd-forecasts-flash-flooding-for-kirthar-sulaiman-ranges/",
  "date_published": "2024-08-26T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 26 (APP):The Flood Forecasting Division (FFD) on Monday anticipated severe flash flooding along the Kirthar Range (Jacobabad, Qambar Shandadkot, Dadu and Jamshoro Districts) and the Sulaiman Range (D.G.Khan & Rajanpur Districts) including nullahs in Balochistan (Zhob, Loralai, Sibbi, Nasirabad and Kalat Division) besides urban flooding in major cities of Sindh during August 27 to 31 (Tuesday to Saturday).\nAccording to daily report of Federal Flood Commission, at present, River Indus is experiencing “Medium Flood” in Guddu-Sukkur reach and “Low Flood” at Kotri Barrage while all other major rivers of the Indus River System i.e. Jhelum, Chenab, Ravi and Sutlej are discharging normal flows.\nSince August 19, 2024 Tarbela Reservoir is maintaining Maximum Conservation Level (MCL) of 1550 feet. However, ample storage space (26.23%) remains available in the Mangla reservoir to accommodate any potential high flows from upstream River Jhelum. The combined live storage of the country’s major reservoirs (Tarbela, Chashma & Mangla) stands at 11.346 MAF which is 84.96% of the total live storage capacity of 13.354 MAF.\nAccording to FFD, Lahore, yesterday’s depression over Northwestern Madhya Pradesh (India) has shifted South-Southwestwards and is now located over Southeastern Rajasthan (India). Trough of Westerly Wave extends over Northeastern Afghanistan and adjoining Pakistan, while the Seasonal Low persists over Northern Balochistan.\nLight moist currents from the Bay of Bengal were penetrating into upper parts of Pakistan while moderate to strong moist currents from both the Bay of Bengal and Arabian Sea were penetrating into Southern Sindh and adjoining areas up to 5000 feet at the reporting time. It is very likely to become intense during the next 4 days.\nFor the next 24 hours, FFD, Lahore has predicted scattered thunderstorm rain of Moderate Intensity over Islamabad, Punjab (Rawalpindi, Sargodka, Gujranwala, Multan, Bahawalpur & DG Khan Division) and Khyber Pakhtunkhwa including upper catchments of all major rivers of IRS.\nFor the same period, scattered to widespread thunderstorm rain of Moderate Intensity with isolated Heavy Falls is expected over Southern & Southeastern Sindh besides isolated thunderstorm rain of Moderate Intensity over Punjab (Faisalabad, Sahiwal & Lahore Divisions) and Balochistan (Nasirabad, Sibbi, Loralai, Zhob & Kalat Divisions).\nFor the extended period from 27th August to 30 August 2024, widespread thunderstorm rain of Heavy to Very Heavy intensity with isolated Extremely Ileavy Falls may occur over Southern Punjab (D.G.Khan, Multan & Bahawalpur Divisions), Sindh and Balochistan (Zhob, Loralai, Sibbi, Nasirabad, Kalat & Makran Divisions).\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T05:00:01.501Z"
}
