{
  "title": "PM urges youth to set roadmap for successful life with focused objectives",
  "link": "https://www.app.com.pk/national/pm-urges-youth-to-set-roadmap-for-successful-life-with-focused-objectives/",
  "date_published": "2020-02-23T07:12:00.000Z",
  "source": "APP",
  "content": "MIANWALI, Feb 23 (APP):Prime Minister Imran Khan Sunday stressed upon the country’s youth especially students to clearly identify a roadmap of life with clear objectives to achieve their aims and always learn from the bitter lessons of life.\nAddressing the 7th convocation of the NAMAL University as special guest and chairman, the prime minister said that students should listen to their inner voice from their heart or personal inclination which could steer their future course in life.\nHe said the man was created with certain objectives. Allah Almighty had bestowed upon human being with different potentials which were often left unattended.\n“You can achieve everything you have pictured or dreamt of in your life. In this struggle, human being could stumble over hurdles and difficulties. But these stumbling blocks should not lead you to frustration,” he advised a cheering assembly of students and faculty members.\nThe prime minister recalled his long cricket career in this regard.\n“The craze often arises from heart and propels people to go forth. You have to make strong determination and once you made it, burn your boats as there is no way to return,” he added.\nThe prime minister said difficult times should be taken as part of learning and soul searching which enable a person to explore the factors behind failure.\nOnce, he said, these lessons learnt coupled with high level education could help enhance the human capabilities to analyze these factors.\n“It is a progression in life and a demoralized person cannot excel in life. Never feel dishearten from the bad effects of failure and hard times, seek how to manage them by switching goals from one to other,” he added.\nHe further said Quaid-e-Azam Muhammad Ali Jinnah and Allama Iqbal wanted establishment of a true Islamic welfare state on the pattern of world’s first welfare state of Madina which was established by the Holy Prophet (Peace be Upon Him).\nHe said it was the most successful model for the world to emulate and a great civilization emerged on the basis of these modern principles.\nThe country which adopted those principles achieved progress, he said, adding even the Scandinavian countries were progressing as they had adopted the basic principles of humanity.\nThe prime minister said in China, its leadership, had resolved some 30 years back to lift a huge population from the poverty and now it was the fastest growing economy in the world with its GDP growth rate hovering around 30 trillion dollars.\nHe said a strong nation would rise on the principles of state of Madina. The main thing was to correct the life path as science could not answer two things, ie; the basic aim of life and what to happen in the life hereafter, he added.\nBeing the most successful personality in the world, the Holy Prophet (Peace Be Upon Him) stood distinct and role model for all humans, he said and urged the students to follow his way of life.\nThe prime minister also welcomed and thanked UAE minister for Tolerance Sheikh Nahyan bin Mubarak Al Nahyan Sheikh Nayhan for attending the event.\nHe said on behalf of people of Pakistan, he offered his gratitude over the way, the leadership of United Arab Emirates stood with Pakistan at a time when it needed friends.\n“The UAE proved as a friend in need and helped us at a time when we faced probably one of the critical economic challenges,” he added.\nThe prime minister also mentioned the support extended by the leadership of Saudi Arabia and China which helped his government to manage the national economy.\n“My country will never forget the way you stood with us in time of need,” he observed.\nThe prime minister reminded the students that cherishing big dreams and challenges always led to success in the future. Life dotted with tasks as manifested by the Prophets should be preferred instead of a life full of ease which could lead to destruction.\nHe also referred to a quote of Robert Frost who preferred to travel on untrodden paths.\nThe prime minister also congratulated parents of the graduating students and shared moments of joy for getting quality degrees of international repute.\nHe also appreciated Tony Ashai, the world-renowned architect, for his work and modern layout of the institute.\nHe declared that NAMAL would soon become an Oxford university and knowledge city in the world.\nThe prime minister also mentioned services of Tariq who runs a petrol station in the area from where the PTI started its movement in Mianwali.\nUAE minister for Tolerance Sheikh Nahyan bin Mubarak Al Nahyan in his address lauded contribution of the university through vigorous commitment.\nHe said that he was attending the ceremony to express pride, solidarity, friendship, brotherhood and cooperation which existed between the two brotherly countries.\nThe UAE minister said the people and leadership of both the countries were celebrating their commitment to growth and cooperation in all spheres of life. The people of UAE felt pride in calling Pakistan as a brother and friend, he added.\nThe fraternal ties between the brotherly countries enjoyed strong support from their people and leadership, Sheikh Nahyan said.\nHe said the UAE ruler’s recent visit to Pakistan was the most fruitful visit whereas, Prime Minister Imran Khan’s visit to the UAE reflected the strong commitment and cooperation between the leadership to further build bridges of friendship and cooperation for the mutual benefits of the two countries.\nThe UAE minister also appreciated Prime Minister Khan’s devotion and commitment and said he inspired them all for his tiresome work and sincere leadership for the future of his nation and his contribution for growing the brotherly ties between the two countries.\nHe expressed his confidence that the graduation courses in the university would lead to youth empowerment. NAMAL university had become an essential center for the education, cultural and social landscape of Pakistan, he added.\nHe said the university’s visionary mission had been offering equal opportunities and education to all regardless of the social diversity and economic conditions.\nHe said through its various disciplines, the institute was articulating the great vision in the shape of knowledge based society in the country and providing immense opportunities for the rural and deserving students enabling them to diversify their energies for the development and prosperity of the country.\nSheikh Nahyan referred to the latest global challenges said today, the world faced unpredictability and the communities were living in the interesting times with enormous challenges cropped up ranging from fragile economies, quality of life and issues like climate change, waste, portable water, renewable energy and importance for sustaining the quality of life.\n“A large number of adults and women lack basic education skills whereas children deprive of schooling. The religious and political beliefs are also adding to certain challenges,” he added.\nHe stressed upon peaceful co-existence among all communities and knowledge based society in which religious tolerance would be the main ingredient.\nThe UAE minister said the religion of Islam had been an everlasting source of social values, human dignity and parity and characterized by the needs of modern life. The Islamic principles always united the people, he added.\nHe also called upon the global community to promote a harmony among all communities and religious tolerance.\nEarlier, Vice Chancellor Namal University Sikandar Mustafa, gave an overview and performance of the university.\nRector Arif Nazeer Butt said that they were continuously in the process of learning which increased wisdom with aims for bigger challenges and exposure.\nHe said that competency and commitment were the other keys for success and they were striving to build a sustainable institution by upholding merit.\nThe prime minister, as chairman of the university, also awarded degrees and awards among students of different faculties",
  "retrievedAt": "2025-08-11T18:50:40.907Z"
}
