{
  "article_id": "2025-01-17_753a82b893e32dcb7e718f3e7bc9222e",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885687/twin-peaks-creator-and-filmmaker-david-lynch-dies-at-78",
    "retrieved_at": "2025-08-26T07:45:48.424Z"
  },
  "metadata": {
    "title": "‘Twin Peaks’ creator and filmmaker David Lynch dies at 78 - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-16T19:22:09.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/170014074f00bbf.jpg",
    "categories": [],
    "word_count": 774,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "David Lynch, the American filmmaker, writer and artist who scored best director Oscar nominations for Blue Velvet, The Elephant Man and Mulholland Drive and co-created the groundbreaking TV series 'Twin Peaks', has died at age 78, his family said on Thursday. \"It is with deep regret that we, his family, announce the passing of the man and the artist, David Lynch,\" a statement on Lynch's Facebook page said. \"There's a big hole in the world now that he's no longer with us. But, as he would say, 'Keep your eye on the doughnut and not on the hole.'\" With his visually stunning, disturbing and inscrutable works filled with dream sequences and bizarre images, Lynch was considered a master of surrealism and one of the most innovative filmmakers of his generation. He received an honorary Academy Award in 2019 for his lifetime achievements. The enigmatic artist and devotee of transcendental meditation preferred not to explain his complex, bewildering films, which included Wild at Heart, the 1990 Palme d'Or winner of the Cannes Film Festival, the 1977 horror film Eraserhead and the 1997 mystery Lost Highway. \"A film or a painting, each thing is its own sort of language and it's not right to try to say the same thing in words. The words are not there,\" he told The Guardian newspaper in a 2018 interview. His style of filmmaking prompted the term Lynchian, which Vanity Fair magazine described as weird, creepy, and slow. In his films, Lynch inserted the macabre and disturbing into the ordinary and mundane and heightened the impact with music. Lynch said that he was not only interested in the story but also the mood of a film, set by the visual elements and sound working together. \"His eye for the absurd detail that thrusts a scene into shocking relief and his taste in risky, often grotesque material has made him, perhaps, Hollywood's most revered eccentric, sort of a psychopathic Norman Rockwell,\" the New York Times said in 1990. Lynch, a former Eagle Scout who was once described by producer Mel Brooks as \"Jimmy Stewart from Mars\", grew up to be a counterculture icon but his roots were firmly planted in small-town, wholesome America. David Keith Lynch was born on January 20, 1946, in Missoula, Montana, the eldest of three children. His father worked for the US Department of Agriculture and the family moved frequently. Lynch once described his childhood as a \"very beautiful, sort of perfect world\". But as an art student at the Pennsylvania Academy of Fine Arts in the 1960s he encountered the seedier side of America while living in a crime-ridden, run-down area of Philadelphia with his wife and baby daughter. He described the city as the biggest influence in his life. The experience inspired Eraserhead, his unsettling, hallucinatory debut feature that became a cult hit in midnight cinemas. After seeing the film, Brooks, the producer of The Elephant Man, hired Lynch to direct it. The Elephant Man, about a severely deformed man in Victorian London, was nominated for eight Academy Awards in 1981. Although it failed to win an Oscar, it launched Lynch into the mainstream. But his next film, the 1984 science fiction epic Dune, bombed at the box office. Two years later Lynch was back on top with Blue Velvet, which delved into the mysterious underworld in a small North Carolina town. Some critics considered it his masterpiece and the best film of the decade. \"Blue Velvet represents something that has never been seen before and in all likelihood will never be seen again: an underground movie made with Hollywood means and Hollywood skill. It's midnight mainstream,\" Dave Kehr, of The Chicago Tribune, wrote in his 1986 review. Lynch switched to the small screen in 1990 when he created the mystery crime series 'Twin Peaks' with Mark Frost for ABC. The Emmy-winning series became a cultural phenomenon and was revived in 2017. Mulholland Drive, Lynch's 2001 Hollywood mystery, began as a TV pilot but was dropped by the network and eventually made it to the big screen. It was named the best film of the 21st century so far in a 2016 BBC poll of 177 critics worldwide. In his later years Lynch, a true Renaissance man, devoted himself to making documentaries, short films, painting and a YouTube channel. He released albums, music videos, soundtracks and books, including his 2018 memoir Room to Dream. The acclaimed director was married four times and fathered four children. \"I love what I do and I get to work on stuff I want to work on. I wish everybody had that opportunity,\" he told Vulture.com in a 2018 interview.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}