{
  "article_id": "2025-01-17_37daebe97ae7dda406dbe25668a76820",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885785/uk-mps-hear-about-rights-violations-in-pakistan",
    "retrieved_at": "2025-08-26T07:45:20.243Z"
  },
  "metadata": {
    "title": "UK MPs hear about rights violations in Pakistan - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T03:36:22.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 607,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "LONDON: A group of British parliamentarians convened on Wednesday at Portcullis House to address escalating allegations of human rights violations and political repression in Pakistan. The session, organised by the newly formed group Friends of Democratic Pakistan-UK (FODP), spotlighted concerns over the erosion of democracy, enforced disappearances and the use of military courts to prosecute civilians. The briefing, chaired by James Frith MP, was attended by around a dozen UK MPs, including Jeremy Corbyn, Naz Shah, Preet Kaur and Andrew Pakes, along with political activists, former officials of Imran Khan's administration, and victims of alleged transnational repression. The event provided a platform for discussion on Pakistan's ongoing political crisis and its implications for human rights and democratic governance. FODP founder Safina Faisal emphasised the need to hold Pakistan's military establishment accountable for alleged violations of international law. She highlighted the plight of political workers, journalists and women, many of whom have faced arbitrary arrests and mistreatment. \"The killing of peaceful protesters, enforced disappearances and military trials of civilians are grave concerns requiring urgent attention,\" she stated. Zulfi Bukhari, Shehzad Akbar and founder of newly formed group detail alleged mistreatment of PTI supporters PTI's Zulfi Bukhari, a former aide to Imran Khan, shared grim details about the alleged deaths of protesters during a PTI demonstration on Nov 26, claiming that hundreds had died. He also cited a United Nations report that declared former prime minister Imran Khan's detention illegal, describing the conditions of his imprisonment as inhumane. Ms Faisal, who claimed to be a UK-based business owner, said the triggering point for her was when police attacked Dr Yasmin Rashid's car. \"I felt so sorry for her. I am used to being treated like a human living here in the UK so my heart breaks when I see how people are treated in Pakistan.\" \"In the UK you can protest outside Downing Street. You can question your PM but no one will abduct you. Though she has no affiliation with PTI, she said she supports the party besides \"raising my voice for women, including PTI activists, who have faced injustice\". Zulfi Bukhari alleged systematic torture of PTI members to suppress dissent, adding that some were tortured publicly. \"Intimate videos have been weaponised to blackmail politicians,\" he said. He further claimed that Imran Khan was being held in solitary confinement with limited access to legal counsel or family. Shehzad Akbar, former accountability czar in Imran Khan's government, spoke of the targeting of British Pakistanis. He recounted how his own family faced abductions and harassment. \"This is not about political rivalry; it's about dismantling democracy itself,\" he asserted, accusing the Pakistani government of using rigged elections and judicial manipulation to consolidate power. Lord Daniel Hannan also addressed the gathering, lamenting what he described as martial law conditions in Pakistan. He said, \"I have no conscience interests in this matter, but purely democratic interest. I don't see how anyone can be indifferent to the collapse of the rule of law and personal freedom in a country especially like Pakistan to which we are connected by deep ties. We expected democracy to grow in Pakistan since 1945.\" At the conclusion of the session, parti-cipants called for the restoration of judicial independence, the release of political prisoners, and an independent international investigation into human rights abuses. Specific demands included targeted sanctions against officials responsible for violations, publication of the Commonwealth election observation report and guarantees of fair trials for those facing prosecution. This session follows a similar parliamentary hearing last summer, which also drew attention to the arrest of Imran Khan and the subsequent protests in Pakistan. Published in Dawn, January 17th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}