{
  "article_id": "2025-01-17_a72b5a18789740018720edc861b0320f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885899/russia-iran-harden-military-and-trade-ties-in-new-pact",
    "retrieved_at": "2025-08-26T07:45:04.021Z"
  },
  "metadata": {
    "title": "Russia, Iran harden military and trade ties in new pact - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T17:14:01.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/172213377352f7d.jpg",
    "categories": [],
    "word_count": 758,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Russia and Iran signed a new treaty on Friday underpinning their economic and military cooperation, which both sides cast as a major milestone in their relations. Moscow has looked to the Islamic republic as a strategic ally since sending troops into Ukraine in February 2022, worrying Western officials who see both as malign actors on the world stage. The two sides agreed to help each other counter common \"security threats\", according to a copy of the text published by the Kremlin. But, they stopped short of a mutual defence pact like the one signed between Russia and North Korea last year. They also agreed that if either side were subjected to aggression, the other would not provide \"assistance to the aggressor\". Russian President Vladimir Putin and his Iranian counterpart Masoud Pezeshkian, who signed the agreement together at a ceremony in the Kremlin, both hailed the accord as a new chapter in their ties. \"This truly breakthrough document is aimed at creating the necessary conditions for the stable and sustainable development of Russia and Iran and our entire Eurasian region,\" Putin said. Pezeshkian said the pact would \"open a new chapter in relations between Iran and Russia in all fields, especially in the field of economic cooperation\". The two sides agreed to \"support trade and economic cooperation in all areas\", a key point as both sides ramp up trade in the face of heavy Western sanctions on their energy industry. They also agreed to cooperate on training military personnel, as well as to formalise the docking of warships and vessels at each others' ports. The agreement did not explicitly reference the exchange of weapons, an area of cooperation that the West has slapped with sanctions. Iran has already supplied Russia with self-detonating \"Shahed\" drones that Moscow fires on Ukraine in nightly barrages, according to Ukrainian and Western officials. Sitting next to Putin in the Kremlin after signing the treaty, Pezeshkian called for a political settlement to end the nearly three-year conflict. \"I would like to remind that war is not a suitable solution to solve problems and we welcome negotiations and achieving peace between the two countries of Russia and Ukraine,\" he said. Moscow and Tehran had been working on a new treaty for years. Their previous relationship was governed by a 2001 document they have renewed periodically. They share a complicated history. Iran and Russia fought wars in the 18th and 19th centuries over land in the Caucasus, and the Soviet Union and Britain launched a joint invasion of Persia during World War II. Putin has made building ties with Iran, China and North Korea a cornerstone of his foreign policy as he seeks to challenge what he calls a US-led \"global hegemony\" amid his Ukraine offensive. Tehran has also sought closer ties with Moscow, after suffering a series of foreign policy setbacks last year. A rebel offensive overthrew Russian and Iranian-backed Syrian leader Bashar al-Assad last month, and a conflict between Israel and Tehran-ally Hezbollah substantially weakened the militant group. Speaking ahead of a fragile truce between Israel and Hamas that is due to come into force, Pezeshkian said he hoped a \"permanent ceasefire will be established in Gaza and the aggressions on this land will end\". Putin also expressed hope for a \"long-term stabilisation\" in Gaza and called for the world not to \"weaken efforts for a comprehensive settlement of the Palestinian-Israeli conflict on the basis of international law\". Pezeshkian's visit to Russia also comes just days before Iran-hawk Donald Trump returns to the White House. The US president-elect, who is seeking a rapid end to the conflicts in Ukraine and the Middle East, has made repeated military threats against the Islamic republic. During his first term, the Republican pulled out of a multinational deal that provided Iran sanctions relief in exchange for restrictions on its nuclear programme. In 2020, Iranian Revolutionary Guards commander Qasem Soleimani was assassinated in a US drone strike in Iraq on Trump's orders, prompting a wave of fury in Iran. Trump last year warned the US would \"wipe [Iran] off the face of the Earth\" if a recent alleged Iranian plot to kill him had been successful. Iran's president on Tuesday reiterated his country's categorical denial of being part of the alleged plot. Iranian President Masoud Pezeshkian made the remarks in his first interview with a US media outlet since Trump survived an assassination attempt last July, and also after the US Justice Department in November charged an Iranian man in connection with a plot to kill Trump the previous month.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}