{
  "article_id": "2025-01-17_3f0ef8355551cf3fd05c5e0c4e542d35",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885890/trump-and-xi-speak-by-phone-vow-improved-ties-despite-threats",
    "retrieved_at": "2025-08-26T07:45:03.966Z"
  },
  "metadata": {
    "title": "Trump and Xi speak by phone, vow improved ties despite threats - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T16:56:21.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/172138084b0646d.png",
    "categories": [],
    "word_count": 432,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "US President-elect Donald Trump and Chinese President Xi Jinping spoke by phone on Friday, days before the incoming US president returns to the White House, with both leaders vowing to take a positive approach to improving ties between the rival countries. Xi said he hoped for a \"good start\" in relations with Trump, who, in turn, said, \"It is my expectation that we will solve many problems together and start immediately.\" Trump in his election campaign threatened China and other US trading partners with huge tariffs, but he has also said he is open to talks with Xi, a leader he has long openly admired. The threat of a 10 per cent tariff on Chinese products, in addition to existing tariffs dating back to Trump's first term, is driven by accusations that China allows fentanyl's chemical components to flow into Mexico and onto America where the drug causes 70,000 overdose deaths a year. \"We discussed balancing trade, fentanyl, TikTok, and many other subjects,\" Trump said on his social media platform Truth Social after their call. \"President Xi and I will do everything possible to make the world more peaceful and safe!\" The US Congress passed a law last year forcing TikTok's Chinese owner ByteDance to either sell the platform or close it by Sunday due to national security concerns, but Trump pledged to save TikTok in his campaign speeches and has been mulling ways to stall the ban. The law was an answer to widespread belief in Washington that the highly popular app could be used by China for spying or propaganda. Trump's impending return to the Oval Office has stirred fears that tensions between the world's two largest economies could worsen rapidly. This week, Beijing slammed comments by Marco Rubio, Trump's nominee for secretary of state, as \"unwarranted attacks\" after Rubio called China \"the most ... dangerous near-peer adversary\" the United States had ever faced. \"The US side must establish a correct understanding of China, cease unwarranted attacks and smear campaigns against China,\" foreign ministry spokesman Guo Jiakun said. In December, Xi said China was willing to engage in dialogue and \"expand cooperation\" with the US, but warned that a trade war would have \"no winners\". The Biden administration has largely worked to ease multiple frictions and said that China has taken some action on fentanyl. In his farewell speech, Biden said that China would \"never surpass\" the US, which would remain the world's dominant superpower. He added that Washington managed its complex ties with Beijing and that the relationship \"never tipped over into conflict\" in his four years as president.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}