{
  "article_id": "2025-01-17_3153d55b4fe0ca0ce6d1ef33edf7e193",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885689/rajhi-takes-overall-dakar-car-lead-on-penultimate-stage",
    "retrieved_at": "2025-10-12T00:53:06.330Z"
  },
  "metadata": {
    "title": "Rajhi takes overall Dakar car lead on penultimate stage - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T03:06:04.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/67897602325fd.gif",
    "categories": [],
    "word_count": 430,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "SHUBAYTAH: Saudi driver Yazeed al-Rajhi took the lead in the overall car standings at the Dakar Rally in Saudi Arabia after finishing third in Thursday's decisive penultimate stage. Swedish driver Mattias Ekstrom (Ford) won the 11th stage, finishing the 275km special in Empty Quarter dunes 41sec ahead of Nasser al-Attiyah (Dacia) with Rajhi (Overdrive) completing the podium, at 1min 45sec. Rajhi, who trailed leader Henk Lategan (Toyota) by 2min 27sec going into Thursday's stage, not only caught his rival but opened up a significant gap. He now leads the South African by 6min 11sec going into Friday's final stage. \"I knew I could do it. I trusted myself, I attacked and enjoyed,\" said the 43-year-old Saudi at the finish. The 12th and final stage on Friday is mainly symbolic, with a timed special of just 61km, which will make it hard for the South African to alter the outcome. Barring any surprises, Rajhi will become the first Saudi competitor to win the Dakar, which has been based in Saudi Arabia since 2020. Lategan, now second overall, finished fifth on the day 10min 23sec behind Ekstrom who is 16min 23sec back in third in the overall standings \"We couldn't have done better today, I tried everything,\" said Lategan. \"I'm no dune expert but I'm happy to be at the finish with the car in one piece. It's incredible, we had a very good Dakar with ups and downs, but overall I'm happy.\" Spanish rider Tosha Schareina won a fog-shortened penultimate bike stage while Daniel Sanders remained on course to become the second Australian to win the category. Schareina's victory in 2hr 12min 4sec on the 112km 11th stage special did not, however, allow the Honda rider, who is second overall, to threaten Saunders' grip on the race. The Spaniard clawed back 7min 31sec but Sanders still has a 9min lead going into Friday's final stage so if he safely negotiates the 61km special he will emulate the achievement of fellow Aussie Toby Price who won the bikes in 2016 and 2018. Due to an early morning fog that prevented the organisation's helicopters from taking off, the stage began three hours late. The weather conditions forced the organisers to stop the motorbike special stage after 152km, out of the 308km initially planned, to avoid the riders having to ride in the dark. Argentinian Luciano Benavides (KTM) finished second in the stage at 33sec with Adrien Van Beveren (Honda) a further 24sec behind. The Frenchman is also third in the provisional overall standings, 15min 50sec behind Sanders. Published in Dawn, January 17th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}