{
  "article_id": "2025-01-17_7afde216074adecf0684834af48d4478",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885873/death-toll-in-attack-on-kurram-convoy-rises-to-10-official",
    "retrieved_at": "2025-08-26T07:45:03.952Z"
  },
  "metadata": {
    "title": "Death toll in attack on Kurram convoy rises to 10: official - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T15:25:49.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/17174350545ee6d.jpg",
    "categories": [],
    "word_count": 363,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "The death toll from an ambush on a convoy bringing supplies to Parachinar in Khyber Pakhtunkhwa's Kurram district rose to 10 on Friday, according to the police. A day ago, a security official was martyred and four others were injured when the convoy of 35 vehicles, carrying food and other essential items to Parachinar, came under attack in the Bagan area. In retaliatory action by security personnel escorting the convoy, six attackers were killed and 10 others were injured. Although communications were lost with the drivers of 29 vehicles, some of them managed to make it safely to Thall in Hangu district. There were conflicting reports about the incident's death toll. A local police officer speaking on condition of anonymity told AFP that those killed in the ambush \"include two security personnel, four drivers ... and four civilians\". \"Additionally, there are reports that five to six drivers have been abducted by a local tribe,\" he said. However, Kurram District Health Officer (DHO) Qaiser Abbas told Dawn.com: \"Two security personnel, five drivers and a passenger were killed in yesterday's convoy attack.\" He said the second security personnel was one of those injured in yesterday's attack who had succumbed to his injuries overnight. \"The bodies of four drivers have been recovered from Urawali. The bound drivers were shot dead after being tortured,\" the DHO said. Abbas added that dismembered bodies of a driver and a passenger were later found and brought to Lower Alizai in sacks. Additionally, the drivers' family members told Dawn.com that they were in contact with the victims until 1am, after which they could not be reached. Meanwhile, Nazir Ahmad, president of the Parachinar Trade Union, told Dawn.com that 20 trucks in the convoy were burned and looted, while only one reached Parachinar and returned to its point of origin after delivering its cargo. Clashes stemming from decades-old land disputes claimed at least 130 lives since November, with food and medicine shortages reported due to weeks-long road blockades. A peace agreement was signed on January 1, but the route connecting Parachinar remained blocked. On January 4, a government convoy was attacked near Bagan, injuring Kurram's deputy commissioner and leaving the convoy stranded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}