{
  "article_id": "2025-01-17_a3433db4b12a9e2a2bc2a96d60de93bc",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885777/atlantic-boat-tragedy-claims-lives-of-dozens-of-pakistanis",
    "retrieved_at": "2025-10-12T00:53:09.723Z"
  },
  "metadata": {
    "title": "Atlantic boat tragedy claims lives of dozens of Pakistanis - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T03:28:42.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 682,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "- Migrants' rights group estimates 44 of the deceased hailed from Pakistan - Vessel with 86 migrants left Mauritania on Jan 2; stayed adrift for 12 days - FO says vessel capsized; families of victims claim their loved ones were 'tortured' GUJRAT/MADRID: Around 50 Pakistanis have died on a migrant boat, while trying to cross the Atlantic Ocean illegally to reach Europe, according to an NGO and victims' families. The boat with 86 migrants, including 66 Pakistanis on board, left the West African country of Mauritania for Spain's Canary Islands, migrant rights group Walking Borders said on Thursday. Moroccan authorities rescued 36 people on Wednesday, while 44 of those presumed to have drowned were from Pakistan, Walking Borders CEO Helena Maleno said on X. The ship remained stranded in the ocean for 13 days. However, it is unclear what caused the death of the migrants. In a post on X, Pakistan's Foreign Office said the boat carrying 80 passengers \"capsized\" off the coast of the disputed region of Western Sahara. \"Several survivors, including Pakistanis, are lodged in a camp near Dakhla. Our embassy in Rabat is in touch with local authorities. Additionally, a team from the embassy has been dispatched to Dakhla to facilitate the Pakistani nationals and provide necessary assistance.\" The FO said its Crisis Management Unit was activated and Deputy Prime Minister and Foreign Minister Ishaq Dar instructed government agencies to extend all possible facilitation to the affected Pakistanis. However, the victims' families have claimed that their loved ones died allegedly due to torture, but it was unclear who they blamed for the mistreatment. The claims surfaced in recordings of telephone conversations between survivors and their relatives, but Dawn couldn't independently verify these claims. One of the survivors told his family over the telephone that the migrants were \"physically tortured\" by local officials, with some being hit by hammers. The survivors were admitted to a government hospital in Morocco, where the dead bodies of eight Pakistanis were also being kept. According to local sources, a number of youth from Gujrat and Mandi Bahauddin districts of Punjab left the country around four months ago to illegally enter Europe. They claimed that only 19 people survived the 13-day ordeal, during which they remained stranded in open waters. The survivors claimed that only eight dead bodies reached the shore, with the remaining dumped in the sea. At least 12 of the deceased were said to be from three villages - Dhola, Jaura Karnana and Ghurko - of Kharian. The survivors and the heirs of the deceased victims have urged the federal government to take measures to bring back the dead bodies. The relatives and area people were gathered at the houses of the victims soon after hearing the report of tragic deaths in Africa. FIA has launched a probe into the incident and has started gathering information about the victims and their families. Prime Minister Shehbaz Sharif sought a report on the incident from authorities and said strict action would be taken against those involved in the heinous act of human trafficking. \"No negligence of any kind will be tolerated in this regard. Strong steps are being taken against human trafficking,\" he said in a statement. A number of non-state actors are also active in the region of Western Sahara - where the incident took place - because of a dispute between local pro-independence forces and the Moroccan government. Walking Borders said it had alerted authorities from all countries involved six days ago about the missing boat. Alarm Phone, an NGO that provides an emergency phone line for migrants lost at sea, also said it had alerted Spain's maritime rescue service on Jan 12 about a boat in distress. While quoting Spain's maritime rescue service, Reuters reported the agency received information on Jan 10 about a vessel that had left Nouakchott, Mauritania and was experiencing problems. The service said it could not confirm if it was the same boat, adding it had carried out air searches without success and had warned nearby ships. With input from Reuters Published in Dawn, January 17th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}