{
  "article_id": "2025-01-17_2228ba8240a3c4973fb92567d5613aa2",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885768/first-polio-case-from-thatta-takes-tally-to-73",
    "retrieved_at": "2025-08-26T07:45:28.103Z"
  },
  "metadata": {
    "title": "First polio case from Thatta takes tally to 73 - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T03:09:53.000Z",
    "image_url": "https://i.dawn.com/medium/2025/01/170824297dc21ef.jpg?r=082433",
    "categories": [],
    "word_count": 205,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD: The country reported a polio case on Thursday, marking the second consecutive day of new cases and bringing the tally for 2024 to 73. An official at the Regional Reference Laboratory for Polio Eradication at the National Institute of Health confirmed the detection of the 73rd wild poliovirus type 1 (WPV1) case from Thatta. \"This is the first polio case from Thatta for 2024. Since the sample was collected in December last year, the case has been categorised as part of last year's tally. The incubation period for the sample is nearly three weeks, which can extend further during the winter season,\" the official explained. It is worth mentioning that while hundreds of samples are received at the lab, only a few test positive for the virus, and it takes about three weeks to confirm whether a child is infected with polio. \"Pakistan has been responding to a significant resurgence of WPV1, with 73 cases reported in 2024. Of these, 27 are from Balochistan, 22 from Khyber Pakhtunkhwa, 22 from Sindh and one each from Punjab and Islamabad,\" he added. The Pakistan Polio Programme conducts multiple mass vaccination drives each year, bringing the vaccine directly to children's doorsteps. Published in Dawn, January 17th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}