{
  "article_id": "2025-01-17_230b39c2120d3b660a21e25eeec2087b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885853/shares-at-psx-climb-1400-points-on-easing-political-concerns",
    "retrieved_at": "2025-08-26T07:45:03.872Z"
  },
  "metadata": {
    "title": "Shares at PSX climb 1,400 points on easing political concerns - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T10:06:21.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/171455342b5957b.jpg",
    "categories": [],
    "word_count": 456,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Bulls dominated the trade floor on Friday as shares at the Pakistan Stock Exchange (PSX) surged by more than 1,400 points following a critical judgment in the 190 million Al-Qadir Trust case. The benchmark KSE-100 increased by 902.46 points, or 0.79 per cent, to stand at 114,744.58 from the previous close of 113,836.74 at 2:58pm. At 4:13pm, the index stood at 115,291.87, up by 1,455.13 points. Finally, the index closed at 115,272.08, up by 1,435.34 points or 1.26pc, from the last close. Awais Ashraf, director research at AKD Securities, credited the upward trajectory to the market's positive response \"to today's verdict in the graft case as it has eased concerns regarding political noise, with attention now shifting towards improving macroeconomic factors\". He noted that a \"disinflationary trend and a fully funded external account position could lead to easing interest rates, encouraging investors to move from fixed-income instruments to equities\". Earlier today, former premier Imran Khan and his spouse Bushra Bibi were convicted in the 190m Al-Qadir Trust case with the PTI founder being sentenced to 14 years in prison and a seven-year jail term handed to his wife. Judge Nasir Javed Rana announced the verdict - previously delayed three times - in a makeshift courtroom at Adiala Jail. The court also imposed fines on Imran and Bushra, amounting to Rs1 million and Rs500,000, respectively. Failure to pay the fines would result in an additional six months in jail for Imran and three months for Bushra, the court said. Meanwhile, Yousuf M. Farooq, director research at Chase Securities, attributed the bullish momentum to the market reacting positively to the announcement of a current account surplus of $582 million for December and a drop in the Sensitive Price Index (SPI) over the past week. \"Inflation is expected to stay low over the next year, supported by a stable currency and a balanced current account,\" he said. \"As always, political instability in Pakistan remains the primary downside risk to the market, while oil prices present an upside risk to inflation.\" \"We anticipate that interest rates could fall to single digits within FY25, provided government spending is kept in check, and the stock market is likely to remain buoyant over the next year,\" he added. Yesterday, shares had extended losses overnight, despite a series of interest rate cuts, due to the sharp contraction in the large-scale manufacturing (LSM) sector jolting investor confidence in the economic outlook, which pushed the benchmark KSE 100 index to drop below 114,000. An analyst had noted that the bearish momentum previously witnessed was after news broke regarding initiating dialogue between the establishment and senior opposition leadership. This development sparked uncertainty among investors, raising concerns about potential challenges to the ruling coalition government and their policies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}