{
  "article_id": "2025-01-17_936c93a4493829e25ceee435af08dc6a",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885799/is-it-time-for-basic-income-in-pakistan",
    "retrieved_at": "2025-08-26T07:45:11.845Z"
  },
  "metadata": {
    "title": "Is it time for basic income in Pakistan? - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T04:04:35.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/171509513e57e1f.jpg",
    "categories": [],
    "word_count": 985,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "Social assistance is everywhere conditional, and in Pakistan it is no different. Either it comes with behavioural strings attached - 'do this and we'll help you, don't and we won't' - or it is targeted, with receipt conditional on being a specific type of person or facing a particular type of problem (think Benazir Income Support Programme [BISP] and the extreme poor). Those who defend this approach typically offer the same justifications. First, they argue, resources are limited, which means that we should give them to those most in need and make sure they use them well. Intuitively sensible, this position quickly gives way to the troubling claim that as the poor aren't used to having any money, we should 'guide' them so that they don't waste what they get. Inside this sits the pernicious, yet sadly widespread, prejudice that the poor are feckless and do not deserve our support. Critics of these positions abound, as they do of conditionality more broadly. First, they note, any claim that 'resources are limited' is contentions at best. 'Just walk around F6 in Islamabad', you might hear, 'and you'll see how much money Pakistan really has'. The important point is that we cannot uncritically accept the claim that there isn't enough money to go around, because how much money is available to the public purse is always and everywhere an artefact of decisions made by the wealthy and the powerful about how much they will make available. Second, the evidence is clear that conditionality is ineffective, as well as inefficient and inimical to human dignity. Targeted forms of social assistance exclude many of those most in need. Targeting also leads to waste, since it generates duplication, opens avenues for corruption, and requires burdensome bureaucracies to administer. In turn, these bureaucracies are known to be stigmatising and abusive - the poor typically have to jump through unpleasant hoops, offer bribes, and face shame to access support that should be their right. Think of basic income like a pension, only for everyone, with the core purpose being to provide a stable floor of economic security for all. This is why lawmakers, scholars and civil society advocates are turning to basic income as an alternative. Per the international definition, a 'basic income' is \"a periodic cash payment unconditionally delivered to all on an individual basis, without means-test or work requirement\". Think of it like a pension, only for everyone, with the core purpose being to provide a stable floor of economic security that all people can stand on, as a replacement for the patchy social safety nets that we know millions fall through. Supporters note not only that basic income could provide people with life-changing economic security, but that its simplicity - being transferred directly to all - eliminates the need for expensive, wasteful administrative systems that are ripe for corruption. This prospect is attractive all over the world, but perhaps nowhere more so than in the subcontinent. Pilot research from across the region shows that basic income can be transformative. In India, a trial in rural Madhya Pradesh found that it improved people's health, nutrition, education, and ability to invest. More recently, an experiment run by colleagues and I in Telangana showed major improvements in well-being, dignity, and people's sense of agency. These findings have been paralleled in Bangladesh, where another experiment documented a substantial reduction in stress alongside an increase in people's sense that they can cope with life. Nepal, it has just been announced, is set to join the wave of South Asian basic income pilots. Advocacy is now following the research. In Bangladesh, major public figures are calling for the transitional authority to rationalise the social protection system by combining the more than 150 targeted social protection schemes into one nationwide basic income. In India, Congress included basic income in the manifesto that finally stemmed the BJP tide at the last election. While at the state level, more and more authorities are announcing something like a 'basic income for women'; surely it is only a matter of time before one of them crosses the Rubicon to offer basic income for all? All of which begs the question - is it not time for Pakistan to catch up? The Pakistani government's own figures suggest that in 2023-24, over seven per cent of GDP was allocated to 'pro-poor expenditure', as per the national Poverty Reduction Strategy Paper. Even if these figures are highly debatable - they generously include public infrastructure and even some military spending, as if fattening the fauj feeds the poor - the important point is that the state is at least in principle committed to equity. What is more, the sums cited by the Ministry of Finance would be enough to fund a modest nationwide basic income of Rs3,000 per month. Wouldn't this be preferable to the status quo? Crucially, while the sceptical will still say that it can't be done, history shows that it can - they said the same about the Nepalese pension, which launched at a measly rate in the 1990s and now sits at the equivalent of Rs8,000 a month, and they even said the same about BISP. Likewise, in India, many claimed that basic income would be impossible, before the aforementioned basic income pilots triggered a nationwide movement calling for reform. What history tells us, therefore, is that bravely beginning - either with a pilot or a policy innovation that can be scaled - opens the pathway for institutionalisation. And where benefits get institutionalised, they tend to stay, since their popularity makes them difficult for predatory authorities to roll back. It is time for Pakistan's policymakers and for progressive civil society to be bold and take steps towards basic security for everyone, through basic income for all. The writer teaches at the University of Bath, UK, and has led basic income pilots across South Asia. Published in Dawn, January 17th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}