{
  "article_id": "2025-01-17_ec1ea87735829a3f125b314d09a88b1a",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1875358/can-the-courts-save-us-from-the-war-weve-waged-against-our-own-planet",
    "retrieved_at": "2025-08-26T07:45:05.290Z"
  },
  "metadata": {
    "title": "Can the courts save us from the war we’ve waged against our own planet? - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-17T07:42:07.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/17122209093c15b.jpg",
    "categories": [],
    "word_count": 2018,
    "reading_time_minutes": 11
  },
  "content": {
    "article_body": "Since the Industrial Revolution, man-made greenhouse gas emissions have driven global temperatures to unprecedented levels. By 2023, Earth recorded its hottest year since systematic weather tracking began in the 1850s - a testament to the unravelling of the planet's ecological stability (or its lack thereof). For over 11,000 years, the Earth's delicate balance, established after the last Ice Age, provided a stable foundation for human progress. This natural equilibrium enabled human beings - a species over many millennia - to invent the wheel and plough, domesticate animals like the ox and buffalo, and cultivate agricultural surpluses that spurred civilisation itself. That balance is now in peril. Climate change has destabilised the very ecosystems that made human advancement possible. We no longer inhabit a planet capable of sustaining the surpluses or one that has the climate stability to support a civilisation. The climate crisis is not merely a challenge to overcome - it a symptom of human beings' overconsumption of the Earth's finite resources. The consequences of climate crisis are all around us. In October, catastrophic floods ravaged Valencia, Spain, while the blistering heatwaves of the summer of 2024 claimed thousands of lives across South Asia, including over 1,000 Hajj pilgrims. Here in Pakistan, we live the crisis daily: unprecedented rain and floods, droughts, heatwaves, and toxic air pollution (epitomised by Punjab's notorious smog) that render life in both rural and urban areas a battle for survival. Another facet of the climate crisis in Pakistan is poor governance. In 2022, as historic floods displaced millions, $450 million were spent on fighter jets. In Punjab, cities choking on vehicle fumes and crippled by traffic congestion saw billions of rupees funnelled into signal-free corridors to ease commutes to sprawling housing schemes. Meanwhile, Karachi endured a deadly heat spell in June, claiming over 500 lives, while Sindh's bureaucrats secured multi-billion rupee SUV deals. At the same time, as food insecurity looms large and rural livelihoods erode, millions of acres in Sindh and Punjab have been handed over for corporate farming - an agenda absent from Pakistan's climate policies, food security frameworks, or Sustainable Development Goals (SDGs). The climate crisis isn't just a product of greenhouse gases; it's exacerbated by short-sighted policies and misplaced priorities, driving the country further into ecological collapse. What role, if any, do courts of law play in addressing the climate crisis? At first glance, one might assume their function is limited to interpreting statutes and resolving disputes. But as the climate crisis accelerates, threatening fundamental rights and survival itself, the judiciary's role has expanded far beyond these traditional confines. This shift was evident in Asghar Leghari's case before the Lahore High Court (LHC). In 2016, Asghar Leghari, a lawyer and farmer from Punjab, filed a petition challenging the government's inaction on climate change. He sought the enforcement of the federal government's Framework for Implementation of National Climate Policy 2014. In its 2018 judgment, the LHC observed: \"Climate Change is a defining challenge of our time and has led to dramatic alterations in our planet's climate system. For Pakistan, these climatic variations have primarily resulted in heavy floods and droughts, raising serious concerns regarding water and food security.\" The court went on to add that these disruptions disproportionately harm society's most vulnerable and emphasised its constitutional duty to protect fundamental rights. In a powerful observation, it stated, \"This is a clarion call for the protection of fundamental rights of the citizens of Pakistan... [and] can only be addressed by climate justice.\" Since the Leghari judgment, Pakistani courts have increasingly invoked the principles of climate justice in cases before both the high courts and the Supreme Court (SC), recognising that governance failures and environmental degradation are intrinsically linked to the safeguarding of human rights. Cement manufacturing companies are notoriously and disproportionately powerful, wielding outsized political clout. Yet, in 2019, even their influence met a formidable roadblock in the court. It began in 2018 when a cement company sought to establish a plant in the Chakwal and Khushab Districts of Punjab, an area classified as a \"negative zone\" by the Industries Department. Undeterred, the company challenged the zoning regulations, taking the matter to the country's highest court. The court dismissed the challenge, citing an overlooked but compelling factor: climate vulnerability. The Salt Range, where the plant was proposed, faces rising temperatures and declining agricultural productivity. The court's legal reasoning not only upheld zoning restrictions but also set a precedent, proving that even the most politically influential players cannot bulldoze their way through when ecological concerns are at stake. In 2021, in a landmark case over the commercialisation of residential plots in Islamabad's G-9 sector, the court observed: \"Incorporating adaptation, climate resilience and sustainability, in the policy decisions by the urban development authorities, are essential to actualise the fundamental rights of the people and therefore form an integral part of the fundamental human rights of the people of Pakistan. In the face of the grave existential threat of climate change, adaptation, climate resilience and sustainability assume the role of a constitutional necessity and of an overarching constitutional obligation\" (emphasis added). Thus, the idea of climate justice as a constitutional necessity and an overarching constitutional obligation has reshaped the legal landscape in Pakistan, with ripple effects that promise to shape the country's future jurisprudence. Another prime example emerged in late 2021 when the LHC struck down the acquisition of 100,000 acres of fertile agricultural land along the Ravi River for property development, terming it illegal and unconstitutional. In a 218 page judgment, the court broke new ground, challenging the traditional notion of \"public purpose\" often invoked to justify such projects. While courts have long upheld land acquisition for housing certain groups as a public good, this case pivoted the conversation: can housing schemes truly serve the public interest without accounting for their toll on food security amid a worsening climate crisis? The judgement warned of a slippery slope - if climate impacts aren't factored into decisions, what would stop Punjab's government from converting all agricultural land into housing schemes? An appeal was filed in the SC in early 2022 and while the court suspended the LHC judgment pending the decision in appeal, the matter has not come up for hearing in almost three years. In a similar vein in 2017, Pakistan's elected representatives took a decisive step, acknowledging the urgency of the climate crisis by enacting the Pakistan Climate Change Act. The law envisioned a two-pronged institutional response: a Climate Council to shape policies and a Climate Authority to execute them. While the council was notified in 2019 and finally convened its inaugural meeting in 2022, the promised Climate Authority remains conspicuously absent. This gap between legislation and implementation underscores the disconnect between recognising the climate emergency and mobilising the structures needed to address it effectively. Early in 2024, the SC took action to address the paralysis in climate governance. Responding to an NGO's plea over the non-implementation of the Pakistan Climate Change Act, the court responded swiftly. By June, it had ordered the federal government to notify the authority. However, the complexities of governance soon emerged. Climate-related responsibilities - like agriculture, irrigation, and urban planning- fall largely under provincial jurisdiction. The court pushed forward, directing provinces to submit their climate policies. While Khyber Pakhtunkhwa and Sindh had already taken the lead with action plans, the court's urgency spurred Balochistan and Punjab to hastily formulate and adopt their first climate policies by August. The case sheds light on the limits of legal mandates in the face of bureaucratic inertia; the courts can only go so far without institutional support and political will. In June this year, to commemorate World Environment Day, the SC hosted a day-long climate conference - a symbolic yet significant step that reinforced the judiciary's growing role in addressing climate change. While these illustrative decisions are a testament to the scope of application of climate justice in Pakistan's jurisprudence, are they truly enough? A handful of progressive rulings by a handful of judges reflect potential, not permanence. Climate justice needs robust, sustained jurisprudence instead of sporadic victories. In 1994, the Supreme Court passed judgment in the Shehla Zia case. It expanded the interpretation of the fundamental right to not be deprived of life unless in accordance with law, declaring that the right to life extended to a right to a clean and healthy environment. The 26th Constitutional Amendment has introduced Article 9A - the right to a clean and healthy environment into the black-and-white text of the Constitution. This is indeed a victory for environmentalists everywhere (and credit due to the efforts and legacy of Dr Parvez Hassan). But do we have 30 years for climate justice jurisprudence to develop while the climate crisis is playing out before us? The idea of climate justice as an overarching constitutional obligation is profound and fascinating, and Pakistan's climate jurisprudence is a dynamic outlier in an otherwise dreary and conservative landscape. But anyone familiar with the workings of the judicial system will tell you there is a difference between justice and the application of law. Courts of law are designed to adjudicate rights, not provide climate justice. Will Pakistani courts be able to surmount challenges and live up to the ideals the jurisprudence has evolved so far? In Leghari's case, the LHC observed that Pakistan's adaptation to climate change hinges on climate justice. The Pakistan Climate Change Policy of 2012 and the National Adaptation Plan of 2022 outline the country's adaptation strategy to climate change. While many question whether or not these documents sufficiently comprehend the climate challenges faced by Pakistan, they serve a critical function: providing citizens with a framework to hold the government accountable for its climate commitments. They also clearly demonstrate that adaptation isn't cheap. Overhauling irrigation systems, transforming agriculture to withstand heat and use less water, and redesigning urban landscapes will require billions of rupees. The question is, who decides how these funds are spent and by whom? Courts of law in Pakistan don't usually second guess government policy decisions or how they decide to spend money - as they shouldn't - it would be against the concept of separation of legislative, executive and judicial powers. To what extent, then, might existing jurisprudence on non-interference in policymaking provide courts with leeway to determine whether specific government expenditures align with climate sensibility? Could climate justice become a tool for courts to assess which public sector projects protect climate rights and which do not? And would such judicial involvement even be prudent? These questions don't have easy answers, partly due to the very nature of the nation-state; the concept of the state as an entity that protects borders and has a monopoly on violence (in that only the state, and not individuals, is permitted to take the life and liberty of its citizens). And it is the courts of law that determine whether the state has exercised its power legitimately. The nation-state was not designed to tackle security threats that disregard borders such as the one posed by the climate crisis. Indeed, faced with an existential crisis like climate change, it makes no sense to divide the Earth into nearly 200 different entities and have them all try to fight and negotiate with one another. It follows, then, that legal systems and courts of law developed under the nation-state are not designed to do so either. Nothing demonstrates more clearly how the climate crisis has upended human civilisation than the inability of the nation-state and its institutions to address the challenges it presents. Courts of law deal with clear and tangible matters to produce jurisprudence. A court requires a plaintiff or complainant to initiate proceedings. It will summon and hear the opposing side. Evidence must be gathered and presented in specific ways. Only through the application of such bureaucracy can justice be effectively delivered. But the climate crisis does not adhere to such constructs. It places mankind against nature, demanding accountability for overconsumption. While legal systems may not be designed for this kind of accountability, Pakistan's climate jurisprudence certainly serves as a petri dish for an experiment of what could be.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}