{
  "title": "PTI’s govt. intentionally delayed development pace in Punjab: PM",
  "link": "https://www.app.com.pk/national/ptis-govt-intentionally-delayed-development-pace-in-punjab-pm/",
  "date_published": "2023-04-16T08:06:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 16 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday said that previous government of Pakistan Tehreek-e-Insaf had deliberately interrupted the development pace in the Punjab which was initiated by their government.\nInstead initiating new uplift projects, the earlier ones initiated by the PML-N government were put to halt. The people of the province were avenged for their support to Pakistan Muslim League-N, the prime minister expressed these views during a high-level meeting to review the ongoing public welfare and other proposed projects.\nThe meeting was attended by Caretaker Chief Minister Punjab Syed Mohsin Naqvi, PM’s advisor Ahad Khan Cheema and federal and provincial authorities, PM Office Media Wing said in a press release.\nThe meeting was given a detailed briefing over the construction work on Imamia colony flyover project. The prime minister directed for early completion of the project for the public use.\nAddressing the participants, the prime minister said that during the last four years of the previous government, the affairs of the province were handed over to an incompetent and puppet chief minister.\nInstead focusing on the progress of province, the office of the chief minister was misused for political maneuvering at the federal level, he opined.\nThe prime minister further observed that these public welfare-oriented projects which should have been completed and alleviated public woes, continued to hit snags for years during the previous government’s tenure.\nHe directed the early completing of all such ongoing projects.\nThe meeting was further briefed about the proposed Lahore-Sialkot motorway link road to facilitate the people of Gujranwala.\nThe prime minister directed the chief minister to constitute a three-member committee in this regard that would give a detailed briefing over the project in the next meeting.",
  "retrievedAt": "2025-08-11T08:19:16.395Z"
}
