{
  "article_id": "2025-07-11_6dfb0acd288537f221e89c114f4a97d9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minister-inaugurates-vehicle-emission-testing-drive-to-curb-air-pollution/",
    "retrieved_at": "2025-08-27T09:28:56.492Z"
  },
  "metadata": {
    "title": "Minister inaugurates vehicle emission testing drive to curb air pollution",
    "author": null,
    "date_published": "2025-07-11T10:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 413,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 11 (APP): Minister of State for Interior Talal Chaudhry on Friday formally inaugurated the vehicle emission testing campaign in Islamabad. As part of the launch, a team from the Islamabad Transport Authority inspected the minister's own vehicle using advanced equipment. Speaking in the occasion, Talal Chaudhry said that both the Prime Minister and the Ministry of Interior had instructed the administration to implement reforms across Islamabad. These reforms, he added, include not just infrastructure improvements but also steps to protect the environment. He highlighted that the air quality index (AQI) in Islamabad had been climbing steadily over the past few years. \"In some areas, the AQI had even started to cross the 200 mark, which is concerning,\" the minister stated. Chaudhry said that the vehicle inspection initiative is part of a broader effort to improve air quality. The government has imported modern testing devices that meet international standards to ensure accurate inspections of vehicle emissions. The Minister of State thanked the Punjab government for sending a trained team to support the initiative. He also noted that Islamabad's Deputy Commissioner Irfan Memon set a public example by starting the inspection drive from his own vehicle. According to Minister of State for Interior, the testing campaign will begin with government vehicles. He announced that a dedicated testing setup will be established near the Old Parade Ground to facilitate inspections. Vehicles that pass the emission test will be issued barcoded stickers as proof of compliance. Chaudhry added that strict action would be taken against vehicles that emit excessive smoke, including financial penalties. He said the capital has already witnessed improvements due to recent environmental actions. Traditional brick kilns, which were a major source of air pollution, have been shut down. Only kilns using zigzag technology are allowed to operate now, he explained. He emphasized that vehicle emissions remain one of the main causes of environmental damage in the city. The new policy aims to ensure that no smoke-emitting vehicle will be allowed to enter Islamabad without inspection. He reiterated that vehicles found polluting the air will face strict fines, and said this step is necessary to maintain public health and environmental standards. In his remarks, Minister of State for Interior Talal Chaudhry once again thanked Punjab's Chief Minister for extending support through trained teams and equipment for the campaign. The event concluded with renewed government commitment to cleaner air and stricter regulation of polluting vehicles as part of broader reforms underway in the capital.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}