{
  "article_id": "2025-07-11_9e4c14e35410ab9feb8425ad68a0f534",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/housing-ministry-fakt-exhibitions-to-host-build-pakistan-exhibition-and-conference-2025/",
    "retrieved_at": "2025-08-27T09:29:16.410Z"
  },
  "metadata": {
    "title": "Housing Ministry, Fakt Exhibitions to host Build Pakistan Exhibition and Conference 2025",
    "author": null,
    "date_published": "2025-07-11T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 348,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 11 (APP):The Ministry of Housing and Works has signed an Memorandum of Understanding (MoU) with Fakt Exhibitions (Pvt.) Ltd. to jointly host the Build Pakistan Exhibition and Conference 2025, a nationwide event series promoting housing infrastructure, sustainable development and investment opportunities, starting this October in Lahore. The MoU signing ceremony took place at the Ministry of Housing and Works here Friday, where Saleem Khan Tanoli, CEO of Fakt Exhibitions (Pvt.) Ltd., and Muhammad Ashfaq Ghumnan, Additional Secretary of the Ministry, formally signed and exchanged the document. The event was attended by Federal Minister Mian Riaz Hussain Pirzada and Secretary Hamid Yaqub Sheikh. The MoU defines Fakt Exhibitions' responsibility for organizing the \"Build Pakistan - Let's Build Together\" exhibition under the Ministry's patronage, aimed at driving economic growth, advancing industrial development, and promoting sustainability across Pakistan's housing and construction sectors. The exhibition series kicks off in October 2025 at Lahore Expo Center, featuring four events centered on infrastructure, housing, urban renewal, and industrial growth, with strong collaboration from trade bodies and industry groups to enhance participation. It has been planned that dedicated pavilions will be provided to government projects, private companies, and international exhibitors to showcase innovations, expertise, prospective investment opportunities and advanced techniques and construction materials. On this occasion, Saleem Khan Tanoli briefed on the objectives and contours of the exhibitions. He highlighted the significance of the project and its potential outcomes, which are deemed critical for infrastructure development, housing sustainability, and industrial growth. Minister Riaz Hussain Pirzada, while addressing the ceremony, congratulated both teams and termed this signing of the MoU an important milestone in the mission to strengthen Pakistan's housing, infrastructure, and industrial sectors. He called it a timely initiative providing a valuable platform for national and international stakeholders. The minister said that the initiative closely aligns with the government's broader development agenda in promoting affordable housing, facilitating public-private partnerships, attracting foreign direct investment, and accelerating progress on CPEC and Special Economic Zones. He added that the Ministry is fully committed to supporting platforms that encourage innovation, foster collaboration, and enable sustainable urban development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}