{
  "article_id": "2025-07-11_767b2ae76889d3fde03d5e95fd0ceb2e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-reaffirms-regional-engagement-condemns-rights-violations-in-iiojk-fo-spox/",
    "retrieved_at": "2025-08-27T09:28:04.944Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms regional engagement, condemns rights violations in IIOJK: FO Spox",
    "author": null,
    "date_published": "2025-07-11T16:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 761,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 11 (APP):Foreign Office Spokesperson Ambassador Shafqat Ali Khan Friday in his weekly media briefing shed light on Pakistan's diplomatic engagements, regional security concerns, and reiterated its condemnation of human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK). The Spokesperson, highlighted the country's active multilateral diplomacy, evolving bilateral relations, and firm positions on key foreign policy issues. He mentioned that the Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar was currently leading the Pakistani delegation at the 32nd ASEAN Regional Forum (ARF) Ministerial Meeting in Kuala Lumpur, Malaysia. The forum was discussing political and security issues impacting the Asia-Pacific region with the goal of fostering peace and cooperation through dialogue, he said. On the sidelines of the ARF meeting, he said Senator Dar held bilateral meetings with leaders from Malaysia, Canada, Australia, Laos, Sri Lanka, Russia, the European Union, Switzerland, and the United Kingdom. These interactions focused on strengthening economic ties, trade, education, and cultural exchanges, as well as addressing regional and global challenges. The Foreign Office Spokesperson also highlighted the visit of Turkish Foreign Minister Hakan Fidan and Minister of National Defence Yasar Guler to Islamabad. Co-chairs of the Joint Commissions under the High-Level Strategic Cooperation Council (HLSCC), the Turkish officials discussed expanding bilateral cooperation in trade, energy, and investment. The inaugural meeting of the Joint Commission reviewed the progress of twelve standing committees under the HLSCC, he added. In parallel, he said a Pakistani delegation led by Special Assistants to the Prime Minister, Ambassador Syed Tariq Fatemi and Haroon Akhtar Khan, met with Russian Deputy Prime Minister Alexei Overchuk in Moscow. Discussions covered wide-ranging cooperation including trade, energy, agriculture, and investment. Pakistan reiterated its desire to deepen ties with Russia, recognizing its stabilizing role in global affairs. He added that a key development was the inaugural round of Additional Secretary-level talks between Pakistan and Afghanistan held in Islamabad on July 7. The talks, he said focused on trade, refugee repatriation, regional connectivity, and security cooperation. \"Pakistan underscored its concerns over terrorist sanctuaries in Afghanistan and urged Kabul to take concrete actions against groups threatening Pakistan's security,\" he said. He also shed light on the 9th round of Bilateral Political Consultations between Pakistan and Poland took place in Warsaw on July 4. Delegations reviewed cooperation across various sectors including energy, defence, mobility, and higher education. Both countries agreed to enhance engagement through high-level visits and multilateral cooperation, with the next round to be held in Islamabad in 2026, he said. The spokesperson announced that July 13 will mark the 94th Youm-e-Shuhada-e-Kashmir (Kashmir Martyrs Day), commemorating the 1931 massacre of 22 Kashmiris in Srinagar. He denounced ongoing human rights abuses in IIOJK, including recent restrictions on Ashura preparations and the humiliating treatment of a Kashmiri youth by Indian forces. \"Indian armed forces are operating with impunity, with license to kill,\" Ambassador Shafqat Ali Khan said, reiterating Pakistan's call for an end to extrajudicial killings and for the international community to take notice of the situation. Commenting on Indian National Security Advisor Ajit Doval's claim of attacking 13 Pakistani airbases, the FO Spokesperson termed the remarks \"distortions and misrepresentations\" and a \"violation of international law.\" He reminded that Pakistan had downed multiple Indian aircraft and rejected India's attempts to glorify aggression. On Afghanistan, the Spokesperson acknowledged ongoing concerns about terrorist sanctuaries and stressed that Pakistan continues to engage with Kabul in good faith, hoping for more responsible action from the Afghan side. In response to questions about declassified U.S. documents on Pakistan's role during the Soviet-Afghan war, the spokesperson noted, \"What is in the past is in the past,\" emphasizing Pakistan's current efforts to chart a peaceful and cooperative future for the region. Addressing climate change, the Spokesperson said Pakistan remains one of the most vulnerable nations despite its negligible contribution to global emissions. He reiterated Islamabad's leading role in advocating for climate finance and justice for developing countries. Responding to questions on remarks made by PPP Chairman Bilawal Bhutto Zardari regarding the potential extradition of individuals of concern, the Spokesperson clarified: \"He did not name anyone. The government's position remains consistent and unchanged.\" He directed inquiries to the PPP's official spokesperson for further clarification. The Spokesperson deferred a direct response on the status of U.S. aid under former President Donald Trump but indicated that dialogue with Washington on all matters, including aid and cooperation, is ongoing. Asked about hypothetical global conflict scenarios involving China, the Spokesperson declined to speculate but reaffirmed the strength of Pakistan-China relations, describing China as \"our iron brother\" and a strategic partner.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}