{
  "article_id": "2025-07-11_8eaf63453e2d3ec93f3b3a672856c605",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/court-suspends-ban-on-youtube-channels-of-matiullah-jan-asad-toor/",
    "retrieved_at": "2025-08-27T09:28:04.900Z"
  },
  "metadata": {
    "title": "Court suspends ban on YouTube channels of Matiullah Jan, Asad Toor",
    "author": null,
    "date_published": "2025-07-11T17:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 296,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 11 (APP): The District and Sessions Court of Islamabad on Friday temporarily lifted the ban on the YouTube channels of two journalists, Matiullah Jan and Asad Toor, following their appeals against a previous order that blocked 27 channels. Additional District and Sessions Judge Muhammad Afzal Majoka suspended the order to block the YouTube channels of journalists Matiullah Jan and Asad Toor. This decision came during the hearing of appeals filed by both journalists, challenging the earlier directive issued by a lower court. Lawyers representing the journalists argued that the channels were blocked without completing the legal procedure. They maintained that the original order was issued without serving notice or giving the journalists an opportunity to present their side. Earlier, Judicial Magistrate Abbas Shah had directed the blocking of 27 YouTube channels on the request of the National Cyber Crime Investigation Agency. Matiullah Jan and Asad Toor were among those affected by the decision. In its latest written order, the court acknowledged the arguments presented by the journalists. The judge noted that, based on the available record, the applicants were not issued any notice before the channels were blocked, and they were not given a fair hearing, which is a requirement under Article 10-A of the Constitution. The court suspended the magistrate's order concerning the YouTube channels of Jan and Toor and issued a notice to the National Cyber Crime Investigation Agency, seeking a response by July 21. In its one-page ruling on each appeal, the court stated that the journalists claimed their right to a fair trial had been violated. According to the applications, no prior notice was served, and the magistrate's decision was made without hearing their version. The case will now proceed with the agency expected to respond in the next hearing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}