{
  "title": "Three injured in firing on sleeping protesters at lawyers’ sit-in in Khairpur - Newspaper - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Unknown armed men, riding three sports utility vehicles, fired at sleeping protesters early on Sunday morning in a camp at Babarloi bypass where lawyers and their supporters had begun a sit-in for an indefinite period two days ago against the construction of six canals on the Indus River.\n\nWhen the protesters woke up and went after the attackers, they escaped immediately.\n\nThe Karachi Bar Association’s president, Aamir Nawaz Warraich, said that the attackers had arrived in three vehicles: a white Fortuner, a black V8, and a black Vigo and fled after firing at the sit-in participants.\n\nHe said that three protesters were hurt. “No one can make us bow with such cowardly act. We repeatedly say we have come wearing our death shrouds. We will either be martyred here or rise with the notification against the canals,” he warned.\n\n“More than 48 hours have passed since our sit-in started. We have given 72-hour ultimatum to the government to issue the notification for the cancellation of the canals. However, we will expand our protest and announce our future course of action after consultation on Monday,” he said.\n\nThe sit-in, meanwhile, entered its third day, with long queues of vehicles stretching for several kilometres due to the traffic blockade on the bridge.\n\nKBA condemns attack\n\nThe KBA president said in a statement that the attack took place between 5am and 6am on Sunday, when three SUVs approached the protesters’ camp and their armed occupants opened fire before fleeing.\n\nHe described the attack as “shameful” and termed it a direct assault on democracy and Indus River, demanding immediate arrest of the main culprits and judicial inquiry into the incident.\n\nHe said the Indus was not merely a water source, but essence of their identity, culture, economy and survival. “When its land is grabbed, when its people are displaced, when voices defending it are attacked, it is the Indus that bleeds,” said the statement.\n\nThe association warned that the firing incident was a dangerously growing trend of silencing dissent through violence and fear. “Let it be clear: no amount of repression can drown out the truth. The KBA stands firm in its commitment to protect the Indus, uphold the Constitution and defend rights of the people,” it added.\n\nThe association reiterated its demand for an immediate and transparent judicial inquiry and called for arresting the attackers.\n\nIn a video statement, Mr Warraich said the 72-hour deadline given to the government to address the protesters’ demands would expire on Monday (today). The protesters had previously received threats and had even been targeted in earlier attacks, but such tactics would not force them to take back their demands.\n\nHe clarified that the protest would continue until notification about the canals’ construction was withdrawn. The next course of action would be announced at a press conference on Monday evening, he said.\n\nThe legal fraternity and several nationalist parties in Sindh have been staging the sit-in at Babarloi bypass against the construction of six canals, corporate farming and the 26th Amendment and Peca amendments.\n\nBoy suffers gunshot wound\n\nAyan Ali Khajjar, a 12-year-old boy, received a bullet wound during a protest rally taken out from the Ghaslate Depot (kerosene depot) locality falling within the jurisdiction of the Rehmatpur police station.\n\nThe boy was rushed to the Trauma Centre in the Chandka Medical College Hospital where his condition was stated to be stable.\n\nThe boy’s uncle, Anees Khajjar, stated shots were fired when a group of protesters was asking shopkeepers in the locality to pull down the shutters. Larkana SSP Ahmed Chaudhry has called a report from the SHO concerned over the incident.\n\nMeanwhile, local JSQM-B leaders met the SHO and urged him to register an FIR against the culprits.\n\nPublished in Dawn, April 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:39:18.936Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905514",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T00:25:15.000Z"
}
