{
  "title": "US defence chief shared sensitive Yemen strike plans in second Signal chat: US media - World - DAWN.COM",
  "author": null,
  "content": "US Defence Secretary Pete Hegseth shared information on forthcoming US air strikes on Yemen in a private Signal chat group that included his wife, brother and personal lawyer, the New York Times and CNN reported on Sunday.\n\nAFP was not able to independently verify the reports, which detailed what would be the second time Hegseth has been accused of sharing sensitive military information on the commercial messaging app with unauthorised personnel.\n\nLast month, The Atlantic magazine revealed that its editor-in-chief was inadvertently included in a Signal chat in which officials, including Hegseth and National Security Advisor Mike Waltz, discussed the strikes that took place on March 15.\n\nThe revelation sparked an uproar, with US President Donald Trump’s administration facing a scandal over the accidental leak. A Pentagon Inspector-General’s probe into that leak is ongoing.\n\nHegseth is facing increasing criticism from within his own camp, with three former staffers penning a statement decrying their dismissals and his own former Pentagon spokesman all but calling for him to be fired on Sunday.\n\nThe Times reported that Hegseth had shared information in the second Signal group chat on the same March 15 strikes that were discussed in the accidental leak.\n\nThe information shared “included the flight schedules for the F/A-18 Hornets targeting the Houthis in Yemen”, the newspaper reported.\n\nThe outlet said that unlike the accidental leak where journalist Jeffrey Goldberg was mistakenly included in the group, this group chat was created by Hegseth. The other chat was initiated by Waltz.\n\n“It included his wife and about a dozen other people from his personal and professional inner circle in January, before his confirmation as defence secretary,” the Times reported, citing unnamed sources.\n\nHegseth’s wife Jennifer is a journalist and former Fox News producer. The group also included his brother Phil and Tim Parlatore, both of whom serve in roles at the Pentagon.\n\nParlatore also continues to serve as Hegseth’s personal lawyer, the Times reported.\n\nResponding to the report, Pentagon spokesman Sean Parnell accused the NYT of being “Trump-hating media”.\n\n“There was no classified information in any Signal chat, no matter how many ways they try to write the story,” he said, without providing further specifics.\n\nThe Pentagon did not respond to AFP requests for specific details on what was shared in the defence secretary’s Signal group chat.\n\nA source familiar with the matter, who was speaking on condition of anonymity, told Reuters that the second chat included about a dozen people and was created during his confirmation process to discuss administrative issues rather than detailed military planning.\n\nThe chat included details of the schedule of the air strikes, the person said.\n\nWhite House spokesperson Karoline Leavitt said on Monday that Trump stands behind Hegseth following the reports.\n\nTrump largely pinned the blame for the earlier leak on Waltz, but has dismissed calls to fire top officials and insisted instead on what he called the success of the raids on the Yemeni rebels.\n\nThis week, three top Pentagon officials were put on leave pending investigations into unspecified leaks in the Defence Department.\n\nDeputy chief of staff Darin Selnick, senior advisor Dan Caldwell and Colin Carroll hit back on Sunday, releasing a statement saying Pentagon officials had “slandered our character with baseless attacks”.\n\n“At this time, we still have not been told what exactly we were investigated for, if there is still an active investigation, or if there was even a real investigation of ‘leaks’ to begin with,” they said in a joint statement posted on social media.\n\n“While this experience has been unconscionable, we remain supportive of the Trump-Vance Administration’s mission to make the Pentagon great again and achieve peace through strength.”\n\nHours after the latest reported leak, Hegseth’s former Pentagon spokesperson John Ullyot published a scathing opinion piece describing “a month of total chaos at the Pentagon”.\n\n“President Donald Trump has a strong record of holding his top officials to account. Given that, it’s hard to see Defence Secretary Pete Hegseth remaining in his role for much longer,” wrote Ullyot.\n\nDemocrats were quick to pounce on the latest allegations, with Senate Armed Services Committee ranking member Jack Reed calling for the Pentagon Inspector General to include the latest allegations in its probe.\n\n“If true, this incident is another troubling example of Secretary Hegseth’s reckless disregard for the laws and protocols that every other military servicemember is required to follow,” he said in a statement.\n\nAdditional input from Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/210904075f01580.jpg",
  "retrievedAt": "2025-08-25T14:28:23.697Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905640/us-defence-chief-shared-sensitive-yemen-strike-plans-in-second-signal-chat-us-media",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T04:10:06.000Z"
}
