{
  "title": "Putin says he is open to direct peace talks with Ukraine - World - DAWN.COM",
  "author": null,
  "content": "Russian President Vladimir Putin, under pressure from Washington to show willingness to make peace in Ukraine, proposed on Monday bilateral talks with Kyiv for the first time in years, and said he was open to more ceasefires after a one-day Easter truce.\n\nPutin said fighting had resumed after his surprise 30-hour ceasefire, which he announced unilaterally on Saturday. Both sides had accused each other of violating Putin’s truce, which Kyiv had largely dismissed from the outset as a stunt.\n\nWashington said it would welcome an extension of the truce. Ukraine’s President Volodymyr Zelenskiy called for it to be extended into a 30-day ceasefire protecting civilian targets.\n\nUS President Donald Trump, who has vowed to end the three-year-old war swiftly, has reoriented US policy away from its staunch support of Ukraine towards accepting Russia’s account of the war, but has so far won few concessions from Moscow.\n\nRussia rejected a Trump proposal last month for a full 30-day ceasefire, which Ukraine had accepted. US officials held parallel talks with both sides in Saudi Arabia, but they agreed only to limited pauses on attacks on energy targets, which they accuse each other of violating.\n\nSpeaking to a Russian state TV reporter, Putin said Moscow was open to any peace initiatives and expected the same from Kyiv.\n\n“We always have a positive attitude towards a truce, which is why we came up with such an initiative, especially since we are talking about the bright Easter days,” Putin said.\n\nAsked about Zelenskiy’s proposed 30-day truce on civilian targets, he said: “This is all a subject for careful study, perhaps even bilaterally. We do not rule this out.”\n\nHis spokesman, Dmitry Peskov, later confirmed that Putin was referring to the possibility of direct talks with Ukraine. The two sides are not known to have held any such talks since a failed peace effort in the early months of the war three years ago.\n\n“When the president said that it was possible to discuss the issue of not striking civilian targets, including bilaterally, the president had in mind negotiations and discussions with the Ukrainian side,” Peskov said, according to Interfax news agency.\n\nThere was no immediate response from Kyiv to Putin’s remarks. A spokeswoman for President Volodymyr Zelenskiy did not immediately respond to a request for comment.\n\nZelenskiy said earlier today that his forces were instructed to continue to mirror the Russian army’s actions.\n\n“The nature of Ukraine’s actions will remain symmetrical: ceasefire will be met with ceasefire, and Russian strikes will be met with our own in defence. Actions always speak louder than words,” he said on social network X.\n\nTrump and Secretary of State Marco Rubio both announced on Friday that Washington could walk away from peace talks in Ukraine altogether if the sides do not make more progress within days. Trump struck a more optimistic note on Sunday, saying that “hopefully” the two sides would make a deal “this week”.\n\nRussia has yet to row back from any of its major demands, including that Ukraine cede all the land Putin claims to have annexed and accept permanent neutrality. Ukraine says that it would amount to surrender and leave it undefended if Moscow attacks again.\n\nAsked about Trump’s remarks on a possible peace deal soon, Peskov told a daily conference call with reporters: “I don’t want to make any comments right now, especially about the timeframe.\n\n“President Putin and the Russian side remain open to seeking a peaceful settlement. We are continuing to work with the American side and, of course, we hope that this work will yield results.”\n\nWhile there were no air raid alerts in Ukraine on Sunday, Ukrainian forces reported nearly 3,000 violations of Russia’s ceasefire with the heaviest attacks and shelling seen along the Pokrovsk part of the frontline, Zelenskiy said earlier today.\n\nRussia’s defence ministry said on Sunday that Ukrainian forces had shot at Russian positions 444 times and said it had counted more than 900 Ukrainian drone attacks, saying also that there were deaths and injuries among the civilian population.\n\nReuters could not independently verify the battlefield reports.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2123233309c8c17.jpg",
  "retrievedAt": "2025-08-25T14:28:04.572Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905715/putin-says-he-is-open-to-direct-peace-talks-with-ukraine",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T18:23:50.000Z"
}
