{
  "title": "Total shutterdown in most parts of Sindh as people take to streets against canals - Pakistan - DAWN.COM",
  "author": null,
  "content": "LARKANA/HYDERABAD/SUKKUR/MIRPURKHAS/BADIN: The routine life came to a standstill in Sindh’s cities and towns, barring Karachi and parts of Hyderabad, on Sunday in response to a strike call given by the Jeay Sindh Qaumi Mahaz-Bashir (JSQM-B).\n\nThe call was given by the party to show that Sindh rejects the federal plan to draw six more canals from the Indus River to irrigate millions of acres in Chilistan and other areas of Punjab.\n\nWhile a complete strike was observed in all other cities and towns, a partial shutterdown was witnessed in Hyderabad district. Karachi remained unaffected.\n\nIn Larkana and Qambar-Shahdadkot districts, a ‘wheeljam’ was also witnessed while all markets, bazaars, commercial streets and business establishments remain closed. Fuel stations also did not open.\n\nJSQM-B activists riding motorbikes and raising slogans against the new canals kept patrolling roads and streets. In some localities, such groups of activists were seen forcing shopkeepers not to pull up their shutters.\n\nKarachi remains unaffected, partial strike witnessed in Hyderabad\n\nPolice personnel were deployed at different points along major roads but they did not intervene to foil attempts to enforce the strike.\n\nDuring the shutterdown in Larkana, JSQM-B leaders, including Athar Soomro, Azizur Rehman Shaikh and Ashraf Kalhoro, held a sit-in along with a good number of party workers at the main gate of Jinnah Bagh.\n\nAddressing them, the leaders said they would not allow the federal government to execute its canals project as it would turn Sindh’s fertile lands barren. They criticised Pakistan Peoples Party (PPP) for its “double standards”, and accused the Centre and Punjab of thrusting the project upon Sindh.\n\nThey deplored the “PPP-PML-N nexus” on the issue and called for shelving the plan. They appreciated the legal fraternity’s bold step of blocking highways to send a strong message to the federation against its ill-advised plans.\n\nSome unknown charged activists tore off PPP flags, panaflex and its leaders’ portraits during protest demonstrations in Larkana and Ratodero. PPP Larkana district president MNA Khursheed Junejo and general secretary Aijaz Leghari condemned the incidents and called for action against the culprits. They said they [PPP leaders] were exercising restraint but such things should not happen.\n\nA complete strike was observed in almost all cities and towns of Jacobabad, Shikarpur, Ghotki and Kandhkot-Kashmore districts on JSQM-B’s call for a Sindh-wide shutterdown on Sunday.\n\nAll business, trade, commercial and educational activities remained suspended and vehicular traffic mostly off the road.\n\nIn Sukkur district, main shopping malls, markets and commercial areas remained open but shops and vending stalls on Military Road and its surrounding localities did not open. The strike call in Khanpur Mahar town of Ghotki district was also not responded to. Rallies and demonstrations were, however, held by different political and nationalist parties across the district.\n\nIn Hyderabad district, a partial strike was observed on JSQM-B call. Initially, shops remained closed in the Cantonment Board’s limits as well but they were opened later. A complete strike was, however, observed in Qasimabad and Tando Mohammad Khan, where all main business centres remained closed.\n\nA similar shutterdown was witnessed in Jamshoro and Kotri towns. Sindh University students continued their protest against the controversial canals by blocking a section of the Indus Highway for a second consecutive day.\n\nJSQM activists blocked a section of the National Highway near Matiari Bypass.\n\nA complete strike was observed in Matiari, Saeedabad and Hala cities. Shops were opened in the evening, when the highway blockade was also ended.\n\nReports from Shaheed Benazirabad, Naushahro Feroze and Sanghar districts suggested that a complete shutterdown was observed there on Sunday.\n\nAll main markets and bazaars in Nawabshah city, including Mohni Bazaar, Sakrand Road, Qazi Ahmed Road, Bucheri Road, Masjid Road, Hospital Road, Lal Building Road, Sarafa Market, Mobile Market, Cloth Market, Hussaini Road, Mariam Road and Society remained completely closed.\n\nA total shutterdown was also observed in Sakrand, Daur, Qazi Ahmed, Jam Sahab and other towns of Shaheed Benazirabad district as well as Moro, Kandiaro, Mehrabpur, Padidan and other towns of Naushahro Feroze district.\n\nKhipro town of Sanghar district also remained closed on JSQM-B call.\n\nPublished in Dawn, April 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68055a4f046e5.jpg",
  "retrievedAt": "2025-10-12T02:39:04.366Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905513/total-shutterdown-in-most-parts-of-sindh-as-people-take-to-streets-against-canals",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T00:25:16.000Z"
}
