{
  "title": "PSX continues bullish trend over record current account surplus - Business - DAWN.COM",
  "author": null,
  "content": "Bull maintained their hold of the trade floor at the Pakistan Stock Exchange (PSX) on Monday as shares climbed more than 1,000 points on strong macroeconomic indicators.\n\nThe benchmark KSE-100 index increased by 847.96, or 0.72 per cent, to stand at 118,163.54 from the previous close of 117,315.58 at 11:18am.\n\nAt 12:40pm, the index surged 1,477.00, or 1.26pc, to stand at 118,792.58 from the last close.\n\nFinally, the index closed at 118,383.38, up by 1,067.80 or 0.91pc, from the last close.\n\nYousuf M. Farooq, director research at Chase Securities, said, “Positive news flow has driven improved market activity and a broad-based rally.”\n\nHe credited the rally to the record-low inflation reading, supported by strong Ramazan remittances of $4 billion for the month of March.\n\nHe also noted that the real effective exchange rate (REER) stood at 101, in addition to interest rates “now expected to gradually decline”.\n\n“The session began with better-than-expected results from Ghandhara Industries Limited (GHNI) and Sazgar Engineering Works Limited (SAZEW), which lifted sentiment in the auto sector, while cements rallied on expectations of a gradual recovery in economic growth,” he added.\n\nMohammed Sohail, chief executive of Topline Securities, attributed the upward momentum to “excellent corporate results”, especially by Meezan, United Bank Limited (UBL) and Sazgar.\n\nOn Friday, the index had largely traded in the positive zone throughout the trading session, buoyed by encouraging ma­­c­­r­o­economic indicators and strong corporate earnings.\n\nAccording to analysts, the upward momentum was primarily driven by the highest-ever monthly current account surplus and a favourable movement in the Real Effective Exchange Rate.\n\nPakistan recorded its highest-ever monthly current account surplus in March, with a surplus of $1.195 billion compared to $363 million in the same month last year, the State Bank data showed on Thursday.\n\nThe March surplus accounted for the largest share of the $1.859bn total surplus posted during the July-March period of the ongoing fiscal year.\n\nThe previous month also witnessed a historic inflow of remittances, which reached $4.1bn. The surge has prompted the SBP to raise its annual remittance target from $35bn to $38bn for FY25.\n\nDespite the SBP governor’s assertion that import restrictions have been lif­ted, imports of goods during the nine-month period rose modestly to $43.39bn from $39.06bn a year earlier — an increase of just $4.33bn. Exports of goods also increased by $1.77bn, reaching $24.66bn in the same period.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/211120530cce3fb.jpg",
  "retrievedAt": "2025-08-25T14:28:10.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905660/psx-continues-bullish-trend-over-record-current-account-surplus",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T06:35:44.000Z"
}
