{
  "title": "Firm hands over Rs7.5m cheque to family of sacked worker who set himself on fire in Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "A multinational company (MNC) has paid a total amount of Rs7.5 million to the family of a former employee who died by suicide in Lahore earlier this year in protest against a “delay” in the provision of justice.\n\nAsif Javed was a trade union leader at a Kabirwala-based plant of a food and beverage MNC. He was sacked in 2015, along with some other employees, allegedly for establishing a trade union within the company.\n\nThe National Industrial Relations Commission (NIRC) had ordered the workers’ reinstatement along with the payment of their dues. However, the company challenged the NIRC’s decision in the Lahore High Court (LHC), where the case had been pending for the last five years.\n\nOn February 25, Asif walked out of the court and set himself on fire. He was taken to a hospital but succumbed to his injuries three days later. The incident had led to public outcry on social media.\n\nWhile Justice Shujaat Ali Khan was hearing the case earlier, Justice Khalid Ishaq presided over the hearing today.\n\nAdvocate Izzat Fatima appeared to represent Javed in absentia while the latter’s family was also present.\n\nThe MNC’s lawyer presented a cheque worth Rs7.5m before the judge, saying it would be handed over to the deceased person’s family as an aggregate of dues and compensation.\n\nThe judge, noting that Javed left behind two widows, ordered the MNC to instead hand over the amount in the form of two separate cheques, each worth Rs3.75m, to each wife.\n\nFatima confirmed to Dawn.com that the bereaved family had received the cheques. She, however, said the payment was made “entirely on humanitarian grounds” instead of compensation or due. The MNC lawyer also confirmed this to Dawn.com.\n\nSubsequently, Justice Ishaq disposed of the petitions of both parties over Javed and other workers’ dismissal.\n\nJaved and several other employees were dismissed by the MNC in 2016. They had challenged that move before a local labour court, which had ordered their reinstatement in 2019.\n\nThat court decision was challenged by the MNC before the NIRC, which set aside the appeal on Nov 23, 2020. The next month, the company approached the LHC against that dismissal and the case had been pending since then.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:28:10.615Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905674/firm-hands-over-rs75m-cheque-to-family-of-sacked-worker-who-set-himself-on-fire-in-lahore",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T08:43:52.000Z"
}
