{
  "title": "Funds shortage causes delay in purchase of anti-cancer drugs in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The plan of Khyber Pakhtunkhwa government to extend free cancer treatment programme to Ayub Teaching Hospital Abbottabad and Khyber Teaching Hospital Peshawar has been facing delay owing to non-procurement of medicines.\n\nThe free cancer treatment programme was launched in Hayatabad Medical Complex (HMC) Peshawar in 2013, where about 10,000 patients have received cashless drugs as well as investigation services so far.\n\nLast year, the government accepted a proposal to extend the programme to Ayub Teaching Hospital (ATH) Abbottabad and Khyber Teaching Hospital (KTH) Peshawar to reduce load on HMC and facilitate patients.\n\n“The government has completed the process and is about to start procurement after a delay caused by huge paperwork as many bidders have lodged complaints, which have now been addressed,” a senior official at health department told Dawn. He said that committees were notified belatedly that also caused the delay. “Now we are going to start the process next week,” he added.\n\nHealth secretary says govt paying handsomely to the department\n\nHe said that health department was going to procure anti-cancer medicines worth more than Rs1 billion for patients in those three hospitals.\n\nProf Abid Jameel, a former head of oncology department at HMC, had requested government to extend the services to ATH and KTH as both the hospitals had oncologists. As per plan, 25 per cent patients will get free drugs in each ATH and KTH Peshawar while 50 per cent will avail the facility in HMC.\n\nInitially, the programme was meant for blood cancer, but it started covering all types of cancers in 2016.\n\nProf Abid, who launched the programme at HMC is now the chairman of Board of Governors at ATH, told Dawn that it was difficult for cancer patients from all over the province to visit HMC for consultation, diagnosis and medicines.\n\nHe said that ATH had 25-bed oncology ward that could cover Abbottabad, Mansehra and Haripur districts of Hazara division as well as patients from Kohistan and Gilgit-Baltistan regions.\n\n“We can provide free services to 600 patients at ATH annually,” he said. He said that government had so far spent around Rs10 billion on free treatment of cancer patients at HMC.\n\nAccording to HMC’s record, the cure rate in blood cancer patients is 85 per cent and around 70 per cent for all cancers, which matched international standards.\n\n“In addition to free treatment, the programme is also meant to raise awareness regarding cancers so that people consult right doctors at right time to avoid complications. Presently, mortality due to cancer is high as most patients visit hospitals only after their disease reaches third stage in which the chances of treatment are very low,” said Prof Abid.\n\nHe said that it was a government programme for all patients and hospital couldn’t deny treatment to those, who were in the last stage of cancer and began treatment to prolong their lifespan by one to two years. Therefore, awareness was needed for people to visit hospitals at early stages, he added.\n\nProf Abid said that cancer incidence could be brought down through awareness campaigns as its treatment was highly expensive and in many cases patients required lifelong treatment even if they survived.\n\n“We appreciate government for extension of free cancer treatment because patients had to visit Peshawar every month for follow-up treatment and medicines. Patients, especially those living in faraway areas, travelled to HMC,” he said.\n\nHealth Secretary Shahidullah Khan told Dawn that efforts were afoot to ensure free availability of drugs for the programme soon. “Although, government is paying handsomely but still there is shortage of funds,” he added.\n\nPublished in Dawn, April 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:28:37.885Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905561/funds-shortage-causes-delay-in-purchase-of-anti-cancer-drugs-in-kp",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T00:23:59.000Z"
}
