{
  "title": "2nd Boeing jet departs China, falling victim to Trump’s tariff war - World - DAWN.COM",
  "author": null,
  "content": "A second Boeing jet intended for use by a Chinese airline was heading back to the US on Monday, flight tracking data showed, in what appears to be another victim of the tit-for-tat bilateral tariffs launched by President Donald Trump in his global trade offensive.\n\nThe 737 MAX took off from Boeing’s Zhoushan completion center near Shanghai on Monday morning and was heading towards the US territory of Guam, data from flight tracking website AirNav Radar showed.\n\nGuam is one of the stops such flights make on the 5,000-mile (8,000-km) journey across the Pacific between Boeing’s US production hub in Seattle and the Zhoushan completion centre, where planes are ferried by Boeing for final work and delivery to a Chinese carrier.\n\nOn Sunday, a 737 MAX painted with the livery for China’s Xiamen Airlines made the return journey from Zhoushan and landed at Seattle’s Boeing Field.\n\nIt is not clear which party made the decision for the two aircraft to return to the US.\n\nTrump this month raised baseline tariffs on Chinese imports to 145 per cent. In retaliation, China has imposed a 125pc tariff on US goods. A Chinese airline taking delivery of a Boeing jet could be crippled by the tariffs, given that a new 737 MAX has a market value of around $55 million, according to IBA, an aviation consultancy.\n\nThe plane flew from Seattle to Zhoushan just under a month ago.\n\nBoeing did not immediately respond to a request for comment.\n\nThe return of the 737 MAX jets, Boeing’s best-selling model, is the latest sign of disruption to new aircraft deliveries from a breakdown in the aerospace industry’s decades-old duty-free status.\n\nThe tariff war and apparent U-turn over deliveries comes as Boeing has been recovering from an almost five-year import freeze on 737 MAX jets and a previous round of trade tensions.\n\nConfusion over changing tariffs could leave many aircraft deliveries in limbo, with some airline CEOs saying they would defer delivery of planes rather than pay duties, analysts say.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/21093810482ffc1.jpg",
  "retrievedAt": "2025-10-12T02:38:23.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905645/2nd-boeing-jet-departs-china-falling-victim-to-trumps-tariff-war",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T05:00:08.000Z"
}
