{
  "title": "Making crypto safe for the masses - Business - DAWN.COM",
  "author": null,
  "content": "Cryptocurrency is a type of digital or virtual money that uses cryptography (advanced math and computer science techniques) to secure transactions. Unlike traditional currencies, like the dollar or euro, cryptocurrencies are decentralised, meaning they are not backed by any government or reserve. They operate on a blockchain, which is a public distributed ledger of all transactions. Although there are thousands of cryptocurrencies available, the most popular in Pakistan are Bitcoin and Ethereum.\n\nCryptocurrencies are gaining momentum globally as the number of use cases is increasing and many countries are now making them legal. The most popular use is for investment. Consumers buy cryptocurrencies just like they buy dollars or gold, in the hope that its value will increase. If we take Bitcoin as an example, over the past five years it has experienced significant fluctuations and exceptional growth. At the start of 2020, one bitcoin cost $7,200. At the end of the year the price jumped to $28,900. In 2021 the peak was $69,000. In 2022 the low was $15,800. On April 1, 2025, the value was $85,169. This amounts to a 1,182 per cent return over five years. Despite its extreme volatility, it is the apparent, spectacular growth that has attracted investors to this asset class.\n\nAt the same time, cryptocurrency has had a mixed reception by regulators globally. In some countries, eg El Salvador, it has legal tender status, while in others, including Pakistan, India and China, it is not accepted as payment in lieu of goods and services, nor can one own it legally, though it is not officially banned either.\n\nRegardless of not being able to own crypto officially in Pakistan, it has become very popular. In the last couple of years its usage has gained material momentum, and Pakistan was ranked third in the Global Crypto Adoption Index in 2020-2021. Despite the State Bank of Pakistan (SBP) advising the general public to refrain from speculating in cryptocurrencies and prohibiting banks from allowing foreign payment or the use of credit cards for purchasing cryptocurrencies, it is estimated that 10 million Pakistanis have accounts with Binance, Coinbase and Crypto.com (international crypto exchanges).\n\nThe SBP should, in its own sandbox, pilot at least one exchange with one or more authorised dealers\n\nAlthough not verified directly by the exchanges, analysts believe that annual purchases of crypto through unofficial channels are north of $1 billion, and the combined holdings of Pakistani nationals are around $10 billion. Hence, cryptocurrency as an asset class is a reality, which suggests that it may be optimal to regulate it.\n\nOne of the reasons for its popularity is its ease of doing business. The customer journey for owning a crypto asset is easier than opening a bank account. One just has to download a crypto exchange app and open an account. While the ‘know your customer’ (KYC) process asks for an identity document, it does not verify the document. Once the account is open, you need to buy the coin you are interested in. The same exchange app will show thousands of local individuals acting as facilitators. You can transfer rupees to them via a bank account or wallet, and they will credit your account with the cryptocurrency you want.\n\nThis process works in a similar manner when you sell your crypto asset. In other words, this is a full-fledged, institutionalised hawala system.\n\nThe reason SBP has a jaundiced view of cryptocurrency is that, firstly, its use in Pakistan is largely speculative. Secondly, given the fact that Pakistan is constantly under the Financial Action Task Force lens and given the lax KYC and anti-money laundering (AML) procedures of the exchanges, crypto can be a major conduit for money laundering, and lastly, it is a net drain on the country’s foreign exchange reserves.\n\nNotwithstanding these genuine concerns, transactions are taking place daily and growing. Pakistan has recently created a crypto council, and its mandate is to find a solution. Major policy decisions, such as a one-time crypto amnesty declaration without tax, will take time. In the interim, the following steps can be taken.\n\nThe SBP should, in its own sandbox, pilot at least one exchange with one or more authorised dealers (banks). In this pilot, the proceeds of the sale of crypto assets held by Pakistani nationals should be allowed, albeit with the same data points required for a workers’ remittance. Payment from a foreign bank account into a local bank account with full transparency should be enabled. The pilot will demonstrate to the government the level of adoption by users.\n\nThe second solution requires both the Securities and Exchange Commission of Pakistan (SECP) and the SBP. The SECP is needed to allow the commodities exchange to create an exchange-traded fund. This would be a contract that replicates a cryptocurrency and incorporates the exchange parity in its value.\n\nWith this solution, the KYC and AML requirements would also be fulfilled, non-knowledgeable investors would be discouraged, and the amount of dollars leaving the country would also be limited, as only the net position needs to be covered by the market maker, who is the user that provides the liquidity. To make this work, the SBP would have to provide a dollar cap for the market maker to settle with the exchanges.\n\nThe volume of users and the amounts exchanged all point to the fact that cryptocurrency has become a reality in Pakistan. It now needs to be acknowledged and regulated, with rules that cover the genuine concerns of the regulators. Waiting will just make the problem bigger over time.\n\nThe writer is the Chairman of the Pakistan Fintech Network\n\nPublished in Dawn, The Business and Finance Weekly, April 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6805508ced9b1.jpg",
  "retrievedAt": "2025-08-25T14:28:24.868Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905500/making-crypto-safe-for-the-masses",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T00:26:19.000Z"
}
