{
  "title": "Neeraj Chopra hopes eponymous event will bring Diamond League to India - Sport - DAWN.COM",
  "author": null,
  "content": "Neeraj Chopra will tick off an item in his bucket list with an eponymous javelin competition in Bengaluru next month but the poster boy of Indian athletics has also added a new one to it — watching a Diamond League event in the country.\n\nThe Neeraj Chopra Classic on May 24 will be a World Athletics Gold category event featuring former world champions Anderson Peters and Julius Yego, 2016 Olympic winner Thomas Roehler and American Curtis Thompson among others.\n\nChopra, who won the gold at the 2020 Tokyo Olympics but settled for silver behind Arshad Nadeem in Paris last year, could not confirm the participation of his Pakistani frenemy though.\n\n“He is consulting his coach but has not confirmed his participation yet,” Chopra told a virtual press conference on Monday.\n\n“Like other top throwers, Arshad too has been invited. It will involve government (permission). Once everything is confirmed, we will know the final list.”\n\nIndia and Pakistan have suspended bilateral cricket over their soured political relations though the bitter neighbours continue to engage in Olympic sports.\n\nChopra is the first Indian track-and-field athlete to win an Olympic gold, world championship and the Diamond League and has single-handedly raised the profile of Olympic sports in an otherwise cricket-mad country.\n\nHaving an event bearing his name, like pole vaulter Armand Duplantis has one in Sweden, is another dream Chopra wanted to fulfil.\n\n“It’s always been a dream of mine to see India host a world class athletic event. To have such an event, that too named after me, feels surreal,” the 27-year-old said.\n\n“This is going to be an annual event and were are going to expand it to include more disciplines.\n\n“People will get to see top throwers competing right in front of their eyes. It would be a major boost for local talent, who will get to perform against the best athletes.\n\n“Our next effort should to bring a Diamond League event to India. It is not impossible.\n\n“We have the stadiums and World Athletics is aware of the growing popularity of these events in India. They also want more crowd follow athletics.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:28:07.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905692/neeraj-chopra-hopes-eponymous-event-will-bring-diamond-league-to-india",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T11:54:17.000Z"
}
