{
  "title": "Nasa’s oldest active astronaut returns to Earth - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Cake, gifts and a low-key family celebration may be how many senior citizens picture their 70th birthday. But Nasa’s oldest serving astronaut Don Pettit became a septuagenarian while hurtling towards the Earth in a spacecraft to wrap up a seven-month mission aboard the International Space Station (ISS).\n\nA Soyuz capsule carrying the American and two Russian cosmonauts landed in Kazakhstan on Sunday, the day of Pettit’s milestone birthday.\n\n“Today at 0420 Moscow time (0120 GMT), the Soyuz MS-26 landing craft with Alexei Ovchinin, Ivan Vagner and Donald (Don) Pettit aboard landed near the Kazakh town of Zhezkazgan,” Russia’s space agency Roscosmos said.\n\nSpending 220 days in space, Pettit and his crewmates Ovchinin and Vagner orbited the Earth 3,520 times and completed a journey of 93.3 million miles over the course of their mission.\n\nIt was the fourth spaceflight for Pettit, who has logged more than 18 months in orbit throughout his 29-year career.\n\nThe trio touched down in a remote area southeast of Kazakhstan after undocking from the space station just over three hours earlier.\n\nNasa images of the landing showed the small capsule parachuting down to Earth with the sunrise as a backdrop.\n\nThe astronauts gave thumbs-up gestures as rescuers carried them from the spacecraft to an inflatable medical tent.\n\nDespite looking a little worse for wear as he was pulled from the vessel, Pettit was “doing well and in the range of what is expected for him following return to Earth,” Nasa said in a statement.\n\nHe was then set to fly to the Kazakh city of Karaganda before boarding a Nasa plane to the agency’s Johnson Space Centre in Texas.\n\nThe astronauts spent their time on the ISS researching areas such as water sanitisation technology, plant growth in various conditions and fire behavior in microgravity, Nasa said.\n\nThe trio’s seven-month trip was just short of the nine months that Nasa astronauts Butch Wilmore and Suni Williams unexpectedly spent stuck on the orbital lab after the spacecraft they were testing suffered technical issues and was deemed unfit to fly them back to Earth.\n\nSpace is one of the final areas of US-Russia cooperation amid an almost complete breakdown in relations between Moscow and Washington over the Ukraine conflict.\n\nPublished in Dawn, April 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68055ff8c6399.jpg",
  "retrievedAt": "2025-10-12T02:38:40.116Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1905536/nasas-oldest-active-astronaut-returns-to-earth",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T00:23:00.000Z"
}
