{
  "title": "MDCAT postponed amid floods in Punjab, revised date issued - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistan Medical and Dental Council (PMDC) has postponed the upcoming Medical and Dental College Admission Test (MDCAT) due to the ongoing floods in the country, the Ministry of Health said on Friday.\n\nThe decision comes as the country is facing catastrophic floods, which have inundated thousands of villages and displaced millions in Punjab, with flood water now expected to move downstream towards Sindh.\n\nAccording to a statement issued by the Ministry of Health, “After holding discussions with relevant representatives from all four provinces, AJK (Azad Jammu and Kashmir) and Gilgit-Baltistan, on the instructions of Health Minister Mustafa Kamal, the PMDC has revised the exam date to October 26 (Sunday).”\n\nThe PMDC is the national statutory organisation responsible for regulating the standards of medical and dental education throughout the country.\n\nThe decision was taken in light of the “difficulties faced by students in the affected areas,“ the statement read.\n\nThe exam was previously scheduled to be held on October 5.\n\nThe “decision is in the larger interest of the students,” the statement quoted Health Minister Mustafa Kamal as saying.\n\n“The government is committed to providing equal educational opportunities to every student in the country,” he added.\n\nThe exam, which in previous years has been marred by delays, is the entry requirement for admission to medical and dental colleges across Pakistan.\n\nEach year, approximately 200,000 candidates take the MDCAT.\n\nThis year, the exam will conducted in the following universities across the country: University of Health Sciences, Lahore in Punjab; Sukkur IBA University, Sukkur for Sindh; Khyber Medical University, Peshawar for Khyber Pakhtunkhwa; Bolan University of Medical and Health Sciences, Quetta for Balochistan; and Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad for Islamabad Capital Territory, Azad Jammu and Kashmir, Gilgit-Baltistan as well as PMDC’s international venue in Riyadh, Saudi Arabia.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/12150104ef4f372.webp",
  "retrievedAt": "2025-09-19T14:35:51.499Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941453/mdcat-postponed-amid-floods-in-punjab-revised-date-issued",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T10:15:34.000Z"
}
