{
  "title": "UN halts Afghan returnee aid over curbs on women staff - World - DAWN.COM",
  "author": null,
  "content": "KABUL: The United Nations said on Thursday that it has suspended its assistance to Afghans ret­urning from neighbouring countries after the Taliban government prevented wom­­­en staff members from working.\n\n“On Sept 9, in light of instructions from the de facto authorities prev­enting Afghan female staff from working, UNHCR was compelled to halt acti­vit­ies at its encashment centres across Afgha­n­i­s­tan,” the UN’s refugee age­ncy said. It explained that these are places where Afg­hans returning from Paki­s­tan and Iran receive money and other support.\n\nThe UN said in a separate statement that its wo­­men employees had been prevented from accessing their workplaces in several locations across the country this week.\n\n“Security forces are visibly present at the ent­rances of UN premises in Kabul, Herat, and Mazar-i-Sharif to enforce the res­triction. This is particularly conc­e­rning in view of continuing restrictions on the rights of Afghan wom­en and girls,” the statement said.\n\nThe ICC issued arrest war­rants in July for two senior Taliban leaders, acc­using them of crimes aga­inst humanity over the persecution of women and girls, who are banned from most education and work. Women and girls are also barred from parks and gyms, and from travelling without a male guardian.\n\nThe UN said it was ending its support for returne­es due to operational conce­rns. For cultural reasons it needs female employees to interview the many women returning from neighbouring countries.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:35:53.222Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941400/un-halts-afghan-returnee-aid-over-curbs-on-women-staff",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T03:34:01.000Z"
}
