{
  "title": "Call for sanctions on Israel as UNSC slams attack on Qatar - World - DAWN.COM",
  "author": null,
  "content": "• Security Council statement backs Doha, but doesn’t name Israel\n• UAE calls Israeli strike ‘attack on collective Gulf security framework’; Qatar calls emergency Arab-Islamic summit\n• PM Shehbaz lauds Doha’s mediatory role for Gaza peace\n\nWASHINGTON / ISLAM­ABAD: Members of the UN Security Council railed against Israel’s “illegal and unprovoked aggression” against Qatar, recalling that in the span of mere days, it has struck Syria, Lebanon, Yemen and now the main peace broker in Gaza.\n\nSome nations even called for levying sanctions on Tel Aviv “before it was too late”.\n\nIn a statement issued ahead of the meeting, the Council also condemned the strikes, calling for “de-escalation” and expressing solidarity with Qatar, but without naming Israel.\n\nCalling Doha “the territory of a key mediator” for peace talks between Israel and Hamas, the council also “underlined their support for the sovereignty and territorial integrity of Qatar.”\n\nMeanwhile, at a special UNSC briefing — jointly requested by Pakistan, Algeria and Somalia — Pakistan’s Permanent Repre­s­e­n­tative Asim Iftikhar Ahmad welcomed the condemnation, but called for further steps.\n\n“The Council must go beyond; must hold Israel accountable; safeguard the role and protection of mediators engaged in peace efforts; and recommit to the centrality of international law and the UN Charter in maintaining international peace and security,” he urged.\n\nThe briefing was held under the agenda item ‘Situation in the Middle East’, and was attended by Qatar’s Prime Minister Mohammed bin Abdulrahman al-Thani.\n\n“The brazen and illegal assault is not an isolated incident, rather it is part of a broader and consistent pattern of aggression and violation of international law by Israel that undermines regional peace and stability,” Ambassafor Ahmad said.\n\nEven Dorothy Shea, the US envoy, stressed that unilateral bombing inside Qatar does not serve the interests of either Israel or the US.\n\nHowever, she emphasised that this should not be used to cast doubt on Israel’s commitment to bringing its prisoners home.\n\nAlgerian Ambassador Amar Bendjama noted that “Israel behaves as if law does not exist, as if borders are illusions and the UN Charter is an ephemeral text.”\n\nHe pointed out that Qatar was the fourth country attacked by Israel in as many days, condemning “the conduct of an extremist government” and urging the Council to use all its tools — including sanctions — “before it is too late”.\n\nArab diplomacy\n\nMeanwhile, the United Arab Emirates on Thursday condemned Israel’s threat of further attacks on Qatar, warning that any assault on a Gulf nation amounted to an attack on the “collective Gulf security framework”.\n\nThe remarks came in response to a threat made by Israeli PM Benjamin Netanyahu who said that Doha must expel or prosecute senior Hamas officials, “because if you don’t, we will”.\n\nThe incident prompted a fierce backlash across the Arab world and triggered urgent efforts to coordinate a regional response.\n\nUAE president Sheikh Mohammed bin Zayed Al Nahyan embarked on a tour of Gulf capitals, a move his diplomacy adviser, Anwar Gargash, said was aimed at “reinforcing the concept of a common destiny”.\n\nMeanwhile, at the funeral of those slain in Doha on Thursday, coffins draped in Qatari and Palestinian flags were carried into a packed mosque, underscoring the dual impact of the strike.\n\nHamas confirmed that five of the dead were part of its political operation, including the son of veteran negotiator Khalil al-Hayya. The Qatari soldier who died was named as Lance Corporal Badr Saad Mohammed al-Humaidi al-Dosari.\n\nHamas officials accused Israel of deliberately sabotaging negotiations over a possible ceasefire and hostage deal. Fawzi Barhoum, a senior spokesperson, described the airstrike as “an assassination of the entire negotiation process” and accused the US of complicity.\n\nAn emergency Arab-Islamic summit will be held in Qatar on Sunday and Monday to discuss next steps.\n\nShehbaz in Doha\n\nMeanwhile, Prime Minister Shehbaz Sharif on Thursday rushed to Qatar to express solidarity with its people and the government after Israel struck the Hamas leadership in Doha in “a blatant violation of international laws”.\n\nDuring his one-day visit, the prime minister met Qatar’s ruler Sheikh Tamim bin Hamad Al Thani and conveyed Pakistan’s strongest condemnation of the Sept 9 Israeli attack, which he termed “a blatant and flagrant violation of Qatar’s sovereignty and territorial integrity”.\n\nHe appreciated Qatar’s responsible, constructive and mediatory role in efforts to bring peace in Gaza, and stressed that such acts of Israeli aggression were clearly meant to undermine regional stability and threaten ongoing diplomatic and humanitarian efforts.\n\nHe also welcomed Qatar’s decision to host an extraordinary Arab-Islamic Summit on Sept 15, and said Pakistan had indicated its willingness to the Organisation of Islamic Cooperation to co-sponsor and co-convene this summit.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c38adde7319.jpg",
  "retrievedAt": "2025-09-19T14:36:05.273Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941377/call-for-sanctions-on-israel-as-unsc-slams-attack-on-qatar",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T02:51:32.000Z"
}
