{
  "title": "‘Bajaur operation averted militant buildup in KP’: officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Amid renewed opposition to military action to root out militancy in Khyber Pakhtunkhwa, officials on Thursday said the targeted operation in Bajaur, continuing at a steady pace, was necessary to contain militants in the tribal district, which serves as a “transit route” to nine other districts.\n\nAccording to officials, a failure to act in time would have “serious security implications” for at least 10 other districts and further complicated the security situation in the province bordering Afghanistan. A civil administration official told Dawn that the militants would have overrun KP had they not been contained in the upper reaches of Bajaur.\n\n“The district serves as a transit route to nine districts of Malakand division as well as Katlang in Mardan. All these areas are interconnected,” the official said, while referring to the districts of Upper and Lower Dir, Shangla, Swat, Buner, Malakand, and Katlang in Mardan.\n\nAnother official said that the “threat projection was big” and the situation would have been more difficult to handle if timely action had not been taken. The targeted action, the official said, forced a large number of militants to flee and they were now believed to have concentrated in regions close to the border.\n\nThe official said the security forces cleared 11 of the 36 areas and over 3,000 families, who were temporarily displaced, had returned to their homes.\n\n“We thought that Damadola and Kitkot with build-up areas would turn out to be tough. Militants have now retreated from the area and we are in the process of sanitisation before allowing people to return to their homes and hearths,” the official said.\n\nDamadola, about seven kilometres from the Afghan border, has always been a militant hotbed. It gained national and international attention in January 2006 when a number of students were killed in a strike on a seminary. Initially thought to be a US strike, reportedly targeting Al Qaeda leader Ayman al-Zawahiri, Pakistan’s military eventually claimed the action as its own.\n\nOfficials believed that if the targeted action continued at the same pace, remaining areas could be cleared in the near future and people would be able to return home ahead of winter. Bajaur, the official claimed, could serve as a model in other districts affected by militancy.\n\nThis was the first time a targeted area-wise operation was launched by engaging the local population, who were encouraged to ask militants to leave the area to avoid displacement and damage to their property.\n\nAuthorities began the process of engagement with the area notables on July 30. Negotiations continued for fourteen days but following the militants’ refusal to leave the area, residents agreed to vacate their areas for the targeted operation.\n\nA document seen by Dawn revealed that the notables acknowledged that the protection of life and property was the responsibility of the state, thus empowering the security forces to establish the writ of the state. The document also emphasised that efforts would be made to minimise the damage to the property and allow for compensation.\n\nThis enabled the security forces to undertake action without fear of harming and causing civilian casualties and damage to properties, the official added.\n\nAccordingly, 21,000 families left their homes, out of which 8200 were provided shelter at government-owned buildings, while 12,800 stayed with the community. “The most remarkable thing was to facilitate the return of people to six villages of Tarkho within five days of their displacement on August 21. Subsequently, six more areas were cleared and residents were allowed to return on September 8,” the official said.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:36:04.709Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941378/bajaur-operation-averted-militant-buildup-in-kp-officials",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T02:53:13.000Z"
}
