{
  "title": "Landmark SC ruling de-links wife’s rights from consummation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: In a landmark judgement with far-reaching implications for women’s rights under Islamic family laws, the Supreme Court ruled on Thursday that a woman’s right to maintenance (Nafaqa) was neither contingent upon consummation or ‘Rukhsati’ (bridal departure) nor is it subject to her husband’s discretion.\n\n“It flows unconditionally from the solemnisation of a valid marriage and constitutes a binding legal duty,” observed Justice Syed Mansoor Ali Shah in his decision on an appeal by Ambreen Akram. She had challenged the Lahore High Court’s (LHC) verdict of April 28, 2015, which turned down her plea for maintenance because the marriage was not consummated.\n\n“In essence, the only legitimate ground for suspending this obligation (maintenance) arises where the husband discharges a high burden of proof to establish that his wife has wholly and without justification withdrawn from marital relationship, not merely as physical access but encompassing the full spectrum of emotional, residential and relational life,” Justice Shah explained in his 15-page judgement.\n\nJustice Shah says claim to maintenance takes effect with solemnisation of marriage; criticises LHC observations as ‘deeply patriarchal’\n\n“Absent such proof, the obligation to provide maintenance persists,” Justice Shah emphasised.\n\nTwo fundamental questions\n\nThe judgement observed that the case raises two fundamental questions at the intersection of Islamic law, constitutional rights and social realities: When does a Muslim woman become entitled to maintenance within a marriage?\n\nAnd, under what circumstances, may a man be excused from his marital obligation to pay maintenance to his wife?\n\nAt stake is not merely the contemporary interpretation of Islamic law but the very meaning of marriage (Nikah) and marital relationship, the scope of financial independence of a woman within marriage and the Constitution’s promise to uphold the dignity, privacy and equality of an individual, the protection of the family and participation of women in all spheres of life, the judgement explained.\n\nThe case pertains to Ambreen Akram’s marriage to Asadullah Khan in Nov 2012. Despite a valid Nikahnama, Asad­ullah delayed Rukhsati for over a year.\n\nSo Ambreen Akram filed for maintenance in Oct 2013.\n\nClaim upheld\n\nA family court in Faisalabad upheld her claim, awarding an amount of Rs3000 per month as maintenance with effect from the date of marriage. The amount was later raised by Faisalabad’s District Court to Rs5000.\n\nAsadullah Khan divorced his wife on May 2, 2014. But the LHC reversed the decision, citing lack of consummation.\n\nThe Supreme Court observed in its judgement that Asadullah Khan had failed to provide a marital abode, made no arrangements for rukhsati and did not fulfil his basic obligations under the marital contract.\n\nThere is no factual or legal basis to invoke an exception to the husband’s obligation of maintenance, Justice Shah observed.\n\n“No credible evidence has led to suggest that the petitioner wilfully withdrew from the marital relationship or refused cohabitation without valid cause,” the apex court judge said.\n\nThe wife’s inability to cohabit due to husband’s own failure to facilitate Rukhsati does not defeat her claim to maintenance, the judgement explained.\n\nHence Ambreen Akram cannot be penalised for non-consummation as it resulted from her husband’s own inaction, Justice Shah said.\n\n“To suggest otherwise would allow men to weaponise the absence of consummation, often caused by their own neglect, as a means to escape financial responsibility, thereby trapping women in marriages devoid of rights and dignity,” the judgement cautioned.\n\nThe Supreme Court held that the petitioner’s right to maintenance took effect with the solemnisation of marriage and continued as long as the bond lasted.\n\nConsidering that the divorce took place during the pendency of the litigation, the maintenance period will continue till the period of Iddat, the judgement added.\n\n“The denial of maintenance in the light of husband’s default and in the absence of any fault on part of the wife, was contrary to law and accordingly set aside,” Justice Shah observed.\n\nIn his judgement, Justice Shah went on to say that a reading of Islamic jurisprudence, statutory enactments, constitutional protections and judicial precedents affirm that a woman’s right to maintenance was neither contingent upon consummation or rukhsati, nor subject to discretion of her husband.\n\nThis understanding not only gives effect to the egalitarian spirit of Islamic law but also reinforces constitutional commitment to dignity (Article 14), equality (Article 25), and protection of the family unit (Article 35).\n\n“In a patriarchal society where economic dependence often fuels systemic injustice, the right to maintenance must be safeguarded as an essential constitutional, legal and ethical entitlement.\n\n“Any attempt to curtail it must therefore be subjected to strictest constitutional and jurisprudential scrutiny, the judgement emphasised.\n\nThe Supreme Court set aside the LHC judgement by holding that Ambreen Akram’s entitlement to maintenance of Rs5000 per month began on the date the marriage was solemnised. It will include maintenance for the period of Iddat.\n\nConcern over LHC verdict In his concluding remarks, Justice Man­soor Ali Shah noted with concern the language used in the LHC judgement.\n\nThe High Court verdict stated: “Maintenance allowance is the right of wife after consummation of marriage and after crossing the barrier, it becomes the responsibility of the husband to maintain his wife.”\n\nJustice Shah criticised the observations as “deeply patriarchal”.\n\nThese expressions cast women as passive recipients in marriage rather than equal partners, undermining their legal and constitutional status, the judge said.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:36:30.976Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941362/landmark-sc-ruling-de-links-wifes-rights-from-consummation",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:52:53.000Z"
}
