{
  "title": "A single bullet - Newspaper - DAWN.COM",
  "author": null,
  "content": "A SINGLE bullet often becomes a pivot in history: Sarajevo, Dallas, Los Angeles, Memphis, and now Utah. And nearer home, Rawalpindi in 1951, and again in 2007.\n\nAt Sarajevo, a Serb student Princip assassinated Archduke Franz Ferdinand of Austria-Hungary and his wife Sophie on June 28, 1914. Within a month, World War I broke out.\n\nAt Dallas, on Nov 22, 1963, Lee Harvey Oswald assassinated president John F. Kennedy. His singular culpability has been questioned ever since. Two days later, Oswald was shot by nightclub owner Jack Ruby. In June 1968, a younger Robert Kennedy was killed by a Palestinian immigrant Sirhan Sirhan in a Los Angeles hotel.\n\nOn April 4, 1968, the civil rights activist Dr Martin Luther King died from a single bullet shot by James E. Ray in a motel in Memphis, Tennessee. King became yet another victim of the Vietnam War, which he had criticised as “one of history’s most cruel and senseless wars”. He crafted his own death sentence when he declared some months earlier: “We will no longer vote for men who continue to see the killings of Vietnamese and Americans as the best way of advancing the goals of freedom and self-determination in Southeast Asia.” Yet American voters have done just that.\n\nOn such a single bullet hinges a life, and history.\n\nAnd now, at Utah, on Sept 10, a White right-wing activist Charlie Kirk fell to a single shot fired by Tyler J. Robinson. Although Tyler’s parents were registered Repub­licans, he himself was an “unaffiliated, or nonpartisan, voter”. Robinson surrendered to the authorities two days later, upon the insistence of his father and a local pastor.\n\nOn such a single bullet hinges a life, and history. As Rudyard Kipling put it, in a different context, “Two thousand pounds of education/ Drops to a ten-rupee jezail.”\n\nIt is reported that after Kirk became politically allied with US President Donald Trump, contributions to Kirk’s organisation Turning Point USA accelerated. “By 2022, contributions exceeded $79 million.” Trump reciprocated Kirk’s fidelity. The day after Kirk’s death, Trump ordered that US flags be flown at half-mast on public buildings. He awarded the Presidential Medal of Freedom (the nation’s highest civilian honour) to Kirk posthumously.\n\nOver 4.5 million American Muslims may not share their president’s grief, especially when they recall Kirk’s partisan writings. Four years before his death, Kirk had written: “Islam is the sword the left is using to slit the throat of America.”\n\nConsidering the volatility of our own politics, Pakistan has had fewer assassinations. Notable amongst them was the attempt on then-president Pervez Musha­rraf’s life in December 2003. One of the bombers had his face blown off, leaving it as a macabre death mask for Musharraf to publish in his memoirs.\n\nFour years later, Benazir Bhutto survived an assassination attempt in 2007 in Karachi but succumbed to a second soon after, in Rawalpindi. Like the murder of then-prime minister Liaquat Ali Khan in the same location in 1951, a verdict on her death has yet to be concluded by history.\n\nDo such assassinations deliver the change they prescribe, or are they events whose significance is magnified by belated sentiment? To armchair pundits, Kirk’s murder at this time in Trump’s administration is of more sinister significance than the nick on Trump’s right ear by a sharpshooter in 2024. Kirk’s sacrifice for Trump’s cause has deepened Trump’s conviction that he is destined by Providence to survive.\n\nTrump is now on the warpath. His weapons are economic — tariffs, sanctions and embargoes. His targets are Russia, China and India. On a lower rung are the EU countries and now Nato (which includes Turkiye). Trump wants his allies (if they desire to remain his allies) to stop getting oil and energy from Russia. In the halcyon days of cross-border cooperation, the EU used to import about 45 per cent of its gas from Russia. It will reduce to 13pc this year. Even that is too much for Trump. He wants to bring Vladimir Putin and also Xi Jinping and Narendra Modi to their knees, to genuflect before America’s almighty might.\n\nThere was a time when the world spoke of Interconnectedness, of “a stable global energy system”. In the West, Nord Streams 1 & 2 and the Yamal-Europe Pipeline connecting Russia and Europe were part of that dream. All three have been sabotaged, made inoperable. The only pipeline functioning is the Turk Stream which transports Russian natural gas to Turkey and to European countries.\n\nA different brand of hostility has dest­royed hopes of Interconnectedness in the subcontinent. The IPI and TAPI pipelines are fading memories of intent. The Indus Waters Treaty has been overpowered by nature’s inclement floods. We are knowing victims of our own intransigence.\n\n“Today, I am alive,” the poet Ayad Gharbawi wrote, with foreboding, “but there is no law to thank./ If not me, then someone else.”\n\nThe writer is an author.\n\nwww.fsaijazuddin.pk\n\nPublished in Dawn, September 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68cb6774ee280.jpg",
  "retrievedAt": "2025-09-19T14:36:56.963Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942820/a-single-bullet",
  "dateList": "2025-09-12",
  "date_published": "2025-09-18T02:00:23.000Z"
}
