{
  "title": "Utah man suspected in Charlie Kirk murder taken into custody - World - DAWN.COM",
  "author": null,
  "content": "A young Utah man suspected of killing influential United States conservative activist Charlie Kirk at a university in the city of Orem was in custody on Friday, Utah Governor Spencer Cox told reporters.\n\n“We got him,” Cox told reporters.\n\nThe suspect, identified as Tyler Robinson, had confessed to a family friend or “implied that he had committed the murder” to that friend and that person in turn had contacted the Washington County sheriff’s office on Thursday.\n\nA family member interviewed by investigators said Robinson had become more political recently and spoke in a disparaging manner about Kirk, Cox told reporters. Robinson was taken into custody on Thursday night, about 33 hours after Kirk’s murder, Federal Bureau of Investigation Director Kash Patel said at the press conference.\n\nKirk, a close ally of US President Donald Trump, was killed by a single bullet as he spoke onstage at an outdoor amphitheatre at Utah Valley University on Wednesday.\n\nPreviously, US investigators said they had found the bolt-action rifle believed to have been used to kill Kirk and released images of a person of interest.\n\nInvestigators spoke to Robinson’s roommate, who showed them comments Robinson had made on Discord, a chat and streaming platform popular with gamers, discussing retrieving a rifle from a drop point and then leaving the rifle in a bush wrapped in a towel. This matched the description of the gun that authorities recovered after the shooting in a wooded area near campus.\n\nAmmunition found at the scene had been inscribed, Cox said.\n\nA young Utah man suspected of killing influential United States conservative activist Charlie Kirk at a university in the city of Orem was in custody on Friday, Utah Governor Spencer Cox told reporters. “We got him,” Cox told reporters. The suspect, identified as Tyler Robinson, had confessed to a family friend or “implied that he had committed the murder” to that friend and that person in turn had contacted the Washington County sheriff’s office on Thursday. A family member interviewed by investigators said Robinson had become more political recently and spoke in a disparaging manner about Kirk, Cox told reporters. Robinson was taken into custody on Thursday night, about 33 hours after Kirk’s murder, Federal Bureau of Investigation Director Kash Patel said at the press conference. #DawnToday\n\nThe messages on the casing included: “What’s this”; “Oh, Bella Ciao, Bella Ciao, Bella Ciao, Ciao”; “If you read this, you are gay, LMAO” and “Hey fascist, catch!” Cox told reporters.\n\nTrump earlier said that authorities had captured the suspect.\n\n“I think, with a high degree of certainty, we have him in custody,” Trump said on Fox News programme ‘Fox and Friends’. “Everybody did a great job; we worked with the local police, the governor.”\n\nThe president claimed that the suspect was turned in “by somebody very close to him”, noting that the authorities had “very good pictures but not great, not perfect”.\n\n“Somebody very close to him said, ‘Oh, it’s him’,” Trump said. “Essentially, they went to a US marshal, and the person involved was involved with law enforcement and a person of faith. The father convinced the son, ‘This is it’.”\n\nAdditionally, Trump backed a call by Cox to give the suspect the death penalty if the suspect is found guilty.\n\n“This trial will start in two, three, [or] four years. In certain places that do it differently, they have what’s called ‘quick trial’. You have a fast trial and fast verdict,” the president said.\n\n“If he’s guilty, we’ll need to keep him, feed him, take care of him … like for 50 years,” Trump added. “In Utah you have the death penalty. The governor … is very intent on the death penalty in this case, and he should be.”\n\nThe father-of-two used his audiences on TikTok, Instagram and YouTube to build support for anti-immigration policies, outspoken Christianity and gun ownership, and to spread carefully edited clips of his interactions during debates at his many college events, according to AFP.\n\nKirk, a well-connected activist, author and podcast host, helped build support for Trump and the Republican Party among younger voters.\n\nKirk was the co-founder and president of the conservative student group Turning Point USA and appeared at Utah Valley on Wednesday as part of a planned 15-event “American Comeback Tour” of US college campuses. His killing stirred outrage and denunciations of political violence from Democrats, Republicans and foreign governments.\n\nKirk had 5.2 million followers on X and hosted a popular podcast and radio programme, ‘The Charlie Kirk Show’.\n\nAdditionally, US Deputy Secretary of State Christopher Landau warned on Thursday that Washington may take action against foreigners “praising, rationalising, or making light” of Kirk’s killing, adding he had directed consular officials to take appropriate action.\n\n“In light of yesterday’s horrific assassination of a leading political figure, I want to underscore that foreigners who glorify violence and hatred are not welcome visitors to our country,” Landau said in a post on social media platform X.\n\n“I have been disgusted to see some on social media praising, rationalising, or making light of the event, and have directed our consular officials to undertake appropriate action.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/122007471d5a255.webp",
  "retrievedAt": "2025-09-19T14:35:49.735Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941465/utah-man-suspected-in-charlie-kirk-murder-taken-into-custody",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T12:37:24.000Z"
}
