{
  "title": "Flood threat remains severe at rivers’ confluence - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Panjnad crosses 668,000 cusecs; mass evacuations underway in Alipur\n• Guddu, Sukkur barrages record over 400,000 cusecs, remain in ‘medium flood’\n• Children among the missing after boats capsize in Jalalpur Pirwala\n• NDMA chairman says Pakistan facing ‘last monsoon spell’\n• Preparations in place at Nasirabad as Balochistan braces for floodwaters\n\nLAHORE: Punjab is facing a relentless flood emergency as the Sutlej, Ravi and Chenab rivers continue to swell, inundating thousands of villages and displacing millions across the province.\n\nThe situation intensified after Indian authorities issued alerts regarding rising water levels at Ganda Singh Wala and Ferozepur two days ago, prompting renewed evacuations along the Sutlej River.\n\nDespite some areas witnessing a slight recession in water levels, the overall flood threat remains severe, with rescue and relief operations stretched across multiple districts.\n\nAt Panjnad Headworks on the Chenab River, water discharge surged to an exceptionally high level, crossing 668,000 cusecs. Between Wednesday morning and early Thursday, the flow increased by 100,000 cusecs, triggering mass evacuations in Alipur tehsil.\n\nIn a late night development, a protective dyke near the city of Shujabad collapsed for a second time, inundating communities along the river bank.\n\nThe downstream pressure has also impacted Sindh’s Guddu and Sukkur barrages, which continue to record medium flood levels with flows exceeding 400,000 cusecs.\n\nIn Rahim Yar Khan, authorities reported 660,000 cusecs passing through Chachran Sharif, though no immediate threat to localities was identified.\n\nAccording to the Flood Fore­casting Division (FFD) data, Pan­jnad witnessed outflows of over 668,000 cusecs, with a steady trend, while Guddu and Sukkur barrages had a flow of over 400,000 cusecs.\n\nOn the other hand, flood levels in Punjab rivers receded further, with Ganda Singh Wala on the Sutlej River near the Indian border in a “medium” flood.\n\nPDMA River Flows report relea­sed at 6:30pm revealed that on the Chenab River, Marala Headworks was steady at 68,986 cusecs, Khanki Headworks was rising at 82,411 cusecs, and Qadirabad Headworks was steady at 84,440 cusecs.\n\nAt Chiniot Bridge, the flow was rising at 57,463 cusecs, while the Rivaz Bridge gauge level was steady at 518 feet.\n\nAt Trimmu Headworks, the flow was steady at 140,007 cusecs. The Head Muhammad Wala gauge was falling at 412.38 feet, the Sher Shah Bridge level was steady at 393.20 feet and Panjnad Headworks was flowing extremely heavy at 658,845 cusecs.\n\nOn the Ravi River, conditions were steady at all locations: Jassar was reporting 19,500 cusecs, Ravi Syphon 32,120 cusecs, Shahdara 31,682 cusecs, Balloki Headworks 59,580 cusecs, and Sidhnai Headworks 75,549 cusecs.\n\nOn the Sutlej River, flows were predominantly steady: Ganda Singh Wala was at 98,165 cusecs, and Sulemanki Headworks was at 121,459 cusecs. An exception was Islam Headworks, where the flow was falling at 113,956 cusecs, while the Mailsi Syphon was steady at 120,150 cusecs.\n\nFor the Indus River upstream of Guddu, the Chachran Bridge gauge was steady at 298.25 feet, and the Guddu Barrage flow was steady at 506,433 cusecs.\n\nTragedies, displacement\n\nIn Bahawalnagar, two people drowned after a Rescue 1122 boat carrying 23 evacuees capsized. In Jalalpur Pirwala, another rescue bo­­­­at carrying 25 people overturned, leaving five, including children, missing. In Muzaf­fargarh, three teenagers fell into floodwaters near Basti Jarah; one died and two were rescued.\n\nAuthorities reported thousands fleeing their homes in Seetpur, Khairpur and Bait Nabi Shah in Muzaffargarh, as well as in Jalalpur Pirwala, where 706,000 people across 148 mou­­zas have been affected. In Khanewal, 159,029 people were evacuated from riverbeds, while 128,658 acres of crops were submerged.\n\nPunjab Relief Commissioner Nabil Javaid said more than 4,500 villages and 4.287 million people have been affected by floods across the province, with 2.262m relocated.\n\nHe said 396 relief camps, 490 medical camps and 412 veterinary camps have been set up, while 1.696m animals have been shifted to safer areas. A total of 79 people have lost their lives in the floods, he added.\n\nRescue, relief efforts\n\nPunjab Emergency Service Secretary Dr Rizwan Naseer said over 13,600 people were rescued in the past three days in Multan alone, with more than 25,000 relocated. Across the province, more than 362,000 people have been evacuated using 139 rescue boats.\n\nPDMA Director General Irfan Ali Kathia said four helicopters and 2,000 tents have been deployed to Jalalpur Pirwala, where reli­­ef distribution continues with army support.\n\nRahim Yar Khan Deputy Commissioner Khurrum Parvaiz told Dawn that water levels were rising downstream of Panjnad, prompting evacuation operations in the riverbed areas of Khanpur and Liaquatpur. He said around 12,000 people had been evacuated, six relief camps established and 1,800 tents distributed among flood-affected families.\n\nThe deputy commissioner added that all dy­­k­­es in the district were intact, with 660,000 cu­­secs passing through Chachran Sharif, and as­sured there was no threat to nearby localities.\n\nPunjab Information Minister Azma Bukhari said Chief Minister Maryam Nawaz had ord­ered the removal of the Assistant Commis­sioner of Jalalpur Pirwala over negligence after a rescue boat capsized. She added that water levels at Muhammad Wala and Sher Shah bridges had fallen below critical levels, ruling out immediate breaching of dykes.\n\nPunjab Chief Secretary Zahid Akhtar Zaman visited Panjnad Headworks, where he was briefed on inflows and discharges. Officials confirmed that evacuation of low-lying areas was ongoing, with all embankments under constant monitoring.\n\nMeanwhile, officials said Mangla Dam is 90 per cent full, Tarbela 100pc, India’s Bhakra 90pc, Pong 99pc and Thein 97pc, increasing downstream pressure.\n\nBalochistan rains\n\nNDMA Chairman Lt Gen Inam Haider Malik said on Thursday that Pakistan was facing the final monsoon spell of this season, adding that during the past two days, the floodwater heading south was “losing steam”, Dawn.com reported.\n\n“The water in our rivers came in two layers,” he explained. “The first is hitting Guddu Barrage, the other is at Panjnad. Based on this information, we expect that it will stabilise in the next two to three days.”\n\nSeveral areas of Balochistan have been lashed by torrential monsoon rains over the past two days, triggering flash floods and prompting the PDMA to issue an alert on Thursday. District administrations have been directed to take urgent measures to protect residents from possible devastation.\n\nOfficials said seasonal rivers and streams were already carrying heavy rainwater, with the risk of severe flooding if showers continued in the catchment areas.\n\nAt Hub Dam, water levels rose rapidly to 338 feet, just one foot short of its full capacity of 339 feet. A senior Irrigation Department official said the spillways could be opened at any time, and people living along the Hub Riv­er had been warned to move to safer locations.\n\nMeanwhile, the Balochistan government has completed arrangements along the left bank of the Indus River in anticipation of floodwaters expected to arrive from Punjab’s Sutlej, Ravi and Chenab rivers within the next few days.\n\nRescue teams, boats and heavy machinery have been deployed in the border areas of Nasirabad division, including Nasirabad, Usta Muhammad, Sohbatpur and Jaffarabad.\n\n“For the past week, rescue staff and equipment have been positioned along the Sindh-Balochistan border,” an official said.\n\nBalochistan Irrigation Minister Sadiq Um­­rani told the provincial assembly that preparations were in place to shift people from vulnerable areas to safety. He added that an understanding had been reached with the Sindh government that no embankments would be deliberately breached if water reached dangerous levels. “If over 1.1 million cusecs flow through the Indus, the chief ministers of both provinces will decide further action,” he said.\n\nBalochistan PDMA Director General Jahanzeb Khan said 16 flood control centres had been set up across four districts of Nasirabad division, operating round the clock. Rescue and relief arrangements, including provision of essential goods, had been finalised to assist displaced families.\n\nSaleem Shahid in Quetta and Ali Jan Mangi in Dera Murad Jamali also contributed to this report\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c38c2648d47.jpg",
  "retrievedAt": "2025-10-12T04:07:22.747Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941380/flood-threat-remains-severe-at-rivers-confluence",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T02:57:09.000Z"
}
