{
  "title": "Tokyo set for athletics extravaganza to ease pain of Covid-hit Olympics - Sport - DAWN.COM",
  "author": null,
  "content": "A sea of purple posters at the Narita Airport announces the World Athletics Championships — in both English and Japanese. Banners of Haruka Kitaguchi, Japan’s javelin star, are plastered on the walls of the mazy metro stations in the Japanese capital. On the buildings in Ginza, digital billboards have the Japanese athletics team on display.\n\nAfter a spectator-less Olympics four years ago during the Covid-19 pandemic, Tokyo is geared up to host a global athletics extravaganza beginning on Saturday.\n\nIt was an emotional memory for Japanese athletics chief Yuko Arimori, who teared up when asked at the opening press conference on Friday what it meant to finally have fans in attendance at the championships.\n\n“Sports aren’t just for athletes but for everyone to enjoy,” the former marathon runner said as she recalled being cheered on by fans at her international debut at the 1991 Tokyo World Championships.\n\nThe stadium is sold out on most nights, and as of Friday evening, nearly 500,000 tickets have been sold for the nine-day event featuring more than 2,000 athletes from 200 countries.\n\n“This will be an athletics display of the ages,” World Athletics President Sebastian Coe said at Friday’s press conference, highlighting Usain Bolt’s presence at the World Athletics Ultimate Championships countdown party a day earlier.\n\n“Sports have the unique ability to touch the hearts, minds and lives of young people.”\n\nA Covid-delayed, spectator-less Olympics pushed World Athletics and the athletes to become more creative, better connected and grasp the use of advanced technology. “The athletes came back stronger, more mentally resilient,” Coe said.\n\nHe also defended World Athletics’ decision to cap off the season with the championships rather than it being the crescendo amid a stacked Diamond League season.\n\nWhen asked, Coe brushed off any downside to two big-ticket events like the men’s and women’s 100 metre being scheduled for the same night, saying “it’ll work well”.\n\nSeveral Olympic champions are headlining day one of the championships. It’s almost a given that Sweden’s Armando Duplantis will win gold and break another world record — his own — in the men’s Pole Vault, although that much-awaited display will come later, as Saturday is just the qualifying round.\n\nUS’ Valerie Allman, Olympic champion in Paris, leads the field in the women’s discus throw, while countrymate Ryan Crouser makes his season’s debut in Tokyo after battling injury. Crouser is the world record holder in the men’s shot put, a three-time Olympic champion and two-time world champion, his accolades almost guaranteeing the US a medal in the event.\n\nYet another US superstar to take the spotlight — which he absolutely adores — is Noah Lyles. The 28-year-old showman is the Olympic and defending champion in the men’s 100m, but currently holds the third fastest time this year with 9.90. Jamaica’s Kishane Thompson is the world lead with a sensational 9.75 run at the Jamaican Championships this June.\n\nUSA’s Kenneth Bednarek isn’t too far behind with 9.79 at the US Championships last month. Lyles and Bednarek will renew their rivalry in the 100m after Bednarek shoved Lyles following a heated showdown at the USA Track and Field Championships.\n\nThe women’s 100m comes with its own set of year-long rivalry. US’ Melissa Jefferson-Wooden arrives undefeated this year with a 10.65, the same time that won teammate Sha’Carri Richardson gold in Budapest 2023.\n\nJamaican twins Tina and Tia Clayton have taken the sprinting world by storm this year. Unfortunately, only national champion Tina will compete in the 100m dash this year after Tia suffered an injury during the Jamaican trials.\n\nFive-time world champion and sprint goddess Shelly-Ann Fraser-Pryce will be ending her career “on her own terms” after Tokyo, which marks her ninth world championships. The 38-year-old Jamaican is an eight-time Olympic medalist and undoubtedly considered one of the greatest sprinters of all time. She’s the third-fastest woman in the world, with a 10.60 clocked in 2021.\n\nThe women’s 400m will be anyone’s game. Bahrain’s Salwa Eid Naser comes in with a 48.67 world lead set in the Zurich Diamond League final last month, while Dominican sprinter Marileidy Paulino is the defending and Olympic champion with a 48.81 this season.\n\nHurdles superstar Sydney McLaughlin-Levrone is focusing on the 400m flat this time. The 26-year-old won the US title in 48.90 earlier this year, just 0.16 shy of her personal best.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/122227056bb4d83.webp",
  "retrievedAt": "2025-09-19T14:35:49.909Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941485/tokyo-set-for-athletics-extravaganza-to-ease-pain-of-covid-hit-olympics",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T17:28:18.000Z"
}
