{
  "title": "Auto sales surge 62pc - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite the devastating floods, Pakistan’s automotive sector showed resilience in August, with cars, sport utility vehicles (SUVs), pickups, and vans recording sales of 14,050 units — a 62pc year-on-year (YoY) increase and a 27pc month-on-month (MoM) rise.\n\nThe month-on-month growth was primarily driven by strong sales from Pak Suzuki Motor Company (PSMC), while the year-on-year surge reflected a more stable macroeconomic environment, introduction of new variants, lower interest rates, easing inflation, and improving consumer sentiment.\n\nMyesha Sohail of Topline Securities noted that vehicle sales in the first two months of fiscal year 2026 (2MFY26) reached 25,093 units, up 45pc from 17,288 units in the same period last year.\n\nPSMC led the growth with sales of 7,154 units in August, marking a 96pc YoY and 94pc MoM increase. The month-on-month jump reflected a low base, as June sales had surged ahead of the GST hike implemented on 1 July 2025. During 2MFY26, PSMC sold 10,834 units, a 33pc rise year-on-year.\n\nHyundai Nishat posted an 83pc YoY increase but saw a slight 1pc decline MoM, selling 1,212 units in August, boosted by strong demand for Tucson and Elantra models. Its sales for July-August FY26 rose 95pc to 2,437 units compared to last year.\n\nIndus Motor Company (IMC) recorded 60pc YoY growth and a modest 2pc MoM increase to 3,400 units in August. Sales during 2MFY26 rose 78pc to 6,737 units versus the previous fiscal year.\n\nHonda Atlas Cars (HAC) experienced a decline, with August sales falling 7pc YoY and 28pc MoM to 1,073 units. However, its July-August FY26 sales rose 24pc to 2,573 units year-on-year.\n\nSazgar Engineering Works (SAZEW) reported a 10pc YoY increase but a 3pc MoM dip to 1,049 units in August, including sales of the newly launched HAVAL H6 PHEV variant. Sales in 2MFY26 reached 2,128 units, up 20pc YoY.\n\nSales of two- and three-wheelers surged 42pc YoY and 19pc MoM to 148,063 units in August, pushing 2MFY26 sales to 273,000 units, a 44pc increase year-on-year.\n\nConversely, tractor sales dropped sharply due to the floods and weak farm economics. The sector recorded 996 units in August, a 63pc YoY and 17pc MoM decline. Sales during July-August FY26 plummeted 47pc to 2,191 units compared to the same period last year.\n\nTruck and bus sales saw a significant rise, with 666 units sold in August, up 122pc YoY and 78pc MoM. This brought 2MFY26 sales to 1,040 units, a 71pc increase over 2MFY25.\n\nMyesha Sohail expects positive momentum to continue in auto sales during FY26, driven by lower interest rates and an upcoming pipeline of new models, including hybrid and plug-in hybrid variants.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c363f2e04b7.gif",
  "retrievedAt": "2025-10-12T04:06:40.220Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941300/auto-sales-surge-62pc",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:53:00.000Z"
}
