{
  "title": "Pakistan, UAE vow to counter drug smuggling - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan and the United Arab Emirates (UAE) have vowed to expand bilateral collaboration in countering drug smuggling.\n\nThe two sides made the commitment when Interior Minister Mohsin Naqvi met Sheikh Zayed bin Hamad bin Hamdan Al Nahyan, Chairman of the UAE National Anti-Narcotics Authority, on Thursday to discuss enhanced cooperation against drug trafficking.\n\nAccording to the ministry, both sides held detailed discussions on anti-narcotics efforts and other matters of mutual interest, agreeing to enhance their joint efforts to curb smuggling of drugs and narcotics.\n\nMr Naqvi welcomed Sheikh Zayed and his delegation, underscoring Pakistan’s commitment to combating narcotics as a national priority.\n\nTo facilitate closer coordination, the government appointed DG Anti-Narcotics Force Major General Abdul Mueed as its focal person, while the UAE named Brigadier Taher Gharib as its special representative.\n\nMr Naqvi congratulated Sheikh Zayed on becoming the first chairman of the UAE’s newly established National Anti-Narcotics Authority and praised the move as a step towards deeper regional cooperation.\n\n“The establishment of this authority will significantly boost joint efforts between Pakistan and the UAE in combating narcotics,” Mr Naqvi was quoted as saying by the official press release.\n\nHe assured Sheikh Zayed of Pakistan’s full support and highlighted Pakistan’s frontline role in the fight against drugs, noting that over 400 suspects involved in trafficking to the UAE had been arrested and five tons of narcotics seized.\n\nMr Naqvi credited these successes to joint efforts and timely information sharing, while warning of an uptick in synthetic drug smuggling. This is a war for the future of our generations, and defeat is not an option, he emphasised.\n\nSheikh Zayed affirmed the UAE’s commitment to providing all possible cooperation to Pakistan in anti-narcotics operations, stressing the importance of strengthening bilateral collaboration to ensure a safer future for coming generations.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/120941012ed1f3f.webp",
  "retrievedAt": "2025-10-12T04:06:28.115Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941358/pakistan-uae-vow-to-counter-drug-smuggling",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:52:53.000Z"
}
