{
  "title": "UNSC to meet over drone raid in Poland - World - DAWN.COM",
  "author": null,
  "content": "WARSAW: The UN Security Council called an emergency meeting for Friday to discuss violations of Poland’s airspace after Warsaw accused Moscow of launching a drone raid on its territory.\n\nPoland branded the incident, which prompted forces to shoot down several drones overnight Tuesday to Wednesday, a deliberate “unprecedented” attack on the country, Nato and the European Union.\n\nMoscow denied targeting the country and said there was no evidence the drones were Russian. But Poland’s European partners backed Warsaw. The Czech Republic, the Netherlands and Sweden each summoned their Russian ambassadors on Thursday to protest.\n\nGermany announced Thursday it would expand its role in a Nato mission to defend Polish airspace. Stray Russian drones and missiles have entered the airspace of Nato members including Poland several times since Moscow launched its invasion of Ukraine in 2022, but no Nato country had yet attempted to shoot them down.\n\nPolish officials said drones violated its airspace 19 times, but there were no casualties and the damage was limited — a house and a car were destroyed.\n\nThe incident was “an attempt to test the mechanism of action within Nato and our readiness to respond”, Polish President Karol Nawrocki said on Thursday during a visit to an airbase in western Poland.\n\nPoland’s National Security Council met on Thursday and the defence minister was set to brief parliament on the latest findings.\n\nWarsaw said there would be a UN Security Council meeting to discuss “the violation of Polish airspace by Russia”. Shortly afterwards, the Council’s South Korean presidency announced in New York that it would take place on Friday at 3pm (1900 GMT).\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68c391c379bb9.jpg",
  "retrievedAt": "2025-10-12T04:07:00.993Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941390/unsc-to-meet-over-drone-raid-in-poland",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T03:21:09.000Z"
}
