{
  "title": "From jackals to dolphins, Pakistan’s wildlife reels under deadly floods - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan’s ongoing floods — among the deadliest in the country’s recent history — have swept away villages, submerged farmland and forced over two million people from their homes, mainly in Punjab.\n\nThe consequences, however, are not limited to humans. The catastrophic deluge has also devastated the country’s already fragile wildlife.\n\n“Entire habitats have been submerged, encompassing everything from scrub forests and rangelands to critical wetlands that act as wildlife sanctuaries,” Rafiul Haq, a Karachi-based ecologist, told Anadolu.\n\nDisplaced jackals, wild boars, chinkara antelope, and even elusive jungle cats are now venturing into villages in search of food and shelter, he added.\n\nSuch encounters bring new dangers. Studies show human-wildlife conflict rises sharply after floods, and Pakistan is no exception.\n\n“Rural areas, now burdened with displaced carnivores and omnivores, are witnessing increased attacks on livestock including goats, sheep and poultry, leading to retaliatory killings that threaten to push rare species further toward extinction,” Haq said.\n\nUzma Khan, a wildlife conservation specialist with the WWF-Pakistan, said fragmented habitats are weakening the resilience of local ecosystems, leaving wildlife populations more vulnerable to conflicts with humans.\n\n“Numerous snakes have entered communities in recent days,” she said. “Many were rescued, but some, including pythons, were killed.”\n\nShe warned that floods can also spark disease outbreaks in livestock that spill over into wild populations. Stagnant water, she said, provides breeding grounds for insects that spread infections.\n\n“This requires close monitoring and vaccination of livestock to reduce the risk of outbreaks,” she added.\n\nFloodwaters often carry ungulates such as sambar deer and hog deer from across the border in India into Pakistan, further straining the country’s stressed ecosystems.\n\n“These deer, which include rare chinkara species, usually get injured after being struck by rocks and trees in the rivers, and require proper treatment before their release,” Kamran Bukhari, a senior conservator at the Punjab Wildlife Department, told Anadolu, adding that they are closely monitored.\n\nSo far this year, dozens of hog deer, which are classified as endangered, have been rescued, he added.\n\nAltaf Ali Shah, a wildlife department official in Khyber Pakhtunkhwa, said torrential rains and glacial lake outburst floods (Glofs) have displaced Himalayan ibex in Chitral district and destroyed habitats for birds, rodents, and reptiles.\n\nExperts warn that danger extends beneath the water’s surface. Fisheries and aquatic biodiversity are also under threat as floods disrupt river systems and wetlands.\n\nAquatic species endemic to Pakistan, including the Indus River dolphin, freshwater turtles and crocodiles, are at risk, Haq explained.\n\n“Strong currents sweep these vulnerable creatures into irrigation canals and distributaries where chances of survival are slim,” he said. “Rescue teams often find dolphins stranded far from their river habitats — one of Pakistan’s recurring ecological tragedies.”\n\nThe Indus dolphin, locally known as “bhulan“, is found almost exclusively in Pakistan. Dwelling mainly in a 1,300-kilometre (807-mile) stretch of the Indus River, the endangered mammal is functionally blind, relying on echolocation to navigate the muddy waters.\n\nA related species lives in the Ganges and Brahmaputra systems of India, Bangladesh and Nepal, but the Indus dolphin is genetically distinct and considered one of the world’s most endangered freshwater cetaceans.\n\nHaq urged more coordinated rescue and conservation efforts.\n\nDespite the devastation, Haq noted that the rains and floods carry a “dual nature,” sometimes boosting wildlife populations.\n\n“Floodwaters breathe life back into arid zones,” he said. “Species like chinkara deer and wild cattle often find freshly sprouted grasses at their doorsteps after rains, potentially boosting their populations in the short term.”\n\nScientific studies, he added, show that periodic floods increase primary productivity in rangelands and wetlands, sparking herbivore booms and drawing migratory birds in greater numbers.\n\nUzma Khan of WWF-Pakistan agreed, noting that natural floods, though increasingly unpredictable under climate change, also rehabilitate habitats that support fisheries, waterfowl and endangered riverine species like hog deer.\n\n“The most important step needed is protecting floodplains from human encroachment,” she said. “As well as linking rivers and associated lakes, which not only helps manage floods but also creates reservoirs that sustain communities as well as wildlife like waterfowl and freshwater turtles.”\n\nShe warned that unchecked leasing of land around wetlands and forests undermines natural defences.\n\n“Protecting forests is very crucial as they shield land from the devastating impacts of cloudbursts and flash floods, which are increasing in both frequency and intensity because of climate change,” she said.\n\nHaq said the long-term solution lies in creating wildlife corridors, restoring habitats and adopting sustainable floodplain management.\n\n“Without that, Pakistan risks losing crucial biodiversity and the ecological safety nets that support its natural heritage and, ultimately, its people,” he said.\n\nHeader Image: Pakistani people wade through floodwater as at least 22 people were killed and over 1.5 million affected in massive flooding, with hundreds of thousands already evacuated to safer areas in Mandi Bahuddin. — Anadolu Agency",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/12102918b9e1912.webp",
  "retrievedAt": "2025-09-19T14:35:52.323Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941414/from-jackals-to-dolphins-pakistans-wildlife-reels-under-deadly-floods",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T07:00:04.000Z"
}
