{
  "title": "Pakistan relying on spin prowess, team harmony ahead of women’s World Cup - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan captain Fatima Sana and head coach Mohammad Wasim voiced optimism over their side’s preparations for the upcoming ICC Women’s World Cup, stressing a spin-oriented strategy and collective harmony as central to their campaign.\n\nThe World Cup, to be hosted under a hybrid model across India and Sri Lanka, will see all of Pakistan’s fixtures staged in Colombo, with political tensions ruling out travel between the two neighbours.\n\nPakistan open their immediate run-in with a three-match ODI series against South Africa in Lahore from Sept 16, following the conclusion of a training camp at the National Cricket Academy and the Gaddafi Stadium.\n\n“The conditions in Sri Lanka favour spin, so we’ve built our squad around slow bowlers while also strengthening the batting group to post competitive totals,” Fatima told reporters. She termed the South Africa series a key opportunity to fine-tune combinations ahead of the global event.\n\nHead coach Wasim, a former Test batter, said the camp had focused on building a supportive environment and ensuring equal opportunities across the squad. While persistent rain in Lahore disrupted some practice games, he noted progress in all departments of play.\n\n“Our emphasis has been on creating a positive culture, that’s crucial to performance,” Wasim remarked.\n\nAsked about Pakistan’s high-profile Asia Cup final against India in Dubai on Sept 14, Fatima extended her best wishes to the men’s side.\n\n“It will be a great contest. I hope Pakistan comes out on top,” she said. Wasim added that recent success in the tri-series had boosted confidence against the arch-rivals.\n\nLooking further ahead, Wasim said Pakistan were determined to make a statement against India in Colombo.\n\n“We’ve taken all necessary steps to prepare ourselves in every department,” he observed.\n\nFatima, meanwhile, avoided highlighting individual players, insisting every member of the squad would have a role to play. She underlined the camp’s focus on improving batting partnerships and strike rotation.\n\nThe South African women’s side is due in Lahore late Thursday night, with the series expected to provide Pakistan a vital springboard before their World Cup challenge.\n\n“Winning this series will give us the confidence and mindset we need for the global stage,” the skipper concluded.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:36:17.890Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941348/pakistan-relying-on-spin-prowess-team-harmony-ahead-of-womens-world-cup",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:53:06.000Z"
}
