{
  "title": "Pakistan, Israel trade barbs at UNSC over attack in Doha - World - DAWN.COM",
  "author": null,
  "content": "Pakistan and Israel engaged in a heated debate at the United Nations Security Council (UNSC) on Thursday, with Islamabad condemning Tel Aviv’s recent attack in Qatar targeting Hamas leaders as “illegal, unprovoked, and a threat to regional stability”.\n\nThe sharp exchange took place at an emergency UNSC meeting convened under the agenda item ‘Situation in the Middle East’. The session had been requested by Algeria, Pakistan, and Somalia and was supported by France and the United Kingdom.\n\nAmbassador Asim Iftikhar Ahmad, Pakistan’s Permanent Representative to the UN, opened his address at the UNSC with a strong condemnation of Israel’s strike, calling it a “brazen and illegal assault” and a violation of Qatar’s sovereignty.\n\n“The brazen and illegal assault is not an isolated incident, rather it is part of a broader and consistent pattern of aggression and violation of international law by Israel that undermines regional peace and stability.”\n\nAhmad further highlighted that the “Israeli strikes targeted a residential neighbourhood, deliberately endangering civilians, and thus, also constitute a grave breach of the International Humanitarian Law.”\n\nHe described the attack as a direct challenge to diplomacy, as it targeted Qatar at a time when delicate negotiations on a Gaza peace deal were reportedly progressing toward a possible breakthrough.\n\n“Striking the territory of a principal mediator and those directly involved in negotiations is a deliberate attempt to sabotage diplomacy, derail peace efforts, and prolong the suffering of civilians,” he said.\n\nAhmad reaffirmed Pakistan’s solidarity with Qatar, highlighting the recent visit of Prime Minister Shehbaz Sharif and Foreign Minister Ishaq Dar to Doha as a demonstration of Islamabad’s support for the security and sovereignty of the Gulf nation.\n\n“The visit underscores Pakistan’s unwavering support for the security and sovereignty of Qatar and its commitment to peace and stability in the Middle East,” he said.\n\nHe condemned Israel’s attack as a flagrant violation of the UN Charter, particularly Article 2(4), which prohibits the threat or use of force against the territorial integrity or political independence of any state.\n\nAhmad warned that the attack was consistent with Israel’s long record of cross-border military actions in Gaza, Syria, Lebanon, Iran, and Yemen, describing it as “yet another manifestation of [Israel’s] systematic disregard for international law, and its brazen policy of destabilising the region.”\n\nReading from the Security Council statement adopted earlier in the day, Ahmad highlighted the unanimous condemnation of the strikes in Doha, noting that members had expressed deep regret at the loss of civilian life, underscored the importance of de-escalation, and affirmed support for Qatar’s sovereignty and territorial integrity. The statement also stressed the vital role Qatar continues to play in mediation efforts alongside Egypt and the United States for a ceasefire in Gaza, and called for the release of hostages and the end of the conflict in Gaza.\n\nFor his part, Israel’s ambassador initially addressed the UNSC by invoking the US raid that killed Osama bin Laden in Pakistan to justify the strike in Doha.\n\n“When bin Laden was eliminated in Pakistan, the question asked was not why target a terrorist on foreign soil. The question was why was a terrorist given shelter at all. The same question must be asked today. There’s no immunity for bin Laden and there can be no immunity for Hamas,” he said.\n\nAt that, Pakistan immediately exercised its right of reply with Ambassador Ahmad rejecting the analogy as “unacceptable, indeed ludicrous” and accusing Israel of attempting to deflect attention from its own “illegal actions and violations of international law“.\n\n“It [Israel] is an occupier, a serial violator of the UN Charter and international law, that threatens the international community, humanitarian organisations, and even the United Nations itself — and does so with impunity,” Ahmad said. “Despite being the aggressor, it pretends to be the victim. But today, it stands fully exposed.”\n\nAhmad also emphasised Pakistan’s frontline role in counterterrorism.\n\n“The international community is well aware of Pakistan’s sacrifices in the fight against terrorism. Al Qaeda was largely decimated due to Pakistan’s counterterrorism efforts, and we remain committed to this collective endeavor,” he said, reinforcing that Islamabad’s position was based on facts and international law.\n\nFollowing Pakistan’s response, the Israeli ambassador returned to the floor, accusing Pakistan and others of applying double standards.\n\n“Maybe he was offended by my words and I apologise for that, but I make sure my speeches stick to facts. And the fact is Osama bin Laden was killed in Pakistan, and no one condemned the US for that. When other countries attack terrorists, no one condemns them either,” he said.\n\nHe added: “You cannot change the fact that 9/11 happened, and you cannot change the fact that Osama bin Laden was in Pakistan and was killed on your territory. When you criticise us — and I’m sure you will continue — think about the standards you apply to your country and the standards you apply to Israel.”\n\nAssistant Secretary General for the Middle East, Asia and the Pacific, Mohamed Khaled Khiari, also briefed the Council while Qatar’s prime minister, Mohammed bin Abdulrahman bin Jassim al-Thani, participated under Rule 37 of the Council’s provisional rules of procedure.\n\nIn his address under Rule 37, Qatar’s prime minister strongly denounced the Israeli attack in Doha. He said the attack targeted a residential compound allocated for negotiating teams, housing Hamas representatives and their families, and terrorised residents.\n\n“It is a violation of the UN Member State’s sovereignty,” he said. “Israel – led by bloodthirsty extremists – has gone beyond any borders, any limitation when it comes to behaviour among states and individuals. Have you heard of any state that is attacking the mediator this way? A state that is attacking the negotiating teams that are hosted by Qatar?”\n\nAl-Thani criticised Israeli Prime Minister Benjamin Netanyahu’s justification of the attack, contrasting it against the Taliban’s political bureau in Doha, which facilitated the US-Taliban talks that ended the war in Afghanistan.\n\n“The United States has never targeted the negotiators.”\n\nHe warned that Israel’s actions were destabilising the region and undermining prospects for peace.\n\n“We call for peace, not war, and we will not be deterred by those who call for war and destruction,” he concluded.\n\nThe Security Council also heard from Rosemary DiCarlo, the under secretary general for political and peace building affairs at the UN, who described the strike in Doha as an “alarming escalation” that violated Qatar’s sovereignty and endangered the ongoing ceasefire and hostage negotiations with respect to the Gaza invasion.\n\nShe detailed that the airstrike targeted a residential area housing Hamas’ political leadership, killing several affiliates along with a Qatari security officer.\n\n“The sovereignty and territorial integrity of any country, including Qatar — a valued partner in advancing peacemaking and conflict resolution — must be respected,” DiCarlo told the ambassadors. Israel, she noted, claimed responsibility, with PM Netanyahu describing it as “a wholly independent operation” following a deadly attack on civilians in Jerusalem on Monday, which Hamas said it carried out.\n\nShe also noted that Qatar, the Gulf Cooperation Council, the League of Arab States, and the Organisation of Islamic Cooperation had all condemned the action and expressed concern over further escalation, underlining the widespread international alarm over the strike.\n\nChina’s representative also highlighted the Israeli attack’s impact on ongoing diplomacy, recalling that the US had proposed a ceasefire on September 7, which Israel reportedly agreed to. Just two days later, a Hamas delegation discussing the proposal was struck by Israel. “Such an act of bad faith, irresponsibility and a deliberate sabotage of negotiations is indeed despicable,” he said, expressing concern that the attack could escalate tensions further in the region.\n\nOther major powers also weighed in.\n\nThe US underscored that unilateral bombing inside Qatar did not serve the interests of Israel or Washington, while reaffirming support for ceasefire, humanitarian aid, and hostage negotiations. France condemned Israel’s strikes as a violation of the international law and stressed the need for a political solution based on a two-State framework. The UK described the attacks as counterproductive to peace and Israel’s long-term security. Algeria and Somalia criticised Israel’s aggression and urged the Security Council to take action to prevent further destabilisation.\n\nThe debate illustrated deep divisions within the Security Council over the Doha strike, with Pakistan leading the charge in condemning Israel and defending the principles of international law. Ahmad repeatedly underscored the link between Israel’s ongoing occupation of Palestinian territories and recurring crises in the region, stating that durable peace could only be achieved through a comprehensive political settlement, including an end to the occupation.\n\nObservers noted that Pakistan’s approach combined strong condemnation with legal and diplomatic reasoning, highlighting both the humanitarian consequences of the strikes and the broader threat to regional stability. Ahmad also emphasised that attacks on Qatar, a principal mediator in Gaza negotiations, constituted not just a violation of sovereignty but an attack on diplomacy itself.\n\nBy the end of the session, the UNSC collectively reaffirmed the importance of mediation, the release of hostages, and the need for a political solution to the Gaza conflict. However, the exchanges between Pakistan and Israel, coupled with Qatar and China’s condemnations, highlighted persistent tensions over accountability, the interpretation of international law, and perceived double standards in responses to acts of state violence.\n\nThe Doha strike and the ensuing Security Council debate have raised critical questions about the effectiveness of international mechanisms in restraining unilateral military actions, protecting mediators, and ensuring civilian safety in conflict zones.\n\nFor Pakistan, the session provided a platform to assert its principled stance on international law, uphold Qatar’s mediation role, and highlight the importance of accountability for actions that threaten regional peace and security.\n\nAs the Council moves forward, the debate over Israel’s actions in Doha is likely to influence broader Middle East diplomacy, the role of mediators, and the balance between counter-terrorism operations and international legal norms.\n\nPakistan’s leadership in condemning the strike, combined with interventions from other Council members, demonstrates the continuing relevance of multilateral forums in addressing complex conflicts, even amid disagreement among major powers.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/12113443a3a8337.webp",
  "retrievedAt": "2025-09-19T14:35:53.961Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941420/pakistan-israel-trade-barbs-at-unsc-over-attack-in-doha",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T06:09:56.000Z"
}
