{
  "title": "Govt orders crackdown on wheat price speculation - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A high-level government committee on Thursday reaffirmed that the country holds sufficient wheat stock and directed authorities to intensify market surveillance to curb speculative activity and prevent artificial price hikes.\n\nThe directive was issued by Finance Minister Muhammad Aurangzeb, who chaired the second meeting of the Steering Committee for the Assessment of Inflationary Trends. The committee, established last week by Prime Minister Shehbaz Sharif, is tasked with reviewing food stock levels and inflationary pressures, particularly in light of recent flood-related disruptions.\n\nAccording to an official announcement, adequate wheat stocks — excluding strategic reserves — are currently available. Initial assessments also suggest that flood damage to rice and sugarcane crops is manageable.\n\nAurangzeb stressed the importance of strict monitoring and vigilance against market manipulation to avoid undue price escalation.\n\nLocal naanbais (bread makers) in the federal capital have warned of a potential increase in roti prices due to rising wheat costs. In several cities, the price of roti has already increased, raising concerns over food affordability for daily wage earners and low-income households.\n\nDespite upward pressure on prices, government officials have dismissed claims of a wheat shortage, maintaining that sufficient supplies are available to meet current demand.\n\nThe committee continued its detailed review of domestic and international factors influencing price trends. The finance minister emphasised that controlling inflation and ensuring price stability remain among the government’s top priorities, particularly to safeguard vulnerable and flood-affected households.\n\nHe noted that the steering committee has been mandated to closely track market developments, coordinate policy responses across federal and provincial levels, and recommend timely administrative measures to contain inflation and protect public purchasing power.\n\nThe meeting included a comprehensive review of the basket of essential food items, assessing recent movements in the Sensitive Price Index (SPI). Key commodities such as onions, tomatoes, rice, wheat, sugar, and edible oil were discussed in detail, including region-wise supply trends, stock positions, and the import situation of selected staples.\n\nThe committee also reviewed preparations for the upcoming sowing season, underlining the need for a proactive approach to ensure timely availability of seeds and other agricultural inputs.\n\nAurangzeb directed all relevant institutions — including the National Disaster Management Authority, Space and Upper Atmosphere Research Commission, and the Pakistan Bureau of Statistics — to work closely with provincial governments to complete accurate and timely crop damage assessments.\n\nHe announced that the steering committee would reconvene next week to assess progress on agreed actions to ensure price stability.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/1210213668ad6c1.webp",
  "retrievedAt": "2025-10-12T13:04:42.915Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941297/govt-orders-crackdown-on-wheat-price-speculation",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:53:00.000Z"
}
