{
  "title": "CTD claims killing four ‘terrorists’ in Pishin - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Four alleged terrorists linked to the banned Tehreek-i-Taliban Pakistan (TTP) were killed in a Counter Terrorism Department (CTD) operation in Pishin’s Yaro area, while in a separate incident in Kharan district, unknown armed men gunned down four members of a family and abducted four others, police said on Thursday.\n\nA CTD Balochistan spokesman said on Thursday that the joint operation was launched on intelligence-based information about the presence of the terrorist group in Akalzai Yaro area in Pishin.\n\nThe terrorists opened fire on the CTD personnel when they cordoned off the area. However, the security personnel immediately retaliated, and a heavy exchange of fire continued for over an hour. During the gun battle, four members of Fitna al Khawarij — the term used by the state for the TTP — were killed, the spokesman said, adding that a large quantity of arms and ammunition was recovered from their hideout.\n\nThe seized weapons included two SMGs with magazines and cartridges, two 9mm pistols with cartridges, three hand grenades, a large quantity of explosive material, prima cord, and detonators.\n\nGunmen slay four in Kharan; as many abducted\n\nThe spokesman further said that the slain suspects had been directly involved in several terrorist incidents, including multiple casualty improvised explosive device (MCIED) attack on an FC truck in Chaman in Jan, IED attack on a Levies dafadar on College Road in Chaman in March, target killing of police official Mohammad Hashim in Oct 2022, and killing of another police official, Shaheed Zainullah in Nov 2022.\n\nFurther investigation is underway, the CTD Balochistan spokesman added.\n\nKharan attack\n\nMeanwhile, unknown armed men gunned down four members of a family and abducted four others from a remote area of Kharan district on Thursday.\n\nPolice said the incident took place in the Laja area of Kharan, where a large number of armed men arrived late Wednesday night. After identifying a house, they barged in and opened fire on its residents, killing four people — three of them brothers — on the spot.\n\n“The armed men fired multiple rounds at the victims, causing their instant death,” a senior police officer said, adding that the bodies were badly mutilated due to the excessive number of bullets.\n\nPolice officials also confirmed that the attackers took away four relatives of the deceased while leaving the area. Sources said the victims belonged to local tribes of Laja.\n\n“It appears to be a case of target killing,” police officials in Kharan said, adding that an investigation was underway. No group has so far claimed responsibility for the killings.\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:06:43.094Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941357/ctd-claims-killing-four-terrorists-in-pishin",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:52:53.000Z"
}
