{
  "title": "France deploys three Rafale fighter jets to help protect Polish airspace, Macron says - World - DAWN.COM",
  "author": null,
  "content": "France will deploy three Rafale fighter jets to help Poland protect its airspace after this week’s drone incursions into its airspace, French President Emmanuel Macron said on Thursday on X.\n\n“The security of the European continent is our top priority. We will not give in to Russia’s increasing intimidation,” he said.\n\nA French military official said the warplanes had already been deployed to Poland prior to Tuesday’s incursions.\n\nOn Tuesday, Poland said it had scrambled aircraft alongside allies to shoot down “hostile objects” violating its airspace during a Russian attack on neighbouring Ukraine, a first for a NATO country during the war.\n\nThe incursion came as Russia unleashed a barrage of strikes across Ukraine, including in the western city of Lviv, around 50 miles (80 kilometres) from the Polish border.\n\nResponding to the accusation, Russia’s foreign ministry claimed that its drones had carried out a major attack on military facilities in western Ukraine but stressed that there were no plans to hit any targets in Poland.\n\nSubsequently, Poland — a NATO member, invoked the Western defence alliance’s Article 4 for urgent talks in reaction to the violation.\n\nUnder Article 4, any member can call urgent talks when it feels its “territorial integrity, political independence or security” are at risk.\n\nPoland’s European partners in NATO have backed the country, with the Czech Republic, the Netherlands and Sweden each summoning their Russian ambassadors on Thursday to protest.\n\nGermany announced it would expand its role in a Nato mission to defend Polish airspace.\n\nMeanwhile, the UN Security Council has called an emergency meeting today to discuss violations of Poland’s airspace.\n\nStray Russian drones and missiles have entered the airspace of Nato members, including Poland, several times since Moscow launched its invasion of Ukraine in 2022.\n\nLast month, Warsaw said a Russian military drone flew into its airspace and exploded in farmland in eastern Poland, calling the incident a “provocation”.\n\nPoland in 2023 said a Russian missile had crossed into its airspace to strike Ukraine. And in November 2022, two civilians were killed when a Ukrainian anti-aircraft missile fell on a village near the border.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/12124422662bbf0.webp",
  "retrievedAt": "2025-09-19T14:35:52.238Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941436/france-deploys-three-rafale-fighter-jets-to-help-protect-polish-airspace-macron-says",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T07:44:55.000Z"
}
