{
  "title": "South Africa beat England by 14 runs in rain-marred first T20 - Sport - DAWN.COM",
  "author": null,
  "content": "CARDIFF: Marco Jansen and Corbin Bosch took two wickets apiece as South Africa beat England by 14 runs on the Duckworth-Lewis-Stern met­hod in a rain-marred first T20 in Cardiff on Wednesday.\n\nBad weather reduced what should have been a 40-over contest at Sophia Gardens to just 12.5 in total.\n\nEngland chasing a revised 69 in five overs for victory, finished on 54-5 as they failed to keep pace with a daunting run rate of nearly 14 an over against a quality attack.\n\nJansen (2-18) and Bosch (2-20) did the bulk of the da­m­age in an England innings where only Jos Buttler (25) passed 20.\n\nEarlier, several South Africa batsmen made quickfire 20s in a total of 97-5 in 7.5 overs after England captain Harry Brook won the toss.\n\nSouth African skipper Aid­en Markram struck 28 off 14 balls, with two fours and two sixes, although he was drop­ped in the deep by Phil Salt.\n\nDonovan Ferreira, the player-of-the-match, hit three sixes in his 25 not out and Dewald Brevis made 23.\n\nFast bowler Luke Wood was only playing after the hosts decided against risking Jofra Archer in the wet conditions following the express quick’s four-wicket haul in England’s record 342-run win over South Africa in the third ODI at Southampton.\n\nBut Wood had opener Ryan Rickelton caught behind for a golden duck in a haul of 2-22.\n\n“It feels like madness, but you can think about things. It was swinging about with the new ball, but you need one or two guys to make a cameo and you can reach a good score,” said Markram, who led the Proteas to a 2-1 ODI series win, at the presentation ceremony.\n\nBrook added: “We can’t read into that too much. We didn’t execute as well as we could have done.”\n\nBoth Salt, who holed out off the very first ball of the chase to the returning Kagiso Rabada, and Brook were out for ducks.\n\nIn between Jacob Bethell, fresh from his maiden professional century at Southa­mpton, made seven before he skyed Jansen to cover.\n\nButtler kept England in the hunt before he was caught behind, off Jansen’s last ball of the fourth over.\n\nEngland now needed 26 off six balls and Bosch, who dismissed Tom Banton with the opening delivery of the last over, ensured they never really got close, with South Africa going 1-0 up in this three-match series ahead of Friday’s second T20 at Old Trafford.\n\nSCOREBOARD\n\nSOUTH AFRICA:\n\nA. Markram c Wood b Rashid 28\n\nR. Rickelton c Buttler b Wood 0\n\nL.D. Pretorius c Brook b Wood 2\n\nD. Brevis c Dawson b Curran 23\n\nD. Ferreira not out 25\n\nT. Stubbs b Overton 13\n\nM. Jansen not out 1\n\nEXTRAS (LB-2, W-3) 5\n\nTOTAL (for five wkts, 7.5 overs) 97\n\nFALL OF WICKETS: 1-1 (Rickelton), 2-33 (Pretorius), 3-37 (Markram), 4-73 (Brevis), 5-90 (Stubbs)\n\nDID NOT BAT: C. Bosch, K. Rabada, K. Maphaka, L. Williams\n\nBOWLING: Luke 2-0-22-2 (1w), Overton 1.5-0-24-1 (1w), Rashid 2-0-24-1, Dawson 1-0-14-0, Curran 1-0-11-1\n\nENGLAND:\n\nP. Salt c Maphaka b Rabada 0\n\nJ. Buttler c Rickelton b Jansen 25\n\nJ. Bethell c Ferreira b Jansen 7\n\nH. Brook c Rickelton b Bosch 0\n\nT. Banton c Markram b Bosch 5\n\nW. Jacks not out 1\n\nS. Curran not out 10\n\nEXTRAS (B-4, LB-1, W-1) 6\n\nTOTAL (for five wkts, 5 overs) 54\n\nFALL OF WICKETS: 1-0 (Salt), 2-17 (Bethell), 3-28 (Brook), 4-43 (Buttler), 5-43 (Banton)\n\nDID NOT BAT: J. Overton, L. Dawson, L. Wood, A. Rashid\n\nBOWLING: Rabada 1-0-11-1, Jansen 2-0-18-2 (1w), Bosch 2-0-20-2\n\nRESULT: South Africa won by 14 runs (DLS Method).\n\nPLAYER-OF-THE-MATCH: Donovan Ferreira\n\nPublished in Dawn, September 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/121152397b416db.webp",
  "retrievedAt": "2025-09-19T14:36:18.428Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1941354/south-africa-beat-england-by-14-runs-in-rain-marred-first-t20",
  "dateList": "2025-09-12",
  "date_published": "2025-09-12T00:53:05.000Z"
}
