{
  "title": "PM for reduction in load-shedding amid soaring summer temperatures",
  "link": "https://www.app.com.pk/national/pm-for-reduction-in-load-shedding-amid-soaring-summer-temperatures/",
  "date_published": "2024-06-11T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 11 (APP): Prime Minister Muhammad Shehbaz Sharif on Tuesday directed for reduction of power load-shedding in the country in view of the rising temperature during summer season.\nThe prime minister also directed for functioning of an effective and active system in the power distribution companies for the facilitation of consumers, regarding registration of timely complaints in case of no supply of power.\nThe prime minister chaired a meeting regarding load shedding, the anti-power theft campaign and reforms in the power sector. The meeting was attended by Minister for Economic Affairs Ahad Khan Cheema, Minister for Energy Awais Leghari, Minister for Petroleum Dr Musadik Malik, PM’s Coordinator Rana Ahsan Afzal and senior officials of the relevant ministries, PM Office Media Wing said in a press release.\nThe prime minister advised that purchase of new transformers should be in line with the international standards, besides seeking benefits from the latest adopted present-day system at the global level for bringing reforms in the energy sector.\nHe also directed the provincial governments to fully support the anti-power theft drive and ensure exemplary punishment to those involved in power theft.\nThe prime minister also strictly directed to end overbilling in the country.\nDuring the meeting, the prime minister was apprised that till May 30, 134 cases had been registered and a total of 90 employees were arrested.\nA briefing over the re-organization of National Transmission and Dispatch Company and the progress achieved over the process was given.\nUnder the reforms in energy sector, a project related to metering of a total of 124,611 transformers was included in the upcoming development budget, whereas with the cooperation of Asian Development Bank one third of the power consumers of IESCO were being shifted to smart meters which would be enhanced to other areas of the country later on.\nThe meeting was given a briefing over the demand and supply of power and the causes of load shedding. The better recovery areas were load shedding free whereas it was carried out in the defaulted departments and power thievery areas.\nThe prime minister was apprised of the progress on anti-power theft campaign which was successfully underway with the support of provincial governments.\nTill 7 September 2023 to this date, 1,60,004 FIRs had been registered, 79,885 people had been arrested while 448 employees were suspended, it was further added.",
  "retrievedAt": "2025-08-11T03:11:04.771Z"
}
