{
  "title": "Govt carries out 88% financing of fiscal deficit through domestic markets: Economic Survey",
  "link": "https://www.app.com.pk/national/govt-carries-out-88-financing-of-fiscal-deficit-through-domestic-markets-economic-survey/",
  "date_published": "2024-06-11T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The government during the fiscal year 2023-24 carried out around 88 percent of financing of fiscal deficit through domestic markets, whereas 12 percent was made from external sources.\nAccording to the pre-budget document launched by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, the public debt portfolio and borrowing operations witnessed various developments during first nine months of outgoing fiscal year (July-March FY 2024).\nWithin domestic debt, the government relied on long-term domestic debt securities predominantly on floating rate Pakistan Investment Bonds (PIBs) and, Sukuk) for financing of its fiscal deficit and repayment of debt maturities.\nThe government was able to retire Treasury Bills (T-bills) amounting to Rs 0.8 trillion which led to a reduction of short-term maturities.\nIn order to make debt management operations more competitive and improve transparency in borrowing operations as well as diversify the investors base, government undertook amendments in the Treasury Bills Rules, 1998 and Ijara Sukuk\nRules, 2008.\nPursuant to these amendments, government carried out maiden auction of 1- year fixed rate Ijara Sukuk on PSX in December 2023. The whole Sukuk auction system has now been shifted to PSX.\nIn addition to existing 3 year and 5 year Ijara Sukuk instruments, government introduced a 1 year discounted Sukuk instrument with a target to diversify shariah compliant instrument base and give more options to investors with appetite towards Islamic investments.\nGovernment successfully issued Shariah Compliant Sukuk instruments amounting to around Rs 1.5 trillion, according to Pakistan Economic Survey.\nExternal budgetary disbursements were recorded at US$ 6.3 billion, of which US$ 2.7 billion was received from multilateral sources, US$ 2.8 billion from bilateral development partners and US$ 0.8 billion was recorded as inflow from Naya Pakistan Certificates;\nIn addition to above, government also received US$ 1.2 billion under the IMF’s Stand-By Arrangement (SBA) and US$ 1.0 billion bilateral deposit from UAE for balance of payment support.\nAccording to the pre-budget document, interest expense was recorded at Rs 5,517 billion during the first nine months of the current fiscal year against its annual budgeted estimate of Rs 7,302 billion.\nInterest expense on domestic debt was recorded at Rs 4,807 billion, which is 55 percent higher as compared to interest expense on domestic debt in same period of preceding year.\nThe main reasons for increase is due to high cost of borrowing on new domestic debt and resetting of existing floating rate debt at higher rates (around 74 percent of domestic debt is floating rate) on back of higher policy rate.",
  "retrievedAt": "2025-08-11T03:10:32.503Z"
}
