{
  "title": "Tarar stresses need for national political reconciliation for resolving all issues",
  "link": "https://www.app.com.pk/national/tarar-stresses-need-for-national-political-reconciliation-for-resolving-all-issues/",
  "date_published": "2024-06-11T18:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): Minister for Law and Justice Azam Nazeer Tarar on Tuesday stressed the need for national political reconciliation to resolve all the issues instead of pitching against each other.\nResponding to points raised by leader of the opposition in Senate Syed Shibli Faraz and Ali Zafar, the minister said no individual or a political is indispensable in a democratic system whereas reconciliation was the only solution to resolve crisis or mutual disputes.\nHe said the treasury benches never interrupted the opposition members during their speeches. When they were in opposition, they requested of the then treasury benches to give chairmanship of standing committees of Interior and Law and Justices to them for oversight but PTI refused, he said.\nHe went on to say that the PTI during its tenure passed 52 bills within one and half hours. The PTI government passed the bill related to State Bank of Pakistan in just five minutes despite their request, he said.\nAzam Nazeer said that the PTI leadership dissolved the National Assembly unconstitutionally as motion of no confidence had already been moved against the then prime minister.\nHe said the committees would be allocated to the parties as per their share in the House.\nSherry Rehman of PPP while speaking in the House said that the opposition members would get their share in standing committees as per their number of members in the house. They wanted that the opposition would have their due share in the committees of the House.\nShe said in past when they were in opposition, they were not given headship of interior and law and justices standing bodies but they did not resorted to boycott the standing committees.\nAPP/raz-ajb",
  "retrievedAt": "2025-08-11T03:10:04.573Z"
}
