{
  "title": "PSM to be revived by Sindh govt after federal govt’s consensus: Rana Tanveer",
  "link": "https://www.app.com.pk/national/psm-to-be-revived-by-sindh-govt-after-federal-govts-consensus-rana-tanveer/",
  "date_published": "2024-06-11T14:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP):Minister for Industries and Production, Rana Tanveer Hussain on Tuesday apprised the Upper House that Sindh government was going to take over the Pakistan Steel Mills (PSM) for reviving the state-owned enterprise after consensus with the federal government.\nThe minister was responding to the query of Senator Mohsin Aziz of Pakistan Tehreek-e-Insaf (PTI) pertaining to losses of PSM at present and the number of individuals employed.\nMinister for Investment with Chief Minister Sindh for working out a plan to revive the PSM.\nHe said that Sindh government was demanding 200 acres of more land other than the 550 acres of covered area of the existing plant of PSM.\nMoreover, he said the federal government had also approved 700 acres of the total 19,000 acres land of the PSM to use it for industrial purposes and Sindh Cabinet had also approved it’s rules for using the land.\nThe Minister said that PSM had around 5,000 employees whereas the Mill was closed that remained dysfunctional during the previous governments.\nThe federal government had acquired 1,500 acres of land for sports processing zone, whereas China was interested to relocate it’s export industry to Pakistan, he added.\nSenator Taj Haider, Pakistan People’s Party Parliamentarians (PPPP) informed the House that the PSM had the capacity of 1.1 million tonnes of production capacity whereas another steel mill of similar capacity and technology was set up in Isfahan, Iran that had 30 million tonnes of production capacity.\nHe said that Sindh government under the leadership of Chairman PPP Bilawal Bhutto Zardari was willing to revive the mega steel mill of the country and the federal government should consider it.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:11:29.170Z"
}
