{
  "title": "Market capitalization of PSX increase by 59.7 percent by end May 2024",
  "link": "https://www.app.com.pk/national/market-capitalization-of-psx-increase-by-59-7-percent-by-end-may-2024/",
  "date_published": "2024-06-11T16:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The market capitalization of the Pakistan Stock Exchange (PSX) increased by 59.7 percent to Rs 10,170 billion by end May 2024 against Rs 6,369 billion on 30th June 2023.\nAccording to Pakistan Economic Survey, 2023-24 launched here on Tuesday, as of May 31, 2024, the number of listed companies at PSX stood at 524. During July-March FY2024, 04 new companies listed at PSX.\nThe performance of major world stock markets (US, France, India, China, and Pakistan) remained robust except Shanghai Stock Exchange (SSE) Composite Index of China. Primarily, the property sector crisis in China slightly dented the investors’ sentiments.\nThe KSE-100 index of Pakistan posted a significant growth of 82.8 percent from 41,453 (end June 2023) to 75,878 (end May 2024) owing to successful IMF’s program under Stand-by Arrangement and stability on economic & political front.\nThe Morgan Stanley Capital International Emerging Market (MSCI-EM) Index, an index of 24 emerging stock markets, increased by 6.0 percent during July-May FY2024.\nIncrease has been observed in BSE Sensex Index of India (14.3%), Kuala Lumpur Composite Index of Malaysia (16.0%), Jakarta Stock Exchange Composite Index of Indonesia (4.6%) and Korean Composite Stock Price Index of South Korea (2.8%)\nDecrease has been observed in SET Index of Thailand (10.5%), Shanghai Composite Index of China (3.6%), and PSEi Composite Index of Philippines (0.5%). The product basket of National Savings Scheme (Defence Savings Certificates, Special Savings Certificates, Special Savings Accounts, Regular Income Certificates, Prize Bonds etc.) witnessed an outflow of Rs 105.0 billion during July-March FY2024 as compared to an outflow of Rs 308.2 billion last year.\nDuring July-March FY2024, 20,810 new companies were incorporated with SECP, with capitalization of Rs 33.0 billion. Most companies were registered in Information Technology (2,700), Trading Sector (2,475) and Services Sector (2,299).\nDuring July-March FY2024, 3.4 million lots of different commodity futures contracts including gold, crude oil, and US equity indices worth Rs. 4.1 trillion were traded on PMEX which is 14.5 p",
  "retrievedAt": "2025-08-11T03:10:52.506Z"
}
