{
  "title": "Danish School at Jia Khan Sohbatpur established with cost Rs 2122.6 million during 2023-24",
  "link": "https://www.app.com.pk/national/danish-school-at-jia-khan-sohbatpur-established-with-cost-rs-2122-6-million-during-2023-24/",
  "date_published": "2024-06-11T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): Under the Prime Minister’s directives, CDWP considered the project titled “Establishment of Danish School at Jia Khan Sohbatpur, Balochistan” (Cost Rs 2122.6 million). The project aims to provide quality education to the area’s residents to\nenhance the overall quality of education in this inundated / underdeveloped province.\nAccording to the Economic Survey 2023-24 launched by Minister for Finance and Revenue Senator Muhammad Aurangzeb on Tuesday, CDWP considered the establishment of the school will allow the residents of the area to receive quality education and compete with the students of the rest of the country for higher education.\nThe “Establishment of Danish School at Kuri, Islamabad ” project was also considered in CDWP. The objectives of the project are to provide quality education from class six to intermediate to the population of ICT, increase the literacy rate, and reduce the unemployment rate by offering quality education to the children belonging to the marginalized community that will reduce the disparity and promote equity and equality in society.\nFurthermore, as per performance review of 2022-23, the following projects are completed during 2022-23 including establishment of Islamabad Model College for Boys, G-13/2, Islamabad, establishment of Islamabad Model College for Boys, G-15, Islamabad, establishment of Islamabad Model College for Boys, Pakistan Town, Islamabad.\nSimilarly, the establishment of Islamabad Model School (I-V), Ghora Shahan (FA), Islamabad, provision of leftover Infrastructure in Islamabad Model College for Girls, Bhara Kahu, Islamabad were also among the completed projects.",
  "retrievedAt": "2025-08-11T03:10:32.943Z"
}
