{
  "title": "Governor Punjab honors Dubai-based Pakistani journalist Syed Mudassar Khushnood",
  "link": "https://www.app.com.pk/national/governor-punjab-honors-dubai-based-pakistani-journalist-syed-mudassar-khushnood/",
  "date_published": "2024-06-11T08:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): Governor Punjab Sardar Saleem Haider Khan presented the Best Journalist Award to Syed Mudassar Khushnood, a prominent Pakistani journalist based in Dubai, United Arab Emirates (UAE), at a prestigious ceremony organized by Pakistan Peoples Party (PPP) Gulf and the Middle East in Dubai.\nOn this occasion, PPP Gulf and Middle East President Mian Munir Hans praised Syed Mudassar Khushnood, emphasizing that he is recognized as the number one journalist in the United Arab Emirates, particularly in Dubai.\nHis extraordinary services have brought immense pride to Pakistani journalists in the UAE.\nThe award, presented personally by the Governor of Punjab, recognizes Syed Mudassar Khushnood’s role as an important bridge between the UAE and Pakistan.\nSyed Mudassar Khushnoud has been honored with numerous awards in the past, cementing his reputation as the best journalist in the UAE, including the region.\nSyed Mudassar Khushnood is the first Pakistani journalist in the UAE to receive a 10-year golden visa and the highest immigration award from the UAE government.\nHis services in promoting the positive image of Pakistan and serving the Pakistani community in the Emirates have been widely recognized.\nSpeaking at the event, PPP Middle East and Gulf President Mian Munir Hans reiterated that Syed Mudassar Khushnood is ranked first among the top ten journalists in the UAE. He called Khushnood an ambassador for the country while highlighting his significant impact on journalism.\nTalking to the media on this occasion, Governor Punjab Sardar Salim Haider Khan said that his party believes in freedom of the press and he has no role in the recent passing of the Punjab Defamation Bill 2024.\nThe event highlights Syed Mudassar Khushnoud’s outstanding achievements and dedication to journalism, further cementing his position as the number one journalist in the UAE.",
  "retrievedAt": "2025-08-11T03:11:43.901Z"
}
