{
  "title": "Economic Survey 2023-24: PTV keeps masses abreast of current affairs",
  "link": "https://www.app.com.pk/national/economic-survey-2023-24-ptv-keeps-masses-abreast-of-current-affairs/",
  "date_published": "2024-06-11T17:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The Pakistan Television Corporation Limited (PTV) while telecasting national and International programs in metro cities and also economically backward areas of the country keeps the masses abreast of current affairs of the country as well as the whole world.\nAccording to the Pakistan Economic Survey 2023-24, presented by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, the national TV continued to air different programs regarding entertainment, education, information and sports to the people enabling them to aware and uplift with their socioeconomic conditions, to eliminate the existing disparity.\nAt present, PTV is operating seven multiple channels like PTV Home, PTV News, PTV Sports, PTV Global, PTV National, PTV Bolan and PTV World. Only PTV English News Channel in Pakistan telecasting the information about Pakistan domestically as well as internationally.\n“Pakistan Television covers 100 percent area of population on terrestrial network. The number of registered TV set holders in the country was 25,184,719 as on 31st March, 2024.\nDuring FY 2024, Rs 204.650 million were allocated for two PSDP projects of the PTV i.e. ‘Establishment of National Film Production Institute at the PTC Academy’ and ‘A Pilot Project of Terrestrial Digitalization of DTMB-A (Digital Terrestrial Multimedia Broadcast)’- financed through Chinese grant-in-aid.”\nThe second project was commissioned to improve signal quality of the terrestrial network in the less developed areas of Pakistan. Also, the work on RBS (Rebroadcast Station)-Murree, Cherat and Kala Shah Kaku is under process for the upgradation of transformers and new power connections.",
  "retrievedAt": "2025-08-11T03:10:07.109Z"
}
