{
  "title": "FBR tax collection sees steady growth",
  "link": "https://www.app.com.pk/national/fbr-tax-collection-sees-steady-growth/",
  "date_published": "2024-06-11T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The Federal Board of Revenue (FBR) showed a consistent upward trend in tax collection, attributed to effective tax policies and administrative measures during the financial year 2023-24 (July-April).\nAccording to the Economic Survey 2023-24 launched on Tuesday, the rapid advancement in financial systems and digital payments “poses a compelling requirement to align the systems and processes with technology-driven shifts”.\nThe Survey noted that the FBR, a prime revenue organization, was undergoing a reform process to make it a modern and efficient organization for the best outcome. It could further enhance revenue collection and, consequently, the tax to Gross Domestic Product (GDP) ratio by focusing on technology advancement measures.\nThe FBR’s net provisional tax collection increased by 30.6 percent during the first ten months of the fiscal year 2023-24 to Rs 7,361.9 billion against Rs 5,637.9 billion during same months last year.\nThe domestic tax collection registered 32.3 percent growth to reach 6,464.3 billion during July-April FY 2023-24 from Rs 4,886.1 billion the previous year.\nAn amount of Rs 411.1 billion was paid back as refunds during period against Rs 282.0 billion in the same period of last year.\nDuring July-April 2023-24, direct tax share increased considerably to 48 percent from 45 percent last year.\nMeanwhile, the contribution of indirect taxes was reduced to 52 percent in ten months of fiscal year 2023-24 from 55 percent last year.\nAccording to the Economic Survey, the increasing share of direct taxes “shows a positive development consistent with progressive taxation principle.”\nThe revenues from direct taxes increased significantly, rising by 39.7 percent in the first ten months of FY 2023-24, and the net collection enhanced to Rs 3,513.2 billion from Rs 2,514.9 billion recorded in the same period last year.\n“The bulk of tax revenue is generated through income tax. A significant share of income tax is contributed through contracts, imports, profit payout, etc,” the Survey noted.\nThe tax payments with tax declaration and collection on demand also showed high growth. Within indirect taxes, sales tax collection grew by 19.5 percent during July-April FY 2024.\nThe net sales tax collection increased to Rs 2,498.5 billion from Rs 2,090.0 billion last year. Sales tax on imports contributed about 61 percent of total sales tax during same period, while the domestic sector contributed the rest.\nThe collection of federal excise duties (FED) increased sharply by 61.0 percent during the period under review. The net collection stood at Rs 452.6 billion during ten months of FY 2023-24, against Rs 281.2 billion during the same period last year.\nThe major revenue spinners of FED are cigarettes, cement, concentrates used in beverages/food, motor cars, and air travel.\nThe customs duty grew by 19.4 percent to reach 897.6 billion during July-April FY 2023-24 from Rs 751.9 billion in the same period last year.\nMineral fuels, vehicles, edible oil, and machinery were the significant revenue spinners of customs duty.",
  "retrievedAt": "2025-08-11T03:10:56.088Z"
}
