{
  "title": "Rs 7.67 bln provided to PBM during fiscal 2024 to provide assistance to needy",
  "link": "https://www.app.com.pk/national/rs-7-67-bln-provided-to-pbm-during-fiscal-2024-to-provide-assistance-to-needy/",
  "date_published": "2024-06-11T14:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): An amount of Rs 7.67 billion has been allocated to Pakistan Bait-ul-Mal (PBM) during the fiscal year 2024 to provide assistance to the destitute and needy persons through executing various core projects and schemes.\nAccording to the Economic Survey 2023-24 launched by Minister for Finance and Revenue Senator Muhammad Aurangzeb, out of the total, Rs 4.32 billion is utilized during July-March for various core projects and schemes.\nThrough Individual Financial Assistance (IFA), the poor, widows, needy, and orphans are supported for medical treatment of catastrophic diseases like cancer, surgical, heart, and kidney and installation of Cochlear implants for children up to age five years per Rs 1.5 million each child.\nThe PBM has envisioned providing wheelchairs to every disabled person in the country and Sewing Machines among skilled workers to empower them to earn their livelihood. A family having two or more special (disabled) children has been declared a “special family” is being provided financial assistance.\nAn amount of Rs1.75 billion has been disbursed countrywide for the period July to March fiscal year 2024.\nSchools for Rehabilitation of Child Labour (SRCLs), PBM has established National Centres for Rehabilitation of Child Labour countrywide since 1995 for primary (nonformal) education. Children (male and female) between the ages of 5 and 6 are weaned away from hazardous labor and enrolled in these centers, which provide free uniforms, books and stationery.\nDuring July- March fiscal year 2024, Rs 422.78 million was disbursed for the purpose.\nAn amount of Rs 272.0 million has been utilized for July to March fiscal year 2024 for Women Empowerment Centres (WECs) providing free training to widows, orphans, and poor girls in different skills.\nSimilarly, Rs 645.89 million has been spent on Pakistan Sweet Homes (PSHs) established for orphan children, where they are provided free food, nutrition, medical treatment, boarding and lodging, and free education through well-reputed education institutes.\nOld homes are established for enrolled senior citizens (above 60 years of age), where they are provided free of cost boarding/lodging, meals, and medical care. An amount of Rs 8.04 million has been utilized for that purpose.\nWhile an amount of Rs 137.82 million has been utilized for PBM Shelter Homes, mainly focuses on quality service delivery to shelter-less persons by respectably taking care of multiple aspects, including health care, safe/secure living environment, hygienic food, etc.\nPBM being an executing agency of Roti Sab Ke Leay has procured food vehicles to deliver food to the poorest segment of society and during July-March, fiscal year Rs 28.06 million has been utilized for that purpose.",
  "retrievedAt": "2025-08-11T03:11:03.061Z"
}
