{
  "title": "Govt to present over Rs18 trillion national budget on Wednesday",
  "link": "https://www.app.com.pk/national/govt-to-present-over-rs18-trillion-national-budget-on-wednesday/",
  "date_published": "2024-06-11T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): The incumbent government is all set to present its first growth-oriented federal budget for the fiscal year 2024-25, with an estimated outlay of over Rs18 trillion, on June 12 (Wednesday).\nThe budget for fiscal year 2024-25 would be presented before the National Assembly by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb.\nThe budget had been formulated while considering the existing challenges being faced by the economy at domestic and international fronts. Hence, mitigating people’s sufferings, transforming agriculture sector, promoting Information Technology (IT), boosting exports, promoting industrial growth and bolstering businesses, would be the main focus of the document, the sources said.\nThe government is firmly committed to presenting a pro-people, business-friendly and progressive Federal Budget FY 2024-25. It will pursue policies aimed at fiscal consolidation to contain budget deficit.\nIn addition to fiscal management, revenue mobilization, measures for economic stabilization and growth, reduction in non-development expenditures, job creation and people-friendly policies for the socioeconomic prosperity of the country, would feature in the budget.\nIt would also focus on social sector development besides introducing reforms for improving governance and boosting the private sector for investment.\nOn the revenue side, the government would introduce measures for bringing improvements in the system of tax collection, broadening the tax base, and facilitation to tax-payers.\nKeeping in view the robust growth of revenues during the current fiscal year (2023-24), the government is likely to set the revenue collection target at over Rs.12 trillion for the fiscal year 2024-25.\nThe sources said the preparations for the announcement of the federal budget for fiscal year 2024-25 continued in full swing in accordance with the prescribed timeliness.\nThe budget is being prepared in close coordination between all departments and ministries involved in budget related events including the presentation of the budget in the Parliament and launching of the Economic Survey, sources added.",
  "retrievedAt": "2025-08-11T03:11:03.008Z"
}
