{
  "title": "SNGPL, SSGCL expand gas transmission network: Survey",
  "link": "https://www.app.com.pk/national/sngpl-ssgcl-expand-gas-transmission-network-survey/",
  "date_published": "2024-06-11T15:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 11 (APP): Two gas utility companies, Sui Northern Gas Pipelines Limited (SNGPL) and Sui Southern Gas Company Limited (SSGCL) laid 156 km of gas transmission network, 3,614 km of mains, and 76 km of service lines, connecting 56 villages and towns to the gas network during July-March Financial Year 2023-24.\nAccording to the Economic Survey 2023-24 unveiled by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, 11,554 additional gas connections were provided across the country, including 9,871 domestic, 1,621 commercial, and 62 industrial connections.\nNatural gas, recognized as a clean, safe, efficient, and environmentally friendly fuel, contributes about 28.9 percent (FY 2023) of the country’s total primary energy supply mix. Pakistan has an extensive gas network comprising over 13,989 km of transmission pipelines, 161,806 km of mains, and 41,463 km of service gas pipelines, serving more than 10.77 million consumers nationwide.\nThe government is actively pursuing policies to enhance indigenous gas production and import gas to meet the increasing energy demand. Currently, the capacity of two FSRUs to re-gasify Liquefied Natural Gas (RLNG) is 1,200 MMCFD, enabling RLNG imports to mitigate the gas demand-supply shortfall. The total natural gas consumption was approximately 3,207 million cubic feet per day (MMCFD), including 695 MMCFD of RLNG from July-March FY 2024. The power sector, domestic sector, and fertilizer sector are the largest consumers of gas, with 894 MMCFD, 864 MMCFD, and 764 MMCFD, respectively.\nIn compliance with the OGRA Ordinance 2002 and LNG Policy 2011, OGRA notified LNG rules in 2007 to regulate LNG activities. The licensing process for LNG sector activities is governed under OGRA (LNG) rules. As of now, two LNG terminals are operational with licenses granted to M/s Engro Elengy Terminal Limited (EETL) in 2016 and M/s Pakistan GasPort Consortium Limited (PGPCL) in 2018. OGRA granted construction licenses in April 2021 to M/s Tabeer Energy Private Limited (TEPL) and M/s Energas Terminal Private Limited (ETPL) to develop LNG terminals in Port Qasim, Karachi. Additionally, extensions have been granted for these licenses for a further two years.\nGas companies plan to provide new connections during FY 2025, subject to OGRA approval. They also plan to invest Rs 45,483 million in transmission projects, Rs 39,610 million in distribution projects, and Rs 5,878 million in other projects, bringing the total investment to Rs 90,971 million during FY 2025. OGRA is empowered to regulate the LPG sector under the OGRA Ordinance 2002 and LPG (Production & Distribution) Rules 2001 since 15th March 2003.\nLPG is essential in Pakistan’s energy mix, providing a cleaner alternative to biomass-based sources, particularly in areas where natural gas is unavailable. During July-February FY 2024, the total supply of LPG stood at 935,574 metric tonnes. Currently, 11 LPG producers and 313 LPG marketing companies operate in the country with over 6,000 authorized distributors. OGRA has simplified the procedure for granting LPG licenses, which are now issued on a fast-track basis once requirements are met.\nDuring July-March FY 2024, OGRA issued 36 permits for the operation of LPG storage and filling plants, 33 licenses for the construction of LPG storage and filling plants, two operational licenses for LPG air mix plants, and eight licenses for road bowsers for the transportation of LPG. Additionally, OGRA issued four permits for the construction of LPG auto refueling stations during the same period.\nDue to augmented investment and future expansion plans of LPG marketing companies, significant investment in LPG supply and distribution infrastructure has been observed. OGRA has made a noteworthy contribution to national economic progress, creating an environment for additional investment, which will not only result in infrastructure development in the LPG sector nationwide but also provide jobs for hundreds of unemployed people. OGRA continues to play a crucial role in increasing private investment in the midstream and downstream petroleum industry. During July-March FY 2024, an investment of around Rs 6.57 billion was made in LPG infrastructure.",
  "retrievedAt": "2025-08-11T03:10:55.856Z"
}
