{
  "title": "Capital turns green, white ahead of Independence Day; preparations in full swing",
  "link": "https://www.app.com.pk/national/capital-turns-green-white-ahead-of-independence-day-preparations-in-full-swing/",
  "date_published": "2020-08-10T06:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): The federal capital has wore a green and white look with display of a number of stalls carrying attractive colourful accessories since the countdown for the upcoming Independence Day celebrations started with only two days left.\nA large number of Jashan-i-Azadi stalls carrying national flags, bunting, pin badges, green and white dresses, toys and other accessories set up at the main avenues, markets and streets of the city have added charm to the beauty of the capital and revived the hustle and bustle after lifting the lockdown after decrease in cases of COVID-19.\nThe preparations for the Independence Day festivity are in full swing with a number of patriotic youngsters especially children rush to these stalls daily for buying these accessories especially flags and bunting to decorate their vehicles and houses to finalize their preparations.\n“My kids are very excited after staying in-door for many days due to COVID-19 pandemic lockdown and now planned to enjoy the Independence Day celebrations to their fullest through buying dresses and decorating” , Zahid Awan who lives in G-8 sector said.\n“The stalls carrying green and white-coloured Jashan-i-Azadi accessories set up at different nook and corners have not only added a charm to the beauty of the capital but given a message of patriotism to the citizens”, he said while talking to APP.\nIt has been observed that every stall this year carried display of Kashmir flags to show solidarity and affection to the Kashmiri people living in Illegally Indian Occupied Jammu and Kashmir.\n“Independence Day is the perfect time to show solidarity with the Kashmiri people who have been struggling for their right to self-determination for decades and enduring atrocities and severe human rights violations”, Professor Tahir, a lecturer at a college said.\nHe said, the unwavering support shown by our nation to Kashmiri people on Youm-i-Istesaal should be expressed on the Independence Day also.\nShagufta Shahid, a working woman said, “We should not only let our children buy flags, bunting and other accessories to celebrate this day but tell them about the historical struggle of our national heroes and workers of Pakistan Movement behind creation of Pakistan and what we can contribute to make our country a better place”.\nShe said, the idea of tree plantation on August 14 will make this day more purposeful and contribute to reduce environmental hazards being faced by the country.\nKamran Khan, a roadside stall holder said, “The occasion of Independence Day gives us an opportunity to earn a handsome amount through selling flag-coloured items. Most of our customers are youth and children who buy more things to decorate their dresses, vehicles and homes.”\nThis year, vendors like me are expecting good sales after lifting lockdown as youth looks more enthusiastic to prepare for Independence Day celebrations and then posting selfies on social media, he said.\nHe said, the cost of giant flags is up to Rs. 2500 while the small and medium flags are sold from Rs. 500 up to Rs. 1000. The remaining items including, toys, face masks, pin badges and stickers are sold below Rs. 500.\nEvery year on Independence Day, youth and children show more excitement toward celebrating this important occasion and their motivation comes through the variety of stalls displaying unique items to attract them.",
  "retrievedAt": "2025-08-11T19:38:08.228Z"
}
