{
  "title": "Galadari Brothers provide free air tickets to 200 stranded Pakistanis: Bukhari",
  "link": "https://www.app.com.pk/national/galadari-brothers-provide-free-air-tickets-to-200-stranded-pakistanis-bukhari/",
  "date_published": "2020-08-10T06:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 10 (APP): Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (OPHRD) Sayed Zulfikar Abbas Bukhari Monday said Galadari Brothers had provided free air tickets to 200 Pakistanis stuck in the United Arab Emirates (UAE).\nIn a tweet, he said the Pakistan International Airlines (PIA) would operate two flights on Monday to repatriate the stranded Pakistanis.\n“Galadari Brothers provide free tickets to 200 overseas Pakistanis stuck in UAE. Two PIA flights to operate today to repatriate them back to Pakistan,” he tweeted.\nHe also added to his tweet to express gratitude to Suhail Abdul Latif Galadari for the initiative.\n“Shukria brother @SuhailGaladari7 for fulfilling your promise & standing with the Pakistani nation through COVID times.”\nGaladari Brothers committed an amount of Rs10 million for providing tickets to 200 stranded Pakistanis during a recent meeting with SAPM Zulfi Bukhari, held at Dubai last month.\n“Free air tickets for 200 stranded Pakistanis have been arranged and they will fly to Multan and Islamabad through special flights of PIA on August 10. Hundred (100) passengers will fly to Multan from Sharjah on Monday by PK 6238 departing at 0900 hours and arriving at Multan at 1300 hours and 100 passengers going to Islamabad from Sharjah by PK 6212 Departing at 1600 hours and arriving Islamabad at 2000 hours,” said a press release issued here by the Ministry of Overseas Pakistanis and Human Resource Development.\nMeanwhile, Consul General of Pakistan in Dubai Ahmed Amjad Ali has also conveyed his profound gratitude to Suhail Galadari for assisting Pakistani nationals for their repatriation to Pakistan.\nThe government of Pakistan has gained acclaim locally for taking the lead in launching the world’s largest repatriation operation during the corona virus pandemic to reunite the stranded citizens with their families. United Arab Emirates had the highest number of stranded Pakistanis since suspension of flights due to the pandemic.\nAccording to ministry, the government had repatriated more than 300,000 overseas Pakistanis from multiple countries through 500 plus special flights.",
  "retrievedAt": "2025-08-11T19:38:07.209Z"
}
