{
  "title": "Sarwar hails Dar for successful Tree Plantation campaign in Punjab; plants sapling at NHMP Training College",
  "link": "https://www.app.com.pk/national/sarwar-hails-dar-for-successful-tree-plantation-campaign-in-punjab-plants-sapling-at-nhmp-training-college/",
  "date_published": "2020-08-10T05:55:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 10 (APP): Governor Punjab Chaudhry Mohammad Sarwar on Monday said the government had been endeavouring to eliminate political interference from institutions.\nSpeaking during a Tree Plantation ceremony at the National Motorways and Highways (NHMP) Training College, Sheikhupura, he said the nation was proud of transparency and merit in the NHMP, adding that there was nothing in life that could not be achieved with hard work.\nInspector General of Police (IGP) Motorway Police Syed Kaleem Imam along with other high officials of motorway police were present.\nHe also announced to install a Water Filtration Plant in Police Training College by the Sarwar Foundation.\nGovernor Punjab Chaudhry Mohammad Sarwar said strong institutions led to strong countries, adding that ever since the PTI government had assumed power, it had been trying to eliminate political interference from institutions besides taking practical steps for strengthening institutions.\nThe Governor Punjab said political interference destroyed institutions and then institutions did not work on merit and transparency.\nHe said Pakistan was on the road to economic development, adding that global organisations were also validating Pakistan’s economic development today due to CPEC.\nSarwar said, “Pakistan belongs to all of us and all of us must work for its progress and prosperity.”\nHe said some people in Pakistan said that coronavirus was nothing but a conspiracy. Because of the misinformation, the government had to face a lot of problems but Prime Minister Imran Khan’s strategic smart lockdown policy had effectively contained coronavirus in Pakistan. “We should continue to follow the government SOPs until we completely get rid of this deadly virus.”\nGovernor Punjab Chaudhry Mohammad Sarwar said, “Pakistanis are proud of Rescue 1122 and Motorway Police because they are not only corruption free but these departments are working on the principles of merit and transparency.” He said a progressive Pakistan was the vision of Prime Minister Imran Khan, adding that the Prime Minister had always done what others thought was impossible to do.\nHe said the Moodys had maintained Pakistan’s ranking as stable which was a sound evidence of successful economic policies of the incumbent government.\n“I appreciate and congratulate Usman Dar and his team for the successful tree plantation campaign as tree plantation is vital for the survival of our future generations,” he said.\nIG Motorway Police Syed Kaleem Imam said over 25,000 lives were lost due to road accidents every year in Pakistan, adding that Motorway Police always tried to ensure safety of those who traveled through motorways.\nHe said, “Motorway police are completely corruption free and we are ensuring merit and transparency on every level.”\nEarlier, Governor Punjab Chaudhry Mohammad Sarwar launched a plantation campaign by planting a sapling in NHMP Training College.",
  "retrievedAt": "2025-08-11T19:38:17.246Z"
}
