{
  "title": "Turi meets with Portuguese counterpart, discusses bilateral relations",
  "link": "https://www.app.com.pk/national/turi-meets-with-portuguese-counterpart-discusses-bilateral-relations/",
  "date_published": "2022-11-18T07:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Federal Minister for Overseas Pakistanis and Human Resource Development (OP&HRD) Sajid Hussain Turi met Portuguese Secretary of State for Labor Mr. Miguel Fontes and President of Public Works Department IEFP, Mr. Domingo Lopes in Portugal.\nIn the meeting, bilateral relations, facilitation of immigration process and issues of mutual interest were discussed.A detailed discussion was held on the process of further enhancing cooperation between Portugal and Pakistan in human resources and labor exchange programs.\nTuri emphasised on increasing cooperation between the two countries in the field of human resources as that can benefit both sides, received a press release here on Friday.\nFederal Minister further expressed that Pakistan is proud of its cordial and friendly relations with Portugal.Pakistan and Portugal have always worked together to strengthen cooperation and relations with each other.He further added that Pakistan is interested to expand the relations in economic sector.\nHe added that the sole reason of his presence in Portugal is to create opportunities for skilled and hardworking Pakistanis to work in Portugal.\nHe elaborated that Portuguese companies can hire Pakistani IT experts and skilled workers. Pakistan is willing to assist Portugal by proving manpower in various fields.\nFederal Minister for Overseas Pakistanis and Human Resource Development, Sajid Hussain Turi said that proposed draft on Labor Mobility Partnership should be signed soon. The agreement on Labor Mobility Partnership will provide a legal framework for increasing cooperation between the two countries.\nTuri said both countries are working on student exchange programs. He said he is elated that Pakistani students can get a chance to study in Portugal.\nHe added that Pakistan and Portuguese must work to expedite the process of immigration and visa acquisition.Minister expressed his gratitude for a warm welcome and his delightful visit to the beautiful country of Portugal.He expressed his best wishes to the Government of Portugal and the people on behalf of the Government and the people of Pakistan.",
  "retrievedAt": "2025-08-11T15:53:56.791Z"
}
