{
  "title": "NA passes resolution to protect children’s rights",
  "link": "https://www.app.com.pk/national/na-passes-resolution-to-protect-childrens-rights/",
  "date_published": "2022-11-18T07:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): The National Assembly (NA) on Friday unanimously adopted the resolution to acknowledge Children’s rights on World Children’s Day’ celebrated every year on 20th November.\nThe resolution was moved by the Member National Assembly (MNA) Mehnaz Akbar Aziz, stated that this House realizes the negative effects of climate change and feels strongly about the resulting suffering of 16 million children who have been impacted by the ‘super floods’ in Pakistan, and at least 3.4 million girls and boys who remained in need of immediate, lifesaving support.\nThe House recognizes the rights of every child born in Pakistan as well as mothers and the need for provision of the best available early care and safe environment for all children.\nThis House understands the importance of the first thousand days of every child’s life which is a unique period of opportunity for brain development and laying foundations of optimum health and future growth of children.\nThis House condemns merciless practices of child trafficking, child abuse, child pornography and prostitution, and recommends strong legislation and implementation to curb these inhuman and brutal offences.\nThis House reassures to safeguard rights of all children as enshrined in the1973 Constitution of Pakistan, and under the United Nations Convention on the Rights of the Child, for a more equal and inclusive Pakistan.\nThe House pledges to ensure inclusion of children’s voices in important matters to establish peace and harmony in the society, creating conducive environment for a healthy life.\nThis House reaffirms to tackle the menace of child and bonded labor as enshrined in Article-11 of the Constitution\nMeanwhile, this House commits to create equal opportunities for all to acquire quality education in true letter and spirit as enshrined in Article 25-A of the Constitution of Pakistan.\nThis House resolves to invest time and effort for reducing malnutrition in children and mothers, and combat the menace of stunted growth among children in order to protect the future of Pakistan.\nThis House further commits that the child who is physically, mentally or socially handicapped shall be given the special treatment, education and care required by his condition.\nThis House pledges to provide more opportunities for children’s civic engagement and participation, as inclusion is pivotal to the future of democracy.\nThis House reiterates to further support and strengthen the Parliamentary Caucus on Child Rights for the child-centered legislation, advocacy and oversight, and National Commission on the Rights of Child to ensure greater compliance.\nIt is to mention here that as many as 500 students along with the teachers from the seven federal public schools working under the ambit of Federal Directorate of Education were also present in the National Assembly to witness the proceedings on International Children Day.\nSpeaker National Assembly welcomed the school children and teachers in the session.",
  "retrievedAt": "2025-08-11T15:53:56.311Z"
}
