{
  "title": "PAF pavilion remained iconic at IDEAS-2022",
  "link": "https://www.app.com.pk/national/paf-pavilion-remained-iconic-at-ideas-2022/",
  "date_published": "2022-11-18T07:33:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 18 (APP):The 11th Edition of International Defence Exhibition and Seminar, IDEAS 2022, concluded on Friday at Karachi Expo Center.\nOn the 4th and final day of the exhibition, the National Aerospace Science and Technology Park (NASTP) being the most appreciated project of the show, continue to gather admiration from the visitors, said a news release on Friday.\nThe broad spectrum of the project and its national significance has made it the most successful project at the exhibition. The NASTP project as per CAS vision and his own initiative has materialized in record time.\nPAF pavilion with the static display of state of the art JF-17 Thunder and Super Muhshak Trainer Aircraft remained iconic in the mega event with keen interest shown in the indigenously developed aircraft by the visiting delegates and senior military officials of different countries.\nEarlier, on the 3rd day of the event, PAF’s legendary Mirage aircraft presented a breath-taking flypast at Karachi Sea view. The event also included a paratrooping show of PAF’s Air Borne team jumping from the mighty C-130 Hercules. The Flypast was witnessed by several key officials and delegates from friendly countries. The excited crowd gathered at the venue were over joyed to see the power packed performance of the PAF aircrew.\nBoth NASTP and the JF-17 Thunder aircraft together will serve as the leading defence productions to attract foreign delegates for joint ventures. NASTP is all set to become one of the best Aerospace, Cyber and IT Clusters in the world and transform national landscape with design, R&D and innovation centers for emerging and disruptive technologies to foster research, innovation and development in aviation, space, IT and cyber technologies, products and services to accrue maximum social, economic, security and scientific dividends for the country.\nThe mega event on one hand provided an opportunity to Pakistan Air Force to showcase its aircraft and indeginous productions infront of the audience from around the globe while on the other will pave the way for future defence collaborations with friendly countries.",
  "retrievedAt": "2025-08-11T15:53:56.273Z"
}
