{
  "title": "Govt to provide legal cover to street vendor program: Faisal Kundi",
  "link": "https://www.app.com.pk/national/govt-to-provide-legal-cover-to-street-vendor-programfaisal-kundi/",
  "date_published": "2022-11-18T12:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Special Assistant to Prime Minister for Poverty Alleviation and Social Safety, Mr. Faisal Karim Kundi Friday announced that the present government will provide legal status to the street vendors program.\nHe was presiding over a briefing on providing an enabling environment for street vending.\nMr. Zia Banday, senior fellow Pakistan Institute for Development Economics (PIDE) and focal person of street vendors’ program, gave a detailed presentation on the ongoing program in Islamabad, its challenges and future roadmap.\nThe meeting was attended by Mr. Nadeem Afzal Chan, Former PPP MNA and high officials of the ministry along with representative street vendors.\nFaisal Kundi said that street vendors are an important part of society and by recognizing them through legislation and regulations we can build our economy.\nZia Banday apprised Faisal Karim Kundi about the challenges faced by street vendors. The previous government didn’t provide legal status to Rehri Ban project due to which such a useful scheme had to face a closure in the initial stages, said Faisal Karim Kundi.\nThe present government will provide legal status to the project, he added.\nStreet vendors discussed their fears and expectations of the vendor’s community with Faisal Karim Kundi.\nKundi assured them full support for the welfare of street vendors. He said that vendors will only welcome this project if legal grounds are provided to the project.\nThis project must be extended to the provincial level, he added.\nIt was elaborated in the meeting that in comparison to other developing countries, street vendors remained a much neglected segment in Pakistan.\nIt is left to fend itself on the cost of perpetual squeezing by predators from both private and public entities.\nBased upon a PIDE research survey, the street economy of urban Pakistan is conservatively estimated at around PKR 900-1000 billion with up to a million street vendors operating.\nThis is an overwhelmingly cash, unrecorded and informal economy with little graduation opportunities for Bottom of Pyramid (BoP) street vendors.\nDeprivation of legal status constraint effectiveness of street vending as a viable tool for poverty alleviation, job creation and livelihood for urban poor.\nIn 2021, Ministry of Poverty Alleviation launched a street vendors’ initiative at limited scale for formalization and financial inclusion of street vendors. Program components enabled over 200-street vendors to acquire eco friendly carts, micro-finance loans and vending licenses. Participating street vendors have organized themselves in an association. It is now facilitating digitalization of street vendors through their digital onboarding, bookkeeping, online payments, lending and ecommerce with engagement with tech companies.\nMr. Nadeem Afzal Chan mentioned that ground realities of street vending demand a holistic engagement between political leadership and researchers for a sustainable solution. PPP has a long history of struggle for the emancipation of poor and it is willing to expand the intervention footprint for street vending across the country.\nParticipating street vendors also talked about their problems, where they are primarily facing problems of non-issuance and non-renewal of vending licenses.\nTheir relief under the government program is under peril due to eviction threats from Municipality officials.\nThey have requested Mr. Kundi to intervene in this matter. SAPM has shown his resolve in addressing the street vendors’ issues in earnest.\nHe mentioned that the government will be engaging all stakeholders in first getting the street vendors’ law promulgated and then oversee its implementation across the country. He recognized street vendors as an integral part of the urban economy, who have a legitimate socioeconomic role to play.\nHe emphasized that the ministry of poverty alleviation will play a lead role in the provision of an enabling environment for street vendors in the country.",
  "retrievedAt": "2025-08-11T15:53:52.090Z"
}
