{
  "title": "IDEAS 2022 depicts Pakistan’s achievement, self-sufficiency: Israr Tareen",
  "link": "https://www.app.com.pk/national/ideas-2022-depicts-pakistans-achievement-self-sufficiency-israr-tareen/",
  "date_published": "2022-11-18T13:03:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 18 (APP): “Our country has showcased one of the best and technologically advanced air and ground equipment in the global market, thus, proudly achieving self-sufficiency in many fields related to the defence sector,” Mr Muhammad Israr Tareen, Federal Minister for Defence Production stated while addressing the closing ceremony of IDEAS 2022 held at the Expo Center, Karachi.\nHe further added that Pakistan has always been conscientious of the reality that arms facilitate peace, desires to live as a harmonious and peace-loving country in this competitive world.\nMajor General Muhammad Arif Malik HI(M) DG DEPO, Brig. Naveed Azam Cheema, Director Coordination DEPO, Commodore Mohammad Tahir SI(M), Director (Media) DEPO and Mr. Zohair Naseer, CEO Badar Expo Solutions were also present on the occasion.\nHe added that the aim of the IDEAS 2022 was to showcase our products, demonstrate our organizational skills to plan and conduct a mega event of international stature and provide a great international platform to convey our viewpoints on security issues of the Region. Moreover, to provide a unique opportunity for our defence related industry, both in public and private sector, to display their products and interact directly with the defence industry of the developed world and creating a good opportunity to reinforce the diplomatic efforts in the domain of defence diplomacy. He said by holding IDEAS 2022 successfully under the prevalent environment is the manifestation to build the image of Pakistan as a modern, progressive and tolerant state that is willing to co-exist peacefully with the international community.\nWhile giving an answer to a question he said we have achieved all targets of holding the IDEAS 2022. Around 285 foreign defence delegations from 64 countries participated, which shows the significance and success of the exhibition. Over 30 MoUs were signed delegates on the side line of IDEAS-2022.\nHe highlighted that foreign delegate, as well as exhibitors, had a comfortable stay and a good message will be conveyed in the world that Pakistan is a peaceful country and has the organizational skills to hold a grand event in the most organized way.\nMeanwhile, Major General Muhammad Arif Malik also briefed the media, and added that Pakistan had been in defence production since decades.\nOur some of the major indigenously developed products were showcased in IDEAS-2022 including Main Battle Tank, Al-Khalid, Al-Zarrar, JF-17 Thunder Fighter Aircraft, Armoured Personnel Carriers, and Armed UAV etc.\nWe received a very good response for IDEAS 2022 from Turkey, China, North America, South America, Europe, Asia, and Far East.\nDG DEPO thanked event Badar Expo for selling up show in befitting manner. He added that the impact of the event will be large, it is an ongoing process and major deals take time to be cemented. Pakistan is producing high-quality defence products which are competitive in cost but are equal in terms of quality. Pakistan would continue to hold IDEAS biennially and has great potential to export its defence products across different continents of the world.\nLater, the exhibitors were recognized by giving away certificates and participation awards.",
  "retrievedAt": "2025-08-11T15:53:51.640Z"
}
