{
  "title": "First Lady for constant awareness, effective measures to reduce deaths by breast cancer",
  "link": "https://www.app.com.pk/national/first-lady-for-constant-awareness-effective-measures-to-reduce-deaths-by-breast-cancer/",
  "date_published": "2022-11-18T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): First Lady Samina Alvi on Friday said that the continuous awareness campaign and effective measures were a must to reduce the ratio of fatalities caused by breast cancer in the country.\nThe first lady, addressing an event to create awareness on breast cancer, said the awareness drive would help women get early diagnosis of the otherwise deadly disease for their timely treatment thus reducing the risks of deaths.\nHeld by Islamabad Chamber of Commerce and Industries, the event was attended by representatives of the business community, health experts and a huge number of women.\nShe told the gathering that the ratio of breast cancer-related deaths was higher in Pakistan comparing other countries as one of every nine women in the country was infected by the disease. Moreover, around 50,000 women succumb to the disease every year, she added.\nShe said besides preventive measures, the timely diagnosis of breast cancer was essential which necessitated the self-examination by the women.\nSamina Alvi said the media, educational institutions, hospitals and the business community had been fully participating in the awareness drive on breast cancer.\nShe said the higher fatality ratio of breast cancer was a matter of concern. Due to the very reason, an awareness campaign was underway across the four provinces which was also bringing in the positive impacts.\nBesides, awareness seminars were also being held in the universities, she added.\nLauding the role of ICCI, the first lady apprised the participants about her visits to different areas which led to enhanced awareness among women.\nShe said despite meagre resources, the country was capable enough to cope with the deadly disease.\nReiterating her call for self-diagnosis, the first lady said in case of finding any abnormal growth, the women should immediately consult the doctor and also undergo mammography and screening, if required.\nShe said even the young girls of 12 years were also being infected by the disease which was a matter of concern.\nShe also called for steps to take care of the persons with disabilities besides improving the people’s mental health.\nIn their addresses, other speakers including ICCI President Ahsan Zafar Bakhtawari appreciated the active role of the first lady for awareness of breast cancer and emphasised the continuity of the campaign.\nThe health experts apprised the audience about the situation of breast cancer in Pakistan, prevention and its treatment.",
  "retrievedAt": "2025-08-11T15:53:54.185Z"
}
