{
  "title": "Leopards intrude Saidpur village, hunt goat",
  "link": "https://www.app.com.pk/national/leopards-intrude-saidpur-village-hunt-goat/",
  "date_published": "2022-11-17T20:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 17 (APP):Around four common Asian Leopards, in a rare appearance close to human habitation, on Thursday evening intruded Saidpur village located next to the protected area, and hunted a goat.\nThe Islamabad Wildlife Management Board (IWMB) staff rushed to the spot to ensure protection of the masses and the wild species of the endangered big cats after it received the information that few leopards were spotted inside Saidpur village at 1930 hours, an IWMB staffer on ground told APP while sharing details of the incident after a small clip of leopards made rounds over social media.\nThe few seconds video made by locals spotted a leopard, and a crowd of locals could be seen throwing spotlights on the wildcat.\nThe IWMB official maintained that he was a local resident of Saidpur and had received the information from the IWMB official number. The staff had reached the spot swiftly due to close proximity.\nHowever, he said the locals had gathered on the spot like ‘spectators of a fun fair’ which was risky as the wild animal which was human shy in nature could have been provoked and instigated by human sounds of hooting and rumpus and might have attacked them.\nHe brushed aside the private media reports of more than half dozen goats and cows being killed by the wandering leopards as they had only attacked a single goat and left it after the locals created noise to flee the cats.\nThe IWMB official said the area residents were reluctant to leave the spot so that the leopards could also go back to their habitat. “I had requested the Islamabad Police mobile on patrol to disperese the gathered mob but they didn’t pay heed to it and left the spot.”\nThe leopards, however, left the spot after a while and no person was harmed, he said, adding, “the leopards have not intruded in the human settlement rather humans have encroached into their habitat as the leopard attacked the goats in a newly built dwelling by the locals which is illegal and within the national park.”\nWhen contacted the Kohsar Police Station, the officials said that the police troops were deployed on ground to protect people in Daman-i-Koh which was in the Saidpur village’s vicinity.",
  "retrievedAt": "2025-08-11T15:53:56.822Z"
}
