{
  "title": "President for creating awareness on initiatives for women empowerment",
  "link": "https://www.app.com.pk/national/president-for-creating-awareness-on-initiatives-for-women-empowerment/",
  "date_published": "2022-11-18T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): President Dr Arif Alvi Friday underlined the need for a comprehensive awareness campaign with the involvement of all relevant stakeholders to inform and educate female population of the country regarding steps taken by the government for the empowerment of women and to urge them to fully utilize and profit from these initiatives.\nThe President made these remarks during a meeting with a delegation of the Women Business Network here at the Aiwan-e-Sadr.\nDuring the meeting, the President said that multiple products targeting women had been launched, which include opening bank accounts online without requiring women to visit bank branches and fulfilling cumbersome processes, Property Rights acts, which have made it mandatory for giving the inheritance to the women.\n“Females are also being offered loans on easy terms and conditions”, he added.\nThe President said that BISP and Ehsaas programs were extremely effective and were playing a pivotal role in maintaining data of the women population, providing them with financial stipends, helping them to open bank accounts and creating a digital communication network to communicate with the women of Pakistan through digital, SMS and other such services.\nHe said that although there was a pressing need for taking more steps for empowering women both economically and financially and to encourage women to profit and benefit from the laws, programs and initiatives already in the field of empowerment of women.\nThe President expressed his deep concerns that although the banks have been offering preferred loans to women, however, only 2 to 5% of loans were being availed.\nHe called upon all the women’s networks and other relevant organizations in private and government sectors to take decisive action and roll out advocacy and awareness programs to advise the women to fully utilize these loans, which he said will play a pivotal role in their empowerment.\nThe President said that if Pakistan was to make progress, it needed to ensure that its women population was involved in the active economic stream, was empowered financially and economically and equipped with education and marketable skills through the existing skilled-based institutions and also benefiting from the free of cost training and education and programs offered online.\nHe said that women parliamentarians, Chambers of Commerce, NGOs and advocacy groups should join hands to develop a comprehensive strategy to reach out to women at the grassroots level and equip them with the information and education for their self-empowerment.\nThe President said that there was also a need to develop a comprehensive strategy and advocacy campaign to bring women into the formal structure and elevate them to decision-making positions, which would encourage other women to follow suit.\nHe said that the women and youth bulge of the country were two great assets, which need to be fully equipped and geared to contribute their pivotal role in the progress and development of  country.\nThe President appreciated that women were entering into professional education in reasonable numbers but expressed his concerns that 50% of these women preferred to stay at home without being economically active after graduation, which was a great loss to the country.\nHe urged all the advocacy groups, organizations and parents to ensure that all women graduates of professional colleges enter into the economic mainstream and contribute their share in the development of country.\nWomen Business Network is a global network of business professionals and corporate leaders to uplift women for key leadership positions in the industry and to create cross-border opportunities for their businesses.\nIt aims to support and connect women’s organisations and cross-sector collaborations, supporting women entrepreneurship, women lead businesses and empowering women businesses through international exchange programs.",
  "retrievedAt": "2025-08-11T15:53:54.308Z"
}
