{
  "article_id": "2025-07-31_7d385d386952072f54bbf7fe745f64b8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pti-leadership-deliberately-skipping-hearings-to-delay-court-verdicts-prosecutor-general/",
    "retrieved_at": "2025-08-27T10:24:55.266Z"
  },
  "metadata": {
    "title": "PTI leadership deliberately skipping hearings to delay court verdicts: Prosecutor General",
    "author": null,
    "date_published": "2025-07-31T16:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 354,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 31 (APP): The Pakistan Tehreek e Insaf (PTI)'s leadership is deliberately skipping appearances before the courts to delay the proceeding decisions of trials in various cases pertaining to violence and vandalism, said Federal Prosecutor General Ghulam Sarwar. He was talking to media along with Prosecutor Raja Naveed and others outside the Judicial Complex Islamabad. He said that case No.1033 of Kohsar police station, which has been heard in ATC-II is related to November 26 protest in which Ali Amin Gandapur, Faisal Javed, Zulfi Bukhari, Asad Qaiser and others are involved. In this, considerable damage was caused to government property. On May 12, ten challans were distributed and copies were distributed to eight accused. Eight accused who were absent were declared absconders, he said, adding that the process of declaring two accused as absconders has been started. The case is scheduled for August 4. He said that in the Tarnol police station case, Zartaj Gul, Faisal Javed, Ali Bukhari, Shibli Faraz, Raja Basharat and other leaders are nominated. In this case, challans were submitted to the extent of 98 accused on July 22. The prosecutor said that in the Karachi Company Police Station related to November 26, protest, arrest warrants have been issued against 50 accused. Since the case was registered, these accused have not appeared before court. These accused were not even included in the investigation. Twenty-one accused were arrested on the spot in the case of the Police Station Secretariat, he said. Amir Mughal, Asad Qaiser, Rehan Rajput, Ali Zaman and others are named in this case. Twelve accused appeared in court in this case and copies of challans were distributed to them, he said.In this case too, he said, very few accused appeared in court. The challans that we have submitted include the PTI leadership. The PTI leadership is not appearing in court. The accused in these cases are in the hundreds, but very few of the accused appear.Cases are being postponed so that a decision cannot be taken in the cases.The accused are aware that the trial is going on, but they deliberately do not appear in the courts.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}