{
  "article_id": "2025-07-31_257d757c1a693e35ba14d573e19a8668",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cto-imposes-full-ban-on-heavy-vehicles-loader-rickshaws-in-capital/",
    "retrieved_at": "2025-08-27T10:25:20.364Z"
  },
  "metadata": {
    "title": "CTO imposes full ban on heavy vehicles, loader rickshaws in Capital",
    "author": null,
    "date_published": "2025-07-31T15:07:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 278,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 31 (APP): Chief Traffic Officer (CTO) Captain (R) Syed Zeeshan Haider has imposed a complete ban on the entry of heavy vehicles, overloaded trucks and loader rickshaws into Islamabad. The sweeping measure, enforced across the federal capital, aims to eliminate the persistent problems of traffic congestion and fatal accidents caused by such vehicles. A police spokesman told APP on Thursday that the order was implemented as part of a broader initiative to upgrade the city's traffic management system and ensure the safety of citizens. He said that additional traffic personnel have been deployed on all major roads and intersections to regulate traffic and enforce the ban strictly. Vehicles found violating the new order will be impounded and legal action will be taken against the drivers. CTO Zeeshan added that the ITP has launched a zero-tolerance policy against all forms of traffic violations, including signal breaking, overspeeding, lane violations, and illegal parking. Offenders will face immediate fines, and in serious cases, their vehicles will be shifted to police stations. He said drone surveillance is being expanded to monitor real-time violations and ensure timely intervention. This tech-based monitoring system will strengthen road discipline and deter habitual violators. He said the Islamabad Traffic Education Unit has also been mobilized on main thoroughfares to educate commuters about traffic rules and safe road behavior. Senior officers will remain present in the field to personally supervise operations and assist the public. CTO Zeeshan Haider assured that all measures will be enforced without discrimination. \"Equal implementation of the law is our top priority. No violator-regardless of status-will be spared,\" he said, urging citizens to fully cooperate with traffic authorities for a safer Islamabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}