{
  "article_id": "2025-07-31_fd2ae17cc4d22af65be7f8143446e0bd",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-vows-to-root-out-terrorism-through-multi-pronged-strategy/",
    "retrieved_at": "2025-08-27T10:24:49.223Z"
  },
  "metadata": {
    "title": "PM vows to root out terrorism through multi-pronged strategy",
    "author": null,
    "date_published": "2025-07-31T16:09:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 513,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 31 (APP): Prime Minister Muhammad Shehbaz Sharif Thursday while chairing a review meeting of the Steering Committee on Counter-Terrorism and Establishment of the State Writ (Harden the State), expressed resolve to eradicate the scourge of terrorism from the country. Speaking during the meeting here, he said, \"The state of Pakistan is determined to root out the scourge of terrorism and the world recognizes our successful operations against terrorists\" \"The state of Pakistan has adopted a multi-pronged strategy in the war against terrorism,\" he said adding, \"Pakistan has made full and effective use of important elements such as ground operations, relevant legislation, meaningful public communication and discouragement of extremist thinking.\" The committee directed effective coordination between the federal and provincial governments against terrorism and strict implementation of its recommendations in this regard. \"The role of the brave sons of the armed forces in this war against terrorism is commendable and laudable,\" he remarked. He said, \"The entire nation, including me, is proud of the officers and officials who laid down their lives for the country and their families who were imbued with the spirit of sacrifice.\" \"The entire Pakistani nation, the brave forces, law enforcement agencies, and intelligence agencies are united and focused in the war against terrorism,\" he added. The prime minister said, \"Pakistan's brave forces fought the terrorists vigorously in Operation Radd-ul-Fasaad and Zarb-e-Azb, and the world recognized Pakistan's victory in the recent historic Marka-e-Haq.\" He acknowledged that the provincial governments, the Intelligence Bureau, the Ministry of Interior, the Counter-Terrorism Department, especially the Punjab Counter-Terrorism Department, had taken very effective steps in this war against terrorism. \"Pakistan is working on a comprehensive, effective and workable strategy to completely eliminate Fitna-al-Hindustan and Fitna-al-Khawarij and other such anti-social elements,\" he stressed. He said, \"With the joint strategy and cooperation of all the relevant institutions, effective operations were undertaken against smuggling, which made it possible to prevent the menace.\" \"Prevention of smuggling has had a positive impact on the economy,\" he noted. \"Only a peaceful and strong state structure free from terrorism restores the confidence of investors at the international level,\" he said adding, \"The government has brought revolutionary changes such as digitization of all systems and improvement in the tax system to restore the confidence of the investors at the international level.\" He said, \"Record increase in the Pakistan Stock Exchange and improvement in global ratings indicate the stability of Pakistan's economy and this will restore the confidence of foreign investors.\" \"The implementation of the repatriation programme for Afghan nationals residing illegally in Pakistan in accordance with international laws is continuing effectively,\" he observed. Deputy Prime Minister Muhammad Ishaq Dar, Field Marshal Chief of Army Staff Syed Asim Munir, National Security Adviser Lieutenant General Muhammad Asim Malik, Federal Minister for Information and Broadcasting Attaullah Tarar, Federal Minister for Law Azam Nazir Tarar, Federal Minister for Economic Affairs Division Ahad Khan Cheema, Adviser to the Prime Minister for Inter-Provincial Coordination Rana Sanaullah, Minister of State for Interior Talal Chaudhry, Chief Secretaries of all provinces, Inspectors Generals and relevant government officials attended the meeting.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}