{
  "article_id": "2025-07-31_0f7366ec7e40db96b1b10f944a64dca7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/bjp-not-only-initiated-a-public-slandering-of-kashmiris-but-has-institutionalized-it-altaf-wani/",
    "retrieved_at": "2025-08-27T10:26:48.662Z"
  },
  "metadata": {
    "title": "BJP not only initiated a public slandering of Kashmiris but has institutionalized it: Altaf Wani",
    "author": null,
    "date_published": "2025-07-31T06:06:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 208,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 31 (APP): Acting Chairman Jammu and Kashmir National Front Altaf Hussain Wani has strongly condemned Indian Home Minister's remarks slandering the Hurriyat platform, stating that the racist regime has not only initiated a public vilification campaign against Kashmiris but has institutionalized it. Talking to APP here on Thursday, Wani said the language used by the Indian minister reflects the deep-rooted prejudice and hatred harbored against Kashmiris. \"Labeling Hurriyat as a terrorist outfit is a reflection of the venomous mindset embedded in India's power hierarchy,\" he said, adding that such dangerous stereotyping is part of a broader campaign by the Indian government to delegitimize the Kashmiris' rightful struggle for self-determination. Reiterating that the ongoing movement in Kashmir is a legitimate struggle, the Front leader said the Hurriyat Conference is a representative platform that represents the aspirations of the vast majority of Kashmiris who have categorically rejected India's illegal occupation and refused to accept its dictates. Wani asserted that the Indian minister's baseless and absurd claims will not alter the ground realities. \"Kashmir a UN disputed territory must be resolved peacefully in line with the UN Security Council resolutions, which call for a referendum to enable the people of the region to determine their political future,\" Wani added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}