{
  "article_id": "2025-07-31_3147fcba61e2ab090f06fadf37f0e6ab",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cjcsc-meets-egyptian-president-defence-minister-commander-in-chief-grand-imam-of-al-azhar/",
    "retrieved_at": "2025-08-27T10:24:45.551Z"
  },
  "metadata": {
    "title": "CJCSC meets Egyptian President, Defence Minister, Commander in Chief, Grand Imam of Al-Azhar",
    "author": null,
    "date_published": "2025-07-31T16:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 226,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "RAWALPINDI, Jul 31 (APP): Chairman Joint Chiefs of Staff Committee (CJCSC) General Sahir Shamshad Mirza, NI (M) called on President of Arab Republic of Egypt Abdel Fattah el-Sisi, General Abdel Mageed Ahmed Abdel Mageed Saqr, Minister of Defence and Military Production and Commander-in-Chief of Egyptian Armed Forces, Admiral Osama Mounier Mohamed Rabie, Chairman and Managing Director Suez Canal Authority and Professor Dr. Ahmed Mohamed Ahmed El-Tayeb, Grand Imam of Al-Azhar. The CJCSC, who is on an official visit to Egypt for the 3rd round of Defence and Security Talks hold meetings with the military high up and dignitaries of Egypt, said a news release issued by Inter Services Public Relations (ISPR). Discussions focused on bilateral military cooperation, security, counter-terrorism and prevailing regional situation. Dignitaries from both sides emphasized upon the shared interest in further strengthening and expanding existing military-to-military relationship in the domains of training, joint military exercises and defence cooperation. While interacting with Professor Dr. Ahmed Mohamed Ahmed El-Tayeb, Grand Imam of Al-Azhar, CJCSC highlighted the importance of religious and inter-faith harmony to promote tolerance, inclusivity and address underlying causes of terrorism. The Egyptian dignitaries lauded the professionalism of Pakistan Armed Forces and acknowledged their sacrifices in the fight against terrorism. Earlier, upon arrival at Ministry of Defence, Chairman CJCSC was presented Guard of Honour by a smartly turned out contingent of Egyptian Armed Forces.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}