{
  "title": "Garbage burning becomes nuisance for Capital’s residents causing respiratory diseases",
  "link": "https://www.app.com.pk/national/garbage-burning-becomes-nuisance-for-capitals-residents-causing-respiratory-diseases/",
  "date_published": "2023-12-27T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): The residents of the federal capital are perturbed over increasing garbage burning as the air pollution was exacerbating in the metropolis causing respiratory diseases and other health complications.\nThe Islamabad Capital Territory Administration has imposed Section 144 on open waste burning in the federal capital on the request of the Pakistan Environmental Protection Agency (Pak-EPA) to control the spiking risk of smog due to deteriorating air quality.\nThe air quality as per the EPA report was unhealthy due to increased ratio of particulate matter of 2.5 microns (PM2.5) was beyond the permissible limits of the national environmental quality standards (NEQS).\nSueliman Agha, a resident of Sector G-7/1 told APP that during the evening hours, the ambiance of the city got murky after small heaps of garbage being set ablaze could be seen around the public parks and street junctions.\nHe added that most of the time either people or the sanitary staff put the garbage and dried leaves on fire for heating purposes or otherwise for getting rid of the waste.\nHe said this practice is extremely dangerous for the masses residing near to such locations especially children, elderly including heart patients and others.\nAgha demanded the authorities concerned to launch a massive awareness campaign and action against the perpetrators.\nFarha Rabbani, a resident of H-13 complained about the illegal plastic manufacturing units that were burning plastic items for recycling that were emitting dark smoke and causing severe problem for the masses as breathing issue and respiratory ailments were common in the locality.\nThe EPA had recently launched punitive action against plastic burning units in H-13 sector and imposed and sealed many of those units.\nHowever, the federal capital residents demanded the authorities concerned including civic agency and environmental watchdog to not only clamp down on the pollution creating sources but also start mass awareness campaigns on educating people on the hazards of waste burning.",
  "retrievedAt": "2025-08-11T11:15:08.612Z"
}
