{
  "title": "Interfaith unity celebrated on Christmas: Ashrafi acknowledges collaborative efforts across religions",
  "link": "https://www.app.com.pk/national/interfaith-unity-celebrated-on-christmas-ashrafi-acknowledges-collaborative-efforts-across-religions/",
  "date_published": "2023-12-27T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): Prime Minister’s Special Representative on Religious Harmony and Pakistani Diaspora in Middle East and Muslim Countries, Hafiz Muhammad Tahir Mehmood Ashrafi, on Wednesday, emphasized the spirit of unity and cooperation among all religious communities on the occasion of Charismas in the country.\nHolding a press conference here, he expressed gratitude and acknowledged the leaders and representatives of various faiths across Pakistan, commending their collaborative efforts in fostering interfaith harmony.\nAshrafi, who is also the Chairman of Pakistan Ulema Council specifically thanked the Christian community for actively participating in their religious ceremonies across the country, highlighting the unity displayed during these events.\nHe shed light on the nationwide manifestation of interfaith cohesion, exemplifying Pakistan as a country that embraces and respects all religions. He reiterated the commitment of Pakistan as a nation that upholds the principles of the Constitution, emphasizing that everyone is bound by the rule of law.\nIn a firm stance, Ashrafi stated, “Pakistan is a country that recognizes and respects all religions and sects. Our Constitution guarantees equal rights to all citizens, regardless of their faith.” He went on to express regret over the fact that some individuals wish to impose their ideologies on the nation.\nHowever, the Prime Minister’s Special Representative highlighted that the entire nation, irrespective of religious affiliations, collaborated with the Christian community, setting a remarkable example of interfaith harmony.\nHe reiterated the importance of unity, diversity, and mutual respect in the fabric of Pakistani society.\nExpressing disappointment over the dissemination of misinformation, Ashrafi highlighted the Ministry of Religious Affairs’ efforts in managing Hajj applications that exceeded the designated quota. He asserted that the Ministry was actively working to address these issues and find practical solutions.\nIn a broader context, he announced the establishment of Pakistan Peace Councils nationwide. These councils would foster interfaith harmony and collaboration, promoting unity and understanding among diverse religious communities, he added.\nAdditionally, the Prime Minister’s Special Representative said the Ministry of Religious Affairs had launched the Pakistan Hajj Application, providing guidance and information for pilgrims. He said this digital initiative was designed to ensure that Hajj participants receive the necessary support and guidance throughout their sacred journey.\nHe also addressed several critical issues, including the positive economic trajectory in Pakistan, the polio issue, and the humanitarian situation in Palestine.\nAshrafi acknowledged the positive developments in Pakistan and the establishment of the Special Investment Facilitation Council (SIFC) to facilitate foreign investment. He emphasized the significance of SIFC in providing essential facilities for external investments, highlighting its pivotal role in the country’s economic growth.\nOn the pressing issue of polio eradication, he mentioned a conference being held on Thursday under the supervision of Health Minister Nadeem Jan, involving scholars and religious leaders. He said special guest Caretaker Prime Minister Anwaar-ul-Haq Kakar, was expected to address the conference, where a joint Fatwa (religious decree) and declaration would be issued to emphasize the legitimacy of polio vaccination globally.\nAddressing concerns about delayed justice, Ashrafi, on behalf of the Pakistan Ulema Council, urged the immediate punishment of those involved in the May 9 incidents. Despite the available evidence against the culprits, he questioned the delay in taking action and called for swift justice against the perpetrators.\nTurning to the distressing situation in Palestine, Ashrafi revealed that Caretaker Prime Minister Anwaar-ul-Haq Kakar was engaged with leaders from all Islamic countries regarding the peace and ceasefire situation in Gaza.",
  "retrievedAt": "2025-08-11T11:15:06.561Z"
}
