{
  "title": "SNGPL disconnects 238 connections, imposes fine of Rs. 3.41 mln",
  "link": "https://www.app.com.pk/national/sngpl-disconnects-238-connections-imposes-fine-of-rs-3-41-mln/",
  "date_published": "2023-12-27T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP):Sui Northern Gas Pipelines Limited (SNGPL), in its ongoing crackdown against gas pilferers in Punjab, Khyber Pakhtunkhwa, and Islamabad, has disconnected  238 more connections and imposed a fine of Rs 3.41 million on pilferers.\nThe regional team in Lahore took action by disconnecting 26 connections due to illegal gas usage and 9 others for the use of compressors, imposing a fine of Rs 0.26 million in gas theft cases said a spokesperson of the SNGPL.\nThe team in Rawalpindi disconnected 4 connections due to illegal gas usage and another one for the use of a compressor.\nMeanwhile, the team in Islamabad disconnected eight connections for illegal gas usage.\nIn Multan, 3 connections were cut off due to illegal gas usage and another 10 for the use of compressors. In Peshawar and Karak, SNGPL disconnected 80 connections for the direct use of gas and imposed a fine of Rs 2.4 million against gas theft cases, also filing two FIRs against gas pilferers. In Sahiwal, one connection was disconnected due to illegal gas usage.\nIn Sialkot, the team disconnected two connections for illegal gas usage, imposing a fine of Rs 0.09 million against gas theft cases. In Sheikhupura, 35 connections were disconnected for illegal gas usage, with an additional 2 for the use of compressors, and a fine of Rs 0.03 million was imposed against gas theft cases.\nThe regional team in Sargodha disconnected 34 connections for illegal gas usage and another 20 for the use of compressors, imposing a fine of Rs 0.3 million against gas theft cases.\nIn Gujranwala, the team disconnected 2 connections for illegal gas usage, imposing a fine of Rs 0.33 million against gas pilferers. The team in Gujrat disconnected one connection due to illegal gas usage.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:15:50.384Z"
}
