{
  "title": "Research, pursuit of knowledge, key to overcome Pakistan’s current challenges: Solangi",
  "link": "https://www.app.com.pk/national/research-pursuit-of-knowledge-key-to-overcome-pakistans-current-challenges-solangi/",
  "date_published": "2023-12-27T10:46:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 27 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Wednesday said that research and pursuit of knowledge were imperative to overcome multiple challenges, currently faced by the country.\nDelivering the speech at Fourth Convocation of Information Technology University, he said nations did face challenges and Pakistan, with the grace of Allah Almighty, would also overcome multiple challenges being faced now.\nThe minister said that a country could develop only through the acquisition of knowledge and education.\nStressing the role of students in overcoming these challenges, he said it was necessary to end negative propaganda.\nThe motto of almost all the religions, was that humans should become good persons, Murtaza Solangi said adding that education promoted humanity and friendly attitude in the society.\nHe said Pakistan was facing diverse, unprecedented and extraordinary challenges including economic crisis, intolerant and violent behaviour. He said every day, impacts of climate emergency were being witnessed by everyone in the country.\nHe said another challenge was the diminishing hope in youth and younger generation.\nHe said with the passage of time, traditions were fading away in the society. Additionally, unbridled use of social media platforms has resulted in toxic, slanderous propaganda, full of lies and disinformation. He said it was unfortunate that those who upload total lies and fake information, get more viewers and and earn more money after monetization of their contents.\nAt the end, he read the prologue of a play ‘Exception in the Rule’ by German playwright Bertolt Brecht which elucidated the story of a rich merchant.\nIn the convocation, 524 students were awarded degrees while five students were awarded PhD degrees whereas 16 students were awarded gold medals.\nGovernor Punjab Balighur Rehman, Vice Chancellor ITU Professor Dr. Adnan Noor, Vice Chancellors of various universities, deans, faculty members and large number of students were present on this occasion.",
  "retrievedAt": "2025-08-11T11:15:38.269Z"
}
