{
  "article_id": "2025-07-28_f9ffade2f26e80ddd85ab227f6352679",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/court-directs-jail-authorities-to-allow-access-to-pti-founders-family-lawyers/",
    "retrieved_at": "2025-08-27T10:14:48.272Z"
  },
  "metadata": {
    "title": "Court directs jail authorities to allow access to PTI founderâs family, lawyers",
    "author": null,
    "date_published": "2025-07-28T15:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 343,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 28 (APP):The District & Sessions Court of Islamabad on Monday directed the superintendent of Adiala Jail to ensure legal access to Pakistan Tehreek-e-Insaaf (PTI) founder and his wife Bushra Bibi during the Toshakhana 2 case proceedings, following a petition filed by PTIas founder sister, Aleema Khan. Special Judge Central Shahrukh Arjumand issued instructions to the Adiala Jail superintendent to act according to the law on a petition filed by Aleema Khan, who challenged the jail administrationas refusal to allow her and PTIas founder legal team to attend court proceedings and meet the detained couple. During the hearing, Aleema Khanas counsel, Khalid Yousaf Chaudhry, appeared in court and argued that despite court orders, family members were denied entry into Adiala Jail. He further claimed that PTIas founderas legal team was also prevented from attending in-jail court proceedings, including in the Toshakhana, Cipher, and Al-Qadir Trust cases. The petition stated that the restrictions imposed by jail authorities were not only unnecessary but also illegal. It argued that barring access to family and legal counsel was a violation of the rights of the accused. It was also contended that denying access in the Cipher case raised questions over the fairness of the trial. The lawyer maintained that under Section 352 of the Criminal Procedure Code, trial proceedings should be open, and public access is a legal right. Citing Article 10-A of the Constitution, the petition emphasized that legal representation is a fundamental right. Aleema Khanas lawyer argued that there is no law restricting family members from visiting on hearing dates and called the denial of entry unconstitutional. He added that such actions compromise the transparency of the trial process. The court was informed that previous orders had already directed the jail administration to allow access to the family and legal representatives. However, these orders were allegedly ignored. After hearing the arguments, the judge directed the superintendent of Adiala Jail to act on Aleema Khanas petition in accordance with the law, ensuring that access is granted to the family and legal team during court hearings.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}