{
  "article_id": "2025-07-28_de63696547bb2f2a4ffe841bf39c021b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-for-effective-implementation-of-digital-transformation-plan-to-promote-transparency/",
    "retrieved_at": "2025-08-27T10:16:04.694Z"
  },
  "metadata": {
    "title": "PM for effective implementation of Digital Transformation Plan to promote transparency",
    "author": null,
    "date_published": "2025-07-28T09:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 28 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the federal government to hold meaningful consultations with provincial governments for effective and comprehensive implementation of the Digital Transformation Plan. Chairing a weekly review meeting on Cashless and Digital Economy here, the prime minister said digitalization of the economy will help promote transparency. The core objective of the Federal Government's Digital Transformation Plan is to provide ease and convenience to the public without any additional cost, he said adding that the government was encouraging digital payments and digital transfer of funds through policy measures. All provincial governments, including Gilgit-Baltistan and Azad Jammu & Kashmir, should fully cooperate with the federal government regarding the digitalization of the economy and cashless economy, the prime minister stressed adding that with the cooperation of provincial governments and institutions, the federal government's Digital Transformation Plan should be further streamlined to ensure targets are achieved within the set timelines. Meaningful consultation with all stakeholders should be made a permanent feature of this plan, the prime minister added. During the meeting, the prime minister was told that the National Digital Commission and the Pakistan Digital Authority had been established, and the necessary rules have been formulated. The appointment process of the Chairperson and Members of the Pakistan Digital Authority is in its final stages. Furthermore, it was informed that the Merchant Onboarding Framework for digital services was launched on July 25, 2025. The meeting was attended by Minister for Finance and Revenue Muhammad Aurangzeb, Minister for Economic Affairs Ahad Khan Cheema, Minister for Information Technology and Telecommunication Shaza Fatima, Minister of State for Finance and Railways Bilal Azhar Kayani, Chief Secretaries of all four provinces, Gilgit-Baltistan, and Azad Jammu & Kashmir, Chief Commissioner of Islamabad Capital Territory, and other senior government officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}