{
  "article_id": "2025-07-28_fae811d96e8d9b6668a42fd999f1db6b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ecp-rejects-barrister-gohars-claim-lawmakers-convictions-still-stand/",
    "retrieved_at": "2025-08-27T10:14:12.342Z"
  },
  "metadata": {
    "title": "ECP rejects Barrister Gohar’s claim: lawmakers’ convictions still stand",
    "author": null,
    "date_published": "2025-07-28T18:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 193,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 28 (APP): The Election Commission of Pakistan (ECP) on Monday categorically refuted PTI chairman Barrister Gohar Ali Khan's assertion regarding the status of three disqualified legislators, stressing that their convictions have not been set aside. In its official statement, the ECP made clear that the disqualifications of Senator Ejaz Chaudhry, MNA Ahmed Chattha, and Punjab Assembly Opposition Leader Malik Ahmed Khan Bhachar remain in full effect. \"Their convictions handed down by an anti-terrorism court still stand.\" The Election Commission of Pakistan (ECP) has clarified that Abdul Latif Chitrali's case stands apart from other convicted legislators. While Chitrali himself did not approach the Islamabad High Court, several of his co-accused in the May 9 case filed appeals. The Islamabad High Court subsequently overturned their convictions and ordered their release. Although Chitrali was not among the petitioners, the ECP noted that the ruling carries implications for individuals linked to the same proceedings. Accordingly, Abdul Latif Chitrali has been issued a notice to appear before the Election Commission of Pakistan to assist in determining whether the Islamabad High Court's decision regarding his co-accused in the May 9 case may extend to him as well.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}