{
  "article_id": "2025-07-28_3822f9806a4dcbec5aec98fda6ef2e5d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/seminar-held-on-peace-wings-from-victory-over-fascism-to-community-with-shared-future-for-mankind/",
    "retrieved_at": "2025-08-27T10:14:12.343Z"
  },
  "metadata": {
    "title": "Seminar held on ‘Peace – Wings from Victory over Fascism to Community with Shared Future for Mankind’",
    "author": null,
    "date_published": "2025-07-28T18:00:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 580,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 28 (APP):A high-level seminar titled \"Peace-Wings from the Victory over Fascism to a Community with a Shared Future for Mankind\", organized by the China Media Group (CMG) and Asian Institute of Eco-Civilization Research and Development (AIERD) here on Monday. The seminar was not only a means of highlighting China's sacrifices against fascism in World War II, but also aimed to promote world peace, international partnership, and the idea of \"a society with shared destiny.\" The seminar was attended by prominent government figures, diplomats, think tank experts, intellectuals, and media representatives, who praised China's leadership, foreign policy, and humanitarian global vision. On this occasion, Minister of State for Religious Affairs and Interfaith Harmony, Khel Das Kohistani, said in his address that the main pillars of China's foreign policy were tolerance, partnership and mutual respect, adding that China was not only resisted fascism by becoming an iron wall but also remains a powerful voice against injustice, oppression and exploitation today. He further said that Pak-China friendship was a high example of sincerity and mutual trust in the world. Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam said the sacrifices made by China for global welfare will be written in golden words in history. \"China has always promoted philanthropy, peace and justice. The concept of 'shared society' is a ray of hope for the present era, which based on the idea of connecting the world,\" she added. Former Defense Minister Lt. Gen. (retd) Naeem Khalid Lodhi emphasized, \"China's sacrifices in World War II are unforgettable. It is not only resisted against aggression but later showed the world community the path to peace, development and survival. China's determination is still the guarantor of international stability.\" President Institute of Regional Studies, former Foreign Secretary Johar Saleem said that China's role had become decisive in terms of global peace, prosperity and development. Its policies were leading the global system towards balance, transparency and partnership. Former Pakistani Ambassador to China, Moinul Haque, while highlighting China's peace-loving leadership, stated, \"China and Pakistan are not only strategic partners but also 'iron brothers' linked by hearts. China's brotherly attitude and determination to stand by Pakistan in every difficult time prove it to be a true friend.\" Shakeel Ahmed Ramey, CEO of the Asian Institute of Eco-Civilization, Research and Development, said people's welfare, mutual cooperation and equitable development had always been at the core of China's policies. China extended its hand of development and friendship without interfering in the sovereignty of any country globally, and also set exemplary examples on every front, from poverty alleviation to sustainable development. CEO of Pakistan China Institute, Mustafa Haider Syed said that China had sacrificed for mankind in every era. Its leadership had always prioritized global peace and stability. If we examine different periods of history, he said that China's humanitarian, balanced and long-term vision was evident at every stage. The participants appreciated China's partnership-based narrative and expressed their confidence in it. Many participants also recorded their feelings in writing on the \"Comments Wall\", praising China's global leadership, welfare initiatives and role in promoting peace. This seminar was not just an intellectual meeting but an expression of determination that the new challenges facing the world, such as extremism, unilateralism and oppression, could only be confronted with mutual cooperation, partnership and a shared vision of peace. This vision of China was not only commendable but also provides the foundation for a sustainable, just and peaceful world for humanity in the future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}