{
  "article_id": "2025-07-28_f731f289a389ef986c85e61f963cf016",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dr-furqan-hameeds-book-recep-tayyip-erdogan-the-tiger-of-the-islamic-world-launched/",
    "retrieved_at": "2025-08-27T10:14:12.334Z"
  },
  "metadata": {
    "title": "Dr. Furqan Hameed’s book ‘Recep Tayyip Erdogan – The Tiger of the Islamic World’ launched",
    "author": null,
    "date_published": "2025-07-28T17:44:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 435,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 28 (APP): National Language Promotion Department (NLPD), in collaboration with the Turkiye Azerbaijan Pakistan Friendship Forum (TAPF) and the Institute of Peace and Diplomatic Studies (IPDS), hosted a book launch ceremony for Dr. Furqan Hameed's new book titled \"Recep Tayyip Erdogan-The Tiger of Islamic World\" here on Monday. Esteemed guests included Federal Minister for Information and Broadcasting Attaullah Tarar, Ambassador of Turkiye to Pakistan Dr Irfan Neziroglu, Ambassador of Turkmenistan to Pakistan Atadjan Movlamov, Ambassador of Kazakhstan to Pakistan Yerzhan Kistafin, Deputy Head of Mission for the Embassy of Uzbekistan in Pakistan Zafar Akhmedov, Ambassador of Azerbaijan to Pakistan Khazar Farhadov, High Commissioner of the Republic of Rwanda to Pakistan, Fatou Harerimana, Dr Farhat Asif, the President of IPDS among others. In her address, Dr. Farhat Asif, President of IPDS, said that the launch of \"Recep Tayyip Erdogan-The Tiger of Islamic World\", authored by their esteemed friend and scholar Dr. Furqan Hameed, was not just a literary event but an occasion to reflect on the values of courage, leadership, unity, and vision-values that President Erdogan has come to symbolize for millions around the world. She thanked the Director General of NLPD and all collaborators for making the event successful, and expressed her gratitude to the distinguished guests and participants for their presence. In his address, Dr. Muhammad Saleem Mazhar, Director General of NLPD, said that the purpose of the ceremony was to acknowledge and encourage the efforts of a person who has worked to strengthen the ties between these two brotherly nations through his columns and writings. \"This recognition will help further solidify these ties. It was an important literary, academic, and cultural event which proved to be very successful,\" he added proudly. He concluded by thanking all the honored guests and attendees for their active participation. In his remarks, Dr. Furqan Hameed, Head of Urdu Service at TRT (Turkish Radio and Television Corporation), columnist, writer, and senior journalist, said that his book is a tribute to President Erdogan's leadership and constructive approach. He shared that Erdogan began his journey as the Mayor of Istanbul, transforming the city through modernization. Dr. Hameed added that Erdogan holds deep affection for Pakistan and often recites the poetry of Allama Iqbal, his favorite poet, at his public gatherings. He considers Pakistan his second home after Turkiye. \"This book will help further strengthen the bond between Turkiye and Pakistan,\" Dr. Furqan Hameed said, thanking all the distinguished guests for attending the launch. At the conclusion of the event, he presented copies of the book to Federal Minister Attaullah Tarar, the Ambassador of Turkiye, and other esteemed guests.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}