{
  "article_id": "2025-07-28_311e9e980814256cc47f849b913385f8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-awards-scholarships-research-grants-to-478-high-achieving-students/",
    "retrieved_at": "2025-08-27T10:15:52.138Z"
  },
  "metadata": {
    "title": "AIOU awards scholarships, research grants to 478 high-achieving students",
    "author": null,
    "date_published": "2025-07-28T12:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 324,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 28 (APP):Allama Iqbal Open University (AIOU) awarded merit scholarships and research grants to 478 outstanding students during a special ceremony held on campus, reaffirming its commitment to inclusive and high-quality education. Speaking at the event, Vice Chancellor Professor Dr. Nasir Mahmood praised the academic performance of the recipients and highlighted AIOU's achievement in securing the second position among over 2,000 Pakistani universities in the Times Higher Education Impact Rankings 2025 under Sustainable Development Goal 4: Quality Education. \"This global recognition reflects the university's dedication to academic excellence,\" Dr. Mahmood said, emphasizing the importance of improving educational standards across the country. A total of 439 students received Merit Scholarships, while 39 were awarded Research Grants during the ceremony organized by the university's Directorate of Student Advisory and Counseling Services. The Vice Chancellor noted that the scholarship recipients had all secured over 80% marks and were selected purely on a merit basis. AIOU currently offers scholarships under nine different categories, including for children of martyrs, transgender individuals, prisoners, persons with disabilities, and students from low-income backgrounds. Dr. Mahmood shared that the university has allocated Rs. 140 million for scholarships this year to expand educational access and support students in financial need. \"These scholarships are not just a reward for talent-they are a lifeline for many students who might otherwise not be able to continue their education,\" he said, congratulating the recipients and acknowledging the efforts of faculty and parents. Also addressing the ceremony, Professor Dr. Irshad Ahmad Arshad called the scholarship recipients a \"national asset\" and highlighted AIOU's efforts to promote inclusive education. \"To ensure that no student is deprived of education due to financial constraints, AIOU has launched a Student Support Fund,\" he said. \"We are currently offering free matric education in Balochistan, Gilgit-Baltistan, and the merged tribal districts.\" The event was attended by university faculty, principal officers, and students, who welcomed the university's continued efforts to provide equitable educational opportunities across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}