{
  "title": "National Savings obtained Rs 52 billion from fresh schemes by June 2",
  "link": "https://www.app.com.pk/national/national-savings-obtained-rs-52-billion-from-fresh-schemes-by-june-2/",
  "date_published": "2021-06-07T09:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP): Central Directorate of National Savings (CDNS) has received an increased investment of Rs 52 billion by June 2, of this Fiscal Years 2020-21 from the registered Premium Prize Bond of Rs 40,000 and Rs 25000 recently initiated by the institution.\nThe new registered Premium Prize Bonds of Rs 40,000 and Rs 25000 were registered by State Bank of Pakistan (SBP) and en-cashed only by the registered financial institution under the SBP, Senior Official of CDNS told APP here on Monday.\nIn the last one and a half years, investors have withdrawn Rs 588 billion after the suspension of the said bond by May 31st of current FY 2020-21, he informed.\nReplying to another question, he said, “We paid the encashment of Rs148 billion by May 31th of this month to the investors against the suspension of prize bonds of Rs 25,000.”\nHe said the federal government recently suspended the prize bonds of Rs 25,000 and had given a nine-month deadline to investors to en-cash their total savings of Rs 160 billion.\nThe senior official of CDNS said National Savings has paid Rs 148 billion to their customers in the 5 months and remaining 12 billion out of total Rs 160 billion would also be paid by September 30, 2021, he said.\nHe informed that the government has already canceled prize bonds of Rs 40,000 and CDNS repaid to the investors the encashment worth of Rs 258 billion in previous FY 2019-20.\nThe senior official said CDNS has opened new avenues for public and private investment to document the country’s economy and ensure transparency in the financial system.\nReplying to another question, he said the CDNS has received a fresh deposit of Rs700 billion in the last 11 months from July 1, to May 31, in the current fiscal year 2020-21.\nThe CDNS has set Rs249 billion annual collection target collection from July 1 to June 30 for the year 2020-21 as compared to Rs352 billion for the previous year’s 2019-20 to enhance savings and promote saving culture in the country, he said.\nThe CDNS had set Rs352 billion annual collection target for the year 2019-20 as compared to Rs350 billion for the previous year’s 2018-19, –he said.\nReplying to another question on current revision of CDNS certificate profit rates, he said the CDNS has maintained the same interest rate on the savings certificates investment due to the market situation and as per Pakistan Investment Bonds (PIB) policy decision.\nHe informed that the CDNS interest rates were linked with the policy of PIB, set by State Bank of Pakistan (SBP).",
  "retrievedAt": "2025-08-11T20:49:19.006Z"
}
