{
  "title": "FM urges functionaries to extend fruit of devolution of power to people: FM Qureshi",
  "link": "https://www.app.com.pk/national/fm-urges-functionaries-to-extend-fruit-of-devolution-of-power-to-people-fm-qureshi/",
  "date_published": "2021-06-07T10:52:00.000Z",
  "source": "APP",
  "content": "MULTAN, Jun 07 (APP): Foreign Minister Makhdoom Shah Mahmood Hussain Qureshi said that Pakistan Tehreek-e-Insaf (PTI) strongly believed in the devolution of power at grass-root level and urged the functionaries to serve the people to the best of their abilities.\nWhile addressing a ceremony to energize Nishtar hospital through solar power, Foreign Minister stated that the Punjab government should ensure physical presence of secretaries of south Punjab secretariat in Multan and Bahawalpur to address problems of the local people.\nBeing public representatives, it is our duty to facilitate local people in getting their issues addressed.\nQureshi urged CM Punjab to check the presence of secretaries in offices. How would officials resolve public problems in case they were not physically present in Multan and Bahawalpur or lacked powers required to address issues of the local people.\nThe secretaries should focus on solving the problems of people in south Punjab.\nHe lauded the simplicity and honesty of CM Punjab Usman Buzdar and stated that they wanted to see him (Buzdar) stronger and successful. PTI was very much focused on south Punjab.\nFM Qureshi recalled that a sum of Rs 4 billion was allocated for South Punjab secretariat and added that people wanted to know how much of it has been utilized. He said, Pakistan Tehreek-e-Insaf had promised to establish south Punjab province adding: “And we will emerge triumphant before the people.”\nForeign Minister Shah Mahmood Qureshi also lauded the efforts of Provincial Minister for Energy Dr Akhtar Malik for offering the facility to energize Nishtar hospital through Rs 46 million Retrofitting Project.\nThe project will help offer economical electricity to Nishtar hospital and it would save millions of rupees by conserving electricity.\nQureshi remarked that best planning can always save taxpayers money. Annually, there will be a saving of Rs 35 million at Nishtar hospital and Rs 17.5 million in case of Children Hospital, he added.\nureshi said that a huge benefit has been ensured at a small cost of Rs 81 million for the two projects. The cost of solar project at children hospital complex was Rs 35 million.\nQureshi said that the cost would be recovered in just two years and the electricity generation through these projects would be almost free of cost for the rest of their lifespan of 23 years.\nHe said that a people-friendly policies would always think of ways ensuring best utilization of taxpayers money. However, he lamented, the past government finalized costly agreements and it was very difficult to revise these agreements due to sovereign guarantees.\nHowever, the incumbent government was taking steps to shift focus from thermal to cheaper sources including hydel and solar energy. He hoped that it would surely help the government provide electricity at cheaper tariff to masses.\nQureshi also hinted that the government was working on 10 hydel projects which would be completed in next 10 years.\nPakistan possessed potential to produce 50,000 megawatts through hydel projects. Similarly, the country has enough sunlight for solar projects.",
  "retrievedAt": "2025-08-11T20:49:18.143Z"
}
