{
  "title": "Dire need to mend our ways in which we affect oceans, aquatic life: Naval Chief",
  "link": "https://www.app.com.pk/national/dire-need-to-mend-our-ways-in-which-we-affect-oceans-aquatic-life-naval-chief/",
  "date_published": "2021-06-07T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP): Chief of the Naval Staff, Admiral Muhammad Amjad Khan Niazi on Monday said there was a dire need to mend our ways in which we were affecting the oceans and aquatic life existing in them.\nIn his message on World Oceans Day, the Naval Chief emphasized that we could only protect the Earth’s ultimate source of life through joint efforts, a Pakistan Navy news release here received said.\nAdmiral Niazi said, “Today, on 8th of June 2021, we celebrate ‘World Oceans Day’, to focus on the maintenance and development of the oceans and coastal areas.”\nHe added that the oceans; a major source of sustenance of life on earth, act as lungs to our planet as they provide more than 50 percent of the oxygen produced on this planet.\n“They are also major absorbers of greenhouse gases and carbon dioxide. Thus, human activity on land is directly affecting the oceans and the life that flourishes within,” he underscored.\nThe purpose of World Oceans Day, celebrated globally under the ambit of UN, was to enlighten the world community regarding the impact of human actions on the oceans and to explore ways and means for their sustainable use and the marine resources we derived from them, the Naval Chief said.\nThe theme selected for World Oceans Day 2021 by UN is ‘The Ocean: Life and Livelihoods’. This offers an opportunity to explore the human life relationship with the oceans.\nHe said, “Oceans regulate our climate. Holding 97 percent of the water on earth, almost all rain that drops on land comes from the sea.”\nAdmiral Muhammad Amjad Khan Niazi said on the eve of World Oceans Day, we acknowledge the challenges that were eroding the integrity of our waters – pollution, marine invasive species, extreme climatic changes and threats to survival of marine species.\n“We depend on our oceans for food. Fishing alone, from catch to the consumer, produces not only food for billions of people but also creates millions of jobs worldwide. Nearly 15 percent of animal protein consumed by humans comes from marine fish.”\nHe explained that as the challenges to the ocean continued to grow, so did the need for novel solutions to fight these challenges.\nTo commemorate significance of the World Oceans Day, he said Pakistan Navy was playing a lead role in promoting safe and sustainable use of ocean resources.\nHe mentioned that some of the major Pakistan Navy initiatives included; beach cleaning, construction of harbour debris collection barges, intensified Mangroves plantation, banning use of destructive fishing nets, tackling oil pollution at sea and coordination with industrial community to reduce waste dumping into the sea.\nA number of events and activities have been arranged to highlight the spirit of the day and to raise awareness about oceans and their resources.\n“An active and forthcoming participation, with due regard to the prevailing COVID-19 situation, by all under Command will help promote the essence of the day,” the Naval Chief highlighted.\nAdmiral Niazi concluded that on this Day, let us re-affirm our commitment and resolve to reverse the damage done, and save our oceans from any further degradation.",
  "retrievedAt": "2025-08-11T20:49:13.524Z"
}
