{
  "title": "KJP helps physically impaired get job in int’l market: Usman Dar",
  "link": "https://www.app.com.pk/national/kjp-helps-physically-impaired-get-job-in-intl-market-usman-dar/",
  "date_published": "2021-06-07T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP): Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar has shared the story of physically impaired Abdullah, who got a job in the international market after getting six months training in a high-tech trade under the Hunarmand Pakistan (Skills for All) programme.\nThe SAPM, on his twitter handle, said,”Skills for All! A young man, who was unemployed and home-bound for several years due to his disability, has started earning thousands of dollars from international market.\nUnder the Kamyab Jawan Programme (KJP), scholarships are being given to the youth for trainings in modern and high-tech trades along with traditional ones. Alhamdulillah! Today Abdullah is a successful young man.”\nUsman Dar also posted a two-minute film documentary of Abdullah describing his success through the KJP.\nThe Hunarmand Pakistan was launched in the beginning of 2020 under the Kamyab Jawan Programme with Rs 10 billion seed money and set a target to train 50,000 each in high tech and traditional trades by end of the Fiscal Year 2020-21.\nAccording to Usman Dar, so far 170,000 young people have been given skill scholarships under the programme after release of massive funds in line with the instructions of Prime Minister Imran Khan.\nHe congratulated Abdullah on becoming a successful freelancer of the international market and said the young man had become an example for the youth.\nUsman Dar urged them to get rid of unemployment by getting trained in high trades under the programme.\nAbdullah, in his video, explained his journey to the international market and said he was now earning dollars through online job.\nHe said he entered the international market after getting a six-month training course in graphics designing under the Hunarmand Pakistan.\nAbdullah appreciated Prime Minister Imran Khan and the KJP team for launching the programme.",
  "retrievedAt": "2025-08-11T20:49:15.557Z"
}
