{
  "title": "MoST working day and night on manufacturing of EVM as per ECP requirements:Shibli Faraz",
  "link": "https://www.app.com.pk/national/most-working-day-and-night-on-manufacturing-of-evm-as-per-ecp-requirementsshibli-faraz/",
  "date_published": "2021-06-07T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 07 (APP): Federal Minister for Science and Technology, Shibli Faraz Monday said his ministry was working day and night on the task of manufacturing of Electronic Voting Machine (EVM) as per the requirements of Election Commission of Pakistan (ECP).\nHe was speaking at a news conference held outside ECP along with the Federal Minister for Information, Broadcasting and National Heritage, Chaudhry Fawad Hussain, Advisor to Prime Minister on Parliamentary Affairs, Dr. Babar Awan and Adviser to the Prime Minister on Interior and Accountability, Mirza Shahzad Akbar.\nThe federal minister stated that the local manufacturing process of EVM would be completed within a few weeks.\nHe thanked ECP for extending cooperation through providing their all necessary requirements to the Ministry of Science and Technology for incorporating the required features in the EVM.\nShibli hoped that the next elections will be conducted through EVM without any controversy as per vision of Prime Minister, Imran Khan\nShibli Faraz termed use of technology as indispensable for ensuring free, transparent and credible elections in the country as per vision of the Prime Minister, Imran Khan.\nThis would strengthen democracy and allow only those people to enter parliament who could represent the masses in true sense.\nFollowing the vision of Prime Minister, Imran Khan to ensure transparent election, a committee comprising officials of three ministries was formed including Ministry of Information Technology which is looking into the matters related to i-voting, Ministry of Law working on the related law and Ministry of Science and Technology working on manufacturing of EVM.\nTo a question regarding cost of EVM, Shibli Faraz said the cost of EVM cannot be measured at this stage as many of the features are yet to be incorporated in it.\nTo another question regarding train incident in Ghotgi, the minister said that such incidents should not happen.\nHe said train accidents occur in the developed countries too but rarely but in Pakistan ratio of such incidents is more comparatively which is matter of concern.\n“We have to use technology in our Railways sector too to avoid such incidents”, he added.",
  "retrievedAt": "2025-08-11T20:49:21.523Z"
}
