{
  "title": "Opposition parties not to be furnished NRO at any cost: Murad",
  "link": "https://www.app.com.pk/national/opposition-parties-not-to-be-furnished-nro-at-any-cost-murad/",
  "date_published": "2020-10-22T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): Minister for Communication and Postal Services Murad Saeed Thursday said no national reconciliation ordinance (NRO) would be given to the opposition parties at any cost rather to make them accountable for looting the national wealth.\nAddressing the press conference here, he said the opposition had sought the NRO in writing from the Prime Minister Imran Khan.\nHe said the opposition parties even linked their support with Financial Action Task Force (FATF) related legislation for the provision of NRO. The opposition created hurdles in the passage of FATF related legislation when it did not furnish the NRO, he said.\nThe minister said the FATF specific legislation was aimed to get Pakistan out of the grey list.\nHe said Nawaz Sharif was an absconder and a certified corrupt person who was propagating the narrative of country’s enemies.\nPanama Papers was a global scandal and Nawaz Sharif was caught red-handed in it resulting his disqualification by the court of law, he said.\nComing hard on the opposition parties, Murad Saeed said the opposition parties had started targeting the national institutions after failing to get the NRO.\nThe Pakistani nation would never forgive such people who looted the national exchequer through money laundering and fake accounts, he said.\nThe minister said the past rulers had left the national economy in the intensive care unit and the incumbent government succeeded to stabilize it after the untiring efforts.\nHe said Pakistan had achieved surplus in the current account after a hiatus of 17 years.\nThe developed countries with strong economies remained helpless during the coronavirus pandemic, he added.\nHe said Pakistan had devised an effective strategy to cope with the COVID-19 pandemic which was highly appreciated and acknowledged by the world.\nHe said India was targeting Pakistan’s four sectors including national security institutions, China Pakistan Economic Corridor, creating civil unrest in the country and Kashmir through false propaganda.\nThe Indian media had also started a campaign against Prime Minister Imran Khan as he had exposed the real face of fascist Modi before the international community and effectively pleading the Kashmir cause at the United Nations General Assembly, he said.\nHe said Kashmir issue discussed thrice at the United Nations platform after the gap of 54 years.\nThe minister also appreciated the nation for effectively countering Indian propaganda on the social media.\nPaying rich tribute to the personnel of law enforcing agencies, he said they rendered supreme sacrifices for the maintenance of peace besides curbing menace of terrorism.\nPakistan had successfully defeated the war on terror and now, it was known as one of the best tourism destination on the globe, he added.",
  "retrievedAt": "2025-08-11T19:55:49.430Z"
}
