{
  "title": "Multi-sectoral cooperation vital for cyber security: Fawad",
  "link": "https://www.app.com.pk/national/multi-sectoral-cooperation-vital-for-cyber-security-fawad/",
  "date_published": "2020-10-22T14:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): Federal Minister for Science and Technology Chaudhry Fawad Hussain Thursday underlined the need for enhancing multi-sectoral cooperation to ensure cyber security.\nHe was chief guest at the closing ceremony of “IEEE 1st Annual International Conference on Cyber Warfare and Security (ICCWS) 2020” was virtually hosted by National Centre for Cyber Security (NCCS) held here at Air University.\nSpeaking on the occasion, the minister said that there was a\ncompelling case for public and private sectors to work together with a view to\nresponding to cyber vulnerabilities.\nHe emphasized that such cooperation in addressing cyber challenges was vital. “Through public and private partnership, we can manage the risks arising from malicious use of cyberspace,” the minister highlighted.\nAir Marshal (Retd.) Javaid Ahmed HI(M), Vice Chancellor Air University in his\nclosing speech highlighted that confidence in the security of our digital lives was\nmore and more important.\nHe thanked all national and international conference participants including Wajeeha Ikram Parliamentary Secretary from Ministry of Education, Senator Rubina Khalid, CEO Ignite Syed Junaid Imam, Athar Osama, CEO Havelsan Turkey Dr. Mehmet Akif Nacar, CEO Security Code Russia Andrey Golov , CEO Ebryx Ahrar Naqvi , Dr. Fred Baker from ICANN USA, Prof. Siraj Sheikh from UK, Prof. Olaf Maennel from Estonia, Prof Vern Paxon from USA, and Ms. Jean Daka from Belgium.\nEarlier, Director NCCS Prof. Dr. Kashif Kifayat, highlighted that cyber threats do\nnot respect national borders, so it is not enough to solely address these threats at\nnational level.\nInternational collaboration is a must to address cyber risks.\nHe said that NCCS would continue to organize such events to spread awareness about cyber security as part of its mandate.\nTwo days conference offered a great opportunity to conference attendees to learn\nfrom prominent keynotes, CEOs Speeches, Tech Talks, Panel Discussions,\nWorkshops and Paper Presentations.\nMore than two thousand people from different walks of life attended different parallel sessions and tracks of online conference.",
  "retrievedAt": "2025-08-11T19:55:51.574Z"
}
