{
  "title": "Opposition trying to divert attention from real issue of Quaid’s Mazar desecration: Shibli",
  "link": "https://www.app.com.pk/national/opposition-trying-to-divert-attention-from-real-issue-of-quaids-mazar-desecration-shibli/",
  "date_published": "2020-10-22T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 22 (APP): Federal Minister for Information and Broadcasting Senator Shibli Faraz Thursday told the Senate that the opposition was trying to divert attention from the real issue – violation of the sanctity of the Quaid’s Mausoleum by the son-in-law of former prime minister Nawaz Sharif.\nSpeaking on the resolution moved by Leader of Opposition in the Senate Raja Zafar ul Haq, the minister said it was ironic that the political party named after the party of Quaid-e-Azam Muhammad Ali Jinnah was trying to do politicking instead of remorse on the incident.\nThe person, who had caused disrespect to the Quaid was son-in-law of Pakistan Muslim League-Nawaz chief.\nRaja Zafar ul Haq had moved the resolution that the House should condemn the arrest of Safdar Awan (son-in-law of Nawaz Sharif).\nShibli Faraz said Sindh Chief Minister Murad Ali Shah had admitted that the sanctity of the Quaid’s Mazar was violated, but the incident was being politicized instead of being condemned.\nHe said the House should better have a debate on the desecration of the Quaid’s Mausoleum and should suggest some punishment for the accused.\nThe Pakistan Peoples Party, which was running the government in Sindh, was responsible for such incidents, he added.\nThe minister said such people were causing damage to national interests as the neighboring country was using such incidents for anti-Pakistan propaganda. “Pakistan should be our top priority and not the personalities,” he added.\nMinister for Law and Justice Senator Faroogh Nasseem also condemned the desecration of the Quaid’s Mausoleum by Safdar Awan.\nHe stressed that after a thorough debate the House should determine punishment for those who were involved in disrespecting the Quaid’s Mazar.\nLeader of the House Dr Shahzad Waseem said two inquiry committees had been constituted to probe the incident of Safdar Awan’s arrest. He called for ensuring the rule of law and making all the facts public.\nSenate Chairman Sadiq Sanjrani referred the matter to the Standing Committee on Law and Justice.",
  "retrievedAt": "2025-08-11T19:55:49.427Z"
}
