{
  "article_id": "2025-08-10_5a054680905e72e8f4edca61efe84465",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-lauds-minorities-role-in-national-progress/",
    "retrieved_at": "2025-08-17T19:57:11.270Z"
  },
  "metadata": {
    "title": "NA Speaker lauds minorities’ role in national progress",
    "author": null,
    "date_published": "2025-08-11T03:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 304,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 10 (APP): National Assembly Speaker Sardar Ayaz Sadiq on Sunday lauded the role of minorities in Pakistan's development and progress, describing their contributions as exemplary. In his message on National Minorities Day, observed annually on August 11, the Speaker reaffirmed that the Constitution of Pakistan guarantees equal rights and complete religious freedom to all minorities residing in the country. He said that minorities living in Pakistan have always played a significant role in promoting national stability, interfaith harmony, and national unity. He remarked that the contribution of minorities to national affairs is a testament to the vibrancy of our democratic traditions. Speaker said that August 11, reminds us of the historic address delivered by Quaid-e-Azam Muhammad Ali Jinnah to the Constituent Assembly in 1947. In his speech, he clearly stated that all citizens of Pakistan, regardless of their religion, caste, or ethnicity, have equal rights and complete freedom to live according to their religious beliefs and practices. Acknowledging the services of minority representatives in Parliament, NA Speaker stated that their inclusion reflects the strengthening of democratic values in Pakistan. He said that minority Members of Parliament are rendering valuable services in legislation and public welfare. He further emphasized that the current Parliament is fully committed to ensuring the protection of minority rights and to taking effective measures for their welfare, in line with the vision of Quaid-e-Azam Muhammad Ali Jinnah. Deputy Speaker National Assembly, Syed Ghulam Mustafa Shah, in his message on National Minorities Day, stated that the minority community is playing a vital role in Pakistan's progress and prosperity. He said that minorities residing in Pakistan enjoy complete freedom to live in accordance with their religion and beliefs. He stressed that for a peaceful and strong Pakistan, it is essential for people of all faiths to embrace tolerance, harmony, and unity.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}