{
  "title": "Senate body to examine delegated legislation over Ministry of Education",
  "link": "https://www.app.com.pk/national/senate-body-to-examine-delegated-legislation-over-ministry-of-education/",
  "date_published": "2023-03-03T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP): The Senate Functional Committee on Delegated Legislation, under the Chairmanship of Senator Mian Raza Rabbani, convened on Friday would examine the delegated legislation of selected attached departments of the Ministry of Federal Education & Professional Training.\nAfter a thorough examination, the committee presented a rigorous report, raising various queries regarding regulations, said a press release.\nDuring the meeting, the committee discussed the Islamabad Capital Territory Private Educational Institutions (Registration and Regulation) Act, 2013.\nThe committee members noted that the Private Educational Institutions (Registration and Fee Determination) Rules, 2016 were challenged by private educational institutions through a writ petition, and the Islamabad High Court declared several sub-rules ultra vires to their parent act, including the schedule II of the rules.\nThe Ministry assured the committee that draft rules will be forwarded to Ministry of Law for input within one week to which the Secretary, Ministry of Law assured the Committee that opinion will be given on such rules within one week. The committee gave timelines to both Ministries to complete the said task.\nThe committee also raised a query about the status of the Federal Board of Intermediate and Secondary Education Employees Service Regulations, 1989, which apparently had not been repealed by the Federal Board of Intermediate and Secondary Education Employees Service Regulations, 2005. The officials were not able to provide a satisfactory reply to the queries. The committee expressed its reservation about the unpreparedness of the officers.\nThe National Vocational and Technical Training Commission Act, 2011, and the National Vocational and Technical Training Commission Employees (Service) Regulations, 2018, were also examined during the meeting. The committee pointed out that the provisos of some rules were in contradiction with the regulations of 2018, and queries were raised about regular, contract, and probation periods. The DG NAVTTC assured that a report would be provided within ten days.\nOverall, the meeting was productive, and the committee’s rigorous analysis and inquiries will lead to further improvements in subordinate legislation.\nThe Committee meeting was attended by Senators, Dr Mehr Taj Roghani, Rubina Khalid, and Senator  Keshoo Bai, Secretary Law, Officials from Ministry of Federal  Education and its various attached departments.",
  "retrievedAt": "2025-08-11T06:15:32.949Z"
}
