{
  "title": "AJK President seeks world’s urgent attention towards worsening human rights situation in IIOJK",
  "link": "https://www.app.com.pk/national/ajk-president-seeks-worlds-urgent-attention-towards-worsening-human-rights-situation-in-iiojk/",
  "date_published": "2023-03-03T18:07:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK) Mar 03 (APP): Azad Jammu and Kashmir President Barrister Sultan Mehmood Chaudhry on Friday urged upon the international community to play its much-needed due role to stop bloodshed and human rights violations committed by Indian occupation forces in Indian illegally Held Occupied Jammu and Kashmir.\nHe expressed these views while talking to a delegation of members of the California State Assembly, wherein he underlined that, owing to their best track record on human rights, the United States could play an important role in preventing rights abuses in the restive region and resolving the lingering Kashmir issue.\nStressing the need for an early and amicable settlement of the Kashmir imbroglio, the AJK president said that former US president Bill Clinton had termed Kashmir as the world’s most dangerous conflict.\nGiven the highly volatile situation in the region, he said that it was imperative that the influential world governments should play their due role to settle the long pending dispute peacefully.\n“Pakistan and India are both nuclear powers,” he said, adding that any misunderstanding between the two countries could be a prelude to a major war that could threaten the peace of the entire world.\n“The international community, especially the United States, should play its role in solving the Kashmir problem,” he maintained.\nOn this occasion, the members of the California State Assembly, Mr. Chris Holden, Wendy Carrillo, Mike A. Gipson, Melanie Holden, Anna Goddard, Willie Armstrong, Dr. Asif Mehmood, Khalid Mehmood, Akbar Mehmood, Khalid Nazir, Muhammad Ilyas, Farooq Malik, Amir Khan, Sana Khan and others were also present.\nBarrister Sultan Mehmood Chaudhry thanked the members of the Californian Assembly for their visit to Kashmir.\nHe urged the visiting delegates to use their political and diplomatic clout to help stop the bloodbath of innocent civilians at the hands of Indian forces in Occupied Kashmir.\nThe visiting delegates assured the AJK President that they would raise their voice in support of the Kashmiri people’s right to self-determination at all available forums.",
  "retrievedAt": "2025-08-11T06:15:39.347Z"
}
