{
  "title": "President for integrating differently-abled in regular school system, tailored jobs",
  "link": "https://www.app.com.pk/national/president-for-integrating-disabled-in-regular-school-system-tailored-jobs/",
  "date_published": "2023-03-03T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP): President Dr Arif Alvi on Friday stressed an inclusive approach towards the persons with disabilities in all areas of life particularly education to help them make active members of society.\nExcept for a few mental disorders, he said, the system should accommodate the differently-abled children in regular schools and provide tailor-made jobs to them in accordance with their skill set.\nAddressing the 5th Cerebral Palsy Conference here at Pakistan Institute of Medical Sciences (PIMS), he said physically and mentally challenged children needed care and empathy from the society and also the readiness to accept them as any other child.\nCerebral palsy is a group of disorders that affect a person’s ability to move and maintain balance and posture.\nPresident Alvi said the persons with physical, visual and hearing impairment had the same intellectual capacity as other people and thus needed support by the society to help them function better.\nThe president emphasized raising awareness in the society to be empathetic towards the persons with physical and mental weaknesses.\nHe regretted that the children with cerebral palsy are often stereotyped and called for shunning taboos affiliated with them.\nHe mentioned that First Lady Samina Alvi through awareness campaigns put her best efforts in highlighting the cause of persons with disability besides stressing facilities for them at public places.\nPresident Alvi said training of doctors was very important for taking curative measures, adding that good professional training with the help of technology could help the health experts play their due role in mainstreaming the persons with disabilities.\nThe president recalled that the country’s visually-impaired diplomat Saima Saleem effectively represented Pakistan at the United Nations and delivered a speech using braille.\nHe also laid focus on preventive treatment to reduce rate of malnutrition, stunting and maternal mortality. In this regard, he said, educating the masses and the role of midwives was important.\nHe expressed confidence that the conference would help raise consciousness about cerebral palsy.\nPresident Pakistan Academy of Cerebral Palsy Professor Javaid Iqbal said cerebral palsy affects two out of 1,000 children and causes multiple physical, mental and other problems.\nHe said the academy aimed at creating interdisciplinary forum to improve communication and teamwork in providing services and care for children with cerebral palsy.\nExecutive Director PIMS Muhammad Naeem Malik said PIMS since its inception was providing treatment to the people and approximately one million people annually get treatment in the hospital.\nThe children with cerebral palsy performed a tableau on a song sung by a child with the same disorder.\nThe president gave away appreciation shields among the foreign delegates who participated in the conference. The representatives from Russia, Brazil, Netherlands, Sri Lanka, Egypt and UAE attended the event.",
  "retrievedAt": "2025-08-11T06:15:54.321Z"
}
