{
  "title": "World Wildlife Day celebrated in Gilgit",
  "link": "https://www.app.com.pk/national/world-wildlife-day-celebrated-in-gilgit/",
  "date_published": "2023-03-03T12:07:00.000Z",
  "source": "APP",
  "content": "GILGIT, Mar 03 (APP): The World Wildlife Day was celebrated in Gilgit to raise awareness of the mountain ecosystem of Gilgit-Baltistan and the protection of wildlife among students.\nIn this regard, the World Wildlife Fund-Pakistan (WWF-Pakistan) in collaboration with Gilgit-Baltistan Forest, Wildlife Department and Snow Leopard Foundation organized an event at Fatima Jinnah Degree College for Women, Gilgit on Friday.\nThe purpose of the event was to raise awareness of world’s forests and woodlands and preservation of the millions of livelihoods that depend directly on them, with a particular attention to traditional knowledge of the communities who have managed forest ecosystems and wildlife.\nA short documentary film was screened highlighting the snow leopard protection and conservation of Himalayan ibexes.\nMeher Angaz, Principal Fatima Jinnah Degree College for women Gilgit welcomed the guests and emphasized on the students to play their role for a better mountain ecosystem.\nChief Conservator, Forest and Wildlife Department GB gave a detailed presentation on the current wildlife situation in GB and how the community-based trophy hunting program is contributing in the region.\nArt and painting gallery was embellished with wildlife paintings made by the fine arts department students of the college.\nRaja Zikriya Maqpoon, minister for wildlife, forest, parks and environment for GB, was the chief guest at the event. In his speech, he appreciated the collaborative efforts of public-private partnership for the protection of wildlife.\nThe chief guest also inaugurated the nature club at the college established with the support of WWF-Pakistan and FCDO. Speaking on the occasion, he said GB has mighty mountains, renowned glaciers, flora and fauna and a diverse landscape. “All we need is to preserve and protect them for our future generations,” he added.\nHaider Raza Director North, WWF-Pakistan said they would continue efforts for a healthy environment in line with the SDGs and thirty more nature clubs will be established in different schools of GB.\nAhsan Pirzada, Secretary Forest, Wildlife, Parks and Environment GB assured his full support for the youth of GB to facilitate them in the field of wildlife and forestry. He said, scientific research is a need of time and youth need to adapt wildlife as career.\nPlantation activity was also held at the end of the event. High dignitaries, teachers, students and media persons participated in the plantation drive.",
  "retrievedAt": "2025-08-11T06:15:38.877Z"
}
