{
  "title": "Nature-based solutions help better adapt, protect more lives: Speakers",
  "link": "https://www.app.com.pk/national/nature-based-solutions-help-better-adapt-protect-more-lives-speakers/",
  "date_published": "2024-02-17T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 17 (APP):The speakers Saturday called for integrating anticipatory disaster risk reduction (DRR) and climate change adaptation (CCA) approaches with climate science to make sure that more lives are protected from climatic disasters.\nSpeaking at a panel discussion organized at the World Social Forum in Kathmandu on Saturday by Pakistan’s leading think tank ‘Sustainable Development Policy Institute (SDPI) and Oxfam in Pakistan, the speakers said that the incidence of climatic hazards and disasters are increasing which plunged communities into vulnerability to disasters and are causing losses and damages, said a press release.v\nSpeaking on the occasion, globally acclaimed climate justice expert Harjeet Singh said that the temperatures are the determining factor of climate change which calls for analyzing science for better adaptation and preparing communities against climatic hazards and disasters. He called upon the humanitarian sector to keep in mind the future warming levels and slow on-set disasters while designing humanitarian programmes.\nHe said the communities know much about the impacts of climate change such as glacier melting, changing cropping patterns, and water availability but they do not know why this is happening. He said that science gives the ‘why’ answer.\nHe said while climate change is creating new poor with more marginalities, there is a need to opt for nature-based solutions for adaptation. He called for integrating humanitarian approaches with science.\nThe Deputy Executive Director of SDPI Dr. Shafqat Munir said that climatic hazards are now putting cities and towns at risk urging the need for risk-sensitive urban planning through applying both Disaster Risk Reduction (DRR) and Climate Change Adaptation (CCA) strategies. He said preparedness and anticipatory DRR approaches can better equip vulnerable communities at local levels to cope with ensuing disasters/climatic hazards.\nThe localization of DRR-CCA strategies and implementation plans can help to save and protect more lives. He called for taking urgent collective action to achieve the Paris Agreement’s objective on the Global Goal on Adaptation and Sendai Framework for DRR.\nOxfam’s regional humanitarian coordinator Mr. Jermaine, from the Philippines, said that effective climate action requires a balanced approach, considering both adaptation and mitigation efforts. Similarly, there is a need to ensure equity, right, and justice in line with the Global Goal on Adaptation (GGA) framework that prioritize fairness and equitable adaptation strategies, he added.\nQuoting from Cyclone Hayan 2013, he said due to inappropriate early warning messaging, the communities could not prepare against the Tsunami. He said that there is a need to train communities on DRR and early warning messaging should be clear.\nProgramme Manager ARTS Foundation, Saira Falak narrated the losses and damages that occurred in Pakistan during the floods in 2022. She mentioned about the plight of women and girls saying that during the emergency, the women lost their livelihood and plunged into further poverty.\nShe said that there is a need to build the capacity of women on disaster risks and preparedness. She spoke about the non-traditional losses that impact people and the economy badly.\nCivil society expert from Nepal, Ram Sharan Sedhai said disaster creates, perpetuates, and aggravates poverty which renders people more vulnerable to disasters and weakens their coping strategies. Once hit by a disaster, the community needs resources, time, and patience to recover from the impacts.\nQuoting from the Nepal’s 2015 earthquake, he said political will power and stability have far-reaching impacts on decisions regarding saving lives. He called for training the first responders, such as local youth, police, elected representatives, and government.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:45:10.264Z"
}
