{
  "title": "Pakistan envoy to US calls on world to resolve Kashmir dispute, terms it ‘core issue’ of enmity with India - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan’s envoy to the United States has called on the global community to resolve the Kashmir dispute, terming it the “core issue” of the recent complete breakdown of ties with India in the wake of the Pahalgam attack.\n\nThe April 22 attack in Pahalgam killed 26 people, mostly tourists, in one of the deadliest assaults since 2000. India has implied cross-border links without evidence, while Pakistan has rejected the claim and called for a neutral probe.\n\nTensions have since spiked, with Pakistan reinforcing its forces as it expected an incursion and India’s premier granting “operational freedom” to his military. As temperatures remain high, with the military warning of a “ resolute” response to any misadventure by New Delhi, diplomatic channels have remained engaged to prevent conflict.\n\n“It could be an important part of President [Donald] Trump’s legacy to attend to this situation — not with a Band-Aid solution, but by addressing the core issue: the Kashmir dispute,” Pakistan’s Ambassador to the US Rizwan Saeed Sheikh said in an interview with Fox News Digital published earlier today.\n\n“This is one nuclear flashpoint,” the envoy said.\n\nSheikh’s statement echoes his recent call to Trump to step in and help ease soaring tensions with India. He had highlighted that as a president “standing for peace in the world as a pronounced objective during this administration”, there was no “higher or flashier flashpoint” than the Kashmir issue.\n\nTrump, in his inaugural speech as the US president, had said: “My proudest legacy will be that of a peacemaker and unifier.”\n\nA ceasefire — which has since been broken — was secured between Israel and Hamas following Trump’s election, and he has also been engaging with Ukraine and Russia to halt their war.\n\nDuring his interview with Fox News, Sheikh also called on nations around the globe to help with a lasting settlement to the Kashmir issue.\n\nHe said: “Previously, when the situation has been at this level or the tensions have escalated, the international community has attended to the situation, but taken their eyes [and] attention away, even before the situation could fully defuse.\n\n“This time, perhaps it would be […] timely in terms of the situation elsewhere on the globe, with similar instances, […] to perhaps not afford a Band-Aid solution, but to address the broader problem.”\n\n“Any misadventure or miscalculation can lead to a nuclear interface,” the ambassador was quoted as saying. “That is certainly not desirable in such a densely populated region.”\n\n“We want a peaceful neighbourhood,” Sheikh emphasised, adding that Pakistan did not want any instability in the region.\n\nHowever, he stressed, Pakistan’s desire for peace “should not in any way be misconstrued as a sign of weakness”. “We want peace with dignity.”\n\nSheikh described India’s response to the Pahalgam attack as dangerously premature and inflammatory, according to the report.\n\nThe envoy reiterated Prime Minister Shehbaz Sharif’s offer to hold a “neutral and transparent” probe into the Pahalgam attack. He pointed out that both the investigation offer and Pakistan’s request for evidence linking it to the attack had gone “unanswered”.\n\n“Within minutes of the attack, India began levelling accusations against Pakistan,” he said, noting that a post-investigation report was filed just 10 minutes after the incident occurred, despite the remote and rugged terrain near the scene.\n\nThe ambassador warned that the region was once again being held “hostage to the war of hysteria” by India’s government and media, who immediately “began beating war drums”.\n\nOn the allegations implied by India, which has not yet named Pakistan or any entity directly, Sheikh said the suspects were reportedly Indian nationals whose homes have already been raided.\n\nHe questioned why India is looking outside its borders rather than addressing “administrative inadequacies” in occupied Kashmir. He slammed India’s broader policies in held Kashmir, including the alleged settlement of non-residents into the region.\n\nSpeaking about India’s unilateral suspension of the Indus Waters Treaty, Ambassador Sheikh said: “That is as grossly illegal as it can get. This is one treaty that has withstood wars between India and Pakistan.”\n\nLaw Minister Azam Naz­eer Tarar said yesterday that Pakistan’s final response to India’s letters on the IWT would be crafted in consultation with all relevant ministries, including foreign affairs, water resources and law.\n\nMinister of State for Law and Justice Barrister Aqeel Malik has also said Islamabad would approach international forums, including the World Bank that brokered it, regarding the treaty’s suspension.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/031215072bf4cab.png",
  "retrievedAt": "2025-08-23T08:12:59.212Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908173/pakistan-envoy-to-us-calls-on-world-to-resolve-kashmir-dispute-terms-it-core-issue-of-enmity-with-india",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T08:14:36.000Z"
}
