{
  "title": "Two die, 24 injured in rain, windstorm: Punjab PDMA - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Provincial Disaster Management Authority (PDMA) on Friday announced that two persons died and 24 others were injured due to windstorms and rain in different cities of Punjab during the last two days.\n\nThe PDMA also warned of more rain and thunderstorms in Rawalpindi, Gujranwala, Lahore, Faisalabad, Sargodha, DG Khan, Multan, Sahiwal and Bahawalpur divisions. Landslides may occur due to rain in Murree and Galiyat, it added.\n\nIt said there were chances of thunderstorms with lightning in Punjab and rains would continue till May 4.\n\nIt said that on Thursday night, two persons citizens died and 24 others were injured due to windstorm and rain, while nine buildings were partially damaged by the storm.\n\nMore showers, thunderstorm likely in city today\n\nPDMA Director General Irfan Ali Kathia warned of a high possibility of lightning strikes in the next three days. He advised people to stay in safe places to avoid lightning and not go out under the open sky in bad weather conditions.\n\nThe DG also ordered provision of the best medical assistance to the injured and said that financial assistance to the affected families will be ensured as per the policy of the Punjab government.\n\nMeanwhile, the Meteorological Department predicted that moist currents were penetrating upper/central parts of the country. A westerly wave is affecting upper and central parts of the country.\n\nThe weather forecast for Saturday stated that cloudy weather with rain-wind/thunderstorm is likely in Kashmir. Isolated hailstorm/heavy falls is likely during the period.\n\nIn Punjab, rain-windstorm/thunderstorm is expected in Murree, Galliyat, Rawalpindi, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujarat, Gujranwala, Hafizabad, Sialkot, Narowal, Lahore, Sahiwal, Kasur, Okara, Faisalabad, Toba Tek Singh, Jhang, Khushab, Sargodha, Mianwali, Multan, Layyah, Bhakkar, Taunsa, Rajanpur, DG Khan and surrounding areas. Isolated hailstorms/heavy falls may also occur during the period.\n\nDuring the last 24 hours, 40mm rainfall was reported in Muzaffarabad city, Narowal 31.02mm, Murree 29.0mm, Garhi Dopatta 26.5, Hafizabad 20.0, Sialkot city 19.3, Gujranwala 16.0, Kasur, Lahore airport 15.0 each, Rawalakot 14.5, Kotli, Sialkot Airport 14.0 each, Lahore city 11.6, Gujrat, Mangla 11.0 each, Chakwal 10.0, Islamabad city 9.4, Jhelum 9.0, Mandi Bahauddin 6.0, Sheikhupura, Joharabad 5.6 each, Islamabad airport 5.0, Rawalpindi 4.0, Bahawalnagar 3.0, Noorpur Thal 2.8, Sargodha city 2.2, Attock, Okara 2.0 each, while Sahiwal, Bahawalpur airport and Bahawalpur city received only traces of rain.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:51:17.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908036/two-die-24-injured-in-rain-windstorm-punjab-pdma",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:39.000Z"
}
