{
  "title": "UN Security Council may meet soon on India-Pakistan tensions - World - DAWN.COM",
  "author": null,
  "content": "UNITED NATIONS: Greece, which holds the rotating presidency of the UN Security Council, has said that a council meeting on rising tensions between India and Pakistan may happen “sooner rather than later”, while Pakistan indicated that it is keeping “all options” open, including raising the issue at the Security Council.\n\n“All the options are [on the table], including raising it in the Security Council. We will take the decision at the appropriate time,” said Pakistan’s Permanent Representative to the United Nations, Ambassador Asim Iftikhar Ahmad, at a news conference at the UN headquarters on Friday. He was responding to a question from the president of the UN Correspondents Association (UNCA).\n\nAmbassador Evangelos Sekeris of Greece made his remarks on Thursday while briefing UN reporters in New York on the Security Council’s work programme under Greece’s month-long presidency.\n\n“We are in close contact … but this is something which might happen, I would say, sooner rather than later. We will see, we are preparing. It’s the first day of our (UNSC) presidency,” Sekeris said.\n\nEnvoy to UN says Guterres, heads of General Assembly and Security Council, OIC Group in New York have been briefed on Pakistan’s position\n\nHe noted that a formal request had not yet been submitted but emphasised the value of such a discussion.\n\n“Of course, if a request comes for a meeting, then… I think this meeting should take place because, as we said, maybe it’s also an opportunity to have views expressed and this might help to diffuse a bit tensions. We will see.”\n\nPakistan’s envoy warned that the current crisis could escalate rapidly.\n\n“In this politically motivated and highly provocative environment created by India’s irresponsible and destabilising actions in the wake of the Pahalgam attack … as we speak, there is reasonable intelligence indicating towards imminent threat of kinetic action by India against Pakistan.”\n\nHe said Islamabad had already briefed key international stakeholders: “We have briefed the UN Secretary-General, Presidents of the General Assembly and the Security Council, the OIC Group in New York, and fellow members of the Security Council. We have also shared our position and concerns with various other international partners.”\n\nShould India initiate hostilities, he said, “Pakistan will exercise its inherent and legitimate right to self-defence, as enshrined in the UN Charter”.\n\nAt the same time, Ambassador Asim condemned terrorism in clear terms. “Pakistan condemns terrorism in all its forms and manifestations. Nothing justifies targeting of innocent civilians. We are concerned over the loss of lives in the Pahalgam attack, and we extended our condolences.”\n\nHe also criticised India’s reported move to suspend the Indus Waters Treaty (IWT). “Holding of IWT in abeyance is unilateral and illegal. There are no such provisions in the Treaty. India’s unilateral and unlawful actions are bound to undermine regional peace and stability with catastrophic implications.”\n\nAmbassador Sekeris acknowledged the seriousness of the situation. “I have to tell you that we are also seriously concerned with the growing bilateral tension in the atmosphere, which has been evolving between India and Pakistan.”\n\n“We are also joining others who are calling for de-escalation and dialogue so that the situation does not spiral out of control,” he added, noting that larger member states were in contact with both sides.\n\nOn the Pahalgam incident, Sekeris said, “It’s an issue which is very pertinent. As I said before, as a position of principle, we strongly condemn any act of terrorism and this is what we did” on the “heinous terrorist attack” in Pahalgam in which innocent civilians died.\n\nHe added, “Both India and Pakistan are far larger than Greece. So the size and volume are of a different nature. We also join calls for de-escalation and dialogue so that the situation does not spiral out of control”.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:13:28.931Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908062/un-security-council-may-meet-soon-on-india-pakistan-tensions",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:00.000Z"
}
