{
  "title": "Instigating agitators: Punjab govt recommends cancellation of eight trainee medics’ licences - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab government has forwarded the cases of eight postgraduate trainee doctors to the Pakistan Medical and Dental Council (PMDC) for cancellation of their ‘permanent practicing licences’, for participating in the recent protests and instigating other employees to suspend treatment of the patients at the state-run hospitals of the province.\n\nThree of these PGRs are from the Punjab institute of Cardiology (PIC), Lahore, two each from the Benazir Bhutto Hospital (BBH), Rawalpindi, Nishtar Hospital, Multan. and another was from the Children Hospital, Lahore.\n\nThe heads of the teaching institutions proposed action against the young medics on the basis of the reports prepared by the relevant heads of their departments, and then the government wrote to the PMDC for the cancellation of their practicing licences.\n\nMeanwhile, the young doctors and other employees continued to close down the OPDs of the government hospitals across Punjab.\n\nYDA threatens countrywide protest\n\nOn Friday, senior doctors, including professors, remained absent from the hospitals. The sources said that most of the medical teachers were supporting the protesting young doctors and other employees.\n\nThe health department directed the officials concerned to expedite the process of hiring daily-wage doctors to replace the protesting medics in order to keep the OPDs operational.\n\nThe YDA Pakistan has meanwhile expressed concern over the Punjab government move to seek cancellation of ‘permanent practicing licences’ of postgraduate trainee doctors.\n\n“We consider this move not only unjustified but a direct threat to the dignity and career of healthcare professionals who have served this country with dedication and commitment,” says Dr Atif Majeed Chaudhry, president of YDA Pakistan, in a statement.\n\nHe said the association strongly opposes the action proposed against the doctors. “Targeting individual professionals in this manner sets a dangerous precedent. We strongly urge the Pakistan Medical and Dental Council to reject this unconstitutional move which jeopardises the future of dedicated professionals.”\n\nDr Chaudhry said the YDA reserves the right to launch a nationwide movement to protect the rights and licences of doctors if this issue is not addressed immediately.\n\n“We hope the PMDC will uphold its mandate as an independent regulatory body free from external pressure,” he added.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:51:53.647Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908041/instigating-agitators-punjab-govt-recommends-cancellation-of-eight-trainee-medics-licences",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:39.000Z"
}
