{
  "title": "Alvi to be held accountable if Bilawal’s claim on canals proven: PTI MNA - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI lawmaker Ali Muhammad Khan said that the party would issue a show-cause notice to former president Arif Alvi if it was proven that he had approved some controversial canals during his presidency as claimed by PPP Chairman Bilawal Bhutto-Zardari\n\nOn February 15, Punjab Chief Minister Maryam Nawaz and Chief of the Army Staff General Asim Munir inaugurated the ambitious Cholistan project to irrigate South Punjab’s lands amid public uproar and strong reservations in Sindh.\n\nDays after the canals controversy was put to rest by the Council of Common Interests, Bilawal on Thursday claimed that the decision to carve them out was taken during the caretaker government, under the presidency of PTI’s Alvi.\n\nSpeaking during DawnNewsTV programme Doosra Rukh on Friday night, PTI MNA Ali Muhammad said that the party would question the former president if the charges being levelled against him by the PPP chairman were proven.\n\n“If Bilawal has any evidence to support his claim, then he should provide it. The party will issue a show-cause notice to the Alvi and question him on the matter,” he said.\n\nAli Muhammad said that Bilawal should not take “wild guesses”, adding, “How was the project approved under President Zardari’s presence? Why did he [Zardari] not stop it before?”\n\nHe further said that the party stands with the people of Sindh.\n\nThe PTI leader also spoke on the heightened tensions with India following the April 22 attack in occupied Kashmir’s Pahalgam that killed 26 people.\n\nHe said, “In matters of [potential] war, we are all one. There is no opposition to the government when it comes to Pakistan’s defence,” adding that PTI founder Imran Khan must be included if the government called for a multi-party conference.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/031307191ec0ea9.jpg",
  "retrievedAt": "2025-08-23T08:12:59.043Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908170/alvi-to-be-held-accountable-if-bilawals-claim-on-canals-proven-pti-mna",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T08:52:53.000Z"
}
