{
  "title": "‘Sindh’s housing, solar projects lack transparency’ - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A Senate panel on Friday raised serious fiduciary questions over foreign-funded multimillion-dollar projects in the housing and solar energy sectors of Sindh and mega national projects in the transmission sector.\n\nThe meeting of the Senate Standing Committee on Economic Affairs, chaired by Senator Saifullah Abro, expressed concerns over the handling of major public welfare projects, including the Sindh Solar Energy Project (SSEP), housing schemes under foreign funding, and multiple transmission and infrastructure projects, according to an official announcement.\n\nSenators Haji Hidayatullah Khan, Falak Naz, Kamran Murtaza, Rahat Jamali, Kamil Ali Agha, Dr Afnan Ullah Khan, and Saifullah Sarwar Khan Nyazee attended.\n\nThe committee discussed the project, under which solar systems are distributed to households consuming less than 100 units of electricity. Officials reported that only 23,000 solar systems had already been distributed out of a planned 200,000.\n\nSenate panel questions logic for involving NGOs\n\nMr Abro expressed dissatisfaction over the officials’ lack of transparency and clarity.\n\n“Full details should be provided to the committee,” he demanded. He criticised the project’s implementation, stating, “You are not giving a break-up of solar project. The advertisements are running as if Sindh has been turned into Switzerland.”\n\nThe committee learned that consumers in the 0–20 unit category who could not afford Rs6,000 upfront cost were excluded from the scheme. He said it was strange that the scheme was meant for people with low incomes, but at the same time, they were expected to pay Rs6,000 as a tax. He observed that 20 solar panels were going to one house, showing misuse of the scheme.\n\nHe also questioned the financial logic behind the procurement process: “According to you, the cost is Rs21,000 and the company has quoted Rs8,000 more. How did you accept the bid of Rs32,000?” he asked and directed the officials concerned to submit the details about the market rate.\n\nOfficials confirmed that 18 companies participated in the bidding process, with contracts awarded to three, including one Chinese firm. The initial bid was Rs10,000 per system, but prices later increased.\n\nThe meeting was told that 10pc of the charges were paid to NGOs instead of 2pc the normal consultancy rates paid in projects of other departments.\n\nNGOs role questioned\n\nSenator Kamil Ali Agha also questioned the logic for involving NGOs in SSEP and housing schemes. The committee chair pointed out discrepancies in beneficiary records, saying, “There are 22 people in each house in BISP. The information you’ve given proves that there are 20 people from one house. Don’t give 20 panels to one house.”\n\nThe committee decided to write formal letters to the secretary of economic affairs and chief secretary of Sindh regarding concerns over the credibility of the beneficiary lists. “Give solar systems to the needy people, not to one household repeatedly,” Mr Abro observed.\n\nWhile reviewing housing projects in Sindh under foreign aid, the committee raised concerns over Rs22bn allocated for 2.1 million houses, with Rs10,500 per house reportedly channelled to NGOs. “Is Rs22bn a small amount? How crafty these schemes are developed to aid NGOs through the common public,” chairman Abro noted.\n\nHe demanded a 20-year record of the five NGOs involved, their background and copies of their agreements. The committee also took serious notice of the absence of senior officials from the Sindh Peoples’ Housing for Flood Affectees (SPHF) and the Sindh Solar Energy Project. The officials were unable to satisfy the committee adequately.\n\nDiscrepancy in power project\n\nThe panel also deliberated on 765kV Dasu-Islamabad Trans­mission Line Project of NTDC, where the panel highlighted a possible financial discrepancy of Rs1.282bn. The committee observed that the issue had already been discussed in detail in previous meetings, where the officials conceded it concerned that the tax amount was not included in the letter of acceptance (LoA) issued to the qualified firm.\n\nThe NTDC board of directors also approved the amount mentioned in the LoA (Rs33bn) and Rs1.282bn was later included in the signed agreement. Senator Abro called for the DG FIA and NAB chairman to investigate the matter and seek explanations from all the NTDC board members over alleged violations of the bidding agreements.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/681553a0bfe01.gif",
  "retrievedAt": "2025-08-23T08:12:59.895Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908107",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:13.000Z"
}
