{
  "title": "PFUJ slams govt over ‘black laws’, attacks on press freedom - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Bilawal says society without free press is a body without a soul\n• NA speaker praises journalists for demonstrating exceptional patriotism in post-Pahalgam incident situation\n\nISLAMABAD: The Pakistan Fede­ral Union of Journalists (PFUJ) has called upon the federal and provincial governments, to respect press freedom and freedom of expression, which are fast eroding in the country.\n\nIn a joint statement issued on the eve of Press Freedom Day, being observed the world over to­­day, PFUJ Acting President Khalid Khok­h­­ar and Secretary General Ars­h­­­­ad Ans­ari condemned the recent am­­endments made by the federal and Punjab governments to stifle the freedom of expression.\n\nThey said the am­­endments to the Prevention of Elec­tr­onic Crimes Act (Peca) 2025 made by the federal government and the Def­amation Law passed by the Punjab As­­­sembly were aimed at controlling the media.\n\nThe PFUJ leadership also regretted that the Journalist Safety Act, adopted by Parliament long ago, has still not been enforced as neither the commission has been constituted nor its rules framed by the government.\n\nThey also accused the government of issuing government advertisements — a vital source of revenue for media outlets — to only those media organisations that are toeing the government line. They noted that those organisations which are taking an independent stand are being denied official advertisements.\n\nThey pointed out that English language daily Dawn was also being punished for taking independent editorial stance by stopping the official advertisement to that newspaper, which was founded by Quaid-i-Azam Mohammad Ali Jinnah.\n\n‘Journalism is public service’\n\nMeanwhile, PPP Chairman Bilawal Bhutto-Zardari has paid rich tribute to journalists, editors, photographers, and media workers across Pakistan and around the world on the occasion of World Press Freedom Day.\n\nIn a statement issued by the Bilawal House, the PPP chairman said that the World Press Freedom Day serves as a poignant reminder that journalism is not merely a profession — it is a public service, a shield against tyranny, and a lifeline for any democratic society.\n\n“In every unjust silence, in every muffled truth, freedom itself is wou­nded,” he added. Mr Bhutto-Zardari pointed out that the unanimously pas­sed Constitution of 1973, which guarantees the freedom of speech, expression, and the press, was a historic gift from Quaid-i-Awam Shaheed Zulfikar Ali Bhutto, the country’s first elected prime minister.\n\nHe lauded the PPP-led Sindh government for taking a pioneering step by passing the Sindh Protection of Journalists and Other Media Practitioners Act, 2021, and establishing the Commission for the Protection of Journalists and Other Media Practitioners under this law.\n\nThe PPP chairman saluted the courage of media professionals who risk their lives to uncover and report the truth. He said: “A society without a free press is a body without a soul. Let us honour those who speak when others stay silent. Let us protect those who write so that we may read the truth.”\n\nIn his message, National Assembly Speaker Ayaz Sadiq said that freedom of the press is pivotal for the promotion of democratic values. He paid rich tribute to journalists serving in Palestine, Indian-occupied Kash­m­­ir, and other war-torn regions, recogni­sing their courage and professionalism.\n\nHighlighting the role of Pakistani media during recent Indian aggressive policies in the region, Speaker Sadiq praised the journalistic community for demonstrating exceptional professionalism and patriotism. Through fact-based reporting, the media played a key role in revealing the true face of India to the international community.\n\nHe added that the role of the journalistic community is of vital importance in promoting a positive image of the country and fostering an informed society.\n\nHe also appreciated the important role played by journalists in the Press Gallery of the parliament, who serve as a bridge between legislative proceedings and the general public.\n\nNA Deputy Speaker Ghulam Mustafa Shah affirmed parliament’s unwavering belief in freedom of expression and its commitment to ensuring that journalists have timely and accurate access to information. He said the National Assembly has consistently pursued legislation aimed at the protection and welfare of journalists.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:51:54.208Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908129/pfuj-slams-govt-over-black-laws-attacks-on-press-freedom",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:06.000Z"
}
