{
  "title": "Harry loses legal fight with UK government over police protection - World - DAWN.COM",
  "author": null,
  "content": "LONDON: Prince Harry on Friday lost his legal challenge to changes to his security arrangements made by the British government following his decision to step down from royal duties with his American wife Meghan.\n\nHarry, King Charles’ younger son, had sought to overturn a decision by the Home Office — the ministry responsible for policing — which decided in Feb 2020 he would not automatically receive personal police security while in Britain.\n\nLast year, the High Court in London ruled the decision was lawful and that decision was upheld by three senior Court of Appeal judges who said that, while Harry understandably felt aggrieved, that did not amount to an error of law in the decision.\n\nPrince Harry said he was “devastated” to lose his appeal, telling the BBC he would “struggle to forgive” the decision and could not safely bring his family to Britain.\n\nThe prince says in an interview King Charles does not speak to him; rules out return to Britain\n\n“Obviously, pretty gutted about the decision,” Harry, who now lives in California with Meghan and their two children, told the BBC.\n\nJudge Geoffrey Vos said Harry’s lawyer had made “powerful and moving arguments” about the impact of the decision about his security.\n\nRules out return\n\nIn the BBC interview Harry said King Charles does not speak to him and that he cannot bring his family to live in Britain. He added: “My status hasn’t changed it can’t change. I am who I am, I am part of what I am part of, I can’t escape that.” Harry claimed that “security was used as leverage” to try and keep him and Meghan within the royal fold, but said he wanted to be reconciled with his family.\n\n“What I’m struggling to forgive, and what I will probably always struggle to forgive, is that a decision that was made in 2020 that affects my every single day and that is knowingly putting me and my family in harm’s way,” he said in the interview from California.\n\nBuckingham Palace said in relation to Harry’s legal case: “All of these issues have been examined repeatedly and meticulously by the courts, with the same conclusion reached on each occasion.”\n\nJudge Geoffrey Vos said that Harry’s lawyer had made “powerful and moving arguments” about the impact of the security change, but that did not make the change unlawful.\n\nHarry, 40, attended two days of hearings in April, when his lawyer told the court that he had been singled out for different, unjustified and inferior treatment.\n\n‘Life at stake’\n\nHis lawyer Shaheed Fatima had said Harry’s “life was at stake”, citing that al Qaeda had recently called for him to be murdered, and he and Meghan had been involved in “a dangerous car pursuit with paparazzi in New York City” in 2023. However, the government’s legal team said the bespoke arrangement for the prince had positive advantages from a security assessment point of view.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/03100951aae76fe.jpg",
  "retrievedAt": "2025-08-23T08:13:13.869Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908124/harry-loses-legal-fight-with-uk-government-over-police-protection",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:25.000Z"
}
