{
  "title": "National Women’s T20 cricket tournament to start on May 7 in Karachi - Sport - DAWN.COM",
  "author": null,
  "content": "A total of five teams will vie for the title of the National Women’s T20 Tournament 2025 beginning on May 7 at two venues in Karachi, the National Stadium and HPC Oval Ground, the Pakistan Cricket Board said on Saturday.\n\nLast month, Pakistan finished the ICC Women’s World Cup 2025 Qualifiers unbeaten at the top of the table with a domineering victory over Bangladesh by seven wickets in Lahore to win the tournament.\n\nPakistan had already booked their spot for the World Cup to be held later this year on April 17, courtesy of their bowlers, who had once again stepped up to defend a below-par score of 205 against Thailand in their penultimate encounter of the tournament.\n\n“The five-team National Women’s T20 Tournament 2024-25 will begin on May 7 at two venues in Karachi,” the PCB said in a press release.\n\nThe PCB added that this year’s edition will feature five teams — Challengers, Conquerors, Invincibles, Stars, and Strikers. Competing in a double-league format, each team will play eight matches with a total of 22 matches slated to take place across 18 days.\n\nThe teams finishing second and third on the points table will face off in a qualifier on May 22, with the winner advancing to meet the top-ranked team in the final on May 24. The final will be played at the National Stadium.\n\nA total of 80 cricketers will participate in the tournament, which carries a prize pool of over Rs3 million. The champions will receive Rs1.5 million, while the runners-up will take home Rs1 million, the PCB added.\n\nThe 19-member squads of each of the five teams will be trimmed to 16 at the end of the four-day pre-tournament camp, which begins on May 3 in Karachi.\n\nAmong the players featuring, five national players, who were part of Pakistan’s victorious squad at the recently concluded World Cup Qualifiers tournament, will lead their respective sides.\n\nPakistan skipper Fatima Sana, who was named captain of the team of the Qualiifers tournament will be leading her side, Conquerors. Opener Gull Feroza will be leading Strikers, southpaw Muneeba Ali will be leading Invincibles, off-spinner Rameen Shamim will be leading Challengers, and veteran batter Sidra Amin will be captaining the Stars side.\n\n“As part of the PCB’s continued efforts to promote and expand the reach of women’s cricket, both the qualifier (May 22) and the final (May 24) will be live-streamed on the PCB’s official YouTube channel. All matches in the tournament will begin at 3pm PKT,” the statement added.\n\nLast year’s tournament was held in Islamabad and Rawalpindi, with Karachi and Lahore being declared joint winners of the tournament after the final at the Rawalpindi Cricket Stadium was called off without a ball being bowled due to rain.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/03164707890552f.jpg",
  "retrievedAt": "2025-08-23T08:12:57.467Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908187/national-womens-t20-cricket-tournament-to-start-on-may-7-in-karachi",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T12:28:35.000Z"
}
