{
  "title": "India continues blocking social media channels; tries to undercut IMF deal - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: As Indian Prime Minister Narendra Modi handed the defence of the country back to the military and busied himself with economic management, the strategy to deal with Pakistan appeared to be shaping into an imitation of what the government does with critics at home — shutting their finances and media outlets.\n\nModi was inaugurating a port in Kerala on Friday, and mocking the opposition when the Indian government also blocked access to the official YouTube channel of Pakistan’s Prime Minister Shehbaz Sharif for users in India, invoking concerns over national security and public order, Kolkata-based Telegraph newspaper said on Friday.\n\nIt said the move was part of a wider crackdown on Pakistani digital content, following the April 22 attack in Pahalgam that left 26 civilians dead, most of them tourists.\n\nUsers trying to access PM Shehbaz’s YouTube profile are now met with a standard message: “This content is currently unavailable in this country because of an order from the government related to national security or public order.”\n\nThis is the most high-profile block since similar action was taken against the YouTube channels of Defence Minister Khawaja Asif and the Inter-Services Public Relations (ISPR), the paper said.\n\nIndia’s ministry of information and broadcasting has invoked emergency provisions under the Information Technology Act to direct major social media platforms to geo-restrict several Pakistani accounts that were allegedly involved in spreading anti-India narratives and misinformation.\n\nOfficials say the restrictions are part of a “coordinated counter-disinformation effort” in the aftermath of the Pahalgam attack.\n\nA notable segment of the crackdown has been directed at high-profile Pakistani cricketers, whose social media accounts enjoy massive Indian viewership.\n\n“The Instagram handles of current and former players including Babar Azam, Mohammad Rizwan, Shaheen Shah Afridi and Haris Rauf have been blocked for Indian users,” according to the report.\n\nAttempts to access these profiles in India, it said, now return a message stating: “Account not available in India. This is because we complied with a legal request to restrict this content.”\n\nThe YouTube channels of Shahid Afridi, Shoaib Akhtar, and Basit Ali have also been geo-restricted, making their content inaccessible to Indian audiences.\n\nThe action, officials say, is based on concerns that these public figures were either directly sharing or amplifying content that could be used to spread anti-India sentiment, particularly in the wake of the Kashmir attack.\n\nFormer players including Wasim Akram, Waqar Younis and Afridi (on Instagram) continue to have visible accounts, although, according to the report, more profiles could be under review.\n\nEarlier, the YouTube channels of Shoaib Akhtar, Syed Muzammil Shah, and Arzoo Kazmi, channels such as Duniya Merey Aagay, Ghulam Nabi Madni, HAQEEQAT TV and HAQEEQAT TV 2.0 were also blocked for Indian users.\n\nOlympic javelin silver medallist Arshad Nadeem’s Instagram account has also been blocked in India. The tenth edition of the Pakistan Super League (PSL), currently underway, is not being broadcast or streamed in India. Broadcasters Sony Sports Network and FanCode suspended telecast of the tournament following the Pahalgam strike, The Telegraph said.\n\nThe restrictions go beyond politics and sport. Earlier, the Instagram profiles of leading Pakistani actresses Mahira Khan and Hania Aamir were blocked for Indian users. Other celebrities, including Ali Zafar and Fawad Khan, have also faced similar action in recent days.\n\nOfficials in the ministry said that the government would continue to monitor and act against digital assets that pose a threat to India’s sovereignty, particularly in the context of terrorism, defence and foreign affairs.\n\nIMF programme\n\nSeparately, India has also asked global multilateral agencies, including the IMF, to review funds and loans provided to Pakistan, as New Delhi seeks “to corner the neighbouring state diplomatically”.\n\n“We will be asking all multilateral agencies to review the loans and support to Pakistan,” Reuters quoted a government source as saying.\n\nPakistan secured a $7 billion bailout programme from the IMF last year and was granted a new $1.3 billion climate resilience loan in March.\n\nAlthough the IMF and India’s finance ministry did not immediately respond to a Reuters request for comment, an adviser to Pakistan’s finance minister said the IMF programme is “well on track”.\n\n“The latest review has been done well and we are completely on track,” Khurram Schehzad told Reuters, adding that Pakistan had very productive spring meetings with financial institutions in Washington.\n\n“We did about 70 meetings … interest has been very high for investing and supporting Pakistan as the economy turns around,” Schehzad said.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:51:48.417Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908068/india-continues-blocking-social-media-channels-tries-to-undercut-imf-deal",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:39:54.000Z"
}
