{
  "title": "Opposition walks out of Balochistan Assembly over mines bill - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Opposition members staged a walkout from the Balochistan Assembly on Friday in protest against the Mines and Minerals Bill, accusing the government of reintroducing controversial clauses previously removed during committee discussions.\n\nThe session, presided over by Speaker Abdul Khaliq Achakzai, saw heated debate over the bill. National Party President Dr Malik Baloch strongly opposed its passage, alleging that several contentious clauses were deceitfully reinserted into the final draft.\n\n“This is a serious violation and betrayal in parliamentary history,” Dr Baloch said on the assembly floor. “We will not compromise on Balochistan’s coasts and resources.”\n\nChief Minister Sarfraz Bugti responded by offering dialogue and transparency, stating that the government had taken the opposition into confidence on the matter. He said a committee would be formed to review and amend the disputed clauses in consultation with opposition members.\n\n“The assembly is supreme, and every member should respect the house,” Mr Bugti said. “Our doors are open. I invite the opposition to come and discuss the Mines and Minerals issue.”\n\nMr Bugti also expressed dismay over the opposition’s walkout. “It is the responsibility of the opposition to listen to the government’s stance,” he added. “The house should be run according to the assembly rules.”\n\nDespite his offer, the opposition walked out after continued criticism of the bill. Speaker Achakzai acknowledged the opposition’s concerns but called on them to consider the government’s position as well.\n\nAwami National Party-Awami President Asad Baloch questioned the opposition’s move, noting, “When the opposition had signed the draft of the bill, why are they now staging a walkout?”\n\nMines and Minerals Minister Mir Shoaib Nosherwani defended the bill, stating during the session that he had made no comments against Balochistan’s interests during committee meetings.\n\nIn other assembly business, the house passed four resolutions, including one calling for the division of National Assembly constituency NA-260 into two separate constituencies. Two call-attention notices submitted by opposition members were disposed of due to the absence of Planning and Development Department officials.\n\nAmong the resolutions passed, Jamiat Ulema-e-Islam’s (JUI) Fazal Qadir Mandokhail urged practical steps for the Zhob Bypass project and proposed raising the age limit for birth registration from 20 to 30 years. Both were approved unanimously.\n\nJUI’s Zabid Ali Reki presented a resolution seeking to split NA-260 into two constituencies, while another by JUI’s Asghar Ali Tareen called for officially declaring Dr Mehar Ullah Tareen a martyr. Both measures passed.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:52:08.335Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908127/opposition-walks-out-of-balochistan-assembly-over-mines-bill",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:06.000Z"
}
