{
  "title": "Trump posts spoof picture dressed as pope - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Friday posted a spoof picture of himself dressed as the pope on his Truth Social platform after joking that he would like to be the next Catholic pontiff.\n\nThe president is seen in what appears to be an AI-generated color image, with his right index finger pointed toward the sky, wearing papal regalia, including white robes, a gold crucifix pendant and the miter hat.\n\nIt comes after Trump joked to reporters this week that he would like to be the next pope, just days before cardinals are due to start the conclave to elect the successor of Pope Francis who died on April 21.\n\nAsked who he would like to succeed Pope Francis, Trump said: “I’d like to be pope, that would be my number one choice.” Trump went on to say that he did not have a preference but said there was a cardinal in New York who was “very good”.\n\nHe appeared to be referring to the archbishop of New York, Timothy Dolan, a theological conservative and fiercely opposed to abortion.\n\nTrump attended the funeral service of Pope Francis last week, his first foreign trip since returning to power.\n\nAbout 20 per cent of Americans declare themselves Catholic, and exit polls indicated in November that they voted around 60pc in favour of Trump.\n\nPope Francis had arguably been one of the most powerful moral voices on the world stage critical of Trump.\n\nWhen Trump first ran for president in 2016, Francis was unsparing on his signature promise to build a border wall to seal off Mexico.\n\nFrancis told reporters, “Anyone, whoever he is, who only wants to build walls and not bridges is not a Christian.” Cardinals will gather on May 7 in a conclave in the Vatican’s Sistine Chapel to elect a new pope",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/large/2025/05/031152213ce4cb5.png",
  "retrievedAt": "2025-08-23T08:13:00.024Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908168/trump-posts-spoof-picture-dressed-as-pope",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T06:58:30.000Z"
}
