{
  "title": "Wanted Pakistani human smuggler still posting videos to TikTok - World - DAWN.COM",
  "author": null,
  "content": "A HUMAN trafficker, wanted by Pakistani authorities, remains at large and is potentially still luring hapless people to perilous and deadly crossings with promises of safe routes into Europe, a BBC Verify investigation has found.\n\nKhawar Hassan — a man in his 30s who goes by many aliases, but is most well-known as Fadi Gujjar — is unlike many other Pakistani smugglers. While others tend to boastfully advertise illegal routes to Europe online, he is more careful, advertising his services through word of mouth.\n\nHis online presence is limited to highly edited videos of his travels and almost all clients BBC Verify identified were local to his town of Jaurah, in Gujrat. In fact, two people he was close to — cousins Sufian Ali and Atif Shahzad — were among those who were beaten to death on a deadly boat journey he put them on.\n\nTheir uncle, Ahsan Shahzad Chaudhry, confirmed that his nephew Sufian was indeed friends with Fadi Gujjar.\n\nThe three men can be seen together in a TikTok video, posted to Fadi’s account, filmed at a beachside restaurant in Mauritania’s capital Nouakchott.\n\nWithin a month of this video being posted online, Ali and Shahzad were dead. Meanwhile, Fadi is on the run, wanted by the Federal Investigation Agency (FIA) for his role in the Mauritania boat tragedy, which claimed the lives of at least 43 Pakistanis, among others.\n\nAccording to the BBC, his current location on Facebook is set to Istanbul.\n\nBut it is Mauritania, on West Africa’s Atlantic coast, which is said to be the nerve-centre of his operation, and the place from which the migrant boat started its perilous journey. The route is deadly. IOM data shows that 170 people — including 14 children — have died or gone missing on it this year.\n\nPakistani authorities have named Fadi as one of ten smugglers involved in the tragedy and arrested some members of his family — his mother and one of his brothers — for collecting money on his behalf from people buying routes to Europe.\n\nBBC Verify geo-located his most recent TikTok posts to Baku, Azerbaijan – although it cannot be said for certain if he is still there.\n\nWhen contacted through WhatsApp via a number shared by survivors, Fadi Gujjar refused to address the allegations against him, claiming that his name was being misused, and that he “left everything up to Allah”.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:13:28.486Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908059/wanted-pakistani-human-smuggler-still-posting-videos-to-tiktok",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:00.000Z"
}
