{
  "title": "Indian Sikhs continue to visit Kartarpur despite rising tensions - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: As contacts of all kinds between Pakistan and India are cut amid escalating tensions between the two countries, Indian Sikhs continue to cross the border to visit Gurdwara Darbar Sahib at Kartarpur. However, there are growing complaints of Sikh pilgrims about the Indian government making it harder for them to visit the Kartarpur corridor.\n\nSardar Ranbir Singh and Sardar Shan Singh, who crossed the border from Indian Punjab, talking to Dawn, said they had to go through difficult processes to come to Pakistan. They said the Indian government was trying to control the number of visitors crossing the border to visit Kartarpur. They said Sikh pilgrims were given respect in Pakistan that’s why they wanted to visit this country.\n\nSardar Vir Singh, another pilgrim, said he had come to Gurdwara Darbar Sahib for the third time through the Kartarpur Corridor. He said he could not understand why the Indian government was afraid of sending Sikhs to Kartarpur. He said there was propaganda about Pakistan in India by a particular group that had created panic.\n\nSardar Lal Singh and Singhara Singh said the founder of Sikhism Baba Guru Nanak was born in Pakistan and that the Sikhs living all over the world could never say “death to Pakistan”. They requested the Sikhs around the world to come to Kartarpur to pay for religious rituals.\n\nThe Sikh pilgrims expressed their solidarity with Pakistan and said, “We will stand by Pakistan in difficult times”.\n\nWOMAN HELD WITH DRUGS: Sialkot police arrested a woman drug dealer and seized from her ice, heroin and other drugs worth Rs3.5m besides Rs1m cash.\n\nA team raided a house near the Dhedowali railways crossing and arrested Shama Tauqir, a resident of Street Salo Gujar of Sialkot. Police recovered 6kg heroin, 6kg ice, 7kg hashish and 8kg of opium from her. Police also recovered more than Rs1m cash from the suspect.\n\nDistrict Police Officer Faisal Shahzad told Dawn that Police Station Saddar SHO Muhammad Razzaq was given the special task to break the network of drug dealers. He added that the woman had contacts with drug pushers in Peshawar and she was selling drugs in the Sialkot, Sambrial, Daska and Pasrur areas through her network.\n\nInspector Razzaq said the woman drug dealer recovered from the drug was worth Rs3.5m. He said the police would arrest her accomplices.\n\nPublished in Dawn, May 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:52:09.525Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908029/indian-sikhs-continue-to-visit-kartarpur-despite-rising-tensions",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T00:40:39.000Z"
}
