{
  "title": "Pakistan successfully tests launch of short-range Abdali ballistic missile - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan has conducted a successful training launch of the Abdali Weapon System, a surface-to-surface missile with a range of 450 kilometres, the military’s media affairs wing said on Saturday.\n\n“The launch was aimed at ensuring the operational readiness of troops and validating key technical parameters, including the missile’s advanced navigation system and enhanced manoeuverability features,” the Inter-Services Public Relations (ISPR) said in a press release.\n\nIt noted that the launch was a part of “Ex Indus” and was witnessed by the commander of the Army Strategic Forces Command (AFSC), senior officials from the Strategic Plans Division and the AFSC, as well as scientists and engineers from Pakistan’s strategic organisations.\n\nThe ISPR also released a video of the successful launch.\n\nPresident Asif Ali Zardari, Prime Minister Shehbaz Sharif, Chairman Joint Chiefs of Staff Committee General Sahir Shamshad Mirza and the services chiefs extended their congratulations to the participating troops, scientists, and engineers, the ISPR said.\n\n“They expressed complete confidence in the operational preparedness and technical proficiency of Pakistan’s Strategic Forces to ensure credible minimum deterrence and safeguard national security against any aggression,” the statement added.\n\nThe test launch comes amid heightened tensions between nuclear powers Pakistan and India in the wake of New Delhi’s aggressive measures in the wake of a deadly attack in occupied Kashmir.\n\nThe April 22 attack in Pahalgam killed 26 people, mostly tourists, in one of the deadliest assaults since 2000. India has implied cross-border links without evidence, while Pakistan has rejected the claim and called for a neutral probe.\n\nTensions have since spiked, with Pakistan reinforcing its forces as it expected an incursion and India’s premier granting “operational freedom” to his military. Pakistan witnessed shelling across the Line of Control (LoC) in AJK for a week since April 25, with the Pakistan Army responding to unprovoked Indian firing.\n\nAnalysts in Pakistan told AFP the missile launch was a warning shot.\n\n“It clearly indicates that we have the resources to counter India. This is not a message only for India but the rest of the world that we are well-prepared,” said Hasan Askari Rizvi, a military analyst.\n\nChief of Army Staff (COAS) General Asim Munir on Thursday asserted that any “misadventure” by India would be met with a “swift, resolute and notch-up response”. The next day, the army’s top brass also warned India of a “sure and decisive” response should it attempt to impose war.\n\nAs temperatures remain high, diplomatic channels have been engaged to prevent conflict, with the United States and the European Union contacting top Pakistani and Indian leaders.\n\nIn August 2024, Pakistan conducted a successful training launch of the Shaheen-II surface-to-surface ballistic missile.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/031559308a1df80.png",
  "retrievedAt": "2025-08-23T08:12:59.808Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908176/pakistan-successfully-tests-launch-of-short-range-abdali-ballistic-missile",
  "dateList": "2025-05-03",
  "date_published": "2025-05-03T08:40:56.000Z"
}
