{
  "title": "Swat floods leave over 125 schools unusable - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWAT: The recent floods caused extensive damage to the education sector in Swat district, rendering 128 government schools, both for boys and girls, partially or completely unusable.\n\nOfficials of the district education department told Dawn that the natural calamity hit primary, middle, high and higher secondary educational institutions in multiple tehsils.\n\nThey said the majority of buildings had suffered structural cracks, boundary wall collapse and damage to roofs and inundated classrooms, leaving them unsafe for teaching activities.\n\nThe officials said although the provincial government announced a one-day closure of schools in the flood-hit areas on Sunday, all public and private educational institutions across Swat reopened on Monday. However, classes weren’t held in 128 damaged schools.\n\nActivists fear high dropout rate due to prolonged learning disruption\n\nFloods also destroyed 1,849 houses across the district after water swept through entire neighbourhoods, leaving households with nothing but debris.\n\nAffected students lamented that their textbooks, notebooks and completed assignments were washed away in the deluge.\n\n“We lost all our books, notebooks and school work done all through the year,” said a student from Matta.\n\nThe crisis has been compounded by widespread losses in Mingora city, where Udyana Bazaar, the largest market for schoolbooks, stationery and other supplies in the district, was completely inundated.\n\nShopkeepers said that the floodwater ruined their stocks, leaving thousands of students without access to new books and school materials.\n\n“There are around 50 shops only in our market where all of them were inundated by the floods, destroying books and notebooks,” said Qadir Khan, a bookseller in Mingora.\n\nTeachers feared the prolonged school closure and loss of learning materials could cause a learning crisis, especially in rural areas where alternative arrangements were scarce.\n\n“The extent of damage is alarming. Children are eager to return to school, but many buildings are no longer fit for use. Unless urgent rehabilitation is carried out, their learning will be severely disrupted,” said a senior teacher from Kabal tehsil.\n\nThe district education officer confirmed that assessment surveys had been completed and detailed reports forwarded to the provincial government.\n\n“Restoration work will require significant funding, but we are working with the provincial administration to secure resources,” he told Dawn.\n\nThe provincial government has pledged to prioritise the reconstruction of schools under its rehabilitation programme.\n\nWhen contacted, a spokesperson for the chief minister, Ahmad Faraz Mughal, said that education was among the foremost concerns and that necessary steps would be taken to ensure that no student was deprived of learning opportunities.\n\n“The provincial government is committed to extending all possible assistance. The chief minister directed officials to prioritise relief operations and was personally monitoring the situation in the affected districts of Swat, Buner, Shangla and Swabi,” he said.\n\nMr Mughal said around 10,000 buildings were damaged by floods in Swat alone, resulting in losses worth billions of rupees.\n\nMeanwhile, education activists and local NGOs have called for urgent intervention of authorities, warning that prolonged disruption in schooling could drive dropout rates high, especially among girls in remote areas.\n\nSwat director (education) Fazal Khaliq told Dawn that around 105 primary, middle and high schools for boys had been affected by the floods.\n\n“Our school employees and volunteers have cleaned mud and sand from classrooms, while the data of partially damaged schools has been sent to the higher authorities for necessary action,” he said.\n\nThe official said schools whose buildings were currently usable would reopen in a couple of days.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ae36f1737bf.gif",
  "retrievedAt": "2025-10-12T03:54:03.350Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937451/swat-floods-leave-over-125-schools-unusable",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:55:19.000Z"
}
