{
  "title": "Gwadar port to be powered via solar energy in bid to enhance efficiency: minister - Pakistan - DAWN.COM",
  "author": null,
  "content": "Maritime Affairs Minister Muhammad Junaid Anwar Chaudhry on Wednesday announced that plans are underway to utilise solar energy to power Balochistan’s Gwadar port in a bid to improve its efficiency, a press release issued by his ministry said.\n\nGwadar Port, built more than a decade ago, still remains a non-starter, prompting the federal government to speed up efforts aimed at the maximum utilisation of the port. Earlier this month, Gwadar Port Authority (GPA) and a Chinese company agreed to boost investments at the port, in an attempt to develop it as a “regional transhipment centre”.\n\nIn a meeting aimed at enhancing the port’s operations, Chaudhry announced that “efforts are underway to implement solar-based solutions” to enhance the operational capability of the Gwadar port.\n\nIn that regard, a sub-committee has been established, which will be responsible for planning and implementing an “efficient solar panel utilisation plan, recommending the installation of solar photovoltaic systems, battery storage solutions for Gwadar’s water facilities, and proposing measures to enhance the region’s power supply,” the press release said.\n\nFurther outlining the responsibilities of the sub-committee, it added: “ The committee will design solar power distribution systems integrated with storage options to ensure a dependable energy supply for critical infrastructure, including the Gwadar Port Authority.“\n\nThe sub-committee will include representatives from the Ministry of Energy, Ministry of Maritime Affairs, Federal Board of Revenue, Gwadar Port Authority, Gwadar Development Authority, Quetta Electric Supply Company, and officials from the Prime Minister’s office.\n\nAccording to Chaudhry, the plan will establish micro solar grids across the port, which is expected to meet the energy demands of the port throughout the year.\n\n“The initiative seeks to significantly reduce Gwadar’s reliance on external energy by making it self-sufficient through local power sources,” the press release quoted him as saying.\n\nHe also detailed that the grids will be “set up at strategic locations to supply power for water pumps and the 1.2 million gallons per day (MGD) desalination plant.”\n\nChaudhry said the initiative will be fully functional soon, which will in turn facilitate the “establishment of new factories in the Gwadar free zone and provide power to the Gwadar International Airport.”\n\nThe minister shared that the maritime ministry is working in collaboration with the planning ministry, along with other relevant bodies, to resolve Gwadar’s “power and water scarcity” problems.\n\nHe highlighted that a shift to solar power could also potentially save Gwadar’s fishing industry over a million dollars.\n\n“Solar energy is not only a matter of reducing expenses but also vital to protecting the city’s flagship industry, which supports local livelihoods and strengthens its position in export markets,” the press release quoted him as saying.\n\nIn attendance at the meeting were: Chairman Gwadar Port Authority Noorul Haque Baloch, Chairman COPHCL My Yu Bo, Additional Secretary Maritime Ministry Umer Zaffer Shaikh, and Technical Advisor Jawad Akhtar.\n\nOn July 1, the Ministry of Maritime Affairs announced a plan to expand Gwadar Port’s operational capacity by introducing additional shipp­ing lines and launching a ferry service connecting Pak­istan with Gulf Cooperation Council countries.\n\nIn January, the government sought private sector support in routing its cargoes through Gwadar Port.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2714563090f891e.webp",
  "retrievedAt": "2025-09-06T09:49:07.662Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937575/gwadar-port-to-be-powered-via-solar-energy-in-bid-to-enhance-efficiency-minister",
  "dateList": "2025-08-27",
  "date_published": "2025-08-27T10:35:17.000Z"
}
