{
  "title": "Girls dominate top positions of FBISE intermediate results - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Girl students outnumbered boys in the Intermediate final exam conducted by the Federal Board of Intermediate and Secondary Education (FBISE), securing 13 of the 17 positions in all five groups.\n\nAccording to the results announced on Tuesday, the overall pass percentage remained 83.19 in the Higher Secondary School Certificate (HSSC) Part II exam, as 79881 students were declared successful. The pass percentage for HSSC-I remained 62.40 with 60794 students declared to pass.\n\nIn the Pre-Medical and Commerce Groups, all positions were bagged by girls while in Humanities Group, they clinched all the positions, but the second position was shared by a boy.\n\nIn Pre-Medical, Aleena Tahir from Army Public School and College Pasban Rawalpinidi Cantonment stood first by getting 1071 marks. The second position was secured by Warda Sarfraz from The Scholars Science College, Wah Cantt by obtaining 1070 marks.\n\nThe third position was shared by Urwa Malik from Army Public School and College Humayun Road Rawalpindi Cantt and Minahil Murtaza from Army Public School and College Gujranwala, by getting 1069 marks each.\n\nMeanwhile, in Pre-Engineering Group, Muzzammil Sajid from Scholars Science College, Wah Cantt, got first position by getting 1063 marks. The second position was clinched by Mohammad Sami from KIPS College Wah Cant with 1059 marks followed by Aisha Naeem from Army Public School Fort Road, Rawalpindi Cantt, who got 1054 marks to get the third position.\n\nIn Science General Group, Zayam Ruhab from Army Public School, Fort Road Rawalpindi, got first position by getting 1056 marks. The second position was clinched by Eesha Zaidi from Punjab College Campus of Hills House Boarding School, Islamabad, H-11/4, by getting 1055 marks while Halima Zuhaib from the same institute got 1053 marks for the third position.\n\nIn Commerce Group, girl students of Punjab College Hill campus House Boarding School H-11/4 got all the three positions. Jannat Nazir got first position by getting 1025 marks followed by her school fellows Shahzia Mahnoor and Zainab Waqar, who got 1020 and 1013 marks and stood second and third, respectively.\n\nMeanwhile, Dina Khan from Pakistan International School (Pakistan Section) Saudi Arabia got first position in Humanities Group by getting 986 marks. The second position was shared by Talha Shamas from Institute of Islamic Sciences, Satra Meel, Islamabad and Zoha from Punjab College Campus of Hills House Boarding School, H-11/4 by getting 981 marks each. Similarly, Sidra from Pakistan International School, Taj Al Deen Al Makki Azizyah, Saudi Arabia, clinched the third position by obtaining 974 marks.\n\nOut of total 17 position holders, six girl students belonged to Punjab College Campus Hills House H-11/4, Islamabad.\n\nThe results announcing ceremony was attended by State Minster for Federal Education Wajiha Qamar and Secretary Education Nadeem Mahbub.\n\nIn their addresses, they appreciated the position holders, their parents and teachers for their achievements.\n\nThe secretary education also appreciated the performance of the federal board, particularly its digitisation work and stated that the ministry will help other boards in their modernisation.\n\nEarlier, FBISE Chairman Dr Ikram Ali Malik in his address highlighted salient features of the results.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ae2fc073a51.gif",
  "retrievedAt": "2025-09-06T09:49:19.310Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937410/girls-dominate-top-positions-of-fbise-intermediate-results",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:55:13.000Z"
}
