{
  "title": "Indian cabinet approves 2030 Commonwealth Games bid, names Ahmedabad as ‘ideal host city’ - Sport - DAWN.COM",
  "author": null,
  "content": "India said on Wednesday that the city of Ahmedabad is an “ideal” location for the 2030 Commonwealth Games, with its bid viewed as part of a wider push by the cricket-mad nation to host the 2036 Olympics.\n\nAhmedabad is the key city in Prime Minister Narendra Modi’s home state of Gujarat, home to a 130,000-seater arena, the world’s biggest cricket stadium and named after the premier.\n\nModi’s cabinet approved India’s bid for the 2030 Commonwealth Games on Wednesday.\n\nIndia submitted a formal letter of intent last year to the International Olympic Committee to host the 2036 Games.\n\n“Ahmedabad is an ideal host city offering world-class stadiums, cutting-edge training facilities, and a passionate sporting culture,” a cabinet statement read.\n\n“Narendra Modi Stadium, the largest stadium in the world, has already demonstrated its capability by successfully hosting the 2023 ICC Cricket World Cup Final,” it said.\n\nNigeria and at least two other nations have reportedly expressed interest in hosting the Commonwealth Games, which struggled to find a replacement host for 2026 after the Australian state of Victoria withdrew, citing costs.\n\nThe British city of Glasgow stepped in and will stage a slimmed-down version.\n\nThe decision on the 2030 host will be made in November.\n\nIndia said that if it wins the bid, the Commonwealth Games would be a “full-fledged” event.\n\nThat would include tag-type sports such as kabaddi and kho kho, which India is pushing to be included in the Olympics.\n\nIndia has a population of 1.4 billion but its record at the Olympics is poor for a country of its size, winning only 10 gold medals in its history.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/08/191535555baf562.jpg",
  "retrievedAt": "2025-09-06T09:49:05.652Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937625/indian-cabinet-approves-2030-commonwealth-games-bid-names-ahmedabad-as-ideal-host-city",
  "dateList": "2025-08-27",
  "date_published": "2025-08-27T12:42:05.000Z"
}
