{
  "title": "India’s heavy rains cause floods, kill 30 in landslide on pilgrim route - World - DAWN.COM",
  "author": null,
  "content": "Heavy rain set off a landslide on a famed Hindu pilgrimage route in India-occupied Jammu region, killing at least 30 people, the ANI news agency said on Wednesday, while floods prompted official warnings for people to stay indoors at night.\n\nWeather officials forecast more rain and thunderstorms with gusty winds for the mountainous region of Ladakh, while heavy rain is set to lash the occupied Jammu and Kashmir territory.\n\nAuthorities were battling to restore telecom services as communication was “almost nonexistent”, said Chief Minister Omar Abdullah.\n\nTuesday’s landslide near the shrine of Vaishno Devi on the pilgrims’ route killed at least 30 people, said ANI, in which Reuters holds a minor stake.\n\nIt was the latest havoc from downpours in the Himalayan region that killed 60 people, with 200 missing in Kishtwar in occupied Kashmir last week.\n\nAuthorities also ordered the closure of educational institutions in held Jammu, which weather officials said was deluged with 368 millimetres of rain on Tuesday.\n\nThe rivers Tawi, Chenab, and Basantar overflowed beyond their alert levels, causing floods in low-lying areas, held Jammu district official Rakesh Kumar told reporters.\n\nTelevision images showed vehicles falling into a big hole after a bridge collapsed on the Tawi river, while some highways linking occupied Jammu to the rest of India were also damaged.\n\nPakistan has also grappled with monsoon rains in recent weeks.\n\nOn Tuesday, Islamabad said Punjab faced a “very high to exceptionally high” danger of flooding from a combination of heavy rains and India’s decision to release water from two dams.\n\nThe number of displaced in the province now exceeds 150,000, including nearly 35,000 who left voluntarily after flood warnings triggered by heavy rain since August 14, officials said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/27112413648f6aa.webp",
  "retrievedAt": "2025-09-06T09:49:12.564Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937553/indias-heavy-rains-cause-floods-kill-30-in-landslide-on-pilgrim-route",
  "dateList": "2025-08-27",
  "date_published": "2025-08-27T06:28:56.000Z"
}
