{
  "title": "Stocks stay bearish on economic concerns - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) extended its bearish momentum on Tuesday, with the benchmark KSE-100 index falling for the second consecutive session amid profit-taking, futures rollover pressure, and concerns over a delay in the release of the third tranche from the International Monetary Fund (IMF).\n\nThe KSE-100 index closed at 148,435 points, down 380 points or 0.26 per cent, according to data released by Topline Securities Ltd. The session remained volatile, with the index climbing to an intraday high of 149,453 points before succumbing to selling pressure. Market participants attributed the fluctuation to rollover activity typical of the futures contract settlement week.\n\nDespite early gains led by Fauji Fertiliser Company, Hub Power Company, and Pakistan Oilfields Ltd — which collectively added 295 points — the index closed in the red due to declines in heavyweight stocks including Engro Holdings, Bank Al Habib, Meezan Bank, MCB Bank, and Habib Bank Ltd. The cumulative impact of these losses dragged the index down by 549 points.\n\nAhsan Mehanti of Arif Habib Corporation said the market came under pressure due to weak global equities, falling international crude oil prices, and a lack of triggers on the domestic front. He also pointed to investor concerns over steady policy rates, a proposed hike in industrial gas tariffs, and regional geopolitical uncertainty, which together created a cautious market outlook.\n\nInvestor participation weakened, with traded volumes slipping 4pc to 665.42 million shares. However, the total traded value surged 19.74pc to Rs31.54bn, suggesting selective interest in high-value scrips. First Dawood Bank led the volumes chart with 40.15 million shares traded. Market watchers expect volatility to persist through the rollover period, with investor sentiment closely tied to developments in IMF talks and fiscal policy announcements.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ae3d5641163.gif",
  "retrievedAt": "2025-09-06T09:49:38.093Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937486/stocks-stay-bearish-on-economic-concerns",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:40.000Z"
}
