{
  "title": "Karachi’s S.M. Law College students protest against ‘exceptional’ fee hike - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Students of the Sindh Muslim Government Law College are protesting what they describe as an “exceptional fee hike” by the college administration, claiming it exceeds the limit approved by the Higher Education Commission (HEC) of Pakistan and is being applied to all batches rather than only to newly enrolled students.\n\nThe protest, ongoing since Aug 25, 2025, is being led by the “Students Action Committee”, which includes students from all current batches. They are demanding that the college administration roll back the decision to increase fees by 25-30 per cent.\n\nSpeaking to Dawn, a student leading the protest said the college had been increasing fees consecutively for the past few years. “They [the college administration] raised the fee by 15-18pc in previous years as well. This is unfair and unjust, as students cannot afford such increases every year,” he said.\n\nHe added that what was more troubling was that the fee hike had been applied to all existing batches, whereas any increase, if necessary, should be limited to new students only.\n\nCollege principal claims actual hike is 15pc, says increase is justified due to lack of govt funding\n\nThe student representative also highlighted other demands, including a reduction in examination fees and the digitisation of the admissions process.\n\n“There is no online portal for admissions at S.M. Law College. The outdated manual system is still in use, which creates difficulties for new students during the admission process,” he said.\n\nHe warned that if their demands were not met, the students would continue and expand their protest.\n\nHowever, S.M. Law College Principal Prof Fareed Ahmed Dayo told Dawn that the protest outside the college was unjustified and driven by “ulterior motives”.\n\nHe said that the decision to increase the fee had been taken in Sept 2024, not this year.\n\n“Where were these protesters then? Why are they suddenly raising this issue now? These are just a few students with other motives. Some of them are acting on behalf of a certain faculty member to pressure me,” Mr Dayo claimed.\n\nHe also alleged that the protesting students had used “filthy language” on social media against him, the state and government institutions. “They have also locked the college gate for the second consecutive day.”\n\nThe principal explained that the actual fee increase was only 15pc, not 25pc, and stressed that the decision in that regard was made by the Board of Governors of the college, not the principal alone.\n\n“Besides, the college does not receive any government funds or grants. We have to generate our own revenue,” he said.\n\n“Moreover, our classrooms are air-conditioned, unlike many other public-sector institution, and the quality of education is much better. And compared with other institutions offering LLB programmes in the country, our fee structure is actually quite reasonable,” he concluded.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:49:24.839Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937458/karachis-sm-law-college-students-protest-against-exceptional-fee-hike",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:59.000Z"
}
