{
  "title": "14 booked for assaulting women in separate incidents in Sahiwal - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: In a series of violent incidents across the district, seven women have been reportedly assaulted, and 14 individuals booked in cases related to violence against women.\n\nThe incidents occurred at various locations and are believed to be linked to property and land disputes, according to police sources.\n\nIn Dubai Garden, Salman Ali, Asgher Ali, Arsalan, Safyan along with their four unidentified accomplices allegedly forced their entry into the residence of Liaqat Ali, a commission agent. They allegedly physically assaulted Shafqat Bibi at the house and looted Rs2 million in cash.\n\nIn another incident at Noor Dad Mafi village, Shakoor, Nadeem Jamil, Allah Dita, Usman, and six unidentified persons allegedly stormed the home of Nadia Perveen and assaulted her and her brother, Muhammad Irfan.\n\nLocals alerted the police, but the assailants fled, leaving the siblings injured. In a similar incident at Asad Ullah Pull village, Riaz, Aslam, Muzamil, Baber, and nine unidentified individuals allegedly entered the home of Muhammad Ashraf and subjected him and his wife, Nadia, to physical violence.\n\nAt village 105/9-L Bahawal Sher, Habib and Muhammad Hussain reportedly attacked Muhammad Nadeem and his wife, Shahida Bibi, using bamboo sticks. Shahida’s clothes were torn during the assault, and her husband sustained critical injuries.\n\nPolice registered separate cases at Ghala Mandi Bahadur Shah, Dera Rahim, and Yousafwala police stations against 14 suspects. Investigations are underway.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:49:20.493Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937414/14-booked-for-assaulting-women-in-separate-incidents-in-sahiwal",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:55:07.000Z"
}
