{
  "title": "Uproar after US envoy tells Lebanese journalists to ‘act civilised’ - World - DAWN.COM",
  "author": null,
  "content": "BEIRUT: US envoy Tom Barrack told Lebanese journalists during a press conference at the country’s presidential palace on Tuesday to “act civilised”, sparking outcry and calls for an apology.\n\nAs journalists shouted questions after the US delegation’s meeting with Lebanese President Joseph Aoun, Barrack stepped up to the podium in the packed room and said: “We’re going to have a different set of rules… please be quiet for a moment.\n\n“The moment that this starts becoming chaotic, like animalistic, we’re gone.”\n\n“Act civilised, act kind, act tolerant, because this is the problem with what’s happening in the region,” added Barrack, who is US ambassador to Turkiye and special envoy to Syria. He has recently been leading talks with Lebanese officials.\n\nThe Lebanese presidency expressed regret in a statement on X at “remarks made inadvertently from its podium by one of our guests”, affirming its appreciation for journalists and media representatives.\n\nInformation Minister Paul Morcos also expressed regret at the remarks “by a member of the foreign delegation towards media representatives at the presidential palace”.\n\nThe photojournalists’ syndicate called Barrack’s comments “a direct insult” that set “a serious and totally unacceptable precedent”.\n\nIn a statement, it demanded “an immediate and public apology”, rejecting attempts to “downplay the seriousness of what happened or let it pass without accountability”.\n\nAn editors’ syndicate also called for “a public statement of apology” and floated a boycott of the envoy’s future visits and meetings.\n\nThe union of journalists in Lebanon said Tom Barrack’s remarks were “a reflection of an unacceptable arrogance in dealing with the media” and also called for an official apology.\n\nIbrahim Musawi, a lawmaker from Hezbollah and head of the Lebanese parliament’s media committee, called the remarks “a blatant insult” and urged the government to “summon the US ambassador and reprimand her”.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/27104916f5fe0e5.webp",
  "retrievedAt": "2025-10-12T03:53:59.891Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937508/uproar-after-us-envoy-tells-lebanese-journalists-to-act-civilised",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:51.000Z"
}
