{
  "title": "Farage unveils plan to deport asylum seekers - World - DAWN.COM",
  "author": null,
  "content": "LONDON: The leader of Britain’s anti-migration Reform UK party, Nigel Farage, announced a plan on Tuesday to repeal human rights laws to allow for mass deportations of asylum seekers, action he said was needed to prevent “major civil disorder”.\n\nFarage said his party, which is leading in national opinion polls, would remove Britain from the European Convention on Human Rights (ECHR), repeal the Human Rights Act and disapply other international treaties that have been used to block the forced deportation of asylum seekers.\n\n“We are not far away from major civil disorder,” Farage said at a press conference. “It is an invasion, as these young men illegally break into our country.” The announcement comes against the backdrop of sustained, small-scale protests in recent weeks outside hotels housing asylum seekers, in response to concerns about public safety after some individuals were charged with sexual assault.\n\nOpinion polls show that immigration has overtaken the economy as British voters’ biggest concern. Reform UK — which has just four members of parliament but is ahead in every survey of voting intentions — is putting Labour Prime Minister Keir Starmer under growing pressure to tackle the issue.\n\nAnti-migration leader pledges to repeal UK’s human rights law\n\nIn 2024, Britain received a record 108,100 asylum applicants, almost 20pc more than a year earlier. Individuals from Pakistan, Afghanistan, Iran and Bangladesh made up the largest number of applicants for asylum last year. Much of the focus has been on those who arrive on small boats across the Channel, with record numbers arriving this year.\n\nReform said changes to asylum law meant it could deport 600,000 asylum seekers in its first term in power if it wins the next election, which is due by 2029. At the press conference, Farage asked one of his top officials, Zia Yusuf, if Britain could deport 500,000 to 600,000 people in its first term. “Totally,” Yusuf replied.\n\nSeries of gimmicks\n\nStarmer’s government and its predecessors have been wrestling for years with how to deal with undocumented migrants entering the country. Reform UK’s plans are the most radical yet and would involve signing deals with Afghanistan, Eritrea and other countries to repatriate their nationals who arrived in Britain illegally. Government minister Matthew Pennycook called Reforms proposals “a series of gimmicks” that would not work.\n\nHe said the ECHR underpinned key international accords, including the Good Friday Agreement, which ended three decades of violence that had gripped Northern Ireland since the late 1960s. Asked what would happen to that peace deal, Farage said it could be renegotiated but added that it would take years.\n\nOn Tuesday, an Ethiopian asylum seeker went on trial accused of sexual assaults against a woman and a teenage girl. His arrest last month provoked a number of high-profile protests. Farage said he was the only party leader prepared to take the action needed to tackle such public concerns.\n\n“It’s about whose side are you on,” he said.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:49:29.113Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937511/farage-unveils-plan-to-deport-asylum-seekers",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:51.000Z"
}
