{
  "title": "Karachi Company SHO, other officials face criminal cases as IHC dismisses petition - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court has dismissed a petition filed by the Karachi Company SHO seeking revocation of an order for the registration of a criminal case against him and other officers for alleged corruption, illegal detention and theft.\n\nThe controversy stems from an incident on May 7, 2025. According to the complainant, Haroon Anwar, his son was intercepted by plainclothes police officials when was driving to a market in Islamabad. The officials allegedly took his son, his car, and possessions — including a laptop, a mobile phone, and Rs 10,000 in cash — to the Karachi Company police station.\n\nThe complainant alleged that the SHO of the police station demanded Rs100,000 for his son’s release. Eventually, a sum of Rs50,000 was negotiated and paid. Despite receiving the payment, the police officials registered a false criminal case against the complainant’s son.\n\nThis prompted Haroon Anwar, the complainant, to lodge an FIR against the SHO, but the police refused to register the case based on Mr Anwar’s complaint. The complainant then approached the court of the Additional Sessions Judge (West) under Sections 22-A/B of the Criminal Procedure Code (CrPC), which empowers justices of the peace to direct the registration of an FIR if a cognisable offense is disclosed.\n\nOn July 19, 2025, Additional Sessions Judge Rana Mujahid Rahim accepted the application. The judge noted that the complaint clearly disclosed cognisable offenses and that the SHO had no authority to refuse registration of FIR.\n\nThe court was also shown video evidence that prima facie supported the timing of the illegal pickup. Judge Rahim directed the SSP (Investigation) to register a case immediately.\n\nChallenging this order, police officials through their lawyer, filed a writ petition in the Islamabad High Court. The petitioner’s counsel argued that the complaint was mala fide, citing that 15 other FIRs were already pending against the complainant, Haroon Anwar.\n\nHe also presented an internal police inquiry report dated July 8, 2025, from the SP, Saddar Zone, which had found the allegations against the SHO to be “unfounded and unsubstantiated”.\n\nHowever, Justice Saman Rafat Imtiaz of the Islamabad High Court was not persuaded.\n\nIn the order the court held that the statutory duty of a police officer under Section 154 CrPC is to register an FIR whenever information about a cognizable offense is received, without any pre-registration inquiry into its truthfulness.\n\nThe judge emphasised that the veracity of the allegations could only be determined during a trial, not at the stage of registration. The court cited precedent, including Jehanzeb Khan vs. Justice of Peace which reinforces that a justice of peace is not bound by any police report when deciding an application under Section 22-A CrPC.\n\nDismissing the petition, the court stated that the mere existence of pending cases against the complainant could not presumptively establish malice on his part. Furthermore, determining such malice would require recording evidence, which is not possible in the court’s constitutional writ jurisdiction.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:53:45.734Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937408/karachi-company-sho-other-officials-face-criminal-cases-as-ihc-dismisses-petition",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:55:13.000Z"
}
