{
  "title": "Leverkusen sign former Real defender Vazquez - Sport - DAWN.COM",
  "author": null,
  "content": "BERLIN: Former Real Madrid right back Lucas Vazquez has joined Bayer Leverkusen until 2027, the German club announced on Tuesday.\n\nThe five-time Cham­pions League winner joins on a free transfer, having been a free agent since his Real contract expired in the summer.\n\nThe 34-year-old completed a medical in Real and is in line to play in Leverkusen’s next match, away at Werder Bremen on Saturday.\n\nIn a statement, Vazquez said he was “looking forward to continuing my career at Leverkusen”.\n\nVazquez revealed former Leverkusen coach and current Real manager Xabi Alonso and one-time Leverkusen player Dani Carvajal, who is now at Real, helped convince him to join the German side.\n\n“With Vazquez we are signing an extremely experienced player who has won everything there was to win with Real Madrid over the past ten years,” said Leverkusen sporting director Simon Rolfes, adding the newcomer would be­come “a pillar” of the side.\n\nLeverkusen were looking for a right-back after Jeremie Frimpong’s move to Liverpool.\n\nOther than a short stint at Espanyol, Vazquez spent his entire career with Real, winning four La Liga titles.\n\nTrent Alexander-Arn­old’s arrival at Real meant Vazquez fell lower in the pecking order at right back, but the nine-time capped Spanish player wanted to continue his career.\n\nUnbeaten domestic double winners two seasons ago, Leverkusen have under­gone a complete rebuild this summer, with several key players leaving the club.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:49:30.492Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937473/leverkusen-sign-former-real-defender-vazquez",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:46.000Z"
}
