{
  "title": "Tokyo-bound Duplantis, Lyles headline Diamond League finals - Sport - DAWN.COM",
  "author": null,
  "content": "ZURICH: Pole vault world record holder Armand ‘Mondo’ Duplantis will aim to win a fifth successive Diamond League title on Wednesday in Zurich, the Swiss city hosting the circuit’s finals just two weeks before the world championships in Tokyo.\n\n“I have to be focused, I can’t slack,” said the US-born Swede, who has been in electric form, setting a 13th world record, of 6.29 metres, in Budapest earlier this month.\n\n“High expectations are better than no expectations. It’s a good problem, honestly,” he said of the public’s perception of the current state of the pole vault competition.\n\n“It’s bringing people to watch us, jumping high.”\n\nAsked whether the 6.30m barrier could soon be breached, Duplantis played a straight bat.\n\n“I try to maximise my days as much as I can. And if I feel like that on the day, it’s a day that I have the possibliity to break the world record, I’ll go after it.\n\n“It would be amazing to do it here, it’d probably even more amazing to do it in Tokyo.\n\n“It really is just a beautiful circus act that we do and I think we can entertain anyone anywhere in the world.”\n\nDuplantis will compete in one of six field disciplines held at a street event on Zurich’s Sechselautenplatz, directly in front of the city’s iconic opera house.\n\nOlympic champion Yaroslava Mahuchikh will resume her rivalry with Australia’s Nicola Olyslagers in the women’s high jump while there is also the men’s long jump, the women’s pole vault, and the shot put for both male and female throwers.\n\n“I’m ready to jump!” said Mahuchikh, the Ukrainian who set a world record of 2.10m last year.\n\n“I started my season very well. The main thing now is to get in shape for Tokyo,” she added in reference to the Sept 13-21 worlds in the Japanese capital.\n\n“It’s exciting, it’s the main competition of the season. I’m going to Tokyo to protect my title.”\n\nThe remaining 26 Diamond League champions will be crowned in the course of a bumper programme at the Letzigrund Stadium on Thursday.\n\nThe array of global stars on show includes the likes of Olympic 100m and 200m champions Noah Lyles and Letsile Tebogo.\n\nThey face off in the men’s 200m, with Botswana’s Tebogo hunting a first ever Diamond League title and US sprinter Lyles looking to win the trophy for a record-breaking sixth time.\n\n“With Weltklasse Zurich being the last race before the world championships, I am looking to run something special,” said Lyles, who had to be happy with 200m bronze at the Paris Olympics in a race won by Tebogo.\n\nOlympic and Diamond League champion Julien Alfred also lines up in the women’s 100m, while 800m star Emmanuel Wanyonyi and 400m hurdles ace Femke Bol will also be looking to defend their series titles.\n\nThe majority of athletes have qualified for the Diamond League finals thanks to points accrued in the 14 meets to date, while a handful will compete in Zurich on global or national wildcards.\n\nThere is, however, no place for Jakob Ingebrigtsen in the men’s 1,500m.\n\nThe Norwegian, who has struggled with an achilles injury since winning double world indoor golds in Nanjing in March, was refused a wildcard because rules stipulate that he must have competed in at least one Diamond League meet during the outdoor season.\n\nHe instead heads to a training camp in the Japanese city of Kyoto ahead of Tokyo to fine-tune preparation for a tilt at a 1,500-5,000m double.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:54:22.646Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937469/tokyo-bound-duplantis-lyles-headline-diamond-league-finals",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:46.000Z"
}
