{
  "title": "PCB officials concerned over national team’s continued decline - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan Cricket Board (PCB) officials are concerned over the continued decline in the performance of national sides across formats during the past two years, attributing it largely to frequent changes in the board’s leadership, selectors, coaches and captains.\n\nAccording to sources, the matter came under detailed discussion at the recent meeting of the Board of Governors (BoG), which lasted nearly three hours, Dawn has learnt.\n\nPCB chairman Mohsin Naqvi also attended the session for about 15 to 20 minutes. During the meeting, various departments of the PCB including International Cricket, High Performance Cen­tre, Legal Affairs and Women’s Cricket presented their reports to the BoG.\n\nThe members, sources said, voiced dissatisfaction over the performance of the men’s senior team, women’s team and Pakistan Shaheens, questioning the International Cricket department over the ongoing slump.\n\nThe department, in its response, pointed to the instability at the top level, noting that the board has worked under four chairmen in less than three years — from Ramiz Raja (2021-23) to Najam Sethi and Zaka Ashraf (both with six-month tenures in 2023-24) and now Mohsin Naqvi since February 2024. With each chairman bringing wholesale changes, captains, selectors and coaches have been reshuffled repeatedly, creating further uncertainty.\n\nThe department also highlighted that in 2021 the PCB had restricted bilateral Test series to just two matches. However, from the next ICC cycle beginning in 2027, the board has decided to revert to full home-and-away series comprising at least three Tests, three ODIs and three T20 Internationals.\n\nWhile acknowledging the financial cost of this approach, officials said it was necessary to improve performance standards.\n\nAnother factor cited was the closure of the National Cricket Academy in recent years, which, according to the Inter­national department, adversely affected player development. The board has now decided that Pakistan Shaheens will regularly play series against major opponents, often alongside the senior team.\n\nThe High Performance Centre recommended that long-term appointments be made for captains, coaches and selectors to ensure continuity. It assured BoG members that all domestic academies would soon be fully operational, with positive results expected within a year. While offering to provide input on appointments, HPC officials stressed that the final decisions rested with the PCB chairman.\n\nPublished in Dawn, August 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:54:03.792Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937470/pcb-officials-concerned-over-national-teams-continued-decline",
  "dateList": "2025-08-27",
  "date_published": "2025-08-26T23:54:46.000Z"
}
