{
  "title": "PTI MNAs begin resigning from standing committees after Imran’s orders - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI lawmakers have begun resigning from membership and chairmanship of all standing committees in the National Assembly on Wednesday after instructions from party founder Imran Khan.\n\nThe Election Commission of Pakistan (ECP) in July and August disqualified a large number of PTI members and leaders in relation to their involvement in the May 9, 2023 riots against Imran’s arrest, sparking protests in the National Assembly.\n\nNA Director General (Media) Zafar Sultan Khan told Dawn.com today that Ali Asghar Khan and Faisal Amin had sent their resignations as standing committee members to NA Speaker Ayaz Sadiq.\n\nA statement from PTI Chief Whip Aamir Dogar also said: “PTI members of the National Assembly have started acting on the instructions of founding chairman Imran Khan. PTI members of standing committees have started sending their resignations. Many members have submitted their resignations to the National Assembly Secretariat.”\n\nHe said the remaining lawmakers would send their resignations to the NA Secretariat tomorrow.\n\nThe resignation announcement took place following a meeting of PTI’s political committee that ended at 3:30am this morning, according to PTI MNA Sanaullah Khan Mastikhel.\n\nThe MNA today said that PTI members were resigning from memberships and chairmanships of all standing committees.\n\n“PTI has resigned from the PAC (Public Accounts Committee) and other committees,” he said in a video announcement before the Public Accounts Committee meeting, adding that political matters would be handed over to the political committee for further consultation.\n\nAccording to the opposition leader’s chamber, the decision on resignations had been made, and members, including Junaid Akbar, had written their resignations, but the resignations had not been formally submitted to the speaker as yet.\n\nConfirming his move to Dawn.com, Akbar said there was no room nor desire for any other decision once Imran had ordered the resignations. “There is no use in remaining in the standing committees if there is no momentum towards further relief for Imran or his release.”\n\nMeanwhile, Mastikhel added that the resignation from the committees was decided on the instructions of Imran after a meeting of four and a half hours, extending his thanks to the PTI founder for reposing his full trust in the political committee.\n\n“As the decision was taken in the late hours of the night, today we also have a parliamentary party meeting … whatever Mr Khan orders, we will follow accordingly,” he said.\n\nMastikhel also added that the second decision made by the political committee was to field a candidate in the vacant seat of the late Mian Azhar’s constituency following his death.\n\nThe late Azhar’s son, Hammad Azhar, clarified in a post on X yesterday that the decision to boycott by-elections was due to the PTI members in those areas being “unjustly disqualified”, while the matter of Mian Azhar’s natural death was a different case, according to Imran.\n\n“He (Imran) also said that due to the demise, someone from Mian Azhar’s family or a candidate nominated by Hammad Azhar will contest the election from here,” Hammad added.\n\nChairman Junaid Akbar did not attend the PAC meeting today, where the Cabinet Division, Oil and Gas Regulatory Authority (Ogra) and National Electric Power Regulatory Authority’s (Nepra) audit objections were under consideration. The meeting instead took place under the chairmanship of Naveed Qamar.\n\nThe political committee expressed deep concern over the daily hearings related to the Toshakhana trial in Adiala Jail, saying they would “affect the fundamental rights of the accused” and create obstacles in the delivery of justice.\n\n“The PTI considers the members disqualified in the May 9 cases as its true representatives,” the committee added, saying it would boycott by-elections being held in the constituencies of disqualified members.\n\nAccording to the announcement, elections will be held in the NA-129 constituency of Lahore.\n\nEarlier this month, members of the opposition party staged a vociferous protest in the NA against the continuing convictions of its leaders and subsequent disqualifications of its lawmakers.\n\nSeparately, Information Minister Attaullah Tarar said on Geo News show ‘Capital Talk’ that PTI MNAs should not resign from standing committees, saying he particularly attended every session of the Senate standing committee by Barrister Ali Zafar out of respect and the government complied with his orders.\n\nHe also appreciated the input of PTI lawmakers in standing committees and said attempts were always made to engage them in dialogue and address their concerns.\n\n“I think the standing committees have a very important role so they should review the decision to resign from them.”\n\nMeanwhile, PTI Secretary General Salman Akram Raja blamed the government as well for the decision to resign from the standing committees, saying the orders of committee chairmen were not heeded.\n\nHe also alleged there was no use to contesting the by-elections since the results were already rigged and predecided.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:49:11.344Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937565/pti-mnas-begin-resigning-from-standing-committees-after-imrans-orders",
  "dateList": "2025-08-27",
  "date_published": "2025-08-27T10:00:37.000Z"
}
