{
  "title": "First Hajj flight to take off from Karachi at wee hours on Sunday: Talha",
  "link": "https://www.app.com.pk/national/first-hajj-flight-to-take-off-from-karachi-at-wee-hours-on-sunday-talha/",
  "date_published": "2023-05-20T14:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Minister for Religious Affairs and Interfaith Harmony Senator Muhammad Talha Mahmood on Saturday informed that the first Hajj flight would take off from Jinnah International Airport, Karachi at 0450 hours on Sunday.\nAddressing a press conference here, he said almost 175,000 people would proceed for spiritual journey to perform Hajj rites this year on both government and private schemes.\nThe minister further informed that the Ministry of Religious Affairs and Interfaith Harmony had refunded Rs55,000 as ‘Qurbani amount’ to both regular and sponsorship scheme pilgrims in their bank accounts.\nHe explained that earlier it was decided that the ministry would arrange Qurbani (sacrifice) for the pilgrims but due to delay in the decision, the majority of pilgrims had arranged this sacred rite on their own.\nTalha advised the pilgrims of both regular and sponsorship schemes to collect Rs55,000 from their respective banks before their departure for Hajj as the same would not be reimbursed to them in Saudi Arabia.\nHe said the Saudi government-run Qurbani booths would be available near government residences, providing a hassle-free process for purchasing the coupons.\n“In the event of any issues or difficulties in acquiring the Qurbani amount, the complaint could be lodged with the accounts officer of the ministry directly at 0519208552,” he added.\nThe minister said this year more than 26,000 pilgrims would benefit from the ‘Road to Makkah’ project from the Islamabad International Airport, a notable increase from the 16,000 pilgrims served last year.\nHe said this efficient facility aimed at streamlining the immigration and customs procedures for the intending pilgrims departing from the federal capital, enabling them to swiftly embark on their spiritual journey.\nHe explained that the initiative would expedite the processing of pilgrims at the Saudi airport in order to minimize wait times, allowing them to proceed directly to their designated buses upon arrival.\nTalha further emphasized the government’s commitment to expanding the ‘Road to Makkah’ project to other airports in Pakistan, stating that plan was underway to extend this convenient service to additional cities, Lahore and Karachi next year. The recent visit of the Saudi Deputy Interior Minister to Pakistan had been instrumental in strengthening bilateral cooperation, he added.\nAnticipating a record-breaking number of pilgrims, he affirmed that meticulous arrangements had been made to ensure a smooth Hajj experience for the estimated 175,000 Pakistanis who would perform the pilgrimage this year.\nHe clarified that the provision of free Hajj would not be permitted, and instead, efforts were being made to provide comprehensive assistance to the pilgrims, including dedicated Hajj assistants to guide them throughout their journey.\nThe minister also conveyed gratitude of 250 million Pakistani people towards Saudi King Salman bin Abdulaziz and Crown Prince Mohammed bin Salman, underscoring the deep-rooted connection between the Pakistani populace and the holy cities of Makkah and Madina.",
  "retrievedAt": "2025-08-11T08:31:37.761Z"
}
