{
  "title": "French Embassy to enhance educational opportunities for Pak’s youth in France: Ambassador",
  "link": "https://www.app.com.pk/national/french-embassy-to-enhance-educational-opportunities-for-paks-youth-in-france-ambassador-2/",
  "date_published": "2023-05-20T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):Ambassador of France to Pakistan, Nicolas Galey on Saturday said that the French Embassy would enhance educational opportunities for Pakistani youth in France by providing more scholarships and strengthening the Campus France Pakistan office.\nAddressing the French Alumni Day in Islamabad, he said that the mission of the Campus France Pakistan office is to promote studies in France and help students find the establishment corresponding to their project among the vast offer of higher education in France, including many taught in English.\nThe role of alumni is essential because they are the best ambassadors of higher education in France and an aspiring source to explain educational and living experiences in France to their Pakistanis.\nHe stressed that both countries are working to enhance bilateral relations and cooperation, particularly in higher education.\nThe day was being celebrated worldwide to reconnect the hundreds and thousands of people from all countries who got their higher education and professional training, or part of it, in French universities or other educational institutions, the Ambassador noted with pleasure.\nHe stressed that the French Alumni Pakistan was a Pakistanis platform who have attended French universities and can inspire the younger generation to choose those prestigious institutions to build a successful career. He said that the relationship between Pakistan and France in higher education dates back to the early 1960s, adding that the number of Pakistani students recently decreased. Still, the French Embassy is determined to reverse this situation with the support of the Pakistani authorities.\nHe said the efforts to enhance Pakistani students’ number at French universities began in 2003 when the HEC launched a scholarship program for PhDs in France. So far, 670 Pakistani students have received higher education in France.\nThe Ambassador said the French government and universities fund 30 scholarships for Pakistani students annually. In European countries, too, dozens of students get scholarships each year, he said. Only last year, 170 students got scholarships to study in Europe; 40 started their Masters’s degrees in France. More than 250 Pakistani students and researchers choose France annually for a semester exchange, an internship, a short course, a full master/Ph.D. degree, professional training, or a research study.",
  "retrievedAt": "2025-08-11T08:31:41.229Z"
}
