{
  "article_id": "2025-01-06_3b68d7a4e3bb06b9961c812a02c6d0c2",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883492/south-africa-beat-pakistan-by-10-wickets-to-win-test-series-2-0",
    "retrieved_at": "2025-08-26T07:28:49.138Z"
  },
  "metadata": {
    "title": "South Africa beat Pakistan by 10 wickets to win Test series 2-0 - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-06T11:23:37.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/0622192574c8e18.jpg",
    "categories": [],
    "word_count": 514,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "South Africa made light work of a modest target of 58 to claim victory against Pakistan by 10 wickets at a sun-bathed Newlands on Monday, wrapping up the series 2-0 inside four days of the second and final Test. Pakistan had held up the home side's victory charge with a second innings score of 478 having been asked to follow on, their effort led by captain Shan Masood's fine 145 on a docile wicket. But seamer Kagiso Rabada (3-115) and spinner Keshav Maharaj (3-137) kept chipping away at the Pakistan wickets, aided by some poor shot selection. David Bedingham was promoted to open in the South African second innings after double-centurion from their first, Ryan Rickelton, sustained a hamstring strain. Bedingham raced to 44 from 30 balls to see his side to victory in 7.1 overs. \"The result is very satisfying, it was good old Test cricket. There was something in it for the bowlers with the new ball and then the wicket really flattened out,\" South Africa captain Temba Bavuma said. \"It was a good experience that will hold us in good stead as a team. Certain parts of the game we let go, but all those learnings will make us better.\" South Africa have won their last seven Tests in a row, their second-best run of victories behind a nine-game winning streak between 2002-2003. It is the perfect preparation for their appearance in the World Test Championship final against Australia at Lords from June 11-15. Pakistan resumed the fourth day on 213 for one, though they were effectively two down after in-form batter Saim Ayub fractured his ankle while fielding on the first day. Despite the wicket offering little to the bowlers in terms of seam or turn, South Africa picked up two wickets in the morning session, as Khurram Shahzad was caught by Maharaj at point off seamer Marco Jansen for 18. Rabada bowled Kamran Ghulam for 28, a delivery that nipped back off the wicket and crashed into the off-stump. The home side took the new ball shortly after lunch and that brought two more wickets, including the key scalp of Masood, who was trapped leg before wicket by 18-year-old fast bowler Kwena Maphaka, South Africa's youngest ever Test player. Saud Shakeel scored 23 before he was caught at second slip by Aiden Markram off Rabada. Mohammad Rizwan (41) and Salman Agha (48) continued to show resistance but both fell to Maharaj, who also claimed the wicket of Aamer Jamal following a breezy 34. Pakistan's total of 478 is the highest-ever follow-on score by a visiting team in South Africa, a vastly improved display after they had been bowled out for 194 in their first innings. \"We didn't start off well with ball and bat, conceding too many runs [in South Africa's first innings of 615] and folded quite early in our first innings on a really nice surface,\" Masood said. \"The fightback after that was the thing you look for as a team and individuals really stepped up. [But] we need to learn how to win the crucial moments.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}