{
  "article_id": "2025-01-06_9f2f403d808801fb6569dd7acaca2649",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883413/pakistan-reaffirms-support-for-kashmir-plebiscite",
    "retrieved_at": "2025-10-12T00:44:17.195Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms support for Kashmir plebiscite - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-06T00:46:44.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/677b268d7ea29.gif",
    "categories": [],
    "word_count": 593,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD: President Asif Ali Zardari and Prime Minister Shehbaz Sharif have said Pakistan will continue to extend political, diplomatic and moral support to Kashmiris' right to self-determination. They made these remarks in their messages on January 5, observed as Kashmiris' Right to Self-Determination Day. The day commemorates the UN Security Council resolution passed in 1949, affirming the Kashmiris' right to decide their future through a UN-sponsored plebiscite. In separate messages, the two leaders said that this year, Kashmiris around the world observed the 76th anniversary of the UN resolution guaranteeing a free and fair plebiscite in Jammu and Kashmir. PM, president, political leaders urge global powers to help implement UN resolutions The president said India had denied the right to self-determination to the people of held Kashmir for over seven decades and subjected them to oppression, violence and systemic brutalities. PM Shehbaz said the time has arrived for the international community, including the UN, to live up to their promises and take meaningful measures to enforce the resolution. PPP, JUI-F chiefs reaffirms resolve In his message, PPP Chairman Bilawal Bhutto-Zardari highlighted the suffering of the people of held Kashmir and said it was not just a regional issue but a test of humanity's conscience. He voiced deep disappointment at the global community's silence over the relentless atrocities faced by Kashmiri people. Mr Bhutto-Zardari said the world must fulfil its promises to the Kashmiri people and realise their inalienable rights. He reiterated the right to self-determination was a fundamental principle enshrined in international law and promised to the people of Kashmir through UN resolutions. The PPP chairman paid tribute to the unyielding resolve of Kashmiris, who have steadfastly endured decades of oppression while standing firm in their demand for dignity, justice, and freedom. \"Today, we stand shoulder to shoulder with our resilient Kashmiri brothers and sisters who have faced relentless Indian oppression,\" he said, claiming the PPP has always been \"at the forefront of defending the Kashmir cause\" and will continue to raise its voice on every platform. He committed to extending unwavering political, moral, and diplomatic support to the oppressed people of occupied Kashmir until their freedom is achieved. \"Together, we will ensure that the dream of a peaceful, free Kashmir, liberated from Indian occupation, becomes a reality.\" JUI-F chief Maulana Fazlur Rehman also issued a strong statement commending the resolve of Kashmiris for their right to self-determination. The Kashmiri people will prevail in their struggle to attain their right to self-determination, as recognised by international resolutions, Mr Rehman said. The JUI-F chief lamented India's intransigence as the main obstacle to the implementation of UN resolutions. He also expressed disappointment over the UN's failure to fulfil its responsibility to hold a plebiscite in the region. The JUI-F chief condemned India for its brutal repression and ongoing genocide of Kashmiri Muslims, urging the global community to take notice of the grave human rights violations. Reiterating his support for the Kashmiris' struggle, Mr Rehman said, \"We stand shoulder to shoulder with our Kashmiri brethren in their quest for freedom.\" The JUI chief concluded by expressing solidarity with the Kashmiri people and urged global powers to implement UN resolutions. National Assembly Speaker Sardar Ayaz Sadiq also reaffirmed Pakistan's unwavering support for Kashmiris. In his message, the speaker praised Kashmiris for their steadfast struggle but regretted that despite the lapse of more than 70 years, UN resolutions remain unimplemented. The speaker strongly condemned the Indian government's actions of August 5, 2019, when it unilaterally abrogated the special status of held Kashmir. Published in Dawn, January 6th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}