{
  "article_id": "2025-01-06_fcc16f6061ab0f13d227a7fe0ecf923f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883407/efforts-underway-to-recover-abducted-persons-says-balochistan-cm",
    "retrieved_at": "2025-10-12T00:44:33.583Z"
  },
  "metadata": {
    "title": "Efforts underway to recover abducted persons, says Balochistan CM - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-06T00:46:45.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 289,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA: Balochistan Chief Minister Sarfraz Bugti claimed on Sunday that all seven kidnapped persons, including an 11-year-old student, would be recovered soon as the government is taking strict measures in this regard. Six of the victims were abducted from a picnic point during Eidul Azha holidays. Talking to journalists, he said that kidnapping of six persons from the Shaban area was a sensitive issue as they have been claimed by a banned outfit. He said he was in contact with the father of the kidnapped student who he said has been kidnapped for ransom. Referring to a resolution moved by opposition members in the house, the chief minister said that changing \"B\" Area of Levies into \"A\" area of police in Balochistan is a sensitive matter as the Levies Force is a tribal force, but it needs reforms. \"The issue of having two parallel forces in the province, the police and the Levies Force, now needs a decision and this will have to be done sooner or later as two parallel forces cannot continue for an indefinite period in the province,\" Mr Bugti said. Discussing the issue of blockade of roads and highways in the province, he said protesters have been given an opportunity to hold talks with the government, otherwise the government knows how to exercise its powers according to the law. He urged the protesters to consider the difficulties faced by people and patients when national highways are blocked. On the issue of electricity load-shedding in the province, the chief minister criticised distribution companies for causing inconvenience to the masses and emphasised that electricity and gas supply should be ensured, particularly in winter, to help people cope with the severe cold. Published in Dawn, January 6th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}