{
  "article_id": "2025-01-06_c4ed76ac4fb5a45d0d22a33fd6785037",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883410/data-shows-afghanistans-polio-situation-better-than-pakistans",
    "retrieved_at": "2025-10-12T01:11:04.024Z"
  },
  "metadata": {
    "title": "Data shows Afghanistan’s polio situation better than Pakistan’s - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-06T00:46:45.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 571,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD: While the global community has been eyeing on Pakistan and Afghanistan, only two countries which have been reporting polio cases, the situation in war-prone Afghanistan is much better than Pakistan. According to statistics, Afghanistan reported 25 cases of polio in year 2024. On the other hand, Pakistan has reported 68 cases of the crippling disease and the clock is still ticking as reports of a number of samples, collected last year, are yet to receive. However, a senior official of the Polio Programme of Pakistan said that Pakistan has been following the policy of sharing the facts and Pakistan's reporting system is much better, as compared to Afghanistan, due to which there was a strong possibility that in Afghanistan a number of cases might not be reported. He said Prime Minister Shehbaz Sharif, taking notice, has formed a new team comprising his focal person for polio eradication Ayesha Raza Farooq and a national coordinator Anwarul Haq to turn the tide again. A document of Global Polio Eradication Initiative (GPEI), available with Dawn, shows that as of Dec 26, Pakistan reported over 67 cases as compared to Afghanistan's 25 cases. The document shows that while 60 per cent boys and 40pc girls were infected with the virus in both countries, in Afghanistan 16pc of infected children had zero dose of oral polio vaccine (OPV). In Pakistan 12pc victims had zero dose of OPV. As for as the environmental samples were concerned, in Pakistan 591 sewage samples were tested positive from 106 sites but in Afghanistan only 100 samples were found positive from 24 sites. While in Pakistan polio has spread to 83 districts, in Afghanistan the virus is limited to 11 provinces. The document further reveals that in Pakistan 45.4 million population is under five, in Afghanistan the number of less than five years old children is 11.2 million. In both countries nine polio campaigns were carried out. Officials of Polio Programme Pakistan said that it was a fact that there were some issues in Pakistan due to which polio could not be eradicated despite the fact that the programme has been working in the country since 1994. \"According to our perception a number of cases are not reported in Afghanistan. They don't collect samples of paralysed children. On the other hand, in Pakistan every union council is bound to send sample of every paralysed child due to which we receive thousands of samples every year,\" he said. He said in Pakistan, the programme has started doing mapping of the refusal clusters, asserting that the situation will start improving during ongoing year. He said that Pakistan's journey to become polio free has been on a rocky road witnessing many ups and downs. \"On multiple occasions, the country seemed like getting to a trajectory leading it towards finish line. Nevertheless, something unusual always happened to reverse the gains letting the virus to come back with full force. As we look at the case counts, Pakistan reached double figures around 2005-6 and seemed ahead of neighbouring India to join the list of polio-free countries. \"Nevertheless, the implications of war on terror in the region created new challenges of security-related inaccessibility to vulnerable children, largely in erstwhile Fata and scattered pockets in mega city of Karachi and Peshawar as well. The immunity gap created, thereby, helped the virus thrive, paralysing hundreds of vulnerable children once again,\" he said. Published in Dawn, January 6th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}