{
  "article_id": "2025-01-06_ee93a1c5310d0e9e994ce02f712a9f7d",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882236/the-year-they-came-for-the-internet",
    "retrieved_at": "2025-08-26T07:29:05.723Z"
  },
  "metadata": {
    "title": "The year they came for the internet - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-06T06:50:38.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/04165451688461f.jpg",
    "categories": [],
    "word_count": 2339,
    "reading_time_minutes": 12
  },
  "content": {
    "article_body": "So there we have it. Pakistan has topped the world in terms of financial losses suffered as a result of outages and shutdowns of internet and social media apps in 2024, according to Top10VPN.com, an independent VPN reviewer. It's not like this wasn't expected - well, for everyone, except the people actually making the decisions, it seems. In fact, the people in power would simply shrug at these staggering figures. \"People should use internet less and for important matters only,\" the parliamentary secretary for cabinet division, Syed Sajid Mehdi, famously said on December 22, 2024 - summing up the attitude of the ruling dispensation led by the PML-N. For context, the throttling of the internet or blocking of specific social media apps didn't start in 2024. But what was different this year were the infrastructural, legal, and policy changes, which fundamentally changed the experience of the internet in Pakistan, bringing down its speed among the lowest 12 per cent in the world, trailing behind war-torn Palestine and Libya. Meanwhile, X remained blocked, and most VPNs have been choked with an ironic, draconian, and uncertain VPN registration regime being put in place with express inspiration from non-democratic countries like China and the UAE. The precursor to most internet issues was the internet shutdown that cost Pakistan its democracy: the February 8, 2024, shut down on the day of the general election that led to a controversial election result, largely because election officials could not upload the results within the stipulated time. The absurdity doesn't end here though. This article is an attempt to chronicle the many instances of internet outages, throttling and social media app suspensions throughout 2024, which earned us the top spot on Top10VPN.com's list and caused a colossal loss of $1.62 billion. X, formerly Twitter, was blocked without any notice or justification on February 17, 2024, soon after evidence of rigging in the February 8 election started being shared on the platform, and the Rawalpindi commissioner held a press conference admitting to receiving orders to rig the election. It took several notices to the federal government and the PTA by different high courts for the government to admit that the app was indeed blocked at the request of the Ministry of Interior. The PTA, for its part, acted like it was bound by the government's instructions, even though the Pakistan Electronic Crimes Act (Peca) vests the power only with the authority to block content independent of the federal government. Despite orders by the Sindh High Court for the X ban to be lifted, it remains blocked to date, with the foreign minister, interior minister, and IT minister defending the ban under the pretext of national security, without qualifying what exactly that means. Ironically, Prime Minister Shehbaz Sharif, IT Minister for State Shaza Fatima, and other cabinet members continue to use X using a VPN, which they have also blocked in the country, by practice testifying to the absurdity of banning the platform in the first place. 2024 also saw a range of laws and notifications violative of basic rights over the internet, without any public debate or meaningful multi-stakeholder consultations. These include the Punjab Defamation Act passed by the Punjab Assembly on May 20, 2024, which effectively divides citizens into two tiers: public officials with higher privileges and protections, and then the rest of the taxpayers who pay the salaries of these very public officials. There was also talk of a Digital Rights Protection Authority (DRPA) being set up through an amendment to Peca at the end of April. The news resurfaced in early December with the additional proposal of changing definitions in the Peca law to add VPNs, \"fake news\" with a penalty of five years, and empowering the DRPA to block online content with added offences including criticism of military and judiciary. Additionally, a National Cybercrime Investigation Agency (NCCIA) was proposed as the investigation agency under Peca, touted to replace the FIA Cybercrime wing that has been the agency for investigating cyber crimes under Peca since 2016. After creating confusion, the proposal was scrapped in December. A National Forensics and Cybercrime Agency (NFCA) was also proposed in December. It remains to be seen if there will be a u-turn on this as well or not. On December 16, a surprise Digital Nation Pakistan bill was [introduced in Parliament],18 again without any public consultations by the government, albeit with backing from the World Bank, reportedly for creating Digital Public Infrastructure. Ironically, the bill has invited a lot of ridicule from the PML-N's own coalition partner, the PPP, as well as the opposition, given the irony that the government responsible for degrading internet speeds and shutting it down routinely was introducing digital identity in the country. The draft law also fails to take into account the digital divide, whereby more than half the population is not even connected to the internet, with internet services not available in several regions. Add to this regular shutdowns and outages, including on election day, and there is a disaster of digital identity waiting to happen. Furthermore, in the absence of a data protection law, regular hacks and leaks from the Nadra identity database, the government seems wholly unprepared to introduce an ambitious project with little awareness of the local context. There have been talks of VPN registrations for a few years now, but the government started blocking several VPNs in Pakistan starting in late February. A few months on, the IT Minister for State Shaza Fatima hilariously blamed VPNs for slow internet speeds, followed by PTA Chairperson Major General (retired) Hafeez Ur Rehman saying on September 8 that unregistered VPNs would be blocked. At the same time, he encouraged citizens to register VPNs with the PTA - an ironic ask, given VPNs are meant for security and privacy of connections to begin with. On November 10, internet users started reporting that VPNs were completely blocked, with the PTA soon after introducing a portal for registration. The interior ministry, the ministry that seems to have the final say on most censorship and surveillance measures, demanded the blocking of all VPNs on November 15. The VPNs were being used by terrorists to facilitate violent activities, the ministry claimed. This was soon followed by an absurd announcement by the head of the Council of Islamic Ideology, who declared VPNs \"unislamic\" if used against 'national security or character assassination'. After much ridicule and confusion, the CII chief rescinded the edict as a 'clerical error'. On December 24, the PTA devised a new strategy to register VPNs by introducing a license category under which companies can apply to provide VPN services, a few weeks after the IT Minister for State Shaza Fatima repeated the interior ministry's unsubstantiated claim of VPNs facilitating terrorist activities. Much confusion around the slowdown of the internet has persisted through the year, particularly due to the lack of transparency surrounding the issue. At one point, it emerged that the Web Management System (WMS), also referred to as the Web Monitoring System, was being upgraded this year. According to report, the new system was reportedly purchased from a Chinese government firm after the lapse of the five-year contract with the Canadian company, Sandvine, for Deep Packet Inspection (DPI) technology that was installed at the gateway level. Additionally, a Chinese-style firewall also started to be set up initially with no public information, but slowly emerging details from various sources revealed that on July 23, the trial phase for installing the firewall was completed and the government was moving to purchase the new system. This was blamed for the slowdown in internet speed, and Rs30 billion were reportedly allocated in the development budget for acquisition and installation of the firewall. On August 14, an IT Ministry source admitted that Content Delivery Networks (CDNs) through the firewall were causing content to be routed through the internet backbone rather than CDNs, which was slowing down the internet. On August 15, the defence minister admitted that a firewall was being tested and said the internet \"would get better soon\". The same day, an alert for a \"huge cyberattack\" was issued, along with the government urging activation of the firewall. The audio leaks case in the Islamabad High Court filed by Bushra Bibi tracked the violation of law by intelligence agencies in the interception of phone calls and messages. On July 1, court documents revealed that the PTA had ordered telecoms to implement a mass surveillance system called the Lawful Intercept Management System (Lims). At the same time, the court documents showed, no warrant for surveillance had been issued under the Fair Trial Act, 2013. The court held that illegal surveillance cannot be taking place. However, the federal government moved the Supreme Court against the IHC verdict, and on August 19, the apex court suspended the high court order and barred the court from further proceedings in the matter. In the meantime, the federal government issued a gazette notification, authorising the ISI to intercept calls and messages or trace calls through any telecommunication system. This notification was challenged in the Lahore High Court as well as the Sindh High Court, but remains in effect, legalising mass surveillance without a warrant. Several disruptions to internet services took place in the year apart from the fateful February 8 election day network disruption. Besides slowing down internet speed, Netblocks confirmed restrictions on Facebook in Pakistan on July 17 on the occasion of Ashura. On July 21, users reported a WhatsApp disruption in Pakistan. Meta confirmed that the minister's claim of a global WhatsApp outage was false, showing that the block was Pakistan-specific. Moreover, encrypted messaging app Signal was blocked on August 26, WhatsApp and Instagram disrupted on September 21, internet suspended in areas of Lahore due to MDCAT exams on September 22, and VPNs were blocked nationwide on November 10. On November 15, internet was suspended in areas of Balochistan for \"public safety\". On November 19, new social media platform BlueSky was blocked in Pakistan, one of the first countries to make the move. On November 24, WhatsApp backends were restricted again. Mobile and internet services were disrupted again on November 25 and 26 due to the PTI's protest in Islamabad. On December 1, internet slowdown and disruption in Instagram, WhatsApp media, and TikTok was reported again. In fact, the disruptions caught so much global attention that the global #KeepItOn coalition issued a statement on December 12, asking authorities in Pakistan to stop suppressing digital rights. Needless to say, these disruptions and firewall installation led to a lot of backlash from the public and civil society. The IT industry, through the Pakistan Software Houses Association (P@SHA) warned of a mass exodus of IT companies and condemned the grave consequences of the hastily implemented firewall, which it said had slowed down the speed by 40pc and could cost the economy $300 million. The Overseas Investors Chamber of Commerce also warned that the ongoing internet disruptions could \"derail\" Pakistan's economy. On August 17, the Pakistan Business Council said several multinational companies were planning to exit amidst internet disruptions. The Chainstore Association of Pakistan also expressed serious concern over internet disruptions and their impact on businesses. On August 23, Telecom operators wrote to the PM over the internet crisis, warning that the sector could face an annual loss of Rs12 billion. The slowdown in internet speed had resulted in a daily decrease of 6,400 terabytes in internet traffic nationwide, they added. On November 29, it was reported that the firewall installation blocked the government's goal for a $1 trillion economy with the target of $60 billion form IT exports being missed. The next month, P@SHA said that one hour of internet outage in Pakistan cost the Pakistani economy $1 million. Internet outages in Balochistan and Khyber Pakhtubkhwa, especially around the time of protests by Pashtun Tahaffuz Movement (PTM) and Baloch Yagjehti Committee (BYC) also continued, cutting these important rights movements from the rest of the country and adding to the blanket of censorship. Meanhwhile, cases against journalists and activists also saw a rise in 2024. Notices were sent to journalists for a \"campaign against the judiciary\" in the beginning of the year, and after the elections, journalist Asad Toor was arrested and detained by the FIA for two weeks. Journalist Imran Riaz Khan was arrested around the same time as well. Journalist Matiullah Jan was later arbitrarily disappeared and then brought to court after public outcry the next day for his reporting and investigation into deaths during the crackdown on the PTI protest in Islamabad on November 26. On December 14, 150 journalists and vloggers were booked under Peca for \"maligning security agencies over Nov 26 incident\". Overall, the state of the internet deteriorated dismally, causing millions of dollars in losses, and denting the potential growth of the IT sector. The narrative of \"digital terrorism\" was also promoted by the army chief, signifying the seriousness of the crackdown on dissent and criticism on social media, accompanied by legal proposals for changes in laws such as Peca and the Punjab Defamation law. The installation of the firewall means the state now has sophisticated capabilities to tinker with specific functionality of applications such as WhatsApp media. The blocking of VPNs means loss of privacy and security, as well hindrance in accessing blocked content, especially the platform X. If the government is serious about a digital Pakistan where people have internet access and the IT sector can grow, the firewall will have to be disbanded and internet speeds brought to normal again. Such failed policies are bringing us to the bottom of lists in internet speed, and no one will want to invest in the country due to these issues. As we start the new year, the state must realise that the young people of Pakistan deserve better; that it must listen and consider their needs. Unless that happens, Pakistan will continue topping lists for the wrong reasons and fail to realise the potential the IT sector offers for its younger generation. Header image created with generative AI",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}