{
  "article_id": "2025-01-06_0dd55bb785f878e82bd7f688efcbd64f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1883364/84-hindu-pilgrims-arrive-from-india",
    "retrieved_at": "2025-08-26T07:29:35.971Z"
  },
  "metadata": {
    "title": "84 Hindu pilgrims arrive from India - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-06T00:46:37.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/677b17d4ae8a7.gif",
    "categories": [],
    "word_count": 209,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE: A group of 84 Hindu pilgrims arrived in Pakistan from India on Sunday to attend the birth anniversary celebrations of Shiv Avtari Satguru Sant Shadaram Sahib at Shadani Darbar in Hayat Pitafi, Sindh. Evacuee Trust Property Board (ETPB) Additional Secretary for Shrines, Saifullah Khokhar, received the pilgrims at the Wagah Border and presented bouquets on behalf of the board's chairman, Syed Ataur Rehman. Mr Khokhar assured that all necessary arrangements, including foolproof security and medical facilities, had been put in place to ensure a safe and comfortable visit for the pilgrims. The group travelled directly from Wagah Border to Shadani Darbar, where the main religious rituals and celebrations will take place. During their stay, the pilgrims are also scheduled to visit other religious sites, including Yog Mata Mandir in Aqilpur, Ghotki, Pano Aqil, Sukkur and the historic Sadhu Bela Temple. In addition, the pilgrims will spend a day in Nankana Sahib, the birthplace of Baba Guru Nanak, on Jan 14 before returning to India on Jan 15. The Pakistan High Commission in New Delhi issued 94 visas to Indian pilgrims for the event under the Pakistan-India Protocol on Visits to Religious Shrines of 1974, which facilitates religious visits between the two countries. Published in Dawn, January 6th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}