{
  "title": "PM vows not to burden consumers with higher utility bills: Firdous",
  "link": "https://www.app.com.pk/national/pm-vows-not-to-burden-consumers-with-higher-utility-bills-firdous/",
  "date_published": "2020-02-25T03:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP):Prime Minister Imran Khan on Tuesday reiterated the government’s firm resolve for not burdening the consumers with increased utility bills, by keeping the electricity and gas tariffs stable through out-of-box methods.\nBriefing the media about the decisions of the Federal Cabinet, Special Assistant o the Prime Minister (SAPM) on Information and Broadcasting Dr Firdous Ashiq Awan said the previous governments adopted anti-people policies by not passing on the power and gas generation cost to the consumers. Moreover, the Pakistan Muslim League-Nawaz regime did not increase the tariffs in the wake of Panama Papers case and 2018 for being the election year.\nThe prime minister, while chairing the cabinet meeting, advised the Ministry of Energy not to offset the power and gas generation cost by increasing their tariffs and instead find a way out by preparing a mechanism to revamp the obsolete structure of power sector, she added.\nDr Firdous said the cabinet deliberated on the challenges related to the transmission lines, which could not bear the load of over 18,000 mega watts, whereas in summer demands crossed 26,000 mega watts, causing disruption in power distribution system.\nMoreover, the cabinet expressed the determination to hold the power pilferers accountable, besides use of the latest digital technology to control line losses and theft. It was informed that some 58,387 first information reports were registered against the power thieves in 2019.\nThe SAPM said the subsidized rate of Rs 5.35 per unit for the agriculture sector and for consumers using less than 300 units would continue as Rs 162 billion had been allocated in the budget for the purpose.\nShe said Special Assistant Dr Saia Nishtar briefed the cabinet about five pro-poor programmes launched under the PM’s Ehsaas Programme. The patronization of poor segments of the society by the government was a step towards realization of the dream of State of Madina, she added.\nDr Firdous said Minister for Education and Technical Training Shafqat Mehmood presented the Pakistan National Education Plan 2020, which was approved by the cabinet after a thorough debate.\nA unified curriculum would be introduced in all the educational institutional institutions, including religious seminaries whose students would be brought to the mainstream by providing them modern education facilities.\nA comprehensive education policy would be prepared to enroll 22 million out of school children, she added.\nShe said the curriculum for grade 1 to 5 had been sent to National Curriculum Council whereas that of Grade 6 to 8 had been prepared, which would be presented at a national conference next month for approval.\nUnder the new educational policy, she said, mother languages would also be integrated in the curriculum. After 70 years, the students of Daras-e-Nizami would also benefit from information technology, she added.\nShe said under the Hunarmand Pakistan, 170,000 students would be empowered through technical training as industries, and small and medium enterprises would be involved in the youth’s career counseling process.\nDr Firdous said the government had decided to announce about 50,000 scholarships for the under-graduates.\nShe said the cabinet expressed its satisfaction over United States President Donald Trump’s acknowledgment of Pakistan’s positive role in the war against terrorism, which was a victory of the country’s positive narrative and an Indian defeat.\nThe SAPM, in a series of tweets, said Trump’s statement was an open admission of Pakistan’s efforts for the world peace.\nThe prime minister, she said, remarked that the world leaders were acknowledging Pakistan’s positive role and stressed the need to further highlight the country’s achievements on the diplomatic front and its positive image.The special assistant said the Federal Cabinet in principle decided to merge two separate bills related to the journalists’ safety, security, insurance and terrorism, and directed the ministry concerned to make a comprehensive law on the matter for approval.\nShe said the cabinet also expressed its satisfaction over the measures being taken to control inflation and their outcome in the shape of relief to the poor segments of society, besides the economy moving on an upward trajectory.\nShe said the prime minister assured support to the law minister and his team on their standing on the legal framework in line with the constitutional and legal parameters.\nDr Firdous asked the PML-N leadership to submit the authentic medical reports of Nawaz Sharif rather sending medical certificates of private laboratories. There was much difference in a medical report and a medical certificate.\nThey should tell the nation about the actual health condition of Nawaz Sharif and give access to the media to the hospital in the United Kingdom where he was under treatment, she added.\nNawaz Sharif, she said, was given relief by the government on humanitarian grounds and allowed to go to London for medical treatment, but he was found there in restaurants.\nThe PML-N leaders should now stop misleading the innocent people of the country about the health of Nawaz Sharif as despite several reminders they had failed to submit his medical reports, which were compulsory for further such relief, she added.\nDr Firdous also asked PML-N President Shehbaz Sharif to return back to Pakistan from the UK. She asked Rana Sanaullah to brief the people about Nawaz Sharif’s fresh surgery and also name of the hospital where he was admitted for any such surgery.",
  "retrievedAt": "2025-08-11T18:51:24.799Z"
}
