{
  "title": "Human Rights Council must pay immediate attention to protect human rights in IoJK",
  "link": "https://www.app.com.pk/national/human-rights-council-must-pay-immediate-attention-to-protect-human-rights-in-iojk/",
  "date_published": "2020-02-25T02:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 25 (APP):Minister for Human Rights, Dr. Shireen Mazari on Tuesday said that Human Rights Council must pay immediate attention to the protection and respect of the human rights of the people of Indian occupied Jammu and Kashmir (IoJK).\nShe said this while addressing at high-level segment of the 43rd session of the Human Rights Council in Geneva, said a message received here.\n“ I congratulate you, Madam President and members of the Bureau, for assuming stewardship of the council. I must also commend High Commissioner Bachelet, and her office, for their global human rights advocacy.” she added.\nThe minister said that this Council was the custodian of universal human rights, adding It had made strides towards amplifying and responding to the aspirations of people across the world.\nThe council’s enduring strength lied in even-handed approaches, its transparency and impartiality, she added.\nShireen Mazari said that as a founding member, Pakistan would continue to positively contribute to all the processes and mechanisms of the council.\nShe pointed out that Pakistan, in September 2019, presented a plea and petition of the Kashmiri people to this council. Meanwhile, over six months had passed and 8 million Kashmiris, already in the clutches of decades-long Indian state oppression, remained caged in the world’s largest open prison , she added.\nDrawing the attention of President of Human Rights Council, she said that Pakistan was not alone in highlighting the true face of India’s deliberate disregard of human dignity as well as its blatant breach of its international human rights obligations, adding US Congress, EU parliamentarians, UN Secretary General, UN High Commissioner for Human Rights, Human Rights organizations and the international media had highlighted these issue.\nAmnesty International had rightly termed India as the “Internet shutdown capital of the world”, she added.\nThe minister said, ” I do not need to remind the council that all this represents clear breaches of multiple international human rights instruments that India is party to. Further, it exposes the real mindset of a regime that pretends to be a bastion of democracy, federalism and secularism, and aspires to be a permanent member of the United Nations Security Council”.\nUnfortunately,Mazari added, India was attempting to buy political support and silence critics on its systematic human rights abuses in IoJK and of Muslims in India, through offers of lucrative arms and other business deals.\nThe minster said “What is happening in IoJK is not a “country specific situation” in this Council’s parlance. The atrocities and abuses are being inflicted upon the people of a disputed and occupied territory.\nThe issue of Jammu and Kashmir has been on UN Security Council agenda for over 70 years, marked as disputed territory in all maps of the UN. It is not and can never be an internal matter for India”.\nShe said last year, Pakistan opened -up the Kartarpur Corridor and constructed the world’s largest Gurdwara, allowing unimpeded access to the Sikh community from across the world, in Pakistan adding 18 denominations of Christian churches were present in the country, where devotees freely professed their religion.\nPakistan had a flourishing Christian Missionary school system, she pointed out.\nShireen Mazari said “We have pioneered a wide-ranging social protection programme (Ehsaas or Compassion) aimed at alleviating the plight of the marginalized, through financial empowerment of women, provision of shelter to the homeless and through removal of financial barriers to accessing health and education.”\nIf India had nothing to hide, it should allow unhindered access to the Commission of Inquiry and independent observers in IoJK, she added.\nPakistan stood ready to allow access on its side of the Line of Control, together with similar access to the Indian Occupied side, she said adding “We also urge the High Commissioner to continue with the reporting process on Jammu and Kashmir”.\nShe also said that the council and the wider international community must act and demand from India regarding Occupied Jammu and Kashmir to rescind all illegal actions of 5th August 2019.\nShe demanded to immediately desist India from changing the demographics of the occupied territory.\nThe minister also demanded to lift the lockdown and communications blackout and allow access to medicines, food and other essential items for the Kashmiri people in the occupied valley.\nShe also demanded to release all arbitrarily detained Kashmiri leaders, professionals and activists, including young boys who had been abducted by Indian security forces.\nShe also urge the council to pressurise India to repeal all draconian laws which allow its occupation forces to continue committing atrocities with impunity in IoJK.\nShrireen Mazari also demanded to prohibit the use of force by India, specifically the use of live ammunition and pellet guns against unarmed civilians and ensure drawdown of its over 800,000 troops that were currently holding the entire Kashmiri population under siege through brute force in the occupied valley.\n“In line with our founder Quaid-i-Azam Mohammad Ali Jinnah’s vision of a humane and egalitarian state, we have enacted progressive laws to protect children, women, minorities, the transgender community,the differently-abled and other marginalized segments”, she added.\nThe minister said that Pakistan hoped that this Council would deliver on its promise and its principles.",
  "retrievedAt": "2025-08-11T18:51:33.489Z"
}
