{
  "title": "Musk ‘surprised’ US taxpayer money going to Afghan Taliban - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The billionaire owner of Tesla and SpaceX — who has been named by US President-elect Donald Trump as his potential efficiency tsar — on Tuesday appeared shocked to learn that the US was sending US taxpayer money to Afghanistan.\n\nElon Musk, who has been tapped to lead a new Department of Government Efficiency (Doge) under the incoming administration, tweeted his surprise over this fact — which was brought to his attention by former CBS journalist Lara Logan.\n\n“Imagine giving these terrorists $40 million dollars of your tax money every week? Sound crazy? Because it is — pure insanity,” she commented, posting a letter, written by a senior Republican lawmaker urging Trump to halt US aid to Afghanistan.\n\n“Are we really sending US taxpayer money to the Taliban?” Musk asked, reflecting a growing sentiment among conservatives that Washington needs to reduce foreign assistance.\n\nIn the Jan 2, 2025 letter, Tim Burchett had cited concerns that nearly $10 million of foreign aid money had been paid to the Afghan Taliban by non-governmental organisations (NGOs) in the form of taxes.\n\nIn its latest report to Congress, the Office of the Special Inspector General for Afghanistan Recons­truction (SIGAR) revealed that the US remains the largest donor to the Afghan people, having committed over $21 billion since the US military withdrawal in 2021.\n\nThis led Congressman Michael McCaul, chairman of the House Committee on Foreign Affairs, to call for greater oversight of US foreign assistance to Afghanistan. “The US government must work harder to prevent the Taliban from benefiting from humanitarian aid,” McCaul stated, echoing Burchett’s call for more stringent measures.\n\nBurchett’s letter expressed “strong concerns” over the possibility that foreign aid allocated to Afghanistan is indirectly benefiting the Taliban, which continues to control large swaths of the country.\n\nThe Congressman, who has been an outspoken critic of US foreign aid programs, also highlighted concerns over cash shipments sent to Afghanistan’s central bank, which he believes are difficult to track and could be exploited by the Taliban for their own purposes.\n\nThe issue has now drawn the attention of prominent figures of the Trump transition team, like billionaire Musk, who has publicly questioned the ethics of such foreign aid.\n\nAlthough the far-right views and controversial associations with vaccine sceptics and election deniers of Logan — the journalist who highlighted Burchett’s letter — have raised questions about her credibility, her statements nevertheless resonate strongly with conservative circles and fuel further debate.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:45:46.674Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883746/musk-surprised-us-taxpayer-money-going-to-afghan-taliban",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:21.000Z"
}
