{
  "title": "128 DEA, education dept officials involved in Rs500m scam in Bahawalnagar - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALNAGAR: An inquiry committee constituted on the directions of the chief minister to probe a corruption scam in the district education authority (DEA) of Bahawalnagar has found 128 officials of the authority, district accounts office (DAO) and education department involved in embezzlement of Rs500m by issuance of additional grant/funds to various schools in the district through bogus cheques, Dawn has learnt.\n\nThe sources in the district government said two firms of politicians-backed vendors were paid more than Rs200m without any newspaper advertisement in violation of the rules of PPRA (Public Procurement Regulatory Authority) and bogus billings.\n\nThe politicians allegedly involved in the scam belong to the ruling PML-N.\n\nThe inquiry committee, comprising Irfan Ahmad Sandhu (BPS-21), secretary (Regulations), S&GA Department, and Khalid Mehmood (BPS-19), additional secretary (Regulations) Finance Department, in its detailed report issued on Dec 30, 2024 (a copy available with Dawn), found the officials involved in misconduct, inefficiency and corruption and recommended proceedings against them under the Punjab Employees, Efficiency, Discipline and Accountability (Peeda) Act.\n\nThe report said Shahida Hafeez, the former education CEO, in connivance with 127 education and accounts officials, especially DDF Sajid Jodhiana, was involved in allocating additional grants/funds to schools without following rules, which resulted in embezzlement of Rs500,070,000 from the public exchequer.\n\nIt added that Ms Shahida released these additional funds under the heads that had no allocation in the approved budget.\n\nInquiry recommends action under Peeda Act against the officials, including former CEO; all accused officials, except one, still working on their posts; PML-N local leaders also involved\n\nIt claimed that without getting approval from the administrator of DEA (DC) and by violating the PPRA rules, a huge amount was released without proper requisition by the DDOs concerned.\n\nShe also violated the financial rules while entrusting the office of the DDOs to ESTs/non-gazettedd teachers despite having availability of gazetted teachers.\n\nDeclaring DDF Muhammad Rashid Jameel the second main accused in the scam, the report said the finance officer failed to provide original record and grant release register and he did not give correct answers to the questions asked by the inquiry committee.\n\nThe report further said District Accounts Officer Rafiq Abbasi committed irregularities with the connivance of Deputy Accounts Officer Sajid Mehmood Jodhiana, auditors Muhammad Sajid, Hafiz Hasan, Babar and Muhammad Riaz along with other education officials.\n\nThey did not examine the record before authorisation of funds allocated to DDOs/co-accused. Huge additional grants allocated to different schools were divided into smaller amounts of Rs75,000 per procurement and by using such tactics, more than Rs500m were released against bogus vouchers.\n\nWhile mentioning the names of school heads of DEA Bahawalnagar, the report said all the officials utilised additional grants without adopting legal formality and no quotations were sought as required under PPRA rule.\n\nIt found no physical work done in schools despite collecting funds, and items/things shown to be purchased from the grant were found to be old and out of order.\n\nThe plan to manipulate the additional grant was hatched at the start of 2024 and the politicians allegedly assured the officers that they would be backed at every forum regarding the scam.\n\nA junior clerk, named Saddam Hussain, who the report claims was directly involved in the fraud along with two other main accused and he was given a one-year extension in his post to execute the plan, sources claimed.\n\nThe sources said two firms of politicians-backed vendors were paid more than Rs200m without any newspaper advertisement in violation of the PPRA Rules and bogus billings.\n\nTwo firms, allegedly run by DDF Rashid Jamil and editor Hafiz Hasan, were paid more Rs150m.\n\nSimilarly, two more firms, dealt by DDF Sajid Jodhiana, the main accused in the scam, a former deputy accounts officer convicted by the National Accountability Bureau (NAB), and a PML-N legislator, were paid more than Rs100m. This was disclosed in a recent inquiry report of Special Branch (a copy available with Dawn).\n\nIt is pertinent to mention here that during the scam, the Special Branch (SB) had alerted the authorities in its report (copy available with Dawn), that the DAO under district account officers and deputy district account officers had become a hotbed of corruption.\n\nRegarding DDO Sajid Jodhiana, who was declared as one of the main accused in the probe report, it was claimed that he was appointed as the DDO in health/education and irrigation branch for the last 10 years, against the regulation that an employee posted in the office could not remain in a branch for more than three years.\n\nIt said that Jodhiana was involved in corruption of hundreds of millions of rupees per month in payment of various bills and salaries of employees, TA/DA, allowances, payment fixation and accuracy on service books and other issues through touts (names of touts also mentioned in the report).\n\nIt is also worth mentioning that despite the scam and inquiry report, all accused education and accounts officers, except former CEO Shahida, are still working on their posts and no departmental action has been taken against them so far. Ms Shahida was suspended when the allegations surfaced in the earlier inquiry.\n\nDistrict Account Officer Rao Abdul Samad was contacted through phone calls on his official phone numbers and landline for three days but he did not respond to calls or messages.\n\nBahawalnagar Deputy Commissioner Zulfiqar claimed that on public complaints, even before the current inquiry, he had referred the matter to the South Punjab Education Department after a probe on whose basis the current high-level probe had started against the accused officials.\n\nHe claimed that the district administration had first taken action on the matter on public complaints in the month of May.\n\nThe ADC(G) initiated an inquiry into the matter and then in the light of his inquiry report, the matter was taken up by the South Punjab Education Authorities, he added.\n\nMr Zulfiqar expressed hope that those responsible would be punished according to the law and added that NAB had also now taken up the matter.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:11:21.254Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883790/128-dea-education-dept-officials-involved-in-rs500m-scam-in-bahawalnagar",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:48.000Z"
}
