{
  "title": "Pakistan removed from list of ‘hunger hotspots’, says FAO - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Air pollution affected over 70pc population\n• More than 35pc children remained out of school as per 2023 census\n\nISLAMABAD: In a positive development, the Food and Agriculture Organisation (FAO) has removed Pakistan from the list of “hunger hotspots”. However, the United Nations’ arm has projected that acute food insecurity will remain at 20-25 per cent in the provinces of Sindh, Khyber Pakhtunkhwa, and Balochistan.\n\nAccording to a recent World Bank Brief on poverty and equity, food price inflation in Pakistan showed significant changes from April to June 2024, easing price pressure for the poor, vulnerable, and aspiring middle-class households who allocate 42-48pc of their budgets to food.\n\nHowever, energy inflation rose 65pc and core inflation including transportation remained elevated in rural areas. Higher indirect taxes drove further price increases for consumer goods and services. These adversely affected the families falling in the above-mentioned categories who allocate 23-28pc of their budgets to energy, housing and transportation services.\n\nThe report said that primary-to-middle and middle-to-secondary schools transition rates improved by two percentage points in 2023. However, over 35pc of children across Pakistan remained out of school entirely as per the 2023 population census.\n\nAdditionally, chronic air pollution remains a public health concern affecting more than 70pc of population. Approximately, 14 days of schooling were lost in Punjab due to smog and poor air quality.\n\nReal agricultural incomes rose by 5pc in the fiscal year 2024, but other sectors employing the poor such as construction, trade and transportation saw falling real wages. Manufacturing activity did not register any increase over the fiscal year 2023. Similarly, employment and labour force participation rates and job quality indicators did not rise.\n\nThe direct labour income impact and the fiscal multiplier of public investment have been muted as real development expenditures declined in the fiscal years 2023 and 2024. Official external remittances rose 10pc in the fiscal year 2024, but only 3.2pc of the poorest households received these and exchange rate appreciation and high inflation reduced their real value.\n\nSocial transfer spending related to the Benazir Income Support Programme rose considerably in 2024. The benefit levels under the BISP rose by 50pc while general consumer price inflation measured 61pc over the fiscal years 2023 and 2024.\n\nThe report estimates that rural poverty is 2.5 times high as compared to urban poverty while sub-national poverty rates range from 3.9pc (Islamabad) to 71.5pc (Khuzdar). Consumption-based inequality as measured by the Gini index remained at just over 32 and individual labour income inequality too remained flat at 47.6 in the fiscal year 2024.\n\nHorizontal inequality remained unchanged. In fiscal years 2023 and 2024, inequality within each of the poor, vulnerable, and aspiring middle class, and middle class plus social classes accounted for nearly 75pc of total labour income inequality.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:32:20.035Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883830/pakistan-removed-from-list-of-hunger-hotspots-says-fao",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T02:20:49.000Z"
}
