{
  "title": "Trump asks Supreme Court to halt sentencing in New York hush money case - World - DAWN.COM",
  "author": null,
  "content": "President-elect Donald Trump has asked the US Supreme Court to prevent a New York state court from sentencing him for his conviction on criminal charges stemming from hush money paid to a porn star.\n\n“This court should enter an immediate stay of further proceedings in the New York trial court to prevent grave injustice and harm to the institution of the presidency and the operations of the federal government,” his lawyers wrote in a filing made public on Wednesday.\n\nA day ago, a New York appeals court denied his effort to halt sentencing scheduled for Friday in New York state court in Manhattan. In Wednesday’s filing, his lawyers asked the US Supreme Court to immediately order a stay in the case, as he seeks an appeal to resolve questions of presidential immunity.\n\nThey said they had simultaneously asked the state’s highest court for the same emergency relief.\n\nThe Supreme Court ordered prosecutors to respond to the request by Thursday morning, signalling that the justices may act quickly on the matter.\n\nTrump, who won another term in the White House and is set to take office on January 20, was convicted by a New York jury of covering up his former lawyer Michael Cohen’s $130,000 payment to adult film actor Stormy Daniels for her silence before the 2016 election about a sexual encounter she says they had.\n\nTrump has denied the encounter and any wrongdoing.\n\nSteven Cheung, a spokesman for Trump, said in a statement his legal team had asked the Supreme Court “to correct the unjust actions by New York courts and stop the unlawful sentencing”.\n\nA spokesperson for Manhattan District Attorney Alvin Bragg, whose office brought the case, said prosecutors would respond in court papers.\n\nThe hush money case made Trump the first US president, sitting or former, to be charged with a crime and also the first to be convicted.\n\nSince the verdict, his lawyers have made two unsuccessful attempts to have the case tossed.\n\nIn scheduling Trump’s sentencing for Friday, Justice Juan Merchan said he was not inclined to sentence Trump to jail and would likely grant him an unconditional discharge, which would place a judgment of guilt on Trump’s record without any penalty such as custody, a fine or probation.\n\nTrump’s lawyers have argued that the hush money case should be dismissed in light of the Supreme Court’s landmark July 1 ruling that granted former presidents broad immunity from criminal prosecution for their official acts, in a case involving criminal charges over his efforts to undo his 2020 election loss to Joe Biden.\n\n“By repeatedly admitting evidence of President Trump’s official acts during trial, the trial court violated the principles of presidential immunity that this court enumerated,” Trump’s lawyers said in Wednesday’s filing.\n\nThey also contended that, as president-elect, Trump is immune from prosecution “in the brief but crucial period” between his November 5 election and his Jan 20 inauguration.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/0822420258c50d8.jpg",
  "retrievedAt": "2025-08-26T07:32:05.528Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883911/trump-asks-supreme-court-to-halt-sentencing-in-new-york-hush-money-case",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T17:42:50.000Z"
}
