{
  "title": "Ministries ‘flouting’ right to information: Fafen report - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The majority of federal ministries are flouting the Right of Access to Information Act (RTI), 2017, thwarting citizens’ access to public data and inadvertently promoting disinformation, a new report has said.\n\nThe report by the Free and Fair Election Network (Fafen) is based on an analysis of the websites of 40 divisions operating under 33 federal ministries.\n\nArticle 19A of the Constitution guarantees all citizens the right to access information. This right is reinforced by the federal RTI Act and subsequent laws enacted by provinces, the Fafen report said.\n\nThe assessment was conducted between April and June 2024, under the criteria laid down in Section 5 of the RTI Act, 2017.\n\nAlmost half of 33 federal ministries didn’t respond to information requests under RTI law\n\nThe section binds government organisations to publish information about their functions, powers, employees, regulations, notifications, policies, decisions, budget, and audit reports, among other information.\n\nFafen’s assessment found that not a single website out of the 40 divisions fully complied with this provision to disclose public information online.\n\nThe organisation monitored these websites for information about their functions, services, personnel information, laws, regulations, performance reports, finances and processes for obtaining information.\n\nA division-wise analysis of information available on the websites revealed significant variations in compliance with the RTI law.\n\nThe Cabinet Division and Inter-Provincial Coordination Division ranked the highest with 42 per cent compliance with Section 5 of the RTI Act.\n\nFifteen divisions fell within the compliance range of 31pc to 40pc, with six of them — Establishment; Petroleum; National Heritage and Culture; Revenue; Interior; and Planning, Development, and Special Initiatives divisions — achieving 38pc compliance each.\n\nSeven divisions — Commerce, Communications, Federal Education and Professional Training, Foreign Affairs, Privatization, Religious Affairs and Interfaith Harmony, and Water Resources — reported had a compliance rate of 35pc.\n\nThe Climate Change and Information Technology and Telecommunication Divisions had a compliance rate of 31pc.\n\nThirteen divisions fell were 21pc to 30pc compliant. They were Aviation, Defence, Defence Production, Economic Affairs, Power, Human Rights, Law and Justice, Parliamentary Affairs, Railways, and Science and Technology, Finance, Industries and Production and National Food Security and Research.\n\nThe divisions with the lowest compliance rate were Housing and Works, Information and Broadcasting, Ports and Shipping, Narcotics Control, National Health Services, Regulations and Coordination, and Overseas Pakistanis and Human Resource Development (19pc); National Security, Kashmir Affairs and Gilgit-Baltistan and States and Frontier Region (15pc); and Poverty Alleviation and Social Safety Division (8pc).\n\nRTI requests\n\nFafen also filed RTI requests with 33 federal ministries, of which only 19 responded, while 14 did not provide any information.\n\nAmong the responses, only nine ministries (27pc) provided the requested information within the stipulated 10 working days.\n\nHowever, 10 ministries (30pc) provided the information after the deadline. The remaining 14 ministries have yet to provide the requested information.\n\nMinistries such as Climate Change, Commerce and Defence Production responded promptly within the time frame.\n\nIn contrast, Finance and Revenue, Interior, and Railways ministries did not respond within or beyond the legal time frame, Fafen added.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:45:48.348Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883749/ministries-flouting-right-to-information-fafen-report",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:21.000Z"
}
