{
  "title": "First segment of Karachi’s Malir Expressway to be opened on Saturday - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sindh Chief Minister Syed Murad Ali Shah on Tuesday set Jan 11 as the final date for the inauguration of the first segment of the Malir Expressway project that runs from Korangi Caus­eway to Shah Faisal Colony.\n\nThis decision was taken during a high-level meeting chaired by CM at New Sindh Secretariat, where the project’s final progress was reviewed, said a press statement issued.\n\nLocal Government Minister Saeed Ghani, Chief Secretary Asif Hyder Shah, Karachi Mayor Murtaza Wahab, Prin­cipal Secretary to CM Agha Wasif, Commissioner Hassan Naqvi, city police chief Javed Odho, Transport Secretary Asad Zamin and other officials attended the meeting.\n\nThe statement said that a toll plaza would manage the traffic flow, charging Rs100 for cars and jeeps, and Rs200 for heavy vehicles.\n\nOnly commercial vehicles, cars, jeeps and buses will be permitted on the expressway, while motorcycles and rickshaws are not allowed on the expressway.\n\nThe CM emphasised the importance of efficient traffic management and directed officials to promptly address any operational challenges to ensure the timely completion of ongoing works.\n\nThe meeting was informed that the first segment would feature a ramp to facilitate immediate traffic flow and would be complemented by a connecting flyover from Korangi, which is expected to be completed within two months.\n\nThe construction of the Jam Sadiq Interchange and road rehabilitation projects at the EBM and Shah Faisal Interchanges are progressing steadily. Encroachments at the Quaidabad Interchange have been cleared and construction is ongoing to enhance connectivity, the statement said.\n\nThe CM directed law enforcement agencies to deploy district and traffic police at key entry and exit points, including the Jam Sadiq, EBM and Shah Faisal interchanges.\n\nThe traffic police will patrol both sides of the expressway continuously in vehicles. Dedicated traffic police will be present on the expressway to ensure proper traffic flow.\n\nTo ensure smooth operations, the CM declared the stretch from Shah Faisal Interchange to the Shah Faisal Colony Bridge as a no-parking zone.\n\nSpanning 40 kilometres, the expressway connects Korangi Creek Avenue to the M-9 Moto­rway near Kathore, offering a critical link for commuters and significantly reducing travel time.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677dd14476ab1.gif",
  "retrievedAt": "2025-08-26T07:32:26.987Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883773/first-segment-of-karachis-malir-expressway-to-be-opened-on-saturday",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:38.000Z"
}
