{
  "title": "National Highway Authority comes under fire in Sindh PA over steep hike in toll tax - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Opposition, treasury join hands to demand withdrawal of decision\n• Karachi-Sukkur car journey now costs in tolls over Rs2,500, house told\n• Sharjeel urges federal govt to release funds for Sukkur-Hyderabad motorway\n\nKARACHI: The Sindh Assembly on Tuesday lambasted the federal government and the National Highway Authority (NHA) for increasing toll taxes on the highways and motorways in the province and demanded immediate withdrawal of the decision.\n\nLawmakers from the both sides of the aisle joined hands to adopt a unanimous resolution, tabled by Pakistan Peoples Party lawmaker Heer Soho, and termed the increase in toll tax during the past seven months a sheer injustice to Sindh.\n\nOn Jan 1, 2025, the NHA once again increased toll taxes on highways and motorways across Pakistan, marking the third significant hike in just seven months as the authority aims to generate Rs102 billion in revenue by the end of the current fiscal year, a substantial increase from the Rs64 billion collected in the previous year.\n\nThe mover of the resolution, Ms Soho, said that the journey from Karachi to Sukkur by car via motorway and highways under the control of the NHA cost a toll tax of over Rs2,500, which was an additional burden on the already inflation-hit people.\n\nShe said the NHA suddenly increased the toll tax on the motorways and highways for the third time in the past seven months.\n\nMs Soho said the increased toll tax was being charged in Sindh, although the motorways and highways in the province were not even mentioned in the NHA notification.\n\n“The NHA should be named the Punjab Highway Authority as it doesn’t take any notice of the dilapidated roads in Sindh,” she said.\n\nThe PPP MPA said the road from Karachi to Sukkur was the most dilapidated among all motorways and highways under the NHA control.\n\nSpeaking on the resolution, Senior Minister Sharjeel Inam Memon said Sindh was continually subjected to injustices as all roads under the NHA’s administrative control were in a very poor condition, which also led to fatal accidents. “The federal government must levy taxes, but it has to give facilities too to public,” he added.\n\nThe minister said that it was the inefficiency and malice on part of the federal government that the Hyderabad-Sukkur Motorway was still incomplete. “The federal government should allocate and release the required funds for the project the way it does for the roads in other parts of the country,” he demanded.\n\nHe also pointed out the shortage of Motorway police on the highways in Sindh. “The Motorway police are active in the whole country, but they are not seen on motorways and highways in Sindh,” he deplored.\n\nMr Memon also requested the members of the Muttahida Qaumi Movement-P (MQM-P) to take up the issue of the incomplete motorway and increase in toll tax in the province with the Centre as their party was a coalition partner in the federal government.\n\nMQM-P’s Sabir Qaimkhani said the toll tax was charged for the maintenance of highways and provision of standard facilities to the public. He said the Karachi-Hyderabad Motorway lacked standard facilities and it could not be considered as a motorway.\n\nPPP’s Khairun Nisa Mughal and Tanzeela Umm-i-Habiba and MQM-P’s Muhammad Adil Siddiqui also spoke on the resolution and demanded immediate withdrawal of the increase in the toll tax.\n\nEarlier, the government bulldozed the business of the opposition members opposing the resolutions of the Pakistan Tehreek-i-Insaaf-backed Sunni Ittehad Council member Muhammad Shabbir, MQM-P’s Quratul Ain Khan and Jamaat-i-Islami’s lone member Muhammad Farooq.\n\nThe opposition members’ resolutions were rejected with the majority votes of the treasury benches as the law and parliamentary minister opposed them.\n\nQuestion Hour\n\nWhile furnishing statement and replies of the lawmakers’ written and verbal queries during Question Hour, Education Minister Syed Sardar Ali Shah said that three cadet colleges were established in Karampur, Khairpur and Larkana from 2019 to 2023.\n\nIn reply to a question by MQM-P’s Faisal Rafique, he said that as many as 154 colleges were there in seven districts of the city.\n\nAnswering another question, he said that there were 42 college principals in BPS-20 in the province.\n\nHe said that as many as 2,827 principals, professors, associate professors, assistant professors and lecturers were employed in the colleges across the province, while there were 2,278 vacant posts.\n\nLater, the house was adjourned to Friday at 10am.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:11:07.612Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883772/national-highway-authority-comes-under-fire-in-sindh-pa-over-steep-hike-in-toll-tax",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:38.000Z"
}
