{
  "title": "Iran executed 901 people in 2024: UN - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: Iranian authorities reportedly executed more than 900 people last year, including around 40 in a single week in December, the United Nations rights chief said on Tuesday.\n\n“It is deeply disturbing that yet again we see an increase in the number of people subjected to the death penalty in Iran year-on-year,” Volker Turk said, adding that at least 901 people were reportedly executed in 2024.\n\nThat compares to at least 853 people executed in Iran in 2023.\n\n“It is high time Iran stemmed this ever-swelling tide of executions,” Turk said in a statement.\n\nIran uses capital punishment for major crimes including murder, drug trafficking, rape and sexual assault.\n\nActivists are increasingly alarmed over the surge in hangings in Iran. The Islamic Republic executes more people per year than any other nation except China, for which no reliable figures are available, according to human rights groups including Amnesty International.\n\nThey accuse the authorities under supreme leader Ayatollah Ali Khamenei of using capital punishment as a tool to instil fear throughout society, particularly in the wake of 2022-2023 nationwide protests.\n\nThe UN rights office said that most of last year’s executions were for drug-related offences but it said “dissidents and people connected to the 2022 protests were also executed”.\n\n“There was also a rise in the number of women executed,” IHR said in a report on Monday that at least 31 women had been executed in Iran in 2024.\n\n‘Shockingly high’\n\nIran does not publish official data on executions, but UN rights office spokeswoman Liz Throssell told reporters that the team had gathered figures from a range of different reliable rights organisations that monitor the situation, including HRANA, Hengaw and the Norway-based Iran Human Rights (IHR).\n\n“We are confident of the number,” she said. The highest number of executions in Iran in recent decades was recorded in 2015 when at least 972 people were put to death.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/12/18143726330ef6d.jpg?r=143743",
  "retrievedAt": "2025-08-26T07:32:19.996Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883811/iran-executed-901-people-in-2024-un",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T02:02:12.000Z"
}
