{
  "title": "CJP Afridi explains trichotomy of powers to civil service delegation - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Chief Jus­tice of Pakistan Yahya Afridi during a meeting with the visiting delegation of Civil Services Academy (CSA), Lahore, provided them an insightful introduction to Pakistan’s constitutional history, tracing its evolution from the country’s independence in 1947 to the 2024 promulgation of the 26th Amendment.\n\nThe delegation of probationary officers undergoing training at the CSA, Lahore, accompanied by the director of the academy, visited the Supreme Court on Tuesday as part of their study tour.\n\nCJP Afridi, who congratulated them on their success in joining the civil services through a competitive examination, emphasised the sig-nificance of the Constitution as the fundamental docu-ment that governs the state’s functions and highlighted the concept of the trichotomy of power enshrined in the Constitution.\n\nHe also explained the distinct yet interdependent roles of the three pillars of the state: the legislature, tasked with making and amending laws; the executive, responsible for implementing laws; and the judiciary, charged with interpreting laws and ensuring justice.\n\nThe CJP addressed the pressing issue of case pendency in the country’s judicial system and elaborated on the hierarchical structure of the judiciary, comprising the Supreme Court, high courts, and district courts.\n\nHe highlighted the critical role of district courts as the primary interface for litigants and the starting point of the litigation process. Stressing the importance of timely justice, he mentioned the role of National Judicial Policy Making Committee as a policy-making forum to address the backlog of cases. He underlined the judiciary’s commitment to reducing delays and providing relief to litigants, thereby fostering trust in judicial institutions.\n\nSharing his experiences from visits to remote districts across the provinces, the CJP underscored the need for patient hearings and empathetic engagement with litigants.\n\nHe advised probationers to uphold the principles of justice, fairness, and respect in their interactions with the public and to resolve issues strictly within the ambit of the law.\n\nSC registrar Salim Khan provided a comprehensive briefing on the CJP’s reformative agenda.\n\nHe explained that reforms are designed to be citizen-centric, with a primary focus on ensuring access to swift and cost-effective justice for the common man as currently 57,347 cases are pending in the Supreme Court and 2.4 million cases across all judicial tiers.\n\nSpecial attention is being given to vulnerable segments of society, including women, children, physically challenged individuals, and overseas Pakistanis.\n\nThe registrar highlighted that the reform process emphasises improving processes and procedures ra- ther than expanding institutional size.\n\nThese reforms are homegrown and based on the experience of indigenous employees of the Supreme Court. This approach ensures efficiency without incurring additional costs or causing disruptions to routine operations.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677dde87030cc.gif",
  "retrievedAt": "2025-08-26T07:32:14.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883825/cjp-afridi-explains-trichotomy-of-powers-to-civil-service-delegation",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T02:20:49.000Z"
}
