{
  "title": "PM boasts of stability after UAE agrees to $2bn rollover - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Premier informs cabinet of his ‘constructive’ meeting with Zayed Al Nahyan\n• ‘Comprehensive’ meeting on reducing power prices to be held this week\n• Halal meat, rice exports on the agenda as Indonesian president due in Islamabad\n• Cabinet moves to safeguard FBR data, declares its infrastructure critical\n\nISLAMABAD: Prime Minister Shehbaz Sharif revealed on Tuesday that the United Arab Emirates (UAE) has decided to roll over a $2 billion debt due this month, providing critical financial relief to Pakistan.\n\nIn his televised opening rem­arks at a federal cabinet meeting that he chaired, the prime minister apprised the members of his “positive and constructive” meeting with UAE President Sheikh Mohamed bin Zayed Al Nahyan in Rahim Yar Khan. They discussed ways to further strengthen bilateral ties and investment cooperation.\n\nAccording to the premier, the UAE president emphasised moving swiftly on the investment projects and expressed his country’s commitment to enh­ancing its long-standing partnership with Pakistan. During their one-on-one meeting, the UAE president announced the debt rollover.\n\nPM Shehbaz emphasised the need for sustained efforts to stabilise the economy and rebuild the country’s global standing. “Due to our collective efforts, the economy is stabilising. We will continue to work hard with the same commitment and devotion. Time is not far from when we will become a prosperous nation and regain our stature. But this needs a journey of sacrifice, blood and sweat and nothing short of that,” he added.\n\nThe premier stressed that the recently unveiled programme on the homegrown economy required measures to reduce the cost of electricity, which he described as inevitable to boost exports and commerce.\n\nHe informed cabinet members that he had chaired a meeting last week to consider reducing power prices with the collaboration of provincial governments and that a “comprehensive” meeting would be held this week on the subject.\n\nOn small and medium enterprises (SMEs), the prime minister noted recent progress, including decisions made during a meeting to reconstitute the SMEDA Board. Another meeting on the subject is scheduled for Jan 15.\n\nHe also pointed to a rise in textile exports, reiterating the government’s focus on export-led growth and diversification into non-traditional exports.\n\nStrengthening ties with Indonesia\n\nThe prime minister informed the cabinet that Indonesian President Prabowo Subianto is set to visit Islamabad this month to discuss strengthening bilateral ties. Areas of focus will include cooperation in Halal meat and rice exports and the import of edible oil.\n\nReferring to a recent firing incident in Lower Kurram that injured the deputy commissioner and others, Prime Minister Shehbaz condemned the attack, describing it as an attempt to sabotage a peace agreement. He prayed for the swift recovery of the injured being treated in Peshawar.\n\nHe said the government was working in unison to curb the menace of human smuggling, which has led to the death of hundreds of Pakistani citizens and damaged the country’s reputation.\n\nPM Shehbaz said he regularly held meetings on the subject with the Ministry of Interior and relevant departments to address the issue.\n\nCabinet decisions\n\nLater, according to a press release issued by the PM Office, the federal cabinet, upon the recommendation of the Revenue Division, approved declaring the Federal Board of Revenue’s (FBR) infrastructure as critical under the Prevention of Electronic Crimes Act (PECA) 2016. This step aims to safeguard sensitive data from cyberattacks or any unlawful intervention.\n\nThe federal cabinet, upon the recommendation of the Aviation Division, approved the extension of Flydubai’s temporary operating permits for weekly flights between Lahore, Islamabad and Dubai from Jan 4 to Feb 3.\n\nThe Ministry of Maritime Affairs briefed the cabinet on public sector imports and exports through Gwadar Port by 11 federal ministries or divisions from March 2024 onwards.\n\nThe prime minister directed that all relevant ministries’ reports be included in the briefing and a comprehensive report be submitted. He directed that 60pc of all public sector trade be conducted via the port.\n\nThe cabinet was also updated by the IT ministry on the rollout of the e-Office system across federal ministries, making government communications\n\npaperless starting Jan 1, 2025. The system has already been implemented in 21 ministries and is expected to save time and reduce expenses. The processing time for summaries at the PM’s Office has been cut to a maximum of three days.\n\nThe cabinet, upon the recommendation of the Cabinet Division, approved purchasing refurbished Chromebooks for schools and colleges, with a third-party audit to ensure transparency.\n\nThe cabinet also approved the signing of a memorandum of understanding (MoU) between the Investment Board and China’s Shandong Ruyi Group for establishing textile parks.\n\nThe federal cabinet, on the recommendation of the Ministry of Foreign Affairs, approved the signing of an MoU between the ministry’s Foreign Service Academy and Serbia’s Diplomatic Academy.\n\nThe cabinet also ratified decisions made during recent Cabinet Committee on Legislative Cases meetings on Dec 31 and Jan 1 and directed all pending court cases concerning private Hajj operators to be resolved expeditiously.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:45:47.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883758/pm-boasts-of-stability-after-uae-agrees-to-2bn-rollover",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:14.000Z"
}
