{
  "title": "Tech billionaire Musk continues attacks on UK PM over grooming scandal - World - DAWN.COM",
  "author": null,
  "content": "• Ex-PM Brown terms Musk’s allegations ‘complete fabrication’\n• Humza Yousaf reminds X boss how Pakistani MP helped secure extradition of murderers\n\nLONDON: Tech billionaire Elon Musk seems to be playing a dangerous game, whipping up furore over a historic grooming scandal in what appears to be an attempt to target the Labour government of UK PM Keir Starmer.\n\nOver the past week, the tech entrepreneur has attack­­­ed the UK government over grooming gangs, using his platform X to accuse one key Labour leader of being a “rape genocide apologist”, and calling for her and Starmer to be jailed.\n\nOn Monday, Starmer had hit out against politicians and activists “spreading lies and misinformation” over gr­­oo­m­ing gangs, accusing opp­os­i­tion lawmakers of “jumping on a bandwagon” and “amplifying what the far-rig­­ht is saying” to gain attention.\n\nOnline debate had now “cr­­ossed a line”, resulting in th­­reats against parliamentarians, including Safeguar­ding Minister Jess Phillips, he said.\n\n“We have seen this playbook many times — whipping up of intimidation and of threats of violence, hoping that the media will amplify it,” Starmer said.\n\n“Those who are spreading lies and misinformation as far and as wide as possible are not interested in victims, they’re interested in themselves,” he added.\n\nDebate around grooming ga­ngs was reignited this we­­­­­ek after it was reported that Phillips rejected Oldh­­am Council’s request for a go­­v­­­ernment-led inquiry into hi­­s­­torical child sexual exp­l­oi­tation in the town, in fav­o­­ur of a local investigation.\n\nThe grooming scandal, which came to light in the 2010s, involved the systema­t­­­ic abuse of thousands of gi­­rls in towns such as Roth­er­h­am, Rochdale and Old­h­am. A 2014 report estimated that 1,400 children were explo­it­­ed in Rotherham between 1997 and 2013, primarily by men of Pakistani heritage.\n\nKeir Starmer, as head of the Crown Prosecution Service (CPS) from 2008 to 2013, revised CPS policies to improve responses to such cases, but some early decisions not to prosecute remain controversial.\n\nMusk’s allegations reference a misinterpreted 2008 Home Office memo, suggesting officers allowed abuse to continue. However, Nazir Afzal, a former prosecutor who secured convictions in these cases, clarified that no such directive existed. Afzal also credited Starmer for reforms that raised CPS conviction rates for sex abuse cases. Musk also claimed that the Labour PM at the time issued a circular to UK police forces effectively telling them not to prosecute rape gangs.\n\nBut Gordon Brown, who was PM at the time of the incident in question, claimed that allegations made by Musk about how he dealt with child grooming gangs are “a complete fabrication”.\n\nKriss Donald case\n\nAlso on Tuesday, one of Musk’s retweets prompted a response from the former First Minister of Scotland, Humza Yousaf, who responded to a comment regarding the racially motivated murder of 15-year-old Kriss Donald in 2004.\n\nMusk quoted a post about the incident by Keith Woods, a far-right Irish activist, exp­ressing that it was “the first time [he’d] heard of this.”\n\nResponding to Musk, Yousaf posted: “Let me also be the first to tell you that it was a Scottish-Pakistani MP at the time, Mohammad Sar­war, who travelled to Pakistan to ensure Kriss Donald’s evil killers were extradited back to Scotland to face the full force of the law.”\n\nIn March 2004, Donald was abducted in a random attack from Glasgow by five men linked to a local British Pakistani gang. Two men were convicted over the murder, but three of the accused fled to Pakistan, which lacked an extradition treaty with the UK at the time.\n\nMohammad Sarwar, who was MP for Glasgow Central at the time, played a crucial role in persuading the Pak­istani government to extradite the fugitives. The suspects were subsequently returned to Scotland where they faced criminal sentences.\n\nKriss Donald’s family consistently opposed the far-right’s exploitation of the tragedy. His mother emphasised that her son was a victim of gang violence, urging the public not to target the Asian community.\n\nDespite her appeals, far-right groups, including the British National Party (BNP) and Patriotic Alternative, have used Donald’s case to promote their agendas.\n\nKeith Woods, the far-right activist whose post Musk shared, also has a history of promoting anti-Semitic and white nationalist narratives.\n\nPublished in Dawn, January 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677da288b2208.jpg",
  "retrievedAt": "2025-08-26T07:32:34.913Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883747/tech-billionaire-musk-continues-attacks-on-uk-pm-over-grooming-scandal",
  "dateList": "2025-01-08",
  "date_published": "2025-01-08T01:49:21.000Z"
}
