{
  "article_id": "2025-09-08_f48ece8c6adf0393260e133050b94dff",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-slams-indias-policies-urges-regional-stability-at-book-launch/",
    "retrieved_at": "2025-09-19T16:25:26.068Z"
  },
  "metadata": {
    "title": "Tarar slams India’s policies, urges regional stability at book launch",
    "author": null,
    "date_published": "2025-09-08T17:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 425,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 8 (APP):Minister for Information and Broadcasting Attaullah Tarar on Monday reaffirmed Pakistan's unwavering commitment to peace, diplomacy, and regional stability while strongly criticizing India's internal and external policies, particularly its treatment of minorities and alleged involvement in transnational terrorism. Speaking at the launch of Ambassador Aizaz Ahmad Chaudhry's book \"Pakistan-India Relations - Fractured Past, Uncertain Future,\" Tarar emphasized that Pakistan has consistently chosen dialogue over aggression and continues to advocate for peaceful coexistence. He underscored that Pakistan's relationship with India must be understood through the lens of the two-nation theory. Tarar praised the Pakistan Army for its vital role in defending national sovereignty and countering Indian hostility, stating, \"Our armed forces have made unmatched sacrifices-not just for Pakistan's security, but for global peace.\" He noted that the entire nation-including youth, intellectuals, politicians, and academics-has stood united behind the armed forces during times of external aggression. Addressing the Kashmir dispute, Tarar reiterated that it remains the core issue in Indo-Pak relations. He condemned the Hindutva-driven policies of the current Indian government, arguing that they have eroded democratic values and marginalized minorities. \"Sustainable peace in the region is impossible without addressing these fundamental challenges and ensuring justice for the people of Kashmir,\" he said. The minister also expressed grave concern over India's alleged involvement in transnational assassinations, including the targeted killings of Sikh leader in Canada and other countries, describing them as \"clear evidence of Indian-sponsored terrorism.\" He accused India of weaponizing water resources and attempting to unilaterally revoke the Indus Waters Treaty-an act he said is legally untenable. Citing rulings from the International Court of Arbitration and other forums, Tarar emphasized that bilateral treaties require mutual consent and cannot be revoked unilaterally. On the diplomatic front, Tarar asserted that Pakistan has effectively presented its case to the international community. He said India's narrative of rising economic and military dominance collapsed when confronted by Pakistan's resolute military response and superior diplomacy. \"Pakistan's perspective has resonated globally because the power of truth cannot be subdued or conquered,\" he remarked. Tarar further highlighted Pakistan's sacrifices in the global war against terrorism, noting that thousands of lives-including those of soldiers and civilians-have been lost. He dismissed allegations of Pakistan sponsoring terrorism as baseless, reaffirming that the country remains one of the biggest victims of terrorism. Concluding his remarks, the minister paid tribute to Ambassador Aizaz Ahmad Chaudhry for his distinguished service and contributions to Pakistan's foreign policy discourse. He reiterated that Pakistan stands resilient, united, and committed to truth, justice, and peace in the face of regional challenges.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}