{
  "article_id": "2025-09-08_6d7cb1eada64cc37d1368fac33fefe44",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-calls-for-stronger-academia-parliament-linkages/",
    "retrieved_at": "2025-09-19T16:25:07.483Z"
  },
  "metadata": {
    "title": "NA Speaker calls for stronger academia-parliament linkages",
    "author": null,
    "date_published": "2025-09-08T17:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 543,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 8 (APP): National Assembly Speaker Sardar Ayaz Sadiq on Monday underlined the importance of robust collaboration between Parliament and academic institutions to foster democratic values, civic awareness, and national development. He was addressing the Inaugural Session of the National Conference on Teaching, Research and Writing about the Parliament, held at the Parliament House to mark the 10-year review of the Parliamentary Studies Programme. Recalling the launch of the programme in 2015 under his chairmanship, the speaker noted that 25 universities pledged to introduce Parliamentary Studies into their curricula. He commended Vice Chancellors, Rectors, Principals, and senior faculty for their continued partnership in building parliamentary literacy among students. \"A true understanding of the Constitution and Rules of Procedure cannot be gained through cursory reading. It requires practical exposure and experience,\" he remarked. The Speaker highlighted that currently, 17 universities are offering courses on Constitution, Parliamentary Studies, and related subjects, with faculty members and scholars increasingly engaging in indigenous research on parliamentary processes. Sardar Ayaz Sadiq emphasized the success of the National Assembly Internship Programme, launched in 2013, which has provided exposure to thousands of students - particularly from underprivileged areas - on legislative processes. Interns, he said, were often struck by the scale and complexity of parliamentary work and left as the Ambassadors of Parliament and Democracy after completion of their immersive experience during internship. The Speaker highlighted reforms to boost transparency and merit in the National Assembly Secretariat, including public access through seminars, limiting discretionary promotion powers, and publishing staff seniority lists. He noted Pakistan's National Assembly became the world's first \"Green Parliament\" by fully shifting to solar energy. Participants proposed replicating the internship programme in provincial assemblies, enhancing academia-Parliament ties, launching a Parliamentary Journal, recognizing top academic work, involving MPs in university boards, creating a research databank, and reviving the Student Ambassador Programme. Sardar Ayaz Sadiq assured participants of Parliament's full support in strengthening higher education and committed to engaging the Higher Education Commission (HEC) to facilitate universities in implementing Parliamentary Studies programmes. He invited universities to submit written recommendations, which will be deliberated at a follow-up meeting in December 2025. This meeting, he announced, will also be expanded to include the Speakers of all four Provincial Assemblies, Gilgit-Baltistan Assembly, and Azad Jammu and Kashmir Legislative Assembly. MNA Ms. Shaista Pervaiz, Convenor of the Parliamentary Taskforce on SDGs, lauded the Speaker for institutionalizing Parliamentary Studies and establishing a sustainable platform for parliamentary-academic collaboration. She invited universities to partner with Parliament in advancing research and action on the Sustainable Development Goals (SDGs). MNA Ms. Nousheen Iftikhar, President of the Young Parliamentarians Forum (YPF) Board, who chaired one of the thematic panels, underscored the importance of engaging youth in democratic processes. She emphasized that initiatives such as the Parliamentary Studies Programme, coupled with structured internships and fellowships, can inspire young people to see Parliament not only as a legislative body but also as a space for innovation, research, and civic responsibility. Ms. Iftikhar reaffirmed YPF's commitment to working closely with universities to revive the Student Ambassador Programme and to create opportunities for students to directly interact with Parliamentarians. Learned Vice Chancellors, Rectors, Provosts, Deans and Faculty members of over 25 universities from all four provinces of the country participated in the Conference.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}