{
  "article_id": "2025-09-08_17c944a02fc62a821a5a0024ad0e4bb1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-directs-ndma-to-expedite-relief-operations-ensure-preparedness-as-river-levels-surge/",
    "retrieved_at": "2025-09-19T16:25:54.524Z"
  },
  "metadata": {
    "title": "PM directs NDMA to expedite relief operations, ensure preparedness as river levels surge",
    "author": null,
    "date_published": "2025-09-08T15:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 208,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 08 (APP): Prime Minister Shehbaz Sharif on Monday directed the National Disaster Management Authority (NDMA) to expedite ongoing relief operations and ensure complete preparedness for potential flood situations due to rising water levels in the rivers. The prime minister, chairing a meeting to review ongoing rescue and relief operations in flood-hit areas, instructed to ensure early warnings and timely evacuation measures for populations near rivers and areas at risk. The NDMA chairman briefed the prime minister on the current situation of flooding in rivers, the status of rising water level in rivers, and the relief operations for flood-affected people across the country. Prime Minister Shehbaz directed the NDMA to maintain full coordination with provincial governments and Provincial Disaster Management Authorities. He also instructed to intensify the search for missing persons in the flood-hit areas The prime minister was also briefed on the displacement of people due to floods and the ongoing rescue operations. The participants of the meeting were apprised of the severe flooding conditions in the Chenab, Ravi, and Sutlej rivers at Trimmu Barrage, Panjnad Barrage, Head Balloki, Head Sidhnai, Ganda Singh Wala, Head Sulemanki, and Head Islam. It was told that the convoys of relief goods were being continuously sent to the flood-affected areas.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}