{
  "article_id": "2025-09-08_fb8aa76ee9b334526de262450cfb657e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/269-feeders-fully-restored-across-flood-affected-areas-power-division/",
    "retrieved_at": "2025-09-19T16:24:13.231Z"
  },
  "metadata": {
    "title": "269 feeders fully restored across flood affected areas: Power Division",
    "author": null,
    "date_published": "2025-09-08T13:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 490,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 8 (APP):The Ministry of Energy (Power Division) on Monday reported substantial progress in restoring electricity across flood-affected regions, with 269 feeders fully restored and 242 temporarily energized out of 515 impacted. According to the Power Division's latest report, restoration work is underway at full pace in affected areas under various distribution companies (DISCOs), with a significant number of feeders and grid stations already restored. Peshawar Electric Supply Company (PESCO), Gujranwala Electric Power Company (GEPCO), Lahore Electric Supply Company (LESCO), Faisalabad Electric Supply Company (FESCO), Multan Electric Power Company (MEPCO), Tribal Electric Supply Company (TESCO), and Hazara Electric Supply Company (HAZECO) have resumed partial or full operations, with Swat, Swabi and DI Khan fully restored and other areas expected to recover within days. In PESCO-managed areas, including Swat, Buner, Shangla, Swabi and DI Khan, 12 grid stations and 91 feeders were impacted by the floods. Out of these, 86 feeders have been fully restored, while 5 have been partially restored. As a result, electricity has been restored to 461,049 out of 463,375 consumers. Restoration work for the remaining consumers is expected to be completed by September 11-12. In GEPCO's jurisdiction, 11 grid stations and 103 feeders were affected. Out of these, 89 feeders have been fully restored, while 14 have been partially restored, enabling the restoration of power supply to 722,402 out of 735,987 consumers. Restoration for the remaining will be carried out as soon as the floodwater recedes. In LESCO-controlled areas, including Lahore, Okara, Sheikhupura, Kasur, and Nankana Sahib, 67 feeders were affected. Among them, 57 feeders have been fully restored and 10 partially restored. Electricity has been restored for 64,393 out of 73,734 affected consumers. Full restoration is expected by September 9-10. Power restoration in Sheikhupura is already complete. Similarly, in FESCO's areas covering Toba Tek Singh, Faisalabad, Chiniot, Jhang, Sargodha, Mianwali, and DI Khan, 27 grid stations and 80 feeders were affected. Of these, 17 feeders have been fully restored and 59 partially restored. Electricity has been restored for 90,049 out of 201,937 affected consumers, with full restoration expected by September 10 once floodwaters recede. In MEPCO's domain, 153 feeders were affected, with 4 fully and 149 partially restored. MEPCO serves 129,244 affected consumers, and full restoration will commence as floodwaters recede. In TESCO areas, particularly in North Waziristan and Khyber, 18 feeders were affected. So far, 13 feeders have been fully restored and 5 partially restored, enabling the restoration of power to 27,378 out of 31,774 affected consumers. The remaining consumers are expected to have their electricity restored by September 15. Meanwhile, in HAZECO's Mansehra region, all three affected feeders have been fully restored. Overall, the Power Division has restored electricity for 1,404,486 out of 1,659,716 affected consumers. Restoration for the remaining 255,230 consumers remains a top priority and will continue as floodwaters recede. The Power Division is working tirelessly to ensure full restoration as soon as possible to bring relief to all affected areas.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}