{
  "article_id": "2025-09-08_4271281d28578f977e826f39999fbea2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/3000-pakistanis-to-receive-training-study-opportunities-in-china/",
    "retrieved_at": "2025-09-19T16:25:53.932Z"
  },
  "metadata": {
    "title": "3,000 Pakistanis to receive training, study opportunities in China",
    "author": null,
    "date_published": "2025-09-08T16:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 328,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 8 (APP):China will provide 3,000 training and study opportunities to Pakistani nationals from 2025 to 2029 under a new bilateral cooperation plan. The commitment is part of the China-Pakistan Action Plan (2025-2029), agreed during Prime Minister Shehbaz Sharif's visit to Beijing last week. The initiative falls under the section on science, technology and human resources, which identifies human capital development as a key area of collaboration. According to the plan brief available with Wealth Pakistan on Monday, Pakistan and China will strengthen joint research programmes in both applied and basic sciences. New laboratories will be established under the Belt and Road Initiative, focusing on disaster prevention and mitigation, early warning systems, small hydropower development, climate change, air pollution control, new energy sources, food and agriculture, medicine and health, and artificial intelligence. The plan also commits to expanding talent exchanges in science and technology. Pakistani research and management personnel will be supported for training and study stays in China through programmes such as the Talented Young Scientist Programme, International Technical Training Workshop for Developing Countries, CAS President's International Fellowship Initiative, and the CAS-ANSO Scholarship. In addition, the two countries will deepen cooperation under the Belt and Road Science, Technology and Innovation Cooperation Action Plan, with specialized programmes in spatial information, artificial intelligence and traditional medicine. Marine science and energy resources also form part of the training scope. The plan calls for joint survey and research on offshore natural gas hydrates as well as enhanced collaboration on marine technology. Furthermore, the plan highlights exchanges on cybersecurity and data security to build capacity in the digital sector. It also underscores cooperation in mutual recognition of engineers, employment promotion, vocational skills development, and social security system development. Through this initiative, the Chinese side will directly support Pakistan's capacity building in science, technology, and human resources. Officials from both countries expect it to create stronger academic, professional and technological linkages, while ensuring long-term benefits for the people of Pakistan and China.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}