{
  "article_id": "2025-09-08_9de1188e1762b825c8e8aba1a0396838",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/president-zardari-confers-nishan-e-imtiaz-on-uae-naval-chief-hails-strong-bilateral-ties/",
    "retrieved_at": "2025-09-19T16:25:52.289Z"
  },
  "metadata": {
    "title": "President Zardari confers Nishan-e-Imtiaz on UAE Naval Chief, hails strong bilateral ties",
    "author": null,
    "date_published": "2025-09-08T15:49:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 253,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 08 (APP): President Asif Ali Zardari on Monday conferred the prestigious Nishan-e-Imtiaz (Military) upon the Commander of the United Arab Emirates Naval Forces, Staff Major General Humaid Abdulla Alremeithi, in a special investiture ceremony held at Aiwan-e-Sadr. Speaking after the ceremony, President Zardari said the award recognized General Alremeithi's outstanding services and contributions to strengthening defence and security ties between Pakistan and the UAE. He noted that the visit of the UAE Naval Chief was a reflection of the deep-rooted fraternal bonds between the two nations, adding that both sides were committed to expanding cooperation in multiple fields. The president lauded the UAE Navy's active participation in Aman Dialogue-25 and Exercise Aman-25, expressing confidence that such engagements reinforced regional maritime security. He also appreciated the trust placed by the UAE in the professional expertise of Pakistan Navy and assured continued support in meeting the UAE Navy's manpower requirements. Underscoring the \"extraordinary and exemplary\" nature of Pakistan-UAE relations, President Zardari emphasized that the partnership was not only based on shared strategic interests but also on enduring people-to-people linkages. \"Pakistan remains committed to further strengthening these historic brotherly ties,\" he affirmed. General Alremeithi, in his remarks, highlighted his personal bond with Pakistan, recalling that he had spent four years in the country while graduating from the Pakistan Naval Academy in Karachi. The ceremony was attended by Defence Minister Khawaja Muhammad Asif, former National Assembly Speaker Raja Pervaiz Ashraf, former Senate Chairman Nayyar Hussain Bukhari, and Chief of the Naval Staff, Admiral Naveed Ashraf.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}