{
  "article_id": "2025-09-08_d580cae0ed9b5a1e7a932ee0ff2c0ef1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/heavy-rains-expected-across-sindh-punjab-and-balochistan-pmd-issues-flood-warning/",
    "retrieved_at": "2025-09-19T16:24:42.350Z"
  },
  "metadata": {
    "title": "Heavy rains expected across Sindh, Punjab and Balochistan; PMD issues flood warning",
    "author": null,
    "date_published": "2025-09-08T21:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 579,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 08 (APP): The Pakistan Meteorological Department (PMD) has predicted widespread rain-wind/thundershowers with scattered heavy to very heavy falls across Sindh, Central and Southern Punjab, and Northeastern and Southern Balochistan on Tuesday. The department stated that partly cloudy weather with rain-wind/thundershowers is expected at isolated places in Northeastern Punjab, Khyber Pakhtunkhwa, Gilgit-Baltistan and Kashmir. According to the advisory, torrential rains are likely to cause urban and coastal flooding in low-lying areas of Mirpurkhas, Shaheed Benazirabad, Tharparkar, Khairpur, Sukkur, Larkana, Thatta, Badin, Sajawal, Hyderabad, Dadu and Karachi from Monday evening through September 09. The water level in Hub Dam may also rise, while more downpours in flood-affected parts of Punjab and Sindh are feared to aggravate the situation. Flash floods are also expected in hill torrents of Dera Ghazi Khan, adjoining eastern and southern Balochistan, and the Kirthar Range around Dadu. The PMD cautioned that heavy rainfall, windstorms and lightning may damage vulnerable structures including mud houses, electric poles, billboards, vehicles and solar panels. In Islamabad, partly cloudy weather with chances of rain and thundershowers at isolated places has been forecast. In Punjab, thundershowers with heavy falls at a few places are expected in Bahawalpur, Rahim Yar Khan, Khanpur, Kot Addu, Lodhran, Khanewal, Dera Ghazi Khan, Taunsa, Rajanpur and Multan. Murree, Galliyat, Rawalpindi, Jhelum, Chakwal, Sialkot, Narowal, Sargodha, Faisalabad, Lahore and surrounding areas are also likely to experience partly cloudy weather with spells of rain. In Khyber Pakhtunkhwa, most districts will remain partly cloudy, though rain and thundershowers may occur in Abbottabad, Mansehra, Kohistan, Dir, Swat, Malakand, Buner, Chitral, Kurram, Orakzai, Kohat, Hangu, Karak, Bannu, Lakki Marwat, Dera Ismail Khan and Waziristan. Sindh is expected to receive widespread rains with heavy to very heavy falls in Tharparkar, Umerkot, Mirpur Khas, Sanghar, Khairpur, Shaheed Benazirabad, Matiari, Tando Allahyar, Tando Muhammad Khan, Thatta, Badin, Sukkur, Dadu, Jamshoro, Karachi, Larkana, Hyderabad, Sajawal, Jacobabad and Ghotki. Balochistan is also likely to experience widespread rains in Zhob, Qala Saifullah, Musakhel, Sibi, Kohlu, Loralai, Barkhan, Dera Bugti, Quetta, Ziarat, Mastung, Naseerabad, Lasbela, Khuzdar, Kalat, Awaran, Kharan, Panjgur and the coastal belt of Makran including Ormara, Pasni and Gwadar, while hot and dry weather will prevail in other districts. In Kashmir and Gilgit-Baltistan, partly cloudy weather with rain and thundershowers at isolated places is expected. During the past 24 hours, several parts of Punjab, Sindh, Khyber Pakhtunkhwa, Balochistan, Kashmir and Gilgit-Baltistan received heavy rainfall. Jhang received the heaviest downpour at 85 millimetres, followed by Multan with 77 mm, Bhakkar with 51 mm, and Faisalabad with 43 mm. In Sindh, Sakrand recorded 52 mm, Khairpur 50 mm, Badin 45 mm and Dadu 38 mm, while Karachi received 6 mm of rainfall. Malam Jabba in Khyber Pakhtunkhwa recorded 31 mm and Parachinar 27 mm. In Balochistan, Lasbela received 8 mm and Khuzdar 3 mm, while Rawalakot in Azad Kashmir recorded 4 mm and Skardu in Gilgit-Baltistan reported 1 mm. The highest temperature in the country during the past 24 hours was recorded at Nokundi at 43 C followed by Dalbandin at 42 C. The minimum and maximum temperatures for major cities stood at 22 C and 29 C in Islamabad, 25C and 34C in Lahore, 26C and 30C in Karachi, 23C and 36C in Peshawar, and 20C and 32C in Quetta. The PMD has urged the public, travelers and tourists to remain cautious, avoid unnecessary exposure to vulnerable areas and stay updated with the latest weather advisories as further heavy rainfall may worsen the situation in flood-affected regions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}