{
  "title": "May 9 riots: Faisalabad ATC sentences Omar Ayub, Shibli Faraz and other PTI leaders to 10 years in jail - Pakistan - DAWN.COM",
  "author": null,
  "content": "An Anti-Terrorism Court (ATC) in Faisalabad on Thursday sentenced PTI leaders, including Omar Ayub Khan, Shibli Faraz, Hamid Raza, and Zartaj Gul Wazir, to 10 years of imprisonment for their involvement in the May 9 riots.\n\nOn May 9, 2023, PTI supporters, protesting the party founder Imran Khan’s arrest, staged violent protests throughout the country, vandalising military installations and state-owned buildings, while also attacking the Lahore corps commander’s residence. Following the riots, thousands of protesters, including party leaders, were arrested.\n\nOut of 185 PTI workers accused, 108 have been sentenced by the court today. PTI’s Member of the Provincial Assembly (MPA), Junaid Afzal Sahi, was sentenced to three years in prison. Meanwhile, MPA Khayal Ahmad Kastro, Member of the National Assembly (MNA) Zain Qureshi, and former PTI leader Fawad Chaudhry have been acquitted in the cases.\n\nReacting to the development, PTI Chairman Barrister Gohar Ali Khan said the party will challenge the decision in the high courts.\n\nSpeaking to the media in Islamabad today, Gohar said: “We will raise the issue with PTI Founder Imran Khan on the future course of action regarding whether we should return to the parliament or launch a movement.”\n\nHe said that the “political cases against PTI members were baseless”, adding that the PTI believed in running the system instead of believing in extremism.\n\n“We do not believe in violence or incitement in politics. Those who have been convicted today do not believe in politics of violence.”\n\nAccording to a copy of the court order — available with Dawn.com — “the prosecution has successfully proved its case without any shadow of doubt” against 17 of the accused, including the opposition leaders and Zartaj Gul. They were sentenced to:\n\n10 years rigorous imprisonment, Rs1 million fine under Section 109 (punishment of abetment if the act abetted committed in consequence and where no express provision is made for its punishment) read with Section 34 (acts done by several persons in furtherance of common intention) of the Pakistan Penal Code (PPC)\n\n10 years of rigorous imprisonment, Rs 1m fine under Section 120B (punishment of criminal conspiracy) read with Section 34 PPC\n\n“The sentences of imprisonment awarded to [the] aforementioned convicts for both the offences shall run concurrently and [the] benefit of section 382B (period of detention to be considered while awarding sentence of imprisonment) CrPC (Code of Criminal Procedure) is also extended to the convicts, if they have undergone some tenure of detention in this case previously,” the order read.\n\nMoreover, 90 accused — designated the “actual perpetrators” of the riots in the court order — were sentenced on various charges read with Section 149 (every member of unlawful assembly guilty of offence committed in prosecution of common object) PPC.\n\nThree years of rigorous imprisonment, Rs100,000 fine under Section 148 (rioting, armed with deadly weapon) PPC\n\nThree years of rigorous imprisonment, Rs100,000 fine under Section 152 (assaulting to obstructing public servant when suppressing riot) read with Section 149 PPC\n\nOne year of rigorous imprisonment, Rs100,000 fine under Section 153 (wantonly giving provocation with intent to cause riot) read with Section 149 PPC\n\nSix months of rigorous imprisonment, Rs50,000 fine under Section 186 (obstructing public servant in discharge of public functions) read with Section 149 PPC\n\nSix months of rigorous imprisonment under Section 188 (disobedience to order duly promulgated by public servant) PPC\n\nSix months of rigorous imprisonment, Rs50,000 fine under Section 291 (continuance of nuisance after injunction to discontinue) read with Section 149 PPC\n\n10 years of rigorous imprisonment, Rs1m fine under Section 324 (attempted murder) read with Section 149 PPC\n\nTwo years of rigorous imprisonment on six counts, Rs50,000 to each injured under Section 337A (assault) read with Section 149 PPC\n\nOne year of rigorous imprisonment, Rs20,000 to one injured under Section 337F (punishment for assault on parts of the body other than the head or face) read with Section 149 PPC\n\nTwo years of rigorous imprisonment on 12 counts, Rs50,000 to each injured under Section 337L (punishment for other hurt) read with Section 149 PPC\n\nOne year of rigorous imprisonment, Rs100,000 fine under Section 341 (punishment for wrongful restraint) read with Section 149 PPC\n\nTwo years of rigorous imprisonment, Rs100,000 fine under Section 353 (assault or criminal force to deter public servant from discharge of his duty) read with Section 149 PPC\n\n10 years of rigorous imprisonment, Rs1m fine under Section 436 (mischief by fire or explosive substance with intent to destroy house, etc) read with Section 149 PPC\n\nFive years of rigorous imprisonment, Rs500,000 fine under Section 440 (mischief committed after preparation made for causing death or hurt) read with 149 PPC\n\nAdditionally, the 90 accused were sentenced under various sections of the Anti-Terrorism Act, 1997 (ATA).\n\n10 years of rigorous imprisonment, Rs1m fine under Section 7 (Punishment for acts of terrorism) of the ATA read with Section 149 PPC\n\n10 years of rigorous imprisonment, Rs1m fine under Section 7(1)H (the act of terrorism committed falls under clauses (h) to (n) of sub-section (2) of Section 6, shall be punishable, on conviction, to imprisonment of not less than five years but may extend to imprisonment for life and with fine) read with Section 149 PPC\n\nProperty forfeited to government under Section 7(2) (An accused, convicted of an offence under this act, shall be punishable with imprisonment of 10 years or more, including the offences of kidnapping for ransom and hijacking shall also be liable to forfeiture of property)\n\nMeanwhile, PTI Punjab Assembly member Junaid Afzal Sahi was sentenced to:\n\nThree years of rigorous imprisonment, Rs100,000 fine under Section 148 PPC\n\nOne year of rigorous imprisonment, Rs100,000 fine under Section 341 (punishment for wrongful confinement) read with Section 149 PPC\n\nAccording to the order, the 108 convicts will receive copies of the order and will be able to file an appeal within 15 days. Additionally, arrest warrants have been issued for those convicted in absentia, including Shibli Faraz, Omar Ayub, Rai Murtaza Iqbal and Zartaj Gul.\n\nMeanwhile, 77 accused were acquitted because the prosecution “miserably failed to prove the alleged offence”.\n\nIn a post on X, the PTI condemned the sentences in the strongest terms and branded the cases “false, fabricated, and politically motivated”, adding that the opposition leaders in both houses were sentenced to prevent the party’s mass mobilisation on August 5.\n\n“Through this decision, six of our National Assembly members, three Punjab Assembly members and one senator have been sentenced,” the party stated. “This decision is not only a clear violation of the Constitution and the law but also another dark stain on the face of justice.\n\n“The judiciary’s continuous transformation into a rubber stamp at the behest of the state system, issuing such grave verdicts one after another under political pressure without transparent trials, evidence, cross-examination of witnesses, or the right to defence, is a dangerous trend that is completely undermining the credibility of the judicial system,” the statement added.\n\nThe PTI added that this is the “first time” opposition leaders in both houses of parliament have been sentenced “solely based on their loyalty to Imran Khan’s political narrative, public representation, and constitutional struggle”.\n\n“The real purpose of these decisions is not to deliver legal justice but to make a concerted effort to prevent the public protest scheduled for August 5, which was announced by Imran Khan himself,” the party claimed.\n\n“Today’s sentences and the warrants issued against several other leaders this morning are all links in the chain of fear that the state system harbours toward Imran Khan’s peaceful public movement.”\n\nMoreover, the party branded the sentences “part of a systematic plan aimed at suppressing the public awakening and political consciousness emerging under Imran Khan’s leadership”.\n\nHowever, the PTI wrote that these sentences only ignited their resolve, ahead of the protests slated for August 5.\n\n“Imran Khan’s vision lives in our hearts, and our loyalty to it remains unwavering. Our leaders and workers are ready for every sacrifice, because we believe that only those nations survive the darkness of oppression that resist,” the statement read.\n\nThe Human Rights Commission of Pakistan deplored the mass sentencing.\n\n“While those involved in violence must be held accountable, the use of anti-terror laws to try civilians raises serious due-process concerns and is symptomatic of the continued erosion of democratic values. We reiterate that all those accused must receive fair, transparent trials in civilian courts and urge the state to refrain from using draconian laws to stifle political dissent.”\n\nIn May, an ATC in Islamabad sentenced PTI members, including MNA Abdul Latif, to 27 years of imprisonment for attacking a police station during the May 9 riots.\n\nIn December 2024, military courts had sentenced 85 civilians to prison terms ranging from two to 10 years for their involvement in violent attacks on military installations during the riots on May 9.\n\nAdditional reporting by Imran Gabol.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/3114475449f73b5.jpg",
  "retrievedAt": "2025-08-17T21:49:17.657Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927802/may-9-riots-faisalabad-atc-sentences-omar-ayub-shibli-faraz-and-other-pti-leaders-to-10-years-in-jail",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T09:56:01.000Z"
}
