{
  "title": "PML-N rejects rumours of Nawaz Sharif becoming president, terms them ‘table stories’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "PML-N Senator Irfanul Haque Siddiqui, when asked whether party chief Nawaz Sharif intended to run for president or would be politically active in the coming days, firmly denied the speculation, clarifying that the PML-N supremo had no intention of assuming the presidency.\n\nHis statement comes amid speculations earlier that President Asif Ali Zardari would resign from his post. However, the news was rejected across the political spectrum.\n\nSpeaking on Dawn News programme ‘Doosra Rukh’ on Wednesday night, Siddiqui categorically denied any such developments, saying, “Nawaz Sharif has neither expressed a desire to become president, nor has there been a discussion about it.\n\n“There is no truth to speculation that Nawaz Sharif is trying to change the system to become president himself. These are baseless, table stories.”\n\nHe added that there was a time when it was inconceivable that Zardari would become the president, but the decision was made due to the situation, timing and political climate.\n\nSiddiqui had earlier also denied reports of Zardari’s resignation. Speaking on Geo News programme ‘Geo Pakistan’, he said: “Reports that Zardari is resigning, Imran’s sons are coming, Nawaz Sharif is going to Adiala … these are not news. They are bogus, table stories.”\n\nHe had said, “Zardari has not created any difficulties for the government, and understands his constitutional responsibilities as head of state”.\n\nThe PML-N leader had said his party had “no trouble” working with the president and there was no credible reason to remove him from office. “We have a coalition with the PPP. Why would we bring down this system?” he questioned.\n\nInterior Minister Mohsin Naqvi had also rebutted rumours of President Zardari being asked to resign, terming it a “malicious campaign”.\n\n“We are fully aware of who is behind the malicious campaign targeting President Asif Ali Zardari, Prime Minister Shehbaz Sharif, and the chief of army staff,” Naqvi wrote on X.\n\n“I have categorically stated that there has been no discussion, nor does any such idea exist about the president being asked to resign or the COAS aspiring to assume the presidency,” he asserted.\n\nHe said the president enjoys a strong and respectful relationship with the leadership of the armed forces. He quoted President Zardari as having “clearly” stated: “I know who is spreading these falsehoods, why they are doing so, and who stands to benefit from this propaganda.”\n\nNaqvi stressed that the “sole focus” of Chief of Army Staff Field Marshal Asim Munir was Pakistan’s strength and stability.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/31142240e6f15f2.jpg",
  "retrievedAt": "2025-08-17T21:49:04.239Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927804/pml-n-rejects-rumours-of-nawaz-sharif-becoming-president-terms-them-table-stories",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T10:44:40.000Z"
}
