{
  "title": "BNP leader condemns ‘abduction’ of colleague, decries ‘state atrocities’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The central information secretary of Balochistan National Party (BNP), Hassan Agha, has condemned the alleged kidnapping of his colleague Dr Abdul Majeed Mengal.\n\nMr Agha said the party had been facing this situation since 2012.\n\nWhile addressing a press conference on Tuesday, Mr Agha said if the state and government cannot tolerate BNP’s peaceful political struggle, they should officially ban the party instead of “harassing our leaders and their families with false and baseless charges”.\n\nHe accused state institutions of using intimidation tactics to weaken the party and said strategies “would not succeed”.\n\nHe also criticised the arrest of Baloch Yakjehti Committee leader Dr Mahrang Baloch and her colleagues.\n\nMr Agha cited the government’s decision to prevent BNP chief Sardar Akhtar Mengal from traveling abroad for medical treatment as part of a “targeted campaign” against the party.\n\nHe asserted the BNP has always advocated, through democratic means, for the rights and resources of Balochistan.\n\nMr Agha accused the federal government of “worsening the situation” in Balochistan through “electoral manipulation” instead of resolving the province’s issues.\n\nHe held the current government responsible for the “targeted killing of BNP workers” and the arrest of women activists.\n\n“A government that cannot protect the dignity of its own mothers and sisters and is afraid of a political party’s banner has no right to rule,” he said, adding the BNP would continue its fight for justice and rights.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/67d637e33cbfa.jpg",
  "retrievedAt": "2025-08-17T21:51:06.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927714/bnp-leader-condemns-abduction-of-colleague-decries-state-atrocities",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:32:28.000Z"
}
