{
  "title": "Top seeds Zverev, Gauff advance at Canadian Open - Sport - DAWN.COM",
  "author": null,
  "content": "TORONTO: Top seeds Alexander Zverev of Germany and American Coco Gauff advanced to the third round of the Canadian Open on Tuesday after both players were pushed hard by their opponents.\n\nWorld number three Zverev, playing in his first match since his first-round loss at Wimbledon, was far from his best but emerged with a 7-6(8/6), 6-4 win over Adam Walton under the lights in Toronto.\n\nMomentum shifted firmly in Zverev’s favour when he won a 52-shot rally in the first set tiebreak, and he sealed the win on a double fault by the Australian in the second set.\n\n“It was a very important moment, very important point for me,” Zverev said. “Lucky to get through in the first set and finish it off in two.”\n\nZverez said he did not play his “prettiest” match but was proud of how he battled after taking a break from the game following his early Wimbledon exit.\n\n“I took some time off, which I needed also for myself. I’m happy to be playing again,” added Zverev, after recording 499th win of his career.\n\nZverev next plays 32nd seed Matteo Arnaldi, who defeated qualifier Tristan Schoolkate 6-3, 3-6, 6-3, on Thursday.\n\nThird-seeded Lorenzo Musetti and number five Holger Rune both eased into action with comfortable straight set wins. The pair began after byes and wasted little time in advancing into the third round, with Musetti hammering Australian qualifier James Duckworth 7-5, 6-1.\n\nRune dispatched big hitter Giovanni Mpetshi Perricard 7-6 (9/7), 6-3.\n\n“It was a very tricky first match for me, he’s a big server and (there was) not a lot of rhythm in the match,” Rune said after his 75-minute win.\n\n“I had to really take care of my own serve, and then just look for the opportunities.\n\n“It was about finding a way to win at the end of the (first set) tiebreak. In the second set I was pretty good when it mattered. I think I was serving very well today.”\n\nNumber eight Casper Ruud put out Roman Safiullin 6-3, 6-3 for another seeded win.\n\nElsewhere, 11th seed Karen Khachanov beat Juan Pablo Ficovich of Argentina 6-4, 6-2.\n\nLast year’s winner in Canada, Alexei Popyrin, defeated local wild card Nicolas Arseneault 7-6(9/7), 6-3.\n\nCanadian Denis Shapovalov continued his unlucky home streak taking a 7-6(7/4), 7-5 loss to Learner Tien and extending a losing run dating to 2019 at home.\n\nTenth-seeded former champion Daniil Medvedev got through his opening match and will next face Popyrin after a 7-6(7/3), 6-4 win against Czech lucky loser Dalibor Svrcina, ended with more than 40 unforced errors.\n\nOn the women’s side, top seed Gauff was two points from defeat but battled back to beat fellow American Danielle Collins 7-5, 4-6, 7-6(7/2) in a nearly three-hour battle to reach the third round.\n\nFrench Open champion Gauff overcame 23 double faults and 74 unforced errors to beat Collins in their first career meeting.\n\n“I was practicing well and I don’t think I transferred it today, but hopefully I got my bad match of the tournament out of the way,” Gauff said.\n\nThe day’s biggest shocker saw Japanese qualifier Aoi Ito stun Italian seventh seed Jasmine Paolini 2-6, 7-5, 7-6(7/5).\n\nThe 21-year-old beat Amer­ican Katie Volynets in the first round for her first WTA 1000 level triumph then followed with her first victory over a top-10 opponent by rallying from a set and break down to advance after two hours and 27 minutes.\n\nWorld number 110 Ito saved a match point in the 10th game of the second set and outlasted sixth-ranked Paolini to book a third-round match against Spain’s 51st-ranked Jessica Bou­zas Maneiro, who defeated Ame­r­ican Ashlyn Krueger 6-4, 6-4.\n\nIto reached the semi-finals last October at Osaka in her WTA debut and claimed a 125-level title at Canberra in January, but until this week had not won a tour-level match this year.\n\nIn other matches, DC Open champion Leylah Fernandez dropped her opener on home soil, falling to Australian Maya Joint 6-4, 6-1.\n\nWashington runner-up Anna Kalinskaya advances, the Russian beating American Ann Li 7-6(8/6), 0-6, 6-3.\n\nRussian fourth seed Mirra Andreeva advanced to the third round in a walkover past Canada’s Bianca Andreescu due to a left ankle injury.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688aa7fab71d6.jpg",
  "retrievedAt": "2025-08-17T21:50:57.253Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927688/top-seeds-zverev-gauff-advance-at-canadian-open",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:32:36.000Z"
}
