{
  "title": "Senate body voices concern over loss of life, property in flooding - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Expressing concern over the death of a man and his daughter in DHA-5 and sweeping away three cars and some bikes in Saidpur area due to flooding, a senate panel on Wednesday held authorities concerned responsible for the loss.\n\nSenate Standing Committee on Water Resources, which met here with Senator Shahadat Awan in the chair at the Old PIPS Hall, Parliament Lodges, said that this was the failure of the authorities concernedas at least safety grills should have been installed on bridges and low lying area to avoid loss of lives and vehicles.\n\n“In this society [DHA] a car fell down in a nullah and drowned..If there were no safety grills, this is a serious issue,” said Senator Humayun Mohmand.\n\nThe committee directed the minister concerned to submit a report in next meeting as what actions were taken against those responsible for the tragedy of DHA-5.\n\nWants action against officials responsible for DHA-5, Saidpur incidents\n\nThe committee members said action must be taken against responsible and proper inquiry should be conducted by Ministry of Water Resources.\n\nCDA was then asked to brief the committee upon the data regarding encroachments on the nullahs and waterways in Islamabad Capital Territory.\n\nCommittee voiced concern over flooding in Saidpur took place due to encroachments in the right of ways of nullahs and CDA’s performance in this regard is not satisfactory.\n\nThe committee directed that the CDA chairman should brief the committee in next meeting regarding removal of encroachments from right of ways of nullahs.\n\nMeanwhile, members highlighted the rapid rise of illegal constructions and land-grabbing along natural drains and waterways all over the country. The committee directed the Ministry of Water Resources and local authorities concernedto take urgent action to remove encroachments and submit a comprehensive report identifying affected sites and timelines for clearance.\n\nIt is relevant to note here last week CDA Chairman while chairing a meeting had decided to start a mega operation across Islamabad to remove alleged encroachments either in right of way of nullahs or from their banks to avoid any loss during flooding.\n\nRecently, Saidpur Village experienced flooding that swept away three cars and several motorcycles.\n\nEarlier, the committee besides other agenda items discussed Dams Safety Bill. The Ministry of Water Resources informed the committee that the Dams Safety Bill was drafted with the help of ADB and tabled before the ministry two days ago.\n\nThe representative of the ministry expressed the hope that the bill would be ready for introduction in the House within three months after final vetting.\n\nThe committee was then briefed on the status of the Nai Gaj Dam project, which remains stalled due to insufficient funds by the federal government.\n\nOfficials from Wapda and the ministry reported that the delay in completion of the project was due to inflation in the country and further progress was hampered due to deadlock in the funding.\n\nThe committee voiced serious concern over the cost escalation and urged the government to approve the revised 3rd PC-I, within one month and allocate the funds for the completion of the project in June, 2027, the stipulated time-frame.\n\nThe committee chairmanstressed that the issue be raised at the highest level for resolution for which the Minister for Water Resources Moeen Watto assured the committee, that he would try to get the revised 3rd PC-I of Nai Gaj dam approved by the government within one month so that funds could be released as demanded by Wapda.\n\nDuring the briefing on the implementation status of the National Water Policy and groundwater regulation, the committee was informed that although Water Acts and Regulations have been passed by Sindh, Punjab, and Khyber Pakhtunkhwa, their implementation remains limited.\n\nBalochistan in this regard already has a law that is going to be updated by a new enactment in few months, as informed by the Chief Engineer, Irrigation Balochistan.\n\nAs far as the steps taken by the Government of Balochistan is concerned, it was informed that various executive orders, policies have been issued in this regard, however the Government shall be in the capacity to regulate the same one the enactment is passed by the provincial assembly.\n\nThe Committee observed that provincial delays in implementing regulatory frameworks threaten long-term water sustainability.\n\nAll provinces were directed to furnish updated implementation reports within a month, clearly indicating timelines, legal instruments enacted, and operational challenges, if any.\n\nThe Committee reiterated the need for coordinated water governance, timely institutional response, and strict action against encroachments and administrative delays.\n\nThe committee Chairman Senator Shahadat Awan concluded the meeting by emphasizing the urgency of addressing regulatory gaps and infrastructure delays.\n\nHe further directed that in the upcoming meeting, representatives of FIA and NAB be invited to provide input regarding inquiries related to Wapda projects and pending cases.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/68800ba9ab480.jpg",
  "retrievedAt": "2025-08-17T21:50:17.222Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927664/senate-body-voices-concern-over-loss-of-life-property-in-flooding",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:33:07.000Z"
}
