{
  "title": "Bannu police foil attack on checkpost - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: Police foiled an attack on a checkpost in Shaikh Landak area of Bannu district on Tuesday night.\n\nAn official said that the cops deployed at the post noticed movement of terrorists near their installation and responded quickly. He said cops opened fire on terrorists, forcing them to flee the area.\n\nMeanwhile, police officials held meetings with elders in Bannu and Karak districts to review law and order situation and restore peace and normalcy in the region.\n\nElders of the Madakhel tribe attended the meeting held in the Wazir subdivision of Bannu. DSP Reham Ayaz Khan, SHO Hasan Gul and other police officials were also in attendance.\n\nThe elders said they always supported law enforcement agencies in their efforts to establish peace in the region.\n\nThe officials said joint efforts by police and tribesmen would bring lasting peace to the Wazir subdivision and other parts of the district.\n\nIn Karak, police authorities asked the elders to help make the district crime-free during a meeting held at the Latambar police station.\n\nOn the occasion, elders said they would stand by the police to purge the district of crime and social and moral evils.\n\nShot dead\n\nA married woman was shot dead inside her house in the Khar Khaybar area of Serai Naurang town of Lakki Marwat on Wednesday.\n\nPolice identified the deceased as Sania Bibi, 21, wife of Mohammad Abrar. They shifted the body to the Tehsil Headquarters Hospital for postmortem.\n\nMosam Khan, 56, father of the deceased, told police that Jabbar Khan, brother-in-law of his daughter, Sania, shot her dead over a petty issue. The police registered a case against the suspected killer.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/28151020c512087.jpg?r=113317",
  "retrievedAt": "2025-08-17T21:50:08.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927645/bannu-police-foil-attack-on-checkpost",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:33:13.000Z"
}
