{
  "title": "Closer Pak-Iran cooperation vital to securing shared interests, say experts - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Closer Pakistan-Iran cooperation is vital to securing shared interests in a shifting geopolitical environment where both countries face common threats, including from Israel.\n\nThis was observed by experts at a roundtable session hosted by the Islamabad Policy Institute (IPI) ahead of Iranian President Masoud Pezeshkian’s visit to Pakistan, which brought together Pakistani lawmakers, former diplomats, journalists, and a visiting delegation of Iranian media to discuss the future of bilateral ties.\n\nFormer information minister and chairman of the Senate Foreign Affairs and Defence Committees, Senator Mushahid Hussain, warned of a growing “Indo-Israel axis” and called for coordinated responses from both countries.\n\n“Israel helped India during its aggression against Pakistan, while Iran’s recent conflict with Israel exposed Indian support for Tel Aviv,” he said. Referring to the Pakistan–India conflict in May, he noted: “Israeli Harop drones were operated by Israelis from inside India against Pakistan. This is a very major thing,” he stressed.\n\nSenator Mushahid Hussain warns of growing ‘Indo-Israel axis’, calls for coordinated responses from both countries\n\nSenator Hussain emphasised that Pakistan’s solidarity with Iran was not just symbolic, but rooted in long-standing ties and mutual strategic concerns.\n\n“Pakistan’s solidarity with Iran is a reaffirmation of the time tested ties between the two countries, and this solidarity is also based on mutual interest and to counter common threats that both Iran and Pakistan face.”\n\nHe said both countries had faced aggression on “false pretexts” and had disproved the myth of India and Israel’s invincibility through their resilience. He urged both sides to work jointly on unresolved regional crises.\n\n“Resolution of the Palestine and Kashmir disputes is essential for stability in both the Middle East and South Asia,” he added.\n\nIPI Chairperson and former human rights minister Dr Shireen Mazari highlighted unresolved bilateral challenges, especially in border management, as key obstacles to trade and pilgrimage flows. She pointed to foreign interference as a destabilising force in the region.\n\n“These powers are actively trying to destabilise our region,” Dr Mazari said, naming Israel and the United States as external actors fueling separatist movements. She also called for stronger security coordination and revived efforts on the stalled Iran-Pakistan gas pipeline.\n\nShe questioned the legitimacy of the global nuclear non-proliferation regime.\n\n“If Israel is not brought into NPT and under IAEA safeguards, Iran would have little incentive to stay in the NPT,” she argued.\n\nSenator Raja Nasir Abbas Jafri, Chair­m­­an of the Majlis Wahdat-i-Muslimeen, said both countries must prioritise internal stability to pursue meaningful regional cooperation.\n\n“Hostile external forces are trying to disrupt the global power shift away from the West by destabilising key regions like South Asia, West Asia and South China Sea,” he said.\n\nHe stressed the need for conflict prevention, improved communication, and deeper political and media partnerships. “We must root our relationship in mutual trust and shared strategic objectives,” he added.\n\nIPI fellow and security analyst Abdul Basit pointed to changing dynamics along the Pakistan-Iran border, where new actors are emerging while old ones adapt their strategies.\n\n“The border region is witnessing entrance of new state and non-state actors. At the same time, the existing non-state actors are also adjusting their agendas in line with the new geopolitical realities,” he noted.\n\nReferencing recent reports, Mr Basit warned that Israel was allegedly promoting separatist narratives through initiatives like the Balochistan Study Project, which advocates for regime change in Iran and the creation of an independent Balochistan. He also identified the Islamic State Khorasan Province (ISKP) as a growing threat in the Iran–Pakistan border region.\n\nMuhammad Faisal, IPI fellow and doctoral candidate at the University of Technology, Sydney, said that despite the strain caused by the January 2024 missile exchanges, both sides had since worked to restore political trust.\n\n“While diplomatic ties have recovered, economic cooperation remains stalled due to sanctions and lack of formal banking channels,” he said.\n\nMr Faisal emphasised the need for a balanced approach in Pakistan’s relations with Iran and Gulf states. “Pakistan’s ability to maintain strategic dialogue with Iran and the US has increased its diplomatic space,” he said.\n\n“This must be used to build sustained engagement based on realism and recognition of each other’s limitations,” he said.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/301357243bf8641.jpg?r=140020",
  "retrievedAt": "2025-08-17T21:51:18.361Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927716/closer-pak-iran-cooperation-vital-to-securing-shared-interests-say-experts",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:32:28.000Z"
}
