{
  "title": "India PM Modi faces opposition fury after Trump’s 25pc tariff threat - World - DAWN.COM",
  "author": null,
  "content": "Indian opposition parties criticised the government on Thursday, describing US President Donald Trump’s threat of a 25 per cent tariff as a diplomatic failure for New Delhi, while the rupee currency tumbled and equity indexes slid in response to the news.\n\nThe 25pc rate would single out India more harshly than other major trading partners, and threatens to unravel months of talks, undermining one of Washington’s strategic partners in the region, viewed as a counterbalance to China.\n\nTrump said the tariff on imports from India would start from Friday, in addition to an unspecified penalty for Russian dealings and involvement in the BRICS grouping of nations.\n\nIn response, the government of Prime Minister Narendra Modi said it was studying the implications of Trump’s remarks and was dedicated to securing a fair trade deal.\n\n“This development reflects a broader collapse of foreign policy under the Modi government,” a lawmaker of the main opposition Congress party said in a notice to the lower house of parliament, asking for a discussion on the matter.\n\nThe debate would focus on the “government’s economic and diplomatic failure in preventing the imposition of 25pc US tariffs plus penalties on Indian exports,” the notice added.\n\nCommerce Minister Piyush Goyal was expected to brief the lower house later on Thursday, his office said.\n\n“I don’t care what India does with Russia,” Trump said in a Truth Social post on Thursday, adding, “They can take their dead economies down together, for all I care.”\n\nRussia remained India’s top oil supplier during the first six months of 2025, accounting for 35pc of overall supplies.\n\nEconomists warned the steep tariff could hurt India’s manufacturing ambitions and trim up to 40 basis points off economic growth in the financial year to March 2026.\n\nIndia’s benchmark equity indices, the Nifty 50 and BSE Sensex, fell as much as 0.9pc each in early trade before paring losses and trading flat.\n\nThe rupee was trading down 0.2pc at 87.6175 after touching its lowest in more than five months earlier in the day. The dollar’s rise gains momentum as the Fed signals patience on rate cuts.\n\nIndia has received a “raw deal”, said Priyanka Kishore, an economist at Asia Decoded. “While further trade talks may bring the tariff rate down, it appears unlikely that India will secure a significantly better outcome than its eastern neighbours,” she added.\n\nThat would raise questions about India’s relative appeal as a China plus one destination, she said, referring to a strategy of diversifying supply chains through manufacturing outside China to reduce geopolitical and operational risks.\n\nTrade talks continued, Trump said on social media, however, as nations face a Friday deadline to strike deals on reciprocal tariffs or have a US tariff slapped on their exports.\n\nThe US levy on India exceeds those agreed by some other nations in deals with the Trump administration. For example, the tariff on Vietnam is set at 20pc and on Indonesia at 19pc, with levies of 15pc on Japanese and European Union exports.\n\nOn Wednesday, Trump said Washington had reached a trade deal with India’s arch-rival Pakistan that Islamabad said would lead to lower tariffs on its exports, but neither side has yet revealed the agreed rate.\n\nSince India’s short but deadly conflict with Pakistan in May, New Delhi has been unhappy about Trump’s closeness with Islamabad and has protested, casting a shadow over trade talks.\n\nDespite former public displays of bonhomie between Trump and Modi, India has taken a slightly harder stance against the United States in recent weeks.\n\nTrump has repeatedly taken credit for the India-Pakistan ceasefire he announced on social media on May 10, but India disputes his claim that it resulted from his intervention and trade threats.\n\n“The government has destroyed our economic policy, has destroyed our defence policy, has destroyed our foreign policy,” opposition leader Rahul Gandhi told reporters.\n\nThe United States, the world’s largest economy, now has a trade deficit of $45.7 billion with India, the fifth largest.\n\nTrump’s announcement and the lack of clarity on the penalty have created “considerable uncertainty”, said Krishan Arora, a partner at consultants Grant Thornton Bharat.\n\n“India is also actively realigning its position in global supply chains through deeper trade and investment linkages with other countries - an effort that must now accelerate to reduce long-term vulnerabilities,” Arora said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T21:48:45.292Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927819/india-pm-modi-faces-opposition-fury-after-trumps-25pc-tariff-threat",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T14:00:04.000Z"
}
