{
  "title": "Bajaur people take to streets against military operation - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: People from all walks of life took to streets on Wednesday to protest the ongoing military operation in several areas of Lowi Mamund tehsil in Bajaur that was launched on Tuesday.\n\nThe residents of different areas of the district, mostly youth and political and social activists, attended the demonstration held at Umary Chowk, the junction linking Lowi Mamund and War Mamund tehsils.\n\nThe protesters, some wearing black ribbons and holding copies of the Holy Quran, expressed deep concerns over suffering of local population during the ongoing anti-militant operation in Lowi Mamund tehsil. Describing the operation as unannounced, they alleged that authorities launched the action without issuing prior notice to locals.\n\nThey also criticised authorities for imposing a three-day curfew in several areas of Lowi Mamund tehsil, saying the move caused immense hardships to locals.\n\nMeeting decides to halt action and relax curfew at daytime\n\nFormer MNA Gul Zafar Khan, PTI senior leader and Nawagai tehsil council chairman Dr Khalilur Rehman, ANP local leader Gul Afzal Khan, PTI young leader Najibullah Khan Mamund, JI leader Irfan Janbaz and Khalid Khan addressed the rally, which later turned into a sit-in blocking the main Inayat Kallay-Laghari road to all sorts of traffic.\n\nSpeakers said that the residents of Bajaur were peace-loving people and wanted to get the region free of all sorts of anti-peace and anti-social elements as they posed a significant threat to peace and normalcy in the area.\n\nHowever, they claimed that military action was not a good solution to eliminate anti-peace elements in the region as such actions yielded nothing but brought suffering for people in the past.\n\nThey said that the killing and wounding of innocent locals in the ongoing operation strengthened their narrative that use of force would not restore peace in the region.\n\n“Every citizen of Bajaur yearns for durable peace in the region but experience over the past couple of years has shown that use of force has not brought peace rather perpetuated lawlessness,” they added.\n\nSpeakers also slammed district administration for imposing curfew in several areas of Lowi Mamund tehsil without taking residents into confidence. They demanded end to the ongoing action in Lowi Mamund tehsil and lifting the curfew with immediate effect.\n\nThe sit-in continued till filing of this report late on Wednesday night. Gul Zafar Khan and others suggested approaching both security forces and militants with the Holy Quran to request them to swiftly end the conflict in the region if it wasn’t resolved immediately.\n\n“This would be the best solution to end the conflict. We should approach both sides with the Holy Quran, requesting them to end the fight in our area if the conflict isn’t ended immediately,” they said.\n\nMeanwhile, ‘Operation Sarbakaf’ continued for the second day on Wednesday. However, there were no reports about new casualties. According to sources, three civilians were killed and 10 others were wounded in exchange of fire in different areas of Lowi Mamund in Tuesday’s action.\n\nSimilarly, at least four terrorists were killed, 12 were injured and about 10 were captured alive by security forces in different areas of Lowi Mamund tehsil during Tuesday’s operation, which is yet to be confirmed by authorities officially.\n\nMeanwhile, authorities decided late on Wednesday night to postpone the operation scheduled for today (Thursday) and also ease curfew in Lowi Mamund tehsil.\n\nAccording to the sources, the decision was taken by senior officials of security forces during a meeting with a jirga of local elders and political leaders held at Bajaur Scouts headquarters in Khar.\n\nSources said that Deputy Commissioner Shahid Ali Khan and DPO Waqas Rafique were also present in the meeting wherein it was decided that there would be no operation in Lowi Mamund tehsil on Thursday.\n\nThey said that there would be a daytime relaxation in the curfew while a complete nighttime curfew would remain in place in the region. It was also decided in the meeting to award compensation to the families of those civilians, who were killed and wounded in the operation and rebuild the houses affected in the operation.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688aa046d7c4f.jpg",
  "retrievedAt": "2025-08-17T21:50:07.617Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927655/bajaur-people-take-to-streets-against-military-operation",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:33:13.000Z"
}
