{
  "title": "Four women die, child missing as vehicle falls into swollen Hassanabdal stream - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: Four women died and a minor child went missing after a double-cabin vehicle carrying ten members of a family was swept away in a swollen stream near the Jehri Kass area, about 40 kilometres from Hassanabdal, during the early hours of Wednesday, police and rescue sources said.\n\nAmong the deceased were a six-month pregnant woman and a one-year-old child.\n\nAccording to District Emergency Officer Ali Hasnian, out of the ten family members, five were rescued. The bodies of four women were recovered, while the search for the missing child continued until the filing of this report.\n\nQuoting the victims’ family, police said the family was returning from a farmhouse located in the nearby village of Bhallar Jogi when their vehicle got stuck in rainwater and was swept away by the stream. The accident occurred near Jehri Kass, bordering the Haripur district of Khyber Pakhtunkhwa, during the early hours of Wednesday.\n\nAccording to sources, the five rescued individuals were identified as Waris Khan, 63, a resident of New City, Wah Cantt, Shehryar Khan, 28, Asfandyar Khan, Farhat Sheikh, 55, and Aqeel Khan.\n\nThe bodies of Nimra Bibi, 25, Nazia Bibi, 50, Sabira Bibi, 65, and Eeman Bibi, 28, were recovered from the Haro River, a few kilometers from the site of the incident, and were shifted to the Tehsil Headquarters Hospital for medico-legal formalities.\n\nThe search for the one-year-old Mustafa Khan continued at the time of filing this report.\n\nAccording to eyewitness Ameer Ali, who was the first to reach the scene, the accident was caused by the strong water flow in the seasonal stream following recent heavy rainfall.\n\nSoon after the incident, Deputy Commissioner Rao Atif Raza, along with Assistant Commissioner Aqsa Imtiaz, reached the spot and monitored the search and rescue operation.\n\nScuba divers from all six Rescue 1122 stations across the district were called in and participated in the operation, which led to the timely recovery of the four bodies, including that of the pregnant woman.\n\nA pall of gloom spread in the New City area of Wah Cantonment when the coffins of the four women, all from the same family, were brought to their home.\n\nHeart-wrenching scenes were witnessed at both the hospital and the residence as relatives mourned the sudden deaths of the women.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/688aa28bef229.jpg",
  "retrievedAt": "2025-08-17T21:50:29.604Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927667/four-women-die-child-missing-as-vehicle-falls-into-swollen-hassanabdal-stream",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T00:33:07.000Z"
}
