{
  "title": "High interest rate stokes private sector woes - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The business community, except multinationals, has expressed intense disappointment over the State Bank of Pakistan’s (SBP) decision to maintain the policy rate at 11 per cent, warning that the move could stifle economic revival and increase pressure on an already struggling private sector.\n\nPresenting a contrasting view, M. Abdul Aleem, Chief Executive and Secretary General of the Overseas Investors Chamber of Commerce and Industry (OICCI), said his organisation supported the central bank’s decision.\n\n“Given rising imports, exchange rate pressures, and recent domestic and global challenges, a cautious approach is prudent. Overall, this is a bold decision,” he told Dawn.\n\nHowever, Federation of Pakistan Chambers of Commerce and Industry (FPCCI) President Atif Ikram Sheikh said that while the Consumer Price Index (CPI) dropped to 3.2pc in June, the SBP had maintained a policy rate 780 basis points higher.\n\nHe had earlier urged a single-stroke cut of 500bps to align monetary policy with the Special Investment Facilitation Council (SIFC) and the Prime Minister’s vision for industrial growth, export promotion, and import substitution.\n\nKarachi Chamber of Commerce and Industry (KCCI) President Muhammad Jawed Bilwani also criticised the SBP’s stance, arguing that the decline in core inflation left no sound economic justification for keeping borrowing costs so high.\n\n“Even with current or marginally higher inflation, there is room to bring the rate down to single digits, as regional economies have done under tougher conditions,” he said.\n\nSBP slammed for maintaining status quo\n\nBilwani warned that elevated interest rates were harming small and medium enterprises (SMEs) and manufacturers, hindering economic recovery, job creation, and industrial activity. “These high rates have choked working capital, raised default risks, and increased the cost of doing business, making our exports globally uncompetitive,” he added.\n\nSITE Association of Industry President Ahmed Azeem Alvi questioned the rationale behind maintaining the rate amid declining inflation. He called on the finance minister and SBP governor to justify the move and engage the business community in such decisions.\n\n“At a time when Pakistan is receiving positive signals globally following its success in the Marka-e-Haq, this decision seems ill-timed and potentially harmful to economic momentum,” he said.\n\nAlvi proposed a gradual reduction of the policy rate to 5-6pc to stimulate investment, growth, and employment.\n\nKorangi Association of Trade and Industry (KATI) President Junaid Naqi echoed similar concerns. He said the SBP had ignored several positive indicators — declining inflation, improved foreign reserves, and a narrowing current account deficit — while keeping interest rates among the highest in the region.\n\n“The manufacturing and export sectors are under severe financial stress, and this policy only deepens uncertainty,” he said.\n\nNaqi urged the SBP to adjust rates in line with ground realities and shift from a restrictive stance to one that supports business revival and long-term growth.\n\nPakistan Chemicals and Dyes Merchants Association Chair­man Salim Valimuhammad also criticised the SBP, calling the decision unwise and urging a shift to single-digit rates in the next quarter.\n\n“Affordable credit is essential for business expansion and industrial output. Without it, the government will also struggle to boost revenue,” he noted.\n\nPublished in Dawn, July 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/301531096a9fa1f.png?r=170832",
  "retrievedAt": "2025-08-17T21:49:52.430Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1927743/high-interest-rate-stokes-private-sector-woes",
  "dateList": "2025-07-31",
  "date_published": "2025-07-31T03:29:33.000Z"
}
