{
  "title": "Team led by SSP safe city visits NUST to enhance AI cooperation",
  "author": null,
  "content": "ISLAMABAD, Jul 09 (APP):A team led by Senior Superintendent of Police (SSP) Safe City Dr Muhammad Iqbal visited the National Centre of Artificial Intelligence (NCAI) at the National University of Sciences and Technology (NUST) on Wednesday to strengthen cooperation for the effective use of AI-based technologies in policing and surveillance operations.\nAn official told APP that the visit was conducted under the special directions of Inspector General of Police Islamabad, Syed Ali Nasir Rizvi, aimed at modernizing Safe City Islamabad’s infrastructure through cutting-edge innovation.\nHe said the delegation held a meeting with the Project Director of NCAI, where both sides discussed potential avenues for integrating AI-powered applications into the Safe City system to improve real-time monitoring, crime detection, and emergency response.\nHe said emphasis was placed on practical collaboration in areas such as city-wide surveillance, automated threat analysis, and predictive policing.\nHe said both institutions reaffirmed their commitment to sustained cooperation in developing AI solutions to support law enforcement and enhance public safety across the federal capital.\nHe said Safe City Islamabad currently operates more than 700 AI-enabled cameras across critical points of the city, significantly contributing to crime prevention and rapid response.\nOn this occasion, SSP Iqbal stated that Safe City Islamabad is fully aligned with technological advancements and is determined to expand its capabilities with smarter, AI-driven systems.\nSSP Iqbal added that the project remains committed to safeguarding the lives and property of citizens and ensuring peace and order in Islamabad through technology-driven policing.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:23:49.596Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/team-led-by-ssp-safe-city-visits-nust-to-enhance-ai-cooperation/",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T15:46:00.000Z"
}
