{
  "title": "AC cracks down on touting outside excise office; arrests 4",
  "author": null,
  "content": "ISLAMABAD, Jul 09 (APP):The Assistant Commissioner (AC) of the Industrial Area on Wednesday conducted an unannounced inspection outside the Excise and Taxation Office and detained four individuals involved in touting.\nAccording to the spokesman of ICT administration, in response to growing complaints from citizens, the Assistant Commissioner (AC) Industrial Area carried out a surprise visit outside the Excise and Taxation Department located in Islamabad’s Industrial Zone. The operation was aimed at curbing the presence of touts who are often found offering unlawful assistance to visitors in return for money.\nDuring the visit, the AC identified four individuals operating illegally outside the premises. These individuals were reportedly posing as facilitators and misleading people seeking legitimate services at the Excise office, including vehicle registration and token tax payment.\nUpon verification, it was found that the arrested men had no official affiliation with the department. They were taken into custody on the spot and shifted to the local police station for further legal action.\nAccording to officials, the administration had received multiple reports of harassment and fraud attempts by such elements, prompting immediate action. The arrested touts were allegedly charging citizens for services that are either free or require no third-party involvement.\nAuthorities said the presence of unauthorized agents not only causes inconvenience to the public but also undermines the credibility of government departments. The Assistant Commissioner stated that steps are being taken to ensure transparency and a citizen-friendly environment at public offices.\nFollowing the arrests, the AC also issued instructions to enhance surveillance outside the Excise office and to deploy security staff to prevent similar activities in the future. Visitors were advised to avoid engaging with any person claiming to offer fast-track services for a fee.\nThis operation is part of a broader initiative by the Islamabad Capital Territory (ICT) Administration to improve service delivery and ensure that citizens can access government services without interference or exploitation.\nOfficials have warned that further checks will be carried out regularly and that strict action will be taken against anyone found involved in similar practices. The public has also been urged to report such individuals to the authorities immediately.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:23:49.242Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ac-cracks-down-on-touting-outside-excise-office-arrests-4/",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T15:49:00.000Z"
}
