{
  "title": "Senate panel urges PTV overhaul to tackle financial strain",
  "author": null,
  "content": "ISLAMABAD, Jul 9 (APP):The Senate Standing Committee on Information and Broadcasting on Wednesday sought a workable plan to revamp Pakistan Television’s (PTV) to overcome financial problems and demanded full lists of its staff and anchorpersons in response to growing scrutiny over the organization’s budgetary challenges.\nThe meeting chaired by Senator Ali Zafar, the committee deliberated on key legislative and administrative matters relating to the media sector. The Committee voiced concern over recent recruitment at PTV despite mounting financial strain and the loss of revenue following the removal of the TV license fee from electricity bills.\nMinistry officials reported that PTV’s annual budget of Rs. 11 billion had been fully utilized, with\nRs. 8.5 billion spent solely on salaries.\nSenator Ali Zafar raised questions about inconsistencies between reported salary disbursements and on-ground realities, and called for a future briefing on viable reform strategies. With 3,507 regular employees, the committee demanded employment records from the past five years. Senator Sarmad Ali voiced concern over persistent financial losses and hinted at the possibility of privatization.\nSecretary for Information and Broadcasting Ms Ambreen Jan informed the committee that to offset the financial shortfall, Pakistan Television (PTV) would receive its allocated funds from the Ministry of Finance in quarterly installments.\nThe Secretary informed the committee that emoluments exceeding Rs 500,000 per month had been reduced, 84 employees had been terminated, and 280 staff members with unverified academic credentials were undergoing dismissal proceedings. Additionally, a team has been assigned to inspect 104 PTV boosters to identify and shut down malfunctioning units.\nHe said the surge of indecent content in TV drama serials, undermines cultural and religious values. He stated that the proposed bill seeks to amend existing laws and prohibit offensive language that could negatively impact those norms.\nSarmad Ali called for action by PTA or religious advisory bodies and proposed creating a content monitoring authority.\nSenators voiced concerns over the enforcement of existing PEMRA regulations.\nSenator Pervaiz Rashid argued that current penalties have been ineffective in curbing violations and warned against excessive regulation of cultural norms, particularly in relation to attire.\nSenator Afnan clarified that the proposed legislation is not intended to target women. The committee agreed to move forward with voting on the bill, as the Chairman stressed the importance of maintaining balance, avoiding harsh measures or undue police involvement, and consulting the Minister for Information for a final stance.\nSecretary for Information and Broadcasting, Ms. Ambreen Jan, highlighted that Pakistani TV channels often air international sports events containing alcohol and gambling promotions, which fall beyond local regulatory control.\nSenator Zarqa Suharwardy Taimur raised concerns regarding government departments providing incomplete or selective information under the Right of Access to Information (Amendment) Bill.\nSenator Ali Zafar backed the proposal for mandatory written justifications in cases of information denial and supported inviting the Information Commissioner for further consultation. Senator Zarqa referenced Scotland as a model for transparency and prompt responses by public institutions.\nThe Committee also discussed challenges facing the cinema industry. Ministry officials clarified that film censor boards operate at both federal and provincial levels.\nSenator Pervaiz Rashid highlighted the disconnect between the number of board members and the lack of active film production, citing the shortage of screening venues. He called for government investment in cinema infrastructure and recommended involving the Ministry of Finance to explore funding options.\nThe Committee decided to move forward with voting on the bill, as the Chairman underscored the importance of maintaining a balanced approach—avoiding harsh provisions or unnecessary police involvement—and consulting the Minister for Information for a final stance.\nThe committee concluded by discussing the registration of cases against journalists and social media activists under the Prevention of Electronic Crimes Act (PECA). It resolved to summon the Interior Secretary in the next session for further clarification on the matter.\nThe meeting was attended by Senators Pervaiz Rashid, Sarmad Ali, Jan Muhammad, Syed Waqar Mehdi, Dr. Zarqa Suharwardy Taimur, and senior officials from the Ministry of Information and Broadcasting and relevant departments.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:23:25.069Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/senate-panel-urges-ptv-overhaul-to-tackle-financial-strain/",
  "dateList": "2025-07-09",
  "date_published": "2025-07-09T17:19:00.000Z"
}
