{
  "title": "Ulema fully support PM statement on women hijab: Ashrafi",
  "link": "https://www.app.com.pk/national/ulema-fully-support-pm-statement-on-women-hijab-ashrafi/",
  "date_published": "2021-06-27T13:51:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 27 (APP): Special Representative for Prime Minister on Religious Affairs Hafiz Tahir Mehmood Ashrafi has said ulema fully support the statement of Prime Minister Imran Khan regarding women hijab and dresses.\nAddressing a press conference here on Sunday, he said that Islam is protector of women rights, adding that PM’s statement about hijab was legal and in accordance with Holy Quran and Sunnah.\nHe said that PM’s statements about women clothing was targeted by some elements for political reasons. He said that the Quranic order about hijab was equally applicable to men, that they should keep their eyes down.\nHe said the government should set up a helpline to register a secret complaint about sexual harassment of children. Ashrafi said that open public punishment should be given by setting up special courts to prevent cases of child abuse. He said that pictures of sexual beasts, who abuse children or women, should be shown on television channels and publish in newspapers.\nHe said that child abuse was a crime whether it happens in a madrasa, a college or a university. He appealed to Chief Justice of Pakistan to award public and immediate sentences to such culprits. He urged parents to educate their children how they should react and how they should seek help if somebody attempts to abuse them or touches them inappropriately.\nTo a question. Ashrafi said that ulema and mashaykh across country were with the government on the issue of Muharram observance. The prime minister has ordered for expansion of peace committees for Muharram, he added. “I will make some necessary changes in the committees and visit different districts for the purpose before Muharram,” he added.\nTo a question, Ashrafi said that Maulvi Abdul Aziz should be hanged at Minar-e-Pakistan to make an example of those who sexually abuse children.\nTo another question, he said a committee was working on a proposal about amending the Waqf Property Act. He said that some people were doing politics on the Waqf Property Board issue.\n“We are the guards of mosques and madrasas and no one can frighten us,” he added. He said that the police had not visited any mosque or madrasa even once in three years.\n“We are not against modern media, but there should be a system for filtering the content being presented there,” he said adding that negative things spread evil; therefore, such things should be filtered and there should be no objection on it. Ashrafi said that mobile-phone technology had its own problems and it also spreads obscenity.\nAbout refusing bases to the United States, he said the government represented the public sentiments by refusing the bases. He said that Pakistan always helped Afghan brothers everywhere and it was facilitator for peace in Afghanistan, but the problem was created by the Afghan people and Afghan political parties.\nHe made it clear that now Pakistan’s land would not be used against any country and no one should use their land against Pakistan.\nAshrafi urged the media not to create suspicions about madrasa curriculum, adding that Muttahida Ulema Board’s job was only to stop anarchist material. He said that no restrictions would be imposed on teaching science subjects in madrasas.",
  "retrievedAt": "2025-08-11T20:53:49.260Z"
}
