{
  "title": "HR ministry to raise problems of PWDs in Federal Cabinet: Mazari",
  "link": "https://www.app.com.pk/national/hr-ministry-to-raise-problems-of-pwds-in-federal-cabinet-mazari/",
  "date_published": "2021-06-27T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP): Federal Minister Dr. Shireen Mazari has said that Ministry of Human Rights would raise the problems of the People With Disabilities (PWDs) in Federal Cabinet especially ensuring them 2 percent quota in federal departments/divisions.\nChairing the second meeting of the Council on Rights of Persons with Disabilities here Sunday, Mazari said that Federal Secretary for Human Rights will also approach its counterparts to take necessary actions for ensuring 2 percent quota for persons with disabilities in jobs as well as secretaries of ministries would also be called in the next Council meeting.\nThe second meeting of the Council on the Rights of Persons with Disabilities discussed making Islamabad friendly city for persons with disabilities and ensuring 2 percent quota of job for persons with disabilities in federal ministries/divisions.\nThe Council comprises members of National Assembly, Senate, members from the Ministry of Information, Finance, Education, and PASS; Chairman Capital Development Authority (CDA); Executive Director National Institute of Rehabilitation Medicine (NIRM); and three Persons With Disability (PWDs).\nThe Council was constituted under the ICT Rights of Persons with Disability Act 2020, which was promulgated in September 2020. Its first meeting was held in February 2021.\nDuring the meeting, the representatives of the Capital Development Authority briefed the participants that CDA has taken initiatives to make Islamabad friendly city for persons with disabilities. They have already started to make ramps at 40 different places of ICT with signs, they told.\nThe Council proposed CDA to ensure such facilities according to the international standards.\nIt was also decided that the Council will take up matter of fee exemption in educational institution of Islamabad Capital Territory with Ministry of Education and issue of persons with disabilities to travel alone in private airlines with Ministry of Aviation.\nThe Managing Director Bait ul Mal Zaheer Abbas Khokhar said that Bait ul Mal had the capacity to conduct a survey on persons with disabilities and it could be started from ICT as a pilot project.\nThe Director General Human Rights Muhammad Arshad briefed the participants that the Ministry of HR had prepared a public service message for mass awareness on rights of persons with disabilities which was disseminated through social and digital media platforms of Ministry of Human Rights and electronic channels through 10 percent quota of Pakistan Electronic Media Regulatory Authority for public service messages.",
  "retrievedAt": "2025-08-11T20:53:50.132Z"
}
