{
  "title": "COVID-19 deaths, positive cases drop to record low since June 1",
  "link": "https://www.app.com.pk/national/covid-19-deaths-positive-cases-drop-to-record-low-since-june-1/",
  "date_published": "2021-06-27T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 27 (APP): The national tally on Sunday of total active COVID-19 cases was recorded 32,241 with 901 more people testing positive for the deadly virus and 1,347 people recovering from the disease during the last 24 hours.\nTwenty-three corona patients have died during past 24 hours, 19 of whom were under treatment in the hospitals and four out of the hospitals had perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in the Punjab followed by Khyber Pakhtunkhwa.\nOut of the total 23 deaths occurred, six of them died were under treatment on ventilators.\nThere were 1,941 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 2.02 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 22 percent, Lahore 17 percent, Bahawalpur 22 percent and Multan 27 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 42 percent, Rawalpindi 17 percent, Karachi 23 percent and Muzaffarabad 19 percent.\nAround 253 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, and Gilgit Baltistan (GB).\nSome 44,544 tests were conducted across the country on Saturday, including 11,903 in Sindh, 18,528 in Punjab, 9,605 in Khyber Pakhtunkhwa (KP), 2,848 in Islamabad Capital Territory (ICT), 748 in Balochistan, 327 in GB, and 585 in AJK.\nAround 900,291 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 954,743 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 20,212, Balochistan 27,003, GB 5,984, ICT 82,565, KP 137,628, Punjab 345,796 and Sindh 335,555.\nAbout 22,211 deaths were recorded in country since the eruption of the contagion. Around 5,410 people perished in Sindh, two of them died in hospitals and one out of the hospitals on Saturday.\n10,721 people died in Punjab died with eight deaths occured in past 24 hours. Some six people died in the hospitals and two out of the hospitals.\nAs many as 4,304 people expired in KP, six of them died in hospitals, 776 individuals died in ICT, 307 people died in Balochistan, two of them died in the hospitals, 111 infected people perished in GB and 582 people died in AJK, three of them succumbed to the deadly virus in the hospitals and one out of the hospitals.\nA total of 14,416,394 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 2,197 corona patients were admitted in hospitals.",
  "retrievedAt": "2025-08-11T20:53:54.654Z"
}
