{
  "title": "India has unleashed fifth generation warfare against Pakistan: ex-CJCSC",
  "link": "https://www.app.com.pk/national/india-has-unleashed-fifth-generation-warfare-against-pakistan-ex-cjcsc-2/",
  "date_published": "2020-09-14T12:37:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Sep 14 (APP): Former Chairman Joint Chiefs of Staff Committee (CJCSC) General (retd) Zubair Mahmood Hayat has said that after losing traditional war, India has unleashed the fifth generation warfare against Pakistan.\nAddressing a Defence Day function here on Monday, he said that Pakistan army is fully prepared to thwart two-pronged Indian conspiracy, to weaken our bond with Islam, and create rift between the army and people by exploiting the tools of social media.\nHe said that Islam is a religion of peace, justice and equality whereas Indian philosophy is to control the region through fascist means. He said that India had realised that it could not suppress Islam. Kashmir is a glaring example of the idea. India failed to subjugate the people of Kashmir after 70 long years of using brute force.\nHe also criticised unilateral annexation of Indian occupied Jammu and Kashmir and said that this step has exposed Indian true face which converted Kashmir into an open prison.\nHe said that India was behind anti-Islam and anti-Pakistan propaganda on the social media, but the Pakistan Army and people were fully united and would frustrate these evil designs.\nHe said that today we gathered here to pay tribute to our martyrs who sacrificed their lives for the nation.\nAbout Chawinda, he said that enemy attacked with an armed division at Chawinda. As a result, the largest tank battle after World War-II was fought there and our brave forces converted Chawinda into graveyard of Indian tanks.\nHe paid best tribute to Squadron Leader MM Alam, who made an international record of downing Indian planes and said now we have Wing Commander Noman and Squadron Leader Hasan who forced Indian pilots “to taste our tea”.\nUnderlining the importance of Pakistan, he said that it is the fifth largest country in the world and according to survey we are 4th most intelligent country and lead the world as far as charity is concerned. We are they only atomic power of the Muslim world. He said that our brave armed forces fought and won war against terror with active support of people of Pakistan.\nHe said the land of Faisalabad is very fertile as it produced a number of stars like Nusrat Fateh Ali Khan, Shehbaz Senior and handball team who brought laurel for the country at global level.\nRegarding Kashmir issue, he said that Indian forces had set a history of atrocities and barbarism in Indian occupied Kashmir where 900,000 India forces have been deployed only to crush voice of Kashmiri people for right to self-determination.\nHe strongly condemned the Indian cruelty in Kashmir and said that its forces have killed more than 100,000 innocent Kashmiris besides subjecting more than 16,000 females to rape. Indian forces also inflicted injuries on 1,1000 children through pellet guns besides abducting 12,000 children and sending them out of Kashmir valley.\nHowever, he reiterated that bullying tactics of Indian forces could not stop Pakistan from continuing moral, political and diplomatic support to Kashmir brethren. He also paid the best tribute to Syed Ali Geelani and termed him the greatest freedom fighter of the world.\nHe said that India had lost the traditional war and now it was adopting shameful and wicked tactics. Life is very miserable for Muslims in India. After destroying Babri Masjid, now Indian forces are planning to bulldoze 83,000 more mosques. When enemy feels that it could not fight in the battlefield, it fields Kulbushan Jadhav like persons to conduct terrorism, bomb blasts and targeted killings.\nHowever, we should be well aware and support Pak army for defence of the country, he added.\nEarlier, Chairman Lyallpur Warriors Major (retd) Taseer Akram Rana presented address of welcome while Dr Arif Siddiqui and Brigadier Yaqoob Qureshi also addressed the function.\nDivisional Commissioner Ishrat Ali, Deputy Commissioner Muhammad Ali and a large number of people were also present.\nAn exhibition of war weapons was also arranged while a smart contingent of Pak Rangers also performed on the occasion.",
  "retrievedAt": "2025-08-11T19:48:05.834Z"
}
