{
  "title": "9th Muharram procession peacefully ended in Quetta",
  "link": "https://www.app.com.pk/national/9th-muharram-procession-peacefully-ended-in-quetta/",
  "date_published": "2020-08-29T06:33:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 29 (APP): The mourning processions of 9th Muharram-ul Haram were taken out from Imambargah Nasirul-Aza and Imamgargah Kalan amid tight security here Saturday afternoon.\nThe mourning procession passed different routs including Art School Road, Archer Road, Liaqat Bazaar, and Prince Road, and terminated peacefully at the same Imambragahs with scheduled time.\nThe speakers on the occasion urged the people to follow in the footsteps of the martyrs of Karbala and prepare themselves to face the new challenges created due to conspiracies against Muslims.\nTight security arrangements were made to ensure the protection of the people, however, the procession of Muharram-ul Haram has been monitored by helicopters.\nAll the link roads and streets were closed and the people were allowed to join the procession with standard operating procedures (SOPs) to ensure implementation of SOPs for the elimination of COVID-19.\nHowever, on special directives of the provincial government, mobile services have been suspended from early morning 9 am till 8 pm in view of security measures during the seventh procession of Muharram-ul Haram.\nAdditional Inspector General of Police (AIGP) Abdul Razzaq Cheema said in press conference that at least 68 check posts were also set up at various places including sensitive areas and over 50 CCTV cameras had been installed at different places for monitoring of the procession of Muharram-ul Haram.\nHe said 7000 security forces including Levies Force, police and Frontie6 Corps (FC) personnel were assigned to ensure protection of the procession in Quetta.\nShia community and scholars appreciated the officials of security forces including police and Frontier Corps (FC) on batter arrangements during Muharram-ul Haram and its mourning procession.",
  "retrievedAt": "2025-08-11T19:44:04.501Z"
}
