{
  "title": "Pakistan witnesses lowest deaths in 24 hours as one perish: NCOC",
  "link": "https://www.app.com.pk/national/pakistan-witnesses-lowest-deaths-in-24-hours-as-one-perish-ncoc/",
  "date_published": "2020-08-29T07:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 29 (APP):Pakistan on Saturday witnessed the lowest death as only one individual was expired of COVID-19 in past 24 hours across the country.\nNo COVID affected patient was on ventilator in Azad Jammu and Kashmir (AJK), Gilgit Baltistan (GB) and Balochistan, said National command and Operation Centre (NCOC) on Saturday in its latest statistics of COVID-19 deaths, positive cases and recovered patients across the country.\nThe deceased was expired on Friday in a hospital of Sindh.\nAlmost 112 ventilators were occupied across the country out of 1920 ventilators allocated for COVID-19, it said.\nDuring last 24 hours, 319 people were tested COVID positive where the total active COVID cases reported across the country were 8,748.\nHowever, 22,434 tests were conducted on August 28, as 5,247 in Sindh, 9603 in Punjab, 3,556 in Khyber Pakhtunkhwa (KP), 3,004 in Islamabad Capital Territory (ICT), 473 in Balochistan, 276 in GB and 275 in AJK.\nAround 280,340 people had recovered so far across Pakistan making it a significant count with over 90 percent recovery ratio.\nSince the pandemic broke out a total of 295,372 cases detected so far including AJK 2290, Balochistan 12804, GB 2832, ICT 15597, KP 35971, Punjab 96699, Sindh 129179.\nSince the contagion clutched masses across the country around 6284 deaths were recorded. In Sindh 2395 lost battle of their live while fighting this virus, 2195 in Punjab, 1250 in KP where one died in hospital on 27 August.\nHowever, in ICT 175 deaths were recorded, in Balochistan 141, in GB 67 individuals had died whereas the lowest deaths were reported from AJK which remained 61.\nAfter tireless strides since the first Coronavirus case reported in the country a total of 2,581,695 tests were conducted so far. Around 735 hospitals were equipped with COVID facilities with\n1,084 patients admitted across the country.",
  "retrievedAt": "2025-08-11T19:44:10.272Z"
}
