{
  "title": "India fails to push Pakistani into FATF blacklist despite efforts , says Qureshi",
  "link": "https://www.app.com.pk/national/india-fails-to-push-pakistani-into-fatf-blacklist-despite-efforts-says-qureshi/",
  "date_published": "2020-08-29T09:03:00.000Z",
  "source": "APP",
  "content": "MULTAN, Aug 29 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi said that India had tried to push Pakistan into FATF blacklist but it failed despite of repeated efforts.\nHe said that Pakistan Tehreek-i-Insaf govt has worked a lot on Financial Action Task Force (FATF) in limited time and bills were also  passed with consultation of opposition from Parliament in this regard. The spposition parties voted in favour of the  bills in National Assembly but opposed it in Senate. He said that passage of the bill was need of the and expressed his hope that Pakistan will come out from grey list.\nForeign minister Makhdoom Shah Mahmood Hussain Quresi expressed these views while talking to journalists here at Mumtazabad on Saturday. Qureshi said that mourning processions were being taken out  across the world today but these were banned in Indian Illegally Occupied Jammu and Kashmir (IIOJ&K). The Indian forces were arresting the Kashmiri people to stop  them from mourning.\nHe appealed the ulema to describe the Indian atrocities in IIOJK during their speeches.\nTo a question about rains in Karachi, he said that the people of Karachi were facing miseries due to heavy rains and federal government will extend every type of cooperation with Sindh government in this connection.\nAbout health of PML N supremo, Mian Muhammad Nawaz Sharif, Qureshi said that he should return without waiting government steps as his health seemed better now.\nAbout flood situation, Shah Mahmood Qureshi said that water level was increasing in water reservoirs which may result in flooding.\nThere was flood situation in Balochistan and federal government would help it. He said that the sewerage system of Multan was insufficient to cover the city as most of the population is not connected with the sewerage system.\nHe informed that development funds worth of billions of rupees got approved from JAICA and Asian Development Bank to replace the sewerage system of the city.\nHe said that the nefarious designs of different elements which wanted to spread sectarianism would be foiled. The peace of Multan is exemplary as the rich tribute was being paid to Hazrat Imam Hussain and martyrs of Karbala.\nHe also hailed administration over better arrangements. Earlier, Makhdoom Shah Mahmood Qureshi visited the main procession routes of Mumtazabad and expressed satisfaction over\nthe security and other arrangements.\nLater,  speaking to reporters during a peace rally at Doulat Gate, Makhdoom Shah Mahmood Qureshi said that the Indian policy in Indian Illegally Occupied Jammu and Kashmir has been unsuccessful.  Pakistan Army and the government stood with the Kashmiri people for their struggle of freedom.  He said that Pakistan enjoys cordial relations with Saudi Arabia and leadership of both countries used to visit each other.",
  "retrievedAt": "2025-08-11T19:44:04.496Z"
}
