{
  "title": "US Congress resolution unsolicited interference; neither welcome nor acceptable: FO",
  "link": "https://www.app.com.pk/national/us-congress-resolution-unsolicited-interference-neither-welcome-nor-acceptable-fo/",
  "date_published": "2024-06-28T16:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): Pakistan on Friday said that Resolution 901 adopted by the US House of Representatives was an “unsolicited interference” in its domestic affairs which was “neither welcome nor acceptable”.\nForeign Office Spokesperson Mumtaz Zahra Baloch, during her weekly press, said the resolution clearly stemmed from an inadequate and erroneous understanding of political and electoral process of Pakistan.\n“It is also an unsolicited interference in Pakistan’s domestic affairs. We believe that bilateral relations between countries should be based on mutual respect and sovereign equality. The unsolicited interference from the US Congress is, therefore, neither welcome nor acceptable,” she added.\nBesides, the spokesperson said, the timing and context of the said resolution were also not conducive to the current positive trajectory of bilateral ties between Pakistan and the United States.\nPakistan, she said, would like to develop its relations with the US on the basis of mutual trust and confidence and non-interference in each other’s domestic affairs.\nExpressing concerns about the continued suppression of the democratic rights of the Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJK), the spokesperson said that a few days ago, the Indian authorities banned the elections of the Jammu and Kashmir High Court Bar Association and arrested former Bar president Mian Qayoom.\nThe Indian authorities also disallowed the Eid congregation at Srinagar’s historic Jamia Masjid, and house arrested prayer leader and prominent Kashmiri leader Mirwaiz.\n“These oppressive measures are yet another example of the autocratic approach of the Indian authorities, and a violation of the fundamental freedoms and human rights, especially of the rights of association and peaceful assembly,” she said and reiterated Pakistan’s stance for continued political, diplomatic, and moral support to the Kashmiri people for the just and peaceful settlement of the dispute as per the United Nations Security Council resolutions.\nThe spokesperson strongly condemned the indiscriminate bombing of Beit Lahia city in Northern Gaza by the Israeli forces, killing women and children.\n“Pakistan deplores Israel’s actions as war crimes against the people of Gaza and emphasizes the urgent need for an immediate and unconditional ceasefire to prevent further civilian casualties,” she stressed.\nSpokesperson Baloch informed the media that the government had appointed Additional Foreign Secretary (Middle East and SIFC) Ambassador Rizwan Saeed Sheikh as Pakistan’s Ambassador to Washington and Asim Iftikhar, currently serving as Pakistan’s envoy in France, as Pakistan’s Additional Permanent Representative to the United Nations in New York.\nShe apprised the media of Deputy Prime Minister and Foreign Minister Senator Ishaq Dar’s address at the Institute of Strategic Studies here wherein he called for leveraging Pakistan’s strategic location and advocating for international cooperation over confrontation, with firm support for multilateralism, promoting peaceful relations and regional stability to foster sustainable economic development.\nDar had emphasized the importance of humanitarian cooperation in Afghanistan and ensuring that Afghan soil is not used for terrorism against its neighbours, besides seeking peaceful relations with India based on mutual respect, resolving the Kashmir dispute, and rejuvenating SAARC (South Asian Association for Regional Cooperation) while rejecting India’s unilateral actions in the IIOJK.\nShe mentioned the 18th round of bilateral political consultations between Pakistan and Sweden held on June 26 in which the two sides reviewed the breadth of bilateral cooperation and agreed to enhance cooperation, aiming for a comprehensive relationship grounded in strong economic ties.\nThe spokesperson also highlighted that Additional Foreign Secretary (Asia and Pacific) Ambassador Imran Siddiqui represented Pakistan at the 19th meeting of the Ministers of Foreign Affairs of the member states of the Asian Cooperation Dialogue (ACD) held in Tehran where he emphasized the significance of promoting regional connectivity and leveraging complementarities among the member states.\nReplying to a question, the FO spokesperson said Pakistan would participate in the Doha-III meeting where Special Representative on Afghanistan Ambassador Durrani, and Ambassador to Afghanistan Ubaid Ur Rehman Nizamani would represent the country. The agenda for the talks had been set by the organizers, including the United Nations and the Qatari authorities, she added.\n“Pakistan has always said that we respect the sovereignty and territorial integrity of Afghanistan, and in that context, it is critical that Afghanistan takes effective action against those terrorist groups which are responsible for terror incidents and attacks inside Pakistan.\n“We have also urged Afghanistan to ensure that any terror hideouts that destabilize the region should be eliminated, and we expect Afghanistan to fulfill the commitments that it has made to the international community and to Pakistan specifically,” she added.\nResponding to another query, she said a neutral expert and an ad hoc Court of Arbitration were hearing Pakistan’s objections to the construction of Kishanganga and Ratle hydroelectric projects in the IIOJK.\n“A team of our technical and legal experts is accompanying the Neutral Expert who is inspecting these projects as part of the ongoing proceedings.”\nTo a query, she reiterated that any foreign national who was in Pakistan illegally, in defiance of Pakistan’s immigration laws, would face justice. “Pakistani laws are clear with regards to those who are in Pakistan illegally, and that includes fines, imprisonment and deportation. And this Plan, as I have said repeatedly from this podium, is being implemented and will be implemented without discrimination to any nationality.”",
  "retrievedAt": "2025-08-11T03:32:11.158Z"
}
