{
  "title": "CPDI holds five-day training for journalists on safely reporting, HR issues",
  "link": "https://www.app.com.pk/national/cpdi-holds-five-day-training-for-journalists-on-safely-reporting-hr-issues/",
  "date_published": "2024-06-28T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):The Center for Peace and Development Initiatives (CPDI) has conducted a five-day Capacity-Building Training Program for a cohort of journalists from Punjab to report on human rights, fundamental freedoms, and democratic processes safely, accurately, independently and inclusively.\nThe initiative was aimed at empowering journalists to build robust, ethical careers while steering the intricacies of modern-day journalism. The training sessions took place in Islamabad and were attended by journalists from various areas of Punjab, including Faisalabad, Khanewal, Rawalpindi and Bahawalpur, a news release said.\nThe training sessions featured a diverse, educated, and skilled panel of eminent trainers including Myra Imran, Aftab Alam, Zahid Abdullah, Nizam Khan Salarzai, Tanzila Mazhar, Waqas Naeem, Bilal Dar, Hasnain Ghayoor, Adnan Rehmat, Zafarullah Khan, Saifullah Khoso, Tanzeela Mazhar, and Ghulam Murtaza. These experts provided detailed insights into the various facets of journalism in the country through interactive sessions and activities specifically designed to engage participants in constructive discussions.\nKey features of the training included bridging the gap between conventional and modern journalism, ensuring a free, expressive media landscape in Pakistan and using AI and Machine Learning for sound reporting. The training sessions served as a reminder to the journalists about their responsibilities of unbiased reporting, modernizing journalism by using digital means, and the negative impacts of disinformation and misinformation.\nIt was emphasized that collection of data, and authenticating helps to enhance the credibility of journalistic reporting. The training emphasized the responsibilities of journalists in unbiased reporting, integrating digital tools for modern journalism, and fostering an inclusive work environment in the male-dominated field.\nThe training program organized by CPDI highlighted the former’s commitment to strengthening media engagement. The training session served as a reminder of the role journalists have to play in upholding ethics and promoting freedom of speech and freedom of expression.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:32:57.173Z"
}
