{
  "title": "PDMA takes measures to deal with any pre-monsoon related eventualities, de-silting of nullahs completes : DG",
  "link": "https://www.app.com.pk/national/pdma-takes-measures-to-deal-with-any-pre-monsoon-related-eventualities-de-silting-of-nullahs-completes-dg/",
  "date_published": "2024-06-28T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):Punjab, Provincial Disaster Management Authority (PDMA) Director General Irfan Ali Kathia Friday said that following the strict direction of Chief Minister Punjab Maryum Nawaz, the authorities concerned had been cleaning and de-silting all the nullahs immediately to deal with any pre-monsoon related eventualities.\nTalking to PTV news channel, he said that normal to above normal rains, nearly normal temperatures were expected in the country during this monsoon season whereas urban flooding warnings were being issued to all the districts.\nThe authority asked all deputy commissioners and concerned officers to take all precautionary measures to avoid human loss as rain-wind-thundershowers with isolated heavy falls predicted, the DG said. The rains might generate flash floods in different parts of the province, he added.\nThe district administrations had also been asked to ensure availability of all emergency services staff, machinery and other resources to deal with any eventuality, he mentioned.\nThe DG further said that the district administrations had made all arrangements to tackle any untoward situation.\nAn effective response mechanism was being prepared in case of natural calamity while trained human resources would also play an effective role in disaster management, he added.\n“We are also ensuring safe evacuation of communities residing along natural drains and rivers to minimize the impact of any untoward situation,” he highlighted.\nReplying a question, he said that the PDMA warned of potential urban flooding in Lahore, Sialkot, Gujranwala, Narowal and Rawalpindi, alerting the local administrations accordingly.\nThe authorities in flood-prone districts were advised to clear the rivers and canals and  people had been advised not to cross them during rainy and flood conditions, he said, adding, strict enforcement of laws prohibiting bathing in rivers and canals was also recommended.\n”In case of rains, immediate drainage of water should be ensured in every city. Wherever there is a risk of flood, early measures should be taken,” he added.\n“Due to the fear of possible floods, daily reports had been sought from most of the districts, he said.\nFollowing the PMDA warning of urban and flash flooding, the Rescue 1122 also began mock exercises to build its flood rescue capacity, he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:33:23.834Z"
}
