{
  "title": "IPRI roundtable discusses geostrategic, technological contestations in Asia Pacific region",
  "link": "https://www.app.com.pk/national/ipri-roundtable-discusses-geostrategic-technological-contestations-in-asia-pacific-region/",
  "date_published": "2024-06-28T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):The Islamabad Policy Research Institute (IPRI) on Friday organised the roundtable on “Asia Pacific: Geo-Strategic, Geo-Environmental and Technological Contestations” to discuss opportunities and challenges for the country amid growing regional tensions.\nIt was participated by Dr Zafar Nawaz Jaspal (QAU), Ambassador Naghmana Hashmi, and Dr Ashfaque Hasan Khan (NUST). The session was moderated by Director Research IPRI Dr Raashid Wali Janjua. President IPRI Ambassador Dr Raza Muhammad gave the welcome remarks. The discussion focused on the importance of the Indo-Pacific and Asia-Pacific regions in geo-politics and geo-strategic alliances, a news release said.\nDr Janjua discussed the post 9/11 importance on the region and transition from bi-polarity to multi-polarity. Dr Jaspal discussed the implications of regional security architecture.\nHe also discussed the importance of South Asia and the Indian Ocean in the regional security architecture, and India-USA security relations. He elaborated how India’s position as a net security provider with the US has impacted China’s relation with Pakistan, with the two countries becoming strategic partners on security. He discussed how this is also impacted by Pakistan’s history with India and due to existing territorial disputes with India.\nAmbassador Hashmi discussed China’s perspective on the Asia-Pacific region. She highlighted how China prioritizes development and progress on a local and international level.\nShe addressed Pakistan’s strategic and regional importance to China in geo-politics with India’s strategic alliance with the United States as a net-security provider. She discussed China’s perspective to be more defensive than offensive which is also very relevant to Pakistan.\nShe emphasized the importance of clarity on Pakistan’s standing in Asia-Pacific relations, and to have one strategic compass towards Pakistan’s goals as Pakistan and China have significant strategic partnerships on navy and nuclear policies.\nDr Khan discussed the opportunities and challenges for Pakistan’s geo-economics stance. He discussed how sanctions may or may not impact a country’s economy and how “confrontation of Russia with Ukraine led to an unprecedented number of sanctions on Russia.”\nHe elaborated on how geo-economics have changed in the Asia-Pacific region and other regions as economic sanctions have not been as effective on certain countries like Iran and Cuba which have led to countries facing sanctions exploring new ways to strengthen their economies such as de-dollarisation and using their own currencies as a weapon of war. He explained how economic and financial sanctions have in turn led to countries forming their own economic forums and platforms such as BRICS.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:32:56.515Z"
}
