{
  "title": "NA passes Finance Bill-2024 with majority vote",
  "link": "https://www.app.com.pk/national/na-passes-finance-bill-2024-with-majority-vote/",
  "date_published": "2024-06-28T12:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): The National Assembly on Friday passed the Finance Bill 2024 after a clause-by-clause consideration, incorporating specific amendments.\nMinister for Finance and Revenue Muhammad Aurangzeb moved the motion for consideration of the Finance Bill, 2024 to give effect to the financial proposals of the federal government for the year, commencing on July 1, 2024.\nThe motion was passed with majority vote which led to the passage of Finance Bill-2024 after clause-by-clause reading and adopting amendments after due process of voting.\nAll the amendments, presented by the opposition members, were rejected.\nThe total outlay of the federal budget for the fiscal year 2024-25 is Rs. 18.877 trillion. This budget outlines the government’s fiscal policies and budgetary allocations for the upcoming financial year, reflecting a comprehensive plan to address various economic and social challenges.\nThe government has allocated Rs. 1,400 billion for the Public Sector Development Programme (PSDP) in its current budget, and an additional amount of Rs100 billion would be allocated under Public-Private Partnership, bringing the total to Rs1,500, the highest in the country’s history.\nIn the budget grants amounting to Rs1,777 billion for the promotion of the Benazir Income Support Programme (BISP), Azad Jammu and Kashmir (AJK), Gilgit-Baltistan, merged districts of KP, Higher Education Commission, Railways, and IT sectors have been allocated.\nTo ensure equitable development in AJK, GB, and merged districts of the KP, the government has allocated at 10 percent and around 11 percent for other sectors development including IT, telecom, science and technology, governance, and production sector.\nThe House also held discussion on the Charged Expenditure that included Demands for Grants and Appropriations for the financial year ending on June 30, 2025.\nThe House approved 133 demands for grants related to various departments and ministries.\nAccording to the Rule 187 of the Rules of Procedure and Conduct of Business in National Assembly 2007, not less than four days shall be allotted for the general discussion on the budget.\nHowever, the National Assembly smoothly continued debate on the Finance Bill, 2024 for eight days.\nThe formal debate started on June 20, 2024 that continued till June 27, 2024. The House also discussed recommendations of the Senate.\nMinister of Finance Muhamamd Aurangzaib termed the budget 2024-25 as growth budget and said it was based on a well-thought-out strategy to boost the economic growth.\nHe said that the budget for the next fiscal year was aimed at narrowing the fiscal deficit by expanding the government’s revenues and cutting unnecessary expenditures.\nMuhammad Aurangzaib reiterated the government’s commitment to increasing the tax-to-GDP ratio to 13 percent, which currently stands at a low 9.5 percent.\nHe said that the country had achieved macroeconomic stability. He highlighted that the economic indicators, including the current account, fiscal deficit, inflation, and foreign exchange reserves, were stable and under control.\nHe outlined the government’s plan to continue this economic stability into the next fiscal year, aiming to lead the country towards sustainable economic growth.\nHe also called for reconstructing and digitizing the Federal Board of Revenue (FBR) to ensure high GDP target. He said that the concept of non-filers would be eliminated from the tax system, making it mandatory for everyone to pay taxes.\nThe minister expressed the government’s resolve to curb tax evasion and expand the tax net, particularly targeting retailers and the real estate sector.\nHe said that the current account deficit had decreased, the fiscal deficit was under control, and the country had foreign reserves of $9 billion, providing an import cover for two months.\nHe highlighted a significant reduction in inflation, from 38 percent to 11 percent, and sustained food inflation at two percent. He said that no tax had been imposed on the solar.\nThe Finance Minister said that cardiology stents, surgical items, books, printing, and items and in FATA and PATA region had been granted tax exemptions.\nHe said that tax exemptions could not be granted for packaged milk that did not meet quality standards. He said that these tax exemptions for education and health sectors were provided despite the challenging economic conditions.\nOpposition leader in the National Assembly, Omar Ayub, along with Pakistan Tehreek-e-Insaf (PTI) Chairman Gohar Ali Khan and Sunni Ittehad Council leader Ali Muhammad said relevant stakeholders were not taken on board during the formulation of the bill.\nOmar Ayub said : “The finance bill fails to address the critical economic challenges faced by the country and has been drafted without adequate consultation with the key stakeholders.”\nGohar Ali Khan said : “This bill is not reflective of the people’s aspirations or the country’s economic realities.”",
  "retrievedAt": "2025-08-11T03:32:34.784Z"
}
