{
  "title": "PM hails approval of budget 2024-25 by National Assembly",
  "link": "https://www.app.com.pk/national/pm-hails-approval-of-budget-2024-25-in-national-assembly/",
  "date_published": "2024-06-28T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday hailed the swift approval of the budget 2024-25 by the National Assembly, praising the tireless efforts of Finance Minister Muhammad Aurangzeb and his team for preparing a pro-people budget that prioritizes welfare of common man and promises to steer the country towards economic prosperity.\nTalking to the finance minister in the National Assembly, the prime minister expressed his satisfaction over the active participation of all the treasury and opposition members in the budget session.\nHe also appreciated the efforts of the officers from ministries of finance, planning, other relevant ministries and Federal Board of Revenue (FBR) in preparation of the budget.\nThe government, he said, tried its best to utilize all possible resources to provide maximum relief to the common man.\nHe said the government provided relief to the salaried class, pensioners and workers.\nThe prime minister highlighted that special attention was given in the budget to various important sectors such as health, education, agriculture and information technology.\nHe said the elite class and the tax evaders would be brought into the net. “It is not possible that the poor pay the taxes and the elites enjoy tax exemptions,” he added.\nExpressing satisfaction over the economic situation, the prime minister said the country’s economy had now been put on the right path and that Pakistan’s journey of prosperity had begun now.\nHe said due to the business friendly policies, the trust of investors had been restored in the government.\nThe government was taking steps to bring reforms in the departments and privatize the loss making state-owned entities on priority, he added.",
  "retrievedAt": "2025-08-11T03:32:12.545Z"
}
