{
  "title": "Upcoming monsoon rains to cause devastating floods; relief camps established in vulnerable areas should be widely advert",
  "link": "https://www.app.com.pk/national/upcoming-monsoon-rains-to-cause-devastating-floods-relief-camps-established-in-vulnerable-areas-should-be-widely-advert/",
  "date_published": "2024-06-28T09:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP): Coordinator to the Prime Minister on Climate Change and Environmental Coordination, Romina Khurshid Alam on Friday stressed that the upcoming monsoon rains could lead to devastating floods, whereas relief camps established in vulnerable areas should be widely advertised to ensure access for potential victims.\nThe Coordinator to PM on Climate Change and Environmental Coordination made these remarks whole chairing the meeting of task force on global warming and heat waves here.\nRomina emphasized the importance of utilizing all available media platforms, including digital, electronic, radio, and mosque loudspeakers to effectively communicate information about the relief camps.\nShe highlighted the urgent need for protective measures against the severe threats of heat waves and floods to food, health, and the economy alongwith the need for collaborative efforts to face these calamities, stating that “hazards cannot be stopped but can be handled”.\nFurthermore, she urged the authorities to address the pressing issue of tree cutting and the dumping of trees in nullahs, as these actions can lead to damage to bridges during floods in KPK and Kashmir.\nThe decisions made in the earlier two meetings of the task force held on 7th and 14 June were reviewed in detail.\nShe said, “The departments contributing in my efforts to overcome socio-economic impacts are my team and assured of Ministry’s all possible support at all levels so as the country’s disaster vulnerability is lessened through coordinated efforts among the federal and provincial departments including national and provincial disaster management authorities, health, education, agriculture, water and energy departments.”\nShe said well-coordinated disaster risk mitigation or prevention measures are required to overcome socio-economic impacts of the disasters.\nThe meeting took stock of the measures being taken on the current heat wave and to avoid any untoward incident in the upcoming monsoon season in the country.\nRepresentatives of the National Disaster Management Authority, Ministry of Science and Technology, Ministry of Climate Change, Ministry of National Health, Services, Regulations and Coordination, Pakistan Meteorological Department, Ministry of Information and Broadcasting participated in the meeting while officials from the provincial governments joined through video link.\nThey informed the meeting about preventive measures to protect lives, livelihoods of the people from heatwave and possible monsoon floods.\nThey informed that most of the measures have already been completed about expected floods including establishing relief camps, mapping of resources, desilting of nullahs, and public awareness campaigns, stock maintenance and mock exercises to implement the contingency plan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:33:00.551Z"
}
