{
  "title": "Protests grip Bangladesh as pressure mounts on Yunus-led govt - World - DAWN.COM",
  "author": null,
  "content": "Primary school teachers in Bangladesh joined public sector workers in protests against the interim government on Monday amid growing discontent and political uncertainty in the South Asian country.\n\nNobel peace laureate Muhammad Yunus, 84, took over as interim head of the country last August after deadly student-led protests forced then Prime Minister Sheikh Hasina to flee to India.\n\nYunus’ administration has faced pressure from civil servants, teachers, political parties and the military as the caretaker government attempts to guide the country through a fragile transition before holding a general election.\n\nThe government issued an ordinance on Sunday allowing the Ministry of Public Administration to dismiss public servants for misconduct without lengthy procedures, sparking outrage across the bureaucracy.\n\nGovernment employees continued their demonstrations for a third consecutive day on Monday, calling the ordinance “repressive” and demanding its immediate withdrawal.\n\nThousands of teachers in government primary schools also began indefinite leave from work on Monday, demanding a hike in wages.\n\nIn the face of protests by the employees of the National Board of Revenue, the interim government was forced on Sunday to withdraw an order to dissolve the tax body and replace it with two divisions under the finance ministry.\n\nPolitical uncertainty also deepened last week after a top student leader said Yunus said he could step down if political parties cannot agree on reforms and an election timeline.\n\nWahiduddin Mahmud, the planning adviser in Yunus’ cabinet, however, said the de facto prime minister was not quitting.\n\n“We are not going anywhere till our job is done,” Mahmud said during the weekend, adding that Yunus acknowledged the obstacles but remained committed to holding a fair election.\n\nThe interim government has been caught between competing demands for swift general elections and reforms. Yunus has said the elections could be held by June 2026, while the Bangladesh Nationalist Party (BNP), led by former Prime Minister Khaleda Zia, has been pushing for polls by December.\n\nBangladesh’s army chief, General Wakeruz Zaman, added to the pressure by calling for elections to be held in December during a speech last week, expressing his dissatisfaction over the political situation.\n\nYunus convened a last-minute meeting of his Advisory Council on Saturday and also held talks during the weekend with the country’s main political forces, including the BNP, Jamaat-i-Islami and the student-led National Citizen Party.\n\nLeaders of other political parties also met Yunus.\n\n“We are in a war-like situation,” Yunus’ press secretary Shafiqul Alam told reporters on Sunday. “After the Awami League’s activities were banned, attempts are on to destabilise us in various ways. We have to get out of this situation.”\n\nThe registration of Hasina’s Awami League party was suspended this month, effectively barring the party from contesting the next election.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/26214617944a13d.jpg",
  "retrievedAt": "2025-08-23T14:28:23.749Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913450/protests-grip-bangladesh-as-pressure-mounts-on-yunus-led-govt",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T13:10:48.000Z"
}
