{
  "title": "The silent squeeze - Newspaper - DAWN.COM",
  "author": null,
  "content": "In the wake of recent economic reforms, Pakistan has seen encouraging signs of macroeconomic recovery. Inflation is on the decline, the rupee has remained relatively stable, and remittances have picked up. The government’s fiscal discipline, supported by timely decisions around interest rate management, energy pricing, and the International Monetary Fund-programme compliance has helped rebuild confidence among international partners and investors. Business sentiment, while still cautious, is improving, and the groundwork for a more stable financial environment is being laid.\n\nThese are significant achievements. Steering the economy out of crisis mode and back onto a path of growth is no small feat. But as the country looks to deepen these gains and build a more resilient system, attention must now shift toward long-term structural fairness, particularly in the tax regime for individual contributors, of which the salaried class is the biggest component.\n\nStudies indicate that real income for Pakistanis has declined by an estimated 15 per cent over the past few years. This has been a result of inflation, currency devaluation, taxation, and wages that have not kept pace with rising costs. Essential expenses like housing and education surged, further straining household budgets. These factors collectively eroded real income, making financial stability increasingly difficult for many Pakistanis.\n\nOf all these factors, perhaps taxation is the easiest lever to provide relief to the salaried, tax-paying middle class — who pay significantly more in taxes compared to other groups, in fact, the Federal Board of Revenue’s own statistics indicate that the middle income group pays around 200pc more in taxes than the Association of Persons (AOPs) and nearly three times more than the business sector. This is true even though businesses and AOPs collectively account for a far larger portion of Pakistan’s economic activity.\n\nStudies indicate that real income for Pakistanis has declined by an estimated 15pc over the past few years\n\nThis unfairly heavy taxation reduces take-home pay, limiting the ability of salaried individuals to save, invest, or spend on non-essential goods and services. This can stifle domestic demand and dampen economic activity, lower living standards and push skilled professionals to seek opportunities abroad as they struggle to move up economically. The disparity also discourages productivity and encourages tax evasion or underreporting.\n\nBeyond that, studies by the Small and Medium Enterprises Development Authority and the International Labour Organisation indicate that more than 40pc of Pakistan’s economy operates informally. That means a large portion of businesses, whether they are in wholesale trade, real estate, retail, or agriculture, function without properly recording income, paying taxes, or even registering with authorities. In effect, this creates two parallel economies: one visible, over-regulated, and overtaxed, and the other under the radar.\n\nThe lack of enforcement against non-filers and informal businesses makes tax evasion relatively risk-free on the one hand while on the other, salaried individuals face an automatic deduction of tax and strict penalties for even minor delays in filing. This incentivises employers to offer deferred payments and even outsource jobs into the informal sector, weakening labour protections and reducing long-term tax revenue.\n\nFrequent audits and tax evaluations create financial and psychological stress for individuals. Many salaried professionals and business owners face lengthy scrutiny, often leading to unexpected tax demands. The lack of transparency in audit selection raises concerns about fairness, and increased audits also discourage compliance, as taxpayers fear harassment rather than facilitation.\n\nThis imbalance has long-term consequences, not just for individuals, but also for the overall economy. If formal and transparent taxpayers continue to account for an exponential share, whilst others operate outside the system with little consequence, then the incentive to remain compliant erodes. It is important to provide relief to the salaried class while encouraging formalisation. One quick fix for this is by raising the taxable income threshold to Rs1.2m and abolishing the 10pc surcharge on individuals earning over Rs10m.\n\nIt’s important for all sectors to contribute in proportion to their size in the economy. Measures such as digitising tax records, using data analytics to identify non-filers, and removing discretionary exemptions are imperative.\n\nHowever, unless such measures are part of a larger, consistent reform effort, they risk being short-term fixes to a structural problem. The goal should be to reward formalization, not just reduce the penalties of being in the system. Much like the reduction in sales tax for digital payments made through cards at restaurants, there should be a real incentive to file taxes. The government can also consider restoring the tax credits on investments, insurance, education, and housing that can ease cost pressures for the salaried class.\n\nThese proposed measures are not novel; they have been part of Pakistan’s tax system in the past and can be reintroduced through policy consistency and technology integration. Actively using existing data sets like electricity bills, property records, vehicle registration, and travel histories to identify non-filers, and ensuring enforcement mechanisms are applied uniformly, is an easy solution for the narrow base problem. Exemptions and tax holidays that are no longer economically justified should be phased out, and compliance should be made simpler through streamlined digital filing systems.\n\nPeople are more likely to comply when they have an answer to where their taxes are being used. An annual Taxpayer Report showing how revenues were used for infrastructure, education, healthcare, and other services, can help rebuild trust in the system and make the tax-paying process more transparent.\n\nThe writer is Chairman & CEO of Unilever Pakistan\n\nPublished in Dawn, The Business and Finance Weekly, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6833b8a671750.jpg",
  "retrievedAt": "2025-08-23T14:28:26.863Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913374",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:30.000Z"
}
