{
  "title": "Water crisis deepens in Mansehra amid dry spell - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: The ongoing dry spell has worsened the water crisis in Mansehra city and its suburbs as streams, wells and boreholes are drying up, leaving residents with no option but to purchase water from private bowsers.\n\n“We are going to launch the Piyasa Mansehra (Thirsty Mansehra) movement against the government for its failure to provide potable water to residents,” chairman of Mansehra Neighbourhood Council-I Abdul Waheed told reporters on Sunday.\n\nHe said the water table had dropped drastically in recent years due to prolonged drought-like conditions, affecting four neighbourhood councils and forcing people to procure water on payment.\n\nMr Waheed said the Bothkhatta stream, once a primary water source for the city, had become sewage due to pollution by wastewater from settlements.\n\nResidents complain they’ve to buy water from private bowsers\n\nResidents complained that the tehsil municipal administration and public health engineering department, both responsible for supplying potable water to residents, had failed to initiate any water scheme to meet the growing demand.\n\nThey said a shallow well project hadn’t been operational since its launch a few years ago.\n\n“We have been supplying water through bowsers to people in the city and its outskirts as the water crisis has deepened due to a prolonged dry spell here,” tractor-tanker driver Mohammad Aslam said.\n\nPrime Minister Shehbaz Sharif had announced a water supply project last year aimed at addressing urban water needs, but the Pakistan Muslim League-Nawaz (PML-N) government has yet to implement it.\n\nSimilarly, a gravity-based water supply scheme, proposed with Rs 20 billion in financial assistance from the Kingdom of Saudi Arabia, has seen no progress since its announcement.\n\nFrustrated by inaction, chairpersons of various neighbourhood councils, including Abdul Waheed and Israr Khan alias Phool, have announced the launch of a protest movement.\n\n“We will take to the streets against the departments that have failed to ensure a potable water supply to the city and surrounding areas,” Mr Waheed told reporters.\n\nHe said that chairmen had also met with the deputy commissioner, the Chief Engineer of public health, the Tehsil Municipal administration and also with local lawmakers, but no breakthrough in easing the water crisis.\n\nMeanwhile, the three-day Tableeghi Ijtema, attended by hundreds of thousands of participants nationwide amid tight security, concluded here on Sunday with prayers for Muslim unity worldwide.\n\n“This was the biggest ever crowd in Hazara division and everything happened peacefully due to our effective and foolproof security measures,” DPO Shafiullah Khan Gandapur told reporters at the congregation.\n\nDeputy Commissioner Khaliq Iqbal and DPO Gandapur visited the venue and reviewed security and other arrangements for the final day.\n\nThroughout the congregation, religious scholars urged participants to adhere to Islam’s teachings.\n\n“You should give a rightful share to your family members without gender discrimination. Depriving women of their inheritance is one of the greatest sins,” a scholar told participants in a sermon.\n\nThe people gathered in large numbers from across the country for the concluding sermon and collective prayers. They later left for their destinations.\n\nMedical camps run by both public and private organisations provided free care to attendees around the clock.\n\nThe congregation, which took place over around 3,000 kanals of land on both sides of the Siren River, was guarded by over 2,000 police personnel and volunteers.\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6833b2282fa5a.jpg",
  "retrievedAt": "2025-08-23T14:28:37.160Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913305/water-crisis-deepens-in-mansehra-amid-dry-spell",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:06:12.000Z"
}
