{
  "title": "Relief for residents as 95pc U-turns and chowks reopen in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After more than a decade, residents of the federal capital got a sigh of relief as over 95 per cent of previously barricaded U-turns and chowks (squares) have been reopened, allowing for smoother traffic flow — thanks to the efforts of the local administration.\n\nThis development has brought considerable comfort to motorists. The previous closures had forced them to take long detours, resulting in increased fuel consumption and wastage of time.\n\nA large number of citizens have welcomed the decision and expressed the hope that the reopened U-turns and squares would not be closed again under the pretext of managing traffic congestion.\n\n“It [the reopening of U-turns] happened due to a collective effort of all stakeholders,” said Deputy Commissioner Irfan Memon when contacted on Sunday.\n\nDecision taken on permanent basis and happened due to collective effort of all stakeholders, says DC\n\nWhen asked whether the move was permanent or if the U-turns might be closed again, he confirmed that it would be permanent.\n\nHowever, while most people commend the decision of the local administration and the capital police, some fear it may lead to traffic jams in the city.\n\nA senior police officer noted that the traffic police would need additional personnel to manage traffic at reopened intersections, especially those lacking traffic signals.\n\nCiting “security concerns and the smooth flow of traffic,” city managers and police had originally closed numerous crossings and U-turns in 2011. The closures were prompted by the traffic police’s lack of resources and personnel.\n\nAnother senior official, who wished to remain anonymous, criticised the move, stating that the closure of over 70 intersections had compromised pedestrian safety, particularly for school-going children. He acknowledged that the closures had more to do with manpower shortages than security or traffic flow.\n\nThe idea of closing intersections was initiated and implemented by the Islamabad Traffic Police (ITP) even though it was a law enforcement agency and not responsible for traffic engineering. While the ITP cited security concerns for some closures, the number of such crossings was relatively small.\n\nMany people were worried about other closed intersections which were made signal-free, allowing motorists to drive fast.\n\n“It was difficult for pedestrians to cross from G-7 to G-8 and similarly from G-6 to G-7 due to the high-speed traffic and lack of signals,” said Ahmed Ali, a resident of G-6.\n\nA senior CDA official noted that no other city was as “signal-free” as Islamabad had become. “By closing intersections, the concept of ‘zebra crossing’ has nearly disappeared from the city,” he said. In developed countries, pedestrians have more rights than motorists, he added. “There, pedestrians can stop fast-moving vehicles by pressing a button at traffic lights, turning them red to safely cross.”\n\n“Now that crossings and U-turns have reopened, it is the responsibility of motorists to follow traffic rules and avoid creating jams,” said Abdul Qadir, a resident of F-8.\n\nMohammad Riaz, a senior citizen from F-10, added that many previously closed U-turns and chowks in the busy F-10 Markaz had been reopened, allowing motorists to cross main roads without inconvenience.\n\nMeanwhile, a senior journalist who recently visited China noted that no one takes the first available U-turn after entering a highway from a side road there, not due to a law but out of consideration for traffic flow. He expressed the hope that such civic responsibility could be adopted in Pakistan as well.\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6833aef2c4154.jpg",
  "retrievedAt": "2025-08-23T14:28:44.274Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913280/relief-for-residents-as-95pc-u-turns-and-chowks-reopen-in-islamabad",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:06:05.000Z"
}
