{
  "title": "GB Land Reforms Act hailed as historic step towards local ownership - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Bar council passes resolution lauding legislators\n• Says the legislation makes local people owners of their lands\n\nGILGIT: Lawyers’ community in Gilgit-Baltistan has lauded the approval of Land Reforms Act by the GB Assembly as the first legislation to give land ownership to locals, replacing the colonial-era law.\n\nThe Gilgit-Baltistan Bar Council, in a meeting chaired by Syed Riaz Kazimi, passed a resolution lauding assembly members for getting the much-awaited land reforms act approved.\n\nThe resolution said the land reforms act replaced colonial law Khalisa Sarkar 1978 and made local people owners of their lands. It added that according to aspirations of people, ownership of land has now become possible.\n\nThe resolution appreciated the efforts of Amjad Hussain, who moved bill and incorporated lawyers’ recommendations into it before passing the legislation.\n\nSpeaking to Dawn, Advocate Islamuddin said the “Nautore Rules” were enforced in Gilgit and Baltistan before independence during Sikh rule. In 1978, the government repealed the Gilgit Sub-Division Nautore Rules, 1942, and the Baltistan Nautore Rules, 1965, and implemented the Northern Areas Nautore Rules, 1978.\n\nIn settled areas, Nautore Land refers to all lands that are registered in the settlement records under government ownership, while in unsettled areas, Nautore Land refers to land that is not in the individual ownership or possession of anyone, which has not been allotted by any competent authority, and which is barren land located outside the village limits, the lawyer explained.\n\nMr Islamuddin said that all powers related to Nautore Land were vested in the collector/deputy commissioner as they had the powers to cancel the allotted land and transfer or register new allotments and transfers.\n\nThe collector had the power to take all decisions related to barren and public lands, he added.\n\nIn the Nautore Rules, 1978, there was no concept of public land, divisible or indivisible land or common land; land was either in individual ownership or in the ownership of the Khalsa Sarkar (government land). But the GB Land Reforms Act 2025 finally replaced Northern Areas Nautore Rules, 1978, he said.\n\nMr Islamuddin noted that the GB Land Reforms Act was a comprehensive law, in which legislation had been made according to prevailing customs, local conditions and land structure of Gilgit-Baltistan. “The Gilgit-Baltistan Land Reforms Act 2025 divides land into two categories: Common Land and Government Land.”\n\nAccording to him, this new law declares all waste lands, pastures, mountains, rivers, glaciers etc. as common public lands and recognises public as the common owners of these lands and resources, whereas in the Nautore Rules 1978, there was no concept of common public ownership and the government had full ownership rights and powers over waste lands.\n\nUnder the new law, other types of lands are called “Government Land”. This refers to lands that have been allotted to the provincial or federal government and are in the possession of the government, or are certified in the name of government institutions in the record books.\n\nAccording to the GB Land Reforms Act, a “District Land Appropriation Board” (DLAB) has been constituted under Section 4, which will be headed by the deputy commissioner, and the member of assembly of the concerned constituency will also be a part of this board along with other members. This board will prepare a plan and recommendations regarding the distribution of distributable land and submit it to the “Gilgit-Baltistan Land Appropriation Board” (GBLAB), which will take a final decision.\n\nEarlier, PPP GB chapter president and GB Assembly member, Advocate Amjad Hussain, who had introduced the bill, told the media that for the first time the colonial laws had been replaced with local laws.\n\n“After the GB Land Reforms Act 2025, the region’s people have been declared owners of the all common lands,” he said.\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:17:40.375Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913358/gb-land-reforms-act-hailed-as-historic-step-towards-local-ownership",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:23.000Z"
}
