{
  "title": "Sindh IG forms committee to probe violence in Moro - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Inspector General of Police (IGP) Ghulam Nabi Memon on Monday formed a committee to probe a violent protest in Naushero Feroz’s Moro city on May 20, where one protester was killed and over a dozen other people, including police personnel, were injured.\n\nClashes broke out in Moro last Tuesday when police attempted to disperse demonstrators protesting the controversial construction of new canals on the River Indus. Protesters, organised by the Sindh Saba and armed with sticks and rods, blocked the Moro bypass road and clashed with police.\n\nSindh Home Minister Ziaul Hassan Lanjar’s house was also attacked, along with two trailers on Moro bypass road. A deputy duperintendent of police (DSP) was among the wounded.\n\nAccording to a notification, the committee, chaired by Sindh West Deputy Inspector General (DIG) Irfan Ali Baloch, will comprise Senior Superintendent of Police (SSP) Amjad Ahmed Shaikh of the Anti-Vehicle Lifting Cell, Benazirabad SSP Shabbir Sethar, DSP CIA Hyderabad Iftikhar Buriro and sub-inspector Naik Mohammad.\n\n“The investigation of FIRs lodged will run parallel as a criminal case investigation”, the Sindh IG told Dawn.com when contacted for confirmation.\n\n“The facts in this case are scattered, therefore, this committee is [being] formed,” he added. “Besides ascertaining the facts leading to [the] May 20 incident, it will evaluate [the] police response to the situation and fix responsibility, suggesting and recommening remedial measures to prevent such untoward incidents in [the] future.”\n\nMeanwhile, the Human Rights Commission of Pakistan (HRCP) expressed “deep alarm” about the situation in Moro and the casualties and injuries among demonstrators and the police.\n\n“The burial of a deceased political activist under police supervision, as well as subsequent arrests and charges of sedition against protesters and their families, are gravely concerning,” the commission wrote on X.\n\n“While HRCP does not condone violence by any actor, the disproportionate use of force by the police and criminalisation of dissent is unlawful. We demand an immediate, impartial inquiry into these incidents.”\n\nOn Sunday, the body of Irfan Leghari, who was killed in the violence in Moro, was buried in Mohammad Shah graveyard instead of his ancestral graveyard under a judicial order.\n\nLeghari’s funeral was performed by police in the absence and without the consent of his family members and close relatives. Leghari had been shot during the police action and ensuing clashes.\n\nFamily members and relatives reacted angrily when police escorting the coffin-carrying ambulance arrived in the Leghari Bijarani village, in Sanghar district, late on Friday evening.\n\nThey said they would not accept the body from the police, who they said killed their loved one and also tortured and rounded up many of their community members at the demonstration.\n\nLeghari’s heirs insisted that all those detained during and after the protest be released and cases against them withdrawn. Additionally, they demanded the resignation of the Sindh IG and DIG, as well as the registration of an FIR to investigate the incident.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:28:22.867Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913471/sindh-ig-forms-committee-to-probe-violence-in-moro",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T18:51:05.000Z"
}
