{
  "title": "Roland Garros pays tribute to retired Nadal as Sabalenka makes fast start - Sport - DAWN.COM",
  "author": null,
  "content": "PARIS: Rafael Nadal was given a rousing reception as the ‘King of Clay’ stepped onto Court Philippe Chatrier for the final time on Sunday in a ceremony to celebrate his career at the French Open, while Aryna Sabalenka got her French Open campaign up and running with an emphatic victory.\n\nThe 38-year-old, who retired from tennis last November, was serenaded by the Roland Garros crowd, with spectators wearing different coloured t-shirts to create the message “14 RG, Rafa”.\n\nNadal dominated the French Open after winning on debut as a teenager in 2005, lifting the trophy a record-breaking 14 times.\n\nThe Spaniard finished with a remarkable 112-4 win-loss record at the clay-court Grand Slam.\n\nHe last won the title in 2022 and played his final match on the Paris clay last year when he was defeated by Alexander Zverev in the first round.\n\n“I don’t know how to start… I’ve been playing on this court for 20 years.\n\nI suffered, I won, I lost. I have lived many emotions here on this court,“ an emotional Nadal told the crowd after watching a video of his career highlights at Roland Garros.\n\nNadal’s family and friends watched from the player’s box, along with many of his former coaching staff, including his uncle Toni.\n\n“Without doubt, the most important tennis court of my career,” Nadal added to cheers.\n\n“It’s been an incredible story that began back in 2004 when I came to Roland Garros for the very first time. I could barely walk on crutches due to a foot injury. I climbed to the top of the court and looked out and couldn’t wait to play here.”\n\nNadal won the title the very next year after that injury setback, downing Mariano Puerta in the final.\n\nNadal’s long-time rivals Novak Djokovic, fresh from winning his 100th ATP title on Saturday, Roger Federer and Andy Murray all joined him on the main Chatrier court.\n\nThe trio walked out after Nadal’s speech to greet their fellow former world number one, to a deafening roar from the fans.\n\n“After all these years fighting for everything, it’s unbelievable how time changes the perspective of things,” Nadal said to the other members of the ‘Big Four’.\n\nSABALENKA, ZHENG UP AND RUNNING\n\nWomen’s world number one Sabalenka needed just an hour to sweep aside Russian Kamilla Rakhimova on the opening day of the tournament.\n\nThe Belarusian kicked off the schedule under the roof on Court Philippe Chatrier with a ruthless 6-1, 6-0 win, making a strong start to her tilt at a first French Open title.\n\nSabalenka has never reached the final at Roland Garros, but the tournament appears more open than in recent years given the struggles of three-time defending champion Iga Swiatek.\n\nThe Pole has slipped to fifth in the rankings and has not reached a WTA final since lifting her fourth French Open trophy last year.\n\nSabalenka believes she is as well-placed as ever to take advantage.\n\n“I really feel I can do really good here,” said Sabalenka, who belted 30 winners past Rakhimova in a one-sided contest. “Super happy with the level.”\n\nChina’s Zheng Qinwen, who won Olympic gold last year at Roland Garros, overcame a tough first-round assignment as she beat former finalist Anastasia Pavlyuchenkova 6-4, 6-3.\n\n“I will carry the gold medal mentality throughout the tournament,” said Zheng, the number eight seed.\n\nElina Svitolina opened the action on Court Suzanne Lenglen with a 6-1, 6-1 win over Turkey’s Zeynep Sonmez as scattered showers interrupted play briefly on the outside courts before giving way to clearer skies.\n\nGermany’s Eva Lys took out American 28th seed Peyton Stearns 6-0 6-3 while twice Wimbledon champion Petra Kvitova was another early casualty in Paris following her 3-6, 6-0, 6-4 defeat by Swiss Viktorija Golubic.\n\nSerbia’s Hamad Medjedovic became the first player into the men’s second round with a 6-3, 6-3, 7-6(2) victory over Poland’s Kamil Majchrzak.\n\nIn the men’s section, Italian Lorenzo Musetti found his touch after a tight first set to reach the French Open second round with a 7-5, 6-2, 6-0 victory over German qualifier Yannick Hanfmann, beginning his campaign with the firm intention of winning the title.\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6833bb6c0695e.gif",
  "retrievedAt": "2025-10-12T03:17:10.772Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913389/roland-garros-pays-tribute-to-retired-nadal-as-sabalenka-makes-fast-start",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:36.000Z"
}
