{
  "title": "Journalist, official among 23 dead in Israeli strikes - World - DAWN.COM",
  "author": null,
  "content": "• Gaza authorities say Israel in control of 77pc of territory\n• Man whose nine children killed battling for life in ICU\n\nCAIRO: Israeli military strikes killed at least 23 Palestinians across the Gaza Strip on Sunday, including a journalist and a rescue service official, health authorities said.\n\nThe latest deaths resulted from Israeli strikes in Khan Yunis, Jabalia and Nuseirat areas, medics said.\n\nIn Jabalia, local journalist Hassan Majdi Abu Warda and several family members died when an air strike hit his house.\n\nThe air strike in Nuseirat killed Ashraf Abu Nar, a senior official in the territory’s civil emergency service, and his wife in their house, medics added.\n\nThere was no immediate comment by the Israeli military.\n\nThe Hamas-run Gaza government media office said Abu Warda’s death raised the number of Palestinian journalists killed in Gaza since October 7, 2023, to 220.\n\nIn a separate statement, the media office said Israeli forces were in control of 77 per cent of the Gaza Strip, either through ground forces or evacuation orders and bombardment that keeps residents away from their homes.\n\nIslamic Jihad, a wing of Hamas, said that fighters had carried out ambushes and attacks using bombs and anti-tank rockets against Israeli forces in several areas across Gaza.\n\nMeanwhile, the father of nine children killed in an Israeli strike in Gaza over the weekend remains in intensive care, said a doctor at the hospital treating him.\n\nHamdi Al-Najjar, himself a doctor, was at home in Khan Yunis with his 10 children when an Israeli air strike occurred, killing all but one of them. He was rushed to the nearby Nasser Hospital in southern Gaza where he is being treated for his injuries.\n\nAbdul Aziz Al-Farra, a thoracic surgeon, said Najjar had undergone two operations to stop bleeding in his abdomen and chest and that he sustained other wounds including to his head.\n\n“May God heal him and help him,” Farra said, speaking by the bedside of an intubated and heavily bandaged Najjar.\n\nThe Israeli military confirmed it conducted an air strike on Khan Yunis on Friday. The military is looking into claims that “uninvolved civilians” were killed, it said, adding that the forces had evacuated civilians from the area before the strike began.\n\nAccording to medical officials in Gaza, the nine children were aged between one and 12 years. The child that survived, a boy, is in a serious but stable condition, the hospital said.\n\nNajjar’s wife, Alaa, also a doctor, was not at home at the time of the strike. She was treating Palestinians injured in Israeli attacks on Gaza in the same hospital where her husband and son are receiving care.\n\n“She went to her house and saw her children burned, may God help her,” said Tahani Yahya Al-Najjar of her sister-in-law.\n\n“With everything we are going through only God gives us strength.”\n\nTahani visited her brother in hospital on Sunday, whispering to him that she was there: “You are okay, this will pass.”\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/26092503283f2b2.jpg",
  "retrievedAt": "2025-10-12T03:16:49.521Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913326/journalist-official-among-23-dead-in-israeli-strikes",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:07.000Z"
}
