{
  "title": "PTI announces countrywide movement, party told to prepare itself - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI officials on Monday announced that the party will launch a “countrywide movement” and urged party members and supporters to get ready, though no date was announced.\n\nParty founder and ex-premier Imran Khan has been imprisoned at Rawalpindi’s Adiala Jail for over two years upon his conviction in four cases — two Toshakhana references, the cipher case, and the Iddat case, in which his wife, Bushra Bibi, is also jailed.\n\nThe party has since launched several mass protests demanding his release, notably a march to Islamabad on November 26, 2024, where a day of pitched battles between security forces and PTI protesters ended in a hasty retreat of the party’s top leadership and supporters from the Red Zone.\n\nIn a post on X, PTI Senator Ali Zafar wrote that the party would be mobilising nationwide after having a six-hour discussion with the ex-premier today.\n\n“Some very important matters were discussed. Amongst them was a countrywide movement for which the party should prepare and be well-organised,” the senator wrote.\n\nZafar warned that according to Imran, “there is no room for anyone in PTI to play both sides, and everyone must stand united for the cause of truth and justice.”\n\nQuoting Imran, Zafar wrote, “I am bearing all the hardship in jail for the sake of the nation, and PTI leadership should not be scared of sacrifice.”\n\nHe did not give a date for when this movement is set to take place.\n\nMeanwhile, Imran’s sister Aleema Khanum also spoke to reporters outside the Adiala Jail about the mass mobilisation, though she too did not give a date for when the movement would take place.\n\n“Imran Khan issued instructions to get the party ready,” Aleema said. “He said ‘I will not call anybody to Islamabad, since they (authorities) sit with sniper rifles and people get shot … it brings me great pain, I will not do this.’\n\n“Imran Khan has said that the party should get ready, as he will announce a mass movement across Pakistan soon,” she added.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:28:22.918Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913461/pti-announces-countrywide-movement-party-told-to-prepare-itself",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T17:49:49.000Z"
}
