{
  "title": "Pak-EPA, Islamabad admin go after single-use plastic items as usage remains rife - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As single-use plastic items continue to be used in the federal capital despite a 2023 law to curb their use, the climate ministry has claimed they have stepped up a crackdown on such items and imposed fines on several violators.\n\nIn a statement, its spokesperson Saleem Sheikh said the Pakistan Environmental Protection Agency (Pak-EPA) in collaboration with the Islamabad Capital Territory (ICT) administration had “intensified” its enforcement of the Single-Use Plastics (Prohibition) Regulations 2023.\n\nThe official recalled that on May 23, a Pak-EPA’s enforcement team conducted a targeted inspection in the G-6 Sector and seized over 15 kilogrammes of banned single-use plastic products. Six shopkeepers were fined and issued warnings for non-compliance, he added.\n\nIn a separate operation on May 22, Pak-EPA teams carried out inspections in key markets, including G-9 Peshawar Morr Market, Safa Gold Mall (F-7 Markaz), and Rana Market (F-7/2).\n\nEPA DG says anyone found using polythene bags will be fined\n\nThese raids led to the confiscation of over 300 kilogrammes of banned items and Rs45,000 in fines on seven violators, the spokesperson added. On May 16, inspections in G-7 Markaz and adjacent markets resulted in the seizure of 150 kilogrammes of single-use plastics and Rs10,000 in fines, he added.\n\nLauding the joint crackdowns by Pak-EPA and the ICT administration, Pak-EPA Director General Nazia Zeb Ali emphasised the agency’s firm stance against plastic pollution.\n\n“This crackdown is part of our sustained efforts to enforce the Single-Use Plastics (Prohibition) Regulations 2023, to reduce plastic pollution in the capital city and its adjoining areas for overall protection of the environment and public health,” she remarked. She highlighted that stringent actions would continue at all levels against those disregarding the ban, contaminating the city’s environment and harming public health.\n\nThe Single-Use Plastics (Prohibition) Regulations 2023 banned the manufacture, import, distribution, sale, and use of single-use plastics, including polythene bags and disposable beverage containers, within the Islamabad Capital Territory.\n\nDG Nazia Zeb Ali warned that anyone found using, selling and manufacturing polythene bags would be liable to pay fines. In case of violation of law, an individual would be fined Rs5,000, a manufacturer Rs100,000 and a shopkeeper Rs10,000.\n\nHighlighting the environment and public health burden of single-use plastic items, Nazia Zeb Ali remarked that single-use plastics, such as polythene bags, disposable utensils, and plastic straws, are among the leading contributors to urban pollution.\n\n“In Islamabad alone, a significant portion of municipal waste is composed of polythene bags. Besides being known as a major cause of deleterious impact on the environment and public health, these plastics clog drainage systems, contribute to urban flooding and take centuries to decompose,” she highlighted.\n\nShe said further that such plastics release toxic chemicals as they degrade, adding that these microplastics enter soil, water, and even the air, posing long-term health risks.\n\nOpen burning of plastic waste, still a common practice, produced harmful fumes that directly impacted respiratory health, especially among children and the elderly, she added. It may be noted that in the absence of a proper waste disposal system in the capital, particularly in some of its rural areas, waste burning has become a common practice.\n\nNazia Zeb Ali also urged the public to support the government’s efforts to rid the city of the growing burden of single-use plastics and its adverse impacts on the environment, public health and the city’s sewerage system.-\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:28:43.905Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913284/pak-epa-islamabad-admin-go-after-single-use-plastic-items-as-usage-remains-rife",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:06:06.000Z"
}
