{
  "title": "Iran rejects temporary halt on uranium enrichment to secure US nuclear deal - World - DAWN.COM",
  "author": null,
  "content": "Iran will not consider temporarily suspending uranium enrichment to secure a nuclear deal with the US, a foreign ministry spokesperson said on Monday, adding that no date had yet been set for a sixth round of talks with Washington.\n\nThe negotiations between Washington and Tehran aim to resolve a decades-long dispute over Iran’s nuclear ambitions, and both sides have taken a tough stance in public over the issue of Iran’s uranium enrichment.\n\nAsked about reports that Iran could freeze enrichment for three years to reach an agreement, spokesperson Esmail Baghaei told a press conference: “Iran will never accept that.”\n\nBaghaei also ruled out the possibility of an interim nuclear deal with the US, dismissing media reports that a provisional agreement was being considered as a temporary step towards a final deal.\n\nPresident Donald Trump said on Sunday that US negotiators had “very good” talks with an Iranian delegation over the weekend.\n\nIran is waiting for further details from mediator Oman regarding the timing of the next round of talks, Baghaei said.\n\n“If there is goodwill from the American side, we are also optimistic, but if talks are aimed at curbing Iran’s rights then talks will get nowhere,” he added. The stakes are high for both sides.\n\nTrump wants to curtail Tehran’s potential to produce a nuclear weapon that could trigger a regional nuclear arms race and perhaps threaten Israel.\n\nIran, for its part, maintains its nuclear programme is exclusively for civilian purposes and wants to be rid of devastating sanctions on its oil-based economy.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/2614472137102bc.jpg",
  "retrievedAt": "2025-08-23T14:28:25.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913429/iran-rejects-temporary-halt-on-uranium-enrichment-to-secure-us-nuclear-deal",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T09:48:29.000Z"
}
