{
  "title": "Over 3,800 vehicles of govt depts don’t give a hoot to traffic laws in Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Over 3,800 official vehicles of the government departments being used by senior bureaucrats and police officers were found violating traffic laws in Lahore, with the majority of them committing multiple violations, showing a rising trend of law-breaking by the top government officers compared to the other citizens.\n\nShockingly, the official vehicles in the use of top-ranked officers were spotted violating the traffic laws. They included inspector general of police, Lahore Commissioner and DC, DGs of Federal Investigation Agency (FIA), Pakistan Post, Agriculture, Excise and Taxation, Punjab Food Authority and Health Services, Lesco CEO and additional chief secretaries.\n\nIt was revealed in a report formed by the City Traffic Police (CTP) Lahore, carrying the record of total 3,896 official vehicles that were spotted ignoring traffic rules.\n\nAs per the report, the Punjab Police was at the top among other federal and provincial departments whose 496 official vehicles committed traffic violations in Lahore, followed by 358 vehicles of the Services & General Administration Dept and 328 of the Lahore Electricity Supply Company (Lesco).\n\nVehicles of IGP, commissioner, DC, FIA DG, other top officers found committing violations, not paying fines\n\nAbout the departments, the traffic police said many vehicles belonged to the CM Monitoring Cell, Law, Parliamentary Affairs & Human Rights Department Punjab, the Pakistan Railways, Punjab Revenue Authority, Pakistan Telecommunication Company Ltd, National Highways Authority, Ministry of Pakistan Railways, Sui Northern Gas Pipelines, Punjab Home Department, the Environment Protection Department Punjab, the Lahore Development Authority.\n\nA vehicle (LRZ 6076), in the use of an SP, violated the traffic laws 107 times (highest violations) in Lahore and fines imposed on this vehicle, amounting to Rs50,300, were still unpaid. Another vehicle (LZR 9872), which was under the use of the Punjab Agriculture DG, violated the traffic regulations 83 times and its Rs74,000 fine was not paid. An official vehicle (LWQ 1235) belonging to the additional chief secretary (S&GAD) Punjab committed 47 violations and its fine Rs21,300 was still unpaid. Seven other vehicles belonging to the same officer were spotted violating traffic laws 65 times.\n\nThe report further revealed that 300 vehicles which violated traffic laws belonged to Wapda, 184 to Livestock & Dairy Department, 181 PTCL, 130 SNGPL, 122 irrigation department, 117 of PFA Punjab, 107 DC office, 102 belonged to the Lahore Cantonment Board, 104 National Highways Authority, 99 of agriculture department, 89 LDA, 76 Pakistan Railways, 69 Punjab Revenue Authority, 68 of Punjab health department, 61 Punjab Horticulture Authority, 42 of Punjab Home Department, 41 of Ring Road Authority, 40 of Punjab Board of Revenue, 37 of Pakistan Atomic Energy Commission, 31 of FIA etc.\n\nAn official said the statistics came to the limelight when the Punjab Safe City cameras spotted the vehicles and issued them e-challan tickets. The city traffic police conducted detailed investigations and found out that these vehicles belonged to 73 departments.\n\nAnother irritating part of the development is that all officials in charge of these vehicles never bothered to pay fines, prompting the traffic police high-ups to write them letters to ‘identify the violators and pay fees’ besides initiating action against them.\n\nLahore Chief Traffic Officer (CTO) Athar Waheed has brought the matter to the notice of Chief Secretary Zahid Akthar Zaman and IGP Dr Usman Anwar. He has requested the both higher officers of the province to intervene to stop violations being committed by those running the province.\n\nOn the other hand, the traffic police lodged 4,541 FIRs against the citizens for violating traffic rules in Lahore during the last 10 days. Many of them were arrested on the spot, the official said.\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:16:49.285Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913330/over-3800-vehicles-of-govt-depts-dont-give-a-hoot-to-traffic-laws-in-lahore",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:54.000Z"
}
