{
  "title": "JI plans long march to Islamabad for rights - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Jamaat-i-Islami’s Balochistan chapter emir, Maulana Hidayat-ur-Rehman Baloch, on Sunday announced plans for a province-wide mobilisation, including a long march to Islamabad and a mass sit-in in Quetta, to demand basic rights for the people of Balochistan.\n\nAddressing a youth convention, “Balochistan’s Burning Issues and the Role of Youth,” Mr Rehman accused the federal government of treating Balochistan’s population like a “dead and enslaved nation.”\n\nHe alleged that Baloch youth were systematically denied employment and economic opportunities, with the result that a sense of alienation prevails among them.\n\n“Through deliberate policies, we are being pushed towards despair and insurgency,” he said.\n\n“But we will not choose the path of cowardice or violence. We will pursue democratic resistance with resolve.”\n\nMr Rehman expressed serious concern over the number of young people buried in Balochistan’s cemeteries, citing enforced disappearances, extrajudicial killings, and state oppression as devastating to Baloch families.\n\nAlleges systematic denial of employment and economic opportunities to Balochistan\n\nHe called for the recovery of missing persons, the reopening of trade at border crossings, and an end to what he termed Islamabad’s discriminatory policies.\n\nOther speakers at the convention, including Jamaat-i-Islami provincial general secretary Murtaza Khan Kakar and IJT Balochistan head Bahadur Khan Kakar, echoed these concerns. They identified widespread poverty, drug abuse, lawlessness, the destruction of education and healthcare systems, and frequent harassment at checkpoints as critical issues facing the province.\n\n‘No access to clean water in heart of CPEC’\n\nReferring to the China-Pakistan Economic Corridor (CPEC), Mr Rehman lamented that while other provinces benefited from infrastructure projects, Balochistan, particularly Gwadar, has seen little more than additional checkpoints and police stations. “We don’t even have access to clean drinking water or basic healthcare in the heart of China-Pakistan Economic Corridor,” he added.\n\nHe further accused the federal government of using International Monetary Fund loans to suppress Baloch and Pashtun populations. “Those who closed the Chaman and Gwadar borders are the enemies of our youth,” Mr Rehman declared.\n\nVowing a peaceful but firm campaign, Mr Rehman said he would tour Balochistan to prepare for the Islamabad march and urged youth to organise for a sit-in of one hundred thousand people in Quetta.\n\n“We are not safe — neither our children nor our nights. Our democratic protest is met with jail and bullets,” he said. “But we will reclaim our rights through peaceful resistance.”\n\nPublished in Dawn, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:28:57.764Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913356/ji-plans-long-march-to-islamabad-for-rights",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:23.000Z"
}
