{
  "title": "A bumpy import road ahead - Newspaper - DAWN.COM",
  "author": null,
  "content": "Ahead of Budget FY26, everything seemed to look sound in the auto sector. The sale of both imported and locally made heavy vehicles, cars and two-wheelers has shown a robust trend.\n\nThis is evident from the official figures suggesting huge import bills for both completely built-up (CBU) units as well as completely and semi-knocked-down (CKD/SKD) kits being imported by the assemblers for local assembly of vehicles.\n\nHuge imports of any kind usually give a serious jerk to the sale of locally made items, but strangely in the case of automobiles, cash-rich consumers are going wild for both imported and locally made vehicles.\n\nThe import bill of CBU buses and trucks, along with other heavy vehicles and cars and bikes, soared to $85 million, $228m and $2.1m, respectively, in 10MFY25 from $45m, $207m and $1.33m in the same period last fiscal, showing a jump of 88pc, 10pc and 54pc.\n\nIMF’s tariff cuts, followed by an increase in the age limit of used cars to five years, may slow down sales of locally made vehicles and harm the country’s manufacturing base\n\nMarket pundits believe that electric vehicles (EVs), hybrid EVs and plug-in hybrid EVs are being imported by the new entrants, followed by small volumes of imports of fossil fuel vehicles by the local assemblers. One cannot rule out the huge import of used cars in the overall CBU import bill.\n\nImporters try to hide rising trends in used car imports. The CEO of Indus Motor Company, Ali Asghar Jamali, has recently pointed out that used car imports still represent a significant portion of 29 per cent of the local auto market by value in the current financial year.\n\nHe noted during July-March FY25, imports of used vehicles increased modestly by 6pc to 29,590 units from 27,859 in the same period last year.\n\nLikewise, the import of CKD/SKD kits for heavy vehicles, cars and bikes by the local assemblers stood at $330m, $818m and $38m, respectively, during 10MFY25, up by 141pc, 37pc and 11pc over the same period last fiscal year.\n\nAs things have been moving in a positive direction prior to the new budget FY26, auto players have received a shock from the International Monetary Fund’s (IMF) tariff rationalisation plan followed by tariff cuts in National Tariff Policy 2025-2030 for many sectors, including the automotive sector. The IMF also backs up the reduction in the age limit of used cars to five years and allows the commercial import of vehicles.\n\nIn the upcoming budget, the government needs to rationalise tariff structures applied equally to all assemblers — old and new — based on a clear localisation roadmap\n\nThese developments have caused anxiety among the executives of the auto sector, who have been continuously engaged in meetings with the Ministry of Industries and Production, pointing out serious repercussions of the IMF-backed programme in which vendors fear loss of over 500,000 jobs in case of tariff rationalisation.\n\nThe government, which appears helpless, has also reportedly asked the assemblers to engage foreign consultants to deal with the IMF tariff rationalisation plan.\n\nTariff cuts, followed by an increase in the age limit of used cars to five years from three years, may slow down sales of locally made vehicles. Used cars arriving under various schemes will further make deeper inroads, as cuts in tariffs on new and used vehicles will bring down prices of these vehicles.\n\nAuto sector expert Mashood Ali Khan said an increase of 40pc in the sales of cars, pickups, sports utility vehicles (SUV) and vans to 111,464 during 10MFY25 has pushed up the import of CKD/SKD kits by the assemblers, thus contributing to the trade deficit.\n\nHowever, the majority of this volume is dominated by new entrants, mainly Chinese and Korean SUV assemblers. “There is negligible localisation in new models. SUVs and premium segment vehicles assembled by new entrants have very low or zero localisation,” he claimed.\n\nThese new players are taking full advantage of tariff concessions under government policies, importing parts instead of developing local supply chains. As a result, local parts manufacturers are excluded from the value chain, while the national import bill continues to rise, Mr Khan explained.\n\nHistorically, once imports start rising without industrial safeguards, local manufacturing suffers, leading to factory closures and layoffs.\n\nSpeaking about the IMF’s guidelines, Mr Khan explains, “If implemented, this will directly challenge local assemblers, lowering prices of imported vehicles and hurting local auto parts manufacturers. Price competition is welcome — but unfair competition from subsidised imports risks collapsing three decades of local vendor investment.”\n\nHe said parts makers are facing enormous challenges like unfair tariff advantages for new entrants, unpredictable localisation obligations, greater preference for imports, low volumes from existing assemblers due to market shrinkage, rising costs of raw materials, utilities, and currency depreciation. There is no structured export policy for auto parts manufacturers, as auto parts exports have been reeling at $20-25m per annum for decades.\n\nIn the upcoming budget, the government needs to rationalise tariff structures for fair competition, and tariffs should apply equally to all assemblers — old and new — based on a clear localisation roadmap.\n\nPakistan cannot afford to sacrifice its local manufacturing base for short-term gains through relaxed imports. The upcoming budget is an opportunity to correct course and support a balanced, fair, and forward-looking industrial policy, Mr Khan said.\n\nShankar Talreja of Top Line Securities said lifting restrictions on used car imports and relaxing the existing age limit of three years to five years will increase the import of used vehicles, which will impact auto assemblers negatively. However, this will be implemented from July 2026 onwards; only legislation needs to be submitted by July 2025.\n\nMr Talreja was of the view that hatchback car makers will be more affected than sedan/SUV manufacturers, as the large import market comprises engine capacities up to 1,000 cc, in which largely Pak Suzuki operates, though the Kia Picanto also holds some market share.\n\nThe government seeks to “extend the principle of removing the preferential treatment of local production to other industries by July 2026, and this will be implemented in a gradual manner until FY30. Mr Talreja said this will be a problem for local auto vendors, as auto assemblers are currently incentivised to buy locally made parts from Pakistan, as duties on these parts were higher for imports.\n\nAfter removal of this preferential treatment, both local and imported parts will be on a level playing field. Nonetheless, this will be a gradual shift and will start from July 2026 onwards, he said.\n\nPublished in Dawn, The Business and Finance Weekly, May 26th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:17:17.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913204",
  "dateList": "2025-05-26",
  "date_published": "2025-05-26T01:05:30.000Z"
}
