{
  "title": "Milk and money - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE nationalisation of the Abu Dhabi National Oil Company in the early 1980s was not an imperceptible process, unlike the assimilation of Parsis who dissolved like sugar in the milk of India.\n\nIt was more a precipitation — the locals rose to the top, leaving expatriates below. In February 1981, a trickle, then a flood, of watanis found employment in ADNOC. Inevitably, their qualifications mattered less than their lineage. They had to belong to the right clan. A watani expressed incomprehension at the appointment of another as a director. He remonstrated: “But he is not from Al Ain!” — the stronghold of the ruling Al Nahyan family.\n\nWatanis targeted first the post of director and then worked their way down the corporate ladder. Like some ethnic types who avoid manual labour, preferring cerebral activities like the arts or commerce, the watanis sought authority without responsibility.\n\nTheir challenge lay in adapting to a multinational environment. Engineers were primarily a potpourri drawn from the subcontinent — Indians and Pakistanis, diluted by Egyptians and Palestinians. A soft-spoken, efficient divisional head in the exploration & production directorate — a Palestinian — was later uncovered as a spy.\n\nWorking with ‘watanis’ became an education in itself.\n\nSudanese populated the legal department, the Lebanese were inclined towards IT-related tasks, and the Egyptians be-cause of their command over Arabic were known as skilled Iagos — devious and manipulative.\n\nWorking with watanis became an education in itself. They were secretive and despite their social generosity — communal feasts, etc — they preferred to keep their personal lives private. One would rarely be invited into their homes or introduced to their families.\n\nOccasionally, they might in a moment of candour reveal their true thoughts about us expatriates. It amused them to play games with foreigners who asked: ‘Do you select a particular coloured keffiyeh to suit the occasion?’ The watani answered this by explaining that the black keffiyeh is worn on formal occasions, the red one at social functions, and the white one for everyday wear. The truth is, he confided to me, we pull out and wear whichever is at the top of the pile.\n\nAnother confessed that the obligatory weekend ritual where he had to attend the majlis of the elders at Al Ain was not inconvenient, as camping in the desert had been made easy with air-conditioned tents. The discomfort lay in having to drink camel’s milk for breakfast.\n\nIn the UAE, watanis wore their local dress with its free flowing thobe. Abroad, they often had difficulty fitting into suits. Shoes were a particular problem. At home, their feet spread within open sandals. Abroad, they could not fit into standard sizes. If the length was right, the breadth would be too narrow.\n\nThose watanis who sought to make an impact showed it in their approach to management. Some were laid back, leaving the day-to-day drudgery to their subordinates. A few held their underlings in a vice.\n\nOne, for example, convened a meeting of his senior staff at a refinery in the field. He took a roll call to ensure that every manager was present. He then asked them whether the plant was still running. The hum outside confirmed that it was. He startled them by saying that if the plant could function without them, then what use were they to him?\n\nHe trimmed his directorate into a lean shadow of itself. He would have reached the bone, had he himself not been trimmed out of ADNOC. He went into business and made more money there than he saved at ADNOC.\n\nAlmost every watani’s name appeared on the client list of the Bank of Credit and Commerce Inter­national (BCCI), which had a symbiotic relationship with ADNOC. Oil revenues flowed first into ADNOC’s account with BCCI and were then dist­r­ibuted as royalties to Sheikh Zayed’s office. The surplus went to ADIA and other government agencies.\n\nFor a decade, as ADNOC grew, so did BCCI. In mid-1981, Agha Hasan Abedi called on ADNOC’s general manager Dr Krouha to thank him for his support. Abedi told Krouha that, by the grace of God, BCCI no longer needed ADNOC’s business.\n\nTen years later, in July 1991, the BCCI collapsed. An ailing Abedi was flown to Abu Dhabi to appeal to Sheikh Zayed. The ruler refused to receive him. After 10 days, Sheikh Zayed told a BCCI official: “Why don’t you take Mr Abedi out of here, because I do not have the heart to break his heart.”\n\nThe rise and fall of BCCI has been documented in searing detail by P. Truell and L. Gurwin in their book False Profits (1992). It is replete with the names of Pakistanis involved in BCCI’s collapse. They survived. Their names are dissolved in the milk of amnesia.\n\nThe writer is an author.\n\nwww.fsaijazuddin.pk\n\nPublished in Dawn, August 14th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/689d476abc61a.jpg",
  "retrievedAt": "2025-08-23T14:29:35.609Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930771/milk-and-money",
  "dateList": "2025-05-26",
  "date_published": "2025-08-14T02:19:30.000Z"
}
