{
  "title": "Sindh govt fully prepared to deal with potential threat of flood: Sharjeel - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Senior Sindh Minister Sharjeel Inam Memon has said that the provincial government has completed preparations to deal with the ‘potential flood threat’ and that arrangements are being made to relocate people to safe areas, if necessary.\n\nAddressing a press conference here on Thursday, he said that Chief Minister Syed Murad Ali Shah had put all administrations across Sindh on alert.\n\n“Though the situation in the province is currently under control, the Provincial Disaster Management Authority has taken precautionary measures to relocate people to safe areas, if necessary,” he said.\n\nExpressing solidarity with the flood-affected people of Punjab, he said that the Pakistan Peoples Party and the Sindh government stood by them in this difficult time and supported Punjab government’s relief and rescue efforts.\n\nMr Memon said that the Sindh government was fully prepared to respond to any emergency. “We are working closely with the National Disaster Management Authority (NDMA) to mitigate the impact of the floods,” he added.\n\nSays boats, tents, coolers and kitchen equipment stockpiled; irrigation and energy ministers visit Sukkur Barrage to monitor situation\n\nHe said that preparations were underway to handle potential emergencies, with essential supplies such as boats, tents, coolers, and kitchen equipment stockpiled. “A dedicated cell has been established to closely monitor the flood situation and coordinate with the National Disaster Management Authority (NDMA) for swift response to any emergencies,” he added.\n\nThe senior minister provided a detailed update on the flood situation at barrages, citing the inflow and outflow at Guddu, Sukkur and Kotri.\n\nAccording to the data collected on Thursday evening, the inflow at Guddu is 300,232, and the outflow is 333,361. At Sukkur, the inflow is 212,300, and the outflow is 266,370, while at Kotri, the inflow is 211,870, and the outflow is 244,025.\n\nLeaves cancelled\n\nChief Secretary Asif Hyder Shah, chairing a meeting on the possible flood situation in the province, directed all essential service departments, including irrigation, local government, health, police, public health, livestock, as well as deputy commissioners’ offices, to cancel all leaves of their relevant employees to ensure availability of a maximum number of personnel for emergency duties.\n\nHe asked all commissioners and DCs to prepare comprehensive contingency plans, giving priority to the safety of people and livestock.\n\nHe also directed that inventory of all government and private machinery and resources should be maintained so that they could be utilised immediately when required.\n\nIt was decided in the meeting that control rooms would be established at the chief secretary’s office, commissioners’ offices, and DCs’ offices to continuously monitor the flood situation and facilitate registration of public complaints.\n\nThe chief secretary directed the health department to ensure an uninterrupted availability of essential medicines and vaccines to prevent malaria and other water-borne diseases during the flood situation. He further directed that anti-venom and anti-rabies vaccines must also be stocked in sufficient quantity at all hospitals and health centres, particularly in vulnerable areas, so that immediate treatment could be provided to such victims without delay.\n\nHe also directed all DCs to maintain close coordination with the Pakistan Army, Navy, Rescue-1122, and other relevant agencies to ensure timely rescue and relief operations.\n\nCommissioners and DCs were further instructed to personally visit riverine areas to review and ensure preparations on the ground.\n\nThe chief secretary directed all commissioners to chalk out comprehensive plans for population likely to be affected and rescue efforts, ensuring that evacuation strategies, relief camps and emergency support systems are well-prepared in advance.\n\nHe instructed the Rescue 1122 and the PDMA to share complete details of their available inventory, including boats, rescue equipment, medicines, tents, and other essential supplies, with commissioners and deputy commissioners so that these resources could be effectively utilised in case of emergency.\n\nThe CS was informed that a total of 188 rescue boats had been made available across the province to deal with any potential flood emergency.\n\nHe directed the DCs to identify and coordinate with local vendors who could provide additional boats on an emergency basis.\n\nMinisters visit Sukkur Barrage\n\nSindh Irrigation Minister Jam Khan Shoro and Energy Minister Syed Nasir Hussain Shah visited Sukkur Barrage on Thursday to review the arrangements made to cope with the potential threat of flood in the province.\n\nThe irrigation secretary, Sukkur commissioner, chief engineer of Sukkur Barrage and other officials were also present during the visit.\n\nSpeaking at a joint press conference later at the barrage, the ministers said that floodwater was heading towards Sindh after causing widespread devastation in Punjab but Sindh government had taken all necessary measures. Irrigation officials were on duty at all embankments, they said.\n\nMr Shoro said that Sukkur Barrage structure is not at risk as it has a capacity to safely pass 960,000 cusecs. Protective dykes are strong enough to sustain pressure, he noted.\n\nHe expressed his concern that people living in the riverine areas were, however, reluctant to move to safe places from their centuries-old abodes.\n\nThe minister said that the government’s focus was currently on Panjnad to see how much water from there will enter Sindh.\n\nNasir Shah said that if 700,000 to 800,000 cusecs would pass through the barrage in a single night, then no one would be able to control the situation. He noted that repeated attempts were made in the past to revive controversial projects, like Kalabagh dam and Sindh opposed it every time.\n\n“The projects of Diamer and Bhasha dams are under construction; water can only be stored after these projects are completed, he added.\n\nWaseem Shamsi in Sukkur also contributed to this report\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:55:39.939Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937975/sindh-govt-fully-prepared-to-deal-with-potential-threat-of-flood-sharjeel",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:22:08.000Z"
}
