{
  "title": "Thai court sacks PM Paetongtarn Shinawatra for ethics violation - World - DAWN.COM",
  "author": null,
  "content": "Thailand’s Constitutional Court dismissed Prime Minister Paetongtarn Shinawatra from office on Friday for an ethics violation after only a year in power, dealing another crushing blow to the Shinawatra political dynasty that could usher in a new period of turmoil.\n\nPaetongtarn, who was Thailand’s youngest prime minister, becomes the sixth premier from or backed by the billionaire Shinawatra family to be removed by the military or judiciary in a tumultuous two-decade battle for power between the country’s warring elites.\n\nIn its verdict, the court said Paetongtarn violated ethics in a leaked June telephone call, during which she appeared to kowtow to Cambodia’s former leader Hun Sen when both countries were at the brink of an armed border conflict. Fighting erupted weeks later and lasted five days.\n\nThe decision paves the way for the election by parliament of a new prime minister, a process that could be drawn out, with Paetongtarn’s ruling Pheu Thai party losing bargaining power and facing a challenge to shore up a fragile alliance with a razor-thin majority.\n\nIn a 6-3 decision, the court said Paetongtarn had put her private interests before those of the nation and damaged the reputation of the country, causing a loss of public confidence.\n\n“Due to a personal relationship that appeared aligned with Cambodia, the respondent was consistently willing to comply with or act in accordance with the wishes of the Cambodian side,” the court said in a statement.\n\nThe ruling brings a premature end to the premiership of the daughter and protégé of influential tycoon Thaksin Shinawatra. Paetongtarn, 39, was a political neophyte when she was thrust abruptly into the spotlight after the surprise dismissal of predecessor Srettha Thavisin by the same court a year ago.\n\nPaetongtarn has apologised over the leaked call and said she was trying to avert a war.\n\nShe is the fifth premier in 17 years to be removed by the Constitutional Court, underlining its central role in an intractable power struggle between the elected governments of the Shinawatra clan and a nexus of powerful conservatives and royalist generals with far-reaching influence.\n\nThe focus will next shift to who will replace Paetongtarn, with Thaksin expected to be at the heart of a flurry of horse-trading between parties and other power-brokers to try to keep Pheu Thai in charge of the coalition.\n\nDeputy premier Phumtham Wechayachai and the current cabinet will oversee the government in a caretaker capacity until a new prime minister is elected by the house, with no time limit on when that must take place.\n\nThere are five people eligible to become prime minister, with only one from Pheu Thai, 77-year-old Chaikasem Nitisiri, a former attorney general with limited cabinet experience, who has maintained a low profile in politics.\n\nOthers include former premier Prayuth Chan-ocha, who has retired from politics and led a military coup against the last Pheu Thai government in 2014, and Anutin Charnvirakul, a deputy premier before he withdrew his party from Paetongtarn’s coalition over the leaked phone call.\n\nThe ruling thrusts Thailand into more political uncertainty at a time of simmering public unease over stalled reforms and a stuttering economy expected by the central bank to grow just 2.3 per cent this year.\n\nAny Pheu Thai administration would be a coalition likely to have only a slender majority and could face frequent parliamentary challenges from an opposition with huge public support that is pushing for an early election.\n\n“Appointing a new prime minister…will be difficult and may take considerable time,” said Stithorn Thananithichot, a political scientist at Chulalongkorn University.\n\n“It’s not easy for all parties to align their interests,” he said. “Pheu Thai will be at a disadvantage.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/291507111264ed7.webp",
  "retrievedAt": "2025-09-06T09:52:11.290Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938149/thai-court-sacks-pm-paetongtarn-shinawatra-for-ethics-violation",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T10:12:57.000Z"
}
