{
  "title": "PSG to face Bayern and Barca in Champions League - Sport - DAWN.COM",
  "author": null,
  "content": "MONACO: European champions Paris St Germain were handed a tough list of opponents, including Barcelona and Bayern Munich, in this season’s Champions League and record 15-time winners Real Madrid will face Manchester City and Liverpool after the league phase draw was made on Thursday.\n\nPSG will entertain Bayern and go to Barcelona, while the French club will also meet Premier League sides Tottenham Hotspur and Newcastle United along with Atalanta, Bayer Leverkusen and Athletic Bilbao in the new group phase format which started last season.\n\nTottenham, the Europa League champions, will play PSG in a repeat of their Super Cup game two weeks ago. PSG’s eight-game schedule is completed by Sporting Lisbon.\n\nXabi Alonso’s Real will play City, who they beat in the knockout playoffs last season, at home and take on Premier League champions Liverpool at Anfield in what will be a homecoming for Trent Alexander-Arnold, who left Anfield to join Real in the close season.\n\nReal also will face Juventus in a repeat of their 2017 final win, and two French opponents, Olym­pique de Marseille and Monaco — where superstar forward Kylian Mbappe started his career.\n\nTheir schedule also includes a trip far east to play FC Kairat Al­m­­aty of Kazakhstan — 6,420 kilometres from Madrid.\n\nLiverpool have away trips to the vibrant stadiums of Inter Milan, Eintracht Frankfurt, Marseille and Galatasaray.\n\nBayern will have rematches of two recent finals — at home to Chelsea where the German champions lost the 2012 title game on home turf, and away to PSG, who they beat in the 2020 final. Bayern also will go to Cyprus to face Pafos.\n\nCity will travel north of the Arctic Circle to face Bodo/Glimt of Norway, and host former fan favourite Kevin De Bruyne with his new club Napoli.\n\nLast season’s runners-up Inter Milan host Liverpool and Arsenal, and the Italian side will travel to Borussia Dortmund and Atletico Madrid.\n\nBarcelona, La Liga champions and last year’s semi-finalists, face away games at Chelsea and Newcastle.\n\nArsenal, semi-finalists last season, play Bayern, Atletico Madrid and Club Brugge.\n\nThis is the second season of the league phase format with 36 teams playing eight different opponents on a weighted schedule through January, and ranked in a single-standings table.\n\nFour newcomers to the main stage of the Champions League are Bodo/Glimt, Kairat, Russian-owned Pafos and Belgian champion Union St Gilloise.\n\nGames in Bodo and Almaty shape to be the longest-ever trips for visiting teams, and their home games in January among the coldest in competition history. Bodo play on a heated artificial turf field.\n\nThe computerised draw gave each team two opponents drawn from each of the four seeding pots. Teams are seeded based on their ranking over five seasons of results in UEFA competitions.\n\nRetired great Zlatan Ibrahimovic picked each team out of their draw pots and former Ballon d’Or winner Kaka pushed a button to reveal the slate of opponents.\n\nGames start on Sept 16 and the final league phase matchday is Jan 28. On that Wednesday evening, all 36 teams play in 18 games kicking off at the same time.\n\nThe top eight teams in the final standings advance to the round of 16 in March. Joining them will be winners of eight knockout playoffs, featuring teams ranked ninth to 24th, scheduled in February. The bottom 12 teams are eliminated.\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:55:35.840Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937980/psg-to-face-bayern-and-barca-in-champions-league",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:21:55.000Z"
}
