{
  "title": "ECC okays Rs40bn to wind up essential items’ facility for the impoverished - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Economic Coordination Committee (ECC) of the cabinet on Thursday approved about Rs40 billion to wind up the Utility Stores Corporation (USC), including payments of terminal benefits to employees and clearing liabilities of vendors and suppliers.\n\nThe meeting, chaired by Finance Minister Muhammad Aurangzeb, sanctioned a technical supplementary grant of Rs30.216bn for the closure of USC, according to an official statement. Another Rs9.935bn to settle vendors’ dues will be budgeted in 2026-27. The ECC also directed the Ministry of Industries and Production to rationalise financial requirements for the winding-up process.\n\nThe committee decided that USC’s assets, including properties, would be disposed of within the current fiscal year to partly cover closure costs. The government stressed that the package was designed to protect employees’ rights while maintaining fiscal discipline.\n\nBreakdown of package\n\nOf the Rs30.216bn, Rs13.225bn has been allocated for a severance package to regular employees. Another Rs5.751bn will cover terminal dues of both regular and contract staff, including compensation for widows of employees who died in service.\n\nGovt allocates Rs30bn for severance, Rs10bn for vendor dues; Utility Stores Corporation assets to be sold this year\n\nA one-time compensatory payment for contractual and daily-wage staff is estimated between Rs2.192bn and Rs6.337bn, subject to negotiations with the Collective Bargaining Agent (CBA).\n\nApproximately Rs1.467bn has been earmarked for pending salaries and operational expenses. This includes half a month’s salary for April 2025, salaries for July and August 2025, and retention of limited staff to facilitate winding up.\n\nRoughly Rs630 million will cover the retention of 832 staff from September to November 2025, while Rs805m will cover the retention of 326 employees from December 2025 to June 2026.\n\nLosses and downsizing\n\nEstablished in 1971, USC was once profitable but has been incurring losses since 2013, which rose to Rs23.8bn by June 2025. Initially set up to provide subsidised essentials, its network expanded sharply in 2007 when outlets increased from 1,023 to 5,557 and staff strength rose from 3,892 to 12,749 by 2009. This expansion made operations heavily reliant on subsidies.\n\nIn August 2024, the federal cabinet placed USC on the active privatisation list and discontinued subsidies. Between December 2024 and February 2025, the number of stores was reduced from 3,742 to 1,904 and employees from 11,614 to 7,710. Despite this, projected annual losses remained around Rs8.315bn.\n\nGovernment decisions\n\nOn June 28, 2025, the prime minister considered two options: closure of USC by July 31, 2025, or continuation of operations with a Rs14bn grant to clear vendor dues and stabilise cash flow. The government opted for closure and tasked the finance minister to oversee the process, including modalities for voluntary separation schemes.\n\nBetween July 3 and 14, USC shut 1,059 rented stores and 1,230 franchise outlets. However, protests by CBA and staff unions delayed the plan. A closure package was later finalised, costing between Rs16bn and Rs19.5bn.\n\nOn July 31, USC ceased nationwide operations and shifted stock to warehouses for disposal. By the end of August, most staff will be laid off, but salaries for April (half month), July and August are still pending for 7,710 employees.\n\nAsset disposal\n\nThe finance minister directed USC to obtain fresh valuations of 21 properties to offset costs. Preliminary assessments by the State Bank of Pakistan valued them between Rs10.5bn and Rs12.6bn.\n\nHowever, several hurdles remain. Some properties belong to the defunct Roti Corporation of Pakistan and have not yet been transferred to USC, requiring additional procedures. Other properties face issues such as leasehold rights, missing completion certificates and pending commercialisation charges. The Privatisation Commission has been asked to release the original title documents.\n\nResidual staff\n\nTo complete audits, stock reconciliation, auctions and handle litigation, 832 employees will be retained until November 2025. From December 2025 to June 2026, a further reduced workforce of 326 staff will manage property disposals and residual tasks.\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:52:52.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937996/ecc-okays-rs40bn-to-wind-up-essential-items-facility-for-the-impoverished",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:21:50.000Z"
}
