{
  "title": "PSX extends losing streak for fourth session - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) extended its losing streak for a fourth consecutive session on Thursday, as investor sentiment remained subdued amid concerns over flooding in key agricultural regions and macroeconomic unce­rtainty.\n\nThe KSE-100 index settled at 147,343.51, down 150.52 points or 0.10 per cent, after recording an intraday high of 148,042 and a low of 147,210, reflecting a volatile but directionless trading day confined to an 833-point band.\n\nDespite support from select heavyweights, including Sazgar Engi­neering, Lucky Cement, and United Bank — adding a combined 206 points to the index — selling pressure in Habib Bank, Fauji Fertiliser, Bank Al-Habib, Faysal Bank, and Systems Ltd collectively shaved off 477 points. Traded volume rose 9.2pc to 935.5 million shares, while traded value climbed 14.4pc to Rs33.5bn. Pace Pakistan topped the volume chart with 71.4m shares exchanged.\n\nAli Najib, Deputy Head of Trading at Arif Habib Ltd, said the market closed on a muted note, with investors remaining cautious over the evolving flood situation in upper provinces. While current water levels stay under control, any surge could impact major crop-producing areas and disrupt food supplies.\n\nInvestor nerves were also rattled by the finance minister’s recent comments, projecting August inflation in the 4-5pc range but warning of potential fiscal strain if flood-related damages escalate. This kept bulls on the sidelines, despite selective buying attempts.\n\n“The market is currently caught in a tug-of-war between macroeconomic anxieties and sporadic value hunting,” said Ahsan Mehanti of Arif Habib Corporation. He added that fears of agricultural losses in Punjab, rising leverage, rollover pressure on futures contracts, and falling global crude oil prices contributed to the bearish close.\n\nAnalysts view the 146,500-148,000 level as a key support zone, although sustained macroeconomic and climate-related risks may continue to limit upward momentum in the near term.\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b0e90ec4ed8.gif",
  "retrievedAt": "2025-09-06T09:54:28.410Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938003/psx-extends-losing-streak-for-fourth-session",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:21:50.000Z"
}
