{
  "title": "Turkiye says it bars Israeli ships from its ports, restricting airspace - World - DAWN.COM",
  "author": null,
  "content": "Turkiye has decided to bar Israeli vessels from using its ports, forbid Turkish ships from using Israeli ports and impose restrictions on planes entering Turkish airspace, Foreign Minister Hakan Fidan said on Friday.\n\nHe provided few details in comments to parliament, which appeared to summarise steps that Turkiye has already taken against Israel over the conflict in Gaza or has started to implement.\n\nTurkiye on Friday fiercely criticised Israel’s offensive in Gaza and accused it of committing genocide in the Palestinian enclave and halted all trade with Tel Aviv, called for international measures against it and urged world powers to stop their support.\n\nSources told Reuters last week that Turkish port authorities had also started informally requiring shipping agents to provide letters declaring that vessels are not linked to Israel and not carrying military or hazardous cargo bound for the country.\n\nA source had also said that Turkish-flagged ships would be prohibited from calling at Israeli ports.\n\n“We have totally cut our trade with Israel, we have closed off our ports to Israeli ships and we are not allowing Turkish vessels to go to Israel’s ports,” Fidan told an extraordinary parliamentary session on Israel’s attacks on Gaza.\n\n“We are not allowing container ships carrying weapons and ammunition to Israel to enter our ports, and aeroplanes to go into our airspace,” he added, without giving details.\n\nThe Israeli government did not immediately comment on his remarks.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:52:06.432Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938184/turkiye-says-it-bars-israeli-ships-from-its-ports-restricting-airspace",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T15:03:09.000Z"
}
