{
  "title": "PMA alarmed over ‘severe shortage’ of life-saving drugs across country - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Medical Association (PMA) has raised alarm over “an unprecedented” and severe shortage of essential medicines across the country and warned that the crisis threatens the lives of millions of patients.\n\nAccording to the association, at least 80 important medicines are unavailable, with 25 having no substitutes. These drugs include life-saving medications for diabetes, cancer, Alzheimer’s, Parkinson’s, heart disease and psychiatric disorders.\n\n“We demand immediate and decisive action from the government to address this catastrophic situation. The medicines shortage is not a minor inconvenience. It’s a life-threatening issue for patients with chronic and critical illnesses,” the association said in a statement.\n\n“Patients are suffering from severe complications, and in many cases, their health is rapidly deteriorating. For example, the lack of long-acting injectable insulin is leading to uncontrolled blood sugar, increasing the risk of kidney failure, blindness and amputations for diabetics. Similarly, transplant patients are exposed to dangerous fungal infections due to the absence of a crucial antifungal drug,” says the statement.\n\nAt least 80 critical drugs, 25 of which have no substitute, are unavailable, says association\n\nThis crisis is also a humanitarian issue. The people of Pakistan are already facing a severe financial crisis and are under immense mental stress, it adds.\n\nThe association called upon the government to immediately approve a new, pragmatic drug pricing policy that considers production costs to ensure the financial viability of manufacturing essential medicines.\n\n“A major reason for drugs’ shortage is unchecked operation of black markets. These illegal markets are thriving across the country, causing frequent spikes in the prices of essential medicines. The price of a vial of insulin, for instance, has more than tripled in the black market, making it unaffordable for most families. We urge a nationwide crackdown on these criminal networks and strict enforcement of the law against profiteers,” the association says.\n\nIt urged the government to establish a high-powered task force comprising representatives from the health ministry, the PMA and the pharmaceutical industry. The body, the association emphasised, must be empowered to make rapid decisions on imports, licensing and production to overcome the current shortages.\n\nIt also criticised the Drug Regulatory Authority of Pakistan (Drap), which is mandated to ensure the availability of safe and effective medicines, for its failure in “carrying out its core responsibilities.”\n\n“While Drap attributes the crisis to ‘international supply chain disruptions,’ this explanation is insufficient and deflects from the critical issue of domestic policy failures,” the association said, while demanding that the authority be held accountable for its inaction and lack of foresight.\n\n“The authority must move beyond vague assurances and take concrete measures to address the crisis, including facilitating emergency imports and providing full transparency on its actions.”\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:55:35.907Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937977/pma-alarmed-over-severe-shortage-of-life-saving-drugs-across-country",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:22:08.000Z"
}
