{
  "title": "Pakistan agrees to consider ‘diplomatic relations’ with Armenia - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Friday said that Pakistan has agreed to consider establishing diplomatic relations with Armenia.\n\n“Foreign Minister of the Republic of Armenia, H.E. Ararat Mirzoyan @AraratMirzoyan and I held a cordial conversation on phone today, and agreed to consider establishing diplomatic relations between Pakistan and Armenia,” FM Dar posted on X.\n\nMeanwhile, Armenia’s Minister of Foreign Affairs Ararat Mirzoyan also posted on X, saying, “Had an important call with DPM & FM H.E. Ishaq Dar @MIshaqDar50 today. Following recent developments & in line with the vision of cooperative engagement both bilaterally & on multilateral platforms, we discussed establishment of diplomatic relations between Armenia & Pakistan.”\n\nPakistan and Armenia do not have formal diplomatic relations so far. The relationship is characterised by a regional geopolitical rivalry, with Pakistan supporting Azerbaijan against Armenia in the Nagorno-Karabakh conflict, as per the Press Information Department.\n\nEarlier this month, Prime Minister Shehbaz Sharif hailed US President Donald Trump’s peace efforts following his role in brokering the Armenia-Azerbaijan peace deal.\n\n“Pakistan welcomes the historic peace agreement signed between the Republic of Azerbaijan and the Republic of Armenia at the White House Summit under the auspices of US President Donald J Trump,” the premier wrote in a statement on X.\n\nHe congratulated both countries on “charting a course for a peaceful future for their region”, stating: “Pakistan has always stood by the brotherly nation of Azerbaijan and we stand with them at this proud moment of their history.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:52:11.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938157/pakistan-agrees-to-consider-diplomatic-relations-with-armenia",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T11:38:45.000Z"
}
