{
  "title": "Karachi: inequitable NFC impact - Pakistan - DAWN.COM",
  "author": null,
  "content": "BORN in the name of devolution, propagated as people’s rights, and celebrated as a victory for the deprived, the seventh National Finance Commission award has been nothing of the sort.\n\nIts birth in 2010 coincided with the passage of the 18th Constitutional Amendment, which also created ambiguity about the role of the local governments (LGs), paving the way for the recentralisation of powers by the provincial governments.\n\nRather than bringing governance closer to the people, the seventh NFC award and the 18th Ame­ndment took away whatever devolution of resou­rces and powers existed with the LGs at that time.\n\nIn 1999, when the federal government abolished the octroi and zila tax (OZT) collection by the LGs, it introduced a 2.5 per cent increase in the GST on goods. A transparent mechanism for direct transfers to the LGs was introduced to compensate for their revenue losses. Later, the Distribution of Revenues & Grants-in-aid Order of 2006 fixed these direct transfers at one-sixth of GST collections.\n\nHad that system continued, Karachi would have received Rs190 billion in 2024-25 as a direct transfer from GST alone (as compensation for the OZT). Other district governments in Sindh, such as those in Ghotki, Hyderabad and Thatta, would also have received direct transfers of Rs4,456 million, Rs4,486m and Rs3,618m respectively.\n\nThis right of the LGs was usurped through the seventh NFC and merged into the federal divisible pool. The provinces were allowed to use the LGs’ share as they pleased. Karachi, being the largest collector of OZT, was the worst affected, receiving meagre amounts totalling less than Rs200bn from 2010-11 to 2024-25, against its due share of Rs1,236.7bn. Karachi suffered a colossal loss of more than Rs1,000bn, or one trillion rupees, after the seventh NFC under the OZT head alone.\n\nThe seventh NFC award and 18th Amendment took away whatever devolution of resources and powers existed with the LGs.\n\n‘Democracy’, ‘devolution of power’ under the 18th Amendment and ‘equitable distribution of resources’ under the seventh NFC were meant only for those with political power in the provinces. After becoming mega-rich under the seventh NFC, the provinces were not bound to give equitable shares to the cities or districts.\n\nSindh spent 3,871bn in development funds from 2010-11 to 2024-25. Comprising 37pc of Sindh’s population, Karachi was entitled to Rs1,416.6bn, but received only Rs472bn (a deficit of Rs944.6bn). The federal government’s PSDP from 2010-11 to 2024-25 amounted to Rs8,967bn.\n\nConstituting 8.4pc of the country’s population, Karachi should have received Rs756.8bn. However, it received only Rs340bn (a deficit of Rs416.2bn). The total development deficit was Rs1,360.9bn (almost one and a half trillion rupees) from 2010-11 to 2024-25.\n\nDue to such flaws in the 18th Amendment, the Provincial Finance Commission (PFC) has been dead since 2009. The subjects of LGs have been taken back by the provincial government, including water, sewerage, solid waste management, master plan, building control, development agencies, transport/ mass transit, land control, education, health, etc. Social indicators, including education and health, have nosedived since then.\n\nThe Infrastructure Development Cess has been collected since 1994 on goods at Karachi’s ports for the development and maintenance of the infrastructure that the carriers use when they enter Karachi via national highways. Rather than creating a fund for Karachi’s infrastructure, all the collection under the IDC is merged illegally into the provincial account. Last year, it was Rs170bn. The total IDC collection, since the cess’s inception, is estimated to be around Rs1,000bn or Rs1tr.\n\nAll these amounts, ie, direct transfers from GST taken away by the seventh NFC, deficit in development funds and misappropriation of IDC come to Rs3,360bn or over Rs3tr. It is about three times the amount of the infrastructure funding gap identified by the World Bank: “Karachi requires an estimated $9-10bn [around Rs 1,050bn in 2017] to bridge its service delivery and infrastructure gaps. Without this, the city’s livability and competitiveness will continue to deteriorate, limiting its ability to drive Pakistan’s growth” (Transforming Karachi into a Liveable and Competitive Megacity, 2017, World Bank).\n\nAll these years, we believed that: “All issues of Karachi, including water supply, drainage, sewage, public transport and solid waste disposal, will be addressed at once” as the then prime minister Imran Khan said, when announcing Rs1,100bn for the Karachi Transformation Plan in September 2020.\n\nIn a similar vein, Prime Minister Shehbaz Sharif declared in April 2022 that he had “asked the relevant authorities to fully complete the K-IV project by 2024. We cannot compromise on water supply projects”. A year later, Bilawal Bhutto-Zardari said in June 2023, “I will take a personal interest in the development of the city.” Earlier, in April 2019, MQM’s Khalid Maqbool Siddiqui had said: “We are taking this case to the public … We have had enough.”\n\nIf Karachi gets just one year of its due share in provincial ADP (Rs372.7bn), federal PSDP (Rs84.4bn), IDC (Rs200bn) and a share in GST against OZT based on the 2006 formula (Rs222.7bn), the total would come to Rs879.8bn this year. It would mean complete funding for the K-IV water project (Rs73bn), the Karachi Circular Railway (Rs300bn), the two unfunded Blue and Brown BRTs (Rs180bn), sewage treatment plants at all discharge points (Rs270bn), and the complete rehabilitation of all Karachi roads.\n\nIf provided and spent honestly every year, these funds can bring Karachi closer to being a livable city in a few years, and Pakistan can regain its growth potential, which has been lost since the seventh NFC.\n\nThe nation expects the participants of the 11th NFC to work sincerely to: (i) undo the injustice of the seventh NFC and restore the one-sixth GST share as direct transfers to LGs based on the 2006 formula; (ii) provide safeguards to ensure the equitable distribution of development funds across regions; (iii) make provincial shares conditional on the operationalisation of the PFC; and (iv) provide transparent mechanisms to use IDC for the development of the port city and its freight corridor for future trade expansion.\n\nThe writer was formerly a federal secretary and caretaker provincial minister. He is currently the chairman of the Policy Research and Advisory Council.\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:52:28.679Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938034/karachi-inequitable-nfc-impact",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:22:14.000Z"
}
