{
  "title": "Lyles, Alfred seal Diamond League statement wins ahead of world championships - Sport - DAWN.COM",
  "author": null,
  "content": "Olympic 100m champions Noah Lyles and Julien Alfred will head to the world championships in Tokyo in two weeks’ time on the back of impressive victories at Thursday’s Diamond League Finals.\n\nLyles and Alfred were but two of the cream of track and field’s elite who rose to the top in a scintillating night of action at a 25,000 sell-out Letzigrund Stadium.\n\nAmerican Lyles became the first track athlete to win six Diamond League Final titles by producing a strong finish to outpace Botswana rival Letsile Tebogo for victory in the men’s 200m.\n\nLyles, the reigning world champion in both the 100 and 200, trailed Tebogo coming off the corner before reeling in his rival to cross the line in 19.74 and win by 0.02 seconds.\n\n“Six in a row, the most in track!” Lyles said.\n\n“That’s pretty cool, I’m not going to lie. I saw Letsile lean on the finish line and I leaned on the finish line but I knew I won. The most important is getting wins. I know if I panicked I was not going to win. If you are tight you are done for.”\n\nLyles had to settle for bronze in the 200 at the Paris Olympics, behind Tebogo and fellow American Kenneth Bednarek. But he said he feels ready to defend both his individual titles at the worlds in Tokyo next month.\n\n“I know I’m fit, being able to run the whole 200. I’ve got top end speed,” Lyles said.\n\nTebogo said Lyles has become humbler since he beat the American in Paris.\n\n“You have to let the legs do the talk, because the more you talk and you cannot prove it, it means you only talk, you do not prove yourself,” Tebogo said.\n\n“But for me, I do not talk, I just let the legs do its thing. I think now, Lyles is humble. He knows what can happen in this sport. He wins today, tomorrow, he can lose it. I believe since Paris, he has been humble, he has not been talking so much.”\n\nAlfred, the Olympic 100m champion, cruised to victory in 10.76 in her first race in more than a month. She had withdrawn from two Diamond League meets due to what organisers said was an injury.\n\n“I am surpassing the questions about my injuries,” Alfred said. “It is my first race back in five weeks so it is one step forward for me. I am not thinking about the time.\n\n“I feel like I want to add another gold in my collection. The season has been long, but when I compare myself now and at the beginning of the season, I am much fitter than before and also mentally, I am in the right place where I want to be.”\n\nTia Clayton of Jamaica was second in 10.84 and Britain’s Dina Asher-Smith third in 10.94.\n\nTwenty-six Diamond League champions were unveiled at the Letzigrund Stadium as quality oozed through at every turn as athletes fine-tuned preparations for the Tokyo worlds.\n\nAthletes competed for points at the 14 previous Diamond League meetings in a bid to qualify for the two-day finale in Zurich. The winners were presented with a diamond-shaped trophy and a $50,000 cheque.\n\nAmerican Christian Coleman outleaned Akani Simbine of South Africa and Jamaican Ackeem Blake on the line to win the men’s 100m in 9.97. Simbine clocked 9.98 and Blake 9.99.\n\n“This victory feels amazing. Let’s keep winning,” Coleman said. “In America we have five, six guys that should be in the final in Tokyo, so if I should get the opportunity, I want to come home with a medal.”\n\nAmerican Brittany Brown won the women’s 200m in a season’s best 22.13, while Asher-Smith took second (22.18), and Marie-Josee Ta Lou-Smith, who was disqualified from the 100 for a false start, finished third.\n\nFemke Bol of the Netherlands continued her dominance in the women’s 400 hurdles, winning in a meet record 52.18 to secure her fifth overall Diamond League title. Bol has won 30 straight Diamond League races, dating back to 2020.\n\n“Another Diamond League season undefeated,” Bol said. “It’s really cool.”\n\nNorway’s Karsten Warholm, the world record holder and three-time world champion, then nonchalantly repeated Bol’s feat, bettering his 2019 mark with a new meet record of 46.70sec.\n\n“That was my target for this meeting,“ said Warholm. “I’m on the right path for Tokyo. I have three titles as world champions and I want more. I’m greedy.”\n\nTwo loaded short hurdles races went the way of in-form American Cordell Tinch for the men over 110m and Jamaican Ackera Nugent (12.30sec) in the women’s 100m.\n\nTinch underlined his credentials as the favourite for Tokyo with a winning time of 12.92sec, equalling the meet record — and then world record — set by double Olympic champion Roger Kingdom back in 1989.\n\n“It is about consistency,” said Tinch, who set a world lead of 12.87 in May. “All I have done this year has been the next big moment, every time I get into something, it is another big moment. And I am ready for the next one. I am ready to go to Tokyo and be great.”\n\nNiels Laros pulled away over the final 100m to easily win the men’s 1,500 in a Dutch record 3:29.20, a perfect tune-up for the world championships for the 20-year-old.\n\n“I know that I have a good kick and I relied on that,” Laros said. “I am excited. I am going into Tokyo with a lot of confidence. I am dreaming about the podium.”\n\nOne of the most competitive events on the men’s circuit is the 800m, with athletes edging ever nearer to David Rudisha’s world record of 1:40.91.\n\nKenya’s Emmanuel Wanyonyi faded in the home stretch in Zurich, but just managed to hold on for victory in 1:42.37, 0.05sec ahead of Britain’s Max Burgin, with Canada’s world champion Marco Arop taking third.\n\nThere was a Swiss record of 1:55.91 for in-form Audrey Werro in the women’s 800m.\n\nBahrain’s Salwa Eid Naser trumped Marileidy Paulino for the women’s 400m title, winning in a meet record of 48.70sec, while American Jacory Patterson clocked a personal best of 43.85sec for the men’s one-lap honours.\n\nThe stand-out performance in the field was a huge, world-leading best of 91.51m by Germany’s Julian Weber in the javelin, with India’s world champion Neeraj Chopra finishing second.\n\nThere was no such joy for Japan’s reigning Olympic and world champion Haruka Kitaguchi, who managed a best of only 60.72m for sixth and last spot in a competition won by Greece’s Elina Tzengko (64.57).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/291022132649b83.webp",
  "retrievedAt": "2025-09-06T09:52:25.693Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938121/lyles-alfred-seal-diamond-league-statement-wins-ahead-of-world-championships",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T05:31:37.000Z"
}
