{
  "title": "1.5m affected as Punjab reels from ‘worst flood in decades’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PM Shehbaz, CM Maryam oversee massive relief and evacuation operation\n• Over 1,400 villages inundated; grain crops submerged\n• Chenab expected to swell to dangerous level at Head Trimmu\n• Sialkot airport shut due to floodwater\n• Minister says no compensation for structures built illegally in high-risk areas\n\nLAHORE: The Punjab government has launched one of its largest evacuation operations in recent years, as floodwaters affected over 1.46 million people across the province, with the Chenab River expected to swell to dangerous levels at Head Trimmu.\n\nExtremely high floods in the Sutlej, Ravi and Chenab rivers have also resulted in the loss of 17 lives.\n\nThe province is battling its worst flooding in four decades, which has caused havoc in hundreds of villages and submerged vital grain crops.\n\nTorrential monsoon rain and India’s release of excess water from its dams swelled the three rivers that flow into the province, forcing authorities to breach riverbanks in some places and causing flooding in more than 1,400 villages.\n\nAuthorities warned that between 700,000 and 800,000 cusecs of water could pass through the Chenab River system in the next 48 hours, threatening widespread devastation.\n\nThe relocation effort covers several districts and hundreds of towns, including Jhang, Shorkot, Khanewal, Multan, Muzaffargarh, Shujaabad, Jalalpur Pirwala and Alipur.\n\nWater levels\n\nAs of 12am on Friday, Trimmu near Jhang was in normal flow at 117,534 cubic feet per second (cusecs), but was showing a rising trend, according to the Flood Forecasting Division.\n\nThe division reported falling trends upstream. At Marala Headworks near Sialkot, the flow has dropped to 106,496 cusecs (low flood), while both Khanki and Qadirabad headworks stand at 305,436 cusecs.\n\nWhile the Ravi River has stabilised at Jassar near Narowal (95,580 cusecs), Shahdara was in “exceptionally high flood” with a water outflow of 219,770 cusecs, though the trend was steady. The next stop, Head Balloki near Pattoki, was in the “high flood” category at 114,110 cusecs and showing a rising trend.\n\nFurther downstream, Head Sidhnai near Abdul Hakeem showed a rising trend, with an inflow of 25,443 cusecs and outflow of 10,093 cusecs.\n\nOn the Sutlej River, Ganda Singh Wala near Kasur was in “exceptionally high flood” at 261,053 cusecs, Sulemanki near Bahawalnagar was in “medium flood” at 113,124 cusecs, and Head Islam was in “low flood” at 52,706 cusecs.\n\nMeanwhile on the Indus River, Tarbela Dam showed a normal flow with an outflow of 155,400 cusecs.\n\nScale of damage\n\nAccording to PDMA data, over 1.46 million people in 1,692 mouzas have been affected due to extremely high floods in the Sutlej, Ravi and Chenab rivers, with a total of 17 lives lost.\n\nThe government has evacuated over 265,000 people, of whom 1,372 were living in 355 relief camps and 6,656 were provided with medical help, whereas 90,348 people and 154,980 cattle were transported to safety.\n\nA total of 991 villages were submerged due to flooding in the Chenab River. Some 395 villages were affected by the floods in Sialkot, 127 in Jhang, 124 in Multan, 48 in Chiniot, 66 in Gujrat, 51 in Khanewal, 45 in Hafizabad, 41 in Sargodha, 35 in Mandi Bahauddin, and 19 villages in Wazirabad.\n\nDue to flooding in the Chenab, more than one million people have been evacuated and relocated to safe locations so far. Some 73,000 animals have been moved to safe locations, and 72 veterinary camps have been set up in affected districts.\n\nIn the Ravi, around 80 villages were submerged, including 75 in Narowal, four in Sheikhupura, and one in Nankana Sahib. Around 11,000 people have been evacuated and relocated to safe locations so far. Nearly 4,500 animals have been moved to safe locations. A total of 52 veterinary camps have been set up in affected districts.\n\nAs for the Sutlej River, a total of 361 villages were submerged, including 72 in Kasur, 86 in Okara, 24 in Pakpattan, 27 in Multan, 23 in Vehari, 104 in Bahawalnagar and 25 villages in Bahawalpur. Nearly 127,000 people have been evacuated and relocated to safe locations so far. A total of 70,000 animals have been moved to safe locations, whereas 90 veterinary camps have been set up.\n\n‘No compensation’\n\nInformation Minister Attaullah Tarar on Thursday lauded the exemplary coordination among all stakeholders for averting a major flood disaster in Gujranwala and Wazirabad.\n\nSpeaking to the media in Wazirabad, he assured that arrangements were in place for the provision of relief items, including tents, food and medical supplies.\n\nA survey is currently underway to estimate livestock losses, and compensation will be provided to affected individuals. However, he stressed that no compensation would be given for structures built illegally in these high-risk areas.\n\nMeanwhile, flooding also disrupted flight operations at Sialkot International Airport, where services were suspended for 24 hours on Thursday.\n\n![ .]https://www.dawn.com/news/1937816/the-million-cusec-problem)\n\nThe airport spokesperson confirmed that the runway and terminal were safe, with drainage work underway.\n\nAn official told Dawn that the last flight from Sialkot airport — a Dubai-bound Flydubai — departed on Thursday morning.\n\nPM, CM visit affected areas\n\nPrime Minister Shehbaz Sharif, accompanied by Punjab Chief Minister Maryam Nawaz Sharif, conducted an aerial survey of affected areas on Thursday. NDMA Chairman Lt Gen Inam Haider briefed the premier on the overall situation.\n\nDuring her visit to the Ravi, CM Maryam expressed regret that the crisis had been aggravated by the opening of spillways by India but noted that the province’s early warning system was functioning effectively, allowing the timely evacuation of residents.\n\nInternational support\n\nPresident Recep Tayyip Erdogan of Turkiye phoned PM Shehbaz to express solidarity and offer assistance in rescue and relief efforts.\n\n“Turkiye stands ready to help in any way possible, including during the rescue and relief efforts,” President Erdogan said, according to the PM Office.\n\nPM Shehbaz thanked him for the support, calling it reflective of the “deep-rooted fraternal ties” between the two nations.\n\nZulqernain Tahir in Lahore, Waseem Ashraf Butt in Gujrat and Syed Irfan Raza in Islamabad also contributed to this report. With input from APP and Reuters\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b0f54736011.gif",
  "retrievedAt": "2025-09-06T09:54:34.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938038/15m-affected-as-punjab-reels-from-worst-flood-in-decades",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:21:38.000Z"
}
