{
  "title": "Kabul tries to pin blame for ‘drone strike’ on Pakistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "KABUL: At least three people were killed and seven wounded in two separate incidents in Afghanistan’s Nangarhar and Khost provinces, which Afghan authorities claimed were strikes carried out by Pakistan.\n\nThere was no official word from Islamabad, and Afghan authorities did not provide any evidence of Pakistan’s involvement in the incident, either.\n\nIslamabad has repeatedly warned Kabul to prevent its soil from being used to stage attacks in Pakistan, and that it is fully capable of targeting terrorists who carry out such attacks.\n\nQuoting Afghan authorities, the Reuters news agency reported on Thursday that three children were killed and several others wounded when ‘drones’ hit the home of one Haji Naeem Khan in Khost’s Spera district, near the border with North Waziristan.\n\nAFP photographs from Spera showed people standing outside a badly damaged home in the Lahori Village.\n\nMeanwhile, Afghan officials claimed that four sons and two wives of a man named Shahsawar were among those injured when his house was destroyed in Nangarhar’s Shinwar district.\n\nThe Taliban foreign ministry said in a statement that it strongly condemns the violation of Afghanistan’s airspace, and that the bombing of civilians such irresponsible actions will inevitably have consequences.\n\nIt said that a protest note was formally handed to Pakistan’s ambassador, Ubaid-ur-Rehman Nizam­ani, during a meeting in Kabul on Thursday.\n\nPakistan has targeted terrorist camps in Afghan territory in the past: most recently in December last year, when Pakistan jets bombed positions in Pak­tika province, targeting members of the proscribed Tehreek-i-Taliban Pak­is­tan (TTP).\n\nAt the time, the Foreign Office had avoided di­r­ectly commenting on the claim, but admitted that Pa­k­­i­stani forces conducted “operations in border areas to protect the people of Pakistan from terr­­­orist groups”.\n\nA number of cross-border infiltration bids have also been foiled. In April of this year, ISPR claimed killing at least 54 terrorists who were trying to cross into North Waziristan.\n\nThen, earlier this month, at least 50 attackers were killed trying to cross from Afghanistan into Balo­chistan’s Zhob district.\n\nRecent negotiations bet­ween the TTP and tribesmen in border districts have also laid bare the reality of their chain of comm­and, as the militants rep­e­a­tedly sought time to consu­lt their leaders in Afgha­n­istan.\n\nPublished in Dawn, August 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/29075158e925685.webp",
  "retrievedAt": "2025-09-06T09:54:35.379Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938040/kabul-tries-to-pin-blame-for-drone-strike-on-pakistan",
  "dateList": "2025-08-29",
  "date_published": "2025-08-29T01:21:38.000Z"
}
