{
  "title": "Yellen raises ‘serious concern’ to China after US Treasury cyberattack - Business - DAWN.COM",
  "author": null,
  "content": "US Treasury Secretary Janet Yellen raised concerns on Monday to Beijing about “malicious cyber activity” by Chinese state-sponsored actors, days after her department reported such a breach.\n\nThe incident, which the US Treasury Department disclosed last week, happened in December and resulted in access to some of its workstations and unclassified documents.\n\nIn a virtual meeting with Chinese Vice Premier He Lifeng, Yellen “expressed serious concern about malicious cyber activity by PRC state-sponsored actors,” the Treasury said in a statement, referring to the People’s Republic of China.\n\nYellen also flagged the impact of such issues on the US-China relationship, the statement said.\n\nBut Beijing has rejected accusations that a state-sponsored actor was behind the cyberattack, calling the claims “groundless.”\n\nThe Chinese foreign ministry said previously that Beijing “has always opposed all forms of hacker attacks, and we are even more opposed to the spread of false information against China for political purposes.”\n\nYellen’s talks with He come shortly before the United States is due to see a change in leadership, with President-elect Donald Trump returning to the White House later this month.\n\nTrump’s first presidential term saw Washington engage in an escalating tariff war with Beijing, and temperatures could rise again between the world’s two biggest economies.\n\nOn Monday, Yellen warned Beijing too of “China’s non-market policies and practices and industrial overcapacity,” which would weigh on bilateral ties unless addressed, the statement said.\n\nBesides discussing macroeconomic developments in both countries, Yellen and He also took stock of efforts by economic and financial working groups that they jointly established previously.\n\n“Both sides agreed about the importance of communication and contact,” the Treasury Department said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/0711544348364d8.jpg",
  "retrievedAt": "2025-08-26T07:30:48.833Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883664/yellen-raises-serious-concern-to-china-after-us-treasury-cyberattack",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T06:57:55.000Z"
}
