{
  "title": "PM for seizing assets of human traffickers - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Asks FO to extradite Pakistanis involved in ‘heinous trade’ abroad\n• Sukkur court summons PM, other officials on Jan 15 over boat tragedy\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Monday orde­red strict legal action against hu­­man trafficking gangs in the country, including immediate confiscation of their properties and assets.\n\nThe directives came hours after an additional sessions judge in Sukkur summoned the premier, Interior Minister Mohsin Naqvi and Deputy PM Ishaq Dar on Jan 15 in connection with a recent incident in which 75 Pakistanis were killed when their boat capsized off the coast of Greece.\n\nThe judge issued the summons while hearing a petition which contended that due to the governm­e­nt’s “negligence”, unemployed Pa­­kistanis were trying to reach Eu­­r­ope through illegal means and losing their lives in the process. The petitioner demanded action aga­inst those responsible for the killings.\n\nChairing a review meeting on measures taken against human trafficking, PM Shehbaz praised the Federal Investigation Ag­­ency for taking action against government officials for their inv­olvement in the illegal practice.\n\nHe directed that strict punitive measures be taken against the facilitators, said a press release issued by the PM Office’s media wing.\n\nThe prime minister was briefed on the measures taken against human trafficking, progress on the legal actions against facilitators and about legislation for the eradication of this practice.\n\nThe premier said that prosecution process against all the individuals involved in the heinous trade should be made more effective, adding that top lawyers be appointed for prosecution in consultation with the ministry of law and justice.\n\nHe said the Foreign Office sho­uld contact the countries concerned to expedite the extradition of those Pakistanis who are running hum­an trafficking operations abroad.\n\nHe directed that the ministry of information and broadcasting, in collaboration with the ministry of interior, should launch an awareness campaign to educate the general public about using only legal channels for overseas employment.\n\nHe said the country should promote technical training institutions that could provide certified professionals to the international market in accordance with modern req­uirements, adding that the screening process for individuals travelling abroad should be made more effective at the airports.\n\nNotices\n\nEarlier, Additional Sessions-II Judge Sukkur Javed Mirani issued notices to the PM, the foreign minister, and the interior minister through the speaker of National Assembly and directed them to appear before the court on Jan 15 on a petition filed by advocate Mohammad Ali Shah.\n\nThe petitioner held the respondents responsible for the deaths of 75 Pakistanis who he said were compelled to go abroad for employment because the government had failed in fulfilling its responsibilities, adding that the government had lost its writ.\n\nThe petitioner appealed to the court that a case be registered at the Rohri police station against the government officials for their alleged negligence.\n\nHomage to Aitezaz\n\nPrime Minister Shehbaz Sharif paid tribute to Shaheed Aitezaz Hasan who had laid down his life 11 years ago to save his school and classmates from a devastating attack. Aitezaz died on Jan 6, 2014, while preventing a suicide bomber from entering a school at Hangu village. More than 2,000 students were attending classes at the time of the incident.\n\nHe noted that at a young age of 15 years, Aitezaz displayed unparalleled bravery and sacrificed his life to shield his school and classmates from a devastating attack.\n\nPublished in Dawn, January 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:31:13.750Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883552/pm-for-seizing-assets-of-human-traffickers",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T02:54:40.000Z"
}
