{
  "title": "Russia’s Orthodox patriarch, marking Christmas, says West trying to smother Russia - World - DAWN.COM",
  "author": null,
  "content": "The patriarch of Russia’s Orthodox Church, celebrating Christmas alongside Kremlin leader Vladimir Putin, said on Tuesday that the Western world despised Russia and its “alternative path of civilised development”.\n\nOrthodox Christians in Russia celebrate Christmas on January 7, according to the Julian calendar Patriarch Kirill, an enthusiastic backer of Russia’s invasion of Ukraine, blessed icons and crosses that were to be engraved with the president’s initials and sent to servicemen in the 34-month-old war in Ukraine, Russian news agencies quoted Kremlin spokesman Dmitry Peskov as saying.\n\nRussia presents a challenge to powerful countries not because of its nuclear capabilities or strength, Kirill said, according to the news agencies.\n\n“They hate us because we are offering a different, alternative path of civilised development,” he said at Christ the Saviour cathedral, which was rebuilt on the site of a swimming pool in the 1990s after Soviet dictator Josef Stalin levelled it in the 1930s.\n\nThe West was in moral collapse, he said, but Russia showed the world how to blend science, culture, education and faith.\n\n“Physically, they cannot really smother us, though they try through different types of slander and the creation of blocs of some sort intended to weaken Russia,” he said. “Nothing will work because God is with us.”\n\nPutin has looked to the church for support in Ukraine and denounced what he sees as a decline in Western morals, including the movement to protect gay and transgender rights.\n\nIn his Christmas message, the Russian president praised the church for “strengthening the institution of the family, the upbringing of young people and the affirmation of moral ideals”.\n\nBefore the cathedral ritual, Putin attended the church of St George the Victorious with veterans of the Ukraine conflict, at Moscow’s Poklonnaya Hill war memorial complex.\n\nUkraine, which has had its own independent church since 2018, has moved its Christmas celebration to December 25, though a minority has maintained allegiance to a church with historic links to Moscow.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/07122956dd43473.jpg",
  "retrievedAt": "2025-08-26T07:30:46.759Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883670/russias-orthodox-patriarch-marking-christmas-says-west-trying-to-smother-russia",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T07:34:22.000Z"
}
