{
  "title": "Last-gasp Dembele strike earns PSG French Super Cup victory over Monaco - Sport - DAWN.COM",
  "author": null,
  "content": "DOHA: A stoppage-time goal by forward Ousmane Dembele earned Paris St-Germain a 1-0 win over AS Monaco in the French Super Cup on Sunday as the Ligue 1 champions lifted the trophy for the third consecutive season.\n\nRecord 13-time winners PSG, who faced last season’s Ligue 1 runners-up Monaco after the Parisians had won both the league and the French Cup, won the competition for the 11th time in the last 12 years.\n\n“It was a great game between two teams who play good football,” said Luis Enrique. “The result is well deserved and reflects our domination … against one of the best teams in France and in Europe.”\n\nIn a lively encounter at Doha’s Stadium 974, made from 974 recycled shipping containers for the 2022 World Cup, PSG had 27 chances — nine of them on target — without breaking the deadlock.\n\nBut Dembele ensured the game did not go to penalties when he sealed the win for the French champions two minutes into injury time, netting inside the far post after Fabian Ruiz fed him with a neat pass across the face of the goal.\n\nSummer signing Desire Doue was close to giving PSG the lead in the ninth minute but hit the bar while Lee Kang-In was denied by Monaco goalkeeper Philipp Koehn with an effort from distance in first-half stoppage time.\n\nDembele and Vitinha also tested Koehn in the opening 45 minutes while Monaco’s Maghnes Akliouche and Takumi Mina­mino forced Gianluigi Donnar­umma into saves, with the PSG keeper returning to the side after recovering from a face injury.\n\n“A goal in the last minute always feels like being stabbed in the back,” said Monaco’s Austrian coach, Adi Huetter. “But being honest, PSG deserved to win. They had more chances.”\n\nNo goals were scored in the first half of a French Super Cup for the first time since 2010 when Olympique de Marseille beat PSG 5-4 on penalties after the match ended goalless.\n\nPSG, who beat Nantes and Toulouse in the previous two editions, won 4-2 at Monaco last month in Ligue 1 with Dembele scoring a second-half brace.\n\nFour-time winners Monaco last lifted the trophy in 2000. They were runners-up in 2017 and 2018, losing both times to PSG.\n\nPSG return to league action next Sunday when they host St Etienne while Monaco visit lowly Nantes on Friday.\n\nPublished in Dawn, January 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677c5fe658750.gif",
  "retrievedAt": "2025-10-12T00:44:34.843Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883570/last-gasp-dembele-strike-earns-psg-french-super-cup-victory-over-monaco",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T02:52:24.000Z"
}
