{
  "title": "Legal community opposes civilians’ trial in military courts: Hamid Khan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Senior bar leader Senator Hamid Khan on Monday said the lawyers share a unanimous opinion against trials of civilians by military courts.\n\nSpeaking at a press conference in the auditorium of the Lahore High Court Bar Association, he said that the sentences announced by the military courts in cases related to the May 9 events were unconstitutional.\n\nHe pointed out that there was already a decision by a five-judge bench of the Supreme Court on this matter.\n\nHe said the seven-member bench of the Supreme Court has deeply disappointed the legal fraternity.\n\n“By allowing the announcement of the decision by the military courts, the Supreme Court has let us down,” Senator Hamid said.\n\nHe stated that the lawyers did not consider military courts as legitimate and did not accept their decisions.\n\nHe said that the decision to allow military trial verdicts was a stain on the Supreme Court.\n\nHe said the military courts were only meant for trying military personnel and taking civilians’ trials to military courts was unconstitutional.\n\nSenator Hamid Khan further said that the cases related to the 26th Amendment should be heard by a bench comprising all judges of the Supreme Court.\n\n“We all demand that these cases be presented before a full court,” he added.\n\nHe said the so-called constitutional bench was a product of the 26th Amendment.\n\nHe claimed that the constitutional bench has no right to hear cases against the amendment.\n\nThe PTI senator also demanded the case against the 26th Amendment should be broadcast live, saying the Supreme Court proceedings have been broadcast live in the past as well.\n\nLHCBA President Asad Manzoor Butt and other leaders of the Professional group of lawyers were present at the press conference.\n\nPublished in Dawn, January 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:45:03.842Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883592/legal-community-opposes-civilians-trial-in-military-courts-hamid-khan",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T02:54:05.000Z"
}
