{
  "title": "National embarrassment - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN has utterly failed in protecting its children from polio, a preventable disease that has been eradicated nearly all over the world. With 68 cases reported in 2024 compared to Afghanistan’s 25, we find ourselves in the embarrassing position of being the worst performer among the only two countries where polio is still endemic.\n\nOfficials from Pakistan’s polio programme point to our superior reporting mechanisms and suggest that Afghanistan’s numbers may be underreported. However, this can in no way excuse our dismal performance. The fact remains that Pakistan, with its considerably stronger infrastructure and institutional capacity, should not even be in the same conversation as war-torn Afghanistan when it comes to public health metrics.\n\nPolio in our parts has spread to 83 districts. Our environmental surveillance has detected the virus in 591 sewage samples across 106 sites. These are scary numbers. Security challenges in erstwhile Fata, Karachi, and Peshawar have indeed hampered vaccination efforts.\n\nYet, this narrative of perpetual hurdles is wearing thin. Pakistan’s polio eradication programme, active since 1994, has lately been hurt by mismanagement, vaccine refusals, and gaps in immunisation coverage. Despite nine vaccination campaigns and mapping efforts, 12pc of our infected children had zero doses of the oral polio vaccine. This failure cannot solely be attributed to external factors; it underscores systemic inefficiencies and lack of political will.\n\nThe formation of a new team by Prime Minister Shehbaz Sharif, including focal person Ayesha Raza Farooq and national coordinator Anwarul Haq, suggests recognition of the crisis — but we have seen similar initiatives before with little lasting impact. The programme’s officials must adopt innovative strategies to overcome resistance, improve access, and ensure accountability at every level. The global eradication of polio is within reach, and Pakistan has no excuse to remain an outlier. It is time to end this national disgrace once and for all.\n\nPublished in Dawn, January 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:30:44.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883610/national-embarrassment",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T02:52:07.000Z"
}
