{
  "title": "Over 100,000 KP children remain unvaccinated in last polio drive - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The reluctance of parents to polio vaccination continues to haunt the future of their scions in Khyber Pakhtunkhwa as 111,118 children remained unvaccinated in the December campaign up from 95,834 in October-November drive.\n\nAccording to data compiled by officials of Emergency Operation Centre (Polio) Khyber Pakhtunkhwa, during the five-day campaign carried out from mid-December 2024 vaccinators covered 6.16 million of the total target of 6.42 million under-five children, which is 96 per cent.\n\nHowever, the main challenge of refusals continues to jeopardise the efforts meant to see the province polio-free.\n\nOf the overall unvaccinated children, 90,751 were missed because they were not present when health workers knocked at the doors of their houses while 20,367 didn’t get the drops due to reluctance of their parents.\n\nIn the door-to-door anti-polio campaign from Oct 28 to Nov 3, vaccinators missed 1.5pc of the targeted children in the province due to refusal of their parents or their unavailability at home.\n\nPeshawar records highest number of refusal cases, says report\n\nOf the total of 6.38 million targeted children in 30 districts, 78,355 missed polio vaccine due to their absence from home during the anti-polio teams’ visit while 17,479 didn’t receive the vaccine due to refusal or reluctance of their parents. Both the numbers of missed children and refusals have gone up since then.\n\nThe October-November campaign was carried out in 30 districts and the December drive was conducted in 35 districts but indicators with regard to unimmunised children remained similar.\n\nPeshawar, the epicentre of refusals, led the tally of hesitant parents with 13,072 missed and 8,029 refusal cases in December drive, which also showed that no refusal was recorded in Shangla, Malakand, Dir Upper, Chitral Lower and Upper, Buner, Kohistan Upper and Lower, Kolai Palas and Waziristan Upper.\n\nThe number of hesitant parents in Battagram, Dir Lower and Bajaur remained two each; in Haripur, Abbottabad and Torghar three each; in Orakzai four; in Swat eight; and in Mohmand 17. The number is negligible, according to the report.\n\nAfter Peshawar, Bannu recorded 4,303 refusal cases, Lakki Marwat 1,609, Mardan 1,048, Dera Ismail Khan 998, Kohat 944, Swabi 877, Charsadda 562, Nowshera 430, Karak 397, Khyber 285, Tank 151 and South Waziristan Lower 145. However, all districts reported more missed children.\n\nSources told this scribe that both missed and refusal cases were just a fraction of the whole targeted children but as per international protocol each and every child should be given two drops of vaccine in each campaign till five years.\n\nThey said that authorities were concerned about the main districts like Peshawar, Mardan, Charsadda, Bannu and Dera Ismail Khan where the virus was in circulation and could be tackled only through vaccination of the whole eligible population.\n\nEscaping vaccination through direct refusal and pretending to vaccinators that children were not available were almost same as both remained unvaccinated and exposed to being infected with poliovirus, they added.\n\nPakistan diagnosed 68 polio cases in 2024 including 20 in Khyber Pakhtunkhwa and 27 in Balochistan and in Sindh. Islamabad and Punjab recorded one infection each. Experts believe that the current year will be no exception as cases will continue to emerge.\n\nThey say that polio vaccination has become a vicious cycle as vaccinators continue to perform duty in difficult circumstances because in every campaign alleged terrorists attacked them and police personnel guarding them.\n\nIn 2024, armed motorcyclists killed 20 people and injured 53 while two others were kidnapped.\n\nThe dead included 16 policemen, three polio workers and one civilian. Since 2012, 110 people, mostly police personnel, have been killed during polio vaccination campaigns.\n\nFrightened by terrorists’ onslaught against polio teams, vaccinators don’t have the courage to force refusing parents for vaccination and try to locate missed children.\n\nSources said that the responsibility to trace missed and refusing families rested with district administrations and police, who were receiving directives from chief secretary prior to every drive to ensure immunisation of all children.\n\nThey said that so far the directives continued to fall on deaf ears and every campaign seemed a replay of the previous one.\n\nPublished in Dawn, January 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:45:17.495Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883644/over-100000-kp-children-remain-unvaccinated-in-last-polio-drive",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T03:40:25.000Z"
}
