{
  "title": "SC registrar discusses reforms with top court officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Supreme Court Registrar Muhammad Salim Khan on Monday held an interactive session with heads of different sections of the top court, as part of the ongoing judicial reforms aimed at improving service delivery and broadening access to justice.\n\nDuring the session the registrar said that Chief Justice of Pakistan Yahya Afridi, since assuming office, has prioritised brainstorming with stakeholders across the justice sector to identify and address challenges in judicial operations.\n\nThe comprehensive reform agenda aims to enhance the efficiency of the Supreme Court and elevate the judiciary’s standing on the World Justice Index. These reforms focus on digitalising the court processes, improving accessibility, streamlining procedures, ensuring accountability and fostering greater transparency in judicial operations.\n\nSher Shah, one of the participants, emphasised that reforms were designed not only to minimise the case pendency but also to ensure that litigants receive timely and effective justice.\n\nMove aimed at improving Pakistan’s ranking on World Justice Index\n\nHe underscored that litigants were the core stakeholders of the justice system and must be treated with the utmost respect to highlight the institution’s commitment to justice and reinforce its soft image.\n\nRespectful and fair treatment of litigants, he noted, is essential for restoring public trust and showcasing the judiciary as a reliable and people-centric institution, so that the institution remains committed to reinforcing its role as a symbol of justice, fairness, and respect for all.\n\nThe session also addressed key areas of reform, including advancements in IT infrastructure, improvements in case management systems, capacity building of staff, and introduction of training programmes.\n\nA notable initiative discussed was the launch of the “Online Feedback Form — Stakeholders’ Engagement for Judicial Reform”, available on the Supreme Court’s official website.\n\nThis platform invites the public to share suggestions and insights to enhance service delivery and foster meaningful engagement. The feedback form can be accessed at https://scp.gov.pk/Feedback.aspx.\n\nThe IT directorate also presented updates on progress achieved under the CJP leadership, highlighting the integration of digital technologies and the establishment of mechanisms to make the judicial process more accessible and transparent.\n\nThese initiatives align with the judiciary’s commitment to addressing systemic challenges and ensuring a responsive and trustworthy justice system.\n\nPublished in Dawn, January 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:44:48.449Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1883548/sc-registrar-discusses-reforms-with-top-court-officials",
  "dateList": "2025-01-07",
  "date_published": "2025-01-07T02:54:40.000Z"
}
