{
  "article_id": "2025-01-19_f7c628e89ba8599cca4e336db7b7acf1",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886196/pakistan-sees-gaza-ceasefire-as-first-step-towards-two-state-solution",
    "retrieved_at": "2025-08-26T07:48:05.123Z"
  },
  "metadata": {
    "title": "Pakistan sees Gaza ceasefire as first step towards two-state solution - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T02:22:48.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 519,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "UNITED NATIONS: Pakistan has hoped that the Gaza ceasefire, which begins on Sunday (today) morning, will serve as the first step towards a comprehensive solution, including a two-state solution and the establishment of an independent, sovereign Palestinian state. Pakistan also called on Israel to withdraw from Lebanese and Syrian territories, including Golan Heights, and allow UN peacekeepers to operate without obstruction to ensure compliance with international agreements for advancing sustainable peace and stability in the Middle East. Speaking in the United Nations Security Council on Friday, Ambassador Munir Akram, permanent representative of Pakistan to the UN, voiced deep concern over the increasing threats faced by peacekeepers from the UN Interim Force in Lebanon (UNIFIL) and the UN Truce Supervision Organisation (UNTSO). The Pakistani envoy spoke after two senior UN peacekeeping officials briefed the 15-member council on recent developments in Lebanon and the occupied Syrian Golan, and the challenges facing blue helmets serving there. Urges Israel to withdraw from Lebanese, Syrian territories, allow UN peacekeepers to operate freely UN Under-Secretary-General for Peace Operations Jean-Pierre Lacroix was joined by Major General Patrick Gauchat, head of UNTSO who is temporarily in charge of the UN force in the Golan, UNDOF. Mr Lacroix is currently in Lebanon, where UNIFIL monitors the Blue Line border of separation with Israel. He is there with UN Secretary-General Antonio Guterres and they visited the mission's area of operations earlier in the day. In his remarks, Ambassador Munir Akram strongly condemned Israel's ongoing aggression in Syrian territories and the illegal incursion of Israeli military forces in the separation areas established under the 1974 Disengagement Agreement. That agreement remains binding and must be upheld without exception, he said, adding that no force, except UNDOF, should have a military presence there. \"Any unilateral actions that undermine this agreement are unacceptable.\" Similarly, he said, Pakistan recognises the essential role of UNIFIL in maintaining stability in Southern Lebanon under Security Council Resolution 1701. Welcoming the cessation of hostilities arrangement between Lebanon and Israel of November 26, 2024, Ambassador Akram backed the Lebanese leadership in their commitment to fulfil this arrangement. But he voiced alarm over the continued violations of the arrangement by Israeli forces including airspace violations, airstrikes and restrictions on UNIFILs freedom of movement. \"Israel must adhere to the 60-day timeline stipulated in the arrangement and complete its withdrawal from Southern Lebanon,\" he said. Any security concerns should be promptly reported to the appropriate mechanisms, including UNIFIL, instead of resorting to unilateral violations of the arrangement and of Resolution 1701. \"The unrestricted freedom of movement of UNIFIL and full deployment of the Lebanese Armed Forces (LAF) are crucial to achieving the security and stability,\" he added. The Pakistani envoy urged the Security Council to ensure the full implementation of the mandates of both UNDOF and UNIFIL, saying they must have its sustained backing. UNDOF and UNIFIL, he said, must be equipped with adequate resources and modern technologies to enhance their operational efficiency and to ensure the safety and security of peacekeepers, which was paramount. \"Those who attack UN peacekeepers must be held accountable,\" he said. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}