{
  "article_id": "2025-01-19_e38d28b748f7a064d9b5ba9ebaedc5b9",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886313/protesters-storm-south-korea-court-after-it-extends-yoons-detention",
    "retrieved_at": "2025-08-26T07:47:35.222Z"
  },
  "metadata": {
    "title": "Protesters storm South Korea court after it extends Yoon’s detention - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T14:08:16.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/19185841a77072c.jpg",
    "categories": [],
    "word_count": 776,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Hundreds of supporters of South Korea's arrested president, Yoon Suk Yeol, stormed a court building early on Sunday after his detention was extended, smashing windows and breaking inside, an attack the country's acting leader called \"unimaginable\". Yoon on Wednesday became the first sitting South Korean president to be arrested as he faces allegations of insurrection related to his stunning, short-lived December 3 declaration of martial law that has plunged the country into political turmoil. Shortly after the court announced its decision around 3am local time on Sunday, Yoon's supporters swarmed the building, overwhelming riot police trying to keep them at bay. Protesters blasted fire extinguishers at lines of police guarding the front entrance, then flooded inside, destroying office equipment, fittings and furniture, footage showed. Police restored order a few hours later, saying they had arrested 46 protesters and vowed to track down others involved. \"The government expresses strong regret over the illegal violence ... which is unimaginable in a democratic society,\" acting President Choi Sang-mok said in a statement, adding that the authorities would step up safety measures around gatherings. Nine police officers were injured in the chaos, Yonhap news agency reported. Police were not immediately available for comment on the injured officers. About 40 people suffered minor injuries, said an emergency responder near the Seoul Western District Court. Several of those involved live-streamed the intrusion on YouTube, showing protesters trashing the court and chanting Yoon's name. Some streamers were caught by police during their broadcasts. With Yoon refusing to be questioned, investigators facing a deadline on detaining the impeached president asked the court on Friday to extend his custody. After a five-hour hearing on Saturday, which Yoon attended, a judge granted a new warrant extending Yoon's detention for up to 20 days, due to \"concern that the suspect may destroy evidence\". South Korean regulations require a suspect detained under a warrant to undergo a physical exam, have a mugshot taken and wear a prison uniform. The leader is being held in a solitary cell at the Seoul Detention Centre. The Corruption Investigation Office for High-ranking Officials (CIO), which is leading the probe, said it had called Yoon in for further questioning on Sunday afternoon but the prosecutor-turned-president again did not show up. The CIO said it would ask Yoon to come in for questioning on Monday, and forbade anyone from visiting him at the detention centre apart from his lawyers. His lawyers have argued the arrest is illegal because the warrant was issued in the wrong jurisdiction and the investigating team had no mandate for their probe. Insurrection, the crime that Yoon may be charged with, is one of the few that a South Korean president does not have immunity from and is technically punishable by death. South Korea, however, has not executed anyone in nearly 30 years. Yoon said through his lawyers he found the violent incident at court \"shocking and unfortunate\", calling on people to express their opinions peacefully. \"The president said ... he wouldn't give up and would correct the wrong, even if it took time,\" the lawyers said in a statement. Saying he understands many are feeling \"rage and unfairness\", Yoon asked police to take a \"tolerant position\". Separate from the criminal probe that sparked Sunday's chaos, the Constitutional Court is deliberating whether to permanently remove him from office, in line with parliament's December 14 impeachment, or restore his presidential powers. However, about a thousand supporters marched toward the constitutional court later on Sunday and police arrested three of them, one of whom attempted to scale the court's wall, local media said. Yoon's conservative People Power Party (PPP) called the court's decision to extend his detention on Sunday a \"great pity\". \"There's a question whether repercussions of detaining a sitting president were sufficiently considered,\" the party said. The main opposition Democratic Party said the decision was a \"cornerstone\" for rebuilding order and that \"riots\" by \"far-right\" groups would only deepen the national crisis. Support for the PPP collapsed after his martial law declaration, which he rescinded hours later in the face of a unanimous vote in parliament rejecting it. But in the turmoil since - in which the opposition-majority parliament also impeached his first replacement and investigators botched an initial attempt to arrest Yoon - the PPP's support has sharply rebounded. His party has edged ahead of the opposition Democratic Party in support - 39 per cent to 36pc - for the first time since August, a Gallup Korea poll showed on Friday. Thousands gathered for an orderly rally in support of Yoon in downtown Seoul on Sunday morning. Anti-Yoon demonstrations have also taken place across the city in recent days.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}