{
  "article_id": "2025-01-19_218231914fb8f2f8f123b7967cc1d6b9",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886322/19-suspects-held-over-missing-boys-case-in-karachis-garden-area-police",
    "retrieved_at": "2025-08-26T07:47:35.185Z"
  },
  "metadata": {
    "title": "19 suspects held over missing boys case in Karachi’s Garden area: police - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T16:38:09.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 418,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "Police on Sunday claimed to have detained more than a dozen suspects during an operation and said they had gathered evidence that could aid in recovering two children recently abducted from Karachi's Garden area. Five-year-old Aliyan, aka Ali, and six-year-old Ali Raza went missing in the Garden locality on Tuesday. According to South Deputy Inspector General Syed Asad Raza, CCTV footage revealed that they had been taken away by a man and woman riding a motorbike. Garden police registered a first information report (FIR) under Section 364A (kidnapping or abducting a person under the age of 14) of the Pakistan Penal Code (PPC) and Section 3 of the Prevention of Trafficking in Persons Act, 2018 on the complaint of Zainab Younus, Aliyan's mother. A combing and search operation led by city Senior Superintendent of Police (SSP) Arif Aziz was carried out in search of the two missing boys. Station house officers (SHOs) from Garden, Nabi Bux, Kalakot, Chakiwara, Kalri and other police stations, including lady constables and intelligence staff, joined the operation. \"During the search operation, 19 suspects were detained and shifted to a police station,\" according to the city police spokesperson. He said that the suspects were being interrogated. \"Certain evidence has been obtained, which may help the police to recover the children very soon,\" said SSP Aziz, adding that the children would be reunited with their parents at the earliest. Separately, police have announced a Rs300,000 reward for providing any information regarding the missing boys. A day ago, a seven-year-old boy who had been missing for over a week in Karachi was found dead in the underground water tank of a residential complex near his home. On January 7, Mohammed Sarim, who had gone to a madrassah for lessons near his North Karachi home, went missing and a ransom call had reportedly been made to the family for his release. However, a statement from Bilal Colony police said that Sarim's body was recovered from a water tank at Anam Apartments in New Karachi. According to an August report by Sahil, a non-governmental organisation working for children's rights, a total of 1,630 cases of child abuse were reported across the country in 2024. In the first six months of 2024, 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children, and 18 cases of child marriages were reported. The six-monthly data showed that out of the total reported cases, (962) 59 per cent of victims were girls while (668) 41pc were boys.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}