{
  "article_id": "2025-01-19_40feab4889b1a9ed5e36afac3449da50",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886163/upper-chitral-records-first-ever-licensed-hunt-of-ibex",
    "retrieved_at": "2025-08-26T07:47:52.758Z"
  },
  "metadata": {
    "title": "Upper Chitral records first-ever licensed hunt of ibex - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T02:37:06.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678c1ce0697b5.jpg",
    "categories": [],
    "word_count": 328,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "CHITRAL: Upper Chitral marked a historic milestone in the conservation of wildlife and biodiversity with the successful execution of the district's first-ever licensed Himalayan Ibex trophy hunt by a local the other day. Divisional forest officer of Chitral Gol National Park Rizwan Yousufzai told Dawn that the ibex was hunted in the rugged and unforgiving terrain on the outskirts of the majestic Udren Peak in Terich Valley in the foothold of the mighty Terich Mir peak of Hindukush system of mountains. \"This event signifies a major advancement in the region's ecotourism and conservation efforts.\" Yousufzai said that the hunt lasted for four days in temperatures plummeting to -30C, which tested the endurance and skill of the hunter in one of the world's most challenging landscapes in Terich Valley, which houses many 7,000-meter mountains. \"The successful completion of this landmark hunt not only reflects the perseverance and commitment of the hunting team but also underscores Upper Chitral's immense potential as a hub for regulated trophy hunting and conservation-driven tourism,\" Mr Yousufzai said. \"As the region celebrates this achievement, the emphasis remains on promoting sustainable practices that directly benefit wildlife preservation and uplift local communities, ensuring that future generations can continue to enjoy this natural heritage,\" he said. The divisional forest officer said that the hunting was in line with the Khyber Pakhtunkhwa Wildlife and Biodiversity Board's decision last year, allowing auction of 31 permits for ibex trophy hunting in different conservancies of Chitral. Mr Yousufzai said that the hunter Hammad Mohammad Baig - had obtained the permit in an open bidding for US 554 dollars for the trophy hunting of ibex in Terich Valley. He said the horn of the nine-year-old trophy measured 38 inches. He said that the other winners of the permits in different protected areas were reaching here to accomplish the trophy hunting, but the continued inclement weather and snowfall in the length and breadth of Chitral was deterring them. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}