{
  "article_id": "2025-01-19_3eeff2e8feb6b60b18f787d5fb6e2c01",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886172/kp-health-dept-plans-combined-bog-for-institute-of-child-health-and-fountain-house",
    "retrieved_at": "2025-08-26T07:47:52.179Z"
  },
  "metadata": {
    "title": "KP health dept plans combined BoG for Institute of Child Health and Fountain House - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T02:37:07.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 576,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR: The Khyber Pakhtunkhwa health department has intended to form a combined board of governors to manage the Khyber Institute of Child Health Peshawar and the recently-established Fountain House Hayatabad (Mental Health and Behavioural Sciences Hospital) to expedite the operations of both entities. However, the KICH and Fountain House want separate boards for themselves, citing their distinct specialties-children's health and psychiatry-as the reason. Officials told Dawn that the health department had directed the project director of the Khyber Institute of Child Health and Fountain House to file comments about the two entities being declared medical teaching institutions (MTIs) and managed through BoGs. They said that the project director noted in the response that the government had repeatedly announced that the FH would be declared MTI, while the demand of staff members had also been submitted to the government for approval. However, project director favours separate boards He also insisted that if PC-I was examined, the Fountain House would be a teaching hospital. The officials said the chief secretary had ordered the relocation of the Sarhad Hospital for Psychiatric Diseases from the premises of the Central Jail Peshawar to the Fountain House Hayatabad, with the intention to declare it a teaching hospital to upgrade its clinical services. They added that the government was supposed to declare Fountain House a MTI, set up a BoG, and notify the project director as the health facility's acting CEO or dean until the regular appointment was made to the post. The officials said that in order to develop FH a centre of excellence with modern services in all sub-specialties of mental health and to make it a regional leader in psychiatric services, the project director requested the government to speed up the process of declaring the institute a MTI and forming a separate BoG for it. They said the health department had also sought comments from the director of the Khyber Institute of Child Health about the idea of declaring the centre MTI and forming a separate BoG to make it fully operational. The officials said the establishment of KICH began more than 15 years ago but it had yet to see the light of the day. They said health adviser to the chief minister Ihtisham Ali recently promised to designate KICH as MTI and moving towards BoG formation to ensure its full-scale operations. \"Operatinalisation of an institution requires three things, including infrastructure, equipment and human resources,\" an official of the health department told Dawn. He said KICH had shown 85pc progress on the infrastructure front and 50pc on the equipment side, but it had yet to hire staff members, which appeared to be a challenge under the \"prevalent system.\" The officials said KICH required a separate BoG to become fully operational. They said the department favoured the formation of a single BoG for both KICH and FH. The officials said KICH had been governed by BoG of the MTI Hayatabad Medical Complex for the last few years but the institute was \"neglected\" as the board's focus was on the HMC's affairs. They said thehealth department was likely to send a summary on the matter to the chief minister for approval. The officials said after the approval of the summary, a search and nomination council headed by the health adviser would look for the BoG members. They said declaring both institutes MTIs would ensure speedy recruitment and procurements, which were currently lengthy and cumbersome processes. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}