{
  "article_id": "2025-01-19_686d17448c9b79f9173e340cecb36f5b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886335/moscow-accuses-ukraine-of-killing-civilians-in-occupied-border-region",
    "retrieved_at": "2025-08-26T07:47:35.173Z"
  },
  "metadata": {
    "title": "Moscow accuses Ukraine of killing civilians in occupied border region - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T17:38:40.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/192229059e1823c.jpg",
    "categories": [],
    "word_count": 333,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Russia on Sunday said it had opened a criminal investigation into allegations that Ukrainian troops killed civilians in a Russian village seized by Kyiv. Ukraine has taken dozens of border settlements under its control in the western Russian Kursk region since launching a surprise offensive there last August, and says around 2,000 civilians still live in areas under its occupation. Russia has slowly been pushing Ukraine back and has retaken a number of villages. Russia's Investigative Committee, which probes major crimes, alleged Ukrainian troops \"committed the murder of at least seven civilians, who were sheltering in the basement of a residential house\" in the village of Russkoe Porechnoye, some 20 kilometres from the border. Several Russian state media outlets had overnight published video, supplied by the army, that they said showed Russian troops discovering several dead bodies in a dark basement. AFP could not immediately verify the claims or the video, which showed troops in a dark room moving blankets and clothes off the bodies and faces of what they said were dead civilians. There has been no official response from Ukraine. In a statement, Russia's foreign ministry spokeswoman Maria Zakharova accused Ukraine of the \"cannibalistic massacre of civilians\". Both Russia and Ukraine have accused each other of having killed and targeted civilians throughout the three-year conflict. Russian forces are accused of having murdered hundreds of civilians in the Ukrainian town of Bucha, during a month-long occupation at the start of the conflict. AFP reporters were among the international journalists to witness and photograph the bodies of killed Ukrainian civilians, including some with their hands tied, in the town. The pictures and first-hand accounts from the town triggered outrage in the West and widespread condemnation of alleged Russian \"war crimes\". Moscow has rejected committing atrocities in Bucha and accused Kyiv of staging the images - a claim which has been debunked by several independent fact-checking organisations and media outlets, including AFP. Russia's army said it retook Russkoe Porechnoye from Ukrainian control last week.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}