{
  "article_id": "2025-01-19_51efb9c4e300b0d5b7d913ad6538ebd2",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886204/police-post-attacked-set-on-fire-in-turbat",
    "retrieved_at": "2025-08-26T07:48:12.406Z"
  },
  "metadata": {
    "title": "Police post attacked, set on fire in Turbat - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T02:22:33.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 363,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "GWADAR: Armed militants attacked a police post in the Turbat area of Kech district on Saturday, according to officials. The militants riding motorcycles reached the police check post on the outskirts of Turbat city and carried out the attack. The assailants took the policemen stationed at the post hostage at gunpoint. After seizing official weapons, radios and other equipment from the police officers, the militants set the check post on fire following a ransacking. \"The check post was completely gutted,\" police officials said. They added that soon after receiving information about the attack, police and Frontier Corps personnel rushed to the site, but the attackers had managed to escape. No casualties were reported in the incident. Security forces have launched a search operation in the area to apprehend the militants involved in the attack. Earlier in the first week of January, four people were killed and 32 injured in a blast targeting a bus in the suburban area of Turbat, according to the police. Rabia Tariq, public relations officer for the Balochistan inspector general of police's office, confirmed the toll to Dawn.com, adding that the nature of the blast was being assessed, but full details would be provided only after an investigation. She said as per the initial details, a bus going from Karachi to Turbat was targeted in the New Bahman area, adding that the injured were moved to a nearby hospital with five being in critical condition. Ms Tariq said a large number of police and security forces reached the scene and cordoned off the area and further investigations were being conducted regarding the blast. She said Quetta Senior Superintendent of Police (SSP) Zohaib Mohsin was also going to Turbat with his family and was caught in the blast. A statement from Balochistan government spokesperson Shahid Rind said SSP Mohsin was slightly injured, along with four of his family. Mr Rind said the bodies would be sent to their native areas after the necessary formalities and the injured were being provided medical assistance while those seriously injured were being moved to other cities. The banned militant Balochistan Liberation Army group claimed responsibility for the attack. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}