{
  "article_id": "2025-01-19_f627a6e4dc12e41d616347ceb890fd44",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886179/trump-hints-at-90-day-reprieve-for-tiktok-as-deadline-looms",
    "retrieved_at": "2025-10-12T00:55:22.380Z"
  },
  "metadata": {
    "title": "Trump hints at 90-day reprieve for TikTok as deadline looms - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T02:37:41.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 488,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "WASHINGTON: US President-elect Donald Trump on Saturday said he would \"most likely\" give TikTok a 90-day reprieve from a potential ban after he takes office on Monday, as the app with 170 million American users buzzed with nervous anticipation ahead of a shutdown set for Sunday. \"The 90-day extension is something that will be most likely done, because it's appropriate,\" Trump told NBC in an interview. \"If I decide to do that, I'll probably announce it on Monday.\" The Chinese-owned app, which has captivated nearly half of all Americans, powered small businesses and shaped online culture, said it will go dark in the US on Sunday unless President Joe Biden's administration provides assurances to companies such as Apple and Google that they will not face enforcement actions when a ban takes effect. Under a law passed last year and upheld on Friday by a unanimous Supreme Court, the platform has until Sunday to cut ties with its China-based parent ByteDance or shut down its US operation to resolve concerns it poses a threat to national security. The White House dismissed TikTok's Friday comment as a stunt, reiterating on Saturday that it was up to the incoming Trump administration to take action, increasing the likelihood of a shutdown on Sunday. \"We see no reason for TikTok or other companies to take actions in the next few days before the Trump administration takes office on Monday,\" press secretary Karine Jean-Pierre said in a statement. Users on the app were saying their goodbyes, some filming themselves frantically scrolling or sharing final secrets with their followers ahead of the ban. Does anyone know if the TikTok ban goes into effect on Sunday or if we have all of Sunday to like brain rot still? I need to plan accordingly, fitness influencer Britany Williams said in a video to her 64,000 followers. Uncertainty over the app's future had sent users - mostly younger people - scrambling to alternatives including China-based RedNote. Rivals Meta and Snap had also seen their shares rise this month ahead of the ban, as investors bet on an influx of users and ad dollars. Marketing firms reliant on TikTok have rushed to prepare contingency plans this week in what one executive described as a \"hair on fire\" moment after months of conventional wisdom saying that a solution would materialise to keep the app running. There have been signs TikTok could make a comeback under Trump, who has said he wants to pursue a \"political resolution\" of the issue and last month urged the Supreme Court to pause implementation of the ban. TikTok CEO Shou Zi Chew plans to attend the US presidential inauguration on Monday and sit among high-profile guests invited by Trump, a source said. Suitors including former Los Angeles Dodgers owner Frank McCourt have expressed interest in the fast-growing business that analysts estimate could be worth as much as $50 billion. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}