{
  "article_id": "2025-01-19_faae965c5c87a4db6388b6ad28e98a76",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886181/thousands-turn-out-at-london-pro-palestinian-rally",
    "retrieved_at": "2025-10-12T01:13:14.097Z"
  },
  "metadata": {
    "title": "Thousands turn out at London pro-Palestinian rally - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T02:37:41.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678c20a455f81.jpg",
    "categories": [],
    "word_count": 498,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "LONDON: Thousands of pro-Palestinian supporters gathered in central London on Saturday, on the eve of the start of a ceasefire between Israel and Hamas, hoping to put \"pressure\" to ensure the ceasefire holds. \"We desperately want to be optimistic\" about the truce, Sophie Mason said. \"And so we need to be out on the streets in order to make sure the ceasefire holds,\" said the 50-year-old, who is a regular at the pro-Palestinian demonstrations in the British capital. The ceasefire, which comes into effect on Sunday morning (0630 GMT), involves the release of Israeli prisoners held by Hamas and Palestinian prisoners held by Israel, Israeli withdrawal from densely populated areas of Gaza and an increase in humanitarian aid deliveries to the conflict-stricken region. The London rally took place in Whitehall, site of the main British government offices, after police rejected the route initially proposed by organisers - which the Met police said would have been in the vicinity of a synagogue. Participants held up placards bearing slogans including \"Stop arming Israel\" or \"Gaza, stop the massacre\" amid regular chants of \"From the river to the sea, Palestine will be free\". Several demonstrators arrested for breaching authorised perimeter \"Obviously, we're delighted there's a cease fire\", said Linda Plant, a retiree from London, however, pointing out that Israeli strikes on Gaza have continued since the ceasefire deal was announced. \"We need to make pressure to make that ceasefire hold\" and for international aid to reach Gaza, said Ben, 36, a workers union member who only shared his first name. For Anisah Qausher, a student, the ceasefire is \"too late, I think it's too little\". While she hopes it will bring \"temporary relief\", she believes that \"we're gonna need to do a lot more\", citing the challenge of rebuilding Gaza. Tensions flared when protesters clashed with police, with a large group breaking through a police line and marching to Trafalgar Square, defying the Metropolitan Police's strict conditions. According to a statement from the Met Police on the social media platform X, a group of demonstrators forced their way through a police line and made their way to the northwest corner of Trafalgar Square. Authorities issued a warning to the group, urging them to disperse or face arrest. \"Anyone in that group should now disperse and leave the area. Anyone remaining in breach of the conditions, or inciting further breaches, will be arrested,\" the police statement read, as per Anadolu Agency. Around 20-30 protesters were \"being arrested\" for breaching the authorised perimeter for the protest, and at least seven other protesters had already been arrested for various offences, the Metropolitan police said on X. A counter-demonstration with around 100 protesters waving Israeli flags also gathered nearby. The Met Police had earlier imposed strict conditions to prevent demonstrators from reaching key locations, including the square and the BBC's headquarters in Portland Place, both of which had been targeted by protesters in previous rallies, reported by Anadolu Agency. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}