{
  "article_id": "2025-01-19_87caabfdd29f6f7fbfd0d9c34ddfc706",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886244/lhc-district-judiciary-disposed-of-38m-cases-in-2024",
    "retrieved_at": "2025-08-26T07:47:38.783Z"
  },
  "metadata": {
    "title": "LHC, district judiciary disposed of 3.8m cases in 2024 - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T03:29:22.000Z",
    "image_url": "https://i.dawn.com/medium/2025/01/171125003c5e0e0.jpg?r=112527",
    "categories": [],
    "word_count": 209,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE: The Lahore High Court (LHC) and the district judiciary of Punjab disposed of over 3.8m cases during the year 2024, revealed a report presented before a full court meeting. LHC Chief Justice Aalia Neelum chaired the meeting attended by the judges, including Justice Ali Baqar Najafi, Justice Abid Aziz Sheikh, Justice Sadaqat Ali Khan, Justice Syed Shahbaz Ali Rizvi and Justice Faisal Zaman Khan. LHC Registrar Abher Gul Khan was also present. The meeting focused on establishing a mechanism for expeditious disposal of pending cases in the LHC principal seat and benches at Multan, Bahawalpur, and Rawalpindi, as well as the district judiciary. Several proposals were put forth to expedite the disposal of old cases, formulate a comprehensive policy to reduce the backlog of cases and ensure swift and quality justice. The report revealed that 148,453 new cases were filed at the high court's principal seat and the regional benches during 2024 while 144,122 cases were decided by the LHC during the same period. Similarly, during 2024, the district judiciary decided 36.57m cases and 37.9m new cases were filed in 2024. The LHC and its benches currently have 198,000 pending cases while the district judiciary has 1.49m pending cases, the report said. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}