{
  "article_id": "2025-01-19_a9378c648d819e792e444ae68f329cb0",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886236/justice-ayesha-malik-calls-for-strict-penalties-for-mistreating-animals",
    "retrieved_at": "2025-08-26T07:47:38.724Z"
  },
  "metadata": {
    "title": "Justice Ayesha Malik calls for strict penalties for mistreating animals - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-19T03:16:08.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 256,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "LAHORE: Justice Ayesha A. Malik of the Supreme Court has emphasised the importance of animal rights, saying when human rights receive significant attention, the rights of animals are often neglected. She called for strict penalties against those mistreating animals. Speaking at the inaugural ceremony of the International Animal and Environmental Rights Conference, Justice Malik stressed that all living beings have the right to live without fear. She highlighted the urgent need for immediate measures to protect animal rights in Pakistan, says a press release. She noted that during the Covid-19 pandemic, while efforts were made to safeguard humans, animals were largely overlooked. \"Just as humans need clean water and a healthy environment, animals also require similar conditions to thrive.\" She further emphasized the necessity of a robust legal framework to ensure the protection of animal rights across all regions. Expressing concern over the conditions of animals at Lahore's Tollinton Market, Justice Malik pointed out lack of clarity regarding laws related to stray dogs. She criticized the practice of killing dogs under the pretext of controlling rabies, asserting that rabies must be addressed through prevention rather than culling. Justice Jawad Hassan of the Lahore High Court also addressed the conference, stating that courts have begun to take a stand on animal welfare. He recalled landmark rulings by Justice Mansoor Ali Shah and Justice Athar Minallah on climate change and animal welfare. Other speakers at the conference included Lahore High Court Bar Association President Asad Manzoor Butt and event's organiser Altamush Saeed. Published in Dawn, January 19th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}