{
  "title": "Exports touch US$22.563 billion during July-May 2020-21: Razak Dawood",
  "link": "https://www.app.com.pk/national/exports-touch-us22-563-billion-during-july-may-2020-21-razak-dawood-2/",
  "date_published": "2021-06-04T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP):Adviser to the Prime Minister for Commerce and Investment Abdul Razaq Dawood Friday said the country’s exports had increased by 14 percent to US$ 22.563 billion during July to May 2020-21, as compared to the same period in FY 2019-20.\nOn a monthly comparison with last year, in May 2021 the Exports increased by 18.7 percent to US$ 1.657 billion as compared to US1.396 billion in May 2020.\nA consultative meeting was held by the Adviser to Prime Minister for Commerce and Investment Abdul Razaq Dawood to review the trade trends at the Ministry of Commerce, said a press release issued by the Ministry of Commerce here.\nHe was informed that according to the provisional (PRE-PBS) figures; monthly exports in May, 2021 have been on the higher side compared to May 2020.\nAs a result, the exports in May increased to US$1.657 Billion compared to US $1.396 Billion in May 2021. This shows an increase of 18.7 percent.\nHe was further informed that since there was an extended Eid holiday to control the spike of Coronavirus which also affected the overall exports in May.\nThe adviser was informed that geographically; in May 2021 top exports’ destinations are USA, China, UK, Afghanistan, Bangladesh, Australia, Sri Lanka, and Kazakhstan.\nHe was also informed that imports in May 2021, grew to US$2.863 billion which has mainly been due to increased imports of petroleum, palm oil, wheat, soybean, machinery, raw material and chemicals, fertilizers, and synthetic filament yarn.\nRazak Dawood paid rich tributes to Pakistan’s exporters for this performance during difficult times despite the COVID-19 rise in May and contraction in Pakistan’s major markets and the difficulties created by the recent upsurge of COVID-19.",
  "retrievedAt": "2025-08-11T20:48:42.895Z"
}
