{
  "title": "Pakistani Diaspora in developed countries can vitally contribute in country’s economy: Shibli Faraz",
  "link": "https://www.app.com.pk/national/pakistani-diaspora-in-developed-countries-can-vitally-contribute-in-countrys-economy-shibli-faraz/",
  "date_published": "2021-06-04T12:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): Federal Minister for Science and Technology Shibli Faraz Friday said the Pakistan Diaspora in the developed countries could vitally contribute towards the development of country’s economy through utilizing their expertise in the modern technologies, research and product development.\nHe made these remarks while chairing a webinar on Developing Export Economy with the help of Diaspora Community through the use of Science and Technology projects.\nThe experts of leading companies from Silicon Valley and other parts of the world participated in the webinar.\nThis webinar is the first instance where contact has been established with the leading experts of different fields from around the world.\nThe discussion revolved around the issues regarding the development in the field of Science and Technology and the way forward.\nThe federal minister said that such linkages will contribute a lot towards tapping the potential of Pakistani Diaspora which is more than willing to steer their motherland on path of progress and prosperity.\nHe stated that Prime Minister Imran Khan accords highest priority to the facilitation of the overseas community.\nHe added that we would like to utilize their expertise in strengthening the research and development structure, application of modern technologies and product development.\nHe stressed that value addition was of core importance in the export economy which can be achieved through these measures.\nShibli Faraz highlighted that the government under the leadership of Prime Minister Imran khan is making all out efforts to ensure ease of doing business in the country which is of pivotal significance in promoting economic activity in the country.\nOn the suggestion of the federal minister, it was agreed that such meetings will be regularly held on fortnightly basis in the format of area wise focused discussions.\nThe federal minister was also informed that a dedicated 200 million dollars fund will be raised by the Diaspora community out of which 100 million dollars will be for vaccines and another 100 million dollars for Research and Development.",
  "retrievedAt": "2025-08-11T20:48:46.498Z"
}
