{
  "title": "Widow sisters thank PM on getting inheritance right after 22 years",
  "link": "https://www.app.com.pk/national/widow-sisters-thank-pm-on-getting-inheritance-right-after-22-years/",
  "date_published": "2021-06-04T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 4 (APP): Like many others, the Pakistan Citizen Portal proved to be a blessing for two widow sisters too, who were able to get their right in inherited property after 22 years, following Prime Minister Imran Khan took notice.\n“Alhamdulillah, it is a happy moment for us. Despite 22 years long struggle, we were unable to get our inheritance right which we have got now due to Allah’s blessing and Prime Minister Imran Khan,” Tanzeem Akhtar and Tanwir Sohrab, both sisters, said in a video message.\nThey thanked the prime minister and prayed for his success in the future.\nMedia error: Format(s) not supported or source(s) not found\nAccording to details, both the sisters had registered a complaint at Citizen Portal for illegal occupation of their property and dispute over distribution of inherited property.\nThey complained that the Additional Deputy Commissioner Revenue had closed their complaint without hearing them.\nTaking notice of it, the prime minister directed the Chief Secretary’s Office to order a fact-finding inquiry into the matter by nominating a senior-level officer, initiate action thereafter under the rules and submit the report by May 31.\nThe complaint was initiated to the Deputy Commissioner Rawalpindi who timely forwarded it to ADC Rawalpindi. However, the ADC Office, in violation of the User’s Guidelines Manual dropped the application the same day by considering it sub judice with the court.\nThe applicants thus approached the Prime Minister’s Office to re-open the case while denying it being sub judice.\nThe PMDU brought the matter to the notice of the focal person of the Chief Secretary’s Office and DC Rawalpindi.\nSubsequent to the intervention of the two offices, the complaint was re-opened after being considered appropriate and not sub judice. The case was thereafter fixed for the next hearing on April 7, 2021, by the ADC concerned.",
  "retrievedAt": "2025-08-11T20:48:46.271Z"
}
