{
  "title": "COVID-19 claims 83 lives, infects 1,893 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-83-lives-infects-1893-more-people/",
  "date_published": "2021-06-04T11:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): The national tally on Friday of total active COVID-19 cases recorded 51,478 with 1,893 more people tested positive for the deadly virus and 3,431 people recovered from the disease during the last 24 hours.\nEighty-three corona patients have died during past 24 hours, 74 of whom were under treatment in hospital and nine out of the hospital in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in the Punjab and Sindh provinces.\nOut of the total 83 deaths occurred in the last 24 hours 34 of them had died who were under treatment on ventilators.\nThere were 3,557 Covid infected patients under treatment in critical care in various Covid dedicated healthcare facilities in past 24 hours.\nThe National Covid positivity ratio during past 24 hours was recorded 3.58 percent.\nIt may be mentioned here that the Covid positivity ratio was the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major areas including Peshawar 31 percent, Lahore 31 percent, Bahawalpur 36 percent and Multan 62 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Abbottabad 35 percent, Bahawalpur 33 percent, Karachi 35 percent and Multan 37 percent.\nAround 430 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, Azad Jammu and Kashmir (AJK) and Gilgit Baltistan (GB).\nSome 52,859 tests were conducted across the country on Thursday, including 15,741 in Sindh, 21,908 in Punjab, 8,255 in Khyber Pakhtunkhwa (KP), 4,319 in Islamabad Capital Territory (ICT), 1,655 in Balochistan, 354 in GB, and 627 in AJK.\nAround 856,005 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 928,588 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 19,388, Balochistan 25,476, GB 5,623, ICT 81,540, KP 133,746, Punjab 341,390 and Sindh 321,425.\nAbout 21,105 deaths were recorded in country since the eruption of the contagion. Around 5,089 have perished in Sindh among 14 of them died in hospital and two out of hospital on Thursday.\n10,184 in Punjab had died with 52 deaths occured in past 24 hours. 45 of them died in the hospital and seven out of the hospital.\n4,125 in KP where 12 of them died in hospital on Thursday, 763 in ICT, 287 in Balochistan among two of them died in the hospital on Thursday, 107 in GB and 550 in AJK among one of them succumbed to the deadly virus in hospital on Thursday.\nA total of 13,420,779 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 3,846 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:48:48.556Z"
}
