{
  "title": "Imran Khan urges world to join hands in saving environment for future generations",
  "link": "https://www.app.com.pk/national/pm-urges-world-to-join-hands-in-saving-environment-for-future-generations/",
  "date_published": "2021-06-04T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 4 (APP): Prime Minister Imran Khan on Friday urged the world community to come together and join hands to protect the ecosystem, increase tree-cover and save the environment for coming generations.\n“It is time for the world to come together and save the environment for our future generations,” Imran Khan said while addressing the virtual launch Gala of UN Decade on Ecosystem Restoration.\nThe Prime Minister appealing to the world community said there was a need for all to protect ecosystem, environment and stop the rapid depletion of tree-cover as well as the degradation of the environment.\nSharing Pakistan’s efforts towards improving the environment Imran Khan pointed out that Pakistan, as part of the UN Decade of Ecosystem Restoration, had so far completed the plantation of one billion trees and its target was to plant 10 billion trees.\nBesides, he said that they have also started another ambitious program of adding nine national parks to the existing 30 national parks, developed over the last 70 years, in the country.\nLIVE #APPNews : Prime Minister Imran Khan addressing virtual launch Gala of UN Decade on Ecosystem Restoration #GenerationRestoration #WorldEnvironmentDay @PakPMO  https://t.co/Xmwjx8mmvt\n— APP  (@appcsocialmedia) June 4, 2021\nThe Prime Minister said the objective of this program was to increase tree cover, protect wildlife – diminishing due to lack to habitat, increase mangroves.\nHe said that the government was also working on the restoration of wetlands by using floodwaters and replenishing the water table.\nThe Prime Minister said that as the whole process also helped in creating green jobs, the government created 80,000 jobs for women and youth during the situation of COVID-19 pandemic.\nAt a time when the people got unemployed due to lockdown situation during the COVID-19 pandemic, the government enabled them, particularly women and youth in remote areas, to generate income by growing nurseries, he added.",
  "retrievedAt": "2025-08-11T20:48:46.899Z"
}
