{
  "title": "IESCO for adopting precautionary measures in rainy season",
  "link": "https://www.app.com.pk/national/iesco-for-adopting-precautionary-measures-in-rainy-season/",
  "date_published": "2024-07-29T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): The Islamabad Electric Supply Company (IESCO) has advised power consumers to adopt precautionary measures during the rainy season as little negligence can cause fatal incidents.\n“As the incessant rains continue in the entire IESCO’s Regions, the risk of electrical accidents becomes more prominent,” IESCO Chief Director Operation Muhammad Aslam Khan told here Monday.\nThe IESCO requested esteemed customers to take necessary precautions to ensure their safety during rainfall and keep proper and safe distance from electrical installations like transformers, electric wires, poles and meters during the rain. Never touch electrical appliances with wet hands when your body is wet.\nHe said to prevent personal and property damage from short circuits, ensure old and faulty wiring is repaired. Do not keep electrical appliances on standby position, avoid ironing clothes barefoot, use rope instead of metal wire to hang clothes, and do not use metal wires for drying clothes, he said.\nHe said that never touch broken electrical wires and never tie animals to electric poles or under transformers.\nAdditionally, line staff must adhere to all safety equipment and precautionary measures during their work. IESCO helpline number 118 and complaint and monitoring cell numbers 0519252933, and 0519252934 are available 24/7 for complaints registration.\nIn case of a broken electric wire anywhere do not touch it but immediately inform the concerned IESCO office.\nMeanwhile, given the monsoon rains, IESCO field formations have also been put on high alert.\nPower continuity and timely fault and tripping clearance will be ensured. Additional transformers, meters, cables, and other materials have been provided to the field formations.\nMuhammad Aslam Khan said that all necessary measures have been taken to ensure the timely clearance of faults and tripping on the system during the rainy season.\nHe said senior officers, along with staff, will be present at the central control room at head office and such rooms have also been established at all operation circles to monitor power continuity and fault clearance across 114 grid stations and 1,344 feeders until the end of the monsoon rains.",
  "retrievedAt": "2025-08-11T04:12:12.626Z"
}
