{
  "title": "22 outlaws held, narcotics, weapons with ammunition recovered",
  "link": "https://www.app.com.pk/national/22-outlaws-held-narcotics-weapons-with-ammunition-recovered/",
  "date_published": "2024-07-29T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Islamabad Police apprehended 22 outlaws from different areas of the city during the last 24 hours beside recovering narcotics and weapons from their possession.\nA public relations officer on Monday said that in response to the special directions of Inspector General of Police (IGP) Islamabad Syed Ali Nasir Rizvi, the Islamabad Police has intensified crackdown against the criminal elements in order to eliminate the crime from the city.\nFollowing these directions, the Aabpara police team arrested two accused namely Arain Zafar and Umer Hussain and recovered  600 gram hashish and one 30 bore pistol from their possession. The Secretariat police team arrested an accused namely Ikram and recovered one dagger from his possession.\nLikewise, the Margalla police team arrested two accused namely Arshad Mehmood and Iram Shahzad and recovered two 30 bore pistols from their possession. The Sumbal police team arrested an accused namely Kashif and recovered one 30 bore pistol from his possession.\nSimilarly, the Shams Colony police team arrested two accused namely Waris and Tahir Mehmood and recovered one 30 bore pistol and one dagger from their possession. The Industrial Area police team arrested an accused namely Waseem and recovered two 30 bore pistols from their possession.\nMoreover, the Khanna police team arrested an accused namely Muhammad Babar and recovered 1000 gram heroin from his possession. The Kirpa police team arrested two accused namely Saqlain and Hassan Irshad involved in illegally filling gas cylinders.\nFurthermore, the Sihala police team arrested an accused namely Ehtisham and recovered one repeater gun from his possession. The Shahzad Town police team arrested an accused namely Ali Hamza and recovered one 30 bore pistol from his possession.\nMeanwhile, separate cases have been registered against the nabbed accused and further investigation is underway. During the crackdown against proclaimed offenders and absconders, the Islamabad Police teams arrested 08 absconders and target offenders from various areas of the city.\nDIG Islamabad Syed Ali Raza directed the police officials to further intensify the crackdown against the criminal elements. “Safety and security of the citizens is our foremost priority and no laxity will be tolerated in this regard”.\nThe citizens are urged to cooperate with police and report any suspicious activity or information through the emergency helpline “Pucar-15” or the “ICT-15” app for immediate assistance.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:12:24.574Z"
}
