{
  "title": "Deputy Prime Minister Dar meets with Secretary General Commonwealth",
  "link": "https://www.app.com.pk/national/deputy-prime-minister-dar-meets-with-secretary-general-commonwealth/",
  "date_published": "2024-07-29T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): Deputy Prime Minister and Foreign Minister Senator Ishaq Dar on Monday received Commonwealth Secretary General Patricia Scotland at the Ministry of Foreign Affairs, in the first official engagement of her five-day visit to Pakistan.\nWelcoming Secretary General Scotland to Pakistan, Deputy Prime Minister Dar reaffirmed the high importance accorded by Pakistan to the Commonwealth and its strong commitment to upholding the values and principles enshrined in the Commonwealth Charter.\nThe deputy prime minister thanked Secretary General Scotland for her climate advocacy on behalf of Pakistan following the 2022 floods that submerged two-thirds of Pakistan’s territory and inflicted economic losses of over US$30 billion. He appreciated the appointment of a dedicated Climate Finance Advisor for Pakistan by the Commonwealth to support Pakistan’s efforts for building climate resilience and disaster preparedness.\nthe deputy prime minister and the Secretary General also discussed matters related to women empowerment and youth participation in Pakistan’s development economy through education and training programmes.\nThe two sides also discussed the agenda for the Commonwealth Heads of Government Meeting (CHOGM) to be held later this year.\nThe deputy prime minister said that he looked forward to engaging with Secretary-General Scotland and his Commonwealth counterparts at the Commonwealth Foreign Affairs Ministers’ Meeting before the CHOGM.\nHe added that as a founding member, Pakistan considered the Commonwealth as an important forum for forging consensus on contemporary global and regional challenges.\nThe deputy prime minister appreciated the Commonwealth’s longstanding support for Pakistan’s economic development, democratic institutions, and rule of law.",
  "retrievedAt": "2025-08-11T04:12:06.735Z"
}
