{
  "title": "NHMP launches Radio FM 95 in 3 major cities",
  "link": "https://www.app.com.pk/national/nhmp-launches-radio-fm-95-in-3-major-cities/",
  "date_published": "2024-07-29T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP):Inspector General of National Highway and Motorway Police (NHMP) Salman Chaudhry on Monday announced launch of Radio FM 95 transmission in three major cities including Nowshera, Khyber Pakhtunkhwa, Sargodha Punjab and Jamshoro for Sindh.\nAccording to him, the initiative was a significant milestone in promoting road safety education among commuters on national highways.\nHe said since its inception, Radio FM 95 has been broadcasting informative and engaging content, including road safety tips, traffic updates, and awareness campaigns, reaching a vast audience across the regions.\nThe response has been overwhelmingly positive, with commuters appreciating the valuable information and entertainment provided by the radio station, he added.\nThe IG NHMP said that the success of Radio FM 95 could be attributed to its innovative approach to promoting road safety which included Interactive talk shows and interviews with road safety experts, public awareness campaigns on critical road safety issues,  real-time traffic updates and alerts and engaging entertainment programs to keep commuters informed and entertained during their journeys.\nHe said the NHMP’s commitment to road safety education has been further strengthened through Radio FM 95, which has become an essential tool in reducing accidents and saving lives on national highways.\nThe IG Salman Chaudhry emphasized the importance of road safety education in maintaining safe motorways and highways.\nThe FM 95 radio service provides crucial updates on weather, traffic, alternative routes, traffic rules, and accident prevention. Initially launched in Islamabad in 2015, the broadcast received positive feedback, with listeners requesting its extension to other cities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:12:26.976Z"
}
