{
  "title": "Senate Committee on Human Rights discusses meets",
  "link": "https://www.app.com.pk/national/senate-committee-on-human-rights-discusses-meets/",
  "date_published": "2024-07-29T12:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): Meeting of the Senate Standing Committee on Human Rights, chaired by Senator Samina Mumtaz Zehri, was held at the Parliament Lodges and attended by Senator Mohammad Humayun Mohmand, Senator Poonjo Bheel, Senator Dr. Zarqa Suharwardy Taimur, Senator Syed Ali Zafar, Senator Jam Saifullah Khan, the Federal Minister for Law, Justice, and Human Rights, Senator Azam Nazeer Tarar, the Secretary of the Ministry of Human Rights (MoHR), and senior officials from the affiliated Ministry.\nThe committee members engaged in a comprehensive briefing on the main functions, workings, and institutions of human rights. It was informed that there are seven human rights institutions, namely the National Commission for Human Rights, the National Commission on the Status of Women, the National Commission on the Rights of the Child, the Zainab Alert Response and Recovery Agency, the Child Protection Institute, Islamabad, the Council on the Rights of Persons with Disabilities and the Senior Citizens Council, with the latter four based in Islamabad.\nAdditionally, the meeting included a briefing on social welfare centers and development projects planned for the year 2024-25. The committee members inquired about the legal process for women in jail. The Federal Minister for Human Rights, Senator Azam Nazeer Tarar, explained that the National Commission has a mandate different from legal aid, which is not their responsibility. Legal aid is available for deserving candidates who apply for it. A district committee, headed by a designated official, ensures prisoners are kept in a reasonable environment as per jail mandates and forwards their reports to the government.\nWhile briefing on major achievements, Senator Tarar informed the members about the launch of the AWAZ app for reporting human rights violations on Android. This app is linked to the Prime Minister’s office and is available for 18 hours a day, making it convenient for citizens. MoHR officials also reported on the monitoring of human rights violation cases, the National Action Plan for Human Rights, and the awareness activities, training sessions, and workshops conducted by MoHR. Additionally, Senator Tarar provided details on the Diyat, Arsh, and Damam Fund, which is operational. It was also informed that an amount of Rs. 31,293,842 has been granted by the Federal Administrative Committee for the provision of financial assistance to release 20 convicts who were languishing in jails due to the non-payment of Diyat, Arsh, and Damam amounts.\nIn addition, the Secretary of the Ministry of Human Rights (MoHR) provided further information on the Human Rights Relief and Revolving Fund and the development of the ICT Integrated Social Welfare System (ISWS). This system aims to provide coordinated inter-agency support to Persons with Disabilities (PWDs), Senior Citizens, Transgender Persons, and Victims of Gender-Based Violence. He also mentioned the issuance of the Convention on the Rights of Persons with Disabilities (CRPD) certificates, noting that 19,000 certificates have been issued to PWDs, and efforts are underway to digitize the entire system. Currently, data for 7,000 PWDs has already been digitized in the ISWS.\nThe achievements of the National Commission on the Status of Women (NCSW), the National Commission on the Rights of the Child (NCRC), and the Child Protection Institute (CPI) were also highlighted, along with the launch of the ZARRA Alert app on Google and iOS on November 20, 2023, featuring the Zainab Alert. The chairperson of the committee emphasized the need to raise awareness about the ZARRA Alert and Awaz app, adding that the majority of people are not aware of these facilities.\nRegarding the issues of pending legislation, Senator Tarar highlighted the Pakistan Code app, which is functional and authentic for public use. The chairperson of the committee, while stressing the importance of addressing neglected and pending cases, recommended that the ministry official tackle judicial issues. She emphasized that although there is a mechanism in place, the prosecution is not doing its job, and efforts are being wasted. She lamented that our courts have been focusing increasingly on political cases rather than on legislation related to human rights and public welfare. With millions of cases pending in the High Court and Supreme Court, it is crucial to expedite these matters, as delayed justice is denied justice. Therefore, a comprehensive reform of the judiciary is needed. Senator Tarar, acknowledging the recommendations, added that major revamping and capacity building are needed, stating that poor performance constitutes misconduct.\nIn conclusion, Chairperson Senator Samina Mumtaz Zehri urged the ministry to promptly implement the recommendations of the Cabinet Committee on Enactment of Special Laws for the Provision of Speedy Justice, stressing that many pending human rights cases are being neglected. She also suggested the swift implementation of the Action Plan on Human Rights. Additionally, she recommended creating a nationwide awareness campaign on laws related to human rights, especially concerning issues like domestic violence, child abuse, and rape cases, which have become a plight for the entire nation.",
  "retrievedAt": "2025-08-11T04:12:10.229Z"
}
