{
  "title": "Information Minister condemned malicious campaign against CJP",
  "link": "https://www.app.com.pk/national/information-minister-condemned-malicious-campaign-against-cjp/",
  "date_published": "2024-07-29T11:16:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jul 29 (APP): Federal Minister for Information and Broadcasting, Attaullah Tarar here on Monday said that the state would respond to the malicious campaign against the Chief Justice of Pakistan (CJP) and no one would be allowed to decree religious notions against anyone.\nThe minister while condemning the act of threatening and instigating the people against CJP said that the state would shield against spreading hate in the country.\nIt is the responsibility of the state to impose laws in the country, he said adding that belief in the finality of the Prophet (SAAW) remained an essential part of Islam without which no one could claim to be a Muslim.\nThe minister said this in a press conference after attending a meeting with Ulema, in the Commissioner Office.\nAttaullah Tarar said that Ulema had laid down many sacrifices in Pakistan.\nThe minister highlighted that the father of the CJP was a close ally of the Quaid-e-Azam Muhammad Ali Jinnah.\nHe went on to say that Qazi Esa (father of CJP) and his father played an important role in affiliating Balochistan province with Pakistan. Therefore, without any research, no space could be given to any unauthentic claims in the society; he said adding that the campaign against the CJP was a political move which would not be allowed.\nHe termed the decree of maligning CJP as against law, morality and religion.\nResponding to media queries, the minister informed that an FIR containing terrorism and hate clauses was registered against the culprit. He said that Pakistan has condemned the Gaza massacre and voiced justice for the victims.\nThey have not cited the Gaza situation but they are running a malicious campaign, he said adding that Pakistan had raised its voice for justice for Gaza against Israel’s brutalities. Pakistan had sent relief goods to Gaza victims through six air sorties and three ships, he added.\nHanif Abbassi on the occasion said that Pakistan had a history of the pivotal role played by the youth regarding ‘Khatam-e-Nabuwat’.\nHe said, “Respect and love for the Prophet SAAW being part of our faith, did not require any degree and no one could be permitted to issue ‘fatwa’ against anyone.” He thanked the prominent Ulema and the members of the Interfaith Harmony committee for their support in this regard.",
  "retrievedAt": "2025-08-11T04:12:24.828Z"
}
