{
  "title": "Pakistan Navy alive to vigilantly guard country’s maritime interests: Naval Chief",
  "link": "https://www.app.com.pk/national/pakistan-navy-alive-to-vigilantly-guard-countrys-maritime-interests-naval-chief/",
  "date_published": "2020-09-08T07:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 08 (APP): Chief of the Naval Staff Admiral Zafar Mahmood Abbasi on Tuesday said the Pakistan Navy was alive to role to vigilantly guard the country’s maritime interests.\n“Today, Pakistan Navy being potent naval force in the region is alive to its growing responsibilities and role to vigilantly guard country’s maritime interests,” he said in his message on the 55th Pakistan Navy Day, which was marked on Tuesday, according to a press release.\nThe Naval Chief also underlined that Pakistan Navy was spearheading various initiatives to jump start Pakistan’s Blue Economy in line with the government’s renewed focus on the maritime sector and its decision to declare 2020 as the ‘Year of Blue Economy’.\nHe said 8th September marked a golden chapter in the country’s rich naval history, and rekindled hope and pride in the new generation.\nOn the day, he said,the Pakistan Navy acknowledged the sacrifices and spirit of naval heroes, who epitomized grit, courage and valour during the 1965 War.\nAdmiral Abbasi said all ranks of Pakistan Navy reiterated solidarity with their Kashmiri brethren and denounce the blatant annexation of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nThe Pakistan Navy celebrated 55th anniversary of ‘Navy Day’ to honour heroic achievements of the Ghazis and Shuhada (martyrs), who fought gallantly against a much bigger adversary with absolute courage and profound faith in Allah Amighty.\nThe Navy Day is a glorious reminiscence of daring operation ‘Somnath’, when the Pakistan Navy warships destroyed important shore installations and inflicted irreparable damage to the Indian pride. The Pakistan Navy’s lone submarine Ghazi reigned and remained unchallenged at sea throughout the war.\nThe day dawned with special prayers offered in all Naval mosques for peace and prosperity of the country and particularly for the success of Kashmir struggle. Quran Khawani was arranged for eternal peace of Shuhada of the 1965 war. Flag hoisting ceremonies were held at all naval units and establishments. Other activities of the day included Navy Day boat rallies prominently in Karachi.\nMoreover, the Pakistan Navy also released a special docufilm, ‘SURKHRU’ which features the story of its successful detection of Indian submarine and deterring it from entering into Pakistani waters on March 4, 2019.\nThe story of the docufilm demonstrates the rundown of action and sequence of the incident, and pays tribute to its heroes for displaying the true professionalism and valour in safeguarding maritime frontiers.",
  "retrievedAt": "2025-08-11T19:46:56.969Z"
}
