{
  "title": "UK pledges support for devastating floods victims in Pakistan",
  "link": "https://www.app.com.pk/national/uk-pledges-support-for-devastating-floods-victims-in-pakistan/",
  "date_published": "2020-09-08T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 08 (APP):The government of UK has pledged to provide life-saving clean water, sanitation and shelter to over 55,000 vulnerable people in Pakistan to help them recover from devastating floods.\nThe announcement was made by Lord (Tariq) Ahmad of Wimbledon, Minister of State for South Asia at the UK’s Foreign Commonwealth and Development Office, during a virtual visit to Pakistan where he also discussed with the government of Pakistan how Britain could work with them to tackle climate change.\nThe £800,000 UK aid package will be given through the National Disaster Consortium (NDC) and will provide immediate relief in rural Sindh to many who have lost their homes.\nIt comes on top of the UK’s distribution last week of emergency stocks including hygiene kits and tarpaulins to over 1,118 families in flood-affected districts of Sindh. The UK will coordinate closely with Pakistani authorities to ensure that aid gets to where it is needed most.\nLord Ahmad said “Like everyone in the UK, I have been saddened to see the heart-breaking images of the flooding in Pakistan. The UK stands with Pakistan, ready to help, as entire communities have lost their homes, livelihoods and loved ones.”\nThe UK aid announced today will ensure life-saving clean water, sanitation and shelter gets to those who need it most. The recent monsoon flooding serves as a stark reminder of how devastating natural disasters can be – and the dangers of climate change.\n“During my first virtual visit to Pakistan as a Minister of the Foreign, Commonwealth and Development Office, I also launched a year of climate action from the British High Commission ahead of COP26, which will save lives, create jobs and protect the environment.”\nBritish High Commissioner Christian Turner CMG said “Following Pakistan’s remarkable success against Covid-19, it is important that we support strengthening systems against the devastating flooding.”\nAs part of Lord Ahmad’s virtual visit, the UK urged Pakistan to work together on a green recovery from COVID-19 as part of a UK-Pakistan year of climate change action, ahead of the UN Climate Change Conference, known as COP26, in Glasgow next year.\nHe discussed with the Government of Pakistan how the UK can help the country transition to cleaner energy, emphasizing that with the UK’s world-leading expertise in this area, it can help Pakistan make the most of opportunities from the rapidly falling cost of renewables.\nThe UK has committed to ensuring every girl gets 12 years of quality education, and in Pakistan. The UK has supported nearly 8 million girls to attend primary and secondary school.\nThe minister also visited the Polio Surveillance Centre, which is also the COVID-19 surveillance centre. He met the Coordinator National Emergency Operations Centre Dr Rana Safdar who briefed the Minister on Pakistan’s response to COVID-19.",
  "retrievedAt": "2025-08-11T19:47:03.482Z"
}
