{
  "title": "Asad seeks Azerbaijan’s role to highlight Kashmir issue",
  "link": "https://www.app.com.pk/national/asad-seeks-azerbaijans-role-to-highlight-kashmir-issue/",
  "date_published": "2020-09-08T08:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 8 (APP): National Assembly Speaker Asad Qaiser Tuesday said Azerbaijan being an important country in Asia could play its role in the Organization of Islamic Cooperation (OIC) and other regional forums to raise the plight of people of Indian Illegally Occupied Kashmir.\nThe Kashmir issue was the flash point of South Asia and might trigger escalation if not peacefully settled as per aspirations of the Kashmiri people, he said during a meeting with Ambassador of Azerbaijan Ali Alizada here at the Parliament House.\nThe NA Speaker said the Indian government had stripped Kashmir of its autonomy and unique regional identity through the revocation of Article 370 and 35-A of its constitution. The decision to rescind the statute was followed by an organized brutal crackdown against innocent civilians, including women and children and crippling any sign of life in the illegally occupied Valley and other parts of the region, he added.\nAsad Qaisar said Pakistan and Azerbaijan had an enduring diplomatic relationship. The two countries not only had a similar cultural, religious, and geopolitical outlook but also similar views on regional and international issues.\nThe NA speaker underlined the need for closer inter-parliamentary relations between Pakistan and Azerbaijan. The Pak-Azerbaijan Parliamentary Friendship Group could be an apt forum to enhance those relations, he added.\nHe also stressed the need to reinvigorate Parliamentary Union of ECO member states.\nAs regards the Nagorno Karabakh conflict, the NA Speaker said Pakistan supported Azerbaijan’s fair position. Pakistan had always supported Azerbaijan’s territorial integrity in the settlement of the conflict over Nagorno Karabakh in accordance with the United Nations resolutions.\nReferring to the CPEC, he said both of the countries could acquire a bigger volume of trade in the upcoming future. The immense scope of cooperation existed between both the countries therefore Azerbaijan mission in Islamabad could play a pivotal role in this regard, he added.\nHe suggested closer interaction between commerce and agriculture committees of both the legislatures for further enhancing mutual trade and economic ties.\nAmbassador Ali Alizada said his country also attached to immense importance to its relations with Pakistan. They were steadily accelerating and both always enjoyed longstanding warm and cordial relations.\nHe said Azerbaijan wholeheartedly supported Pakistan’s stance on Kashmir. His country stood with Kashmiris in their struggle for the right of self-determination.\nHe expressed gratitude to Pakistan for extending diplomatic support on the issue of Nagorno Karabakh.\nAzerbaijan, he said, wanted to strengthen the economic and cultural ties along with mutual trade. With CPEC becoming operational, growing regional connectivity would improve which would help both the two countries cooperate in multiple sectors.\nHe agreed for enhancing parliamentary cooperation between two legislatures.",
  "retrievedAt": "2025-08-11T19:46:57.058Z"
}
