{
  "article_id": "2025-02-13_30fd8a114acdca2754f7eb4438b17d10",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-new-zealand-parliamentary-friendship-group-holds-inaugural-meeting/",
    "retrieved_at": "2025-08-27T12:42:22.869Z"
  },
  "metadata": {
    "title": "Pakistan-New Zealand Parliamentary Friendship Group holds inaugural meeting",
    "author": null,
    "date_published": "2025-02-13T14:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP):Member of the National Assembly and Convener of the Pakistan-New Zealand Parliamentary Friendship Group (PFG), Ms Sabheen Ghoury, chaired the inaugural meeting on Thursday. The parliamentary exchanges and people-to-people contacts play a vital role in strengthening bilateral ties and dispelling misconceptions about Pakistan, said the participants of the meeting. The session featured a comprehensive briefing from Dr Faisal Aziz, the Ambassador of Pakistan to New Zealand, along with senior officials from the Ministries of Foreign Affairs and Commerce. The session was attended by distinguished Members of the National Assembly (MNAs), including Anjum Aqeel Khan, Dr Shazia Sobia Aslam Soomro, Ms Shahida Rehmani, Ms Mussarat Rafique Mahesar, and Muhammad Khan Daha (virtually). The meeting began with an in-depth analysis of the current state of bilateral relations, covering diplomatic engagement and political cooperation between Pakistan and New Zealand. The discussion explored various trade and investment opportunities, with a focus on identifying key sectors for potential collaboration. The meeting addressed the existing challenges and obstacles hindering closer cooperation between the two nations, seeking practical solutions and strategies to overcome these barriers. The final segment of the meeting centered on developing a strategic action plan and key initiatives to further enhance bilateral ties. It was emphasized that parliamentary exchanges and people-to-people interactions are crucial in dispelling misconceptions about Pakistan. The session concluded with productive discussions and a renewed commitment to fostering stronger and more mutually beneficial relations between Pakistan and New Zealand.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}