{
  "article_id": "2025-02-13_62c9563d8ca7877cbf9f4644dc69c68e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-adopts-phased-approach-to-rationalize-gas-pricing-law-minister/",
    "retrieved_at": "2025-08-27T12:41:23.062Z"
  },
  "metadata": {
    "title": "Govt adopts phased approach to rationalize gas pricing: Law Minister",
    "author": null,
    "date_published": "2025-02-13T15:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 271,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP):Federal Minister for Law and Justice Senator Azam Nazeer Tarar, while responding to an attention notice in the Senate on Thursday, underscored the rationale behind the energy policies, particularly the provision of subsidized gas to industries for electricity generation. Azam Nazeer explained that the initiative was introduced during a period of acute power shortages to safeguard industrial operations from production losses and equipment damage caused by frequent outages. Azam stated that the policy of supplying gas to industries at subsidized rates was introduced during a period of severe electricity shortages to prevent production halts and equipment damage. However, with improved electricity availability and reduced industrial demand, the burden of capacity payments compensations to power producers for unused electricity has increased, contributing to higher costs for consumers. Regarding Pakistan's engagement with the International Monetary Fund (IMF), Senator Tarar noted that while there was an opportunity to conclude the program in 2016, subsequent political developments required continued negotiations under lender-imposed terms. He likened international loans to domestic bank loans, emphasizing the necessity of adhering to conditions set by creditors. In negotiations with the IMF, the government secured a conditional continuation of gas supply to captive power plants instead of an immediate termination. under the agreement, a phased imposition of a levy over 18 months has been approved to encourage industries to transition to the national grid and ensure fair gas pricing. Senator Tarar also underscored that the policy applies uniformly across all provinces, reinforcing the government's commitment to national unity and equitable economic measures. He assured that the government remains dedicated to implementing policies that foster economic stability and growth.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}