{
  "article_id": "2025-02-13_4c109ab5a498c9540ffc02dc970b2c12",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ahsan-iqbal-reviews-progress-on-seerat-center-lahore-project/",
    "retrieved_at": "2025-08-27T12:40:58.136Z"
  },
  "metadata": {
    "title": "Ahsan Iqbal reviews progress on ‘Seerat Center Lahore’ project",
    "author": null,
    "date_published": "2025-02-13T15:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 343,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP): Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Thursday chaired a meeting to review the progress of the Seerat Center Lahore project, focusing on its operational and governance plan. Addressing the meeting, he said establishment of Seerat Chairs in public sector universities was aimed at equipping future generations with modern education and imparting intellectual and ideological teachings inspired by the Seerat-un-Nabi (PBUH). He said the initiative comprised three key components including the establishment of nine Seerat Chairs in public sector universities, the launch of a world-class center for gender studies and women's rights, and the creation of an endowment fund to support research and academic activities. The minister elaborated that research under this initiative would be conducted on nine key themes derived from the life of the Holy Prophet (PBUH), including faith and sectarian harmony, leadership and governance, human rights and social justice, business and property rights, education and knowledge, sustainable development, social welfare, gender studies and global peace. He further highlighted that the Women's Seerat Center Lahore was envisioned as a Center of Excellence in Gender Studies, aimed at countering the growing disconnect of the younger generation from religion through scholarly and intellectual engagement. The objective is to empower women and girls with confidence by demonstrating that Seerat-un-Nabi (PBUH) and Islamic teachings provide guidance for a dignified and successful life. The center would particularly focus on women's rights and gender studies from an Islamic perspective, ensuring that female graduates receive a strong foundation in Islamic teachings along with expertise in modern disciplines such as economics, sociology, philosophy, political science, psychology, computer science and management. Furthermore, the center would offer postgraduate studies and specialized research on gender studies, with a focus on women's rights in Islam. It will also serve as a platform to address contemporary challenges faced by women and provide solutions based on Islamic principles. During the meeting, Ahsan Iqbal directed the relevant authorities to expedite the operationalization of Seerat Centers, ensure the recruitment of faculty, and establish well-equipped libraries to facilitate academic research.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}