{
  "article_id": "2025-02-13_c439c2ab39f6335a121e927d9be05169",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/holding-peaceful-meetings-democratic-right-of-political-parties-irfan-siddique/",
    "retrieved_at": "2025-08-27T12:41:16.918Z"
  },
  "metadata": {
    "title": "Holding peaceful meetings, democratic right of political parties; Irfan Siddique",
    "author": null,
    "date_published": "2025-02-13T16:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 227,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP):Pakistan Muslim League -Nawaz (PML-N)'s Parliamentary leader in the Senate, Senator Irfan-ul-Haque Siddiqui, on Thursday, said that every political party has the right to hold a peaceful meeting. While speaking in response to Senator Hidayatullah Khan's concerns over the non-granting of permission to organise the Awami National Party(ANP) public meeting in Rawalpindi, he said that ANP organizes peaceful meetings and does not pose any threat. \"I remember the ANP Liaquat Bagh meeting where there were many martyrs of ANP, and they took their bodies peacefully.\" He assured the House that he would talk to the Chief Minister of Punjab about the matter.Meanwhile, Minister for Law and Justice and Human Rights Senator Azam Nazeer, while explaining the meeting between the International Monetary Fund(IMF) delegation and the Chief Justice of the Supreme Court of Pakistan, told the Upper House of the Parliament that the IMF delegation did not come to discuss any case or file cases. He said that the IMF has a program related to governance and judicial reforms, and the meeting with the Chief Justice took place in this context. The Law Minister said that some circles in the country wrote letters to the IMF, which created the impression of external interference in the country's affairs, adding the meeting was not to influence any case or court decisions but to improve the judicial system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}