{
  "article_id": "2025-02-13_cfb4dd5fbf0cac4415dc0092f7458a6e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-turkiye-agree-to-deepen-multiple-cooperation-vow-efforts-for-5b-trade-volume/",
    "retrieved_at": "2025-08-27T12:42:51.279Z"
  },
  "metadata": {
    "title": "Pakistan, Turkiye agree to deepen multiple cooperation; vow efforts for $5b trade volume",
    "author": null,
    "date_published": "2025-02-13T10:30:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 698,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP): Pakistan and Turkiye on Thursday agreed to strengthen bilateral cooperation in multiple fields including defense, economy, science, education and health besides reiterating the efforts to achieve the goal of $5 billion bilateral trade volume. The bilateral ties and cooperation were discussed during the bilateral meeting between Prime Minister Shehbaz Sharif and Turkish President Recep Tayyip Erdogan and the 7th session of the High-Level Strategic Cooperation Council encompassing wide-ranging areas including trade, investment, defense, agriculture, education, energy, science & technology, and infrastructure. The two leaders, addressing a joint press stakeout, following their meeting and HLSCC meeting, told the media that they reaffirmed to fight against terrorism considering it their common enemy. Prime Minister Shehbaz Sharif, in his remarks, said that both sides discussed a range of issues including trade, strategic and defense cooperation and signed accords for multiple cooperation including for a special economic zone to be built by a Turkish firm. \"I assure you that I will work closely with you and our teams will work closely to convert these MoUs into action,\" he remarked. Welcoming the Turkish president who was visiting after five years, he said that the bilateral relations were not carved out after Pakistan's independence but went back centuries. He said during the Turkish Independence movement, the Muslims of the subcontinent, fully supported the Turkish people who also reciprocated with even greater compassion and magnanimity. Prime Minister Shehbaz said that be it was earthquake or floods, Turkiye stood by Pakistan through thick and thin and recalled President Erdogan and the First Lady's visit to Pakistan's flood-hit areas in 2010 and support for the reconstruction of houses and schools. He viewed that President Erdogan's visit would take the bilateral friendship to new heights and called him a highly respected Muslim world leader for his strong stance on issues like Gaza, Palestine and Kashmir. \"Turkiye always stood by Pakistan for the just cause of Kashmir. You always maintained your stance loud and clear. Similarly, Pakistan fully supported the cause of Northern Cyprus and stood by Turkiye in this cause in an unwavering fashion,\" he remarked. The prime minister also thanked the visiting dignitary for appreciating the sacrifices of Pakistani people and armed forces in fighting against terrorism. \"Together we will fight this menace and will not rest until we defeat this,\" he resolved and also urged the Afghan government to play its part to eliminate the menace. Turkish President Erdogan, in his remarks, said that the HLSCC was the highest-level mechanism to institutionalise the centuries-old friendship. He said in the HLSCC meeting, both sides agreed to strengthen ties and also later signed 24 MoUs and agreements to enhance cooperation in trade, water resources, agriculture, energy, culture, science, banking, education, defence and health. Besides, he said in his bilateral meeting with Prime Minister Shehbaz, they extensively discussed bilateral, regional and global developments. President Erdogan encouraged Turkish investors to engage more in Pakistan and develop flagship projects. He told the media that both sides had agreed to continue efforts to reach the goal of $5 billion trade volume and considered expanding the scope of the Goods Trade Agreement in the first stage. They observed that the military dialogue and cooperation in defence sector had grown trade and investment relations besides agreeing for the projects in procurement and joint manufacturing. Expressing gratitude to Prime Minister Shehbaz for being the first leader to visit Turkiye after the earthquake and appreciated Pakistan's sacrifices against terror and for regional stability, assuring Turkiye's unconditional support in this regard. The Turkish president said that Turkiye stood in solidarity with the Kashmiri people and sought the resolution of the issue as per UN resolutions and aspirations of the Kashmiri people. Appreciating Pakistan's support to the Northern Cyprus cause, he said that Turkiye made efforts with Pakistan at the United Nations and OIC to support the Palestinian people and would keep up efforts for the establishment of an independent Palestinian state with Quds Al Sharif as its capital. Ishtiaq Ahmed, APP's Foreign Editor, leads coverage of the Prime Minister, President and Foreign Office, bringing over 20 years of journalism experience from local and international publications - Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}