{
  "article_id": "2025-02-13_1713beefd0fbd801e57e1d0d0b146c3b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-president-erdogan-pledge-to-unlock-full-potential-of-bilateral-trade-investment/",
    "retrieved_at": "2025-08-27T12:42:13.820Z"
  },
  "metadata": {
    "title": "PM Shehbaz, President Erdogan pledge to unlock full bilateral trade, investment potential",
    "author": null,
    "date_published": "2025-02-13T13:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 457,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP): Prime Minister Shehbaz Sharif and Turkish President Recep Tayyip Erdogan on Thursday pledged to enhance the economic ties between Pakistan and Turkiye by unlocking the full potential of bilateral trade and investment. \"Our bilateral trade volume is strengthening year by year as in 2024 alone, it increased by around 30%,\" President Erdogan said while addressing the Pakistan-Turkiye Business and Investment Forum here during his two-day visit. But, he said \"We are still far behind our target of $5 billion trade volume\", expressing his confidence that all the relevant stakeholders would play a role in increasing the trade volume. He believed that expanding the scope of the preferential trade agreement between the two countries and evolving it into a free trade agreement would contribute to stable and balanced increase in the trade volume. President Erdogan also stressed the need to improve combined road and railway transportation to increase the trade activities between the two countries. \"It will be in the interest of the entire region to leverage projects that we can implement with a holistic perspective such as reactivating the Islamabad-Tehran-Istanbul trade railway line as well as initiative on the middle corridor, China Pakistan Economic Corridor (CPEC),\" he added. He emphasized that Pakistan with its dynamic population and fertile agricultural land as well as important strategic position, could become one of the major economies in future. He said Pakistan's evolving economy was expected to undertake significant projects in the coming period, particularly in the fields of energy, agriculture, healthcare, infrastructure, IT, energy, trade and investment. The Turkish president assured the businessmen of providing every kind of support to ensure that they made the most of the trade and economic opportunities between the two countries. As regards situation in Gaza, the Turkish president said \"Gaza belongs to our Gazan brothers and sisters and it will remain to be so, forever\". He said Turkiye and Pakistan will act shoulder-to-shoulder to ensure peace and prosperity of the region. PM Shehbaz said the people of Pakistan and Turkiye enjoyed brotherly relations even in the pre-partition era. He said Pakistan had always joined voice with the voice of the Turkish President for the freedom of the people of Gaza and Kashmir. He said under leadership of Erdogan and Nawaz Sharif, investment and trade ties between Turkiye and Pakistan touched highest point in the history of friendship and brotherhood. The prime minister urged the businessmen and the investors to contribute towards the government's efforts to achieve the bilateral trade volume of $5 billion. \"Today we signed various MoUs and agreements but the more important is to convert them from paper to actions. For this, I assure to extend my government's all-out support to Turkish businessmen investing in Pakistan,\" he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}