{
  "article_id": "2025-02-13_bb363981a9057a6998fdd73218f3a6cb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/chairperson-bisp-attends-roundtable-conference-on-scaling-up-family-planning-vouchers-in-pakistan/",
    "retrieved_at": "2025-08-27T12:41:19.002Z"
  },
  "metadata": {
    "title": "Chairperson BISP attends roundtable conference on Scaling Up Family Planning Vouchers in Pakistan",
    "author": null,
    "date_published": "2025-02-13T16:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 352,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 13 (APP):Chairperson of the Benazir Income Support Programme (BISP), Senator Rubina Khalid Thursday reaffirmed BISP's commitment to improve the well-being of vulnerable communities, particularly women. She was speaking during a Roundtable Conference on Scaling Up Family Planning Vouchers in Pakistan. The conference was organized by the Population Council and UK International Development to engage key public and private sector stakeholders from national and provincial levels in policy discussions aimed at expanding family planning voucher programs across Pakistan. Speaking as the chief guest, Senator Rubina Khalid emphasized BISP's dedication to empowering underprivileged women through initiatives like Benazir Kafaalat, Taleemi Wazaif, and Nashonuma, which provide financial assistance for education, maternal health, and child nutrition. She stressed the importance of enabling women to make informed choices about their education and healthcare. Highlighting BISP's vast National Socio-Economic Registry (NSER), which contains data on over 38 million households, she stated that this database is crucial in supporting various social protection programs across provinces. She also noted that NSER data had been utilized for the pilot phase of the Family Planning Voucher Program to facilitate its implementation. Discussing maternal and child health, she underscored the role of the Benazir Nashonuma initiative, which provides conditional cash assistance and nutritious food to pregnant and lactating mothers, as well as children under two years of age. Senator Rubina Khalid urged parliamentarians to actively raise awareness about population growth and resource constraints, emphasizing that quality education and healthcare are fundamental rights of every child. She assured stakeholders of BISP's continued support for maternal and child health initiatives. Other notable speakers at the event included Sindh's Provincial Minister for Health and Population Welfare, Dr Azra Fazal Pechuho; Vice Chairperson Punjab Social Protection Authority, Jahan Ara Wattoo; Country Director Population Council, Dr Zeba Sattar; and Ms. Joe Moir, Development Director (FCDO). They lauded BISP's role in using the NSER database to identify and support vulnerable women, ensuring their access to essential health and family planning services. The roundtable concluded with a strong commitment from all stakeholders to collaborate on expanding family planning programs and strengthening maternal and child healthcare services across Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}