{
  "title": "Voting for constitutional referendum continues with enthusiasm in Uzbekistan",
  "link": "https://www.app.com.pk/national/voting-for-constitutional-referendum-continuous-with-enthusiasm-in-uzbekistan/",
  "date_published": "2023-04-30T06:36:00.000Z",
  "source": "APP",
  "content": "TASHKENT, Apr 30 (APP):The voting for the constitutional referendum in Uzbekistan continues with enthusiasm on Sunday, which will be of extreme importance in determining the constitutional and political direction in the country.\nToday-on Sunday, at 08.00, the referendum of the Republic of Uzbekistan on the reform of the Constitution of the Republic began, Chairman of the Central Election Commission (CEC) of Uzbekistan, Zayniddin Nizomxodjayev said this while addressing a press conference here in (Tashkent) Uzbekistan on Sunday.\nIn accordance with the decisions of the chambers of the Oliy Majlis of the Republic of Uzbekistan, the day of the referendum was set as April 30, 2023, and one question on the ballot: “Do you accept the Constitutional Law of the Republic of Uzbekistan “On the Constitution of the Republic of Uzbekistan?” it was written, he said.\nChairman of CEC of Uzbekistan, today at 8:00 am , 10,703 referendum polling stations in our country opened their doors to citizens voting in the referendum.\nHe said that 55 referendum holding grounds established at diplomatic and other representative offices of the Republic of Uzbekistan in 39 foreign countries, including referendum precincts established in Eastern countries, have started working.\nHe informed that 19 million 722 thousand 809 voting citizens were included in the single electronic voter list.Zayniddin Nizomxodjayev said that a total of 307 thousand 895 citizens were included in the list of voters in 55 referendum precincts created abroad.\nHe said that citizens of Uzbekistan used the right to early voting for the first time in the referendum held on April 19-26th of this year. 611,320 citizens voted early.\nDuring the previous referendums, the legislation did not provide for such opportunities, he added.He said that in this year’s referendum, it was possible to monitor the voting process in real-time (online) through video cameras installed in up to two referendum precincts located in all districts and cities of Uzbekistan.\nThe voting process can be continuously monitored on the screens in the Press Center of the Central Election Commission, on the official website of saylov.uz, as well as through “Uzbekistan 24” and other TV channels of the National Television and Radio Company of Uzbekistan, he said.\nChairman CEC said a total of 383 international observers, including 184 from 14 prestigious international organizations and 199 from 45 countries, are directly monitoring the referendum.\nIn addition, a total of more than 44,000 local observers from political parties and citizens’ self-government bodies are participating in direct observation, he informed.\nHe said that a total of 964 representatives of accredited mass media, including 192 representatives from 127 foreign mass media, are directly monitoring and covering the referendum.\nHe said that it is planned to announce preliminary information on the number of people who participated in the referendum on the board in the meeting hall of the press center as of 11:00.\nIn the meantime, while briefing the media, the representatives of the Election Commission and international observers have given an encouraging note to the preparations for the Constitutional Referendum in Uzbekistan.\nAccording to international observers and international think tanks, this will be the foundation of the new Uzbekistan, which has strong possibilities of showing positive economic and political effects in the future.\nAddressing the press conference, representatives of international and local NGOs also addressed the media briefing, describing the government’s preparations for the constitutional reforms as encouraging.",
  "retrievedAt": "2025-08-11T08:24:41.437Z"
}
