{
  "title": "DHA-UAE group sign MoU for golf view villas in DHA City Karachi",
  "link": "https://www.app.com.pk/national/dha-uae-group-sign-mou-for-golf-view-villas-in-dha-city-karachi/",
  "date_published": "2023-04-30T07:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Dubai Royal Family member Sheikh Ahmed Dalmook Al Maktoum’s office has signed a Memorandum of Understanding (MOU) with the Defence Housing Association (DHA) Karachi to develop ultra-high-end golf view villas overlooking the newly built golf course in DHA City Karachi.\nThe Office of Sheikh Ahmed Dalmook Al Maktoum, a Member of the Dubai Royal Family, United Arab Emirates (UAE), signed the deal at a ceremony here witnessed by Sheikh Ahmed Dalmook Al Maktoum, President DHA and Fakhr-e-Alam, a business partner.\nThe project will be completed by AMWAJ Developers from the United Arab Emirates (UAE) on the internationally designed Nick Faldo Golf Course in DHA City Karachi.\nThe MOU outlines the commitment of providing state of the art ultra-high end ultra luxury villas as per the highest international standards, said a press release.\nAMWAJ will develop this Project, in collaboration with D.H.A. City Karachi, which will facilitate in ensuring that the development is done as per the highest international standards on the world-renowned Nick Faldo Golf Course.\nA statement said: “Having experience in completing various international commercial and infrastructure Projects globally, Sheikh Ahmed Dalmook Al Maktoum’s Office is keen on expanding its investments in Pakistan and bringing foreign direct investment.\nThe Office is also developing various other Projects in Pakistan, such as developing state of art high-end luxury apartments in partnership with D.H.A Lahore, measuring an area of 50 Kanals in Sector K of Phase 5, DHA Lahore.\nIn the energy sector, the office is developing an 1100 MW Green Hydrogen project through its London (AIM listed) company Oracle Energy. Similarly, in the health sector, the office is working closely with the Ministry of Health (MOH) to develop first-of-kind plasma products in Pakistan.\n“This strategic partnership between DHA City Karachi will pave the way for further strengthening the existing bilateral relationship between the two brotherly countries.\nThis will also help drive economic growth, create more jobs and further boost the real estate sector, especially in D.H.A. City Karachi.”",
  "retrievedAt": "2025-08-11T08:24:41.025Z"
}
