{
  "title": "New ‘rocket force’ to bolster strike capability - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakis­tan has added a new arm to its military – the Army Rocket Force Command – tasked with building a long-range conventional strike capability to give the army a sharper edge over arch-rival India.\n\nThis was announced by Prime Minister Shehbaz Sharif during a ceremony on the eve of Independence Day in Islamabad. “On this occasion, I announce the establishment of the Army Rocket Force Command,” he remarked during his speech.\n\nThe new command will be responsible for operating conventional missiles — including ballistic, cruise, and possibly even hypersonic — designed to hit targets far beyond the front lines.\n\nThe idea is to strike deep, hard, and without reaching for the nuclear trigger. PM Shehbaz described the force as “equipped with modern technology and having the capability to strike at the enemy from different directions… another milestone in strengthening our conventional warfare capacity.”\n\nThe timing of the announcement is significant. It came almost three months after a four-day war with India — the most intense in decades. It was the Pakistan Air Force’s early successes that tipped the balance in Pakistan’s favour, but the shortcoming of not having much to fire back with at longer range was noted.\n\nA senior security official, cited by Reuters, said that the “force would have its own command in the military, which would be dedicated to handling and deployment of missiles in the event of a conventional war”. “It is obvious that it is meant for India,” the official said.\n\nThe establishment of the new command seems to be the outcome of lessons learned from that conflict: to deter India in the conventional space, something more than fighters and artillery was needed.\n\n“Crucially, it is a lesson of the May war. Pakistan didn’t have much in the way of longer-range conventional rockets, which could be employed for deep targeting,” said Muhammad Faisal, a scholar at the University of Technology Sydney, who specialises in South Asia security.\n\nThis is not an entirely new concept. China has its own dedicated missile arm, the PLA Rocket Force. Iran, in recent conflicts with Israel, has used mass missile launches to swamp enemy defences. Pakistan is now joining this small club. The record of missile use is mixed. Iran’s 12-day clash with Israel in June saw plenty of missile launches and indeed caused substantive damage but failed to bring any real change in the strategic picture.\n\nIn Ukraine, Russia’s vast missile arsenal has battered cities without delivering victory. Recent conflicts have shown that drones have mattered more.\n\nThis raises the obvious question: will Pakistan’s rocket force be a real game-changer, or just an expensive new project?\n\nLong-range precision missiles aren’t cheap to build, buy, or maintain. Similarly, its place in Pakistan’s broader military doctrine also remains unclear.\n\n“It is a significant development and could lead to changes in our military doctrine and force posture. Since not much is available in the public domain about the role of this new entity and the employment concept, it may be premature to speculate about its effectiveness against the Indian threat,” said Dr Adil Sultan, dean of the Faculty of Aerospace and Strategic Studies (FASS) at Air University.\n\nPublished in Dawn, August 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/15094602c126852.jpg",
  "retrievedAt": "2025-08-25T19:43:32.558Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930990/new-rocket-force-to-bolster-strike-capability",
  "dateList": "2025-02-18",
  "date_published": "2025-08-15T02:28:41.000Z"
}
