{
  "title": "LHC chief justice dismayed at lack of confidentiality for rape victims - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Lahore High Court Chief Justice Aalia Neelum on Monday deplored that no effective measures have been taken to keep the victims’ identity confidential in sexual assault cases and stressed that protecting them was of utmost importance.\n\nShe observed that the preservation of evidence was crucial, and video/audio recordings and other evidences must be legally secured under the Qanun-i-Shahadat (the law of evidence).\n\nThe chief justice was heading a full bench seized with a matter relating to the implementation of Anti-Rape Act 2021. Justice Farooq Haider and Justice Ali Zia Bajwa were the other members of the bench.\n\nPunjab Prosecutor General Syed Farhad Ali Shah, acting Advocate General of Punjab Baleeghur Rehman Chaudhry and Inspector General of Police Dr Usman Anwar appeared before the bench.\n\nThe advocate general submitted a report on the implementation of the law, pointing out that it was a federal law with certain gaps.\n\nAt this, Chief Justice Neelum remarked, “This is like putting the court and the nation on a wild goose chase.”\n\nAs she inquired why the attorney general was absent, a deputy attorney general explained that the principal law officer was occupied with engagements in Islamabad.\n\nThe bench observed that it was a highly significant matter and the attorney general’s presence was necessary.\n\nThe bench further remarked that the issue concerns the entire nation, not just an individual.\n\nIt regretted that the anti-rape law was enacted in 2021 but serious shortcomings remain in its implementation.\n\nThe IGP stated that there had been 5,000 cases of abduction and 7,000 ‘honour killings’ of women.\n\nHe said the police investigators visit crime scenes and compile reports, while special officers are being recruited and trained to improve investigation. However, some measures required approval from the cabinet, he added.\n\nThe bench adjourned the hearing for a date to be fixed later by the office and sought personal appearance of the attorney general.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:42:46.089Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892633/lhc-chief-justice-dismayed-at-lack-of-confidentiality-for-rape-victims",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:13:55.000Z"
}
