{
  "title": "War-weary Gazans reel from ‘500 days of humiliation’ - World - DAWN.COM",
  "author": null,
  "content": "GAZA CITY: For 500 days since an unprecedented Hamas raid on Israel triggered the Gaza Strip’s deadliest conflict, Mohammed Abu Mursa has grappled with “humiliation, suffering and bloodshed” in his fight for survival.\n\nAbu Mursa and his family have been displaced more than a dozen times since the war began, moving from place to place across the Palestinian territory in a desperate attempt to stay safe, he said.\n\n“It’s been 500 days of humiliation, suffering and bloodshed,” said the resident of northern Gaza, finally able to return home after a fragile ceasefire took hold on Jan 19.\n\n“I just hope the ceasefire holds,” he added. “There is only destruction around us.” Like the Abu Mursa family, nearly all of Gaza’s 2.4 million residents have been displaced at least once during the conflict.\n\nMore than 16 months later after the Israel-Hamas conflict broke out, vast swathes of the territory are in ruins. The Israeli military campaign by land, air and sea has killed at least 48,284 people in Gaza, the majority of them civilians, according to the Hamas-run territory’s health ministry, whose figures the UN considers reliable.\n\nKhadija Hammou, 56, said that the 500 days since the conflict began have felt like “500 years”. “There is no tent to shelter us, no water to drink or bathe in, no means of survival in Gaza,” she said. “Everywhere we go… there is only suffering.”\n\nTo Hammou, the conflict has “revealed to the world that Israel is committing massacres and that our people are the occupied and the oppressed”.\n\n‘Tired’\n\nDespite the ceasefire and the diplomatic efforts to extend it, Gazans are concerned that the violence could reignite. “Our fear is that the war will resume” and the world will fail to stop Israel’s actions, said Ayman al-Jamali, 39, a resident of the Tal al-Hawa neighbourhood in Gaza City.\n\n“The world watches the massacres unfold without doing anything,” he said.\n\nJamali accused Israeli Prime Minister Benjamin Netanyahu of “seeking any opportunity to destroy Gaza”, which for years has been under a crippling Israeli-led blockade and, during the current conflict, a siege.\n\nEarlier on Monday, Netanyahu said he was “committed” to a plan proposed by US President Donald Trump for his government to take control of Gaza and expel its inhabitants to neighbouring Egypt or Jordan. The proposal, which experts say would violate international law, has triggered widespread outrage.\n\n“I’ve never travelled in my life, and I don’t intend to leave the country unless they kill us,” said Jamali, who now lives in a tent he set up amid the rubble of his former home. “My tent is a witness to Israel’s genocide.”\n\nExhausted by the conflict, Mohammed Skik, 47, fears his family may have to live in a tent for years to come.\n\n“Enough with this destruction and humiliation… We are tired. I just hope our children can live like children in the rest of the world,” he said.\n\nThe United Nations has said more than $53 billion will be required to rebuild Gaza and end the “humanitarian catastrophe” that has gripped the territory.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b3d00886565.gif",
  "retrievedAt": "2025-10-12T01:31:12.021Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892679/war-weary-gazans-reel-from-500-days-of-humiliation",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:12:40.000Z"
}
