{
  "title": "Balochistan govt launches plan to train young pilots - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan government has launched a ‘Youth Pilot Development Programme (YPDP-1)’ to provide training to young people in the aviation sector so that they could join national and international aviation industry.\n\nWomen will be encouraged to join the programme, while children of martyrs will also be given opportunities.\n\nProvincial government spokesman Shahid Rind disclosed this while speaking at a presser along with Captain Ali Azad, Director General of the Aviation Wing of Balochistan.\n\nIn the first phase, Mr Rind said, one female candidate from Gilgit-Baltistan has been included in the programme.\n\nHe said the YPDP-1 would be a first of its kind by any provincial government in the country and serve as a milestone in promoting aviation in the region.\n\nGiving details of the programme, he said young pilots will receive an additional 200 flight hours of training, which will greatly enhance their practical skills.\n\nMr Rind expressed the hope that YPDP-1 will play a key role in fostering the growth of aviation in Balochistan, helping the youth compete on a global scale and access employment opportunities both nationally and internationally.\n\nThe spokesman said the government is committed to creating more opportunities in the aviation sector, opening new horizons for the youth.\n\nHe mentioned that under the guidance of Chief Minister Mir Sarfraz Bugti, the implementation of the programme is being started immediately.\n\nMr Azad shed light on the significance and technical details of the programme.\n\nAlso present on the occasion were trainee pilots who described the initiative as an invaluable opportunity for the youth of Balochistan.\n\nMr Rind said the programme aims to establish Balochistan as a hub in the aviation industry and added that it would not incur additional costs for the government, as available resources will be efficiently utilised to run it.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:31:07.234Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892693/balochistan-govt-launches-plan-to-train-young-pilots",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:12:25.000Z"
}
