{
  "title": "NA takes up delay in construction of two roads in capital’s rural areas - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Lawmakers on Monday expressed concerns over the inordinate delay in the construction of two roads in the rural areas of Islamabad as Prime Minister Shehbaz Sharif was likely to inaugurate Jinnah Avenue Interchange on Tuesday (today).\n\nMNAs Nuzhat Sadiq and Asiya Naz Tanoli moved a calling attention notice, which was taken up by the National Assembly on Monday, regarding the inordinate delay in the construction of two roads in the rural areas. The lawmakers invited the attention of the interior minister “to a matter of urgent public importance regarding poor condition of roads in rural areas particularly Jagiot and Sikander-i-Azam roads, causing grave concerns amongst the public.”\n\nAfter discussion in the house, the matter was referred to the standing committee.\n\nMNA Nuzhat Sadiq said Jagiot road catering to around 50,000 people was in a dilapidated condition, causing problems for commuters including schoolchildren. The MNA said the road was the main link between rural and urban areas as it connected Alipur Farash with Jagiot. The movers of the calling attention notice said construction work on Sikander-i-Azam road (from Shah Allah Ditta to KP area in Margalla Hills) was inaugurated by Prime Minister Shehbaz Sharif in 2023, but later the work was halted.\n\nOn calling attention notice, suspension of work on Jagiot and Sikander-i-Azam roads referred to standing committee\n\nMNA Tanoli said both the roads should be completed as soon as possible, adding rural areas of Islamabad had been facing shortage of basic necessities, including a proper sewerage system. She said the matter should be referred to the standing committee for further discussion to which the chair agreed.\n\nEarlier, speaking on behalf of the interior minister, Information Minister Attaullah Tarar told the house that 52pc work on Sikander-i-Azam road, which was launched in 2023, had been completed, but due to shortage of funds work at the site was halted. He said now the project would be completed on priority basis.\n\nAbout the Jagiot road, Mr Tarar said 22pc work on it was already completed and by the end of the current fiscal year the project would be ready.\n\nIn June 2023, Mr Sharif (during his first stint) had inaugurated the Sikander-i-Azam road (also known as Alexander road). The project was started by the CDA, but later work on it was halted halfway. The road is meant to link Islamabad with Haripur. There is a well located on the boundary of Islamabad and Haripur, known as Alexander’s well. That’s why the road is popularly known as Alexander Road.\n\nAccording to CDA, the widening and overhauling of the existing Shah Allah Ditta to Kenthla road was to be carried out. The 7.5km road will be constructed up to Kenthla where it could be connected with Haripur in future.\n\nInauguration of Jinnah Avenue Interchange\n\nMeanwhile, sources said the F-8 Jinnah Avenue project was ready for inauguration and PM Shehbaz Sharif was likely to open it on Tuesday (today).\n\n“Yes, as per initial confirmation PM is all set to inaugurate this interchange on Tuesday,” said an officer of the CDA.\n\nThe project worth Rs4.1 billion was started on November 5 with the completion target of three months.\n\nThe project had two components - an underpass (which was completed in 42 days) and a flyover, which has been constructed in 90 days.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b39680a1f2d.jpg",
  "retrievedAt": "2025-10-12T01:31:10.549Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892613/na-takes-up-delay-in-construction-of-two-roads-in-capitals-rural-areas",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:13:43.000Z"
}
