{
  "title": "More than cricket as Pakistan hosts first major tournament in 29 years - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan will host a first major cricket tournament in almost three decades from Wednesday in a move hailed as a landmark just a few years after the country was off-limits because of security fears.\n\nStaging the Champions Trophy in three cities over the next two-and-a-half weeks will be a huge boost to the nation’s reputation if authorities can pull it off smoothly and safely.\n\n“Convincing the world that Pakistan is a safe country and that it is capable of delivering such a global event from an administration point of view took serious hard work and convincing,” former Pakistan Cricket Board (PCB) chairman Ramiz Raja said.\n\n“The world eventually understood our viewpoint,” said Raja, under whose tenure the event was awarded in 2021.\n\nThe build-up has not been without problems after neighbours and arch-rivals India refused to play in Pakistan over long-standing political tensions.\n\nA powerhouse of the sport on and off the pitch, India will instead play their matches in Dubai, but the other seven countries will be based in Pakistan.\n\nThe country has stepped up security, especially in host cities Karachi, Lahore and Rawalpindi, even if attacks in major cities are increasingly rare.\n\nPakistan had been due to host the Champions Trophy, the premier ODI event after the World Cup, in 2008. It was instead staged in South Africa a year later because of a security crisis that spilled over from the war in neighbouring Afghanistan after the September 11 attacks.\n\nPakistan became a no-go zone for international sides in 2009 after gunmen attacked a bus carrying Sri Lanka’s team in Lahore, wounding several players and killing eight policemen and civilians.\n\nBut since a sweeping military crackdown that started in 2014 and lasted several years, security has vastly improved.\n\nTest cricket returned to Pakistan in 2019 and Australia, England, New Zealand and South Africa later toured the country, helping Pakistan’s bid to host the tournament.\n\nThose teams will all be in Pakistan for the Champions Trophy.\n\nFor 77-year-old businessman Haji Abdul Razzak, a global event coming back to Pakistan is like another birthday. The last time Pakistan held a major international cricket tournament was as co-hosts, with India and Sri Lanka, in 1996.\n\nRazzak raised the Sri Lankan flag on March 17, 1996, at the Gaddafi Stadium in Lahore when the islanders defeated Australia to clinch the title.\n\nTwenty-nine years later the cricket fanatic will attend the opening match of the Champions Trophy in Karachi on Wednesday between holders Pakistan and New Zealand.\n\n“It is fresh in my mind,” a teary-eyed Razzak told AFP. “My country was thriving back then and cricket was on everyone’s mind.”\n\nHe added: “Terrorism took everything away from us. I am overjoyed to see a global event coming back to our country and I am feeling like it will be my birthday.”\n\nAlthough militancy is still a threat in Pakistan, the violence is nearly entirely limited to the remote border regions from north to south, far away from the stadiums.\n\nWith the capital Islamabad placed in lockdown, Pakistan recently hosted a summit of the Shanghai Cooperation Organisation and a global meeting on girls’ education, raising its profile on the international stage.\n\nAs a test case for its readiness, Pakistan last week staged a tri-series with New Zealand and South Africa and crowds flocked to the recently renovated stadiums in Lahore and Karachi.\n\nRaja, a former Pakistan captain who played in the 1987 World Cup hosted by Pakistan and India, said holding the Champions Trophy has an enormous significance that goes beyond sport.\n\n“This Champions Trophy is a crucial step toward normalising its standing in the global cricket community,” he said. “It’s also about national pride and sending a strong message about resilience and determination.\n\n“It is about youth engagement, cultural promotion and building a global image.\n\n“Now the onus is on us to deliver. “\n\nHeader Image: A billboard in Lahore, depicting captains of different teams ahead of the Champions Trophy, on February 15, 2025. — AFP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/181250368b58797.jpg",
  "retrievedAt": "2025-08-25T19:42:32.887Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892756/more-than-cricket-as-pakistan-hosts-first-major-tournament-in-29-years",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T07:52:53.000Z"
}
