{
  "title": "30 terrorists killed in intelligence-based operation in KP’s South Waziristan: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Security forces killed 30 terrorists in an intelligence-based operation (IBO) in Khyber Pakhtunkhwa’s South Waziristan district, the military’s media wing said in a statement on Tuesday.\n\nA statement issued today from the Inter-Services Public Relations (ISPR) said security forces conducted an IBO on Monday in the district’s general area on Sararogha based on a reported terrorist presence.\n\nIt added that security forces “effectively engaged” the terrorists at their location during the operation, due to which 30 were “sent to hell”.\n\nThe ISPR added that sanitisation operations were being conducted to eliminate any other terrorists found in the area.\n\n“Security forces of Pakistan are determined to wipe out the menace of terrorism and such sacrifices of our brave men further strengthen our resolve,” the statement concluded.\n\nPresident Asif Ali Zardari and Prime Minister Muhammad Shehbaz Sharif lauded the security forces for their successful operation.\n\nThe president reaffirmed his resolve to completely eradicate the proscribed Tehreek-i-Taliban Pakistan group (TTP) and said that security forces were carrying out operations to eliminate the spectre of terrorism from the country.\n\n“The entire nation is united against terrorism,” he said, according to a press release from the President Secretariat Press Wing.\n\nHe further reiterated that operations against the TTP would continue till its complete elimination.\n\nPM Shehbaz said that the government would continue to foil the nefarious designs of the enemies of humanity, adding that security forces were getting closer to the target of wiping out terrorism each day.\n\n“The sacrifices of the sons of the soil will not go in vain,” he said, according to a press release from the PM Office Media Wing.\n\nThe prime minister said the government and the security forces were fully committed to completely wipe out terrorism from the country.\n\nThe incident comes just days after four soldiers were martyred while 15 terrorists were killed in two separate IBOs carried out in KP on Saturday.\n\nOn Thursday, security forces killed 13 terrorists in five separate operations carried out across KP. Earlier in January, security forces killed 30 terrorists during three separate operations across KP.\n\nPakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan.\n\nTerror attacks have increased since the TTP broke a fragile ceasefire agreement with the government in 2022.\n\nA security report, released last month by the Islamabad-based think tank Pak Institute for Peace Studies (PIPS), showed that in 2024, the number of terror attacks reached levels comparable to the security situation in 2014 or earlier.\n\nIt said that while terrorists no longer controlled specific territories inside Pakistan as they did in 2014, the prevailing insecurity in parts of KP and Balochistan was “alarming”.\n\nIt said that over 95 per cent of terrorist attacks recorded in 2024 were concentrated in KP and Balochistan.\n\nKP recorded the highest number of terrorist incidents in the country in 2024, with 295 attacks. Meanwhile, attacks by various outlawed Baloch insurgent groups, primarily the BLA and the Balochistan Liberation Front, saw a staggering 119pc increase, accounting for 171 incidents in Balochistan, it said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:42:31.618Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892797/30-terrorists-killed-in-intelligence-based-operation-in-kps-south-waziristan-ispr",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T15:09:11.000Z"
}
