{
  "title": "Bulls dominate as PSX rises by nearly 1,400 points with experts citing ‘good corporate results’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "Bulls dominated the trading floor on Tuesday at the Pakistan Stock Exchange (PSX) as shares rose by nearly 1,400 points, with experts citing “good corporate results” as the reason for the uplift.\n\nThe rise comes after the market sustained a three-week losing streak, despite bearish performances in the last three sessions due to political noise and reciprocal tariffs imposed by US President Donald Trump on American allies and competitors, which heightened concerns about a potential global trade war.\n\nAfter the slump, shares at the exchange went on a record-setting streak as the KSE-100 index climbed more than 3,000 points to surpass the 114,000 mark.\n\nThe market opened last week with a spectacular rally after the State Bank of Pakistan released remittances data, showing a surge of over a quarter to $3 billion in January.\n\nThe benchmark KSE-100 index climbed 1455.85 points to stand at 345,519,481 points from the previous close of 111,743.53 points at 3:30pm.\n\nFinally, the index closed at 113,088.47, up by 1344.94 points or 1.2pc, from the previous close.\n\nYousuf M. Farooq, director of research at Chase Securities, said, “Good corporate results have attracted fresh institutional buying.”\n\nWhile the economy appears to be back on track, the current account deficit and real effective exchange rate numbers released today have led some investors to believe that a devaluation of the Pakistani rupee might occur, Farooq said, adding that a quick devaluation could contribute to longer-term stability.\n\n“The economy is showing signs of recovery, with improvements in fuel consumption, motorcycle and auto sales, although large-scale manufacturing remains sluggish,” he added.\n\nMore to follow",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/18165352790ea49.jpg",
  "retrievedAt": "2025-08-25T19:42:31.576Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892777/bulls-dominate-as-psx-rises-by-nearly-1400-points-with-experts-citing-good-corporate-results",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T12:00:53.000Z"
}
