{
  "title": "Number of migrants doubled since 1990: UN - World - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The number of international migrants worldwide in 2024 stood at 304 million, a figure that has nearly doubled since 1990, when there were an estimated 154 million migrants globally, a new United Nations report says.\n\nThe International Migrant Stock 2024 yet to be released by the United Nations Department of Economic and Social Affairs (Desa) says despite robust growth in the absolute number of international migrants over recent decades, their share of the world’s population remains small: in 2024 just 3.7 per cent of people globally were international migrants, having increased only modestly from 2.9 per cent in 1990.\n\nThe US hosted more international migrants than any other country in 2024, with 52.4 million. Germany was the second leading destination for international migrants, hosting 16.8m in 2024, followed by Saudi Arabia (13.7m), the UK (11.8m), France (9.2m), Spain (8.9m), Canada (8.8m), the UAE (8.2m), Australia (8.1m), the Russia (7.6m), Turkiye (7.1m) and Italy (6.6m).\n\nIn 2024, the report says, just under half (48pc) of all international migrants worldwide were women or girls. In Europe and Northern America, as well as in Latin America and the Caribbean, women and girls comprised around half of all international migrants and their share was essentially unchanged between 1990 and 2024.\n\nEurope hosted more international migrants than any other region with 94m in 2024. Northern America was home to the second largest number with 61m, followed by the region of Northern Africa and Western Asia with 54m.\n\nEurope experienced the largest increase in the number of international migrants among the eight regions, with the addition of 43m between 1990 and 2024.\n\nThe pace of growth of Europe’s international migrant stock increased since 2020, due largely to refugee flows from Ukraine. Northern America added 34m international migrants between 1990 and 2024; however, the pace of growth in that region has slowed over time.\n\nBetween 2020 and 2024, the number of international migrants in Northern America increased by less than one per cent per year, on average, compared to average annual growth rates of 3.8pc during 1990-2000 and 2.3pc during 2000-2010.\n\nWith 46m people in 2024, the total population of Oceania was small relative to the other regions, yet international migrants comprised 21pc of the residents.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:30:12.292Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892702/number-of-migrants-doubled-since-1990-un",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:15:11.000Z"
}
