{
  "title": "Textile exports surge 16pc - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The textile and clothing exports rebounded 15.85 per cent in January from a year ago, Pakistan Bureau of Statistics data showed on Monday.\n\nFrom the start of the new fiscal year, the textile exports maintained a bullish trend with robust growth of 13pc in August, 17.92pc in September, 13.11 pc in October, 10.81 pc in November, and 5.55pc in December.\n\nHowever, export growth bounced back to double digits in January, as was forecasted by exporters. The disruption in supply from Bangladesh has also boosted demand for Pakistani garments.\n\nIn absolute terms, the textile and clothing exports rose 15.85pc to $1.68bn in January FY25 from $1.45bn in the corresponding month last year. In the first seven months (July-January), the exports of textile and clothing reached $10.77bn as against $9.74bn over the corresponding months of last year, showing an increase of 10.60pc.\n\nPakistan Textile Exporters Association has warned the government against making any changes to the Export Facilitation Scheme (EFS), which might create cash flow problems for exporters. The EFS, according to exporters, has significantly contributed to boosting exports in the current fiscal year.\n\nTextile and clothing exports have been static for the last two years despite having a $25bn installed capacity due to structural issues, according to textile players. The exporters have sought the early rele­ase of various refunds/rebates, which have been stuck up for many months.\n\nThe PBS data showed exports of readymade garments rose 21.90pc in value and 8.73pc in quantity during 7MFY25, while knitwear rose 18.16pc in value and 9.78pc in quantity. Bedwear grew 14.71pc in value and 14.04pc in quantity.\n\nTowel exports rose 6pc in value and 6.67pc in quantity 7MFY25, whereas cotton cloth went up 3.99pc in value and contracted 1.44pc in quantity, respectively.\n\nYarn exports dipped 35.77pc in 7MFY25. The exports of made-up articles, excluding towels, increased by 10.98pc, and tents, canvas and tarpaulin went up by 18.91pc in 7MFY25. The export of raw cotton recorded a decline of 98.90pc during the period under review.\n\nThe import of synthetic fibre shrank 1.32pc, and the arrival of synthetic silk yarn increased by 12.13pc. However, other textile items’ import increased by 73.80pc the period under review.\n\nThe import of raw cotton surged 194.41pc during the first seven months of the current fiscal year. However, the import of second-hand clothes grew 24.27pc during the period.\n\nThe import of textile machinery also grew by 60.36pc during the first seven months of the current fiscal year compared to a year ago. In July-January FY25, the country’s total exports increased by 10.17pc to $19.58bn, up from $17.77bn in the same months last year.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:43:00.554Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892674/textile-exports-surge-16pc",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:12:52.000Z"
}
