{
  "title": "Balakot people seek jobs for locals in power project - Pakistan - DAWN.COM",
  "author": null,
  "content": "MANSEHRA: The residents of Balakot and local government representatives on Monday demanded of Khyber Pakhtunkhwa government to ensure employment opportunities for locals in Balakot hydropower project.\n\n“This is the first mega energy project being built on the Kunhar River by Pakhtunkhwa Energy Development Organisation (Pedo), but locals are denied employment opportunities, which is against the existing laws,” Syed Munir Hussain Shah, chairman of Bala Paras village council, told a meeting attended by members of affected families.\n\nHe said that members of the families, whose land was acquired for the dam, were also in attendance to safeguard their rights.\n\n“We are going to constitute a committee consisting of dam-affected families to present our case at both public and private forums,” said Mr Shah.\n\nHe said that local government representatives were united in their demand for immediate resolution to issues related to land acquired for the dam and employment for locals.\n\n“If the government does not address our concerns regarding land and employment, we will devise a strategy to take to streets and block Mansehra-Naran-Jalkhad road to all kinds of traffic,” said Mr Shah.\n\nHe emphasised that it was the largest project ever undertaken by Pedo and locals had made great sacrifices, abandoning their homes, agricultural land and even ancestral graveyards.\n\n“We want our rights and if government doesn’t address our issues we will take to streets,” said Mr Shah.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:30:07.345Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892593/balakot-people-seek-jobs-for-locals-in-power-project",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:13:35.000Z"
}
