{
  "title": "Rawalpindi’s Raja Bazaar traders demand reopening of road - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: District administration and Rawalpindi Municipal Corporation (RMC) failed to satisfy traders about turning Raja Bazaar into a pedestrian street as they urged the authorities to open the road for traffic.\n\nDeputy Commissioner Dr Hassan Waqar Cheema, accompanied by RMC Chief Officer Imran Ali and other senior officials visited the Raja Bazaar.\n\nRawalpindi Traders Association President Shahid Ghafoor Paracha told Dawn that the traders rejected the district administration’s plan to close the road from Fawara Chowk to Hamilton Road.\n\nHe said that the traders decided to stop the administration from implementing the plan for pedestrian street.\n\n“We are in favour of removing encroachments and supported the administration as the wide roads will benefit shopkeepers of Raja Bazaar but closure of roads is unacceptable,” he said.\n\n“There is no parking plan with RMC and Traffic police failed to manage the traffic as in last two days; closure of the road caused congestion in the area and people found difficulty to visit bazaars,” he said.\n\nOn the other hand, the deputy commissioner has emphasised the swift completion of the pedestrian street project in Raja Bazaar to improve accessibility and public convenience. During his visit to the area, he inspected the ongoing anti-encroachment operation and directed the authorities to expedite the work on a fast-track basis.\n\nHe further instructed authorities that beautification efforts should begin immediately alongside the development work to uplift the aesthetic value of Raja Bazaar.\n\nPublished in Dawn, February 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:42:47.002Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892611/rawalpindis-raja-bazaar-traders-demand-reopening-of-road",
  "dateList": "2025-02-18",
  "date_published": "2025-02-18T02:13:43.000Z"
}
