{
  "title": "Balochistan Assembly slams APS bus attack as ‘brutal assault on nation’s future’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: The Balochistan Assembly on Monday adopted a resolution — jointly moved by opposition and treasury lawmakers — to condemn the suicide attack on the Army Public School (APS) bus in Khuzdar terming it a cowardly, brutal, and inhumane act to target innocent students who were on their way to school.\n\nThe resolution was moved by opposition leader Mir Younis Aziz Zehri on behalf of the opposition and treasury members on the floor of the house.\n\n“A suicide attack is an inhuman and brutal assault on the future of the nation and deliberate attempt to destroy the peace and education in the country, especially in Balochistan,” said the resolution.\n\nA resolution was initially moved by opposition leader Mr Zehri of JUI-F and Mir Saleh Rehmat Baloch of National Party, but other members suggested it should be converted into a joint resolution of all parties.\n\nDeputy Speaker Ghazala Gola, who was presiding over the session, allowed the joint resolution after consulting the house.\n\nMr Zehri, in his address, strongly condemned the attack, which has claimed the lives of 10 people, including eight students, and injured over 40.\n\n“This barbaric act was not only an atrocity against unarmed children but also a malicious conspiracy targeting Pakistan’s youth, national integrity, and the pursuit of knowledge and peace,” the resolution stated. The assembly demanded immediate action from the provincial government to bring the perpetrators and their facilitators to justice.\n\nOn the occasion, ANP’s Engineer Zamrak Khan Achakzai lamented the lack of implementation of the national action plan across Khyber Pukhtunkhwa.\n\nNational Party’s Kulsoom Niaz Baloch said the attack exposed the absence of state writ and the worsening security situation across the province.\n\nShahida Rauf of JUI-F called the attackers cowardly enemies who deliberately targeted children and said that these children were innocent and had nothing to do with the politics of hate and violence.\n\nProvincial Minister for Planning and Development Mir Zahoor Buledi said terrorism has no religion or ideology and claimed the attack’s roots could be traced to India.\n\nPML-N MPA Zarak Khan Mandokhail said that targeting children was a failed attempt to destabilise Balochistan, and called for unity against those misleading the people.\n\nFarah Azeem Shah of the BAP said the Khuzdar attack proved “terrorists supported by India were active in the province”.\n\nProvincial Minister Mir Saleem Khosa described the attack as one of the most heartbreaking incidents in Balochistan’s history.\n\nPPP MPA Haji Ali Madad Jattak stated that the world now knows Pakistan’s enemies have moved from attacking borders to targeting children.\n\nJamaat-i-Islami MPA Maulana Hidayatur Rehman stressed that protecting citizens is a constitutional obligation.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:18:09.714Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913580/balochistan-assembly-slams-aps-bus-attack-as-brutal-assault-on-nations-future",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:25:40.000Z"
}
