{
  "title": "Diplomatic blitzkrieg - Newspaper - DAWN.COM",
  "author": null,
  "content": "AFTER facing off on the battlefield, Pakistan and India are now fighting a battle of narratives, with each side sending high-level delegations to world capitals to communicate their respective points of view regarding the recent hostilities.\n\nPrime Minister Shehbaz Sharif landed in Turkiye on Sunday as part of a four-nation tour that will also see him travelling to Iran, Azerbaijan and Tajikistan. Meanwhile, current and former lawmakers and diplomats are due to leave for the US and Europe.\n\nEx-foreign minister and PPP chief Bilawal Bhutto-Zardari may reportedly lead one of these delegations. The team visiting the US is scheduled to meet the UN secretary general, American lawmakers, as well as engage with think tanks and the media in Washington DC. An Indian team, led by lawmaker and former UN official Shashi Tharoor, has visited the US as part of New Delhi’s lobbying efforts.\n\nPersonal interactions have considerable influence in the conduct of diplomatic relations, which is why the PM himself is leading delegations to friendly regional states.\n\nSimilarly, senior lawmakers with experience in foreign affairs are being dispatched to the US. The fact is that in the current circumstances, Pakistan has strong talking points. While the Indian side may try to spin the details, the fact is that New Delhi started blaming Pakistan for the Pahalgam atrocity very soon after the killings, without a shred of evidence. India has yet to share the details of any alleged Pakistani role with this country, or the international community.\n\nSecondly, India initiated hostilities with Operation Sindoor; Pakistan’s response in the shape of Operation Bunyanum Marsoos was defensive. Such recklessness in a nuclear neighbourhood reflects a highly irresponsible attitude on India’s part.\n\nMoreover, India’s threats regarding the Indus Waters Treaty violate a bilateral agreement that cannot be altered unilaterally, and by threatening to stop Pakistan’s share of water, India is creating a fresh cause for conflict in South Asia. All these points should be amplified by Pakistan’s delegations abroad.\n\nWhile Pakistan must defend itself as staunchly in the diplomatic arena as it did in the battlefield, ultimately, for there to be peace in the subcontinent, both states must sit down and talk about their differences.\n\nIndia is unlikely to favour negotiations at the current juncture, as elements within the ruling party and media have whipped up war hysteria and anti-Pakistan feelings in the population. But in the long run, without a structured peace process in South Asia, the only alternative is more hostility.\n\nNew Delhi may loathe foreign involvement in its disputes with Pakistan — consider the hysterical reaction to Donald Trump’s claims of mediating the ceasefire. But foreign powers are unlikely to sit back and watch if tensions climb to the stage where there is talk of the unthinkable: a nuclear exchange.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:30:02.535Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913600",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:57:28.000Z"
}
