{
  "title": "Internet in Panjgur to remain suspended for six months - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A National Asse­mbly panel was informed on Monday that internet services in Panjgur will remain suspended for next six months over security concerns.\n\nThe committee was informed that the security agencies had responded to a letter from the Ministry of Interior stating that, due to the prevailing security and law and order situation, internet services in Panjgur district would remain suspended for the next six months.\n\nThe NA Standing Committee on Information Technology, held with Aminul Haq in the chair was told that this has been communicated to the interior ministry by security agencies in response to a letter, citing prevailing law and order situation as the reason.\n\nExpressing concern over this situation, the committee noted that internet services in Panjgur have remained suspended for the past three years, causing severe difficulties for the local population, particularly the business community and students. Consequently, the committee decided to convene an in-camera meeting wherein the Secretary Interior would brief the committee in detail about the specific law and order situation that necessitates the continued suspension of internet services.\n\nNational Party lawmaker Pullain Baloch informed the committee that the people of his constituency (NA-258) have to travel from 15kms to 20kms only to access internet services. He said PTCL’s internet coverage in the area was nearly non-existent. Subsequently, the committee directed the PTA chairman to conduct a survey of the internet coverage in the mentioned region and submit a detailed report to the committee.\n\nDecision taken due to security concerns, NA panel told\n\nMeanwhile, the NA committee was briefed that a total of 4.6 million students had been provided training through 19 batches under 15 most in-demand freelancing courses. Among the trained individuals, 28pc were female. The committee was further informed that according to a survey conducted in October 2024, freelancers and trainees who received training through Ignite’s programmes collectively generated revenue amounting to US$1.65 billion. Ignite informed the committee that it had introduced 10 additional courses, bringing the total number of courses to 25. These include programmes and projects related to artificial intelligence. The committee directed Ignite to submit a district-wise list of student enrollments from Balochistan.\n\nRegarding female enrollment, the committee directed Ignite to make efforts to increase the current 28pc female participation across various courses to at least 50pc, in order to ensure greater inclusion and empowerment of women in the national workforce.\n\nThe committee expressed concern over the absence of the CEO of PTCL and issued instructions to ensure he appears before the lawmakers in next meeting of the committee. It was brought to the panel’s attention that PTCL was allegedly planning to sell certain properties, including some high-value assets. The committee directed PTCL to present the specific clauses of its sales and purchase agreements that authorise the company to proceed with the sale of these properties.\n\nBesides ministry officials and MNA Adil Khan Bazai, lawmakers Zulfiqar Ali Bhatti, Dr Mahesh Kumar Malani, Sadiq Ali Memon, Sharmila Sahiba Farooqui Hashaam, Ahmad Saleem Siddiqui, Pullain Baloch, Awais Haider Jakhar, and Umair Khan Niazi attended the meeting.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:18:55.992Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913567/internet-in-panjgur-to-remain-suspended-for-six-months",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:25:31.000Z"
}
