{
  "title": "Punjab braces for another spell of downpour from today - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Govt activates emergency protocols; orders desilting of waterways\n• PDMA calls for standardised fitting of solar panels to withstand inclement weather\n• Official says 70pc deaths resulted from falling solar panels\n\nLAHORE: Heavy rain and thunderstorms are set to batter Punjab, days after similar weather killed around 20 people across the province.\n\nThe Provincial Disaster Man­agement Authority (PDMA) Punjab has issued a province-wide alert of severe weather from today (Tuesday).\n\nA westerly wave combined with moist currents is likely to bring intense windstorms, thu­nderstorms, and heavy rainfall across the region from May 27 to 31, said the Met department forecast.\n\nUpper and central Punjab districts, including Rawal­pi­ndi, Murree, Galliyat, Attock, Chakwal, Jhelum, Mianwali, Sargodha, Hafizabad, Mandi Bahauddin, Sialkot, Narowal, Okara, Lahore, Faisalabad, Jhang, Toba Tek Singh, Gujranwala, Gujrat and Sheikhupura will experience heavy rains with hailstorms and lightning from the evening of May 27 through May 31.\n\nSouthern districts of DG Khan, Rajanpur, Multan, Bhakkar, Layyah, Bahawalpur, Sahiwal, Pakpattan and Vehari are expected to receive light to moderate rain and thunderstorms during the same period.\n\nThe authorities warned people to stay away from loose stru­ctures, including electric poles, trees, vehicles and solar panels during thunderstorms and stay indoors as much as possible.\n\nThe warning was issued as a PDMA assessment showed 70pc of casualties during the thunderstorm three days ago were caused by falling solar panels which were not installed properly.\n\nEmergency protocols\n\nIn light of the fresh forecast, the Punjab government has activated emergency protocols across all districts.\n\nThe district administrations and all relevant departments, including health, education, irrigation, local government and Rescue 1122, have been put on alert to maintain round-the-clock staffing at emergency operation centres.\n\nThe provincial cabinet committee on disaster management also convened an emergency meeting on Monday.\n\nHealth Minister Khawaja Salman Rafiq chaired the mee­ting attended by senior officials and divisional commissioners.\n\nThe meeting focused on a comprehensive five-point age­nda to strengthen the province’s response to the upcoming monsoon season.\n\nPDMA DG Irfan Ali Kathia briefed the committee on the relief body’s preparations. The commissioners and deputy commissioners shared progress reports on ongoing desilting of waterways and mock emergency exercises.\n\nMr Rafiq issued directives for enhanced measures in Gujranwala and Lahore, where above-average monsoon rains are predicted.\n\nThe meeting approved a special grant for desilting operations in Waha (Rajanpur) and urgent measures to address potential hill torrents in vulnerable areas.\n\nThe minister stressed the importance of field visits by officers to ensure proper arrangements before monsoon rains.\n\nRawalpindi’s Leh Nullah was specifically identified for priority desilting operations.\n\nThe meeting also reviewed the Flood Risk Management Survey. Officials revealed plans to survey over 100,000 structures in Dera Ghazi Khan division, with all hill torrent area surveys scheduled for completion by June 22.\n\nThe committee also approved a crucial model study on river erosion patterns.\n\nPDMA helpline\n\nThe PDMA has also established a communication system to disseminate weather updates and warnings through SMS alerts, mosque announcements and through local representatives.\n\nPDMA DG Kathia urged citizens to contact the PDMA helpline at 1129 in case of any emergency. The authority can also be reached on WhatsApp +923178371900 and landline 042-9922135/6 for assistance.\n\nPDMA has also directed local authorities to submit daily situation reports.\n\nSolar panel regulations\n\nThe PDMA has taken action against substandard fitting of solar panels after falling plates resulted in the deaths of most of the 19 people who were killed during the windstorm in central and southern Punjab on Saturday.\n\nThe authority has issued directives to the energy and local government departments and divisional and district administrations for comprehensive guidelines for the installation of solar panels so that they could withstand inclement weather.\n\nAccording to PDMA’s findings, poorly installed solar panels and mounting structures were uprooted during the recent storm, causing fatal accidents across Punjab.\n\nPoorly fitted panels and mounts fell from rooftops, resulting in significant loss of life and property.\n\nPDMA DG Kathia confirmed that 70pc of the accidents that occurred due to windstorms in the past few days were caused by fallen solar panels or their mounts.\n\nHe said solar panels installed on rooftops or in open areas should follow proper installation guidelines.\n\nHe stressed the installation of solar panels should be standardised and certified in the future.\n\nThe PDMA has instructed district administrations to conduct thorough surveys of existing solar installations to identify and repair dangerous fittings.\n\nThe installation of all existing and future solar panels must meet strict engineering standards, including the key requirements like use of certified material and mounting equipment, structural approval by relevant authorities and implementation of regular maintenance and inspection protocols, the relief body directed.\n\nIt also stressed the need to devise standard operating procedures (SOPs) for repairs and periodic safety checks.\n\nThe energy and local government departments were directed to create a regulatory framework for solar panel installations.\n\nThe framework would enforce mandatory safety standards and certification processes for all solar energy systems, especially those installed on rooftops and open structures.\n\nThe PDMA warned that failure to comply with the new guidelines could result in similar tragedies during future extreme weather events.\n\nAll deputy commissioners have been directed to immediately launch awareness campaigns to educate the public about safe solar panel installation practices while the formal regulations were being developed.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:30:32.364Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913571/punjab-braces-for-another-spell-of-downpour-from-today",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:25:25.000Z"
}
