{
  "title": "GB traders protest suspension of Pakistan-China trade - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT:  Traders affiliated with import and export between Pakistan and China through Khunjerab Pass on Monday announced protest against the suspension of trade between the two countries for the last six months.\n\nAddressing a press conference, Pakistan-China Traders Action Committee leaders said transporters, hotel owners, labourers and shopkeepers had become jobless.\n\nMohammad, Ismail, Ebad Nagri, Yawar Abbas and Abbas Mir and other leaders of the committee said over 200 consignments imported from China had stuck at Sost Dry port since December last year.\n\nThey said local traders faced billions of rupees losses as many items had expired. They also had to pay daily port charges and other expenses. They said trade between two countries through Khunjerab Pass was the biggest source of income for GB people.\n\nThey said small traders were not being allowed to import items for local markets. They said the collection of income tax and sales tax at Sost Port was in violation of the law given the disputed constitutional status of Gilgit-Baltistan. They demanded that the customs checkpoint be relocated outside Gilgit-Baltistan’s territorial limits and that the region’s disputed status be recognised.\n\nMoreover, Gilgit-Baltistan should be exempted from income tax and sales tax with customs duties being the only charges applied to imported goods.  They also demanded immediate removal of the customs collector. They warned that if their demands were not met within 48 hours, the next course of action would be announced.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/11/17103128f1dd05e.jpg?r=103135",
  "retrievedAt": "2025-08-23T14:30:04.190Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913474/gb-traders-protest-suspension-of-pakistan-china-trade",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:26:34.000Z"
}
