{
  "title": "Three die after inhaling poisonous gas at a paper mill in Sheikhupura - Pakistan - DAWN.COM",
  "author": null,
  "content": "NAROWAL: Three workers died and eight others fell unconscious after accidentally inhaling poisonous gas while working in a paper mill at Sheikhupura on Monday.\n\nAs per the Sheikhupura Rescue 1122 spokesman, on receipt of an emergency call about some workers falling unconscious at Khanpur Paper Mills, rescue teams were dispatched to the spot.\n\nHe said that on reaching the mill, the rescuers found several workers, including Abbas (40), Bilal (19), Ali Haider (30), Asghar Ali (25), Hanif (22), Faiz Ahmed and Akram (31) lying unconscious.\n\nOf them, he said, three workers -- Abbas, Bilal and Haider – died instantly, while others were shifted to the Sheikhupura District Headquarters Hospital, after provision of first aid.\n\nEight others fall unconscious\n\nAccording to hospital sources, the condition of one of the unconscious workers was critical. On being informed of the incident, local police also rushed to the spot and started investigations.\n\nRescue 1122 spokesperson said after completion of the legal procedure, the bodies were handed over to the police.\n\nSHO SUSPENDED: Sialkot district police officer (DPO) suspended Muradpur station house officer (SHO) from service on a complaint about the alleged torture and humiliation of a man seeking registration of a first information report (FIR) of a theft.\n\nAs per a district police spokesperson, Qaiser, a resident of Tibi Araiyan village, approached the Sialkot DPO office with a complaint stating that he had reported a theft on police helpline 15.\n\nHe said that despite the theft complaint, Muradpur SHO Akram Shahbaz refused to register an FIR of the incident, terming it baseless.\n\nHe said that when he insisted on registration of the FIR, the SHO used abusive language and tortured him.\n\nTaking notice of the complaint, DPO Faisal Shahzad immediately suspended the SHO from service and ordered DSP Muhammad Nauman to conduct an inquiry into the incident.\n\nThe DPO said it is the police’s job to register FIRs and protect life and property of people, adding that police officers who humiliate and torture complainants have no place in the department.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:18:12.182Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913491/three-die-after-inhaling-poisonous-gas-at-a-paper-mill-in-sheikhupura",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:26:26.000Z"
}
