{
  "title": "NA body calls for urgent focus on Islamabad’s water crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary panel on Monday stated that in addition to focusing on major road projects in the federal capital, urgent attention should be given to the pressing issue of water scarcity affecting residents.\n\nThe National Assembly Standing Committee on Interior met with MNA Khurram Nawaz in the chair and discussed the growing water shortage and other issues in Islamabad.\n\nThe chair pointed out that CDA had been spending billions of rupees on road-related projects without paying serious focus on addressing the water shortage.\n\nLater, an informal meeting was held under the supervision of Minister of State for Interior Talal Chaudhry and attended by local MNAs, the CDA chairman and others to discuss the issue.\n\nCommittee chairman says CDA spending billions of rupees on road-related projects without addressing basic issue of residents\n\nThe participants of the meeting discussed long- and short-term solutions, including the mega Ghazi Barotha water project, which is designed to provide 100 million gallon per day water to Rawalpindi and Islamabad. The construction of Chirah Dam also came under discussion.\n\nIt may be mentioned that Islamabad is a fast growing city, but its underground water level has been depleting.\n\nIn the last three decades, no new water source has been explored with the city managers focusing on development works.\n\nThere are three main sources of water for Islamabad: Simly Dam, Khanpur Dam and tubewells. The CDA has been receiving on average 70mgd water from these sources to meet the need of 220mgd of the urban population. The rural areas of the capital are dependent either on boring or on small water schemes of the local government.\n\nBackground talks with relevant officers showed that both rural and urban population is facing shortage of water. The officials said that in the 90s the CDA launched a project to bring water from Khanpur Dam. This was the last project that was executed when Islamabad’s population was almost 600,000. However, now the population of the city is estimated at around 2.5 million.\n\nDuring the last two decades, the CDA kept on discussing various projects, including the Ghazi Barotha project (estimated cost Rs100 billion), the extension of Khanpur Dam, construction of proposed Chirrah Dam and several small proposed dams, including Shahdara and Chinot.\n\nEarlier, during the committee meeting, the issue of rural areas development package also came under discussion.\n\nThe committee pointed out that a development package had been announced by the prime minister for the construction of roads/streets in rural areas in 2023. The work was started, but later halted halfway. The chairman of the CDA informed the committee that funds had been released and work had begun with priority to be given to projects on which 80pc work had already completed.\n\nThe committee was told that six roads projects, which were started in 2022 and halted, would be completed before June 30. Two roads each will be completed in constituencies of all the three MNAs.\n\nThe committee showed its concerns over poor service delivery in rural union councils and directed the chairman CDA to submit details in next meeting regarding the total number of UCs, their secretaries and the funds generated and utilised by the union councils in Islamabad.\n\nThe committee also directed the CDA chairman to initiate an inquiry into the poor condition of Parliament Lodges and provide details of the work completed so far and the remaining work and the official involved in alleged corruption therein.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:30:04.468Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913483/na-body-calls-for-urgent-focus-on-islamabads-water-crisis",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:26:33.000Z"
}
