{
  "title": "Return of displaced Rajgal families yet to start despite announcement of schedule - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: The much-awaited repatriation of hundreds of displaced families of Rajgal valley in Tirah could not be started despite the fact that authorities had announced the date of May 15 for the purpose.\n\nSources in Jamrud told Dawn that they were not given any specific reason for the unannounced postponement of the return of displaced families, hailing from Nakai, Chingai, Bakhta Kallay, Babar Kachkol, Kachkol, Gharebay and Kharwaly which was scheduled for May 15 as per an official notification issued on October 22, 2024.\n\nIt was also announced on the same date (October 22, 2024) that 2,041 families comprising 11,487 individuals would be repatriated to Tor Chapar from October 29 onwards.\n\nThe remaining families of these localities in Rajgal valley had been waiting for their planned return on May 15 but the district administration along with Provincial Disaster Management Authority remained silent over the matter despite the passing of the announced date.\n\nIDPs say there is no security issue in their villages\n\nKukikhel tribesmen had in July last year started a protest campaign against the prolonged delay in return of their displaced families to Rajgal. Protesters had blocked Peshawar-Torkham Highway on August 21, 2024 for over a month to press authorities for announcing a return schedule.\n\nIt was after the said protest, which also caused suspension of bilateral trade with Afghanistan for five weeks, that government submitted to Kukikhels’ demand for return of Rajgal valley families and announced a comprehensive plan through which hundreds of families were sent back to Barai, Daman, Patal, Pakdara, Bagh Kalay and Ghwakhy in the first phase and later to Tor Chapar.\n\nThe return of displaced families to Nakai, Chingai, Bakhta Kalay, Babar Kachkol, Kachkol, Gharebay and Kharwaly could not be started on May 15 owing to unspecified reasons. Displaced families from these localities are impatiently waiting for an announcement to this effect.\n\nMany in Jamrud, where most of the displaced families had settled down, argued that there was no security issue in their villages and they were eager to go back to their homes, which were mostly damaged.\n\nResidents of other localities in Rajgal valley where families had already returned also complained about lack of basic facilities like road infrastructure, reconstruction of their houses with official assistance, absence of schools and health facilities and little access to clean drinking water.\n\nHaji Mubarak Shah of Pakdara village told Dawn that they could not rebuild their damaged homes prior to damage assessment survey as by doing so they could be deprived of any official assistance.\n\nHe said that with all the natural springs either blocked with landslide or natural change in underground direction during the period of their displacement, they were faced with acute shortage of drinking water while irrigation channels, which they had built over a period of time before their displacement in 2012, had all gone dysfunctional due to prolonged lack of maintenance.\n\n“Living conditions have not yet stabilised in the areas where families had returned in 2023 and 2024 as they still lack basic amenities of life while the entire infrastructure stands destroyed and required immediate repair and rehabilitation which we do not see instantly,” he said.\n\nIrfan Kukikhel, a resident of Daman village, said that most of the returned families were either residing in damaged houses or tents.\n\nHe added that they were also faced with health problems owing to absence of a well-equipped health facility.\n\nHe said that most of the womenfolk still fetched drinking water from far away natural springs in dense forest and there was an immediate need for a drinking water supply schemes in all the villages.\n\nHe said that majority of the returned families had to send their children back to Jamrud for education as there was neither a government nor a public school in the entire Rajgal valley.\n\nHe said that if the situation remained the same, all the returned families would go back to Jamrud and Peshawar with the potential danger of leaving Rajgal valley at the mercy of terrorist groups, who were eagerly looking for reestablishment of their bases in such abandoned hilly areas that could serve as a natural camouflage for them against any military operation.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:30:03.128Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913519/return-of-displaced-rajgal-families-yet-to-start-despite-announcement-of-schedule",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:26:40.000Z"
}
