{
  "title": "Two polio workers abducted in Tank as nationwide polio drive begins - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA ISMAIL KHAN: Two polio workers were abducted by armed assailants in Tank district here on Monday as a five-day polio campaign kicked off across the country.\n\nThe workers were performing their duties in the Dolat Koruna area of Tank as part of the ongoing vaccination drive.\n\nThe abducted workers identified as a Union Council official, Sifat Khan, and his colleague Hizbullah.\n\nAccording to police sources, both health workers were on duty when unidentified armed men abducted them and took them to an undisclosed location.\n\nMinister calls upon nation to stand united against polio as it did against India\n\nSoon after the incident, police launched a search operation in the surrounding areas to trace the abductors and recover the kidnapped workers.\n\nAccording to the KP he­­­­a­lth department spo­k­e­sperson, during this five-day campaign, nearly 7.3 million children under the age of five will be administered polio drops across the province.\n\nWhile addressing a news conference in Islamabad, Minister for Health Syed Mustafa Kamal has suggested the nation to get united against the polio just like it did during the tension and war with India earlier this month.\n\nHe visited the National Emergency Opera­tions Centre (NEOC) on the first day of the nationwide polio campaign, targeting approximately 45.4 million children under the age\n\nof five. This year, Pakistan and Afghanistan are conducting simultaneous polio cam-paigns — an unprecedented joint effort — while the rest of the world has already eliminated the disease.\n\nMr Kamal administered polio drops and provided additional vitamin A supplements to children, paying tribute to the frontline polio workers. He acknowledged their dedicated services and called upon parents across the country to fully cooperate by ensuring their children receive the vaccine.\n\nThe minister urged all parents with folded hands to understand that vaccination was essential for their children’s health and future.\n\nHe said every person has to play role for the eradication of virus of crippling disease.\n\n“Polio remains an incurable disease, unlike cancer, which can be treated, and that only through vaccination children can be protected from lifelong disability. Out of Pakistan’s 89 districts, 50 have reported the presence of poliovirus in environmental samp­l­­es.\n\nThis enemy virus is pre­­sent everywhere arou­­nd children so communities should dispel misinformation and negative notions that hinder immunisation efforts,“ he said.\n\n“Polio eradication is one of the foremost priorities of the government of Pakistan,” Mr Kamal aff­irmed.\n\n“If a child becomes disabled due to polio, parents will bear responsibility before God. We must unite as a nation, just as we stood firm against India, to defeat polio.”\n\nEncouraging community participation, the minister noted positive outcomes from recent campaigns in Karachi, where a significant reduction is witnessed in refusal cases. He called upon people to join hands in the mission to secure a safe and healthy future for the children of Pakistan and Afghanistan.\n\nIkram Junaidi in Islamabad also contributed to this report\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683504dea9690.gif",
  "retrievedAt": "2025-08-23T14:30:23.677Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913582/two-polio-workers-abducted-in-tank-as-nationwide-polio-drive-begins",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:25:40.000Z"
}
