{
  "title": "Mir Ali sit-in over alleged drone strike comes to an end as agreement reached - Pakistan - DAWN.COM",
  "author": null,
  "content": "Locals staging a sit-in against a suspected drone strike in North Waziristan’s Mir Ali tehsil last week, which claimed the lives of four children, announced on Tuesday that they have ended their protest after having reached an agreement with the local administration.\n\nFor over a week, the locals in Mir Ali had been staging a sit-in, demanding justice in the wake of a suspected strike that took place in Hurmuz village on May 19 during the daytime, leaving four children of the same family dead and injuring five others, including a woman. The Inter-Services Public Relations (ISPR) clarified that security forces were “falsely implicated” in the incident and that it was carried out by the banned Tehreek-i-Taliban Pakistan (TTP).\n\nAllama Iqbal Dawar, one of the organisers, told Dawn.com that following a series of talks held between the protesters and officials, both sides reached an agreement on late Monday night.\n\nThe bodies of the deceased have been buried, and the roads previously blocked by the protesters are now open, while officials are set to meet the affected families and announce compensatory measures soon.\n\nAdditionally, Mufti Baitullah, spokesman for the Jirga, also announced the agreement while addressing the protesters in a video seen by Dawn.com. Baitullah was seen lauding the Jirga members for playing a positive role in the whole affair.\n\nWhen approached by Dawn.com, District Police Officer Waqar Ahmad confirmed that the agreement had been signed but did not reveal any details about the pact.\n\nSimilarly, Mir Ali Tehsildar Sher Bahadar told Dawn.com that a four-point agreement had been reached. However, he too did not elaborate any further.\n\nHowever, North Waziristan Deputy Commissioner Mohammad Yousuf Karim told the local media that he had held thorough talks with the tribal leaders, assuring them that the government and the army would pay “serious attention” to the safety of the residents during operations against the militants.\n\nLast week, the local elders had threatened to march to Islamabad to protest against the drone strike in case their demands were not met.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:29:58.267Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913645/mir-ali-sit-in-over-alleged-drone-strike-comes-to-an-end-as-agreement-reached",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T14:07:35.000Z"
}
