{
  "title": "Budget features bold measures for ‘strategic direction’ - Business - DAWN.COM",
  "author": null,
  "content": "• Finance minister hints at simplified tax returns for salaried class\n• Claims every possible support to be made available for armed forces\n• Privatisation drive to be ‘accelerated’ in next fiscal year; PIA, three Discos to be privatised by year end\n• Flags population growth, climate change as existential threats\n\nISLAMABAD: Promising simplified tax returns for the salaried class, Finance Minister Muhammad Aura­ng­zeb on Monday pledged that the up­co­ming federal budget would int­ro­duce “bold measures” to steer the national economy in a strategic direction and make available whatever support is required by the armed forces.\n\nTalking to journalists after an event organised by the Pakistan Banks Association and Karandaaz Pakistan, the finance minister said that every possible support would be provided to the armed forces, stressing that it was a national need in light of recent cross-border aggression, not just a military requirement.\n\nResponding to a question, he said the IMF mission and its regional dir­e­ctor, Jihad Azour, and executive dir­ector, Bahador Bijani, had retur­ned after concluding the mission in Islam­abad and completing discussions on the broad contours of the budget.\n\nThe discussions would continue virtually this week on a few new things that might crop up from Pakistan’s side or from their side, but a lot of support was available from the IMF, he said.\n\nMr Aurangzeb said the IMF app­roved Pakistan’s first biannual rev­iew and additional financing strictly on merit because all structural and qualitative benchmarks had been completed. He noted that Pakistan’s resolve to stay the course played a key role in overcoming challenges, including attempts to derail the IMF board meeting and create problems.\n\nResponding to a question on budget delay, the minister said the country’s leadership had prioritised expressing gratitude to friendly nations who stood by Pakistan amid heightened tensions with India. Budget finalisation would resume upon the leadership’s return.\n\nEarlier, Mr Aurangzeb said Pakis­tan’s turnaround story for macroeconomic stabilisation had received glo­bal appreciation. He said an equally strong message from friends and development partners was to stay the course and that was also the government’s commitment to move ahead with structural reforms in taxation, energy, state-owned enterprises (SOEs) and public finance.\n\nHe said it was easy to go for a sugar rush and pump liquidity in the system, but that was a well-known route the country had treaded multiple times before and landed in a balance of payments crisis as Pakistan is an import-dependent economy. He promised to resist that temptation to break the boom-and-bust cycle.\n\nSimpler tax returns\n\nThe minister said the taxation reform was now led by the private sector and the purpose was to minimise human interaction through people, process and technology and address theft, leakage and corruption through transparency.\n\nHe said the government would ensure simplified tax returns and forms for the salaried class. He said that around 70 to 80 per cent of salaried people did not hold equity and fixed-income portfolios.\n\n“They receive salaries through bank accounts with tax deducted at source. They should not have to fill in 140-150 data points,” he said, adding that the government aimed to reduce that number to just nine — five for wealth tax and four for income tax.\n\nThe minister conceded that 24 state-owned enterprises transferred to the Privatisation Commission last year did not go well. However, he said the process would now be accelerated, with transactions involving Pakistan International Airlines (PIA), three power distribution companies and some financial institutions expected to reach completion by the end of this year.\n\nMr Aurangzeb said debt servicing was the single-largest expenditure on the public finance side, and therefore, the government would have to ensure fiscal discipline to reduce borrowing and thus curtail debt servicing costs.\n\nWhile the Debt Management Office is being restructured, he emphasised that its goal should go beyond reducing interest payments and instead help create economic value — or “alpha” — to put the economy on a sustainable growth path.\n\n“That is where we are going to bring very bold measures in the coming budget to give strategic direction where the economy is headed” and change the DNA of the economy and not to just give an account of expenditure and revenue, Mr Aurangzeb said.\n\nHowever, he warned that population growth and climate change were existential threats already impacting the country. Therefore, the government was also engaged with development partners and the IMF to support adaptation policies, he added.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:18:36.269Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913573/budget-features-bold-measures-for-strategic-direction",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:25:25.000Z"
}
