{
  "title": "Gohar sees Imran’s release before Eid; Aleema disagrees - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Jailed leader’s sister says rumours being spread to keep masses away from holding protest\n• Claims ex-PM has cautioned PTI leaders against ‘playing from both sides’\n• FIA court holds hearing in Bvlgari jewellery set case\n\nISLAMABAD: While PTI Chairman Barrister Gohar Ali Khan on Monday expressed the hope that Imran Khan will be released before Eidul Azha, the ex-PM’s sister said such rumours were being spread to cool down the nation aimed at keeping them from holding protests.\n\nAleema Khan, while quoting her brother, said that soon a countrywide movement will be launched and asked the party leaders to stop playing from both sides.\n\nBarrister Gohar said the legal team was hopeful that cases against the incarcerated leader will be fixed soon and he will be released before Eid.\n\nHe urged the party workers to remain calm and assured them that all possible efforts were being made to get Imran Khan freed.\n\nAleema Khan while speaking to media outside Adiala Jail disagreed with Barrister Gohar’s optimism saying such rumours were being spread to calm down the PTI supporters.\n\nShe complained that ex-PM’s children were allowed to speak to him only once during the past eight months and his medical check-up directives were also not being implemented.\n\n“Even books are not allowed into the cell. Imran Khan has said that he will not kneel down even if he would be kept in the jail for the rest of his life. Tens of Vloggers are claiming on a daily basis that some important personality has met Imran Khan. Others said some American had called on him. However, the fact is that all such claims are rumours and they are being spread to cool down the supporters,” she asserted.\n\nAleema Khan said that in a message to party leaders her brother had stated that even his family members had been kept in jail. “Hassan Niazi has been imprisoned for 10 years,” she said.\n\nShe quoted Imran Khan as saying that PTI has an ideology and he has been watching everyone. Those who have been playing a double game should decide about their future. She also quoted him as saying that even judges were not able to decide the cases. She said the former premier had directed the party workers to start preparations for the countrywide mass movement.\n\nAccording to her, he said that PTI would stand by the judges. “I will not call anyone to Islamabad as there will be snipers but party should start preparations for the countrywide mass movement,” she said while sharing Imran Khan’s message.\n\nAleema Khan voiced concerns about the conditions of her brother’s imprisonment, claiming that even basic facilities meant for general prisoners were being denied to him.\n\nShe claimed that Bushra Bibi, who is accused of aiding and abetting in a corruption case, is being held in isolation to exert pressure on him. She expressed concerns that appeals were not being heard and alleged that judges had gone back on their word to take up the cases.\n\nFIA court hears case\n\nMeanwhile, the Special Court of Federal Investigation Agency completed the cross-examination of sixth prosecution witness in a case related to Toshakhana’s Bvlgari Jewellery set.\n\nSpecial Judge Central Shahrukh Arjumand presided over the hearing held inside the Adiala Jail.\n\nImran Khan and his wife Bushra Bibi were presented before the court where PTI lawyer Qusain Faisal Mufti completed the cross-examination of NAB Additional Director Qaiser Mahmood.\n\nA total of six witnesses have been cross-examined so far. The court announced that the statements of other witnesses will be recorded in the next hearing scheduled for May 31.\n\nPublished in Dawn, May 27th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/271556539d2f326.jpg",
  "retrievedAt": "2025-08-23T14:30:29.394Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913585/gohar-sees-imrans-release-before-eid-aleema-disagrees",
  "dateList": "2025-05-27",
  "date_published": "2025-05-27T00:25:40.000Z"
}
