{
  "title": "CM KP directs issuance of ‘Fard’ to applicants within two days",
  "link": "https://www.app.com.pk/national/cm-kp-directs-issuance-of-fard-to-applicants-within-two-days/",
  "date_published": "2020-12-28T14:23:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Dec 28 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan Monday directed the authority of Revenue Department to ensure issuance of “Fard” to the applicants within two days otherwise stern action would be taken against the concerned Patwaris.\nHe issued these directives while presiding over a meeting of the provincial cabinet here.\nMembers of the provincial cabinet, Chief Secretary, Additional Chief Secretary and administrative secretaries attended the cabinet meeting.\nThe Chief Minister further directed the Revenue Department to bring necessary amendments in the rules for transfer of Patwaris at divisional level so that inter-districts transfers of Patwaris could be made within a division.\nHe directed all the departments to ensure approval of all their projects included in the Annual Development Programme upto December 31, 2020 adding that he would convene a review meeting in the first week of January 2021 as no leniency will be tolerated in this regard.\nThe Chief Minister further directed the concerned authorities to construct sheds for labourers waiting on foot-paths to earn livelihood.\nReferring to the establishment of “Panahgahs” which is a flagship initiative of the present government, the Chief Minister directed the Social Welfare Department to make all the “Panahgahs” in the province fully functional in view of the recent cold wave and the best arrangements and facilities should be provided for spending the night and ensuring that no one is forced to spend the night under the open sky in winter season.\nThe chief minister in this connection also directed to make proper arrangements for their meal.\nThe Chief Minister also directed the Minerals Department to take stern action for curbing the illegal extraction of sand and gravel from the rivers in Swat and submit a report in this regard within a week.\nHe also directed the Forest Department to take effective action against illegal deforestation in some parts of the province.\nThe Chief Minister directed the Industries Department to complete the preparations for the inauguration of two to three new Economic Zones in the month of January and expedite the work on providing electricity to the local industries at affordable rates.\nHe also directed for preparation of Action Plan to relocate the established marble factories on Warsak Road, Peshawar.\nLater, briefing the media about the decisions of the Cabinet meeting, Special Assistant to the Chief Minister for Information Kamran Bangash said that the cabinet had given conditional approval to the revised Industrial Policy 2020 under which various measures have been proposed for industrial development in the province.\nProminent features of the policy include provision of various incentives to investors for promotion of domestic and foreign investment, linkages with industries, provision of facilities to industrialists under one-window operation for small and medium enterprises.\nThese also include provision of easy loans, provision of conducive environment for setting up industries in the province and rehabilitation of old and sick industries.\nThe cabinet conditionally approved amendments to the Khyber Pakhtunkhwa Arms Rules 2014, aimed at ensuring implementation of SOPs for shooting / gun clubs.\nSimilarly, the cabinet also approved the Khyber Pakhtunkhwa Sentencing Bill 2020 under which minimum and maximum punishments have been proposed to facilitate the judiciary.\nThe bill proposes the establishment of a sentencing council, which will make recommendations for the overall improvement of the criminal justice system.\nThe meeting also approved the Khyber Pakhtunkhwa Legal Aid Rules 2020, under which the government will provide legal aid to all those who cannot afford to pursue their cases in the courts.\nA simple procedure has been formulated for the purpose of appointment of lawyers and determination of fees for this purpose.\nThe cabinet also approved procurement of vehicles for the newly appointed Additional District and Sessions Judges. The cabinet also approved the appointment of new members for the Board of Directors of Water and Sanitation Companies Mardan, DI Khan, Bannu and Abbottabad.\nThe cabinet also approved the establishment of Khyber Pakhtunkhwa Skills Development Fund Company and also deliberated on the appointment of its Chief Executive Officer and Directors.\nThe cabinet constituted a committee comprising Cabinet Members Akbar Ayub, Sultan Khan, Timur Jhagra, Shahram Turki, Abdul Karim Khan and Shaukat Yousafzai to further improve the draft proposal and table their recommendations in the next meeting of the cabinet.\nThe Special Assistant further said that the cabinet also approved the provision of funds for generating employment opportunities for the youth and women-folk under the special initiatives of the Department of Sports, Tourism, Culture and Youth Affairs.\nUnder this programme, youth will be provided interest free loans ranging from Rs. 5 to 20 lakhs in addition to providing necessary training for initiation of their own businesses. 20% of interest free loans will be specified for minorities, persons with disabilities and transgenders.\nSimilarly, the cabinet also approved the Khyber Pakhtunkhwa Youth Endowment Fund Management,\nMaintenance of Accounts & Audit Rules 2020 and Khyber Pakhtunkhwa Youth Affairs Management and disposal of immovable properties\n“maintenance of accounts and Khyber Pakhtunkhwa Prohibition of non-bio degradable plastic products” to discourage the use of polythene bags.",
  "retrievedAt": "2025-08-11T20:11:37.253Z"
}
