{
  "title": "Project launched to adapt climate change impacts for vulnerable communities",
  "link": "https://www.app.com.pk/national/project-launched-to-adapt-climate-change-impacts-for-vulnerable-communities/",
  "date_published": "2020-12-28T10:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 27 (APP): The Adaptation Fund of USD 6.094 million project aimed to enhance resilience to water scarcity, caused by floods and droughts at community level, district/city and national/provincial level in Rawalpindi and Nowshera cities.\nThe project developed by UN-Habitat in collaboration with the government of Pakistan and other stakeholders, said a press release issued here.\nReducing the impact of flooding and droughts was becoming one of the top priorities of the government.\nThe project will install rainwater harvesting units both at household level and public buildings to demonstrate cost-effective solution to adapt to both floods and droughts.\nTo scale the project’s approach, a national urban strategy will be developed, focusing on climate change impacts, particularly floods and water scarcity (and resulting public health problems), while also employing a spatial planning approach.\nThe project will be implemented by UN-Habitat, Ministry of Climate Change, National Disaster Management Authority, Pakistan Council for Research on Water Resources.\nIn light of the current COVID-19 crisis, the rainwater harvesting units are extremely relevant as these interventions will improve the hygienic conditions of the local communities.\nThe needs of the most vulnerable will be considered at all stages of the process. Mio Sato, Acting Resident Coordinator UN appreciated the efforts of MOCC and UN Habitat for launching the climate change adaptation project. Climate Change and Environmental Sustainability has been one of the priority of United Nations.\nShe emphasized UN common approach mainstreaming in projects and programming to pave the way for a sustainable flood and drought management at all levels and create a model for climate resilient urban development and management in Pakistan.\nIrfan Tariq, DG MOCC explained that Pakistan is one of the severely climate change impacted country although its GHG emissions are low.\nClimate Change adaptation is the priority of government. In this context, this project is important and would be curtain raiser for adaptation activities and will be instrumental in building climate change-related resilience in Rawalpindi and Nowshera. districts.\nHe reaffirmed the commitment of local authorities to provide support for a successful implementation.",
  "retrievedAt": "2025-08-11T20:11:39.277Z"
}
