{
  "title": "Bangladesh drops Sheikh Mujib from currency - World - DAWN.COM",
  "author": null,
  "content": "• New notes feature natural landscapes and landmarks, not leaders\n• Hasina’s trial over ordering mass killings kicks off\n• Top court overturns ban on Jamaat-i-Islami\n\nDHAKA: Bangladesh on Sunday began issuing new banknotes removing images of its founding president, Sheikh Mujibur Rahman, the father of ousted prime minister Sheikh Hasina, whose trial on charges of orchestrating crimes against humanity also commenced in her absence.\n\nThe caretaker government, which has run the South Asian nation of some 170 million people since Ms Hasina fled last year, introduced the currency changes as it navigates a volatile political landscape.\n\nMs Hasina, 77, was overthrown in August 2024 following a student-led uprising.\n\n“Under the new series and design, the notes will not feature any human portraits, but will instead showcase natural landscapes and traditional landmarks,” Bangladesh Bank spokesman Arif Hossain Khan said.\n\nUntil now, all notes featured the portrait of Sheikh Mujibur Rahman, who led Bangladesh to independence from Pakistan in 1971 and was assassinated in a 1975 coup.\n\nNew designs for the Muslim-majority nation include images of Hindu and Buddhist temples, historical palaces, artwork by the late painter Zainul Abedin depicting the Bengal famine, and the national martyrs’ memorial.\n\nOn Sunday, notes for three of the nine denominations were released. “The new notes will be issued from the central bank’s headquarters, and later from its other offices across the country,” Khan added, noting that “other denominations of the notes with new designs will be released in phases.” Existing notes and coins will remain legal tender.\n\nThis is not the first time banknote designs have reflected political shifts.\n\nInitial 1972 notes featured a map, later replaced by Sheikh Mujibur Rahman’s image during periods led by his Awami League party. When the rival Bangladesh Nationalist Party was in power, historic sites were featured.\n\n‘Systematic attack’\n\nMeanwhile, at the opening of Ms Hasina’s trial, prosecutors alleged she orchestrated a “systematic attack” to crush the uprising that toppled her.\n\nUp to 1,400 people were killed between July and August 2024 during her government’s crackdown, according to the United Nations.\n\nMs Hasina, in self-imposed exile in India, has defied an extradition order and rejected the charges as politically motivated.\n\nBangladesh’s International Crimes Tribunal (ICT) is prosecuting former senior figures linked to Ms Hasina’s ousted government and her now-banned Awami League party.\n\n“Upon scrutinising the evidence, we reached the conclusion that it was a coordinated, widespread and systematic attack,” ICT chief prosecutor Mohammad Tajul Islam told the court.\n\nMr Islam lodged five charges each against Ms Hasina, ex-police chief Chowdhury Abdullah Al Mamun (in custody) and former interior minister Asaduzzaman Khan Kamal (on the run), including “abetment, incitement, complicity, facilitation, conspiracy, and failure to prevent mass murder”.\n\n‘Not an act of vendetta’\n\nProsecutor vowed impartiality, saying, “This is not an act of vendetta but a commitment to the principle that, in a democratic country, there is no room for crimes against humanity.”\n\nInvestigators have reportedly collected extensive evidence, including video footage and Ms Hasina’s phone conversations.\n\nThe prosecution alleged Ms Hasina ordered security forces to crush protesters, including directing them to open fire from helicopters, and specifically ordered the killing of student protester Abu Sayeed. They say such acts are tantamount to “crimes against humanity”.\n\nThe ICT court opened its first trial connected to Ms Hasina’s government on May 25. In that case, eight police officials face charges of crimes against humanity over the killing of six protesters on August 5, the day that Ms Hasina fled the country. Four of the officers are in custody and four are being tried in absentia.\n\nJI’s registration restored\n\nOn the other hand, the Supreme Court of Bangladesh on Sunday restored the registration of Bangladesh’s largest Islamist party, Jamaat-i-Islami, allowing it to participate in future elections.\n\nThe court overturned a 2013 high court order, initiated under Ms Hasina’s government, that had banned the party. “The Election Commission is directed to deal with the registration of that party in accordance with law,” commission lawyer Towhidul Islam told AFP.\n\nThe party’s lawyer, Shishir Monir, said the decision would allow a “democratic, inclusive and multi-party system.” Ms Hasina had banned Jamaat-i-Islami, rivals of her father, and cracked down on its leaders. The Awami League itself was banned in May by the interim government, pending the outcome of trials against Hasina and other leaders.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683d06638f33f.jpg",
  "retrievedAt": "2025-08-18T03:07:33.500Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914854/bangladesh-drops-sheikh-mujib-from-currency",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:03:31.000Z"
}
