{
  "title": "Haris’ blistering ton sees Pakistan complete T20 series sweep over Bangladesh - Sport - DAWN.COM",
  "author": null,
  "content": "LAHORE: Pakistan’s pursuit of adapting the “modern-day” approach towards white-ball cricket seemed to have reached manifestation in the first two games of their three-match Twenty20 International series against Bangladesh.\n\nBut on Sunday night, here at the Gadd­afi Stadium, in front of jam-packed sta­nds, it was evident that the hosts were transitioning quite well into the new style.\n\nAnd it was Mohammad Haris who demonstrated it in the most brutal of ways, plundering a 45-ball century — his maiden T20I ton — to see Pakistan thrash Bangladesh by seven wickets in the third and final match of the series, completing the clean sweep — the side’s first series win at home since December 2021.\n\nThe wicket-keeper/batter — the first Pakistan non-opener to score a T20I century — remained unbeaten on 107 off 46 balls, having struck eight fours and seven sixes, as Pakistan chased down the 197-run target with 16 balls to spare.\n\nHaris came in to bat after Pakistan had lost opener Sahibzada Farhan in the first over — and never looked back.\n\nThe right-hander started with consecutive fours off pacer Hasan Mahmud before taking on Mehidy Hasan Miraz for another.\n\nHaris smashed Khaled Ahmed’s pace past deep square, then lifted the right-armer over deep fine-leg for his first six. Saim Ayub, who had struggled for runs in the first two matches, pulled Mahmud for a six and a four in the next over as Pakistan reached 56-1 at the end of the powerplay.\n\nSaim bludgeoned pacer Tanzim Hasan for a towering six over deep midwicket before cutting Rishad Hossain for a four, while Haris pulled the leg-spinner’s half-tracker for his second six in the eighth over.\n\nAfter Haris brought up his maiden T20I fifty with a six and a four off Tanzim, Saim (45 off 29, two fours and four sixes) holed out to Tanzid Hasan at long-on.\n\nThe incoming Hasan Nawaz played Tanzim deftly to get off the mark with a four before lifting Rishad gracefully over wide long-off as Pakistan cruised. Hasan, however, departed in the 13th over after clubbing Mehidy for a six and a four, leaving Pakistan needing 60 runs in seven overs.\n\nHaris’ flow never broke; the right-hander creamed Tanzim over mid-off for six before picking two boundaries off Rishad in the next over, which also saw Pakistan captain Salman Ali Agha drive the spinner over the infield and through the covers.\n\nHaris went after Khaled for another maximum over long-leg and cracked Mahmud through the off-side before bringing up his century with a double. He cleared the long-off boundary once again before Salman finished the game off with a four and a single off Towhid Hridoy in the 18th over.\n\nEarlier, a brisk 110-run opening stand between Tanzid Hasan and Parvez Hossain had powered Bangladesh to 196-6, but Pakistan clawed back in the death overs, led by Abbas Afridi’s disciplined bowling at the backend of the innings.\n\nParvez was the aggressor early on, smashing 66 off just 34 deliveries — laced with seven boundaries and four sixes — while Tanzid added a steady 42 off 32 balls (three fours and three sixes). Their partnership laid a solid foundation before Pakistan hit back in the second half of the innings.\n\nAbbas, who was expensive in his initial spell, returned with precision at the death, conceding just eight runs in his final two overs and finishing with figures of 2-26. Pakistan restricted the visitors to just 46 runs in the final five overs while claiming four wickets.\n\nPakistan’s decision to open the bowling with Saim backfired as Parvez took him apart in the third over, hitting two sixes down the ground and sweeping him for four. Tanzid continued the assault in the following over, striking Hasan Ali for two boundaries before Parvez added two more off Faheem Ashraf.\n\nThe momentum continued as Abbas was also dispatched for boundaries in the sixth over, with Bangladesh reaching 53-0 by the end of the powerplay.\n\nTanzid then took on skipper Salman, lofting him for six, before Parvez attacked in-form spinner Abrar Ahmed, smashing him for a six over midwicket and following up with back-to-back boundaries to bring up his fifty in just 26 balls.\n\nAt the halfway mark, Bangladesh stood at 99 without loss. The breakthrough finally came in the 11th over when Tanzid was caught at short fine-leg by Abrar off Faheem, but not before Parvez had launched him for a six and a four.\n\nParvez departed soon after, miscuing a sweep to Haris behind the wickets. However, Towhid and skipper Litton Das consolidated, taking Bangladesh to 150-2 by the end of the 15th over.\n\nAbbas returned to bowl a tight 15th over, giving away only six runs. Litton ended a brief boundary drought with a four off Hasan Ali but was bowled on the very next ball while attempting a ramp shot.\n\nShamim Hossain provided a brief flourish with two boundaries off Hasan, but Abbas struck again in the 18th over, dismissing both Shamim and Towhid while conceding just two runs.\n\nJaker Ali chipped in with a four and a six off Faheem in the penultimate over, while Tanzim hit a six off a no-ball from Hasan Ali, who had earlier removed Mehidy.\n\nScoreboard\n\nBANGLADESH:\n\nTanzid Hasan c Abrar b Faheem 42\n\nParvez Hossain c Haris b Shadab 66\n\nLitton Das b Hasan 22\n\nTowhid Hridoy c Saim b Abbas 25\n\nShamim Hossain c Haris b Abbas 8\n\nJaker Ali not out 15\n\nMehidy Hasan c Nawaz b Hasan 1\n\nTanzim Hasan not out 8\n\nEXTRAS (B-1, LB-2, NB-1, W-5) 9\n\nTOTAL (for six wkts, 20 overs) 196\n\nDID NOT BAT: Rishad Hossain, Hasan Mahmud, Khaled Ahmed\n\nFALL OF WICKETS: 1-110 (Tanzid), 2-113 (Parvez), 3-162 (Litton), 4-171 (Shamim), 5-172 (Towhid), 6-184 (Mehidy)\n\nBOWLING: Saim 2-0-24-0, Hasan 4-0-38-2 (1w, 1nb), Faheem 4-0-41-1, Abbas 4-0-26-2, Salman 1-0-11-0 (1w), Abrar 2-0-27-0, Shadab 3-0-26-1 (2w)\n\nPAKISTAN:\n\nSahibzada Farhan c Rishad b Mehidy 1\n\nSaim Ayub c Tanzid b Tanzim 45\n\nMohammad Haris not out 107\n\nHasan Nawaz c Rishad b Mehidy 26\n\nSalman Ali Agha not out 15\n\nEXTRAS (LB-1, W-2) 3\n\nTOTAL (for three wkts, 17.2 overs) 197\n\nDID NOT BAT: Shadab Khan, Khushdil Shah, Faheem Ashraf, Abbas Afridi, Hasan Ali, Abrar Ahmed\n\nFALL OF WICKETS: 1-8 (Farhan), 2-100 (Saim), 3-137 (Nawaz)\n\nBOWLING: Mehidy 3-0-26-2, Hasan 3-0-42-0 (2w), Khaled 4-0-37-0, Tanzim 3-0-36-1, Rishad 3-0-39-0, Shamim 1-0-11-0, Towhid 0.2-0-5-0\n\nRESULT: Pakistan won by seven wickets.\n\nPLAYER-OF-THE-MATCH: Mohammad Haris\n\nSERIES: Pakistan won the three-match series 3-0.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683d0ea47b999.jpg",
  "retrievedAt": "2025-08-18T03:07:29.619Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914893/haris-blistering-ton-sees-pakistan-complete-t20-series-sweep-over-bangladesh",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:40:44.000Z"
}
