{
  "title": "Fending for the regular folk - Business - DAWN.COM",
  "author": null,
  "content": "Promises of prosperity often mask a chain of dependency. Across countries and through time, governments have insisted that their policies are designed to serve the common man. From the most advanced economies to the developing world, this narrative is persistent, and Pakistan is no exception.\n\nGovernments primarily generate revenue through taxation and borrowing. As such, their objectives should be twofold: to provide essential services and to invest in projects that expand the future tax base, reducing reliance on debt. Unfortunately, Pakistan’s public sector has not succeeded in both respects. The case of state-owned enterprises (SOEs) illustrates this dysfunction well. These entities were envisioned to serve the nation but have become financial black holes. Over the past decade alone, losses from SOEs have crossed Rs1 trillion.\n\nThe Pakistan International Airlines (PIA) continues to operate under a staggering financial deficit, a burden that weighs heavily on the national exchequer. It is severely overstaffed — largely due to political pressures that obstruct necessary reforms — but it is also paralysed by a systemic aversion to risk. With no incentive to make a profit and jobs being needlessly protected, innovation is stifled, and with a decision-making process designed to avoid responsibility, choices are either indefinitely delayed or doomed from the outset.\n\nOver the past decade, PIA alone has incurred losses amounting to nearly Rs1tr, which is roughly Rs140 million, for each of its 7,000 employees. No government in the last few decades has come up with a single good reason to keep on losing this much money.\n\nReal prosperity can only emerge when the state acts as a facilitator, not a hurdle, allowing markets and merit to drive the nation forward\n\nAnother area rife with unintended consequences is minimum wage legislation. These laws, intended to ensure a livable income, often result in the opposite. Businesses unable to afford increased wages either cut jobs or turned to automation. Ironically, the policy designed to protect workers ends up pushing them out of the workforce. The minimum wage in Pakistan has reportedly increased tenfold over the past decade. While that may seem like progress on paper, artificially high wages create inefficiencies. Industries shut down, relocate, or begin underreporting employment to bypass regulations, all of which leads to greater unemployment.\n\nFurthermore, the government continues to allocate significant resources to the Benazir Income Support Programme, a commendable initiative on paper aimed at alleviating poverty. The amount the government spends on this programme is over a staggering Rs500 billion. What if, instead of relying so heavily on cash handouts, we spent this money preparing younger generations so that they can earn in the future?\n\nPerhaps an even more essential question to ask is whether we’re truly preparing our citizens for a future dominated by artificial intelligence and rapid technological change? Without robust schools and accessible healthcare, do we risk perpetuating dependency rather than fostering the skills and resilience people need to thrive?\n\nSadly, government subsidies — particularly in agriculture and essential commodities — often miss their mark. The government provides gas at below-market prices to fertiliser companies, intending to support farmers. Yet those companies sell the fertiliser at the open-market price. As a result, farmers see little to no reduction in the price they pay, and the subsidy fails to reach its intended beneficiaries.\n\nAttempts at collecting taxes at higher rates don’t work anywhere in the world; the result is low investment and tax evasion, though lower taxes have enabled growth, which results in a higher value being collected\n\nThe exchange rate mismanagement offers another cautionary tale. The forward rates always reflect the difference in interest rates between any two currencies. Here we debate about whether devaluing the rupee boosts exports.\n\nIf we look at interest rate comparisons between the US dollar (USD) and the United Arab Emirates’ dirham and Hong Kong dollar, these two currencies have maintained the same conversion rates with the USD for a long time. We will also see that the interest rates in these currencies are also closely pegged to the USD, whereas in Pakistan, the difference runs at around 8pc, which is what our average devaluation is over many years.\n\nWe can’t have our cake and eat it too. The outcome is simple: either we keep the rupee pegged to the USD and then also keep the interest rate the same as USD interest rates or devalue the rupee. We have experimented with artificially keeping the rupee stable against the USD; however, the math always adjusts in the end with great volatility.\n\nTo truly serve the common man, we need a shift in mindset and method. Tax reform is a critical starting point. Lowering the tax burden on individuals and businesses can stimulate economic activity, create jobs, and improve living standards. Attempts at collecting taxes at higher rates don’t work anywhere in the world. The result is low investment and tax evasion. On the other hand, lower taxes have enabled growth, which results in a higher value being collected.\n\nMany government programmes claim to serve the common man but often fall short in practice, fostering dependency. For meaningful and lasting progress, policies must shift toward promoting economic freedom, reducing wasteful expenditures, and prioritising sustainable, inclusive growth.\n\nCrucially, the government must also uphold the sanctity of contracts — a fundamental pillar of any functioning economy. When the state itself becomes an unpredictable party against businesses, it erodes investor confidence and turns opportunity into risk.\n\nWithout a stable, rule-based environment, people will hesitate to invest, innovate, or build. Real prosperity can only emerge when the state acts as a facilitator, not a hurdle, allowing markets and merit to drive the nation forward. This is the only way to benefit the ordinary citizen.\n\nThe writer is Chairman, Nishat Chunian Ltd.\nX: @UnapologeticCapitalist\n\nPublished in Dawn, The Business and Finance Weekly, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:25.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914931/fending-for-the-regular-folk",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T03:16:41.000Z"
}
