{
  "title": "Govt to prioritise high-value projects as development budget stands at Rs880bn only: Ahsan Iqbal - Pakistan - DAWN.COM",
  "author": null,
  "content": "Federal Minister for Planning, Development, and Special Initiatives Ahsan Iqbal on Monday said the government will have to prioritise high-value projects, as only Rs880 billion has been allocated for development in the upcoming budget for the fiscal year 2025-26.\n\nThe government has adopted austerity measures for the upcoming budget — set to be announced on June 10 — in line with the demands of the International Monetary Fund (IMF) to implement stricter spending policies and raise revenues to reduce the budget deficit and improve debt sustainability, as part of its $7 billion loan programme. The global money lender also expects Pakistan to achieve a 3.6 per cent economic growth with 7.7pc inflation next year.\n\nSpeaking to reporters in Islamabad after a meeting of the Annual Plan Coordination Committee, the planning minister noted that since 2023, the development budget had decreased, stating that Pakistan was observing “tight financial discipline in order to balance spending and income” — a process he said had been agreed upon with the IMF.\n\n“Pakistan has faced such severe inflation that the federal government would end up spending the money it collected from the provincial governments to pay off loans,” he explained.\n\n“The reason we have these debts is because the govt in power between 2018 and 2022 took multiple loans and the policy rate rose to 23pc due to heavy inflation,” Iqbal added. “Repaying those loans became 55pc of our spending. As a result, this has affected our development budget.”\n\n“Since resources are limited, we need to focus on high-priority projects for national development. We need to ensure ‘value for money’ in selecting projects.\n\n“Efficiency and prioritisation of investment are two important pillars to fulfil lack of resources,” the federal minister said earlier while addressing the committee meeting.\n\nHe said that fiscal space will be provided in the next PSDP for projects of strategic importance. He said efforts have been made to align the development budget with national priorities while staying within limited resources.\n\nThe minister recalled that when the PML-N was voted out of government in 2018, the defence and development budgets were Rs1 trillion each.\n\nBreaking down the development budget, Iqbal said that Rs664bn would be allocated to infrastructure projects including energy, water, transport and planning.\n\n“The energy, water and highway sectors will be prioritised,” he noted.\n\nHe added that Prime Minister Shehbaz Sharif had ordered that Rs120bn of the Rs1 trillion development budget be allocated to upgrade the N-25 Highway in Balochistan, which runs from Chaman to Karachi through Quetta.\n\n“The road will be upgraded to an expressway,” he said. “Excepting this project, we have Rs880bn with which we have to balance the PSDP (Public Sector Development Programme).”\n\nIqbal further said that special areas such as Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan would receive Rs63bn, while the merged districts in Khyber-Pakhtunkhwa would receive Rs70bn.\n\n“Science and IT (Information Technology) will receive Rs53bn, bodies performing institutional reform will get Rs9bn, while the production sector will receive Rs11bn. Altogether, this makes Rs1tr,” he outlined.\n\n“Our guiding principle was to make sure that we prioritise projects for which we have rupee cover and foreign funding available,” Iqbal explained. “Those projects of national importance are protected. At the same time, projects in their advanced stages will also receive funding to achieve completion.\n\n“We will move away from token allocation as it renders projects unhealthy,” he added, further stating that the government will try and ensure transparency through a comprehensive monitoring system where projects will be observed by satellite.\n\nOutlining the government’s annual plan, Iqbal expected Pakistan’s GDP to grow by 4.2 per cent.\n\nHe added, “4.5pc of that will be agriculture, 4.3pc from industry and 4pc from services.”\n\nThe planning minister said that the country set a target of $35bn for its exports and $39bn for foreign remittances.\n\n“Remittances reached $27bn in 2022-23 and can reach $37bn in 2024-25 — an increase of $10bn,” he said. “I want to thank overseas Pakistanis for ignoring negative calls and claims that ‘overseas Pakistanis are upset’ and calls for boycotts and continuing to send remittances.\n\n“It is a very big contribution and it is like oxygen to us,” he added, stating that there is scope for remittance figures to climb to $50bn in the future.\n\nIqbal mentioned that Pakistan had among the lowest tax-to-GDP ratios in the world. “We are ranked among the lowest tax collectors in the world. The rate is hardly 10pc whereas developing countries ahead of us collect 16-18pc,” he said.\n\n“If we are serious about the nation’s development, then tax collection, tax evasion, and tax reforms will have to be considered as an aspect of national security as the top most priority,” the minister asserted.\n\n“Every citizen should be watchman against tax evasion,” adding that the government is taking action against those earning millions but not paying taxes. He urged tax paying citizens to cooperate with the government against evaders.\n\nIqbal mentioned that within the next five years, the government needs to raised large amount of resources to fulfill the development budget.\n\n“Last fiscal year, we started with Rs1400 billion, but it was reduced to Rs1100 bn. This year it has further reduced to Rs1000 bn. I think this raises a huge question mark about our future and is a sign for concern,” the minister cautioned.\n\n“To reverse this situation, we need to increase the tax collection by huge proportions.”\n\nHe said the federal government will hand over development projects by provinces to the provincial governments and focus on projects by the Centre, adding that such projects are a huge strain on resources.\n\nHe mentioned that the federal budget has projects devolved to provinces but still a responsibility of the federal government, adding such projects have “reduced the space” of the Centre.\n\n“Till 2018, PSDP hardly had 12-14 pct provincial projects. Between 2012-2013, the federal government moved forward with record development projects. “After 2018, provincial projects began to creep in. By 2022, when we came back (to power), they were around 40 pct.”\n\nIqbal said while selecting PSDP for the upcoming year, the government ensured that international projects or those linked with multi-lateral organisations should be provided rupee cover as the top most priority.\n\nHe said the government ensured that allocations of resources for regions such a Gilgit-Baltistan, Azad Kashmir, and merged areas are protected and there is no deduction so their requirements are fulfilled.\n\nHe said the third priority was that projects 70-80 pct in completion phase are allocated huge sums so they are completed and “moved from the books and improve our portfolio” and do not incur further costs.\n\nFurthermore, he said under Uraan Pakistan initiative, the government needs to ensure that projects of “strategic importance” are allocated sufficient funds. This includes funds for Diamer Basha dam which is vital to address the water crisis that the government will have to complete with speed.\n\nFor connectivity, he said projects like Sukkur-Hyderabad motorway, Quetta-Chaman road, and second phase of Karakoram highway need to be prioritised.\n\nIqbal called for allocating funds to incomplete projects of Higher Education Commission so that the youth are not affected.\n\n“We need to increase tertiary education by three times. Pakistan already have the lowest ratio in the region. Our ratio is 13 pct, India has 30 pct, Bangladesh has 25 pct, and China has 60 pct. We need to increase it in the future,” he asserted.\n\nRegarding projects on low priority that could be frozen or shut down, the minister said the government has identified 118 projects worth Rs1000bn that need to be placed on low priority or capped to save resources.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/02162902ab5daa3.jpg",
  "retrievedAt": "2025-08-18T03:07:13.084Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914987/govt-to-prioritise-high-value-projects-as-development-budget-stands-at-rs880bn-only-ahsan-iqbal",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T13:36:50.000Z"
}
