{
  "title": "Eight injured in ‘flamethrower’ attack on Israeli hostage protest in US - World - DAWN.COM",
  "author": null,
  "content": "In the face of rising criticism of Israeli atrocities on Gaza, which has killed nearly 54,000 Palestinians, a man in the United States yelling “free Palestine” used incendiary devices to torch protesters rallying in support of Israeli hostages, injuring at least eight people in the US state of Colorado on Sunday.\n\nThe FBI said it was investigating the incident as a “targeted terror attack” and identified the suspect as 45-year-old Mohamed Sabry Soliman.\n\nHe was booked into the county jail just before midnight on multiple felony charges, according to county records. His bond has been set at $10 million.\n\nThe incident comes as pressure on Israel rises to cease what has been called a “genocide” in Gaza by the United Nations and Amnesty International among other international human rights organisations.\n\nPolice in the city of Boulder said it was too early to determine a motive for the attack, which took place shortly before 1:30pm (12:30am PKT) at a demonstration outside a mall.\n\nThe Anti-Defamation League, a Jewish activist group, said the “violent anti-Semitic attack” occurred at Sunday’s “Run for Their Lives” event, a weekly gathering of the Jewish community in solidarity with hostages seized during Hamas’ October 7, 2023, attack on Israel, sparking the onslaught in Gaza.\n\nFBI agent Mark Michalek told reporters the attack happened at a “regularly scheduled weekly peaceful event”.\n\n“Witnesses are reporting that the subject used a makeshift flamethrower and threw an incendiary into the crowd,” he said, adding that “the suspect was heard to yell: ‘Free Palestine!’”\n\nBoulder Police said that eight victims, four men and four women aged between 52 and 88, were transported to hospitals.\n\nBoulder Police Chief Steve Redfearn told reporters that “at least one victim was very seriously injured, probably safe to say critical condition.”\n\nThe suspect was also injured before being taken into custody, Redfearn said.\n\nIn one video that purportedly shows the attack, a shirtless man holding clear bottles in his hands is seen pacing as the grass in front of him burns.\n\nHe can be heard screaming “End Zionists!” and “They are killers!” towards several people in red T-shirts as they tend to a person lying on the ground.\n\nOther images showed billowing black smoke.\n\nBoulder resident Alexis Cendon said he felt “very, very scared” after hearing about the attack near his workplace.\n\nSunday’s attack occurred during the Jewish holiday of Shavuot.\n\nIt comes almost two weeks after the fatal shooting of two Israeli embassy staffers outside a Jewish museum in Washington, where a 31-year-old suspect, who shouted “Free Palestine,” was arrested.\n\nBoulder Police Chief Redfearn insisted it was “way too early to speculate motive,” but FBI chief Kash Patel described the incident as “a targeted terror attack”.\n\nColorado Attorney General Phil Weiser labelled it “a hate crime”.\n\n“People may have differing views about world events and the Israeli-Hamas conflict, but violence is never the answer to settling differences,” Weiser said.\n\nWhite House Deputy Chief of Staff Stephen Miller posted on X that the suspect was a foreign national who “illegally overstayed [his] visa”.\n\nFox News and CBS both cited US officials as saying Soliman was an Egyptian national.\n\nThe White House said President Donald Trump had been briefed on the incident.\n\nIsrael’s top diplomat Gideon Saar condemned Sunday’s “terrible anti-Semitic terror attack targeting Jews in Boulder”.\n\nIsraeli Ambassador to the United Nations Danny Danon also voiced outrage.\n\nUS Secretary of State Marco Rubio also described the Boulder incident as a “targeted terror attack,” while Attorney General Pam Bondi termed it “a horrific anti-Semitic attack”. Lawmakers on both sides of the political aisle expressed revulsion.\n\n“Tonight, a peaceful demonstration was targeted in a vile, antisemitic act of terror,” top Senate Democrat Chuck Schumer said in a statement. “Once again, Jews are left reeling from repeated acts of violence and terror.”\n\nSeveral organisations also decried the violence.\n\n“This is an attack on all of us — and we will not stay silent,” the Israeli-American Council said in a statement.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/0217570709e810a.jpg",
  "retrievedAt": "2025-08-18T03:07:14.413Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914996/eight-injured-in-flamethrower-attack-on-israeli-hostage-protest-in-us",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T12:59:16.000Z"
}
