{
  "title": "India’s Adani denies sanctions evasion or Iran LPG trade after WSJ reports US probe - World - DAWN.COM",
  "author": null,
  "content": "India’s Adani Group on Monday denied “any deliberate engagement” in sanctions evasion or trade involving Iranian-origin liquefied petroleum gas, after The Wall Street Journal reported that US prosecutors were probing whether Adani entities had imported Iranian LPG into India through their Mundra port.\n\nAn Adani spokesperson called the report “baseless and mischievous” in a statement, adding: “We are not aware of any investigation by US authorities on this subject.”\n\nThe WSJ said it had found tankers travelling between the Gulf and billionaire Gautam Adani’s Mundra port in western India exhibiting traits that experts say are common for ships evading sanctions.\n\nIt said the US Justice Department was reviewing the activities of several LPG tankers used to ship cargoes to Adani Enterprises, the group’s flagship entity, citing people familiar with the matter.\n\nReuters could not immediately confirm the report and the US Department of Justice and the US Attorney’s Office in Brooklyn did not immediately respond to requests for comment.\n\nAdani said it did not handle any cargo from Iran at its ports, as a matter of policy. It said all its LPG trade, which accounts for 1.46 per cent of Adani Enterprises’ total revenue, was fully compliant with domestic and international laws, including US sanctions regulations.\n\nA shipment referred to by the WSJ was handled as a “routine commercial transaction” via third-party logistics partners and supported by documentation identifying Sohar, Oman, as the port of origin, Adani said.\n\nUS President Donald Trump said in May that any party buying Iranian oil or petrochemical products would immediately be subject to secondary sanctions.\n\nLast November, US authorities indicted Adani and his nephew, Sagar Adani, on suspicion of paying bribes to secure power supply contracts and misleading US investors during fund-raising in the United States.\n\nAdani Group has denied the accusations and vowed to fight them.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/02222438c0896d2.jpg",
  "retrievedAt": "2025-08-18T03:07:09.283Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915019/indias-adani-denies-sanctions-evasion-or-iran-lpg-trade-after-wsj-reports-us-probe",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T17:29:19.000Z"
}
