{
  "title": "Budget 2025-26: Dual pricing on the cards as govt ratchets up war on cash - Business - DAWN.COM",
  "author": null,
  "content": "• Buying petrol with cash may cost an extra Rs2-3 per litre\n• All fuel stations may be legally required to offer digital payment modes\n• Manufacturers, importers may charge extra 2pc GST on cash sales\n• Emphasis will be on low-cost digital options instead of costlier POS systems\n• Minor tax rate cut expected for salaried class\n\nISLAMABAD: As part of its strategic direction to declare ‘war on cash’, the federal government is likely to introduce differential tax and transaction rates for cash and digital payments across various sectors, including fuel pricing, in the upcoming budget.\n\nThis is going to be the most crucial step among many other things that Finance Minister Muhammad Aurangzeb has been hinting at in recent days and may unveil during his budget speech on June 10.\n\nAccording to sources, the next year’s budget would also be envisaging lower tax rate on the salaried class — though by a tiny margin of 1 to 1.5 percentage points — under strict directions of the prime minister to give a message that the government is at least beginning to ease burden where tax rates are too high, even if it is unable to reduce them significantly.\n\nSources also said that policymakers had already been working on the technical and administrative aspects of the move to support the Federal Board of Revenue (FBR), which has failed miserably so far to document retail businesses in a manner that could yield revenue outcomes over the past two decades, despite repeated attempts and models.\n\nThe finance minister is believed to have held at least three successive consultative sessions with the FBR, the Ministry of Petroleum, banks, financial institutions, and a few hired or co-opted consultancy firms to explore technical solutions.\n\nThe campaign against the cash-based economy would work both ways — from top-down and bottom-up — to encourage and compel both consumers and businesses to reduce costs for documented transactions and increase expenses for cash. It aims to gradually shift the economy from low-cash to eventually cashless, where technically feasible.\n\nAn official said that all petrol pumps across the country — from Chaman to Khyber and Karachi to Azad Kashmir — would be required by law to provide digital options, including QR codes, debit and credit cards, and mobile payment services, in addition to cash.\n\nThe government-notified petroleum prices would apply only to digital transactions, while cash sales would involve an additional cost of about Rs2-3 per litre.\n\nConsumers would be free to conduct cash transactions at a higher rate, but would be encouraged to opt for digital payments instead.\n\n“This is a regulated environment and implementable at the outset,” the official said, adding that this would also help track petroleum supplies from borders and ports to refineries and depots.\n\nOn the other hand, importers and manufacturers would have to charge a standard 18 per cent general sales tax on digital payments from their suppliers or retailers, with an additional 2pc GST applicable on sales settled in cash.\n\nExtra cost\n\n“If wholesalers, distributors and retailers are ready to pay higher tax and their customers are willing to absorb the additional cost, it’s their choice, but it will involve substantial finances,” an official said.\n\nFBR Chairman Rashid Mehmood Langrial, when approached for comment, said only: “We must move towards a cashless economy,” but declined to elaborate ahead of the budget announcement.\n\nSources said the new initiative might appear synonymous with the filer and non-filer categories for banking transactions — a policy that did not yield desired results given its limited scope. However, the new policy is likely to have far greater outreach, capturing even small and informal business transactions through a carrot-and-stick approach.\n\nThe Finance Bill 2025-26 would provide a piece of legislation under which every business — big or small — would be required to offer cash and digital options. The cash transaction would carry an additional tax or fee compared to digital payments.\n\nUnlike digital options like point-of-sale systems, which involve additional expenditure in the form of POS machines, payments under the upcoming scheme will also be available through simple QR codes and other digital solutions. Countries like India, Indonesia, and Bangla­desh have reportedly achieved landmark successes in this regard.\n\nAnother official said the FBR has been unable to persuade major businesses — including event managers, jewellers, marriage halls, and many professionals such as doctors, lawyers, and beauty salons — to shift away from cash to digital solutions.\n\nAt a pre-budget meeting last week, Finance Minister Aurangzeb promised to shift the tax burden away from the salaried class and the documented sector to others through digitisation. He hinted at significant steps towards the compulsory use of digital payments to maximise a cashless economy and increase documented transactions.\n\nAt a public event the same week, he also announced that the upcoming federal budget would introduce “bold measures” to steer the national economy in a strategic direction.\n\nEarlier, he announced the government’s “war on cash” as part of a strategy to tap into over Rs9.3 trillion in circulation and maximise revenue potential. He has been talking about maximum utilisation of technology, end-to-end digitisation and auditing towards this end besides simplifying processes.\n\nThe finance minister also put on record some time ago that non-filers and under-filers were evading taxes of around Rs1.3tr at the individual level. “We must declare war on cash if we aspire to join the G20 (a group of major economies),” he said, adding that it was only possible when transactions are documented.\n\nAccording to the minister, Pakistan’s economy was potentially valued at more than $700 billion — significantly higher than the current estimate of $410bn — leading to over Rs7tr in annual tax evasion. “We will ensure this documentation,” he promised.\n\nOn the petroleum side, the government introduced a landmark bill in the National Assembly last month to digitally track petroleum products from import and production to retail sales in a bid to curb smuggling and adulteration. The practice causes massive revenue losses estimated at Rs300-500 billion annually, besides affecting the environment and vehicle engines.\n\nThe dual-pricing mechanism in the upcoming budget is expected to complement that legislative move and provide end-to-end traceability across the fuel supply chain.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:31.018Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914877/budget-2025-26-dual-pricing-on-the-cards-as-govt-ratchets-up-war-on-cash",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:24:56.000Z"
}
