{
  "title": "When the why walks away: Virat Kohli’s retirement and the summer that lost its song - Prism - DAWN.COM",
  "author": null,
  "content": "There was a time: before hashtags and hostilities, when cricket on this subcontinent belonged to purer minds. I was lucky to grow up in that Karachi. A city where cricket was not a proxy for politics, but a portal into grace, grit, and genius. Our coaches didn’t teach us whom to cheer based on flags; they taught us to revere Sunil Gavaskar if we wanted to learn the art of attrition, and Gordon Greenidge if we sought the fury of a square cut in full bloom. We were taught that genius bowed to no border. Which is why, today, I feel no conflict in mourning Virat Kohli’s exit. In times like these, when vitriol comes easier than virtue, this piece is not written in protest or praise. It is written in remembrance. For the game we once loved. And the way we were once taught to love it.\n\nThere are English summers, and then there are English summers that contain Rohit Sharma and Virat Kohli. The former are pleasant; the latter, unforgettable. This year, the roses will still bloom, and the Barmy Army will still sing. But the air will be thinner, the echoes fainter, because this is a summer robbed of its lords. First, Rohit Sharma stepped away — quietly, gracefully. And now, so has Virat Kohli.\n\nWhat remains is not merely the absence of players; it is the departure of meaning. A certain class of Test cricket, the kind that moved philosophers and CEOs alike, has drawn its curtain.\n\nThe absence feels architectural. As if two marble columns were quietly removed from a historic pavilion, with the entire structure now precariously leaning toward collapse. One could still enter, but who would stand in awe?\n\nAnd yes, we will watch. Ben Stokes deserves that. The man has turned trauma into leadership and chaos into a story. He will give every ounce of himself to this series, and it is only right that we show up.\n\nBut let us not pretend. Not all cricketers are made equal. Some you watch casually; others, you rearrange your life for. Across boardrooms in Zurich, Karachi, Sydney, and Palo Alto, people rescheduled earnings calls, postponed honeymoons, and stepped out of climate summits simply to witness Kohli in whites, confronting once more the fraught architecture of the fifth-stump line. A craftsman in prolonged dialogue with imperfection, he embodied what many might recognise as the Romantic Peril of Test Cricket, the very paradox that makes the long form so intellectually and emotionally compelling.\n\nBut now? With the great ones gone, and the new ones still waiting to become legends, it’s harder to justify the same trade-offs. With Virat absent, the return on investment for five days of Test cricket has fundamentally shifted.\n\nThis is not a critique of the younger players. They are brilliant, earnest, and committed. But some of us still believe that respect is not a courtesy; it is a currency. You don’t give up five days of a sanctuary vacation or abandon a boardroom just to watch a rough diamond endure its necessary grind at the crease. You do it for the rare performer whose genius warrants the interruption of your own.\n\nWhich brings us, inevitably, to the question: why now? Why would Kohli walk away at the peak of his fitness, form, and fervour? There isn’t one reason. It never works that way.\n\nGreat careers end the way great loves do, not with one betrayal or a single heartbreak, but with the erosion of belief.\n\nStill, if one moment hastened this farewell, it may have been the appointment of Gautam Gambhir. His arrival may not be the cause. But it might well have been the final straw. Because when players like Kohli, Rohit, and Ravichandran Ashwin step away almost in concert, you don’t need an inquiry. You need a mirror.\n\nManaging genius is a genius act. Ask anyone who worked with Steve Jobs, Branson, or who still survives under Elon. This isn’t about control; it’s about alignment. You don’t manage someone like Virat Kohli. You understand him. You protect his purpose. You locate his why, and you build everything else around it.\n\nI’ve watched too many small men in large roles fumble this truth. Men who climbed ladders not because they inspired others, but because they complied better. They ended up managing teams far sharper than themselves. And predictably began dimming the lights to hide the contrast. There is no faster way to kill a company. Or a cricket team.\n\nGautam Gambhir, for all his grit, has never radiated the intellectual largesse required to steward players who are larger than himself. He may be a good lieutenant. But this job needs a philosopher-general, someone who understands that great players don’t just need a plan. They need belief, clarity, and a sense of shared meaning.\n\nDesign firm IDEO would call this a systemic misalignment between cultural intent and leadership archetype: a failure to preserve the tacit rituals, values, and emotional contracts that define high-performing creative ecosystems. Friends at McKinsey might frame it as a breakdown in vertical coherence, when the ethos at the top no longer resonates with the motivations of key talent.\n\nMy favourite organisational theorist today calls it a leadership incongruence error. Upon encountering my blank stare, she added: “It’s the insertion of a low-agency operator into a high-autonomy, high-purpose environment.” The result is not just friction. It is institutional dissonance.\n\nI say: unforgivable.\n\nUnka rutba tha, magar rooh kahin aur thi,\n\nJaise mehfil mein aangan ka diya le aaya ho koi\n\nHe held the rank, but his spirit wandered,\n\nlike bringing a courtyard lamp to a gathering of stars\n\nThis isn’t new. In Silicon Valley, where I live and work, the pattern is familiar. Startups are littered with the stories of brilliant founders brought to their knees not by markets, but by middling managers promoted beyond their capacity. Think of when HP chose Carly Fiorina, or when Yahoo staggered through a carousel of CEOs, or when Apple, briefly, forgot it needed Steve Jobs.\n\nThe Board of Control for Cricket in India is most culpable here. This isn’t a team in need of discipline. It is a constellation in need of choreography. And at its most delicate moment of transition, when what was needed was vision, they reached for order.\n\nBecause genius does not shrink to fit into systems, systems must grow to contain genius. That the BCCI could not see this, could not anticipate the vacuum they were creating, is perhaps the most damning evidence of all.\n\nKohli’s retirement is not just the end of a player’s journey. It is the culmination of an institutional misreading. The result is visible, not just in the cricket, but in the quiet goodbyes. He didn’t leave because he stopped loving the game. He left because the game stopped understanding the kind of love he gave it.\n\nThis is a failure of leadership. A failure to identify the why, and to protect it at all costs.\n\nIn every great team, the leader’s first task is not strategy. It is stewardship. To recognise the genius in the room, and to ensure that genius feels seen, respected, and called to something greater than itself. That didn’t happen here. And so, the greatest storyteller of this era has packed up his pen.\n\nNevertheless, the game will go on, the scoreboard will still tick. But those of us who came not just to see runs, but to feel reverence, will know: something sacred has slipped away.\n\nHeader image: Indian batsman Virat Kohli announced his retirement from Test cricket on May 12. — AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/24120211f34849e.png",
  "retrievedAt": "2025-08-18T03:07:22.607Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912598/when-the-why-walks-away-virat-kohlis-retirement-and-the-summer-that-lost-its-song",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T06:47:01.000Z"
}
