{
  "title": "Karachi DHA begins strict enforcement of traffic rules - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A welcome scene was observed on Seaview towards the side leading to Defence Housing Authority (DHA) Phase 8, recently, when the DHA Vigilance teams in smart blue uniforms and red caps were seen stopping all motorcyclists without helmets from venturing any further.\n\nThey were told to go back to where they were coming from unless they showed up wearing helmets.\n\nMany motorcyclists showed frustration and anger, many looked surprised. Since when does this happen in Karachi, many wondered aloud. Some even used manipulative tactics by accusing the men in uniform for discriminating against the lower middle class folks who cannot afford helmets. They were promptly told that nothing doing as rules are rules.\n\nAccording to Clifton Defence Community (CDC) president Abdur Rehman, the practice is currently only limited to Phase 8 of the DHA.\n\n“This is a recent initiative taken by the DHA, which was being planned for a year now though it has been implemented recently,” he told Dawn.\n\nVigilance teams stopping motorcyclists without helmets from entering Phase 8\n\nAsked why just for Phase 8, the CDC president said that it is easy to cordon off the phase.\n\n“There are only eight entry or exit points to Phase 8, otherwise it is surrounded on three sides by the creek area or water. By setting up check posts on these handful of entry or exit points you can make the phase geographically secure,” he added, saying that some roads around the checkpoints have been made one-way, too, while there are bright lights and cameras installed all over Phase 8 making it a monitored zone for which the residents are also paying extra charges like they do in other such places in the city, for example, Malir Cantt.\n\nLt Col Faisal Masood, the additional director Phase 8, DHA Vigilance, also told Dawn that the motorcyclists being sent back if they are not wearing helmets is only a part of the main plain, which is providing security to Phase 8.\n\n“We have been implementing our security plan for Phase 8 since a month or so ago. Creating a model phase with where we can control traffic violations and crime, we can take it to DHA’s other phases, though not the entire city of Karachi as we don’t control the entire city,” he explained, adding that for starters they are controlling traffic violations in Phase 8 by working in liaison with traffic police.\n\n“Not just motorcyclists without helmets, we are also catching all speeding vehicles, cars with dark tinted glasses, vehicles with silences or mufflers removed, one-wheeling, etc,” he said.\n\n“People, especially youth here, are found racing or speeding on the broad and open roads of DHA Phase 8. That is also a reason behind so many tragic accidents happening on these very roads. But with our strict monitoring and rules here, hopefully, we can control that, too,” Col Masood concluded.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/683cdfc3ac42c.jpg",
  "retrievedAt": "2025-08-18T03:07:40.760Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914831/karachi-dha-begins-strict-enforcement-of-traffic-rules",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:03:04.000Z"
}
