{
  "title": "Police told to ensure mobile phone traders use e-gadget - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The inspector general of police (IGP) Punjab has issued a new standard operating procedure (SOP) mandating officers from the IT branch and investigating units to inspect mobile phone shops to ensure that they are using the e-gadget application.\n\nThe gadget is a digital platform developed to monitor the sale and purchase of mobile phones in an effort to curb mobile theft and related crimes.\n\nOn the directive of IGP Dr Usman Anwar, the new SOP has been issued under which investigation officers, operators and police IT branch are to check mobile shops to ensure that the installed e-gadget was being used properly.\n\nIn shops still without the e-gadget, the application should be installed and the ID should be verified from the front desk of the concerned police station. Strict action should be taken against shopkeepers who are not entering the mobile purchase, sale and repair despite having the ID, said the directive of the IGP.\n\nIn this regard, the IGP directed the concerned police to instruct the muharrars/investigation officers/SHOs to immediately implement the SOP for e-gadget application.\n\nIt may be recalled that the police have launched the e-gadget project for traders in collaboration with Punjab Information and Technology Board to control sale and purchase of stolen cellphones in the open market of Rawalpindi district.\n\nThe aim to launch the mobile-based application was to check the theft of cellphones and speedy recovery of stolen ones. The police have already collected data of all mobile phone selling, purchasing and repairing shops in their respective areas.\n\nThe police were of the view that the use of the application would help check mobile phone theft/snatching and its related crimes.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:24:09.525Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914811/police-told-to-ensure-mobile-phone-traders-use-e-gadget",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:03:14.000Z"
}
