{
  "title": "Another Karachi policeman gunned down in Sohrab Goth targeted attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: In less than one week, armed assailants shot dead another policeman in what police described as a targeted attack near Sohrab Goth on early Sunday morning.\n\nCentral SSP Zeeshan Shafiq Siddiqi said that Constable Shaharyar Ali, 28, was heading some place on his motorbike at around 3:05am when armed assailants, also on a motorcycle, targeted him on Shahrah-i-Pakistan near near Kashti Chowk within the remit of the Yousuf Plaza police station.\n\nHe sustained a single bullet wound in the abdomen and was taken to the Jinnah Postgraduate Medical Centre where he died during treatment.\n\nPolice sources said that the investigators have obtained CCTV footage near the crime scene. The footage is blurred but it showed that the policeman had stopped his motorbike on the road. In the meantime, two assailants riding a motorcycle emerged there, fired at him and rode away without taking any valuables from him.\n\nNo breakthrough made in murder investigation of traffic constable shot dead on May 27, says CTD\n\nThe victim was posted at the Anti-Vehicles Lifting Cell (AVLC) and a resident of the Buffer Zone area. He was not in uniform at the time of the incident.\n\nIt appeared to be an incident of targeted killing, but police were investigating the matter to find out the exact motive, the SSP said.\n\nHe said the murder did not seem to be robbery related as the killers did not take away slain constable’s pistol, his cell phone, cash and motorbike.\n\nArea SHO Iftikhar Khanzada told Dawn that no case was registered till late in the night as the family was busy in making funeral arrangements.\n\nIn a short span of five days, it is the second incident of targeted killing involving a policeman.\n\nEarlier on May 27, an on-duty traffic policeman, Zain Ali Raza, was shot dead within the remit of the Boat Basin police station. Later, a little known group had claimed responsibility for the targeted attack on its Telegram channel.\n\nThe police had registered a terrorism case and transferred the investigations to the Counter-Terrorism Department as senior police officers feared resurgence of some banned outfits. Investigators suspected involvement of their sleeper cells in the killing.\n\nSo far, no arrest has been made in connection with the May 27 targeted killing case.\n\nCTD DIG Asif Ejaz Sheikh told Dawn that they launched an investigation into the killing of the AVLC policeman.\n\nHe, however, said it would be premature to say anything concrete at this moment about the exact motive of the murder.\n\nRegarding the Boat Basin incident, he said that the CTD was working on many leads, but so far, no concrete evidence had emerged about the involvement of any militant group.\n\nHe said that the group that had claimed responsibility on Telegram just used its name as ‘Mujahideen’ without naming any specific faction of the outlawed Tehreek-i-Taliban Pakistan.\n\nThe DIG said that the outlawed TTP or Balochistan Liberation Army had used their own social media handles to claim responsibility for their attacks.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:44.361Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914835/another-karachi-policeman-gunned-down-in-sohrab-goth-targeted-attack",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:03:04.000Z"
}
