{
  "title": "Haj pilgrims gather in Makkah under scorching desert sun - World - DAWN.COM",
  "author": null,
  "content": "More than a million pilgrims poured into the holy city of Makkah ahead of the annual Haj, with authorities vowing to hold a safer pilgrimage amid searing desert heat and a massive crackdown on illegal visitors.\n\nOfficials have beefed up heat mitigation measures, hoping to avoid a repeat of last year’s Haj, which saw 1,301 pilgrims die as temperatures reached 51.8 degrees Celsius.\n\nTemperatures were forecast to exceed 40 degrees Celsius this week as one of the world’s largest annual religious gatherings starts on Wednesday.\n\nThe Haj, one of the five pillars of Islam, must be performed at least once by all Muslims with the means to do so.\n\nAs of Friday, more than 1.3 million pilgrims had arrived in Saudi Arabia for the multi-day pilgrimage, according to officials.\n\nThis year, authorities have mobilised more than 40 government agencies and 250,000 officials, doubling their efforts against heat-related illness following the lethal heatwave of 2024.\n\nShaded areas have been expanded by 50,000 square metres (12 acres), thousands more medics will be on standby and more than 400 cooling units will be deployed, Saudi Arabia’s Haj minister Tawfiq al-Rabiah told AFP last week.\n\nToday, with temperatures topping 40 degrees Celsius, the health ministry said 44 cases of heatstroke had already been treated.\n\nThe latest artificial intelligence technology will also help monitor the flood of data and footage, including video from a new fleet of drones, from across Makkah to better manage the mammoth crowds.\n\nDespite the punishing heat, pilgrims were overjoyed as they arrived in Makkah.\n\n“This is really a blessing from Allah,” Abdul Majid Ati, a Filipino lawyer and Sharia counsellor, told AFP near the Grand Mosque.\n\n“We feel so peaceful and safe in this place.”\n\nAbdulhamid, from Nigeria, said he was “very happy” to be performing his second pilgrimage in a row at just 27 years old.\n\nBut the young man said he never walks out without his sunglasses, describing the temperatures in Makkah as “very, very, very hot”.\n\nThe rites in the holy city and its surroundings, which follow a lunar calendar, fall again this year during the hot month of June.\n\nLast year, most of the deaths were among unregistered pilgrims who lacked access to air-conditioned tents and buses.\n\n“They were caught by surprise because the intensity of the heat was so high that their adaptation measures failed,” said Fahad Saeed of Climate Analytics, a think tank based in Germany.\n\nIn the run-up to this year’s Haj, Saudi authorities launched a widespread crackdown on unregistered worshippers, using frequent raids, drone surveillance and a barrage of text alerts.\n\nHaj permits are allocated to countries on a quota system and distributed to individuals by lottery.\n\nBut even for those who can obtain them, the steep costs prompt many to attempt the Haj without a permit — though they risk arrest and deportation if caught.\n\nAlong with hefty fines, those found illegally entering Makkah during the Haj face a potential 10-year ban from Saudi Arabia.\n\nLarge crowds at the Haj have proved hazardous in the past, most recently in 2015 when a stampede during the “stoning the devil” ritual in Mina, near Makkah, killed up to 2,300 people in the deadliest Haj disaster.\n\nSaudi Arabia earns billions of dollars each year from the Haj and Umrah pilgrimages undertaken at other times of the year.\n\nThe pilgrimages are also a source of prestige for the Saudi monarch, who is known as the custodian of the two holy mosques of Makkah and Medina.\n\nFor Mariama, a 52-year-old pilgrim from Senegal, the journey to Makkah has fulfilled a lifelong dream.\n\n“I was dreaming about it, thinking about it every time to come here to do the Haj,” she said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/02204020f7fc694.jpg",
  "retrievedAt": "2025-08-18T03:07:09.146Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915010/haj-pilgrims-gather-in-makkah-under-scorching-desert-sun",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T16:02:29.000Z"
}
