{
  "title": "Crypto council agrees on technical committee to draft framework for digital and virtual assets - Business - DAWN.COM",
  "author": null,
  "content": "The Pakistan Crypto Council (PCC) has agreed to form a technical committee to draft a framework for digital and virtual assets, the Ministry of Finance said on Monday.\n\nThe PCC was officially launched in March to “regulate and integrate blockchain technology and digital assets” into the country’s financial landscape.\n\nAccording to a press release by the finance ministry, the meeting was chaired by Finance Minister Muhammad Aurangzeb and attended by PCC Chief Executive Officer Bilal Bin Saqib, governor of State Bank of Pakistan (SBP), chairman of Securities and Exchange Commission of Pakistan (SECP), and government officials.\n\n“The meeting focused on the draft regulatory framework for digital and virtual assets in Pakistan, aiming to align with international standards and evolving technological trends,” the press release said.\n\nIt added that the participants discussed options for establishing “an autonomous regulatory authority to oversee and regulate the digital finance and crypto ecosystem in the country”.\n\n“It was agreed to constitute a technical committee comprising representatives from SBP, SECP, Law Division, and IT & Telecom Division,” the ministry said, adding that the committee will review the draft laws and propose a robust framework and governance structure to be reviewed by the PCC in the next meeting.\n\nThe press release said that the PCC members gave valuable input for “a secure, transparent, and innovation-friendly regulatory environment” which aims to promote “responsible blockchain adoption, safeguarding investors, and advancing financial inclusion”.\n\nThe finance minister appreciated the contributions of all stakeholders and reaffirmed the government’s commitment to creating a “future-ready financial infrastructure that supports innovation while maintaining financial stability and regulatory compliance”, it added.\n\nLast week, the National Assembly Standing Committee on Finance held a meeting, where PPP MNA Sharmila Farooqi introduced a bill on digital currency regulations. Finance Secretary Imdadullah Bosal said that the ban on cryptocurrency was still in place across Pakistan, stressing the need for its regulation during the meeting.\n\nThe same day, Saqib had unveiled the country’s first government-led Strategic Bitcoin Reserve. He announced the establishment of a national bitcoin wallet, “holding digital assets already in state custody — not for sale or speculation, but as a sovereign reserve signalling long-term belief in decentralised finance”.\n\nCryptocurrencies are gaining momentum globally as the number of use cases is increasing and many countries are now making them legal. However, it has had a mixed reception by regulators globally.\n\nIn some countries, like El Salvador, it has legal tender status, while in others, including Pakistan, India and China, it is not accepted as payment for goods and services, nor can one own it legally, though it is not officially banned either.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/021931196709f48.jpg",
  "retrievedAt": "2025-08-18T03:07:12.425Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1915007/crypto-council-agrees-on-technical-committee-to-draft-framework-for-digital-and-virtual-assets",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T15:03:18.000Z"
}
