{
  "title": "The cost of relief - Newspaper - DAWN.COM",
  "author": null,
  "content": "ALTHOUGH bound by the IMF’s stern conditions, the federal government appears desperate to provide tax relief to middle-class salaried individuals as well as businesses, especially the real estate lobby, in the upcoming budget.\n\nThis desire seems to have grown stronger in the aftermath of Pakistan’s recent tactical military win against India as the ruling party hopes to turn the ‘feel-good factor’ in the country into wider political support for itself. The question, however, remains: can the government secure ‘concessions’ from the multilateral lender to implement its ‘relief plans’ to win over middle-class voters?\n\nWhat we have seen is that the government was compelled to delay the announcement of its budget by more than a week to June 10 when the IMF mission left the country after inconclusive policy discussions on Islamabad’s budget proposals last month.\n\nNo final agreement was reached due to differences mainly on the proposed increase in defence expenditure and tax cuts for individuals and businesses.\n\nThe Fund later said in a statement that the discussions would continue virtually regarding the budget “over the coming days”, revealing some disagreement. The Fund added that the talks “focused on actions to enhance revenue — including by bolstering compliance and expanding the tax base — and prioritise expenditure”.\n\nThe outcome of the ongoing virtual budget talks remains inconclusive — otherwise we would have heard from the Fund or the government that the differences had been sorted out.\n\nThe IMF feels that the government’s expenditure and tax relief proposals will hit the overarching target of the primary budget surplus — whose size determines the reduction or increase in public debt in a given fiscal year — of 1.6pc of GDP agreed upon by the two sides in policy discussions.\n\nThe lender wants the authorities to come up with credible proposals, identifying alternative sources of revenue to offset the impact of the increase in defence and other expenditures and the cuts in taxes.\n\nThe lender has valid reason to be concerned. The widening shortfall of more than Rs1tr in tax collection in the first 11 months of the current fiscal year, despite the imposition of record new taxes and the blocking of tax refunds, justifies the IMF’s apprehensions.\n\nThe massive shortfall in tax recovery makes it clear that the FBR may not be able to meet even the revised collection target. The IMF had recently agreed to slash the tax collection target of nearly Rs13tr by Rs640bn for the full fiscal year.\n\nWith the Fund insisting on fortifying the primary budget surplus target against any additional expenditures and potential revenue slippages, the nation’s fiscal authorities have a formidable challenge ahead of them as they try to balance the IMF’s programme goals with the government’s growing desire to deepen the feel-good factor through some fiscal extravagance.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:25.138Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914866",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:14:24.000Z"
}
