{
  "title": "French police detain dozens more in wake of PSG celebrations - World - DAWN.COM",
  "author": null,
  "content": "French authorities detained 79 people in the second such wave of arrests during celebrations following Paris Saint-Germain’s Champions League win, a police chief said on Monday.\n\nThe PSG thrashed Inter Milan by a record 5-0 in Saturday evening’s final in Munich, flying back to Paris on Sunday for a triumphal parade along the Champs-Élysées, then celebrations in a packed Parc des Princes stadium on the edge of the French capital.\n\nThe PSG winning the biggest prize in European club football for the first time sparked delirious festivities in France, but was marred by violence.\n\nOn Sunday, “we saw a resurgence of individuals driven by malicious intent who were not really PSG supporters”, Paris police chief Laurent Nunez told RTL radio.\n\n“We arrested 79 people, some of them in the night,” he said, adding that order had been restored before dawn.\n\nSome were detained for taking barriers and briefly blocking the ring road around Paris, while others had tried to vandalise businesses or light fireworks on the Champs-Élysées, he said.\n\nOn Saturday night, police had made more than 500 arrests across France, the interior ministry said, after more than 200 cars were torched and police clashed with youths.\n\nIn the southwest town of Dax, a 17-year-old boy died after being stabbed in the chest.\n\nA 23-year-old man riding a scooter in central Paris also died after being hit by a vehicle.\n\nA policeman was in an induced coma after being injured by a firework.\n\nReceiving the triumphant team at the Elysee palace yesterday, French President Emmanuel Macron condemned what he called “unacceptable” violence during the festivities.\n\nMany of the stars of the team, one of the youngest in the competition, are drawn from the huge football talent pool in the Paris suburbs after PSG’s Qatari owners turned their back on the policy of signing star players like Neymar and Lionel Messi.\n\nA total of 11.5 million people tuned in across France to watch the match.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/02134542ef9ebdf.jpg",
  "retrievedAt": "2025-08-18T03:07:22.068Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914963/french-police-detain-dozens-more-in-wake-of-psg-celebrations",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T09:22:31.000Z"
}
