{
  "title": "Gunmen open fire on vaccination team as GB records its first polio case in Diamer - Pakistan - DAWN.COM",
  "author": null,
  "content": "No casualties were reported when unknown men opened fire on a polio vaccination team in Diamer district, where Gilgit-Baltistan recorded its first case of the year.\n\nPakistan is one of the last two countries in the world, alongside Afghanistan, where polio remains endemic. Despite global efforts to eradicate the virus, challenges such as security issues, vaccine hesitancy and misinformation have slowed progress.\n\nAccording to a first information report (FIR) registered at the local police station, the incident occurred on Sunday when unknown armed men opened fire on a polio team in the village of Sheikho in Tangir Valley, the constituency of GB’s Chief Minister Haji Gulbar Khan.\n\nHowever, the polio team remained safe.\n\nAccording to the FIR, as soon as the polio vaccination team returned to Sheikho village after completing their duties, two unknown armed men stopped the team’s vehicle at the RCC bridge.\n\n“You all are ruining the environment here by bringing [unveiled] women from Gilgit in the name of the polio campaign.\n\n“If you do this again, you won’t be able to escape,” they said before shooting at the polio team vehicle, which sustained a punctured tire. The armed men then fled towards a nearby hill.\n\nThe incident occurred at 1:45pm, according to the FIR.\n\nAccording to GB government spokesperson Faizullah Faraq, the chief minister has taken notice of the incident and has directed strict action.\n\nThe polio monitoring team had been shifted to a safe place immediately after the incident, Faraq said.\n\nHe said the polio team went to the area “without informing the police”, leading to the “unfortunate” incident.\n\nThe first case of wild poliovirus has been reported in GB, bringing the national total to 11 this year, as the country continues to battle the debilitating disease.\n\nThe Regional Reference Laboratory for Polio Eradication at the National Institute of Health in Islamabad confirmed the new case of wild poliovirus in GB’s Diamer district.\n\nWhile providing details on the case, GB Health Secretary Asifullah Khan said a 23-month-old child was diagnosed with poliovirus in Diamer’s Tangir area.\n\nHe said that the child has not travelled outside the area, however, the virus strain has been confirmed to originate from Karachi’s Liaquatabad area.\n\nAsifullah observed that there was a record of administering polio drops to the child. However, he added that the child was not provided with the vaccines to be given immediately after birth.\n\nTo a question, the health secretary said that the department has not announced the detection of poliovirus to the public, but the case has been confirmed.\n\nThis is the first case of wild poliovirus reported from GB and the 11th confirmed case in Pakistan this year, said a statement by the Pakistan Polio Eradication Programme.\n\nThe third nationwide polio vaccination campaign of 2025, which began on 26 May, concluded yesterday, successfully reaching over 45 million children under five years of age across 159 districts, including high-risk areas of the country.\n\nThe programme called on all parents to ensure their children do not miss out on any opportunity to receive polio drops.\n\nBefore the latest case, there had been no reported cases of poliovirus in GB and the region was declared a polio-free zone.\n\nPolio is a highly infectious and debilitating disease with no cure. The only way to protect children is through repeated doses of the oral polio vaccine for all children under five, as well as the timely completion of all vaccines offered as part of the essential immunisation schedule.\n\nLast year, the country reported more than 70 polio cases, with the virus detected in around 90 districts.\n\nThis year’s first nationwide polio vaccination campaign was held in February, followed by a fractional IPV-OPV Polio (injectable polio vaccine) campaign in Quetta and Karachi on Feb 20 and 22, respectively. Around one million children were targeted for vaccination in this campaign.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:18.515Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914951/gunmen-open-fire-on-vaccination-team-as-gb-records-its-first-polio-case-in-diamer",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T07:12:38.000Z"
}
