{
  "title": "Commuters in Islamabad hit hard as fare of CDA buses plying on various routes doubled - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: At a time when city managers are focusing on launching multibillion-rupee development projects, they have dealt a heavy blow to the poor segments of society by increasing metro and electric bus fare by 100pc.\n\nStarting June 1 (Sunday), the Capital Development Authority (CDA) raised the fare from Rs50 to Rs100.\n\nNasreen Bibi, a widow, is among the affected passengers.\n\nShe lives in the Bari Imam area, where she receives free food from the shrine, and works as a maid in various houses in G-6 to support her five-member family.\n\nCivic body justifies increase, says with Rs50 per ride, it was incurring annual expense of Rs5.12bn against Rs1.46bn revenue\n\n“Paying Rs100 for a round trip was manageable for me, but today I was shocked when I was asked to pay Rs100 for one-way travel. Now I’m upset, how will I manage Rs200 per day just to get to work and back to Bari Imam?” she told Dawn.\n\nAnother passenger Abu Bakar, standing at Aabpara stop, said increasing the fare by 100pc was great injustice with poor people.\n\n“PM Shehbaz Sharif should take notice and order restoration of the old fare,” he said.\n\nThe CDA has been paying subsidy to ensure smooth service of metro and electric buses on various routes.\n\nThe Orange Line Metro (which goes towards the airport), Blue Lines from Pims to Gulberg Green, Green Line, which runs from Pims to Bhara Kahu and electric buses, which ply on around 16 routes, have started charging Rs100 per stop.\n\nThere is no change in the fare of Red Line metro bus service from Pindi to Islamabad, which is being run by Punjab government with the help of the subsidy being provided by the federal government.\n\nBesides metro buses, last year CDA’s contractor - NRTC - brought 160 electric buses to Islamabad. CDA pays roughly Rs350 per kilometres to the contractor.\n\nOut of the total, only around 120 of the buses are being operated because of the shortage of charging facility.\n\nHowever, CDA is constructing a depot at Zero Point, where it will have full charging capacity.\n\nSo far, there are no proper bus stops and electric boards on stops for guidance of passengers and about arrival timings of buses.\n\nMohammad Waseem, a resident of Bhara Kahu, said that CDA is a major organization and had been spending billions of rupees on road related projects.\n\n“Recently, CDA completed multibillion Serena and F-8 interchange projects while many other mega projects, including Shaheen Chowk interchange, Kashmir Chowk underpass, Faizabad remodeling project, multibillion Safari Parks, are on the cards. If CDA has any funding issue, it should not focus on such projects and paying subsidy for the public bus service should be its top priority,” he said.\n\nOn the other hand, CDA in a statement justified the increase in fare.\n\nThe CDA chairman and chief commissioner Islamabad Mohammad Ali Randhawa said providing modern and environment-friendly travel facilities to the citizens of Islamabad was top most priority of the civic agency.\n\n“We appreciate citizens for their trust in CDA, which is providing transportation facilities to more than 85,000 commuters daily through its fleet of electric air-conditioned buses.”\n\nHe stated that alongside recent fare adjustments in public transport, the CDA remains committed to providing all residents of Islamabad with modern, comfortable, eco-friendly, air-conditioned and accessible transport at their doorsteps.“\n\nAccording to a press release, the CDA chairman said: “Currently, the Orange Line operates 30 buses, Blue Line 10 buses, Green Line 10 buses and the electric air-conditioned fleet - all subsidised by the CDA.\n\n“Thanks to these services, over 85,000 citizens travel daily, which stands as practical evidence of CDA’s determination and efforts to enhance Islamabad’s urban infrastructure and travel facilities.\n\n“Previously, with a fare of Rs50 per ride, the CDA incurred annual expenses of Rs5.12 billion, while revenue stood at only Rs1.46 billion, requiring a Rs3.66 billion subsidy each year. With the new fare adjustment of Rs100 per ride, revenue is expected to rise to Rs2.33 billion. However, to maintain the operational stability and continuity of high-quality, eco-friendly, air-conditioned bus services in the future, the CDA will still need to provide a substantial subsidy of Rs2.79 billion annually.”\n\nThe CDA stated that fare adjustment was not intended to burden citizens but a necessary step to ensure the provision of best travel facilities, improve service quality and maintain long-term public trust and sustainable travel stability.\n\nThe statement said additional revenue will directly contribute to the regular maintenance of buses, fleet expansion, increased routes, reduced waiting times, improved service quality, cleanliness, safety, and an enhanced travel experience for passengers.\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:35.047Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914820/commuters-in-islamabad-hit-hard-as-fare-of-cda-buses-plying-on-various-routes-doubled",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:03:14.000Z"
}
