{
  "title": "Two coaches of Pakistan Express derail in Bahawalpur, suspending traffic on ML-1 for hours - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR/LAHORE: Two bogies of the Pakistan Express train going to Rawalpindi from Karachi derailed on Sunday near Mubrakpur Railway Station on Sammsatta-Dera Nawab Sahib section in Bahawalpur district, disrupting railway traffic for hours on both Up and Down tracks on the main Karachi-Lahore railway line (ML-1).\n\nAs per railway officials, the dining car and a standard air-conditioned coach of the Rawalpind-bound 45-Up Pakistan Express derailed, adding that no passenger was hurt in the incident.\n\nBecause of the incident, the Up and Down trains, including Sialkot-bound Allama Iqbal Express, 7-Up Tezgam bound for Rawalpindi, Karachi Express bound for Lahore, Millat Express for Sargodha and Bahauddin Express for Multan had to be halted for hours at different railway stations in Bahawalpur district limits.\n\nThe passengers of these train, especially women and children, had to brave severe heat due to the ongoing hot spell in the region.\n\nSeveral trains halted at different stations; passengers suffer due to hot weather\n\n“The derailment was horrible, as it not only damaged the coaches badly but also the railway track,” said an official source in the railways.\n\nThe officials say that because of the derailment, the front trolley of the dining car and some wheels of the AC bogie separated from their main frame.\n\nThey added that after derailing, the two bogies damaged and blocked the other railway track, suspending the up and down traffic on the ML-1.\n\nOn being informed of the incident, relief and rescue trucks, along with the railway staff, rushed to the spot from Bahawalpur and Sammsatta stations. The railway staff started the operation by detaching the two derailed bogies from the Pakistan Express.\n\nAfter detaching the derailed bogies, the Pakistan Express was allowed to resume its journey to its destination. After the train’s departure, the bogies were removed from the damaged portion of the track. After necessary repairs both tracks were opened for railway traffic after hours today.\n\n“The derailments don’t occur due to the decaying track alone, as these also happens due to the poor condition of the coaches for which the railway has limited funds for maintenance. The railways must pay attention towards this important issue immediately,” another official source told Dawn.\n\nHe said the brakes of several coaches are not working properly. “The situation is very alarming and it may lead to major accidents in future as well,” he warned.\n\nMeanwhile, Chief Executive Officer (CEO) Mr Amir Ali Baloch has constituted a three-member committee to probe into the derailment. The committee comprises Deputy Chief (Signal), Telcom Engineer (carriage) and Deputy Chief Operating Superintendent (Coaching).\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-18T03:07:28.408Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914921/two-coaches-of-pakistan-express-derail-in-bahawalpur-suspending-traffic-on-ml-1-for-hours",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:54:45.000Z"
}
