{
  "title": "JI’s Hidayat assails govt policies for repression, economic injustice - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: While blaming the government’s policies for what he called systemic repression and economic injustice in the country, Maulana Hidayatur Rehman, emir of Jamaat-i-Islami’s Balo­ch­­istan chapter, has called for a joint struggle to provide relief to the people.\n\nSpeaking at a press conference at the protest camp of the Grand Alliance in front of the Quetta Press Club on Sunday, the JI leader said the government was not allowing people to speak about their rights and against the atrocities “committed by the rulers against people”.\n\nMaulana Hidayat, who was accompanied by other political and civil society figures including Zahid Akhtar Baloch, Prof Abdul Qudoos Kakar, Rehmat­ullah Zehri, Ghulam Sarwar Mengal and Younis Kakar, said the system “imposed on us” is fundamentally flawed and “built on lies and oppression”.\n\n“Even under a non-Islamic system, we might have received justice, but in our so-called Islamic state, justice is a farce,” he lamented.\n\nSays officials blame IMF for their policy failures\n\nHe criticised the disparity in pension disbursements, saying rulers had funds to pay Rs1 million monthly pensions to top officials, but can’t afford Rs10,000 for poor workers.\n\n“This is blatant injustice and a double standard that must end,” he added.\n\nThe JI leader accused the government of deliberately ignoring the plight of the poor while blaming the IMF for its own policy failures.\n\nHe further criticised the officials’ extravagance, stating that billions were spent on boxing events and fireworks, while universities and public institutions struggle to pay salaries.\n\nHe said that his party and his movement for people’s rights, Haq Do Tehreek, will continue to raise their voices for the oppressed.\n\nHe condemned the “architects of the current governance system”, saying: “Whoever designed this unjust structure — alive or dead — I curse them. This land is ours, and we will fight for its people’s rights.”\n\nPublished in Dawn, June 2nd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:23:50.623Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914840/jis-hidayat-assails-govt-policies-for-repression-economic-injustice",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T02:02:41.000Z"
}
