{
  "title": "PML-N’s Hina Arshad secures Punjab Assembly seat in Sialkot polls marred by rigging claims - Pakistan - DAWN.COM",
  "author": null,
  "content": "PML-N’s Hina Arshad Warraich secured a Punjab Assembly seat (PP-52) in Sialkot by a wide margin amid rigging allegations by the PTI, according to preliminary results issued by the Election Commission of Pakistan (ECP) on Monday.\n\nThe by-election for PP-52 (Sambrial) took place yesterday, two months after the seat had fallen vacant following the demise of PML-N MPA Arshad Javed Warraich — father of the winning candidate.\n\nAnalysts had expected a tough one-on-one contest between the ruling PML-N and the PTI-backed aspirants, whereas the PPP had also been running an aggressive campaign in Sambrial to perform better in the race.\n\nAccording to Form-47 issued by the ECP today and signed by Returning Officer Muhammad Iqbal, Warraich clinched the seat by winning 78,702 votes.\n\nWarraich’s main opponent, Fakhir Nashat Ghumman, who was an independent candidate backed by the PTI, was the runner-up with 39,018 votes.\n\nPPP’s Raheel Kamran Cheema ranked third with 6,832 ballots cast in his favour, followed by Tehreek-i-Labbaik Pakistan’s Muhammad Shafaqat with 4,851 votes.\n\nThe balloting had remained peaceful throughout yesterday, except for verbal arguments between PTI supporters and the police at some polling stations out of a total of 185.\n\nPTI spokesperson Sheikh Waqqas Akram accused the Punjab government and the police of interfering in the by-election, alleging that its polling agents were expelled from the polling stations. The former ruling party also claimed to have “video evidence of the rigging”.\n\nHowever, Provincial Election Commissioner Sharifullah, in a statement, denied these allegations. He said the voting process continued in all 185 polling stations without any interruption till 5pm. He said that the election commission would review any complaint regarding irregularities if it was provided in a proper way.\n\nThe local administration, apparently for security reasons, had placed containers in front of the RO office — a move lambasted by the PTI as well as the PPP, which also staged a sit-in in front of the office in Sambrial.\n\nPPP leader and ex-premier Raja Pervaiz Ashraf also added to the PTI’s rigging allegations.\n\nSpeaking to the media in Sambrial yesterday, flanked by PPP Punjab Secretary General Hassan Murtaza, Ashraf claimed polling stations had been closed in several areas by the administration.\n\nThe ex-premier said it would be unfortunate if the results were changed, adding that it would not be a good omen for the government. He said it was not tolerable that rigging took place during the by-election.\n\nThe ECP had set up 185 polling stations, categorising 11 as highly sensitive, 38 as sensitive, and 136 as normal. A total of 1,696 officers and staff had been deployed to perform election duties across these stations.\n\nThe total number of registered voters in PP-52 was 297,185, including 157,725 male voters and 139,460 female voters.\n\nThe voter turnout was recorded as 44.79 per cent, with a total of 133,096 ballots cast, out of which 130,837 were counted as submitted in the right manner.\n\nAfter her victory, Warraich told Dawn.com: “This is not just my victory — it is the victory of the people of Sambrial. They did not elect me for politics but for service, and I will do my utmost to live up to their expectations.”\n\nThe PML-N leader went on to thank Punjab Chief Minister Maryam Nawaz, adding that her support helped her. Warraich had served as chairperson of the Sialkot district council from 2016 to 2020.\n\nPrime Minister Shehbaz Sharif expressed gratitude for the victory, congratulating Warraich.\n\n“Thanks to the unbreakable bond between the leadership and the workers, PML-N continues to reflect the will of the people,” the premier asserted in a post on X.\n\nHe credited the victory to the unwavering leadership of PML-N President Nawaz Sharif and CM Maryam, as well as the dedication of his party workers.\n\nIn a statement, CM Maryam also felicitated Warraich on her success. “Thanks to the people of Sambrial for once again placing their trust in PML-N,” she said.\n\n“This victory is a validation of our policies. The public has sent a clear message that they want progress, service, and stability,” she said.\n\nThe chief minister stressed her government was actively working for public welfare in every constituency, pledging that those efforts would now be further accelerated.\n\n“We will live up to the trust the people of Sambrial have shown in us,” CM Maryam was quoted as saying by her party.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/02132416a4f29e1.png",
  "retrievedAt": "2025-08-18T03:07:22.240Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914953/pml-ns-hina-arshad-secures-punjab-assembly-seat-in-sialkot-polls-marred-by-rigging-claims",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T09:09:42.000Z"
}
