{
  "title": "Govt announces four-day Eidul Azha holidays - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal government on Monday announced a four-day public holiday on the festive occasion of Eidul Azha.\n\nAccording to a notification issued by the Cabinet Division, the government has declared a public holiday from June 6-9, 2025 (Friday to Monday).\n\n“The prime minister has been pleased to declare the 6th, 7th, 8th, and 9th (Friday to Monday) as public holidays on the occasion of Eidul Azha,” the statement said.\n\nPakistan would observe Eidul Azha on June 7, the moon sighting Central Ruet-i-Hilal Committee (RHC) announced last month after the crescent for the month of Zilhaj was not sighted.\n\nThe committee’s meeting took place on a roof in Islamabad’s Kohsar Block, where the religious affairs ministry has its office.\n\nAddressing a press conference, RHC Chairman Maulana Abdul Khabeer Azad said, “No testimony of sighting the moon of the month of Zilhaj was received from any part of Pakistan […]. Therefore, it was decided with consensus that Zilhaj 1, 1446AH would be on May 29, Thursday and Eidul Azha would be observed on June 7, Saturday.”\n\nHe noted that the weather remained cloudy in most parts of the country and clear in some.\n\nMaulana Azad presided over the meeting of the RHC with officials and experts from other departments also gathered to see the moon. Simultaneous zonal meetings of the RHC also took place at their respective headquarters in the provincial capitals to send testimonies.\n\nDr Mohammad Hasan Ali, director of the Institute of Meteorology and Geophysics at the Pakistan Meteorological Department; Shaukatullah Khan of the Space and Upper Atmosphere Research Commission (Suparco); and Zainul Abedin from the science and tech ministry were among those present during the meeting.\n\nCelebrated on the 10th of Zilhaj, Eidul Azha marks the culmination of Haj, one of the five pillars of Islam.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/271913311b9374e.png?r=003041",
  "retrievedAt": "2025-08-18T03:07:12.861Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1914994/govt-announces-four-day-eidul-azha-holidays",
  "dateList": "2025-06-02",
  "date_published": "2025-06-02T12:40:02.000Z"
}
