{
  "title": "Mobilink Bank carries out nationwide plantation drive to boost safeguards against climate change",
  "link": "https://www.app.com.pk/national/mobilink-bank-carries-out-nationwide-plantation-drive-to-boost-safeguards-against-climate-change/",
  "date_published": "2024-04-22T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP):Pakistan’s leading digital microfinance bank, Mobilink Bank, carried out a nationwide plantation drive to help enhance the country’s forest cover as well as mitigate the looming impacts of climate change.\nMobilink Bank’s teams from all 109 branches nationwide participated in the drive with remarkable enthusiasm and planted approximately 5000 saplings to protect the environment and hand down a serene and greener Pakistan to future generations, said a news release.\nThe campaign was part of Mobilink Bank’s Climate Action Program, Change to Sustain, which envisions a sustainable and prosperous Pakistan that is resilient and effectively shielded against the far-reaching impacts of climate change. Sustainability is at the heart of the Bank’s corporate philosophy, which it seeks to replicate through impactful social responsibility initiatives for the broader societal benefit.\nMobilink Bank is part of the VEON group, a global digital operator that provides converged connectivity and digital services to nearly 160 million customers in six dynamic markets that are home to 7% of the world’s population.\nApart from the teams from Mobilink Bank branches, senior officials from district administration, State Bank of Pakistan (SBP), faculty members of various educational institutions, and members of civil society also attended the plantation drives in multiple cities and towns. They expressed hope that the endeavor will boost environmental protection, besides improving air quality and the natural beauty of the urban and rural centers, thereby positively impacting the lives of citizens.\nSharing his thoughts regarding the plantation drive, Chief Operating Officer of Mobilink Bank, Haaris Mahmood Chaudhary, said, “Mobilink Bank is proud to achieve the remarkable milestone of planting approximately 5000 trees nationwide under its Climate Action Program, Change to Sustain. The program stems from our organizational values of sustainability and social responsibility, where we seek to create shared value for the communities we serve. The need for aggressive plantation cannot be overstated, as Pakistan is amongst the top eight countries most affected by climate change. Our program strengthens the safeguards against climate change to protect the livelihoods, natural resources, and lives of vulnerable communities, mainly women. We firmly believe we can build a sustainable and prosperous future for our country.”\nMobilink Bank recognizes that environmental responsibility is not just about external impact but also about fostering a culture of sustainability within its workforce. Through engaging in environmental initiatives, the Bank empowers employees to become active agents of change. This focus on environmental stewardship fosters collaboration and teamwork as employees work together towards a common goal. It strengthens civic responsibility, encouraging employees to translate their eco-conscious practices into their daily lives beyond the workplace.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:01:08.642Z"
}
