{
  "title": "Pakistan, Iran agree to ban terrorist organizations",
  "link": "https://www.app.com.pk/national/pakistan-iran-agree-to-ban-terrorist-organizations/",
  "date_published": "2024-04-22T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Pakistan and Iran on Monday decided in principle to ban terrorist organizations in their respective countries.\nThe decision to the effect was taken in a meeting between Minister for Interior Mohsin Naqvi, and his Iranian counterpart Dr Ahmad Vahidi and Law Minister Amin Hussain Rahimi.\nThe two sides agreed on a joint plan of action to deal with the menace of terrorism being a common problem, with further improving mutual support and exchange of intelligence information. It was decided to sign a security agreement in that regard at the earliest.\nIt was also decided to provide all possible facilities to the Pakistani pilgrims on the occasion of Arba’een. The Iranian Interior Minister extended an invitation to his Pakistani counterpart to visit Iran in that regard where the Iraqi counterpart would also be invited.\nThe two sides observed that joint initiatives would help ensure the provision of best facilities to the pilgrims.\nInterior Minister Naqvi thanked his counterpart for the invitation to visit Iran.\nBoth sides also agreed to waive the fines imposed on their nationals imprisoned in each other’s country.\nMohsin Naqvi said that he wanted that the Pakistani prisoners in Iran should return to the homeland as soon as possible.\nThe two countries also decided to increase cooperation in border management, including steps for prevention of smuggling and drugs trafficking.\nMinister Naqvi said that smuggling was a cause of economic loss for both countries and its prevention through border management would help promote mutual trade.\nThe two sides also agreed to activate the border markets as soon as possible.\nThe Iranian Interior Minister praised Pakistan’s excellent job of border fencing.\nHe said that Pakistan had historical, cultural and religious relations with Iran.\nMinister Naqvi said that Pakistan attached great importance to its fraternal relations with Iran and was keen to further strengthen mutual cooperation.\nHe said all Islamic countries would have to work together for the rights of the oppressed Muslims of Gaza.\nHe thanked the Iranian Government for supporting Pakistan’s position on the Kashmir issue.\nThe Iranian President’s visit to Pakistan was very important in terms of bilateral relations, he observed.\nBoth the Iranian ministers thanked Mohsin Naqvi for the warm welcome and hospitality extended to them on their visit to Pakistan.",
  "retrievedAt": "2025-08-11T02:00:20.048Z"
}
