{
  "title": "Gillani calls for enhancing parliamentary engagements between Pakistan and Iran",
  "link": "https://www.app.com.pk/national/gillani-calls-for-enhancing-parliamentary-engagements-between-pakistan-and-iran/",
  "date_published": "2024-04-22T15:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Senate Chairman Yousuf Raza Gillani on Monday extended a warm welcome to the Iranian President Dr Seyyed Ebrahim Raisi and his delegation, and called for enhancing parliamentary engagements, fostering regional cooperation, and further improving bilateral relations between Pakistan and Iran.\nDuring the meeting, the chairman emphasized the deep historical ties between his family and Iran, tracing back to his ancestor, Hazrat Ghaus-ul-Azam, said a news release issued by the Senate Secretariat.\nHe reiterated the personal significance of his past visits to Iran, where he emphasized the importance of bilateral dialogue in strengthening relations between the two nations.\nHe recalled that Iran was the first country to recognize Pakistan in 1947, further solidifying the strong ties between the two nations.\nReaffirming the enduring cordial relations between Pakistan and Iran, the chairman celebrated the strong bilateral ties grounded in shared values and cultural heritage. He emphasized that these ties serve as the bedrock of foreign policy, contributing to regional stability and prosperity.\nExpressing commitment to enhancing parliamentary cooperation, the chairman underscored the need for greater inter-parliamentary engagements and exchange programs aimed at bolstering the capacity and expertise of parliamentary staff.\nHe also shared concerns over recent developments in Indian Illegally Occupied Jammu and Kashmir, highlighting the volatile situation and expressed gratitude for Iran’s continued support towards the just cause of the Kashmiri people.\nBoth leaders stressed the importance of joint efforts in addressing regional security challenges, including counter-terrorism and border security.\nThey reaffirmed their commitment to dialogue and cooperation in maintaining peace and stability in the region. The chairman stressed the significance of promoting cultural and educational exchanges between the two nations.\nHe emphasized fostering greater understanding and goodwill among the people, and exploring opportunities for collaboration in education, science, and technology.\nBoth leaders expressed optimism for the future of Pakistan-Iran relations and reiterated their commitment to further strengthening cooperation on regional and global issues of mutual interest.\nPresident of Iran appreciated the Chairman Senate historical link with Iran and acknowledged his spiritual bond.",
  "retrievedAt": "2025-08-11T02:00:23.715Z"
}
