{
  "title": "UET Lahore improves its global ranking",
  "link": "https://www.app.com.pk/national/uet-lahore-improves-its-global-ranking/",
  "date_published": "2024-04-22T12:49:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 22 (APP): The University of Engineering and Technology (UET) Lahore has made significant strides in its global standing, climbing to the 791-800 range in the QS World University Rankings.\nThis marked improvement, particularly compared to its previous position in the 801-1000 bracket in 2023, highlights its dedication to academic excellence and innovation. Out of 1500 universities worldwide and 14 universities from Pakistan evaluated this advancement underscores UET Lahore’s commitment to elevating its educational standards and solidifying its reputation as a leading institution in engineering and technology.\nUET Lahore has achieved a remarkable feat in the QS World University Rankings by subject. Among the 14 Pakistani universities assessed, UET Lahore stands out in the domain of Engineering and Technology, securing the impressive position of 236. This significant advancement marks a notable improvement of 43 places from its previous ranking which was 279. In QS Asia Universities Ranking, the UET Lahore has sustained its last year position at 179.\nAccording to the latest QS ranking data, the UET has improved its subject-wise world rankings considerably compared to 2023: Electrical & Electronic Engineering 201-250 compared to 251-300 last year; Mechanical Engineering and Computer Science & Information Systems remains the same 251-300 and 401-450 accordingly. UET has achieved its first time rankings in the domains of Mathematics with a ranking range of 501-550, Business & Management Studies with a ranking range of 601-620, and in Physics and Astronomy with a ranking range of 601-640.\nUET Lahore’s commendable rise in the rankings underscores its commitment to excellence and innovation in STEM solidifying its reputation as a leading institution not only in Pakistan but also on the global stage.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:01:28.296Z"
}
