{
  "title": "Pakistan, Iran for broadening bilateral cooperation",
  "link": "https://www.app.com.pk/national/pakistan-iran-for-broadening-bilateral-cooperation/",
  "date_published": "2024-04-22T15:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Pakistan and Iran have reiterated the resolve to further broaden mutually beneficial cooperation in various areas of common interest. Both sides underscored the need for operationalizing bilateral trade mechanisms to boost the volume of trade up to $10 billion. The two countries also urged the need to work together to overcome the challenges being faced by the region.\nThis was discussed between President Asif Ali Zardari and the visiting Iranian President, Dr Seyyed Ebrahim Raisi, during a meeting, held at Aiwan-e-Sadr on Monday.\nThe two leaders also discussed key regional and global developments, particularly the situation in the Middle East. President Asif Ali Zardari expressed deep concern over the worsening humanitarian situation in Gaza and strongly condemned Israel’s military aggression against the people of Gaza that had resulted in the killing of thousands of innocent Palestinians. He assured that Pakistan would consistently and unequivocally support the Palestinian cause. Both Presidents reiterated the need for enhanced international endeavours to bring an end to Israeli suppression of the people of Gaza and for enhanced humanitarian relief and assistance.\nThe President said that Pakistan and Iran enjoyed close fraternal ties based on shared religion, culture, and history, which needed to be further strengthened for the mutual benefit of the two brotherly countries. He thanked Dr Seyyed Ebrahim Raisi for being the first Head of State to visit Pakistan after the general elections, which reflected the deep personal commitment of the Iranian President to Pakistan.\nThe President appreciated Iran’s principled stance and its consistent support to the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) and their right to self-determination.\nThe President of Iran, Dr Seyyed Ebrahim Raisi, emphasized the need for further expanding and consolidating bilateral relations in all areas of mutual interest. He said that the interest of the two brotherly countries called for further cementing economic, trade and cultural relations. He highlighted that both countries had enormous potential to increase bilateral trade to the level of $10 billion.\nThe President of Iran appreciated Pakistan’s consistent support for their Palestinian brethren during the ongoing humanitarian crisis in Gaza.",
  "retrievedAt": "2025-08-11T02:00:22.159Z"
}
