{
  "title": "Pakistan keens to expand existing relations with Iran by promoting parliamentary, economic ties: NA speaker",
  "link": "https://www.app.com.pk/national/pakistan-keens-to-expand-existing-relations-with-iran-by-promoting-parliamentary-economic-ties-na-speaker/",
  "date_published": "2024-04-22T17:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Speaker of the National Assembly Sardar Ayaz Sadiq Monday said that Pakistan values its historical fraternal relations with Iran and was keen to expand the existing relations by promoting parliamentary and economic ties.\nDuring a meeting with the President of Iran Dr. Seyyed Ebrahim Raisi, the Speaker expressed his confidence that the visit of the Iranian President to Pakistan would not only enhance the relations between the two Islamic brother countries but also among other regional countries due to its far-reaching impacts.\nPakistani Parliamentary delegation comprising members of all the political parties including Syed Naveed Qamar, Aoon Chaudhry, Malik Muhammad Amir Dogar, Noor Alam Khan, Sahibzada Hamid Raza, Khalid Hussain Magsi, Chaudhry Salik Hussain, Dr Tariq Fazal Chaudhry were also present in the meeting, said a news release.\nThe Speaker warmly welcomed the Iranian President on behalf of the parliament and the people of Pakistan.\nHe said that sustainable peace in the region is hinged upon the resolution of bilateral issues amicably through dialogue.\nHe said that there were vast opportunities for cooperation in trade, energy and other sectors, which were essential for the development and prosperity of the people of both countries.\nHe hailed the establishment of trade centers on both sides of the Pakistan-Iran border and said that the establishment of trade centers on the Pakistan-Iran border would bring prosperity to the lives of the citizens living on both sides of the border.\nHe said that people-to-people and parliament-to-parliament contacts play a pivotal role in rendering bilateral relations more stable.\nPresident Raisi expressed his excitedness to visit Pakistan. He said that the Pak- Iran ties were more than the traditional and diplomatic relations as the people of the countries are bound in eternal relations of brotherhood, neighbourliness and love.\nHe thanked the people and government of Pakistan for the warm welcome and hospitality extended to him and his delegation in Pakistan. He said that close ties between the two countries will usher in a new era of regional development and prosperity.\nWhile talking on the occasion, MNA Syed Naveed Qamar said that Pakistan values its parliamentary contacts with Iran and added that the Parliament of Pakistan aimed to promote relations with Iran’s National Assembly.",
  "retrievedAt": "2025-08-11T02:00:18.165Z"
}
