{
  "title": "Eco-friendly agri technology imperative to overcome environmental pollution: Hina Hafeezullah",
  "link": "https://www.app.com.pk/national/eco-friendly-agri-technology-imperative-to-overcome-environmental-pollution-hina-hafeezullah/",
  "date_published": "2024-04-22T16:02:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Apr 22 (APP): Member Judicial Water & Environment Commission Hina Hafeezullah Ishaq has said that it is imperative to bring environment-friendly agricultural technology to the common farmer in order to overcome environmental pollution.\nShe expressed these views while addressing the environmental pollution meeting held at the University of Agriculture, Faisalabad (UAF).\nPro-Vice Chancellor/Dean Faculty of Agriculture UAF Dr. Muhammad Sarwar Khan, Principal Officer Public Relations and Publications Dr. Muhammad Jalal Arif, Dean Faculty of Animal Husbandry Dr. Qamar Bilal, Dean Faculty of Veterinary Sciences Dr. Farzana Rizvi, Dean Engineering Dr. Anjum Munir, Dr. Babar Shehbaz. Dr. Muhammad Azeem, Dr. Nadeem Akbar Sindhu, Dr. Shahid Ibn Zameer, Dr. Adnan Younis and others were also present in the meeting.\nHina Hafeezullah said that all possible measures are being taken at the government level to prevent elements that cause environmental pollution. She said that by bringing modern technology to the farmers, the trend of burning the crop residue should be stopped. She said that heavy fines are being imposed on the factories which are not following the environment friendly rules in order to control smog and other environmental diseases.\nShe urged the agricultural scientists to play their full role in bringing eco-friendly viable agricultural technology in the reach of the common farmer.\nDr. Muhammad Sarwar Khan said that the UAF is continuing the awareness journey with the farmers to promote zero-tillage and other technologies in cropping system of wheat and rice and  as well as other crops so that science-based modern research reaches the field.\nHe said that by strengthening the service provider system, modern technology is being promoted which prevents the burning at the fields. He called for applying the modern trends in the fields that not only increase the productivity but also help address other issues.\nDr. Muhammad Jalal Arif said that under the dynamic leadership of UAF Vice Chancellor Dr Iqrar Ahmad Khan, the scientists are building a strong relationship with farmers and industry.\nHe said that the university in coloration with HBL launched agricultural Dera in which fertilizers and modern technology are being easily provided to the farmers with the aim of ensuring food security.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:00:43.625Z"
}
