{
  "title": "TLP protest call ‘fails to move Punjab’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: After tensions, violence and chaos prevailing for several days, Punjab remained largely peaceful on Friday as no incident of violence or hostile gatherings was reported in any part of the province in response to the call given by the Tehreek-i-Labbaik Pakistan (TLP) to its workers to take out rallies in protest against the police action at Muridke.\n\nThe TLP even failed to bring its workers onto the roads in Lahore, where it had been holding violent protests during the last few days.\n\nReports suggest that the Punjab police successfully established the writ of law in the provincial capital and other cities where traffic and businesses remained running, while students attended their educational institutions as per routine on Friday.\n\nPeople were witnessed shopping in the city markets, while the outlets of multinational companies, especially the fast food joints, also remained open.\n\nSpecial security measures were witnessed at the Yateem Khana Chowk, Shahdara, Chungi Amar Sidhu, Thokar Niaz Baig and Babu Sabu Interchange, where the Lahore police leadership apprehended TLP workers’ protests.\n\nNo incident of violence or hostile gatherings reported\n\nNo rally was taken out by the radical outfit anywhere in the city, as per the reports.\n\n“Punjab witnessed not a single protest activity by the TLP, nor any unpleasant episode was reported on Friday”, provincial police chief Dr Usman Anwar told Dawn.\n\nHe attributed this ‘success’ to the heightened security measures, frequent raids on the TLP activists, engaging businessmen and convincing them to stay strong and the implementation of the Punjab government’s policy in letter and spirit.\n\n“As many as 308 more activists of the TLP were arrested in the province-wide crackdown launched by the Punjab police on Thursday night to foil its Friday’s call for agitation,” the IGP said.\n\nHe said that the police were deployed in markets, business centres, on highways and important locations to maintain law and order. They were directed to arrest the miscreants and lodge cases under the Anti-Terrorism Act for committing any unlawful or violent act, he added.\n\nAnother senior police officer said that the Punjab police provided a list of hardcore TLP leaders and activists to the Counter Terrorism Department (CTD) to trace and arrest them.\n\nHe said that the troublemakers were using social media to incite violence and disseminate false reports of state aggression.\n\nLater, a Punjab police spokesperson said that the situation remained stable across the province, including Lahore and people, especially the trader community, completely rejected the strike call given by “miscreants.”\n\nPrivate as well as public transport remained smooth in all cities, while all highways and main roads, including the motorways, the GT Road and the Ring Road, remained open to traffic, he said.\n\nPublished in Dawn, October 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1809370242dfd2e.webp",
  "retrievedAt": "2025-10-20T18:20:50.255Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949593/tlp-protest-call-fails-to-move-punjab",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T01:45:17.000Z"
}
