{
  "title": "Zimbabwe roped in after Afghanistan pulls out of upcoming tri-nation series - Pakistan - DAWN.COM",
  "author": null,
  "content": "Zimbabwe Cricket on Saturday accepted the Pakistan Cricket Board’s (PCB) invitation to participate in a T20I tri-series also featuring Sri Lanka, following the withdrawal of the Afghanistan Cricket Board (ACB).\n\nThe ACB pulled out of the series after alleging that three of its cricketers were killed in a strike carried out by Islamabad.\n\nPakistan had again targeted terrorist hideouts in Afghanistan on Friday. Incidents were reported from the Angoor Adda region and across Afghanistan’s Urgun and Barmal districts of Paktika province as strikes were conducted against hideouts of the outlawed Hafiz Gul Bahadur group.\n\nThe attacks came on the heels of an audacious gun-and-bomb attack targeting a military installation in North Waziristan, and just hours after Islamabad and Kabul extended their two-day ceasefire.\n\n“Zimbabwe Cricket has accepted the Pakistan Cricket Board’s invitation to participate in a T20I tri-series also featuring Sri Lanka,” a statement from the PCB said.\n\nThe maiden tri-series on Pakistan soil has been scheduled to provide all three sides with preparation ahead of next year’s ICC Men’s T20 World Cup, the cricket board added.\n\nThe International Cricket Council (ICC) on Saturday night issued a statement on the deaths of three Afghan cricketers in an airstrike in Afghanistan’s Paktika province, stating it was “deeply saddened and appalled”.\n\n“The three young men had returned home after participating in a friendly cricket match when they were killed in an attack that also claimed the lives of several civilians,” the governing body said.\n\n“The ICC strongly condemns this act of violence that has robbed families, communities, and the cricketing world of three bright talents whose only ambition was to play the sport they loved,” it added.\n\n“The ICC stands in solidarity with the Afghanistan Cricket Board and echoes their grief.”\n\nIn a post on social media platform X late Friday night, the ACB said three players — identified as Kabeer, Sibghatullah and Haroon — and “five other countrymen” from Urgun district were killed and seven others were injured in a strike.\n\nIt said the players had earlier travelled to Sharana to participate in a friendly cricket match.\n\n“The ACB considers this a great loss for Afghanistan’s sports community, its athletes, and the cricketing family,” the cricketing board said. As a result, the ACB decided to withdraw from participating in the tri-nation series scheduled to be played in November.\n\nAfghanistan’s ace spinner Rashid Khan, in a post on X, said he welcomed the ACB’s decision to withdraw from the upcoming fixtures against Pakistan.\n\nPakistan was set to host the series from November 17 to 29.\n\nEarlier, Pakistan Cricket Board (PCB) Spokesperson Amir Mir told Dawn.com that the tri-series was still on and the third team would be finalised shortly.\n\nSeparately, Information Minister Attaullah Tarar said earlier today that Pakistan had carried out precision strikes in Afghanistan against the outlawed Gul Bahadur group last night.\n\n“All speculations and assertions being made regarding targeting of civilians are false and meant to generate support for terrorist groups operating from inside Afghanistan,” he said on X.\n\nCricket icon Shahid Afridi took to X and said that Afghanistan, in its acts of aggression, had forgotten Pakistan’s hospitality and “favours”.\n\n“Pakistan has always stood by its Afghan brothers, considering the troubles of Afghans as its own trouble,” the former all-rounder wrote. “It opened its borders for its brothers. It accommodated 4 million refugees on its land.\n\n“I have to say that in recent days, Afghanistan, forgetting all these favours, committed open aggression on the borders, to which our forces gave a full response,” he added.\n\nAfridi wrote that Afghanistan should think of Pakistan as a brotherly Islamic country and should not allow its land to be used to aid acts of terrorism.\n\nPakistan has witnessed a surge in terrorist attacks, especially in KP and Balochistan, predominantly targeting the police, law enforcement agencies’ personnel, and security forces. Attacks increased after the banned Tehreek-i-Taliban Pakistan broke a ceasefire agreement with the government in 2022.\n\nIslamabad has been raising concerns over the presence TTP terrorists in Afghanistan and has repeatedly urged Kabul to take action to prevent these attacks. For its part, Kabul has batted aside accusations of support for militancy, alternating between vehement denials of Afghan soil being used to launch attacks across the border, assurances that have failed to materialise, and simply telling the Pakistani state to negotiate with the TTP.\n\nTensions have flared between the two countries over the last few days, with Kabul and Islamabad engaging in border skirmishes on October 11. According to the military, 23 Pakistani troops were martyred and 200 Taliban and affiliated terrorists killed at the border following an attack from the Afghan side.\n\nAfghanistan claimed it carried out the attack as a “retaliatory” measure, accusing Islamabad of conducting air strikes in its territory earlier in the week. For its part, Islamabad has not confirmed whether it was behind the air strikes but maintained that Kabul must “stop harbouring the Tehreek-i-Taliban Pakistan on its soil”.\n\nSubsequently, Afghan forces struck several Pak­istani posts and the Pakistan Air Force (PAF) and artillery pounded Afghanistan’s posts, targeting hostile positions in the Afghan provinces of Helmand, Kandahar, Khost, Paktia, and Paktika.\n\nOn Tuesday night, fighting flared up again on between Pakistani forces and the Afghan Taliban in the Kurram district of Khyber Pakhtunkhwa. However, a temporary ceasefire was then announced. The Foreign Office (FO) said the ceasefire was implemented at the Taliban’s request and with mutual consent, and would last for 48 hours.\n\nPrime Minister Shehbaz Sharif, however, made it clear on Thursday that he expected Kabul to make the first move if it was serious about resolving the issue of cross-border terrorism through talks.\n\n“We decided the temporary 48-hour ceasefire [and] the message has been sent that if they want to fulfil our justified conditions through talks, then we are ready,” he said, adding that if the Taliban were serious, they would initiate steps to hold talks.\n\nOn Friday, with representatives from both sides expected to meet in Doha soon for talks mediated by the Qatari government, Pakistan again targeted terrorist hideouts in Afghanistan. It had come after an attack on a military installation in North Waziristan and after Islamabad and Kabul extended the two-day ceasefire.\n\nThere was no statement from Pakistan’s military, but terrorists linked to the Hafiz Gul Bahadur group had claimed responsibility for the attack on Khaddi Fort in Mir Ali, where a suicide bomber rammed an explosive-laden vehicle into the main gate of a military camp before attempting to stage an incursion earlier in the day.\n\nMeanwhile, in a telling statement posted to X (formerly Twitter), Defence Minister Khawaja Asif said on Friday that the relationship with Kabul would no longer be like it was in the past.\n\n“There will no longer be protest notes or appeals for peace; no delegations will go to Kabul. Wherever the source of terrorism lies, it will have to pay a heavy price,” he wrote.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/182114578dc0f43.webp",
  "retrievedAt": "2025-10-20T18:20:37.736Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949695/zimbabwe-roped-in-after-afghanistan-pulls-out-of-upcoming-tri-nation-series",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T06:56:39.000Z"
}
