{
  "title": "3 terrorists killed as Bannu police thwart attack on checkpost - Pakistan - DAWN.COM",
  "author": null,
  "content": "Three terrorists were killed after they attempted to attack a police checkpost in Khyber Pakhtunkhwa’s Bannu late last night, police said in a statement on Saturday.\\n\\nKP police said that three terrorists belonging to the Fitna-al-Khawarij had made an unsuccessful attempt to target the Mazanga police checkpost last night.\\n\\nFitna-al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP).\\n\\nPolice said the terrorists were attempting to attack the Mazanga police checkpost using a rickshaw loaded with explosive material. During this attempt, they were intercepted by police officials who tried to stop them due to their suspicious activity, the police said.\\n\\nWhen they did not stop, officials opened fire which caused the rickshaw to explode, the statement said, adding that all three terrorists were killed while police personnel remained safe.\\n\\nThe explosion caused minor damage to nearby houses, it added.\\n\\nAccording to the statement, Bannu Deputy Inspector General (DIG) Sajjad Khan and Bannu District Police Officer (DPO) Saleem Abbas Kalachi lauded the prompt and courageous response of the policemen, saying they had “set an exemplary standard of duty, bravery, and professionalism“.\\n\\nThe statement said that Bannu police was “fully committed to protecting the lives and property of the people at all costs”. The statement added that the DIG and the DPO had also announced cash rewards and certificates for the officers stationed at the checkpoint.\\n\\nPakistan has lately been witnessing an uptick in terrorist activities, mainly in KP and Balochistan. In November 2022, the TTP, after breaking a ceasefire deal with the government, had vowed to escalate attacks against the security forces, the police, and other law enforcement agencies’ personnel.\\n\\nOn Thursday, the military said security forces had killed 34 “India-backed” terrorists during multiple operations that took place across Khyber Pakhtunkhwa over the span of three days.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/18121805cd4cc36.webp",
  "retrievedAt": "2025-10-20T18:41:00.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949717/3-terrorists-killed-as-bannu-police-thwart-attack-on-checkpost",
  "dateList": "2025-10-18",
  "date_published": null
}
