{
  "title": "PPP decides to give PML-N ‘more time’ to fulfil demands - Pakistan - DAWN.COM",
  "author": null,
  "content": "The PPP on Saturday, following a meeting of its Central Executive Committee (CEC), said it was giving its coalition ally, the ruling PML-N, more time to fulfil its demands.\n\nThe two parties are partners in the federation, though the PPP does not have a presence in the cabinet. The disagreement between the ruling allies first surfaced last month, soon after heavy monsoon rains and flooding devastated parts of Punjab and other provinces. The PPP pushed for using the BISP to deliver immediate relief to flood-affected families, a demand resisted by the Punjab government.\n\nTensions deepened when PPP leaders publicly criticised the Punjab government, accusing it of politicising relief and sidelining the federal mechanism for assistance. On the other hand, PML-N ministers also voiced frustration, with Rana Sanaullah calling for a complete overhaul of BISP and arguing that its current structure was unfit.\n\nThe technical disagreement soon turned into a political confrontation, with both the ruling allies issuing counter-accusations almost on a daily basis. Earlier in October, PPP walked out of Senate and National Assembly sessions to protest what it called insults from Punjab’s PML-N leadership over the controversial Cholistan canal project and criticism of the PPP’s Sindh administration.\n\nToday’s CEC meeting was held on the 18th anniversary of the 2007 Karsaz bombing when twin blasts ripped through the homecoming procession of former prime minister Benazir Bhutto, killing over 180 people.\n\nPPP Vice President Senator Sherry Rehman, Sindh Senior Minister Sharjeel Inam Memon and PPP leader Nadeem Afzal Chan addressed a press conference after the meeting, where Rehman said the PPP chairman discussed the use of BISP to disburse flood relief funds to those affected by flooding.\n\n“The world recognises BISP and knows that those affected by flooding need immediate assistance at their doorstep,” the senator said. “If their doorstep has been washed away, then the aid can be directly disbursed into their account.”\n\n“We have demanded that the first tranche of aid be disbursed. Rather than engaging in political mudslinging, the government should review how we immediately distributed aid through BISP during the 2022 floods,” she added.\n\n“We want the federal government to take notice of Chairman Bilawal’s demands and disburse aid to affected areas.”\n\nChan added that the party has decided to give the federal government more time to fulfil its demands, including the use of BISP to provide flood relief funds to those affected by the deluge in Punjab.\n\nOther demands included changes to the system for electing local government bodies in Punjab, addressing rising energy costs and the import of crops.\n\n“There are some promises that the prime minister promised to fulfil during our last meeting,” Chan stated. “He said, ‘these are the people’s issues’ and requested time. Today, at the CEC, the president and chairman delivered a full briefing and the meeting decided to give the [PML-N] leadership more time.”\n\nHowever, our demands, which are those of the public, still stand,“ he added. “When we have our next CEC, hopefully in a few months, then we will review the situation.”\n\nOn Thursday, the PPP leadership met with Prime Minister Shehbaz Sharif and other PML-N leaders, with the ruling party saying it valued and respected its coalition ally.\n\n“The prime minister has agreed to utilise BISP for helping flood victims and that the PPP will be taken on board while decision-making about flood victims and farmers,” Chan told Dawn after Thursday’s meeting.\n\nChan said the PM had agr­eed to all the PPP’s demands “as they were justified and logical”.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:20:24.038Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949752/ppp-decides-to-give-pml-n-more-time-to-fulfil-demands",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T18:45:27.000Z"
}
