{
  "title": "PPP set to observe 18th anniversary of Karsaz bombing with simplicity - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Peoples Party (PPP) is set to commemorate on Saturday (today) the 18th anniversary of the tragic October 18, 2007 Karsaz bombing when twin blasts ripped through the homecoming procession of former prime minister Benazir Bhutto, killing over 180 people.\n\nWhile no public meeting will be held on Saturday to mark the incident, the central executive committee (CEC) of the PPP, to be chaired by party chairman Bilawal Bhutto-Zardari, is scheduled to meet here at Bilawal House.\n\nIn a statement issued by the PPP Karachi Division, the party announced that in accordance with the directions of chairman Bilawal Bhutto-Zardari, no “public jalsa” will be held this year.\n\nThis decision was made in solidarity with the flood-affected people across the country. Instead, the party will observe the anniversary with “solemnity, respect, and deep gratitude for the sacrifices made by its martyrs”.\n\nNo public meeting planned in view of flood devastations; Bilawal to chair CEC meeting today\n\n“The series of tributes will begin on the evening of October 17 and continue through October 18, culminating in the visit of Chairman Bilawal Bhutto-Zardari to the Karsaz Monument, where he will lay floral wreaths and offer prayers for the martyrs who gave their lives for the cause of democracy,” the statement read.\n\nBilawal pays tribute to slain workers\n\nThe PPP chairman in a separate statement paid rich tribute to the martyrs of Karsaz, praising their courage and sacrifices.\n\n“October 18, 2007, remains forever etched in the soul of the nation — the day when over three million people welcomed Shaheed Mohtarma Benazir Bhutto home, and 180 brave Jiyalas laid down their lives defending the dream of a democratic Pakistan,” he said.\n\nHe described the attack as a sinister “alliance between dictatorship and terrorism” aimed at destroying the hope of the people.\n\n“They sought to extinguish the light of democracy, but the blood of our martyrs made it shine brighter,” he said.\n\nReaffirming his commitment to the mission of Benazir Bhutto and the martyrs of Karsaz, Bilawal vowed to continue the struggle for democracy, equality, and justice. “The blood of our martyrs continues to illuminate our path toward a peaceful, democratic, and prosperous Pakistan,” he concluded.\n\nIn a statement, Sindh Senior Minister Sharjeel Inam Memon, while paying tribute to the slain workers, said that the day remains a dark yet immortal chapter in Pakistan’s democratic history\n\nHe said that hundreds of PPP supporters sacrificed their lives to prove that no price was too high in the cause of democracy. “The Karsaz tragedy stands as a symbol of the failure of those forces that tried to silence the people’s voice. Despite the tragedy, the PPP continued its struggle for democracy, the Constitution, and the people’s right to rule—principles that remain the foundation of the party today,” he stated.\n\nHe said that the PPP has always believed in the power of the people and is prepared to make every sacrifice to defend democracy. “The martyrs of the Karsaz tragedy are national heroes whose sacrifices will always be remembered as part of the golden chapter of Pakistan’s democratic history.”\n\nMeanwhile, the PPP Sindh chapter has also announced that commemorative activities will be held at the district level across the province to mark the anniversary.\n\nThe party leaders, workers, and supporters will gather at local offices and monuments to offer prayers and remember the sacrifices that continue to define the PPP’s legacy of democratic resistance.\n\nThe PPP Sindh chapter president Nisar Khuhro in a statement paid tribute to the martyrs of the Karsaz tragedy, stating that the incidents of October 18 and December 27 were part of the same conspiracy aimed at murdering democracy and the hopes of the people.\n\n“Despite these tragedies, the PPP raised the slogan democracy is the best revenge and played a crucial role in ensuring the continuation of democracy in the country,” he said.\n\nHe said that Benazir Bhutto returned to Pakistan on October 18 in response to the people’s demand, but General Pervez Musharraf did not want her to return.\n\nThese tragic incidents, he said, were part of a broader conspiracy to crush democracy and the people’s aspirations, aiming to prevent the rise of a people’s government in the country.\n\nPublished in Dawn, October 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/18093836d1ed1f5.webp",
  "retrievedAt": "2025-10-20T18:20:50.545Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949620/ppp-set-to-observe-18th-anniversary-of-karsaz-bombing-with-simplicity",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T01:45:09.000Z"
}
