{
  "title": "Putin’s Budapest visit makes awkward spectacle for EU, Nato - World - DAWN.COM",
  "author": null,
  "content": "BUDAPEST: When Russia’s Vladimir Putin steps off the plane in European Union and Nato member Hungary for a summit with Donald Trump, it will be uncomfortable viewing for allies of Ukraine that have sought to isolate a leader they say is a war criminal.\n\nThe US president said on Thursday he may meet his Russian counterpart in Budapest within two weeks, adopting a more conciliatory tone towards Russia just as it had looked like Washington could send Tomahawk missiles to Kyiv.\n\nThe choice of a country that is part of groupings that have spearheaded international efforts to help Ukraine and isolate Russia for the summit raised eyebrows among diplomats and analysts as much as the plan itself.\n\nIt was there that, in 1994, the United States, Britain and Russia signed the Budapest Memorandum, providing Ukraine with security assurances in exchange for Kyiv giving up its nuclear weapons.\n\n“It is awkward for both the EU and Nato,” said a senior Western European official. “Timing is everything: the Tomahawk threat is growing, and all of a sudden, Putin wants to meet. But if Trump can pull something off, he should do it.”\n\nGood terms with Russia\n\nHungarian Prime Minister Viktor Orban has maintained warm relations with Moscow, adding to the bete noire status he had already gained in Brussels after years of conflict over what the EU says is democratic backsliding in Budapest.\n\nPutin is wanted under an arrest warrant from the International Crim­inal Court on charges of illegally deporting children from Ukraine, but few observers expect this to be a problem for him in Budapest.\n\nOrban announced in April during a visit by Israeli leader Benjamin Netanyahu, who has an ICC warrant for his arrest on charges of war crimes in Gaza, that Hungary would withdraw from the court.\n\nThe process has not yet been completed, meaning that technically Putin should be arrested if he visits Budapest, although, as a senior diplomat from an EU country said, “Nobody will be surprised if the Hungarians don’t arrest Putin.”\n\nHungarian Foreign Minister Peter Szijjarto said on Friday that Hungary will ensure Putin can enter the country for the summit and return home afterwards.\n\nSymbolic blow to EU\n\nBotond Feledy, a geopolitical analyst at Red Snow Consulting, said the choice of Budapest for the meeting meant Putin could “hit several birds with one stone”.\n\n“On the one hand, he will be holding talks on the Ukraine war in an EU country without EU leaders attending,” he said.\n\n“For Putin, this is a much stronger blow to the stomach for Europe symbolically on several levels compared with this meeting being held in Turkey or elsewhere.”\n\nFeledy also noted that the meeting would exclude Ukrainian President Volodymyr Zelensky for a second time after the Trump-Putin summit in Alaska and potentially add to bad blood between Budapest and Kyiv.\n\nUkraine’s relationship with Hungary has grown increasingly tense. Zelensky said Hungarian drones had crossed into Ukraine last month, prompting Orban to retort that Ukraine was not a sovereign state.\n\nTough elections ahead\n\nOrban is one of the most high-profile international backers of Trump’s MAGA movement, lauded by devotees for his uncompromising approach to immigration and LGBTQ+ rights, and his focus on conservative Christian values.\n\nTrump said on Tuesday that Orban was “fantastic” and “a great leader”, despite his failure to heed US calls to stop buying Russian oil.\n\nEuropean officials expect the Hungarian leader to play up his mediator role ahead of elections next year, in which opinion polls show his Fidesz party trailing centre-right rivals Tisza.\n\n“The Hungarian side will definitely try to present its role as an important one, bridging the gap between the two significantly different sides,” said Marcin Przydacz, foreign policy adviser to the Polish president.\n\nAnalysts say that domestic issues will determine the outcome of the elections, but the summit could help Orban bolster his argument that his links with Russia are needed to end the war.\n\n“If there is an agreement, that will legitimise his narrative about peace retrospectively,” said Zol­tan Novak, an analyst at the Centre for Fair Poli­tical Analysis.\n\nPublished in Dawn, October 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/68f2e5a5a22a8.jpg",
  "retrievedAt": "2025-10-20T18:20:51.131Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949651/putins-budapest-visit-makes-awkward-spectacle-for-eu-nato",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T01:45:02.000Z"
}
