{
  "title": "TTP ‘commander’ among 9 militants killed in Lakki Marwat - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT: At least eight alleged terrorists were gunned down in an intelligence-based operation in the Sultankhel area, while a commander of the banned Tehreek-i-Taliban Pakistan (TTP) was reportedly killed by unidentified gunmen, on Friday.\n\nIn addition, security forces claimed to have foiled a terror bid in Bajaur after a large cache of explosives, loaded into a non-Customs paid vehicle, was destroyed in Lowi Mamund tehsil.\n\nIn Lakki Marwat, officials said an operation was launched on reports about the presence of militants in the rural area located on the border with Punjab, near Mianwali.\n\nSecurity forces spotted the terrorist hideout in the forest between Kaichi Kamar and Sultankhel, which was reportedly targeted through a unmanned drone.\n\nForces foil major terror bid in Bajaur by disabling explosive-laden vehicle\n\nDuring the operation, eight militants were eliminated and their hideouts were destroyed, while security forces seized a large quantity of arms, ammunition and explosives and launched a sanitisation operation to neutralise any other threats in the area.\n\nSeparately, TTP ‘commander’ Tariq Kochi, who hails from Toi Khula tehsil of Lower South Waziristan, was reportedly killed near the border with Balochistan by unidentified gunmen.\n\nSources said the incident occurred near the Tesh mountain range, where Kochi and other militants were ambushed by unidentified individuals.\n\nPolice said that Kochi had been involved for the past year in multiple incidents of attacks, shootings, and target killings targeting security forces, police personnel, and civilians in the area.\n\nSecurity forces also claimed to have foiled a terrorism bid by destroying a huge cache of explosives loaded in a car in Bajaur.\n\nA senior police official said that the sabotage bid was foiled in Thangai area at around 11:15 am, when the security personnel targeted a suspected vehicle laden with explosives.\n\nDPO Waqas Rafique said the explosives-laden vehicle was disabled by firing at it, adding that no loss of life was reported.\n\nThe official, however, said that an investigation was underway to ascertain who was behind the failed sabotage bid.\n\nPublished in Dawn, October 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/1807255155a67f5.webp",
  "retrievedAt": "2025-10-20T18:21:04.138Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949674/ttp-commander-among-9-militants-killed-in-lakki-marwat",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T01:44:25.000Z"
}
