{
  "title": "24 transgender persons hospitalised in India’s Indore after ‘mass suicide’ bid: reports - World - DAWN.COM",
  "author": null,
  "content": "At least twenty-four people from the transgender community were hospitalised in the city of Indore in India’s Madhya Pradesh state after consuming disinfectant in a “mass suicide” bid related to a dispute with a rival group, multiple Indian media outlets reported.\\n\\nNDTV reported that the incident occurred on Wednesday night and they were hospitalised soon after.\\n\\n“They have claimed to have consumed phenyl together, but this cannot be immediately confirmed,” the report quoted Maharaja Yashwantrao Hospital Superintendent-in-Charge Dr Basant Kumar Ningwal as saying, adding that none of them were in a critical condition.\\n\\n“What triggered the mass act by the transgender persons was not immediately clear,” the report said. Meanwhile, The Hindu reported that the incident occurred “following an altercation with … a rival group leader and her associates”.\\n\\nIndore Additional Deputy Commissioner of Police (Crime) Rajesh Dandotiya told the outlet that the rival group leader was arrested on Thursday and a case was registered against her and three associates for alleged assault and extortion.\\n\\n“As per the FIR (first information report), there was a dispute between the two factions of the community and that [the rival group leader] and her associates allegedly threatened and assaulted the 24 persons when they demanded some money from a deposit collected for a community conference, prompting them to try to harm themselves,” the report added.\\n\\nIt further said that a previous FIR had been lodged on Tuesday against one of the associates after a trans woman accused him and another of the three men of “posing as journalists” and issuing threats, along with blackmailing and raping her.\\n\\nThe Print reported that Additional Deputy Commissioner of Police (Crime Branch) Rajesh Dandotiya said the two used to blackmail the victim by feigning to be journalists and going to the transgender community’s gathering in Nandlalpura in June 2025.\\n\\n“The victim belongs to the Kinnar society. The victim has said that the two … claimed to be journalists, used to threaten her that they would defame her and an FIR would be registered against her, as happened in the case of her gurus. On June 12, the accused went to the dera. The accused … assaulted the victim, sexually and physically,” the report quoted him as telling reporters.\\n\\nIt added that they were booked under Section 18 of the Transgender Protection Act 2019 and for intimidation.\\n\\nThe report further said that other members of the community had reached the hospital and demanded that the suspects be arrested, with one member threatening to end her life if the group’s demands were not met. “They also attempted suicide in the hospital by pouring kerosene, which was foiled by the police,” the report added.\\n\\nDespite being legally recognised as a third gender in a historic 2014 apex court ruling, the transgender community in India often lives on the extreme fringes of Indian society, with many forced into prostitution, begging or menial jobs.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:41:04.352Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949726/24-transgender-persons-hospitalised-in-indias-indore-after-mass-suicide-bid-reports",
  "dateList": "2025-10-18",
  "date_published": null
}
