{
  "title": "Gold crosses Rs456,000 per tola - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Domestic gold prices surged to a record high on Friday, with one tola (24kt) reaching Rs456,900 and 10 grams hitting Rs391,718 — marking an unprecedented single-day increase of Rs14,100 and Rs12,089, respectively.\\n\\nThe jump was driven by a sharp $141 per ounce rise in international gold prices to $4,358, according to the All Pakistan Sarafa Gems and Jewellers Association (APSGJA). Local rates are also influenced by movements in the interbank exchange rate.\\n\\nCommenting on the surge, Mohammad Sohail, CEO of Topline Securities, said gold prices have risen over 50pc in 2025 so far. As a result, Pakistan’s gold reserves are now estimated at $9bn — up from $6bn at the start of the year. This increase has lifted total reserves (including liquid foreign exchange) to approximately $23bn, nearing an all-time high.\\n\\nHe noted that gold now constitutes nearly two-thirds of Pakistan’s liquid reserves, compared to one-third on average over the past decade, indicating a significant shift in reserve composition.\\n\\nYellow metal reserves estimated at $9bn; silver hits all-time high\\n\\nInternational media linked the rally in gold to geopolitical and economic developments, including comments by US President Donald Trump about the unsustainability of full-scale tariffs on China, and expectations of further interest rate cuts by the US Federal Reserve.\\n\\nThe ongoing conflicts in Ukraine and Gaza, along with global trade tensions, have also contributed to safe-haven demand for gold. Several countries have reportedly been increasing their gold holdings amid the price rally.\\n\\nPricing discrepancies\\n\\nDespite the official rates issued by APSGJA, jewellers in the local market continue to quote prices at their discretion. On Friday, some traders initially demanded Rs470,000 per tola before settling between Rs466,500 and Rs467,500 by evening — significantly higher than the official rate.\\n\\nEarlier this week, one tola was being sold for Rs450,000-452,000 while the Association quoted Rs440,000. At times, bullion traders quote lower-than-official rates, adding further inconsistency.\\n\\nPresident of the All Karachi Jewellers and Manufacturers Association (AKJMA), Muhammad Haseen Qureishi, urged the government to establish a regulatory body to issue daily gold prices, curb black marketing, and ensure uniformity in pricing to restore consumer confidence.\\n\\nSilver hits new peak\\n\\nSilver prices also hit new highs, with 10 grams and one tola priced at Rs4,718 and Rs5,504 — up by Rs167 and Rs141, respectively. The global silver rate rose by $1.67 to $54.17 per ounce.\\n\\nMarket sources said the silver market faces a supply shortage, with rampant black-market activity. Traders quoted varying rates ranging from Rs7,500 to Rs9,000 per tola, far exceeding the official price. Small and medium investors were reported to be active buyers in the silver market.\\n\\nPublished in Dawn, October 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/18072308e27b54f.webp",
  "retrievedAt": "2025-10-20T18:41:02.433Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949647/gold-crosses-rs456000-per-tola",
  "dateList": "2025-10-18",
  "date_published": null
}
