{
  "title": "‘Big shoes for me to fill’, says Gill as Virat, Rohit make ODI return - Sport - DAWN.COM",
  "author": null,
  "content": "All eyes in Perth are on Virat Kohli and Rohit Sharma as the two India stalwarts prepare for the opening one-day international against Australia on Sunday, marking the first national team outing for the pair since winning the ICC Champions Trophy in March.\n\nIndia’s new ODI skipper, Shubman Gill, told journalists on Saturday that he had had numerous conversations with his predecessors who had retired from the shortest and longest forms of the game about how to take the team forward.\n\n“Definitely very exciting - big shoes for me to fill carrying over the legacy (Virat and Rohit) left for us,” the 26-year-old said.\n\n“These are the kind of players that when I was a kid, I used to idolise them. The kind of game that they used to play, the kind of hunger that they had is something that inspired me. It’s a big honour to lead such legends of the game and learn from them.”\n\nGill has already captained at T20I and Test level, but the upcoming three-match series will be the first time he has led in ODIs, where he averages nearly 60 with the bat.\n\n“I think in front of a difficult situation, I wouldn’t shy away from getting any suggestions or advice from them,” he said.\n\n“How they converse and what kind of communication or messaging they had with the players is something that helped me get the best out of myself. That’s the kind of captain I would want to be, where all my players feel very secure in the job they have to do.”\n\nAustralia captain Mitch Marsh acknowledged that India’s two returning batters are partly responsible for an expected bumper crowd at the 60,000-seat Perth Stadium, which is nearing a sell-out despite a forecast of rain.\n\n“A lot of people are going to come and watch them. If it is their last time on Australian soil, I hope they enjoy it,” the 33-year-old said, before cheekily adding that he would prefer “not too much good cricket from them”.\n\nThe Perth local, who struck two hundreds and averaged 70 across white-ball formats against South Africa and New Zealand in recent months, dead-batted any suggestion that continued good form might prompt a Test recall ahead of the Ashes series this summer.\n\n“I’ve got tickets for day one and two, I haven’t asked the wife yet, but that’s about as much thought as I’ve given it.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/18185723eeae0c9.webp",
  "retrievedAt": "2025-10-20T18:20:24.854Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949737/big-shoes-for-me-to-fill-says-gill-as-virat-rohit-make-odi-return",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T13:58:26.000Z"
}
