{
  "title": "Postecoglou sacked after Forest defeat, Haaland takes Man City top - Sport - DAWN.COM",
  "author": null,
  "content": "Ange Postecoglou’s reign as Nottingham Forest manager ended after a 3-0 defeat to Chelsea on Saturday, as Erling Haaland took Manchester City top of the Premier League by scoring twice in a 2-0 win over Everton.\n\nPostecoglou was sacked after just eight games and 40 days in charge at the City Ground, making his the shortest ever managerial stint in Premier League history.\n\nForest picked up just one point from the Australian’s five league games and were also dumped out of the League Cup by second-tier Swansea.\n\nClub owner Evangelos Marinakis left his seat during the match as Chelsea took control in the second half, and Postecoglou’s fate was confirmed shortly after full-time.\n\nForest are already looking for their third manager of the season after Nuno Espirito Santo was dismissed last month.\n\nChelsea had to survive an early onslaught before two goals in three minutes early in the second period swung the game in the Blues’ favour.\n\nTeenager Josh Acheampong headed in his first senior goal from Pedro Neto’s corner.\n\nNeto curled in a free-kick to double Chelsea’s lead before Reece James added a third late on to lift the visitors up to sixth in the table.\n\nDefeat saw Forest fall into the relegation zone.\n\nHaaland’s unstoppable form is dragging City into title contention as the Norwegian took his tally for the season to 23 goals in 13 games for club and country.\n\nAfter two defeats in their opening three Premier League matches, Pep Guardiola’s men are now unbeaten in eight games in all competitions.\n\nHaaland proved the match-winner once more with two clinical finishes in five minutes either side of the hour mark at the Etihad.\n\nHe used all of his 1.95-metre (6ft 5in) frame to power in a header from Nico O’Riley’s cross to break the deadlock.\n\nHaaland then had a helping hand from Jordan Pickford for his second as the England goalkeeper failed to keep out a low shot to his left.\n\nCity edged ahead of Arsenal, who are in action later at Fulham, on goal difference.\n\nBournemouth were denied top spot by Jean-Philippe Mateta’s 97th minute penalty to complete his hat-trick and salvage a 3-3 draw for Crystal Palace.\n\nTwo goals from Eli Junior Kroupi put the Cherries 2-0 up at Selhurst Park at half-time.\n\nPalace lost for the first time in 20 matches in their last outing at Everton.\n\nThe Eagles avoided another defeat thanks to the in-form Mateta, who was fresh from scoring his first international goal for France.\n\nMateta struck twice to level before Ryan Christie turned in Marcus Tavernier’s cross in the 89th minute to restore Bournemouth’s lead.\n\nHowever, Andoni Iraola’s men were denied another huge win when Mateta stroked home from the spot after wantaway Palace captain Marc Guehi was fouled inside the box.\n\nNewcastle’s struggles on the road continued with a 2-1 defeat at Brighton as Danny Welbeck struck twice.\n\nThe Magpies have yet to win away in the Premier League this season and slipped to 11th, behind local rivals Sunderland.\n\nThe Black Cats climbed up to seventh with a 2-0 victory over Wolves, which left the visitors five points off safety at the bottom of the table.\n\nBurnley climbed out of the bottom three thanks to goals from Lesley Ugochukwu and Loum Tchaouna to beat Leeds 2-0.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/18222327e70946d.webp",
  "retrievedAt": "2025-10-20T18:20:24.343Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949750/postecoglou-sacked-after-forest-defeat-haaland-takes-man-city-top",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T17:24:58.000Z"
}
