{
  "title": "Missing Ziarat AC’s son recovered after two months - Newspaper - DAWN.COM",
  "author": null,
  "content": "QUETTA: The son of the Assistant Commissioner (AC) Ziarat, who was kidnapped two months ago along with his father, has been safely recovered, police officials said.\n\nHowever, his father, Assistant Commissioner Ziarat Muhammad Afzal Baqi, is still missing, and authorities are making all-out efforts for his safe recovery.\n\nPolice officials said that after his recovery, Mustansar Bilal, the son of assistant commissioner, reached the Zardalo area of Harnai, from where he was taken into protective custody and handed over to the Deputy Commissioner Harnai.\n\nIt may be recalled that the assistant commissioner and his son were abducted about two months ago by unidentified armed men while returning to Ziarat after a picnic along with their family. The kidnappers allowed the family members, security guard and driver to go home after setting the official vehicle on fire.\n\nOn Sept 21, reports circulated that the kidnappers had killed AC Ziarat and dumped his body in a mountainous area of Harnai district. An official of Ziarat administration also confirmed that Afzal Baqi had been killed by the kidnappers and even released a photograph purported to be his body.\n\nHowever, Chief Minister Mir Sarfraz Bugti later informed the provincial assembly that the killing of the assistant commissioner was not confirmed, assuring that the government was making all-out efforts for his safe recovery.\n\nOfficials said that Mustansar Bilal reached the Zardalo area of Harnai district and informed local authorities about his presence in the area. “Mustansar is safe and sound in the custody of Deputy Commissioner Harnai,” police officials said.\n\nAuthorities, however, said that AC Ziarat remains missing and efforts were underway for his safe recovery. They did not disclose how Mustansar Bilal managed to reach Harnai.\n\nPublished in Dawn, October 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-20T18:20:38.712Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949666",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T01:44:41.000Z"
}
