{
  "title": "New Zealand v England T20 series opener abandoned due to rain - Sport - DAWN.COM",
  "author": null,
  "content": "The opening game of New Zealand’s three-match Twenty20 series with England was abandoned due to heavy rain in Christchurch on Saturday, with the hosts denied the opportunity to chase down a modest total for victory.\n\nPlay was called off following a long delay after England’s innings, in which the tourists scored 153-6 in 20 overs on a difficult wicket, with Sam Curran (49 not out) finishing well after Jos Buttler (29) failed to build on a good start.\n\nThe second match takes place at the same venue on Monday before the finale in Auckland on Thursday, as both teams step up their preparations for next year’s men’s T20 World Cup in India and Sri Lanka, likely to be held in February-March.\n\nNew Zealand fast bowlers Matt Henry (1-26) and Jacob Duffy (1-45) made full use of early swing and bounce at Hagley Oval to restrict England to only 44-2 in the opening six powerplay overs before Harry Brook (20) looked to cut loose.\n\nJimmy Neesham (1-20) conceded a couple of huge sixes to the England skipper in the eighth over but gained revenge by getting through his defence, and the tourists’ momentum ground to a halt again when Mitch Santner (1-20) removed Tom Banton for nine.\n\nThe dangerous Buttler also fell to spin shortly afterwards, holing out in the deep while looking to attack Michael Bracewell (1-10), before rain halted play in the 17th over with England on 110-5 and seeking a late charge to boost their total.\n\nKyle Jamieson (1-27) removed Jordan Cox for 16 after the break, but Curran persevered, benefiting from a dropped catch and surviving a loud appeal for lbw to take England to a respectable total with 19 runs in the final over",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/182145173a8fcea.webp",
  "retrievedAt": "2025-10-20T18:20:24.081Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1949740/new-zealand-v-england-t20-series-opener-abandoned-due-to-rain",
  "dateList": "2025-10-18",
  "date_published": "2025-10-18T16:45:34.000Z"
}
