{
  "title": "Heatwave in Punjab set to last until 12th: PDMA - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The ongoing heatwave across Punjab is set to continue until at least June 12 (Thursday), with temperatures rema­ining well above seasonal norms, the Provincial Disaster Management Authority (PDMA) confirmed on Monday.\n\nAccording to the PDMA, current temperatures are ranging between 4 and 7 degrees Celsius higher than average, pushing conditions into potentially life-threatening territory.\n\nA similar warning for next few days was issued for Gilgit-Baltistan. The Met Office said temperature would increase by five to seven degrees. It suggested precautionary measures as it noted that the high temperature may speed up glaciers melting this week.\n\nThe city of Sargodha reco­rded the province’s hig­­h­est temperature on Mon­day at a scorching 47°C.\n\nMajor urban areas, incl­uding Lahore, Multan, and Faisalabad, simmered at around 45°C, while distri­cts such as Toba Tek Singh, Sahiwal, Okara, Mandi Bahauddin, Khane­wal, Kasur, Layyah, Jhang, and Hafizabad saw temperatures between 40°C and 42°C. Southern Punjab faces particularly severe conditions, with Bahawalpur, Rahim Yar Khan, Dera Ghazi Khan and Multan expected to bear the brunt of the intense heatwave.\n\nPDMA Director General Irfan Ali Kathia directed all relevant agencies to remain on high alert. Critical emergency measures are underway, including the provision of clean drinking water in the arid Cholistan region, activation of dedicated heatstroke counters in all hospitals, and the stocking of essential medicines for heat-related illnesses.\n\nAuthorities were warning citizens on social media about the severe risks posed by the extreme heat.\n\nPDMA also issued an advisory urging the public to take immediate precautions. It instructed people to take special care for vulnerable groups, including children, the elderly and those with preexisting health conditions, who are most susceptible to heatstroke.\n\nThe citizens have also been advised to strictly avoid unnecessary outdoor activities, especially strenuous work or exercise, during peak sunlight hours (10 am to 4 pm). Wearing light-coloured, loose cotton clothing and staying hydrated are essential. The authority stressed the importance of public vigilance, warning that the effects of the heatwave can be severe and swift.\n\nFor emergencies, particularly symptoms such as dizziness, nausea, or fainting, citizens are advised to contact the PDMA helpline immediately at 1129.\n\nMeanwhile, according to the Economic Survey 2024-25, issued on Monday, Pakistan experienced its ninth warmest year on record in 2024, with the national average temperature reaching 23.52°C, 0.71°C higher than the long-term average.\n\nThe alarming data reveal an accelerating warming trend across most regions of the country. July 2024 was particularly extreme, becoming the second-hottest July in 64 years, with temperatures going 1.26°C above normal.\n\nOctober broke all records as the hottest October ever recorded, with temperatures soaring 2.48°C above average.\n\nJamil Nagri in Gilgit also contributed to this report\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:30:48.142Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916154/heatwave-in-punjab-set-to-last-until-12th-pdma",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:34.000Z"
}
