{
  "title": "Budget FY26: ‘Relief’ for salaried group as govt goes after solar panels, e-commerce - Business - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb presented the budget for fiscal year 2025-26 on the floor of the National Assembly on Tuesday amid a routine protest by the opposition.\n\nPakistan’s budget for the upcoming year aims for GDP growth of 4.2 per cent and sets an ambitious tax collection target at Rs14,131 billion.\n\nMost awaited among the rumoured announcements was some relief for the country’s much-burdened salaried class across all income slabs, according to the finance minister.\n\n“This relief will not only simplify the tax structure but will also ensure a balance between inflation and take-home pay by reducing the tax burden on middle-income earners,” he said.\n\nThe minister also announced a 10pc increase in salaries to government employees from Grade-1 to Grade-22.\n\nProposed changes in income tax:\n\nAurangzeb said the salaried group’s relief was aimed at preventing brain drain from the country, stressing that the government was aware that the workforce was facing the highest taxes in the region and there was fear that the most talented individuals might emigrate.\n\n“This move reflects the government’s commitment to make taxes fairer and reduce the burden on salaried individuals,” he said.\n\nHowever, among the increases in income-related charges, the minister said there was a proposal to increase the tax on income from interest from 15pc to 20pc.\n\nThe minister said the government was introducing multiple measures to improve equality in the tax system and it was observed that the salaried and business classes paid heavy taxes, while people earning from non-traditional means relatively pay less taxes.\n\nHowever, he said the above proposed tax increase would not apply to national savings schemes.\n\nAmong the changes in the pension structure outlined by the finance minister are:\n\nThe finance minister also outlined various changes in taxes related to property and land since he said heavy taxes had a negative impact on the construction sector.\n\nHe said the following reductions in withholding tax on the purchase of property were proposed:\n\nAurangzeb further said there was a proposal to abolish the federal excise duty of up to 7pc, which was imposed last year on the transfer of commercial properties, plots and houses, to reduce the burden on the construction sector.\n\nA tax credit is also being introduced on houses up to 10 marlas and flats of 2,000 square feet to encourage mortgages for the provision of loans on low-cost housing.\n\nThere was also a proposal to reduce the stamp paper duty on the purchase of property in Islamabad from 4pc to 1pc.\n\nThe budget proposed several measures relating to sales tax changes affecting multiple items from solar panels to e-commerce:\n\nAurangzeb said there was a proposal to rationalise the tax rate on profits earned on mutual funds.\n\nTax rate on profit on debt has been proposed to be increased from 15pc to 20pc. The tax rate has been enhanced to 25pc & 15pc on dividend from mutual funds.\n\nSome other major proposed measures in the minister’s budget speech are:",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:51:01.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916323/budget-fy26-relief-for-salaried-group-as-govt-goes-after-solar-panels-e-commerce",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T18:47:49.000Z"
}
