{
  "title": "Budget cuts & developing backwards - Business - DAWN.COM",
  "author": null,
  "content": "With the upcoming fiscal year’s budget drawing closer, most conversations in the business and policy circles are focused on the usual items, with defence spending and the International Monetary Fund conditionalities taking the limelight. What remains missing from the discourse, as usual, is the potential neglect for the development spending, which media reports suggest may be cut once again.\n\nIn FY25, the government had proudly proposed an outlay of Rs1.4 trillion under the federal Public Sector Development Programme (PSDP). However, the optimism was short-lived, as within two weeks, the allocation was slashed by Rs250 billion. Though disappointing, the move was predictable, as the PSDP has been revised downward every year throughout the past decade, with an average cut of 17.3 per cent. In contrast, overall expenditure has mostly been adjusted upwards.\n\nTime and again, development has emerged as the frontline item to be trimmed when fiscal pressures mount. It’s come to a point where the revised FY24 allocation of Rs659bn was lower than where it stood in FY16. As a percentage of the federal budget, the PSDP has slipped below 5pc — a concerning situation for any emerging economy.\n\nThese are nominal figures, so one can imagine what the real value loss would be. In dollar terms, PSDP for FY24 had plummeted to $2.3bn, less than half its value a decade ago. It’s true that after the 18th Amendment, the responsibility no longer lies with the centre, and provinces have to play an ever-greater role in financing public sector development, especially in devolved subjects like education and health.\n\nWith significant cuts in the PSDP, major chunks never translate into actual spending as key ministries utilise far less than what is available\n\nOn the first look, that does seem to be the case, as today, provinces now account for around 72pc of the national PSDP. In many cases, their allocations have grown or held steady, often prioritising health, education, and agriculture. But the vacuum left by the centre, especially in large-scale infrastructure and strategic initiatives, is hard to fill.\n\nAs part of the Karachi School of Business and Leadership’s latest policy note, we looked at the key trends in the federal PSDP to understand not only the government’s expected priority areas but also the efficiency in utilising the funds.\n\nHistorically, around half of all the federal PSDP funds, on average, have been earmarked for infrastructure projects, followed by the social sector, which has raked in almost a fifth of the proposed outlay. This is obviously understandable given that its two largest components, health and education, are provincial mandates under the 18th Amendment and are predominantly provisioned for in their respective budgets.\n\nBut the persistent cuts have now caught up with the most critical infrastructure needs of the country. At the sub-category level, transport has consistently been the most funded area, receiving roughly just under Rs1tr in original outlays over the last five years. However, its dominance is waning, as reflected by its share falling by 13 percentage points to 23pc by FY24. Once you start accounting for downward revisions, for which the data is unfortunately not particularly standardised, the picture looks even worse.\n\nThe funding mix also reveals a shift as the share of foreign currency in PSDP has fallen from 9pc in FY20 to 6pc by FY24, highlighting the government’s struggles in arranging external financing for development. Nonetheless, some ministries, such as Maritime Affairs and Aviation, have shown more resilience in this regard and managed to garner more sustainable support from international partners, in part due to China-Pakistan Economic Corridor-linked infrastructure projects. But for the most part, the centre has mostly pivoted toward rupee-based resources; whether by design or necessity is up for debate. However, allocations are only part of the story. The more worrying aspect is that a significant chunk of the PSDP may not translate into actual spending.\n\nEven in FY24, only 80pc of the proposed funds were authorised, and some key ministries spent far less than what was available. While agencies like the National Transmission & Despatch Company and Railways exceeded 90pc utilisation, the Planning Division, ironically responsible for overseeing all development, spent just 17pc of its allocation. Similarly, among the 21 low-priority ministries, defined as those with proposed outlays of less than Rs5bn, there was persistently weak absorption with only six departments managing above-average utilisation rates, reflecting a deeper problem of execution bottlenecks and limited capacity.\n\nThese cuts, and the inefficiency in utilisation, are not without consequence. Public infrastructure investment, if executed well, has multiplier effects on productivity and economic output. But when projects are delayed, underfunded, or abandoned, the results are the opposite: inflated costs, decaying infrastructure, and waning investor confidence. It’s no surprise that Pakistan’s gross fixed capital formation has fallen to around 11.2pc of GDP, among the lowest in emerging markets.\n\nCompounding the issue is Pakistan’s growing throw-forward of an estimated Rs10tr based on the current pipeline, as per the Planning Commission. Research by the Pakistan Institute of Development Economics suggests that around a third of all projects are delayed, some by over a decade, and cost overruns are commonplace.\n\nClearly, the system needs a reset. While increasing allocations is required, it might not suffice. Arguably, there’s a need for Pakistan to not only clean its portfolio but also overhaul planning and execution frameworks. Public-private partnerships, long touted as a panacea, must be institutionalised and expanded with proper oversight and transparency. Success stories like the Lahore-Sialkot Motorway and Hattar Economic Zone offer templates, but scale and governance remain major hurdles.\n\nThe upcoming Uraan Pakistan initiative, the 13th five-year plan, proposes a much-needed pivot toward transparency, data-driven planning, and inclusive governance. But the clock is ticking. Without bold reforms, this vision might end up with the same fate of many before it: celebrated on paper, ignored in practice.\n\nAhmad Junaid is Dean of KSBL, and Mutaher Khan is co-founder of Data Darbar and works for the Karachi School of Business and Leadership.\n\nPublished in Dawn, The Business and Finance Weekly, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6847631241914.jpg",
  "retrievedAt": "2025-10-12T03:30:00.142Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916165/budget-cuts-developing-backwards",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:59.000Z"
}
