{
  "title": "Warnings of an existential climate threat - Pakistan - DAWN.COM",
  "author": null,
  "content": "• 224 extreme disaster events experienced between 1980 and 2024\n• Floods affected over 100m people, caused damage worth $36.4bn\n• 2024 sets new records for temperature, rainfall anomalies\n\nISLAMABAD: The Economic Survey has warned that the escalating climate crisis poses an existential threat to Pakistan, noting that extreme weather patterns, rising temperatures and erratic rainfall are increasing in frequency and intensity as the world crosses the crucial 1.5°C threshold.\n\n“Climate change is no longer a myth but an urgent reality. The high vulnerability of Pakistan calls for reducing global emissions and creating improved adaptive response strategies locally,” emphasised the survey released on Monday.\n\nNatural disasters have posed serious threats to Pakistan’s human capital, prompting the government to make significant future capital investments in infrastructure, it said, adding that the country experienced 224 extreme natural disaster events between 1980 and 2024.\n\nAmong these disasters, floods have emerged as the most catastrophic in terms of economic damage and population impact. With 109 occurrences — including flash, riverine and general floods — these events have affected over 100 million individuals and inflicted total damages of $36.4 billion, excluding broader economic losses. This disproportionately high impact underscores the issue of climate injustice.\n\nIn addition, extreme temperatures, particularly heatwaves, are becoming increasingly deadly, accounting for 2,741 fatalities across 13 events. Tropical cyclones, though limited to five events, caused more than $1.7bn in damages. Droughts, despite only two reported instances, have severely affected over 6.9 million individuals and resulted in damages totaling $247m, underlining the severe consequences for the country’s agrarian economy.\n\nAccording to the survey, the year 2024 witnessed severe climate phenomena in Pakistan, marked by extreme heat, unpredictable rainfall, and regional disparities, further reflecting the increasing impacts of climate change. These climatic anomalies involved both intensified rainfall and elevated temperatures.\n\nThe economic and social costs are already substantial, as shown by the devastating 2010 and 2022 floods, which caused billions of dollars in damages, massive displacement and necessitated high capital investment. As these challenges intensify, Pakistan’s climate profile is increasingly reflecting global trends of heightened variability and environmental distress, making the country’s resilience dependent on urgent and coordinated action at multiple levels.\n\nBoth globally and in Pakistan, 2024 was marked by a mix of climate-driven challenges that reflect intensifying variability and extreme weather. These developments underline the growing need for enhanced adaptation efforts, resilient infrastructure and proactive measures to counter the mounting impacts of a shifting climate.\n\nThe survey stated that despite contributing minimally to global greenhouse gas emissions, Pakistan remains among the most vulnerable nations to climate-related disasters. The country continues to experience an alarming rise in such events — from extreme heatwaves and monsoon floods to glacial lake outburst floods (GLOFs) and air pollution — while 2024 set new records for temperature and rainfall anomalies.\n\nLooking ahead, this vulnerability can be transformed into resilience through sustained investment in renewable energy, climate-smart infrastructure, and ecosystem restoration. By aligning global support with national-level efforts, Pakistan can not only mitigate the climate crisis but also work towards a safer and more sustainable future.\n\nAccording to the survey, both globally and within Pakistan, the intensification of climate variability and extreme weather events during 2024 highlights the urgent need for robust adaptation strategies and climate resilience initiatives.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6847835136acd.gif",
  "retrievedAt": "2025-08-20T03:51:34.840Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916212/warnings-of-an-existential-climate-threat",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:49.000Z"
}
