{
  "title": "Punjab CM’s ‘red line seems to have blurred’ with low conviction in abuse cases - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz’s initiative of protecting the women and children from violence, abuse and harassment suffered a major setback as only 924 suspects nominated in total 60,217 cases registered in all the districts during 2024 got punishments from courts while 2,388 were ‘acquitted’, with Lahore police’s performance at its worst.\n\nThe official figures revealed that the suspects acquitted in the cases were more than double in number as compared to those convicted by the courts.\n\nA majority of the suspects escaped punishments due to the ‘gross negligence’ on the part of the Punjab police as faulty investigations, lack of evidence and weak challans were largely attributed to the pathetically low conviction rate in crimes against women and children in Punjab.\n\nResultantly, sufferings of the rape victims increased manifold when a majority of the suspects nominated by them escaped punishments from the courts of law.\n\nPolice performance falters as 2,388 suspects acquitted, 924 penalised in 60,217 cases related to crimes against women and children in 2024\n\nSome experts believed that the punishment to a meagre number of accused persons showed that the performance of the Punjab police’s senior command was restricted largely to the registration of the victims’ complaints only.\n\nThey said the police officers have been applying decades-old tactics of satisfying the CM by ‘presenting a maximum number of registered crime figures’ and shifting blame for low conviction rate to courts.\n\nChief Minister Maryam Nawaz in many high-level meetings had declared the violence against women her ‘red line’ and conveyed categorically to Punjab police chief Dr Usman Anwar that she wanted to break the myth that they were weak part of the society and will not tolerate any negligence in this respect.\n\nAccording to an official report, the Punjab police’s Special Sexual Offences Investigation Unit (SSOIU) had investigated a total of 60,217 cases of violence, abuse and harassment against women and children registered in Punjab in 2024.\n\nMost crimes were related to the sexual assault on women and children and their kidnap for ulterior motives. Many incidents of child pornography, cruelty and sexual abuse have also been reported in parts of the province. As per the report, the SSOIU had divided the heinous crimes in Schedule-I and Schedule-II.\n\nThe specialised unit was dealing with 13 various offences of Pakistan Penal Code (PPC) listed in Schedule-I besides others lodged under anti-terrorism act 1997.\n\nPrimarily, they included section 292A that deals child’s seduction, 292B regarding the creation, possession, or distribution of child pornography, section 354 deals a person who assaults or uses criminal force against a woman intending to outrage her modesty, section 365 deals abduction or kidnapping someone with the intention of keeping them confined without proper cause or legal justification etc.\n\nSimilarly, schedule-II has listed 19 kinds of offences against women and children in addition to those registered under anti-terrorism act.\n\nThe report reveals that out of total 22,663 cases listed in Schedule-I, not a single accused could get punishment from the courts in the crimes registered in 30 districts, including Lahore.\n\nMost suspects nominated by the victims in FIRs of these districts escaped punishments as the official data shows only 555 suspects were convicted by the courts in 8,083 cases lodged in eight other districts of Punjab.\n\nThe Multan police were at the top among others where 409 suspects out of the total 2,150 were convicted from the courts, according to the report.\n\nAs per the Schedule-II offences, no suspect nominated in 22,521 registered crimes against women and children in 33 districts of Punjab was convicted by the courts.\n\nHowever, only 351 suspects nominated in 5,443 cases lodged in the rest of six districts listed in schedule-II could get punishments.\n\nAs per the report, the Lahore police’s performance remained most pathetic despite having large-scale resources, manpower and the chain of command of highly experienced officers.\n\nThe report reveals the provincial capital police registered 10,141 cases of violent crime against women and children in 2024.\n\nOf them, 65 suspects were acquitted while no one was awarded punishment so far.\n\nSimilarly, the report mentioned many other districts which failed in awarding punishments.\n\nThey included Rawalpindi, Nankana Sahib, Narowal, Wazirabad, Gujrat, Hafizabad, Mandi Bahauddin, Attock, Jehlum, Chakwal, Murree, Sargodha, Khushab, Bhakkar, Jhang, Chinot, Lodhran, Sahiwal, Pakpattan, Okara, DG Khan, Muzaffargarh, Layyah, Bahawalpur, Bahawalnagar, and Rahim Yar Khan.\n\nA majority of the cases were shown as ‘still under trial’ in the report.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:51:01.729Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916260/punjab-cms-red-line-seems-to-have-blurred-with-low-conviction-in-abuse-cases",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T03:40:44.000Z"
}
