{
  "title": "Another KWSC pipeline bursts at Karachi University amid water crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: While the city continued to face a severe water crisis on Eid holidays, the dilapidated and outdated water distribution and supply infrastructure of the Karachi Water and Sewerage Corporation (KWSC) once again played havoc with the University of Karachi (KU) after a 36-inch supply line burst, submerging the access to the cemetery on the campus on Eidul Azha.\n\nThe leakage, being repaired, inundated a large portion of the road leading to the university’s graveyard. People were forced to wade through the ankle-deep water to reach the graves of their near and dear ones for paying homage, a common practice during religious festivals.\n\nResidents of the KU staff colony said that they had timely reported the leakage to the water utility, but it did not take immediate steps to plug the leakage.\n\nHad the water utility acted promptly, a large amount of water would not have been wasted, besides saving people from the ordeal they went through on the Eid days, the residents lamented.\n\nEarlier in April, a burst water main near KU, an 84-inch diameter pipeline, had led to a water crisis and flooding in on the campus, impacting residential and academic buildings, and causing significant losses for the university. The repair work had caused a severe water shortage and disruptions in the city’s water supply for over 10 days.\n\nChief Engineer Water Trunk Man (WTM) of the KWSC Syed Muhammad Ijaz said that a leakage had been reported in the joint of the 36-inch diameter line. “The repair work has been started, which will be completed soon,” he added.\n\nThe KWSC chief engineer said that the damaged line supplied water only to Scheme 33 and the repair work would not affect the regular supply to any other area in the city.\n\nHe said that water had been supplied to Scheme 33 as usual on Sunday night and now the next supply would be made on Thursday as per the schedule.\n\n“During this time, the citizens will not face any kind of trouble or shortage,” he said.\n\nThe chief engineer further said that the repair work on the damaged line was in progress on an emergency basis and the technical team of the water utility was present on the spot.\n\n“The repair process is being carried out rapidly so that the line can be fully functional soon,” he added.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:51:13.465Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916176/another-kwsc-pipeline-bursts-at-karachi-university-amid-water-crisis",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:13:23.000Z"
}
