{
  "title": "PTI slams economic policy as ‘elite preservation’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Tehreek-i-Insaf has strongly objected to the country’s economic policy and called it “elite preservation” and asserts it will not be silenced as it owes the people of Punjab the truth.\n\nPTI Punjab media cell head Shayan Bashir said here on Monday that farmers had suffered Rs2.2 trillion in ‘crop losses’, while the parliament gave itself 138 per cent salary hikes. “This is not governance, it is self-reward during collapse and we will expose it.”\n\nHe stated that Pakistan had missed its own growth target of 3.5pc while achieving 2.7pc growth and added that as per Economic Survey of Pakistan 2024–25 the agricultural growth fell from 6.25pc to just 0.56pc.\n\nMr Bashir said the farmers have lost over Rs2.2tr in wheat since May 2024 as cotton output downed by 34pc, Maize 15pc and wheat nearly nine per cent.\n\nDespite collapse, he stated the imported cotton enjoyed zero per cent GST, while the local farmers paid 18pc GST on cotton seed, 14pc on tractors. “This is anti-farmer policy by design,” he asserted.\n\nThe PTI Punjab media cell head said the government debt had reached Rs74.9tr, while domestic borrowing increased to 18pc. He stated that the rupee had lost 122pc cent in value since April 2022, which had been acknowledged by the finance ministry.\n\nIn the midst of this collapse, he said, parliament passed salary increases for MPs from Rs218,000 to Rs519,000 per month and Senate chairman, NA speaker’s salaries to Rs1.3m per month.\n\nIn a separate statement and tweet, Mr Bashir said Patron-in-Chief of Pakistan Tehreek-i-Insaf Imran Khan has been unjustly imprisoned for 673 days, marking his fourth Eid in confinement. Once again, he alleged, Khan was denied the right to offer Eid prayers, meet his family, or speak with his children.\n\nIn the Islamic Republic of Pakistan, where public funds were spent on lavish Haj trips with state protocol, he asked how could authorities justify preventing a former prime minister from performing Eid prayers? “In a tightly monitored cell, where every meeting and conversation is scrutinised, what security risk could offering prayers possibly pose?” he asked.\n\nHe observed that Imran Khan was being deprived of rights afforded to other prisoners. In sweltering heat, he said, Khan was confined to a small cell with frequent electricity cuts and severe restrictions on movement. He said Khan was facing fabricated and baseless charges, with deliberate delays in court hearings to prolong his detention. He said the PTI condemned this unfair treatment and violation of basic human rights. “We will raise this issue with the international community and launch a street movement to demand justice,” he said.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:51:02.390Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916253/pti-slams-economic-policy-as-elite-preservation",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T03:31:14.000Z"
}
