{
  "title": "Behind the numbers... - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN has achieved economic stability, with the fundamentals showing significant improvement in the last year and a half. However, is the recovery that Finance Minister Muhammad Aurangzeb claimed yesterday, while releasing the Economic Survey for the outgoing year, sustainable?\n\nCan this stability be converted to faster growth? Is there even a plan to do so? With the economy stuck in low-growth mode, thanks to successive governments’ failure to lay the foundation for a structural shift, the moment should have, instead, been one of introspection.\n\nRather than praising the rulers’ ‘achievements’, Mr Aurangzeb could have reflected on where and why they dithered on reform promises. The public should have been told why the government chose not to tax powerful lobbies — retailers, real estate speculators, big farmers, high earners operating in the grey economy, etc.\n\nIt should have been informed how the government plans to target the untaxed and undertaxed segments to deepen the fragile recovery that our politicians never stop talking about.\n\nBehind the stability statistics are some hidden realities. According to the Survey, the economy is estimated to grow by a nominal 2.68pc this year from 2.5pc a year ago, with its size increasing to $411bn from $372bn. This growth rate falls short of the original target of 3.6pc and is even lower than the average growth of 3.4pc of the last five years and the long-term average of 4.7pc.\n\nThe two major drivers of growth — agriculture and big industry — continue to be in trouble. Agricultural growth is at a nine-year low while large-scale manufacturing is contracting. The minister rightly warned against a ‘sugar rush’ for faster growth, saying the last thing the country needs is more boom-and-bust cycles. However, the question is: how long can we keep suppressing growth to protect stability? Why do we need stability if not for faster and sustainable growth?\n\nThe fiscal deficit is down, and expected to remain much lower than last year’s 6.8pc. This has been achieved not by increasing revenues through broadening the tax base but by slashing development funds at the expense of future growth.\n\nThe 9pc increase in per capita income to $1,824 essentially means that income disparity in society is on the rise, with nearly 45pc of the population surviving below the poverty line.\n\nThe investment-to-GDP ratio has risen slightly to 13.8pc from 13.1pc but remains much lower than that of our peers such as Vietnam and Bangladesh with a ratio of 31pc and Sri Lanka with 23pc. Foreign investment is minuscule due to policy inconsistencies and political instability, recurring economic crises and other ills. If anything, the government will be walking another tight fiscal rope next year, hoping to achieve a moderate growth rate of 4.2pc — most probably in vain.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:51:01.304Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916238/behind-the-numbers",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T03:10:56.000Z"
}
