{
  "title": "Heavy imports causing trade imbalances - Business - DAWN.COM",
  "author": null,
  "content": "• Govt struggles to exploit export potential\n• Markup payment goes up by 17pc to Rs6.4tr\n\nKARACHI: The demand pickup in developed markets created export opportunities for Pakistan. However, continued heavy reliance on imports, particularly from China, resulted in persistent trade imbalances, according to the Economic Survey 2024-25, issued on Monday.\n\n“With global trade of goods and services growth projected to slow to 1.7 per cent in 2025, the government is taking all measures to strengthen economic buffers, expand exports, and enhance trade ties to navigate rising geopolitical and financial uncertainties,” said the survey.\n\n“Pakistan has recently resolved the issues in the import of soyabean and beef products from the US, which will further enhance its trade with one of the largest markets in the world,” it added.\n\nThe cotton trade forms the backbone of US-Pakistan textile cooperation. Pakistan is one of the largest importers of US cotton, a vital input for its top export sector, textiles and apparel. In FY24, it imported over $700 million worth of raw cotton, the largest item in imports from the US. This number is expected to increase further in the ongoing year.\n\nThe trade balance in goods registered negative growth, driven by an 11.8pc increase in imports, which outpaced the 6.8pc growth in exports. Similarly, the service exports grew by 9.3pc, slightly outpacing the 7.9pc growth in service imports.\n\nCurrent account and remittances\n\nAccording to the survey, despite higher remittances during July-April FY25, the financial accounts during this period witnessed an outflow of $1.6bn against a net inflow of $4.2bn in the same period last year mainly due to higher debt repayments.\n\nThe outflow was mainly due to increased government debt repayments as well as lower-than-projected disbursement of official loans, it added.\n\nRemittance inflows have been increasing since FY23, reaching a historic high of $4.1bn in March, further strengthening the external account. During July-April FY25, remittances surged 31pc.\n\nThe current account recorded a surplus of $1.9bn during July-April FY25, marking a reversal from a $1.3bn deficit in the same period last year.\n\n“This is a historic achievement in Pakistan’s external sector, seen only once in FY03 when the surplus reached $4.1bn,” said the survey.\n\n“Within current expenditures, during 9MFY25 markup payments increased by 17 per cent YoY to Rs6.4 trillion due to increase in debt borrowings,” it added.\n\nDue to a decline in the policy rate, the government has managed to save debt servicing costs of around Rs800bn to Rs1tr.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6847849af147f.gif",
  "retrievedAt": "2025-10-12T03:29:57.019Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916216/heavy-imports-causing-trade-imbalances",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:59.000Z"
}
