{
  "title": "Economic Survey 2024-25: Growth stumbles as key targets missed - Business - DAWN.COM",
  "author": null,
  "content": "• Major crops down 13.5pc amid water crisis, restricting agriculture and overall GDP growth\n• Industry, services underperform; large-scale manufacturing struggles for third straight year\n• Inflation drops to 4.6pc, a 60-year low, amid declining interest rates\n• Finance czar calls it ‘a gradual recovery’, promises ‘turnaround’ next year\n• GDP growth reaches 2.68pc, missing 3.56pc target\n\nISLAMABAD: “Next year will be a turnaround story,” Finance Minister Muhammad Aurangzeb promised on Monday as he unveiled the Pakistan Economic Survey 2024-25 (PES) document, which highlighted widespread slippages across major sectors of the economy in the outgoing fiscal year.\n\nReviewing the economy report card, the finance minister suggested that Pakistan’s performance should be evaluated in a global context rather than a historical one.\n\nHe stated that while global economic growth has been on a declining trend, expanding 3.5pc in 2023, 3.3pc in 2024, and 2.8pc in 2025, Pakistan had progressed from a contraction of 0.2pc in 2023 to 2.5pc growth in 2024, with a further rise to almost 2.7pc this year.\n\n“This is gradual recovery, and the right way to ensure sustainable growth,” he insisted, adding that no one wanted a return to the boom-and-bust cycles of the past.\n\nThe current year’s GDP growth will clock in at 2.68pc; well short of the 3.56pc target, although slightly improved from last year’s 2.5pc. It is below the five-year average of around 3.3pc, and well below Pakistan’s long-term average of over 4.5pc.\n\nMr Aurangzeb noted that global inflation stood at 2.6pc in 2023, rose to 2.7pc in 2024, and is projected to reach 3.1pc in 2025. In contrast, inflation in Pakistan had fallen from 29pc in 2023 to 23pc in 2024, and now to a six-decade low of 4.6pc.\n\n“So, this too has moved in the right direction,” Mr Aurangzeb remarked, noting that the benchmark interest rate had been reduced by a cumulative 1,100 basis points during the current year to 11pc, down from a peak of 22pc. Resultantly, the public debt-to-GDP ratio declined from 68pc last year to 65pc, aided by the government’s buyback of approximately Rs1 trillion in debt, which created additional fiscal space, the minister said.\n\nMissed targets\n\nThe Economic Survey data reveals that almost all major components of the economy missed targets. The finance minister singled out a 13.5pc contraction in major crops, which was estimated to have restricted the overall GDP growth rate by 0.6pc. The overall agriculture sector, which accounts for nearly 24pc of GDP, posted modest growth of 0.6pc this year, falling well short of the 2pc target and significantly below last year’s announced growth of 6.4pc. Major crops such as wheat, cotton, and maize contracted by 13.5pc, a sharper decline than an estimated 4.5pc.\n\nThis was primarily due to initial estimates of a 35pc water shortage, which were later revised down to 11-12pc. As a result, cotton ginning saw a 19pc decline, compared to last year’s growth of 0.1pc, and well below a targeted contraction limit of 2.3pc.\n\nMeanwhile, the industrial sector was announced to have shown 4.8pc growth, surpassing the 4.4pc target. This triggered some pointed questions, however. A journalist commented that it seemed likely the industry’s performance would later be revised downward, given that an almost 1pc contraction had been reported for the first nine months of the current year.\n\nWithin industries, mining and quarrying contracted by 3.4pc against a growth target of 5pc, shrinking for the third consecutive year. Likewise, Large-Scale Manufacturing (LSM), which contributes nearly 8pc to GDP, contracted by 1.5pc, falling far short of the growth target of 3.5pc.\n\nThis also marked the third consecutive year of struggles for LSM, which saw a 10pc contraction in fiscal ’23, followed by less than 1pc growth in fiscal ’24 (that too, owing to a low base effect), and followed by an additional 1.5pc contraction this year.\n\nThe services sector, which makes up nearly 59pc of GDP, was said to have posted growth of 2.9pc, well short of the 4.1pc target. Within the services sector, wholesale and retail trade, transport and storage, financial and insurance services, and private services all missed targets, whereas government services, education and similar sectors that outperformed expectations.\n\nSeparately, the investment-to-GDP ratio improved to 13.8pc in fiscal ’25, up from 13.1pc in fiscal ’24, although falling short of the 14.2pc target. Private investment grew by 9.1pc, slightly below the 9.7pc target. National savings also saw an improvement, rising to 14.1pc of GDP, surpassing the 13.3pc target.\n\nIndian meddling\n\nMr Aurangzeb said structural reforms aimed at transforming the foundations of Pakistan’s economy would have remained elusive without the ongoing 37-month Extended Fund Facility (EFF) programme. The programme, he noted, had supported taxation reforms that raised the tax-to-GDP ratio to a five-year high and contributed to a reduction in power sector losses.\n\nThe minister described the recent release of a $1bn tranche by the IMF as a major success, achieved “against all odds.” For the first time publicly, it was revealed that India had actively opposed the move.\n\n“Just as our armed forces fought for a victory, a similar battle was being fought on the economic front,” he said, claiming that the Indian executive director at the IMF had made every effort to keep Pakistan’s case off the board’s agenda, or, if it was included, to block both the second instalment of the EFF as well as a new $1.4bn Resilience and Sustainability Facility, which is crucial for Pakistan’s climate adaptation financing needs.\n\nBut Pakistan’s bilateral allies and multilateral partners stood by the country and offered their support, Mr Aurangzeb said, while also acknowledging that this outcome would not have been possible without the strength of Pakistan’s economic performance.\n\nReform-centric budget\n\nMr Aurangzeb also stated that reforms in public finance, including pension reforms, rightsizing of government, and privatisation of public sector entities, would be pushed through, and this would be evident in the budget to be presented on Tuesday (today).\n\nThe minister avoided multiple questions regarding the quality of data, and the use of May-June projections to calculate growth numbers instead of relying on actual data. However, he affirmed his support for the published data, stating that, as finance minister, he stood behind it.\n\nHe also expressed his support for the inclusion of members from the private sector on the board of the Pakistan Bureau of Statistics, which is responsible for the Economic Survey report.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/68475ed53c282.jpg",
  "retrievedAt": "2025-10-12T03:31:04.615Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916157/economic-survey-2024-25-growth-stumbles-as-key-targets-missed",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:34.000Z"
}
