{
  "title": "Kech blast leaves tribal elder, son dead - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA/GWADAR: At least 21 people, including a tribal elder and his son, lost their lives in separate incidents of shootings, explosion, drownings and traffic accidents across Balochistan during the Eid holidays, officials said on Monday.\n\nThe incidents also left at least 13 others injured.\n\nThe tribal elder, Muhammad Amin, a close relative of senior minister Mir Zahoor Ahmed Buledi, was on his way to offer Eid prayers along with his sons and relatives when he was targeted in an IED attack in the Zamran area of Kech district\n\n“The IED was planted at the roadside and targeted the vehicle of tribal elder through remote control when it reached near the site,” a Levies official said, adding that Mr Amin and his son, Naveed Amin, died on the spot. His younger son, Hafiz Irshad, was injured along with another man, he added.\n\nNo group immediately claimed respo­nsibility for the attack.\n\nLater, PPP chairman Bilawal Bhutto-Zardari offered his condolences to his family. “In this time of grief, he and the entire PPP stand with Zahoor Buledi and the bereaved family,” he said in a statement, praying for the recovery of the injured.\n\nSimilarly, former excise and taxation officer Hafiz Elahi Bakhsh was killed in a gun attack while he was on way to offer Eid prayers.\n\nIn Nasirabad district, the brother of a senior government officer, Ziaur Rehman Hashmi, was killed in an attack. In Noshki, a seminary student, Riaz Ahmed, was shot dead, while in the Buleda area, a man identified as Abdullah was killed after being kidnapped. In yet another shooting, an unidentified man sustained wounds in Dera Bugti area, officials said.\n\nAccidents\n\nIn Sherani district, a fast-moving car plunged into a ravine, killing four people, including a one-year-old child. They were identified as Abdul Rahim Sher­ani, his brother Anas Khan, and Saddam Khan Sherani.\n\nAnother crash near Lyari on the Makran Coastal Highway in Uthal killed one person and injured three others.\n\nIn the Dalbandin area, a vehicle overturned, claiming the life of Qudratullah and injuring two others. Near Dera Allahyar, a motorcycle collided with a car, killing Azhar Ali and Farman Ali. In Pasni’s Judi area, a vehicle overturned, injuring nine people. They were later identified as Mahim, Saifullah, Sharabel, Abdul Hameed, Nowroz, Shafiq, Nizam, Tanveer, and Hamal.\n\nDrowning\n\nAt least six people drowned in separate incidents during holiday picnics. Two young girls drowned while bathing in the Nari Gaj River near Sibi, and an 11-year-old boy drowned in Sohbatpur district. Three men also drowned in separate incidents in Kohlu and Basima\n\nIn another incident, a man identified as Ghulam Mustafa fell to his death from a mountain while picnicking with friends in the Wadh area of Khuzdar district.\n\nAli Jan Mangi from Nasirabad and Abdul Wahid Shahwani from Khuzdar also contributed to this report\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-20T03:51:32.716Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916205/kech-blast-leaves-tribal-elder-son-dead",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:49.000Z"
}
