{
  "title": "Ex-CJP seeks review of verdict on military trials of civilians - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Former chief justice of Pakistan (CJP) Jawwad S. Khawaja has requested the Supreme Court to revisit the May 7, 2025 judgement on military trials of civilians otherwise the same will serve as a constant reminder of ceding judicial space to executive by accepting that it can act as judges to try civilians in criminal cases.\n\n“This ceding of judicial space will haunt the Supreme Court and our nation,” says a petition moved to seek review of the May 7 judgment by the seven-judge constitutional bench of the Supreme Court.\n\nOn May 7, a five-judge constitutional bench had restored key provisions of the Pakistan Army Act (PAA) that allow for the trial of civilians in military courts. The court ruled by a 5-2 majority in favour of overturning its earlier decision on Oct 23, 2023, in which the five-judge Supreme Court bench had held the military trial of civilians involved in the May 9, 2023 acts of arson and attacks on the military installations as illegal and unconstitutional.\n\nExcept for Justice Jamal Khan Mandokhail and Justice Naeem Akhtar Afghan, who had dissented with the majority judgement, the detailed reasoning of the majority judgement has yet to come.\n\nSays judgement cedes vital judicial space to executive and undermines judicial authority\n\nSenior counsel Khawaja Ahmed Hosain has instituted the review petition on behalf of former CJP with a request to set aside the May 7, 2025 judgement since implementation of the same would mean the entire civilian judicial system would be handed over to the executive.\n\nThe apex court “conceded” there is no constitutional requirement for its independent existence, the review petition regretted, adding the ruling failed to appreciate the implications of its findings.\n\nIt reminded that it was the solemn duty of the Supreme Court and each of its members to preserve, protect and defend the Constitution. The preamble to our Constitution, its majestic crown, requires that fundamental rights “shall be guaranteed”. These fundamental rights are the heart and soul of a living Constitution. By allowing court martial of civilians, the May 7 judgement strikes at and undermines the heart and soul of our Constitution, the review petition pleaded.\n\nThe petition argued that citizens cannot be deprived of fundamental rights, adding decisions taken in the name of necessity have wrecked our jurisprudence and our history.\n\nThe petition contended that the constitutional bench while deciding the intra-court appeals had relied on the District Bar Association (DBA) case to uphold the vires of Section 2(1)(d) of the PAA and to hold that court martials were consistent with principles of fair trial and due process.\n\nThere is no consideration in DBA case of the provisions of the PAA under challenge in this case, the review petition reminded adding the DBA case, besides 21st Amendment was inserted in the First Schedule of the Constitution as contemplated in Article 8(3)(b), and was hence insulated from challenge on the basis of fundamental rights.\n\nMoreover, the 21st Amendment had a sunset clause which has since lapsed, the petition reminded adding the insertion of the said amendment in the First Schedule made it immune from challenge on the basis of fundamental rights.\n\nThe May 7 judgment thus had failed to engage with a basic point: if court martials are consistent with Article 10A, what was the need to include the 21st Amendment in the First Schedule.\n\nThe very purpose of including the 21st Amendment in the First Schedule was to insulate it from a challenge on the ground of fundamental rights, it said, adding the DBA case concerned a limited and time restricted allowance by way of a constitutional amendment.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:31:05.261Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916118/ex-cjp-seeks-review-of-verdict-on-military-trials-of-civilians",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:43.000Z"
}
