{
  "title": "Big industry production contracts amid challenges - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Despite claims of achieving macroeconomic stability, the Large-Scale Manufacturing (LSM), which accounts for 67.5 per cent of the overall manufacturing sector, contracted by 1.5pc during July-March FY25.\n\nThe Economic Survey, unveiled by Finance Minister Muhammad Aurangzeb on Monday, attributed this decline to persistent structural bottlenecks, elevated input costs, and contractions leading to negative growth in food, chemicals, iron and steel, and electrical equipment, which continue to hinder a broad-based recovery in LSM.\n\nHowever, the manufacturing sector recorded moderate growth of 1.3pc in July-April compared to 3pc in the preceding year.\n\nThe survey highlighted that the manufacturing and mining sectors were critical for Pakistan’s industrial base, jointly contributing 13.2pc to GDP.\n\n12 industrial groups of manufacturing sector recorded growth\n\nWhile within manufacturing, the LSM plays a dominant role, followed by Small-Scale Manufacturing (SSM) and slaughtering, which contribute 2.4pc and 1.4pc to GDP, respectively.\n\nThe survey highlighted that localised disruptions, such as law and order concerns in parts of Khyber Pakhtunkhwa, led to temporary closures of some production units, though their overall impact remained marginal.\n\nIn parallel, certain plants permanently ceased operations due to sustained uncompetitiveness or a market shift towards imported alternatives, further weighing on industrial output.\n\nOut of 22 industrial groups, 12 recorded positive growth during the July-March FY25 period, indicating a modest recovery in selected segments of the manufacturing sector. The textile and the food groups have the highest weightage in manufacturing.\n\nThe output of the food group recorded a moderate contraction of 0.5pc against 1.8pc expansion last year.\n\nNotable declines were recorded in sugar, bakery products, and chocolate and sugar confectionery, tea blended and vegetable ghee. The decrease in sugar production was primarily attributed to the deregulation of the Minimum Indicative Price of sugarcane by provincial governments, which created uncertainty for farmers.\n\nThe imposition of a Federal Excise Duty (FED) of Rs15 per kg at the beginning of the current fiscal year further escalated production costs, adding pressure to an already struggling sugar industry.\n\nIn contrast, wheat and rice milling starch and its products improved, supported by better crop harvests.\n\nThe political unrest and labour disputes in Bangladesh between December 2024 and March led to the redirection of some export orders to textile producers in other Asian countries, including Pakistan.\n\nAs a result, the textile sector grew 2.2pc, wearing apparel 7.6pc, coke and petroleum products 4.5pc, pharmaceuticals 2.3pc, and automobiles 40pc. The textile sector contracted by 8.8pc in the same period last year.\n\nThe growth in cotton yarn was 8.4pc, cotton cloth 0.8pc, and terry towels and bathrobes 4.0pc were key contributors.\n\nThis turnaround was supported by improved macroeconomic conditions and a shift in the policy rate, which lowered borrowing costs and encouraged investment.\n\nAnother key sector of manufacturing — coke and petroleum products — grew 4.5pc in 9MFY25, slightly lower than 4.8pc last year.\n\nThe main contributors to this performance were high-weighted products, including high-speed diesel 9.3pc, motor spirit 2pc, furnace oil 2.7pc, and solvent naphtha 14.6pc, reflecting increased demand from the transport, industrial, and power generation sectors.\n\nMining and quarrying\n\nThe mining and quarrying sector contracted 3.4pc in 9MFY2025, slightly improving from the contraction of 4pc recorded in the previous year.\n\nSignificant growth was recorded in the extraction of sulphur 341.9pc, dolomite 43.3pc, limestone 34.1pc, marble 20.2pc, and ocher 70.3pc. Ocher is a earthly-coloured pigment used in paints and several industries.\n\nWhile some minerals experienced a decline, including crude oil 14.8pc, natural gas 6.8pc, coal 5.7pc, and iron ore 20.2pc, against the same period last fiscal year, indicating a contraction in energy and metallic mineral outputs.\n\nThe survey highlighted that LSM sector continues to grapple with persistent structural challenges, despite early signs of macroeconomic stabilisation and added that outcomes of FY25 in manufacturing and mining underline the need for deeper reforms to unlock industrial growth.\n\nThe overall recovery remains fragile amid high input costs, weak investment, and uneven policy transmission.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6847843e74643.gif",
  "retrievedAt": "2025-10-12T03:31:03.052Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916215/big-industry-production-contracts-amid-challenges",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:59.000Z"
}
