{
  "title": "Exemptions hit record as tax revenue falls short - Business - DAWN.COM",
  "author": null,
  "content": "• Sales tax waivers jump almost 50pc to Rs4.25tr\n• Income tax exemptions surge 68pc to over Rs800bn\n\nISLAMABAD: Tax exemptions granted by the Federal Board of Revenue (FBR) surged to an all-time high of Rs5.84 trillion in the outgoing fiscal year, marking a 51 per cent increase from Rs3.879tr a year ago, according to the Pakistan Economic Survey 2024-25 unveiled by Finance Minister Muhammad Aurangzeb on Monday.\n\nThe unprecedented rise in tax concessions comes at a time when the FBR is grappling with significant revenue shortfalls, making this the second consecutive year of record-high exemptions. In FY24, exemptions skyrocketed 73.3pc.\n\nThe cost of tax exemptions has gone up for the seventh consecutive year despite the government’s claim that exemptions would gradually decrease under the International Monetary Fund (IMF) programme.\n\nTax exemptions refer to the revenues foregone by the state under various categories to different industries and other groups. This is mainly due to exemptions on raw materials and semi-finished products, as well as specific sectors aimed at reducing input costs for export-oriented industries. Additionally, specific individuals are eligible for tax exemptions on certain perks and privileges.\n\nThe robust increase in tax exemption costs is mainly due to the Rs1.796tr waiver on domestically supplied and imported petroleum, oil and lubricant (POL) products. A similar quantum of exemption was reported last year.\n\nHowever, this exemption is largely fiscal — while provinces receive no share from this amount, the federal government recovers the full amount through the petroleum development levy (PDL), which is not part of the divisible pool.\n\nAs a result, the federal government incurs minimal actual cost, but provinces are left out of revenue sharing from PDL collections.\n\nThe IMF is concerned about these tax waivers and has requested that the government abolish them. The government withdrew tax in last year’s budget. The upcoming federal budget 2025-26 will show the actual number of exemptions that will be eliminated to meet the FBR’s ambitious revenue target.\n\nThe value of tax exemptions has been increasing over the years. In FY18, it was Rs540.98 billion, rising to Rs972.4bn in FY19, to Rs1.49tr in FY20 and then slightly eased to Rs1.314tr in FY21, before surging to Rs1.757tr in FY22. These tax concessions were extended to all sectors to promote industrialisation.\n\nSales tax exemptions increased by 48.8pc to Rs4.253tr from Rs2.86bn in FY24, primarily due to exemptions on imports and local supply of POL products, and imports under the Fifth and Sixth Schedules of the Sales Tax Act.\n\nThe cost of zero-rated exemptions under the Fifth Schedule rose to Rs683.43bn in FY25 from Rs206.05bn in FY24, an increase of 232pc. This is because the government relaxed the zero-rated regimes for five export-oriented and some other sectors.\n\nOn the local supplies, the cost of exemption under the Sixth Schedule decreased to Rs461.09bn in FY25 from Rs613.07bn in the previous year, a decline of 25pc. This is due to a massive withdrawal of exemptions on items under that schedule.\n\nThe cost of reduced rates under the Eighth Schedule rose to Rs617.35bn in FY25 from Rs357.99bn in the previous year, indicating a growth of 72.4pc.\n\nThe sales tax exemption on petroleum goods surged to Rs1.796tr in FY25 from Rs1.257tr, reflecting a growth of 43pc.\n\nIncome tax exemptions rose to Rs800.82bn in FY25 from Rs476.96bn in FY24, an increase of 68pc. This rose mainly because of total exemption on income under Part 1 of the Second Schedule of the Income Tax Ordinance, costing the exchequer Rs443.45bn in FY25, up from Rs293.46bn over the previous year, an increase of 51pc.\n\nAt the same time, the tax credit cost extended to businesspersons in income tax more than quadrupled to Rs101.04bn in FY25 from Rs24.37bn last year.\n\nThe total tax exemption of Customs reached Rs785.87bn in FY25, up from Rs543.52bn over the previous year, showing an increase of 44.6pc.\n\nPublished in Dawn, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:30:26.188Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916155/exemptions-hit-record-as-tax-revenue-falls-short",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:12:34.000Z"
}
