{
  "title": "CORPORATE WINDOW: An inquiry into cryptocurrency - Business - DAWN.COM",
  "author": null,
  "content": "Ever since the formation of the Pakistan Crypto Council (PCC) in March to regulate and integrate blockchain technology and digital assets into the financial landscape, the country seems to be moving at breakneck speed to fast-track the adoption of cryptocurrencies or digital assets, which “rely on an encrypted network to execute, verify, and record transactions, independent of a centralised authority such as a government or bank”.\n\nThis is despite the fact that crypto transactions, which use blockchain technology to store transactions on a digital ledger across a network of computers to enable financial transactions anonymously without banks, financial firms or governments, remain “illegal” in Pakistan, and many individual crypto investors or users (their numbers are touted officially to be in millions to make a case for early adoption) have seen their personal bank accounts — and in some cases the accounts of their family members and even friends — seized when attempting to withdraw earnings even though trading isn’t explicitly banned.\n\nThe seized digital assets already in state custody are now being used to create a pool of official “strategic reserves” to signal Pakistan’s long-term belief in decentralised finance, as announced recently by PCC CEO Bilal Bin Saqib during a Bitcoin event in Los Angeles.\n\nEl Salvador, a close ally of the Trump administration, is the only country in the world which has led the world in crypto adoption and converted a portion of its official international reserves — nearly 15 per cent of the total stocks — into Bitcoins, a top cryptocurrency. However, its cryptocurrency gambit is believed to have worsened the country’s economic woes, leading it to the International Monetary Fund for a bailout. Bitcoin’s price is volatile, as is the case with other less popular digital assets. It fell over $30,000 from its December 2024 peak of $106,490 before rising again in April and May this year.\n\nThough several countries around the world have embraced cryptocurrencies as legal forms of payment, the opinion on its adoption in Pakistan remains divided\n\nWhen the cryptocurrency market was routed in 2022, according to an article published by the Council on Foreign Relations , the risk of these holdings contributed to El Salvador’s debt crisis. The threat of money laundering and bitcoin’s price instability worsened the spread in El Salvador’s government bonds compared to US treasuries, it said.\n\n“El Salvador’s cryptocurrency gambit also poses risks to small investors who might be lured into untrustworthy assets. In Argentina, for example, investors lost some $250 million after being encouraged by President Javier Milei to purchase a little-known digital currency called $Libra. When they did as $Libra went live, those with initial holdings quickly dumped their assets in a classic ‘rug pull’, leaving small investors lured by the scheme without their money. While Bitcoin is too large to be rug pulled, the direction of El Salvador’s cryptocurrency culture may leave Salvadorans uniquely exposed to other digital currencies that take advantage of unsuspecting enthusiasts,” the article added.\n\nMr Saqib, a Web3 growth expert, crypto advisor, and angel investor, recognised by Forbes and awarded an MBE by the British government for his contributions to entrepreneurship and innovation, briefly spoke with me on Wednesday about the matter. The critics of the crypto adoption effort, he said, don’t just know anything. “We follow the US in every matter. Now that President Donald Trump is leading the world in this sphere, why shouldn’t we also join it? We have the third largest population of freelancers in the world, and the adoption [of crypto and blockchain] technology will help us grow our exports,” he argued. Hence, many suspect that Islamabad’s focus on digital assets is driven by its desire to buy influence with the Trump administration.\n\nUntil now, Pakistan’s approach to crypto/blockchain adoption, say tech executives, has been cautious, reactive and ambiguous, shaped by concerns about financial stability, capital flight, and regulatory capacity. A couple of years back, the government also indicated that it did not plan to legalise cryptocurrencies, citing Financial Action Task Force compliance and their proven use for money laundering and terror financing elsewhere in the world.\n\nStill, peer-to-peer and informal crypto adoption continues, with Pakistan ranking among the top 10 globally in Chainalysis crypto adoption indexes. Bitcoin usage is widespread for remittances, speculative trading, and as a hedge against inflation, largely through offshore exchanges like Binance and via stablecoins.\n\nThe State Bank had stopped banks and financial service providers from dealing in cryptocurrencies in 2018. Yet the Securities and Exchange Commission of Pakistan in November 2020 released a paper outlining potential approaches for regulating cryptocurrency in the country. Now, the central bank has also just released its regulatory framework sandbox for startups to test innovative products and services in a controlled environment.\n\nThe government has also recently announced the establishment of the Pakistan Digital Assets Authority for overseeing blockchain infrastructure and regulating virtual assets. Besides, the PCC has formed a technical committee to draft a framework for digital and virtual assets in Pakistan, aiming to align with international standards and evolving technological trends.\n\nMr Saqib recently said with Pakistan ranking among the top 10 nations for global crypto adoption and an estimated 25m active users, alongside an over $30bn foreign remittance market, blockchain presents an unparalleled opportunity for innovation and growth. “This is just the beginning; Pakistan is open for business,” he argued, underscoring Pakistan’s growing engagement in global cryptocurrency discussions and the evolving landscape of digital finance.\n\nSeveral countries around the world have embraced cryptocurrencies, recognising them as legal forms of payment or establishing frameworks for their regulation. But the opinion on its adoption by Pakistan is divided. Those in favour say Pakistan, by creating a clear legal framework for crypto adoption, can foster innovation, increase financial inclusion, ensure cheaper and faster remittances and attract investment.\n\n“This means people investing would comply with the appropriate anti-money laundering laws and pay taxes. This also means that the regulator will protect people from scams and penalise bad actors and make crypto exchanges comply with all domestic regulations,” a tech firm executive explained.\n\nThe critics argue that there are several reasons why Pakistan should not embrace digital assets until it becomes more stable and secure, as cryptocurrencies are at the moment highly volatile, can create uncertainty in business transactions, encourage capital flight and money laundering for terrorism (groups like Tehreek-i-Taliban Pakistan are using exchanges like Binance for crowdfunding purposes), worsen macroeconomic fundamentals as these operate anonymously outside the central bank’s control, and so on.\n\nAnother tech executive argued, “I would speculate that people in the government are hoping that by legalising the holding of Bitcoins, it may entice Pakistanis, reportedly holding digital assets worth $20 billion in their offshore accounts, to bring that to Pakistan.”\n\nHe is also opposed to making crypto a legal tender and creating strategic Bitcoin reserves. “If the amount of money in circulation outpaces the supply of goods and services, it becomes inflationary. On the other hand, if for any reason the money in circulation is less than that needed to support economic activity, it causes contraction.\n\n“Bitcoin and other cryptocurrencies, which are not specific to any country, grow in quantity based on certain mining activity, which is unrelated to the underlying economic conditions anywhere in the world. It has a speculative value on the basis that the mining will be restricted to an absolute, predefined number. The speculative value is, as stated, what the next person is willing to pay for it. The way I see it is that if I acquire a Bitcoin, the value I can assign to it is what a greater fool than I is willing to pay me for it,” he argued through a written response, requesting anonymity.\n\nMerits and demerits of crypto adoption apart, it is advisable that the authorities reassess their strategy, pause and move cautiously.n\n\nPublished in Dawn, The Business and Finance Weekly, June 10th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/06/6847889462514.gif",
  "retrievedAt": "2025-10-12T03:29:57.264Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1916229/corporate-window-an-inquiry-into-cryptocurrency",
  "dateList": "2025-06-10",
  "date_published": "2025-06-10T01:23:55.000Z"
}
