{
  "title": "NDMA to provide 14 ventilators, 64 beds, 25 oxygen tanks to Balochistan government",
  "link": "https://www.app.com.pk/national/ndma-to-provide-14-ventilators-64-beds-25-oxygen-tanks-to-balochistan-government/",
  "date_published": "2020-07-14T04:23:00.000Z",
  "source": "APP",
  "content": "QUETTA, Jul 14 (APP):Chairman National Disaster Management Authority (NDMA) Lieutenant General Mohammad Afzal on Tuesday said that NDMA will provide 14 ventilators, 64 beds, 25 oxygen tanks to the Balochistan government to combat pandemic more effectively.\n“Balochistan government with its available limited resources took extraordinary steps within a short span of time to combat Coronavirus,” he said during his visit to ICU, Isolation Ward, and Testing Laboratory established for COVID-9 patient here in the Bolan Medical College Hospital and Fatimah Jinnah Chest Hospitals of the provincial capital.\nMedical Superintendent Bolan Medical College Hospital (BMC), Dr. Saleem Akhter Abro, and Medical superintendent Fatimah Jinnah Chest Hospital Dr. Noorullah Musakhail briefed the Chairman NDMA upon his arrival to their respective hospitals.\nChairman NDMA, on the occasion, said that doctors, paramedics, pharmacists, nurses, and paramedics are our frontline heroes. They are the people who are rendering matchless sacrifices in the line of their duties to defeat the pandemic. “Government values their services and would always be there to own them,” he maintained.\nHe said that the federal government was taking all possible steps to provide the best health facilities at their doorsteps to the patients including those affected by the Corona Virus. “Efforts are also afoot to increase the capacity of the hospitals and other available health care units in the wake of the current situation arising from the deadly virus.\nLieutenant General Mohammad Afzal said that under the supervision of Chief Minister Balochistan Jam Kamal, Chief Secretary Balochistan Faseel Asghar and Secretary Health Dostain Jamaldini provincial government devised a concerted strategy against the pandemic that yielded positive results.",
  "retrievedAt": "2025-08-11T19:29:41.178Z"
}
