{
  "title": "PTI govt doing sincere efforts to advocate case of Kashmiris at Int’l forums: Ramesh Kumar",
  "link": "https://www.app.com.pk/national/pti-govt-doing-sincere-efforts-to-advocate-case-of-kashmiris-at-intl-forums-ramesh-kumar/",
  "date_published": "2020-07-14T00:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 14 (APP):Pakistan Tehreek-e-Insaf (PTI) MNA Dr Ramesh Kumar Tuesday said that his government under the brave leadership of Prime minister Imran Khan was making all out sincere efforts to advocate the case of Kashmiris at all forums through effective diplomacy.\n“Prime Minister, as per his commitment was advocating Kashmir issue in the world and now the civilized world is also supporting the narrative of Pakistan in this regard”, he said while talking to PTV news channel.\nThe sacrifices of Kashmiris will not go waste and they will get their due right of free and fair plebiscite at all\ncosts as Pakistani nation and its government is standing shoulder to shoulder with kashmiri people in their need of hour, he added.\nIt is for the first time that Kashmir issue has been internationalized and public opinion in civilized world regarding this issue has changed, he mentioned.\nHe said it is also encouraging that Kashmiris are fighting for their right to -self-determination against a far bigger country for the last many decades but have refused to step back from their fundamental rights, MNA said.\nMNA said it is high time for civilized world and world human rights organizations to raise voice against Indian atrocities and human rights violations carried out by Indian forces.\nHe said our Prime Minister, President and Foreign minister are exposing horrible face of India to the world. Kashmir is a national cause and it is a great success of our foreign policy, that Kashmir issue is discussing in the Security Council of the United Nations and other International forums.\nKumar said now the Kashmiri leadership is also acknowledging Pakistan’s unwavering support to the Kashmiri people and appreciated its efforts for effectively raising the Kashmir dispute and highlighting gross human rights violations in IOJK at all international forums.\nHe reiterated Pakistan’s firm resolve to stand with the Kashmiris till the realization of their right to self-determination as promised by the international community.\nHe said extremist Indian government used different tactics to suppress the Kashmiris’ resolve for freedom struggle, but it failed in it.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:29:46.873Z"
}
