{
  "title": "Newborns’ mental health to be integrated into national policy",
  "author": null,
  "content": "ISLAMABAD, Apr 11 (APP):Parliamentary Secretary for Health Dr. Nelson Azeem on Friday announced that newborns’ mental health will be incorporated into Pakistan’s national health policy.\nSpeaking at the inaugural session of the country’s first international Infant Mental Health Conference, he said that the earliest years of life lay the foundation for lifelong mental, emotional, and physical well-being.\nHe highlighted that around 40 percent of Pakistan’s population is under the age of 15. “If we nurture our children properly today, we can build a healthy, capable, and productive workforce that ensures economic progress and social stability,” he said.\nThe conference was jointly organized by the Health Services Academy (degree-awarding institution), The Healing Triad, and the Pakistan Institute of Living and Learning.\nThe central theme of the event was “Baby Matters,” aimed at promoting mental health services for children from birth to age three.\nKey speakers included Dr. Alexander Harrison, Dr. Nadeem Zafar, and Prof. Mudat H. Rana, while representatives from the Ministry of National Health Services, World Health Organization (WHO), UNICEF, Pakistan Paediatric Association, Pakistan Psychiatric Society, Institute of Psychiatry (Benazir Bhutto Hospital Rawalpindi), Health Services Academy, and other national and international organizations also participated.\nDirector Projects at HSA, Nadeem Sajjad Kayani, and Additional Controller of Examinations Dr. Khalid Iqbal Malik, along with HSA’s senior faculty, were in attendance.\nRepresenting the HSA Vice Chancellor, Head of Public Health Department Dr. Babar Tasneem Shaikh welcomed the participants and outlined the critical gaps in infant mental health services in Pakistan, along with their serious social and medical consequences.\nDr. Shaikh emphasized the need for effective parenting, early intervention services, and community-level awareness for this age group.\nThe conference provided a unique platform for dialogue and collaboration between international and local experts.\nLocal participants included Dr. Abid Malik, Dr. Asad Tameezuddin, Dr. Ayesha Minhas, Dr. Sarwat, Dr. Wajid Malik, Dr. Alia Khalid, Dr. Roop Zainab Rana, and Ms. Farwa Naqvi from Rawalpindi and Islamabad.\nDr. Azeem pointed out that research clearly indicates how adverse early childhood experiences—such as stress, abuse, or neglect—have a lasting impact on brain development.\nHe noted that maternal depression during pregnancy, stress in newborns, and lack of early stimulation contribute to developmental delays, malnutrition, and academic failure, threatening the nation’s future.\nHe announced that the government will undertake comprehensive measures to promote child mental health. These include expanding access to mother and child mental health services, introducing mental health screening for young children, training healthcare providers, teachers, and midwives, raising awareness among parents, and strengthening policies related to early education and nurturing.\n“This investment is not merely for individual well-being—it is an investment in national development.\nThe time to act is now so that every child can thrive mentally, physically, and emotionally,” he added.\nFollowing the opening session, expert teams were dispatched to various cities, where they will hold awareness and training sessions on Saturday with parents, teachers, healthcare professionals, and community leaders.\nEach team will also plant a symbolic tree representing the beginning of Infant Mental Health (IMH) services and long-term partnerships in those regions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:24:17.804Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/newborns-mental-health-to-be-integrated-into-national-policy/",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T12:41:00.000Z"
}
