{
  "title": "IHC stops transferring of pending cases from single to division benches",
  "author": null,
  "content": "ISLAMABAD, Apr 11 (APP):A division bench of Islamabad High Court (IHC) on Friday stopped the deputy registrar judicial from transferring cases from single to division benches without a legal ground.\nIt also ordered the IHC’s deputy registrar to keep the court’s guideline in transferring or marking of cases in future.\nA division bench comprising Justice Mohsin Akhtar Kayani and Justice Sardar Ijaz Ishaq Khan issued the 11 pages order.\nIt said that court guidelines should be followed until a full court bench would give its opinion regarding the rules.\nIt directed the registrar office to send all the cases to relevant benches as per the high court rules and orders. The deputy registrar judicial wouldn’t send the cases from single benches to division benches without a legal ground in future, it said.\nThe court said that it was the authority of deputy registrar judicial to fix the cases before single or division benches as per the high court rules. The power of the chief justice was to approve the roster, it said. The deputy registrar is not authorized to withdraw and shift any case to another bench.\nThe court said that the administrative powers of the chief justice are clear, adding that fixing of the cases is judicial business and it couldn’t be seen as administrative power.\nThe judgment said that the larger bench had settled in Tyrian case that the chief justice could form a bench but couldn’t amend or re-constitute it. The bench could be re-constituted only when it recused itself from the case with reasons.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:23:52.054Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ihc-stops-transferring-of-pending-cases-from-single-to-division-benches/",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T16:36:00.000Z"
}
