{
  "title": "PM Shehbaz Sharif’s Belarus visit of utmost importance,  will help further boost bilateral ties: Tarar",
  "author": null,
  "content": "ISLAMABAD, Apr 11 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Friday that Prime Minister Shehbaz Sharif’s visit to Belarus was of utmost importance, which will prove helpful in further boosting the relations between the two countries.\nIn a media talk, the minister said during the visit of Belarusian President Aleksandr Lukashenko to Pakistan a few months ago, it was agreed to increase cooperation in several fields.\nHe said a Memorandums of Understanding  (MoU) will be signed during Prime Minister Shehbaz Sharif’s visit to Belarus to increase cooperation in agricultural machinery, defense, defense production and various sectors.\nThe minister said that there will also be discussions on further expanding relations between Pakistan and Belarus.\nThe President of Belarus has a personal and long-standing relationship with PML-N leader Muhammad Nawaz Sharif, Attaullah Tarar maintained.\nHe said that Muhammad Nawaz Sharif has been invited as the special guest for an informal dinner.\nDuring the past year, Pakistan has moved away from isolation on the global stage and towards an active foreign policy, Attaullah Tarar remarked.\nSeveral world leaders have visited Pakistan, Attaullah Tarar said adding that Pakistan hosted the Shanghai Cooperation Organization (SCO) summit.\nAttaullah Tarar said Pakistan’s agreements with various countries were in the implementation stage.\nHe said more than 300 experts and delegates from all over the world participated in the recently concluded Pakistan Minerals Investment Forum.\n“Pakistan is emerging as an emerging economy on the global stage”, Attaullah Tarar said adding that now foreign investors were coming to Pakistan and investing in various projects.\nHe opined that business forums being conducted now were proving helpful in stabilizing the country’s economy.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:24:46.855Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-shehbaz-sharifs-belarus-visit-of-utmost-importance-will-help-further-boost-bilateral-ties-tarar/",
  "dateList": "2025-04-11",
  "date_published": "2025-04-11T08:04:00.000Z"
}
