{
  "title": "HEC invites research proposals from faculty members under RAPID Tech Transfer Grant",
  "link": "https://www.app.com.pk/national/hec-invites-research-proposals-from-faculty-members-under-rapid-tech-transfer-grant/",
  "date_published": "2023-01-10T08:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): The Higher Education Commission (HEC) has invited research proposals from faculty members, under the RAPID Technology Transfer Grant (RTTG) programme.\nThe official sources told APP that HEC, in that regard, had invited faculty members of public and private sector universities/degree awarding institutions (DAIs) to submit research proposals focused on the transfer of university developed technologies and products to the industry and commercial sector.\nThe RTTG is a key element of the Higher Education Development in Pakistan (HEDP) project supported by the World Bank and implemented by the HEC.\nIt is a fast-track funding mechanism dealing with themes, topics, and issues of severe urgency for quick-response research on Flood Response, Climate Change and Environment.\nThe grant is anticipated to support proposals in applied research, product innovation, and commercialization of developed technological research and solutions. The RTTG will provide funds to selected institutions based on a competitive, peer-reviewed evaluation of proposals.\nThe amount of funding for RTTG awards may range between PKR 10 – 20 million with a maximum project duration of six months.\nSharing the details of applicant eligibility, the sources stated that Lead Principal Investigators (Pls) must be a regular faculty member of higher education institutions (public and private), or hold a contract equivalent to the length of the project duration.\nThe priority sectors for RTTG support are Flood Response, Climate Change and Environment, including but not limited to climate mitigation, adaptation, policy dialogue interventions and disaster management (focusing on climate modelling and disaster surveillance, environment monitoring, and geological monitoring), Metro-scale pollution reduction technologies, protection of available trees through artificial intelligence system controls, and use of membrane systems for gaseous and water industrial waste treatment\nThe other sectors, including design and development of hybrid membranes and classical system per the requirement of site and location, identification and development of hospital waste treatment processes, removal of arsenic/other toxic metal elements from industrial effluents and water underground aquifers, climate-smart agriculture, adapting agriculture production to climate change by developing climate resilient crop varieties with regard to heat, drought, and flooding (especially of wheat and cotton) and any other area related to Flood Response, Climate Change and Environment.\n-Proposal Submission Procedure-\nThe project proposals on the prescribed application template must be submitted via HEC online portal. The deadline for project proposal submission is Tuesday, February 7, 2023 (11:59 PM).\nThe Interested candidates are asked to visit http://www.hec.gov.pk/site/RTTG for further information and application.",
  "retrievedAt": "2025-08-11T05:42:32.235Z"
}
