{
  "title": "Int’l organisations, countries’ over $10 bln pledges for 4RF implementation commendable: Sherry Rehman",
  "link": "https://www.app.com.pk/national/intl-organisations-countries-over-10-bln-pledges-for-4rf-implementation-commendable-sherry-rehman/",
  "date_published": "2023-01-10T12:20:00.000Z",
  "source": "APP",
  "content": "The minister in a series of tweets expressed her gratitude to the world community, donor agencies and development organisations for giving an overwhelming response to the International Climate Resilient Pakistan Conference in Geneva that was aimed to garner cooperation for burden sharing of climate catastrophes triggered in the region due to heightened greenhouse gas emissions (GHGs).\nSenator Rehman said the international partners had reiterated full support at the forum with the government of Pakistan and the United Nations at the Geneva conference.\nShe said the finances pledged would be used for the complete rehabilitation and reconstruction of the flood victims.\n“The world has acknowledged the ravages of floods and climate change in Pakistan. Pakistan needed resources to rehabilitate flood victims and rebuild infrastructure and this is a great achievement of Pakistan”, Senator Sherry Rehman said.\nThe minister underscored that in this entire process, the continuous efforts of UN Secretary General Antonio Guterres were appreciable.\n“After the floods, he emerged as the voice of vulnerable and affected people in Pakistan at the global level,” Sherry Rehman said.\nShe added that the first priority of the government was to give back their homes and livelihoods to the flood victims.\n“We are constantly struggling in this regard and will not rest until the complete success of this mission”, Sherry Rehman said.\nThe minister also lambasted the Pakistan Tehreek-e-Insaf (PTI) leadership. “On the other hand, one party (PTI) in the country is constantly busy creating chaos and uncertainty. The world is seeing how different our priorities are from that of this party,” Sherry Rehman said.",
  "retrievedAt": "2025-08-11T05:42:41.690Z"
}
