{
  "title": "PM calls for strong Pakistan-US ties for sustainable development",
  "link": "https://www.app.com.pk/national/pm-calls-for-strong-pakistan-us-ties-for-sustainable-development/",
  "date_published": "2023-01-09T19:57:00.000Z",
  "source": "APP",
  "content": "GENEVA, Jan 10 (APP): Prime Minister Shehbaz Sharif during a meeting with Deputy Administrator of the United States Agency for International Development (USAID) Isabel Coleman on Monday stressed for strengthening of relations between Pakistan and the United States.\nHe said a new era had started in the ties between Pakistan and the United States and their relations were based on mutual respect and a desire for sustainable development.\nIsabel Coleman had called on the prime minister on the sidelines of the International Conference on Resilient Pakistan in Palais des Nations, Geneva, Switzerland.\nShehbaz Sharif said the two countries had the common objective of fighting against terrorism and extremism.“Pakistan has a categorical and clear viewpoint on this matter.”\nThe PM thanked the American government and people and the USAID for their help for flood affectees.He told the participants of the meeting that water from rains and floods was still standing in different areas of Sindh and Balochistan and the winter weather had increased the difficulties of the flood affectees.The PM shed light on the steps taken by the government for the restoration of the flood affectees.He said the government was working on projects of smart agriculture and sustainable development in Pakistan.The government was making efforts to modernize the agriculture sector to make the farmers prosperous and bring foreign exchange to the country, he noted.He told about the 10,000 megawatts solarization projects of the government, adding in the initial phase, solar panels would be installed on federal government buildings.The project would help reduce dependence on imported fuel, bring down the import bill and generate environment-friendly electricity, he explained.\nThe PM appreciated the work done by USAID in the sectors of health, education, and infrastructure in Pakistan.The USAID deputy administrator informed the prime minister about the steps taken by the USAID for the help of flood affectees in Pakistan, its announcement of additional financial assistance of $ 100 million for the flood victims, and its desire to extend full cooperation to Pakistan in the future.\nShehbaz Sharif extended his best wishes to USAID administrator Samantha Power and appreciated her efforts for providing relief to the flood victims in Pakistan.",
  "retrievedAt": "2025-08-11T05:42:34.815Z"
}
