{
  "title": "Mushahid lambasts world community on G-20 moot in IIOJK",
  "link": "https://www.app.com.pk/national/mushahid-lambasts-world-community-on-g-20-moot-in-iiojk/",
  "date_published": "2023-01-10T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 10 (APP): Chairman of the Senate’s Standing Committee on Defence Mushahid Hussain Sayed on Tuesday lambasted the world community for its double standards and silence over India’s attempts to hold the Group of Twenty (G-20) Summit 2023 in the disputed territory of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nIt was rather incumbent upon the world to foil such Indian attempts in solidarity with the oppressed innocent Kashmiris facing the worst state-sponsored human rights abuses, he said while talking to a private news channel.\nSenator Mushahid said, “If the world is much concerned then G-20 forum should hold its session in Kyiv, the capital of Ukraine, which is under Russian attack.”\nHe said the international community should not turn a blind eye to the plight of Kashmiris facing the worst violence and persecution at the hands of Indian occupant forces. But its silence over the Kashmiris’ loud cries for justice and the just right to self-determination, and India’s unilateral decisions on the disputed territory’s issues showed its duplicity, he added.\nThe Group of Twenty (G-20) is a leading international economic cooperation forum that has played a key role in shaping and strengthening international governance and framework on all major international economic issues. India got its presidency for a year on December 1, 2022.\nAccording to the G20 official website, the summit logo was inspired by the colours of Indian national flag – saffron, white and green, and blue. It juxtaposes the planet Earth with the lotus, India’s national flower that reflects growth amid challenges, it said.\n“The theme of India’s G20 presidency is ‘One Earth-One Family-One Future’ that affirms the value of all life – human, animal, plant, and microorganisms – and their interconnectedness on the planet Earth and in the wider universe,” the website said.\nThe 18th G-20 Heads of State and Government Summit will take place on September 9-10, 2023 in New Delhi. The summit will be a culmination of all the G20 processes and meetings held throughout the year among ministers, senior officials, and civil societies.",
  "retrievedAt": "2025-08-11T05:42:37.048Z"
}
