{
  "title": "Minister urges ulema to work for interfaith harmony in country",
  "link": "https://www.app.com.pk/national/minister-urges-ulema-to-work-for-interfaith-harmony-in-country/",
  "date_published": "2020-11-15T13:48:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 15 (APP): Federal Minister for Religious Affairs and Interfaith Harmony Pir Noorul Haq Qadri has urged ulema and mashaikh to work for interfaith harmony in the country.\nAddressing the ‘Milli Irtebat’ conference here on Sunday, he said that ulema and mashaikh should not become dirty politics of those who were running a campaign against the the national institutions in the name of ‘Vote Ko Izzat Do’.\nHe said that anyone using dirty language against the Chief of Army Staff was, in fact, abusing the institution. He said the campaign was prepared in New Delhi and it reached Pakistan via London.\nHe said the Pak Army was custodian of solidarity and unity of the nation and nobody could be allowed to insult it in any way.\n“The Holy Prophet (PBUH) established a state which is called the State of Madina, which strengthened Islam,” he added.\nSo ulema and mashaikh should work jointly to strengthen the state, he added.\nQadri said that if the nation wanted to respond to the world in case of insult to religion, it would have to be strong in all sectors of life especially in economy.\nHe said only two international leaders from the Islamic world raised voice against the French president on his blasphemous caricature statements.\nHe said it was a pride for Pakistan that Prime Minister Imran Khan was one of the two leaders, and the second leader was Turkish President Recep Tayyab Erodgon.\n“It is a need of the hour that the West should be made to realise that freedom of speech and insult to two billion people’s religion are two different things,” he added.\nThe minister said that it was a responsibility of ulema and mashaikh to foil the conspiracies against the country as such conspiracies had provided an opportunity to the enemy to destroy Iraq, Libya and Syria earlier.\n“Ulema should now work to eliminate or reduce differences among different sects of Islam and make them united,” the minister said.",
  "retrievedAt": "2025-08-11T20:01:20.980Z"
}
