{
  "title": "‘Kaavan’ elephant to be shifted Cambodia on Nov 29: IHC told",
  "link": "https://www.app.com.pk/national/kaavan-elephant-to-be-shifted-cambodia-on-nov-29-ihc-told/",
  "date_published": "2020-11-27T15:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): The Islamabad High Court (IHC) was told on Friday that ‘Kaavan’ the elephant of Marghazar Zoo Islamabad would be shifted to Cambodia on November 29, in compliance of court orders pertaining to shifting of zoo animals to sanctuaries.\nWhile, the two bears would be shifted to Jordan on December 6.\nChief Justice Athar Minallah conducted hearing on a case pertaining to shifting of animals to sanctuaries due to their poor look after arrangements at the Islamabad zoo.\nDuring the course of proceedings, Dr. Amir Khalil and German expert Frank Gortz, who came from Austria to transfer Kaavan, appeared before the court and said that the elephant would be sent to Cambodia on November 29. Later the two brown bears would be transferred to Jordan on December 6.\nChief Justice Athar Minallah appreciated the team of doctors and experts who came to take care of Kaavan and said that Pakistan could also take care of the animals but it had set a precedent to shift them in sanctuaries.\nThe bench remarked that the animals were not made to be kept in cages, adding that the animals need to be provided natural environment.\nJustice Athar Minallah remarked that only Costa Rica had banned zoos and set an example for the world. Kaavan – the elephant had become international celebrity, he said.\nThe chief justice appreciated the efforts of Dr. Khalil and other people who participated in this cause. The court said that President of Pakistan Dr Arif Alvi himself visited to see Kaavan at the zoo and set a good example.\nDr. Amir Khalil told the court that they had prepared a special traveling box to shift Kaavan and said it was a big mission. The mission was complex due to the elephant was big in size and journey was long.\nGerman Expert Frank Gortz said that he came here for medical analysis of Kaavan and to assure his safe journey.\nDr. Khalil also requested the chief justice to join the occasion as Kaavan leaves for his new home. However, Justice Minallah excused and said that his court’s job was just to give judgment and it had done it. The court then adjourned hearing on the case till December 6.",
  "retrievedAt": "2025-08-11T20:04:01.699Z"
}
