{
  "title": "Buying more LNG sans recovering full cost may create circular debt: Spokesman",
  "link": "https://www.app.com.pk/national/buying-more-lng-sans-recovering-full-cost-may-create-circular-debt-spokesman/",
  "date_published": "2020-11-27T18:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP): Buying more liquefied natural gas (LNG) sans recovering full cost could prove reckless, besides creating circular debt, said a spokesman of Petroleum Division on Friday while responding media allegations of LNG imports on ‘selected data.’\nClarifying the allegations, he said, LNG is not gas as per law, “government can only buy more LNG when confirmed buyers are available, who will pay the full price.” All LNG under contracts is Take or Pay, and when a spot cargo is procured, it becomes Take or Pay.\nEach cargo is approximately $25 million in value. The government is buying additional volumes, above 800mmcfd of prior contracts, based on demand from confirmed consumers, who are prepared to pay the full price. This includes Power, CNG and portion of Industrial demand.\nRegarding the construction of more LNG terminals, it is clarified that the terminals generally run near capacity; in last 27 months since the present government took office during winter and summer, there have been nine months where the total LNG demand has been 800mmcfd or less.\nIn last four years, the government and customers has paid billions of rupees in charges for unutilized capacity. If the present government were to build more terminals on the same financial model, much larger amounts would be paid out of public money that will go waste.\nInstead, the present government opened up the sector to private investors and gave permissions to all who applied, with no financial commitment on the part of government.\nTwo of these companies are moving forward and one is likely to break ground within two months, with the other to follow shortly thereafter.\nResponding to allegations of not signing more long-term LNG contracts, he said it is must be understood that the government have to ensure that we can sell the full 800mmcfd every month before committing to more long-term contracts.\nWhen the projections will show that the country has firm demand exceeding 800mmcfd on a consistent basis, only then, the government will consider signing more long-term agreements. Otherwise, it will be releasing LNG in the air.\nOn the queries of not buying more LNG in summer 2020, to meet winter demand and saving billions, he said that spot cargoes prepared for delivery (i.e within 30-60 days).\nWhereas in forward buying (i.e order today for delivery much later), the pricing for such purchases is being undertaken on a forward curve for Brent and Swap Spreads for slope.\nSo, if spot cargoes were available in July for 10 percent of Brent, resulting in $4/mmbtu delivered price, an order placed in July for delivery in December does not get priced at $4/mmbtu. The sellers will use forward projections of Brent in December and Swaps Spreads for slope in December, resulting in a much higher price for delivery in December.\nAn expectation that we can get ready price of summer for delayed delivery in winter is totally wrong.\nThe allegations regarding recent LNG Spot Purchases by the government for December, it must be known that the global demand of LNG goes up dramatically in winter compared to summer.\nIt is a natural phenomenon that summer spot prices are lower and winter prices are higher.\nEven ignoring the current winter season, the range of spot prices in our tenders in the last one year spanning a winter and a summer has been at a slope of as low as 5.8 percent and as high as 15.78 percent.\nIt must be noted that from Sep 2018 to November 2020, a total of 35 spot cargoes were bought by Pakistan, with an average spread of 10.4 percent of Brent compared to 13.37 percent of Brent old contracts. Even if the high of December 2020 is added, the spot average still come to only 11.3 percent and this average will go down after January 2021.\nAnother question was about why was enough LNG not ordered in summer resulting in two extra cargoes being ordered, he said spot cargoes are ordered once firm demand is available to PLL showing the need for going above 800mmcfd, as explained above.\nPPRA rules followed in routine require approximately 75 days procurement process. On occasion, if an emergency cargo is needed, the process is shortened, again staying within PPRA Rules.\nOn account of COVID, a lot of industry was shut down and electricity demand was low in the middle of summer. PLL ordered enough LNG based on the demand placed with it. When lockdown restrictions were eased, the economy had a V shaped recovery and the demand picked up rapidly.\nWhen additional demand was placed, emergency tenders were arranged to procure the LNG.\nRegarding the allegations of giving priority to RFO over LNG and not being provided cheap LNG to NTDC resulting in running some plants on high cost RFO, it is clarified that as for Karachi Electric, ECC allocated them 190mmcfd of gas in April 2018.\nGas allocations to Power and Fertilizer require specific identification of the source. However, in a typical style of previous government, an allocation was made without identifying where this additional gas would come from, or who would be cutoff, or even ensuring an agreement for this supply. SSGC has been providing gas to KE on an as available basis.\nWhen load shedding hit the city of Karachi in summer 2020, and KE did not have enough RFO in stock which it is required to do, some LNG ordered for NTDC was diverted to KE through SSGC’s system.\nThis resulted in replacement of that capacity in the NTDC system with RFO for about two months until the emergency cargoes of LNG were delivered.\nAs of end of November, the total generation on RFO in the NTDC system in 11 months is less than 3.5 percent of total generation. In FY 2017-18, the last year of previous government, RFO generation stood at (21percent).",
  "retrievedAt": "2025-08-11T20:03:58.926Z"
}
