{
  "title": "President announces April 9 as election date for Punjab, KP assemblies",
  "link": "https://www.app.com.pk/national/president-announces-april-9-as-election-date-for-punjab-kp-assemblies/",
  "date_published": "2023-02-20T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP): President Dr Arif Alvi on Monday announced April 9, 2023 as the date for holding general elections of the provincial assemblies of Punjab and Khyber Pakhtunkhwa.\nIn a decision under under Section 57 (1) of Elections Act, 2017, the president asked the Election Commission of Pakistan (ECP) to issue election programme in accordance with Section 57 (2) of the Act.\nIn his letter to the Chief Election Commissioner of Pakistan (CEC), the president said that he was under oath to preserve, protect and defend the Constitution of the Islamic Republic of Pakistan under Article 42 read with third Schedule of the Constitution.\nHe wrote that there being no restraining order from any of the judicial fora, there was no impediment in invoking the power and authority vested in him under Section 57 (1) of Elections Act, 2017, empowering him to “announce the date or dates of the general elections after consultation with the Commission”.\nTherefore, the president said he had felt it necessary to perform his constitutional and statutory duty to announce the date of elections to avoid the infringement and breach of the Constitution and law i.e., holding of elections not later than ninety days.\nPresident Alvi said that the governors of Punjab and Khyber Pakhtunkhwa were not performing their constitutional duties for appointing a date, not later than ninety days from the date of dissolution of provincial assemblies as per the Constitution of Pakistan.\nHe added that the ECP was also not fulfilling its constitutional obligation for holding polls for the assemblies of Punjab and Khyber Pakhtunkhwa.\n“Both the constitutional offices are placing the ball in each other’s court, similar to an Urdu adage پہلے آپ، نہیں، پہلے آپ (pehlay aap, nahin pehlay aap – You go first, no after you) thus, resulting in delay and creating a serious danger that constitutional provisions may be violated”, he said.\nThe president pointed out that the ECP had already indicated the possible dates of elections in its various communications to the constitutional functionaries showing its own responsibility of holding the elections within ninety days.\nPresident Alvi stated that he had initiated a serious consultation process with the ECP under Section 57 (1) of the Elections Act, 2017 to announce the date for the general elections of the aforementioned assemblies, however, the ECP replied that the Commission could not participate in a meeting on the subject matter with the Office of the President.\nHe said that in exercise of powers conferred upon him under Section 57 (1) of Elections Act, 2017, he was announcing the date of April 9, 2023 for holding of general elections of the provincial assemblies of Punjab and Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T06:08:31.506Z"
}
