{
  "title": "Sania for amending BISP Act to facilitate poor masses amid rising inflation",
  "link": "https://www.app.com.pk/national/sania-for-amending-bisp-act-to-facilitate-poor-masses-amid-rising-inflation/",
  "date_published": "2023-02-20T10:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP): Senator Sania Nishter of Pakistan Tehreek-e-Insaf (PTI) on Monday apprised the House that aim of introducing the Bill further to amend the Benazir Income Support Act, 2010 which was rejected by the House suggested measures for enhancing the stipend under BISP to protect the poor masses from rising inflation.\nAddressing the House at the issue of public importance, the Senator said according to the data of Pakistan Bureau of Statistics, on February 16 Sensitive Price Index was recorded at 38.42 percent and purchase of daily commodities was beyond the reach of common man, particularly middle and lower middle class.\nShe said that due to inflation, it was difficult for lower income group people to bear the expenditure of health, education and meet other daily household needs.\nShe said that the bill, which was introduced in the House aimed to relate stipend of Benazir Income Support Programme (BISP) with inflation to provide relief to the marginalised segments of the society to provide maximum relief to them through enhanced allocation for the programme.\nSania Nishter said that to this effect, a committee was already formed to prepare mechanism to increase the amount according to inflation in budget, adding that one meeting of the committee was also held.\nSpeaking on the occasion, Senator Dr Zarqa Suharwardy Taimur (PTI) expressed her concerns over rising influence of India on water resources of Pakistan, particularly construction of water reservoirs on Neelum River. She also expressed her displeasure over a question paper of COMSAT University and termed it against social and religious ethics.\nShe also called for allocating proper time for women members of Senate for expressing their point of view and urged the need for taking appropriate measures to tackle with environmental degradation.\nDr Taimur lauded the efforts of law enforcement agencies and their sacrifices for restoring peace and security in the country.\nSenator Robina Khaild of PPP said that the Senate was the highest forum of the country and discussion in it must be based on evidence and should not discuss concocted things circulating in news papers and social media.\nShe appreciated the role to Chairman PPP, Foreign Minister Bilawal Butto Zardari for further cementing diplomatic ties of the country with different countries of the world.\nShe expressed her concerns over increasing use of drugs among youth, particularly in educational institutions and stressed the need for taking strict measures to overcome the menace. Senator Rubina also demanded to provide proper opportunities for the youth to engage with them.",
  "retrievedAt": "2025-08-11T06:08:25.477Z"
}
