{
  "title": "Amin inaugurates “SELF ENUMERATION PORTAL” for digital census",
  "link": "https://www.app.com.pk/national/amin-inaugurates-self-enumeration-portal-for-digital-census/",
  "date_published": "2023-02-20T18:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):Federal Minister of Information Technology and Telecommunications, Syed Amin-ul-Haque on Monday inaugurated the “SELF ENUMERATION PORTAL” of 7th Population and Housing Census, 2023 as the Pakistan Bureau of Statistics (PBS) is going to conduct Pakistan’s first ever Digital census.\n“Upcoming 7th Population and Housing Census is a paradigm shift towards digitization. Self-Enumeration is one of the innovations and conveniences that this Digital Census has brought to in Statistical System of Pakistan. Through the Self Enumeration portal, it is easy to enter household information. After completing this milestone, Pakistan will become the first country in South Asia to offer the facility of self-enumeration” Chief Census Commissioner Dr. Naeem uz Zafar appraised the participants of the ceremony.\nHe further informed that Geo-tagging, Tablet-based data collection, real-time monitoring, Complaint management system and computer-assisted telephonic interviews for quality assurance will link the whole process with credibility, reliability and transparency.\nHe appreciated the efforts of PBS and collaborating partners for working day and night for achieving this milestone.\nMuhammad Sarwar Gondal, a Member of Resource Management /Support Services informed the participants about the background and efforts that were made to achieve the goal of Digital Census in Pakistan.\nFor the credibility of this process, PBS involved all stakeholders from planning to finalization of results.\nHe further clarified that the main purpose of the Census is Data-driven Policymaking and Planning. PBS used the data of the 2017 Census for the implementation of the Smart lockdown.\nHe appraised that self-enumeration is for their convenience, as by following some easy steps they can enter their family information. These steps are Visit the self-enumeration portal, (https: self.pbs.gov.pk). Sign Up/Register using a mobile number and generate a secure login/password, Complete the census questionnaire by providing the following details: Family information/Housing information/Respondent information, Review/ confirm information, and edit if needed, before submitting the census questionnaire.\nAfter submission of the questionnaire, a UTN will be issued which will be saved in your portal and sent to your registered mobile number through SMS. This UTN will be verified by census enumerators during field enumeration.\nChairman NADRA, Mr. Tariq Malik, appreciated the efforts of the NADRA team to adhere to the timelines. In a short time on a war footing, 126000 devices were prepared and distributed.\nSyed Amin-ul-Haque appreciated PBS and stakeholders (NADRA, SUPARCO, Provincial Governments, Armed Forces & NTC) to achieve the huge milestone of Self Enumeration.\nHe further added that it is comforting that we have reached the establishment of a system that can gather the count of individuals in Pakistan in a transparent and credible way. Self-Enumeration Portal is however just the beginning of the Census Data Collection process. He hoped that the way all organizations have been working to attain this goal, the results will be provided as per scheduled timelines.\nThe official Census song “Tum he Se Hai Tumhara Kal” was also launched in a ceremony. In an attempt to engage online audiences on social media PBS collaborated with MindMap Communications Pvt. Ltd. and Bajao, one of the fastest-growing music streaming services in Pakistan, to organize an online song competition using the slogan Tum He Se Hai Tumhara Kal. Online audiences were encouraged to use the slogan and send in their song entries. The competition’s winner was the song entry that receives the most votes on Bajao’s Music App.\nThe inauguration of the Self Enumeration portal is the beginning of the implementation of a Paradigm shift towards digitization that PBS planned to achieve through this Digital Census.",
  "retrievedAt": "2025-08-11T06:08:07.651Z"
}
