{
  "title": "NAVTTC trains over 100,000 youth as contribution to national development",
  "link": "https://www.app.com.pk/national/navttc-trains-over-100000-youth-as-contribution-to-national-development/",
  "date_published": "2023-02-20T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP): National Vocational and Technical Training Commission (NAVTTC) has equipped over 100,000 youth with income-generating skills for employment generation, economic development and productivity.\nNAVTTC has made significant achievements and has elevated the quality of Skills and Technical and Vocational Education and Training (TVET) training in Pakistan under Chairman Shahid Khan and former Executive Director NAVTTC, Sajid Baloch.\nNAVTTC has equipped youth with in-demand income-generating technical and High Tech IT Skills trainings in cutting-edge technologies like Robotics, Artificial Intelligence, Apps and Game Development, Cyber Security, Industrial Automation, Cloud Computing, Mechatronics, E-Commerce and beautician etc.\nNAVTTC has already trained 143,000 highly skilled professionals, with 71 per cent employment; 75,268 have been trained in Hi-Tech Digital IT skills; and 53,598 in conventional trades. Over 13,000 NAVTTC skilled and certified youth got employed abroad and are earning billions to improve the national economy. NAVTTC has also launched the highly promising Matric-Tech and Middle Tech programmes for skills education in formal education schools.\nTakamol Saudi Arabia and NAVTTC Pakistan are partnering in the joint skills testing and certification programme called “Skills Verification Program” (SVP), for ensuring a competent skilled workforce and employment. More than 2500 youth has been tested/certified and got employed in the Kingdom of Saudi Arabia. NAVTTC pioneered a fully automated software-based system for SVP, which is being implemented as a global best practice by Takamol Saudi Arabia in other countries of Asia.\nNAVTTC is empowering the expatriate Pakistani skilled workforce with globally recognized skill certification, by enhancing the prospects in international labour market employment/skill visa opportunities for the Pakistani workforce, including KSA, thereby providing income, enhancing their quality of life, and earning precious foreign remittance.\nNAVTTC has developed a skilled workforce and jobs portal, National Employment Exchange Tool (NEXT) i.e. jobs.gov.pk which is fully operationalized, with available data of 458,959 skilled youth with 689,878 jobs posted from 1,085 employers.\nThe NAVTTC jobs and skills portal is a bridge which connects the skilled youth and the employers, opening new vistas of employment and empowerment with the state providing valuable services to the public for getting employment and realizing their potential.\nUnder National Vocational Qualifications Framework (NVQF), NAVTTC has developed over 200 qualifications. More than 655 TVET institutes have been accredited across the country bringing them at par with international standards of the job market.\nNAVTTC has contributed significantly to improving the skills training system in Pakistan and has developed a highly skilled and international standard workforce. International development partners have partnered with NAVTTC to benefit Pakistan, these include European Union, Germany GIZ, Japan JICA, British Council, UNHCR, UNICEF, ADB etc.\nNAVTTC with a result-oriented approach is executing various initiatives, under Prime Minister’s Youth Skill Development Program (PMYSDP), to uplift the skills TVET sector in Pakistan. The NAVTTC management enhanced the focus on marginalized segments of society, increasing training opportunities for widows, orphans, persons with disabilities (PWD), transgenders etc. with employable skills.\nNAVTTC arranged international accreditation of 10 TVET Institutes with TUV Rheinland, Germany and the Asia Pacific and Accreditation and Certification Commission (APACC).\nThis brings them to par with international standards, which has enhanced employability in the international market. NAVTTC has also established 5 state-of-the-art Centers of Excellence (CoE) with the assistance of the European Union, Germany and Norway to promote excellence in the training delivery for youth and TVET practitioners.\nCoE Islamabad is fully operationalized to facilitate the training of trainers and trainees for the modern technologies and skills to compete in the national and international labour market. To organize the TVET system of the country on modern lines, NAVTTC introduced an internationally recognized Competency Based Training (CBT) system in the country to replace the traditional mode of training.\nWith the introduction of CBT, Pakistan is geared to deliver training in accordance with the internationally demanded and recognized requirements. NAVTTC has developed and successfully launched E-learning Modules in 04 Trades i.e. E-Commerce, Professional Chef, Web Designing, and Graphics Designing and trained 3800 youth in these modules.\nPakistan is blessed to have a large pool of talented youth who have great potential.",
  "retrievedAt": "2025-08-11T06:08:17.171Z"
}
