{
  "title": "Shazia Marri calls for steps to ensure transgenders’ inclusion in mainstream",
  "link": "https://www.app.com.pk/national/shazia-marri-calls-for-steps-to-ensure-transgenders-inclusion-in-mainstream/",
  "date_published": "2023-02-20T15:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP): Federal Minister for Poverty Alleviation and Social Safety and Chairperson Benazir Income Support Programme, Shazia Marri Monday called for taking steps to ensure transgenders’ inclusion in the mainstream.\nShe was addressing a conference arranged by Sustainable Development Policy Institute (SDPI), via Zoom-link in Islamabad today.\nThe conference was arranged under the title “Financial Inclusion among Transgender Community in Pakistan.”\nShe said financial empowerment of the transgender community, awareness for them among the masses, and acceptance in society are the issues being faced by vulnerable and marginalized segments, particularly the transgender community of Pakistan.\nShazia Marri lauded the socio-economic contribution of the Sustainable Development Policy Institute in upbringing this marginalized and vulnerable society of Pakistan and awareness of their rights.\nShe also commended the role played by transgender community leaders Ms. Bindiya Rana and Ms. Reem Sharif in highlighting the issues being faced by their community.\nShe called upon Dr. Abid Qaiyum Suleri, Executive Director, SDPI, to arrange more seminars on the topic in order to highlight the issue.\nWhile talking about the role of society, she said, it is our duty to sensitize people about the hardships being faced by the transgender community in Pakistan. They have come a long way in their struggle, she continued.\nShe, however, noted with concern that there are still areas in Pakistan where atrocities are being meted out to the transgender community. She expressed her utmost desire to see the transgender community’s inclusion in the mainstream.\nShazia Marri apprised the participants that Benazir Income Support Programme (BISP) has started financial assistance to transgenders through cash disbursement under Benazir Kafaalat.\nTransgender persons are now eligible for Rs. 7000 quarterly cash assistance, she continued and urged the community to take benefit from the scheme and visit the nearest BISP Tehsil office, along with CNIC, for registration.\nShe highlighted the Hybrid Social Protection Scheme of BISP and said that BISP has proved itself as a successful model in uplifting the socio-economic conditions of women in Pakistan.",
  "retrievedAt": "2025-08-11T06:08:23.934Z"
}
