{
  "title": "Sub-national polio vaccination campaign concludes",
  "link": "https://www.app.com.pk/national/sub-national-polio-vaccination-campaign-concludes/",
  "date_published": "2023-02-20T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP): A sub-national polio vaccination campaign has concluded in nine districts to vaccinate more than six million children under the age of five years.\nThe polio drive was conducted in the seven endemic districts of Bannu, D I Khan, Tank, Lakki Marwat, North Waziristan, Upper South Waziristan and Lower South Waziristan in southern Khyber Pakhtunkhwa, and two districts of Punjab including Lahore and Faisalabad.\nThe drive was planned after two environmental samples collected from two separate sites in Lahore tested positive for the wild poliovirus in January. The first positive sample of 2023 was detected on January 19 and was genetically linked to the poliovirus found in the Nangarhar province of Afghanistan in November 2022, according to the National Polio Lab at the National Institute of Health.\nIt was the first evidence of cross-border transmission in more than a year. The second positive sample was reported on January 27, which was genetically linked to a virus circulating in south KP.\nMinister for National Health Services Abdul Qadir Patel, in a statement, said parents and caregivers should ensure that their children were vaccinated in every campaign to protect them from the disability-causing virus and to stop it from gaining a foothold in their communities.\nHe said the presence of wild poliovirus with genetic links to the virus in Afghanistan and south KP in sewage samples was evidence that the virus was moving with people and circulating in the communities.\nThe minister said, “The poliovirus on any side of the border is a threat to children in both countries. Only repeated doses of the oral polio vaccine can offer life-long protection.\n“Our vaccinators will keep bringing the vaccine to your doorstep as often as needed, so I encourage parents and caregivers to ensure that your children take these drops and remain protected.”\nCoordinator of the National Emergency Operations Centre Dr Shahzad Baig said in the last phases of its eradication, the poliovirus moved with under-immunized populations, highlighting the importance of repeated vaccination.\nHe said last year some 37 environmental samples were positive for the wild poliovirus in 13 districts, but the programme remained successful in preventing circulation in the districts of detection and limiting it to the endemic districts of southern KP.\nThe Lahore district, which reported the positive samples, was already covered during the nationwide campaign in January, he added.\nThe February round is the second round of response to the virus detection in Lahore, followed by another round in March.",
  "retrievedAt": "2025-08-11T06:08:17.307Z"
}
