{
  "title": "Amin Aslam, Zartaj Gul strongly deny any brawl at COP-26, call Fityana’s statements baseless",
  "link": "https://www.app.com.pk/national/amin-aslam-zartaj-gul-strongly-deny-any-brawl-at-cop-26-call-fityanas-statements-baseless/",
  "date_published": "2021-11-27T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 27 (APP):Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam and Minister of State (MOS) for Climate Change Zartaj Gul have jointly and strongly denied any brawl or misunderstanding at COP-26 and have said that the allegations made by Member National Assembly Riaz Fityana at Public Accounts Committee (PAC) meeting, held on November 25 were totally baseless.\nThe 26th Conference of Parties (COP-26) was held in a successful manner with due recognition to Pakistan, during which very useful meetings of SAPM and MOS with various heads of delegations and heads of international organizations and UN bodies were held as per official schedule of meetings at COP-26, said a media release.\nDuring the meetings, Pakistan’s Green agenda under the vision and leadership of Prime Minister Imran Khan was highly appreciated and Pakistan’s pavilion was one of the busiest pavilions lauded by the several heads of delegations and international organizations, it added.\nWhile representing Pakistan both SAPM and MOS individually and jointly attended various events and highlighted the prominent initiatives of the present government including TBTTP, GLOF, Climate Smart Agriculture, Protected Areas Initiatives, Clean Green Pakistan etc. held during COP-26 and highlighted Pakistan as one of the top Climate Action Champion countries of the world. The officials of Ministry of Climate Change (MoCC) attending COP-26 worked day and night and were able to make COP-26 a successful event for Pakistan, the ministers said in their joint statement.\n“The success of Pakistan in COP-26 can be gauged from the facts that the government of UK has regarded Pakistan as one of the four countries ranked as Nature Champions out of 196 countries in the world. Also the UN system has declared Pakistan as one of the top three countries ranked as Forestry Leaders, among 196 countries across the Globe,” they said.\nIt is however, added that honourable member of Parliament Riaz Fityana was not the part of Pakistan’s official delegation and was representing a Non-Governmental Organization without any invitation of MoCC.\nThe Spokesperson of the MOCC Muhammad Saleem Sheikh told APP that the statement of Lord Aamer Sarfraz,Conservative Member of the House of Lords, also a participant at COP-26, Glasgow, UK was of the view that the UK position was very clear – Pakistan was a star performer at COP-26. “Malik Amin Aslam, SAPM is extremely well regarded internationally and worked tremendously hard during the event,” Sheikh mentioned the quote of the British MP.\n“I visited the Pakistan pavilion myself, which was by far one of the most active and effective pavilions at the summit. Pakistan can be very proud of the Global Climate leadership their country is taking,” Lord Aamer has said told Sheikh.",
  "retrievedAt": "2025-08-11T21:39:55.388Z"
}
