{
  "title": "Deposits by Overseas Pakistanis in RDAs reach $ 1.5 billion in ten months",
  "link": "https://www.app.com.pk/global/deposits-by-overseas-pakistanis-in-rdas-reach-1-5-billion-in-ten-months/",
  "date_published": "2021-06-25T15:52:00.000Z",
  "source": "APP",
  "content": "OTTAWA, Canada, June 25 (APP): Deposits in Roshan Digital Accounts (RDAs) have reached an impressive figure of US$ 1.5 billion through 165,000 accounts opened in just 10 months by overseas Pakistanis to take advantage of the digital solutions offered under RDAs.\nIt was pointed out during a webinar arranged by Dubai Islamic Bank Pakistan on the theme of ‘Banking Beyond Boundaries with Roshan Digital Accounts’.\nHigh Commissioner for Pakistan to Canada Raza Bashir Tarar described RDAs as a landmark achievement of the government in providing the overseas Pakistanis with excellent digital solutions to invest and participate in the growing economy and socio-economic development of the country.\nDuring the webinar, the participants highlighted key features and benefits of RDA Scheme for the expatriate Pakistanis to stay connected with Pakistan and meet their everyday and lifestyle banking requirements and investment aspirations to participate in Pakistan’s burgeoning economy.\nIn his keynote address, High Commissioner Raza Bashir Tarar noted that Prime Minister Imran Khan had been consistently emphasizing the importance of overseas Pakistanis and their contribution to the economy of Pakistan as well as the vital role their remittances played in the economic development of Pakistan.\nHe lauded the overseas Pakistanis for helping reach Pakistan to an impressive figure of being the sixth largest receiver of foreign remittances.\nHe said the RDA scheme was an excellent way of further optimising the potential of overseas Pakistanis and an unprecedented response to the scheme spoke volume for the trust reposed by overseas Pakistanis in the economic policies of the government.\nThe High Commissioner described the RDAs as a tailormade financial solution designed to facilitate non-resident Pakistanis in remitting their money to Pakistan and the growth of potential was immense in view of nine million Pakistanis residing abroad.\nHe paid rich tributes to the State Bank of Pakistan and other Pakistan banks participating in the Roshan Digital Accounts initiative which was a leap forward in terms of connectivity and the optimum use of IT.\nRaza Bashir Tarar said the RDAs were a reflection of the quality and strength of Pakistan’s banking system and its trustworthiness and it was evident by a great number of accounts that had been opened and a very large sum deposited along with investments in Naya Pakistan Certificate reaching US $770 million.\nHe also lauded the launch of new products such as Roshan Apni Car Scheme and the Roshan SamajiKhidmat for the overseas Pakistanis.\nEarlier, Shahid Ahmed Khan, Honourary Consul General of Pakistan in Boston, Junaid Ahmed, President and CEO of Dubai Islamic Bank Pakistan, Sajid Salman President TCF Canada, SofyanYusufi, GPS Market Offering Leader and Deloitte Risk and Financial Advisory USA and Saleem Aslam, Country Head Pakistan ACCA also addressed the webinar.",
  "retrievedAt": "2025-08-11T20:53:26.852Z"
}
