{
  "title": "Pakistani Americans very close to heart of PM Imran Khan: Qureshi",
  "link": "https://www.app.com.pk/national/pakistani-americans-very-close-to-heart-of-pm-imran-khan-qureshi/",
  "date_published": "2021-06-24T19:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 24 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi on Thursday crediting the Overseas Pakistanis for the record foreign remittances this year said that Pakistani American community was very close to the heart of Prime Minister Imran Khan.\n“Imran Khan even before becoming the Prime Minister had received very encouraging response from the Pakistani Americans during his fundraising campaigns as a common Pakistani,” he added.\nThe Foreign Minister expressed these views during a virtual meeting with elected Pakistani Americans including the members of Pakistani American Council, City Mayors and Deputy Mayors.\nPakistan Ambassador to the United States Asad Majeed also attended the virtual meeting held through video-link.\nThe Foreign Minister felicitated Pakistani Americans over their electoral successes and said that he always felt proud of the successes of Pakistanis in the United States and their contribution for the country and community.\nHe also expressed his pleasure over the fact that a number of Pakistanis in UK were part of the British Parliament and they as well as the Pakistani Americans were raising their voice for the cause of Kashmir.\nThe Foreign Minister apprised the Pakistani Americans of the government’s efforts and intent to give the right of vote to the Overseas Pakistanis and enabling them to play their role in Pakistan’s political system and decision making.\nHe also updated the Pakistani Americans about the government’s achievements on economic front despite the challenges of COVID-19 and dealing with pandemic situation through effective strategy including that of the smart lockdown.\nThe Foreign Minister said that the present government was transforming the center of its foreign policy from geo-political to geo-economics.\nHe also apprised the Pakistani Americans of the government’s measures to facilitate the Overseas Pakistanis in redressal of their problems including through the establishment of PM Portal, FM Portal at Foreign Office as well as the instructions given to Pakistani Missions abroad to hold regular online Kachehris for expatriates.\nThe Foreign Minister further said that elected Pakistani Americans can also play important role in further strengthening bilateral relations between Pakistan and US.",
  "retrievedAt": "2025-08-11T20:53:35.779Z"
}
