{
  "title": "Hydropower development initiative focuses on clean energy transition: Amin",
  "link": "https://www.app.com.pk/national/hydropower-development-initiative-focuses-on-clean-energy-transition-amin/",
  "date_published": "2021-06-25T15:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): Special Assistant to the Prime Minister (SAPM) on Climate Change Malik Amin Aslam has said that Pakistan while being on the frontline of climate change impacts, is facing a huge challenge of preparedness in the face of these rapidly emerging threats.\nThe unprecedented heatwaves and alarming rate of melting glaciers, in addition to unexpected monsoon season, were posing threats at multiple levels currently, he added while speaking at the ‘Clean Energy Transition Summit’ organized by Sustainable Development Policy Institute (SDPI), here on Thursday.\nAslam said, “Pakistan is on the development pathway and thus, we want to maintain that momentum. Ten-billion tree tsunami initiative which not only has generated jobs but also is directly addressing the menace of climate change.”\n“We have made ecosystem restoration a budgetary priority while Hydro-development has been a key focus of our government in addition to pushing for solar power plants as well as establishing wind corridors,” Aslam said and remarked that with local coal, we hope to move to Coal to Liquid or Gas which is much cleaner and pushing for re-commitments to clean energy under the CPEC umbrella.\nChairperson of NA Committee on Food Security and Agriculture Shandana Gulzar Khan said that we need to change the way of doing business and encourage business to make the shift towards the cleaner energy. We also need to evaluate the link between gender, clean energy, and COVID-19, she added.\nDr Abid Qaiyum Suleri, Executive Director, SDPI, during his opening remarks earlier, raised the pertinent question that we need to know how we can make renewable energy fit in the current narrative in a way that it could respond to fiscal restraints and meets the needs of the consumer.\nHe said that the government is making efforts to expand the generation capacity, providing fiscal incentive to use more electricity through reduction of tariffs while trying to roll out a Renewable Energy policy.\n“By 2030, the goal is for 60% of energy to come from clean resources,” Dr Suleri said while adding further that the purpose of this summit is to take one step forward with the government sector, academics, think-tanks, and the private sector. Moreover, a clean and green COVID-19 recovery is a top priority, he added.\nWaqas bin Najib, Member Energy, MoPD&SI, informed the participants that our national energy policy has already been approved and renewable energy has a major role in the policy, which is very encouraging news. As power demand increases, we should be looking at cleaner energy production, he added.\nDanny Kennedy, CEO, New Energy Nexus, while sharing the experience of California, said that we chose renewable energy which has been a huge success for the state and Pakistan may get benefitted from this experience for its transition to clean energy.\nSheeraz Anwar Khan from ADB, was of view that the energy sector in Pakistan has suffered due to poor strategies and with the increased share of renewable energy, the government is hoping to achieve sustainable mix of it at affordable prices.\nFarzana Altaf, DG, Pak-EPA, was of view that Hydro is very familiar to us, but our investments have to be focused to promote this source of energy. Mohammad Faisal Sharif, the energy sector expert, explained that transitioning from fossil fuels to renewable energy is a huge commitment and we are also transitioning our grid from a single buyer to a multi-party system.\nHassan Daud Butt, CEO KP BOI, said that we have around 15 projects worth 22 billion in progress under CPEC, total volume of energy projects is 13-14k Megawatt while we require 17k MW. He said that cleaner energy is imperative but cheaper source of energy is also important and being abundant with indigenous sources.\nMustafa Haider Sayed, Executive Director, Pakistan China Institute, was of view that under CPEC, Coal power plants have been the game changer for meeting Pakistan’s energy needs and have played a significant role in uplifting communities.\nSobiah Becker, Climate Change Advisor, Foreign, Commonwealth and Development Office (FCDO), opined that there is a need to establish development partnerships for energy transitions. She said that political will, awareness, and traditional and non-traditional sources of finance play important role in this regard.\nAmbassador Shafqat Kakakhel was of view that the government has to resolve and stop the use of imported coal. Clean energy policy must be reflected that determine the contribution of Pakistan to achieve sustainable development.\nDr Fatima Khushnud, from Engro Energy opined that we need to be mindful of our financial sustainability prospects while we also need to keep our target consumer tariffs in mind.\nBesides, we need to provide an enabling environment for the private sector to bring captive power back to the grid. Dr Irfan Yousuf, expert in energy sector, said that the government must cut down emissions and introduce Renewable Energy into the sector.\nDr Oliver Knight, Senior Energy Specialist from the World Bank, said that Variable Renewable Energy (VRE) refers to solar and wind and to meet longer term targets, solar and wind plants, and investment in Balochistan would be required in this sector.\nSyed Aqeel Jafari, energy sector expert, highlighted that the limitations we are facing include surplus quantity for a couple of years ahead. Mr Ashruff Hassan Rana, from Bridge Factor, opined that there has to be a reasonable charge/fee paid to the grid to subsidize the electricity which will be higher for the poor.\nDr Sajid Amin, Senior Research Fellow, at SDPI, highlighted that Covid-19 has given us an opportunity to build back better.\nHe said that in addition to social and environmental gains, Renewable Energy provides a strong economic opportunity. However, a fundamental shift in priorities is needed to ensure a green recovery. Moreover, higher investment requirements are necessary for green recovery.\nDeputy Chief Financial Officer China Power Zu Hong, Dr Liaquat Ali Shah, Executive Director Centre of Excellence CPEC, Mr Zarak Khan from State Bank of Pakistan, Ms Kashmala Kaka Khel, Climate Finance Expert, Ms Vardah Malik, Investment Advisor,\nSEED Pakistan, Mr Omar Malik, Director, Shams Power (Private) Limited, Dr Fiaz Ahmad Chaudhry, Professor, Energy Institute, Lahore University of Management Science (LUMS), energy sector expert Asad Mehmood and Dr Hina Aslam of SDPI also shared their views with the participants on different aspects of the topic.",
  "retrievedAt": "2025-08-11T20:53:27.303Z"
}
