{
  "title": "Senate refers 18 bills to standing committees concerned",
  "link": "https://www.app.com.pk/national/senate-refers-18-bills-to-standing-committees-concerned/",
  "date_published": "2021-06-25T09:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): The government on Friday moved 18 bills in the Senate which were referred to the standing committees concerned for further consideration after the House’s approval.\nMinister for Federal Education, Professional Training, National Heritage and Culture Shafqat Mahmood moved the bills, The National Vocational and Technical Training Commission (Amendment) bill, The Hyderabad Institute for Technical and Management Sciences Bill, 2021, The National College of Arts Institute bill, 2021 and The Pakistan Academy of Letters (Amendment) bill, 2021 which were referred to the standing committees concerned.\nMinister of State for Parliamentary Affairs Ali Muhammad Khan on behalf of Minister for Finance and Revenue moved, The Loans for Agricultural, Commercial and Industrial Purposes (Amendment bill, 2021, The Financial Institutions (Secured Transactions) (Amendment) bill, 2021, The SBP Banking Services Corporation (Amendment) bill, 2021, The Companies (Amendment) Bill, 2021 and The Corporate Restructuring Companies (Amendment) bill, 2021.\nThese bills were also referred to the standing committees concerned for further consideration.\nOn behalf of Minister of State for Climate Change Zartaj Gul Wazir, Ali Muhammad Khan also moved the Global change Impact Studies Centre (Amendment) bill, 2021 which was referred to the Standing Committee on Climate Change.\nMinister for Parliamentary Affairs Ali Muhammad Khan also moved the Protection of Communal Properties of Minorities (Amendment) Bill, 2021 on behalf of the Minister for Religious Affairs and Inter-Faith Harmony.\nHe also moved the Islamabad Capital Territory Charities Registration, Regulation and Facilitation bill, 2021 and The COVID-19 (Prevention of Hoarding) bill, 2021 on the behalf of Minister for Interior which was referred to the standing committee concerned.\nOn behalf of Minister for Maritime Affairs, Ali Muhammad Khan moved the Port Qasim Authority (Amendment) bill, 2021, The Pakistan National Shipping Corporation (Amendment) bill, 2021, The Gwadar Port Authority (Amendment) bill, 2021.\nThe minister also moved the Maritime Security Agency (Amendment) bill, 2021 on the behalf of Minister for Defence.\nSenator Mustafa Nawaz Khokhar moved the Al-Karam International Institute Bill, 2021 in the house. All these bills were referred to the Standing committees concerned for further consideration.\nEarlier, Chairman Senate Standing Committee on Power Senator Saifullah Abro presented report of the Committee on the bill further to amend the regulation of generation, transmission and distribution of Electric Power Act, 1997 (The Regulation of Generation, Transmission and Distribution of Electric Power (Amendment) Bill, 2021.\nHe also presented report of the Committee on the Bill further to amend the Islamabad Rent Restriction Ordinance, 2021 (The Islamabad Rent Restriction (Amendment) Bill, 2021.\nEarlier, Leader of the Opposition Yousaf Raza Gillani said that late night lawmakers were informed about the 40 items agenda of the Senate. He said that we required some time to get prepare for the proceedings.\nHe also spoke on the oil tankers strike and demanded that government should talk with protesters to resolve the issue.\nLeader of the House Dr. Shahzad Waseem said that legislation was the actual work of the House. He said that all these agenda items were brought for referring to the relevant committees, adding that it was pending since last four months and we want to start on work on it.\nPakhtoonkhwa Milli Awami Party Senator Sardar Muhammad Shafiq Tareen demanded that the sudden death of the ex- Senator Muhammad Usman Kakar should be probed.\nLeader of the House Dr. Shahzad Waseem said that Usman Kakar was our honourable colleague. He also condoled with Shafiq Tareen on the sad demise of Usman Kakar. He said that Senate has debated on the death of Usman Kakar and also passed a condolence resolution.\nMinister for Railways Azam Khan Swati said that this was very sensitive issue, adding that government would provide all resources and cooperation for the satisfaction of the late Usman Kakar family in this regard.",
  "retrievedAt": "2025-08-11T20:53:32.245Z"
}
