{
  "title": "Govt actively pursuing CPEC projects: Hammad Azhar",
  "link": "https://www.app.com.pk/national/govt-actively-pursuing-cpec-projects-hammad-azhar/",
  "date_published": "2021-06-25T10:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 25 (APP): Minister for Energy Hammad Azhar has said the present government has been actively pursuing China Pakistan Economic Corridor (CPEC) Projects for early their completion.\nAddressing at virtual inauguration of high-power Testing of ± 660kV Matiari-Lahore HVDC Transmission Line project being witnessed simultaneously in Pakistan and China here Friday, the minister said CPEC was of utmost importance for Pakistan as it would enable the country to enhance industrial production, upgrade energy and communication infrastructure and improve connectivity within the region.\nThe CPEC has generated number of employments and investment opportunities in Pakistan and beyond, he said.\nThe minister said the government was committed to providing basic necessities to the masses through its power projects.\nThe government has performed well in last 3 years and it has attained various projects on different fronts, he said.\nHammad said the government has also worked to improve electricity transmission system in the country and a record 24,633 MW power was transmitted in current month through its national power system.\nHe said Matiari Lahore HVDC project was now successfully starting of high power transmission.\nHe appreciated the hard work of NTDC Management, PPIB, PMLTC and State Grid Corporation of China for making the project a huge success.\nHe said the friendship between Pakistan and China was spanned over seven decades started in 1951 when the first high level official delegation visited China.\n“We have also celebrated the 70th anniversary of diplomatic ties between China and Pakistan recently. The friendship between the two countries is expanded in different sectors like education, power sector, tourism, trade, defense, health along with CPEC projects,” he observed.\nHe said the ± 660kV HVDC transmission line was a new technology in our current AC transmission infrastructure.\nThe transmission line would evacuate power from power plants located in Sindh to the North load centers. Thus, bringing stability in the power system and enhancing the transmission capability to overcome the power crisis in Pakistan. He said the project was continued despite the pandemic and was successfully completed. The project would bring relief to the consumers, he said.\nSpeaking on the occasion Chinese Ambassador to Pakistan, Nong Rong congratulated NTDC Pakistan and State Grid Corporation of China for the successful completion of high power test for Matiari-Lahore HVDC Project.\nHe also expressed sincere gratitude to the Ministry of Energy , CPEC Authority,NEPRA and China National Energy Administration for the unremitting support and convenience provided.\n“Matiari-Lahore HVDC Project is the only power transmission project in the CPEC priority list, as well as the first HVDC transmission project in Pakistan, devoting itself to address the bottleneck of electricity transmission from south to north and upgrading the layout of Pakistan national grid, “ he said.\nHe said over 1,300 Chinese engineers and technicians along with 6500 Pakistani workers overcame the impact of the pandemic and intensively worked together. They successfully implemented low-power test and High-power test, and smoothly made it into the new phase of High-power trial run operation in spite of the difficulties and obstacles, presenting us a good interpretation of China speed in Pakistan, the ambassador said.\nHe said up to now, CPEC has attained $25.4 billion investment in Pakistan, which increases for Pakistan as much as 5,200 MW of installed power generation capacity, 886,000 meters of national power transmission line, 510 kilometers of highway, and 75,000 jobs created while in the peak time of construction.\nHe said, “ due to its tremendous contributions to the Pakistan’s economic and social development, CPEC gains widespread praises from the whole society of Pakistan and attracts extensive attention from international community as well”.\nHe said at present, CPEC moved up to the new phase of high quality development, focusing on industry, agriculture and livelihood cooperation.\n“As we know, stable power supply is the foundation of industrialization and industrial cooperation. For that purpose, the project, under the strong guidance and leadership of China National Energy Administration and State Grid, is supposed to well operated and maintained, functioning as the main artery to transmit the power from south to north, and be gradually adapted to localization” he said.\nHe expressed the hope the Matiari-Lahore Transmission Company could make further study with the Pakistani counterpart on how to deepen and expand the power transmission cooperation to meet the demand of the local economy and community, making more contribution to the high quality development of CPEC.\nHe said the year of 2021 marked the 70th anniversary of establishment of diplomatic relationship between China and Pakistan. Over the past 70 years, no matter how the international landscape, regional situation and domestic situation of the two countries changed, the two sides have always trusted and supported each other, and the bilateral relationship becomes a model with different social systems, different historic background, he said.\nAmbassador said China was willing to work closely with Pakistan to well implement the consensus reached by leaders of two countries, and continuously advance the progress of CPEC, enriching the all-weather strategic partnership and building a closer China-Pakistan community with a shared future in new era.\nSpeaking on the occasion, MD NTDC Muhammad Ayub said low testing of the transmission line had already been conducted during which 800 MW and 2200 MW electricity was successfully transmitted.\nHe said it was a great achievement for both China and Pakistan and the project would bring stability in transmission system.\nHe said the commercial date of operation of the project was September 1, 2021.\nHe said the total length of the transmission was 886 km with the transmission capacity of 4400 MW.\nCEO Pak Matiari-Lahore Transmission Company Wang Bo and other also spokes on the occasion.\nThe ceremony was also attended by Chairman NEPRA Tauseef H Farooqi, Chairman CPEC Authority Lt Gen ( R) Asim Saleem Bajwa, Secretary Power Division Ali Raza Bhutta, MD PPIB Shah Jahan Mirza, the CEO PMLTC, Chairman CET China while Chinese senior officials also participated through Video link from China.",
  "retrievedAt": "2025-08-11T20:53:32.261Z"
}
