{
  "title": "DISCOs, KE deliberately committed malpractices to coverup inefficiencies: NEPRA",
  "link": "https://www.app.com.pk/national/discos-ke-deliberately-committed-malpractices-to-coverup-inefficiencies-nepra/",
  "date_published": "2023-12-04T15:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 04 (APP):National Electric Power Regulatory Authority (NEPRA) while issuing an inquiry report into the over-billing matter of all power distribution companies (DISCOs) including K-Electric on Monday said that distribution companies have been deliberately committing malpractices to cover up their inefficiencies, which has led to wrong and excessive billing to thousands of consumers, especially domestic.\nDISCOs also failed to collect electricity bills as per tariff terms and conditions approved by the authority, according to the report issued by NEPRA here. The report said that the companies sent false detection bills to the customers in violation of provisions of the consumer service manual.\nThe NEPRA had constituted an investigation team comprising three senior officers after receiving a large number of complaints from the consumers against DISCOs and KE for over-billing and wrong meter readings in the monthly bills for July and August 2023.\nThe committee scrutinized the consumer complaints and visited the offices of the concerned DISCOs to submit a comprehensive report to the authority. It further said. Million of consumers suffered due to an over 30-day billing period cycle, the report said. The DISCOs sent average billing to the consumers without meter readings and printing photo snaps on the bills besides the timely replacement of faulting meters. The authority has decided to take legal action against DISCOs, including K Electric, in light of the report.\nThe authority has given a 30-day deadline to DISCOs to replace the faulty meters as soon as possible and correct the wrongly charged bills, failing which strict legal action would be taken, said a statement issued by NEPRA. The authority also served notices on DISCOs and K-E seeking explanation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:50:38.213Z"
}
