{
  "title": "Saudi Arabia seeks closer ties with Pakistani private media for collaborative ventures: Dr. Al-Otaibi",
  "link": "https://www.app.com.pk/national/saudi-arabia-seeks-closer-ties-with-pakistani-private-media-for-collaborative-ventures-dr-al-otaibi/",
  "date_published": "2023-12-04T07:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 4 (APP):Saudi Press Attaché Dr. Naif Al-Otaibi on Monday conveyed Saudi Arabia’s eagerness to foster increased cooperation with private broadcasters in Pakistan in a bid to strengthen bilateral ties in the realm of media.\nBriefing the media persons underscoring the significance of this development, he said, “We aspire to see a deepening of collaboration between private media institutions in Saudi Arabia and Pakistan. Such cooperation holds immense importance as both nations share a mutual interest in each other’s content.”\nThe press attaché emphasized the people’s desire in both countries to engage with the cultural offerings, particularly dramas and films, from Pakistan and Saudi Arabia. He said this collaboration aimed to meet this demand by facilitating the exchange of content between the media entities of the two nations.\n“We envision a future where the exchange of films and productions between Saudi Arabia and Pakistan is increased. This will not only strengthen cultural ties but also provide an opportunity for both countries to showcase their rich histories and traditions through each other’s media platforms,” Dr. Al-Otaibi explained.\nExpressing specific desires for collaboration, he said, “Saudi Arabia wants to publish content in Pakistan that contributes to enhancing the relationship between the two brotherly nations. Additionally, it wants to feature content that aligns with Saudi Vision 2030, offering benefits to the Muslim Ummah and Arab countries.”\nDr. Al-Otaibi informed that the Saudi Arabia extended invitations to Pakistani media institutions and journalists to cover significant events and conferences including pivotal gatherings during the Hajj season, national day celebrations, and political summits etcetera hosted in various cities in the Kingdom.\nHighlighting the strides made in Saudi Arabia’s media sector, he shared information about the establishment of a state-of-the-art studio covering 6,000 square meters in Riyadh. Furthermore, he said a new institution with extensive archives of visual and audio content had been created, catering to the needs of documentary makers and media professionals.\nAs part of future plans, Dr. Al-Otaibi announced the upcoming Saudi Media Forum scheduled for February 2024 in Riyadh adding that this forum would bring together media professionals from around the world to discuss and exchange ideas on the evolving landscape of media.\nHe further said efforts were underway to complete the transition of prominent Saudi television channels, including Al Hadath and Al Arabiya, from Dubai to Riyadh as this move would streamline operations and contribute to the continuous growth of the Saudi media industry.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:51:28.435Z"
}
