{
  "title": "FGRF hands over keys of houses built for Kalam’s flood victims",
  "link": "https://www.app.com.pk/national/fgrf-hands-over-keys-of-houses-built-for-kalams-flood-victims/",
  "date_published": "2023-12-04T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 04 (APP):The Faizan Global Relief Foundation of Dawat-e-Islami (FGRF) on Monday handed over the keys of the houses built for the flood victims of Kalam that got affected during the disastrous floods of 2022.\nBy this time, FGRF-Dawat-e-Islami had built around 5,000 houses and handed them over to the flood victims across Pakistan, the FGRF spokesperson told APP while sharing relief updates in flood-hit areas.\nIt may be recalled that in the 2022 floods, several houses were also destroyed in Kalam and people were in a dilapidated state.\nThe FGRF provided ration, shelter and other supplies to the victims and also took responsibility for the construction of damaged houses and also built houses for them.\nIn this regard, a function was also organized in Kalam. DSP Circle Madin, Habibullah, AC Bahrain, former Tehsil Nazim, Habibullah Saqib, SHO Kalam and FGRF Supervisory Majlis member Haji Shifaat Attari, provincial officials Salim Attari along with division and district officials were present in the ceremony.\nA large number of officials of Dawat-e-Islami participated along with the guests who later spoke to the media about the keys handing over to the victims.\nThe victims told the media that they thank the FGRF for this initiative. “FGRF supported us even during the flood days and provided rations, mattresses, beds and necessities of life and sent hundreds of truckloads of rations to our areas of Bahrain, Madin and Kalam. And today we are very grateful to Dawat-e-Islami for making houses for those whose houses were destroyed in this flood,” they said.\nThe spokesperson of FGRF said, “We have not forgotten the Muslims who are in trouble and the construction of more houses is going on.”\nAt the end of the program, FGRF also distributed rations to the victims.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:50:53.377Z"
}
