{
  "title": "LESCO detects 125 power pilferers in 24 hours",
  "link": "https://www.app.com.pk/national/lesco-detects-125-power-pilferers-in-24-hours/",
  "date_published": "2023-12-04T14:38:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 04 (APP):The Lahore Electric Supply Company (LESCO) has detected a total of 125 connections from where customers were pilfering electricity in all its circles of five districts (Lahore, Sheikhupura, Nankana Sahib, Kasur and Okara) on the 86th day of grand anti-power theft campaign.\nThe LESCO spokesman told media here Monday that the company has also submitted FIR applications against 125 electricity thieves, out of which 65 FIRs have been registered in respective police stations, while two accused have been arrested. Grand anti-power theft operations against electricity thieves are being conducted on the directives of the Federal Power Division and the LESCO Chief Executive Officer (CEO) Engineer Shahid Haider is supervising these operations.\nThe LESCO chief vowed that the operations would continue without discrimination until the complete end of electricity theft. The electricity pilferers as well as the LESCO officers and employees who facilitate them are also being brought to justice. On the 86th consecutive day of the anti-power theft campaign, the spokesman added, large commercial consumers were also found involved in electricity theft and all of them were also disconnected and charged with detection units. Among the seized connections 4 were commercial and 121 domestic, and all these connections were disconnected and charged with a total of 123,100 units as detection bill amounting to Rs 5.152 million.Apprising the media about some major power pilferers, he explained that LESCO charged 24,000 detection units to an electricity pilferer in Bhaati Gate area; 7,605 detection units to a customer stealing electricity also in Bhaati Gate area; 7,605 detection to a power thief in area of Chah Miran; and 7,000 detection units to a power thief in Data Nagar area. During the 86 days of grand anti-theft campaign, the spokesman mentioned, the LESCO detected pilferage on 32,505 power connections and submitted 32,122 FIR applications against electricity thieves in the relevant police stations out of which 31,128 FIRs have been registered, while 15,420 accused have so far been arrested by the police. The LESCO has so far charged a total of 54,741,728 detection units worth Rs 2,146,418,299 to all the power pilferers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:50:53.487Z"
}
