{
  "title": "President stresses upon attitudinal change as key to growth of any sector in economy",
  "link": "https://www.app.com.pk/national/president-stresses-upon-attitudinal-change-as-key-to-growth-of-any-sector-in-economy/",
  "date_published": "2023-12-04T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 04 (APP): President Dr Arif Alvi on Monday emphasized that attitudinal change in any sector of the economy could lead to its growth and development including the production and export of world famed Pakistani indigenous Basmati rice.\nThe president, elaborating his viewpoint, said that technological and scientific research and inputs would pave way for the latest innovations in the agriculture sector and the rice exporters should utilize all available tools to enhance their yield by supplementing the country’s exports.\nHe was addressing the Biryani Festival and presenting of REAP journal organized by the Rice Exporters Association of Pakistan (REAP) at the Aiwan-e-Sadr. The event was attended by the REAP office bearers, members of the diplomatic corps, exporters, traders and mediapersons.\nThe president underlined the need for inclusion and encouragement of women in the agriculture sector as the country was looking towards such initiatives, leading to further women empowerment. “With such changes in attitude, they can stimulate changes in the country’s economy,” he added.\nThe president said that with proper scientific tools and knowledge, Pakistan could attain food autarky and cited Netherlands that was 19 percent smaller than Pakistan in size but had become the second largest food exporter in the world owing to usage of latest technology and research.\nAppreciating the role of REAP in boosting country’s exports and the national economy, the president said that with organizing of festivals and road shows in different countries, they were providing huge business opportunities to the local Basmati rice growers and exporters.\nHe also suggested for exploring the organic cultivation of rice crop as the world including Pakistan were facing water scarcity.\nHe opined that if the world resources were properly utilized, about 7 billion world’s population could be fed properly and regretted that along with the global trade, the exploitation of population and accumulation of wealth also continued.\nHe said that hoarding of food stuff was also a reason which led to food crises and it could be ended if priorities across the globe were set, adding that only $1 trillion could be suffice to address the food scarcity in the world.\nContrary to it, the Islamic teachings had made the wealth a source for channeling the uplift of entire community, leading to well being of the human beings, he added.\nThe president also stressed upon measures to water conservation in the agri-sector, particularly during the rice cultivation as it was a water intensive crop.\nBesides, value addition products based upon rice crop, the exporters could increase Basmati outreach to different parts of the world, he said, and lauded REAP for projecting the soft image of Pakistan and promoting their culture, industry and livelihood.\nHe said that certain things in the agriculture sector were possible and doable and expressed the optimism that the country would soon rise economically.\nEarlier, Chairman REAP, Chela Ram Kelwani, in his address, highlighted the contribution of the association in the country’s exports. He said that country’s Basmati was renowned worldwide due to its aroma, quality and taste.\nHe apprised that they had arranged rice festivals in 14 countries so far, while Mexico and Russia were the latest rice export destinations for REAP.\nConvener of REAP Abdul Rahim Janoo, said that with strenuous efforts, the rice export had jumped from $300 million to $3 billion and if they were given further incentives, it could surpass $5 billion annually.\nOn the occasion, the president also gave away medals among the recipients to recognize the contributions of REAP.",
  "retrievedAt": "2025-08-11T10:50:09.440Z"
}
