{
  "title": "Senate Chairman congratulates nation on the occasion of Eid-ul-Fitr",
  "link": "https://www.app.com.pk/national/senate-chairman-congratulates-nation-on-the-occasion-of-eid-ul-fitr/",
  "date_published": "2022-05-02T10:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 2 (APP): Senate Chairman Muhammad Sadiq Sanjrani congratulated the Muslims around the world and especially Pakistanis on the blessed and happy occasion of Eid-ul-Fitr, saying worships offered during the month of Ramadan brought piety, discipline and patience in a nation.\nThe month of Ramadan was a great gift from Allah Almighty for the Muslims, as Allah accepts the prayers and supplications of all Muslims packed with enormous blessings and rewards for the life hereafter. Eid-ul-Fitr was the day of completion of the holy month of Ramadan, a day of divine mercy and thanksgiving.\nThe infinite blessings and mercy of Allah Almighty required that the Muslims enlightened their lives in the light of the commands of the Almighty because this was the only path by which they can achieve success in this world and the life hereafter.\nMuhammad Sadiq Sanjrani said that while celebrating Eid, Muslims should not forget to share the joy and happiness of this blessed occasion with their loved ones, neighbors and needy relatives as this was the real spirit and essence of this holy day.\nThe Senate Chairman said that Eid-ul-Fitr taught to share happiness with peace and love and we have to adopt a joint strategy to make the country a cradle of peace.\nHe said that Eid-ul-Fitr was an important day for the Muslim world. Pakistanis have to pledge to work together for the development and prosperity of the country so that the problems facing the country could be solved together. The problems of the Muslim Ummah were common and their solution was a common strategy, he added.\nOn the occasion of Eid-ul-Fitr, we have to forget our differences and move forward for the development and prosperity of the country.\nDeputy Chairman Senate Mirza Muhammad Afridi also congratulated the nation on the auspicious occasion of Eid-ul-Fitr and prayed to Allah Almighty to accept the prayers of all Muslims in the month of Ramadan.",
  "retrievedAt": "2025-08-11T14:48:27.613Z"
}
