{
  "title": "PM directs free medical treatment to 50pc patients at PKLI",
  "link": "https://www.app.com.pk/national/pm-directs-free-medical-treatment-to-50pc-patients-at-pkli/",
  "date_published": "2022-05-02T09:20:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 2 (APP): Prime Minister Shehbaz Sharif Monday directed the authorities concerned to provide free medical treatment to at least fifty percent of the patients at Pakistan Kidney and Liver Institute (PKLI) and called for providing the facilities of international standards to the people.\nThe prime minister, chairing a review meeting to discuss the matters pertaining to the PKLI, was told that the PKLI had carried out 290 kidney transplants and 190 liver transplants last year. Out of those, only 17% were provided free medical treatment, it was told.\nThe prime minister was given a briefing on the administrative affairs of the Institute as well as a Nursing University project.\nThe prime minister was dismayed over the negligence in the completion of the PKLI project.\nHe said the PKLI was meant to provide free transplant services to the poor people from across the country so that they would not have to travel abroad for their treatment.\nWhile calling for converting PKLI into a Trust, the prime minister instructed the Punjab Chief Secretary to furnish a strategy within three days to make the Institute financially independent. No patients should be deprived of medical treatment just due to the financial reasons, he directed.\nHe observed that the poor people had to face difficulties to avail quality healthcare and added that the provision of free quality health facilities was among his government’s priorities.\nThe prime minister called for changing the mindset of ignoring the poor people and instructed to keep their service among top priorities.\nHe also instructed for early completion of the Nursing University project and outsourcing the sanitary services, if needed, in order to ensure the cleanliness of the hospital at par with international standards.\nKhawaja Salman Rafiq, Khawaja Imran Nazir, Punjab Chief Secretary, Punjab Health Secretary, relevant senior officials and management of the PKLI attended the meeting.",
  "retrievedAt": "2025-08-11T14:48:29.110Z"
}
