{
  "title": "Anti-corruption investigations to be launched against Buzdar: Tarar",
  "link": "https://www.app.com.pk/national/anti-corruption-investigations-to-be-launched-against-buzdar-tarar/",
  "date_published": "2022-05-16T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): Pakistan Muslim League-Nawaz (PML-N) leader Atta Tarar Monday hinted at launching investigations against former chief minister Usman Bazdar and others for building assets beyond their income in last three and half years.\nAddressing a press conference in Islamabad, Tarar said the PML-N has decided will file a petition against Usman Bazdar and others in Punjab Anti-Corruption. “Usman Buzdar made assets worth Rs10 billion during his tenure as the chief minister of Punjab. He deprived the poor masses of their rights and exploited the national resources,” claimed Tarar.\nDuring the last four years, Pakistan Tehreek-e-Insaf (PTI) ruthlessly plundered the country’s wealth while its chairman had been facilitating the plunders in his party including Buzar, and Farah Gogi and company.\nIn fact, the PML-N leader said, Buzdar was appointed by Imran Khan so that he could bring in more money through illegal means. Buzdar, after becoming the chief minister, made assets worth Rs270 million in Taunsa alone by purchasing 5500 Kanal land against Rs 5 billion.\nAtta Tarar also said that PML-N would unearth the nexus between Imran Khan, Usman Buzdar, Bushra Bibi, and Farha Gogi, who had been laundering public money during the PTI tenure.\nThe PML-N leader further said that Farah Gogi looted the people of Punjab for three years while Imran Khan benefited her with Rs320 million through the Tax Amnesty Scheme 2019. “Farah also minted millions of rupees through transfer postings. In fact, she had been ruling Punjab through Bani Gala.”\n“Imran Khan helped Farah Gogi and her husband escape the country, and all this was done to avoid investigation, however, they would have to face the law for exploiting the public money,” Tarar said.",
  "retrievedAt": "2025-08-11T14:54:38.736Z"
}
