{
  "title": "PM sets National Task Force to tackle severe heatwave, GLOFs: Sherry",
  "link": "https://www.app.com.pk/national/pm-sets-national-task-force-to-tackle-severe-heatwave-glofs-sherry/",
  "date_published": "2022-05-16T12:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Monday said the Prime Minister in an important development has formulated a National Task Force to stir disaster management efforts to tackle severe heatwave and GLOF events.\nAddressing a joint press conference flanked by Chairman National Disaster Management Authority (NDMA) Lieutenant General Akhter Nawaz Satti and Additional Secretary Ministry of Climate Change Jodat Ayaz, she said the maiden meeting of the Task Force has been convened by the Prime Minister in the evening to be participated by all the provinces.\nSenator Rehman said the meeting of the Task Force would decide to take measures against heatwave. “The heatwave has spiked-up and gained longevity in its span. The glaciers in the north are melting rapidly because of prolonged and extreme temperature spike.\nShe added that the task force would comprise of relevant chief secretaries, federal and provincial ministries and departments.\nThe Minister said the growing environmental degradation has emerged as an existential threat to the country and it demanded a whole of nation approach.\n“Pakistan has seen 152 extreme weather events in the past 20 years and the UN put Pakistan among the top 23 most drought hit countries and is among the top ten affected countries due to climate change”, she added.\nSenator Rehman underlined that Pakistan was mostly affected due to regional greenhouse gas emissions (GHGs) whereas it also needed a local response and measures as well to ensure mitigation and adaptation to climate change.\n“The international conferences like COPs are important to drive efforts to address climate change. Pakistan has less than one percent GHG emissions but the developed world has neglected the country despite its increased burden of natural disasters”.\nShe added that it was not only the matter of water scarcity or temperature rise rather the heatwave would impact Sindh’s agriculture which made the country’s half food basket.\n“We have established over 1,000 heatwave centers each in Sindh and Punjab and it’s meeting is being chaired by Secretary Ministry of Climate Change (MoCC).\nHeatwave will have serious impacts on masses and our early communication can help save lives”, she added.\nThe Met office has indicated a prolonged heatwave till June, she said adding that the Ministry was also issuing advisories to the provinces in this regard.\n“Awareness is must and we will have to make communication on behaviour change which is need of the hour”.\nShe added that the Ministry lacked any communication strategy and was under staff. The Ten Billion Tree Tsunami Plantation project has raised many apprehensions of the stakeholders and a probe would launched to ensure transparency which was the only project of the Ministry under the previous regime.\n“Pakistan is the third most water stress country in the world and its status is shifting from water stress to water scarce nation that will have huge impact on the country”.\nA recent glacial lake outburst flood (GLOF) incident occurred due to the melting of glacial lake formed at Shisper Glacier that partially damaged the Karakoram Highway (KKH), she said.\n“There are 30-31 potential lakes to outburst out of 3044 total serious glacial lakes.”Climate Change Council was not convened for the past four years which was a crucial forum with the representation of the provinces, she added.\n“Pakistan has first time entered into summers without any spring season. If we may take preparedness measures then it will occur again in the next year due to global warming.”\nChipping in the media conference, Additional Secretary MoCC Jodat Ayaz said the climate science was considered in Pakistan as a matter of decades to come, adding, “the scientific models predicted for 2030 have started activating 10 years prior to the projected timelines”.\nChairman NDMA Lieutenant General Akhtar Nawaz Satti said the GLOF and other events have occurred in advance like the rest of the world due to global warming.\n“Met Office despite financial constraints have been issuing advanced updates and advisories on weather. It is a positive sign despite all limitations”, he mentioned.\nShisper glacier was formed in 2018 which is a surging glacier whereas in 2021 in February along with Chief Secretary Gilgit Baltistan visited on site to observe the situation, he added.\n“We received the first warning for GLOF at Shisper on 16th March. The GBDMA and DDMA Hunza are the core bodies to manage mitigation measures. If there is no life and livestock losses reported it is mainly due to the early warning and preparedness measures”, he added.\nAs many as nine houses were permanently damaged, 6 partially destroyed alongwith a bridge and two hydel power projects completely damaged in the region, he said.",
  "retrievedAt": "2025-08-11T14:54:40.113Z"
}
