{
  "title": "IWMB successfully rehabilitates four black bear cubs at Wildlife Centre: Rina",
  "link": "https://www.app.com.pk/national/iwmb-successfully-rehabilitates-four-black-bear-cubs-at-wildlife-centre-rina/",
  "date_published": "2022-05-16T09:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): Islamabad Wildlife Management Board (IWMB) has successfully rescued and rehabilitated four cubs of excessively poached Black Bears from various locations where the threatened baby bears were looked after by expert and trained caretakers of the Board.\nThe journey of rescue and rehabilitation of black bears started back in 2021 when two animal lovers from Rawalpindi recovered a three-month old cub and handed over to the Board, told APP Chairperson IWMB Rina Saeed Khan while sharing the animal rehabilitation endeavours done by the Board.\nKhan said the poor cubs showed the unheard story of illegal hunting and poaching of Black Bears found in the forest mountains of Gilgit Baltistan (GB), Azad Jammu and Kashmir (AJK) and Khyber Pakhtunkhwa (KP).\nShe said two staffers of the IWMB Gibran and Raja Anees were sent to Jordan’s Al-Mawa Bear Sanctuary for training on handling bears during the relocation of two Himalayan Bears along with the elephant Kavaan sent to Cambodia.\nShe added that Daboo was recovered in a bag with his ears ripped by the poacher and might have perished in that condition if the wildlife lovers did not rescue him and brought to the IWMB rehabilitation centre.\nThe Board after the closure of the Marghazar Zoo had decided to establish a animal rescue and rehabilitation centre that was still on the cards awaiting the government’s funding, she said.\nDaboo, she said was not able to be released into the wild as it had developed close association with the humans due to extreme care and look after by the Board staff.\nLater, she said one baby bear Baloo was rescued from a Bear Dancer in Gujranwala and the IWMB requested the Punjab Wildlife Department to hand it over to the Board for better care. “The Punjab Wildlife Department after seeing the Board’s efforts and work gave another baby bear Ladu of 2 to 2.5 years old that was in a seriously depressed mental condition and needed urgent attention”.\nShe informed that the Board has established a special enclosure for the Bears that had swings, shade, climbing bars and a pool for their entertainment and exercise for good health.\n“Baloo and Ladu has no teeth as they were used for dancing that made them more vulnerable to be left into the wild or among the adult bears”, she added.\nKhan informed that the Board had also received another baby bear Makra which was recovered by the AJK Forest Department in an abandoned condition.\nThe Board approached the AJK Forest Department to handover Makra as it had a proper enclosure and trained staff to look after the cubs well, she added.\nTo a question, she said the diet of the bears included Vitamin B mixed with food, milk, honey, seasonal fruits, chickpeas, flat breads, wholegrain flour breads, watermelons, kachnar leaves, and their most favourite sugarcane.\nShe underlined that bear batting was a serious issues and causing decline in the number of the bear species, adding, black bears, monkeys, and pangolin were one of the most poached animals in the country.\nEarlier, the IWMB Chairperson tweeted, “Little Makra exploring his older brothers pond while enclosure is being cleaned! When Makra is bigger (at least 25 kg) we can put him in same enclosure as Daboo & Baloo. We are also supplying ice blocks in this sweltering heat to our 4 rescued black bears!”",
  "retrievedAt": "2025-08-11T14:54:43.127Z"
}
