{
  "title": "PM sets up task force on climate change amid heatwave, glacier melting",
  "link": "https://www.app.com.pk/national/pm-sets-up-task-force-on-climate-change-amid-heatwave-glacier-melting/",
  "date_published": "2022-05-16T08:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): Prime Minister Shehbaz Sharif on Monday set up a task force on climate change in view of the country currently facing heatwave and melting of glaciers.\nThe task force included relevant federal ministers, secretaries, provincial chief secretaries, and relevant provincial secretaries, Chairman National Disaster Management Authority (NDMA) and senior officials of other agencies.\nThe task force will develop a comprehensive strategy to mitigate the effects of climate change in the country and prevent incidents such as the glacier incident in Hunza.\nChairing a high-level emergency meeting on the recent heatwave and the effects of climate change, the prime minister directed to take measures to prevent food and water shortages, and to conserve water and forests.\nThe meeting was attended by Federal Ministers Syed Khurshid Shah, Sherry Rehman, Ehsas-ur-Rehman Mazari, Tariq Bashir Cheema, Maryam Aurangzeb, Chairman NDMA Lieutenant General Akhtar Nawaz and officials of relevant agencies. Participation through video link of Federal Minister for Education Rana Tanveer Hussain and Provincial Secretaries.\nPM Sharif directed to take immediate steps in this regard and present a report in the next meeting.\nThe meeting was informed that climate change was the main reason for the intense heat wave and Pakistan was the fifth most vulnerable country in the world in terms of climate change.\nIt was pointed out that Pakistan, despite having large reserves of glaciers, was also at risk of water scarcity which could have a direct impact on the country’s agriculture.\nThe prime minister directed to formulate a comprehensive strategy in this regard on an emergency basis and also stressed the launch of a public awareness campaign for water conservation.\nHe called for immediate measures to ensure store rainwater before the next monsoon.\nThe prime minister was also briefed on the water shortage in Cholistan, to which he directed an immediate supply of water for human settlements and animals.\nHe directed to ensure immediate relief activities in the recent heatwave in Cholistan by the district administration and relevant agencies.\nPM Sharif directed the Chairman NDMA to visit Hunza immediately and also stressed reconstruction of the bridge that collapsed during the glacier-melting.\nThe prime minister also sought a detailed report in the next meeting regarding the progress of the construction of the bridge.\nPM Sharif also directed the Ministry of Education to implement SOPs to prevent the recent heatwave in government schools and to issue orders to private schools to implement them.\nHe directed the Ministry of Health to immediately submit a detailed report on the research and possible effects of the new sub-variant of COVID-19.",
  "retrievedAt": "2025-08-11T14:54:44.398Z"
}
