{
  "title": "Time for State Institutions to keep national interest supreme: PM",
  "link": "https://www.app.com.pk/national/time-for-state-institutions-to-keep-national-interest-supreme-pm/",
  "date_published": "2023-04-20T07:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP): Prime Minister Shehbaz Sharif on Thursday said it was time for the State institutions to get united for upholding the Constitution and keeping the national interest supreme.\nAddressing at the launch of the 1973 Constitution mobile application, he said Pakistan was currently at the crossroads of constitutional challenges, which required a sense of wholeness to be demonstrated by the State institutions.\nIn connection with the golden jubilee of the country’s constitution 1973, the mobile application has been developed by the Ministry of Information and Broadcasting under the leadership of Minister Marriyum Aurangzeb in collaboration with National Database and Registration Authority (NADRA). The application will act as a digital source to help raise awareness among the general public about the 1973 Constitution.\nShehbaz Sharif said the Constitution had its roots in the parliament, adding that according to the world-recognized concept, the judiciary can only interpret the law, but cannot re-write it.\n“It does not happen any where in the world that a court issues a stay order against a legislation which is still in the making,” he said.\nHe urged the judiciary to reassess its role and become the protector of the Constitution.\nThe prime minister said the 1973 Constitution was the result of the hard toil of the politicians from all backgrounds, who arrived at a consensus in formulation of the sacred document.\nHe recalled that veteran politicians of their times including Zulfikar Ali Bhutto, Mufti Mehmood, Khan Abdul Wali Khan and several others rose above their political differences to write a constitution that acted as a binding force for the federation.\nHe said although politicians made mistakes in the past, but it was the time to rectify them.\n“We have indeed learned a lesson and we are making efforts to take Pakistan out of these problems,” he said. “Great people learn from their mistakes and hold the national interest high.”\nHe said the government took over in difficult time, however, said that it would not hesitate in protecting the State and the Constitution.\nPM Sharif said on the eve of the 50th anniversary, the decision to include 1973 Constitution in the syllabus at schools and college levels was remarkable in raising awareness about its sanctity.\nHe expressed the hope that the young generation would learn about the Constitution and healthy academics debates would be held at educational institutions.\nThe prime minister felicitated the parliamentarians, Speaker National Assembly Raja Pervez Ashraf, Information Minister Marriyum Aurangzeb, Interior Minister Rana Sanaullah and NADRA on the launch of the Constitution 1973 mobile application.",
  "retrievedAt": "2025-08-11T08:20:56.701Z"
}
