{
  "title": "“Talk with Taikonauts of Shenzhou-15 held at Chinese embassy",
  "link": "https://www.app.com.pk/national/talk-with-taikonauts-of-shenzhou-15-held-at-chinese-embassy/",
  "date_published": "2023-04-20T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 20 (APP):”Talk with Taikonauts of Shenzhou-15″ was held here on Thursday to enhance the understanding of young people in the Shanghai Cooperation Organisation (SCO) member countries in the field of astronautical science, and technology.\nThe Good-Neighborliness, Friendship, and Cooperation Commission (GNFCC) of the SCO, China Manned Space Agency, All-China Youth Federation, China Soong Ching Ling Foundation, and the secretariat of the SCO Youth Committee co-hosted an event at the Chinese embassy in Islamabad, said a news release.\nPang Chunxue, Charge d’Affaires of the Chinese Embassy, Shahid Mahmood Baig, Chairman of Pakistan Science Foundation, Asif Farhat, Founder of the Institute of Peace and Diplomatic Studies, members from the Institute of Space Technology and many young Pakistani students from different schools attended the event.\nAliza Jamil, a student of Class 8, from Islamabad Model College for Girls, interacted with the Chinese astronaut. He also asked about how to breathe in space. the astronaut gave a very comprehensive response from space.\nThe “Talk with Taikonauts of Shenzhou-15” event is significant for broadening the youths’ horizons and lighting up their dreams about exploring the mysterious and diverse universe.\nYouths are young ambassadors of China-Pakistan friendship and the hope of our two countries, the iron-clad relationship needed to be passed from generation to generation.\nThis year is the tenth anniversary of the Belt and Road Initiative (BRI) and China-Pakistan Economic Corridor (CPEC), and Science & Technology (S&T) cooperation is an important part of it, and will surely provide strong support to the high-quality and sustainable development of CPEC.\nCooperation in science and technology between China and Pakistan has achieved several remarkable accomplishments, including the Pakistani medicine seeds returning from the Chinese space station after experimentation.\nChina’s development and Chinese modernization will create more opportunities for Pakistan and the world.",
  "retrievedAt": "2025-08-11T08:21:02.958Z"
}
