{
  "article_id": "2025-03-28_99e41052c6e57715b5f18fe69df8a325",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/faithful-observe-jumatul-wida-with-religious-devotion-al-quds-rally-calls-for-muslim-unity-against-oppression/",
    "retrieved_at": "2025-08-27T14:04:23.633Z"
  },
  "metadata": {
    "title": "Faithful observe Jumatul Wida with religious devotion; Al-Quds rally calls for Muslim unity against oppression",
    "author": null,
    "date_published": "2025-03-28T13:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 486,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 28 (APP): Jumatul Wida, the last Friday of the holy month of Ramadan, was observed with religious devotion and fervor in the federal capital as a large number of faithful thronged mosques across the city to offer special prayers. The main congregational prayers were held at Faisal Mosque, where thousands of worshippers gathered to seek divine blessings, forgiveness, and peace. The sermon focused on the significance of Ramadan, importance of piety, and need for unity among Muslims. Special prayers were offered for the progress, prosperity, and security of Pakistan and for the liberation of oppressed Muslims worldwide. Mosques in various sectors, including G-6, G-9, G-11, F-8, and I-10, witnessed an influx of worshippers, with some devotees arriving hours before the sermon. The faithful, wearing traditional attire, listened attentively to the Khutbah (sermon), which emphasized spiritual purification, compassion, and the essence of fasting. In light of the recent security challenges, stringent security arrangements were made by the Islamabad Capital Territory (ICT) Police. Law enforcement agencies were deployed around mosques and key areas to ensure the safety of worshippers. Metal detectors, walk-through gates, and surveillance cameras were used as part of enhanced security protocols. The religious leaders urged the community to uphold the teachings of Islam in their daily lives beyond Ramadan. They stressed the importance of compassion, generosity, and unity to address societal challenges. As the holy month approaches its conclusion, Muslims across the city expressed a sense of spiritual fulfillment while preparing for Eid-ul-Fitr. The faithful were reminded to pay Zakat-ul-Fitr, a mandatory charity, to support the less fortunate and ensure inclusivity in the celebrations. Meanwhile, the Al-Quds rally was held starting from Imambargah Asna Ashri in Sector G-6/2 and culminatd at D-Chowk, with a significant participation from the supporters of Majlis Wahdat-e-Muslimeen (MWM), Shia Ulema Council Pakistan, Imamia Students Organization, and Jafaria Students Organization. The rally saw a large turnout of political, religious, and student organizations expressing solidarity with the oppressed people of Palestine and condemning Israeli atrocities. The event highlighted the need for Muslim unity in addressing issues of Palestine and Kashmir. Senator Allama Raja Nasir Abbas, the head of MWM, led the rally and addressed the participants, emphasizing the importance of a united stance against oppression and injustice. He stated that the resolution of the Palestinian and Kashmiri issues is impossible without the unity of the Muslim Ummah. Prior to the rally, protest resolutions condemning Israeli aggression and calling for Muslim solidarity were approved in various mosques and Imambargahs across the city. Allama Sajid Naqvi's message was shared, urging Muslims to unite and resist oppression, stressing that a divided Ummah cannot solve the crises of Palestine and Kashmir. During the rally, participants chanted slogans against Israeli oppression and in favor of the Palestinian cause, carrying placards and banners bearing messages of solidarity. The day concluded peacefully with prayers for Pakistan's stability, progress, and prosperity, and moreover, liberation of oppressed Muslims worldwide.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}