{
  "title": "PTI quit anti-state smear campaign, hold dialogue with govt on political issues: Aqeel",
  "link": "https://www.app.com.pk/national/pti-quit-anti-state-smear-campaign-hold-dialogue-with-govt-on-political-issues-aqeel/",
  "date_published": "2024-06-16T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Spokesperson of the Federal Government on Legal Affairs, Barrister Aqeel Malik on Sunday said the Pakistan Tehreek-e-Insaf (PTI) must quit its anti-state activities and propaganda, and hold dialogue with the government on political issues to mull over solutions instead of damaging the nation’s interest at global forums.\nThe Spokesperson on Legal Affairs was holding a press conference to brief the media on the political party’s anti-state activities abroad. Barrister Malik said that there was no precedent to PTI’s country enmity as it was perpetrating anti-Pakistan legislation in foreign countries.\n“Pakistan is an independent country and does not take dictation from any nation. We want friendly relations with all nations. However, a concentrated smear campaign against Pakistan in foreign countries that started after the 2022 vote of no confidence which mounted the anti-Pakistan propaganda,” he said and added that the PTI had hired lobbyists and PR firms to promote anti-Pakistan campaign abroad.\nResolution number 901 tabled in November 2023 in US Congress by Congressmen McCormick had all its links to PTI, he alleged while adding, “all anti-Pakistan legislation is done on the behest of PTI and overseas Pakistani diaspora who have strong affiliation with this party are being misused for this clandestine motive of PTI.”\nHe warned that the government and state of Pakistan would clamp down against overseas Pakistanis if the anti-state agenda was promoted.\n“In May 2023, 65 congressmen wrote a letter to the US Secretary of Defence to prioritise the promotion of protection of human rights and democracy in Pakistan. 11 congressmen wrote a letter to US Secretary of State in November 2023 to suspend US assistance to Pakistan. 31 congressmen wrote to the US Secretary of State and President to not recognise the government of Pakistan formed after February 2024,” the Spokesperson noted.\nHe underscored that all these tactics were done by PTI and it was hiring lobbying and PR firms to strongly promote anti-Pakistan propaganda.\n“PTI is running a malicious concentrated campaign against Pakistan. The amendments being moved by the PTI-influenced House of Representatives are all linked to anti-state and country enemy elements as India also has a major role in it and they are joining PTI to work on anti Pakistan narrative,” Barrister Aqeel alleged.\nHe reiterated that the state and government of Pakistan were fully aware of the campaign and its perpetrators.\n“You (PTI) cannot do opposition against the state as by doing so you are undermining it and there is no acceptability and tolerance for it. No political party is above Pakistan, let’s make it crystal clear and no anti-state agenda and narrative will be allowed by the state,” he added.\nHe urged the PTI to think about the country and motherland as it had joined hands with country enemies and set out on an anti-country agenda for its political motives. “PTI is becoming a source of humiliation for the country at international forums. You are Pakistani and we all are Pakistanis. We have to work for the country. Nobody is stopping you from the politics but this negative and inimical political would not be allowed,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:19:25.134Z"
}
