{
  "title": "Pak-EPA initiates comprehensive study on Air, Water Quality in Islamabad 2024",
  "link": "https://www.app.com.pk/national/pak-epa-initiates-comprehensive-study-on-air-water-quality-in-islamabad-2024/",
  "date_published": "2024-06-15T19:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 15 (APP): The Environmental Monitoring Team (EMT) of the Pakistan Environmental Protection Agency (Pak-EPA), under the directions of Director General, Farzana Altaf Shah, and the supervision of Director (Lab/NEQS), Dr Zaigham Abbas, has embarked on two pivotal projects aimed at tackling the critical issues of air and water pollution in Islamabad.\nAccording to the Pak-EPA, air pollution in Islamabad has reached alarming levels, primarily driven by rapid industrialization, and increasing vehicular traffic, which contribute significantly to the concentration of particulate matter in the air.\nThe resultant pollution poses serious health risks, including respiratory illnesses, cardiovascular diseases, and other chronic conditions. Simultaneously, surface water bodies in and around Islamabad are facing contamination from various sources, including industrial discharges, agricultural runoff, and domestic waste, leading to deteriorating water quality that threatens both public health and aquatic life.\nTo combat these alarming situations, Pak-EPA has initiated two projects simultaneously, aimed at studying the serious challenges related to air pollution, predominantly from industrial emissions and vehicular traffic, as well as water pollution from various sources.\nThese pollutants pose severe risks to human health and the ecosystem, necessitating immediate and effective action. The projects are as follows:\nProject 1: Analysis of Airborne Total Suspended Particulate Matters (TSP):\nAs part of the first project, the Pak-EPA’s environmental monitoring team has been diligently collecting 24-hour samples of airborne total suspended particulate (TSP) matter from diverse locations across Islamabad. Sampling sites include the industrial areas of I-9 and I-10, the commercial hub of G-11 Markaz, and the rural vicinity of Taramri Chowk. Furthermore samples from residential zones and heavy vehicle traffic areas will also be collected in upcoming days.\nThe collected TSP samples are currently under analysis to quantify particulate concentration and assess their potential impact on both human health and the environment. This comprehensive study aims to map out pollution hotspots and provide critical insights into the health risks associated with TSP exposure. The data will inform future policies and interventions aimed at reducing particulate emissions and improving air quality in the capital city.\nProject 2: Analysis of Surface and Reservoir Water Quality:\nIn parallel, Pak-EPA is conducting an extensive analysis of surface and reservoir water quality. Composite samples have been collected from key water bodies, including the Korang River, Angoori Dam, Chattar Park, Rumli, Jinnah Nallah, Bharakahu Nallah, and Shahdara. Additionally, critical reservoirs such as Rawal Dam and Simly Dam are included in the sampling list to evaluate water quality comprehensively.\nThese samples are preserved and are currently under analysis to detect contaminants and assess water quality parameters. The objective is to identify pollution sources, evaluate the extent of contamination, and provide recommendations for optimizing water quality to ensure safe and clean water for Islamabad’s residents.\nThe outcomes of this study are crucial for developing effective water management strategies and protecting aquatic ecosystems.\nThe Pak-EPA’s proactive measures to analyze and address air and water pollution are expected to yield significant benefits for the environment and public health. By identifying pollution sources and quantifying the impact of airborne particulates, the air quality study will help formulate policies to reduce emissions, leading to cleaner air and a reduction in pollution-related health issues.\nThe water quality analysis will play a pivotal role in safeguarding Islamabad’s water resources, ensuring access to clean water, and protecting aquatic habitats. Collectively, these studies underscore Pak-EPA’s commitment to fostering a healthier and more sustainable environment for future generations.",
  "retrievedAt": "2025-08-11T03:19:04.685Z"
}
