{
  "title": "Over 68% of Pakistan’s land area classified as arid or semi-arid, vulnerable to desertification: Romina",
  "link": "https://www.app.com.pk/national/over-68-of-pakistans-land-area-classified-as-arid-or-semi-arid-vulnerable-to-desertification-romina/",
  "date_published": "2024-06-16T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam has said that as the global community marks the World Desertification Day on June 17th, Pakistan – which is facing expanding desertification and recurring but intense droughts – stands at a critical juncture in its fight against desertification and land degradation.\nIn her press statement issued here on Sunday, the PM’s aide said that the theme for this year’s World Desertification Day 2024, “Restoration. Land. Climate.”, resonates deeply with the present government’s commitment and on-ground efforts to fight desertification by restoring degraded lands and ecosystems, enhancing climate-resilience and achieving sustainable development goals.\n“Through targeted policies, investments in research and technology and fostering international cooperation, Pakistan remains steadfast in its commitment to combating desertification and achieving land degradation neutrality,” Romina Khurshid said.\nShe highlighted that Pakistan is a signatory to the United Nations Convention to Combat Desertification (UNCCD) and is closely working with international partners to address desertification. Various projects and initiatives are supported by international organizations to enhance Pakistan’s capacity to combat this issue.\nSpelling out factors behind the issues of expanding desertification and land degradation, the PM’s aide said that warming temperatures, shifting or declining rainfall patterns, recurring droughts, loss of vegetation and tree covers, unsustainable agricultural, irrigation practices, overgrazing, urbanisation, ranching, mining and clearing of land and heat-trapping carbon emissions from industrial, transport and fossil fuel-run energy sectors and deforestation are major causes.\nOver 68% of Pakistan’s land area is classified as arid or semi-arid, making it vulnerable to desertification, she underlined and added that soaring desertification levels in recent years have resulted in loss of fertile topsoil, soil erosion, water scarcity, lower agricultural, loss of agriculture-based livelihoods, increase in rural poverty, hunger and malnutrition, rural-to-urban migration, habitat loss, degradation of natural ecosystems.\nSharing a global picture of the desertification challenge, the PM’s coordinator said that like elsewhere in Africa, Europe and Asia, desertification has emerged as a serious environmental issue in Pakistan, adversely impacting large areas of the country and posing a serious threat to agriculture, water resources and livelihoods.\nOf all global regions, Africa and Asia are the worst-hit regions, bearing the brunts of desertification. According to an estimate, a little less than 2 billion people in Asia live in conditions or areas characterised as desertification or drought-hit parts and the number of the people affected by desertification or drought will soar to 2.5 billion by 2050, she explained.\nThe PM’s aide emphasized that the global observance of the world desertification day on June 17 this year, however must serve as a stark reminder of the growing environmental challenges faced by not only the global regions but also Pakistan, underscoring the urgent need for concerted global efforts to combat desertification.\nIn light of the challenges of desertification and land degradation, the present government under the leadership of Prime Minister Shehbaz Sharif has already taken proactive coping measures to address desertification in collaboration with various stakeholders including civil society organizations, academia, and international partners, the PM’s aide empahsised.\n“Various initiatives including Green Pakistan Programme, climate-smart agriculture, National Adaptation Initiative, Living Indus, climate-resilient urban planning and management, Recharge Pakistan are already being implemented to fight desertification by promoting sustainable land management practices, increasing tree cover for restoring degraded land and conserving natural resources as well as increasing groundwater level,” she elaborated.\nRomina Khurshid Alam said further that under these government-led desertification-control initiatives, we are taking all-out measures to engage local communities, development partners, civil society organisations for their role in deal with the threat of desertification.\nEfforts are also being taken to raising awareness about the impacts of desertification for combating desertification in the country. Their participation and commitment are crucial in implementing sustainable solutions and adapting to the changing climate patterns, she added.\n“I believe that addressing desertification in Pakistan requires a holistic approach, integrating environmental, economic and social strategies and engaging local communities and all relevant stakeholders to achieve sustainable land use and protect the livelihoods of those affected,” she remarked, adding, “As the country observes World Desertification Day, let us reaffirm our collective responsibility to preserve our natural heritage, protect our land resources, and secure a sustainable future for generations to come.”",
  "retrievedAt": "2025-08-11T03:19:06.308Z"
}
