{
  "title": "Margalla Hills eateries closure wins conservationists’ social activists’ support",
  "link": "https://www.app.com.pk/national/margalla-hills-eateries-closure-wins-conservationists-social-activists-support/",
  "date_published": "2024-06-16T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): In a watershed moment for environmental conservation, the Supreme Court’s decision to close eateries in the vicinity of Margalla Hills National Park has been hailed by diverse segments of society. This move, aimed at safeguarding natural habitats and biodiversity, stands as a resolute step towards securing the future for generations to come.\nHammad Naqi Khan, Director General of WWF-Pakistan, hailed the Supreme Court’s decision as a landmark step in conserving the fragile ecosystem of Margalla Hills National Park. Speaking to APP, he expressed profound appreciation for the judiciary’s proactive stance in preserving the park’s rich biodiversity and natural splendor, which he described as integral to the federal capital’s beauty and identity.\n“The honorable judges have demonstrated a commendable commitment to safeguarding our natural heritage,” remarked Khan, underlining the significance of this decision in advancing long-term conservation efforts across Pakistan.\nKhan emphasized the strategic significance of the judicial directive, stating, “This landmark decision represents a decisive stride towards the sustainable management and protection of Pakistan’s invaluable natural resources.” The closure of commercial establishments within Margalla Hills National Park is viewed as pivotal in restoring ecological balance and promoting harmonious coexistence between human activities and environmental preservation.\nWWF-Pakistan’s advocacy spotlighted the ecological fragility of Margalla Hills National Park. Their dedication to sustainable conservation practices propelled this landmark decision, marking a new era of environmental stewardship in Pakistan, remarked Hammad Naqi Khan.\nNousheen Izhar, a Nature and Environmental Rights Activist volunteering with Margalla Hills National Park (MHNP), commenting on APP’s question how do you see SC’s decision? expressed concerns about irresponsible tourism and highlighted issues multiplied by restaurants like Monal, such as increased vehicular traffic, emissions, honking, and littering during weekends, Ramazan, Eid, and other festivities.\nNousheen highlighted that waste disposal from these eateries has polluted natural springs, prompting cleanup efforts by the Islamabad Wildlife Management Board and volunteers. Expressing optimism about the Supreme Court’s decision to close all restaurants within Margalla Hills National Park, she cautioned against potential large infrastructure projects such as plazas or housing societies. Nousheen emphasized the need for a harmonious coexistence approach to preserve the park’s pristine habitats and protect its native species.\nAnother activist and a multimedia journalist and founder of Green Rescue Report, Rabbia Arshad Turkman talking to this agency said, “I commend the Supreme Court’s recognition that human mobility cannot be outright banned. However, it is crucial to impose restrictions that safeguard natural habitats, similar to regulations observed in Western nations. These measures are essential to protect biodiversity and ensure sustainable coexistence with our environment.”\nCEO, Resilient Future International (RFI), Aftab Alam Khan said the Supreme Court judgment against illegal construction in Margalla Hills National Park can be a bulwark against Eco-unfriendly mindset.\n“Environment Impact Assessments are an intrinsic part of any construction plan however, the society, in general, is habitual of circumventing environment related laws. Such loopholes must be plugged after this decision of the apex court. All segments must understand that harming environment means killing the future of our own generations,” he said.\nDespite being part of top climate afflicted countries, majority of the society was unwilling to come out of the illusionary comfort zone, Khan added.\nResponding to an APP’s question how we can sensitize our society on the importance of biodiversity? He remarked,\n“Our education system from primary to PhD and from madrassa to government and private schools must teach the destruction of Eco-unfriendly actions. And all offices, government to private must organise training sessions on the same. We have to change the mindset from circumvention to respecting environment and the associated laws and policies,” the RFI CEO said.\n“This decision underscores the importance of maintaining ecological balance and ensuring undisturbed natural spaces. It will safeguard the unique flora and fauna of Margalla Hills, promoting a healthier ecosystem and enhancing the park’s value as a sanctuary for wildlife and a place of natural beauty for all to enjoy” noted Professor Dr. Muhammad Ismail Kumbhar, sustainable development expert at Sindh Agriculture University Tandojam, when asked by APP to comment on this development.\nIn a groundbreaking decision, the Supreme Court has ordered the closure of all eateries, including the renowned Monal Restaurant, nestled within Margalla Hills National Park (MHNP) in slamabad within the next three months. Conservationists and nature lovers from across the country have hailed this verdict as essential for safeguarding our natural ecosystem.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:19:03.258Z"
}
