{
  "title": "Chairman Senate called for elevating bilateral trade volume with Togo",
  "link": "https://www.app.com.pk/national/chairman-senate-called-for-elevating-bilateral-trade-volume-with-togo/",
  "date_published": "2022-08-11T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Chairman Senate Muhammad Sadiq Sanjrani, In a meeting with Togolese Foreign Minister Prof Robert Dussey here at Parliament House on Thursday, has determined joint interests as well as mutual respect as the primary force in the Pakistan and Togo relationship.\nThe duo stressed the need for further enhancing bilateral cooperation in diverse fields of mutual interest, said a press release issued here. Sadiq Sanjrani appreciated the Foreign Minister of Togo participation in the OIC-CFM conference held in Islamabad in March 2022 and underlined the importance of bilateral relations based on common values, aspirations, and mutual respect.\nThe bilateral trade which stands at $27mn needs to be enhanced further, he observed.\nThe Chairman Senate, on his part, emphasized that Pakistan affixes great importance to further boosting amicable ties with Togo. He praised the positive and substantial contribution of Togo to multilateral platforms like the AU, OIC, UN, and ECOWAS. He also applauded traditional coordination of positions and mutual support for each other’s candidatures at international fora.\nThe meeting called for exchanges at bilateral political, trade and Military levels.\nThe Chairman also extended an invitation to the  Chief of Togolese Defense Forces to visit Pakistan.  Sanjrani suggested the formation of a Joint Business Council and proposed the finalization and signing of an MoU for Bilateral Political Consultations, pending since March 2021.\nThe Chairman also denoted new initiatives to forge bilateral cooperation, inter alia, including  MoUs for Cooperation in Health & Agriculture Sectors, MoU for Defense Cooperation, Agreement for Visa Abolition for Diplomatic & Official/Service Passports and MoU for Cooperation in the field of Counter Terrorism.\nThe Foreign minister of Togo assured Sanjrani of further promoting bilateral cooperation and honoured Pakistan’s efforts for peace in the region. Being an important country in the region, Togo also yearns for developing ties with Pakistan, Robert Dossey remarked.\nThe Chairman Senate briefed the visiting dignitary about the working procedures of the Upper House and the Legislation. The meeting also agreed to foster institutional cooperation.\nSanjrani said that Pakistan Institution for Parliamentary Services (PIPS) can provide support for the staff and members of the Parliament of Togo, adding that enhancing parliamentary capacity will help in better legislation and policy-making.\n“There is a need to promote parliamentary diplomacy for better coordination and public-level linkages”, Chairman Senate observed.\nThe two sides acquiesced during the meeting, to maintain contact along with exploring mechanisms for frequent engagement between Pakistan and Togo. Senators Naseebullah Bazai, Zeeshan Khanzada, Fida Muhammad and Secretary Senate Qasim Samad Khan were also present at the meeting.",
  "retrievedAt": "2025-08-11T15:22:43.236Z"
}
