{
  "title": "Indian troops martyr two Kashmiri youth near Pargal Army Camp in IIOJK",
  "link": "https://www.app.com.pk/national/indian-troops-martyr-two-kashmiri-youth-near-pargal-army-camp-in-iiojk/",
  "date_published": "2022-08-11T18:34:00.000Z",
  "source": "APP",
  "content": "Indian troops martyred two Kashmiri youth near an Indian army camp in Pargal area in Indian Illegally Occupied Jammu and Kashmir (IIOJK) in what appeared to be another Indian ploy to implicate Kashmiri youth and create an environment of fear with an aim of maligning freedom struggle and Pakistan.\nThe fears of people in Indian illegally occupied Jammu and Kashmir turned out to be true when on Thursday morning they heard of a purported attack on an Indian army camp in Rajouri district, according to Kashmir Media Service.\nThe fresh incident just ahead of Indian Independence Day seems to be another orchestrated drama for multiple purposes by the Hindutva-driven Bharatiya Janata Party government in India.\nEarlier, at least three Indian troops were killed and several were injured in an attack on the Indian army camp at Pargal in Rajouri. One more soldier died of his injuries at a hospital.\nThe analysts and experts believe that the recent wave of fake encounters during cordon and search operations was a ploy.\nIndian political and military leadership along with the Indian media always try to set a narrative while distracting international attention from the IIOJK and the deteriorating domestic law and order situation. India is facing multiple problems which include economic downturn, domestic insurgencies, widespread demonstrations, tensions between ethnic groups and religious bigotry.\nIn the past, India tried to implicate Pakistan in false flag operations without giving any concrete evidence. By implicating Pakistan in another false flag operation, Modi-led Indian fascist government is trying to create difficulties for Pakistan at the forum of Financial Action Task Force (FATF), the analysts added. It is expected that Pakistan would be out of the FATF grey list in October.\nNew Delhi has a history of carrying out false flag operations to achieve its nefarious designs. On 26 November 2008, India conducted Mumbai attacks to put pressure on Pakistan.",
  "retrievedAt": "2025-08-11T15:22:28.259Z"
}
