{
  "title": "President directs HEC, Hunerkada college to resolve accreditation issue to save students’ future",
  "link": "https://www.app.com.pk/national/president-directs-hec-hunerkada-college-to-resolve-accreditation-issue-to-save-students-future/",
  "date_published": "2022-08-11T13:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): President Dr. Arif Alvi on Thursday directed the Hunerkada College of Visual and Performing Arts to resolve the issue of accreditation by fulfilling the requirement of the Higher Education Commission (HEC) to save the career(s) of the student(s).\nHe issued these directions while disposing of the representation filed by Imran Minhas against the order of the Wafaqi Mohtasib (WM) wherein WM had found HEC’s negligence in taking action against the Hunerkada College of Visual and Performing Arts, an act which was tantamount to maladministration on the part of HEC with the added directions to take suitable action against the college management so that more students do not fall victim to unrecognized college(s).\nThe President admitted the report filed by HEC wherein HEC had stated that, “……the record provided by Hunerkada College of Visual and Performing Arts and to resolve the issue of the applicant, it is recommended that the college shall submit complete record of the student to the university with the request to place it before the University’s Statutory bodies [i.e. Affiliated Committee, Academic council, Syndicate, Senate, etc] for consideration. “\nThe President disposed of the representation with the advice to the college management to submit the record of the student to HEC and directed the HEC to forward the record to the concerned University with its recommendations for necessary processing, a press release issued by the President’s Media Wing here said.\nAs per details of the case, the complainant had alleged that his son got admission in four-year degree program of Fine Arts at Hunerkada College, Islamabad which was affiliated with the University of Balochistan and was run by a renowned artist. After completion of the program, the college was requested to provide a degree but to no avail.\nHe was informed that the University Degree could not be awarded because his son was not registered with the University of Balochistan. Feeling aggrieved, he approached the Wafaqi Mohtasib who passed the impugned order. Later, he filed the representation against this order of the Wafaqi Mohtasib to the President of Pakistan.\nThe President disposed of the representation and directed HEC and the College management to resolve the issue for saving the future of students who were directly affected by this maladministration.",
  "retrievedAt": "2025-08-11T15:22:37.989Z"
}
