{
  "title": "Visitors evince keen interest in Constituent Assembly’s Diamond Jubilee celebrations",
  "link": "https://www.app.com.pk/national/visitors-evince-keen-interest-in-constituent-assemblys-diamond-jubilee-celebrations/",
  "date_published": "2022-08-11T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Parliamentarians, school children, women and various segment of society on Thursday turned up in Parliament House to witness the packed programs of events including photographic, painting and book exhibition being held at Parliament House in connection with the Diamond Jubilee celebrations of first constituent assembly of the country.\nMost of the visitors including the students of government as well as private schools, colleges evinced keen interest in witnessing the photographic history of Parliament right from 1947 to-date.\nEverybody appreciated the exhibition. Many visitors were witnessed clicking pictures of their favourite politicians.\nIn the exhibition, the 75 years history of Parliament has been depicted in pictures.\nRare photos of the country’s top parliamentary leadership included leader of the House, leader of the Opposition, foreign state heads and their historical address to the joint sitting of the parliament have been displayed in the exhibition.\nThe visitors were astonished to see the rare photos of the country’s leadership including Quaid-e-Azam, Liaquat Ali Khan, Zulfikar Ali Bhutto, Mohtarma Benazir Bhutto and others.\nThe three-day photographic exhibition titled “Tarjuman-e-Mazi Shan-e-Hal” organized by National Assembly Secretariat was inaugurated by the National Assembly speaker on Wednesday and it will be concluded on Friday.\nThe three day Art and Pain ting Exhibition with the theme “Pak Sarzamin shad Baad” was also attracting huge crowd.\nYet another 3-day Book Exhibition with the theme “Qaum, Mulk, Saltanat” in the library of Parliament House, was being witnessed in large numbers.\nTalking to APP, Maulana Abdul Akbar Chitrali, a member of National Assembly of Jamat-e-Islami, paid tributes to father of the nation for creating the country.\nChitrali visited the photographic exhibition and lauded the collection of rare photos –depicting the history of Parliament right from 1947 to date.\nHe stressed providing optimum facilities to the people of the country.\nHe said minorities should be provided equal rights and Constitution of Islamic Republic of Pakistan guarantees minorities’ rights.\nParliamentary Secretary for Communication Shahida Akhtar Ali urged all stake holders to celebrate Independence Day keeping aside party affiliations.\nRomina Khursheed Alam, MNA lauded Diamond Jubilee celebrations and pledged to play proactive role in making the country prosperous.\nPeople from all walks of life were taking keen interest in events.",
  "retrievedAt": "2025-08-11T15:22:48.657Z"
}
