{
  "title": "PM emphasizes sustained high-level Pak-EU exchanges for stronger partnership",
  "link": "https://www.app.com.pk/national/pm-emphasizes-sustained-high-level-pak-eu-exchanges-for-stronger-partnership/",
  "date_published": "2022-08-11T10:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Prime Minister Shehbaz Sharif on Thursday said the sustained high-level exchanges between Pakistan and the European Union was vital to further strengthen the growing partnership.\nThe prime minister, in a meeting with the newly appointed Ambassador of the European Union to Pakistan Dr. Riina Kionka who called on him here, said that Pakistan attached high importance to its relations with the EU as well as its historically close and cooperative bilateral ties with EU member states.\nRecalling his recent telephone conversations with the EU Council President Charles Michel and the President of the European Commission Ursula von der Leyen, the prime minister expressed confidence that the upcoming visits to Pakistan by the EU Parliamentary delegations as well as the next rounds of political and security dialogues under EU-Pakistan Strategic Engagement Plan would pave the way for more substantive cooperation between the two sides.\nHe credited the current GSP Plus scheme with enhancing the mutually beneficial trading ties between Pakistan and EU and hoped that Pakistan would continue to be part of the arrangement beyond 2023.\nNoting the 60th anniversary of Pakistan-EU relations this year, the prime minister stressed that this milestone should be commemorated by both sides in a fitting manner.\nPrime Minister Shehbaz Sharif stressed the importance of a peaceful and stable Afghanistan. He also highlighted the unprecedented level of cooperation that Pakistan had extended to the international community in regard to Afghanistan, especially since the developments of August last year.\nDr. Riina Kionka thanked the prime minister for receiving her and expressed her resolve to work for further deepening of EU-Pakistan relations during her tenure in Islamabad.",
  "retrievedAt": "2025-08-11T15:22:49.908Z"
}
