{
  "title": "EU Ambassador plays national anthem on trumpet honoring Pakistan on Independence Day",
  "link": "https://www.app.com.pk/national/eu-ambassador-plays-national-anthem-on-trumpet-honoring-pakistan-on-independence-day/",
  "date_published": "2022-08-11T10:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): As a special gesture to honor Pakistan on its 75th Independence Day, the EU Ambassador Dr. Riina Kionka played the national anthem on trumpet.\nThis unique way to mark the 14th of August when Pakistan obtained independence in 1947 was shared through a special campaign on the social media channels of the European Union Delegation to Pakistan in Islamabad, said a press release issued here by the European Union Commission on Thursday.\nThe year 2022 also marks the 60 years of EU-Pakistan relations in a long-standing partnership that makes both countries stronger together. In Pakistan, the EU is committed to a stable, democratic, and pluralistic country that respects human rights and benefits from its full economic potential by supporting sustainable and inclusive development for all its citizens, it added.\nThe collaboration between the European Union and Pakistan is grounded in the Strategic Engagement Plan (SEP) signed in 2019. Areas of cooperation under the SEP include peace and security, democracy, rule of law, human rights, and migration but also sectors such as energy, climate change, and science and technology, it maintained.\nIt is pertinent to mention here that the EU is one of Pakistan’s largest trading partners. The EU supports Pakistan’s integration into the world economy and its sustainable economic development, namely by granting it preferential access to the European single market under the GSP+ system since 2014.\nThe links to the campaign to celebrate Pakistan’s independence can be found below on the social media channels of the European Union.https://www.facebook.com/EUinPakistan/https://twitter.com/EUPakistanhttps://www.instagram.com/eudelegationpakistan/https://www.youtube.com/channel/UCFSLZdk84jSbdwwz3R2yNIA",
  "retrievedAt": "2025-08-11T15:22:49.892Z"
}
