{
  "title": "NA hosts National Minority Convention",
  "link": "https://www.app.com.pk/national/na-hosts-national-minority-convention/",
  "date_published": "2022-08-11T14:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 11 (APP): Speaker National Assembly Raja Pervaiz Ashraf Thursday said that August 11 was the historic day when the founder of Pakistan Quaid-e-Azam Muhammad Ali Jinnah was elected as President of 1st Constituent Assembly.\nHe expressed these views in his welcome address to the Minority Convention held at the National Assembly Hall in connection with the Diamond Jubilee celebrations of 1st Constituent Assembly in Islamabad.\nHe said the founder of Pakistan in his inaugural address to the 1st Constituent Assembly presented the constitutional outline for newly independent state of Pakistan where every citizen of the state was declared an equal citizen without distinction of color, race, religion, caste and language.\nThe Speaker welcomed the participants of the convention, saying that the convention was\na unique convention of its kind in which Parliamentarians as well as community leaders, representatives of all minority communities are participating. He said that it was an honour for him to welcome them as they are part of the nation.\nWhile appreciating the confidence of a child from Minority community who addressed the convention, he said the address of the child reflects the picture of democratic and egalitarian Pakistan which was guaranteed by 1973 Constitution of the country.\nThe Speaker said that this day was declared as the National Minority Day on the basis of speech of Quaid-e-Azam Muhammad Ali Jinnah on August 11, 1947.\nHe said that keeping in view of the same spirit National Convention on Minority was held in National Assembly Hall to mark that day. He said that white stripe in the flag of Pakistan indicates our minorities who are playing vital role in the development and progress of the country.\nHe said that the Constitution of Pakistan in its Preamble reiterates a Pakistan “In which provision will be made for Minorities to freely profess and practice their religions and develop their cultures.”\nHe said that country’s Constitution guarantees sanctity, security and development of every member of community including minorities. He said that this diamond jubilee would set the future goals for people of Pakistan for coming 75 years.\nThe convention was attended by Federal Ministers, Parliamentarians, Members of Provincial Assemblies, and leaders, representatives & notables of all religious minorities.\nAt the very outset, the Speaker invited Abda Abid, a Christian boy to present quotes from the speech of Quaid-e-Azam Muhammad Ali Jinnah delivered on August 11, 1947. As per vision of Quaid-e-Azam minorities were enjoying equal rights and liberty to practice their religion in free manner.\nArish Kumar, a former Member of National Assembly, speaking in the convention in National Assembly raised the issue of forced conversion, demanded equal opportunities for education. He also appreciated the construction of Kartarpur Corridor in Narowal. Ms Kalara Pasha said Pakistan was the mother of all Pakistanis. Despite having a Muslim husband, she has the right to practice her Christianity.\nKheal Das Kohistani, MNA said there was no discrimination between minorities and majorities in the country. Minorities were playing important role in progress of the country. Parliament was there to resolve issues of minorities. He said National Assembly would protect the rights of minorities at all costs.\nDr Ramesh Kumar Vankwani thanked the speaker for celebrating minority convention in National Assembly Hall. Pakistan People’s Party always played important role in protecting the rights of minorities. Minorities should be provided right to elect their own representatives. He recited Na’at.\nFormer MNA Asiya Nasir proposed that maximum time should be given to the guests.\nMNA Dr. Ramesh Lal said that credit of today event goes to Pakistan People’s Party (PPP), adding that there is no issue of reserve or general seats but loyalty and support with one party matter. He said that there is no country like Pakistan in the whole world.\nMNA Naveed Aamir Jeeva said that non-Muslim Pakistan have played great role in all fields of life including health and education.\nMNA Dr. Darshan Lal said that only democracy would bring progress and prosperity.\nMalik Zahid Iqbal, Sharoon Masih, Imran Uthwal, Ramesh Singh Arora, Dr Lal Chand and Paster Nasir Khan also spoke on the occasion.\nMinister for Parliamentary Affairs Murtaza Javed Abbasi said that the present government would resolve the issues of non-Muslims Pakistanis on priority for ending their feeling of deprivation.\nAddressing a Minority Convention organized by National Assembly here at National Assembly Hall, he suggested the speaker to constitute a Parliamentary Oversight Committee to expedite minority related legislation. There was no discrimination among Pakistani nationals.\nHe said that central government should subtract the National Finance Commission (NFC) share of province failing to prevent forced conversions.\nHe said that minorities were enjoying equal rights in the country which was promised by the founder of the nation Quaid-e-Azam Muhammad Ali Jinnah.\nHe said that he was happy to note that the representatives of all have attended the minority convention.\nHe also thanked foreign minister Bilawal Bhutto Zardari for attending the convention.\nAll other leaders should have attended the convention to encourage minorities, he said.\nHe said that minorities were precious asset of the country, adding that practical steps would be taken for bringing ease in their lives.\nThe convention unanimously adopted a resolution saying that the National Assembly while commemorating the Diamond Jubilee of Constituent Assembly was committed to protect and safeguard the rights and interests of the minorities of Pakistan by enacting required legislation in this regard.\nThe resolution said that the National Assembly acknowledged the achievements by members of minorities, who had served and aided the country in progressing; cognizant of the responsibility of the State enshrined in Article 33 of the Constitution to discourage discrimination and parochial, racial, tribal, sectarian and provincial prejudices among the citizens; conscious of responsibility before Almighty Allah and the citizens of Pakistan; Reaffirming the paramount nature of equality wherein all citizens are equal before the law and are entitled to equal protection of law.\nIt was faithful to the declaration made by the founder of Pakistan, Quaid-e-Azam in his address on August, 11, 1947 to the first Constituent Assembly wherein he stated “.you are free; you are free to go to your temples, you are free to go to your mosques or to any other places of worship in this State of Pakistan”.\nNA recognizes the right to political inclusion and representation of minorities in the federal and provincial services; emphasizes the fundamental right of every citizen to profess, practice and propagate their religion subject to law, public order and morality.\nIt further emphasizes the right that religious denominations have to establish, maintain and manage their religious institutions and the duty on the state to uphold this right and protect their places of worship; proud to reiterate that the Constitution gives the right of representation through ten reserved seats in the National Assembly and four in the Senate of Pakistan.\nThe resolution affirms minorities’ right to freedom of trade, business or profession, and access to employment without discrimination; reassures our citizens that the State will uphold their right to education, provision of property, and non-discrimination in respect of access to public places; stressing the importance of preservation of language, script and culture of each religious denomination.",
  "retrievedAt": "2025-08-11T15:22:37.183Z"
}
