{
  "title": "Parliamentary leaders commend Senator Muhammad Sadiq Sanjrani’s role",
  "link": "https://www.app.com.pk/national/parliamentary-leaders-commend-senator-muhammad-sadiq-sanjranis-role/",
  "date_published": "2024-02-19T16:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):During a meeting of the House Business Advisory Committee (HBAC) on Monday, the parliamentary leaders of various political parties in the Senate acknowledged and eulogized the role of Senator Muhammad Sadiq Sanjrani for efficiently running the affairs of Upper House of Parliament during his tenure as Chairman of the Senate.\nThe leaders expressed these views in a meeting of House Business Advisory Committee (HBAC), said a news release.\nA meeting of the House Business Advisory Committee was presided over by Chairman Senate Muhammad Sadiq Sanjrani.\nMembers observed that Chairman Senate Muhammad Sadiq Sanjrani adopted all-inclusive and participatory approach for the House and provided ample opportunity to all the members to discuss and debate issues of national significance.\n“Political acumen of Sadiq Sanjrani is highly praiseworthy and his approach is unique”, members said.\nChairman Senate also thanked members of the HBAC and other senators. He expressed his gratitude for the cooperation extended by members during the last six years.\nThe Committee also discussed in detail legislative business to be transacted during the 335th Session of the Senate.\nThe session would take up discussion on other issues of extreme public significance.\nThe HBAC decided that the current session would continue for more than two weeks.\nThe meeting was attended by Leader of the Opposition in the Senate, Senator Dr. Shahzad Waseem, Senator Sherry Rehman, Senator Kamil Ali Agha, Senator Waqar Mehdi, Senator Sardar Shafiq Tareen, Senator Afnanullah, and Senator Molana Abdul Ghafoor Haideri. Secretary Senate Mohammad Qasim Samad khan was also present during the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:46:57.047Z"
}
