{
  "title": "Dr Jamil appointed Executive Member of South Asian Chapter of Translators",
  "link": "https://www.app.com.pk/national/dr-jamil-appointed-executive-member-of-south-asian-chapter-of-translators/",
  "date_published": "2024-02-19T13:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP): Prof Dr. Jamil Asghar Jami, Dean of the Faculty of Languages at the National University of Modern Languages (NUML), has been appointed as the first Pakistani Executive Member of the South Asian Chapter of Translators without Borders.\n“It is a remarkable achievement for Pakistan. The appointment highlights Dr Jamil’s exceptional contributions in the fields of translation and interpretationm and symbolizes Pakistan’s emerging presence in the global linguistic community,” a NUML news release said on Monday.\nDr Jamil holds a PhD in Linguistics and has been honoured with a prestigious research fellowship from the University of North Texas, United States.\nHis journey in language education is marked by significant roles, including establishing and leading the Department of Translation and Interpretation at NUML, reflecting his dedication to raising the standards of language translation and interpretation in the country.\nHis academic prowess is further evidenced by his authorship of two insightful books on Allama Iqbal, adding depth to Pakistan’s cultural and intellectual heritage.\nDr Jami’s linguistic expertise extends beyond academia to international platforms, where he is recognized as a United Nations interpreter, demonstrating his capability in managing complex linguistic tasks globally.\nHis talents are also integral to the Pakistani Government, often interpreting for the President and Prime Minister, demonstrating his reliability in high-stakes national and international dialogues.\n“This blend of academic, administrative, and practical expertise in languages, complemented by over two decades of experience in teaching and translation, not only underscores Dr Jami’s individual achievements but also represents a significant stride for Pakistan in the international academic and linguistic domains,” the news release said.",
  "retrievedAt": "2025-08-11T00:47:01.207Z"
}
