{
  "title": "IHC suspends notifications of  Islamabad’s 3 NA seats winners",
  "link": "https://www.app.com.pk/national/ihc-suspends-notifications-of-islamabads-3-na-seats-winners/",
  "date_published": "2024-02-19T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):The Islamabad High Court (IHC) on Monday suspended the notifications of the candidates winning from the three National Assembly seats of NA-46, NA-47, and NA-48 Islamabad.\nThe IHC bench comprising Justice Mian Gul Hasan Aurangzeb and Justice Arbab Muhammad Tahir suspended the victory  notifications of Pakistan Muslim League-Nawaz candidates Anjum Aqeel from NA-46, Tariq Fazal Chaudhry from NA-47 and Raja Khuram Shehzad from NA-48 Islamabad.\nThe bench took the decision while hearing comprising Justice the separate intra-court appeals of independent candidates Shoaib Shaheen, Aamer Mughal and Ali Bokhari Advocate.\nDuring the course of proceedings, Shoaib Shaheen Advocate said that he had received all the Forms-45 of 380 polling stations in the election night and approached the returning officer to point out the irregularity. Form-47 was not issued till 1 a.m. and his workers staged a sit-in in protest, he added.\nThe lawyer said that firstly he filed an application before the  returning officer and then to the district returning officer. The Election Commission of Pakistan (ECP) stopped the RO from issuing the Form 47 and also sought a report within three days, which had not been filed as yet.\nShoaib Shaheen said that the RO was supposed to prepare the Form-47 in the presence of all candidates. However, the ECP later issued the notification declaring Tariq Fazal Chaudhry winner without consolidation of the results.\nAamir Mughal’s lawyer claimed that there were 343 polling stations in his client’s constituency and as per the results he was leading.\nThe petitioners prayed the court to issue directives to the ECP for withdrawal of the victory notifications of the three PML-N candidates in aforesaid constituencies as their complaints were already pending with the electoral body.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:47:01.567Z"
}
