{
  "title": "Govt committed to promote freelancing sector to grow economy, VC says",
  "link": "https://www.app.com.pk/national/govt-committed-to-promote-freelancing-sector-to-grow-economy-vc-says/",
  "date_published": "2024-02-19T06:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):The Vice Chancellor of Abbottabad University of Science and Technology Prof. Dr. Malik Mujaddad Ur Rehman Monday said that the caretaker government was taking various practical steps to promote the freelancing sector to grow the economy and to connect to the global market online using different platforms.\nIn an interview with PTV news channel, he said that the government was launching digital Pakistan Platforms that will provide freelancing opportunities to computer literates in the country, adding, that the freelancing sector’s promotion will help to solve young Pakistani people’s unemployment problems.\nHe said that the government has inaugurated its freelancing IT Lab at Abbottabad University of Science and Technology (AUST) to generate revenue from modern technology and research.\nHe stressed that there is a dire need to provide market-oriented education to the youth so that they do not have to run for jobs after completing their degrees.  “We aim to provide a perfect platform to youth to earn it had also sensitized them to the online avenue of self-employment, bolstering their sustenance levels”, he added.\nEvery year, thousands of university students are unemployed without getting a job. As a result, the number of educated unemployed is increasing day by day, he said, adding, however, there is an opportunity to enrich the country’s economy by involving this unemployed population in freelancing.\nPakistan has immense potential in freelancing, he mentioned, adding, that the government is already working on this sector. With proper investment and necessary initiatives by the government, it is possible to achieve a huge amount of foreign acquisition from the sector and eliminate the problem of unemployment, he suggested\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:48:10.809Z"
}
