{
  "title": "Pakistan’s policy endeavours on track to achieve disaster resilience against floods: Solangi",
  "link": "https://www.app.com.pk/national/pakistans-policy-endeavours-on-track-to-achieve-disaster-resilience-against-floods-solangi/",
  "date_published": "2024-02-19T15:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi on Monday told the Senate that the country’s policy endeavours keeping in view its growing vulnerability due to climate catastrophes were on track to achieve disaster resilience against floods.\nResponding to a motion tabled by Pakistan Tehreek-e-Insaf’s (PTI) Senator Mohammad Humayun Mohmand to discuss the pressing issue of water resources, floods and water mismanagement in Pakistan, especially in the wake of the devastating floods in 2022 and in 2010, the minister provided a brief overview of the country’s response to floods through policy interventions.\nHe said that after three years deliberations post 2010 floods, the Ministry of Water Resources had finalized the National Flood Protection Plan-IV, which was approved by the Council of Common Interests (CCI) on May 2, 2017.\nHowever, all the four provinces including Gilgit-Baltistan, and Azad Jammu & Kashmir, after the enactment of Model River Act 2016, were instructed to change and implement the law according to their requirements, he added.\n“The Punjab and Khyber Pakhtunkhwa provinces have implemented the law whereas it’s approval in the other provinces is in different stages,” the minister said,\nSolangi noted that under the National Plan for Flood Telemetry Programme, some 707 telemetry stations would be established on different small and big rivers across the country.\nThe project concept or PC-I had been made, and the Japan International Cooperation Agency (JICA) had assured its assistance for developing 45 stations, he added.\nThe Punjab and Sindh provinces, he said, continued to work rapidly on expansion and innovation of all their barrages, whereas the work had been completed in Punjab and progress on Sukkur and Guddu barrages in Sindh was underway.\nMoreover, the minister mentioned that the Rs 27 billion flood damage restoration project was completed in Sindh.\nSolangi said that the CCI also approved Water Policy in 2018 and the Federal Flood Commission had made the framework of the policy and submitted to the Ministry of Water Resources.\nCommenting on the 2022 floods, he said the meteorological department predicted that there would be 40% more rain in June 2022 than the previous years. “All these assumptions proved wrong as over 175% rain on average occurred across the whole country.”\nMurtaza Solangi added that 70% more rain on average occurred in Punjab, Sindh received 425% more rain, 450 percent more rainfall took place in Balochistan, and Gilgit-Baltistan received 107 percent more rain than average.\nThe floods of 2022 were not riverine but rather pluvial floods in nature due to more rains and it had less depth and more spread that caused more destruction, he added.\n“The prime minister in 2022 directed to update the National Flood Protection Plan-IV in August 2022 and the ADB (Asian Development Bank) expressed its interest and provided technical assistance in this regard. The provinces also helped to update plan that was approved and under completion in the Planning Division.\n“Moreover, the Flood Protection Sector Project 3 PC-I has been approved and the Economic Affairs Ministry is exploring funding opportunities with multilateral donors,” he ended.\nSenator Humayun Mohmand while moving the motion said the country never focused the water sector seriously as rising global impacts were driving glacial lake outburst floods (GLOFs) and drought like situation.\nPakistan, he said, was among 17 world countries which would acute water shortage in the future.\n“We have to change our mindset to transform our world like the developed world save every drop of water for resilient future,” he said.\nHe added that Pakistan was blessed with the Indus River flowing naturally through a gravitational pull irrigating all the four provinces from the North to the South as the Himalayas had Ganges River at one hand, and Yellow River on the other and Indus Basin upfront.\n“From 30-50 million acres feet (MAF) water is wasted in Pakistan despite the national asset of Indus River flowing from North to South but was poorly managed,” he added.\nFrom 1975-2001 and 2001-2021, there had been 8.89% decline in Indus water, 16.5% in Jhelum River and 17.7% in Chenab Rivers, he added.\nAccording to WADPA, he said the country had 145 million cusecs feet water available in its system, but it had the capacity to only consume or utilize only 102-105 million cusecs feet freshwater that could irrigate only 40 million acres land out of the total 83 million acres available arable land.\nSenate Chairman Sadiq Sanjrani apprised Senator Mohmand that the Upper House had a dedicated caucus on water that the International Parliamentary Union had also recommended it which was working properly.",
  "retrievedAt": "2025-08-11T00:46:35.436Z"
}
