{
  "title": "Senate passes “The Pharmacy (Amendment) Bill, 2023",
  "link": "https://www.app.com.pk/national/senate-passes-the-pharmacy-amendment-bill-2023/",
  "date_published": "2024-02-19T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP): The Senate convened on Monday and passed The Pharmacy (Amendment) Bill, 2023, clause-by-clause to enhance and standardize pharmacy education across the country, aiming to cultivate professionally skilled human resources.\nSenator Mushaq Ahmed introduced the bill, which aimed to grant recognition to qualified pharmacists and foster opportunities for postgraduate specialized diploma programs to enhance their skills.\nAdditionally, it seeks to curb and prohibit unchecked and substandard pharmacy education programs through robust recognition procedures and prohibitions.\nThe prevailing pharmacy Act was promulgated in 1967 in a time when the country was deficient of relevant qualified professional human resources.\nCouples of universities were awarding degree in Pharmacy i-e, university of the Punjab and university of Karachi, whereas now there are almost 100 institutes conducing Pharmacy Degree Courses and more than 200 institutes imparting education in Pharmacy Technician programs.\nThere is dire need of drastic amendments to live decades old pharmacy act.\nThe existing Pharmacy Act provides for registration of Pharmacists persons other than those not holding a relevant qualification in Pharmacy.\nWhile internationally health professions are being segregated in different categories of healthcare service delivery levels and updated to meet the challenges of modern medical and healthcare services deliveries thereof with appropriate professional recognitions.\nTo meet the requirements of legally qualified and professionally competent human resources in the health care sector both inland and to the international market, this professional segregation through amendments in the existing act is unavoidable.",
  "retrievedAt": "2025-08-11T00:47:05.137Z"
}
