{
  "title": "Call for action to build fair, rights-based, equitable & ecologically just world",
  "link": "https://www.app.com.pk/national/call-for-action-to-build-fair-rights-based-equitable-ecologically-just-world/",
  "date_published": "2024-02-19T13:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):Deputy Executive Director of the Sustainable Development Policy Institute (SDPI), Dr Shafqat Munir on Monday signed the Civil Society statement on thematic assembly on economic inequality and justice calling for action to build a fair, rights-based, equitable and ecologically just world at the closing of 5-day World Social Forum in Nepali capital Kathmandu.\nThousands of people representing various civil society organizations signed a civil society statement on thematic assembly on economic inequality and justice. The Assembly was organized at the World Social Forum by Oxfam, Fight Inequality Alliance, Asia Feminist Coalition, ActionAid, LDC Watch, South Asia Alliance for poverty eradication, and Asia Center. The joint statement was issued by Mustafa Talpur, head of advocacy for Oxfam Asia, a news release said.\nThe statement said: We need to lose our fear, for them to lose their power – is a challenge posed by us as we conclude the World Social Forum 2024. The power imbalance that fosters systematic and structural inequalities and the compounding crises that comes along with it, drives us to lose our fear to stand up and speak up against all forms of injustices. It must be understood as a systemic design that leads to gross violations of human rights for a vast majority of the global population.\nThe statement further narrated: The wealth of billionaires built on the material exploitation of workers who struggle to access basic services, appears to have grown twice as much wealth as the rest of the world even during the time of a global health crisis, where most of the people struggled to make ends meet.\nThis highlights that we need to redistribute power, put the people at the heart of just, equal and sustainable world we want.\nThe CSO statement said: At a time when survival and recovery become a privilege for most of us, the richest 1% have continued to remodel economic systems to shift as an inequality-generating machine and veer away from the democratic fabric of the world towards plutocracy. This must raise urgent and unequivocal global attention across the civic space that this is the mouth-to-mouth resuscitation we need to redesign another world that is possible.\nWe stand together across the world, as we share our immense rage, agitation and resistance against this unprecedented economic inequality further exacerbated by the pandemic, war, cost-of-living crisis, and impact of climate change. In doing so, we condemn various facets of inequality— the caste, gender, and disability which intersect deeply with economic deprivation. This comes in line with our deepest solidarity to movements across the world that resist the everyday dehumanisation and loss of dignity in the people’s lives brought by oppression and an insatiable greed for power. From the river to the sea, Palestine will be free. The world belongs to those who care for it, and we shall resist all forms of power that perplex us against the freedom we own, the statement added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:47:19.934Z"
}
