{
  "title": "Third Markhor hunted in Chitral under Trophy Hunting programme",
  "link": "https://www.app.com.pk/national/third-markhor-hunted-in-chitral-under-trophy-hunting-programme/",
  "date_published": "2024-02-19T08:54:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 19 (APP):An American Hunter, Robertson Neil Hall has hunted down a Markhor in Gahirat Gol game reserve in  district, Chitral registering 3rd hunt of current season as part of trophy hunting after paying US dollars 125000 around Rs 34, 875,000 (34.875 million).\nThe eight years old wild male goat had long spiraling horns of around 38 inches and was hunted in Gahirat Gol game reserve.\nUnder the Trophy Hunting programme, four permits are sold annually through auction for hunting of markhors, three in Chitral and one in Kohistan district.\nEarlier two other hunts of markhor had been carried out by foreign hunters in Chitral during current season as part of Trophy Hunting programme launched with the objective of conservation of these rare wild goats.\nTalking to APP, Divisional Forest Officer Wildlife, Farooq Nabi informed that the annual revenue through sale of Markhor Trophy Hunting was witnessing increase by each passing year.\nFor the first time when the scheme was launched in 1990 the hunting permits were sold at price of US dollar 15000 and later gradually the amount increased as foreign hunters kept on coming to Khyber Pakhtunkhwa.\n“Once Markhor was critically endangered wild specie in Pakistan, but due to proper conservation efforts based on monetary gains through sale of hunting permits to foreign hunters, the country has now largest population of the animal,” he apprised.\nUnder the scheme a sense of ownership is being inculcated among communities as 80 percent of revenue generated is spent on development schemes in respective areas of hunting through mutual understanding of local elders. Twenty percent of the revenue generated goes into national kitty.\nPresident Gahirat Conservancy Chitral, Faizur Rehaman when contacted told APP that people of the area are very happy over launching of trophy hunting programme.\nThrough this programme, communities are benefiting in all fields including health, education, and social sector.\nThe amount we receive as our share from trophy hunting programme are being spent on awarding scholarships to brilliant student. Funds are raised for providing healthcare to those ailing persons who cannot afford it, he added.\n“People are now become aware of the benefits of conservation scheme and extend care to wild species and foreign hunters which is a key behind successful protection of Markhor and other wild species in the area,” Fazlur Rehman remarked.\nFarooq Nabi said Chitral Gol National park is habitat of around 3000 markhors among which some have become older which are hunted by stray dogs and other predators.\nIf permission is granted for hunting through creation of a Buffer Zone in Chitral Gol National park, more hunters will come and local community will benefit from more earning through Trophy Hunting Programme, he suggested.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:47:51.835Z"
}
