{
  "title": "Rs 35.6 bln program being launched to eradicate fatal diseases: Health Minister",
  "link": "https://www.app.com.pk/national/rs-35-6-bln-program-being-launched-to-eradicate-fatal-diseases-health-minister/",
  "date_published": "2024-02-19T13:26:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 19 (APP):Caretaker Federal Minister for Health, Dr Nadeem Jan on Monday said that a mega project worth Rs35.6 billion was being launched to eradicate fatal diseases including sugar, HIV AIDs and hepatitis in the country.\nHe said that a Rs six billion program has been prepared for the control of sugar disease besides projects were being launched for the eradication of AIDs HIV.\nHe was addressing a function after inaugurating a modern labour room at the Basic Health Unit (BHU) Kotkay in Charsadda district.\nThe minister said that providing the best healthcare facilities to patients at their doorsteps was the top priority of the government.\nHe said that basic health units are being strengthened in terms of medical staff, equipment and medicines.\nThe minister said the promise of rehabilitation of the flood-affected BHU has been fulfilled and termed the cooperation of the World Health Organization for rehabilitation of the BHU as highly praiseworthy.\nNadeem Jan said that people of the area would now get quality treatment and medicine facilities at their doorsteps.\nThe minister said responsibilities rest on the shoulders of officials of the health department to ensure the best use of the BHU for the betterment of the people.\nHe said that timely availability of the staff and provision of better healthcare facilities was the prime responsibility of the health department.\n“If the performance of BHUs is good then there will be minimum load on big hospitals and precious lives would be saved” he said.\nHe said that a mega project worth Rs35.6 billion was being launched in Pakistan to eradicate fatal diseases including sugar, HIV AIDs and hepatitis besides help its patients.\nNadeem Jan said that a Rs six billion program has been prepared for the control of sugar disease besides projects were being launched for the eradication of AIDs HIV and the patients of Khyber Pakthunkhwa would also be benefited.\nLater, the minister visited the basic health unit Akhun Dheri Charsadda and TB Hospital Baghdada in Mardan where he also inaugurated a training centre. The minister was briefed about these projects.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:47:20.433Z"
}
