{
  "title": "Step up climate change adaptation efforts or face consequences: UN report warns",
  "link": "https://www.app.com.pk/national/step-up-climate-change-adaptation-efforts-or-face-consequences-un-report-warns/",
  "date_published": "2021-11-04T16:21:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Nov 04 (APP): As governments continue their climate talks at COP26 in Glasgow, Scotland, a new report by the UN Environment Programme (UNEP) calls for an increase in funding for climate action to halt a potential ‘huge disruption’.\nThe UNEP published on Thursday its landmark Adaptation Gap Report for 2021 titled ‘The Gathering Storm’,  noting that policies for climate change adaptation, financing and implementation are still far behind where they need to be.\nThe report finds that the costs of adaptation are likely to reach up to $300 billion a year by 2030. It also notes that current pledges point to global warming of 2.7°C by the end of the century.\n“As the world looks to step up efforts to cut greenhouse gas emissions – efforts that are still not anywhere strong enough – it must also dramatically up its game to adapt to climate change,” Inger Andersen, the UNEP Executive Director, said.\nEven if countries were to “turn the tap” off on emissions today, she added, climate impacts would remain, for decades to come.  “We need a step change in adaptation ambition for funding and implementation to significantly reduce damages and losses from climate change,” Ms. Andersen said. “And we need it now.”\nThe UNEP report came as world leaders at COP26 push to limit global warming, in line with the Paris Agreement.  UNEP said greater ambition towards adaptation, particularly for financing and implementation, is also critical to keep existing gaps from widening.\nThe report found the costs of adaption are likely to be at the higher ended of an estimated $140 billion to $300 billion a year by the end of this decade, and $280 billion to $500 billion annually by 2050,  Furthermore, the cost in developing countries is estimated to be between five to 10 times greater than current public adaptation finance flows.\nIn 2019, these nations received some $76.9 billion in climate finance for mitigation and adaptation planning and implementation.  The report also revealed how countries are missing the opportunity to use fiscal recovery from the COVID-19 pandemic to prioritize “green” economic growth that also supports adapting to climate impacts such as droughts, wildfires and floods.\nJust a small portion of the $16.7 trillion in stimulus funding globally has gone to adaptation.  As of June, fewer than one-third of 66 countries studied, had explicitly funded COVID-19 measures to address climate change.\nFuture government spending could also be hampered by the heightened cost of debt servicing, combined with decreased public revenues, particularly in developing countries.  The report’s authors also pointed to areas of progress.\nFor example, nearly 80 per cent of countries have adopted at least one national-level adaptation planning instrument, such as a plan, strategy, policy or law, representing a seven per cent increase since 2020.\nAdditionally, the top 10 donors funded more than 2,600 projects with a principal focus on adaptation, during the period between 2010 and 2019, indicating efforts are growing.\nThat aside, UNEP said countries need to step up public adaptation finance through direct investment and by overcoming barriers to private sector involvement.    They must also consider “higher end climate scenarios”, as detailed in the most recent assessment by UN scientific body, the Intergovernmental Panel on Climate Change (IPCC).\nAdditionally, governments should use post-pandemic fiscal recovery to prioritize interventions that will bring about both economic growth and climate change resilience.\nAuthorities should also establish “integrated risk management approaches”, as well as flexible disaster finance frameworks, the report added, while richer nations should help developing countries “to free up fiscal space”.",
  "retrievedAt": "2025-08-11T21:33:04.564Z"
}
