{
  "title": "Covid-19 deaths show slight uptick amid receding disease prevalence: NCOC",
  "link": "https://www.app.com.pk/national/covid-19-deaths-show-slight-uptick-amid-receding-disease-prevalence-ncoc/",
  "date_published": "2021-11-04T09:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP): The national tally of Covid-19 active cases on Thursday was recorded 22,577 with 580 more people testing positive for the deadly virus and 554 people recovered from the disease during the last 24 hours.\nNineteen corona patients have died during the last 24 hours, 18 of the deceased were under treatment in different hospitals and one of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nOut of the total 19 deceased Covid-19 patients, nine of them expired on ventilators. Most of the deaths occurred in Sindh followed by Punjab.\nThere were 1,247 Covid-19 infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during the past 24 hours was recorded at 1.32 percent.\nThe maximum ventilators were occupied in four major cities including Sargodha 13 percent, Peshawar 17 percent, Lahore 15 percent, and Multan 29 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per the medical requirement of Covid patient) were also occupied in four major cities of Swabi 23 percent, Lahore 20 percent, Sargodha 25 percent, and Multan 37 percent.\nAround 144 ventilators were occupied elsewhere in the country while no Covid affected person was on a ventilator in Azad Jammu and Kashmir (AJK), Balochistan, and Gilgit Baltistan (GB).\nSome 43,901 tests were conducted across the country on Wednesday, including 13,151 in Sindh, 16,260 in Punjab, 10,011 in Khyber Pakhtunkhwa (KP), 3,419 in Islamabad Capital Territory (ICT), 374 in Balochistan, 454 Gilgit Baltistan (GB), and 232 in AJK.\nAround 1,224,085 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,275,158 cases were detected that also included the perished, recovered, and under treatment Covid-19 patients so far, including AJK 34,489, Balochistan 33,280, GB 10,392, ICT 107,022, KP 178,319, Punjab 440,678 and Sindh 470,978.\nAbout 28,496 deaths were recorded in the country since the eruption of the contagion. Around 7,579 people perished in Sindh, eight of them perished out of the hospital on Wednesday.\nIn Punjab, some 12,936 deaths occurred across the province due to Covid-19. Seven of the infected people died in the past 24 hours. Six of them expired in the hospital and one out of the hospital.\nAs many as 5,757 people expired in KP, three of them died in hospitals on Wednesday, 941 individuals died in ICT, one of them expired in the hospital on Wednesday, 356 people died in Balochistan, 186 infected people perished in GB, and 741 people died in AJK.\nA total of 20,966,900 corona tests have been conducted so far, while 640 hospitals are equipped with Covid facilities across the country. Some 1,309 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:33:03.379Z"
}
