{
  "title": "Ex-FATA a future hub of trade, business, employment: NA Speaker",
  "link": "https://www.app.com.pk/national/ex-fata-a-future-hub-of-trade-business-employment-na-speaker/",
  "date_published": "2021-11-04T17:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP):National Assembly Speaker Asad Qaiser Thursday said that implementing FATA reforms in letter and spirit would transform this region into future hub of trade, business and employment.\nWhile stressing on youth, media and Religious representatives of Erstwhile FATA, he said that changing life of common people demand above politics approach by all political leaders.\nHe pledged to continue support of erstwhile FATA people to enable them to enjoy fundamental rights of education, health and employments.\nHe also said that FATA is an area through which all States of landlocked Central Asia can have access to deep sea port of Gwadar.\nHe said that peace in FATA is imperative for progress and development of the country. He expressed these views while addressing the brainstorming session with Ex-FATA representatives of political parties, youth, and Journalist organized by working group on Political Affairs of Special Parliamentary committee on development of Erst-While FATA.\nFederal Minister for Religious Affairs and Interfaith Harmony Pir Noor-ul-Haq Qadri welcomed participants and briefed the Participants about the TORs of Special Parliamentary committee on development of Erstwhile FATA and he appreciated the commitment of Speaker National Assembly for resolving post merger challanges of Ex-FATA.\nHe also said that this is third meeting organized by working group on Political Affairs to evolve consensus on Land, Judicial, infrastructure development and allocation of three percent share in NFC for ex-FATA development.\nHe said that basic health facilities, Education and basic Infrastructure are rights of people of FATA and being public representatives it is our duty to enable people of FATA to enjoy these rights. He also briefed the participants this committee and working group would soon visit all provinces and would try to build consensus for agreeing provinces for three percent share of NFC for development of Ex-FATA.\nSAPM on Establishment Mohammad Shehzad Arbab appreciated the formulation of this parliamentary committee and also highlighted post merger challenges to Ex FATA people.\nHe said that FATA merger is milestone to change the fate of the common people. He said that FATA has been worst impacted area due to war on terror and now is a time to change the fate of the people of FATA. He said that transition issues are reality and resolving these need political ownership.\nHe said that judicial system is new to FATA beside land disputes, settlement matters, mines and mineral and establishment FATA development authority. He also talked about nonexistent of municipal services in Ex- FATA and said that these can be introduced with little finance by KPK government.\nShakahrur Ullah Mohamand Representatives of Ex-FATA journalist said that student’s quota in different university and college for merger districts should be enacted. He also talked about increasing land disputes and urgent need of land reform in merger district.\nEx- FATA youth representative Nizamauldin mentioned about the report prepared by Shahzad Arbab where post merger challenges were already mentioned. He demands for allocation of three percent Share in NFC for Ex-FATA and strengthening Ex-FATA re- organization. He also said that this report is comprehensive and in hindsight indicated all post merger challenges of financial and administrative nature.\nLater on National Security Advisor Moeed Yousif called on Speaker National Assembly Asad Qaiser.\nSpeaker Asad Qaiser said that peace in Afghanistan is vital for regional development. He said that opening border markets and regularizing border business will change the fate especially of FATA people.\nHe said that irregular economy of border areas need to be regularized. Mooed Yousif said that Parliamentary ownership for reforms in FATA is of pivotal importance. He also appreciated Speaker effort in this regard.",
  "retrievedAt": "2025-08-11T21:33:04.529Z"
}
