{
  "title": "Portal to register families under Ehsaas Rashan to open from Nov 8: Dr. Sania",
  "link": "https://www.app.com.pk/national/portal-to-register-families-under-ehsaas-rashan-to-open-from-nov-8-dr-sania/",
  "date_published": "2021-11-04T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 4 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr Sania Nishtar Thursday announced that a web portal to register families under the new initiative of Ehsaas Rashan will open from November 8.\n“Realizing the difficulties of the common people amid inflation, the Ehsaas Rashan program is being launched after a thorough planning including field testing, proof of concept, piloting and technology measures”, the SAPM said while addressing a press conference here.\nThis program will benefit 20 million families and overall 130 million people nationwide including those already registered under the Kafalat program.The beneficiaries will be identified with the help of the new Ehsaas National Socio Economic Registry (NSER) Survey, she said.\nShe said the Ehsaas Rashan Program will provide a subsidy of Rs 1,000 per month to each of the 20 million families on the purchase of flour, pulses, ghee or cooking oil.\nThose who want to get benefit from this program must have their valid registered mobile numbers with their Computerized National Identity Card (CNIC), she stressed.\nThe registered buyers will be able to purchase Rashan from the designated kiryana or utility stores on 30 percent subsidy after issuance of Rashan cards to them.\nThe list of eligible people for availing this benefit will be displayed within three or four weeks after scrutinizing process with the help of Ehsaas database while the Kiryana stores will be registered meanwhile, she said.\nEhsaas has developed a digitally enabled mobile point of sale system in collaboration with National Bank of Pakistan (NBP) to serve beneficiaries through a network of kiryana stores all over the country.\nAbout the procedure, Dr. Sania conveyed that the Kiryana merchants will require downloading the relevant app on their android phones, enter CNIC numbers of the customers and pass on the benefits after authentication from back end immediately.\nThe customer will receive a verification code which would be entered by Kiryana merchant in the app. “Such system has been developed to prevent corruption and abuse”, she said.\nDr Sania hoped that this system will be functional within three to four weeks soon after the completion of registration process.\nThe kiryana merchants having a valid bank account to receive the subsidy amount from any corner of the country will be eligible to register under this program after physical verification.\nDr Sania said that the government will also give profit to the registered merchants on the subsidy amount to encourage them serve maximum people.\nShe said that Ehsaas Rashan will cover 20 million households across Pakistan with a poverty score of less than 39 and an income of Rs. 31,000 per month.\nThe SAPM said that as per our estimate, 60 percent population of Pakistan will be benefited from this program.\nDr Sania said that this is the beginning, however as soon as benefits of this program will be extended to the people, the amount can be increased along with introducing more benefits through utilizing this system.\nShe observed that this program is being launched in view of mitigating suffering of people due to inflation which is overall impacting the world.\nShe said that Ehsaas has gathered socio-economic data of 38 million household which has made easier to launch new programs.\nTo a question, Dr Sania said that small Kiryana stores in rural areas will be encouraged to be a part of this initiative. “An accelerated drive will be launched for the awareness and education of merchants”, she said.\nTo another question, she explained that the government employees having less than 31,000 will be eligible to apply for this program while those who travel abroad for job purposes would not be excluded as per cabinet unanimous decision.\nTo a question, Dr Sania said that Rs. 120 billion subsidy is being given under this program. The provincial governments will contribute 65 percent budget while the share of federal government will be 35 percent. “Confirmation from Sindh and Balochistan is awaited while other provinces have confirmed”.\nTo a question about IMF reaction over this program, Dr Sania said that Advisor to Prime Minister, Shaukat Tarin is having discussions with IMF in this regard. “IMF knows that we are transparently implementing this program to provide relief to the inflation stricken people”, she added.",
  "retrievedAt": "2025-08-11T21:33:09.446Z"
}
