{
  "title": "Razak hails propose legislation for GSP- plus in post-2023",
  "link": "https://www.app.com.pk/national/razak-hails-propose-legislation-for-gsp-plus-in-post-2023/",
  "date_published": "2021-11-04T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 04 (APP): The Adviser to Prime Minister on Commerce and Investment,  Abdul Razak Dawood welcomed the newly proposed legislation for Generalized Schemes of Preference (GSP- plus)  for post-2023 by ‘The European Commission’.\nHe told the audience that Pakistan had already acceded to the 6 new Conventions under the proposed New GSP Regulation, said a press release.\nAdviser for Commerce, hosted a dinner in the honor of the members of the European Union Parliament here.\nThe four-member delegation of the European Parliament headed by Mr. Nicola Procaccini, Member of the Committee on Civil Liberties, Justice and Home Affairs, comprised Ms. Heidi Hautala, European Parliament Vice-President and Rapporteur on the GSP regulation, Mr. Luis Garicano, Member of the Committee on Economic and Monetary Affairs, and Mr. Tomas Zdechovsky, Vice-Chair of the Committee on Employment and Social Affairs.\nThe dinner was also attended by Ms. Androulla Kaminara, Head of the EU delegation in Islamabad, as well as ambassadors of the EU member states to Pakistan.\nSpeaking at the occasion the Adviser to Commerce reaffirmed that Pakistan was committed to the full implementation of the UN conventions related to GSP Plus, however, it also wants European partners to be mindful of its challenges.\nHe appreciated the European member States for their support for Pakistan in securing the GSP Plus status and its continuity in last three reviews conducted by European Parliament and hoped that the forthcoming fourth biennial review would also be successful.\nThe Adviser to Prime Minister for Commerce and Investment, said that the visit of the delegation could not be timed better as the Fourth Biennial Review of GSP Plus to Pakistan was in process and would be completed in the coming months.\nHe noted that the European Union was one of the largest trading and investment partners of Pakistan.In FY 2020-21, total bilateral trade with EU-27 was US$ 10.88 billion.\nThe Adviser reiterated that Generalized Schemes of Preference (GSP Plus) had a positive synergy with government’s social agenda. It has helped Pakistan in attainment of level playing field in the European Market on one hand and acted as a catalyst to undertake necessary social reforms, on the other.\nHead of the EU delegation in Islamabad, Androulla Kaminara, appreciated the whole of government approach and the institutional mechanism put in place by Pakistan for implementation of the various commitments under GSP Plus.\nMember of the Committee on Civil Liberties, Justice and Home Affairs, and head of the visiting delegation Mr. Nicola Procaccini, appreciated the progress made by Pakistan despite challenges on its commitments pertaining to Human Rights, Environment and Climate Change, Labor Rights etc.\nUnder GSP Plus and reiterated EU’s support for promoting universal values and creating enabling environment for the implementation of 27 UN Conventions in the beneficiary countries including Pakistan.",
  "retrievedAt": "2025-08-11T21:33:07.620Z"
}
