{
  "title": "First lady urges LHWs to educate people about perils of breast cancer",
  "link": "https://www.app.com.pk/national/first-lady-urges-lhws-to-educate-people-about-perils-of-breast-cancer/",
  "date_published": "2021-11-04T15:12:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Nov 04 (APP): First Lady, Begum Samina Alvi here on Thursday eulogized the Lady Health Workers (LHWs) for fighting against different diseases and urged them to play role  for creating awareness among the masses about breast cancer which was spreading in Asia very fast.\nShe expressed these views while speaking at an awareness session about breast cancer held at Basic Health Unit (BHU) Gulshan Rehman Colony on Kohat road.\nWorld Health Organization (WHO) Representative in Pakistan, Dr. Mahipala Palitha along with other officials was also present on the occasion.\nThe first lady said breast cancer was an alarming issue affecting lives of a large number of females in the country and there was a dire need for creating awareness about this serious disease.\nBegum Samina Alvi said she has dedicated herself to this cause and going city to city to apprise people, especially women folk about seriousness of the disease.\nShe said if awareness was created, the people would take remedial measures and a large population would be protected from becoming seriously ill.\n“Early diagnosis of breast cancer reduces chances of mortality and in 97 percent of cases, recovery is made, but if the disease gets old in diagnosis than it has very serious implications,” she warned.\nThe first lady also stressed on the need of research to find out reasons that caused this affliction.\nShe said she was also focusing on improving health facilities at government hospitals and to equip every health center with all necessary treatments.\nEvery department should have to play its role in that regard as health was a very important sector which needed special attention, she continued.\nBegum Samina Alvi said women played very important role in nurturing the children and smooth running of families and for that purpose they performed multi tasks and often ignored their own health.\n“If a women is healthy, the whole family will be in better condition, but if a mother health is not well, all will suffer,” she added.\nShe said it was a matter of concern that death rate due to breast cancer in Asia was 45 percent which was higher than other regions and the main reason behind it was lack of awareness among the people.\nThe first lady advised LHWs to also educate women folk about healthy diet, necessary exercises and better nutrition.\nShe also raised voice for disabled persons and said they also deserved attention of the health workers and their relatives.\nShe also requested WHO representative in Pakistan to take measures and involve disabled persons in different social and vocational activities.\nShe said women should take benefit of different schemes of loans offered by different banks on easy terms.\nThrough such schemes, they could stand on their feet and contribute in nation building besides supporting family, she added.\nEarlier, two lady health worker informed the first lady about the procedure adopted for informing women about symptoms of breast cancer and measures for keeping them safe.\nWHO Representative in Pakistan, Dr. Mahipala Palitha in his speech appreciated the services rendered by first lady for creating awareness about the breast cancer.\nHe said treatment of breast cancer was very difficult and costly and therefore awareness about the disease was very necessary for saving people from this physical and mental trauma.\nWHO, he continued, had trained LHWs in Khyber Pakhtunkhwa about information on serious diseases.\nLater, the first lady visited different sections of the BHU and also distributed certificates among the LHWs.",
  "retrievedAt": "2025-08-11T21:33:07.276Z"
}
