{
  "title": "Cabinet approves amendments in ECL Rules: Interior Minister",
  "link": "https://www.app.com.pk/national/cabinet-approves-amendments-in-ecl-rules-interior-minister/",
  "date_published": "2022-04-22T15:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Interior Minister Rana Sana Ullah on Friday said the Federal Cabinet had approved amendments in the Exit Control List Rules that after 120 days the name of a person would atomically be deleted from the ECL in case allegations were not proved.\nAddressing his maiden press conference after assuming the charge of the ministry, the minister said Prime Minister Shehbaz Sharif, soon after taking oath of the office, paid attention towards the grave issue and set up a committee to come up with the amendments in ECL Rules within three days.\nThe committee comprising Sardar Ayaz Sadiq, Azam Nazir Tarar, Syed Naveed Qamar and Maulana Asad Mehmood completed the task within the stipulated time, he added.\nRana Sana Ullah said in the past, the people were put unnecessarily in the ECL to pressurize them. The National Accountability Bureau (NAB) was also used to pressurize the opponents of the then government, he added.\nThe minister said currently names of 4,863 persons were on the ECL and the amendments would benefit around 3,000 of them.\nHe said initially the name of a person could be put on the ECL for 120 days, and the time period could be extended further till 90 days, but for that the government would have to provide solid proofs.\nHowever, he said, the accused involved in terrorism, anti-state activities or those whose names were put on the court orders, would not get any relief from the amendments.\nThe ECL Rules were amended purely on merit and would be for all the citizens, he added.\nThe minister said it was also decided to review the black list, which currently had names of over 30,000 people. He expressed the hope that the task would also be done within weeks.\nOn the directives of PM Shehbaz Sharif, he said, foolproof security was being provided to former prime minister Imran Khan. “The security as approved by the former PM’s principal secretary Azam Khan Azam is being provided to Imran Khan.”\nHe said the former PM had written to the government for providing foolproof security in the wake of threats to his life.\nReplying to a question, he said no case would be registered against anyone on political ground. A case would be filed only after a thorough inquiry and on the basis of solid evidence, he added.\nTo another question, he said a detailed discussion was held in the meeting of National Security Committee (NSC) on the telegram received from Pakistan Embassy in Washington. No evidence of any conspiracy was found in it, he added.\nTo a query, the minister said in the past, the ECL was used for political victimization of the opponents only.",
  "retrievedAt": "2025-08-11T14:44:30.084Z"
}
