{
  "title": "National Security Committee finds no foreign conspiracy in telegram",
  "link": "https://www.app.com.pk/national/national-security-committee-finds-no-foreign-conspiracy-in-telegram/",
  "date_published": "2022-04-22T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): The National Security Committee, after reviewing its contents, the assessments and conclusions by the security agencies, Friday concluded that there had been no foreign conspiracy in the telegram received from Pakistan’s embassy in Washington.\nChaired by Prime Minister Shehbaz Sharif, the 38th meeting of the NSC of the Cabinet discussed the telegram received from the Pakistan embassy in Washington.\nThe former Ambassador of Pakistan to the US Asad Majeed Khan briefed the Committee on the context and content of his telegram.\n“The NSC, after examining the contents of the communication, reaffirmed the decisions of the last NSC meeting,” said a PM Office press release.\nThe NSC was again informed by the premier security agencies that they had found no evidence of any conspiracy.\n“Therefore, the NSC after reviewing the contents of the communication, the assessments received, and the conclusions presented by the security agencies, concludes that there has been no foreign conspiracy,” it added.\nThe meeting was attended by Federal ministers Khawaja Muhammad Asif, Rana Sanaullah, Marriyum Aurangzeb, Ahsan Iqbal, Minister of State Hina Rabbani Khar, Chairman Joint Chief of Staff Committee General Nadeem Raza, Chief of Army Staff General Qamar Javed Bajwa, Chief of Naval Staff Admiral Muhammad Amjad Khan Niazi, Chief of Air Staff Air Chief Marshal Zaheer Ahmad Babar, former Pak Ambassador to US Asad Majeed and senior civil & military officers.\nOn March 27, former Prime Minister Imran Khan, while waving a letter, had told a public gathering that in a meeting with Pakistan’s ambassador, a US government official had threatened Pakistan for repercussions if the no-confidence motion against him failed. However, if Imran Khan is ousted, the United States would forgive all of its wrongdoings.\nCiting the very communication, the ex-prime minister had contended that the United States had hatched a regime change conspiracy in Pakistan.",
  "retrievedAt": "2025-08-11T14:44:31.665Z"
}
