{
  "title": "‘Economic terrorism’, autocratic steps hallmarks of Imran’s rule: Marriyum",
  "link": "https://www.app.com.pk/national/economic-terrorism-autocratic-steps-hallmarks-of-imrans-rule-marriyum/",
  "date_published": "2022-04-22T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Friday ‘economic terrorism’ and autocratic steps like attack on the Parliament and the Constitution were hallmarks of the four-year misrule of the Pakistan Tehreek-e-Insaf Chairman Imran Khan.\nImran Khan had attacked the Constitution as he tried to scuttle the constitutional move to remove him from the prime minister’s office through a vote of no-confidence, but ironically he was asking others for course correction, she said while talking to the media.\nMarriyum asked Imran to apologise to the nation for skyrocketing prices of staple food items and medicines by unleashing ‘economic terrorism’ during his four years of rule.\nHe had failed to fulfill his claim of providing 10 million jobs, and instead rendered some 6 million people jobless due to his bad governance, she added.\nShe accused Imran of patronizing cartels and mafias, which led to increase in the prices of wheat flour, sugar and medicines.\nRidiculing Imran for repeating a speech ad nauseam, she said his lies and arrogance had no end.\nImran Khan was involved in money laundering through foreign funding of his party, she said, adding the case of PTI funding was being heard by the Election Commission of Pakistan.\nShe said the country was reeling under the burden of record debts taken by Imran-led government, and the masses were suffering the consequences of his ‘economic terrorism’.\nImran had lost the confidence of people and ousted from the power through a democratic way of no-confidence move by the true public representatives, she added.\nThe minister said Toshakhana was the country’s Baitul Mal and Imran Khan, the so- called head of the “State of Madina” robbed it.\nShe said the PTI leadership made a hue and cry about self-respect and honour, but they made compromise on the Kashmir issue as Indian PM Narendra Modi had illegally annexed the state during their tenure.\nImran Khan was in fact the campaign manager of Modi’s reelection, she added.\nTaking a dig on the PTI leadership, she said they claimed to have won another World Cup after Imran’s visit to the United States.\nBlasting the former PM, she said Imran Khan had converted the Prime Minister’s chair into a ‘merchant’s shop’. It seemed that he had bought the Toshakhana gifts with themoney borrowed from other people.\nMarriyum said elections were the right of the people, which would will be held on time in a transparent and fair manner. “There will be no failure of RTS like 2018, nor the returning officers will be abducted or ballot boxes stolen like the Daska bye-elections,” she added.\nThe minister said Imran last night claimed that Farah Gujjar could not be held accountable as she held no public office, but he should remember that he had ordered to handcuff a daughter in front of her father, who was also not a public-office holder.“Maryam Nawaz was targeted as a retaliation,” she recalled.\nShe said there was a contradiction in the words and deeds of Imran Khan, who had been telling lies to the nation for the past four years and delivering similar speeches.\nShe said the media was suppressed during Imran Khan’s rule. Notice had been taken of the organized campaign against the institutions through robotic social media networks and those involved would be taken to task, she added.\nThe minister said today the people of Pakistan were forced to pay expensive electricity and gas bills due to sheer bad governance of the PTI government.\nThe present government having representation of all the federating units, would make difficult decisions for the people’s betterment and economic revival, she added.",
  "retrievedAt": "2025-08-11T14:44:32.248Z"
}
