{
  "title": "76.7% youth believes EVMs helpful for free, fair & credible elections: Pildat",
  "link": "https://www.app.com.pk/national/76-7-youth-believes-evms-helpful-for-free-fair-credible-elections-pildat/",
  "date_published": "2022-04-22T11:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 22 (APP):Around 76.7 per cent youth of the country believed that Electronic Voting Machines (EVMs) will be helpful in organizing free fair and credible elections, said a survey conducted by Pakistan Institute of Legislative Development and Transparency (Pildat).\nWhereas 22.1 per cent youth believed that the gadgets would not be helpful for the purpose, according to the survey conducted among the 422 members and alternates of PILDAT’s Youth Parliament Pakistan spread over 232 (85.3 %) of total 272 National Assembly Constituencies in addition to Azad Kashmir, Gilgit Baltistan and Overseas Pakistanis from April 07 to April 12, 2022. “Reasons for low Youth Voter Turnout, Poor Performance of Politicians tops as key reason as 42.3% of youth respondents believe that the poor performance of politicians is the key reason for abysmally low youth voter turnout, followed by low level of trust in Political Parties (42%) and the poor past performance of Election Commission (37.5%).”\n“What makes youth support a political party?&nbsp;37.9% of the respondents are motivated to support a political party due to its past performance, 36.5% base their support on the party’s election manifesto while 17.5% are motivated by the charismatic head of the party.”\n“Large Majority supports revival of Students’ Unions across Pakistan as a&nbsp;significant portion (81.1%) of the young respondents agree over students’ unions being allowed once again, in all public and private educational institutes of Pakistan while 16.9% are in disagreement over their revival.”\n“Youth View on Pakistan government stance regarding Russian invasion of Ukraine as over&nbsp;the recent Russia-Ukraine Resolution passed by the UN General Assembly, 70.1% of the young respondents supported the Pakistani government’s decision to abstain from voting on the resolution. 20.6% supported the idea of voting in favour of the resolution while 5.5% favoured voting against it.”\n“Major Challenges faced by Pakistan; Inflation tops the list&nbsp;as ranking the challenges faced by Pakistan today, 48.7% youth believes that inflation is the greatest challenge faced by the country, followed by unemployment (45.6%) and the poor quality of education across educational institutions in the country (36.3%).\n96% youth feels strongly for Local Governments&nbsp;as&nbsp;95.9% of the young individuals surveyed believe that public problems can never be effectively solved without strong local governments.” “Despite weaknesses & setbacks, Democracy receives Overwhelming support from Youth&nbsp;as&nbsp;84.9% of the respondents agree that democracy, despite its weaknesses, is the best system for our country.”\nThe Voice of Youth is a report series by PILDAT’s Youth Parliament Pakistan which aims to showcase the input acquired from the largest and most representative group of Pakistani youth (aged 18-29 years) spread over all provinces and territories of Pakistan and places of key concentration of Overseas Pakistanis around the globe on several socio-political and economic issues and challenges faced by them. This edition’s theme is&nbsp;’Current Affairs at a Glance’. Under this month’s edition, YPP conducted a public opinion survey from its members of Youth Parliament to seek their input regarding current socio-economic and political situation of Pakistan.",
  "retrievedAt": "2025-08-11T14:44:32.930Z"
}
