{
  "title": "NAB DGs conference concludes with the pledge to provide swift support to victims of public scams",
  "link": "https://www.app.com.pk/national/nab-dgs-conference-concludes-with-the-pledge-to-provide-swift-support-to-victims-of-public-scams/",
  "date_published": "2024-10-24T18:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): The three-day 24th “DGs Conference” of the National Accountability Bureau concluded at the NAB headquarters Islamabad reaffirming the commitment to provide speedy relief to the affectees of public scams.\nChaired by Chairman NAB Lt Gen (Retd) Nazir Ahmed, the conference was attended by Deputy Chairman NAB Sohail Nasir, Prosecutor General Accountability Syed Ihtesham Qadir Shah, DGs of Divisions at NAB Headquarter and Regional Bureaus, Advisors and other senior officers.\nOn this occasion, it was informed that through the efforts of NAB, during the last 6 months, NAB made record direct and indirect recoveries of more than 4 trillion rupees.\nIn the three-day conference, the Director Generals, advisors and heads of various departments of NAB headquarters and regional offices presented detailed reports on the performance of their departments.\nThe conference thoroughly deliberated the performance of all regional bureaus, divisions and cells and reviewed measures taken by NAB to further enhance its performance and efficiency.\nIn the conference, the heads of regional offices of NAB presented their performance report in which it was stated that during the last one year, Karachi and Sukkur regions made indirect recoveries of 2.5 trillion rupees by recovering forest land on an area of 1.8 million acres and a formal report was submitted to the Chief Minister of Sindh after recovering forest land from land grabbers. The cooperation of the provincial government of Sindh in this regard was highly appreciated.\nApart from this, NAB Karachi recovered Rs 1189 million through settlement. Similarly, National Accountability Bureau Sukkur recovered 631,352.26 acres of forest land worth Rs 1,103.5128 billion as indirect recovery. While NAB Khyber Pakhtunkhwa has made indirect recoveries of Rs 194,937 million. NAB Lahore said that in 2023-24, 23786.158 million rupees were recovered and returned to 31,038 victims in cases of public at large cheating. Similarly, NAB Rawalpindi is also playing an important role in recovering money in major cases of fraud and returning back money to the victims, while NAB Multan and Quetta performed well to serve the country and the nation by making significant recoveries.\nThe meeting was informed that at present 724 inquiries and 217 investigation cases are in progress and the number of references under hearing is 821. While 16429 complaints have been dealt with since January 2024.\nThe conference also discussed the auctioning of confiscated and frozen properties under various cases and it was decided that the best strategy should be adopted in the auctioning process of the frozen and confiscated properties and amount should be returned to the affectees so that they can get relief without delay. The confiscated properties of various organizations should be returned after following legal action.\nIn the conference, while reviewing the delay in the decisions of the old pending cases and the status of inactive accountability courts, it was emphasized that better efforts should be made to solve the pending cases in the Supreme Court and the High Courts and the matter of the inactive accountability courts should be taken up at the relevant forum to make them functional in the better interest of nation.\nIn the conference, it was decided to register cases under the Anti-Money Laundering Act against money launderers.\nIn the conference, the endeavors of (A&P) Division were also reviewed and it was emphasized that the already existing (Character Building Societies) should be strengthened and fully activated for creating awareness against corruption among the youth and future generation with dedication so that everyone stands against corruption.\nThe conference also reviewed the performance of the Training and Research Division and appreciated the performance of T&R Division and Pakistan Anti-Corruption Academy (PACA) in providing quality training courses to NAB officers as well as investigating officers of local and international agencies.\nVarious policy decisions were also deliberated in the meeting regarding restructuring of NAB and the transfer policy of officers and their incentives were reviewed and several decisions were taken to improve the performance.\nThe conference was informed that in this one year, Intelligence Directorate of NAB has arrested 50 POs and 78 absconders involved in NAB cases and 12 persons involved in fraud by impersonating themselves as senior NAB officers.\nChairman NAB Lieutenant General Retired Nazir Ahmed while appreciating the performance of NAB emphasized that maximum and prompt relief should be given to the public and affectees of cheating public at large cases by returning their money. He said that NAB has so far made direct and indirect recoveries of 6.1 trillion rupees since its inception. He further said that the new reforms introduced in NAB and the establishment of Accountability Facilitation Centers for Members of Parliament, Members of Provincial Assemblies, Businessmen and Bureaucrats have increased the reputation of NAB and these measures have increased the public’s trust in NAB.\nChairman NAB emphasized to ensure that the investment, economic and economic development in the country should not be affected in following up the cases keeping in mind the national objectives. He said that due to the tireless efforts of NAB officers, Pakistan’s rank in the global anti corruption index has improved, which is very gratifying and more efforts must be made to make further improvement in this regard. Chairman NAB said that NAB is harmonizing the performance of NAB with the contemporary requirements and public expectations by using modern technology keeping in mind better strategy, professionalism and transparency so that better results can be achieved.\nChairman NAB in his concluding remarks said that NAB officers who have outstanding performed their duties day and night with dedication will be recommended for award of Civil Awards to the federal government.\nEarlier, Deputy Chairman NAB Sohail Nasir said that the purpose of organizing the DGs conference is to review the performance of NAB as a whole and prepare a plan for the future in the light of the suggestions of experts and officers, which will improve the quality of performance.\nDuring the conference, Director Generals and other participants presented their suggestions for effective implementation of NAB reforms.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:19:01.897Z"
}
