{
  "title": "Will not sit idle until Pakistan purged of poliovirus: PM",
  "link": "https://www.app.com.pk/national/will-not-sit-idle-until-pakistan-purged-of-poliovirus-pm/",
  "date_published": "2024-10-24T09:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): Prime Minister Shehbaz Sharif on Thursday paying tribute to the efforts and sacrifices of the polio workers, and support by the international partners, reiterated his government’s resolve to make Pakistan a polio-free country to save the future of millions of children.\nThe prime minister, addressing an event held on World Polio Day dedicated to recognise the sacrifices of the polio workers, said that the resurfacing of the polio cases in the country required reuniting the efforts to fight the menace.\nHe reaffirmed that the government would face the challenge with an unwavering commitment to purge the country of this crippling disease.\nThe prime minister, who earlier launched a nationwide polio vaccination drive by administering polio drops to the children, appreciated the support from international partners including the World Health Organisation, UNICEF, and Bill and Melinda Gates Foundation, who had contributed to Pakistan’s efforts to fight out the polio.\n“With this commitment, we will meet success and polio will be pushed out of the country and will never be allowed to resurface,” he resolved, and also appreciated the Saudi government’s support.\nCalling them the “real heroes” the prime minister paid tribute to the sacrifices of the polio workers in the the polio eradication efforts and also distributed shields among the family members of the martyred polio workers and also to those who sustained injuries during the polio vaccination drives.\n“Around 40 cases have been reported across four provinces. Today, we make a pledge to handle these cases effectively. We will not sit idle until the virus is eliminated from the country. This is a challenge which we have accepted,” he remarked.\nPrime Minister Shehbaz said the existence of polio only in Pakistan and Afghanistan was a matter of concern and a challenge that needed to be handled through concerted efforts.\nIn his address, Coordinator to PM on National Health Services Dr Mukhtar Bharath said the constant oversight of the polio eradication efforts at the prime ministerial level was unprecedented which also gave hope for Pakistan to get rid of the virus.\nHe assured the government’s all-out support to the polio workers and said the event was also held to acknowledge their dedicated efforts and sacrifices.\nHe said the surge in polio cases, caused by an immunity gap, was a matter of concern and resolved that the polio vaccination teams would reach every household to vaccinate every child to ensure no one was left behind.\nPrime Minister’s Focal Person on Polio Eradication Senator Ayesha Raza said considering the surge in polio cases, the government had launched a strategy to cope with the challenge with renewed vigour.\nShe also thanked the prime minister for personally overseeing the anti-polio efforts and expressed the hope that such dedication, repeated vaccination and efforts by the polio workers would make Pakistan a polio-free country soon.\nShe said under the polio vaccination drive, around 400,000 polio workers would be deployed to administer polio vaccines to around 45 million children.",
  "retrievedAt": "2025-08-10T20:18:28.265Z"
}
