{
  "title": "Climate Change ministry signs nitric acid mitigation pact to boost climate action",
  "link": "https://www.app.com.pk/national/climate-change-ministry-signs-nitric-acid-mitigation-pact-to-boost-climate-action/",
  "date_published": "2024-10-24T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): The Ministry of Climate Change and Environmental Coordination signed the crucial Nitric Acid Climate Action Group (NACAG) Statement of Undertaking (SoU), committing to reduce nitrous oxide emissions in the country’s nitric acid industry.\nThe signing ceremony was attended by First Secretary at the German Embassy; Janine Rohwer, and Coordinator for Energy, Climate Change and Just Transition at GIZ Pakistan, Wolfgang Hesse.\nThe Coordinator to the Prime Minister on Climate Change, Romina Khurshid Alam confirmed present government’s intention to implement policies to cut nitrous oxide emissions from nitric acid production in the long-term, a news release said.\nFollowing this decision by the Ministry of Climate Change and Environmental Coordination, Fatima Fertilizers Multan Plant has become eligible for financial support from the NACAG Secretariat to install catalysts for mitigating nitrous oxide emissions and measuring technology in its production facilities.\nAddressing the SoU signing ceremony, PM’s climate aide Romina Khurshid Aam said that with the SoU signing with the private sector, Pakistan has become the 11th country to formally sign the understanding of collaboration, alongside Argentina, Colombia, Georgia, Jordan, Mexico, Peru, Thailand, Tunisia, Uzbekistan, and Zimbabwe to reduce over four million tons of CO2 equivalent emissions annually in the country’s nitric acid sector.\n“Today marks a significant step forward in Pakistan’s efforts to combat climate change and advance sustainable development. The NACAG initiative plays a vital role in our climate action strategy, and we are grateful for the support from the German government and GIZ,” Romina Khurshid Alam remarked.\nThe nitrous oxide emission reduction potential in the fertilizer sector in Pakistan has been estimated at around 1.86 million tons of Carbon dioxide equivalent (CO2eq) per year. Nitrous oxide is an odorless, colorless, non-flammable gas. Its global warming potential is nearly 300 times that of carbon dioxide over a 100-year time scale.\nThe coordinator to the Prime Minister reiterated Pakistan’s commitment to reduce the country’s greenhouse gas emissions by aligning national actions with international agreements like the Paris Agreement.\nIn April 2020, Pakistan declared its commitment to helping ensure abatement of N2O from nitric acid production by signing the N2O Mitigation Declaration, she recalled, adding that nitric acid producers in Pakistan became eligible for over 7 million euros grant for advanced abatement technology and monitoring equipment.\nSecretary at the Ministry of Climate Change and Environmental Coordination, Aisha Moriani highlighted the importance of the nitrous oxide emissions initiative, saying the NACAG initiative would be crucial in helping Pakistan meet its carbon mitigation targets by reducing nitrous oxide emissions from the nitric acid sector.\nShe said further that besides reducing nitrous oxide emissions, the initiative would bring other environmental and economic benefits ranging from cleaner air and better public health to the promotion of green technologies and the creation of jobs in the green sector.\nParliamentary Secretary of the Climate Change and Environmental Coordination Ministry, Ahmed Atteeq Anwar said that signing of the SoU with the private sector for tackling global warming causing GHG emissions demonstrates the intention of the government to support the private companies to contribute their part to achieving national environmental sustainability and climate resilience goals of the country.\n“We are particularly encouraged by the active participation of the private sector in our climate mitigation efforts as the present government strongly recognises that real progress in the fight against climate change depends on the involvement of businesses and industries,” he remarked.\n“The signing of this commitment highlights the power of international cooperation in tackling greenhouse gas emissions and building a greener, more sustainable future” said Janine Rohwer, highlighting that the German Development Corporation is providing over 7 million euros in grant financing through the NACAG initiative.\nNitric acid is a crucial material for the production of nitrogen fertilizer and thus a very important component for food security.\nThis initiative will also bring other environmental and economic benefits, from cleaner air and better public health to the promotion of green technologies and the creation of jobs in the green sector.\nThe Ministry of Climate Change commended Fatima Fertilizer as a leader in their commitment to climate action. Director Operations, Inamullah Naveed Khan added that Fatima Fertilizer (Multan Plant) was the first industrial unit to install the Clean Development Mechanism in 2007 and subsequently at their Sadiqabad Plant in 2011.",
  "retrievedAt": "2025-08-10T20:17:27.465Z"
}
