{
  "title": "USF CEO calls for increased breast cancer awareness, early detection",
  "link": "https://www.app.com.pk/national/usf-ceo-calls-for-increased-breast-cancer-awareness-early-detection/",
  "date_published": "2024-10-24T14:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): CEO of the Universal Service Fund (USF), Chaudhry Mudassar Naveed, on Thursday highlighted the importance of raising awareness and promoting early detection of breast cancer in Pakistan.\nSpeaking at the “Breast Cancer Awareness Walk” organized by USF at Fatima Jinnah Park (F-9), he urged mothers to initiate conversations with their daughters about the disease, noting its hereditary nature and the critical need for regular check-ups.\n“Mothers must instil the habit of regular check-ups in their daughters. Early detection is key, and proactive measures can save lives,” said Mudassar Naveed.\nThe event drew significant participation, including notable figures such as Joint Secretary of the Ministry of IT & Telecom (MoITT), Ms. Saima Ahad, renowned oncologist Dr. Muhammad Farrukh, USF employees, and women from various backgrounds.\nChaudhry Mudassar Naveed pledged USF’s support for government initiatives and organizations working to combat breast cancer in the country.\nHe encouraged more people to join the movement to raise awareness, reiterating that early detection and prevention are essential in the fight against breast cancer. “Protecting women is preserving generations,” he added.\nUSF, under the Ministry of IT & Telecom, is committed not only to bridging the digital divide but also to supporting vital social causes, including health awareness, he added.\nJoint Secretary MoITT, Saima Ahad, addressed the gathering, stressing that the government is utilizing multiple channels to spread awareness about breast cancer, particularly in small towns and rural areas.\nShe called on the media to use their platforms to educate the public about self-examinations and the importance of seeking medical help at the earliest signs of abnormalities. “Together, we can break the silence and save lives,” she stated.\nThe awareness walk, held in recognition of Breast Cancer Awareness Month, aimed to raise awareness about breast cancer symptoms, support early detection efforts, and promote a healthier, more informed community.\nRenowned oncologist Dr. Muhammad Farrukh highlighted that breast cancer is curable if detected early. He recommended monthly self-examinations, annual check-ups with healthcare professionals, and early screening for women at risk.\nHe also pointed to socio-cultural barriers, such as stigmatization and discomfort with male doctors, which prevent women from seeking timely treatment. “Breaking these barriers is crucial for effective breast cancer management,” Dr. Farrukh stressed.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:17:54.404Z"
}
