{
  "title": "Naqvi meets Azerbaijan’s Minister of State for internal affairs Ismat Rashid Aliyev",
  "link": "https://www.app.com.pk/national/naqvi-meets-azerbaijans-minister-of-state-for-internal-affairs-ismat-rashid-aliyev/",
  "date_published": "2024-10-24T07:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): Federal Interior Minister and Head of Anti-Narcotics Mohsin Naqvi held a meeting with Azerbaijan’s Minister of State for Internal Affairs, Ismat Rashid Aliyev on Thursday in Turkiye.\nThe high-level meeting took place during the Istanbul International Expo, where the two leaders discussed ways to further strengthen the long-standing fraternal ties between Pakistan and Azerbaijan.\nDuring the meeting, both ministers engaged in comprehensive discussions on multifaceted bilateral relations, with a focus on matters of mutual interest. The dialogue covered a wide range of topics, including security, economic collaboration, and cultural exchanges. The leaders highlighted the deep-rooted historical and cultural connections that bind Pakistan and Azerbaijan, emphasizing the need to build upon the existing partnership.\nOne of the key points of discussion was the Pakistan Navy’s recent successful operation in the Northern Arabian Sea, which resulted in the seizure of over 2,400 kilograms of narcotics worth an estimated $145 million. Minister Aliyev praised the Pakistan Navy’s swift action and commended the effective leadership of Minister Naqvi in guiding the nation’s anti-narcotics efforts. He acknowledged Pakistan’s critical role in combating drug trafficking in the region and highlighted how such operations are crucial for regional stability.\nIn response, Minister Naqvi expressed his gratitude for Azerbaijan’s support and reiterated Pakistan’s commitment to enhancing its anti-narcotics efforts. He emphasized the importance of joint collaboration in tackling cross-border crimes such as drug trafficking, human trafficking, and terrorism. “We salute the dedication of our security forces, and together with Azerbaijan, we can further solidify our resolve to eliminate these threats,” Naqvi said.\nThe Azerbaijani Minister of State also took the opportunity to visit the Pakistani pavilion at the Istanbul International Expo, where he expressed a keen interest in the products and technologies on display.\nHe was particularly impressed by the advanced machinery and modern equipment showcased by Pakistan Ordnance Factories.\nAliyev lauded Pakistan’s technological advancements and manufacturing capabilities, noting that such innovations present ample opportunities for future collaboration between the two countries, particularly in defense and industrial sectors.\nBoth ministers agreed that there is significant potential for enhancing cooperation in various sectors, including border management, human trafficking prevention, and security coordination. They also highlighted the need for continuous efforts to further strengthen their countries’ ties and explored ways to enhance trade, defense, and cultural exchanges.\nTo further solidify the relationship between the two nations, Minister Naqvi extended an official invitation to Minister Aliyev for a visit to Pakistan. In turn, Minister Aliyev invited Naqvi to visit Baku, expressing a desire for continued collaboration on multiple fronts.\n“Pakistan and Azerbaijan enjoy excellent fraternal relations based on mutual respect and shared values,” Naqvi remarked during the meeting. He added, “There is a need to work towards further improving bilateral relations in all spheres, especially in areas like security, economy, and culture.”\nMinister Naqvi emphasized that Pakistan and Azerbaijan are brotherly Islamic nations connected by centuries-old historical ties and cultural similarities. He reiterated Pakistan’s readiness to continue working closely with Azerbaijan to promote peace, stability, and prosperity in the region.\nPakistan’s Ambassador to Turkey, Dr. Yousaf Junaid, was also present during the meeting and underscored the importance of maintaining strong diplomatic ties with Azerbaijan. He expressed optimism about the potential for deeper cooperation between the two nations in the coming years.\nThe meeting concluded with both ministers reaffirming their commitment to enhancing Pakistan-Azerbaijan relations on a sustainable and long-term basis, with future meetings and exchanges expected to solidify these objectives further.",
  "retrievedAt": "2025-08-10T20:18:38.853Z"
}
