{
  "title": "Dawat-e-Islami’s relief efforts for conflict-hit Gaza continuously underway: Attari",
  "link": "https://www.app.com.pk/national/dawat-e-islamis-relief-efforts-for-conflict-hit-gaza-continuously-underway-attari/",
  "date_published": "2024-10-24T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): Faizan Global Relief Foundation, UK Head, Syed Fuzail Raza Attari on Thursday said Dawat-e-Islami’s relief efforts for the oppressed Muslims of Gaza, Palestine were continuously ongoing and all possible resources are being utilized to assist the victims of Gaza, and this aid was being provided on a daily basis.\nTalking to media here, Syed Fuzail Raza Attari said, Alhamdulillah, FGRF Dawat-e-Islami is providing cooked food, clean drinking water, vegetables, ration packs, flour, and cash assistance to the oppressed Muslims of Gaza. Additionally, essential medicines, baby milk, diapers, tents, and other relief materials are also being distributed.\nSharing details, he said that so far 1.5 million liters of water, 145,000 ready-to-eat meal packets, 75,000 kilograms of flour, various relief items for more than 55,000 individuals, fresh bread for over 12,000 people, cash assistance to 2,600 families, hygiene kits for 1,700 families, milk and diapers for 1,500 families’ children, and tents and essential medicines for 200 families have been provided.\nFGRF has also distributed fresh sweets and cakes to 1,500 children, while vegetables have been supplied to 4,500 people. Furthermore, 6 containers containing 800 mattresses, 1,400 blankets, and other winter supplies have been delivered to the victims.\nSyed Fazil Raza Attari further stated that FGRF is not only involved in relief activities in Palestine but also in Egypt, Syria, Turkey, African countries, and Pakistan. He said, “Our goal is to serve solely for the pleasure of Allah Almighty and to show compassion to the Ummah of the Holy Prophet (Peace Be Upon Him), and InshaAllah, this mission will continue until the Day of Judgment.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:17:56.622Z"
}
