{
  "title": "CCP continues in-depth review of PTCL’s acquisition amid industry concerns",
  "link": "https://www.app.com.pk/national/ccp-continues-in-depth-review-of-ptcls-acquisition-amid-industry-concerns/",
  "date_published": "2024-10-24T16:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP):The Competition Commission of Pakistan (CCP) remains committed to addressing concerns in the ongoing Phase -II Merger Review of PTCL’s proposed acquisition of 100% shareholding in Telenor Pakistan (Private) Limited and Orion Towers (Private) Limited.\nThe review is being conducted by a distinguished Bench, led by Chairman Dr. Kabir Ahmed Sidhu, alongside Members Mr. Salman Amin and Mr. Abdul Rashid Sheikh, said a press release issued here on Thursday.\nIn an in-depth analysis, the CCP has thus far held five extensive hearings, beginning on September 30, 2024, with subsequent hearings on October 2nd, 3rd, 22nd, and 24th, 2024. The Bench posed critical questions regarding the potential impacts of the merger, ensuring thorough scrutiny of the competitive dynamics in the telecom sector.\nDuring the most recent hearing, Ms. Rahat Kaunain Hassan, Senior Counsel for PTCL, accompanied by Ms. Mariam Saleem Malik, Counsel for PTCL, presented responses to the concerns raised by Wateen, Jazz, and CM Pak (Zong) in earlier hearings. The CCP Bench facilitated discussions, offering all stakeholders, including PTCL, Wateen, Jazz, and\nTelenor, the opportunity to provide their respective comments.\nPTCL emphasized the merger’s competitive benefits, particularly highlighting the expected reduction in the market share gap between the two leading players. PTCL also addressed potential risks of input and customer foreclosure, outlining the evaluation principles, while highlighting the merger’s efficiencies, including cost savings, increased network capacity, accelerated technological advancements, and the roll-out of 5G services. PTCL assured the Honourable Bench that the MergeCo would fully comply with the Spectrum Sharing Framework, once issued by the Pakistan Telecommunication Authority (PTA), thereby adhering to all regulatory requirements.\nJazz and Wateen, in turn, reiterated their concerns over critical industry matters, particularly tariff regulations, infrastructure sharing, national roaming, and the operations of Cellular Mobile Operators (CMOs).\nThroughout the proceedings, CCP officials, including Mr. Shahzad Hussain (Director General/Registrar), Barrister Ambreen Abbasi, Hafiz Naeem, Mr. Arshad Javed (Legal Department), Ms. Marryum Pervaiz (HoD Merger Department), Mr. Noman Ahmed (Merger Department), raised pertinent questions, ensuring a comprehensive review process.\nThe CCP is committed to ensure that any potential competitive risks arising from the merger are fully addressed, safeguarding market competition and consumer welfare.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:19:37.570Z"
}
