{
  "title": "DPM Dar highlights Pakistan’s commitment to UN Charter of peace, human rights",
  "link": "https://www.app.com.pk/national/dpm-dar-highlights-pakistans-commitment-to-un-charter-of-peace-human-rights/",
  "date_published": "2024-10-24T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP): As the international community commemorates the United Nations (UN) Day today, Deputy Prime Minister and Foreign Minister Ishaq Dar said that since its independence, Pakistan had consistently demonstrated its commitment to the vision of the UN Charter of preventing war and promoting peace; fostering global prosperity and promoting universal respect for human rights.\n“From being top troops contributing country to UN peace operations since 1960, to hosting one of the oldest UN peacekeeping Missions – UNMOGIP – Pakistan has been an ardent advocate of multilateralism, international cooperation, dialogue and peaceful settlement of disputes,” Dar said in his message on the UN Day, who is currently visiting Samoa to attend the Commonwealth Heads of Government Meeting (CHOGM).\nHe said the Day marked the collective resolve of the international community to establish conditions for justice and social progress and to save succeeding generations from the scourge of war.\nHe said currently, the UN Charter’s vision of universal peace, development, and human rights for all was being undermined by blatant violations of its purposes and principles; resurging geopolitical rivalries; rising Islamophobia and xenophobia; adverse impacts of climate change; and increasing poverty.\nHe said the situations of conflict and continued foreign occupation defy the promise of the United Nations to save the succeeding generations from the scourge of war and its guarantees for self-determination.\n“It is imperative that urgent steps are taken to end Israel’s genocidal campaign in the Occupied Palestine and its provocations in the broader region. Concrete measures must also be taken to uphold the right to self-determination of the oppressed people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) as guaranteed to them in the UN Security Council Resolutions,” he urged.\nThe deputy prime minister also called for efforts to achieve the Sustainable Development Agenda and climate goals, including by reforming the international financial architecture, promoting development, and ensuring global financial equity.\nHe also acknowledged and commended the role of all UN Agencies, Funds and Programmes working in Pakistan for their valuable role in supporting socio-economic development.\n“Pakistan will continue to contribute in further strengthening the role of the United Nations in promoting the shared objectives of peace, progress, and prosperity worldwide, including in its capacity as the member of the UN Security Council for the term 2025-26,” the deputy prime minister reiterated.",
  "retrievedAt": "2025-08-10T20:18:29.620Z"
}
