{
  "title": "SZABMU to introduce DNA testing in country",
  "link": "https://www.app.com.pk/national/szabmu-to-introduce-dna-testing-in-country/",
  "date_published": "2024-10-24T17:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 24 (APP):Shaheed Zulifkar Ali Bhutto Medical University (SZABMU) has decided to introduce DNA testing soon first time in the country with public private partnership.\nThis was stated by the Vice Chancellor of the University Professor Dr. Tariq Iqbal while presiding over the thirtieth meeting of the Syndicate Board, said a press release.\nThe VC said that currently this facility is not available in Pakistan. Blood samples of needy patients are sent to foreign countries, which cost one to one and a half lac rupees per test. While using the technical expertise of the scientists of Shaheed Zulfikar Ali Bhutto Medical University, not only the cost per test can be reduced but it also can save money, he said.\nHe said that further, keeping in view the policy of HEC, PhD in clinical sciences is also being started soon. In this context, the university has allocated a significant amount of money for increasing the research sector, which will improve the quality of research, he said.\nThe Vice Chancellor presented the report of the recent MD CAT examination conducted by SZABMU. The report stated that 21884 students participated this year. While the papers were prepared according to the guidelines set by PMDC.\nActing on the information received by the security agencies, 16 people were arrested for using illegal materials. The board, while appreciating the transparency of the examination, stressed that strict action should be taken against those who sabotage the conduct of the examination.\nThe Board was presented with an excellent performance report issued by the Health Care Commission of the School of Dentistry, a subsidiary of the University.\nDr Tariq Fazal Chaudhary (MNA), while appreciating the services of Prof Tariq Iqbal in the Department of Burn Surgery, reiterated that the successful projects like Burn Center and School of Dentistry completed under the leadership of Prof Tariq Iqbal as a pilot. By using the project we can improve patient care in hospitals.\nTalking about the Central Induction Policy, Dr Tariq Fazal Chaudhary emphasized that as a teaching institute, the legal responsibility of all the educational and training activities in PIMS Hospital rests with the university.\nSimilarly induction of postgraduate trainees in all departments of PIMS is also the mandate of the university. Prof Dr Muhammad Umar (VC-RMU), also nominated by HEC, requested the Ministry of Health to implement this central induction policy in all training hospitals of the federal capital. Which will not only lead to monopoly of merit but also improve the quality of training of PG trainee doctors. Meanwhile, the syndicate formed a sub-committee under the chairmanship of Dr Tariq Fazal Chaudhary, which is in the teaching department of health.\nIt will formulate its recommendations to remove the existing irregularities. Dr Tariq Iqbal informed the House that currently the research team of the university is working on ten international standard research projects while two projects are in the process of patenting after completion. Among these projects, research on drugs for infectious diseases like cancer is noteworthy.\nCenter Mr Dost Muhammad Jaiser emphasized that efforts should also be made to provide cheap tests and medicines for the poor and deserving patients. Syndicate member Major Tahir Iqbal (MNA) for the improvement of the health sector. Mentioning the government’s initiatives, he said that the skills of university teachers can be used in various health projects.\nIn the meeting, a policy was approved for national and international level experts from the health sector to get medical and research services in the university. The institution will benefit greatly from their experiences. Apart from this, the training period in sub-sectors has been reduced from six years to four to five years according to international standards.\nApart from senior parliamentarians, Mr Tahir Ehsan, Dr Iqbal Memon, Dr Ansar Maqsood, Dr Bilal, Dr Haroon, Dr Shakib, Dr Musa, Dr Altaf, Dr Shaji Siddiqui and Dr Anbar Saleem participated in the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:19:12.782Z"
}
