{
  "title": "Dec 16 always to be remembered for great sacrifices of APS martyrs: Solangi",
  "link": "https://www.app.com.pk/national/dec-16-always-to-be-remembered-for-great-sacrifices-of-aps-martyrs-solangi/",
  "date_published": "2023-12-16T06:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi Saturday said that the day of December 16 would always be remembered for the great sacrifices of the martyrs of Army Public School.\nIn a message on the 9th anniversary of APS martyrs, he said, “Nine years have passed since the tragedy of APS, but the grief of those who lost their lives was still fresh today.”\nThe minister said that cowardly miscreants attacked the future of the nation, the young children and martyred them.\nMurtaza Solangi said adding no one could hold back their tears remembering that tragic day.\nPaying tributes to the martyrs of APS tragedy, he said they united the nation against terrorism.\nAfter this incident, he said all the political parties and organizations united against terrorism, a twenty-point national action plan was adopted and the terrorists were defeated.\nUnfortunately, without taking the opinion of parliament and public institutions, a government of the recent past allowed the terrorists to return, due to which the nation facing a new wave of terrorism today.\n“Terrorism has never ended due to the appeasement of terrorists around the world”, he maintained.  The people of Pakistan will defeat this new wave of terrorism with the strength of their state institutions and this was the message of today.\n“Our resolve is firm and our passion is true, our war against terrorism will continue”, Murtaza Solangi remarked.\nSolangi stated that  Pakistan had come a long way to defeat terrorism as all state institutions, including civil and military leadership, were on the same page to protect homeland and national security.\n“Pakistan is moving towards lasting peace and development,”  he added.\nHe prayed to Allah Almighty to rest the departed souls of the martyrs of Army Public School in eternal peace and grant courage to the bereaved families to bear the tragic loss with fortitude.\nThe minister also paid tributes to the martyrs of Pakistan Armed forces who sacrificed their lives for peace in the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:03:42.300Z"
}
