{
  "title": "UNSG acknowledges COAS’ concerns over plight of Gaza’s people",
  "link": "https://www.app.com.pk/national/unsg-acknowledges-coas-concerns-over-plight-of-gazas-people/",
  "date_published": "2023-12-16T08:47:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Dec 16 (APP): The United Nations General Secretary (UNSG) in a call on meeting has acknowledged the concerns of Chief of Army Staff (COAS) General Syed Asim Munir on the plight of innocent Palestinians facing huge humanitarian crisis in Gaza and thanked him for his visit to the UN Headquarters.\nDuring ongoing visit to USA, COAS, General Syed Asim Munir, met UN Secretary General Antonio Guterres at UN Headquarters, New York, said an Inter Services Public Relations (ISPR) news release issued here on Saturday.\nThe UNSG warmly welcomed the visit by the COAS and hailed the contributions made by Pakistan Army and contingents of the Law Enforcement Agencies who have remained committed to the peace and stability of the world.\nThe COAS reaffirmed Pakistan’s continuous support to the United Nations in all its earnest efforts.\nThe COAS during his interaction particularly highlighted about the ongoing Kashmir and Gaza issues.\nThe Army Chief said, “Peace in South Asia will remain elusive until a peaceful solution to the longstanding Kashmir Dispute is found in accordance with UNSC resolutions and the aspirations of Kashmiri people.”\nThe COAS also condemned unilateral and illegal Indian efforts to change the status of Indian Illegally Jammu and Kashmir (IIOJ&K) as it was in violation of UN Security Council Resolutions.\nThe COAS reiterated Pakistan’s stance on the Palestine issue and urged the UNSG to mobilize the international community for immediate cessation of hostilities in Gaza to prevent the unfolding human tragedy and highlighted that enduring solution to the issue lies in Two State Solution.\nThe COAS particularly shared deep concerns over the plight of the innocent civilians who were being brutally targeted and were not being provided with sufficient humanitarian relief.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:03:23.119Z"
}
