{
  "title": "SIFC effective forum for economic stability, timely decisions of public interest: Dr Umar Saif",
  "link": "https://www.app.com.pk/national/sifc-effective-forum-for-economic-stability-timely-decisions-of-public-interest-dr-umar-saif/",
  "date_published": "2023-12-16T10:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 16 (APP): Caretaker Federal Minister for Information Technology and Telecommunication, Dr Saif Umar Saturday said that the Special Investment Facilitation Council (SIFC) serves as an effective forum for ensuring economic stability and making timely decisions in the public interest.\nIn a video statement, Dr Saif Umar said, “SIFC is instrumental in paving the way for digital transformation and attracting foreign direct investment in Pakistan.”\nHe said, “Crucial decisions, beneficial to the masses, are being made through the SIFC forum in Information and Communication Technology (ICT).”\nThe minister expressed confidence that these initiatives would contribute to the rapid development and stability of the country’s economy.\nDr Umar Saif further explained, “All stakeholders including the military and political leadership are present in the SIFC forum, which makes decision-making very easy.”\n“We are confident that with the presence of the Special Investment Facilitation Council, the upcoming government will also be able to make timely decisions for the country’s development and public interests because we mustn’t compromise on our economic stability and public interests, we need to avoid departmental obstacles, Instead of unnecessary delay tactics, quick and effective decisions have to be taken in the interest of the country and the nation, for this purpose SIFC is the most effective forum” he added.\nThe minister said that since 2014, the case of hundreds of MHz of spectrum with Sun TV was pending.\nThe matter, he said was raised at the SIFC forum, and all the required legal requirements were met, after which the High Court of Sindh heard the case daily and the verdict of the case was pronounced on Thursday.\nDr Saif said, “It is good news for the people that now this spectrum will be in government custody, which is worth multi-million dollars as per the current market rate of the spectrum.”\nThe minister said that from the establishment of the Advisory Committee for spectrum auction to the necessary steps to lay the network of optical fiber cables across the country.\nHe said, “The effective implementation of the Right of Way Policy, the Special Investment Council has removed all departmental hurdles and all decisions in the interest of the country and the nation have been approved without delay.”\n“The SIFC Forum has a key role to play in the preparation of the country’s first space policy and its approval from the relevant forums” he added.\nSimilarly, Dr Saif said, “Negotiations with Starlink have entered the final stages, and satellite internet will also be available to the public very soon while the existing network will also be improved.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T11:03:18.729Z"
}
