{
  "title": "Neeraj Chopra addresses ‘hate, abuse’ on inviting Arshad Nadeem for javelin competition in India - World - DAWN.COM",
  "author": null,
  "content": "Indian javelin ace Neeraj Chopra on Friday addressed the recent “hate and abuse” following his decision to invite Pakistani rival Arshad Nadeem for the upcoming Neeraj Chopra Classic being held in India.\n\nEarlier this week, the 27-year-old Indian sensation invited Nadeem for the Neeraj Chopra Classic being held in India on May 24. The event will be a World Athletics Gold category event featuring former world champions Anderson Peters and Julius Yego, 2016 Olympic winner Thomas Roehler and American Curtis Thompson among others.\n\nWhile speaking at a press conference on Monday, Chopra said: “Like other top throwers, Arshad too has been invited. It will involve government [permission]. Once everything is confirmed, we will know the final list.”\n\nDiplomatic relations have deteriorated between Pakistan and India following a deadly attack in India-held Kashmir as both sides imposed tit-for-tat diplomatic measures.\n\nPakistan on Thursday announced the suspension of trade and the closure of airspaces with India, among other moves, as it retaliated to New Delhi’s slew of aggressive measures against the country following the deadly attack.\n\nToday, Chopra acknowledged on his social media platforms that there has been “so much talk” about his decision to invited Arshad to India, “and most of it has been hate and abuse.”\n\n“I usually am a man of few words, but that doesn’t mean I will not speak up against what I think is wrong,” Chopra said. “More so when it comes to questioning my love for our country, and the respect and honour of my family.”\n\nThe Indian athlete, who won the gold at the 2020 Tokyo Olympics but settled for silver behind Nadeem in Paris last year, said his invitation “was from one athlete to another nothing more, nothing less”.\n\nThe aim of the Neeraj Chopra Classic was to bring the best athletes to India and for his country to be the home of world-class sporting events, he said.\n\n“After all that has taken place over the last 48 hours, Arshad’s presence at the NC Classic was completely out of the question,” he said.\n\n“My country and its interests will always come first,” Chopra said, adding that his thoughts and prayers were with those affected. “I am both hurt and angry at what has taken place.\n\n“I have carried my country with pride for so many years now, and so it hurts to see my integrity being questioned. It pains me that I have to explain myself to people who are targeting me and my family, with no good reason.\n\n“We are simple people, please don’t make us out to be anything else. There are so many false narratives that certain sections of the media have created around me, but just because I do not speak up, it doesn’t make it true.”\n\nHe went on to say: “When my mother — in her simplicity — had made an innocent comment a year ago, there was an outpouring of praise for her views.\n\n“Today, the same people haven’t held back from targeting her for that very same statement,” he said.\n\nFollowing Nadeem and Chopra’s podium finish at last year’s Olympics, Chopra’s mother Saroj Devi said she was equally happy with her son’s silver medal since it was “my child” Arshad who had bagged gold.\n\nMeanwhile, Nadeem’s mother Raziah Parveen had said: “Neeraj Chopra is like a son to me. I prayed for him too.”\n\nNeeraj concluded his statement saying: “I, meanwhile, will work even harder to ensure that the world remembers India and looks at it with envy and respect for all the right reasons.”\n\nFollowing his return to Pakistan after the Paris Games, Nadeem spoke about his rivalry with Chopra, saying they are “good friends”.\n\n“When we’re competing, we have to put effort in for our countries,” he said, expressing hope that their friendship would be a long-lasting one.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:34:20.020Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906486/neeraj-chopra-addresses-hate-abuse-on-inviting-arshad-nadeem-for-javelin-competition-in-india",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T06:58:11.000Z"
}
