{
  "title": "Young Doctors Association to block main arteries in Lahore today - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: As the Pakistan Super League-X cricket matches started in Lahore on Thursday, the Young Doctors Association’s (YDA) Punjab chapter has announced to shut down the city by staging sit-ins on all the main roads of the provincial capital in a bid to force the Punjab government to review the decision of outsourcing the state-run health facilities in the province.\n\nThe YDA announcement perturbed the authorities who declared it an attempt to “blackmail” the government, ignoring the fact that the international cricketers’ security was a highly sensitive matter.\n\nYDA Punjab President Dr Shaib Niazi claimed that the association took the “hard decision” when it found out the government was unmoved by the 18-day agitation by the employees of the hospitals, as no one from the health or any other department came forward to resolve the matter.\n\nThe police high-ups declared the YDA’s decision a deliberate move to create disturbance, saying the Pakistan Cricket Board (PCB) had announced the matches’ schedule for Lahore months back.\n\n“We will close down all the major roads of the city from Friday (today) under the banner of the Grand Health Alliance (GHA),” announced Dr Niazi here on Thursday.\n\nSharing the details of the association’s ‘Plan B’, he said the young medics and other hospital employees would gather in groups and block Jail Road, Ferozepur Road, and the road leading to Mayo Hospital, for traffic.\n\nSimilarly, Dr Niazi said, the roads leading to the Shaikh Zayed Hospital, Jinnah Hospital and Sir Ganga Ram Hospital will also be blocked as per the plan.\n\nThe protesters have been given a go ahead to stage sit-ins on these arteries and block these for all kinds of traffic, the YDA president said.\n\nDr Niazi warned if any one tried to use force to disperse the protesters, the young doctors would shut down all the government hospitals of Punjab, suspending healthcare services to the patients.\n\nAnother YDA leader Dr Salman Haseeb told the media that all city roads marked by the association would be blocked at 11am on Friday.\n\nIn order to put further pressure on the government, he said, the protesting employees including young medics would march from the chairing cross to the CM Secretariat the same day (Friday).\n\nDr Haseeb issued a strict warning to the police and the provincial government that if they arrested any protester, the employees may take ‘some extreme steps’ to give a more tough time.\n\nOn the other hand, the police high-ups reviewed the situation in view of the YDA threat and intensified security to avoid any untoward happening.\n\nA spokesperson for the Lahore police said that some 10,000 policemen have been deployed to ensure security for the PSL cricket teams.\n\nHe said a four-security-layer strategy was adopted in and around Qaddafi Stadium, adding that all police units, including Dolphin Force and Police Response Unit (PRU), have been directed to intensify patrolling in the marked areas. In addition, the situation will also be monitored through the Punjab Safe Cities Authority (PSCA) cameras, he added.\n\nThe operations DIG has ordered special police teams to launch search operations in the surroundings of the stadium, the routes assigned for the teams and the hotel where the players and other staff were staying.\n\nPolice snipers had been deployed on the rooftops of selected buildings to keep an eye on any suspicious activity, besides other measures, to ensure cricket teams’ security, he added.\n\nPublished in Dawn, April 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680afc8e4f40b.jpg",
  "retrievedAt": "2025-10-12T02:44:10.087Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906459/young-doctors-association-to-block-main-arteries-in-lahore-today",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T03:06:52.000Z"
}
