{
  "title": "KP registers 8th mpox case in current year - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa health department has detected a new mpox case in Khyber tribal district, taking the total number of patients infected with zoonotic ailment in the province this year to eight.\n\nThis is the second case reported in Khyber district. Earlier, a resident of the district, who got the virus from United Arab Emirates, was tested positive for the disease. With the detection of new case, Khyber Pakhtunkhwa recorded a total of 17 cases of mpox during the past three years.\n\nDoctors at public health section of directorate general health services said that the person was tested positive for the disease and isolated accordingly.\n\nThe patient, a 31-year-old male, was screened at Bacha Khan International Airport when he was departing for Dubai. Doctors suspected him and obtained his sample.\n\nExperts say the disease has not spread owing to better arrangements\n\nHis sample was sent to Public Health Reference Laboratory at Khyber Medical University (KMU), where the presence of mpox virus was confirmed.\n\nThe patient reportedly arrived in Pakistan on April 16. Following the confirmation, health department issued directives to the district health officer (DHO) of Khyber for immediate surveillance and contact tracing. The patient has been shifted to isolation ward at Services Hospital, Peshawar, to prevent further spread of the virus.\n\nDoctors said that health department was closely monitoring the situation.\n\nHealth department has urged people to remain vigilant and report suspected symptoms promptly to it.\n\nHealth experts said that positive cases needed to be isolated in homes or hospitals where they should stay away from other people.\n\nThe patients, once diagnosed positive, should remain in quarantine till their full recovery through test after which they could be allowed to meet people, they added.\n\nThe province has recorded 17 mpox cases so far, including eight in 2025, seven in 2024 and two in 2023. Most of the patients had arrived either from United Arab Emirates or Kingdom of Saudi Arabia where the disease was endemic.\n\nAuthorities have been screening passengers arriving from UAE and KSA at Bacha Khan International Airport and suspected ones are being sent to isolation ward at Service Hospital where special arrangements have been put in place for the purpose.\n\n“We send samples of patients to the laboratory for test and patients are released from hospital in case they emerge negative while the positive ones are isolated,” they said.\n\nDoctors said that so far, all patients had the infection, which could be traced to UAE or KSA. The latest case is also an example that has been infected in Dubai.\n\n“As per protocol, all patients are isolated and released only when their tests emerge negative,” they said. Experts, meanwhile, appreciated the surveillance system at the airport due to which all the infected patients were detected.\n\nUnlike other provinces, the screening mechanism at the airport was very active, they said. Nevertheless, all the airports in the country have been receiving people from the endemic countries but the performance of Khyber Pakhtunkhwa regarding detection of cases, has been up to the mark.\n\n“It is the robust screening mechanism at the airport that suspected people are identified and most of them have emerged positive so far.\n\nThe disease has not been spread to community owing to better arrangements by the department,” they said.\n\nPublished in Dawn, April 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:34:20.204Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906468/kp-registers-8th-mpox-case-in-current-year",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T03:20:30.000Z"
}
