{
  "title": "Aurangzeb highlights improved macroeconomic outlook in US meetings - Business - DAWN.COM",
  "author": null,
  "content": "Finance Minister Muhammad Aurangzeb highlighted Pakistan’s improved macroeconomic outlook as he concluded the fourth day of his visit to Washington for the spring meetings of the International Monetary Fund (IMF) and the World Bank with a series of meetings with key financial institutions, rating agencies, and global corporations.\n\nAurangzeb was in the US capital to attend the 2025 Spring Meetings of the IMF and the World Bank Group, which brought together finance ministers and central bank governors from 191 countries to address global challenges such as sovereign debt, climate finance and reforming the international financial system.\n\nIn a series of corporate engagements, the finance minister met Visa’s regional Vice President Andrew Torre and expressed his appreciation for the company’s contribution towards the digitalisation of the country’s economy.\n\nHe noted that Visa’s decision to triple the size of its offices in the country and its collaboration with 1-Link and PayPak would significantly contribute to promoting financial inclusion, e-commerce, transaction security, payment gateways, and facilitate remittances. He assured Torre of the governments full support in addressing any operational matters in Pakistan.\n\nThe finance minister also held a meeting the vice president of Phillip Morris International, acknowledging their long-term commitment to the country. Aurangzeb also emphasised the need for effective enforcement and compliance measures to curb the illicit production and sale of cigarettes.\n\nHe also briefed institutional investors at a seminar hosted by JP Morgan called Pakistan’s Economic and Monetary Policy Outlook.\n\nAurangzeb highlighted Pakistan’s stable macroeconomic indicators, which included twin surpluses, declining inflation, robust foreign exchange reserves, and sound debt management factors that contributed to Fitch’s recent sovereign credit rating upgrade.\n\nIn light of recent events, the finance minister also expressed deep concern over the loss of tourists lives in a terrorist incident in India, reiterating Pakistan’s unequivocal condemnation of terrorism in all forms.\n\nMeanwhile, in a meeting with Masato Kanda, president of the Asian Development Bank (ADB), Aurangzeb congratulated him on his recent appointment and expressed appreciation for the ADB’s enduring partnership with Pakistan, along with its contributions to the country’s development through initiatives such as the Country Partnership Strategy 2026-2030 and its budgetary support.\n\nThe two sides discussed ADB’s project pipeline and committed to accelerating project execution. He requested support for a partial credit guarantee for the issuance of the Panda bond, expressing hope for the materialisation of budgetary support this year.\n\nHe also assured Kanda of Pakistan’s delegations participation in the CAREC meeting scheduled for November 2025.\n\nThe finance minister also held separate meetings with international rating agencies, Fitch Ratings and Moody’s, thanking Fitch for upgrading Pakistan’s sovereign rating to B- and outlining progress on structural reforms in energy, taxation, state-owned entities, public finance, and debt management.\n\nWith Moody’s, he highlighted the country’s strong economic indicators, including low inflation, fiscal surpluses, and record remittances, while emphasising reforms to broaden the tax base.\n\nOn trade matters, he reiterated Pakistan’s commitment to constructive engagement with the US Administration.\n\nFinally, Aurangzeb also met with Sangbu Kim, World Bank’s vice president for digital transformation, and highlighted Pakistan’s progress under the Digital Pakistan policy, particularly in taxation reforms and the end-to-end digitisation of the Federal Board of Revenue.\n\nEmphasising the need for horizontal integration across government entities, he sought the Bank’s support in operationalising the Country Partnership Framework (CPF) through technology.\n\nAt the Vulnerable 20 (V20) Ministerial Dialogue, themed Enabling Climate Prosperity, Senator Aurangzeb outlined Pakistan’s Climate Financial Strategy and the development of a Climate Prosperity plan.\n\nHe highlighted the recent staff-level agreement with the IMF under the Resilience and Sustainability Facility (RSF) and noted that the World Banks 10-year CPF prioritises climate resilience and decarbonisation.\n\nThe minister called for reforms in international financial architecture to support climate-vulnerable nations and stressed the need for capacity-building to develop bankable climate projects.\n\nThe minister also interacted with members of the Pakistan Bank-Fund Staff Association, briefing them on Pakistan’s improving macroeconomic indicators, including the successful IMF staff-level agreement under the Extended Fund Facility and RSF.\n\nHe also discussed the World Bank’s ten-year framework, which addresses challenges in population growth and climate change.\n\nIn a meeting with Jihad Azour, IMF director for the Middle East and Central Asia, the Aurangzeb thanked the IMF for the successful staff-level agreement for Pakistan’s economic reforms. He reaffirmed Pakistan’s commitment to sustaining reforms.\n\nFinally, Aurangzeb concluded his day with a meeting with the Standard Chartered Bank delegation led by Roberto Hoornweg, appreciating the bank’s role in bridging Pakistan’s financing gap during a critical period.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:34:18.102Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906491/aurangzeb-highlights-improved-macroeconomic-outlook-in-us-meetings",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T08:00:09.000Z"
}
