{
  "title": "Baithak highlights women’s voices in the resistance against canals project - Pakistan - DAWN.COM",
  "author": null,
  "content": "Civil society groups, activists and community members gathered for a baithak (sitting) organised by Aurat March and Women Democratic in Karachi’s Kitab Ghar on Thursday to discuss the impact the Cholistan canals project could have on women in Sindh — calling it “a crisis of existence”.\n\nThe proposed canals project has the people of Sindh in an uproar with people protesting all over the province blocking highways and staging sit-ins to stop the construction of the six canals. The aim of constructing the canals is to irrigate the arid region of Cholistan as part of the Green Pakistan Initiative, with Sindh residents fearing the project will deprive the province of its rightful share of water.\n\nThe discussion — at the intersection of the politics of water, land and gender — centred around bringing attention to Sindh’s existing water woes and the place of women in the struggle. Many described the Indus River as the “lifeline and identity” of the people of Sindh.\n\nThe panel was led by Women Democratic Front Finance Secretary Muneeba Hafeez and Mariam Gopang, a lifelong activist associated with the Sindhyani Tehreek (ST), the women’s wing of the Awami Tehreek (AT).\n\nThe session opened with a poetry recitation by Hafeez echoing the exploitation and slow death of the Indus River, drawing parallels to the tragedy of Karbala, where people were denied water by oppressive forces.\n\n“Sindhu jo pait pharyo wayo (The belly of the Indus has been ripped open) Sindhu tay top charyo wayo (The cannon has been turned on the Indus),” she read.\n\nSpeaking about how the project will exacerbate existing inequalities, Hafeez lamented the role of women as unpaid labour in Sindh’s agrarian economy.\n\n“Women not only take care of the house but also work in the fields, walk kilometres every day to fetch water”, she added, warning that matter could grow worse in the face of severe water scarcity.\n\nHighlighting the displacement due to seawater intrusion in Thatta, Sajawal and surrounding areas she said, “When men can no longer find work near the river, they migrate to cities and return empty-handed, It’s the women who are left behind. They go hungry, and so do their children.”\n\nSeawater Intrusion occurs as a result of inadequate water flow into the sea.\n\n“Fisherwomen around Manchar and Keenjhar lakes spend their entire lives around the river, they grow up there, and get married there. Their whole lives are dependent on the Indus River,” said Gopang, noting that the Indus River is not just a body of water but Sindh’s culture, identity, and sustenance.\n\n“Taking the Indus away from the woman of Sindh is akin to taking away her world,” noted Hafeez.\n\n“For 150 years, Indus [River] has been exploited and tampered with to the point where the life associated with it finds itself at the brink of death,” expressed Gopang.\n\n“If Sindhu dies, our culture will die with it,” she added, emphasising that province’s existence is rooted in the Indus River.\n\nSpeaking to Dawn.com, Mariam recalls that she was only 21 when she marched against the Kalabagh Dam with the Awami Tehreek carrying her 4-month-old daughter with her. With Sindh’s water crisis transcending generations, today decades later, her daughter is on the frontlines against the canal project with her infant.\n\nParticipants aired out their frustration over deepening inequalities in the face of the existing water crisis in Sindh. One noted how it is often education for girls is the first thing to be halted as a result of economic fallout from such crises.\n\nAnother called out the apathy of people from urban centres towards the challenges of working-class women in rural areas.\n\nGopang questioned the fairness of irrigating one region at the cost of another. “Today we stand together — regardless of political affiliations — as a united front”, she said, urging the people seated around her to “raise their voices, block roads and protest wherever they can”.\n\nAn Aurat March organiser told Dawn.com the importance of including women’s voices in both mainstream discourse and leftist politics adding that there can be no actual feminist movement unless it extends solidarity to other political movements.\n\nIn a meeting yesterday, Prime Minister Shehbaz Sharif agreed to put the controversial canals project on the back burner amidst protests while the Save Indus River Movement — a conglomerate of nationalist, religious and political parties and civil society — has rejected the prime minister’s announcement meeting and termed it a “betrayal with people of Sindh” vowing to continue their protests.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/25112802b26e294.jpg",
  "retrievedAt": "2025-08-25T14:34:17.797Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906489/baithak-highlights-womens-voices-in-the-resistance-against-canals-project",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T08:27:15.000Z"
}
