{
  "title": "Trump administration to restore foreign students’ legal status, for now - World - DAWN.COM",
  "author": null,
  "content": "The Trump administration said on Friday that it is restoring the student visa registrations of potentially thousands of foreign students in the United States whose legal status had recently been abruptly terminated.\n\nThe decision was announced during a court hearing before a federal judge in Boston who was hearing a challenge by one of the many international students nationally suing over the administration’s actions.\n\nThose students’ status had been revoked as a result of their records being terminated from a database of the approximately 1.1 million foreign student visa holders, putting them at risk of deportation.\n\nSince US President Donald Trump took office on January 20, records for more than 4,700 students have been removed from the US Immigration and Customs Enforcement (ICE)-maintained database known as Student and Exchange Visitor Information Systems (Sevis), according to the American Immigration Lawyers Association.\n\nThe database monitors compliance with visa terms and records foreign students’ addresses, progress toward graduation and other information. To remain in the database, student visa holders have to obey conditions like limits on employment and avoiding illegal activity.\n\nShortly before Friday’s hearing in Boston University student Carrie Zheng’s case, US District Judge F Dennis Saylor said he had received an email from a lawyer from the government alerting him to a change in position by ICE.\n\nAccording to that email, ICE was now “developing a policy that will provide a framework for Sevis record terminations”.\n\nUntil that policy is issued, the Sevis records for Zheng and similarly situated plaintiffs will remain active or will be restored, the email said.\n\nAfter Trump’s administration revoked hundreds of student visas and threatened deportation for participants of pro-Palestinian campus protests, international students told AFP they were reconsidering their dreams of earning degrees in the United States.\n\nTrump has launched a crackdown on higher education in recent weeks, accusing universities, including Columbia and Harvard, of allowing anti-Semitism on their campuses.\n\nIn response, more than 130 international students across the US have joined a federal lawsuit accusing the Trump administration of unlawfully cancelling their visas, jeopardising their legal status in the country.\n\nBut others have been deterred from setting foot in America in the first place.\n\nGerman Tariq Kandil turned down an opportunity to spend six months on exchange at the University of California, Davis, fearing he would be targeted by the US government for his social media posts criticising Trump and speaking about Palestine.\n\n“I didn’t want to have to censor myself just to be able to enter the country,” the 21-year-old told AFP. “The United States is supposed to be the country of free speech.”\n\nKandil said he was “afraid of being arrested when entering or leaving the country and finding myself in detention awaiting deportation”. He was also worried his name would attract undue scrutiny.\n\n“Tariq Kandil isn’t a typical name when you come from Europe.”\n\nMore than 1.1 million international students attended college or university in the US during the 2023/24 academic year, a record figure, according to a report published by the State Department’s educational bureau and the Institute of International Education.\n\nNow, Trump is aggressively targeting top universities where students protested over Israel’s military campaign in Gaza, cutting off federal funds and directing immigration officers to deport student demonstrators, including those with green cards.\n\nRania Kettani, a Moroccan student currently living in Abu Dhabi, joined protests against Israel’s conduct in the Gaza conflict while studying at New York University in 2023.\n\n“It is inconceivable to me that, in today’s context, doing the exact same thing could lead to deportation and cut short my studies,” Kettani told AFP. The 22-year-old had planned to apply for a master’s degree at an American university.\n\n“Seeing the number of students whose visas were revoked, I gave up,” she said. “I don’t want to live and study in fear.”\n\nNaveen, a 26-year-old who asked to be identified with a pseudonym, is in the process of applying for a US visa after being admitted to a university there.\n\nTo prepare for his studies, he has joined online forums that share the “dos and don’ts” of being an international student in the United States.\n\nThe current situation is “a bit hostile”, he told AFP. But Naveen said he believes that revoked student visas and deportations are targeting “immigrants not following the law properly and doing illegal practices”.\n\nHe is hopeful the atmosphere around higher education will improve “in a year or two”. Naveen said he sees a bright future for himself in America and wants to help the US “economy and people”.\n\nThe US could “go back to being a really happy place where people won’t feel these kinds of uncertainties or any doubts in the back of their minds”, he told AFP.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/25220551f92034d.jpg",
  "retrievedAt": "2025-08-25T14:34:11.764Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906535/trump-administration-to-restore-foreign-students-legal-status-for-now",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T16:27:21.000Z"
}
