{
  "title": "Legal aspect of Indus Waters Treaty suspension - Pakistan - DAWN.COM",
  "author": null,
  "content": "AFTER the dastardly incident at Pahalgam in India-held Kashmir, Pakistan immediately distanced itself in unequivocal terms from the perpetrators.\n\nIndia, however, continues to insist that the incident was orchestrated directly or indirectly by the Pakistani state though no shred of evidence for its claim has been made public or shared with Pakistan. Obviously, India is acting with mala fide intent. Holding the Indus Waters Treaty (IWT) in abeyance on the basis of its allegations is in stark violation of Article 26 of the Vienna Convention on the Law of Treaties, 1969, which lays down that treaties “must be performed … in good faith”.\n\nThe unilateral holding in abeyance of the IWT will be treated by Pakistan as a casus belli and a step that is destructive to its vital national interests. Pakistan is heavily dependent on the Indus river system for its agricultural sector, which forms the backbone of the country’s economy. More than 80 per cent of Pakistan’s irrigation depends on water from the Indus Basin. Disruption of water supplies is bound to aggravate the existing water scarcity, reduce crop yields, and precipitate domestic unrest, especially in the water-stressed provinces of Punjab and Sindh.\n\nIn the Vienna Convention and IWT, there are no provisions for a treaty being ‘held in abeyance’. However, only in the Vienna Convention are there provisions with regard to the suspension of a treaty. It is therefore a question of law to be decided as a matter of first impression by a competent tribunal whether the terms ‘holding in abeyance’ and ‘suspension’ of a treaty are the same. In the absence of an authoritative pronouncement on this point in the context of the IWT, we are obliged, for the time being, to proceed on the assumption that the phrase ‘holding in abeyance’ is equivalent to ‘suspension’.\n\nIn the Vienna Convention, the provisions relating to the suspension of a treaty are laid down in Part V. Article 42 provides that a treaty may be suspended only in compliance with the provisions of the Vienna Convention. Article 57 of the Vienna Convention deals with the ‘suspension’ of treaties and provides that: “The operation of a treaty in regard to all the parties or to a particular party may be suspended: (a) in conformity with the provisions of the treaty; or (b) at any time by consent of all the parties after consultation with the other contracting states.”\n\nInterestingly, the Indus Waters Treaty does not contain any provision relating to its suspension.\n\nInterestingly, the IWT does not contain any provision relating to its suspension, nor has India held any consultation with Pakistan in relation to its intent to suspend the treaty. The suspension of the IWT, therefore, is an egregious violation of the provisions of Articles 42 and 57 of the Vienna Convention. Another article of the Vienna Convention that allows the suspension of treaties is Article 60 which provides that a treaty may be suspended by a party only when it is breached by the other party. India’s suspension is not based on the allegation of any breach by Pakistan.\n\nThere is absolutely no doubt that India’s action is highly provocative as it is based on flimsy grounds and mala fide intent. A three-pronged course is advised in order to deal with the emergent situation:\n\nPakistan needs to weigh its options under the provisions of the IWT. Article IX of the treaty provides a mechanism for constituting a court of arbitration. However, there is a difficulty. In private international law, an arbitration clause in an agreement survives the abrogation or termination of the agreement. In the present case, which falls under public international law, it needs to be explored whether the arbitration clause in Article IX will survive the holding of the treaty in abeyance. However, it is clear that India will not be responding to any such initiative after it has declared the IWT’s abrogation.\n\nUnder Chapter VII of the UN Charter, the UN Security Council is authorised to examine cases which may be a threat to international peace and to take appropriate action to maintain international peace and security. Holding the IWT in abeyance will certainly lead to friction between India and Pakistan and may give rise to further disputes. This will threaten international peace if relations between the two nuclear powers deteriorate further. Non-military sources of instability in the economic, social, humanitarian and ecological fields have become threats to peace and security in modern times. This dispute, therefore, is suitable to be dealt with under the provisions of Chapter VII of the Charter of the United Nations by the UN Security Council. The Security Council is authorised, pursuant to Article 40 of the Charter, to grant provisional relief, subject to the final resolution of the dispute referred to it under Article 39 of the Charter.\n\nThe IWT is the only treaty between India and Pakistan that has survived three major wars, uprisings in Jammu and Kashmir and various parts of India and Pakistan, and the military crisis of 2002. The treaty is cited across the world as a shining example of the successful settlement of a transboundary water basin conflict. Pakistan’s National Security Committee has announced a number of actions that constitute legitimate counter-measures under international law. It is hoped that the UN secretary general’s office will play a role at the earliest before the situation deteriorates further.\n\nThe writer is ex-federal law minister & advocate Supreme Court.\n\nPublished in Dawn, April 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680ae40ba2bf4.jpg",
  "retrievedAt": "2025-08-25T14:34:29.304Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906366/legal-aspect-of-indus-waters-treaty-suspension",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T01:44:01.000Z"
}
