{
  "title": "‘Pakistan faces $2bn losses in climate disasters’: ADB - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan faces average annual losses of over $2 billion due to climate disasters, which exacerbate the already high poverty levels, according to the Asian Development Bank (ADB).\n\n“As one of the region’s most climate-vulnerable countries, Pakistan suffers average losses from disaster events exceeding $2bn per year, with women and vulnerable groups disproportionately affected,” said the Manila-based lending agency in its Annual Report 2024 released on Thursday.\n\nIt said the ADB signed a $500 million policy-based loan in 2024 for a programme to boost Pakistan’s capacity for disaster planning, preparedness, and response. The programme supported disaster risk mapping, modelling, and mobilising public and private financing for disaster risk reduction and climate resilience. It will also improve coordination for disaster monitoring and response and utilise ADB’s contingent disaster financing facility for the first time in central and west Asia, providing rapid disbursements in the event of a disaster.\n\nOverall, the ADB said despite its economic performance, central and west Asia still faced significant development disparities and persistent social welfare challenges. Afghanistan, the Kyrgyz Republic, and Pakistan continue to struggle with high poverty levels and limited access to essential services.\n\nIn Pakistan, ADB also committed an additional $330m to expand the reach of a grassroots social protection programme to benefit 9.3 million people, focusing particularly on poor women and their families. The new financing will improve the targeting of household poverty assistance, provide conditional cash transfers to educate children and adolescents, and expand access to health services and better nutrition for women, teenage girls, and children in disaster-prone areas.\n\nThe report noted that Pakistan’s soaring urban population faced declining living standards due to limited public services, inadequate planning, insufficient housing, and climate change. In 2024, ADB published a report analysing these issues and outlining a new model of urbanisation to help make the country’s cities more resilient and livable. The report provides insights on strengthening urban planning, employing innovative public-private partnerships for urban services, enhancing the financial stability of municipalities, and the need for gender-responsive budgeting and expenditure.\n\nThe bank also committed a non-sovereign loan of $41.2m for SAFCO Venture Holdings Ltd to develop a facility in Sheikhupura to produce 200,000 tonnes of sustainable aviation fuel that reduces carbon dioxide emissions by up to 85pc.\n\nThe facility will utilise waste by-products from an adjacent biodiesel refinery and export 100pc of its output mainly to the European Union, generating vital foreign exchange for Pakistan. ADB has an outstanding loan portfolio of about $16bn to Pakistan, excluding undisbursed effective loans of about $4.59bn, taking the total loans to $20.8bn or about 10pc of Pakistan’s total loans.\n\nThe ADB said it committed $24.3bn from its resources in 2024 and $14.9bn in co-financing in collaboration with its partners to help Asia and the Pacific solve a range of complex development challenges. “With our increased financial firepower and a sharper strategic focus, ADB is turning commitment into concrete results,” said ADB President Masato Kanda.\n\n“We are financing more affordable and efficient energy and transport systems, supporting a vibrant private sector that creates better-quality jobs, and strengthening basic education, health, and social protection services.\n\nPublished in Dawn, April 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:43:15.250Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906379/pakistan-faces-2bn-losses-in-climate-disasters-adb",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T01:43:45.000Z"
}
