{
  "title": "Sindh CM questions utility of protests after govt halts canal project - Pakistan - DAWN.COM",
  "author": null,
  "content": "Sindh Chief Minister Murad Ali Shah on Friday questioned the utility of further protests in the province after the federal government agreed to put the controversial canals project on the back burner.\n\nLast night, the government announced that it was halting the contentious canals project until a consensus on the issue could be reached in the Council of Common Interests (CCI), a constitutional body that resolves the disputes of power-sharing between the federation and its provinces.\n\nHowever, the move failed to convince the legal fraternity and opposition parties in Sindh as they vowed to continue their protest campaign and the sit-in at Babarloi bypass in Khairpur, demanding the issuance of a notification officially annulling the controversial scheme.\n\nA statement issued from the Chief Minister’s House said today that after the cancellation of the canals project, the protesters should cease their agitation and unblock the roads they have obstructed, as this disruption was affecting daily life.\n\nHe said that while “peaceful protests were acceptable, public disruptions were not”, adding that protests should not block roads or hinder daily life.\n\nThe statement added that the chief minister called on protesters to clear the roads and restore normalcy, questioning the political motivations behind the ongoing demonstrations.\n\n“Given India’s hostile actions, we must stand united rather than fall into divisive politics,” he stated.\n\nThe chief minister also held a press conference in Karachi, whereby he shed light on the issue again and said: “Does every project approval need a notification? There are proper forums where projects are approved or disapproved.\n\n“People have been made to believe that there is going to be a takeover of Sindh’s rights,” he said.\n\nAddressing the anxiety of the protestors, he acknowledged the “sensitivity” of the issue around water and assured that the matter would be resolved soon and guaranteed that until a consensus is reached, no canals could be constructed.\n\n“People should have faith in their leaders. PPP has made its stance clear and will continue to do so,” he said, urging people to avoid engaging in any “adventurism”.\n\n“PPP will always stand with the people [of Sindh] but given the situation the country is in, we must find a balance.”\n\nCM Shah recalled the Chobara Canal, noting that the PPP opposed its construction and ensured that the project did not go through.\n\n“Similarly, phase two of the Greater Thal Canal never materialised after the completion of its first phase in 2008 due to PPP’s opposition to the project,” he stated.\n\n“I cannot stop anyone from bringing in new schemes, but I am clear on my resolve,” he asserted, adding that PPP would always strive to defend Sindh.\n\nMeanwhile, in a notification issued by the CCI secretariat, Prime Minister Shehbaz Sharif convened the 52nd meeting of the CCI on May 2 at the Prime Minister’s House in Islamabad.\n\nAccording to the notification, the meeting will be attended by the chief ministers of the four provinces, Deputy PM and Foreign Minister Ishaq Dar, Defence Minister Khawaja Muhammad Asif, Federal Minister for States and Frontier Regions (Safron) and Kashmir and Gilgit-Baltistan Affairs Amir Muqam and several other dignitaries.\n\nChief of the Army Staff Gen Asim Munir and Punjab Chief Minister Maryam Nawaz inaugurated the ambitious Cholistan project to irrigate south Punjab’s lands on February 15 amid public uproar and strong reservations in Sindh. The Sindh Assembly also passed a unanimous resolution against the project in March.\n\nThe past few months have seen nationwide protests from political parties, including the ruling coalition ally PPP, and residents against the proposed project.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2519312492f784b.png",
  "retrievedAt": "2025-08-25T14:34:14.325Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906512/sindh-cm-questions-utility-of-protests-after-govt-halts-canal-project",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T14:40:17.000Z"
}
