{
  "title": "Marble tomb will mark Pope’s last resting place - World - DAWN.COM",
  "author": null,
  "content": "VATICAN CITY: A simple, marble tomb nestled in a niche of a Roman basilica beloved by Pope Francis will mark the pontiff’s last resting place, the Vatican said on Thursday, releasing an image of the project.\n\nThe tombstone will bear only the inscription “Franciscus” — the pope’s name in Latin — and its marble will be sourced from Liguria, the northwestern Italian region that was once home to the Argentinian pontiff’s Italian ancestors.\n\nA reproduction of the pectoral cross worn by Pope Francis during his lifetime will hang above it. The tomb will be located near the altar of Saint Francis in the side nave of Santa Maria Maggiore, a fifth-century church in the heart of Rome that already holds the tombs of seven popes, the Vatican said.\n\nPope Francis was devoted to the worship of the Virgin Mary and made a point of praying in Santa Maria Maggiore before leaving on trips abroad and upon his return to Rome.\n\nThe pope declared in 2023 his desire to be entombed in the basilica. The last pope to be buried there was Clement IX in 1669.\n\nOne of four papal basilicas in Rome, Santa Maria Maggiore also holds the remains of several other renowned figures, such as the architect and sculptor Gian Lorenzo Bernini, who designed St Peter’s Square and its surrounding columns.\n\nBuilt around 432 under Pope Sixtus III, the basilica holds some of the Catholic Church’s most important relics, including an icon of the Virgin Mary holding the baby Jesus, attributed to Saint Luke. Pope Francis, born Jorge Bergoglio, had specified in his will the exact spot he wanted to be buried, where he also requested his tomb be unadorned.\n\nPublished in Dawn, April 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/680ae888c3d50.gif",
  "retrievedAt": "2025-10-12T02:43:52.818Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1906395/marble-tomb-will-mark-popes-last-resting-place",
  "dateList": "2025-04-25",
  "date_published": "2025-04-25T01:43:55.000Z"
}
