{
  "title": "19 killed in Nepal in ‘Gen Z’ protest over social media ban - World - DAWN.COM",
  "author": null,
  "content": "Unrest killed at least 19 people in Nepal on Monday, authorities said, as police in the capital fired tear gas and rubber bullets at protesters trying to storm parliament in anger at a social media shutdown and corruption.\n\nSome of the mainly youth protesters forced their way into the parliament complex in Kathmandu by breaking through a barricade, a local official said, setting fire to an ambulance and hurling objects at lines of riot police guarding the legislature.\n\n“The police have been firing indiscriminately,” one protester told the ANI news agency.\n\n“[They] fired bullets which missed me but hit a friend who was standing behind me. He was hit in the hand.”\n\nMore than 100 people, including 28 police personnel, were receiving medical treatment for their injuries, police officer Shekhar Khanal told Reuters. Protesters were ferrying the injured to the hospital on motorcycles.\n\nAnother two people were killed when protests in the eastern city of Itahari turned violent, police said.\n\nPrime Minister KP Sharma Oli called an emergency cabinet meeting to discuss the unrest, which erupted after thousands of young people, including many wearing their school or college uniforms, took to the streets earlier today.\n\nMany carried flags and placards with slogans such as “Shut down corruption and not social media”, “Unban social media” and “Youths against corruption”, as they marched through Kathmandu.\n\nOrganisers of the protests, which spread to other cities in the Himalayan country, have called them “demonstrations by Gen Z”. They say the protests reflect young people’s widespread frustration with government action to tackle corruption and boost economic opportunities.\n\n“This is the protest by the new generation in Nepal,” another protester told ANI.\n\nA government decision to block access to several social media platforms, including Facebook, last week has fuelled anger among the young. About 90 per cent of Nepal’s 30 million people use the internet.\n\nOfficials said they imposed the ban because platforms had failed to register with authorities in a crackdown on misuse, including false social media accounts used to spread hate speech and fake news, and commit fraud.\n\nPolice had orders to use water cannons, batons and rubber bullets to control the crowd and the army was deployed in the parliament area to bolster law enforcement officers, Muktiram Rijal, a spokesperson for the Kathmandu district office, told Reuters.\n\nHe said the curfew, which will remain in force until 10pm local time (1615 GMT), had been extended to Kathmandu’s Singha Durbar area, which includes the prime minister’s office and other government buildings.\n\nViolence abated later in the evening, although protesters remained in the area outside parliament.\n\nPolice said similar protests were also held in Biratnagar and Bharatpur in the southern plains and in Pokhara in western Nepal.\n\nMany people in Nepal think corruption is rampant, and the Oli government has been criticised by opponents for failing to deliver on its promises to tackle graft or make progress to address longstanding economic issues.\n\nThousands of young Nepalis go abroad every year for work and education.\n\nRameshwore Khanal, a former finance secretary, said that although job creation is not up to expectations, popular anger appears to stem more from unhappiness with government appointments and its inability to stamp out corruption.\n\nNepal’s social media shutdown comes as governments worldwide take steps to tighten oversight of social media and big tech due to growing concern about issues such as misinformation, data privacy, online harm and national security.\n\nCritics say many of these measures risk stifling free expression, but regulators say stricter controls are needed to protect users and preserve social order.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08193725df04fed.webp",
  "retrievedAt": "2025-09-19T14:30:28.785Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940524/19-killed-in-nepal-in-gen-z-protest-over-social-media-ban",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T14:39:02.000Z"
}
