{
  "title": "Emirati naval chief awarded Nishan-e-Imtiaz by President Zardari - Pakistan - DAWN.COM",
  "author": null,
  "content": "Commander of the United Arab Emirates (UAE) Naval Forces, Major General Humaid Abdulla Alremeithi, was on Monday awarded the Nishan-i-Imtiaz (Military) by President Asif Ali Zardari at a special investiture ceremony at the Presidency.\n\nA press release from the President’s Secretariat quoted Zardari as saying that the award was “in recognition of his outstanding services and contributions”.\n\n“He (President Zardari) added that the commander’s visit reflected the enduring fraternal ties between Pakistan and the United Arab Emirates, which stand as a testament to the two countries’ shared commitment to deepening cooperation in all fields,” the press release read.\n\nAccording to the press release, the president appreciated the confidence the UAE’s Navy placed in the professional expertise of the Pakistan Navy and expressed interest in further collaboration, stating that they remain ready to support their Emirati counterpart’s manpower requirements in the future.\n\nPresident Zardari also highlighted the extraordinary and exemplary relations that Pakistan and the UAE enjoy, which are “rooted in history and strengthened by enduring people-to-people bonds”. The press release said that he reaffirmed Islamabad’s resolve to continue working closely with the UAE and bolster brotherly ties.\n\n“Commander Alremeithi informed the president that he had close ties with Pakistan, having spent four years in the country while graduating from the Pakistan Naval Academy [in] Karachi,” the press release stated.\n\nDuring his visit, Maj Gen Alremeithi also called on Chairman of the Joint Chiefs of Staff Committee (CJCSC) General Sahir Shamshad Mirza at the Joint Staff Headquarters in Rawalpindi, where he was welcomed with a guard of honour, according to a press release from the Inter-Services Public Relations (ISPR).\n\n“The two dignitaries held in-depth discussions on professional matters, reviewing the evolving global and regional geo-strategic environment,” the ISPR said. “Both sides emphasised the vital role of bilateral defence and security cooperation, including in the maritime domain, for regional peace and stability.”\n\nThe ISPR stated that Maj Gen Alremeithi expressed appreciation for the professional standards and achievements of the Pakistan Armed Forces, as well as their sacrifices in the fight against terrorism and continued efforts towards achieving regional peace and stability.\n\nPakistan and the UAE share close diplomatic, economic, and cultural ties. The UAE is one of Pakistan’s largest trading partners in the Middle East and a major source of remittances, with a large Pakistani expatriate population living and working there.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08171109a789210.webp",
  "retrievedAt": "2025-09-19T14:30:30.868Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940510/emirati-naval-chief-awarded-nishan-e-imtiaz-by-president-zardari",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T12:25:08.000Z"
}
