{
  "title": "Overseas litigants’ facilitation cell set up - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Taking notice of the difficulties faced by overseas litigants in securing timely and convenient access to justice, Chief Justice of Pakistan (CJP) Yahya Afridi has established the Overseas Litigants Facilitation Cell (OLFC) with immediate effect.\n\nThe OLFC, located at the principal seat of the Supreme Court, will be managed by the principal staff officer to the CJP.\n\nIt is designed to serve as a dedicated point of contact, providing necessary support and facilitation to overseas litigants within the broad parameters of its mandate.\n\nFor ease of access, the OLFC can be reached through a dedicated WhatsApp number (+923264442444 — messages only), as well as via an online portal available on the official website of the Supreme Court.\n\nThe facility is intended solely for matters pertaining to the Supreme Court, and does not extend to cases falling under the exclusive jurisdiction of other courts.\n\nFor the purposes of the OLFC, the term “Overseas Litigants” includes any litigant residing abroad — regardless of nationality — who has the right to approach the Supreme Court of Pakistan.\n\nSubject to applicable laws and rules, the OLFC will facilitate the submission of petitions, applications, and grievances through digital means; assist in processing requests for early hearings before the Supreme Court; provide case updates; facilitate the provision of certified copies of orders electronically; maintain a digital record of all matters processed and their outcomes; and submit periodic reports to the CJP.\n\nThe OLFC will specifically deal with pending cases of overseas litigants under the appellate jurisdiction of the Supreme Court.\n\nIt will not, in any manner, entertain matters relating to other courts.\n\nPublished in Dawn, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:31:00.506Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940389/overseas-litigants-facilitation-cell-set-up",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:18:43.000Z"
}
