{
  "title": "‘Lack of sportsmanship’: Reactions pour in after India refuse to shake hands with Pakistan in Asia Cup - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan suffered an ignominious defeat at the hands of India, who beat them by seven wickets after beating the paltry 128-run target set by the Green Shirts during yesterday’s Asia Cup game.\n\nHowever, the match had been marred by controversy from the beginning due to calls from across the border to “boycott” the fixture. It seems the pressure got to the players as well, with the Indian team refusing to shake hands with their rivals at the toss and after the match.\n\nFurthermore, Indian skipper Suryakumar Yadav was said to have “politicised” the win by bringing up the Pahalgam terrorist attack in India-occupied Kashmir, over which the two countries fought a four-day military conflict in May, saying the victory was “a perfect gift” for his nation.\n\nFrom cricketers and politicians to fans and analysts watching the game, social media was rife with their takes on the scene.\n\nPakistan Cricket Board (PCB) Chairman Mohsin Naqvi expressed his disappointment over the “lack of sportsmanship” in a post on X shortly after the match.\n\n“Dragging politics into the game goes against the very spirit of sports. Let’s hope future victories are celebrated by all teams with grace,” he wrote.\n\nHe later said that the PCB has also lodged a complaint with the International Cricket Council (ICC) against the match referee for his alleged violations of rules pertaining to the “Spirit of Cricket” and sought his removal from the Asia Cup.\n\nFormer Pakistan all-rounder Mohammad Hafeez simply wrote on X: “sportsmanship”, followed by a broken heart emoji.\n\nFormer fast bowler Shoaib Akhtar, during a show aired on tapmad platform, said, “Do not make this match political, it’s a cricket match.”\n\n“Do a handshake. I said this pre-match too, that shake hands; there is no issue in it. It’s a game of cricket. Show your grace.”\n\nAkhtar lamented how the Indian cricketers took matters to the “next level”, adding, “I would go and shake hands with my enemies.”\n\nThe cricket legend further said he did not like the “post-match ceremony”, apparently referring to Suryakumar’s comments, and that Pakistan captain Salman Ali Agha made the right move by skipping the ceremony in response.\n\nMeanwhile, Pakistan pacer Aamir Jamal stated that when it comes to sportsmanship, “India will always lack [in] these things”.\n\nCiting Suryakumar’s remarks about his not shaking hands being in alignment with the Indian government and its cricket board to “give a proper reply”, Jamal said: “That’s not a reply, it’s [a] game of cricket.”\n\nDefence Minister Khawaja Asif lamented how India had brought “cricket to this level”.\n\n“Loss of face and international humiliation suffered by India in the recent conflict cannot be compensated by such shabby and petty attempts,” Asif wrote.\n\n“Wounds inflicted by [Pakistan] armed forces, loss of IAF (Indian Air Force) planes, including mighty [Rafales] won’t heal by such cheap theatrics,” he said, referring to Pakistani forces downing six Indian jets during the May conflict.\n\n“India’s injection of politics into sports is shameful,” wrote PTI leader and ex-senator Faisal Javed Khan on X, as he criticised state-broadcaster PTV for purportedly airing Suryakumar’s “anti-Pakistan remarks”.\n\nDr Khurram Abbas, director of the India Study Centre at the Institute of Strategic Studies Islamabad, recalled that Yadav was “trolled in India” after he shook hands with Salman at the trophy reveal ceremony.\n\n“Now under pressure and perhaps [on] instructions by the BCCI, Team India refused to shake hands with team Pakistan at the time of [the] toss and at the end of the match, which is against sportsman spirit,” he wrote.\n\n“This game is getting politicised … ICC should intervene.”\n\nHeader image: Pakistan’s Salman Agha looks dejected as he walks to the pavilion after he is caught out by India’s Abhishek Sharma off the bowling of India’s Axar Patel during the Asia Cup 2025 T20 match between India and Pakistan at the Dubai International Stadium on Sept 14, 2025. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/15164410c8d0e0c.webp",
  "retrievedAt": "2025-09-19T14:31:27.529Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1942168/lack-of-sportsmanship-reactions-pour-in-after-india-refuse-to-shake-hands-with-pakistan-in-asia-cup",
  "dateList": "2025-09-08",
  "date_published": "2025-09-15T12:05:48.000Z"
}
