{
  "title": "Removing the auto sector’s training wheels - Business - DAWN.COM",
  "author": null,
  "content": "Though we have celebrated 78 years of independence, our economic independence falls short with every new International Monetary Fund (IMF) programme.\n\nUnder the National Tariff Policy 2025–30, Pakistan plans to gradually flatten its customs regime by normalising commercial imports of used vehicles, liberalising trade and reducing protection for industries that failed to scale.\n\nUnder this new liberalisation programme, automakers are particularly agitated. The auto industry’s recent protests against imported used cars are justifiable, but how long can we cradle a baby that refuses to grow up?\n\nThe industry has enjoyed some of the highest effective rates of protection in the region, yet prices remain among the highest in Asia, volumes are stagnant, exports are negligible, and sales are sliding.\n\nCar ownership, especially in Asia, is seen as a prestige symbol. It also indirectly represents consumers’ purchasing power. Pakistan, in this regard, clearly lags behind other nations.\n\nPassenger-vehicle ownership is at only 20 cars per 1,000 people; Pakistan’s figures lag behind India at 34, Vietnam at 68 and Thailand at 275. Decades of policy shielding have yielded little; volumes remain low while prices of locally produced cars have gone through the roof.\n\nLet’s try to understand this better with the example of a top variant Suzuki Swift. In a country where per capita income remains around $1,800 and nearly 45pc of the population lives below the poverty line, the locally assembled Swift top variant costs about $16,900 in Pakistan. To put this in perspective, the same top Swift costs about $11,400 in India, proof that the local auto industry has become a white elephant.\n\nWithout gradual sequencing, the reforms risk replacing a weak but developing industrial base with an unsustainable import-driven consumption model\n\nThis affordability crisis partially explains the deeper structural failure. Low volumes mean assemblers cannot realise cost efficiencies. Without scale, localisation remains shallow, which keeps costs extremely high.\n\nCombined with falling purchasing power, sales eventually dry up, production slows, and tooling capacity sits idle. This circular trap has led consumers to pay luxury prices for average products while the industry remains stunted.\n\nThe government’s plan to liberalise, against this backdrop, apparently seems like a decisive shift. Starting from FY26, Pakistan will gradually allow commercial imports of used cars up to five years old, initially at a 40 per cent tariff premium that will gradually decline.\n\nAutomakers fear that this policy will create a “free-for-all” market that would undermine volumes further. Used cars already capture nearly a quarter of the market during weak years, and unrestricted inflows threaten to cannibalise demand for new vehicles entirely.\n\nYet, defenders of the IMF’s approach argue that this moment was inevitable. Consumers have paid inflated prices for decades, yet exporters have little to show for it. Pakistan’s auto exports remain below $100m annually, while the country sits on the edge of a $131 billion regional automobile trade corridor.\n\nAccording to the Pakistan Association of Automotive Parts & Accessories Manufacturers (Paapam), capturing even 5pc of that market could generate $6.5bn in exports, roughly 70 times current levels. The opportunity exists, but the incentives never align with competitiveness.\n\nAccording to a report by Paapam, Pakistan’s auto-parts ecosystem supports 1.83m skilled jobs and relies on over 1,200 suppliers. Localised production annually substitutes imports worth $1.25bn every year, and vendors have invested more than Rs100bn in tooling, plants, and production facilities.\n\nThe same vendors now report operating at a much lower capacity. The policy asymmetry is striking: assemblers can import entire semi-knocked-down kits at the same duty rates as raw materials, while domestic vendors continue paying 15pc duties on their inputs.\n\nThe industry, however, is not without blame. The state provided decades of shelter, yet manufacturers failed to innovate, meaningfully localise, or build export capacity. High-value components remain overwhelmingly imported, while vendors focus on low-value assemblies with limited global competitiveness. This results in overpriced vehicles, while manufacturers depend on policy favour rather than productivity gains.\n\nIn contrast, regional players such as India, Thailand, and Vietnam all began with similar protective measures but used them to build globally competitive industries. India’s liberalisation in 1991 effectively combined measured tariff rationalisation with aggressive industrial strategy, leading to production levels exceeding 5m vehicles annually. It now boasts more than 600,000 exports a year and $9bn in auto-parts exports.\n\nPakistan, however, chose import substitution without preparing for competition. Now, liberalisation risks dismantling an industrial ecosystem built painstakingly over decades.\n\nSo, what is the solution? It lies at neither extreme. Tariffs must be rationalised gradually but tied to measurable localisation and export milestones rather than unconditional market access. Without sequencing, the reforms risk replacing a weak but developing industrial base with an unsustainable import-driven consumption model.\n\nThe author is an economist and an educationist.\n\nPublished in Dawn, The Business and Finance Weekly, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:02:11.802Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940050/removing-the-auto-sectors-training-wheels",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:18:52.000Z"
}
