{
  "title": "‘Flood peak’ expected at Guddu Barrage tomorrow, says Murad - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Sindh Chief Minister Syed Murad Ali Shah has said that the “flood peak” — the moment when the river’s water level or discharge reaches its maximum height and volume during a flood event — in the Indus River has been delayed and is now expected to reach Guddu Barrage on Tuesday (tomorrow), bringing flows of more than 800,000 cusecs.\n\nAfter receiving a briefing at the Flood Emergency Centre on Sunday, he told the media that preparations and the evacuation of vulnerable riverine populations had been accelerated.\n\nHe was accompanied by Senior Minister Sharjeel Memon, Rehabilitation Minister Makhdoom Mahboob, Chief Secretary Asif Hyder Shah and other officials.\n\nThe chief minister said that commissioners had begun making announcements across katcha (riverine) areas to ensure residents vacated their homes and moved to safer locations.\n\nCM says over 800,000 cusecs of water likely to displace 324,000 people; stresses unity, warns against misinformation during flood emergency\n\nHe confirmed that provincial ministers were stationed on both the right and left banks of the Indus to directly supervise evacuations.\n\nMr Shah revealed that approximately 324,000 people were likely to be displaced, of whom 128,000 had already left their homes. However, most evacuees had chosen not to stay at relief camps, with some relocating to embankments. So far, over 40,000 patients have been treated, while 900,000 livestock animals have been vaccinated.\n\nHe said measures taken to drain water from the Left Bank Outfall Drain (LBOD) were expected to prove beneficial. He also noted that bridges were being constructed on the Indus Highway to facilitate movement.\n\nAddressing the comparative flood situation in Punjab, the chief minister said that conditions there were far more severe.\n\n“At this time, the real need for support is in Punjab. Our health minister has already offered medical assistance to them,” he said.\n\nHe clarified that reports of 40 villages being inundated in Sehwan referred to katcha settlements that are always at risk during floods.\n\nEmphasising unity during national crises, Mr Shah recalled that the nation had stood together during the May border confrontation with India.\n\nThe chief minister assured that all relief and healthcare camps had been geo-tagged, with boats, supplies and staff in place.\n\n“Our preparations are complete. The rain in Sindh is manageable, and rainfall in Koh-i-Suleman is not so intense as to immediately flood the river. But we remain cautious,” he noted.\n\nReferring to recent rains in Karachi, he pointed out that drainage measures had cleared the city within hours on Aug 19.\n\nHe expressed confidence that Sindh would withstand the flood, while urging the public to avoid misinformation and cooperate fully with the authorities.\n\nHe acknowledged the active oversight of PPP Chairman Bilawal Bhutto-Zardari and President Asif Ali Zardari, noting that both leaders were being frequently updated on the situation.\n\nMr Shah clarified that Sindh did not currently require federal financial aid, though the prime minister and chief secretary remained engaged in coordination efforts.\n\nHe added that urban flooding could not be entirely prevented, but the key was to drain water within hours — something the provincial government had managed to do successfully after the recent rains.\n\nThe chief minister concluded by urging the public to ignore misinformation, highlighting common challenges during flood situations, and noting action taken against criminal elements in katcha regions.\n\nOver 128,000 shifted to safer locations: Sharjeel\n\nSindh Senior Minister Sharjeel Inam Memon said all cabinet members, designated focal persons, and members of the provincial and national assemblies are also present in the field and personally monitoring the relief measures.\n\nIn a statement, he said that 128,057 people have so far been shifted to safer places from 167 UCs in 15 districts of the province.\n\nHe said that 6,288 people were relocated in the last 24 hours. He added that 39,576 victims have been provided medical assistance at 154 fixed and mobile health camps set up by the Sindh government, including 5,772 people treated in the last 24 hours alone.\n\nHe said that arrangements have also been made for the safety of livestock. In the past 24 hours, 9,384 cattle were moved to safe areas, bringing the total to 370,161 cattle. In addition, 70,267 cattle were vaccinated and treated in the last 24 hours, while a total of 878,796 cattle have been vaccinated and treated so far.\n\nPublished in Dawn, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08100014810fc47.webp",
  "retrievedAt": "2025-09-19T14:30:46.925Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940368/flood-peak-expected-at-guddu-barrage-tomorrow-says-murad",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:19:12.000Z"
}
