{
  "title": "Draft SBCA law proposes new force to curb illegal construction in Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: After the tragic Lyari building collapse that claimed 27 lives in July, the Sindh government has initiated “reforms” to overhaul the Sindh Building Control Authority (SBCA) with a new draft of law that proposes establishment of a separate force for the regulatory body to monitor illegal construction and making all related offences cognizable, non-bailable, and non-compoundable, with penalties for those found guilty.\n\nThe draft of the amended SBCA law, a copy of which is available with Dawn, was already shared with stakeholders by the Sindh government.\n\nThe proposed force would be tasked with implementing building regulations and cracking down on illegal construction activities.\n\nThe draft law reads: “For the purpose of effectively preventing and controlling the unauthorised construction of buildings, and demolition of the unauthorised and dangerous and dilapidated buildings in the province, the field establishment under sub-section (2) shall form and constitute the SBCA Force, which shall perform functions as may be assigned to it by the director general with the approval of the governing body.”\n\n11-member governing body comprising experts and govt officials planned\n\nSources said that the proposed reforms also included the establishment of a governing body comprising senior officials and experts to oversee operations and ensure transparency and accountability.\n\n“Among key features of the proposed law include constitution of the governing body for the SBCA,” said a source privy to the details of the draft.\n\n“The 11-member body would be led by local government minister while additional chief secretary of local government, commissioner of the concerned division, chairman of Pakistan Engineering Council, chairman of Pakistan Council of Architects and Town Planners, vice chancellor of NED university, vice chancellor of MUET Jamshoro, director general of KDA, CEO of KWSC, senior director of Sindh Master Plan Authority and DG of SBCA have been proposed as members of the body,” the source added.\n\nThe draft law, which is proposed to be called “Sindh Building Control Authority Act 2025”, proposes that “all offences under this act shall be cognizable by police, non-bailable, and non-compoundable”.\n\nHowever, it says: “It shall extend to the entire province of Sindh but shall not apply to Cantonment areas.”\n\nIt defines a range of construction-related violations and recommends penalties of up to five years’ imprisonment and up to five million rupees fine for builders, developers, or property owners found involved in illegal construction activities.\n\nMuhammad Hassan Bakhshi, chairman of the Association of Builders and Developers, who also received a copy of the draft law, welcomed the government’s move.\n\nHe said that effective implementation of the law in its true spirit could help put an end to the menace of illegal construction.\n\nAdvocate Saifuddin of Jamaat-i-Islami, who is the leader of the opposition in the City Council, also got a copy of the proposed amendments.However, he said he would comment only after thoroughly reviewing the document.\n\n“However, we believe that the SBCA governing body must include public representation and opposition members should also be part of this body,” he added.\n\nPublished in Dawn, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:30:47.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940366/draft-sbca-law-proposes-new-force-to-curb-illegal-construction-in-sindh",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:19:12.000Z"
}
