{
  "title": "SC plans to use AI to categorise cases for fixing but ‘not yet ready’: CJP Afridi - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief Justice of Pakistan Yahya Afridi on Monday said the Supreme Court had plans to use artificial intelligence to categorise cases for fixation but the judiciary was “not ready” for the technology yet.\n\nHe was addressing a judicial conference at the apex court, marking the commencement of the new judicial year.\n\n“We all talk about technology, we all talk about AI to be utilised for enhancing the justice delivery system,” Justice Afridi said, adding that 61,000 files will be digitally screened under a project that will be completed within six months.\n\n“It is only when you have them digitally scanned that you can utilise the tools of AI for categorisation. It will be easy to categorise cases and to fix before one bench one issue,” he said.\n\nThe chief justice emphasised, “Yes, technology is necessary. Yes, AI has to be utilised. But no, not now. We are not ready for it. We have to prepare ourselves for that.”\n\nJustices Mansoor Ali Shah, Munib Akhtar, Aminuddin Khan, Jamal Khan Mandokhail, Muhammad Ali Mazhar, Ayesha A. Malik, Athar Minallah, Shahid Waheed, Musarrat Hilali, Naeem Akhtar Afghan, Muhammad Shafi Siddiqui and Malik Shahzad Ahmad were among the fellow SC judges seen attending the event. Judges of the high courts were also present.\n\nDuring his speech, CJP Afridi also detailed a number of new policies and standard operating procedures (SOPs) introduced to address the structure of discussions on important issues.\n\nJustice Afridi remarked that the chief justice could previously take up any case out of order for an early hearing, but SOPs were now in place to prevent that.\n\nStating that the court was taking up cases on a “first-come, first-served” basis, the top judge clarified that the court would not hear cases out of their order.\n\nThen, apparently responding to one of the questions raised in Justice Shah’s recent letter on the CJP having powers to grant or refuse judges’ leaves, Justice Afridi said leaves outside of judicial holidays required permission.\n\n“Let’s look at the grant of leave. I made it very clear, during holidays anyone who wants to go anywhere, no issue. But when there is court work, then I said here is the discretion, discretion is the exercise, it is the criteria, you have got everything in writing.”\n\nJust last month, the SC issued a number of policy decisions taken between Oct 26, 2024 and Aug 12, 2025. One such decision, reflected in a General Standing Order dated July 29, 2025, amended the Supreme Court Judges (Leave, Pension and Privileges) Order 1997, empowering the CJP to grant or refuse leave, whether within or outside Pakistan, or to revoke or curtail leave already granted to judges of the court.\n\nIn his letter, Justice Shah wrote: “In principle, leave can, if at all, only possibly be considered for refusal where: (i) a part-heard case cannot be adjourned; (ii) urgent administrative duty demands presence; or (iii) a judge is negligent in work and seeks leave to evade it.\n\n“Yet, in practice, leave is being denied even when none of these circumstances exist-apparently to enforce compliance and control, and to prevent independent judges from speaking at international forums.”\n\nCJP Afridi further observed that the National Judicial Policy-Making Committee, which he heads and includes all the chief justices, had given “serious attention” to the issue of enforced disappearances.\n\n“We sat down and decided on 17 items on which we are to proceed […] First and foremost was that serious attention was given to enforced disappearances,” the top judge said.\n\nHe thanked Attorney General for Pakistan (AGP) Mansoor Usman Awan for assuring the judiciary that the government was “seriously considering a mechanism to ensure the production of detained persons”.\n\n“I thank you for that and I expect that soon, we will have a good news regarding that,” Justice Afridi remarked.\n\n“Number two, to safeguard the dignity of judges, SOPs have also been framed by the high courts to protect the judicial officers from external influence. This is the district judiciary. We have done it; all the district judiciary, all the high courts have framed their rules,” the CJP stated.\n\nJustice Afridi observed that after assuming the CJP’s office in October 2024, he felt the need for reforms, which were categorised based on “five principles”.\n\nThe CJP listed those principles: “To improve service delivery through technology, to improve access and transparency, to strengthen legal and regulatory framework, leverage international and external resources, and to revitalise the attached departments.”\n\nNoting that the apex court had eight sections, CJP Afridi said each section prioritised speedy justice. He said digital case-filing and case-tracking were among the measures raised during six interactive meetings held to discuss the SC’s reforms.\n\n“There are two groups in the lawyers’ community,” the CJP remarked, adding that members from both were included in the consultation process for judicial reforms.\n\nHe detailed that a high-powered committee led by Justice Shahid Waheed, which also included Justices Irfan Saadat Khan, Afghan and Abbasi, reviewed suggestions made by the SC “sections”, some judges and lawyers. Those were then placed before an administrative full court meeting on April 17.\n\nJustice Afridi also spoke of the “Public Facilitation Centre” inaugurated today, which will begin its operations on October 1 and will provide “all details” related to cases.\n\nReiterating the need for speedy disposal of cases, he asserted: “We have always worked for the supremacy of the law.”\n\nEmphasising that rules cannot be made within a single day, the judge urged those having objections to file their recommendations, which would then be taken up by a committee and eventually the full court. “I assure you that whatever your proposals are will be […] taken into consideration,” he affirmed.\n\nDuring his address, CJP Afridi highlighted that the security provided to him and other judges has been reduced, as well as the protocols when in Islamabad’s Red Zone, which houses key government buildings.\n\n“I had nine security contingents as the chief justice. I sat down with the security people and I said ‘I am in the Red Zone, my residence is in the Red Zone, please have a heart’. So we have come down to this that there will only be two security vehicles with me, and same is the case with the worthy judges.”\n\nHe remarked that judges could need security when going outside of Islamabad, but not as much when in the Red Zone.\n\nContinuing his speech, Justice Afridi noted that the Supreme Judicial Council (SJC) had decided on 64 complaints against judges, 72 had been referred to the council’s members, and 65 were pending, which would be considered in the SJC meeting later this month.\n\nAGP Awan, Pakistan Bar Council Vice Chairman Tahir Nasrullah Warraich, and Supreme Court Bar Association (SCBA) President Mian Rauf Atta also addressed the event.\n\nSeparately, CJP Afridi also inaugurated a “Media Station” at the SC, telling mediapersons on the occasion: “You people are necessary for the system because you keep everyone in check. […] Please keep us on check but it should be healthy.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08140410e346daf.webp",
  "retrievedAt": "2025-09-19T14:30:34.693Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940454/sc-plans-to-use-ai-to-categorise-cases-for-fixing-but-not-yet-ready-cjp-afridi",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T05:24:27.000Z"
}
