{
  "title": "Flood risks — act before, not after - Business - DAWN.COM",
  "author": null,
  "content": "Climate change has pushed agricultural risks to alarming levels. The intensity and frequency of floods, torrential rains, cloudbursts, windstorms, heatwaves, and droughts have risen sharply, alongside an ever-increasing risk of crop diseases and pest outbreaks. These recurring natural calamities — most recently the catastrophic super flood of 2025 — have left farmers extremely vulnerable.\n\nParticularly, small farmers — those holding less than 12.5 acres — are in deep misery in flood-affected areas. Out of 11.7 million farms in the country, nearly 97 per cent of farms are smaller than 12.5 acres, as per the 7th Agricultural Census 2024. In other words, the proportion of such vulnerable farmers is extremely high. Their Kharif crops have already been wiped out, leaving them with no fallback option.\n\nLooking ahead, they face two daunting challenges. First, sustaining their families, especially when many have lost stored wheat stocks and, in some cases, livestock as well; and second, securing agricultural inputs for the upcoming Rabi (wheat) crop, whose sowing is just a month and a half away.\n\nThe government has no comprehensive plan to cope with floods or safeguard farmers’ livelihoods. Instead, it continues to focus on reactive, firefighting responses rather than proactive adaptation measures. Successive governments in the past have largely relied on announcing discretionary relief programmes for affected farmers. But these ad hoc, ex-post measures are often plagued by corruption, bureaucratic delays, and time-consuming procedures. In a recent TV talk show, Khalid Hussain Batth, Chairman of Kissan Ittehad, disclosed that a large number of farmers have still not received the compensation announced for the 2022 floods.\n\nGiven the growing scale of climate-induced calamities, it has become imperative for the government to shift from a relief-based model to ex-ante risk management mechanisms. This is particularly urgent for floods, which, unlike droughts and heatwaves, have a sudden and devastating impact on vast agricultural lands, often causing long-term soil degradation.\n\nAs climate change intensifies and agricultural risks mount each passing year, the case for universal crop insurance has never been more compelling\n\nThe 2025 flood has inflicted unprecedented devastation in Punjab. It is largely due to unchecked settlements on riverbeds in rural areas. Across the Sutlej and Ravi rivers, it is common to see agricultural fields, farmers’ private bunds, and even houses and livestock sheds built on raised platforms after filling up land in the riverbeds. These obstructions have narrowed the river’s natural water-carrying capacity, leading to the inundation of vast tracts that were never previously considered at risk. At the same time, such choke points have placed immense pressure on upstream embankments and bunds, resulting in breaches.\n\nMoreover, in several locations, poorly designed highways and river bridges have obstructed the natural flow of floodwaters. For instance, the Baba Farid bridge on the Sutlej river, connecting Pakpattan to Minchanabad, lacks culverts along an eight-kilometre stretch of its approach road. As a result, the river’s decades-old natural waterways, which allow excess water to pass during floods, have been blocked. Similarly, the bridge’s guide banks are too short in length to streamline the river’s flow through the bridge openings. Such design flaws and neglected maintenance of the structures have intensified upstream pressure, leading to widespread destruction.\n\nNewspapers and TV talk shows are filled with demands from various stakeholders to remove encroachments from riverbeds. However, it is important to note that unlike canals, rivers naturally shift their course over time.\n\nIn many instances, they now flow through land privately owned by farmers for generations. Therefore, if the government truly intends to create space for rivers by clearing artificial choke points to avert future devastation — even partially — it will inevitably need to acquire private lands on a large scale under the Land Acquisition Act, 1894, or alternatively enforce the Punjab Irrigation, Drainage, and Rivers Act 2023 (section 4).\n\nEqually pressing is the need to strengthen the financial resilience of farmers in flood-prone areas. Unfortunately, the scope of the federal government’s Crop Loan Insurance Scheme has remained narrow and restrictive, which makes them ineffective in many ways. It covers only small- and medium-sized farmers (up to 25 acres) who take agricultural production loans from banks, excluding millions of non-borrowing farmers. Moreover, coverage is limited to major field crops — wheat, rice, cotton, maize, and sugarcane.\n\nAs climate change intensifies and agricultural risks mount each passing year, the case for universal crop insurance has never been more compelling. Such a scheme should ensure that all farmers — regardless of landholding size, access to bank loans, or crop type — are automatically covered against flood risk, with a meaningful sum insured that can genuinely protect farmers’ livelihoods. Advances in computer-based modelling now make it possible to mark flood-prone areas precisely, factoring in weather forecasts, topography of the area, and hydrological data.\n\nIn conclusion, creating room for rivers and extending crop insurance to all farmers in flood-prone areas are two fundamental measures needed to address the flood challenge, which carries both technical and humanitarian dimensions. Though these steps demand considerable financial resources, the real question is not about funding but whether the government has the political will to make them happen.\n\nKhalid Wattoo is a development professional and a farmer, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad.\n\nPublished in Dawn, The Business and Finance Weekly, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68be2cbee1587.jpg",
  "retrievedAt": "2025-10-12T04:02:10.719Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940433/flood-risks-act-before-not-after",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:18:51.000Z"
}
