{
  "title": "Final goodbyes: Pet funerals become part of Korean life - World - DAWN.COM",
  "author": null,
  "content": "PET funerals are becoming common, supported by a pet-owning population that has grown to 15.46 million, representing 29.9 per cent of the country. The practice now covers a wide range of animals, from dogs and cats to turtles, parrots and even goldfish.\n\nRising demand has invigorated the industry, drawing in new providers and expanding available services. Yet calls for better accessibility remain strong, as many owners still struggle to find nearby facilities to bid farewell to their closest companions.\n\nA study by the KB Financial Research Institute in June found that 64.6pc of Ko­­reans who had lost pets held a funeral — either through a funeral home or a veterinarian — up sharply from 38.7pc in 2023.\n\nThe share opting for cremation, which costs at least 150,000 won ($108) and is pricier than veterinary disposal, also rose from 29.5pc to 49.5pc. The surge is partly explained by legal restrictions.\n\nUnder Korean law, animal bodies are classified as waste, which makes unauthorised burials illegal. For those who do not choose a funeral, the only legal option is to dispose of the remains in a designated garbage bag, an idea that many pet owners find unthinkable. To some, the emotional relief that funerals provide is a stronger reason.\n\n“Of course, there were no other legal options. But a much bigger reason was that I could be with her sincerely until the very end, even if it meant spending hundreds of thousands of won,” Kim said. “The feeling of ‘this is really our fa­­r­ewell’ gave me a chance to settle my heart.”\n\nLee Woong-jong, an animal welfare professor at Yonam College, noted that the rise in pet funerals reflects a shift in public perception in Korea, as pets in the past were often treated like “toys.”\n\n“For current Koreans, pets carry deep meaning. Losing them can cause serious emotional distress, sometimes leading to what is known as pet loss syndrome. Funerals help families bring a beautiful closure to their bond with their pets.”\n\nPublished in Dawn, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/68be06c71c630.jpg",
  "retrievedAt": "2025-10-12T04:02:30.078Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940380/final-goodbyes-pet-funerals-become-part-of-korean-life",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:19:04.000Z"
}
