{
  "title": "Pindi police book Aleema Khan, Naeem Panjutha, others for violence against journalist outside Adiala Jail - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Rawalpindi Police on Monday booked PTI founder Imran Khan’s sister Aleema Khan, party lawyer Naeem Panjutha and others for violence against a journalist outside Adiala Jail.\n\nA first information report (FIR) was filed at the Saddar Bairooni Police Station today on the complaint of Supreme Court Press Association President Tayyab Baloch under Sections 147 (punishment for rioting), 149 (every member of unlawful assembly guilty of offence committed in prosecution of common object), 382 (theft after preparation made causing death, hurt or restraint in order to committing of the theft), 427 (mischief causing damage to the amount of fifty rupees) and 506 (punishment for criminal intimidation) of the Pakistan Penal Code.\n\nBaloch said that he was present outside Adiala Jail at around 3:55pm for reporting with other journalists when Aleema and other people began a media talk after a hearing for the Toshakhana case.\n\n“During this time, a person named Naeem Panjutha called out: ‘Teach him a lesson for questioning Aleema about properties,’” Baloch said, adding that 35-40 people there grabbed him at that, laid him down and began beating him.\n\n“During this time, some unknown person snatched my mobile phone from me and also broke my microphone,” he said, adding that other reporters there who tried to rescue him were also beaten up.\n\n“We barely escaped them after much pleading. The reason is that I had previously asked Aleema Khan about purchasing properties in America as a journalist, which made her uncomfortable. On which, Aleema Khan, through his workers, first posted pictures of me … [and others] on social media and spread rumours against us. Today, as per the pre-arranged plan, they attacked me, beat me up, forcibly snatched my mobile and threatened to kill me, along with breaking my microphone.”\n\nHe requested legal proceedings against Aleema, Panjutha and the other suspects.\n\nIn reponse, Panjutha termed the FIR a “fake case” against him and Aleema.\n\nSlamming the incident, Information Minister Attaullah Tarar said Baloch was targeted with violence “solely and only because of a difference of opinion, which is unacceptable”.\n\nHe said strict action would be taken and vowed to give his full support.\n\nPPP leaders such as Chairman Bilawal Bhutto-Zardari, Nadeem Afzal Chan and Karachi Mayor Murtaza Wahab also condemned the incident.\n\nKarachi Press Club President Fazil Jamili said the incident was both “unfortunate and condemnable”. He added that “this new trend will not end unless political parties actively discourage it. We must remember that politics and journalism rise & fall together.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08230118eabd783.webp",
  "retrievedAt": "2025-09-19T14:30:28.967Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940536/pindi-police-book-aleema-khan-naeem-panjutha-others-for-violence-against-journalist-outside-adiala-jail",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T17:45:18.000Z"
}
