{
  "title": "WHO asks Taliban to lift female aid worker restrictions following earthquakes - World - DAWN.COM",
  "author": null,
  "content": "The World Health Organisation (WHO) has asked Taliban authorities to lift restrictions on Afghan female aid workers, allowing them to travel without male guardians and help women struggling to access care after a powerful earthquake killed 2,200 people in eastern Afghanistan.\n\n“A very big issue now is the increasing paucity of female staff in these places,” Dr Mukta Sharma, the deputy representative of WHO’s Afghanistan office, told Reuters.\n\nShe estimated around 90 per cent of medical staff in the area were male, and the remaining 10pc were often midwives and nurses, rather than doctors, who could treat severe wounds.\n\nThis was hampering care as women were uncomfortable or afraid to interact with male staff and travel alone to receive care.\n\nThe September 1 magnitude-6 quake and its aftershocks injured more than 3,600 people and left thousands homeless in a country already dealing with severe aid cuts and a slew of humanitarian crises since the Taliban took over in 2021 as foreign forces left.\n\nThe Afghan health ministry and a spokesperson for the Taliban administration did not immediately respond to a request for comment.\n\nTaliban say they respect women’s rights in line with their interpretation of Islamic law and have previously said they would ensure women could receive aid. Its administration in 2022 ordered Afghan female NGO staff to stop working outside the home.\n\nHumanitarian officials say there have been exemptions, particularly in the health and education sectors, but many said these were patchwork and not sufficient to allow a surge of female staff, particularly in an emergency situation that required travel.\n\nThat meant aid organisations and female staff faced uncertainty, Sharma said, and in some cases were not able to take the risk.\n\n“The restrictions are huge, the mahram (male guardian requirements) issue continues and no formal exemption has been provided by the de facto authorities,” she said, adding her team had raised the issue with authorities last week.\n\n“That’s why we felt we had to advocate with [authorities] to say, this is the time you really need to have more female health workers present, let us bring them in, and let us search from other places where they’re available.”\n\nSharma said she was extremely concerned about women in the future being able to access mental health care to deal with trauma as well as for those whose male family members had been killed, leaving them to navigate restrictions on women without a male guardian.\n\nPeer Gul from Somai district in Kunar province, which was severely hit by the quakes, said many women from his village had experienced trauma and high blood pressure after the earthquake and were struggling to reach medical care.\n\n“There is no female doctor for examinations; only one male doctor is available,” he said.\n\nSharma noted the growing shortage of Afghan female doctors as the Taliban have barred female students from high school and university, meaning a pipeline of women doctors was not being replenished.\n\nThe United Nations estimates around 11,600 pregnant women were also impacted by the quakes in a country with some of the highest maternal mortality rates in Asia.\n\nFunding cuts, including by the US administration this year, had already left the health system reeling. Around 80 health facilities had already closed in the affected areas this year due to US aid cuts and another 16 health posts had to be shuttered due to damage from the earthquake, Sharma said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08124614d2cf482.webp",
  "retrievedAt": "2025-09-19T14:30:32.684Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940471/who-asks-taliban-to-lift-female-aid-worker-restrictions-following-earthquakes",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T08:00:26.000Z"
}
