{
  "title": "GB CM, 10 others sacked from PTI over new bloc - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: As many as 11 lawmakers of Gilgit Baltistan, including Chief Minister Gulbar Khan, lost the basic membership of Pakistan Tehreek-i-Insaf (PTI) for making a forward bloc and voting against the party policy, according to the termination letters issued to them.\n\nBesides CM Khan, members of GB Legislative Assembly Surayya Zaman, Shamsul Haq Lone, Raja Nasir Khan Maqpoon, Raja Azam Khan Amacha, Syed Amjad Zaidi, Mushtaq Ahmad, Haji Shah Baig, Dilshad Bano, Abdul Hameed and Fazal Rahim were given formal termination notices, all containing identical wording.\n\n“This letter serves as formal notice of termination of your membership, effective immediately. This decision has been made in accordance with party’s policy and procedures. The reason for this termination is your actions in the GB Assembly, specifically making a forward bloc and voting against the party decision, which is a clear violation of our party’s policy.\n\n“Your actions have caused harm to the party’s interests and reputation,” stated the letters issued by Additional Secretary General of PTI Firdous Shamim Naqvi.\n\nParty announces complete support for strike in Balochistan against lawlessness\n\nAll the 11 lawmakers were directed to “refrain from using party’s [PTI] name, designation and/or membership in any manner or whatsoever, failing which the party reserves to take action against you which may also lead to legal action,” the letters stated.\n\nHowever, according to a party insider, the issuance of letters may not make any difference to them, as the “whole system” was allegedly backing them.\n\nAlso, the PTI issued a show-cause notice to former GB governor Raja Jalal Hussain Maqpoon, according to Dawn.com. The notice, dated Sept 5, said it had come to PTI’s notice that Mr Maqpoon had “conspired against the party and approached party members for defection”.\n\n“In view of these reported activities, you are hereby called to explain yourself in writing within two days of this notice. If your reply is unsatisfactory or you do not respond, further action will be taken as per party policy and rules,” it added.\n\nBacks strike in Balochistan\n\nMeanwhile, acting on the direction of PTI founder Imran Khan, the PTI announced complete support for the wheel-jam and shutter-down strike in Balochistan on Monday against escalating lawlessness, rising terrorism, and the government’s failure to protect citizens.\n\nThe call for province-wide strike was given by a six-party opposition alliance comprising Balo­chistan National Party-Mengal (BNP-M), Pasht­unkhwa Milli Awami Party (PkMAP), Awami National Party (ANP), National Party (NP), and Majlis Wahdat-i-Musl­imeen (MWM).\n\nA statement from PTI’s central media department explained that the coalition had announced the joint protest against the recent attack at Shahwani Stadium on BNP-M rally, which claimed several precious lives and left many others injured. It emphasised that the strike was intended not only to mourn the victims of the tragedy but also to expose the government’s abject failure to provide security to its citizens.\n\nThe PTI warned that militancy and extremism were witnessing an alarming resurgence in Balochistan, Khyber Pakhtunkhwa, and other parts of the country due to government’s policies and priorities.\n\n“PTI strongly believes that the people’s voice cannot be suppressed by terrorism, state oppression, or the use of coercive force. Our democratic struggle for peace, justice, and fundamental rights will not only continue but will be pursued with renewed determination and even greater resolve,” it stated.\n\nOn the other side, the PTI extended felicitations to the nation on Pakistan Air Force Day. It stated, “September 7 stands as a symbol of the unmatched bravery, sacrifice, and valour demonstrated by the Pakistan Air Force in the defence of our homeland.\n\nOn this day, we pay tribute to the martyrs who laid down their lives to safeguard the nation’s sovereignty.”\n\nPublished in Dawn, September 8th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T04:01:53.211Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940396",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T01:18:29.000Z"
}
