{
  "title": "Alcaraz outshines rival Sinner to win second US Open crown - Sport - DAWN.COM",
  "author": null,
  "content": "Carlos Alcaraz beat Jannik Sinner in four sets on Sunday to win the US Open and reassert his dominance of an era-defining rivalry in a final delayed by the visit of United States President Donald Trump.\n\nThe 22-year-old Alcaraz won 6-2, 3-6, 6-1, 6-4 to capture his second US Open crown and sixth Grand Slam title, avenging his lone defeat in a major final by Sinner at Wimbledon in July.\n\n“It’s a great feeling. I’m working really hard just to lift this trophy. It’s my second one but it’s still a dream come true,” said Alcaraz.\n\nAlcaraz will reclaim the world number one ranking from Sinner, returning to top spot on Monday for the first time since September 2023 after ending the Italian’s 27-match winning run at hard-court Grand Slams.\n\n“It was one of the first goals that I had, to recover the number one (ranking),” said Alcaraz, who also defeated Sinner in an epic French Open final in June. Alcaraz has now won seven of the past eight meetings and is 10-5 overall against Sinner.\n\n“I tried my best today. I couldn’t do more,” said Sinner. “I felt like he was doing everything slightly better today.\n\n“He raised his level when he had to … He played better than me today.”\n\nAlcaraz and Sinner have shared the last eight Grand Slams on offer, winning four apiece to assert their superiority over the rest of the sport, including Novak Djokovic.\n\nBut while Sinner is 109-4 against the rest of the tour over the past two seasons, Alcaraz has had his number.\n\n“It’s going to be on me if I want to make changes or not,” said Sinner. “That’s what I have to do, trying to become a better tennis player.”\n\nSinner’s defeat at Flushing Meadows extends the longest drought without a successful men’s title defence of any Grand Slam in the Open era.\n\nNo man has retained the US Open crown since Roger Federer won five in a row from 2004 to 2008.\n\nAnticipation for the third straight Grand Slam final between the game’s top two players assumed an even greater dimension with the presence of Trump.\n\nIt was the latest in a series of visits to major sporting events for the US leader after his trip to the NFL’s Super Bowl in February and the FIFA Club World Cup final in July.\n\nHe appeared before the playing of the Star-Spangled Banner, waving to the crowd, which greeted him with a mix of cheers and boos. He was given a frostier reception later in the match though, when shown again on the stadium’s big screens.\n\nA constellation of showbiz and sports icons turned out as well on Sunday, with rock star Bruce Springsteen, fashion icon Tommy Hilfiger, actor Michael Douglas and basketball superstar Stephen Curry all on hand.\n\nThe start of the final was pushed back 30 minutes to allow fans additional time to enter Arthur Ashe Stadium as a result of tighter security measures in effect due to Trump’s attendance.\n\nEven then, the 23,000-capacity venue was no more than three-quarters full when Alcaraz broke Sinner in the opening game of the match.\n\nAs he did in the Wimbledon final, Alcaraz pinned Sinner on the back foot early and broke a second time for a 5-2 lead before serving out to love.\n\nWith hundreds of spectators still waiting to get in at the start of the second set, Alcaraz sought to hammer home his advantage against Sinner.\n\nHe created a break point but Sinner hung on and stalled Alcaraz’s momentum, belatedly ramping up his game and surging 3-1 ahead as the Spaniard suffered a brief dip on serve.\n\nSinner levelled the contest at a set apiece but Alcaraz stormed back with another break early in the third, wriggling out of a tight spot on serve with the help of a sensational baseline smash that sliced away from his rival for a 3-0 edge.\n\nHe padded his lead with another break and quickly wrapped up the set, keeping his foot down to corner Sinner again to begin the fourth set.\n\nThis time Sinner saved two break points but Alcaraz made another charge in the fifth game, delivering the decisive blow for an advantage he never relinquished as the Spaniard became only the fourth man to win multiple majors on hard courts, grass and clay.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/08101120ccf92c3.webp",
  "retrievedAt": "2025-10-12T04:02:35.445Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940450/alcaraz-outshines-rival-sinner-to-win-second-us-open-crown",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T05:17:04.000Z"
}
