{
  "title": "US federal court upholds $83m sex assault defamation order against Trump - World - DAWN.COM",
  "author": null,
  "content": "A United States appeals court upheld on Monday a jury’s $83.3 million penalty against President Donald Trump for defaming author E. Jean Carroll, whom he was found to have sexually assaulted.\n\nThe January 2024 order consisted of $65m in punitive damages after the jury found Trump acted maliciously in his many public comments about Carroll, $7.3m in compensatory damages and $11m to pay for an online campaign to repair Carroll’s reputation.\n\nThe civil order, which prompted an audible gasp in the federal court, far exceeded the more than $10m in damages for defamation that Carroll had sought.\n\nTrump — whom a jury found liable for sexually assaulting Carroll in a separate federal civil case in New York — used his Truth Social platform at the time to fire off a spate of insulting messages attacking Carroll, the trial and the judge, whom he called “an extremely abusive individual”.\n\n“We hold that the district court did not err in any of the challenged rulings and that the jury’s duly rendered damages awards were reasonable in light of the extraordinary and egregious facts of this case,” the US Court of Appeals for the Second Circuit wrote.\n\nCarroll, 81, alleged that Trump defamed her in 2019, when she first made her assault allegations public, by saying she “is not my type”.\n\nJurors were shown Trump’s October 2022 deposition during which he confused a picture of Carroll for his former wife Marla Maples, which threatened to cast doubt on his claim Carroll was not his “type”.\n\nIn 2023, another federal jury found Trump liable for sexually assaulting Carroll in a department store dressing room in 1996 and subsequently defaming her in 2022, when he called her a “complete con job”.\n\n“We agree with the district court that the jury was entitled to find that Trump would not stop defaming Carroll unless he was subjected to a substantial financial penalty,” the appeals court ruled today.\n\nTrump was not required to attend the trial or to testify. However, he used the case to generate heated media coverage and to fuel his claims of being victimised as he campaigned for a return to the White House.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-19T14:30:28.584Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1940533/us-federal-court-upholds-83m-sex-assault-defamation-order-against-trump",
  "dateList": "2025-09-08",
  "date_published": "2025-09-08T16:47:53.000Z"
}
