{
  "title": "Islamabad police gets approval of college for quality education to cops’ children",
  "link": "https://www.app.com.pk/national/islamabad-police-gets-approval-of-college-for-quality-education-to-cops-children/",
  "date_published": "2023-06-04T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): Islamabad Police on Sunday have got approval for the establishment of Islamabad Police Shuhada Model College at Police Line Headquarters under the administrative control of Federal Directorate of Education (FDE).\nA piece of land will be provided by Islamabad Police for the College which would have multi-faceted role to provide free quality education from Pre-School to Intermediate (HSSC) level with modern early child education and STEM Hybrid learning facility. It would also run a parallel stream of skills/TVET education by offering Matric-tech and Inter-tech programs, police said.\nMinister for Interior Rana Sanaullah Khan and Minister for Federal Education and Professional Training Rana Tanveer Hussain have taken special interest for this initiative and termed it as a step to pay immense tribute to the sacrifices rendered by Martyrs.\nThe admissions against the available slots shall have a priority for children of Shuhada followed by the children of Islamabad police personnel and others.\nThe status of the college will be elevated to residential cadet college jointly managed by FDE and Islamabad police after a specified period of time having demonstrated quality repute and subject to the viability assessed by both FDE and Islamabad police.\nThe Ministry of Federal Education and Professional Training has also directed the concerned quarters to take appropriate necessary action by planning and allocating suitable funds and putting in place all resources, codal formalities and approvals for the execution of the project in FY 2023-24.\nIslamabad Capital City Police Officer Dr. Akbar Nasir Khan has thanked both the ministers for their keen interest towards this initiative. After the approval of Capital Police Hospital Islamabad, it will be the biggest initiative for the welfare of police personnel.\nChildren of Islamabad Police personnel will now be able to get quality education and polish their skills as per their aptitudes.",
  "retrievedAt": "2025-08-11T08:37:09.045Z"
}
