{
  "title": "Law Minister emphasises need for professional education of lawyers",
  "link": "https://www.app.com.pk/national/law-minister-emphasises-need-for-professional-education-of-lawyers/",
  "date_published": "2023-06-04T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP): Federal Minister for Law and Justice Senator Azam Nazir Tarar on Sunday emphasized the need for life-long education among members of the legal profession through the provision of continued professional education.\nThe minister expressed these views while attending the closing ceremony of the first-ever 3-day teacher training workshop for law faculty members “Designing and Teaching Effective Law Courses for Legal Academics” as a Chief Guest.\nThe workshop was the outcome of a collaboration between the Directorate of Legal Education (DLE), the Pakistan Bar Council, the Shaikh Ahmad Hassan School of Law and the LUMS Learning Institute.\nThe workshop took place from June 1-3 and involved Deans and Law professors from 21 institutions of legal education from across the country. The workshop comprised active learning sessions focused on course structure, methods of instruction and assessment, along with substantive sessions on both private and public law.\nUsama Malik, Director, Directorate of Legal Education, PBC and Dr Sadaf Aziz, Dean Shaikh Ahmad Hassan School of Law was present at the occasion. Senior Judges from the Lahore High Court attended the event including Justice Ali Baqir Najafi, Justice Jawad Hassan and Justice Asim Hafeez.\nSenior members of the Pakistan Bar Council including Ahsan Bhoon and Hassan Raza Pasha also graced the occasion.\nThe law minister appreciated the intent and design of the workshop and the collective experience and expertise of the participants.\nHe spoke about the renewed efforts of the Pakistan Bar Council and the Directorate of Legal Education headed by Usama Malik to ensure conformity with Legal Education Rules 2015 and the standards established by the Supreme Court of Pakistan in Pakistan Bar Council v.\nFederation of Pakistan reported as 2019 SCMR, 389 where it was emphasized that the “Provision of good quality legal education is inextricably linked with the dispensation of justice that the Bar is responsible for ensuring”. Recent directives to ensure a non-practising allowance for law instructors and the crackdown on sub-standard law colleges are some of the mechanisms for ensuring such standard setting.\nMoreover, former President Supreme Court Bar Association Ahsan Bhoon and Chairman Executive Committee of the Pakistan Bar Council Hassan Raza Pasha also praised the initiative taken by Usama Malik and Dr Sadaf Aziz to uplift the standard of law faculty members across Pakistan in the shape of this workshop.\nDr Parvez Hassan, advocate Supreme Court and member of the Board of Trustees of LUMS, reflected on the founding vision of the Shaikh Ahmad Hassan School of Law. It was the first in the country to establish the 5 year BA/LLB programme and makes an ongoing effort to engage in curricular development and promotion of an active research and learning culture.\nThe Learning Institute at LUMS is also the first in the country to promote a constant upgradation of pedagogical skills amongst university professors based on scientific and evidence-based studies to identify successful teaching methodologies.",
  "retrievedAt": "2025-08-11T08:37:04.134Z"
}
