{
  "title": "Joint efforts needed to restore credibility of justice system: Bilal Kayani",
  "link": "https://www.app.com.pk/national/joint-efforts-needed-to-restore-credibility-of-justice-system-bilal-kayani/",
  "date_published": "2023-06-04T13:37:00.000Z",
  "source": "APP",
  "content": "JHELUM, Jun 4 (APP):Prime Minister’s Coordinator for Economy and Energy Bilal Azhar Kayani on Sunday said that Pakistan was grappling with a “grave crisis of justice provision” and the legal fraternity should work together with the political leadership to ensure the delivery of justice to the people and restore the credibility, dignity and efficiency of the justice system.\nHe was talking to a delegation of Jhelum Bar Association led by its President Sheikh Ikram Advocate here.\nKayani said that Prime Minister Shehbaz Sharif made difficult but right decisions which proved to be in favour of the people with the passage of time. He acknowledged the pivotal role of the 1100 billion federal development programme in driving Pakistan’s economic recovery and expressed the confidence that by tackling the economic crisis alongside political unrest and corruption, the country would be able to overcome these challenges successfully.\nHe was of the view that the formation of a particular bench had tarnished the credibility of the judiciary, which also depicted double standard of justice. He further viewed that “the Chief Justice of Pakistan should put his house [Supreme Court] in order”.“The media and lawyers always played a pivotal role in upholding the constitution, resorting the democracy and safeguarding the people’s rights, and given the current situation of the country, the calls for collaborative efforts between the legal fraternity, political leadership and media have grown stronger,” Kayani added.\nDuring the meeting, the delegation presented their issues and demands. Kayani assured them that he would actively engage with Law Minister Senator Azam Nazir Tarar to find solution. He also apprised them about Prime Minister Shehbaz Sharif’s commitment to addressing the problems faced by bar associations nationwide, including those in Jhelum.\nThe delegation commended Kayani’s dedication to public service in Jhelum, especially in NA-60 and congratulated him on the recent construction of the Shandar Chowk to Jada main highway and the Jamia school to Katchery Link Road.\nAdditionally, the PM’s aide while talking to citizens in an open kutchery (court) held at his public relations office, said that the comprehensive development of Jhelum, including the NA-60 constituency, was a top priority and efforts were underway to address various challenges, including electricity, education and healthcare.\nHe assured the citizens that tangible steps would be taken in due course.\nThe delegation included former president of Jhelum Bar Association Raja Tauqeer Ahmad, General Secretary of District Bar Arbab Shahid Kayani, Joint Secretary Raja Khurram Nisar and other lawyers.\nFormer MPA Chaudhry Saeed Iqbal and Pakistan Muslim League-Nawaz Jhelum leader and senior lawyer Mubarak Kayani were also present on the occasion.",
  "retrievedAt": "2025-08-11T08:37:08.926Z"
}
