{
  "title": "Pakistan must begin journey of reducing plastic waste: Sherry Rehman",
  "link": "https://www.app.com.pk/national/pakistan-must-begin-journey-of-reducing-plastic-waste-sherry-rehman/",
  "date_published": "2023-06-04T16:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 04 (APP):On the occasion of World Environment Day 2023, Federal Minister for Climate Change & Environmental Coordination, Senator Sherry Rehman on Sunday said that the consequences of plastic pollution are intense and long term, as it irreversibly damages our environment and threatens the very fabric of life on earth, from the highest mountains to the deepest ocean trenches.\nUnder this year’s theme ‘Solutions to Plastic Pollution’, centered around addressing the grave concern of plastic under the campaign #BeatPlasticPollution, Minister Rehman urged a call for action as plastic production is set to triple by 2060 if ‘business-as-usual’ continues, according to a statement issued here.\nThe Minister shared the 7R’s Action Agenda which marks the country’s commitment to combat plastic pollution and initiate its journey towards reducing plastic waste.\nThe Agenda includes encouraging conscious choices to minimize plastic consumption (“Reduce”), promoting the redesign of plastic products and manufacturing processes to minimize environmental impact (“Redesign”), emphasizing the extension of product lifespans and reducing reliance on single-use plastics through reusing (“Re-use”), advocating for effective recycling practices to transform plastic waste into new materials and alleviate pressure on landfills and oceans (“Recycle”), and highlighting the shared responsibility of individuals, businesses, and communities in managing plastic waste and promoting sustainable practices (“Responsibility”).\nThe Minister also acknowledges the significance of scientific research and innovation (“Research”) in developing cost-effective and sustainable solutions to combat plastic pollution. Furthermore, the Minister stresses the importance of providing support and resources, particularly to developing nations, in their fight against the global challenge of plastic pollution (“Resource”).\nThe Minister said that plastic waste finds its way into our soil and waterways, and each year, an estimated 3.3 million tonnes of plastics are wasted in Pakistan, equal to the height of two K-2 mountains. To effectively address the plastic issues, Ministry of Climate Change & Environmental Coordination initiated an exhaustive consultative process with the line Ministries, provincial environment departments, ICT administration, industries and other relevant stakeholders for developing Single-Use Plastics (Prohibition) Regulations, 2023 as well as restriction on use of Polyethylene Terephthalate (PET) bottles in federal ministries/divisions. “The aim of this regulation is to fight the problem at its core, instead of fighting the symptoms. The government is leading by example by banning the use of single-use plastic bottles in Federal Ministries, Divisions and attached departments.”\nMinister Rehman highlighted Pakistan’s commitment to promoting a sustainable circular economy for plastics by reducing waste, consumption, and encouraging reuse, recycling, and material recovery. She highlighted that by transitioning to a circular economy by 2040, global savings of $1.3 trillion in direct costs of plastic production, recycling, and disposal, as well as $3.3 trillion in social and economic costs of plastic pollution, can be achieved. Minister Rehman stressed the need for concrete action, improved plastic collection systems, anti-dumping penalties, corporate responsibility for plastic waste, and research for safe alternatives to single-use plastics at the Second Session of the Intergovernmental Negotiating Committee on Plastic Pollution held in Paris last week.\nThe Minister stressed the need for an incentive-driven approach to encourage consumers to change their plastic consumption habits. “A shift in public attitude is unlikely without providing affordable solutions and a circular economy that benefits the poor,” said the Minister. She emphasized that changing behaviors requires a widespread culture of education and values. While penalties and bans can be enforced in specific areas, they alone cannot solve the problem. “To achieve a plastic-free society and address the imminent threat of increased plastic pollution in Pakistan’s oceans and seas, it is crucial to address the fundamental issues and promote a holistic approach towards plastic waste management,” she concluded.",
  "retrievedAt": "2025-08-11T08:37:04.198Z"
}
