{
  "title": "UK announces 7 projects for Pakistan’s climate finance accelerator initiative",
  "link": "https://www.app.com.pk/national/uk-announces-7-projects-for-pakistans-climate-finance-accelerator-initiative/",
  "date_published": "2022-11-20T08:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 20 (APP): Chairman UK-Pakistan Joint Business Council Mian Kashif Ashfaq Sunday said the United Kingdom has announced seven innovative low-carbon projects as a part of the first cohort for the climate finance accelerator(CFA), Pakistan.\nTalking to President Pak-British Friendship Council (North) Muhammad Arbab Khan through zoom he said selected projects from the energy, transportation, AFOLU (agriculture, forestry, and other land uses), waste, e-mobility, and industrial and manufacturing sectors will receive tailored support ahead of an event in February 2023.\nHe said these projects have the potential to benefit communities across Pakistan through pollution abatement, employment opportunities, access to energy, effective waste management e-mobility, and by supporting gender equality and social inclusive efforts.\nMuhammad Arbab Khan said the CFA is part of the UK government’s efforts to help Pakistan in accessing climate finance and meeting the priorities set out in its Nationally Determined Contribution under the Paris Agreement. He said this work comes alongside the provision of UK humanitarian support to Pakistan following flood devastation. He said CFA support will enable these projects to make scalable and ground-breaking projects for a collective greener future for Pakistan.\nHe said 7 selected projects out of a total of 50 included ACT Engineering Services, Digital Dera by Agriculture Republic, Concept Loop, Daewoo Pakistan Express Bus Service Ltd, DISIDE, Ouroboros Waste Management, and Shamas Power Ltd.\nMian Kashif said greenfield solar projects will help industrial and commercial enterprises to the transaction to solar energy through affordable financing instruments of 150 MW on multiple sites in Pakistan.",
  "retrievedAt": "2025-08-11T15:54:16.610Z"
}
