{
  "title": "Elections to be held in August 2023, says Amin Ul Haque",
  "link": "https://www.app.com.pk/national/elections-to-be-held-in-august-2023-says-amin-ul-haque/",
  "date_published": "2022-11-20T16:58:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 20 (APP): Federal Minister for Information Technology and Telecommunication Syed Amin Ul Haque has said that the upcoming elections will take place in August 2023 after the completion of Census in March.\nWhile addressing the launching ceremony of Pakistan Social Media Association (PSMA) at Newports Institute of Communication and Economics here on Sunday, he said that the Information Technology (IT) industry was growing rapidly.\nThe federal minister said connectivity was very significant in the present era for the development and prosperity of any country.\nHe said 70 projects of worth Rs 65 billion had been initiated to improve connectivity in the country so the people could continue their work smoothly.\nAmin Ul Haque said after assuming the charge of IT Minister, he started working on establishing mobile manufacturing plants and succeeded in it. He further said that currently there were 22 mobile manufacturing plants in the country.\nHe said that IT industry was developing and people were being provided with e-banking, e-health and e-agriculture facilities.\nHe said the federal government had made Green Line Bus project operational for the citizens of Karachi.\nHyderabad University would commence its classes in December 2022 or January 2023, he added.\nAmin Ul Haque speaking on PSMA, said that they would be provided with trainers for the proper training of Pakistani youtubers and would be ready for their support to get them recognized.\nEarlier, Co-Chairperson of Newports Institute of Communication and Economics Zainab Taiyyeba aka Huma Bukhari while congratulating the PSMA said that Newports Institute would always facilitate people in their efforts.\nShe said that It was the era of IT, where one could establish their blogs, vlogs and perform other activities to get recognition.",
  "retrievedAt": "2025-08-11T15:54:11.519Z"
}
