{
  "title": "Punjab journalists face cases, censorship, economic exploitation: reports",
  "author": "The Newspaper's Staff Reporter",
  "content": "LAHORE: Journalists in North and Central Punjab province face overlapping threats – from legal intimidation and censorship to direct harassment and deepening economic exploitation, findings of two latest research studies revealed on Tuesday.\n\nThe reports by the Freedom Network noted that economic pressure functioned as ‘soft’ censorship while there were issues like politicised advertising, unpaid or token-paid district correspondents, abrupt story kills and byline removals.\n\nThe reports titled, “Journalism in North Punjab: State of Media Freedom, Access to Information and Safety of Journalists and Other Media Professionals in North Punjab – The Way Forward,” and “Journalism in Central Punjab: State of Media Freedom, Access to Information and Safety of Journalists and Other Media Professionals in Central Punjab – The Way Forward,” were a part of the organisation’s series of reports to look into state of media freedoms in peripheries.\n\nThe publication of these two reports came with technical support from International Media Support (IMS).\n\nThe reports were launched in a function in Lahore where speakers urged the Punjab government to honour its promise of a legal framework to protect journalists against all harms, according to a press release. Federal Commission for Protection of Journalists and Media Professionals Chairperson Kamaluddin Tipu was the chief guest.\n\n“The findings of the two reports represent serious challenges for all of us, including the Punjab government, journalists representative bodies and media houses besides political parties,” Freedom Network Executive Director Iqbal Khattak said.\n\nThe reports documented escalating use of cybercrime and defamation laws against reporters, the near-collapse of district-level print, and worsening wage practices that entrenched self-censorship.\n\n“In North Punjab, the Regional Union of Journalists recorded two physical attacks, 31 FIRs under PECA in 2025 alone, and eight additional bogus FIRs under other laws; in Central Punjab, journalists report at least 32 PECA cases, including prosecutions over years-old social-media posts,” according to the findings.\n\nPrint’s decline and the rapid rise of low-monetized digital outlets left reporters precariously employed and more vulnerable to pressure from officials, security agencies, local power brokers, and criminal groups, the two reports listed the challenges journalists were facing.\n\n“Women journalists face layered barriers of exclusion from press clubs, harassment and relegation to ‘soft beats’ with only tentative improvements in a few city clubs.”\n\nLegal tools – especially the 2025 amendments to the Prevention of Electronic Crimes Act (PECA) –were described as a Damocles’ sword that entrenched self-censorship, with police cases routinely initiated over online posts.\n\nThe two reports made recommendations to improve the situation.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/290916286a1deeb.webp",
  "retrievedAt": "2025-11-01T19:00:59.136Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951847/punjab-journalists-face-cases-censorship-economic-exploitation-reports",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T02:52:16.000Z"
}
