{
  "title": "State & religious extremism",
  "author": "Zahid Hussain",
  "content": "PAKISTAN has banned the TLP again. It is the second time in four years that the violent religio-political group has been outlawed. The action has been taken by the federal government after the group had turned Lahore into a virtual battlefield, destroying public property and attacking law-enforcement agencies. Several people, including policemen, were killed and wounded.\n\nIt was the worst incident of violence perpetrated by a religious group in Lahore in recent times. The government says the state will not succumb to any kind of threat or blackmail this time. The crackdown on the group, which has strong mass support in Punjab, has been intensive. But given its past record of appeasement, there are still doubts over the seriousness of the latest government action.\n\nThere is also the question of the policy dealing with violent extremism that is now so deeply entrenched in society. The TLP is just a symptom of a menace that threatens our social fabric and the state’s unity. The rise of religious extremism in Pakistan is, to a large extent, the result of the state’s own policies.\n\nIn fact, the TLP is a product of the impunity allowed by the state to extremist ideology. Has there been a genuine shift in state policy towards religious extremism? Just banning the TLP won’t solve the problem of religious extremism in the country. There is no indication of the state willing to completely root out violent extremism.\n\nIt is necessary to address the root causes of religious extremism in the country.\n\nA TLP ban in 2021 lasted for only a few months before the state caved in under pressure of the extremist group. Not only was the ban lifted, the party, which was accused of mutiny and killing policemen, was allowed to participate in the general elections. It emerged as the country’s fourth largest party in terms of the number of votes, with its main support in Punjab.\n\nThat shows how deeply religious extremism has seeped into the mainstream. A party which was born of a movement in support of the killer of a governor of Punjab, who was accused falsely of blasphemy and murdered in 2011, has turned into a major political force in Pakistan’s biggest and most powerful province. It could not have happened without the state allowing it impunity. The group saw a meteoric rise after its infamous dharna in Islamabad in 2017 that left the federal capital paralysed for more than a month over a law passed by parliament.\n\nIt is curious that the state appeared helpless before a mob of few hundreds challenging parliament and the government’s writ. The dharna ended after the administration accepted their demands. Interestingly, the agreement also had the signature of a senior ISI officer. A Supreme Court observation in the case questioned the role of the intelligence agency in the TLP protest. It became quite a scandal when a picture of a senior army officer distributing money among the dispersing crowds after the agreement appeared in the media.\n\nMost alarming was the role of the TLP in weaponising the blasphemy law. There has been a marked increase in mob lynchings on false blasphemy accusations. The lynching of a Sri Lankan employee at a garment factory in Sialkot some years ago, the burning to death of a man in Swat, as well as the shooting of a doctor by a police officer in Mirpurkhas are just a few examples of the misuse of blasphemy laws.\n\nThere is also question about the Election Commission’s decision to not only register a group with a violent record as a political party but to also allow it to contest elections. The decision violated the law. With its more extremist religious ideology, the TLP managed to eat into the vote bank of other moderate mainstream religio-political parties.\n\nNow the government has decided to ban the TLP and delist it as a political party. The reference is being sent to the Supreme Court for its approval, and it could be that the court won’t object to the government’s action. But there is still the question of whether merely banning the party can tackle the issue of violent religious extremism. The government action against the TLP was in response to the group’s violent protests and not because of its extremist ideology and attacks on religious minorities and their places worship, which have become rampant particularly in Punjab. All that has been happening for a long time without any action by the administration against the perpetrators.\n\nJust banning a party will not be effective if the state is not fully committed to enforcing the law against all religious extremist forces. The real issue is not the group but the extremist ideology it espouses. We have many examples of banned outfits resurfacing under different names. That could also happen in the TLP’s case.\n\nIt is necessary to address the root causes of religious extremism in the country. Support for the TLP and other extremist groups largely come from semi-educated and deprived sections of society, which are easily swayed. It does not mean, however, that other sections are not influenced as well by radical groups.\n\nA country where over 40 per cent of the population live below the poverty line and 25 million children are out of school provides fertile ground for extremist religious groups to mobilise support. Moreover, the TLP and other extremist groups try to legitimise their actions through some faulty provisions in the law. Exploitation of religion for political gains also provides sustenance to extremist groups.\n\nIf the state is sincere about eradicating religious extremism, it needs to address socioeconomic issues. The growing population is adding to the ranks of the unemployed in the country, which means it is also providing easily swayed recruits to extremist groups. Our education system itself creates extremist mindsets. Just banning the TLP without addressing these issues is not going to solve the problem of religious extremism.\n\nThe writer is an author and journalist.\n\nzhussain100@yahoo.com\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/6901844150d1c.jpg",
  "retrievedAt": "2025-11-01T19:00:32.674Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951922",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T03:06:25.000Z"
}
