{
  "title": "Triumph & disaster",
  "author": "Maheen Usmani",
  "content": "IN today’s frenetic world, success is the glorious deity worshipped at the altar while failure attracts contempt, jeers and alienation. As president John F. Kennedy said, “Victory has a thousand fathers, but defeat is an orphan.”\n\nIronically, defeat is the litmus test for leadership. A bloodied nose is not a reason to leave the ring. Intelligence alone cannot enable greatness: resilience is vital for success, because adversities build, refine and hone character. In essence, setbacks are learning opportunities that teach agility and the ability to pivot. Although embracing failure is a vital component of leadership development, unfortunately this is one aspect of leadership training that is paid scant attention to in Pakistan.\n\nLee Iacocca was one of the most brilliant executives in American automobile history. As the president of the Ford Motor Company, he was instrumental in the creation of the Ford Mustang, the world’s best-selling sports car to date. In July 1978, Iacocca was fired in a brutal boardroom coup by Henry Ford II, despite the company posting a $2 billion profit for the year. Ford reportedly told him, “Sometimes you just don’t like somebody.” Iacocca likened it to being kicked off Mount Everest.\n\nThe public humiliation did not deter Iacocca, whose next stop was Chrysler which was teetering on the brink of bankruptcy. After trimming wastage, the new president and CEO went to the government. “If you can bail out a foreign country, why not an American company?” he demanded. The US was in a recession and there were misgivings about competition from foreign industries. Iacocca made it the central theme of his campaign — bailing out an American company to save jobs and livelihoods.\n\nIronically, defeat is the litmus test for leadership.\n\nOnce the federal loan guarantees were in hand, Iacocca resurrected Chrysler, introducing the transformative K-Car and the minivan for American families. Chrysler repaid its government loans seven years early and Iacocca became a legend, a phoenix rising from the failure of the sacked president to a true blue automobile giant. The scars of Ford became the fuel to ignite Iacocca’s career.\n\nIn 1985, the co-founder of Apple who had revolutionised personal computing, Steve Jobs, was fired from the company which was born in his garage. Boardroom politics chewed and spat him out. In one of life’s little ironies, Jobs had hired the man who fired him. The ashes of the public failure seemed to consume the devastated Jobs as he lost the focus of his life and disappeared.\n\nJobs discovered that disaster gave him the opportunity to display his tenacity. He set up NeXT that produced high-end computers and funded Pixar which transformed storytelling. Eleven years later, NeXT was acquired by Apple, and Jobs returned to the company. His second innings at Apple birthed the iMac, iPod, and iPhone and made Apple one of the most successful brands of any era.\n\n“Getting fired from Apple was the best thing that could have ever happened to me. The heaviness of being successful was replaced by the lightness of being a beginner again. It freed me to enter one of the most creative periods of my life.”\n\nBoth Steve Jobs and Lee Iacocca’s extraordinary corporate success comeback stories illustrate how owning failure became the catalyst for clarity and grit, which led to innovation and authenticity. Novelist Truman Capote said, “Failure is the condiment that gives success its flavour.”\n\nIn order to master the art of the comeback, leaders not only have to reflect and be resilient and strategic, they also have to trust in their ability to evolve and excel. This enables them to lead from the front which bui­lds trust and inspires motivation.\n\nTriumph and disaster are two sides of the same coin and as the author Rudyard Kipling put it, “one should treat the two imposters just the same”.\n\nModern leadership events in Pakistan barely focus on failure as an engine of growth, agility and innovation. It is time to bring adversity to the forefront in the corporate world where it should be reframed as a change agent, because it is an opportunity in disguise. These forums will create space for vulnerability, transformation and high-octane leadership.\n\nThespian Michael Caine defined his philosophy on life as ‘Use the Difficulty.’ He was rehearsing a stage play scene when a chair got stuck in the door and blocked his path. He told the other actor about the obstacle. He responded: “Use the difficulty... if it’s a comedy, fall over it, if it’s a drama, pick it up and smash it.”\n\nThe writer is a communications strategist and author.\n\nmaheenusmani12@yahoo.com\n\nPublished in Dawn, October 31st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/6904226e49dab.jpg",
  "retrievedAt": "2025-11-01T19:02:25.981Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952316/triumph-disaster",
  "dateList": "2025-10-29",
  "date_published": "2025-10-31T02:45:03.000Z"
}
