{
  "title": "Hurricane makes landfall in Jamaica",
  "author": "Reuters",
  "content": "KINGSTON: Hurricane Melissa made landfall in western Jamaica early on Tuesday afternoon as a powerful Category 5 storm and the strongest ever to directly hit the Caribbean nation of 2.8 million people.\n\nMelissa made landfall near the town of New Hope, some 62 km (39 miles) south of Montego Bay, packing maximum sustained winds of 185 mph (295 kph), the United States National Hurricane Center said in its latest advisory.\n\nThe most powerful level on the Saffir-Simpson scale, Category 5, requires speeds of at least 157 mph.\n\nThe slow-moving storm is forecast to remain a powerful hurricane as it crosses the mountainous island, whose highland communities are vulnerable to landslides and flooding, and heads towards Santiago de Cuba, Cuba’s second-largest city.\n\nThe Miami-based hurricane center warned that “total structural failure” was likely in Melissa’s path.\n\n“The destruction could be unlike anything people in Jamaica have seen before,” said US forecaster AccuWeather’s lead hurricane expert, Alex DaSilva. “The island has never taken a direct hit from a Category 4 or a Category 5 hurricane in recorded history.”\n\nMelissa is the third most intense hurricane observed in the Caribbean after Wilma in 2005 and Gilbert in 1988, according to AccuWeather.\n\nGilbert was the last major storm to directly hit the island.\n\nShortly before landfall, Jamaican electric utility JPS said power outages had affected more than a third of its customers. In its worst-hit parishes, some three-quarters of customers lost power, JPS said.\n\nLocal Government Minister Desmond McKenzie told reporters that nearly 6,000 people had moved into temporary shelters.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/29100017376bb65.webp",
  "retrievedAt": "2025-11-01T19:00:44.266Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951927/hurricane-makes-landfall-in-jamaica",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T03:13:44.000Z"
}
