{
  "title": "Nepra imposes Rs110m fines on Discos",
  "author": "The Newspaper's Staff Reporter",
  "content": "ISLAMABAD: The National Electric Power Regulatory Authority (Nepra) on Tuesday imposed more than Rs110 million fines on four ex-Wapda Distribution Companies (Discos) over missed performance targets including system losses, recoveries and earthing of electricity poles.\n\nIn five separate orders, the regulator said it imposed Rs10m fine on Hyderabad Electric Supply Company (Hesco), Rs40m on Quetta Electric (Qesco), Rs10m on Faisalabad Electric (Fesco) and Rs51m on Gujranwala Electric (Gepco) on two counts after completion of legal proceedings including show cause notices and fact finding probes.\n\nNepra had started proceedings against various Discos after receiving Circular Debt Reports which revealed that Discos’ electricity purchases for FY24 had reduced by 1pc to 115,142 GWh (billion units) as compared to 116,696 GWh for the FY23.\n\nFurther, Discos’ losses during FY24 had increased to 18.31pc as compared to 16.84pc during FY23, an increase of 1.47pc. The average target of T&D losses allowed by Nepra for FY24 was 11.77pc. Thus, Discos breached the target by 6.54pc.\n\n“This breach of target contributed around Rs276 billion in Circular Debt for the FY24 despite the fact that Discos have been allowed an investment amount of Rs163.1bn for FY24 to improve their network,” the regulator said.\n\nThe companies reported that reduction in consumption was generally because of higher electricity rates following reduction in subsidies, removal of special incentive packages, and de-industrialisation, forcing consumers to reduce consumption either through low usage at the cost of living standards or through shift to alternate options, particularly solarisation. They had, however, weak defense against their inability to improve recoveries and reduce losses.\n\nWhile Hesco was imposed Rs10m fine because of multiple and continuous misleading statements before the regulator over a period of around 18 months, Gepco was penalised with Rs100,000 fine for insufficient earthing/grounding of low-tension and high tension poles.\n\nQesco, Fesco and Gepco were imposed Rs40m, Rs10m and Rs50m, respectively for their failures to reduce technical and distribution losses and improve recovery of bills as per given targets during FY23 and FY24 despite given sufficient funding in tariff to invest in system improvement.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2908294407e6605.webp",
  "retrievedAt": "2025-11-01T19:01:09.614Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951886/nepra-imposes-rs110m-fines-on-discos",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T02:51:46.000Z"
}
