{
  "title": "Pak-Afghan talks in Istanbul failed to bring about any workable solution, says information minister",
  "author": "Dawn.com",
  "content": "Federal Minister for Information and Broadcasting Attaullah Tarar said early on Wednesday that the latest round of talks between Islamabad and Kabul in Istanbul “failed to bring about any workable solution”, adding that Pakistan would continue to take all possible measures to protect its citizens from terrorism.\n\nAfter days of fighting along the Pak-Afghan border and strikes by Islamabad on Gul Bahadur group camps in Afghanistan, the two countries had come together for a dialogue in Doha which had resulted in a temporary ceasefire, as well as a commitment to reconvene in Istanbul to work on mechanisms for lasting peace and stability between the two countries. Last week, the second round of talks between the two sides had begun in the Turkish capital.\n\nIn a post on social media platform X early on Wednesday, the information minister said that Pakistan had repeatedly engaged with the Afghan Taliban regarding “persistent cross-border terrorism” by Indian-abetted Fitna-al-Khawarij and Indian proxy Fitna-al-Hindustan.\n\nFitna-al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP), while Balochistan-based groups have been designated Fitna-al-Hindustan to highlight India’s alleged role in terrorism and destabilisation across Pakistan.\n\n“The Afghan Taliban regime have been asked time and again to fulfil their written commitments to Pakistan and to the international community in the Doha Agreement. However, Pakistan’s fervent efforts proved futile due to the Afghan Taliban regime’s unabated support to anti-Pakistan terrorists,” Tarar said.\n\n“Since the Taliban regime bears no responsibility towards the people of Afghanistan and thrives on a war economy, it desires to drag and mire the Afghan people into a needless war,” he said.\n\nThe minister asserted that Pakistan had always desired, advocated, and sacrificed for the peace and prosperity of the people of Afghanistan.\n\n“In the same spirit, Pakistan has held countless rounds of talks and parleys with the Afghan Taliban regime but, unfortunately, they have always remained indifferent to Pakistan’s losses. Sadly, after sustaining such huge losses of men and material for four long years, Pakistan’s patience has run its course,” he said.\n\nHe said that in an effort to “give peace a chance” and at the request of Qatar and Turkiye, Pakistan engaged with the Afghan Taliban earlier in Doha and then in Istanbul on a single-point agenda — soliciting action by the Afghan Taliban to prevent the use of Afghan soil by terrorist organisations as a “training-cum-logistics base and jump off point for terrorist activities in Pakistan”.\n\nHe thanked Qatar and Turkiye for facilitating this dialogue and their efforts in convincing Kabul to “desist from the use of terror proxies as leverage against Pakistan”, but said that the neighbouring country repeatedly deviated from the core issue.\n\n“Over the last four days of dialogue, the Afghan Taliban delegation repeatedly agreed to Pakistan’s logical and legitimate demand for credible and decisive action against [militant] organisations and terrorists.\n\n“Sufficient and irrefutable evidence was provided by Pakistan which was acknowledged by Afghan Taliban and the hosts, however, regrettably, the Afghan side gave no assurance,” the minister said.\n\n“The Afghan side kept deviating from the core issue, evading the key point upon which the dialogue process was initiated. Instead of accepting any responsibility, the Afghan Taliban resorted to blame game, deflection and ruses. The dialogue thus failed to bring about any workable solution,” he said.\n\nThe minister again thanked the government of Qatar, Turkiye as well as those of other friendly states for their efforts to “bring about a peaceful solution to the problem of terrorism, for the prosperity and security of the two countries and the region at large”.\n\n“The security of its people is of paramount importance to Pakistan. We will continue to take all possible measures necessary to protect our people from the menace of terrorism and assure them that the government of Pakistan will continue to employ all the resources which are required in this regard to decimate the terrorists, their sanctuaries, their abetters and supporters,” he said.\n\nThe statement from the information minister came hours after Defence Minister Khawaja Asif said that an agreement was about to be reached with Kabul, but Afghan negotiators backpedalled after contacting Kabul during the negotiations.\n\nSpeaking on Geo News programme ‘Aaj Shahzeb Khanzada ke Saath’, the defence minister stated that negotiators had backpedalled on an agreement “four or five times” after receiving instructions from Kabul.\n\n“Whenever we got close to an agreement — either in the last four days or last week — when negotiators reported to Kabul, then there was intervention and the agreement was withdrawn,” he said.\n\n“I believe that the negotiations were sabotaged. We had an agreement, but then they called Kabul and backpedalled from the deal.”\n\n“I would compliment their delegation, but the people in Kabul pulling the strings and staging the puppet show are being controlled by Delhi,” he added.\n\nThe defence minister believed that the Kabul government lacked authority, as it had been “penetrated” by India, which was using Afghanistan to stage a proxy war against Pakistan.\n\n“India is compensating for its defeat on their western border through Kabul. The junta there (in Afghanistan) has elements that have visited India and visited their temples,” Asif said. “India wants to engage in a low-intensity war with Pakistan. To achieve this, they are using Kabul.”\n\nWhen asked to comment on threats by Afghanistan that they would “attack Islamabad” in the event of further hostilities, Asif replied: “If Afghanistan even looks at Islamabad, we will gouge their eyes out.\n\n“They can employ the use of terrorists and they already are. Over the past four years, they have been using terrorists.”\n\n“There should be no doubt that Kabul is responsible for terrorism in Pakistan. Kabul is a tool for Delhi. If they want to, God forbid, attack Islamabad, we will give a befitting response. A response 50 times stronger,” the defence minister said.\n\nOn Tuesday, Turkish and Qatari mediators had tried to salvage negotiations between Pakistan and Afghanistan’s Taliban regime after the talks briefly collapsed over what officials described as “unbridgeable differences”.\n\nA Pakistani security source told reporters that the talks had “collapsed following the Afghan Taliban’s lack of commitment and seriousness to address terrorism-related issues, as well as their refusal to provide any written guarantees”.\n\nFrom the Afghan side, journalists were informed that the negotiations had ended “inconclusively”, with officials in Kabul accusing the Pakistani delegation of “improper conduct” and making “demands that are unacceptable to Afghanistan”.\n\nHowever, within hours of those reports emerging, the rupture had reportedly been repaired. By noon negotiators were back at the table following intense diplomatic efforts by Turkish and Qatari mediators, who pressed both sides to return for what officials described as a “final attempt” to achieve at least a limited agreement.\n\n“The negotiations in Istanbul have resumed at the insistence of the host country and the other mediator,” a Pakistani official confirmed, adding that talks continued late into the evening.\n\nDiplomatic sources said the Afghan Taliban delegation’s stance had shifted multiple times over the course of four days, often due to fresh instructions from Kabul. “They came close to a deal four or five times,” one official said, “but each time, new guidance from Afghanistan scuttled the progress.”\n\nThe divisions within the Taliban’s ranks, split among factions based in Kandahar, Kabul, and Khost was cited as another reason. “If the Kandahar group agrees at some point, the differences of the Kabul group come to the fore,” a source briefed on the negotiations said.\n\nAdding to the complications, the Afghan side reportedly introduced a new demand, insisting that Pakistan should prevent US drones from entering Afghan airspace from Pakistani territory. Observers noted the irony that many of those drones originated from Qatar, which itself is mediating the Istanbul dialogue.\n\nDespite the latest setback, Turkish and Qatari officials were said to have worked intensively to keep the process alive, warning both sides that the collapse of the talks could lead to renewed border tensions. Pak­istani officials reiterated their long-standing position that no agreement would be acceptable without verifia­ble guarantees that Afghan soil would not be used for terrorism against Pakistan. “Our stance has been consi­stent,” a senior security source said. “Without concrete assurances on counterterrorism, there can be no deal.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2907042878fc964.webp",
  "retrievedAt": "2025-11-01T19:01:45.599Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951912/pak-afghan-talks-in-istanbul-failed-to-bring-about-any-workable-solution-says-information-minister",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T02:08:09.000Z"
}
