{
  "title": "$250m approved for glacial melt adaptation programme in 9 countries, including Pakistan",
  "author": "Amin Ahmed",
  "content": "The Green Climate Fund (GCF)  has approved $250 million for a flagship adaptation programme aimed at building resilient water and agriculture systems for vulnerable communities in the glacier-dependent regions of Central Asia, the South Caucasus, and Pakistan, a press release issued on Wednesday said.\n\nLed by the Asian Development Bank (ADB), the ‘Glaciers to Farms’ programme covers nine ADB developing member countries: Armenia, Azerbaijan, Georgia, Kazakhstan, the Kyrgyz Republic, Pakistan, Tajikistan, Turkmenistan, and Uzbekistan, which all rely on glacier and snow-fed rivers for agriculture, domestic water, and electricity generation.\n\nThe programme will focus on four glacier-fed river basins — the Naryn and Pyanj in Central Asia, the Kura in the South Caucasus, and the Swat in Pakistan — covering roughly 27m hectares, the ADB said in a press release.\n\nThe handout added that the GCF approved its concessional funding for the programme at its 43rd board meeting on October 29.\n\nIt said that around 13m people, including farmers and vulnerable populations in fragile mountain regions, would benefit directly from the programme, adding that it would support climate and glacier assessments that would inform national development plans and investment pipelines.\n\nThe programme will also strengthen monitoring and early warning systems to help communities manage the impacts of hazards such as glacial lake outburst floods and prolonged droughts, the handout said.\n\nIt stated that accelerated glacial melt threatened ecosystem services and livelihoods, presenting a serious challenge in the aforementioned countries, where about one in four jobs are in agriculture.\n\nGCF’s funding will be provided mostly as grants and invested alongside $3.25 billion from ADB over the next decade in a series of projects identified by the countries covered by the programme, it added.\n\nBy investing in efficient irrigation, water storage, and watershed management, the projects will help improve agricultural productivity even as accelerated glacial melt increases the frequency of droughts or floods, the handout said.\n\n“Rapid glacial retreat is one of the most complex development challenges faced by our region,” ADB Director for Agriculture, Food, Nature, and Rural Development Yasmin Siddiqi was quoted as saying in the press release.\n\n“We need practical, scalable, and science-based solutions to help communities adapt. With catalytic support from GCF, ‘Glaciers to Farms’ will help move the region beyond fragmented projects and towards systemic, long-term resilience that protects lives and livelihoods now and for future generations,“ she added.\n\nGCF Director of Eastern Europe, Central Asia and Middle East Region Department Thomas Eriksson said that the programme was the “kind of large-scale, innovative, and collaborative effort that will help countries in Central and West Asia strengthen adaptation planning and cooperation to manage climate impacts on glacier-fed water systems”.\n\n“This programme sets a transformative benchmark by improving data, coordination, and financing readiness for long-term resilience in the region’s water and food systems,“ he said.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/29110542060914b.webp",
  "retrievedAt": "2025-11-01T19:00:11.066Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951952/250m-approved-for-glacial-melt-adaptation-programme-in-9-countries-including-pakistan",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T06:24:04.000Z"
}
