{
  "title": "World far off track to meet climate goals, says UN",
  "author": "AFP",
  "content": "PARIS: The UN estimated on Tuesday that nations’ carbon-cutting pledges imply a far-from-sufficient 10 per cent emissions cut by 2035, cautioning that it was unable to provide a robust global overview after most countries failed to submit their plans on time.\n\nWith just days to go before tense COP30 climate talks in Brazil, vulnerable small island nations slammed an “alarming” lack of new climate pledges, especially from major polluters.\n\nUN Climate Change was unable to include crucial targets announced by China and the European Union in its formal assessment of national 2035 pledges because neither has officially submitted detailed plans.\n\nInstead, it incorporated these announcements in a rough calculation alongside its report, showing the world is for the first time setting heat-trapping emissions on a falling trajectory — but nowhere near fast enough.\n\nUN Secretary General Antonio Guterres said last week that slow action from nations meant it was “inevitable” that efforts to limit temperature rise to 1.5C would fail in the short term, unleashing devastating impacts during a period of overshoot as countries worked to pull temperatures back down again by the end of the century.\n\nThe UN’s Intergovernmental Panel on Climate Change has said emissions must fall 60pc by 2035, from 2019 levels, for a good chance of limiting global warming to 1.5C above pre-industrial levels — the more ambitious goal of the Paris climate deal. “The science is equally clear that temperatures absolutely can and must be brought back down to 1.5C as quickly as possible after any temporary overshoot, by substantially stepping up the pace on all fronts,” UN climate chief Simon Stiell said in a statement.\n\nThe two-week COP30 climate negotiations in the Amazon, which start on November 10, are tasked with galvanising momentum in the face of a hostile United States, geopolitical tensions and economic concerns. They also come as the uptake of renewable energy across the world — driven by China — has given impetus to countries’ 2023 promise to “transition away” from polluting fossil fuels.\n\nThe Alliance of Small Island States (AOSIS) noted the “alarming lack of updated targets, especially from bigger countries with significantly more resources than developing countries which bear the disproportionate burden of a climate crisis they did not cause”. It added that the pace of progress should “send shock waves through every citizen”.\n\nUnder the 2015 Paris Agreement countries committed to limit global warming to well below 2C since the pre-industrial era (1850-1900) — 1.5C if possible. With average warming already around 1.4C today, many scientists believe that the 1.5C threshold will likely be breached before the end of this decade as humans continue to burn oil, gas, and coal.\n\nIf temperatures overshoot 1.5C, experts say humanity would probably have to try to pull warming back down by using technologies to remove carbon from the atmosphere that are not yet operational at scale. Countries are supposed to provide increasingly ambitious plans known as Nationally Determined Contr­ibutions (NDCs) every five years, with plans to 2035 due in this year.\n\nThe UN on Tuesday said just 64 of the nearly 200 parties to the Paris Agreement had submitted their NDCs by its end of September cut-off date for the official annual report. As a result Stiell said the document “provides quite a limited picture”, compelling the UN to attempt a more general calculation suggesting a 10pc fall by 2035. The estimate included the US submission made before the return of Donald Trump as US president in January.\n\nHe has since announced he is pulling the United States out of the Paris deal for a second time, called climate change a “hoax”, and has moved to curb scientific study and data collection.\n\nThe estimate also incorporated a pledge by China, the world’s biggest polluter, to reduce emissions by 7-10pc by 2035, its first absolute national target.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/69018a3a653f9.jpg",
  "retrievedAt": "2025-11-01T19:00:31.710Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951936/world-far-off-track-to-meet-climate-goals-says-un",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T03:29:27.000Z"
}
