{
  "title": "PTI delegation meets Fazl, JUI-F agrees to support Achakzai’s nomination for NA opposition leader",
  "author": "Dawn.com",
  "content": "The Jamiat Ulema-i-Islam-Fazl (JUI-F) has agreed to lend its support to the PTI in nominating Pakhtunkhwa Milli Awami Party’s (PkMAP) Mehmood Khan Achakzai for the opposition leader’s slot in the National Assembly (NA).\n\nThe development comes over a week after the PTI formally requested the appointment of Achakzai — whose party is also part of opposition alliance Tehreek Tahafuz Ain-e-Pakistan (TTAP) along with five other parties, including the PTI  — as leader of the opposition in the NA.\n\nThe position of the opposition leader in the lower house of Parliament has been vacant since the disqualification of PTI’s Omar Ayub Khan on August 5.\n\nOn August 20, incarcerated PTI founder Imran Khan named Achakzai for the post of NA Opposition Leader in the NA.\n\nAccording to a statement posted on JUI-F’s X account today, a PTI delegation visited Maulana Fazlur Rehman’s residence in Islamabad, “where the JUI-F agreed to support the nomination of Mehmood Khan Achakzai”.\n\nThe PTI delegation included Asad Qaiser, PTI Khyber-Pakhtunkhwa (KP) President Junaid Akbar and  Shahram Khan Tarakai, while JUI-F chief Fazl was accompanied by Maulana Salahuddin Ayubi, Advocate Jalaluddin, and his son, Maulana Asjad Mehmood.\n\nDuring the meeting, “the PTI delegation appealed to the JUI-F chief to play a role in uniting the opposition in parliament,” the statement said, adding that the PTI also asked the JUI-F to “cooperate” with it regarding a vacant Senate seat from KP.\n\nThe two sides also discussed the current political and regional situation, it further stated.\n\nAccording to the statement, the PTI also “consulted the JUI-F chief on the proposal to hold a national jirga over the law and order situation in KP”.\n\nFor his part, Fazl welcomed the proposal, the statement said.\n\nA subsequent post on the TTAP’s X account said Qaiser “briefed Achakzai in detail about his meeting with Fazl and took him into confidence”.\n\nThe post also stated it was decided during the meeting that the TTAP would hold public gatherings in across the country in November.\n\nEarlier this week, PTI Secretary General Salman Akram Raja had said that the PTI did not see a possibility of the JUI-F supporting it for the NA opposition leader slot.\n\nIn response to a question regarding chatter of a new NA opposition leader and whether the JUI-F would support the PTI, Raja had said, “Cons­idering the past, I don’t think they will go with us at the end, and whether they form an alliance with the PPP or the PML-N, I cannot say anything about it, but we (PTI) don’t really have any interest in it.”\n\nThe same day, PPP Chairman Bilawal Bhutto-Zardari had met with Fazl, where the two discussed the formulation of a joint strategy on key national issues.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/291701241c656db.webp",
  "retrievedAt": "2025-11-01T18:59:47.248Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951971/pti-delegation-meets-fazl-jui-f-agrees-to-support-achakzais-nomination-for-na-opposition-leader",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T10:47:49.000Z"
}
