{
  "title": "PPP set to name AJK PM candidate today",
  "author": "Iftikhar A. Khan",
  "content": "• Chaudhry Latif Akbar, Yasin, Faisal Rathore, and Sardar Yaqub among contenders; President Zardari, PM Shehbaz to finalise nominee\n• Faryal Talpur meets AJK president to seek forward bloc’s support\n• PTI to file disqualification references against defecting lawmakers\n\nISLAMABAD: The PPP is likely to announce its nominee for the office of Azad Jammu and Kashmir (AJK) prime minister on Wednesday (today), following a meeting between President Asif Ali Zardari and Prime Minister Shehbaz Sharif upon the latter’s return from Saudi Arabia.\n\nSources told Dawn that the names of Chaudhry Latif Akbar, Chaudhry Yasin, Faisal Rathore and Sardar Yaqub are under consideration for the top slot.\n\nUnder the AJK Constitution, the movers of a no-confidence resolution are required to name a successor to the sitting prime minister. The no-trust motion will be submitted soon after the PPP finalises its candidate.\n\nA PPP source said there was ‘no hurry’ to form the new government, adding that the PML-N’s decision not to join the treasury benches was “its democratic right”. The party insists it will move ahead “with consensus”.\n\nAccording to sources, a detailed charge sheet highlighting the AJK prime minister’s alleged governance failures has been prepared.\n\nThese complaints include his failure to consult cabinet members, his harsh attitude toward bureaucracy, and cuts to development funds for ministers and assembly members. His unilateral decisions and weak handling of public protests have reportedly deepened dissatisfaction within the coalition.\n\nIn a related development, Faryal Talpur, head of the PPP’s women wing and the AJK political affairs wing, called on AJK President Barrister Sultan Mehmood Chaudhry to seek support from six members of the forward bloc belonging to his group. She discussed matters pertaining to formation of the new government in Azad Kashmir during the meeting.\n\nSpeaking to Dawn, PML-N leader Mushtaq Minhas clarified that if the Azad Jammu and Kashmir prime minister resigns, the party will not vote for the PPP candidate, though it will support a no-confidence motion, if tabled.\n\nHe said the PML-N had been seeking Anwarul Haq’s removal for the past six months over governance concerns.\n\nPTI to file references\n\nMeanwhile, the Pakistan Tehreek-i-Insaf has decided to file references against its defected members who have joined other parties or plan to support the no-confidence motion.\n\nPTI AJK President Abdul Qayyum Niazi held consultations with Opposition Leader Khawaja Farooq Ahmed and summoned the party’s legal team.\n\nAccording to sources, references will be filed under Section 30 of the Elections Act 2020, which allows the disqualification of members who switch parties.\n\nPTI had earlier sent a reference to the speaker against four members — Akmal Sargala, Rafiq Nayyar, and Ali Shan Soni among them.\n\nNow, 12 members of the PTI forward bloc who have joined the PPP could face disqualification if they vote for the no-confidence motion.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2907171624eed0a.webp",
  "retrievedAt": "2025-11-01T19:01:46.107Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951906/ppp-set-to-name-ajk-pm-candidate-today",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T02:18:22.000Z"
}
