{
  "title": "Khar residents evacuate homes ahead of ‘operation’ against terrorists",
  "author": "Anwarullah Khan",
  "content": "BAJAUR: Residents of various areas of Khar tehsil have evacuated their homes, fearing an imminent security operation against terrorists in their areas.\n\nSources told Dawn on Tuesday that hundreds of people from various rural areas of Khar tehsil, bordering Mamund tehsil and Charmang valley, including Janat Shah, Lara Banda, Bara Banda, Gul Dehrai and Shagai, had shifted to safer areas in the district.\n\nThere were no formal orders from the district administration for the residents to evacuate, but even then, residents began leaving their houses on Monday afternoon.\n\nResidents confirmed their evacuation in video clips on social media and said they’re moving to safety due to the possible action against terrorists in the localities. Most residents complained about alack of transportation facilities.\n\nMPA claims 100 educational buildings identified to accommodate displaced persons\n\nANP activist Arafat Khan, who, along with his men, helped residents relocate safely. He told Dawn that the majority of residents had left home between Monday and Tuesday.\n\nHe said a series of clashes between security forces and militants in Lara Banda, Bara Banda and adjacent areas on Monday, forced most residents to vacate their homes for safer areas.\n\n“Initially, residents faced transportation issues for shifting families along with cattle and other belongings due to a shortage of vehicles and unaffordable charges. However, the issue was resolved after political parties and welfare organisations arranged free transport,” he said.\n\nMeanwhile, several political and social activists, including ANP local MPA Mohammad Nisar Khan, JUI-F leader Imran Mahir, JI and Alkhidmat Foundation members, visited different areas and extended assistance to evacuating residents.\n\nTalking to reporters, MPA Nisar Khan, Imran Mahir, Khan Badshah of Jamaat-i-Islami and Taj Mohammad of Alkhidmat Foundation said their party workers were providing facilities, including free transportation and food, to those leaving the area.\n\n“Our party workers have been present here since Monday to arrange transport and other necessities for the residents,” said Mr Mahir at Rashakai area, an area of Khar tehsil via which the displaced families moved to their desired destinations, mostly houses of relatives.\n\nThe JUI-F leader said that the transportation issue for displaced people had almost been resolved.\n\nHe said the displaced people were facing accommodation problems, so the district administration should accommodate them in public educational institutions in Khar tehsil.\n\nNisar Khan claimed the residents who left homes in emergency needed reasonable accommodation for which the administration, on his suggestion, has identified 100 buildings of public educational institutions in Khar tehsil.\n\nMeanwhile, on Tuesday, a delegation of Bajaur Aman Jirga, led by its head Sahibzada Haroon Rashid and comprising ANP MPA Mohammad Nisar Khan and elders from Janat Shah and other areas, met deputy commissioner Shahid Ali Khan and discussed the issues faced by displaced people.\n\nIn Facebook posts, Mr Rashid and Nisar Khan said the the DC assured the visitors that the Pakistan Red Crescent Society would start providing food to the displaced persons from today (Wednesday).\n\nMeanwhile, PTI MPA Dr Hamidur Rehman said in a Facebook message that he discussed the issues of displaced persons with the chief minister, who directed the chief secretary to ensure immediate relief activities for them.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/6901361918ac2.jpg",
  "retrievedAt": "2025-11-01T19:00:44.333Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951833/khar-residents-evacuate-homes-ahead-of-operation-against-terrorists",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T02:52:35.000Z"
}
