{
  "title": "Trump says ‘nothing’ will jeopardise Gaza ceasefire after Israeli strikes",
  "author": "AFP",
  "content": "United States President Donald Trump said on Wednesday “nothing” would jeopardise the ceasefire in Gaza, after Israel carried out air strikes on the Palestinian territory accusing Hamas of violating the truce, which the group denied.\n\nGaza’s civil defence agency said that Israeli attacks had killed at least 50 people, including 22 children, and wounded around 200.\n\n“At least 50 killed, including 22 children and a number of women and children, as a result of the ongoing Israeli strikes on the Gaza Strip since last night,” Mahmud Bassal, spokesman for the agency, told AFP.\n\nAround 200 people were wounded “in a clear and flagrant violation of the ceasefire agreement”, he said, calling the situation in Gaza “catastrophic and terrifying”.\n\nTrump defended Israel’s actions on Wednesday, saying it “should hit back” if Israeli soldiers were killed, but added that “nothing’s going to jeopardise” to truce.\n\n“They killed an Israeli soldier. So the Israelis hit back. And they should hit back,” Trump told reporters on Air Force One during his tour of Asia.\n\nUS Vice President JD Vance said the ceasefire was holding despite the “skirmishes”.\n\n“We know that Hamas or somebody else within Gaza attacked an IDF soldier …\nbut I think the president’s peace is going to hold,” he said.\n\nYesterday, Israel’s Prime Minister Benjamin Netanyahu ordered “powerful strikes” on Gaza, after his Defence Minister Israel Katz accused Hamas of attacking Israeli troops in the enclave.\n\nWhile Katz did not say where the troops were attacked, Hamas said its fighters had “no connection to the shooting incident in Rafah” and reaffirmed its commitment to the US-brokered ceasefire.\n\nThe Israeli military said today that a soldier was killed during fighting in southern Gaza.\n\nGaza’s civil defence agency said at least three strikes were carried out, while the territory’s main Al Shifa hospital said one hit its backyard.\n\nAl Awda Hospital said it had received several bodies, including those of four children, killed in the bombing of Gaza’s central Nuseirat refugee camp.\n\nHamas announced it would delay handing over the body of another hostage, due on Tuesday, saying Israeli “escalation will hinder the search, excavation, and recovery of the bodies”.\n\nA row over the last remaining bodies of deceased hostages has threatened to derail the ceasefire agreement.\n\nIsrael accuses Hamas of reneging by not returning them, but the Palestinian group says it will take time to locate the remains buried in Gaza’s war-ravaged ruins.\n\nHamas later said on Telegram it had found the bodies of two hostages on Tuesday, but did not specify when it would hand them over.\n\nHamas came under mounting pressure on Monday after it returned the partial remains of a previously recovered captive, which Israel said was a breach of the truce.\n\nHamas had said the remains were the 16th of 28 hostage bodies it had agreed to return under the ceasefire deal, which came into effect on October 10.\n\nBut Israeli forensic examination determined Hamas had in fact handed over partial remains of a hostage whose body had already been brought back to Israel around two years ago, according to Netanyahu’s office.\n\nIsraeli government spokeswoman Shosh Bedrosian accused Hamas of staging the discovery of the remains.\n\n“Hamas dug a hole in the ground yesterday, placed the partial remains …\ninside of it, covered it back up with dirt, and handed it over to the Red Cross,” she told journalists.\n\nThe Hostages and Missing Families Forum urged the government to “act decisively against these violations” and accused Hamas of knowing the location of the missing hostages.\n\nOn the ground in Gaza, 60-year-old Abdul-Hayy al-Hajj Ahmed told AFP he was afraid the bombing would start again.\n\n“Now they accuse Hamas of stalling, and that is a pretext for renewed escalation and war,” he said.\n\n“We want to rest. I believe the war will come back. “\n\nHamas spokesman Hazem Qassem rejected claims the group knows where the remaining bodies are, arguing that Israel’s two-year military campaign had left locations unrecognisable.\n\n“The movement (Hamas) is determined to hand over the bodies of the Israeli captives as soon as possible once they are located,” he told AFP.\n\nThe Palestinian group has already returned all 20 living hostages as agreed in the ceasefire deal.\n\nHamas’s October 2023 attack resulted in the deaths of 1,221 people on the Israeli side, according to an AFP tally based on official Israeli figures. Israel’s subsequent relentless assault on Gaza killed at least 68,531 people, according to figures from the territory’s health ministry.\n\nDespite the ceasefire, the toll has continued to climb as more bodies are found under the rubble.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/291010083deda55.webp",
  "retrievedAt": "2025-11-01T19:00:30.911Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951950/trump-says-nothing-will-jeopardise-gaza-ceasefire-after-israeli-strikes",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T05:10:50.000Z"
}
