{
  "title": "Adapt or die",
  "author": "Khurram Husain",
  "content": "THE prime minister has just been approached by a group of business leaders who have made proposals to help revive the economy. My advice to him is to keep them running. It is good that he has formed working groups among them, who will develop more detailed proposals. Once the proposals are developed, they should form a committee to review them. After that should come a consultative process to circulate the proposals for wider input from civil society, civil servants and the State Bank. Then he should do something truly unprecedented: submit them for parliamentary review.\n\nStanding committees in the House and Senate should then call members of these working groups to come and brief them about the proposals. After that, the same committees should call for wider public input from analysts and commentators. Wise guys like yours truly here would be happy to oblige with detailed comment on the pros and cons of each proposal. And after that comes the implementation stage, for which there should be an interdepartmental task force drawn from retired civil servants, members of parliament, independent experts and business leaders. But before that, it will be important to draw up the terms of reference for this task force, for which there should be a separate committee.\n\nHere is a bold statement, and in the spirit of Gen Z era engagements, please prove me wrong. Nothing good has ever come out of these proposals the business community has been bringing to the government over the past half century. Of all the lasting policy measures in place today, or any catalysing policy steps taken over the decades, show me one example of a measure that was proposed by the business community which became the basis of lasting economic dynamism.\n\nYou would be hard-pressed to think of a single example because there are none. Pakistan’s business community has literally grown up thinking that it is the government’s job to help them make a profit. They press this point by subtle attempts at blackmail. ‘We will be forced to shut our plants down’ they say sometimes. Or ‘we will take our investments to another country’.\n\nNothing good has ever come out of the proposals the business community has been bringing to the government.\n\nSimple fact here is that not one of these gents is fit to run any business in any country beyond maybe glorified rent-a-car services or, yes, a pizza franchise. It’s only in Pakistan that they make outlandish profits for minimal effort, where they privatise the gains but socialise the costs of the incentives the government provides them with, and where they can credibly lobby a government to do more to help make their business profitable. If they threaten to close their plants, call their bluff. They don’t create jobs on the scale they like to think, in any case. Certainly not by any comparison to the informal sector or agriculture. If they threaten to take their investments to foreign shores, welcome them. Those who can already have. Those who have not, cannot. And they know it.\n\nBut there are some things the business community should understand, to the marrow of their bones. One, the era of cheap energy is over. With Pakistan’s gas fields in advanced stages of decline and the grid weighed down by large-scale defections and high-capacity payments, the only way to bring energy costs down is via subsidies, and there should be zero appetite for that today. Two, the era of cheap money is also over. Over the years, these same business leaders have grown accustomed to cheap, subsidised credit provided by the State Bank through various schemes. But those schemes have been abused heavily, especially in the time of the PTI government when they were used to pump money into real estate rackets and inflate prices of speculative assets like plot files under the specious argument of using housing and construction as an engine of growth.\n\nIt was in response to this that the IMF basically required the State Bank to surrender the power to run such schemes altogether. This was a good step and has been taken now. These schemes pump printed money into the economy, which is captured first and foremost by the billionaire elites, converted into dollars and remitted into their accounts abroad. Then comes the inflationary pressure they inevitably create, as the supply of rupees in the economy rapidly outpaces the availability of dollars, and the ensuing mismatch between foreign currency and domestic liquidity in the system forces an abrupt exchange rate devaluation. The resulting inflation hits the poor, who have seen little to none of the benefits from the period of growth trickle down to them.\n\nThe story is the same with the interest rate. The State Bank has wisely held rates steady in the last three announcements, and should continue to do so until external sector pressures subside reliably. Maybe, the State Bank should announce some sort of external sector comfort threshold that must be crossed before further rate cuts can be considered. These can include reserve import cover crossing the three-month bar, forward liabilities of the State Bank below $1bn, the export to import ratio remaining stable within a narrow, predefined corridor for at least two quarters. This will help mute some of the annoying babble around CPI inflation and interest rates.\n\nThe business community must understand that things are changing, and they need to keep pace with a changing world. Energy-intensive industries will find it difficult to survive in the new world, if they don’t make their own arrangements for energy going forward. Speculative enterprises like real estate should be allowed to gasp for air long enough till they internalise the virtues of actually adding value to make money. But under no circumstances should government take it upon itself to help revive industry fortunes. This is a great moment to communicate a long overdue message to the freeloaders. It is time to adapt or die. Let them do what business people do everywhere else: work and take risks.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, October 30th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/6902a95f42b76.jpg",
  "retrievedAt": "2025-11-01T19:02:14.328Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952128/adapt-or-die",
  "dateList": "2025-10-29",
  "date_published": "2025-10-30T00:00:22.000Z"
}
