{
  "title": "Indian minister says Australian players touched inappropriately during WWC will ‘learn lesson’, stay cautious in future",
  "author": "Dawn Sport",
  "content": "A senior BJP leader and regional minister has said that two Australian cricketers who were inappropriately touched by a man last week during the Women’s World Cup would “learn a lesson” from the incident and stay cautious in the future, according to Indian media.\n\nThe incident in question took place in the central Indian city of Indore on Thursday morning when the two players left their hotel to go to a cafe, a day after Australia’s six-wicket victory over England in the group stage of the World Cup, when they were allegedly approached by a motorcyclist. The two players were not identified by Indian police or Cricket Australia, which confirmed the incident, and one man has been arrested in connection with the case.\n\nNDTV reported on Sunday that senior BJP leader and Madhya Pradesh minister Kailash Vijayvargiya had stated that the incident was “a lesson for everyone.”\n\n“Sometimes, players don’t realise their popularity. Players are very popular, so they should be careful,” Vijayvargiya said. “This incident has happened; it’s a lesson for everyone. It’s a lesson for us and for the players as well.”\n\n“While there was a security lapse, it was also the players’ responsibility to inform local authorities before going out. They didn’t inform anyone, they didn’t tell anyone,” he said in remarks to the Indian publication.\n\n“But they will learn a lesson from this incident and stay cautious in the future.”\n\nThe minister further said that “whenever any player goes anywhere, even when we go out, we always inform at least one local person.\n\n“I think this will remind the players that in the future, if we leave our venue, we should inform our security or local administration before leaving, as there is a huge craze for cricket players,” he said.\n\nEarlier, Additional Deputy Commissioner of Police Rajesh Dandotiya, told Indian news agency ANI that the security officers of the women’s Australian cricket team had filed a complaint that two members of the team faced inappropriate behaviour.\n\n“A FIR (first information report) was registered, and the accused was identified and arrested following an intensive strategic operation,” Dandotiya said.\n\nHe has been charged under sections 74 and 78 of the criminal code that deal with assault or using criminal force against a woman with the intent to outrage her modesty and stalking, respectively. “We are examining if there were any shortfalls in the security protocols,” Dandotiya added.\n\nViolence against women remains a chronic issue in the world’s most populous country, where an average of nearly 90 rapes a day were reported in 2022.\n\nDandotiya said the 30-year-old man who was arrested has a criminal record.\n\nMeanwhile, Cricket Australia said that the matter was reported by team security to police, who were handling the matter.\n\nBoard of Control for Cricket in India Secretary Devajit Saikia said it was a “deeply regrettable and isolated incident.\n\n“We appreciate the swift and effective action taken by the Madhya Pradesh Police in apprehending the accused. The law will take its due course to ensure justice is served,” Saikia said.\n\n“We will also review our existing safety protocols and strengthen them further, if necessary, to ensure such incidents are not repeated.”\n\nThe Times of India newspaper also reported earlier that the team’s security manager received a distress message from one of the cricketers that said “… there is a guy following us trying to grab us”.\n\nTeam officials were informed and went to their location to assist the players, the paper said. A police patrol then escorted the players safely back to the team’s hotel.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/271213085818550.webp",
  "retrievedAt": "2025-11-01T19:02:42.900Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951554/indian-minister-says-australian-players-touched-inappropriately-during-wwc-will-learn-lesson-stay-cautious-in-future",
  "dateList": "2025-10-29",
  "date_published": "2025-10-27T07:26:23.000Z"
}
