{
  "title": "Naqvi, investigators share initial findings of probe into ASP’s death with family",
  "author": "Munawer Azeem | Ikram Junaidi",
  "content": "ISLAMABAD: Federal Minister for Interior Mohsin Naqvi and members of the committee, constituted to probe the mysterious death of Assistant Superintendent of Police (ASP) Islamabad Adeel Akbar, on Tuesday visited the family of the late police officer in his native town Kamoke.\n\nSources in the police told Dawn that the committee members had shared their initial findings regarding the incident with the family.\n\nThe three-member committee constituted by the inspector general of police (IGP), Islamabad, to probe the death of the ASP due to a gunfire under mysterious circumstances while performing his duty on October 23, comprises Deputy Inspector-General (DIG) Headquarters Haroon Joya, DIG Operations Jawad Tariq and DIG Security Atiq Tahir.\n\nIt has been tasked to determine the facts surrounding the death of ASP Akbar, who was serving as SP Industrial Area Zone and to establish whether it was an accident, suicide, or murder, as well as to identify the possible causes and motives.\n\nAfter the incident, the media widely reported that the ASP Akbar, a grade-17 officer of the Police Service of Pakistan stationed in the capital, allegedly shot himself with an official weapon which resulted in his death near Serena Hotel. The police officials, including the driver and operator attached with the officer, had been taken into protective custody after the incident.\n\nThe deceased, ASP Adeel Akbar, was serving as superintendent of police Industrial Area Zone.\n\nThere were reports that the officer had tested positive for dengue a couple of days ago, but was still performing duty.\n\nThe sources said the committee had so far recorded the statements of the driver and the “operator/gunmen” of the ASP. The committee had also collected digital evidence, including footages of Safe City, mobile phone locations of the deceased ASP.\n\nThe sources said the committee members were looking into all the aspects related to the incidents, including the possibility of the death due to an accidental fire, instead of widely speculated suicide.\n\nThe committee members, they said, had collected the details and engagements of the ASP on October 23.\n\nThe sources said the committee members did not see any reason for the ASP to commit suicide as he had already been exonerate by a committee in April from the charges leveled against him in a case that had been initiated against him in December last year.\n\nMoreover, they said, the ASP had also been shortlisted for Fulbright Scholarship and had enrolled for TOEFL (Test of English as a Foreign Language) after receiving a letter in this regard on Oct 6. The test was scheduled for Oct 24, a day after his death.\n\nAmid speculations over the ASP’s death, a psychiatric of Pakistan Institute of Medical Sciences (Pims) Dr Sultan Muhammad, who claimed to have examined the ASP, had also shared the details, circumstances and the deceased’s mental health condition with the probe committee.\n\n“As claims regarding murder and suicides are being made on social media, I decided to share the details with police as such speculations and debates become a matter of anxiety for the family, which is already aware of the situation,” said Dr Sultan said while talking to Dawn after appearing before the committee.\n\nHe claimed that the ASP had visited him at his private clinic a week before his death.\n\nHe also claimed that the deceased police officer had also told him about his duty in Azad Kashmir last month, where he had been sent along with a contingent of the Islamabad Police to quell a protest.\n\nPublished in Dawn, October 29th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/29092441446c804.webp",
  "retrievedAt": "2025-11-01T19:00:58.310Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951864/naqvi-investigators-share-initial-findings-of-probe-into-asps-death-with-family",
  "dateList": "2025-10-29",
  "date_published": "2025-10-29T02:52:24.000Z"
}
