{
  "title": "Pakistan seeks peace with all neighbours, but will not allow cross-border terrorism from Afghanistan: COAS Munir",
  "author": "Dawn.com",
  "content": "Chief of the Army Staff (COAS) Field Marshal Syed Asim Munir said on Thursday that Pakistan sought peace with all neighbours, including Afghanistan, but reiterated that the country will not allow cross-border terrorism to be perpetrated from Afghan soil.\n\nAccording to a statement from the military’s media wing, the Inter-Services Public Relations (ISPR), Field Marshal Munir made the comments during a trip to Peshawar, where he held an interactive session with a jirga of tribal elders. Later on, he was given a comprehensive briefing at Headquarters 11 Corps on the prevailing security environment, operational preparedness and ongoing counter terrorism efforts to maintain peace and stability along the Pak-Afghan border.\n\nPakistan-Afghanistan relations have worsened sharply in recent weeks, marked by border clashes and mutual accusations. Islamabad has repeatedly warned Kabul against permitting the banned Tehreek-i-Taliban Pakistan (TTP) to use Afghan territory for attacks — an allegation the Taliban reject. After a ceasefire, both sides initiated talks in Turkiye to develop a mechanism for monitoring Taliban measures to curb cross-border assaults, but discussions have so far reached a stalemate.\n\nWhile addressing the jirga, Field Marshal Munir highlighted that “despite the continuation of cross-border terrorism from Afghanistan, Pakistan, over the last few years has exercised patience and extended multiple diplomatic and economic overtures to Afghanistan, aimed at improving Pak-Afghan bilateral relations.”\n\n“However, instead of acting decisively against Indian-sponsored terror proxies Fitna Al Khwarij and Fitna Al Hindustan, [the] Afghan Taliban regime has been providing all possible assistance to these groups,” the statement said.\n\nFitna-al-Khawarij is a term the state uses for terrorists belonging to the banned Tehreek-i-Taliban Pakistan (TTP), while Balochistan-based groups have been designated Fitna-al-Hindustan to highlight India’s alleged role in terrorism and destabilisation across Pakistan.\n\nIt added that during the interaction, the COAS assured the tribal elders that Pakistan, particularly Khyber Pakhtunkhwa, will be “cleansed of the terrorists and their abettors.”\n\nThe army chief also appreciated the “steadfast and unconditional support” rendered by the tribal people to the security forces during the recent standoff between Pakistan and the Afghan Taliban.\n\n“He paid rich tribute to the resilience and sacrifices of the brave people of Khyber Pukhtunkhwa in [the] war against terrorism,” the statement said, adding that the tribal elders reiterated their “full support to the armed forces against terrorism and also against the Afghan Taliban.”\n\nPer the statement, the tribal elders appreciated the candid discourse by the COAS and expressed their unwavering commitment to peace in Pakistan and highlighted that the “twisted ideology” of the Fitna al Khwarij had no acceptance among the tribes of KP.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/301855534d920da.webp",
  "retrievedAt": "2025-11-01T19:01:54.729Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952174/pakistan-seeks-peace-with-all-neighbours-but-will-not-allow-cross-border-terrorism-from-afghanistan-coas-munir",
  "dateList": "2025-10-29",
  "date_published": "2025-10-30T14:03:07.000Z"
}
