{
  "title": "Punjab Police enlist 2,988 kids of cops for free major surgeries - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Punjab Police Department has registered 2,988 special children of the lower-rank employees for their major surgeries, including heart, kidney, liver, bone marrow, cochlear implants, etc, and approved their cases for the treatment, increasing the grant to Rs343 million under a special medical package.\n\nThe amount for the treatment expenses was raised following the reports that several children of police employees were suffering from various complicated diseases while their parents were unable to bear the expenses of their treatment in public as well as private hospitals.\n\nThe parents of these children made requests to Inspector General of Police Dr Usman Anwar, seeking financial help for their treatment, which in many cases totalled up to millions of rupees each.\n\nAs per sources, for the first time police department’s welfare wing has invited applications from employees with special children, including constables and assistant sub-inspectors, asking them to approach the Central Police Office for the purpose.\n\nPay treatment costs of several others suffering from serious ailments\n\nAccording to the official documents, the Punjab police welfare department has approved 654 cases of employees’ children diagnosed with cerebral palsy (CP), increasing the total financial assistance to Rs145m for their treatment either in private or government hospitals. Similarly, an amount of Rs59m was released for the treatment of 161 children diagnosed with thalassemia, Rs10m for 164 others with hearing loss and Rs76m for cochlear implants of 44 children.\n\nMoreover, medical financial aid was provided to 28 children suffering from major heart and kidney diseases and 33 special children, who were recommended by their doctors to have bone marrow transplants, as per the documents.\n\nQuoting some reports, a senior police official says that many of the children registered by the department have undergone major surgeries, while the process for operations of others was underway.\n\nCiting examples, he said Ali Husnain, a two-year-old son of Constable Mohammad Botta from Faisalabad, underwent a bone marrow transplant at Al-Shifa Hospital, Islamabad. He said a Rs1m financial grant was released by the police welfare department to the private hospital, while the remaining Rs1m was paid by the district police.\n\nSimilarly, a retired inspector’s son Uzair Umar underwent a kidney transplant at the Shaikh Zayed Hospital, Lahore, and the bone marrow transplant of 6-year-old Hamza, a thalassemia patient, was performed at the Gambat Institute of Medical Sciences, Sukkur, Sindh. He said the bone fracture surgery of an employee’s 16-year-old daughter, Sania, was done at the Ghurki Trust Hospital, Lahore, while another girl, Zainab (10), underwent arm surgery at the National Hospital, Bahawalpur.\n\nThe official said that four complicated surgeries of an employee’s son, Mohammad Ahmad, were carried out at Al-Shifa Hospital, Islamabad, and the welfare department paid Rs6.5m for the treatment.\n\nHe said Amian (5), daughter of a policeman, underwent plastic surgery at the CMH Rawalpindi, while the department also bore the cost of treatment of 19-year-old Zaid Umar, who was admitted to the ICU of the hospital with serious brain injuries he suffered in a major accident.\n\nThe official said the police department released Rs2.2m for the cardiac treatment of the son of a driver who needed the placement of a pacemaker.\n\nHe said the department was paying Rs15,000 per month each as continued support to the children of police employees, suffering from thalassemia, hemophilia and other blood disorders, besides Rs10,000 per month each for the children living with cerebral palsy.\n\nThe department also released a Rs10m grant for the scholarships to 58 children of employees serving across the province, besides providing customised wheelchairs, prams, and electric wheelchairs to 131 others to improve their mobility, he added.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:02:58.848Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934714/punjab-police-enlist-2988-kids-of-cops-for-free-major-surgeries",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:10:22.000Z"
}
