{
  "title": "PTA rejects audit claim of telecom company overcharging users - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The telecom sector regulator has contested the Auditor General of Pakistan (AGP) report, clarifying that there was no overcharging by Jazz, the country’s largest telecom operator.\n\nThe Pakistan Tele­comm­unication Authority (PTA) said the tariff adjustments highlighted in the audit observations had been duly approved by the authority in line with the prescribed regulatory framework.\n\n“All relevant records substantiating these approvals were shared with the audit authorities for verification,” the PTA stated.\n\nIn a statement, PTA said, “Certain misleading information is being circulated on social media, suggesting that Jazz charged its subscribers tariffs beyond those approved by PTA during the financial year 2023–24, as referenced in the Auditor General of Pakistan’s report.”\n\nIt reaffirmed its commitment to safeguarding consumer interests and ensuring a fair, transparent telecom ecosystem.\n\nThe authority maintains continuous oversight of all operators’ tariff structures to ensure strict compliance with regulatory requirements and to prevent any unfair commercial practices.\n\nMeanwhile, Jazz has also issued a statement claiming that it was reviewing the observations shared in the audit report on the PTA for Audit Year 2024–25.\n\n“We remain confident that Jazz has acted lawfully and transparently at every step, in full alignment with PTA’s rules and regulatory procedures, including those related to tariff approvals and mandated contributions.”\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:03:09.880Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934998/pta-rejects-audit-claim-of-telecom-company-overcharging-users",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:09:43.000Z"
}
