{
  "title": "Any talks with India will be on equal footing, no begging for negotiations: PCB chief Mohsin Naqvi - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan Cricket Board Chairman Mohsin Naqvi on Saturday said that any talks on sporting ties with India would be held on equal footing and there would be no more pleading for negotiations.\n\nThe suspension of bilateral ties between Pakistan and India has now been officially extended beyond cricket to all sports. On Thursday, India’s sports ministry issued a new policy that ends bilateral sporting ties with Pakistan, even on neutral venues. However, no stoppage has been announced for engagement at multilateral tournaments, paving the way for the much-anticipated Asia Cup cricket clash between the two rivals next month.\n\nLast month, the Pakistan Sports Board had asked sports federations in the country to seek approval before participating in sporting events held in India.\n\nQuestioned about sporting ties with India during a press conference in Lahore, Naqvi said: “I think we are very clear that whenever talks are held will be on an equal footing with India and there will be no more begging for negotiations. That time has passed and whatever will happen will be on the basis of equality.”\n\nQuestioned about the team’s dismal performance and the need for any revamping in it, the PCB chief reassured that the squad would exhibit improvement very soon.\n\nThe PCB chief was also asked about visa issues for sports journalists for the upcoming Asia Cup in the United Arab Emirates, to which he said that a cell had been set up to coordinate visa issuance and whoever needed one would be provided.\n\nNaqvi was also quizzed about the team composition that saw notable players Babar Azam and Mohammad Rizwan left out to make way for new players, to which he responded: “I do not even have a one per cent role in the team selection.”\n\nHe said there was a selection team and an advisory body, adding that all of them sat down and reviewed the squad selection multiple times over long hours and days.\n\n“I have told them that whatever decision is made should be on the basis of merit and I will support it. Whatever lot was available to us, we polished it and took it forward. Our effort is to bring as many new people as possible so we have more competition in cricket and the best people come up.”\n\nThe PCB chief called on people to support the team in the Asia Cup match against India and to desist from criticising them, saying that “needless criticism” demotivated players during tournaments.\n\nHe also expressed hope of improvement soon in the national women’s squad.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/23180743e5fa5f3.jpg",
  "retrievedAt": "2025-08-25T13:28:17.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1935792/any-talks-with-india-will-be-on-equal-footing-no-begging-for-negotiations-pcb-chief-mohsin-naqvi",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T13:30:56.000Z"
}
