{
  "title": "Shaheen Afridi backs youngsters following Babar, Rizwan axe - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: Pakistan pace spearhead Shaheen Shah Afridi has expressed confidence in the country’s emerging talent, backing youngsters to step up in the absence of former mainstays Babar Azam and Mohammad Rizwan.\n\nBabar and Rizwan, once Pakistan’s revered T20I opening pair, have been sidelined from the format as the team pursues a more aggressive approach under new leadership.\n\nThe transition follows the appointments of Mike Hesson as Pakistan’s white-ball head coach and Salman Ali Agha as T20I captain earlier this year. Hesson has publicly stated that Babar and Rizwan need to refine their T20I skills to reclaim their spots in the national XI.\n\nWith the senior duo out of favour, Pakistan are relying on less-experienced players such as Saim Ayub, Sahibzada Farhan, and Mohammad Haris to bolster the top order, while Hasan Nawaz has emerged as a promising middle-order batter. All featured prominently in Hesson’s first three assignments and are set to play when Pakistan begin their tri-nation series in the United Arab Emirates on August 29.\n\nThe tournament, featuring hosts UAE and Afghanistan, will be staged entirely in Sharjah and is seen as a preparatory competition ahead of the Asia Cup, which begins on September 9 in the UAE.\n\n“Everyone should get an opportunity. Babar and Rizwan are world-class players and have done great for Pakistan, and they will continue to do so,” Shaheen told reporters on the sidelines of the team’s training camp at Dubai International Cricket Stadium on Friday.\n\n“But everyone gets opportunities, and they should seize them. The youngsters we have are also our players, and we should back them. The more we support them, the better. Instead of criticising them for being new, we should remember they are our players and help them progress.”\n\nThe Asia Cup will provide Hesson and Salman with their first significant test, giving them a chance to assess the team months ahead of the T20 World Cup, scheduled in India and Sri Lanka in February-March next year.\n\nUnder Hesson, Pakistan have enjoyed mixed results so far, having thrashed Bangladesh 3-0 at home, lost 2-1 away, and defeated West Indies 2-1 in the United States.\n\nThe Asia Cup will feature at least one and at most three high-stakes encounters with India. With the cross-border tensions of May still fresh, the matches are expected to be intense, presenting a stern challenge for Pakistan’s revamped side.\n\nShaheen, however, expressed confidence in his team’s preparation.\n\n“Obviously, it’s a high-pressure match, and plans will be made,” he said. “But with the kind of preparation we have, I don’t think Pakistan has ever prepared this early before. This time, we have a great opportunity. We can also use the stadium to our advantage. Our preparation can get even better for the big matches. But our first target is the tri-nation series, and then the Asia Cup.”\n\nThe left-arm pacer also acknowledged the threat posed by Afghanistan and UAE in the tri-series.\n\n“In T20 cricket, no team is easy,” he noted. “But our preparation is solid; we have a young team ready to play fearless cricket. I think we have an edge, and there’s nothing to worry about. Our preparation is for the big events.”\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:03:05.432Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934669/shaheen-afridi-backs-youngsters-following-babar-rizwan-axe",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:09:55.000Z"
}
