{
  "title": "King Dollar - Business - DAWN.COM",
  "author": null,
  "content": "THE seventh and youngest child of Lithuanian immigrants, Harry Dexter White, was a classic late bloomer.\n\nOrphaned at a young age, White fought in World War I, and eventually finished his doctorate from Harvard at age 40. Despite the late start, White’s crowning achievement came at the Bretton Woods Conference when he succeeded in placing the US dollar at the centre of the post-World War II international financial system. In the decades that followed, the dollar reigned supreme as the very foundation of global finance.\n\nThis year, however, the dollar has suffered a decline of almost 10 per cent in value, making this the greenback’s weakest performance since 1973. At least for some, this decline reflects an inflection point, marking the beginning of the end of the dollar era.\n\nA deeper analysis of this dollar depreciation suggests that there might be some volition at play. Important voices from inside the Trump administration, like those of Stephen Miran, have argued that the dollar is structurally overvalued, making US exports uncompetitive. To remedy this, Miran has proposed a summit, the so-called Mar-a-Lago Accord, so that the US would be able to convince other major economies for a depreciation in the dollar. Miran also forwarded the idea of imposing a user fee on foreign governments’ US treasury holdings, another way through which the dollar’s value may be lowered.\n\nIn addition, President Donald Trump has pushed very strongly for lower interest rates, dubbing Federal Reserve chair Jerome Powell ‘Too Late’ for the supposed delay on his part. Trump has recently nominated Miran to the Fed board, in what appears to be an attempt to get lower rates as soon as possible. Trump’s visible frustration with Powell and Miran’s rising influence within the Fed show that lower interest rates, and, consequently, a lower dollar are around the corner.\n\nWhere Washington may willfully turn a blind eye towards dollar depreciation, dollar dominance — a pre-eminent role in international currency transactions and foreign reserve holdings — is quite another thing.\n\nIn terms of dominance, the dollar is undisputed king, with about 60pc of global official reserves held in dollars, while about 60pc of international currency loans and deposits are also denominated in dollars. The US remains the world’s largest investment destination, with FDI totalling some $12.8 trillion. At the same time, it appears that US policymakers are willing to do their utmost to ensure the dollar’s dominance in the international financial system, not least because of the immense geopolitical leverage it offers.\n\nAt the moment, there’s no real challenger to the dollar’s dominance.\n\nThe US has repeatedly frozen foreign governments’ dollar-denominated assets in order to force them to the negotiating table. In 1979, president Carter froze $12 billion worth of Iranian assets to convince Tehran for negotiations. In the decades since, sanctions have become an oft-used tool of US foreign policy. As economic warfare becomes the new normal in the emerging global order, the very success of US foreign policy hinges on the dollar’s dominance.\n\nAt the moment, there’s no real challenger to the dollar’s dominance. The US offers a deep and liquid market for a most desirable single asset, namely the US treasuries. Neither the EU nor China have anything similar. Even if China were to try to offer something, it would have to run trade deficits, something that goes against the agenda of export-driven growth. Concurrently, the significant heft of the US economy will ensure the dollar’s dominance as, according to the IMF, the US made up 26pc of the world’s GDP in 2024, slightly up from 25pc in 1980 — an impressive feat, especially with China’s growth during that time.\n\nStill, the dollar’s reign is not immune to bad policies. Though White played a seminal role, the dollar was bound to become dominant as the US was economically the most powerful country at the end of World War II. Over the next decades, the dollar also attained dominance partly because of the high quality of US institutions, democracy, checks and balances, property rights, etc. With its strong institutions, the US economic system was rightly expected to withstand extreme crises or ‘black swans’.\n\nNow, however, there is a chance that in the haste to implement their political agenda, US policymakers might end up committing a faux pas. Some analysts have noted gravely that the so-called Overton window, or policies viewed as acceptable, is widening under the present administration.\n\nOnce considered unthinkable, public pressure on the Fed chair to lower interest rates as well as the abrupt dismissal of the commissioner of the Bureau of Labour Statistics have raised concerns about the sanctity of US institutions. In a sense, this ostensible indifference towards checks and balances has raised concerns about the future quality of US institutions, and hence the dollar’s continued dominance.\n\nUS policymakers may also want to revisit their haphazard use of sanctions. The number of individuals subject to US sanctions rose from 912 in 2000 to about 9,400 in 2021. Such extensive use of sanctions may provide increased incentives for countries to diversify away from the dollar, especially when the BRICS nations develop potential dollar alternatives in the future.\n\nAll in all, attenuation of the dollar’s dominance might not be a bad thing. Financial stability may actually increase with more international currencies, providing more safe havens during crises. In fact, the dollar’s share of global reserves has been gradually declining for the past two decades as central banks have been shifting away.\n\nKing Dollar still rules global finance, but its crown is not unassailable. Strategic depreciation may aid trade, yet reckless policies and the excessive use of sanctions risk weakening its reign. A future with rival international currencies may bring stability, but for now, the dollar’s dominance endures as long as the US upholds the strong institutions that made it king.\n\nThe writer completed his doctorate in economics on a Fulbright scholarship.\n\naqdas.afzal@gmail.com\n\nX: @AqdasAfzal\n\nPublished in Dawn, August 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68ab9e03a702b.jpg",
  "retrievedAt": "2025-08-25T13:28:23.622Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937054/king-dollar",
  "dateList": "2025-08-23",
  "date_published": "2025-08-25T00:30:50.000Z"
}
