{
  "title": "‘Encounter’: Another child molester shot in private parts in Kasur - Pakistan - DAWN.COM",
  "author": null,
  "content": "KASUR: In another incident in Kasur, a suspect, who had molested a minor girl, was shot in his private parts during an alleged encounter in the limits of Chunian Police Station on Friday.\n\nThe suspect was seen with a 10-year-old girl at Zaheerabad Colony of Chunain through a viral video. The child was in the street when he molested her and CCTV footage captured him committing the crime. The girl child’s father had reported the matter to the police and registered an FIR.\n\nThe police claimed when they conducted a raid to arrest the suspect, he tried to attack them with his pistol that went off. As a result, his private parts were critically injured. The suspect was hospitalised in an injured condition.\n\nAccording to sources in the police, he belonged to the same area as that of the child he molested. He is stated to be 27/28 years old, a daily-wager with no regular job. He is married and has a daughter.\n\nAbout three weeks back, a video of a man molesting a girl child who was playing in the street of Shah Inayat Colony had gone viral, causing an outrage on social media.\n\nDPO Essa Khan Sukhera had taken notice of the footage and directed Station House Officer Asif Javed to arrest the suspect. Three days later, the suspect, a labourer from Okara, was arrested by City police in an injured condition. He too had suffered a bullet injury to his private parts.\n\nThe police said the suspect was caught at Dhanpat Road where he pulled out a pistol to escape arrest. However, the pistol went off during a firing exchange, causing an injury to him.\n\nKasur has been notorious in recent years due to child molestation, rape and sexual abuse cases. In 2015, a child pornography ring was busted for involvement in a case in which over 200 children of Hussain Khanwala village were filmed while raping young boys and girls.\n\nAs many as 285 cases of child sexual abuse were recorded in this single scandal. The busted gang had men in their 20s and 30s. According to some reports, the entire village knew about the shocking activities of the gang.\n\nIn 2018, six-year-old Zainab Amin was kidnapped, raped and killed by a suspect.\n\nIn 2020, a 12-year-old boy was arrested for raping a three-year-old boy child on the rooftop of his house. In 2021, am 11-year-old boy, a seminary student, was raped by four men, aged 30 to 40, near Rohi Nullah on his way to his seminary.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:02:57.595Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934710/encounter-another-child-molester-shot-in-private-parts-in-kasur",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:10:22.000Z"
}
