{
  "title": "Seoul says fired warning shots after North Korean troops crossed border - World - DAWN.COM",
  "author": null,
  "content": "South Korea fired warning shots at North Korean soldiers that briefly crossed the heavily fortified border earlier this week, Seoul said on Saturday after Pyongyang accused it of risking “uncontrollable” tensions.\n\nSouth Korea’s new leader, Lee Jae Myung, has sought warmer ties with the nuclear-armed North and vowed to build “military trust”, but Pyongyang has said it has no interest in improving relations with Seoul.\n\nSeoul’s military said several North Korean soldiers crossed the border on Tuesday while working in the heavily mined Demilitarised Zone (DMZ) separating the two Koreas.\n\nThe incursion prompted “our military to fire warning shots”, Seoul’s Joint Chiefs of Staff said in a statement, adding “the North Korean soldiers then moved north” of the de facto border.\n\nPyongyang’s state media said earlier today that the incident occurred as North Korean soldiers worked to permanently seal the frontier dividing the peninsula, citing a statement by Army Lieutenant General Ko Jong Chol.\n\nCalling the event a “premeditated and deliberate provocation”, Ko said Seoul’s military used a machine gun to fire more than 10 warning shots towards the North’s troops, according to the official Korean Central News Agency.\n\n“This is a very serious prelude that would inevitably drive the situation in the southern border area, where a huge number of forces are stationed in confrontation with each other, to the uncontrollable phase,” Ko said.\n\nThe last border confrontation between the arch-rivals was in early April when South Korea’s military fired warning shots after around 10 North Korean soldiers briefly crossed the frontier.\n\nNorth Korea’s military announced last October that it was moving to totally shut off the southern border, saying it had sent a message to US forces to “prevent any misjudgment and accidental conflict”.\n\nShortly after, it blew up sections of the unused but deeply symbolic roads and railroad tracks that connect the North to the South. Ko warned that North Korea’s army would retaliate against any interference with its efforts to seal the border permanently.\n\n“If the act of restraining or obstructing the project unrelated to the military character persists, our army will regard it as deliberate military provocation and take corresponding countermeasures,” he said.\n\nUnder Lee’s more hawkish predecessor, relations between the two Koreas had sunk to one of their lowest points in years.\n\nAfter Lee’s election in June, he pledged to pursue dialogue with the nuclear-armed North without preconditions, saying last week his government “will take consistent measures to substantially reduce tensions and restore trust”.\n\nEven so, South Korea and the United States began annual joint exercises on Monday aimed at preparing for potential threats from the North. Lee described the drills as “defensive” and said they were “not intended to heighten tensions”.\n\nNorth Korea — which attacked its neighbour in 1950, triggering the Korean War — has long been infuriated by such exercises between the US and the South, decrying them as rehearsals for invasion.\n\nHong Min, a senior analyst at the Korea Institute for National Unification, said Pyongyang was again accusing Seoul of pursuing a “dual approach” with its latest outburst — calling for dialogue while in its view raising military tensions.\n\nPyongyang’s leader Kim called earlier this week for the “rapid expansion” of the North’s nuclear weapons capability, citing the ongoing US-South Korean military exercises that he claimed could “ignite a war”.\n\nHis powerful sister has since said Seoul “cannot be a diplomatic partner” of the North, and that Lee “is not the sort of man who will change the course of history”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/231722412b2fd2e.jpg",
  "retrievedAt": "2025-08-25T13:28:17.072Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1935734/seoul-says-fired-warning-shots-after-north-korean-troops-crossed-border",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T13:33:59.000Z"
}
