{
  "title": "Quetta ATC extends Mahrang’s remand for 15 more days - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: An Anti-Terrorism Court (ATC) on Friday extended the physical remand of Baloch Yakjehti Committee (BYC) leader Dr Mahrang Baloch and four others for an additional 15 days in police custody.\n\nThe fifth accused, Mama Abdul Ghafoor, a leader of the National Party, was released by police, who said he is no longer required for investigation.\n\nMahrang Baloch, along with Beebu Baloch, Gulzadi Baloch and Bebarg Baloch, was produced before the ATC in Quetta amid tight security.\n\nPolice informed the court that further investigation was needed and requested a 15-day extension in remand, which the court approved.\n\nThis is the fourth time the BYC leaders have been presented before the court since their arrest. Initially, they were detained under Section 3 of the Maintenance of Public Order (3MPO). Following the expiry of their MPO detention, terrorism-related charges were filed against them.\n\nA large number of BYC supporters gathered outside the court during the hearing, raising slogans in solidarity with their leaders.\n\nSpeaking to the media outside the court, Mahrang Baloch said the state was attempting to intimidate the public by imprisoning BYC leaders. “We want to make it clear that no national or public movement retreats because of imprisonment.”\n\nShe said that the arrests were an effort to suppress the voice of the people of Balochistan, but instead, “we will amplify this voice so that the world hears the demands of the Baloch people”.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:03:09.844Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1935000/quetta-atc-extends-mahrangs-remand-for-15-more-days",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:09:43.000Z"
}
