{
  "title": "Pakistani foreign minister on first official visit to Dhaka in 13 years - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister Ishaq Dar departed for an official two-day trip to Dhaka on Saturday, marking the first state visit by a foreign minister to Bangladesh in 13 years, the Foreign Office (FO) said.\n\nEver since a popular uprising in Bangladesh saw Sheikh Hasina’s government being toppled in August of last year, there has been a thaw in ties between Islamabad and Dhaka, with trade and bilateral relations seeing a marked improvement.\n\nDar embarked on a “historic visit to Bangladesh” today, the FO said on X, as the deputy premier departed from the Nur Khan Airbase in Rawalpindi. “In Dhaka, he will hold important meetings with Bangladeshi leaders,” it added.\n\n“The visit is a significant milestone in Pakistan-Bangladesh relations as a Pakistani foreign minister is visiting Bangladesh after a gap of around 13 years,” the FO highlighted.\n\nThe last time a foreign minister paid an official visit to Dhaka was in November 2012, when Hina Rabbani Khar made a six-hour visit to Bangladesh to formally invite then-prime minister Sheikh Hasina to a summit in Islamabad later that month.\n\nDuring his trip, Dar will hold important meetings with various Bangladeshi leaders, including Chief Adviser Muhammad Yunus and Adviser for Foreign Affairs Touhid Hossain, according to a statement by FO.\n\n“The whole range of bilateral relations and a number of regional and international issues will be discussed during these meetings.”\n\nThe meetings are likely to take place tomorrow, according to Bangladeshi news outlet BSS.\n\nThe visit is expected to see the signing of four to five memorandums of understanding (MoUs) to strengthen bilateral ties in the fields of trade, culture, media, training, and travel, a senior official of Bangladesh’s foreign ministry told BSS.\n\nDar’s visit comes on the heels of Commerce Minister Jam Kamal Khan’s official tour to Dhaka, where he met Bangladesh’s advisers for commerce and industries.\n\nIslamabad and Dhaka are in the process of establishing a joint working group on trade to enhance the economic ties and foster greater cooperation in trade, according to the commerce ministry.\n\nThe two countries started direct government-to-government trade in February with imports of 50,000 tonnes of rice, while Fly Jinnah has also secured approval to operate flights from Karachi to Dhaka.\n\nDiplomatic ties were rekindled after 15 years in April with the visit of Foreign Secretary Amna Baloch for Foreign Office Consultations (FOC).\n\nLast month, when Interior Minister Mohsin Naqvi visited Dhaka, Paki­stan and Bangladesh agreed to grant visa-free entry to holders of diplomatic and official passports from the other side.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/23111200232d6d9.jpg",
  "retrievedAt": "2025-08-23T08:02:55.139Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1935344/pakistani-foreign-minister-on-first-official-visit-to-dhaka-in-13-years",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T06:44:45.000Z"
}
