{
  "title": "High-level forum to deal with scourge of illegal construction - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Friday held that illegal constructions on the banks of rivers and water channels were to blame for over 700 deaths in the current spell of torrential rains and floods, and called a high-level meeting with all four provinces to address the issue.\n\n“Although it was a natural catastrophe, there is no room for man-made disaster,” the prime minister said while addressing the federal cabinet meeting.\n\n“For how long the federal and provincial governments continue to pay compensation for the loss of lives caused by illegal constructions along rivers and water channels,” the prime minister asked.\n\nHe revealed that more than 700 people have lost their lives during rains and flooding in the country, of which over 400 deaths occurred in Khyber Pakhtunkhwa.\n\nPM to convene meeting with provinces; committee of ministers will work to reduce agriculture production costs\n\n“I will soon convene a meeting on the issue of illegal constructions such as hotels, restaurants and houses, as monsoon rains have caused catastrophic floods in northern parts of the country,” he added.\n\nRecord rains in Khyber Pakhtunkhwa, which began on Aug 15, have wreaked havoc across different parts of the province. Last week, the provincial government declared an emergency as torrential rains destroyed homes, displaced families, and left a trail of destruction in Buner, Swat, Shangla, Mansehra, and other areas.\n\nThe PM expressed concern over such structures, which reflected “catastrophic beauty”, and also over deforestation in Galiyat, where plazas and houses have been built.\n\nThe PM reviewed the relief and rehabilitation work in the flood-affected areas during the meeting, saying that the federal government had exte­nded “full cooperation” to the provincial governments.\n\nHe also commended the efforts of the armed forces in rescue and relief operations. “Pakistan Army reached the distant and difficult areas to rescue the people. For this purpose, helicopters were also used,” he said.\n\nHe mentioned his visit to the flood-affected areas in Gilgit-Baltistan and Azad Jammu and Kashmir, highlighting the efforts of ministers and secretaries. “This is a collective responsibility,” he added.\n\nFollowing the disaster, he said, the responsibility of the Ministry of Climate Change has increased to deal with the challenges of climate change. He added that other relevant departments will also have to play their part.\n\nThe PM also referred to the recent “destructive rains” in Karachi earlier this week. “I spoke to the Sindh chief minister and (PPP Chairman) Bilawal Bhutto-Zardari to express my sympathies,” he said.\n\nMinisterial committee formed\n\nLater, PM Shehbaz formed a ministerial committee with a task to reduce production cost of agriculture.\n\nThe cabinet also approved the closure of Utility Stores across the country with effect from July 1. The prime minister directed the authorities concerned to protect the rights of the stores’ workers.\n\nIn a separate decision, the cabinet approved the proposed amendments to the Special Economic Zones (SEZs) Act, 2012.\n\nPM Shehbaz stressed that providing a business and investor-friendly environment was crucial for industrial development, adding that the expansion of industries would enhance exports and create new jobs.\n\nThe meeting also approved the presentation of the Annual Report of the National Economic Council for fiscal year 2023-24 before Parliament, and endorsed decisions taken by the Economic Coordination Committee (ECC) on Aug 19 and the Cabinet Committee on Legislative Cases (CCLC) on August 18.\n\nOn Wednesday, the prime minister visited the flood-affected districts of Swat, Buner, and Shangla in KP, where 14 more bodies were recovered from debris in Swabi’s Dalori area.\n\nWhile interacting with flood victims, he assured them of the government and the army’s unwavering commitment to extending maximum support “in this critical hour.”\n\nThe KP government, on Monday, released Rs800 million in relief funds for all affected districts, with an additional Rs500m specifically for the worst-hit Buner, as flash floods continue to ravage the province with over 400 deaths.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/230741118fc735b.png",
  "retrievedAt": "2025-10-12T03:52:42.762Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1935021/high-level-forum-to-deal-with-scourge-of-illegal-construction",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:09:31.000Z"
}
