{
  "title": "Man killed in ‘police firing’ during jirga in Charsadda - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHARSADDA: A man was killed allegedly by police firing during a jirga here on Friday, official sources said.\n\nThey said that a jirga was in progress to settle a dispute over a drain along the Ghani Khan Road when Charsadda city police station SHO Behramand Shah along with a party reached there.\n\nThe sources said that the SHO got involved in a verbal altercation with Mian Asim Shah, the son of local Jamaat-i-Islami leader Mian Mohsin Shah. Afterwards, the police officer allegedly opened fire, killing Asim on the spot. Two constables were also reportedly injured in the incident.\n\nThe sources said a case was registered against the SHO and he was also suspended on the intervention of deputy commissioner Dr Azmatullah Khan Wazir when relatives and workers of different political parties placed the body on the road at Farooq Azam Chowk to protest the killing.\n\nThe protesters, including relatives of the deceased, were drawn from JI, PML-N and Qaumi Watan Party, business community and civil society. An inquiry committee, under the supervision of SP investigation Sajjad Khan, has also been formed to investigate the incident, the sources said.\n\nThe protesters, terming the killing as an act of police brutality, burned old tires, and demanded strict punishment for the SHO.\n\nMian Mohammad Zohaib, the brother of the deceased, told the police that a settlement was underway in their hujra regarding a dispute over drainage with a neighbour. In the meantime, SHO Behramand Shah, along with policemen, also arrived at the scene. After a verbal altercation with Mian Asim Shah, the SHO opened fire, killing Asim on the spot, the complainant alleged.\n\nLater, the deputy commissioner held talks with the relatives and protesters and assured them of justice. He directed the police to register the FIR against the SHO.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:02:56.783Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934867/man-killed-in-police-firing-during-jirga-in-charsadda",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:10:29.000Z"
}
