{
  "title": "Ties with China ‘resilient despite geopolitical shifts’: FO - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Foreign Office has reaffirmed that Pakistan’s relations with China remain unaffected by recent geopolitical shifts and resulting realignments.\n\n“We are very confident that these relations are stable and sustainable on their own and will continue to grow and achieve new heights,” Foreign Office (FO) spokesperson Shafqat Ali Khan said during the weekly media briefing.\n\nHis remarks came a day after Chi­n­ese Foreign Minister Wang Yi visited Pakistan as part of his three-nation South Asian tour to attend the sixth Pakistan-China Strategic Dialogue.\n\nWhile the Pak-China dialogue broadly reviewed various aspects of the bilateral relationship, both sides carefully navigated the region’s shifting geopolitical landscape marked by warming China-India ties, Pakistan’s growing engagement with the United States, and tensions in US-India relations driven by President Trump’s tariffs and policies.\n\nFO terms New Delhi’s missile capabilities a global security threat\n\nIndia’s leg of Yi’s visit strengthened China’s rapprochement with New Delhi after years of hostility. The visit resulted in agreements to resume suspended trade talks and accelerate negotiations on border disputes.\n\nSpeaking at a media conference following the bilateral dialogue, Yi had emphasised China’s partnerships with both India and Pakistan “were not targeted at any third party, nor were they affected by any third party.”\n\nBoth Yi and FM Ishaq Dar underlined the importance that Pakistan and China attach to each other. Yi described Islamabad as “the most important stop” on his three-nation trip and highlighted the “stronger internal drive” behind bilateral ties.\n\nEchoing these sentiments, the FO spokesperson said: “Pakistan-China relationship is a very sustainable, longstanding, and robust relationship.” He expressed confidence that Pakistan-China relations, including their growing economic and strategic cooperation, would not be affected by regional developments, including those involving China.\n\nDialogue offer\n\nMr Khan said Pakistan is ready for an all-encompassing dialogue with India and welcomed the mediatory efforts of ‘friends’. “We are ready for composite dialogue. We welcome any effort which helps us achieve our objectives,” he remarked.\n\nAlthough Wang Yi did not publicly comment on India-Pakistan tensions or offer to mediate, he said, “A peaceful, stable, and prosperous South Asia serves the common interests of all sides and meets the expectations of all peoples.”\n\nMr Dar, soon after Yi’s visit, signalled Pakistan’s readiness to engage in dialogue with India. The FO spokesman stressed that unlike India’s insistence on focusing solely on terrorism, Pakistan believes “this would just be one item during the composite dialogue.”\n\nPakistan was not reluctant to address terrorism, as “we have complete and detailed evidence about India’s acts of terrorism against Pakistan”, he said.\n\nAgni-V test\n\nThe FO warned that India’s expanding missile capabilities pose a threat to both regional and global security and criticised the selective application of export control regulations by the Western countries that enabled New Delhi to advance its missile programme.\n\n“The acquisition and testing of int­ercontinental ballistic missile capabilities reflects a growing military threat posed by India extending far beyond the region and even the continent. This development seriously undermines peace, security and strategic stability at both regional and global levels,” the spokesperson said.\n\n“India’s expanding missile arsenal, including systems with intercontinental range, raises serious concerns about the selective and discriminatory application of Export Control Regulations that have enabled such destabilising advancements,” Mr Khan added.\n\nExpressing concern over India’s accelerating arms buildup, Mr Khan warned: “It is dangerous not only for Pakistan’s security but also for regional stability.”\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68a90519746f8.jpg",
  "retrievedAt": "2025-08-23T08:03:15.056Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934904/ties-with-china-resilient-despite-geopolitical-shifts-fo",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:09:36.000Z"
}
