{
  "title": "Murtaza Wahab asks opposition, JI’s town chairmen to work together for Karachi’s development - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Mayor Murtaza Wahab on Friday invited the opposition, mainly the chairmen of nine city towns under the Jamaat-i-Islami (JI), to work together for the betterment of the city instead of “carrying out only negative propaganda.”\n\nAddressing a press conference at the Karachi Metropolitan Corporation (KMC) head office, he shared details of the operation carried out by the city administration during the three-day rain to clear major thoroughfares and restore routine life in the metropolis.\n\n“Given how intense the rainfall was, even someone exceptionally capable wouldn’t have been able to manage the situation,” he claimed. “More than 300 millimetres of rainfall water was drained out through these channels. The capacity of KMC’s drains is 40 millimetres, and due to limited capacity, water spread into surrounding areas during heavy rainfall.”\n\nHe mentioned the traffic jam on Sharea Faisal as a major challenge on the first day of rain, which led to serious congestion on the major road link of the city and attracted severe criticism.\n\n“I admit that there was a lapse in traffic management, which we should have addressed. Perhaps we hadn’t anticipated that the rain would be this severe or that so many people would head out all at once,” added the mayor.\n\nHe urged the JI representatives of the city government to put aside their partisan mindset, reminding them that municipal representatives are part of the government, not party workers.\n\n“Whoever does good work, I will salute them,” he said.\n\n“Solutions will be provided by the PPP. I am ready to discuss the Charter of Karachi. Solutions lie in vision and intent. I am ready to be friends with everyone. In Lahore, everyone identifies as Lahori; in Karachi, we also need to work together. But here in Karachi, we divide ourselves by different identities. We need to change this mindset and work for the city together,” he said.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:03:02.265Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934593/murtaza-wahab-asks-opposition-jis-town-chairmen-to-work-together-for-karachis-development",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:10:08.000Z"
}
