{
  "title": "Dr Pervez Hoodbhoy slams Pakistan’s obsolete education system - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: “Every department of every big US university has got 20 to 30 per cent Indian faculty. Slightly more than that are a Chinese faculty and in most cases zero per cent Pakistani faculty, or Pakistani-origin faculty. In fact, there is not one single professor of mathematics that is Pakistani in any university in the United States, Britain, the rest of Europe or Australia,” said academic and nuclear physicist Dr Pervez Hoodbhoy.\n\nHe was speaking at the launch ceremony of the STEM Talent Search portal Lok Sahaita, a project of the Asma M. Hashmi Stem Centre at the NED University of Engineering and Technology, which was held at a local hotel here on Friday.\n\nThe Lok Sahaita STEM Talent Search Program is an initiative led by NEDUET where the country’s brightest university students will have the chance to submit their science projects for review followed by a period of mentorship to turn their ideas into breakthrough innovations.\n\nThey can work in the field of health, agriculture, urban planning, digital solutions, climate readiness, artificial intelligence, etc. The best projects will earn national recognition along with receiving awards of up to one million rupees.\n\n“We shot down five or six Indian Rafale fighter aircraft from the J-10 fighter jets which unleashed the PL-15 missiles through satellite technology, with training provided by China. So okay we can be happy, but now let’s get realistic,” Dr Hoodbhoy said.\n\nSays rote learning will take us backwards; STEM talent search portal launched\n\n“It is an excellent thing to look for talent but let’s not forget that it is a very difficult upward struggle. It is difficult for many different reasons but let me start with why it is going to be very difficult at the international level.\n\n“Physics teachers and professors all over the world today are grappling with this issue when giving assignments to their students as they are faced with this problem of the students accessing artificial intelligence to actually get the problems solved,” he said.\n\n“Today I accessed ChatGPT, too, to know the position of Pakistani students competing in international physics Olympiads and was given a factual list. According to the AI source, we have had zero gold medals in the last 20 years, one silver medal and five bronze medals. Then I asked the same question about Indian students and was informed that of every Indian team that has gone to the Olympiads in the last 30 years, 42 per cent have received gold medals, 42 per cent have also received silver medals and no student has returned to India without at least a bronze medal,” Dr Hoodbhoy shared.\n\n“So we are in a very difficult situation. Why has this situation come about and how might we possibly go about improving things? This is one way, by holding science competitions, making the students aware of what is out there so they make a run for it. Beyond that it is the education system which, basically, has to be reformed,” he said, adding that our exams only test our memory and nothing else. But memorising blindly will make us move in reverse.\n\nFinally, Dr Hoodbhoy reminded that all talk about progress and its importance in building up a viable society entirely depended upon one’s vision for society and how one honoured or dishonoured those who excelled in the sciences or in any area of intellectual endeavour.\n\n“There is only one person in all of Pakistan’s history, who has won a Nobel Prize in science, well, in physics. It was an achievement which was not simply of getting a Nobel Prize but which also has such importance in the world of physics that you no longer call it the Glashow-Weinberg-Salam theory but the Standard Model of particle physics that unifies the electromagnetic force and the weak nuclear force into a single electroweak interaction,” he said.\n\n“The idea of textbooks is being phased out across the world. The best education system is in Finland where there are no textbooks anymore. Unlike what we have here where textbooks are written by incompetent people who make huge profits. Instead, have it all online. This is how the rest of the world such as China, Korea, Japan, much of Europe and the United States are growing,” he said.\n\n“But here we can’t even utter Dr Abdus Salam’s name because he happened to be an Ahmadi. Here you study Einstein, who was Jewish, C.V. Raman Spectroscopy doesn’t get to you even though he was a Hindu but Dr Abdus Salam offends you so much? If your society is so intolerant that its foundations start to shake with just the mention of his name, then how is your society going to move forward?”\n\nProject PI and Director Stem Centre, NEDUET, Dr Majida Kazmi; Chairman Lok Sahaita Syed Pir Mohammad Shah; Pro Vice Chancellor, NEDUET, Dr Noman Ahmed and Vice Chancellor, NEDUET, Dr Muhammad Tufail, also spoke.\n\nPublished in Dawn, August 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T08:03:02.266Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1934596/dr-pervez-hoodbhoy-slams-pakistans-obsolete-education-system",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T02:10:08.000Z"
}
