{
  "title": "Two large lakes formed by glacial outburst in Gilgit-Baltistan: officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two large lakes have emerged following glacial outbursts in Gilgit-Baltistan’s (GB) Ghizer district following flooding caused by heavy rain this month, regional officials said on Saturday.\n\nA glacial burst, or glacial lake outburst flood (glof), refers to an outburst of water from a glacial lake which could lead to severe flooding downstream. At least 200 people were rescued after a glacier burst in GB, blocking the Ghizer River a day prior.\n\nDue to yesterday’s glacial burst, water containing debris and heavy stones fell into the river and stopped it from flowing for eight to nine hours.\n\n“The water remained standing, causing river water to spread for seven kilometres and become an artificial lake,” provincial government spokesperson Faizullah Faraq told Dawn.com.\n\nMeanwhile, the GB Disaster Management Authority (GBDMA) said that the Ghizer River changed course in the district on August 4 and began flowing over the Gilgit-Chitral Road.\n\n“A lake measuring 2,000 feet long and more than 50 metres wide has emerged in Khatam village as a result of the flood debris, due to which the Gilgit-Chitral Road is still closed,” GBDMA district official Ghufranullah Baig told Dawn.com.\n\n“This lake has affected a small settlement nearby, while trees and a large area of ​​land have been submerged.”\n\nAsraruddin Asrar, a prominent social figure from Ghizer, told Dawn.com that lakes being formed by natural floods in the area were an ongoing phenomenon for a long time.\n\n“Khalti Lake was formed in the 1980s; it still exists and has a great reputation in the area as a tourist attraction,” he said. “Sost Lake came into existence in the 1990s, and a lake was also formed at Haim last year as a result of floods. The largest number of lakes is found in Ghizer district.”\n\nIn 2010, a landslide in Attabad blocked the Hunza River, resulting in the renowned Attabad Lake, which is a popular destination for tourists.\n\nPakistan is home to over 13,032 glaciers, the largest reservoir of glaciers outside of the polar regions. However, experts have warned that about 10,000 glaciers in Chitral and GB have been reported to be receding due to climate change–induced temperature rise.\n\nEarlier this month, a glof from the Shishper Glacier tore through Hassanabad Nullah, swee­ping away part of the Karakoram Highway and destroying public and private properties.\n\nA glacier burst in Bagrot Valley caused the death of one person on August 1, while his father was injured, according to the regional government’s spokesperson.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/2321050441fb601.jpg",
  "retrievedAt": "2025-08-25T13:28:17.136Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1935780/two-large-lakes-formed-by-glacial-outburst-in-gilgit-baltistan-officials",
  "dateList": "2025-08-23",
  "date_published": "2025-08-23T16:09:12.000Z"
}
