{
  "title": "Fraudster agents involved in deductions from Kafalat payments to be dealt strictly: Sania",
  "link": "https://www.app.com.pk/national/fraudster-agents-involved-in-deductions-from-kafalat-payments-to-be-dealt-strictly-sania/",
  "date_published": "2022-03-25T11:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 25 (APP):Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar had caveated of strict actions being taken against fraudster agents involved in deductions from disbursements of Ehsaas Kafaalat beneficiaries.\nWarning agents to refrain from deductions, Dr. Sania, in a statement, reaffirmed that all those involved in deductions from payments of Kafaalat beneficiaries would be dealt with strictly according to the law.\nEhsaas Kafaalat payments for the period January to June 2022 are underway across all Tehsils countrywide. Prime Minister, Imran Khan had raised the six-monthly stipend amount of Ehsaas Kafaalat from Rs.12, 000 to Rs.14,000.\nWith this increase in the Kafaalat stipend by Rs. 2,000 all eligible beneficiaries of Kafaalat are now being paid Rs.14,000.\nHighlighting important pointers regarding defrauding activities, Dr. Sania emphasized on three things:\nFirstly, all Ehsaas Kafaalat beneficiaries should get full payment of Rs. 14,000.\nBeneficiaries whose children are enrolled in Ehsaas Taleemi Wazaif; their stipend amount is more than Rs. 14,000.\n“I would strongly advise all Ehsaas recipients not to forget collecting computerized receipt at the time of payment and double check that the stipend amount mentioned on the receipt is aligned with the cash received”, Dr. Sania reiterated.\nSecondly, she asked beneficiaries not to submit CNICs to retailers prior to Ehsaas payment. Original CNIC should be presented only at the time of Ehsaas payment. “No agent is allowed to hold CNICs of Ehsaas beneficiaries”, she said.\nThirdly, Dr. Sania urged beneficiaries, “Beware of agents who may try to deny cash payments at the time of biometric verification asking recipients to come later some other day. This is not acceptable, and beneficiaries should immediately report such instances to the district administrations and Ehsaas Tehsil offices in their respective districts.\nCautioning agents in newly issued video message, Dr. Sania also referred to Quranic verses about the importance of honesty. “Woe to those that deal in fraud. Those who, when they have to receive by measure from people, exact full measure, but when they have to give by measure or weight to men, give less than due.\nDo they not think that they will be called to account? For a mighty day. A Day when all people will stand before the Lord of the Worlds?”, (Qur’an, 83: 1-6).  She mentioned another verse wherein Allah says, “So give full measure and full weight and nor withhold from the people the things that are their due; and do no mischief on the earth after it has been set in order. That will be better for you, if ye are believers,” (Qur’an, 7: 85).",
  "retrievedAt": "2025-08-11T14:36:23.337Z"
}
