{
  "title": "Nation to bury politics of loot, subservience on March 27: PM",
  "link": "https://www.app.com.pk/national/nation-to-bury-politics-of-loot-subservience-on-march-27-pm/",
  "date_published": "2022-03-25T12:37:00.000Z",
  "source": "APP",
  "content": "MANSEHRA, Mar 25 (APP):Prime Minister Imran Khan Friday said the nation would bury the politics of loot, plunder and subservience on March 27 in Islamabad, and build a corruption-free and sovereign New Pakistan.\nThe prime minister, addressing a huge public gathering here, said on the “coffin” of the politics of three stooges, the people would build the New Pakistan with reformed systems transforming the country into a great nation.\n“Come out for the sake of youth, your children and next generations. Come out to tell the three stooges that the whole nation stood by truth,” he told the charged gathering holding flags of Pakistan Tehreek-e-Insaf (PTI).\nHe said the sole objective of the opposition’s no-confidence motion was to seek the withdrawal of corruption cases against their corrupt leaders, but they would bite the dust. It would be the biggest treason if he pardoned them, he added.\nHe thanked the people of Mansehra, Railways Minister Azam Swati, Member of the National Assembly Saleh Muhamamd and provincial assembly members for arranging the huge public gathering.\nHe said being the country’s future, the youth should choose between good and evil on March 27, referring to the PTI’s public meeting scheduled on the day at the Parade Ground of Islamabad.\nThe prime minister said an illicit trade of loyalties was going on in Islamabad where the parliamentarians were being offered Rs 200-250 million each to buy their loyalties in support of the no-confidence motion.\n“Will these three stooges succeed?” the prime minister questioned the gathering, which shouted “No”.\nHe said by issuing statements in support of the European Union and against his categorical stance of “Absolutely Not”, Shehbaz Sharif was all set to become the prime minister, but he would face disappointment as days of the Sharifs’ corruption were gone.\nHe paid tribute to MNA Saleh Muhammad for rejecting the opposition’s offer, proving himself a man of faith and trust.\nImran Khan said it was his government which spearheaded the Muslim world at the United Nations to adopt a resolution for the designation of March 15 as an International Day to Combat Islamophobia.\nAs the people chanted “diesel-diesel”, the prime minister questioned why Maulana Fazlur Rehman , who had been doing politics in name of religion for the last three decades, could not move such a resolution.\nHe said the West used to hurt the sentiments of 1.5 billion Muslims in the garb of freedom of speech, and hoped that the UN resolution would bring an end to that practice.\nHe told the gathering that Pakistan would rise as a great nation and the Green Passport would earn respect if it truly followed the principles of Madina State, including justice, public welfare and sovereignty.\nCiting the government’s welfare initiatives like Health Card, Ehsaas Cash Assistance, subsidy, anti-stunting programmes, and interest-free housing and business loans, the prime minister said the government had put Pakistan on the course to replicate the Madina Welfare State. Pakistan would emerge as an example particularly among the Muslim world, he added.\nHe said the politicians having riches abroad could never raise a voice against other countries.\nImran Khan said despite Pakistan’s support to the US-led war against terrorism and sacrificing around 80,000 lives, the United States launched 400 drone attacks in Pakistan.\n“Two of these three stooges were in the government at that time. The same country, getting our support for its war, was attacking us in return. There is no such example in the world. But the money-hungry leaders never condemned it,” he said.\nHe said after assuming the office, he decided that Pakistan would never bow before any other country. “We will remain friendly to every country, including India if it reverses its unilateral action of August 5, 2019 in the IIOJK (Indian Illegally Occupied Jammu & Kashmir).\n“We will not let Pakistan bow before anyone. It was made in the name of Islam. Bowing before anyone except Allah is polytheism,” he remarked.\nThe prime minister said Allah Almighty had asked the believers to support the truth against the evil and never asked to stay neutral.\nBut unfortunately, he said “Our society is not following Amr Bil Maroof, rather the Western society is doing it, including their institutions and media.”\nHe said in Pakistan, the one who plundered billions from the national kitty, transferred billions to their servants’ accounts and fled abroad, was still considered a leader. Had it happened in the West, his own party would have deserted him, what to talk of the media, he added.\nHe said despite telling lies before the court and producing forged documents like the Qatari letter, they were still called leaders, which was against the Islamic teachings too.\nHe said contrary to the opposition’s claims, his government performed its best during the last three and a half years, and achieved record exports, tax collection,  five bumper crops, textile and IT (Information Technology) industry’s growth.\nHe said consequent to the negotiations, the government convinced a multinational company to invest $10 billion in Balochistan, which would change the fate.\nHe said despite constructing roads with double stretch comparing the previous regimes, the incumbent government saved Rs 1,000 billion from the road projects. The government would save Rs 710 billion in next 10 years from the renegotiation of power and gas contracts signed by the previous government.\nRailways Minister Azam Swati said the looters stood against Imran Khan as they could not digest the improved national economy and enhanced stature of Pakistan. Another reason behind the opposition’s movement was that the prime minister had closed down doors to their corruption, he added.\nHe said a sea of people would turn up at the historic gathering in Islamabad on March 27 and truth would surely prevail.\nHe said mega development projects were underway in Mansehra, including clean drinking water and medical college, besides the compensation being paid to the affected people of Sukki Kinari Canal project.\nKhyber Pakhtunkhwa Chief Minister Mahmood Khan said the KP MPAs stood with their leader and would never sell their loyalties.\nHe also urged the people to participate in the March 27 historic gathering.\nMNA Saleh Muhammad assured that the people of Mansehra always stood by Imran Khan and would continue to supporting him.\nHe said Imran Khan was contesting the case of whole Muslim world, which no leader could ever do in the past.",
  "retrievedAt": "2025-08-11T14:36:21.505Z"
}
