{
  "title": "India accused of war crimes in IIOJK",
  "link": "https://www.app.com.pk/national/india-accused-of-war-crimes-in-iiojk/",
  "date_published": "2022-08-24T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):The dossier titled ‘India Silencing Journalism and Human Rights in Kashmir’ launched on Wednesday is documentation of war crimes perpetrated by occupation authorities in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nWhatever was happening in the IIOJK was in fact the Indian version of 21st century Gestapo, experts said at the launch of dossier under the auspices of Legal Forum for Kashmir (LFK) and StokeWhite Investigations unit of the United Kingdom.\nThe investigative report draws attention to India’s counterinsurgency strategy in silencing journalists and human rights defenders, who are considered as the last line of ‘defence’ for basic human rights protections in the IIOJK.\nInvestigations by SWI unit and LFK have uncovered the names of officers responsible for the disruption and detention of journalists and human rights defenders in the IIOJK, which will be subject to a broader legal submission. The Indian military and police, in sum, have been instructed by the government with the responsibility of commanding and directing the profiling of journalists and human rights defenders.\nLFK and SWI-unit have documented cases of human rights lawyers and practitioners being subject to home/office raids, disruption of normal work flow, and arrest while on fieldwork or malicious confiscation of travel documents to prevent legitimate journalism or human rights work.\n“We saw, only, in 2019, J&K experienced heightened disconnection of high-speed internet, including of mobile phone signal infrastructure for 18 months. In 2020, India restricted the internet some 109 times,” the dossier highlighted.\nAccording to the findings, Tahir Ashraf Bhatti is the head of the Counter Insurgent Unit, where he summoned many journalists and harassed them for purely reporting on events in held Kashmir.\nThe current head of the cyber cell is Syed Sleet Shah, who recently was recruiting “serious candidates” for a special cyber project via her personal twitter account.\nThis has become a norm and many social media users in Kashmir has stopped using their social media and even if they are using, they are absolutely silent in matters of politics and political changes happening in the valley.\nThe speakers at the launching press conference included LFK Executive Director Advocate Nasir Qadri, Senator Mushahid Hussain Syed, APHC Convenor Mehmood Ahmed Saghar, Ms Mushal Mullick, KIIR Director Altaf Hussain Wani, and IDDS Director Dr Waleed Rasool.\nBesides the media fraternity, All Parties Hurriyat Conference (APHC) leadership including Shaikh Yaqoob, Imtiaz Ahmad Wani, Mushtaq Ahmad Bhat, Zahid Ashraf, Zahid Safi and Mukhtar Ahmad Baba were also present.\nNasir Qadri, in his remarks, said the report launched today was a testimony-based depicting how India was silencing the journalists and human rights defenders in the IIOJK.\n“The report includes testimonies of renowned human rights defenders Khurram Parvez and Ahsan Untoo. The latter’s testimony has already been shared with the Metropolitan War Crimes Unit under Universal Jurisdiction in the UK,” he added.\nSenator Mushahid commended the LFK and the SWI unit for documentation of Indian war crimes in the IIOJK. Indian pogrom in the IIOJK, he said, was on lines with the Israeli unlawful actions against Palestinians.\nHe said the Kashmiri human rights activist Khurram Parvez’s only crime was to speak truth against despotic powers. Despite being a peaceful activist, he was falsefully accused of abetting terrorism.\n“Whatever is happening in Kashmir is the Indian version of Gestapo in 21st century which brutalizes and eliminates any voices that speak truth,” he remarked.\nQuoting Arundhati Rai, Mushahid said an architecture of fascism was being erected in India and RSS (Rashtriya Swayamsevak Sangh) was the only state in India right now.\nAPHC Convenor Mehmood Ahmed Saghar condemned India’s highhandedness against journalists and human rights defenders in the IIOJK. He highlighted the plight of Kashmiri prisoners, who included resistance leaders, journalists, and human rights defenders.\nHe urged Pakistan to up the ante and take up the cases of Kashmiris being arbitrarily detained by India under black laws at international forums for their early release.\nMs Mushal Mullick, wife of incarcerated Kashmiri leader Yasin Malik, lauded the LFK and the StokeWhite for publishing a joint report on Indian excesses against journalists and human rights defenders.\nTerming India “a devil of the time”, she urged that all the Indians human rights violations in the IIOJK must be documented and the perpetrators needed to be held accountable. She requested the Pakistani media to focus on research-based and evidence-based documentation of human rights violations in the held J&K.\nShe said the Kashmiri journalists and human rights defenders continued to be intimidated, and arbitrarily detained under black colonial laws. She also expressed willingness to present testimony against India under universal jurisdiction.\nKashmir Institute of International Relations (KIIR) Director Altaf Hussain Wani highlighted the importance of reports documenting India’s war crimes in held Kashmir. All Kashmiri resistance political leaders were human rights defenders as they strived for the rights of Kashmiri people, he added.\nHe said the UN Rapporteur’s tweet condemning the detention of Khurram Parvez was a slap on the face of India’s fscist regime.\nIDDS Director Dr Waleed Rasool said the introduction of legal warfare or lawfare dimension was in itself a remarkable contribution in the resistance struggle.\nHe highlighted that the media was significant in communicating the higher echelons of power in the world about happenings in the IIOJK. He also stressed the need to document India’s atrocity crimes by gathering data from the ground in the IIOJK itself and shape it so as to apprise the international community of Indian excesses.\nElaborating the key points, Advocate Nasir Qadri said according to the CPJ (Committee to Protect Journalists), the Kashmiri media had reached a breaking point, where journalists had begun to doubt their career choice.\n“Many journalists, who have faced the heat, have either switched to work as public relations executives or have become academics. Some have gone abroad to study. The fact is that even after they quit journalism, the authorities do not spare them.”\n“They can just pick up a line or a paragraph from a story that appeared a decade ago and summon him or her,” he said while quoting a Srinagar-based reporter as saying.\nHe said it appeared that the Indian authorities were running a strategy to disrupt, detain and punish those engaging in reasonable journalism and human rights advocacy, particularly against those who had the capability to document rights violations and report newsworthy incidents to the global arena.\n“In view of this, the Indian authorities must recognize the work of journalists and human rights defenders. There is need of urgent review of the use of UAPA /PSA to align its laws with India’s obligations under international law, particularly the international human rights law,” he added.\n“Halting India’s disingenuous application of counter-terrorism is urgently required. It must be questioned, even if a state is running a censorship strategy, why there is a preference for using a counter terrorism framework to disrupt, detain and punish media and human rights professionals? Such a strategy is questionable at best and triggers many legal questions over the motives of such a security law,” he concluded.",
  "retrievedAt": "2025-08-11T15:27:10.187Z"
}
