{
  "title": "President stresses need for improved first-aid, mental healthcare facilities",
  "link": "https://www.app.com.pk/national/president-stresses-need-for-improved-first-aid-mental-healthcare-facilities/",
  "date_published": "2022-08-24T12:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): President Dr Arif Alvi on Wednesday expressed concern over the shortage of trained human resources capable of providing first-aid facilities and health services to the persons affected by accidents, floods and other natural disasters.\nHe said that health-related institutions and relevant stakeholders should consider incorporating boy scouts and girls guides in the emergency health care system by providing them comprehensive training to provide timely first-aid in emergencies to the affectees around the country.\nThe president expressed these views while chairing a meeting of the Senate of the Health Services Academy (HSA), Islamabad, at Aiwan-e-Sadr. The members of the HSA Senate and senior officials of HSA attended the meeting.\nThe president emphasized the need to establish mental healthcare infrastructure in Pakistan, adding that the existing mental healthcare facilities should be strengthened on an urgent basis.\nHe highlighted that the incidence of mental diseases in Pakistan was 24 percent,  whereas there were only 2,000 experts in this field.\n“Unfortunately, people who suffer from mental health diseases are prone to violence and irrational behaviours and in extreme cases commit suicide or cause serious injuries to others, including their loved ones,” the president said.\nHe regretted that the incidence of suicide in Gilgit-Baltistan was increasing and there was a need to identify the rootcause of this serious behaviour and to set up an effective healthcare system to address psychological and mental health issues faced by the people of the area.\nHe advised the Ministry of National Health Services Regulations and Coordination to provide leadership to conceive an action plan within three months in consultations with all relevant stakeholders to address this very important national issue.\nThe president advised that there was an urgent need to expeditiously launch an Artificial Intelligence-based mobile app and web-based helpline to provide immediate counselling to persons seeking mental health-related counselling.\nHe underlined that there was an acute shortage of 700,000 nurses in the country which had strained the country’s healthcare system, both in the public and private sectors.\nHe also stressed launch of two-year high-quality training courses for nurses and paramedical staff to meet the pressing demand of our healthcare system.\nHe also encouraged private healthcare institutions to create facilities for training of nurses and para-medical staff to contribute to this end.\nThe president advised the management of the Health Services Academy to create an exclusive set-up to keep its accounting and books transparent, verifiable and credible to seek foreign funding from donors to finance its operational and academic needs.\nHe said as per the demand of the market the universities and institutions should also offer Associate Degree Courses of two years in various disciplines to expeditiously meet the shortage of skilled human resources faced by the private sector.\nHe remarked that the universities should offer courses through online and hybrid modes of learning to increase the number of graduates and to bring more youth into the education system of the country.",
  "retrievedAt": "2025-08-11T15:27:14.697Z"
}
