{
  "title": "Iqbal distributes certificates to NADRA’s software engineers",
  "link": "https://www.app.com.pk/national/iqbal-distributes-certificates-to-nadras-software-engineers/",
  "date_published": "2022-08-24T11:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):Federal Minister for Planning and Development  Professor Ahsan Iqbal here on Wednesday distributed certificates among National Database and Registration Authority’s (NADRA)  software engineers for developing Digital Census Turnkey Solution in shortest time.\nChairman NADRA Tariq Malik briefed the minister on recent citizen centric digital interventions rolled out to complement the initiatives of the federal government.\nDuring the briefing, he highlighted the special efforts of the authority to extend its registration services at the door steps of citizens through 771 Registration Centers and deployment of 222 Mobile Registration Vans (MRVs) across the country.\nThe chairman also briefed the minister that NADRA was all poised to carry out the project on Civil Registration and Vital Statistics (CRVS) in joint collaboration with the Ministry of Planning, Development and Special Initiatives.\nThe minister expressed interest in NADRA’s record for registration of birth and death at health facilities across the country.\nDuring the visit, the minister was also informed that during the past one year, the NADRA had enhanced cards printing capacity from 60 thousand to 125 thousands per day.\nThe chairman NADRA also apprised the minister about the security features of smart card which was laden with 36 security features making Pakistani ID card the most secure and unforged.\nMeanwhile, the minister also visited NADRA high-tech Operations Room where he was briefed about the Centralized Operations Management System.\nAhsan Iqbal lauded the efforts of the chairman for introducing international standards and world’s best practices in the NADRA, setting a new benchmark for the world to look for.\nHe distributed the Certificates of Excellence among 24 software engineers.\nThe minister appreciated the efforts of all software engineers who worked day and night in developing the solution for the country’s first ever digital census.\nThe pilot phase of the digital census was successfully carried out from July 21 to August 3.",
  "retrievedAt": "2025-08-11T15:27:14.999Z"
}
