{
  "title": "PM meets Qatari Amir; thanks for QIA’s readiness to invest US $ 3 billion in Pakistan",
  "link": "https://www.app.com.pk/national/pm-meets-qatari-amir-thanks-for-qias-readiness-to-invest-us-3-billion-in-pakistan/",
  "date_published": "2022-08-24T09:54:00.000Z",
  "source": "APP",
  "content": "DOHA, Qatar, Aug 24 (APP): Prime Minister Muhammad Shehbaz Sharif and Amir of the State of Qatar Sheikh Tamim bin Hamad Al Thani Wednesday expressed satisfaction on the upward trajectory of bilateral relations and agreed to work together to further strengthen cooperation in all areas of mutual interest.\nThe two leaders, who met here at the Diwan-e-Amiri, during their extensive consultations, exchanged views on bilateral, regional and international issues.\nThe Prime Minister was accompanied by a high-level delegation including Cabinet Ministers and senior members.\nUpon arrival at the Diwan-e-Amiri, the Prime Minister was welcomed by the Amir in an official ceremony and presented a Guard of Honour.\nThe two leaders then held delegation-level consultations, which were followed by a lunch banquet hosted by the Amir in the honour of Prime Minister Shehbaz Sharif and his entourage.\nThe two sides agreed inter alia to strengthen institutional engagement to increase bilateral trade; deepen collaboration in the agriculture and food sectors; boost cooperation in the fields of energy; encourage and facilitate Qatar’s investments in Pakistan’s renewable energy, tourism and hospitality sectors; provide more opportunities to Pakistanis interested in working in Qatar; and expand cooperation in defence, aviation and maritime domains.\nThe Amir reassured the Prime Minister of Qatar’s commitment to forge a stronger economic partnership with Pakistan.\nThe Prime Minister thanked the Amir for the Qatar Investment Authority (QIA)’s readiness to invest US $ 3 billion in various commercial and investment sectors in Pakistan.\nLauding Qatar’s remarkable economic transformation, the Prime Minister congratulated the Qatari leadership for its visionary and forward-looking approach and wished the Qatari people more success in the future.\nRecalling Pakistan’s long-term partnership with Qatar in the field of LNG cooperation, he thanked the Amir for Qatar’s vital support in meeting Pakistan’s energy needs. The two sides also explored new avenues for mutually beneficial cooperation in the energy sector.\nThe Prime Minister stressed that the Pakistanis working and residing in Qatar were not only a source of strength for the economic progress of both countries but also a testament to the value of people-to-people linkages.\nHe hoped that Qatar’s rapid economic growth would present even greater opportunities for Pakistanis in the future.\nThe Prime Minister appreciated the extensive arrangements made by the Government of Qatar for hosting the FIFA World Cup 2022.\nHe assured the Qatari leadership of Pakistan’s support for the successful organization of the mega event.\nAs the two leaders also exchanged views on the developments in the region, the Prime Minister appreciated Qatar for its long-standing and continuing efforts to promote peace and reconciliation in Afghanistan.\nThe two sides agreed to work together to help address the grave humanitarian and economic crises confronting the Afghan people, stressing that the situation warranted the international community’s scaled up assistance.\nThe Prime Minister highlighted the grave human rights situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) and underscored the importance of a peaceful resolution of the Jammu and Kashmir dispute for sustainable peace, security and prosperity in South Asia.\nThe Amir of Qatar congratulated the Prime Minister on assumption of office and wished him full success. He also conveyed his best wishes for the continued progress and prosperity of the people of Pakistan.\nThe Amir appreciated the important contribution of Pakistanis in the development of Qatar, and shared Qatar’s resolve to provide enhanced employment opportunities for Pakistanis, in line with the Qatar Vision 2030.\nThe two leaders agreed on the importance of frequent high-level exchanges for maintaining the present momentum in bilateral cooperation.\nThe Prime Minister extended a cordial invitation to the Amir to visit Pakistan at his earliest convenience.\nPakistan and Qatar enjoy long-standing, fraternal relations marked by shared faith, mutual trust, and close cooperation. This is the first visit of Prime Minister Muhammad Shehbaz Sharif to Qatar since assuming office in April 2022.\nMeanwhile, the Prime Minister in a tweet posted on his social media account said he held a very productive meeting with the Amir of Qatar.\nHe said that the sides decided to take their excellent bilateral relations to the next level of bilateral engagement.\nThe Prime Minister further said that he was grateful to the Amir for Qatar’s investment of $ 3 billion in various sectors of Pakistan’s economy.",
  "retrievedAt": "2025-08-11T15:27:17.233Z"
}
