{
  "title": "SC sets aside Registrar Office’s objections on overseas Pakistanis voting rights case",
  "link": "https://www.app.com.pk/national/sc-sets-aside-registrar-offices-objections-on-overseas-pakistanis-voting-rights-case/",
  "date_published": "2022-08-24T15:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP): The Supreme Court on Wednesday set aside objections on Pakistan Tehreek-e-Insaf Chairman Imran Khan’s overseas Pakistanis voting rights plea and ordered the Registrar’s Office to fix it case for early hearing before an appropriate bench.\nA two-member SC bench comprising Justice Ijaz Ul Ahsan and Justice Sayyed Mazahar Ali Akbar Naqvi heard the case.\nWhile hearing former interior minister Sheikh Rasheed’s petition against ending the right of overseas Pakistanis to vote, the court observed that the expatriates must be facilitated on priority as they brought in foreign exchange to the country.\nThe counsel for the petitioner said apparently, the expatriates’ right to vote was abolished due to the concerns of Election Commission of Pakistan.\nJustice Ijaz while referencing to the claims of the right being curtailed due to fear of rigging, said fake votes could easily be polled while voting from within the country as well. There was a law against fake votes and rigging, he added.\nHe asked whether a motorway could be closed in the event of an accident. He questioned whether the elections should be stopped due to concerns of rigging.\nHe asked why the ECP did not use its powers to stop rigging. The court could review the commission’s measures to prevent fraud, he observed, adding the ECP’s concerns must be addressed.\nJustice Ijaz said it was not right to eliminate the overseas vote instead of addressing the concerns in that regard.\nThe bench observed that the overseas Pakistanis’ right to vote appeared to be a matter of public interest and a fundamental human right.\nJustice Ijaz said that the court had delivered several decisions related to the rights of expats.\nJustice Naqvi questioned whether the present assembly was empowered enough to make amendments regarding the fundamental rights of the expats. He observed that there were insufficient number of members in the National Assembly.\nJustice Ijaz said a billion dollars was being demanded from financial institutions and other countries, while overseas Pakistanis sent home $30 billion annually.\nThe expatriates were told that they should fly back to the country if they wanted to vote, he remarked.\nJustice Naqvi observed that the overseas Pakistanis sent home $30 billion without any conditions. As the whole world used modern devices for every thing, then why the same could not be used for voting, he asked.",
  "retrievedAt": "2025-08-11T15:27:11.239Z"
}
