{
  "title": "President stresses economic diplomacy to boost trade",
  "link": "https://www.app.com.pk/national/president-stresses-economic-diplomacy-to-boost-trade/",
  "date_published": "2023-06-20T09:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): President Dr Arif Alvi on Tuesday underscored the need to focus on economic and trade diplomacy to enhance the country’s exports.\nHe added that increasing exports and foreign investment could help Pakistan overcome its economic challenges.\nThe President expressed these views while talking to Pakistan’s Ambassador-designate to Denmark and High-Commissioner-designate to Rwanda, who separately called on him, here at the Aiwan-e-Sadr.\nTalking to Ambassador-designate to Denmark, Shoaib Sarwar, the President urged him to especially focus on economic diplomacy initiatives to boost the country’s exports.\nHe highlighted that the dairy and agriculture sector were important areas where Danish companies could be invited to invest in Pakistan.\nHe said that Information Technology was also another important area for enhanced cooperation where Pakistan’s tech companies could offer services and solutions to Danish companies.\nHe also asked the newly-appointed envoy to work towards inviting more wind power companies from Denmark to invest in Pakistan’s energy sector, besides further expanding collaborations in the renewable energy sector.\nHe expressed the hope that recent exchanges at the ministerial level would further strengthen the mutually beneficial ties between the two countries.\nTalking to Pakistan’s High Commissioner-designate to Rwanda, Naeem Ullah Khan, the President highlighted that Pakistan attached great importance to its bilateral ties with Rwanda and both countries enjoyed cordial relations.\nHe stated that there was great potential for cooperation in agriculture, food security and human resource development, which should be fully tapped.\nHe asked the envoy to further improve trade and commercial relations by facilitating importers and exporters, besides reaching out to Rwandan businessmen to explore the Pakistani market.\nThe president also urged the envoys to highlight the atrocities and human rights violations being committed by India in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) as well as persecution of minorities, particularly Muslims and Christians.",
  "retrievedAt": "2025-08-11T08:45:15.035Z"
}
