{
  "title": "Birth anniversary of legendary actor, orator, author, broadcaster Zia Mohyeddin observed",
  "link": "https://www.app.com.pk/national/birth-anniversary-of-legendary-actor-orator-authorbroadcaster-zia-mohyeddin-observed/",
  "date_published": "2023-06-20T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): The birth anniversary of legendary actor,orator, author and broadcaster Zia Mohyeddin was observed on Tuesday.\nMohyeddin was born in Lylallpur (now Faisalabad) on June 20, 1931.\nHe studied at the Royal Academy of Dramatic Art in London in the early 1950s.\nAfter theater roles in “Long Day’s Journey into Night” and “Julius Caesar,” Mohyeddin made his West End debut in “A Passage to India” in 1960, where he originated the role of Dr. Aziz.\nThe actor featured in David Lean’s “Lawrence of Arabia” (1962), playing the role of Arab guide Tafas.\nRoles in Alexander Mackendrick’s “Sammy Going South” (1963), Fred Zinnemann’s “Behold a Pale Horse” (1964), Basil Dearden’s “Khartoum” (1966), Ralph Thomas’ “Deadlier Than the Male” (1966), Tony Richardson’s “The Sailor from Gibraltar” (1967), Freddie Francis’ “They Came from Beyond Space” (1967) and Peter Hall’s “Work Is a Four-Letter Word” (1968) followed.\nMohyeddin returned to Pakistan in the late 1960s and hosted the immensely popular television talk show, “The Zia Mohyeddin Show” on PTV.\nHe returned to the U.K. in the late 1970s and produced multicultural program “Here and Now” (1986 – 1989) for Central Television (now ITV).\nThe actor’s later roles included landmark Granada Television series “The Jewel in the Crown” (1984), Ken McMullen’s “Partition” (1987) and Jamil Dehlavi’s “Immaculate Conception” (1992).\nMohyeddin was also known as one of the world’s foremost reciters of Urdu-language prose and poetry.\nIn 2012, Mohyeddin was accorded the Hilal-e-Imtiaz, the second-highest civilian honor in Pakistan.\nHe died on February 13, 2023 in Karachi at the age of 91.",
  "retrievedAt": "2025-08-11T08:45:14.889Z"
}
