{
  "title": "Pakistan, Russia agree to further diversify bilateral ties",
  "link": "https://www.app.com.pk/national/pakistan-russia-agree-to-further-diversify-bilateral-ties/",
  "date_published": "2023-06-20T13:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Pakistan and Russian sides on Tuesday reiterated their strong desire to deepen and diversify bilateral relations based on the principles of mutual understanding, trust and cooperation.\nThe fifth round of Pakistan-Russia Bilateral Political Consultations was held here.\nForeign Secretary Dr. Asad Majeed Khan and Russia’s Deputy Foreign Minister Andrey Rudenko, led their respective sides, Foreign Spokesperson said in a press release.\nSpecial Representative on Afghanistan, Ambassador Zamir Kabulov was also part of the Russian delegation.\nThe two sides engaged in comprehensive and productive discussions to further strengthen bilateral cooperation and to deepen understanding on regional and global issues of mutual interest.\n“The talks encompassed a wide range of topics including political, economic, defence, energy and people-to-people contacts,” the spokesperson said.\nThe two sides also expressed satisfaction at the upward trajectory of cooperation in the field of energy and agreed to expand cooperation in higher education, culture and science and technology.\nIn the realm of security cooperation, the delegations reaffirmed their commitment to cooperate in combating terrorism, drug trafficking and organized crime.\nThe two delegations agreed to enhance cooperation in multilateral forums and exchanged views on regional issues, including the situation in Afghanistan, the Middle East and South Asia.\nAgreeing that the dividends of peace in Afghanistan would be beneficial for the entire region, they reaffirmed support for efforts for sustainable peace, stability and continued humanitarian assistance to Afghanistan.\nThe consultations provided an opportunity to review the trajectory of Pakistan-Russia relations and to explore new areas of cooperation particularly in the context of commemorating the 75th anniversary of Pakistan-Russia diplomatic relations this year.\nThe next round of Pakistan- Russia Bilateral Political Consultations would be held in Moscow on mutually convenient dates, the press release further added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T08:45:05.879Z"
}
