{
  "title": "Modi govt’s belligerent policies have put regional & int’l peace at risk: Mushaal",
  "link": "https://www.app.com.pk/national/modi-govts-belligerent-policies-have-put-regional-intl-peace-at-risk-mushaal/",
  "date_published": "2023-04-04T17:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP): Chairperson of Peace and Culture Organization, Mushaal Hussein Mullick, Tuesday said the fascist Indian government’s belligerent policies had put regional and international peace and security at risk.\nMushaal, who is the wife of jailed Hurriyat leader Yasin Malik, said in a statement that the people of scenic Jammu & Kashmir valley continued to face the worst discrimination and injustice at the hands of New Delhi-led apartheid regime, which had made their lives hell for resisting the Indian unlawful subjugation.\nShe stated that the Narndra Modi-led fascist government was using all brutal tactics to crush the ongoing freedom struggle in the Indian Illegally Occupied Jammu & Kashmir (IIOJK). However, Indians would not be able to defeat the Kashmiris’ spirit for freedom come what may, she added.\nShe said Modi must remember that bullets and guns could never suppress the Kashmiris’ aspirations despite witnessing oppression and bloodshed on a daily basis for over seven decades.\nMushaal said India was treading on the path of Nazi Germany instead of paving the way for the peaceful settlement of the Kashmir dispute as per the United Nations resolutions.\nShe said the gravity of the situation could be judged that over 18,745 Kashmiris had been detained and over 2,330 tortured since Article 370 revocation in the IIOJK. The Modi regime was using every kind of oppression to subdue the Kashmiris’ freedom struggle and created an atmosphere of fear and terror to advance its colonization agenda by attaching lands and properties of Hurriyat leaders and activists.\nIndia was trampling all the principles of humanity in the occupied valley, she added.\nMushaal said the eviction and demolition drive was meant to change Kashmir’s history, demography, culture and religion, but the brave people of Kashmir would foil all such attempts.\nShe predicted that India would be ultimately disintegrated due to the Hindutva-driven policies of Modi regime, which had created fissures within the various communities living in the country.\nShe urged the world community, the United Nations and human right organizations to force the Indian fascist government to resolve the Kashmir dispute as per the UN resolutions and aspirations of the people of the valley.",
  "retrievedAt": "2025-08-11T08:12:53.666Z"
}
