{
  "title": "Imran was brought to power through ‘rigging’: Bilawal Bhutto",
  "link": "https://www.app.com.pk/national/imran-was-brought-to-power-through-rigging-bilawal-bhutto/",
  "date_published": "2023-04-04T18:09:00.000Z",
  "source": "APP",
  "content": "LARKANA, Apr 04 (APP): The Pakistan Peoples Party (PPP) Chairman and Foreign Minister Bilawal Bhutto Zardari on Tuesday said that Imran Khan was brought to power once by rigging, but he would not be allowed to get power through the back door for the second time.\nHe was addressing a gathering held on the 44th martyrdom anniversary of the country’s first elected Prime Minister and Founder Chairman of PPP Shaheed Zulfikar Ali Bhutto, at Bhutto House Naudero, here on Tuesday evening.\nHe said that former President Asif Ali Zardari had sent a Presidential Reference to the Supreme Court regarding the judicial murder of Shaheed Zulfikar Ali Bhutto, but it had not been taken for hearing yet.\nHe said the constitution made by him was repeatedly violated, the reforms introduced by him were declared unconstitutional and the rights given to the backward classes including women were also revoked, he pointed out.\nBilawal Bhutto Zardari, giving a historical reference, said that after the seizure of power by dictator Ziaul Haq and another dictator Pervez Musharraf, the Supreme Court (SC) was asked whether these actions were legitimate, then the superior court had declared them “legitimate”.\nHe said that after the restoration of democracy in 1988, the government established by Shaheed Mohtarma Benazir Bhutto was allowed to run for just 18 months and the government was dissolved on the basis of a newspaper column, but this action was endorsed by the SC.\nHe also said that even in 1996, the government of Shaheed Mohtarma Benazir Bhutto was overthrown and the judiciary did not restore it.\nReferring to the murder case of Shaheed Mir Murtaza Bhutto, he said: “The murder also happened to a member of our family and we were blamed for that.”\nThe Chairman PPP said that the SC not endorsed Musharraf’s seizure of power, but also allowed him to amend the constitution, adding that former Chief Justice Iftikhar Chaudhary was also part of the bench that approved Musharraf’s coup.\nHe said that President Asif Ali Zardari was unjustly imprisoned until 2005 during Musharraf-regime, adding that General (Retd) Musharraf had once apologized for keeping President Asif Ali Zardari in jail, but this was taken as NRO and a hue and cry was raised unnecessarily across the country and Justice Chaudhry declared it null and void.\n“Chaudhry Iftikhar’s action was extremely ridiculous, who after restoration to the post, avoided even to look at the General (retd) Musharraf, who actually ousted him, rather removed the elected Prime Minister Yusuf Raza Gilani in order not to violate the constitution,” he added.\nForeign Minister Bilawal Bhutto Zardari said that since the time of “former Chief Justice Iftikhar Chaudhary dictatorship has been going on in the judiciary, and a one-man show is going on. If we do not accept dictatorship in Parliament, then we cannot accept dictatorship in judiciary,” he added.\nHe said that during the Imran Khan regime, ailing Faryal Talpur was dragged from the hospital on the night of Eid and locked up in Rawalpindi jail, but no one bothered about the law and rights at that time.\nBilawal Bhutto Zardari said that if a Chief Justice wants to build a dam, he can collect funds for it. “Former Chief Justice Gulzar Ahmed was fond of seeing the Karachi of 1950s, and the houses of the poor were demolished in the name of encroachment,” he claimed.\nHe emphasized that in order to stop this constitutional crisis, we demanded that the Supreme Court should form a larger bench, in which all the judges are part of it.\nHe said that we want the mistakes made in the past not to be repeated, adding that we want “Chief Justice Umar Ata Bandial to be remembered as the judge who saved Pakistan.”\nHe warned that if this crisis continues, no one would come to power, rather, the people of Pakistan would have to bear the consequences of such situations.“We will try to bury the politics of hatred and division, and this is our message for the whole of Pakistan that neither yours nor mine, Pakistan belongs to all of us,” he concluded.\nAseefa Bhutto Zardari, President PPP Sindh Chapter Senator Nisar Ahmed Khuhro, Sindh Chief Minister Syed Murad Ali Shah, MNA Khursheed Ahmed Junejo, Senator Sassui Palejo, MNA Naseebaan Channa, Provincial Ministers, elected representatives as well as the leaders and workers of the Pakistan Peoples Party (PPP) also present on the occasion.",
  "retrievedAt": "2025-08-11T08:12:51.391Z"
}
