{
  "title": "‘Immoral syllabus’ not acceptable at all costs: Rana Tanveer",
  "link": "https://www.app.com.pk/national/immoral-syllabus-not-acceptable-at-all-costs-rana-tanveer/",
  "date_published": "2023-04-04T18:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP): Minister for Education and Professional Training Rana Tanveer Hussain on Tuesday said immoral syllabus was not acceptable at all costs as it was against our social, cultural and religious norms.\nResponding to a calling attention notice in Senate, he said the ministry would serve a memo to the Cambridge University Press directing to remove the chapter in question otherwise; it would ban the book being studies in O-Level syllabus from the course book ‘Sociology’ under the chapter ‘The Family’ with sub-heading ‘Same Sex Family’.\nThe minister assured that its report would be shared with this august house after taking all cordal formalities.\nHe said he, with the help of all stakeholders, designed a ‘national curricula’ in a bid to remove deprivation among the students of public and private education institutions.\nHe further said in many a country, the Federal Board was being preferred compared to any other advanced country’s syllabus.\nRaising the issue on the floor of the house, Senator Mohsin Aziz said through such obscene material, the minds of our young generation was being polluted.\nBeing a Muslim, it was our moral as well as religious obligation not to provide such education to our children, he said quoting the example of “Qaum-e-Loot and its destruction”.\nHe urged the government to monitor the syllabus being taught to the students, particularly in private education institutions for their proper upbringing and to make them a civilized members of the society.\nMeanwhile, Faisal Saleem Rehman urged the government to ban the book on an immediate basis and cancel the license of the educational institutions where this unethical practice was underway.",
  "retrievedAt": "2025-08-11T08:12:50.141Z"
}
