{
  "title": "NA Opposition, treasury benches equally euologise ZAB on his 44th death anniversary",
  "link": "https://www.app.com.pk/national/na-opposition-treasury-benches-equally-euologise-zab-on-his-44th-death-anniversary/",
  "date_published": "2023-04-04T12:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 04 (APP):The members of the opposition and treasury benches of the National Assembly on Tuesday equally euologised former  prime minister Shaheed Zulfiqar Ali Bhutto on his 44th death anniversary.\nSpeaker National Assembly, Raja Pervez Ashraf while presiding the 51st Session of the lower house said that April 4 was the 44th death anniversary of the founding father of Pakistan Peoples Party (PPP) and creator of the 1973 Constitution of Pakistan.\nHe while showering praise for Bhutto said, “Today is the death anniversary of the great leader who laid the foundation of this building of the Parliament, gave rights to the common man, sacrificed his life for democracy and on this day he was executed.”\nTaking the discussion further, Pakistan Tehreek-e-Insaf (PTI) Member National Assembly (MNA), Noor Alam Khan said, “Today is the day of injustice done to the people and the nation was deprived of the people’s leader. I request you, Speaker to defer the business and only take up this agenda as its an important event.”\nHe said Bhutto united the Muslim Ummah and gave them awareness about their real power of oil being exploited by western nations.\nHe was executed on Section 109 and its unprecedented in the world, he added.\nKhan said Bhutto established the people’s rule and ended the presidential system in the country.\nPakistan Peoples Party Parliamentarians (PPPP) MNA Syed Agha Rafiullah said it was dark in the history of the country when injustice was done to the farmers, serfs, poor by the execution of Zulfiqar Ali Bhutto.\nThere was no justice to the person who formed the Constitution of 1973, and this was the vision of Bhutto that today a worker like him was addressing to the floor of the House, he added.\nPTI, MNA Ahmed Hussain Deharr said April 4 was an historic day when the founder of the Constitution of 1973, and the one who raised his voice for the poor died for the poor.\n“Today is the Oppressed’s Day. I salute the leader who got nuclear power for this country and also to those leaders who made atomic explosions and got CPEC for this country,” he added.\nDeharr said today’s burning issue of the country was that the poor was dying due to inflation and rising poverty due to the International Monetary Fund (IMF) conditions signed by the previous regime.\nHe demanded that the PTI and Pakistan Democratic Movement (PDM) should sit together and sign a charter of economy for 10 years to bring the country out of economic crisis.\nLeader of the Opposition in the National Assembly, MNA Raja Riaz said it was a dark day today as the apex court decision was being coincided with the martyrdom anniversary of Shaheed Zulfiqar Ali Bhutto.\nHe said those who martyred Bhutto tendered apologies to the nation after realizing their guilt. The history would also reckon those judges who made an unpopular ruling today, he added.\n“The Apex Court is the institution that used to plunge the country out of crisis but this time it facilitated a blue-eyed (Imran Khan). The one who destroyed the country in terms of corruption, economy, and every sector,” he added.\nThe popular demand of the entire nation for a full bench was ignored and an egoistic ruling was made, he added.\nPML-N, MNA Sheikh Rohale Asghar said Shaheed Zulfiqar Ali Bhutto did the great task of uniting Muslim Ummah in Lahore and was going to create an Islamic Bank so that Muslim states should not approach western banks for aid and help.\nHe added that this was his crime for which the great powers punished him.\nMQM-P, MNA Salahuddin said Bhutto was a man of abilities and had did the unprecedented task of uniting Muslim countries after convening OIC meeting, and united the Opposition for a consensus-based Constitution.\n“But, I would like to mention that no one can deny Bhutto’s dynamic leadership but he refused to accept the majority of Sheikh Mujeeb ur Rehman during the 1970 General Elections. It is regrettable and therefore his mention in the history will be made in a controversial manner,” he added.\nSpeaker National Assembly, Raja Pervez Ashraf interjected to share historical fact that the total population of East and West Pakistan combined at that time was a 100 million, out of which only 80,000 masses were eligible 40,000 each from East and West Pakistan to cast vote in the elections. However, it was Bhutto who gave right to vote to the rest of the population, he added.PPPP, MNA Nawabzada Iftikhar Ahmed Khan Babar while paying tributes to Shaheed Zulfiqar Ali Bhutto, said, Bhutto had given independent foreign policy. He said that Zulfiqar Ali Bhutto was the father of the atomic bomb and made Pakistan’s defence invincible.\nPTI, MNA Ramesh Kumar Vankwani said that Shaheed Zulfiqar Ali Bhutto had made history by not bowing before the dictator.\nJUI-F, MNA Shahida Akhtar Ali said that the mission of Zulfiqar Ali Bhutto of uniting the Islamic countries would be remembered in history.\nShe said in 1974, the Ahmadis were declared non-Muslim in a constitutional amendment by the government of Pakistan under the leadership of Zulfikar Ali Bhutto was a great achievement.\nBAP, MNA Rubina Irfan said April 4, 1979 will be remembered as a black day in the history of Pakistan.\nShe said that the constitution had been given by the great Leader Zulfikar Ali Bhutto and united the people of the country on one platform.\nPTI, MNA Muhammad Mohsin Khan Leghari said that Zulfiqar Ali Bhutto was a man of principle who sacrificed his life for that but did not bow before the dictator.\nPTI, MNA Malik Nawab Sher Waseer said that Imran Khan had dissolved two assemblies for the satisfaction of his ego. He said that Imran Khan had divided the people of the country.\nPaying tribute to Shaheed Zulfiqar Ali Bhutto he said that Bhutto had given awareness and the right to vote to the people of the country.\nMNA Dr. Zulfiqar Ali Bhatti (PML-N) said that constitution had been violated by dictators in the past but no one dares to discuss it.\nHe suggested constituting a special committee which should ensure legislation for making the parliament strong.\nPML-N, MNA Rao Muhammad Ajmal said that April 4 was the black day in the history of Pakistan.\nThe democratic leaders including Zulfiqar Ali Bhutto, Benazir Bhutto and Nawaz Sharif were targeted in the past, he said adding there was need to strengthen the parliament and ensure unity.\nMQM-P Lawmaker Kishwer Zehra moved a motion to refer the Transplantation of Human Organs and Tissues (Amendment) Bill, 2021 to the join sitting which was passed by the House.",
  "retrievedAt": "2025-08-11T08:12:36.782Z"
}
