{
  "title": "PUC launches ‘negotiation process’ to cool down political temperature in country",
  "link": "https://www.app.com.pk/national/puc-launches-negotiation-process-to-cool-down-political-temperature-in-country/",
  "date_published": "2023-01-18T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): Pakistan Ulema Council (PUC) Chairman Hafiz Muhammad Tahir Mehmood Ashrafi on Wednesday said the council had decided to launch negotiation process to cool down the rising political temperature in the country.\nIn a joint statement along with PUC Secretary General Maulana Asad Zakaria Qasmi, he said keeping in view the deteriorating political situation, it was essential to play the role of a bridge among the political parties in a bid to unite them at one platform for the economic stability and defuse the current political tension in the country.\nAshrafi who is also the Prime Minister’s Special Representative for Interfaith Harmony and Middle East said the council had planned to start a series of meetings with political and religious leaders in the current situation of the country.\nHe said the council delegation would hold meetings with Prime Minister Muhammad Shehbaz Sharif, President Dr Arif Alvi, Jamiat Ulema-e-Islam-Fazl Chief Maulana Fazl-ur-Rehman, Pakistan Peoples Party Parliamentarian President Asif Ali Zardari, Jamaat-e-Islami Chief Siraj-ul-Haq, Maulana Mufti Taqi Usmani, Allama Sajid Naqvi, Pakistan Tehreek-e-Insaf Leader Chaudhry Pervez Elahi and important thinkers and intellectuals.\nHe said the situation of the country required initiation of the negotiation process due to the dissolution of assemblies of two provinces and elections in the 34 constituencies of the National Assembly.\nHe further said the parties elected by the people in local body elections in Karachi should move forward to serve the people through mutual understanding and combined efforts.\nMeanwhile, PUC Chairman Hafiz Muhammad Tahir Mehmood Ashrafi, Allama Abdul Haq Mujahid, Maulana Nauman Hashir, Maulana Muhammad Shafi Qasmi, Maulana Asad Zikria Qasmi, Maulana Asadullah Farooq, Maulana Muhammad Ashfaq Pitafi, Allama Tahir-ul-Hassan, Maulana Tahir Aqeel Awan, Maulana Aziz Akbar Qasmi, Maulana Abubakar Hameed Sabri, Maulana Muhammad Aslam Siddiqui and others strongly condemned the attack on the security forces by the terrorists in Chukab sector, Panjgur district across Pakistan-Iran border.\nThey said the entire nation saluted the Pakistan Army and national security forces for their unprecedented sacrifices from time to time to safeguard the every inch of the borders and dismantle the network of terrorists.They said the Ulema and Mashaykh besides the nation were standing by the Pakistan Army and security forces through thick and thin.\nThey said the neighboring countries should express responsibility and they should not allow their borders to be used against Pakistan and other countries.\nThey urged the quarters concerned to take immediate action against those elements allegedly involved in cross border terrorism in the Pakistani areas and harmed the security agencies and people of the country.",
  "retrievedAt": "2025-08-11T05:45:42.268Z"
}
