{
  "title": "Pakistan, China discuss ways to promote bilateral tourism",
  "link": "https://www.app.com.pk/national/pakistan-china-discuss-ways-to-promote-bilateral-tourism/",
  "date_published": "2023-01-18T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP): A high-level meeting was held here on Wednesday at the China Embassy among Ms.Pang Chunxue, Charge de’ affairs, Chinese Embassy in Pakistan and Awn Chaudhry, Advisor to Prime Minister on Tourism and Sports and Aftab ur Rehman Rana, Managing Director of PTDC to discuss the promotion of bilateral tourism between Pakistan and China.\nThe discussion was held on improving facilitation for the tourists on both sides to enhance people-to-people contact on the occasion of year 2023 which has been declared by both countries to be celebrated as the year of China-Pakistan Year of Tourism Exchange.\nChaudhry conveyed the best wishes to Pang Chunxue, on the occasion of the Chinese New Year starting from 22nd January this year.\nHe said, China and Pakistan’s friendship was everlasting and the two brotherly countries need to enhance cooperation in the tourism sector to increase the flow of tourists from both sides which will greatly be helpful in improving the people-to-people contact between the two countries.\nAftab Rana, MD PTDC especially emphasized the need to promote group tours through the registered tourism operators of both countries to provide a convenient way to enjoy tourist sites through guided group tours.\nHe also recommended the opening of the Khunjrab Pass for tourist traffic as it provides easy access to visitors of both countries. He also shared a brief having various recommendations to promote bilateral tourism with Charge de Affairs.\nMs. Pang Chunxue, highly appreciated the idea of improving people-to-people contact during the year of 2023 and agreed to provide all support and assistance for the promotion of bilateral tourism between China and Pakistan.",
  "retrievedAt": "2025-08-11T05:45:42.579Z"
}
