{
  "title": "HEC offers free courses for faculty, students with Coursera",
  "link": "https://www.app.com.pk/national/hec-offers-free-courses-for-faculty-students-with-coursera/",
  "date_published": "2023-01-18T09:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):The Higher Education Commission (HEC) HEC is offering a free-of-cost facility for students and faculty members of all the public and private sector universities to learn without limits with Coursera.\nAccording to official sources, limited slots are left for 6000+ courses for professional certificates, specializations, and learning tracks from 200+ global institutions.\nThe registration deadline for this opportunity is January 20, 2023.\nFor details, the students are advised to visit: http://dlsei.hec.gov.pk Registration link: https://eservices.hec.gov.pk.The sources further informed that Digital Learning and Skills Enrichment Initiative (DLSEI) is an HEC initiative that intends to provide an opportunity to students and faculty members of Higher Education Institutions (HEIs) to secure Certifications from world-renowned universities, which will enhance their learning capabilities and skills for professional development.\nA verified certificate from a world-renowned online platform can serve as proof for an employer that someone is abreast with cutting-edge tools and skills needed for a competitive career.\nInnovation and technologies are influential ways to change the skills workers need in today’s economy.\nIt’s perceived that up to 85M jobs are to be required by 2025 and governments are facing a significant talent gap to support digital transformation efforts.\nProviding online courses to all students through the world’s best online education provider would help students to provide in-demand skills and learning paths to new jobs for the entire workforce, with content from global thought leaders and experience implementing competitive national learning programmes.\nHEC urges university students, faculty members and alumni of Higher Education Institutes (HEIs) to secure Certifications from world-renowned universities, in order to improve the quality of teaching and learning across the board. The Coursera initiative is one of the steps in this direction.\nIt is strongly recommended that all HEIs may encourage faculty members to effectively utilize the courses available on Coursera to qualify for at least one relevant course. Capacity building through MOOCS is one of the simplest and most affordable ways to strengthen the required skills that students and faculty members need to stay abreast of the latest developments.",
  "retrievedAt": "2025-08-11T05:45:56.445Z"
}
