{
  "title": "Amin-ul-Haq stresses for enhancing Pak-US business relations",
  "link": "https://www.app.com.pk/national/amin-ul-haq-stresses-for-enhancing-pak-us-business-relations/",
  "date_published": "2023-01-18T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 18 (APP):Minister for IT and Telecommunication Syed Amin-ul-Haque on Wednesday stressed the need for enhancing Pakistan-United States business relations and bilateral cooperation in various fields of mutual interest.\nTalking to US ambassador to Pakistan Donald Blome, the minister said business relations would prove beneficial for both countries.\nThe minister informed the US ambassador that Pakistan’s Information Technology and telecom sector had immense opportunities for American companies for investment, said a news release.Syed Amin Ul Haque discussed various issues including bilateral relations, IT and the telecom with the ambassador.\nHe said that his ministry was ready to extend all kinds of cooperation and assistance to the US on matters related to the telecom sector.\nThe minister informed the visiting guest that more than 70 projects worth Rs 65 billion for broadband services were being completed in the country to provide quality services to masses in remote areas.\nHe said that the personal data protection bill and social media rules were business-friendly and in accordance with national requirements and the bills would be dispatched to the relevant forums for approval in the next 3 to 4 weeks.\nDuring the meeting, the two sides agreed to start a program for skills training.The US ambassador said that a joint strategy in the telecom sector would boost bilateral cooperation.\nThe envoy noted that Pakistan had talent and a favorable environment for investment and efforts were underway to convince  US companies to invest in  Pakistan.\nDonald Blome said that Pakistan was securing an important position in the world of information technology.",
  "retrievedAt": "2025-08-11T05:45:53.216Z"
}
