{
  "title": "PML-N used to start various programmes only for their own benefit: Farrukh",
  "link": "https://www.app.com.pk/national/pml-n-used-to-start-various-programmes-only-for-their-own-benefit-farrukh/",
  "date_published": "2022-01-15T16:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):Minister of State for Information and Broadcasting Farrukh Habib said on Saturday that the programmes started by the Pakistan Muslim League-Nawaz (PML-N) regime  were only for their own benefit.\nAddressing a press conference along with Special Assistant to the Prime Minister on Youth Affairs Usman Dar he said that PML-N had appointed Maryam Safdar the head of the Prime Minister’s Youth Loan scheme.\nHe said that the PML-N distributed only Rs 26 billion under this programme during its tenure.\nThe minister said that the target of Kamyab Jawan programme would be increased to Rs 50 billion.\nIn the past, the minister said that “political bribery” programmes were started in the name of youth.\n“Nawaz Sharif and Shehbaz Sharif used to start various programmes only for their own publicity”, he said adding that he was grateful to Usman Dar for bringing the youth out of political bribery programmes. He said that the programmes launched in the past had weakened the country’s economy.\nFarrukh Habib said that now a transparent system had been introduced in the Kamyab Jawan programme and banks were persuaded to provide loans to the youth. A large number of young people were looking for jobs, Farrukh Habib said.\nHe said that loans worth Rs. 40 billion have been sanctioned for the youth and 22,000 new businesses had been established with the approved loan amount.\nHe said under this programme, start-ups have been promoted and out of Rs 30 billion, Rs 12 billion was provided to start-ups as this programme was for those who lacked resources. In the first phase, loan up to Rs. 1 million can be obtained without guarantee, the Minister of State said.\nHe said that women also participated actively in the programme and benefited from it.\nFarrukh Habib said that 3,000 new businesses had also been started in Sindh through Kamyab Jawan programme.\nHe said that loans had been given not on political grounds but on merit in a transparent manner as Prime Minister Imran Khan believed in transparency.\nThe minister said that Rs 30 billion had been distributed under the Kamyab Jawan Programme and 50,000 jobs have been provided.\nHe said that Rs 10 billion had been allocated for “Skills for All” programme and 25,000 youth have benefited from this programme. The target for Pakistan’s IT exports this year was $ 3 billion, he added.\nHe said that nationwide Talent Hunt Programme had also been started in collaboration with HEC to involve the youth in various activities.",
  "retrievedAt": "2025-08-11T14:07:07.584Z"
}
