{
  "title": "Govt introduces basic reforms in various sectors during last three years: Hammad",
  "link": "https://www.app.com.pk/national/govt-introduces-basic-reforms-in-various-sectors/",
  "date_published": "2022-01-15T11:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP):Minister for Energy Hammad Azhar on Saturday said that Pakistan Tehreek-e-Insaf led government has introduced basic reforms in various sectors including in energy during last three years aimed at ensuring sustainable development.\nAddressing a press conference here, he said that that these reforms would continue in next five years.\nHe said our economy was paralyzed after 1960 and gross domestic product (GDP) also could not grow like the other countries. Sometime, our GDP witnessed sudden increase and in next increase faced recession, he added.\nEarlier, the State Bank of Pakistan (SBP) fixed the market exchange rate on the direction of Finance Minister resulting increase in debts and pressure on foreign currency reserves, he said.He said now rates were fixed as per market based exchange. The custom policy was also separated from Federal Board of Revenue (FBR) and Tax, he added.\nNow, the commerce ministry fixed it which also help improvement in raw materials, he said. He said it would also help promote industries in the country.\nThe minister said that the country’s exports would be brought at $ 30 billion this year while Rs 6000 billion tax collection would be collected during the said period which would be a record.He said the entire world has praised Pakistan for compliance of 26 points out of 27 given by Financial Action Task Force (FATF).\nHe said new power plants were set up in past without assessing the old power plants established by Independent Power Producers (IPPs). The government renegotiated with IPPs which would bring improvement in the power sector, he added.\nHe said the government for the first time approved Indicative Generation Capacity Expansion Plan (IGCEP) model in the country under which in future power projects would be set up purely in opening competitive bidding as per the requirement.\nThe minister said in past, focus was given only to generation of electricity while no attention was paid to power distribution in the country. In past, our system could not transmit around 20,000 MW while 24,700 MW electricity was transmitted during the last year, he said.\nHammad said system could easily transmit 30,000 MW by 2023. The government has completed 4000 MW HVDC transmission line project which was only present in the papers, he added.He said 2nd phase of Neelum Jhelum transmission line project has also been completed yesterday which would supply electricity from Neelum Jhelum and Karot Hydrpower Projects to Sialkot and Gujrnawala districts.\nThe minister said yesterday, the National Assembly passed a legislation regarding SBP autonomy which was highly politicized by the opposition. In all developed countries, their State Banks were independent, he added.\nHe said the federal government would own the entire assets of SBP while the appointment and removal of SBP governor, deputy governor and board of directors was also under the domain of the Central government. The legislation would free the SBP from politicized decisions, he added.He said the government successfully dismantled cartelization in agriculture and enhance wheat support price to facilitate the farmers. The farmers were getting rates of Rs 250-300 per maund for their sugar cane, he added.\nRegarding fuel cost adjustment, the minister said the past government installed power projects based on imported fuel including LNG and Coal which resulted in variation of fuel cost prices. “Had the past government gives priority to build dams today we have not suffer,” he said.\nHammad said that the incumbent government has declared this decade as “decades of dams” and 10 mega dams were being set up in the country. Under, the plan, 70-80 per cent electricity would be generated through local resources including hydel, coal, and Renewable by 2030, he added.\nHe said 5 GDP growth would be achieved this year while the foreign remittances would be around $ 30 billion which would be a record.\nReplying to a question, he said Pervaiz Khattak has raised the issue before the Prime Minister that there was ban in new gas connection in his constituency. He said PTI was a democracy party and every member has right to speak in the party’s meeting.",
  "retrievedAt": "2025-08-11T14:07:02.974Z"
}
