{
  "title": "China-Pakistan strategic partnership ensures regional, global development: President",
  "link": "https://www.app.com.pk/national/china-pakistan-strategic-partnership-ensures-regional-global-development-president/",
  "date_published": "2022-01-15T12:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 15 (APP): President Dr Arif Alvi Saturday said that all-weather strategic cooperative partnership between China and Pakistan envisioned a prosperous region with the establishment of economic and trade linkages through the China-Pakistan Economic Corridor (CPEC), a flagship of Chinese One Belt, One Road initiative.\nDuring an interaction with the Chinese media, the president said Pakistan and China enjoyed excellent relations which were based upon all-weather strategic cooperative partnership.\nDilating upon the long history of ties between the Iron Brothers, the president said both the countries had been cooperating in diverse fields through China Pakistan Economic Corridor (CPEC).\nThe leadership of the both countries had been consistently improving upon the historic relationship, he said, adding the ties were based upon people-to-people linkages.\nPresident Alvi said both countries had faced testing times. The world is in the flux, facing different challenges and issues like illegal occupation of Kashmir (IIOJK) by India.\nHe said Pakistan and China have been continuously talking about peace in the world and pushing for a durable peace across the world. The president cited both countries’ efforts for peace and stability in Afghanistan.\nChina and Pakistan had a long history of friendship and they were continuously improving upon these ties which had started during 50s and tremendously grew up during 60s, he added.\nChina’s link with the world was established through Pakistan, he said.\nTo a question, the president said that the new global order was emerging.  On different issues, Pakistan and China think alike. In the face of these changes, the president stressed that any global changes should be based upon principles rather than hegemony.\nThe president further stressed that these changes should not be of any kind of interference in each other’s affairs.\nThe last seventy years ties between Pakistan and China had been a good example for the world to show how countries could be friendly and forged relations based upon principles and mutual understanding, he added.\nAbout the CPEC, the president said it is unique form of cooperation. CPEC completed projects stood around worth $28 billion whereas another $24 billion projects were under the completion.\nThe president said the entire portfolio of CPEC projects was over $62 in the short term.\n“I think the CPEC has a tremendous impact upon the economy of Pakistan,” he opined.\nRejecting certain propaganda launched against CEPC, he said huge cooperation was going on between China and Pakistan.\nHe said the a very low mark-up over this investment reflected the mutual cooperation rather than exploitation as projected by those opposing the project.\nThe president further said that under CPEC, the initial projects were energy-based as Pakistan had been facing serious shortage of energy, subsequently, in the second phase, there were huge areas of cooperation in food, health agriculture and poverty alleviation.\nThe president reiterated that through these multi-dimensional projects, people in Pakistan would find more job opportunities and would come out of poverty.\nHe observed that poverty could be alleviated through the strengthening of health and education infrastructure over which Pakistan was fully focusing with different initiatives like Ehsaas programme.\nTo another query, he replied that China had adopted a zero-Covid policy but Pakistan handled it in a very different manner. The government in Pakistan opted for partial lockdown as its economy could not sustain complete lockdown.\nThere were maximum 6,800 covid cases in Pakistan during the months of June and July, he added.\nHighlighting the importance of Gwadar port, the president said fast progress was being achieved. It was one of the largest ports in the region close to the Gulf and would serve as a major deep-sea port.\nThe president shared that it would link western areas of China proving as a big advantage for it.\nHe said Gwadar port was also strategically very important from other aspects as well including fishery.\nThe president urged the governments of the both countries to make further efforts for ensuring movement of goods from China to Gwadar and from Gwadar to China.\nGwadar would be the shortest trade route for Afghanistan and to the Central Asian Republics (CARs), he said, adding the more linkages were established, the more progress and development would take place in the region and beyond.\nGwadar port would ensure peace and development for the whole region, he expressed the confidence.\nAbout the cooperation in IT sector, the president underlined that cyber security and the human resources were needed to be developed.\nHe maintained that tomorrow’s world would not be based upon brick and mortar.\nChina and Pakistan required to be firewalled against hacking, the ability of the non-state actors to launch cyberattacks; for example, to affect their banking and financial institutions and utilities as everything was available on internet, the president added.\nThe president said that they would be looking forward for the Chinese cooperation in developing the chips and cited development of JF-17 Thunder, a good example of cooperation between the two countries.\nThe president said the IT sector across the globe was witnessing an exponential growth for which the world needs trained manpower and stressed that both countries could bring their people into this sector for the economic prosperity.\nThe president also elaborated that both countries could cooperate further in agriculture and Pakistan could learn to increase its yields with the help of Chinese expertise and technology.\nIn the health sector, Pakistan appreciated the way China extended help and guidance during the Covid pandemic.\nThe president opined efforts at poverty alleviation in Pakistan had been linked with the mutual cooperation.\nAbout a question regarding adoption of a resolution by the Chinese Communist Party over its achievements, the president said that they appreciated such achievements of the Chinese people led by the Communist party.\nResponding to a question, the president said that every region had different principles of democratic system, some have presidential form while others were run through prime ministers.\nA set of democracy in any part of the world could not be transplanted in another, he observed.\nThe president said that Chinese democracy had evolved very much as it had unified approach to develop the country.\n“China has made efforts in improving on trade and taking 800 million people out of poverty which is not a small achievement,” he added.\nHe said one belt and one road was a great example to the world to show as to how development for the decades ahead could be achieved.\nTo another question, the president felicitated the Chinese government for arranging the upcoming Beijing Winter Olympics 2022.\nHe opined that from the history of Greece, the world learnt that games had been a source to bring nations closer, enhance cooperation and promote healthy competition through games.\nIt was a great achievement of the Chinese government to host such an event during pandemic, he said, adding that Pakistan would also participate.\nThe president observed that it was unsuitable if games were stymied with politics on false perceptions.\nThe president also congratulated the Chinese Communist Party on the 100 years of its foundation.\nHe said that it continued to guide the world as an example of prosperity and through the way, it displayed unity and took people out of poverty.\nHe stressed that other countries could learn from the peoples’ participation in the government and CCP being an institution for progress.\nThe president also cautioned that Pakistan and China should also understand what was happening in the world as the global relations were like a kaleidoscope with changing colours and should be on their guards that their government systems and institutions should not be threatened on false security perception.\nAbout the role of Pakistan in the Afghan peace and stability, the president said that it had been in the forefront of these efforts to ensure that Afghanistan should not fall back into isolation and its finances and banking sector should not collapse.\nHe said Pakistan has brought the global focus back on Afghanistan. The Afghan people had faced miseries in the last three decades and it was important that the world must bring them into the mainstream, he emphasized.\nAbout the women education, the Afghan government had assured that it would continue, besides the Afghan soil would not be used for any terrorism, he added.\nThe president said Pakistan had hosted about four million Afghans on its soil for four decades and there was no political party in the country that had opposed the refugees unlike the Mediterranean, where the migrants had been left to drown.\nHe said Pakistan had also successfully hosted the extraordinary meeting of the foreign ministers of OIC and with these efforts, it ensured to save Afghanistan from becoming a backburner.\nThe president also wished tremendous progress, prosperity and success to the Chinese government and its people at the herald of the new year.",
  "retrievedAt": "2025-08-11T14:07:03.216Z"
}
