{
  "title": "National Security policy is apolitical: Moeed Yusuf",
  "link": "https://www.app.com.pk/national/national-security-policy-is-apolitical-moeed-yusuf/",
  "date_published": "2022-01-15T16:22:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 15 (APP):National Security Advisor (NSA) Dr Moeed Yusuf said on Saturday that National Security Policy (NSP) was a non-political document and the political leadership of the country should accept it in the larger national interest.\nTalking to senior journalists, columnists, editors and anchors here at the Governor’s House, he said the National Security policy was a first-ever document in the security history of the country which embodied aspirations of all and sundry, adding that NSP encompassed key framework on human security, economic security, military security and prosperity of man in the street.\nMoeed Yusuf urged the political leadership of the country to refrain from playing politics on the security paper, adding that the National Security Policy would address both traditional and non-traditional security challenges, besides challenges to economy, food, water, military security, terrorism, unity and diversity and foreign relations with major powers.\nTo a question, he said the NSP was an executive prerogative of the government and had been approved by the National Security Committee headed by Prime Minister Imran Khan and the cabinet.\n“National Security Policy does not need to be laid before the parliament as it had duly been presented before the Parliamentary Committee on National Security (PCNS) – representative body of the parliament’, he responded, adding that the members of committees were not present on the day.\nHe further clarified that the parliament was unanimous that the matters of national security should be presented before the PCNS instead of being debated in the house, adding that he had also briefed Senate’s Standing Committee on Defence in a separate meeting.\nMoeed, responding to a query, said the National security Policy had been adopted for a period of five years with a mandatory annual review while a new government could also review the security policy.\nHe said the economic security at the heart of National Security Policy unlike the previous policies which revolved around peace, adding that the government believed in economic diplomacy.\nRegarding connectivity of commerce, he said it had been for the first time in the 75 year history of the country that a strategy had been put forth vis a vis linkages with the Central Asian states, adding that blue economy had also remained untapped in the past but the government had adopted a plan to make the country economically self-sufficient and the economic prosperity could ensure national security.\nOn relations with India, the NSA said illogical approach of the Indian government was a obstacle in smooth relations with India, adding that Kashmir was the core issue between Pakistan and India.\nHe said the world was well-aware of India’s jingoism as Modi had emerged as the descendent of Hitler, adding that India was not a safe country for the minorities today.“Pakistan wishes to move forward with India but its conditions are well-defined while we can go as far as the neighbor does”, he maintained.\nRegarding Afghanistan, he said things were far better pre-August 15 scenario, adding that country’s diplomatic relations with neighboring Afghanistan were on a high today. He further said the TTP was behind the singular border incidents since it had the requisite capacity, adding that it wanted to assert its nuisance value but it was not significant.\nTo a question, Moeed Yusuf said China-Pakistan relations were non-negotiable, adding that neither China nor the U.S. had asked Pakistan to sever ties with any other country of the world.\nHe said it had been the first that the country’s National Security Policy had defined importance of ties with various countries of the world.\nOn illegal immigrants, the NSA said repatriation of the refugees would be carried out in a dignified manner, adding that the action would be initiated against the illegal national identity card holders.\nOn business-friendly policies, Moeed Yusuf said all countries of the world, including Turkey, Malaysia and even Saudi Arabia, introduced investment friendly policies, adding that Pakistan would also facilities investors from China, United Sates or any country of the world.\n“I have firm belief in the comprehensiveness of the National Security Policy and the key direction will not be reversed by the subsequent governments, although they may review it”, Moeed responded.",
  "retrievedAt": "2025-08-11T14:07:07.942Z"
}
