{
  "title": "Four terrorists killed in Bannu, Malakand operations - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAKKI MARWAT/MALAKAND: Three terrorists were killed in an intelligence-based operation in Bannu district late on Wednesday, while another died in an encounter with police in Malakand district on Thursday.\n\nA police official told Dawn that after receiving credible intelligence reports about the presence of terrorists, Bannu’s regional police officer Sajjad Khan dispatched a police team, backed by the counter-terrorist department commandos, to the Miryan rural area.\n\nHe said that all the three terrorists were neutralised and killed in the operation led by DPO Saleem Abbas Kulachi.\n\n“An intense exchange of fire took place when the policemen reached the area to capture terrorists,” he said.\n\nElders demand improvement of law and order situation in Domel tehsil\n\nThe official said as the law-enforcers were fully prepared, they responded quickly and effectively, resulting in the elimination of the “Fitna-al-Khawarij” terrorists.\n\nHe identified the terrorists as Mudassir alias Mudassiri, Turab alias Umar Khitab alias Malang and Mohammad Hussain alias Maaz and said they all were wanted by the police and CTD in the targeted killings of several police officials.\n\n“Besides involvement in the killing of ASI Asghar and police constables Kamran, Nusrat and Sikandar, the terrorists also carried out attacks on police stations in the cantonment, city and Miryakhel areas,” he claimed.\n\nThe official said that the police seized an assault rifle and a pistol, magazines and an improvised explosive device and shifted them along with the bodies to a hospital.\n\nProvincial police chief Zulfiqar Hameed praised Bannu police and CTD for killing terrorists and said such operations would continue until terrorism was eliminated.\n\nIn Lakki Marwat, police assisted by the Elite Force’s commandos conducted a “search and strike” operation and snap checking in the remote rural areas of Kurram Par region.\n\nDPO Nazir Khan said that DSP Zafrullah Khan led the operation in the trans-river belt bordering the Karak and Mianwali districts aimed at arresting miscreants, eliminating their hideouts and maintaining law and order.\n\nHe said that the operation helped check activities of miscreants and criminal gangs and reduce crime rate in the area.\n\nKILLED: A terrorist was killed and another arrested in an encounter with the CTD in the Dargai tehsil of Malakand district on Thursday.\n\nThe gunfire left three passers-by injured who rushed to the tehsil headquarters hospital Batkhela, according to the local official sources.\n\nThey said that the CTD learned about the presence of a group of 30 terrorists from Afghanistan, led by their commander Mufti Tahir, in the area and their plans to enter Mardan district via Musa Meena Mehrdi area.\n\nThe sources said the CTD personnel intercepted the terrorists, prompting the latter to open fire.\n\nThey said the exchange of fire,which continued from 12pm to 4:30pm, killed terrorist Saadullah from Afghanistan, while Syed Habib, also an Afghan national, was arrested with injuries.\n\nThe injured passers-by included Ismail, Jamra Ali and Ehtesham, residents of Pabi in Nowshera. The CTD seized a rocket launcher, four rounds of rocket launcher, 16 hand grenades, domestic and foreign currency and mobile phones.\n\nMeanwhile, tribal elders have asked police to focus on the improvement of law and order situation and effective resolution of security issues in Domel tehsil of Bannu district.\n\nThe demand was made by them during a meeting with Regional Police Officer Sajjad Khan in his office.\n\nThe visitors highlighted matters pertaining to law and order, crime, social issues and security challenges.\n\nThey said the police should improve the security situation and provide the localswith a safe living environment.\n\nThe elders also called for better coordination between police and residents for crime control.\n\nThe RPO assured them of all possible measures to protect public life and property.He said public-police trust and cooperation were inevitable for lasting peace.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/17120352f3e41f8.jpg?r=120358",
  "retrievedAt": "2025-08-17T20:41:11.230Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924957/four-terrorists-killed-in-bannu-malakand-operations",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T04:25:38.000Z"
}
