{
  "title": "Iran says Europeans have no grounds to trigger sanctions snapback - World - DAWN.COM",
  "author": null,
  "content": "Iranian Foreign Minister Abbas Araghchi told his European counterparts on Friday that they have no grounds for reactivating UN sanctions after they threatened to do so in the coming months unless there is progress in nuclear talks.\n\n“If EU/E3 want to have a role, they should act responsibly and put aside the worn-out policies of threat and pressure, including the ‘snap-back’ for which they (have) absolutely no moral (or) legal grounds,” Araghchi said on X.\n\nHe added that “any new round of talks is only possible when the other side is ready for a fair, balanced, and mutually beneficial nuclear deal.”\n\nThe remarks came after Araghchi held a conference call with his British, French and German counterparts and European Union foreign policy chief Kaja Kallas.\n\nThe European diplomats told Araghchi of “their determination to use the ‘snapback’ mechanism — which allows for the reimposition of all international sanctions against Iran — in the absence of concrete progress” towards a new deal on Iran’s nuclear programme “by the end of the summer”, the French foreign ministry said.\n\nFrench officials have previously indicated that this means by the end of August.\n\nLast month, French Foreign Minister Jean-Noel Barrot said that the Europeans would be “justified” in seeking a snapback of UN sanctions lifted under a 2015 nuclear deal between Iran and major powers, later abandoned by US President Donald Trump.\n\n“Without a firm, tangible, and verifiable commitment from Iran, we will do so no later than the end of August,” he told reporters.\n\nLast week, Araghchi urged the Europeans to play “a constructive role” on the nuclear issue.\n\n“The threat of sanctions does not help diplomacy,” Araghchi told French newspaper Le Monde.\n\nThere has been much speculation about the status of Iran’s nuclear programme since Israel and the United States bombed key facilities last month.\n\nA clause in the 2015 agreement allows for UN sanctions on Iran to be reimposed through a snapback mechanism in the event of non-compliance.\n\nBut the deal expires in October, giving the parties to it a fast-approaching deadline to invoke the clause.\n\nIran and the United States held several rounds of nuclear negotiations through Omani mediators before Israel launched its 12-day war on June 13. Trump’s decision to join Israel in striking Iranian nuclear facilities effectively ended the talks.\n\nSince the end of the hostilities, both Tehran and Washington have signalled willingness to return to the table, though Tehran has said it will not give up its right to the peaceful use of nuclear power.\n\nAn adviser to Iran’s supreme leader Ayatollah Ali Khamenei, who has the final say in matter of state, said on Monday that there would be no new nuclear talks with the United States if they were conditioned on Iran renouncing uranium enrichment.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/18141254f332e71.png",
  "retrievedAt": "2025-08-17T20:40:41.446Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924997/iran-says-europeans-have-no-grounds-to-trigger-sanctions-snapback",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T09:17:18.000Z"
}
