{
  "title": "Six killed, 16 injured as speeding van overturns near Khairpur - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Six passengers died and 16 suffered injuries when a speeding van overturned after its rear tyre deflated on National Highway near Miskeenpur shrine in Gambat town, Khairpur district, on Thursday.\n\nWitnesses said the van was on its way from Sukkur to Sehwan. They rushed to the badly-maimed vehicle and took out the bodies and the wounded before rescue teams arrived there and shifted the victims to the Gambat Institute of Medical Sciences (GIMS), they said.\n\nHospital sources said that dead were identified as van driver Arshad Bhatti, 35, a resident of Malko Wahan village; Shama Begum, 60, of Miskeenpur; Mai Zohra Khatoon,18, of Pano Aqil; Safia, 30, 4-year-old Owais Jatoi, of Pano Aqil and Ghulam Haider Mangnejo, a resident of Hingorja.\n\nThe injured were Ms Manz­oo­ran, Rahat Kha­toon, Haider Ali, Wazir Ali, Kainat, Asif Ali, Azman, Sajjan, Samad, Rafiq Ali, Mohammad Ali, Ms Samai Khatoon, Zohaib Ali, Ms Maria, Ms Parveen and Ms Tawheeda, they said.\n\nThey said the passengers with minor injuries were discharged after emergency medical treatment, and those with serious wounds were undergoing treatment at the GIMS.\n\nThe bodies were handed over to heirs after completion of medico-legal formalities.\n\nCM takes notice\n\nChief Minister Syed Murad Ali Shah took notice of the accident and directed Sukkur commissioner to ensure the injured received the best possible medical care.\n\nHe expressed sorrow over the loss of lives in the accident and offered condolences to the bereaved families who had lost their loved ones.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/15131935ead509c.png?r=132200",
  "retrievedAt": "2025-08-17T20:41:40.678Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924827/six-killed-16-injured-as-speeding-van-overturns-near-khairpur",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:47:06.000Z"
}
