{
  "title": "JUI-F emerges as largest opposition party in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PML-N withdraws candidate in favour of JUI-F’s nominee on minority seat\n• ANP’s Shahida Waheed wins draw on women seat\n\nPESHAWAR: The Pakistan Muslim League-Nawaz (PML-N) on Thursday withdrew its candidate in favour of Jamiat Ulema-i-Islam-Fazl (JUI-F) for a seat reserved for non-Muslims, paving the way for JUI-F to become the largest opposition party in the Khyber Pakhtunkhwa Assembly with 18 lawmakers.\n\nAs a result, JUI-F’s candidate Gorpal Singh will now be notified as MPA-elect on the said seat by the Election Commission of Pakistan (ECP).\n\nMeanwhile, Awami National Party (ANP) candidate Shahida Waheed was declared the winner through a draw against Pakistan Tehreek-i-Insaf Parliamentarians (PTI-P) candidate for a seat reserved for women. She will also be notified by the ECP as MPA-elect.\n\nBoth developments took place at the office of Provincial Election Commissioner (PEC) Saeed Gul in Peshawar on Thursday, where senior party leaders were present.\n\nPML-N provincial president Amir Muqam and JUI-F’s Maul­ana Attaur Rehman attended the event along with their respective candidates, Gorsaran Lal and Gorpal Singh. The PML-N delegation formally withdrew its candidate in support of JUI-F’s nominee.\n\nSimilarly, delegations of ANP, led by MPA Nisar Baz and candidate Shahida Waheed, and PTI-P, led by MPA Arbab Waseem and candidate Somi, were also present for the draw. Following the draw, ECP officials declared Ms Waheed the winner.\n\nBoth PML-N and JUI-F were allo­­t­ted one seat each, reserved for non-Muslims, on the basis of the seven general seats won by each of them. The ECP had decided to allot the remaining seat through a draw.\n\nSimilarly, both ANP and PTI-P were awarded one seat each reserved for women and the remaining seat had to be allotted through a draw between candidates of these parties.\n\nFollowing the notifications, JUI-F and PML-N will each hold nine of the total 26 reserved seats for women in the KP Assembly. PPP holds five, while ANP and PTI-P will now hold two and one, respectively.\n\nFor the four seats reserved for non-Muslims, JUI-F will hold two, while PML-N and PPP will have one each.\n\nThe opposition now holds a total of 52 lawmakers in the KP Assembly, including 18 MPAs of JUI-F, 17 of PML-N, 10 of PPP, four of ANP, and three of PTI-P. Presently, Dr Ibadullah of PML-N is the leader of the opposition in the KP Assembly. PTI-backed lawmakers maintain their tally of 92 members.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/050729184cea56c.jpg?r=073253",
  "retrievedAt": "2025-08-17T20:43:02.660Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924890/jui-f-emerges-as-largest-opposition-party-in-kp",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:46:29.000Z"
}
