{
  "title": "104 regulatory proposals to ease business climate - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Cabinet Committee on Regulatory Reforms concluded a series of meetings on Thursday, finalising the first package of reforms aimed at reducing compliance burdens, eliminating outdated procedures, and improving the ease of doing business.\n\nChaired by Minister for Investment Qaiser Ahmed Sheikh, the committee held three meetings to review 136 reform proposals submitted by the Board of Investment (BoI). Of these, the Cabinet Committee for Implementation approved 104 proposals.\n\nAccording to a BoI press release, the approved reforms include eliminating 19 redundant regulatory requirements and streamlining 57 procedural steps through simplification, digitalisation, and modernisation to enhance transparency and service delivery.\n\nOnce implemented, the reforms are expected to reduce costs, shorten approval timelines, and create a more business-friendly regulatory environment.\n\nThe committee directed relevant federal ministries and departments to implement the approved reforms within timelines of up to 90 days, depending on the complexity of each measure. The BoI will oversee the implementation and regularly update the cabinet committee on progress.\n\nFurther reform packages are in development, targeting critical sectors of the economy. These upcoming measures aim to further ease regulatory compliance, enabling businesses to invest, grow, and compete more effectively in domestic and international markets.\n\nThe conclusion of this review process reflects the government’s commitment to regulatory modernisation and fostering a conducive environment for business and investment, the BoI stated.\n\nMinister Sheikh praised the efforts of the BoI’s reform team and acknowledged the constructive role played by regulatory bodies in advancing the national reform agenda. He termed the meetings a key milestone in the government’s drive to simplify and modernise Pakistan’s regulatory framework, in line with the prime minister’s directives.\n\nThe reform package, developed under the supervision of the BoI’s reform team, focused on two principal areas: streamlining federal-level Registrations, Lice­nces, Certificates, and Other Permits (RLCOs), and modernising the Com­panies Act 2017 for unlisted companies.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/08/190933219e49bd0.jpg?r=093358",
  "retrievedAt": "2025-08-17T20:42:15.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924852/104-regulatory-proposals-to-ease-business-climate",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:46:48.000Z"
}
