{
  "title": "Elderly man loses life and bet to swim across canal in Bahawalpur - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: A Rs1,000 bet on swimming across gigantic Abbasia Link Canal on Thursday claimed the life of an elderly man, who drowned near Uch Sharif, about 70km from here.\n\nAccording to Rescue 1122 sources, some locals dared Shabeer (66), a retired railway employee, to swim across the big and deep canal, setting a Rs1,000 bet on the arduous task for the elderly man, who was not even a trained swimmer.\n\nThe old man accepted the challenge and jumped into the canal.\n\nQuoting eyewitnesses, the sources said, as the old man started drowning, the onlookers kept laughing and recording videos of him, instead of trying to save him. They also uploaded the video clip on social media.\n\nWhen the old man disappeared in the water, someone called Rescue 1122 for help. By the time a rescue team reached the spot the old man had already drowned, they said.\n\nThe Rescue 1122 divers retrieved the body and handed it over to the victim’s family.\n\nAs the video went viral, many social media users condemned those who instigated the elderly man to jump into the deep canal and did not even help him when he was drowning, demandingtheir arrest.\n\nSo far, Uch Sharif police have not taken any action over the tragic incident.\n\nWOMAN MURDERED: A man allegedly axed his sister-in-law to death and seriously injured his niece over her marriage issue at Chak No 95 on Multan Road in the limits of Thingi police station in Vehari district.\n\nAccording to police and Rescue 1122, the suspect, Ali, brought a marriage proposal of his relative for his niece, Fatimah, but his wife Pakeeza, opposed it.\n\nOn Thursday, Ali began quarrelling with his sister-in-law Pakeeza (mother of Fatima) over the marriage issue and in a fit of rage attacked her with an axe, leaving her dead on the spot.\n\nHe also attacked his niece, injured her and fled the scene.\n\nOn receipt of an emergency call, a Rescue 1122 team reached the spot and shifted Fatima to the hospital. The police shifted Pakeza’s body to the hospital for autopsy.Police have yet to register a case against the fleeing suspect.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/thumbnail/2025/08/11095605e9eac17.jpg",
  "retrievedAt": "2025-08-17T20:41:33.228Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924897/elderly-man-loses-life-and-bet-to-swim-across-canal-in-bahawalpur",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:47:12.000Z"
}
