{
  "title": "Soaring again - Newspaper - DAWN.COM",
  "author": null,
  "content": "BRITAIN’S decision to lift its nearly five-year-old ban on Pakistani airlines, allowing them to apply for permits to resume flight operations to and from the UK, is a boost to Pakistan’s aviation industry, particularly the debt-ridden national flag carrier PIA.\n\nThe UK Air Safety Committee’s move to reverse the restrictions follows aviation safety improvements in this country. The British High Commission in Islamabad stated that “the decisions on delisting states and air carriers were made through an independent aviation safety process”.\n\nIt added: “The committee has judged that necessary safety improvements have been made since its original decision. Therefore, based on this independent and technically driven process, it has decided to remove Pakistan and its air carriers from the UK Air Safety List.”\n\nThe British move follows the lifting of a similar ban by the European Union late last year. PIA restarted its European operations in January. Aviation Minister Khawaja Asif expects the British ban reversal to be followed by the resumption of PIA flights to the US in September.\n\nThe lifting of the ban by the UK will lead to several welcome developments. Britain, home to one of the largest Pakistani diasporas in the world, is among this country’s top trade and travel partners and the move will promote travel and connectivity, and enhance commercial ties between the two countries. Pakistanis living in the UK have already hailed the decision as direct PIA flights will provide 1.6m expats ease of travel to and from their homeland at competitive prices.\n\nBut, more importantly, the ban’s removal by both the UK and EU is a recovery point for the national carrier, and will go a long way in supporting the new push to sell the lossmaking airline by the end of this year. It is now expected to fetch a significantly higher price than was earlier envisaged as the airline will get a new opportunity to rebuild its operations to Britain and the EU nations, which had been two of its most lucrative markets.\n\nThe ban had been prompted on safety concerns by a reckless statement made by the then aviation minister Ghulam Sarwar Khan about the credibility of Pakistani pilots, days after a PIA plane crashed in Karachi in May 2020, killing 97 passengers and crew.\n\nIn a statement in the National Assembly, Mr Khan had alleged that more than a third of the licences of Pakistani pilots were either fake or suspect as the crash was attributed to pilot error. It later transpired that his allegations, resulting in avoidable but disastrous financial and reputational losses for PIA and the country, were not based on fact.\n\nThat is water under the bridge now. Nevertheless, the episode is a reminder that a demonstration of discretion is necessary by those in high offices when it comes to national interests.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/16152147f270710.jpg?r=152227",
  "retrievedAt": "2025-08-17T20:41:17.671Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924922",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T03:01:25.000Z"
}
