{
  "title": "Sabri qawwals have to bear another tragedy - Pakistan - DAWN.COM",
  "author": null,
  "content": "IN scorching heat and without electricity, Sheikh Mohammed Sabir Chishti sits at a makeshift seating area on the side of the road leading to Teen Hatti in PIB Colony.\n\nThe grief-stricken man is being consoled by his relatives, who are coming to express condolences over the tragedy befallen the famed family of singers.\n\nMr Chishti’s son-in-law, Raza Sabri and maternal uncle, Ahmed Sabri, were gunned down in a deadly bus attack in Zhob on Wednesday.\n\nRaza was the son of Mr Ahmed.\n\nThe two men, along with their fellow musicians, were going to Quetta to perform at an event.\n\nAsif, who played musical instruments, was also killed as terrorists opened indiscriminate fire on the bus.\n\nWhile the two families are not related, the killing of three musicians in Balochistan is the second such tragedy to befall the community after the assassination of Amjad Sabri nine years ago\n\nSlain Ahmed’s three brothers, Imran, Nasir and Faisal, remained safe in the attack.\n\nMr Chishti tells Dawn that 12 people, including four Sabri brothers, left Karachi on Wednesday.\n\nAt around 4pm, Faisal called to inform about the attack, said Mr Chishti.\n\nTalking about his son-in-law, Mr Chishti said he was a father of a six-month-old son. Mr Ahmed had eight children.\n\nHe said the musician brothers were invited by a senior official to perform at an event in Quetta.\n\nTalking about his family, he said there were seven Sabri brothers, all of them qawwals. One of them died of natural causes and now Ahmed has been gunned down along with his son.\n\nMr Chishti clarified that though they share the surname with famed qawwal Amjad Sabri, the two families were not related to each other.\n\nMr Amjad was shot dead in Karachi in 2016.\n\nShakoor Ahmed Sabri, a representative of Sabri qawwals, said Wednesday’s killings were the second major attack on musicians since the assassination of Mr Amjad.\n\nHe said the killings have “devastated” qawwals all over the country.\n\n“We are qawals and we sing the greatness of the Holy Prophet (Peace Be Upon Him). We have nothing to do with politics,” said Mr Shakoor, who presented himself as an “elder” of the Sabri qawwal community.\n\nFuneral\n\nThe bodies of three slain musicians have been brought back to Karachi by air. However, the three Sabri brothers, who survived the attack, have yet to return as they are looking after their injured group members in Quetta.\n\nThe funeral will be held after Friday prayers at the KMC ground in PIB Colony, according to Majid Sabri, the elder brother of Mr Ahmed.\n\nHe urged the governments of Sindh and Balochistan to facilitate the return of the survivors, including his three brothers, from Quetta to attend the funeral prayer.\n\nSeveral political leaders and lawmakers have visited the grieving family and expressed their condolences.\n\nSindh minister Saeed Ghani, who received the coffins at the airport, said the Sabri qawals were on their way to perform their art.\n\nHe assured justice would be served and the Sindh government was in touch with Balochistan to extend every possible medical facility to the injured persons there.\n\nSindh Governor Kamran Khan Tessori also visited the residence of Sabri qawwals and offered his condolences.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6879925c61eb7.gif",
  "retrievedAt": "2025-08-17T20:42:47.677Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924883/sabri-qawwals-have-to-bear-another-tragedy",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:46:36.000Z"
}
