{
  "title": "World-first IVF trial reduces risk of babies inheriting diseases - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Eight healthy babies have been born in the UK using a new IVF technique that successfully reduced their risk of inheriting genetic diseases from their mothers, the results of a world-first trial said on Wednesday.\n\nThe findings were hailed as a breakthrough which raises hopes that women with mutations in their mitochondrial DNA could one day have children without passing debilitating or deadly diseases on to the children.\n\nOne out of every 5,000 births is affected by mitochondrial diseases, which cannot be treated, and include symptoms such as impaired vision, diabetes and muscle wasting.\n\nIn 2015, Britain became the first country to approve an in-vitro fertilisation (IVF) technique that uses a small amount of healthy mitochondrial DNA from the egg of a donor — along with the mother’s egg and father’s sperm.\n\nSome have called the result of this process “three-parent babies”, though researchers have pushed back at this term because only roughly 0.1 percent of the newborn’s DNA comes from the donor. The results of the much-awaited UK trial were published in several papers in the New England Journal of Medicine.\n\n‘Important reproductive option’\n\nOut of 22 women to undergo the treatment at the Newcastle Fertility Centre in northeast England, eight babies were born. The four boys and four girls now range from under six months to over two years old. The amount of mutated mitochondrial DNA — which causes disease — was reduced by 95-100 percent in six of the babies, according to the research.\n\nFor the other two newborns, the amount fell by 77-88 per cent, which is below the range that causes disease.\n\nThis indicates the technique was “effective in reducing transmission” of diseases between mother and child, one of the studies said. The eight children are currently healthy, though one had a disturbance of their heart’s rhythm which was successfully treated, the researchers said. Their health will be followed up over the coming years to see if problems arise.\n\nNils-Goran Larsson, a Swedish reproductive expert not involved in the research, hailed the “breakthrough”. The new technique offers a “very important reproductive option” for families affected by “devastating” mitochondrial diseases, he added.\n\nEthical review\n\nMitochondrial donation remains controversial and has not been approved in many countries, including the United States and France. Religious leaders have opposed the procedure because it involves the destruction of human embryos. Other opponents have expressed fears it could pave the way for genetically engineered “designer babies”. An ethical review carried out by the UK’s independent Nuffield Council on Bioethics was “instrumental” in conducting the new research, the council’s director Danielle Hamm said.\n\nPeter Thompson, head of the UK’s Human Fertilisation and Embryology Authority which approved the procedure, said only people with a “very high risk” of passing on a mitochondrial disease would be eligible for the treatment. Ethical concerns have also been raised over the use of mitochondrial donation for infertility in Greece and Ukraine.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:42:00.105Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924866/world-first-ivf-trial-reduces-risk-of-babies-inheriting-diseases",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:47:00.000Z"
}
