{
  "title": "India scoffs at Nato chief’s warning over Russian oil import - World - DAWN.COM",
  "author": null,
  "content": "NEW DELHI: India on Thursday dismissed Nato chief Mark Rutte’s threat of “100 per cent secondary sanctions” on countries trading with Russia, particularly in gas and oil, and warned the West against adopting any “double standards.”\n\nReacting to Mr Rutte’s comments, foreign ministry spokesperson Randhir Jaiswal said securing the country’s energy needs remains an overriding priority, guided by what is available in the markets and the prevailing global circumstances.\n\n“We have seen reports on the subject and are closely following the developments. Let me reiterate that securing the energy needs of our people is understandably an overriding priority for us.\n\nIn this endeavor, we are guided by what is on offer in the markets, and by the prevailing global circumstances.“ He further said that India would “particularly caution against any double standards” on the issue.\n\nWhile the EU has significantly reduced its reliance on Russian oil, some European countries still import Russian oil, either directly or through third-party countries. According to Foreign Policy, Slovakia, Hungary, Austria, and Spain were among the top countries depositing the most money into Russian accounts for fossil fuels in 2024. Additionally, some Russian crude oil is processed into fuels like petrol and diesel in India and then exported to Europe.\n\nSpeaking in Washington on Wednesday, Mr Rutte, according to Reuters, said countries in business with Russia should make a phone call to Russian President Vladimir Putin and “tell him that he has to get serious about peace talks (on ending the Ukraine conflict), because otherwise this will slam back on Brazil, on India and on China in a massive way”.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/142053184503b5a.jpg?r=211239",
  "retrievedAt": "2025-08-17T20:41:54.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924862/india-scoffs-at-nato-chiefs-warning-over-russian-oil-import",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:47:00.000Z"
}
