{
  "title": "COAS Munir, Libyan armed forces’ chief agree on defence industrial collaboration: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) Field Marshal Asim Munir and Libyan Armed Forces’ Commander in Chief Lt Gen Saddam Khalifa Haftar agreed on their countries’ collaboration in the defence industry, the military’s media affairs wing said on Friday.\n\nLt Gen Haftar called on COAS Munir at General Headquarters (GHQ) in Rawalpindi today, the Inter-Services Public Relations (ISPR) said in a press release.\n\n“Both leaders agreed to undertake defence industrial collaboration and exchange of technical expertise to address contemporary security challenges,” the ISPR stated.\n\nIt noted that the meeting “encompassed discussion on matters of mutual interest, evolving regional dynamics, security challenges and matters pertaining to defence cooperation”.\n\nUpon his arrival at GHQ, the Libyan armed forces’ chief laid a floral wreath at the Yadgar-i-Shuhada (martyrs’ monument) to pay homage to the martyrs of the Pakistan Army.\n\n“He was offered a warm welcome, followed by guard of honour by a smartly turned-out contingent of the Pakistan Army,” the statement said.\n\nIn May, Libya’s capital of Tripoli witnessed the worst clashes in years after the killing of a major militia leader. The fighting calmed down two days later after the government announced a ceasefire, residents said.\n\nPresident Asif Ali Zardari had visited Libya during his previous tenure in May 2009. He met with then-Libyan leader Moammar Qadhafi in Tripoli, where they vowed to bolster bilateral ties and agreed to boost economic cooperation between the two countries.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/18162519192cd44.png",
  "retrievedAt": "2025-08-17T20:40:28.523Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925004/coas-munir-libyan-armed-forces-chief-agree-on-defence-industrial-collaboration-ispr",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T11:30:38.000Z"
}
