{
  "title": "Health minister discusses proposed changes to NFC formula - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Although population is the main parameter for distribution of funds under the National Finance Commission (NFC) award, the government is deliberating the possibility of reducing the weightage placed on this metric.\n\nThis was revealed by the Ministry of National Health Services in a statement issued on Thursday.\n\nAccording to the statement, the issue came up during a meeting between Federal Health Minister Mustafa Kamal and a British High Commission (BHC) delegation, led by Ms. Jo Moir, which was held to discuss the government of Pakistan’s health sector priorities and align them with the United Kingdom’s support portfolio.\n\nAccording to the statement issued after the meeting, “Key reforms discussed included revisiting the NFC Award, suggesting that the current 80pe weightage assigned to population be reduced to 50pe, with 30pe allocated as an incentive to provinces that successfully reverse population growth trends.”\n\nThe minister also advocated for a focused Behaviour Change Communication (BCC) campaign to educate men across the country about population control measures.\n\nHe raised concerns about the high fertility rate, calling it a national issue requiring immediate attention. He encouraged efforts to balance population growth through collaboration with stakeholders, including religious scholars and development partners.\n\nMustafa Kamal highlighted Pakistan’s challenges, including a high burden of both communicable and non-communicable diseases. He stressed the importance of shifting focus to preventive and promotive healthcare by strengthening primary health care systems to reduce the strain on tertiary care facilities.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/13082638bd48bb1.jpg?r=083041",
  "retrievedAt": "2025-08-17T20:42:20.045Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924869/health-minister-discusses-proposed-changes-to-nfc-formula",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:46:42.000Z"
}
