{
  "title": "Govt mulls delinking hydel profit from tariff - Business - DAWN.COM",
  "author": null,
  "content": "• Power Division opposes burdening consumers with Rs170 billion arrears\n• Says payments should be funded through federal budget or Wapda revenues\n\nISLAMABAD: The Power Division has opposed any move to burden electricity consumers with Rs170 billion in net hydel profit (NHP) arrears owed to provinces and urged delinking these payments from the electricity tariff.\n\nAlongside the Sindh government, the Power Division has also rejected proposals to transfer hydropower assets — including dam-based and run-of-the-river plants — to provincial control. Both argue that such infrastructure, financed through the Public Sector Development Programme (PSDP) and local and foreign loans, belongs to the federation and the people of Pakistan.\n\nOfficials said the Power Division fears further tariff increases would derail power sector reforms, particularly ongoing renegotiations with independent power producers (IPPs), and could undermine investor confidence. The division also emphasised legal and constitutional issues, as the matter is under review by an inter-ministerial and inter-provincial committee led by the federal planning minister.\n\nThe Khyber Pakhtunkhwa government has long sought an increased NHP share, currently paid at around Rs39-40bn annually for power generated mainly from Tarbela Dam. It has also unsuccessfully demanded over Rs300bn in additional payments and sought the transfer of hydropower plants in lieu of arrears. Punjab receives similar payments from Ghazi Barotha and other plants, with about Rs50bn currently owed to KP and Rs115bn to Punjab in past dues.\n\nUnder Article 161(2) of the Constitution, net profits from hydropower generation are payable to the province where the station is located. However, its interpretation has remained contentious. Following inter-provincial decisions made during the previous PML-N government, NHP costs are currently passed on to consumers at the rate of Rs1.155 per unit and disbursed to KP and Punjab.\n\nThe Power Division told the planning minister that Article 161(2) requires NHP to be calculated by deducting operating expenses from bus-bar revenue and does not allow NHP as a pass-through charge in tariffs. It noted that the AGN Kazi Methodology (KCM), developed in 1985-86 when Wapda was a unified entity, is now obsolete. At that time, hydro accounted for about 74pc of the power mix; today, it contributes just 27pc.\n\nThe division proposed that NHP payments be made either through the federal budget or from Wapda’s hydropower profits, warning that the current tariff-based mechanism is fiscally unsustainable and risks creating a dependency loop.\n\nTransfer of plants opposed\n\nIn response to KP’s demand for plant transfers, the division stated that such projects fall under the 1995 and 2015 power policies, which apply to private IPP-mode projects developed on a BOOT (Build, Own, Operate, Transfer) basis within provinces. It clarified that Wapda’s projects are funded via PSDP, donor loans, and internal resources, and the Wapda Act contains no provision for their transfer to provinces.\n\nThe division also opposed creating an escrow account for NHP payments, arguing it contradicts the existing legal and regulatory framework and the Constitution’s fiscal provisions. KP’s proposal appears to be inspired by an exceptional escrow arrangement used to pay Chinese power producers.\n\nSources said the Sindh government likewise rejected the transfer of hydro assets, stressing that these facilities were built not in IPP mode but for broader national objectives, such as irrigation and agriculture, with electricity being a secondary benefit. Sindh recommended consulting the Economic Affairs Division and the Indus River System Authority on financing and the use of such water reservoirs.\n\nSindh also opposed burdening consumers further, arguing that Wapda — having profited from hydropower generation — should be responsible for NHP disbursements.\n\nThe Power Division has submitted a report to the Council of Common Interests (CCI) stating that the current NHP methodology is outdated. The report maintains that under Article 161, provinces are entitled to NHP for hydropower generated within their borders and supplied to the national grid — a scenario largely applicable during the KCM era when Tarbela dominated the supply.\n\nWith the energy mix now diversified, a uniform Rs1.15 per unit levy across all electricity consumption is used to fund NHP payments. This could result in annual payouts exceeding Rs170bn to KP and Rs125bn to Punjab.\n\nThe report warns that NHP has become a greater threat to electricity affordability than the National Finance Commission award is to the federal fiscal balance. It recommends recalculating NHP shares based solely on actual generation within each province and calls for allocating a share to Wapda as well.\n\nPublished in Dawn, July 18th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68798c76d9bed.gif",
  "retrievedAt": "2025-08-17T20:42:06.856Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924851/govt-mulls-delinking-hydel-profit-from-tariff",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T00:46:48.000Z"
}
