{
  "title": "5 private companies submit proposals on ferry service from Gwadar to Gulf region: maritime ministry - Pakistan - DAWN.COM",
  "author": null,
  "content": "Five private companies on Friday proposed routes for the newly announced ferry service from Gwadar to the Gulf region, according to the maritime ministry.\n\nOn July 1, the Ministry of Maritime Affairs announced an ambitious plan to expand Gwadar Port’s operational capacity by introducing additional shipp­ing lines and launching a ferry service connecting Pak­istan with Gulf Cooperation Council countries.\n\nThe move is expected to provide an affordable, direct maritime link for passengers and cargo, particularly benefiting expatriate communities and cross-border traders.\n\nMinister for Maritime Affairs Muhammad Junaid Anwar Chaudhry chaired a meeting on the ferry service today to review the “technical and financial aspects of ferry operations”, a statement by his ministry said.\n\n“Five private companies presented their proposals,” the statement added.\n\n“The interest of the private sector in ferry service has increased,” Chaudhry said, adding that various routes were under consideration. “The ferry service will promote regional connectivity and trade.”\n\n“The movement of passengers and goods from Gulf countries will become easier,” he noted, adding that the service will highlight Gwadar on the international maritime map.\n\nThe ministry also stated that the meeting included instructions to conduct further evaluations of the submitted proposals. “Authorities were directed to ensure that all regulatory, technical, and logistical considerations are fully addressed ahead of the ferry service launch,” it said.\n\nDuring the meeting, the maritime minister held a phone call with Balochistan Chief Minister Sarfraz Bugti and discussed provincial cooperation. Bugti “assured full cooperation in the ferry service project”, according to the ministry.\n\nIn a statement on X, the Balochistan government said, “The meeting discussed important matters related to the development of Gwadar, public facilities, and increasing employment opportunities for the youth.”\n\nCM Bugti was quoted as saying that the provincial government was giving “serious consideration” to the ferry service from Gwadar to Oman, which will “facilitate pilgrims and ease travelling for the local population”.\n\n“Assuring full cooperation from the Balochistan government, the chief minister stated that this initiative will prove to be a milestone in strengthening regional connectivity,” the statement read.\n\nThe Balochistan government also vowed to provide cooperation and support at every level for the full operationalisation of Gwadar Port.\n\n“All proposed development projects of the Gwadar Port Authority will be fully supported so that Gwadar Port can play a central role in the national economy,” the statement affirmed.\n\nThe statement also said that 1.2 million gallons of clean drinking water will be provided daily to Gwadar citizens through a desalination project that will be established under the Gwadar Port Authority, calling it a “significant step toward a lasting solution to the long-standing water issue”.\n\nCM Bugti was quoted as saying, “The government is committed to providing world-class training to the youth.”\n\nThe youth will be taught various skills under the Pak-China Technical Vocational Centre, while the provincial government’s program to train and provide overseas employment to 30,000 youths will be supported by the Pak-China Technical Vocational Centre, the statement added.\n\nToday’s development comes after Chaudhry visited the Gwadar port on Wednesday to review various ongoing development projects.\n\nThe country has recently increased efforts on the commercialisation of the Gwadar Port, which was built more than a decade ago but remains a non-starter, turning the multi-billion-dollar infrastructure facility into a white elephant instead of becoming a transhipment hub.\n\nEarlier this year, the government sought the private sector’s support in routing their cargoes through the port, seeking detailed proposals to enhance trade.\n\nPlanning Minister Ahsan Iqbal said Prime Minister Shehbaz Sharif had issued directives for devising short- and medium-term strategies to operationalise Gwadar Port effectively within six months. He emphasised the importance of comparing Gwadar’s trade costs with other regional ports.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:40:42.138Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924990/5-private-companies-submit-proposals-on-ferry-service-from-gwadar-to-gulf-region-maritime-ministry",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T09:58:59.000Z"
}
