{
  "title": "Indian right-wing group forces fast food outlet to shut its doors: media reports - World - DAWN.COM",
  "author": null,
  "content": "A group of right-wingers in India forcibly closed an outlet of the fast food chain KFC to close, demanding a ban on the sale of non-vegetarian food during the Hindu month of Sawan, according to reports by Indian media outlets on Friday.\n\nSawan, also known as Shravana, is considered a holy month in the Hindu calendar where many observe fasts and refrain from consuming meat, alcohol and even onions and garlic, according to Indian daily The Hindu.\n\nThe Hindu reported that a group of demonstrators stormed the outlet in Ghaziabad, Uttar Pradesh and confronted the staff, demanding that the restaurant’s operations be stopped.\n\n“Visuals of the incident circulated widely on social media showed members of the outfit carrying saffron flags and chanting slogans such as ‘Jai Shri Ram’ and ‘Har Har Mahadev’, while forcibly pulling down the shutter of the KFC outlet,” the newspaper added.\n\nAccording to The Times of India, Pinky Chaudhary, the chief of the group, said, “Our message is clear: we are asking that all non-vegetarian outlets to refrain from serving such food during the Kanwar Yatra. If they want to remain open, they should serve vegetarian options only.”\n\nThe Hindu reported that opposition parties assailed the governing Bharatiya Janata Party (BJP) for the incident, holding it responsible for “a deterioration in law and order”.\n\nThe Indian Congress party’s National Secretary, Shahnawaz Alam, was quoted by the newspaper as saying: “Such actions are a violation of the fundamental rights of citizens. When there is no ban, how can individuals storm a food chain and force it to shut down?\n\n“It is a design to create disorder in society through groups that have become mainstream after the BJP assumed power. Holy occasions are being used to fuel tension on communal lines,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/18222139f11f584.png",
  "retrievedAt": "2025-08-17T20:40:05.957Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925034/indian-right-wing-group-forces-fast-food-outlet-to-shut-its-doors-media-reports",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T17:03:35.000Z"
}
