{
  "title": "Pakistan beat India 3-0 in Asian Men’s U-16 Volleyball Championship semi-final - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan on Friday beat India 3-0 in the Asian Men’s U-16 Volleyball Championship semi-final being held in Nakhon Phanom, Thailand.\n\n“Team Pakistan U-16 Men’s Volleyball continues its dream run at the 2nd Asian Men’s U-16 Volleyball Championship 2025 in Thailand by defeating arch-rivals India in the semi-final,” the Pakistan Volleyball Association announced in a post on Instagram.\n\nPakistan beat India with a clean sweep by winning three straight sets (25-16, 25-19, 25-12).\n\n“Stellar performances from Junaid, Faizan, Irfan, and Talha powered the Green Shirts into the Final and one step closer to glory,” the association said.\n\nWith this victory, Pakistan qualifies for the final, where they will face Iran on July 19 at 3:30pm PKT.\n\nOn Wednesday, Pakistan secured a place in the semi-finals of the Asian U-16 Volleyball Championship and booked their berth in next year’s FIVB U-17 World Championship after defeating Indonesia in straight sets in the quarter-final.\n\nThe national side had registered another 3-0 victory with set scores of 25-23, 25-20, 25-20. Key contributions came from Junaid, Faizan, Talha, and Saran, who were instrumental in maintaining Pakistan’s unbeaten run in the tournament.\n\n“This win is not just about reaching the semi-finals; it’s about proving that Pakistan’s youth has the strength and skill to compete at the highest levels,” Pakistan head coach Kafiatullah had said. “Qualification for the FIVB U-17 World Championship is a moment of national pride.”\n\nEarlier in the group stage, Pakistan had overcome South Korea, Saudi Arabia and Chinese Taipei to advance to the knockout round.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/18175156c0eda2b.jpg",
  "retrievedAt": "2025-08-17T20:40:20.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925017/pakistan-beat-india-3-0-in-asian-mens-u-16-volleyball-championship-semi-final",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T12:44:26.000Z"
}
