{
  "title": "Pakistani cueists dominate world snooker championships - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistani cueists won two titles in one day at the International Billiards and Snooker Federation (IBSF) world snooker championships on Friday, with Muhammad Asif clinching the IBSF World Masters Snooker Championship and Hasnain Akhtar claiming victory in the World U17 Snooker Championship.\n\nAsif secured victory over Indian Brijesh Damani with a score of 4-3 by the seventh frame of play.\n\nEarlier, Hasnain beat Wales’ Riley Powell 4-0 in the final of the under-17 tournament\n\nThe former world amateur champion advanced to the final after securing a 4-2 win over India’s Manan Chandra in the semi-final held on Thursday at the Crowne Plaza Bahrain. The frame scores were 118-6, 0-84, 25-76, 92-11, 87-62, and 72-41.\n\nAsif qualified for the semifinals of the masters after defeating Habib Sabah (Bahrain) 4-0 (68(68)-8, 57-37, 68(68)-8, 40(40)-8) in the quarterfinal on Thursday.\n\nIn the pre-quarterfinals, Asif defeated Mohamed Shehab (UAE) 4-2 (56-68, 21-72, 57-21, 80(80)-0, 68-45(43), 68-58).\n\nThe championship featured 43 players from 15 nations divided into 11 groups. The top two players from each group were to advance to the knockout last-22 round.\n\nA day earlier, Akhtar moved in the final of the IBSF World Masters U17, U21 and Men 6Red Snooker Championships 2025 being held in Manama, the Associated Press of Pakistan reported.\n\nAkhtar beat Oliwier Nizialek of Poland 4-1 (76(41,34)-1, 69-8, 88(46,42)-0, 62-37) in the semi-final of the mega event. In the pre-quarterfinals, he had beaten Mutasim Al Saadi (Oman) 3-0 (75-41, 56(37)-31, 81-06).",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/18225210c4554b2.jpg",
  "retrievedAt": "2025-08-17T20:40:48.342Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1924987/pakistani-cueists-dominate-world-snooker-championships",
  "dateList": "2025-07-18",
  "date_published": "2025-07-18T08:09:29.000Z"
}
