{
  "title": "NTCB to submit tourism re-opening proposal to NCOC after Eid-ul-Azha",
  "link": "https://www.app.com.pk/national/ntcb-to-submit-tourism-re-opening-proposal-to-ncoc-after-eid-ul-azha/",
  "date_published": "2020-07-29T23:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):The National Tourism Coordination Board (NTCB) will put forward a proposal for re-opening of the tourism sector to the National Command and Operation Center (NCOC) after Eid-ul-Azha.  The decision to this effect was taken by the NTCB, which met here with Special Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development Sayed Zulfikar Abbas Bukhari in the chair. “A consultative meeting of the NTCB was held on Thursday with all provincial/regional governments to discuss appropriate time to re-open the tourism sector of the country,” a news release issued here said.\nThe meeting was attended by Advisor to the Chief Minister Punjab on Tourism Asif Mehmood, Pakistan Tourism Development Corporation (PTDC) Managing Director Syaed Intikhab Alam and NTCB and PTDC board member Aftab Ur Rehman Rana and all provincial and regional tourism secretaries.  Discussing the various options for tourism re-opening, the participants unanimously agreed that the decision in that regard should be taken by the NCOC after evaluating on the ground situation of the coronavirus pandemic in the country.\nThe meeting also deliberated on safety measures and preparedness for re-opening tourism services. All the provincial and regional governments apprised the NTCB chairman that the tourism related guidelines for tour operators, hotels, restaurants and tourist places were ready. The participants were of the opinion that time was ripe for the tourism sector to restart as the COVID-19 curve had started flattening in the country. However, the situation needed to be closely observed on Eid and during the Muharram-ul-Haram.\nThe provincial and regional heads of tourism were told that necessary preparations and awareness should be undertaken so that opening of controlled tourism under SOPs (standard operating procedures) could be made possible after the final decision of NCOC.\nSAPM Sayed Zulfikar Bukhari appreciated the support extended by the government of Khyber Pakhtunkhwa to tourism businesses in renewal of licenses and registration fee.\nHe urged other provincial governments to consider similar support initiatives for tourism businesses that had suffered substantially during the prevailing situation.",
  "retrievedAt": "2025-08-11T19:34:13.288Z"
}
