{
  "title": "President says proud of nation’s discipline in SOPs compliance against coronavirus",
  "link": "https://www.app.com.pk/national/president-says-proud-of-nations-discipline-in-sops-compliance-against-coronavirus/",
  "date_published": "2020-07-30T03:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):President Dr Arif Alvi on Thursday said Pakistan’s success in minimizing the impact of coronavirus pandemic lay in Allah’s blessings, the government’s smart lockdown policy and the nation’s discipline in following the standard operating procedures (SOPs). “I am proud of Pakistanis who showed great discipline in adopting safety measures, which has been even neglected in the West. I want you to continue the same behavior this Eid,” the President said in a special video message, urging people to continue compliance of SOPs in the wake of Eid ul Azha, falling on Saturday.\nPresident Alvi said Pakistan was able to control the situation of coronavirus significantly as a downward trajectory of cases was witnessed after June 20. He mentioned that the government did not panic the situation and implemented the best strategy to overcome the situation. The President said Ehsaas Emergency Cash Programme provided financial assistance to the poor during lockdown. He said with spike of coronavirus cases in the neighbouring country, the myth about the virus for not surviving hot weather conditions, was busted.\nThe President advised the nation to adopt special caution on upcoming Eid ul Azha by wearing mask, maintaining social distancing and avoiding gatherings. “Wear face masks, offer prayers at a distance, and make sure no handshaking and embracing on Eid,” he said.\nHe urged upon the elderly to offer Eid prayers at homes and said that he would also do the same. The President asked the people to adopt SOPs while buying sacrificial animals at cattle markets.  “InshaAllah, we will defeat the challenge of coronavirus with our united efforts,” he said.",
  "retrievedAt": "2025-08-11T19:34:26.091Z"
}
