{
  "title": "Ban on 4G internet service in IOK extended till August 19",
  "link": "https://www.app.com.pk/national/ban-on-4g-internet-service-in-iok-extended-till-august-19/",
  "date_published": "2020-07-29T20:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):In Indian Illegal Occupied Jammu and Kashmir, the authorities have extended till August 19 ongoing ban on the high speed internet services in the territory, which is under military siege for the past almost one year.\nAccording to Kashmir Media Service, an order issued by the principal Home Secretary of Indian Illegal Occupied Jammu and Kashmir said the restrictions on access to internet through mobile data services have been “necessitated” in view of the prevailing situation.\n“There are inputs suggesting rise in the anti-national activities over the coming weeks, more so in view of completion of an year since implementation of the constitutional changes viz-a-viz J&K, (Indian) Independence Day celebrations, etc,” reads the order.\nSubsequently, the Principal Secretary said that it was absolutely necessary in the interest of the sovereignty and integrity of India, the security of Indian occupied Kashmir and for maintaining public order, the internet access across occupied Kashmir shall be made available with 2G only.\n“The directions shall remain in force up to August 19, 2020, unless modified earlier. The IsGP, Kashmir/Jammu shall ensure communication of these directions to the service providers and ensure implementation of these directions forthwith,” the order added.\nIt is to mention here that Narendra Modi-led fascist Indian government had suspended the internet and mobile phone services in Illegal Occupied Kashmir on August 05, 2019 when it revoked the special status of the territory and placed it under military siege.\nAlthough, the Indian government claims that landlines phones and 2G internet services have been restored in the occupied territory but the residents continue to suffer immensely due to absence of prepaid mobile and 4G internet connectivity, particularly after the outbreak of coronavirus, which has wreaked havoc across the world.\nHurriyat leaders, political activists and several international organizations working for rights of common people and journalists including Amnesty International, Human Rights Watch, Reporters Without Borders and Committee to Protect Journalists have time and again demanded restoration of 4G internet service in occupied Kashmir to help the residents of occupied Kashmir to deal with an unprecedented situation caused by the outbreak of COVID-19. However, the Modi regime has paid no attention to the pleas and keeps on extending the ban on the service.",
  "retrievedAt": "2025-08-11T19:34:19.040Z"
}
