{
  "title": "Fakahr Imam stressed revitalizing seed technology for sustainable agriculture, economic growth",
  "link": "https://www.app.com.pk/national/fakahr-imam-stressed-revitalizing-seed-technology-for-sustainable-agriculture-economic-growth/",
  "date_published": "2020-07-30T00:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 30 (APP):Minister for National Food Security and Research Syed Fakhar Imam Thursday stressed the need for revitalizing seed technology to enhance per-acre yield for sustainable economic growth in the country. Chairing a video link meeting on the cotton crop with Punjab Agriculture Minister Malik Nauman Ahmad Langrial, Fakhar Imam said as per Rules of Business, his ministry was a policy planner for the agriculture.\n“We need to modernize our seed technology of major crops,” he said, adding the GMO (genetically modified organism) cotton varieties planted in Pakistan were the First Generation Bt cotton which had disoriented their resistance against PBW and caused sever damage to cotton crop during last season.\nHe said the new seed technology belonged to the multi-national companies, which were not interested to introduce its seed varieties in Pakistan.  Some local public and private research institutes, he said, had developed multiple gene varieties, which proved to be effective in preliminary trials.\n“The genes have passed through clearance from National Bio-safety Committee (NBC) of the Ministry of Climate Change, he said, adding the normal approval process required two year’s testing in NCVT, two years DUS (distinctiveness, uniformity and stability) trial and then clearance from the NBC.  Considering the need of the day, he said, the Punjab Government had proposed to shorten the approval process and accord provisional approval on the bases of one-year trials to varieties having new technology or extraordinary traits.\n“This requires a change in Seed Rules, which is under submission for the consideration,” Fakhar Imam said, adding a four-member committee would be constituted on Seed Act. Secretary NFS&R Omar Hameed Khan would prepare its terms of reference and within three weeks it would would make recommendations.\nHe said after the 18th Constitutional Amendment, Punjab promulgated its own pesticide regulations and rules, and enforced them. “The Federal Government regulates pesticide import and its quality. It has the mandate to ensure pesticide quality at import and pesticide formulation plants.” Punjab requested to notify agriculture officers as seed inspectors under Section 28 (a) of the Seed Act 1976 to enhance regulation and crackdown against brown bag seed business.\nThe revitalization of Punjab Seed Corporation was also discussed in the meeting as the corporation was a source of cotton and wheat seed for not only Punjab but also used to cater to the seeds requirement of Khyber Pakhtunkhwa and Sindh. It was noted that the presence of public sector entities in field set a baseline for the private sector. Secondly, public sector seed production could come into the business for the vulnerable community and crops like pulses.\nConsidering the lower seed supplies by the private seed companies during the current year, it was agreed that the public sector should produce at least 20% share of seed production of major crops like wheat and cotton. The prices of seed might be fixed at a reasonably lower side. Pesticides for whitefly management were discussed by the Technical Committee represented by provinces, academia, DPP (Department of Plant Protection), and PCCC (Pakistan Central Cotton Committee).",
  "retrievedAt": "2025-08-11T19:34:28.959Z"
}
