{
  "title": "UN terms Ehsaas as international best practice",
  "link": "https://www.app.com.pk/national/un-terms-ehsaas-as-international-best-practice-2/",
  "date_published": "2021-10-09T11:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP): Pakistan’s Ehsaas programme had been featured as an international the best practice in the recently released edition of United Nations Principles for Responsible Digital Payments 2021 report.\nAccording to UN’s report, Ehsaas simplified the know-your-customer procedure for users by collecting simple data fields and issuing accounts after basic verification.\nIncentivized 500,000 branchless banking agents to work with the program by reducing taxes on commission earned from beneficiaries, thereby increasing doorstep banking services to elderly, persons with disability, and women.\nOn a twitter message, Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar said, “Glad to see Pakistan’s Ehsaas continue to be lauded as international best practice by the UN as it looks to accelerate Responsible Digital Payments to advance developmental progress.”\nEhsaas programme emerged as the largest social protection program in the history of the country in times of COVID-19 pandemic last year by benefiting almost half of the country’s population.   Rs.179 billion Ehsaas Emergency Cash provided a one-time cash grant of Rs.12,000 to 15 million families (nearly 109 million people) at risk of extreme poverty.     This year as well, one million eligible families were being paid Ehsaas cash.\nTo deliver Ehsaas Emergency Cash, digital capabilities established as part of Ehsaas were adapted, in particular, a new biometric payment system, a demand side SMS based request seeking platform and a new wealth profiling big data analytics mechanism.\nThe digitally enabled payment system fully relied on the use of mobile phones and biometric verification to strengthen the link between government assistance and social protection.\nEhsaas Emergency Cash payments were made through branchless banking platforms of two commercial banks (in retail settings and specially established payment campsites) and their 1,800 biometrically enabled ATMs. The available cash out points in 2,270 campsites were more than 11,500.\nProvincial governments and their security apparatus were responsible for logistic arrangements on ground at the payment campsites to coordinate payments in over 2,270 locations across the country, covering an area of over 881,000 square kilometers.\nMoney was deposited in limited mandate accounts and individuals were able to draw the money after biometric authentication in real time.\nThe United Nations Principles for Responsible Digital Payments advocated for responsible practices in the digitization of payments.\nThese principles had been developed by the United Nations-based better than Cash Alliance, guided by its member governments, companies and international organizations.\nThis flagship resource responded to the UN Secretary General’s Roadmap for Digital Cooperation.",
  "retrievedAt": "2025-08-11T21:25:56.488Z"
}
