{
  "title": "Dubai Expo 2020 offers unprecedented opportunities for investment: Dr Alvi",
  "link": "https://www.app.com.pk/national/dubai-expo-2020-offers-unprecedented-opportunities-for-investment-dr-alvi/",
  "date_published": "2021-10-08T19:08:00.000Z",
  "source": "APP",
  "content": "In an exclusive interview with Gulf News, he said the sectors which could attract foreign investment included renewable energy; mineral resources; real-estate; engineering; information technology; agriculture; and tourism.\nTo a question, he said Dubai Expo 2020 was a mega event, which will run for 6 months with the participation of around 192 countries. It was going to be one of the largest global events that would connect governments, private sector, and general public.\nWith the theme, the ‘Hidden Treasure’ Pakistan Pavilion aimed to showcasing the soft image of Pakistan, and the rich cultural heritage of the country.\nHe said, “it was heartening to see the overwhelming response received by the visitors from all parts of the world. Our active presence in the expo also signifies our renewed focus on geo-economics.”\nHe said the brotherly relationship between Pakistan and the United Arab Emirates had stood the test of time and progressed over the years.\n“We have maintained regular leadership-level interactions, aimed at reviewing and enhancing political, economic; trade and investment; cultural; and defense cooperation.”\n“An all-encompassing strategic relationship, improved economic ties, sharing of knowledge and technology as well as cooperation in tourism and social sectors are the areas of our immediate focus.”\n“Moreover, overseas Pakistanis are a great asset for the country. Pakistan greatly values their contribution who always bring pride to the nation. Pakistanis around the world in general, and those in the Gulf Region in particular, have contributed a lot to the economic development of our country,” he added.\nThe President said the relationship between two brotherly countries was also people-centric and consistently nurtured by 1.6 million strong Pakistani Diaspora in the UAE.\n“They are an effective bridge between our two nations and a source of pride for Pakistan. I would also like to add about our larger vision: strengthen relationship with Muslim countries. This is the corner stone of our foreign policy.”\nPakistan offered a unique opportunity to the Arab World, especially the Gulf Region to access Chinese and Central Asian economies through Pakistan ports and highways, he explained.\n“We are also connected with Europe through road and rail links via Iran and Turkey.”\nTo another question, he said Pakistan was closely following the developments taking place in Afghanistan and was in contact with the international community on this issue. “We also remain engaged with Afghanistan because we cannot afford to disengage.\nBeing the immediate neighbor of Afghanistan, with 2600 km long border and host to nearly 4 million Afghan refugees, we have an abiding interest and desire for peace and stability in Afghanistan. We have consistently underscored the need for a political solution and have supported every effort for peace in Afghanistan. We have remained part of all mechanisms, regional and international, aimed at bringing peace and stability in Afghanistan.”\nAlong with Afghanistan, Pakistan itself had been the biggest victim of the situation, having lost over 80,000 lives and over 150 billion dollars in economy, besides hosting millions of refugees. No other country or people had suffered and sacrificed as much, he commented.\nDr Arif Alvi said peace in Afghanistan was also critical to realize our vision of regional connectivity, economic integration and development. That explained our interest in a peaceful and stable Afghanistan. Therefore, the country most desirous of peace in Afghanistan is Pakistan.\n“I would also like to share Pakistan’s efforts to facilitate evacuation or temporary relocation of members of the international community from Afghanistan, including diplomats and staff, representatives of international organizations, media, and others.\nThe Embassy of Pakistan in Kabul is open, fully functional and is providing consular services and all possible assistance to Afghans, Pakistanis and other nationals. A 24/7 special inter-Ministerial cell has also been established in the Ministry of Interior for facilitation in visas on arrival and other related matters.”\n“I am pleased to share that Pakistan’s facilitation for the evacuations from Afghanistan has been widely acknowledged by world leaders and heads of international organizations. With WFP, we are also facilitating the establishment of humanitarian air bridge. We have also been providing humanitarian assistance to Afghanistan.”\n“We also continue to emphasize that sustained, constructive engagement of the international community is imperative to avoid a humanitarian crisis and help ensure durable peace and stability in Afghanistan. Well-being of the Afghan people should be the foremost priority,” the President added.\nHe said as a part of the larger Muslim Ummah, the relations with Gulf countries were of paramount importance for Pakistan.\n“We have longstanding relations with these countries based on common faith, culture, values and shared history.Despite the linguistic, cultural, and ethnic differences, Islam continues to serve as a unifying bond for all peoples across the Islamic countries. Strong multi-faceted ties with Gulf countries are therefore central to Pakistan’s foreign policy.”",
  "retrievedAt": "2025-08-11T21:25:58.281Z"
}
