{
  "title": "Diamer Bhasha Dam project ready for commencement of physical work, PM told",
  "link": "https://www.app.com.pk/national/diamer-bhasha-dam-project-ready-for-commencement-of-physical-work-pm-told/",
  "date_published": "2020-05-11T10:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):Prime Minister Imran Khan was informed on Monday that as per his directions all issues related to the critically important Diamer Bhasha Dam, including settlement, detailed roadmap for mobilization of financial resources etc. had been resolved and the project was ready for commencement of physical work.\nChairing a meeting here on national water security strategy and construction of dams to meet agricultural as well as energy requirements of the country, the prime minister expressed satisfaction over the progress made so far and directed to immediately start construction activities of the dam.\nThe meeting was attended by Minister for Water Resources Mohammad Faisal Vawda, Minister for Planning Asad Umar, Minister for Information Senator Shibli Faraz, Minister for Kashmir Affairs and Gilgit Baltistan Ali Amin Gandapur, Special Assistant to the PM on Information Lt. Gen. (R) Asim Saleem Bajwa, Water and Power Development Authority (WAPDA) Chairman Lt. Gen. (R) Muzammil Hussain and other senior officers.\nThe prime minister was briefed in detail about the progress of resolution of all pending issues related to the construction of Diamer Bhasha Dam.\nThe meeting was informed that the Diamer Bhasha project had remained stuck for decades due to various reasons. It was told that the dam’s construction would create 16,500 jobs and utilize huge quantity of cement and steel, which would give boost to the industry, besides its main purposes of water storage and producing 4500 MW of cheap and affordable electricity for meeting energy requirements of the country.\nThe 6.4 MAF (Million Acre Feet) water storage capacity of the dam would reduce the current water shortage in the country of 12 MAF to 6.1 MAF. It would add 35 years to the life of Tarbela Dam by reducing sedimentation. An area of 1.23 million acres of land would be brought under agriculture due to the dam.\nIt was informed that an amount of Rs. 78.5 billion would be spent for social development of the area around Diamer Bhasha Dam as part of the project. It would also be a major source of flood mitigation and save billions worth of damages caused by flood each year.\nThe prime minister said ensuring water security was the foremost priority of the present government.\nBesides optimum utilization of the available water resources for agricultural needs, construction of the dams in the country would help meet energy requirements at affordable rate, he added.\nThe prime minister directed that use of local material and expertise be accorded priority during the construction work, which would provide huge job opportunities to the people.\nIt would also boost the construction and related industries, and provide a huge stimulus to the economy, he added.\nThe WAPDA chairman briefed the meeting about the progress of ongoing construction of Mohmand Dam that started recently.\nThe prime minister expressed satisfaction over the speed of work.\nHe was also apprised of the progress on resolution of pending issues related to the Dasu Dam project. He expressed satisfaction over the progress made so far and directed to ensure expeditious commencement of the critical Dasu project.\nThe prime minister was briefed that funds had been arranged for Noulong Dam, Jhal Magsi district Balochistan and that the work would commence next year.\nImran Khan emphasized on starting Sindh Barrage as a priority project as it had huge benefits of addressing agriculture needs of the province. It would stop erosion of soil from sea water and also improve drinking water situation for urban centers of Sindh.\nThe prime minister appreciated the efforts of Ministry of Water Resources and WAPDA for pursuing projects passionately to realize the dream of self-reliance in food security, industry and exports.\nHe also reiterated his emphasis on keeping a close watch on quality of work and meeting the timelines.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:09.992Z"
}
