{
  "title": "Govt countering effects of coronavirus with relief packages: Hammad",
  "link": "https://www.app.com.pk/national/govt-countering-effects-of-coronavirus-with-relief-packages-hammad/",
  "date_published": "2020-05-11T01:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):Minister for Industries and Production Hammad Azhar Monday said the government was countering the economic challenges arising due to the coronavirus pandemic with an economic stimulus package of Rs 1,200 billion and by providing financial assistance to 12 million people under the Ehsaas programme.\nSpeaking in the National Assembly, he said the government would give financial assistance to the unemployed people and provide relief in electricity bills of industrial and commercial consumers.\nThe minister said the number of unemployed persons could have increased to 20 million to 70 million, if the lockdown continued in its previous form. The He said Pakistan Institute of Development Economics (PIDE) had made that projection of unemployment.\nThe Sustainable Development Policy Institute (SDPI), he said, had projected that 0.9 million small businesses would have permanently closed down if the strict form of lockdown was followed.\nHe said all the developed countries were trying to adopt the smart lockdown and Pakistan was doing the same.\nHe said the coronavirus originated in Wuhan, China and now was present in more than 200 countries. Lockdown was meant to slow down the spread of coronavirus and when countries like Japan, Germany and Singapore lifted the lockdown, the virus started to spread again, he explained.\nThe minister said the problem of Pakistan was that more than 25 percent of people were living below the poverty line and according to a Gallup Poll survey last month, seven million families reduced their food supplies because of less financial resources during the coronavirus pandemic.\nAbout 25 million people said they were borrowing money from their relatives and friends to meet the food needs, he added.\nHammad said 14 new hospitals and trauma centers were established in Khyber Pakhtunkhwa and universal health insurance was introduced in the province.\nThe lowest per capita health spending was done in Pakistan from 2008 to 2018 and malnourishment was a major issue, he added. About 70 percent of the health needs of the people were met by the private sector.\nHe said during the meetings of National Command and Control Center all decisions about the lockdown were taken in consensus with the provinces.",
  "retrievedAt": "2025-08-11T19:12:15.477Z"
}
