{
  "title": "President for improved accessibility of Internet facility in rural areas",
  "link": "https://www.app.com.pk/national/president-for-improved-accessibility-of-internet-facility-in-rural-areas/",
  "date_published": "2020-05-11T10:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):President Dr. Arif Alvi Monday directed the Ministry of Information Technology & Telecommunication (IT & Telecom) to improve accessibility of Internet facility in the rural areas as well as to build innovative IT-based solutions and skills so as to meet the economic and technological challenges.\nHe was chairing the second meeting of the committee on emerging technologies here at the Aiwan-e-Sadr, a press release said.\nHighlighting the significance of Information and Communication Technologies (ICT), the president said it had enormous potential to play a vital role in improving the national economy, commerce, exports, education, health, governance, construction industry, agriculture and other important sectors.\nThe ICT played a significant role during the current COVID-19 crises as the technologies accelerated the digitalization of many businesses and services, including online working and video conferencing systems in and out of the workplaces, access to healthcare, education and other essential goods and services, he added.\nThe meeting was attended by Minister for IT & Telecom Syed Aminul Haque and Secretary Shoaib Ahmed Siddiqui, Special Assistant to the Prime Minister on Digital Pakistan Ms Tania Aidrus, and representatives of provincial governments, including Azad Jammu & Kashmir and Gilgit Baltistan, and IT experts through video conference.\nThe president emphasized the need for reinvigorating the vital sector by engaging foreign-based Pakistani IT experts to play their role in the technological development of the country.\nIn order to improve Internet coverage in rural areas, he directed the Ministry of IT & Telecom to initiate measures to enhance the coverage of Internet facility in rural areas so as the students could have uninterrupted access to the online education.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:12:10.056Z"
}
