{
  "title": "Kalapani row: Nepal announces to deploy more forces at India border, says FM Gyawali",
  "link": "https://www.app.com.pk/national/kalapani-row-nepal-announces-to-deploy-more-forces-at-india-border-says-fm-gyawali/",
  "date_published": "2020-05-11T01:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 11 (APP):Nepal will increase the number of security outposts and deploy more armed personnel at the border with India, Foreign Minister Pradeep Gyawali has announced.\nThe senior minister said Kathmandu expects India to avoid any unilateral measures in the Kalapani region and remain committed to the ‘fixed border’ principle as agreed during the past official talks, The Hindu reported on Sunday.\n“The number of border posts on our side is less when compared to the security arrangement on the Indian side. We have approximately 120 border posts at present and are planning to increase the numbers in future,” said Gyawali told The Hindu over the phone from Kathmandu.\nNepal’s decision follows protests in Kathmandu on Saturday after Defence Minister Rajnath Singh on Friday inaugurated a link road to Lipulekh pass that will reduce the travel time for pilgrims to Kailash Mansarovar region.\nIn a strongly worded statement, Nepal’s Foreign Ministry had said the decision to build the road through territory that it claims is a breach of an agreement reached between the two countries to discuss the matter.\nEarlier, responding to questions in the Nepali parliament on Sunday, Gyawali said the government of Prime Minister K.P. Sharma Oli was committed to protecting the sovereignty and territorial integrity of Nepal.\nHe said India “should refrain from further activities in the region”.\nThe Kalapani region is claimed by Nepal but India has been maintaining that the new political map of 2019 has shown the territory “accurately” as part of Uttarakhand.\nReflecting Nepal’s official position, Mr. Gyawali said the link road has been built in the territory that historically belongs to Nepal.\n“As per the Sugauli Treaty of 1816, the territory to the east of the Mahakali river belongs to Nepal and both sides had agreed way back in 1988 to follow the principle of ‘fixed border’ in determining the border of Nepal,” Mr Gyawali said.\nThe principle of ‘fixed border’, the Minister said, was agreed to deal with the areas where the border is determined by the course of rivers.\nHe added, “By the principle of fixed border we will determine the border based on the course of the rivers in the 19th century maps and not on the basis of contemporary human settlements.”\nNepal Communist Party’s Co-Chairman Pushpa Kamal Dahal ‘Prachanda’ also told the Nepali parliament that Nepal should go beyond diplomatic means in settling the border dispute with India.\nGyawali however maintained that Kathmandu favoured a diplomatic settlement of the issue and said he had asked New Delhi for an early resumption of foreign secretary-level talks.",
  "retrievedAt": "2025-08-11T19:12:16.268Z"
}
