{
  "title": "Pakistan condemns UP CM’s statement about taking back ‘Sindhu’",
  "link": "https://www.app.com.pk/national/pakistan-condemns-up-cms-statement-about-taking-back-sindhu/",
  "date_published": "2023-10-09T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 9 (APP): Pakistan on Monday condemned the “highly irresponsible” remarks made by the Chief Minister of Uttar Pradesh about taking back ‘Sindhu’ -the region around the Indus River in Southern Pakistan, saying that the provocative remarks were inspired by the gratuitous assertion of ‘Akhand Bharat.’\n“We condemn the highly irresponsible remarks made by the Chief Minister of Uttar Pradesh, a key member of India’s ruling dispensation and a follower of the bigoted Hindutva ideology, at the National Sindhi Convention in Lucknow. It is equally condemnable that the so-called reclamation of the ‘Ram Janmabhoomi’ has been cited by the Chief Minister as a template for reclaiming the region that constitutes part of Pakistan,”\nForeign Office spokesperson Mumtaz Zahra Baloch said in a statement.\nShe said that history bore witness that a Hindu supremacist mob had brazenly demolished the historic Babri Mosque on 6 December 1992 to take back the claimed birthplace of Lord Rama in Ayodhya.\nShe said clearly the chief minister’s provocative remarks were inspired by the gratuitous assertion of ‘Akhand Bharat’ (undivided India).\n“These remarks manifest a revisionist and expansionist mindset that seeks to subjugate the identity and culture of not only India’s neighbouring countries but also its own religious minorities. They also reflect a perverse view of history,” the spokesperson remarked.\nShe said it was a matter of grave concern that such ideas were being increasingly peddled by individuals belonging to the BJP-RSS combine to further their divisive and parochial political agenda.\nInstead of nurturing hegemonic and expansionist ambitions, the Indian leaders should resolve disputes with neighbouring countries, and work with them to build a peaceful and prosperous South Asia, she added.",
  "retrievedAt": "2025-08-11T10:00:42.118Z"
}
