{
  "title": "Resilience Day evokes nations firm resolve against all crises, calamities: Speakers",
  "link": "https://www.app.com.pk/national/resilience-day-evokes-nations-firm-resolve-against-all-crises-calamities-speakers/",
  "date_published": "2023-10-09T11:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP): The speakers at ‘National Resilience Day 2023’ seminar on Monday expressed homage and sincere prayers for survivors and martyrs of the devastating earthquake of 2005 that jolted the entire country and termed the Day reminding the nation’s firm resolve against all crises and calamities.\nThe National Disaster Management Authority (NDMA) organised one-day seminar under the title Towards Disaster Resilient Pakistan here at the National University of Sciences and Technology (NUST).\nThe seminar commenced with the showcasing of two short documentaries highlighting Pakistan’s disaster timeline and National Emergencies Operations Centre establishment and development of the first ever National Common Operating Picture for disaster management.\nIn his opening remarks, Chairman NDMA, Lieutenant General Inam Haider Malik said it was the moment to extend our heartfelt prayers and wishes to all those who braced disasters and also to the martyrs who embraced martyrdom in the disasters from 2005 onwards.\nThe country, he said had a long history of experiencing natural and man-made disasters, whereas the experiences from those events helped in gathering information.\nHe added that the country was in the middle of recovering from the devastation of the floods of 2022.\nThe authority, he said was witnessing the erratic behavior of disasters world over and in the region.\nHowever, keeping in view the account of destruction caused by the 2022 floods; Pakistan could not afford any more of such disasters further.\nThe chairman highlighted the National Vision for Proactive Management for Disaster Management in Pakistan and stated that the Disaster Management System in Pakistan was currently undergoing a transformation, shifting from a reactive to a proactive approach.\nHe briefed about the establishment of a modern National Emergencies Operation Center (NEOC) at NDMA inaugurated by Prime Minister on 5th October 2023.\nHe underlined the capabilities of NEOC enabled by multiple satellite feeds, softwares, Artificial intelligence tools to generate National Common Operating Picture (NCOP) which would strengthen digital risk assessment, early warning systems and preparedness strategies for Pakistan.\nA video message of Chairman Senate Standing Committee on Defence Senator Mushahid Hussain Sayed was also displayed.\nMushahid Hussain Sayed said that it was the 18th anniversary of the October 8th earthquake that shook the entire country and the Pakistani nation bounced back to the noted history’s most violent earthquake with rigour and national spirit.\nDespite massive devastation, he said the country reconstructed and rehabilitated its damaged parts which was the essence of the Pakistani spirit that never submits and considers disasters and crisis were temporary.\n“It marks a sort of national rejuvenation to remember those who lost their lives and the national spirit that helped rehabilitate the destructed regions of the country,” he added.\nChief Guest former Air Chief Marshal Sohail Aman said during the 2005 earthquake, the armed forces did the massive heli sorties.\nHe said the disaster risk management was all about emotions and responsibility but at presents times it was needed to be handled scientifically.\n“We are one of the best countries ending up disasters with great philanthropic work. However,\nmassive awareness is important in this regard to make the masses and stakeholders realize that we are the worst impacted due to climate change,” he added.\nAir Chief Marshall (R) Sohail Aman said policy level interventions at the government level were necessary whereas it was pertinent to consider that the women were the worst impacted due to disasters and need to be looked after in disasters.\nDuring the first session titled Archived Reflections Pak Exposures to Disasters led by former Chairman NDMA Lieutenant General (R) Nadeem Ahmed shared their experiences and lessons learnt from their experiences during the 2005 earthquake.\nLieutenant General (R) Nadeem Ahmed said the 2005 earthquake incurred massive losses in terms of lives, property, infrastructure and communities.\nHowever, the relief operations during the 2005 earthquake were the largest helicopter relief sorties in the history of mankind as some 30,474 heli sorties were flown to provide assistance and manage relief.\n“We used UN organisations, civil society organisations to drive the relief efforts in quake-hit areas and for inaccessible areas the military was approached. It helped in providing relief on time and no one died of hunger. Pakistan only faced the first wave of death whereas further losses were circumvented and the credit goes to our medical experts,” he added.\nShedding light on lessons learnt, he said four priority areas namely food, shelter, health and water should be focussed during such important calamities.\nHe added that the government should not hesitate to deploy military in disasters because they have the resources and were the quickest responders to emergent situation.\nHe added that joint and integrated logistics should be created in disasters whereas media management was extremely important, do not prolong a relief beyond a threshold as there is no concept of reconstruction without relief.\nVice President, Al-Khidmat Foundation, Air Marshal (R) Farooq Habib said the scale of disasters faced by Pakistan was so extent that no Pakistani could remain aloof from it’s impacts.\nHe added that the beautiful terrain of the country was prone to disasters, whereas climate change was one of the serious risks posing long-term security threats to the country.\nAdvisor to AJK Government, Masood ur Rehaman said the 2005 earthquake was a great tragedy and the most difficult relief activities were done as his own family members were under the rubble of dilapidated houses.\nClimate Expert, Ali Tauqeer Sheikh said if Pakistan had benefited from the lessons learnt from 2005 earthquake, then the damage in 2010 floods would have been low whereas adhering to those experiences would have helped in avoiding the 2022 floods.\nHe underlined the need to create synergies between the policy instruments as all national policy instruments were functioning in silos.\nChairman, Federal Flood Commission (FFC), Ahmed Kamal said there were erratic changes to the monsoon system of the region which has increased recurrence of heavy rainfalls.\nHowever, the country was still working on developing a proactive approach. He noted that the systematic hiccups were hindering the country’s journey to achieve proactive and coherent system for disaster management.\nDeputy Executive Director, Sustainable Development Policy Institute (SDPI), Dr Shafqat Munir Ahmed said disasters had become a recurrent phenomenon and it was important to find how to cope with it.\nHe added that it was required to focus on developing resilience of the society that faces other threats of violent extremism, extremism and others.\nHe highlighted that the country needed finances to enhance it’s resilience and establish enduring infrastructure that was resilient and these funding would come from our own resources as all the stakeholders would have to collaborate with each other.\nHe recommended that there should be at least ten percent in the budget to focus on disaster recovery and rehabilitation.\n“The UN flash appeals were not met in terms of climate finance. We will have to look into local resources and focus on reduction of our carbon footprint to achieve climate resilience. Moreover, it is necessary to club Disaster Risk Reduction (DRR) Framework and Climate Change Adaptation to focus on community based DRR,” he said.\nHead of office UNOCHA, Carlos Geha said Pakistan is a nation of diverse culture and rich history that is facing recurring disasters from floods to droughts.\nThe natural disasters have taken thousands of lives but Pakistan is on the right track and taking great steps since 2005 earthquake, he said.\nGeha added that the country has been successful to establish it’s efficient disaster response infrastructure through military, civil and philanthropic organisations.\nHe suggested that it was needed to take the contingency planning to the community levels and work closer with the communities.\nSecretary Emergency Services Punjab, Dr Rizwan Naseer said the 2005 earthquake was a difficult situation that posed a massive challenge to respond with no disaster management organizational infrastructure on ground.\nHowever, it took Rescue 1122, the first emergency service of Pakistan, more than a decade to reach from a local emergency service to be the first Insarag Certified in South Asia.\nAll the provinces have replicated emergency service model but Sindh and Balochistan were still lagging behind which needed to be probed, he said.\nHe mentioned that lack of capacity and accountability was the issue in the realm of disaster management at the grassroots level that needed to be addressed. He suggested that a single national institution for land use and building control authorityshoukd be established which would help mitigate many hazards and disasters.\nInternational Organization of Migration, Senior Programme Manager, Suzana Paklar said it was very important to not rely on that generic resilience but rather compliment it with further preparations.\nShe added that timely, compelete and consistent information sharing was important be it earthquake as science was progressing and reaching closer to predict earthquake this could help in early warnings.\n“It is necessary to train mind and body to respond to disasters and same is with the communities.\nKnowledge and capacity building should not be associated with individuals but rather institutions,” she added.\nThe second session was on Anticipatory Actions, Global Expectations, Proactive Approach. The second session discussed the future trends and scenarios of disasters and the need for anticipatory actions and proactive approach to reduce disaster risks.\nThe chief guest of the second session was Muhammad Sami Saeed, Minister for Planning, Development and Special Initiatives, who lauded the role of NDMA in coordinating and facilitating the disaster management activities in the country.\nHe also emphasized the need for investing in disaster risk reduction and resilience building as a key component of sustainable development.\nThe guest of honour of the second session was Lt Gen (Retd) Omer Mahmood Hayat, Ex-Chairman NDMA, who highlighted the achievements and challenges of NDMA in implementing Disaster Risk Reduction interventions in the country.\nThe seminar’s panelists included Masood Ur Rehman, Special Secretary to the Prime Minister, AJ&K, Dr. Naseer Ahmed , Secretary Emergencies Services Punjab, Bilal Anwar, CEO, NDRMF and heads of international humanitarian organisations, government departments, disaster management, IT experts and academia.\nThe participants appreciated the initiative of NDMA to organise such a seminar and expressed their commitment to work together for a safer and disaster resilient Pakistan.",
  "retrievedAt": "2025-08-11T10:00:45.359Z"
}
