{
  "title": "Constitution, law not subject to wishes of chief justice: CJP",
  "link": "https://www.app.com.pk/national/constitution-law-not-subject-to-wishes-of-chief-justice-cjp/",
  "date_published": "2023-10-09T16:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP): Chief Justice of Pakistan Qazi Faez Isa on Monday remarked during the hearing of petitions against the Supreme Court Practice and Procedure Act 2023 that the constitution and law are not subject to the wishes of the chief justice.\nWe are bound by the constitution and the people, he said, adding that the chief justice should not go beyond the provisions of the constitution and law.\nA 15-member full court bench presided by Chief Justice Qazi Faez Isa heard the case. Additional documents were also submitted by the lawyers of the parties in the Supreme Court on the occasion.\nDuring the course of the proceeding, President Supreme Court Bar Association (SCBA) Abid S. Zuberi gave arguments and said that the Parliament was not authorized to form rules for SC.\nThe chief justice said that regarding the rules of the Judicial Commission and the Supreme Judicial Council, it is written in the constitution that the constitutional bodies will make the law themselves.\nHowever, when it comes to SC, Article 191 states that the rules of the SC could also be made by law, he said, adding that the point is that the legislators had themselves given the option of law.\nThe Chief Justice of Pakistan asked how 184/3 was used in Pakistan. Whether the human rights cell had been mentioned in the constitution or the SC rules. If a Chief Justice makes a mistake, whether the Parliament can correct it or not, he questioned.\nAddressing Abid Zuberi, the CJP said that our work will increase by getting the right to appeal. Why you are worried, he asked.\nJustice Jamal Mandokhail said that if you want to see the intention of the legislators, then look at Article 175. If the framers of the Constitution had to give complete authority to the Supreme Court, they would have clearly written that any regulation that conflicts with the law or the Constitution would automatically be null and void, he added\nJustice Mazahar Ali Akbar Naqvi said that the Parliament had made a law about SC rules but why it didn’t make the same thing for the high courts. Shariat Court Justice Ijaz-ul-Ahsan said that the high courts are empowered to make their own practice and procedures.\nAbid S. Zuberi said that even today no objection can be raised if the SC makes its own rules. The constitution says that the Supreme Judicial Council will make its own rules, the validity of which will be equal to the constitutional regulations, he said.\nAfter this Muslim League-N’s lawyer, Barrister Salahuddin also gave arguments and said that the Pakistan Bar Council (PBC) has been demanding to regulate the powers of the Chief Justice of Pakistan for 10 years. It is not written in the constitution that the Chief Justice has the power to appoint a bench to hear cases.\nAddressing the council, the CJP noted that earlier people used to adopt the arguments of others but now it is not happening. Barrister Salahuddin said that this is not happening because the proceedings are being broadcast live.\nPetitioner Umar Sadiq, Muhammad Shahid Rana and PML-Q’s lawyers also gave arguments on the occasion. Later, the hearing of the cases was adjourned till tomorrow.",
  "retrievedAt": "2025-08-11T10:00:38.255Z"
}
