{
  "title": "Senator Irfan-Ul-Haq directs to revert all teachers on deputation in edu ministry",
  "link": "https://www.app.com.pk/national/senator-irfan-ul-haq-directs-to-revert-all-teachers-on-deputation-in-edu-ministry/",
  "date_published": "2023-10-09T11:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP): Chairman Senate Standing Committee on Federal Education and Professional Training Senator Irfan-Ul-Haq Siddiqui on Monday categorically directed to revert all the teaching staff on deputation holding administrative assignments in Education Ministry to their parent departments with immediate effect.\nThe Senate Standing Committee on Federal Education and Professional Training which met here under the chairmanship of Senator Irfan-Ul-Haq Siddiqui here at Parliament House unanimously recommended sending all the employees back to their parent departments who were initially recruited as teachers and holding administrative posts at various ministries.\nThe committee debated that all such employees are politically powerful, blue-eyed individuals and does not like to render their services as teachers therefore manage to be posted on various administrative post through influence.\nThe committee observed that this practice is badly affecting the quality of education.\nThe Chairman Committee Senator Irfan Siddiqui concluded that all the teachers on deputation be sent back to their respective educational institutes immediately.\nThe caretaker Minister for Federal Education and Professional Training Madad Ali Sindhi agreed with this viewpoint and assured the committee that immediate action would take place on committee recommendations.\nThe committee also discussed at length the progress on extension of time and details of proceedings of the Ministerial Committee constituted under Dr Niaz Ahmed Vice Chancellor Quaid-e-Azam University for regularisation, of daily wagers teachers and increase in their salaries.\nThe minister said that the list of employees recommended by the FPSC will be issued appointment letters within this week.\nSimilarly, the matter regarding daily wagers will be discussed in the same committee to permanently resolve this long-standing issue and the report in this regard will be submitted to the committee by 13th Oct 2023.\nThe committee was told that since the salary of daily wagers is being enhanced as per committee recommendations from 25000/rps to 32000/rps per month, the case is under AGPRs consideration, on which the chairman committee directed the Director General FDE to make sure that the salaries are paid immediately at the previous rates and the enhanced amount may be paid once the budget is approved.\nThe chairman committee Senator Irfan Siddiqui asked the HEC officials to invite the representatives of affected daily wagers to have their viewpoints.\nThe committee also discussed in detail the report on re-initiating summary for the National Technology Council Act and Service Structure of technologist. The chairman committee strictly inquired as to why the act is pending before the ministry for 7 months.\nIt was stated by the HEC representative that the committee constituted to look into this matter has been officially notified as directed by the Senate Committee in its last meeting and sought time to finalise the recommendations.\nIt was also apprised that the act has been returned from the Cabinet Committee for Disposal of Legislative Cases (CCLC ) with certain observations. The committee chair directed to finalise report on the matter and submit within 15 days.\nThe meeting was attended by Senator Prof. Dr Mehr Taj Roghani, Fawzia Arshad, Engr Rukhsana Zuberi, Molvu Faiz Muhammad and Senator Falaz Naz.\nThe Caretaker Minister for Federal Education and Professional Training Madad Ali Sindhi and other senior officials of related departments were also in attendance.",
  "retrievedAt": "2025-08-11T10:00:46.768Z"
}
