{
  "title": "Economic resilience — the Chinese way - Business - DAWN.COM",
  "author": null,
  "content": "Pakistan’s most significant ally China has sprung another surprise on those who thought that US President Donald Trump’s tariff wars, leading to global trade tensions between Beijing and Washington, could slow down its economic rise. The 5.3 per cent year-on-year expansion in China’s economy during the first half of 2025 defies expectations and reinforces Beijing’s recovery momentum amid a volatile global environment.\n\nData released by China’s National Bureau of Statistics (NBS) last week showed that its GDP has reached $9.24 trillion between January and June. The second quarter grew by 5.2pc year-on-year and 1.1pc quarter-on-quarter — exceeding expectations of 0.9pc and signalling continued resilience despite domestic weakness.\n\nThis performance challenges pessimistic forecasts, underlining the strength of China’s industrial and export sectors, as industrial production, external demand, domestic consumption and targeted public investment were the main growth drivers, even though real estate and private investment remained soft. Analysts expect the momentum to continue, supported by government policy tools, further recovery in domestic demand, and export strength.\n\nWhile Q2 growth marks a modest slowdown from Q1, it reflects persistent dynamism in high-tech manufacturing and exports, aided by a temporary reprieve in US trade tensions. It also surpasses the full-year growth target of 5pc, reaffirming China’s status as a key global growth driver. The growth not only defied expectations but also highlights the heft and flexibility of the country’s manufacturing and export sector, despite a decade of trade turbulence with the US.\n\nBeijing boosts international confidence with its capacity to advance high-quality development amid continued global uncertainty\n\nThe first-half growth was led by a 6.4pc increase in industrial output and 7.2pc export growth. While shipments to the US fell 10.7pc, China expanded trade with the Association of Southeast Asian Nations, the European Union, and Africa. Services expanded by 5.5pc. Retail sales rose 5pc, up from 4.6pc in Q1, suggesting steady — though cautious — domestic demand.\n\nAlthough foreign direct investment (FDI) inflows dropped 13.2pc year-on-year to $49.93 billion, NBS officials described them as “structurally resilient”, with a shift toward long-term positioning rather than short-term capital flows.\n\nThe government has ramped up infrastructure investment, offered consumer subsidies, and pursued targeted monetary easing to cushion the economy from external shocks. Some analysts suggest broader deficit spending may be considered if growth loses steam in the second half.\n\nNBS Deputy Head Sheng Laiyun des­cribed the performance as a “hard-won achievement” in the face of global uncertainty, noting that proactive macroeconomic policies had sustained progress in several key areas.\n\nDespite strong headline numbers, China’s recovery remains uneven. Much of the growth so far has come from industrial activity and external demand rather than the domestic revival policymakers have been seeking. While consumption is improving, big-ticket and discretionary spending remain subdued.\n\nReal estate continues to drag on sentiment. Property investment declined 11.2pc in the first half, and new commercial housing sales continued to shrink. The sector’s downturn remains a significant headwind.\n\nThe underlying challenge remains to broaden the recovery beyond exports and state-led investment and into more resilient domestic consumption and private sector dynamism. Restoring confidence across households, businesses, and foreign investors will be crucial.\n\nChina’s stronger-than-expected first-half performance prompted several major financial institutions — including Morgan Stanley, Goldman Sachs, UBS, and Nomura — to upgrade their full-year forecasts. Most now expect GDP growth close to or above the government’s 5pc target.\n\nPhilippe Monnier, former executive director of the Greater Geneva-Berne area, said China’s adaptive policies and deep manufacturing base have allowed it to withstand the pressure of US tariff actions and maintain macroeconomic stability.\n\nChina’s second-quarter GDP came in slightly above market consensus amid mixed June activity data, reflecting the resilience of its exports amid the US-China trade conflicts, Goldman Sachs said in a recent report. With China’s real GDP growth still solid, Goldman Sachs does not think policymakers see an immediate need to launch broad-based, significant stimulus in the near term. “Instead, we expect incremental, targeted easing to help stem the property downturn and mitigate labour market pressures in the second half,” the report states.\n\nBeijing’s current focus remains on stabilising internal demand through consumer support, small business credit, and selective fiscal expansion. Such measures have helped insulate the economy from external shocks and support real-sector growth.\n\nJapan’s Jiji Press reported that China’s moderately accommodative monetary policy has shown results in supporting consumption and services. International observers also point to Beijing’s strategic push toward sectors such as artificial intelligence (AI), semiconductors, electric vehicles, and clean energy — all aimed at a more sustainable, consumption-led growth model.\n\nKarim Adel, head of the Cairo-based Al Adl Centre for Economic and Strategic Studies, argued that China’s proactive steps in 2025 have not only helped domestic stabilisation but also contributed to global economic momentum.\n\nAmid continued global uncertainty, China’s capacity to advance high-quality development while deepening its opening-up strategy has been a key factor in international confidence. As capital searches for relative safety, China’s performance has made it a focal point for investors and policymakers.\n\nStill, Chinese economists caution that the second half could prove more challenging. Wang Yiming, vice-chairman of the China Centre for International Economic Exchanges, noted that the recovery continues to be hindered by insufficient domestic demand, a sluggish property market, and persistently low prices in key sectors. He has emphasised the need to integrate demand-boosting efforts with structural reforms, particularly on the consumption side.\n\nIn the face of a complex international landscape and mounting challenges, China achieved steady economic growth in the first half of 2025, boosting confidence in global growth potential. By steadfastly advancing high-quality development and steadily expanding high-level opening-up, the Chinese economy has demonstrated strong resilience, providing a reliable driving force for global economic growth.\n\nWith GDP growth projected to outpace most major economies in 2025, China is set to reinforce its position as both a driver of global growth and a source of stability amid international uncertainties.\n\nPublished in Dawn, The Business and Finance Weekly, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/1714270082dc1a7.jpg?r=144810",
  "retrievedAt": "2025-08-17T20:57:13.122Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925390/economic-resilience-the-chinese-way",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:46.000Z"
}
