{
  "title": "Micro solutions for macro problems? - Business - DAWN.COM",
  "author": null,
  "content": "More than a decade ago, Pakistan’s banking industry saw a highly unusual transaction. Failing to meet the capitalisation requirements, Khadim Ali Shah Bukhari (KASB) Bank was sold to BankIslami for a price of Rs1,000. To this day, this transaction remains a topic of discussion among nerdy individuals and is surely an interesting nugget in the sector’s history.\n\nWhile it may have been controversial, KASB was somewhat easy to manage, for it was among the few bad apples in an otherwise healthy industry. What should the regulator do when an entire sector — almost a trillion rupees of assets — is on the same path and refuses to show any signs of improvement?\n\nThis has been the predicament facing microfinance banking, which has recorded aggregate losses every year since 2019 and continued that ritual in Q1FY25 with a net income of negative Rs2.3 billion. As a result, its capital buffers have been depleting for 12 quarters straight and now stand at 1.2 per cent of total risk-weighted assets, well short of the 15pc required by the State Bank of Pakistan.\n\nUnlike last time, this mess is not as simple to clean up, as the risks in microfinance are more systematic rather than company-specific. The big question is whether transferring the problem to another sponsor is really the solution. To paraphrase Professor Damodaran, why throw good money after bad?\n\nAlmost 141.5m total financial accounts have been opened in Pakistan between FY17 and FY24, of which two-thirds were branchless\n\nHaaris Mahmood Chaudhary, President & Chief Executive of Mobilink Microfinance Bank, disagrees with this view and feels it requires a little more context. “Starting with Covid-19 and then the subsequent floods, the industry has indeed faced a number of serious shocks, which have put our customer profile, ie low-income communities and agriculture, in particular pressure. As a result, the banks have also felt the stress on the books,” he explains.\n\nMore importantly, Mr Chaudhary believes it’s not fair to assess microfinance purely from the lens of the bottom line. “Globally, the success of microfinance should be judged on the basis of how it affects social indicators. In Pakistan’s context, data shows that 56pc of all lending to agriculture has been through this industry. Similarly, almost half of all mortgages in the country are underwritten by microfinance. That’s despite our industry being not only much younger but also, as a whole, smaller than the top five banks individually.”\n\n“We should focus on how the industry has contributed to our social indicators. Has poverty come down? How many women have we opened financial services to? Do people now have access to digital wallets?” he questions.\n\nIf that is our lens, Mr Chaudhary does have a point. According to a Data Darbar analysis, almost 141.5 million total financial accounts have been opened in Pakistan between FY17 and FY24. Of this, two-thirds were branchless, thanks to the two telco players that have historically leveraged their subsidiaries’ microfinance licences for deposits.\n\n‘The biggest area of opportunity is opening up the inward remittances mandate for microfinance banks and bringing incentives on par with scheduled institutions’\n\nSimilarly, as far as advances are concerned, scheduled banking is absolutely no match for microfinance in terms of volumes, with the latter boasting 9.28m borrowers as of 2024, of which 1.7m were rural. In contrast, the former had 4.56m outstanding loans by the same period, despite having an asset base almost 55x as much.\n\nTherein, Mobilink Microfinance Bank Limited (MMBL) is one of the industry leaders, accounting for more than 18pc of the total assets and net advances at Rs185.4bn and Rs74.9bn, respectively. Unlike its brethren in the license, it has somehow managed to tackle the sector’s troubles a lot better, as reflected by a capital adequacy ratio of 19.16pc by 2024. However, it hasn’t been immune from them and, for the first time in many years, recorded a red bottom line.\n\nWhile the idea of social improvements is all mighty and good, sponsors are probably more concerned about monetary returns and would probably like to reap some dividends after years of investments. Can microfinance provide a pathway to that, notwithstanding the recent troubles? Mr Chaudhary seems to think so.\n\n“Post Covid-19, we have seen two major shifts happen in the industry, ie the digitisation wave driven by wallets and the growth of nano loans. Though some banks have capitalised on these better than the rest, they present a general opportunity for anyone to generate sustainable, even if not mouthwatering, profit margins,” he says, adding, “Our own return on equity is 18pc, which is very reasonable.”\n\n“However, for this to happen, the industry needs to improve its risk management and profiling practices,” he cautions. While the playbook for reform may be obvious, most of the existing sponsors haven’t shown a willingness to make the required investments in technology, systems and distribution and therefore continue to get dragged down further in the mess. No wonder then that the regulator is on the lookout to find new promoters and lately has pulled off the sale of Finca and Advans to Pakistani and Egyptian fintechs, Abhi (in partnership with TPL) and MNT Halan, respectively.\n\nIn all likelihood, they would follow the same prescriptions that Mr Chaudhary identified. There’s no doubt about the potential of combining wallets with nano lending in generating good returns, but what does that say about the future of the more traditional microfinance? Despite doing better on those fronts, MMBL continues to grow its branches, which reached 113. One reason is probably the wide gulf between the average deposit balances of a brick-and-mortar customer versus digital. To be clear, this is neither limited to microfinance banks nor Pakistan.\n\nThis reach of microfinance, be it through branches or branchless, can serve as a distribution arm for the scheduled banks. After all, the SBP’s latest financial inclusion strategy has set ambitious targets, which certainly won’t be achieved if the big boys of Chundrigarh Road maintain their status quo. For Mr Chaudhary, such partnerships are critical and can open up new monetisation opportunities.\n\n“The biggest area of opportunity is opening up the inward remittances mandate for branchless and microfinance banks and bringing the incentives on par with scheduled institutions. This can significantly help the industry become a lot more stable,” he concludes.\n\nThe writer is co-founder of Data Darbar and works for the Karachi School of Business and Leadership\n\nPublished in Dawn, The Business and Finance Weekly, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687d83e614b98.jpg",
  "retrievedAt": "2025-08-17T20:57:33.529Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925567/micro-solutions-for-macro-problems",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:45.000Z"
}
