{
  "title": "Erdogan insists on Cyprus two-state solution - World - DAWN.COM",
  "author": null,
  "content": "NORTH NICOSIA: Turkish President Recep Tayyip Erdogan on Sunday reaffirmed his country’s support for a two-state solution in Cyprus, urging the international community to accept the Mediterranean island’s existing division.\n\nCyprus has been divided since 1974, when a Turkish invasion followed a coup in Nicosia backed by Greece’s then-military junta. The Turkish Republic of Northern Cyprus, declared in 1983, is recognised only by Ankara.\n\n“We fully support the vision based on a two-state solution,” Erdogan said during a visit to northern Cyprus marking 51 years since Turkish troops invaded the island.\n\n“It is time for the international community to make peace with the realities on the ground,” Erdogan said.\n\nThe Turkish leader’s visit comes few days after UN Secretary General Antonio Guterres said that meetings between Cyprus’s rival leaders at the organisation’s New York headquarters were “constructive,” even as questions remained about crossing points on the island. Erdogan on Sunday called for an end to the isolation of the TRNC.\n\n“Diplomatic, political, and economic relations should be established with the TRNC, and the injustice endured by Turkish Cypriots for decades must finally come to an end,” he said.\n\nThe last major round of peace talks collapsed in Crans-Montana, Switzer­land, in July 2017.\n\nGreeks mourn, Turks celebrate\n\nGreek and Turkish Cypriots marked on Sunday the 51st anniversary of Turkey’s 1974 invasion of Cyprus, an event that split the island and remains a source of tension between Nato partners Greece and Turkiye.\n\nAir raid sirens sounded across the southern Greek Cypriot-populated parts of Cyprus at 5:30am (0230 GMT), the exact time when Turkish troops landed on the northern coast in a military intervention triggered by a brief Greece-inspired coup.\n\nCyprus President Nikos Christodoulides attended a memorial service in the south to commemorate the more than 3,000 people who died in the Turkish invasion, which also drove tens of thousands of Greek Cypriots from their homes.\n\n“Despite those who want us to forget, we will never forget, or yield an inch of land,” Christodoulides said, calling celebrations in the north “shameful”.\n\nEfforts to reunify Cyprus as a bi-zonal, bi-communal federation have repeatedly failed amid deep-rooted mistrust and competing visions for the island’s future.\n\nBefore the invasion, clashes between Turkish and Greek Cypriots saw Turkish Cypriots withdraw from a power-sharing government and prompted the deployment of UN peacekeepers in 1964.\n\nTurkish Cypriot leader Ersin Tatar said the invasion had brought “peace and tranquility” to the island following the “darkest years” for Turkish Cypriots.\n\n“Their (Greek Cypriots) goal was to destroy the Turkish Cypriots,” he said in a video address posted on X.\n\nThe simmering conflict complicates Turkiye’s ambitions to foster closer ties with the European Union, of which both Cyprus and Greece are members.\n\nUN Secretary General Antonio Guterres said last week the two sides would continue discussions on trust-building measures, warning that “there is a long road ahead”.\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:56:56.915Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925542/erdogan-insists-on-cyprus-two-state-solution",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:58.000Z"
}
