{
  "title": "Medical board sought as Zahir Jaffer on death row for Noor Mukadam’s murder preparing mercy plea - Pakistan - DAWN.COM",
  "author": null,
  "content": "Zahir Zakir Jaffer, who was convicted of the gruesome murder of Noor Mukadam and sentenced to death, is preparing for a presidential mercy petition, according to a series of letters seen by Dawn.com as jail authorities have requested the formation of a medical board to evaluate his condition.\n\nNoor, aged 27 years, was found murdered at Zahir’s Islamabad residence in July 2021, with the probe revealing she was tortured before being beheaded. Zahir’s death sentence by the trial court had been upheld by the Islamabad High Court (IHC) in 2023.\n\nIn May, the Supreme Court upheld the death sentence handed by two courts previously over the murder charges under Section 302B (premeditated murder) of the Pakistan Penal Code (PPC). After the ruling by the apex court, a presidential pardon under Article 45 of the Constitution could possibly provide Zahir pardon, or reprieve, or remit, suspend or commute his sentence.\n\nAccording to the letters, which are addressed to the hospital director at the Pakistan Institute of Medical Sciences (Pims) from the superintendent at Adiala Jail, Zahir requires an opinion from a medical or psychiatric board before submitting a presidential mercy petition.\n\n“The appeal of above mentioned Confirmed Condemned Prisoner (Zahir) was pending at [the] Supreme Court of Pakistan and the same has been dismissed,” the letter, dated July 8, read.\n\n“Now the mercy petition of [the] subject cited Confirmed Condemned Prisoner has to be submitted before the Honourable President of the Islamic Republic of Pakistan. For that, the medical board and psychiatric board opinion is mandatory.”\n\nThe letter requested that a time and date be chosen for the medical and psychiatric boards to come to Adiala and examine Zahir.\n\nThe superintendent made the same request in another letter dated July 14.\n\nIn response to the first letter, Pims stated in a document seen by Dawn.com that Dr Shafqat Nawaz from the psychiatry department and Dr Amir Naveed from the neurology department will comprise the medical board.\n\nZahir was not only convicted of the murder, but was also sentenced to 25 years of rigorous imprisonment along with a fine of Rs200,000 under Section 376 (punishment for rape) of the PPC.\n\nIn October last year, Noor’s father had urged the apex court to take up the murder case pending for more than one and a half years.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/20170302f7a85e2.jpg?r=170357",
  "retrievedAt": "2025-08-17T20:58:59.359Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925457/medical-board-sought-as-zahir-jaffer-on-death-row-for-noor-mukadams-murder-preparing-mercy-plea",
  "dateList": "2025-07-21",
  "date_published": "2025-07-20T19:03:04.000Z"
}
