{
  "title": "11 more suspects arrested in Balochistan couple’s killing, case transferred to SCIW: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least 11 more suspects, including a tribal leader, were arrested on Monday for their alleged involvement in the killing of a man and a woman in Balochistan after a video of the murder went viral on social media, with the case now handed over to the Serious Crimes Investigation Wing (SCIW), according to the police.\n\nSCIW Superintendent of Police (SP) Syed Saboor Agha told Dawn.com, “Eleven people have been arrested, including a tribal leader who issued directives to shoot the couple, and all of them will appear before a judicial magistrate today.”\n\nThe viral video showed a group of men leading a couple out of vehicles and into a desert before gunning them down with pistols and shooting the bodies. Political figures and activists said it was an ‘honour’ killing incident. On Sunday, Balochistan Chief Minister Sarfraz Bugti announced on X that he had directed the Balochistan Police to take immediate action, following which one suspect was apprehended.\n\nAccording to a first information report (FIR) — a copy of which is available with Dawn.com — registered by Station House Officer (SHO) Naveed Akhtar at Quetta’s Hanna-Urak Police Station, he lodged the complaint after receiving the video clip that had gone viral on social media, showing a man and a woman being brutally shot and killed by armed individuals.\n\nSHO Akhtar stated that he, along with his team, reached Balochistan’s Dagari, situated on the outskirts of Quetta and, upon investigation, discovered that the incident occurred three days before Eidul Azha in the area of Sanjidi in Dagari.\n\n“The victims seen in the viral video have been identified as Bano Bibi and Ihsanullah,” the FIR said, naming eight suspects who allegedly shot the couple dead. The FIR also mentioned 15 other unknown suspects involved in the incident.\n\nSpeaking to Dawn.com, SHO Naveed Akhtar said, “Owing to the nature of the murder, the case has now been transferred to the Serious Crime Investigation Wing for further investigation.”\n\nPrior to being killed, the victims were allegedly taken to a tribal leader, who declared them guilty of being involved in an ‘immoral relationship’ (locally termed ‘Karo Kari’) and ordered their execution, following which they were taken to the [desert] and shot dead, the FIR said.\n\n“The murder was filmed and uploaded to social media to spread fear and panic among the public,” it added.\n\nAccording to the FIR, a case was registered against the suspects under Sections 147 (rioting), 148 (rioting while armed with a deadly weapon), 149 (unlawful assembly) and 302 (murder) of the Pakistan Penal Code and the Anti-Terrorism Act, 1997.\n\nOne of the main suspects — tribal leader Sardar Sherbaz Satakzai — was presented before an anti-terrorism court today with Judge Muhammad Mubeen presiding over the case. The suspect was handed over to SCIW on a two-day physical remand on the judge’s order upon the police’s request.\n\nChief Justice Balochistan High Court Justice Rozi Khan Barrech took notice of the case and summoned the additional chief secretary and inspector general of police Balochistan to the court in the matter.\n\nIn a press release issued by BHC — seen by Dawn.com — it was notified that Justice Barrech “has taken notice of the news circulating on electronic, print and social media of the murder of a couple for marrying out of choice at Dagari”. The statement added that, “In this matter, the chief justice has summoned the chief secretary and IG Balochistan to court on July 22, 2025”.\n\nThe postmortem report on the slain couple has revealed that the woman was shot seven times and the man was shot nine times.\n\nPolice surgeon Ayesha Faiz, who conducted the postmortem, told Dawn.com that the graves of the man and woman were exhumed and the postmortem was conducted.\n\n“They were killed on June 4. The woman is around 37 to 38 years old and was shot once in the head and seven times in the chest and stomach.\n\n“The woman’s name was Noor Bano Bibi, written on her arm, and she belongs to the Satakzai tribe — while the man’s name was Ihsanullah, and he is around 35 to 36 years old and was shot nine times in the chest and stomach,” the police surgeon said.\n\nAccording to Fiaz, the woman’s body was decomposed but recognisable, while the man’s body was in a slightly better condition and also recognisable.\n\nThe woman was buried in the Degari Qadir Bakhsh Coal Mines Cemetery, and the man in the Sanjadi Cemetery.\n\nThe DNA samples of both bodies have also been obtained and they will be tested if necessary.\n\nThe incident was widely condemned by politicians, civil society activists, and the public, who termed it “barbaric” and urged the government to take swift action against the perpetrators.\n\nSeparately, PPP MNA Shazia Marria moved an adjournment motion in the National Assembly to instead discuss the incident since it was a “matter of urgent national and human importance”.\n\n“This tragic and barbaric act has shaken the conscience of the nation. Such heinous crimes constitute a grave violation of the teachings of Islam, and are in blatant disregard of the Constitution … which guarantees all citizens the right to life, dignity, due process, and equal protection under the law. Furthermore, such acts are deeply offensive to the cultural and moral values of our society, which emphasise compassion, justice and the sanctity of human life.\n\n“This House must condemn this crime in the strongest possible terms. I urge the federal government to immediately engage with the provincial government of Balochistan, obtain a comprehensive and transparent report, and ensure that those responsible are identified, arrested, and prosecuted without delay.”\n\nMarri also said it was “imperative” that the state be made the complainant in the FIR and subsequent legal proceedings to safeguard the integrity of the investigation, reinforce public confidence in the justice system and avoid any compromise or pressure on the victims’ families.\n\nIn Pakistan, ‘honour’ killings continued to claim the lives of women throughout 2024, perpetuated by deeply ingrained societal beliefs about family dignity and shame.\n\nData from the Human Rights Commission of Pakistan shows that in 2024, ‘honour’ killings continued to be a serious issue across Pakistan, with particularly high figures in Sindh and Punjab. From January to November, a total of 346 people fell victim to ‘honour’ crimes in the country.\n\nThe previous two years also saw a consistent rise in murders related to the so-called ‘honour’.\n\nAddressing a press conference to discuss the details of the case, CM Bugti said he stood with the victims and vowed that justice would be served regardless of tribal affiliation.\n\nHe said he immediately ordered the arrest of suspects within 24 hours of the video going viral, adding 12 people had been detained so far, including a tribal chief.\n\nBugti clarified misinformation circulating on social and mainstream media, rejecting claims that the victims were a newly married couple. “The woman and man weren’t married. The woman had five children, and the man, aged around 45 to 50, also had four or five children,” he said, adding that these details did not justify the killing.\n\n“It is a murder, a crime, no matter what anyone has done. No one has the right to kill a person this ruthlessly and make videos,” he said.\n\nHe added that the Special Branch deputy superintendent of police (DSP) posted in Dagari were suspended for failing to report the incident to the government.\n\nThe chief minister also pointed out the spread of misinformation through social media and the lack of investigative journalism.\n\n“People sitting in Karachi and Lahore don’t know what Dagari is. But still, did anyone do any investigation? No. It was the murderer himself who released the video.”\n\nBugti said that he had received a call from PPP Chairman Bilawal Bhutto-Zardari and that operations were underway upon his instructions. He said the government would follow constitutional channels, not tribal jirgas, to resolve the case.\n\nPrime Minister Shehbaz Sharif condemned the murder and contacted CM Bugti, ordering a probe into the incident, according to a press release from the PM Office.\n\nThe prime minister directed that people involved in the incident should be punished according to law, as no one was above the law and could not be permitted to violate the law of the land.\n\nHe also ordered taking all legal measures to bring the culprits to justice.\n\nBilawal called the suspects “beasts”, saying that they deserved no concessions. “I have faith that the criminals involved in this murder will be brought to justice soon,” he said, according to the state-run Associated Press of Pakistan (APP). “This murder should be a test case for the Balochistan government, as it is gender terrorism.”\n\nDefence Minister Khawaja Asif shared the video in a post on X, with a message for the people of Balochistan. Referring to the growing militancy in the province, he said: “Those who have taken up arms against the state — start by raising your voice against the unjust system that surrounds you.”\n\nHe continued that the ones responsible for this “oppression are your own brothers, not the travellers and labourers from other provinces”, pointing out the recent bus attack in Balochistan’s Kalat district, which left three people dead and other similar incidents in the recent past.\n\nPPP Vice President Senator Sherry Rehman also condemned the murder in a post on X, labelling it an “unforgivable crime”.\n\n“Crushing the right to marry is a violation of fundamental human rights. Killing in the name of tribal decisions is a despicable act. The cycle of brutality in the name of honour must be stopped,” she wrote.\n\n“By mercilessly killing the married couple, not only have law and justice been insulted, but the authority of the provincial government has also been challenged,” Rehman added. “The chapter of oppression and barbarism under the guise of jirgas must be closed.”\n\nThe senator emphasised that the perpetrators must be brought to justice and that legislation to end “outdated customs” was indispensable.\n\nBaloch activist Sammi Deen Baloch decried the shooting as an ‘honour’ killing, appealing to Baloch elders to “respect women’s decisions”.\n\n“As a woman, this chilling incident is deeply painful and heart-wrenching for me,” she wrote on X. “Killing any woman in the name of honour is not only a heinous crime but also the worst humiliation of humanity.\n\n“I appeal to Baloch and Pashtun tribal elders, influential sections of society, and intellectuals to respect women’s decisions. Today’s woman is the same woman who is educated, aware, and fully capable of making decisions about her future.”\n\nShe demanded that the killing be investigated transparently and comprehensively so that the suspects would be brought to justice and “no one dares to repeat such a barbaric act in the future”.\n\nAdditional reporting by Nadir Guramani.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:55:51.380Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925613/11-more-suspects-arrested-in-balochistan-couples-killing-case-transferred-to-sciw-police",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T06:52:47.000Z"
}
