{
  "title": "Govt swings into action over Quetta ‘honour killings’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: A primary suspect was detained on Sunday and raids were underway for the arrest of other culprits after a gruesome video went viral, showing the killing of a couple over ‘honour’ in the Dagari area of Quetta.\n\nThe incident purportedly took place around Eidul Azha and has been described as an act of ‘honour killing’. In the video, a group of people can be seen killing a woman and a man, apparently for contracting a love marriage.\n\nAfter the clip went viral on social media, a case on terrorism charges was registered on the ord­ers of Balochistan Chief Minister Sarfraz Bugti, and the Levies and the Counter-Terrorism Dep­artment subsequently arr­es­ted one of the key suspects.\n\n“The case was registered under anti-terrorism laws…on behalf of the Balochistan government, as no one from the area, including the relatives or other people, submitted any application to the Levies or the CTD,” officials said, adding that efforts were underway to arrest more people.\n\nThe slain couple had reportedly married without the permission of their families and the matter was taken to the ‘elders’ of the area, who pronounced a death sentence.\n\nSources said the ill-fated couple, Ehsan Samalani and Bano Satakzai, were invited to the village for lunch and later taken to an abandoned place in Dagari, where they were informed about the decision of the elders.\n\n“You are allowed to shoot me, but nothing more than that,” the slain woman told the perpetrators in Brahvi before her murder.\n\nShe asked her killers to let her walk seven steps before shooting her. She was shot thrice apparently by her brother, followed by the killing of her partner. The bodies have yet to be recovered, further complicating the investigation.\n\nThe video is believed to have been filmed just before Eidul Azha, and the authorities are conducting raids to apprehend the remaining perpetrators, whose identities have reportedly been established but not made public.\n\n“The state will not remain a silent spectator to such barbarism,” said CM Bugti on X (formerly Twitter), vowing that justice would be served.\n\nIn a press conference at the Karachi Press Club on Sunday, Balochistan government spokesperson Shahid Rind confirmed that the individuals seen in the video had been traced through facial recognition and Nadra data.\n\n“One suspect is in custody, and data of all visible individuals in the video has been handed over to Nadra. We are closing in on the rest,” he said.\n\nMr Rind clarified that the state itself had become the complainant in the case to ensure accountability and justice, emphasising that external pressure would not be tolerated during the investigation.\n\nPPP Chairman Bilawal Bhutto-Zardari, whose party rules Balochistan, condemned the cold-blooded killing, expressing profound grief and outrage over the incident. He said that those involved in this heinous murder are nothing less than beasts and deserve no mercy.\n\nAladdin Khilji, provincial director of Aurat Foundation and chairman of the Balochistan EVAWG Alliance (Ending Violence against Women and Girls), also condemned the act.\n\n“This video has shaken us to the core. It is a stark reminder that honour killings remain a brutal reality in Balochistan. From 2019 to 2024, 212 people have been murdered in the name of honour,” he said in a statement.\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:58:49.014Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925555/govt-swings-into-action-over-quetta-honour-killings",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:27.000Z"
}
