{
  "title": "Govt detains traders amid tax protest at Pak-China border as Karakoram highway blocked - Pakistan - DAWN.COM",
  "author": null,
  "content": "The government detained several traders on Monday after they protested at the Pakistan-China border against taxes and announced the closure of the dry port on the call of the Pak-China Trades Action Committee, a traders organisation in Gilgit-Baltistan.\n\nTraders have closed the Karakoram Highway at several places in Hunza and Nagar districts, due to which travellers and a large number of tourists from the two districts have been stranded.\n\n“Traders had blocked the Karakoram Highway by staging a sit-in at two places in the Hunza area, in which the Murtazaabad sit-in ended,” Hunza Deputy Commissioner (DC) Huzaifa Anwar told Dawn.com.\n\n“However, a sit-in is ongoing in the Sost area of the Pak-China border. Talks are being held with the traders there. It is likely that it will be cleared in two to three hours,” DC Anwar added.\n\nHe said that three traders were detained at the Sost Dry Port after the announcement of the sit-in, one of whom has been released, but two are in custody.\n\nThe DC said that the traders were not arrested and in protective custody. “If they had been arrested, a case would have been registered, but no case has been registered against any trader,” he added.\n\n“At present, the priority is to resolve the issue of the closure of the Karakoram Highway, since there are a large number of tourists in the area who are facing problems in their movement.”\n\nThe Silk Route Dry Port was to be closed today and a sit-in was to be held on the Karakoram Highway, according to an announcement from the traders of Gilgit-Baltistan.\n\nHowever, last night the government cracked down on the active traders. According to the traders, the police took action at night and raided the houses of several traders, including Ali Nazar, Abbas Mir and Farman Tajik, and arrested them.\n\nThe traders have pitched tents on the Karakoram Highway at Nagar Rakaposhi and Murtaazabad in Hunza, due to which hundreds of travellers and dozens of nationals and foreigners have been stranded.\n\nFormer president of GB Chamber of Commerce and prominent businessman Javed Hussain, while addressing the traders’ sit-in in Nagar, said that the Hunza administration ruined the peaceful protest by arresting traders.\n\n“Now, if the district administration has any power, then keep the traders in custody; otherwise, we will break out our colleagues and show them,” he said, adding that he would not compromise on the interests of GB. “If it means leaving the PML-N for this, I will leave it a thousand times.”\n\nHe blamed Hunza’s DC and superintendent of police for the situation. The traders raised strong slogans against the district police chief and the deputy commissioner.\n\nFormer president of the Chamber of Commerce, Imran Ali, said that the traders’ demand was against the collection of income and sales tax collected at the Sost Silk Dry Port.\n\nAccording to him, earlier too, an understanding was reached on some issues regarding the protest of the traders against the aforementioned taxes at the Pak-China border, but the issue arose again because of which the Silk Route Dry Port was closed today. The port was to be locked down and a sit-in was to be held in the border area.\n\nAccording to DC Anwar, the situation was completely under control. “We are in contact with the traders and negotiations are also taking place,” he said.\n\nNagar DC Asghar Khan said that the highway was closed for some time due to the Muharram procession in Nagar district, giving the impression that traders had blocked the highway. “However, the highway was not closed anywhere. The Nagar administration has not even arrested any trader,” he said.\n\nIn June, local importers and exporters protested against what they called exploitative policies of the Federal Board of Revenue. The protest was led by traders and supported by political parties against the centre’s trade policies.\n\nLocal traders involved in Pakistan-China trade via Khunjerab Pass had also launched an indefinite protest sit-in May, blocking the Karakoram Highway at Pissan in Nagar, stranding thousands of local and international travellers on both sides of the route.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/683a52e75d1b2.jpg",
  "retrievedAt": "2025-08-17T20:54:42.529Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925630/govt-detains-traders-amid-tax-protest-at-pak-china-border-as-karakoram-highway-blocked",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T15:50:22.000Z"
}
