{
  "title": "Air India cockpit recording suggests captain cut fuel to engines before crash, source says - World - DAWN.COM",
  "author": null,
  "content": "A cockpit recording of dialogue between the two pilots of the Air India flight that crashed last month supports the view that the captain cut the flow of fuel to the plane’s engines, said a source briefed on US officials’ early assessment of evidence.\n\nThe first officer was at the controls of the Boeing 787 and asked the captain why he moved the fuel switches into a position that starved the engines of fuel and requested that he restore the fuel flow, the source told Reuters on condition of anonymity because the matter remains under investigation.\n\nThe US assessment is not contained in a formal document, said the source, who emphasised the cause of the June 12 crash in Ahmedabad, India, that killed 260 people remains under investigation.\n\nThere was no cockpit video recording definitively showing which pilot flipped the switches, but the weight of evidence from the conversation points to the captain, according to the early assessment.\n\nIndia’s Aircraft Accident Investigation Bureau (AAIB), which is leading the investigation into the crash, said in a statement on Thursday that “certain sections of the international media are repeatedly attempting to draw conclusions through selective and unverified reporting”.\n\nIt added that the investigation was ongoing and it was too early to draw definitive conclusions.\n\nThe Wall Street Journal (WSJ) first reported similar information on Wednesday about the world’s deadliest aviation accident in a decade.\n\nThe Federation of Indian Pilots, through its Indian law firm APJ-SLG Law Offices, sent a legal notice to Reuters about a July 17 story published by the news agency, which referenced the WSJ article.\n\nThe notice asked Reuters to desist from publication of any content “that speculates on the cause of the crash or attributes fault to any individuals, especially deceased pilots, in the absence of official confirmation and final report”.\n\nMost air crashes are caused by multiple factors, and under international rules, a final report is expected within a year of an accident.\n\nA preliminary report released by the AAIB on Saturday said one pilot was heard on the cockpit voice recorder asking the other why he cut off the fuel and “the other pilot responded that he did not do so”.\n\nInvestigators did not identify which remarks were made by Captain Sumeet Sabharwal and which by First Officer Clive Kunder, who had total flying experience of 15,638 hours and 3,403 hours, respectively.\n\nThe AAIB’s preliminary report said the fuel switches had switched from “run” to “cutoff” a second apart just after takeoff, but it did not say how they were moved.\n\nAlmost immediately after the plane lifted off the ground, closed-circuit TV footage showed a backup energy source called a ram air turbine had deployed, indicating a loss of power from the engines.\n\nThe London-bound plane began to lose thrust, and after reaching a height of 650 feet, the jet started to sink.\n\nThe fuel switches for both engines were turned back to “run”, and the aeroplane automatically tried restarting the engines, the report said.\n\nBut the plane was too low and too slow to be able to recover, aviation safety expert John Nance told Reuters.\n\nThe plane clipped some trees and a chimney before crashing in a fireball into a building on a nearby medical college campus, the report said, killing 19 people on the ground and 241 of the 242 on board the 787.\n\nIn an internal memo on Monday, Air India CEO Campbell Wilson said the preliminary report found no mechanical or maintenance faults and that all required maintenance had been carried out.\n\nThe AAIB’s preliminary report had no safety recommendations for Boeing or engine manufacturer GE.\n\nAfter the report was released, the US Federal Aviation Administration and Boeing privately issued notifications that the fuel switch locks on Boeing planes are safe, a document seen by Reuters showed and four sources with knowledge of the matter said.\n\nThe US National Transportation Safety Board (NTSB) has been assisting with the Air India investigation and its Chair, Jennifer Homendy, has been fully briefed on all aspects, a board spokesperson said.\n\nThat includes the cockpit voice recording and details from the flight data recorder that the NTSB team assisted the AAIB in reading out, the spokesperson added.\n\n“The safety of international air travel depends on learning as much as we can from these rare events so that industry and regulators can improve aviation safety,” Homendy said in a statement. “And if there are no immediate safety issues discovered, we need to know that as well.”\n\nThe circumstantial evidence increasingly indicates that a crew member flipped the engine fuel switches, Nance said, given there was “no other rational explanation” that was consistent with the information released to date.\n\nNonetheless, investigators “still have to dig into all the factors” and rule out other possible contributing factors, which would take time, he said.\n\nThe Air India crash has rekindled debate over adding flight deck cameras, known as cockpit image recorders, on airliners.\n\nNance said investigators likely would have benefited greatly from having video footage of the cockpit during the Air India flight.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:55:07.104Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925658/air-india-cockpit-recording-suggests-captain-cut-fuel-to-engines-before-crash-source-says",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T13:27:50.000Z"
}
