{
  "title": "Israeli settler attacks threaten West Bank communities - World - DAWN.COM",
  "author": null,
  "content": "KAFR MALIK: From his monitoring station on a remote hill in the occupied West Bank, water operator Subhil Olayan keeps watch over a lifeline for Palestinians, the Ein Samiyah spring.\n\nSo when Israeli settlers recently attacked the system of wells, pumps and pipelines he oversees, he knew the stakes. “There is no life without water, of course”, he said, following the attack which temporarily cut off the water supply to nearby villages.\n\nThe spring, which feeds the pumping station, is the main or backup water source for some 110,000 people, according to the Palestinian company that manages it — making it one of the most vital in the West Bank, where water is in chronic short supply.\n\nThe attack is one of several recent incidents in which settlers have been accused of damaging, diverting or seizing control of Palestinian water sources. “The settlers came and the first thing they did was break the pipeline. And when the pipeline is broken, we automatically have to stop pumping” water to nearby villages, some of which exclusively rely on the Ein Samiyah spring.\n\n“The water just goes into the dirt, into the ground,” Olayan said, adding that workers immediately fixed the damage to resume water supply. Just two days after the latest attack, Israeli settlers — some of them armed — splashed in pools just below the spring, while Olayan monitored water pressure and cameras from a distance.\n\nHis software showed normal pressure in the pipes pulling water from the wells and the large pipe carrying water up the hill to his village of Kafr Malik. But he said maintenance teams dared not venture down to the pumping station out of fear for their safety.\n\nSince the start of the war in Gaza, deadly settler attacks on Palestinians in the West Bank have become commonplace. Last week, settlers beat a 20-year-old dual US citizen to death in the nearby village of Sinjil, prompting US ambassador Mike Huckabee to urge Israel to “aggressively investigate” the killing.\n\nAnnexation\n\nIssa Qassis, chairman on the board of the Jerusalem Water Undertaking, which manages the Ein Samiyah spring, said he viewed the attacks as a tool for Israeli land grabs and annexation. “When you restrict water supply in certain areas, people simply move where water is available”, he said at a press conference.\n\n“So in a plan to move people to other lands, water is the best and fastest way”, he said. Since the start of the war in Gaza, several Israeli politicians and officials have become increasingly vocal in support of annexing the West Bank, which Israel has occupied since 1967.\n\nMost prominent among them is Finance Minister Bezalel Smotrich, himself a settler, who said in November that 2025 would be the year Israel applies its sovereignty over the Palestinian territory.\n\nQassis accused Israel’s government of supporting settler attacks such as the one on Ein Samiyah. The Israeli army said that soldiers were not aware of the incident in which pipes were damaged, “and therefore were unable to prevent it”.\n\nThe damage to Ein Samiyah’s water facilities was not an isolated incident.\n\nIn recent months, settlers in the nearby Jordan Valley took control of the Al-Auja spring by diverting its water from upstream, said Farhan Ghawanmeh, a representative of the Ras Ein Al Auja community. He said two other springs in the area had also recently been taken over.\n\nWater rights\n\nIn Dura al-Qaraa, another West Bank village that uses the Ein Samiyah spring as a back-up water source, residents are also concerned about increasingly long droughts and the way Israel regulates their water rights. “For years now, no one has been planting because the water levels have decreased,” said Rafeaa Qasim, a member of the village council, citing lower rainfall causing the land to be “basically abandoned”.\n\nQasim said that though water shortages in the village have existed for 30 years, residents’ hands are tied in the face of this challenge. “We have no options; digging a well is not allowed”, despite the presence of local water springs, he said, pointing to a well project that the UN and World Bank rejected due to Israeli law prohibiting drilling in the area.\n\nThe lands chosen for drilling sit in the West Bank’s Area C, which covers more than 60 per cent of the territory and is under full Israeli control. Israeli NGO B’Tselem reported in 2023 that the legal system led to sharp disparities in water access within the West Bank between Palestinians and Israelis.\n\nWhereas nearly all residents of Israel and Israeli settlements have running water every day, only 36 percent of West Bank Palestinians do, the report said. In Dura al-Qaraa, Qasim fears for the future. “Each year, the water decreases and the crisis grows — it’s not getting better, it’s getting worse.”\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/687d7a3b600a1.gif",
  "retrievedAt": "2025-08-17T20:56:55.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925543/israeli-settler-attacks-threaten-west-bank-communities",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:58.000Z"
}
