{
  "title": "Dar says Pakistan ‘targeting 60pc renewable energy by 2030’ in line with SDGs - Pakistan - DAWN.COM",
  "author": null,
  "content": "Deputy Prime Minister and Foreign Minister Ishaq Dar on Monday stated that Pakistan is targeting using 60 per cent renewable energy by 2030 during his address to the General Debate of the Ministerial Segment of the UN High-Level Political Forum (HLPF) in New York, according to a statement from the Foreign Office (FO).\n\nPakistan assumed the UNSC Presidency for the month of July 2025, making it the country’s eighth term on the Security Council as a non-permanent member. Islamabad began its current two-year term as a non-permanent member in January 2025 and will serve through the end of 2026. The presidency involves a focus on multilateralism, peaceful dispute resolution, and regional cooperation.\n\nAccording to the FO, Dar reaffirmed Pakistan’s commitment to the 2030 Agenda for Sustainable Development and outlined key policy measures driving growth, climate resilience and economic reform in his address.\n\n“The compounding effects of the pandemic, the food, fuel, and finance crises, as well as intensifying climate impacts, have reversed hard-won development gains and deepened inequalities,” the FM said in his speech.\n\n“Despite these challenges, Pakistan remains fully committed to achieving the 2030 Agenda. Our national development strategies, such as Uraan Pakistan, are aligned with the SDGs.”\n\nThe FM also highlighted initiatives such as the Benazir Income Support Programme and the ‘Living Indus’ and ‘Recharge Pakistan’ initiatives for climate adaptation and renewable energy, the FO’s statement read.\n\nDar also “emphasised the role of the Special Investment Facilitation Council (SIFC) in aligning foreign direct investment with Pakistan’s development priorities, particularly in sectors critical to sustainable growth”.\n\n“While national efforts are essential, these cannot succeed in isolation. As the Secretary-General has rightly emphasised, deep reform of the international financial architecture is critical for implementing the SDGs,” the FM continued.\n\n“Developing countries need scaled-up access to concessional and grant-based resources, meaningful debt relief, and scaled-up climate finance in order to bridge the SDG Financing Gap.”\n\nDuring his visit, Dar met with UN Secretary General Antonio Guterres at the UN headquarters, according to a statement from the FO.\n\nDuring the meeting, the FM reaffirmed Pakistan’s “unwavering and resolute commitment to multilateralism and the central role of the UN in addressing the most pressing global challenges”, the statement read.\n\nAccording to the FO, the secretary general appreciated Pakistan’s presence and initiatives at the UNSC.\n\nDar emphasised that Pakistan was fully committed to the purposes and principles of the UN Charter, especially the need to advance peace through dialogue and diplomacy.\n\nHe further stated Pakistan’s commitment to peace was underscored by the high-level debate on multilateralism and peaceful settlement of disputes and the meeting on UN-OIC cooperation, under Pakistan’s Presidency of the UNSC.\n\n“The deputy prime minister/foreign minister emphasised issues of critical national and regional importance to Pakistan, particularly the Jammu and Kashmir dispute, violation of the Indus Waters Treaty and externally sponsored terrorism in Pakistan,” the FO stated.\n\n“He stressed the imperative of a just settlement of the Jammu and Kashmir dispute in accordance with the resolutions of the Security Council. The DPM/FM lauded the secretary general’s leadership and sincere efforts for de-escalation of recent tensions between Pakistan and India.”\n\nDar also reiterated Pakistan’s unwavering support for Palestinian statehood, an immediate ceasefire in Gaza and firm opposition to Israeli plans for annexation in the occupied West Bank.\n\nThe two men also exchanged views on the need for promoting concessional financing to support development and climate goals, especially for developing countries and mobilising enhanced international support for debt relief and liquidity solutions for the Global South.\n\n“The DPM/FM emphasised that the secretary general’s ‘UN80’ initiative offered a critical opportunity to strengthen the three pillars of the United Nations to promote international peace and security, sustainable development and human rights worldwide,” the statement read, referring to the UN marking its 80th anniversary this year.\n\nAccording to the statement, Dar welcomed the appointment of a UN special envoy on Islamophobia and expressed readiness to support global efforts to combat religious intolerance.\n\nEarlier, the FO reported that Dar arrived in New York to attend high-level signature events of Pakistan’s UN Security Council (UNSC) Presidency, including a conference on Palestine.\n\n“During the visit, he will lead high-level signature events under Pakistan’s Presidency of the UN Security Council, hold bilateral and multilateral meetings in New York and Washington, DC, and represent Pakistan at the International Conference on the two-state solution, co-hosted by Saudi Arabia and France,” the FO said.\n\n“Deputy Prime Minister/Foreign Minister, Senator Mohammad Ishaq Dar, arrived in New York for an official visit from 21 to 28 July 2025,” the FO announced in a post on X.\n\n“During the visit, he will lead high-level signature events under Pakistan’s Presidency of the UN Security Council, hold bilateral and multilateral meetings in New York and Washington, DC, and represent Pakistan at the International Conference on the two-state solution, co-hosted by Saudi Arabia and France.”\n\nIt added that upon his arrival, FM Dar was received by Pakistan’s Permanent Representative to the UN, Asim Iftikhar, and the Ambassador of Pakistan to the United States, Rizwan Saeed Sheikh.\n\nAccording to a July 19 statement issued by the FO, Dar will attend a high-level conference on the “Peaceful Settlement of the Question of Palestine and the Implementation of the Two-State Solution”, to express Pakistan’s strong commitment and unwavering support for the right to self-determination of the Palestinian people.\n\nThe conference was originally planned for June but was postponed due to the Iran-Israel war, which also led to the rescheduling of Dar’s visit. According to The Guardian, the moot will now be held on July 28 and 29.\n\nSince October 8, Israeli strikes have killed more than 58,000 Palestinians in Gaza. Pakistan has consistently raised its voice for the people of Palestine, calling for an immediate, unconditional and permanent ceasefire in Gaza.\n\nEarlier this month, Pakistan urged the UNSC not to remain “a bystander” amid the deepening humanitarian crisis in Gaza.\n\nAside from the Palestine conference, Dar is also set to chair a high-level briefing of the UNSC, focused on enhancing cooperation between the UN and the Organisation of Islamic Cooperation (OIC).\n\n“The meeting is being held as part of Pakistan’s efforts to strengthen collaboration between the OIC and the UN for maintenance of international peace and security,” the FO statement said.\n\nDar is expected to have several other bilateral engagements with his counterparts, as well as senior UN officials, during his stay. He will also meet US Secretary of State Marco Rubio in Washington on July 25.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/21123139d547928.png",
  "retrievedAt": "2025-08-17T20:55:43.902Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925622/dar-says-pakistan-targeting-60pc-renewable-energy-by-2030-in-line-with-sdgs",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T08:27:15.000Z"
}
