{
  "title": "Survey of major roads in the offing to deal with rainwater issue - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Keeping in view the accumulation of rainwater for hours on city roads, massive use of machinery and other resources for early ponding and other civic issues, the government has decided to launch a survey to know existing level of major thoroughfares, residential and commercial buildings for formulating a uniformed policy and incorporating it in the existing engineering rules and regulations.\n\nWhile the Traffic Engineering & Transport Planning Agency (Tepa) has been assigned the task to carry out survey, the Park and Horticulture Authority (PHA) has also been asked to immediately start reducing the level of its infrastructure, wherever required, to ensure diversion of the rainwater into greenbelts, Dawn learnt on Sunday.\n\n“A meeting was held recently wherein heads of various civic departments, including Lahore Development Authority (LDA), Water and Sanitation Agency (Wasa), Tepa, PHA and others were also present.\n\nDuring the meeting, the secretary of the aforementioned agencies’ parent department—Housing, Urban Development and Public Health Engineering Department (HUD & PHED) raised serious concerns at accumulation of wastewater on the roads due to issues related to road level etc, stating that had this important task accomplished before, the accumulation of rainwater and delayed ponding and allied civic issues would have been averted.\n\nMoreover, besides saving public funds, the life of the roads would have been increased,“ a senior official privy to the meeting told Dawn while sharing discussion done in the meeting.\n\nGovt also plans to lower infrastructure level to dispose of water into greenbelts\n\nAccording to him, the Tepa officers, in presence of the LDA director general and others, were assigned the task to immediately launch the survey in a bid to lay down/define road levels to avert various civic issues in the future. The survey will be launched with immediate effect.\n\nDuring the discussion, the officers concerned also revealed that the PHA had conducted a survey a couple of years ago under which 200 points were identified where the civil work was required to divert the accumulated rainwater. But the survey recommendations were not followed in letter and spirit due to lack of funds amounting to Rs400m or so and lack of coordination among the civic agencies.\n\nWhen contacted, Housing Department Secretary Noorul Amin Mengal confirmed the development, stating that Tepa would soon start conducting the survey. According to him, the lack of interest allegedly on the part of officers regarding observance of defined road levels is causing massive damage to the road infrastructure.\n\n“They all (LDA, MCL etc) are constructing roads on roads, lowering the buildings level that is leading to accumulation of rainwater either on roads or diversion of water into buildings. Moreover, in various cases, the level of greenbelts is not even in accordance with the road level,” he explained. “It is time to put all such things in order to increase the life of the infrastructure,” he said.\n\nAn independent expert believes that the lack of maintenance of the road level, buildings and other infrastructure continue causing massive damage to the city of Lahore, in particular, and other major cities, in general, in the monsoon. He says the lack of enforcement of relevant laws and lack of technical knowledge are also adding miseries amid wastage of public money and resources.\n\n“It has, now become common in Lahore that high road levels divert rainwater in bulk into most houses in housing schemes, including even the posh locality of Gulberg, leaving residents with no option but to drain out the rainwater on their own,” says Wasim Khan, a former Chief Town Planner of LDA.\n\n“Moreover, the decades old Wasa’s drainage system is also another factor that is not performing well for timely drainage of the wastewater.”\n\nTo a question, he said, the DPC level for construction of the building should be about one-feet higher than the road level. But the people take it to further heights and construct large ramps. On the other hand, the road level is kept every time, making the level of houses lower than the ground level at various spots of the city district. “This all is a mess that needs to be removed once and for all by taking some steps in collaboration with the urban and engineering experts and relevant departments,” he suggested.\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:56:40.725Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925499/survey-of-major-roads-in-the-offing-to-deal-with-rainwater-issue",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:28:10.000Z"
}
