{
  "title": "Diversity in investment trends - Business - DAWN.COM",
  "author": null,
  "content": "While the government is struggling with the privatisation of hassle-ridden state-owned enterprises (SOEs), there has been some marked progress in mergers and acquisitions (M&A) of stakes, though with lacklustre foreign investment. Official figures show 133 mergers and acquisitions during fiscal year 2025, with relevant market sources saying stakes in more private enterprises are up for sale.\n\nThe Competition Commission of Pakistan (CCP) says it approved a total of 69 M&A transactions during FY25, facilitating inflows of foreign direct investment (FDI) of approximately $50m. These transactions spanned diverse sectors, including food, finance, logistics, aerospace, media, and e-commerce.\n\nOverseas Investors Chamber of Commerce & Industry (OCCI) Secretary-General Abdul Aleem has stressed the need to lift foreign direct investment — currently below 1pc of GDP — by simplifying regulations. “I appreciate the government’s direction, but the exit of some major multinationals highlights the urgency of improving the investment climate for both existing and prospective investors,” he said.\n\nIt may be noted here that the exit of multinationals also included entities whose parent companies took strategic decisions to restrict and consolidate their business operations in a changing global business environment.\n\n‘Unless significant investment is made in its people, the country cannot hope to achieve economic growth’\n\nThe absence of foreign investors in the enhanced investor interest in the Pakistan International Airlines (PIA) privatisation is largely attributed by Dawn’s analysts to the Special Investment Facilitation Council’s support for the process.\n\nThey caution, “While it does give the privatisation authorities a much-needed head start, it will not be sustainable unless preceded by policy and regulatory reforms.” The PIA has incurred a net loss of Rs4.6 billion, according to a report submitted by the finance ministry commission to the National Assembly Standing Committee about a fortnight ago, according to a PPP MNA.\n\nCertain SOEs have failed to complete their financial audits for several years, a statement from the finance ministry said on July 15. The Cabinet Committee on SOEs, chaired by Finance Minister Muhammad Aurangzeb, directed the concerned entities to initiate their audit process without any delay. It also instructed the Securities and Exchange Commission of Pakistan (SECP) to examine such cases and present its findings and recommendations to the committee in due course.\n\nPakistan has signed an agreement with Russia to revive, expand and upgrade the long-dormant Pakistan Steel Mills (PSM) in Karachi. In May, the two countries had agreed to revive PSM, which ceased its operations in 2015. In 2024, following the official closure of the mill, Sindh sought Russia’s assistance in restoring the ageing infrastructure, which had been incurring losses for decades. Russia’s Deputy Prime Minister Alexei Overchuk said Pakistan and Russia were “natural allies” and that Moscow viewed Islamabad as an important strategic partner in the areas of economy and energy.\n\nThe SECP’s corporate registry now encompasses over 258,000 companies, with 99.9pc of incorporations processed online, reflecting a 27pc year-on-year growth\n\nThe CCP also approved 64 domestic M&A deals across sectors such as retail, services, logistics, energy, food, and manufacturing. Sector-wise, 25 transactions occurred in industrial and manufacturing, 14 in energy and power, 13 in services, 11 in financial services, five in consumer goods and retail, and one in real estate.\n\nThen the large-scale manufacturing (LSM) sector posted a growth of 2.29pc in May compared to the same month last year, making it the third consecutive month of positive growth (attributed largely to a significant cut in the key interest rate to 11pc), according to data released by the Pakistan Bureau of Statistics on July 15. During the first 11 months of FY25 compared to the same period of last year, LSM recorded a negative growth of 1.21pc.\n\nLooking at a wider picture, the corporate regulator — the SECP — posted over 35,000 company incorporations in FY25; the highest number for a single fiscal year. According to the SECP’s statement, historic peaks were observed in January (3,442 incorporations) and May (3,605 incorporations). The SECP’s corporate registry now encompasses over 258,000 companies, with 99.9pc of incorporations processed online, reflecting a 27pc year-on-year growth in FY25 compared to FY24.\n\nTotal foreign inflows in T-bills at $1.28bn marked an improvement from the previous year. Yet heightened geopolitical tensions between Pakistan and India increased risk perception among investors. Data from the State Bank shows that outflows from domestic bonds were 24pc higher than inflows during the fiscal year.\n\nJune witnessed a sharp pullback, with foreign investors purchasing just $24m in T-bills while withdrawing $113m. Market analysts attributed cautious investor behaviour to the four-day Indian aggression in May, followed by continued hostile rhetoric from Indian media and political leaders, which fuelled fears of further escalation.\n\nThe equity market, known for its sensitivity to political and regional developments, also witnessed substantial foreign capital flight. In FY25, foreign inflows into equities stood at $460m, while outflows reached $815m — almost double. The market was visibly affected by the Indian aggression in May, which further dampened investor confidence.\n\n“Economic growth and human development are mutually reinforcing,” says Dr Maliha Lodhi. “Unless significant investment is made in its people, the country cannot hope to achieve economic growth, boost productivity, build a skilled workforce and become globally competitive.”\n\nPublished in Dawn, The Business and Finance Weekly, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/10/6722f19eceb9a.jpg?r=091001",
  "retrievedAt": "2025-08-17T20:57:12.222Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925398/diversity-in-investment-trends",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:46.000Z"
}
