{
  "title": "Nine members of Hindu family freed from forced labour in Khuzdar - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Levies Force have rescued nine members of a Hindu family from forced labour in a remote area of Khuzdar district.\n\nThe operation was launched in the Khura area of Gresha tehsil following a formal request by Senator Danesh Kumar to Balochistan Chief Minister Sarfraz Bugti, who promptly took notice and directed high-level authorities to intervene.\n\nActing on the CM orders, the commissioner of Kalat Division supervised a swift operation led by the Levies Force. During the raid, labourers were found working under coercive conditions. Two influential landlords, identified as Babu and Dad Mohammad Baloch, were arrested for their involvement in the forced labor.\n\nAll rescued individuals, including men, women, and children belong to Sanghar district of Sindh. They were reportedly lured to Balochistan under false pretenses and later forced to work on farmlands at gunpoint. The victims have been moved to the Levies station in Naal, where their statements were recorded. After completing legal formalities, they will be handed over to the Hindu Panchayat.\n\nThe incident has drawn widespread condemnation and is being described as a grave violation of human rights. Human rights groups, the Hindu Panchayat, and civil society have welcomed the Balochistan government’s prompt response.\n\nRescue operation ordered on Senator Kumar’s request\n\nSenator Kumar said that such acts of cruelty against minorities will not be tolerated and commended the chief minister for his timely and decisive action.\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/03/060914201130cb1.jpg?r=091428",
  "retrievedAt": "2025-08-17T20:57:55.444Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925572/nine-members-of-hindu-family-freed-from-forced-labour-in-khuzdar",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:40.000Z"
}
