{
  "title": "PM blocks review of net metering policy, again - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Power division told for third time to back off amid public criticism\n• Shelved plan sought to cut buyback rates from Rs27 to Rs11.3 per unit\n\nISLAMABAD: For a third time, Prime Minister Shehbaz Sharif has put on ice an official campaign against the government’s solar net-metering policy, even before a formal summary seeking a proposed revision in buyback rates could reach his office.\n\n“We have been instructed by the Prime Minister’s Office to stop this campaign against net-metering,” a senior official in the power division told Dawn, adding that the division had engaged the Ministry of Information and Broadcasting to build a narrative to be followed by the presentation of a summary to the federal cabinet.\n\n“For the third time, we have been told to back off…,“he said.\n\nWhile these campaigns had slowed down net-metered solar expansion, a rather more dangerous trend of hybrid solar expansion has accelerated that contributes nothing to the grid, but cuts down demand on the national grid, further accentuating the surplus capacity issue, the official said.\n\nEarlier, a change in buyback arrangement for net metering, cleared by the Economic Coordination Committee (ECC) of the cabinet, was turned down by the federal cabinet.\n\nThe decision was made following severe criticism from civil society and ‘prosumers’ — consumers who also produce electricity.\n\nOn July 10, Power Minister Awais Leghari announced he would be taking a revised plan to the cabinet based on consultations with some stakeholders to stagger the recovery of investment in net metering to two to three years from the current one and a half years.\n\nUnless measures are introduced, the expansion of solar systems could add to the surplus in the grid, he said, adding that the combination of the sale of surplus power and the containment of solar expansion would help grid stability.\n\nMr Leghari said the consumers had adopted solar net metering under a government policy and would not be penalised, but its return had become unjustified. If not corrected, even the net-metering consumers would be “bearing billions of rupees worth of electricity bills in future”.\n\nThe power division had prepared a summary for the prime minister and the federal cabinet, proposing a buyback rate from net-metered consumers to about Rs11.3 from Rs27 per unit at present, in line with the solar generation tariff from an average of existing IPPs.\n\nIn addition, it was also seeking a revised billing and settlement mechanism along with new net-metering regulations.\n\nThe existing Rs27 per unit buyback rate is considered by the power division as exorbitant and unsustainable, even though power distribution companies, including K-Electric, seldom make payments to prosumers.\n\nPractically, therefore, net metering helps consumers lower their exorbitant bills at the cost of subdued demand on the grid during daytime.\n\nUnaffordable and skyrocketing electricity rates pushed thousands of industrialists and middle-class residential consumers to net metering to contain their power bills as successive governments and power companies struggled to improve efficiency.\n\nThe power division earlier suggested no change in rates for existing prosumers, but reduced rates for those in the pipeline, along with fixed charges against sanctioned load.\n\nIt also wants the National Electric Power Regulatory Authority (Nepra) to “rationalise” buyback rates and settlement mechanisms, arguing that it had increased the net-metering buyback rate from Rs9-10 to Rs19 and then Rs27.\n\nAccording to official estimates, about 325,000 net-metered connections in residential, commercial and industrial consumers exist in the country with an installed capacity of about 6,500MW.\n\nThe power division and distribution companies (Discos) claim almost equal or more systems in the pipeline but these projections are based on solar panel import data of the State Bank of Pakistan, which has been challenged by Senate Standing Committee on Finance on the basis of trade-based money laundering cases reported by the FBR.\n\nLahore reportedly leads the net-metering rush with over one-fourth of the total connections, followed by 11 per cent in Rawalpindi, 8.5pc in Karachi, 7.5pc each in Multan and Islamabad, 5pc in Faisalabad and about 3.7pc each in Peshawar, Bahawalpur, Sialkot and Gujranwala. This is on top of subsidised solar connections being provided by the provincial governments of the top two populous provinces — Punjab and Sindh — at taxpayers’ money in addition to off-grid and hybrid connections.\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:58:06.031Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925577/pm-blocks-review-of-net-metering-policy-again",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:40.000Z"
}
