{
  "title": "Trump’s renewed interest in Pakistan has India recalibrating China ties - World - DAWN.COM",
  "author": null,
  "content": "United States President Donald Trump’s lunch meeting with Chief of Army Staff (COAS) Field Marshal Syed Asim Munir prompted a private diplomatic protest from India in a warning to Washington about risks to their bilateral ties while New Delhi is recalibrating relations with China as a hedge, officials and analysts said.\n\nThe meeting and other tensions in the US-India relationship, after decades of flourishing ties, have cast a shadow in trade negotiations, they said, as Trump’s administration weighs tariffs against one of its major partners in the Indo-Pacific.\n\nIndia blames Pakistan, especially the military establishment, for supporting what it alleges is cross-border terrorism and has told the US it is sending the wrong signals by wooing Field Marshal Munir, three senior Indian government officials directly aware of the matter told Reuters.\n\nIt has created a sore spot that will hamper relations going forward, they said.\n\nPakistan has denied accusations that it supports militants who carried out an attack in Indian-occupied Kashmir’s Pahalgam and that New Delhi has provided no evidence that it is involved.\n\nUS-India ties have strengthened in the past two decades despite minor hiccups, at least partly because both countries seek to counter China.\n\nThe current problems are different, said Michael Kugelman, a Washington-based senior fellow at the Asia Pacific Foundation think tank.\n\n“The frequency and intensity with which the US is engaging with Pakistan, and seemingly not taking Indian concerns into account, especially after India’s recent conflict with Pakistan, has contributed to a bit of a bilateral malaise.\n\n“The concern this time around is that one of the triggers for broader tensions, that being Trump’s unpredictability, is extending into the trade realm with his approach to tariffs,” he said.\n\nPrime Minister Narendra Modi’s office and India’s foreign ministry did not respond to a request for comment. The foreign ministry has previously said that it had “taken note” of the Trump-Munir meeting.\n\nA US official said they do not comment on private diplomatic communications and that the US enjoys strong relationships with both India and Pakistan.\n\n“These relationships stand on their own merits, and we do not compare our bilateral relationships with one another,” the US official said.\n\nThe US seems to have taken a different tack on Pakistan after a brief conflict broke out between the nuclear-armed rivals in May when India launched strikes on what it called terrorist targets across the border in response to a deadly attack on tourists from the majority Hindu community in India-held Kashmir the previous month.\n\nAfter four days of aerial dogfights, missile and drone attacks, the two sides agreed to a ceasefire.\n\nIndia and Pakistan have skirmished regularly and fought three full-scale wars since independence in 1947, two of them over the Kashmir dispute.\n\nA few weeks after the May fighting, Trump hosted Field Marshal Munir for lunch at the White House, a major boost in ties with the country, which had largely languished under Trump’s first term and Joe Biden. It was the first time a US president had hosted the head of Pakistan’s army at the White House unaccompanied by senior Pakistani civilian officials.\n\nIndian leaders have alleged that COAS Munir’s view of India and Pakistan is steeped in religion. “Tourists were murdered in front of their families after ascertaining their faith,” Indian foreign minister Subrahmanyam Jaishankar said in May, referring to the Pahalgam attack.\n\n“To understand that, you’ve got to also see … you have a Pakistani leadership, especially their army chief, who is driven by an extreme religious outlook,” he claimed.\n\nPakistan says it is Modi who is driven by religious extremism, and that his brand of Hindu nationalism has trampled on the rights of India’s large Muslim minority. Modi and the Indian government say they do not discriminate against minorities.\n\nCOAS Munir’s meeting in the White House added to India’s chagrin over Trump’s repeated insistence that he averted nuclear war between the two nations by threatening to stop trade negotiations with them. The comment drew a sharp response from Modi, who told Trump that the ceasefire was achieved through talks between army commanders of the two nations, and not US mediation.\n\nIn the days following his June 18 meeting with COAS Munir, people from Modi’s office and India’s national security adviser’s office made separate calls to their US counterparts to register a protest, two of the officials said. The protest has not been previously reported.\n\n“We have communicated to the US our position on cross-border terrorism, which is a red line for us,” said a senior Indian official. “These are difficult times … Trump’s inability to understand our concerns does create some wrinkle in ties,” he added, seeking anonymity due to the sensitivity of the matter.\n\nTrump and COAS Munir discussed continuation of a counterterrorism collaboration, under which the US has previously provided weapons to Pakistan, a non-Nato US ally, and talked about ways to further strengthen ties, a readout of the meeting from the Inter-Services Public Relations said.\n\nThat raised concern in New Delhi that any arms Pakistan receives from the US could be turned on India if the neighbours end up in conflict again, two of the officials said.\n\nDespite what used to be public displays of bonhomie between Trump and Modi, India has been taking a slightly harder stance against the US in recent weeks, while trade discussions have also slowed, the Indian officials and an Indian industry lobbyist said.\n\nModi declined an invitation from Trump to visit Washington after the G7 meeting in Canada in June.\n\nEarlier this month, New Delhi proposed retaliatory duties against the US at the World Trade Organisation, showing trade talks were not going as smoothly as they were before the India-Pakistan clashes.\n\nIndia, like other nations, is trying to figure out a way to deal with Trump and is recalibrating ties with China as a hedge, said Harsh Pant, foreign policy head at India’s Observer Research Foundation think tank.\n\n“Certainly there is an outreach to China,” he said. “And I think it is mutual … China is also reaching out”.\n\nLast week, India’s Jaishankar made his first visit to Beijing since a deadly 2020 border clash between Indian and Chinese troops.\n\nIndia is also making moves to ease restrictions on investments from China that were imposed following the 2020 clash.\n\nThe thaw comes despite India’s prickly relations with China and Beijing’s close ties and military support to Pakistan.\n\nBut New Delhi’s concern about Trump’s own engagement with China, which has ranged from conciliatory to confrontational, appears to have contributed to its shift in stance on Beijing.\n\n“With an unpredictable dealmaker in the White House, New Delhi cannot rule out Sino-US rapprochement,” said Christopher Clary, an associate professor of political science at the University at Albany, New York.\n\n“India is troubled by Chinese help to Pakistan and growing Chinese influence elsewhere in India’s near abroad, such as Bangladesh. Yet New Delhi has largely concluded that it should respond to creeping Chinese influence by focusing its pressures on its nearest neighbours and not on China.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/21194111f096470.jpg",
  "retrievedAt": "2025-08-17T20:54:40.364Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925661/trumps-renewed-interest-in-pakistan-has-india-recalibrating-china-ties",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T15:00:11.000Z"
}
