{
  "title": "Radio journalist killed in southern Philippines - World - DAWN.COM",
  "author": null,
  "content": "A local radio broadcaster was gunned down in the southern Philippines on Monday, a presidential task force said, adding to the growing list of media workers killed in a country ranked among the most dangerous in the world for journalists.\n\nErwin Labitad Segovia, 63, a broadcaster for Radio WOW FM and host of a programme that focused on social issues and local governance, was shot dead by a still-unidentified gunman while on his way home shortly after completing his morning broadcast.\n\nAccording to the police, Segovia was followed by two suspects on a motorcycle.\n\nThe Philippines ranked ninth on the 2024 Committee to Protect Journalists’ Global Impunity Index, which tracks countries where journalist murders remain unsolved.\n\nAuthorities have launched an investigation and have activated a special investigation task group to handle the case, Jose Torres Jr, executive director of the presidential task force on media security, said in a statement.\n\n“The safety of journalists remains a priority for the government, and justice for victims of media-related violence continues to be a national concern,” Torres said.\n\nSegovia’s murder highlights the continuing risks faced by journalists in the Philippines, especially in provinces where local power dynamics often go unchecked.\n\nMore than 200 journalists have been killed in the country since democracy was restored in 1986, according to the National Union of Journalists of the Philippines, including 32 in a single incident in 2009 in the south of the country.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/110800158dcabbc.jpg?r=080215",
  "retrievedAt": "2025-08-17T20:55:33.641Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925626/radio-journalist-killed-in-southern-philippines",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T08:33:21.000Z"
}
