{
  "title": "Indonesia ferry fire kills three, more than 500 rescued - World - DAWN.COM",
  "author": null,
  "content": "Three people died and more than 500 others were rescued after a ferry caught fire off the Indonesian island of Sulawesi, emergency officials said Monday.\n\nPassengers jumped overboard with lifejackets after the fire broke out on Sunday at the stern of the KM Barcelona 5, as it sailed to Manado, according to the Indonesian coast guard.\n\nA video released by the Manado rescue agency showed a coast guard vessel spraying water on the ferry, which was emitting black smoke.\n\nIndonesian authorities previously reported five people died in the accident, but later revised the death toll to three.\n\n“Until now, the joint rescue team is still conducting the search and rescue operation because the data is still developing,” Manado rescue agency head George Leo Mercy Randang told AFP on Monday.\n\n“Our post is still open 24 hours a day, in case families want to report about their missing relative.” At least 568 people were rescued from the ferry and water while three others were found dead, the national search and rescue agency said in a statement Monday.\n\nThe ferry’s log had only registered 280 passengers and 15 crew on board. Local media reported that the ship had a capacity for 600 people.\n\nMarine accidents are a regular occurrence in the Southeast Asian archipelago of around 17,000 islands, in part due to lax safety standards or bad weather.\n\nSunday’s fire came just weeks after another ferry sank off the popular resort island of Bali due to bad weather, killing at least 19 people.\n\nIn March, a boat carrying 16 people capsized in rough waters off Bali, killing an Australian woman and injuring at least one other person.\n\nAnd in 2018, more than 150 people drowned when a ferry sank in one of the world’s deepest lakes on Sumatra Island.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/210938205fb24b5.png",
  "retrievedAt": "2025-08-17T20:55:49.529Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925605/indonesia-ferry-fire-kills-three-more-than-500-rescued",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T05:30:03.000Z"
}
