{
  "title": "Literary Notes: Glossaries of Federal Board’s Urdu textbooks: inaccurate, misleading - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUHAMMAD Ahsan Khan is a 90-year-old scholar from Lahore. A voracious reader, expert lexicographer and true connoisseur of the Urdu language, he loves words. That’s why whenever he comes across some erroneous expressions or incorrectly explained words of Urdu, he gets irritated, makes a phone call to me and expresses his concern.\n\nLast week, too, Ahsan Khan Sahib gave me a ring. Sounding shocked, he lamented that even the textbooks of Urdu are now full of errors and the glossaries in them are misleading. He then asked me to have a look at some Urdu textbooks, especially the ones published by the Federal Textbook Board in collaboration with the National Book Foundation, Islamabad.\n\nOn his suggestion, I got copies of Urdu textbooks for class IX, X, XI and XII, published by the Federal Textbook Board, and leafed through them. The back title of each book says “Approved by Government of Pakistan; Ministry of Federal Education & Professional Training; National Curriculum Council Secretariat”.\n\nLet us have a quick look at the glossaries appended to these textbooks, published by the Federal Textbook Board, to find why Ahsan Sahib was so annoyed. The book titled Model Darsi Kitab (Model Textbook): Urdu, for Class XI, has listed in its glossary, for instance, “pesh khaima” (page 130). The meanings given are “nateeja, kisi kaam se pehle aane vali soorat”, which can be translated into English as ‘result, something happening before some work is done’. Aside from what pesh khaima actually means, what makes one wonder is how result can occur before something is done.\n\nAnother entry on the same page is “tees maar khani dikhana” and instead of explaining, the same expression is repeated as meaning. It simply means that nobody has bothered to proofread it even. On the next page, an entry is “dastak”. The meanings given are “darvaza khatkhatana”. What the compilers could not understand is that the word dastak means ‘knock at a door’ (noun) and not ‘to knock on a door’ (verb), but the definition given has turned the noun into an infinitive.\n\n“Laa ubaali tabiyet” is the entry on page 131. The meanings given are “josh vala tabiyet”. Firstly, tabiyet is a feminine noun but the compilers think it is masculine, hence vala, instead of vali. Secondly, the meanings given are exactly opposite: laa ubaali is an Arabic phrase which literally means ‘I don’t care’. The correct meaning would be ‘careless disposition’.\n\nThe book for class X says “khalish” means “khwahish jo poori na ho” (page 167). But literal meaning of khalish, a Persian word, is ‘prick of a thorn’ and it signifies mental prick, continued resentment or concern. “Safed posh”, says the book on page169, is someone clothed in white. But it is a metaphor and it refers to someone not rich but maintaining a certain standard and good reputation. Class IX book says “maoof hona” means “sochne smajhne ke qabil” (page 122). Apparently, the words na hona are missing and it has reversed the sense. On page 123, the explanation to the word “bhaar” is incomplete and the word bhatti is spelt as “bathi”, again proving that proofreading is something unheard of in the Federal Board.\n\nSeveral entries in these books are given in plural form or as oblique case while a glossary, and a dictionary, too, must list words in singular forms and avoid oblique cases. A glossary sometimes needs to explain different shades of meanings or use synonyms, separated with commas or semicolon. But the compilers are, perhaps, laa ubaali (according to their own definition of the phrase), leaving punctuation marks out, listing more than one shades of meanings in one go, without separating the nuances. Josh, you know!\n\nHere I have restricted myself to the glossaries only, though there are many other lapses in text as well, for instance, in class X book, Zahra Nigah’s name has been written as “Zahra Niga” in the table of contents, but in the glossary it has been spelt as “Zahra Nigar” (page 173). The signs to show tashdeed (phonetic twining of consonants) and izaafat (enclitic possessive or adjectival compound) are also missing from the glossaries, making pronunciation difficult for the students.\n\nThe facts mentioned here are based on a cursory reading and a thorough checking may reveal that much of the glossary in each book is inaccurate and misleading. One hopes the Federal Board would contact a senior lexicographer like Ahsan Khan or Saleemur Rahman for putting the books in order.\n\nTwo of these books I purchased from the National Book Foundation’s Karachi office have been stamped with the words “Test Edition”, with print line saying that about 100, 000 or so copies have been printed. One wonders if textbooks can be published in large quantities, sold and taught on a trial and error basis!\n\ndrraufparekh@yahoo.com\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/07/3110025256e559b.jpg?r=100258",
  "retrievedAt": "2025-08-17T20:57:35.546Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925538/literary-notes-glossaries-of-federal-boards-urdu-textbooks-inaccurate-misleading",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:40.000Z"
}
