{
  "title": "Russia slams EU sanctions on India’s Nayara refinery - World - DAWN.COM",
  "author": null,
  "content": "MOSCOW: Rosneft, Russia’s biggest oil producer, on Sunday slammed European Union sanctions on India’s Nayara Energy refinery as unjustified and illegal, saying the restrictions directly threatened India’s energy security.\n\nThe European Union’s 18th package of sanctions against Russia over the conflict in Ukraine, was approved on Friday and is aimed at dealing further blows to Russia’s oil and energy industry. Nayara Energy was one of the targeted companies.\n\n“The Nayara Energy refinery is a strategically important asset for the Indian energy industry, providing a stable supply of petroleum products to the country’s domestic market.\n\nThe imposition of sanctions against the refinery directly threatens India’s energy security and will have a negative impact on its economy,“ Rosneft said.\n\nRosneft said it holds less than 50 per cent in Nayara and does not control the enterprise, which is managed by an independent board. It described the EU’s justification for the sanctions as “far-fetched and false in context.”\n\n“Nayara Energy is an Indian legal entity whose operations support the development of its assets,” Rosneft said, adding that the company is fully taxed in India, has never paid dividends to shareholders, and reinvests profits into refining, petrochemicals, and retail operations.\n\nThe move may jeopardise Moscow’s plan to sell 49.13pc Rosneft stake to Reliance Industries\n\nThe Russian oil giant accused the EU of disregarding international law and third-country sovereignty, calling the move part of a broader effort to destabilise global energy markets and engage in unfair competition.\n\nAccording to the Bloomberg, Russian energy giant Rosneft’s plan to sell its stake in India-based Nayara Energy Ltd may be imperiled by fresh restrictions from the European Union.\n\nThe refinery, in which Rosneft has a 49.13pc stake, will be targetted in the bloc’s 18th sanctions package over Moscow’s invasion of Ukraine, an EU official said.\n\nRosneft has held talks with Reliance Industries Ltd, owned by billionaire Mukesh Ambani, for a possible stake sale in Nayara, according to a local media report. The sanctions will make it difficult for Reliance to buy a stake in its competitor as it might jeopardise the company’s business in Europe, a region that regularly imports Indian fuels including diesel.\n\nNayara operates a 400,000-barrels-per-day refinery and owns nearly 7,000 fuel outlets across India. It is also developing an integrated petrochemicals plant next to its refinery. Reliance Jamnagar processor, the world’s largest refining complex, is within a few kilometers of Nayara’s Vadinar unit.\n\nThe ownership of Nayara is currently split between Rosneft and SPV Kesani Enterprises Co Ltd, an investment consortium. The remaining shares are held by retail investors. Rosneft has been keen to exit its India venture as the company hasn’t been able to repatriate its earnings due to the sanctions, according to local media reports.\n\nRosneft has held discussions with several potential buyers, including Saudi Aramco, the Economic Times reported. The Russian energy giant and partners bought Nayara from Essar Group in 2017 for $12.9 billion.\n\nEU has imposed restrictions on Russian petroleum refined in third countries, a move that could limit Indian fuel exports to Europe. The subcontinent bought 80pc of Russian seaborne exports of Urals as of June this year — private refineries dominated this trade — processing them into fuels for export globally including to many across the EU.\n\nOver time, India has become a crucial source of fuels for countries including the Netherlands, Spain and Romania.\n\nFlows have surged since the Russia-Ukraine war in 2022, when Indian refiners started benefiting from cheaper Urals that were being diverted from western markets.\n\nPublished in Dawn, July 21st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/1810102987d3125.jpg?r=101109",
  "retrievedAt": "2025-08-17T20:56:49.785Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1925539/russia-slams-eu-sanctions-on-indias-nayara-refinery",
  "dateList": "2025-07-21",
  "date_published": "2025-07-21T00:27:58.000Z"
}
