{
  "title": "Adoption of Zainab Alert Bill by Parliament,a historic achievement : Governor Sindh",
  "link": "https://www.app.com.pk/national/adoption-of-zainab-alert-bill-by-parliamenta-historic-achievement-governor-sindh/",
  "date_published": "2020-03-04T21:47:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 5 (APP):Governor Sindh Imran Ismail has said that adoption of Zainab Alert Bill from both houses of parliament was a historic achievement as it would help in prevention of kidnapping and child abuse as well as punish the culprits involved in such heinous crimes.\nThis he said while speaking with father of baby Zainab of Kasur, Amin Ansari here at Governor House here on Thursday, said a statement.\nMember Provincial Assembly of Sindh Ms. Sidra Imran and President Roshni helpline Mr. M.Ali were also present on the occasion.\nTalking to Amin Ansari, Governor Sindh Imran Ismail said that whole Nation salutes Amin Ansari, who has acted with utmost restraint and patience on a great personal loss of his daughter Zainab.\nHis reaction on this tragic incident has been remarkable as he started a campaign to create public awareness about this sensitive issue, which has resulted in adoption of bill against prevention and punishment for such brutal and inhuman acts, the Sindh Governor added.\nThe Governor Sindh said that prevention and punishment of tragic crimes against Women and Children were in the priorities of Federal Government and it was taking all required measures to ensure the same.\nMPA Ms. Sidra Imran said that after adoption by the parliament, the provinces were bound to implement this bill in their respective jurisdictions.\nPakistan Tehreek-e-Insaaf has taken lead in this regard and she has submitted a resolution in the provincial Assembly for its early implementation in Sindh, she added.\nGovernor Sindh congratulated Ms. Sidra Imran for submitting a resolution in this regard and also lauded the role of Roshni helpline for creating awareness about Child Abuse and other related issues.\nAmin Ansari said that the only aim of his endeavors was to prevent and preempt an incident like Zainab’s in future.\nHe would go and raise his voice to any place or forum required in this regard, he added.",
  "retrievedAt": "2025-08-11T18:54:20.609Z"
}
