{
  "title": "Parliamentary cooperation to be strengthened to further cement Pak-Iran relations: Mandviwalla",
  "link": "https://www.app.com.pk/national/parliamentary-cooperation-to-be-strengthened-to-further-cement-pak-iran-relations-mandviwalla/",
  "date_published": "2020-03-04T23:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 05 (APP):Deputy Chairman Senate Saleem Mandviwalla on Thursday said parliamentary cooperation would be strengthened and potential for enhancing the economic links would be exploited to further cement the bilateral relations between Pakistan and Iran.\nHe said this while talking to Ambassador of Iran, Seyed Mohammad Ali Hosseini, who called on him here at Parliament House, said a press release issue here.\nThe deputy chairman said that both Pakistan and Iran shared common dream for development and prosperity of people, as the relationship between the two countries were embedded in history.\nSenators Lt. Gen. (R) Abdul Qayyum, Sajjad Hussain Turi and Walid Iqbal were also present during the meeting.\nMandviwalla said that Pakistan and Iran shared common traditions, religious values and social aspirations and had supported each other not only on International issues but in the development agenda.\nHe said that Pakistan attached highest importance to its historic relations with Iran adding “We are looking forward to further enhance the traditional ties for better economic and political collaboration through increased Parliamentary linkages between the two countries.”\nThe deputy chairman said that Pakistan and Iran had always cooperated with each other at the international forums and had adopted a unified stance on different issues. “The recent years have witnessed enhanced cooperation in defence and security areas”, Mandviwalla observed.\nHe said that trade potential must be exploited for mutual benefit of the people of two sides.\nThe both sides needed to work on evolving a mechanism to boos the trade , he added.\nConvener of Pak-Iran Friendship Group in the Senate Senator Lt. Gen. (R) Abdul Qayyum and members of the group also welcomed the Iranian ambassador.\nThey said Pakistan was keen to work towards unity among Muslims as many challenges would be overcome if the Muslims countries would work unitedly.\nThey also underlined the need for direct flights between Islamabad and Tehran.\nThe Iranian ambassador said that connectivity was very important as both the countries enjoyed social and cultural affinities.\nHe informed that Iranian art and cinema industry was interested to invest in Pakistan and wanted to make a movie on the life of Allama Iqbal.\nThe ambassador said “We are also keen to develop cooperation in the field of media by setting up an Iranian media house in Pakistan.”\nHe also briefed the senators about the steps taken by Iranian government to overcome coronavirus.\nHe said that excellent cooperation had been seen between Pakistan and Iran at boarders.\nRegarding Kashmir, the deputy chairman appreciated the Iranian counterparts and Iran’s highest level leadership for their support on Kashmir issue.\nHe said that the people of Pakistan acknowledged the support and cooperation being extended by the Iranian side.\nIranian Ambassador agreed with the views of deputy chairman and stressed for further boosting cooperation in different sectors through enhanced interaction.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:54:18.859Z"
}
