{
  "title": "NAB’s anti-graft strategy yielding results: NAB chairman",
  "link": "https://www.app.com.pk/national/nabs-anti-graft-strategy-yielding-results-nab-chairman/",
  "date_published": "2020-03-04T22:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP):National Accountability Bureau (NAB) Chairman Javed (Retd) Iqbal Thursday said the bureau’s anti-corruption strategy had proved very successful.\nChairing fortnightly meeting to review NAB performance, he said NAB had prescribed timelines for efficient, effective and expeditious disposal of case from complaint verification-to-inquiry-to investigation and finally to a reference in accountability court, said a press release issued here.\nHe said the anti-graft body had recovered Rs328 billion from corrupt and deposited in national exchequer.\nThe operational methodology of NAB for processing of all corruption cases from complaint verification, inquiry and investigation was also reviewed.\nThe NAB’s investigation officers were directed to follow code of conduct and ensure zero tolerance policy.\nHe said special focus was being given to awareness and prevention activities to educate the people at large about ill effects of corruption.\nHe said NAB in collaboration with Higher Education Commission (HEC) had established over 55,000 character building societies (CBS) in all the leading universities/colleges across the country to build an effective edifice against corruption which would be increased upto 60,000 Dec 2020.\nHe said the performance of all Regional Bureau’s of NAB would be conducted on midterm and annual basis at a given criteria under Quantified Grading System in order to review and further improve the performance of officers/officials of NAB as with better quantitative and qualitative improvements in Operational Efficiency Index, rationalized workload, clearly drawn job descriptions and institutional support and supervision.\nHe said monitoring and evaluation system (MES) had been developed for catering the needs of all concerned having salient features of maintenance of data at each stage including complaint entry, complaint verification, inquiry, investigation, prosecution stage and record preservation of Regional Board Meetings and Executive Board Meetings including case brief was discussed and decided that Monitoring and Evaluation (M&E) System would be implemented forthwith with the ability to analyze data in qualitative and quantitative form having warnings and alarms system for violators.\nDuring the meeting thorough deliberation of the performance of NAB all regional bureaus and NAB headquarter including operation, prosecution and awareness and prevention divisions of the NAB was reviewed and measures taken by the present management of NAB to further improve the performance and efficiency of NAB were discussed and directed to be implemented in letter and spirit.",
  "retrievedAt": "2025-08-11T18:54:19.947Z"
}
