{
  "title": "NA body for withdrawing security from non-entitled persons",
  "link": "https://www.app.com.pk/national/na-body-for-withdrawing-security-from-non-entitled-persons/",
  "date_published": "2020-03-05T02:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP):The National Assembly Standing Committee on Rules, Procedure and Privileges on Thursday directed the provincial administration to withdraw security from the non-entitled persons and submit a compliance report within 15 days.\nThe committee meeting, chaired by Rana Muhammad Qasim Noon, also sought details of the persons getting ‘unauthorized’ security from the provincial governments.\nThe body directed provincial administration to provide security to members of National and Provincial Assemblies on priority. “Each lawmaker should be given two police personnel for the security purpose.”\n“Officials of interior ministry, representative of home ministry from the provinces and police should sit together and bring required amendments in the rules and regulations regarding the provision of security to people’s representatives,” the committee directed.\nThe officials from the provinces apprised the committee that security of VVIPs which included President, Prime Minister and visiting foreign heads of states and government was covered by Blue Book.\nThey said the security of VIP which included Chairman of Senate, Speaker of National Assembly, Chief justice of Pakistan, judges of Supreme Court, federal ministers, governors, Chief Minister and visiting VIPs, and equivalent status and persons was covered under “Rules for security and protection of VIPs and visiting VIPs and equivalent status.”\nThey said provincial intelligence and threat assessment committees had been constituted under the chairmanship of respective Home secretaries and chief commissioner of Islamabad.\n“These committees ascertain the threat to the safety and security to the parliamentarians as well as the other citizens and take appropriate action for their protection” they said.\nA representative from the Balochistan government apprised the committee that provincial and divisional threat assessment committees determine actual existing threat to the individuals requesting for police guards and squad. He said on the recommendation of the committee, the security cover is being provided to persons, keeping in view the threat nature.\nHe also apprised the committee that keeping in view the security situation in the province, lawmakers were also allowed to hire services of private security guards.\nAn official of Khyber Pakhtunkhwa informed the committee that two policemen and two levies personnel were performing security duties with the MPAs.",
  "retrievedAt": "2025-08-11T18:54:15.830Z"
}
