{
  "title": "Zafar Mirza appeals public not to believe in rumors on coronavirus",
  "link": "https://www.app.com.pk/national/zafar-mirza-appeals-public-not-to-believe-in-rumors-on-coronavirus/",
  "date_published": "2020-03-05T00:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP):Special Assistant to the Prime Minister on Health Dr Zafar Mirza Thursday urged that the nation not to pay heed to any rumour over the coronavirus as a vested quarter is trying to mislead people with fake information.\nTalking to Private news, Zafar Mirza said the government is well-prepared to prevent the deadly coronavirus which badly spread other countries, adding, government has taken adequate measures to ensure that the disease does not spread further.\nDr Zafar said the health ministry has taken all-out preparations to provide necessary treatment if anyone in the country is found infected with coronavirus.\nTalking about schools, Special Assistant said the coronavirus situation in the country is not serious enough that schools need to be closed.\nHe said the National Ministry of Health had not suggested that schools be shut down. However, provinces are free to make their own decisions in this regard.\nDr Mirza said the number of people with coronavirus in Pakistan is quite low and the five people who were diagnosed are also recovering.\n“Our preparations are complete and we are screening people returning from abroad,” said the special assistant. The health ministry’s vision is very clear. People are being screened at airports and all entry points.”\nWe are even monitoring people returning from abroad Dr Mirza added.\nHe urged people not to panic and remain hopeful. The public shouldn’t chase after masks but wash their hands frequently and maintain good hygiene, he advised.\nEvery cold or flu is not the coronavirus, said the PM’s aide. However, those with a cold or flu should avoid visiting crowded places.\nPeople returning from China and Iran should stay in isolation for 14 days, he said. There is no restriction on Pakistanis outside Wuhan city returning to the country.\nDr Mirza also spoke about the health ministry’s preparations for the dengue season. He said preparations have begun and a national programme will be launched.",
  "retrievedAt": "2025-08-11T18:54:17.040Z"
}
