{
  "title": "Pakistan, US to work jointly to save ‘suffering humanity’ from drugs’ menace",
  "link": "https://www.app.com.pk/national/pakistan-us-to-work-jointly-to-save-suffering-humanity-from-drugs-menace/",
  "date_published": "2020-03-04T22:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP):Pakistan and United States of America have resolved to jointly work to save the suffering humanity by eradicating the menace of drugs.\nThis was agreed in meeting between Minister of State for Narcotics Control Shehryar Khan Afridi and US Principal Deputy Assistant Secretary of State, James Walsh, in Vienna, Austria, on the sidelines of the 63rd session of the United Nations Commission on Narcotic Drugs (CND), said a press release received here on Thursday.\nThe meeting agreed that after peace dialogue signed between the US and Afghan Taliban, it was about time to wage joint efforts to curb drug trafficking to save the suffering humanity.\nIt was decided in the meeting that a workable plan of action would be developed in the wake of Peace Deal recently signed between the US and Afghan Taliban in Afghanistan.\nShehryar Afridi emphasised upon the need for continued engagement for countering the threat of opiates originating in the region.\nHe said that it was about time that Pakistan and the US worked closely towards securing the region from menace of drugs.\nThe minister suggested that bilateral engagements between the two countries should be held in Islamabad and Washington to help wage joint efforts to eradicate the illicit drugs trade.\nJames Walsh agreed to the idea and said that the US was looking forward to work closely with Pakistan in that regard.\nHe expressed his appreciation for the initiatives taken by Ministry of Narcotics Control Pakistan and the Anti-Narcotics Force (ANF) and assured of all possible cooperation.\nWalsh said that the US administration would make efforts to ensure end of violence in Afghanistan.\nHe said the US was fully committed to fight the spread of drugs and it would continue to engage with Pakistani authorities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T18:54:18.866Z"
}
