{
  "title": "Cuba lists recent measures against her by USA",
  "link": "https://www.app.com.pk/national/cuba-lists-recent-measures-against-her-by-usa/",
  "date_published": "2020-03-05T02:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 5 (APP):The embassy of Cuba (Embajador de Cuba en Pakistán), Thursday terming the policy of the United States government towards Cuba as irrational and inhuman, stated that such policy also violated the human rights of the Cuban people and other countries.\nIn a statement issued here, it stated that the year 2019 was a year of a particular cruelty against Cuba. ” At this stage, USA produced 86 actions and measures, which evidenced an intensification of the blockade with a marked interest in deteriorating bilateral relations to the maximum”, it added.\nThe embassy said, “Of that total, 44 were specific actions of the blockade that includes fines and other types of sanctions with US entities or third countries, the inclusion of Cuban companies on unilateral lists, the extension of laws and proclamations on the blockade, announcements related to the application of Title III of the Helms-Burton Act and regulatory changes.\n” Another 31 measures are examples of the extraterritorial application of the blockade. The rest, 11 measures, are decisions of the Department of State on the prohibition of entry into the United States to Cuban officials, Cancellation of agreements, expulsion of Cuban officials, and restriction of the validity of certain visas, among others.\n“The current policy represents a very high cost for Cuba difficult to quantify. These measures affect the daily life of citizens: fuel transportation (in five packages of measures, 27 companies, they sanctioned 54 vessels and three individuals linked to this sector.\n“People-to-people trips were eliminated, licenses for vessel trips, pleasure boats and private aircraft were denied, regular flights to airports in the country were suspended, except for Havana, re-imposition of the 10% rule for imports from the United States or from a third country for items that have more than 10% of US components.\nThey demonized the Cuban medical cooperation program. Brazil, Ecuador and Bolivia yielded to the pressures that seek to affect one of our main sources of income.\n“The sanctions applied in 2019 constituted 13 fines for violating the blockade for more than USD 2 billion, which discourages possible investments or business partners for the possibility of filing claims under Title III of the Helms-Burton Act. There are 20 lawsuits against Cuban, United States and third-country companies”, the embassy concluded.",
  "retrievedAt": "2025-08-11T18:54:12.309Z"
}
