{
  "title": "President visits Chinese embassy, expresses condolences over Karachi’s tragic incident",
  "link": "https://www.app.com.pk/national/president-visits-chinese-embassy-expresses-condolences-over-karachis-tragic-incident/",
  "date_published": "2022-04-30T11:19:00.000Z",
  "source": "APP",
  "content": "President visits Chinese embassy, expresses condolences over Karachi’s tragic incident\nTalking to the Charge d’ Affaires, Pang Chunxue and officers of the Chinese Embassy, the president said that the entire Pakistani nation was in deep pain and shock over the unfortunate incident and shared the grief of Chinese brothers and sisters.\nHe reiterated the resolve that Pakistan would leave no stone unturned to ensure the safety of Chinese nationals and bring to justice the elements involved in this heinous incident.\nCondemning the incident, the president said that the hostile intent of our enemies was behind it who wanted to harm Pak-China friendship and China Pakistan Economic Corridor project but they would not succeed in their designs as both countries enjoyed deep friendship and were strongly committed to further strengthen the all-weather friendship.\nHe asked the charge d’ affaires to convey his heartfelt condolences to the Chinese people, Communist party and President Xi Jinping.\nThe charge d’ affaires thanked the president for visiting the embassy and expressing solidarity with the people and government of China.\nShe said that both countries had shared future and had a long history of friendship and close cooperation. She condemned the attack and hoped that the culprit behind this incident would be apprehended and punished.\nLater, the president wrote remarks in the visitor’s book of the embassy.\nTalking to media, the president said that friendship between the two countries was enshrined in the brotherly relations of the citizens of Pakistan and China.\nHe opined that losing the three Chinese brothers in Karachi attack was like losing some relatives in Pakistan.\nThe president stressed upon the need to destroy the nefarious terrorist designs that wanted to discourage China from helping Pakistan and expansion of Belt Road Initiative (BRI).\nPakistan had been very successful to defeat such designs but Karachi terrorist attack took place which was very painful, he said and assured that the culprits involved in the attack would be brought to justice, besides, improving the safety of the Chinese nationals.",
  "retrievedAt": "2025-08-11T14:47:49.637Z"
}
