{
  "title": "People who stayed home before lockdown helped slow COVID-19 spread",
  "link": "https://www.app.com.pk/national/people-who-stayed-home-before-lockdown-helped-slow-covid-19-spread/",
  "date_published": "2020-07-01T23:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 02 (APP):A new study has found that people who stayed home even before lockdown and sheltering-at-home orders were implemented may have helped slow the spread of the novel coronavirus back in March and April.\nIndividual decisions to reduce movement likely helped slow the spread of COVID-19 in the US, according to a new study published in The Lancet Infectious Diseases journal.\nThe residents in 25 most affected US counties began to limit their public movements six to 29 days before states implemented stay-at-home orders. The decline in the number of daily trips people made as tracked by mobile phone data helped slow the spread of the virus, Medical Daily reported.\n“Our results strongly support the conclusion that social distancing played a crucial role in the reduction of case growth rates in multiple US counties during March and April,” said study lead author Lauren Gardner from Johns Hopkins University.\nDespite some county-level restrictions being implemented earlier than state policies, 21 out of the 25 counties recorded initial declines in movement before even those local steps.\nDetermining the effectiveness of social distancing is difficult because counties and states implemented different policies at different times so to establish a reliable indicator of social distancing, the researchers used real-world mobile phone movement data.\nTheir first step was to establish a baseline of normal movement between January 8-31. They then examined changes through April 16 in the 25 US counties with the highest numbers of confirmed COVID-19 cases.\nFrom January 24 to April 17, people made far fewer daily trips than they did during the baseline period.\nThe findings showed that individuals began to reduce movement in early March, indicating that social distancing began well before the first state, California, imposed a stay-at-home directive on March 21.\nIn New York City, for example, residents had limited movement to 35 per cent of the baseline, the most significant reduction in movement among the 25 jurisdictions.\nSocial distancing will remain one of the most important ways to control the spread of infections until a vaccine is available, the researchers noted.\n“As stay-at-home policies began to relax, we urge individuals and governments to make safe and data-driven decisions, to respond to the potential risk of increased infections,” the study authors wrote.",
  "retrievedAt": "2025-08-11T19:25:59.504Z"
}
