{
  "title": "Killing grandfather in front of his grandson, a chilling reminder of Nazi oppression: Wani",
  "link": "https://www.app.com.pk/national/killing-grandfather-in-front-of-his-grandson-a-chilling-reminder-of-nazi-oppression-wani/",
  "date_published": "2020-07-01T23:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 02 (APP):Terming killing of a civilian right in front of his 3-year-old grandson by the Indian occupation forces as a chilling reminder of Nazi oppression, senior vice chairman Jammu Kashmir National Front (JKNF) Altaf Hussain Wani has said that the soul-wrenching photo of a toddler crying on the chest of his dead grandfather speaks volumes about India’s fascism and its racial undercurrents.\nIn a statement issued here on Thursday Wani said that the picture of the toddler looking shell shocked on the blood-soaked corpse of his dead grandfather was sufficient enough to stir the world’s conscience.\nWhile describing this spine-chilling incident as a sign of growing frustration within the Indian occupation forces the JKNF leader said, “This surge of frustration within the rank and file of the Indian army has led to the killing of a number of civilians in the valley over the past couple of months”.\nReferring to a similar incident Mr. Wani said that “In May, a young man later identified as 25 year old Peer Mehrajudin, son of ASI, resident of Makhama, Budgam was killed ruthlessly when Indian paramilitary CRPF forces opened fired at his car near Kawoosa Khalisa village in Narbal area of central Kashmir Budgam”.\nHe said that it was an Israeli pattern that India was following in Kashmir to instill a sense of fear and insecurity amongst Kashmiris.\nThe JKNF leader said that the Kashmir’s recent history was apparently awash with such stories of terror, which, he said, would continue to haunt the conscience of those who criminally chose to stay silent on the Kashmiris’ unending sufferings despite knowing the fact that the Indian forces were involved in serious war crimes in Kashmir.\nThese horrifying incidents taking place in the length and breadth of the Kashmir valley he said were the cause and consequence of the long-drawn Kashmir conflict, which he said would continue to wreak havoc on the lives of innocent Kashmir unless the festering dispute was resolved peacefully in accordance with the UN resolutions.",
  "retrievedAt": "2025-08-11T19:25:58.998Z"
}
