{
  "title": "15 national parks become fully functional for first time with proper ecological set-up",
  "link": "https://www.app.com.pk/national/15-national-parks-become-fully-functional-for-first-time-with-proper-ecological-set-up/",
  "date_published": "2020-07-02T05:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 2 (APP):Prime Minister Imran Khan on Thursday said with Pakistan facing severe challenges of climate change due to glacier-melting, the protection of its natural and ecological environment was need of the hour.\nSpeaking at the launch of ‘Protected Area Initiative’ here, the prime minister said protection of green areas along with promotion of eco-tourism was vital for the country development.\nUnder the initiative, 15 national parks covering a land area of 7,300 sq km have been made fully functional for the first time with proper ecological management and governance.\nOf these, nine are new and recently declared national parks while six others earlier had the status of ‘paper parks’ with mere notifications.\nThe protected green area coverage will be enhanced from current 13 to 15 percent of the country’s land area spanning mountains in the north to the scrub forests in plains and a marine-protected area in south of the country.\nIn initial phase, almost 5,000 direct nature jobs will be generated for the youth.\nImran Khan said Pakistan was blessed with 12 diverse ecological zones, making it a rich destination for eco-tourism.\nHowever, he said the country required a further improvement in learning about administration and preservation of national parks.\nImran Khan directed the Chief Minister Khyber Pukhtunkhwa not to open tourist areas for public unless putting in place byelaws regarding protection and preservation of natural environment.\nHe pointed out that Galiyat and Murree were facing problems due to lack of civic planning and policy on eco-tourism.\nHe said cities were facing problems of water shortage and waste disposal facilities due to absence or outdated master plans.\nHe said the government would consider making town planning a part of its Green Initiative.\nImran Khan mentioned that biodiversity of Margalla hills was splendid with its unique flora and fauna, saying that turning it into a national park would help its preservation.\nThe prime minister stressed involvement of local community in preservation of natural environment and rare species including snow leopard and Marco polo sheep.\nHe said awareness among the people of Chitral helped in preservation of Ibex by allowing limited trophy hunting.\nThe prime minister lauded his Adviser on Climate Change Malik Amin Aslam for the ‘Protected Area Initiative’ and urged upon the chief ministers of Punjab and KPK to take the subject on priority.\nChief Minister Punjab Usman Buzdar, Chief Minister KPK Mahmood Khan, Chief Minister Balochistan Jam Kamal Khan, the Chief Secretary Sindh and senior officials from Azad Kashmir and Gilgit Baltistan joined the meeting via video-link.\nMinister of State for Climate Change Zartaj Gul, Adviser Malik Amin Aslam, Special Assistant to PM on Information Lt Gen (r) Asim Saleem Bajwa, Special Assistant Shahbaz Gill, Country Director World Bank Illango Patchamuthu, Country Director Asian Development Bank Shing Xyaohong, Country Director International Union for Conservation of Nature (IUCN) and the Senior Director World Wildlife Fund were present on the occasion.\nThe video messages from George Scaller from World Conservative Society, Kathy McKinon from Chair of World Commission on Protected Areas and Alex McWilliam from IUCN Asia/Asia Protected Area Partnership were shown in the meeting.",
  "retrievedAt": "2025-08-11T19:26:02.281Z"
}
