{
  "title": "PTI govt committed to ensure merit, transparency in national institutions: Shibli",
  "link": "https://www.app.com.pk/national/pti-govt-committed-to-ensure-merit-transparency-in-national-institutions-shibli/",
  "date_published": "2020-07-02T03:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 02 (APP):Minister for Information and Broadcasting Senator Shibli Faraz Thursday said the Pakistan Tehreek-e-Insaf (PTI) government under the leadership of Prime Minister Imran Khan was committed to ensure merit and transparency in all the national institutions.\nThe Pakistan International Airlines (PIA), he said, used to be a prestigious airliner from 1960s to 1980s, but it was ruined by the political interference of governments during the last couple of decades.\nHowever, the present government was working to revive the old glory of the PIA, along with other all national institutions, he said while addressing a press conference here flanked by Minister for Maritime Affairs Syed Ali Zaidi and Prime Minister’s Special Assistant on Accountability Shahzad Akbar Mirza.\nShibli Faraz said the press conference was being held to reveal details about the decline of the national flag carrier.\nHe said the PIA and other private airlines in Pakistan were continuing their flight operations with the fully qualified pilots, who had undergone the scrutiny process and were given a clean chit.\nReplying to questions of media persons, he said before coming to the press conference he had seen on the television screens the press talks of Pakistan Muslim League-Nawaz leaders belonging to the Shahid Khaqan Abbasi group and then those of Shehbaz Sharif group, and now it was expected that some leaders of the Mariam Nawaz group would also hold a presser.\nHe said none of the prime minister’s family members was part of the government unlike the PML-N regime when the then PM’s younger brother was the chief minister and the father-in-law of his daughter was the finance minister.\nTo a question, he said the National Assembly’s Standing Committee on Information and Broadcasting would be presented the report on the issue of showing a incorrect map of Pakistan in a PTV show next week. It was unfortunate that all institutions were ruined by the past rulers as they now had issues of capacity and incompetence because of past political appointments.\nThe PTI government, he said, had launched the process of reformation in the Pakistan Television (PTV) and its results would be visible in coming six months. Those responsible for the lapse would be taken to task, but all legal requirements would be fulfilled so that nobody could get a stay from courts, he added.",
  "retrievedAt": "2025-08-11T19:25:50.439Z"
}
