{
  "title": "100,802 COVID positive patients recovered across country: NCOC",
  "link": "https://www.app.com.pk/national/100802-covid-positive-patients-recovered-across-country-ncoc/",
  "date_published": "2020-07-01T23:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 02 (APP):National Command and Operation Center (NCOC) on Thursday said that around 50 percent of the novel coronavirus (COVID-19) patients have recovered from the infection in the country.\nThe data released by the NCOC said that 100,802 COVID-19 positive patients recovered across Pakistan making it 50% of the total detected.\nIt added 72 people died in the previous 24 hours due to the disease while since 26 February, 217,809 COVID-19 positive cases were detected across the country till date.\nIt said that total active COVID-19 cases in the country at the moment are 108,642 with 4,339 new positive COVID cases detected on July 1 and 72 people lost lives due to the pandemic during last 24 hours.\nThough implementation on the smart lockdown had significantly reduced the number of deaths due to COVID-19 in the country, however again 4,339 cases were tested positive.\nAccording to NCOC, 22,128 tests were conducted in the previous 24 hours including 8,201 in Sindh, Punjab 7,996, KP 2,397, ICT 2,408, Balochistan 780, GB 46 and AJK 300.\nIt said that 104,694 patients recovered so far across Pakistan making it a significant count and 487 ventilators were occupied across Pakistan out of 1,562 vents allocated for COVID-19.\nIt said that total active COVID cases in Pakistan are 108,642. A total of 217,809 cases detected so far (AJK 1,135, Balochistan 1,608, GB 1,151, ICT 13,802, KP 26,938, Punjab 77,740 and Sindh 86,795).\nAbout the deaths, the official data said that 4,473 people had died including 1,406 from Sindh, Punjab 1,784, KP 973, ICT 129, Balochistan 121, GB 28, and AJK 32. So far 1327,638 tests had been conducted and 768 hospitals with COVID facilities with 5,112 patients admitted across the country.",
  "retrievedAt": "2025-08-11T19:25:54.360Z"
}
