{
  "title": "COVID-19 claims 76 lives, infects 1,303 more people",
  "link": "https://www.app.com.pk/national/covid-19-claims-76-lives-infects-1303-more-people/",
  "date_published": "2021-06-10T07:08:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jun 10 (APP): The national tally on Thursday of total active COVID-19 cases was recorded 44,236 with 1,303 more people tested positive for the deadly virus and 1,978 people recovered from the disease during the last 24 hours.\nSeventy-six corona patients have died during past 24 hours, 67 of whom were under treatment in the hospitals and nine out of the hospitals in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nDuring the past 24 hours, most of the deaths have occurred in the Punjab followed by Sindh.\nOut of the total 76 deaths occurred in the last 24 hours 41 of them had died who were under treatment on ventilators.\nThere were 2,967 Covid infected patients under treatment in critical care in various Covid dedicated healthcare facilities in past 24 hours.\nNational Covid positivity ratio during past 24 hours was recorded 3.1 percent.\nIt may be mentioned here that the Covid positivity ratio was the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major areas including Islamabad 21 percent, Lahore 27 percent, Bahawalpur 26 percent and Multan 48 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major areas of Abbottabad 30 percent, Peshawar 28 percent, Karachi 30 percent and Multan 30 percent.\nAround 361 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, and Gilgit Baltistan (GB).\nSome 41,824 tests were conducted across the country on Wednesday, including 13,972 in Sindh, 11,497 in Punjab, 10,375 in Khyber Pakhtunkhwa (KP), 3,682 in Islamabad Capital Territory (ICT), 1,222 in Balochistan, 386 in GB, and 690 in AJK.\nAround 871,669 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 937,434 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 19,623, Balochistan 26,052, GB 5,674, ICT 81,933, KP 135,162, Punjab 343,252 and Sindh 325,738.\nAbout 21,529 deaths were recorded in country since the eruption of the contagion. Around 5,183 have perished in Sindh among 16 of them died in hospitals and three out of the hospitals on Wednesday.\n10,436 in Punjab had died with 39 deaths occured in past 24 hours. 33 of them died in the hospitals and six out of the hospitals.\n4,185 in KP where 15 of them died in hospitals on Wednesday, 768 in ICT among two of them died in hospitals on Wednesday, 291 in Balochistan, 107 in GB and 559 in AJK among one of them succumbed to the deadly virus in hospital on Wednesday.\nA total of 13,705,490 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities. Some 3,192 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:50:01.917Z"
}
