{
  "title": "Pakistan wants peace, stability in Afghanistan: Ashrafi",
  "link": "https://www.app.com.pk/national/pakistan-wants-peace-stability-in-afghanistan-ashrafi/",
  "date_published": "2021-06-10T17:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):Special Representative to the Prime Minister on Religious Harmony and Middle East Hafiz Tahir Mehmood Ashrafi Thursday said that Pakistan wants peace and stability in Afghanistan.\n“I would like to make it very clear on behalf of the Pakistani nation, scholars, Ulema-Mashaykh and the state of Pakistan that we consider the peace of Afghanistan as the peace of Pakistan”, said Ashrafi while addressing a press conference following the Pak-Afghan Ulema Conference.\nHafiz Tahir Mehmood Ashrafi lauded the efforts of Prime Minister Imran Khan, President of Afghanistan Ashraf Ghani, and the Ulema and Mashaikhs of Pakistan and Afghanistan, the Ministers, the ambassadors and important dignitaries who made Pak-Afghan Ulema Conference a success, adding that Islam was the religion of peace, security, tolerance and moderation.\nHe underlined that for the last 40 years Afghanistan and Pakistan in the region have been going through the most difficult time and situation.\n“We are grateful to Allah Almighty and the leadership of Saudi Arabia led by Khadim-e-Harmain Al-Sharifain Shah Salman bin Abdul Aziz and Crown Prince Ameer Muhammad bin Salman who patronised Dr. Abdul Karim Al-Essa, Secretary General Muslim World League and organized ‘Pak- Afghan Ulema Conference’, said Ashrafi.\nIslam terms the killing of any innocent human being as the killing of the entire humanity.\nMeanwhile, addressing the session of Pak-Afghan Ulema Conference, titled, “Establishing Peace in accordance with Islamic principles”, Ashrafi said that holding of conference at the Holy Land of Harmain Al-Sharifain (Mecca tul Makarama, which is the center of peace and security for Muslims, was a matter of pride.\nHe urged Secretary General of the Muslim World League to establish a Joint Council for peace of the region, which was earlier tried to establish in the past.\nAshrafi said that it is a matter of great joy and happiness for us that Muslim World League and Harmain Al-Sharifain will not only cooperate with us but also playing very important role in this regard.\nKhadim-e-Harmain Al-Sharifain King Salman bin Abdul Aziz, Crown Prince Ameer Muhammad bin Salman, Saudi Arabian scholars and leaders, Prime Minister of Pakistan Imran Khan, our political, religious and military leadership have been working hard for peace and stability in Afghanistan, he said.",
  "retrievedAt": "2025-08-11T20:49:53.699Z"
}
