{
  "title": "AJK general election-2021 on July 25: Chief Election Commissioner",
  "link": "https://www.app.com.pk/national/ajk-general-election-2021-on-july-25-chief-election-commissioner/",
  "date_published": "2021-06-10T14:58:00.000Z",
  "source": "APP",
  "content": "MIRPUR [AJK]: Jun 10 (APP): General elections in Azad Jammu and Kashmir will be held on July 25 this year, Chief Election Commissioner of AJK announced here Thursday.\nAddressing a news conference at the AJK’s metropolis, Chief Election Commissioner Azad Jammu and Kashmir Justice (Retd) Abdul Rasheed Sulehriya announced the schedule of the general elections to elect 45 seats of Azad Jammu Kashmir Legislative Assembly on direct adult franchise basis. He said the polling for the legislative assembly will be held on 25th of July 2021.\nFlanked by Members of the AJK Election Commissioner FArhat Ali Mir and Raja Muhammad Farooq Niaz and DGPR AJK Raja Azhar Iqbal, the Chief Election Commissioner Abdul Rashid Suleria said that Elections to all 45 constituencies of the AJK Legislative Assembly including 33 constituencies and 12 reserves seats for Pakistan-based Jammu Kashmir refugees would be held on direct adult franchise basis in a fair free and transparent manner.\nHe said that four new constituencies have been created in AJK State. He said that final list of the eligible candidates will be issued on the 3rd of July 2021.\nThe AJK Chief Election Commissioner told that candidates can file their nomination papers by 21th June, 2021 till 4.00 pm.\nScrutiny of the nomination papers will be held on 22th of June from 8.00 am till completion of the process of the scrutiny. He said that appeals against acceptance or rejection of papers would be received on 27th June and their hearing will be held on 28th and 29th June.\nDecisions on these appeals will be announced on 30th June and July 1st, 2021. He said the candidates can withdraw their nomination papers on 2nd July 2021 and final list of candidates will be displayed on 3rd July and electoral symbols will be allotted on July 04, 2021.\nJustice (Retd) Abdul Rasheed Sulehriya said that there were 28,17090 registered voters for 33 seats of Azad Jammu Kashmir‘s all ten districts. For refugees 12 constituencies, a total of 4,02441 registered voters will be entitled to exercise their right to franchise, he added.\nPolling to the general election 2021 for AJK Legislative Assembly will be held on 25th of July this year from 8.00 a.m to 5.00 p.m without any pause, the CEC announced.\nThe Chief Commissioner announced a complete ban on promotion, transfers of government employees and put a ban on new schemes, inauguration or foundation stone laying ceremonies of new development schemes.\nThe CEC also issued a comprehensive code of conduct for all stakeholders including the candidates, their supporters and voters besides all other AJK government an autonomous functionaries.\nFollowing the announcement of date for election, the electioneering by the prospective contestants including candidates has got momentum in absolutely peaceful atmosphere with an immense enthusiasm across Azad Jammu Kashmir.\nAt the same time, brisk preparations are being given final touches by the AJK Election Commission for holding the elections in AJK, in a free, fair and transparent manner.",
  "retrievedAt": "2025-08-11T20:49:56.547Z"
}
