{
  "title": "Sleep disorders are associated with increased dementia risk in patients with TBI: Study",
  "link": "https://www.app.com.pk/national/sleep-disorders-are-associated-with-increased-dementia-risk-in-patients-with-tbi-study/",
  "date_published": "2021-06-10T18:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP):Preliminary results from a study of more than 700,000 patients with traumatic brain injury (TBI) show that those with a sleep disorder had an increased risk of developing dementia.\nResults show that over a median follow-up period of more than four years, TBI patients with a diagnosed sleep disorder were 25 per cent more likely to develop dementia. The results were similar when stratified by sex: Having a sleep disorder was associated with a 25.5 per cent increase in the risk of incident dementia in male persons with TBI and a 23.4 per cent increase in the risk of developing dementia in female persons with TBI.\n“Our study’s novelty is its confirmation of sleep disorders’ association with incident dementia in both male and female patients, independently of other known dementia risks,” said lead author and primary investigator Dr Tatyana Mollayeva, an affiliate scientist at the Kite Research Institute, the research arm of the Toronto Rehabilitation Institute.\nShe further added, “We are also the first to report on the risks that sleep disorders and other factors pose separately for male and female patients with TBI,” Medical Xpress reported.\nThe retrospective study involved a province-wide cohort of all adult patients who were free of dementia when admitted to the emergency department or acute care hospital with a diagnosis of TBI between May 2003 and April 2013. The total sample comprised 712,708 patients with TBI of all severities. Their median age was 44 years, and 59 per cent were male.\nOver a median follow-up period of 52 months, 32,834 patients– or 4.6 per cent– developed dementia. Analyses controlled for age, sex, income level, injury severity, and known comorbidity risks.\n“The strong links to the incidence of dementia in both sexes suggest a need for more targeted sleep disorders risk awareness in patients with TBI,” said Mollayeva.\nThe research abstract was published recently in an online supplement of the journal Sleep and will be presented as an oral presentation on June 13 during Virtual SLEEP 2021. SLEEP is the annual meeting of the Associated Professional Sleep Societies, a joint venture of the American Academy of Sleep Medicine and the Sleep Research Society.",
  "retrievedAt": "2025-08-11T20:49:54.088Z"
}
