{
  "title": "NA passes 21 government bills, gives nod for amendments in election laws",
  "link": "https://www.app.com.pk/national/na-passes-21-government-bills-gives-nod-for-amendments-in-election-laws/",
  "date_published": "2021-06-10T17:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 10 (APP): The National Assembly on Thursday passed 21 government bills including the laws related to the conduct of elections and the International Court of Justice (Review and Re-consideration) Bill, 2020.\nAdvisor to Prime Minister on Parliamentary Affairs Dr. Babar Awan tabled the Elections (Amendment) Bill, 2020 for consideration after suspension of the rules.\nThe House passed the bill with majority vote after voice voting.\nThe Election (Amendment) Bill, 2020 was introduced in the National Assembly on October 16, 2020. It was referred to the Standing Committee on Parliamentary Affairs the same day.\nThe major proposed amendments to the bill include more financial autonomy to Election Commission of Pakistan (ECP) (Section.11(2)); delimitation on the basis of equal number of voters instead of population (Sections 17&20); appeal to Supreme Court by any aggrieved person on delimitation lists (Section 21(5) new); variation in delimitation not exceeding 5% (instead of 10%) (Section 20); sections relating to electoral rolls by ECP to be omitted (24, 26, 28-34, 36-42, 44); electoral rolls same as registration ID data of NADRA (Section 25); appointment of polling staff from amongst the officers/staff from outside of a constituency (Section 53); provision to challenge appointment of polling officers/staff within 15 days of appointment (Section 15); increase in nomination fee (Section 61); seat to be vacated if returned candidate does not take oath within 60 days from first sitting (Section 72 A new); appointment of five election agents for a polling station instead of one (Section 76(1)); overseas Pakistanis to be extended voting rights (Section 94); use of electronic voting machines in elections to make it transparent (Section 103); polling for Senate elections under open ballot (subject to amendment in Article 226 of the Constitution); enlistment of political parties on the basis of 10,000 members (instead of 2000) including 20% women (Section 202); annual convention by political parties (Section 213a new); and introduction of timelines for various election procedures.\nLikewise, the House passed the Elections (Second Amendment) Bill which is regarding fair, free and transparent election through utilization of technology and modern gadgets.\nThe bill also aimed at granting to exercise voting right to the Overseas Pakistanis which may only be possible by vesting exclusive authority in ECP with technical assistance of NADRA and other agencies. Amendments were sought in section 94 and 103 of the Election Act, 2017 to achieve the aforesaid objectives.\nThe bill was also piloted by Advisor to Prime Minister on Parliamentary Affairs Dr. Babar Awan in the House.\nMeanwhile, the House also passed the bill to provide for the right of review and reconsideration in giving effect to the judgment of the International Court of Justice [The International Court of Justice (Review and Re-consideration) Bill, 2020].\nThe bill was moved by Minister for Law and Justice Dr Muhammad Farogh Nasim in the House.\nThe statement of objects and reasons of the bill says that the government of India initiated proceedings against Pakistan in the International Court of Justice (ICJ), concerning alleged violations of the Vienna Convention on Consular Relations of 24 April 1963” in the matter of detention and trial of an Indian national, Commander Kulbhushan Sudhir Jadhav”, who had been sentenced to death by the Military Court in Pakistan in April 2017. Commander Jadhav was a RAW operative, who facilitated numerous acts of terrorism in Pakistan, which resulted in the killing of countless innocent citizens of Pakistan.\nThe ICJ gave its judgment on 17th July, 2019 wherein it observed that “Pakistan is under an obligation to provide by means of its own choosing effective review and reconsideration of the conviction and sentence of Mr Jadhav, so as to ensure that full weight is given to the effect of the violation of the rights set forth in Article 36 of the Vienna Convention, taking account of paragraphs 139, 145 and 146 of this judgment”.\nIn order to give full effect to the said Judgment , it is necessary that a mechanism for review and reconsideration of Pakistan’s own choice has to be provided. This can be done by law only.\nEarlier, speaking on the occasion, the Law Minister said that Pakistan was a responsible State. The passage of the bill would help washed Indian nefarious designs, he added.\nHe said consular access was not given to Jadhav during PML-N regime while the incumbent government provided consular access to him twice.\nHe said it was mandatory to bring legislation in order to provide fresh consular access to Jadhav under ICJ decision. Otherwise, the India brought the matter to the UN Security Council or challenged it before ICJ, he said.\nHe said the whole house should support it as it was completely tantamount to support of Pakistan.\nThe other bills passed by the House were the Financial Institutions (Secured Transactions) (Amendment) Bill, 2021; the Port Qasim Authority (Amendment) Bill, 2021; the Pakistan National Shipping Corporation (Amendment) Bill, 2021; the Gwadar Port Authority (Amendment) Bill, 2021; the Regulation of Generation, Transmission and Distribution of Electric Power (Amendment) Bill, 2021; the Anti-Rape (Investigation and Trial) Bill, 2020; the Mutual Legal Assistance (Criminal Matters) (Amendment) Bill, 2021; the Federal Medical Teaching Institutes Bill, 2020; the National Institute of Health (Re-organization) Bill, 2020; the Maritime Security Agency (Amendment) Bill, 2021; the International Court of Justice (Review and Re-consideration) Bill, 2020]; the Covid-19 (Prevention of Hoarding) Bill, 2020; the SBP Banking Services Corporation (Amendment) Bill, 2020; the Corporate Restructuring Companies (Amendment) Bill, 2021; the Companies (Amendment) Bill, 2021; the Pakistan Academy of Letters (Amendment) Bill, 2021; the Muslim Family Laws (Amendment) Bill, 2020] (Section 4); the Muslim Family Laws (Amendment) Bill, 2020] (Section 7) and the Criminal Law (Amendment) Bill, 2021.\nEarlier, Advisor to the Prime Minister on Parliamentary Affairs Dr Babar Awan introduced three government bills which were referred to the relevant committees for consideration. These bills were the Pakistan Allied Health Professionals Council Bill, 2021; the Pakistan Nursing Council (Amendment) Bill, 2021 and the Mutual Legal Assistance (Criminal Matters) (Amendment) Bill, 2021\nMinister of State for Parliamentary Affairs Ali Muhammad Khan presented the Report of 2nd Biannual Monitoring on the Implementation of 7th NFC Award (January-June, 2020).\nLater, the House was adjourned to meet again on Friday at 4:00 pm for annual budget",
  "retrievedAt": "2025-08-11T20:49:56.290Z"
}
