{
  "title": "Pakistan envoy meets Bulgarian foreign, security advisors; discuss cooperation",
  "link": "https://www.app.com.pk/national/pakistan-envoy-meets-bulgarian-foreign-security-advisors-discuss-cooperation/",
  "date_published": "2022-02-15T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Ambassador of Pakistan to Bulgaria Mariam Aftab Tuesday met Foreign Policy Advisor Vessela Tcherneva and Security Advisor to the Bulgarian Prime Minister Petar Petrov and reviewed ongoing collaboration between the two countries.\nBoth the advisors welcomed the ambassador in the Council of Ministers and said that Bulgaria considered Pakistan as an important partner in South Asia and, therefore, was desirous of further strengthening bilateral relations.\nDuring the meeting, the two sides discussed ways and means to further enhance them in diverse fields, especially in trade, investment, culture, education and defence collaboration.\nThe ambassador requested for support of Bulgarian Members of European Parliaments in supporting Pakistan’s ongoing GSP+ review in the EU.\nMariam Aftab also briefed the two Bulgarian dignitaries on the constructive role played by Pakistan in tackling the Afghan crisis and ensuring peace and stability in the region.\nIn this regard, she stressed upon the fact that the international community needed to play a proactive role in order to avoid impending humanitarian disaster in Afghanistan by providing urgent food and medical aid.\nShe also sensitized the Bulgarian officials on the ongoing human right abuses by India in the Indian Illegally Occupied Jammu and Kashmir and the importance of allowing observatory missions from the United Nations Human Rights Council and international human rights groups to IIOJK to assess the severity of the issue.\n​On their part, the two dignitaries thanked the ambassador for the briefing and assured their full support on all endeavours of the embassy to enhance bilateral relations.",
  "retrievedAt": "2025-08-11T14:20:38.140Z"
}
