{
  "title": "Fawad foresees opposition leaders in jail before no-trust move",
  "link": "https://www.app.com.pk/national/fawad-foresees-opposition-leaders-in-jail-before-no-trust-move/",
  "date_published": "2022-02-15T15:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain on Tuesday said the corrupt opposition leadership would fail in their attempt for no-trust as they were going to land in jail for their loot and plunder of the national wealth.\nThey could bring a no-confidence motion if they managed to save themselves from the corruption cases, but he did not foresee any such move as they would be in jail before taking the misadventure, he said while addressing the post-cabinet meeting media briefing.\nFawad said the opposition had made 13 abortive attempts in the past to oust the democratically elected government, and their current bid would meet the same fate.\nHe sarcastically said the opposition was as strong as mentioned in the Urdu couplet: “Na Khanjar Uthay Ga, Na Talwaar Unn Sey…. Yeh Bazu Mere Azmaye Hue Hain”.\nHe said it was evident from the fact that all the main opposition, including the Jamiat Ulema-e-Islam-Fazl (JUI-F), the Pakistan Muslim League-Nawaz (PML-N) and the Pakistan Peoples Party (PPP) were relegated to the regions.\nThey were united not to oust the government, rather to hamper the ongoing accountability drive aimed at recovery of the national wealth looted by them, he said, adding it had proved the prime minister’s prediction that all the thieves would get united when the law took its course against them.\nThe minister asked whether Maulana Fazlur Rehman, Bilawal Bhutto, Maryam Safdar or Shehbaz Sharif had the strength to overthrow the government. How those who were even unable to carry their own burden, could pose a threat to the government, he remarked.\nThe country’s future would be bleak if it were linked with the above leaders, who being bygones themselves had no political future, Fawad added.\nTurning his guns toward Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto Zardari and Pakistan Muslim League-Nawaz Vice President Maryam Safdar, he advised them to first contest election for a mayor before thinking for premiership.\nHe said the government wanted live broadcast of the proceedings of all major corruption cases so that the public and the media could know as to how the corruption was committed in a systematic way.\nAccordingly, Fawad said, Minister of State for Information and Broadcasting Farrukh Habib would move a resolution in the National Assembly for a comprehensive debate on live broadcast of the case of Leader of Opposition Shehbaz Sharif. It was all the more important to show the public as to how billions of rupees had poured into the accounts of low-grade employees of his (Shehbaz’s) mills, he added.\nAs regards the decisions taken in the cabinet meeting, the minister said it stressed the need of setting up a forum for consultation between the Federal Government and the higher judiciary on national issues, which would help end unnecessary delays in important administrative matters.\nAmong important pending matters, Fawad elaborated, the cases related to tax collection, investment and stay orders on administrative appointments were included that caused irreparable loss to the country.\nAt present, he said, the cases worth Rs 300 trillion of the Federal Board of Revenue (FBR) and Rs 250 billion of regulatory authorities were pending in various courts.\nHe said the cabinet had expressed grave concern over the allegations leveled against important personalities, especially women, and launching campaigns against them on social media and some television channels, calling for effective legislation to prevent such abusive culture.\nThe minister said the cabinet members paid tribute to Prime Minister Imran Khan for the provision of free anti-corona vaccine worth Rs 127 billion by the Federal Government to the countrymen.\nHe said cabinet approved the reconstitution of the Board of Directors of the State Life Insurance Corporation (SLIC) on the recommendation of Ministry of Commerce. Besides the SLIC, the representatives of Ministry of Commerce, Ministry of Health and Ministry of Finance with economic experts Humayun Bashir, Poro Sadwa, Moin Foda and Anwar Mansoor Khan independent members, would be part of the board.\nHe said the cabinet allowed an international company ‘Peugeot’ to start importing its vehicles for testing to start car business in Pakistan.\nThe cabinet, he said, also approved export of 34,500 metric ton Moong-pulse to Afghanistan on the humanitarian ground under the World Food Programme.\nHe said it also endorsed the $821.80 million debt’s deferred payment agreement with Saudi Arabia. Payments of some $4 billion would be deferred by 2027, which would be could be used in carrying out development activities.\nFawad said the cabinet also okayed extension in the timeframe of international bonds issued for economic stability of the country, directing the ministries of Finance and Law to hold consultation to give administrative and institutional protection to them.\nThe cabinet, he said, approved the appointment of Dr Naveed Hamid as a member of the Monetary Policy Committee for another three years.\nIt also okayed Pakistan’s first digital cloud policy, which was designed to protect digital data in the government institutions as per the international standards, he said, adding the policy would help train manpower for the cloud computing, timely use of data and efficient use of resources, besides increasing investment opportunities in the digital sector.\nFawad said the cabinet also approved in principle the draft of Personal Data Protection Bill-2022, which was aimed at preventing unauthorized access to personal information and its misuse.\nInternational data protection rules and regulations would be part of the bill, and its draft to be sent to the Law Committee, he added.\nOn the recommendation of the Ministry of Law and Justice, he said, the cabinet approved the appointments Justice (Retd) Mian Muhammad Ajmal, Justice (Retd) Faisal Arab, Justice (Retd) Muhammad Sair Ali and Advocate Syed Ayaz Zahoor in the Law and Justice Commission.\nThe minister said the cabinet accorded approval for transfer of 33.5 per cent share of China Zenhua Oil’s operation and working interest to the Pakistan Petroleum Limited (PPL) in the Baska Block.\nHe said it also gave its consent for the appointment of Brigadier (R) Tofique Ahmad as Director General of National Institute of Electronic.\nThe cabinet approved 15 per cent Disparity Reduction Allowance 2022 for grade 1 to 19 Federal Government employees and civil armed forces personnel, he added.\nThe minister said the cabinet gave in-principal approval for setting up special courts to facilitate the overseas Pakistanis, who were major support base of the PTI. The Law Ministry was also directed to devise laws in that regard.\nThe courts would ensure speedy trial of the cases pertaining to the expats’ properties, he added.",
  "retrievedAt": "2025-08-11T14:20:38.889Z"
}
