{
  "title": "Ending stalemate in Pak-India ties conditional with restoration of Kashmir status: PM",
  "link": "https://www.app.com.pk/national/ending-stalemate-in-pak-india-ties-conditional-with-restoration-of-kashmir-status-pm/",
  "date_published": "2022-02-15T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Prime Minister Imran Khan on Tuesday said the possibility of ending the current stalemate with India was subject to the restoration of Kashmir’s autonomy.\n“Talking with India would be a betrayal of the Kashmiri people who have suffered so much and who live in an open-air prison environment with 800,000 troops deployed in the region,” he said in an interview with French daily Le Figaro.\nPM Khan said India’s unilateral decision of August 5, 2019 was in violation of the United Nations Security Council Resolution 47.\n“It is possible to build a relationship with India, but this requires the restoration of Kashmir’s autonomy. They have violated international law with this abrogation,” he said.\nThe prime minister said the attitude of the BJP government and the RSS (a right-wing Hindu fundamentalist group) towards Pakistan and Kashmir was “worrisome” that had led to a “dead end”.\n“We are dealing with a government that is not rational, whose ideology is based on hatred of religious minorities and Pakistan. We can’t talk to them. We are at a dead end.” he said.\nHe said Kashmir remained a disputed area between Pakistan and India since 1947 and pointed out that it was natural to raise voice in defence of the Kashmiris, especially as one third of the territory was in Pakistan.\n“Kashmir is directly a matter of concern for Pakistan,” he said.\nOn Afghanistan, he said Pakistan wanted the recognition of the Taliban government as a “collective process”.\nHe said if Pakistan was the first to grant recognition of Taliban, the international pressure would become “too much for us as we try to turn our economy around”.\n“To be isolated by becoming the only state (to recognise the Taliban regime) would be the last thing we would want,” he said.\nHe said Afghans were a proud people who could not be forced to act in a certain way.\n“You can’t force them. There is a limit to what foreign pressure can do to a government like the Taliban,” he said. “Afghans should not be expected to respect women’s rights as Westerners understand them.”\nHowever, he said that Taliban agreed on girls education but needed time.\nHe expressed concern over the worsening of humanitarian crisis in Afghanistan and the possible reflux of regugees.\nHe mentioned that before the fall of the former regime, three organisations were operating from Afghanistan including the Pakistani Taliban, the Baloch terrorists, and the Islamic State group.\n“We believe that the more stable the Afghan government is, the less these groups can operate. That is why we are so concerned about the stability of Afghanistan,” he said.\nAsked if Pakistan trusted the Afghan Taliban when they say they will not let jihadists strike from their territory, he said, “Yes, the Taliban were able to restore security when they took over in the 1990s”.\n“It is in their interest that regional trade develops from Central Asia through their territory to the Indian Ocean.\nHe emphasized that if terrorists operated from Afghan soil, the Taliban would suffer. “It is in their interest to stop international terrorism,” he added.\nIf Pakistan would bewilling to participate in U.S. President Joe Biden’s counter-terrorism strategy of striking jihadists in Afghanistan from bases in the region, he said, “We do not want international terrorism to operate from Afghanistan, but this can only be done with the help of the Taliban government”.\nHe mentioned that Pakistan had already lost 80,000 lives in the war against terrorism after 2001, and did not want a conflict with the Afghan government.\n“We will be partners with the US in peace, not in war,” he said.",
  "retrievedAt": "2025-08-11T14:20:53.398Z"
}
