{
  "title": "Pakistan in the best position today comparing past decades: President",
  "link": "https://www.app.com.pk/national/pakistan-in-the-best-position-today-comparing-past-decades-president/",
  "date_published": "2022-02-15T18:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): President Dr Arif Alvi Tuesday said that with the economy moving on the right track and good international positioning, Pakistan today was in the best position comparing the past decades.\n“The course is good whether it is economy, national solidarity, or international positioning. Comparing the decades including those of wars and corruption, in the decade starting 2020, Pakistan is in the best position,” the president said in an interview with a private television channel.\nHe said Pakistan was rich with youth bulge and if imparted education and skill training timely, they will start reflecting their impact within four to five years.\nHe said this year, the country’s farmers got additional over Rs 1 trillion and textile sector also earned around Rs 900 billion despite COVID pandemic.\nHe said Pakistan was also impacted by the worldwide inflation thus facing issues as had been faced by any other developing country.\nTalking about the notions of the presidential system, he said it was actually the individuals, not the systems which performed. He said the ongoing discussion was more about the struggle for power and resource sharing among the provinces.\nThe president said one could undermine the US presidential system and now even people were also started writing in support of the Chinese system which had successfully steered millions of people out of poverty.\nAsked about the Ukraine issue, the president said Pakistan neither had anything to do with that nor it had any relevance with the upcoming visit of Prime Minister Imran Khan.\n“We have own affairs with Russia. Ukraine has nothing to do with it. Ukraine is too far from us. There is no messaging. We are not playing any super power against any other,” he remarked.\nHe said despite being fifth largest nation, Pakistan had lesser footprints in the world due to terrorism; however, now the country was on course of reality.\nPresident Alvi said in fact, Pakistan wanted all states to join China Pakistan Economic Corridor (CPEC) besides desiring peace with all the nations including India.\nHe said in fact India did not want to resolve the Kashmir dispute based on the principles and Pakistan wanted the world to pressure India to stop genocide of Muslims.\nAsked to comment about the lynching incidents in Sialkot and recently in Mian Channu, the president called them “very unfortunate” and the perpetrators were actually naïve to the teachings of Holy Prophet Muhammad (PBUH).\nHe said Islam provided a system based on justice and allowed no one to announce verdicts on the roads like this.\nHe said before the government, it was society’s responsibility to mend its behaviour and discourage such attitude.\nComing to the opposition’s slogans of the no-confidence motion, he said since the start of government in 2018, people had been predicting the removal of the government but nothing happened so far. Instead of such unsubstantial matters, there should be discussions on positives going on in the country, he added.\nAbout his meeting with Chief of the Army Staff General Qamar Javed Bajwa on Monday, the president said he met him routinely and apprised him of the terror attacks took place in Balochistan.\nEven with the prime minister, the president said he had discussed the positives like enhanced income of farmers, businessmen, legislation on women rights including inheritance right, and a course on digital skills participated by 2.2 million youths.\nAsked about controversy following the review of the ministerial performance, he said the exercise was a must however, the criteria could be improved to address the reservations.\nPresident Arif Alvi said be it is Afghanistan or any other issue, the world should stand by the truth which was, unfortunately, being overpowered by the interests.\nHowever, he said the time would come when moral standards would make a comeback and added that Islam had clearly taught about supporting the oppressed people.\nOn the books he recently suggested the people read, the president said since assuming the office, he had studied around 90 books from cover to cover. The recently announced selection was on Islamic history, Muslim leadership, Indo-Pak history, Sikandar Mirza, defence strategies and the changes in the modern day world.\nTouching the sports, he expressed his keenness to watch cricket including the ongoing Pakistan Super League matches but at the same time called for similar contests in hockey and football to promote the games.",
  "retrievedAt": "2025-08-11T14:20:38.034Z"
}
