{
  "title": "Kashmiri women optimistic about success of freedom struggle: Shawl",
  "link": "https://www.app.com.pk/national/kashmiri-women-optimistic-about-success-of-freedom-struggle-shawl/",
  "date_published": "2022-02-15T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Kashmiri women, who are soft target of Indian atrocities, are optimistic about the success of their freedom struggle, says Representative of International Muslim Women Union Geneva Shamim Shawl.\nHighlighting the Kashmiri women’s struggle for freedom and resistance against Indian atrocities in an exclusive chat with APP on Tuesday, Shawl said they were successfully operating international women advocacy group to highlight Kashmir issue.\nThe world was now fully aware of the cases of Asifa Bano and Insha Mushtaq, highlighted by the group’s activists in the British Parliament, EU forums and other relevant forums.\nShe said that they were reaching out to all global forums to share the pain and sufferings of vulnerable Kashmiri people specially women and children.\nShawl said that social media and other relevant platforms were being used to fight the case of Kashmir effectively.\nKashmiri women, she said, especially Aasia Andrabi, Farida Behnji and Zamarud Habib, suffering in jail for their just cause, were the true inspirational forces for the youth.\nFrom Kunnanpishpora to Sopore, Indian troops were using Kashmiri women as weapons of war, a shameful act of world’s so-called largest democracy, she remarked.\nThe government up to the level of Prime Minister Modi was active partner in crimes in Kashmir which by every recognised definition were in fact crimes against humanity, said Shawl.\n“They want a Muslim minority state in Kashmir and all that they do is a step towards that direction. There is nothing new in their tactics. Freedom struggles world over have been familiar with these tactics and have ultimately been successful because of their unwavering belief in their just cause and commitment with struggle. Indian media may continue to blackout the truth but the world knows exactly what is happening in Kashmir. The UNHCR reports of 2018 and 2019 are witness of this growing awareness about gross human rights violations in Kashmir,” she said.\nShawl expressed the hope that this support would continue to increase from all those who believe in justice and freedom.\nMrs Shamim Shawl is also serving as the Representative of Kashmir Tehreeki Khawateen and the Executive Member All Parties Hurriyat Conference.\nIt may be mentioned that since the beginning of uprising in Indian Illegally Occupied Kashmir (IIOK), the Indian forces have killed around 100,000 Kashmiris including innocent children and women. With the highest ratio of troops against civilian population in Kashmir, forced disappearances, torture and killing of civilians has become a daily norm of Indian soldiers.",
  "retrievedAt": "2025-08-11T14:20:48.927Z"
}
