{
  "title": "President for increased outreach of Federal Ombudsman",
  "link": "https://www.app.com.pk/national/president-for-increased-outreach-of-federal-ombudsman/",
  "date_published": "2022-02-15T12:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): President Dr. Arif Alvi Tuesday called for increasing the physical and geographical outreach of the Federal Ombudsman to provide free-of-cost justice to the people of remote areas against administrative injustices.\nHe underscored the need for revolutionary changes into the institution of Ombudsman through legislation to make it stronger and more effective to dispense speedy justice to the people against the maladministration of government organizations.\nThe president made these remarks during a briefing on the role of Wafaqi Mohtasib, given by the Federal Ombudsman Ejaz Ahmed Qureshi at the Federal Ombudsman Secretariat.\nThe meeting was attended by Secretary Wafaqi Mohtasib Ejaz Ahmed Khan, Consultant (Legal Affairs) President’s Secretariat, Justice (retd) Sayed Zahid Hussain, and senior advisors of Wafaqi Mohtasib.\nIn order to promote good governance, the president underlined the need for increased interaction with those government departments which caused administrative injustices to the people, so that they should further facilitate and provide better service delivery.\nAppreciating the performance and role of the ombudsman, the president congratulated him and his team and said the institution was doing splendid work by providing free of cost justice to the aggrieved persons.\nHe asked the ombudsman to create awareness among people through media to benefit from the services of the institution.\nThe federal ombudsman gave a presentation on the role and achievements of his organization in providing free-of-cost justice to the aggrieved persons against administrative injustices.\nHe highlighted that his institution had disposed of 106, 732 complaints in 2021 against the receipt of 110,398 cases, despite the COVID-19 pandemic constraints. He apprised that more than 42,000 online complaints had been processed during the year while more than 92.7% of findings had been implemented in the year 2021.\nHe further informed that the value of complaints handled during the year was Rs. 1.85 billion.\nThe ombudsman shared his future vision and informed that he was working on the geographic expansion of the institution to provide free of cost and speedy justice at the district and sub-district level.\nHe apprised that 14 regional offices had been established to help facilitate the people of far-flung areas.\nHe further said that one window facilitation desks had been established at the international airports of Pakistan i.e. Islamabad, Lahore, Karachi, Multan, Quetta, Sialkot, and Faisalabad to help facilitate overseas Pakistanis and address their grievances.\nRegarding the protection of the rights of children Ejaz Ahmed Qureshi informed the meeting that the ombudsman secretariat was closely working with the provincial ombudsmen and the concerned departments of the provincial governments to protect the rights of children and work for their welfare.",
  "retrievedAt": "2025-08-11T14:20:52.932Z"
}
