{
  "title": "IHC asks respondents to deal security matter of former CJP under law",
  "link": "https://www.app.com.pk/national/ihc-asks-respondents-to-deal-security-matter-of-former-cjp-under-law/",
  "date_published": "2022-02-15T13:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): The Islamabad High Court (IHC) Tuesday instructed the government to deal the matter pertaining provision of extra security to former chief justice Gulzar Ahmed under the law and disposed of the case against it.\nThe court said until the competent authority took any action on letter it would not affect the rights of petitioner or citizens of Pakistan.\nOnly the executive authorities were authorized to judge the security threats to any citizen, it added.\nThe court said that any government officer should be dealt as a common citizen after his retirement as public officers were answerable to people.\nChief Justice Athar Minallah took up the case filed by the Jurist Foundation against the letter seeking provision of extra security to former chief justice of Pakistan.\nThe petitioner Riaz Hanif requested the court to shift the case to another bench at this the chief justice instructed him to give arguments in his case, saying that bench could not be constituted under the will of the petitioner.\nThe petitioner had named former chief justice Gulzar Ahmed, Registrar Supreme Court and Ministry of Law and Justice as respondents.\nThe petitioner adopted the stance that a letter had been written to interior minister for provision of extra foolproof security to Justice (retd) Gulzar Ahmed after his retirement. It was against the law, he added.\nHe said that the extra security would be a burden on the national exchequer and was just based on personal benefit. He prayed the court to declare the letter as void and against the law.\nHe further prayed the court to instruct the respondents to withdraw all incentives and take steps under the law.\nThe bench reserved its judgment on maintainability of the petition and later instructed the respondents to deal the matter under the law.\nThe order said neither the letter was implemented nor any action was taken on it so far.The court disposed of the case with above instructions.",
  "retrievedAt": "2025-08-11T14:20:53.344Z"
}
