{
  "title": "First lady seeks support for raising awareness on breast cancer, mental health, rights of disabled persons",
  "link": "https://www.app.com.pk/national/first-lady-seeks-support-for-raising-awareness-on-breast-cancer-mental-health-rights-of-disabled-persons/",
  "date_published": "2023-11-24T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Begum Samina Alvi, wife of the president of Pakistan on Friday emphasized the need for collective efforts in raising awareness about breast cancer, mental health & well-being, as well as advocating for the rights of persons with disabilities to enable them becoming productive part of the society.\n“These topics should be openly discussed throughout the year, whether it is breast cancer, rights of differently abled person or mental health,” she said while speaking at an awareness seminar on breast cancer organized by the Rotary Club here.\n“In this regard, we will need the support of not only the government but also the society as a whole,” she said adding that there was need to work for increasing the existing facilities in Pakistan.\nThe first lady said a five-minute self-examination every month could help detect breast cancer at an early stage, thus saving thousands of the lives of women in the country.\nShe said 44,000 deaths due to breast cancer in Pakistan was an alarming situation that needed raising constant awareness about early diagnosis of the disease.\nSamina Alvi mentioned that the world overall had a 98 percent recovery rate from breast cancer, however, pointed out that in Pakistan, insufficient mammographic facilities led to a high mortality rate due to the detection of malignancy at a late stage.\nShe said women of all ages including teenage girls of 12-14 years were also being diagnosed with breast cancer.\nShe urged the women and girls to learn the five-minute routine of self-examination and spread the word among at least 20 other women folks in their circle. She also got a pledge all the participants to spread her message for the importance of mental health and rights of persons with disabilities. She said with regard to the mental health, a mobile app “Humraaz” was being developed through with the people could seek guidance about their mental health.\nShe said 24% of total population was suffering from mental health problems but the number of related health professionals and psychiatrists was very low that needed to increased.\nShe called for accommodating the differently-abled persons with facilities of education and employment and mainstreaming them in society.\nOncologist Dr Fozia on the occasion informed that 99% breast cancer patients with detection at first stage survived while the survival rate among the patients with detection at second stage was 95% and that of third stage was 86%. However she said the rate for the fourth stage patients significantly dropped to 28%. She said the global rate of detection at stage 4 was 6% while in Pakistan it was 19%.\nShe said the oncology team was committed to convey the message of self examination to the women in every corner of the country.\nOn the occasion, cancer survivors Mahru Arif Ali from Rotary Club and Professor Shama Sikandar also shared their experience of breast cancer.",
  "retrievedAt": "2025-08-11T10:40:11.968Z"
}
