{
  "title": "PM outlines interim government’s key steps as ‘legacy of good governance & reformative approach’",
  "link": "https://www.app.com.pk/national/pm-outlines-interim-governments-key-steps-as-legacy-of-good-governance-reformative-approach/",
  "date_published": "2023-11-24T08:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Friday said with its good governance and reformative approach, the interim government would leave a legacy on the domestic front.\nIn an interactive session titled ‘Breakfast with the Prime Minister’ organized by Jang Group of Publications, PM Kakar said the caretaker government had to its credit for tackling tough challenges in areas including economy, privatization, and connectivity.\nThe prime minister spoke about his vision about the prospects for a better Pakistan, terming “skilled human capital as the answer to several challenges”.\nHe said Pakistan, being an important regional member of the Economic Cooperation Organization, boasted a strategic location at the confluence of central and south Asia besides its rich natural resources. The 240 million population with a huge youth bulge under the age of 25 adds value to human capital, he added.\nHe, however, pointed out that it was utmost crucial to provide skill sets to youth through targeted training programmes and warned that non-utilization of their energy could lead to detrimental consequences.\nKakar said one of the priorities of the caretaker government was to focus on a programme, which would train one million nurses in one decade.\nAlso, the government was exploring partnerships with international conglomerates including Siemens, Germany for the development of skills in different areas.\nThe prime minister said the government was fast-tracking the privatization of State Owned Enterprises and related entities, with Pakistan International Airlines on priority in the list. In this regard, he said, some tangible results were expected to be achieved by mid-January.\nPM Kakar dismissed the notion that people leaving the country to move abroad was a sign of any failure.\n“Brain drain can become a brain asset [in future] and this is a sanguine and positive way to perceive it… Pakistan is a civilization of diversified creative potential which makes it “rich” in a true sense,” he said.\nOn attracting foreign investment, he said the Special Investment Facilitation Council (SIFC) was providing an opportunity for ease of business, adding that the country expected good news in weeks about foreign investment of billions of dollars in areas of agriculture, information technology and mining.\nHe expressed confidence that SIFC, a platform with representatives from civil and military domains, would ensure the continuity of projects despite the change of governments. He also endorsed the idea of including members of the business community to expand its potential.\nHe said EXIM (Export-Import) Bank was working on providing financial services to Pakistan, which would help the local businessmen and traders to carry out financial transactions abroad.\nHighlighting connectivity as a crucial area, he said the Trans-Afghan railway would connect Uzbekistan with Pakistan. Also, the work on the improvement of Quetta-Taftan rail network is underway, he said.\nThe recently launched direct flights with Azerbaijan would reduce travel time and promote trade, he said.\nThe prime minister favoured reforms in taxation and said his government believed in cutting expenditures and was also working on the forthcoming reforms of the Federal Board of Revenue (FBR).\nWealth creation through taxation is the best tool for a government to use the revenue for establishing schools, hospitals, and road infrastructure, he said.\nHe said the media in the country was enjoying freedom and was “beyond any sort of control particularly the social media”.\nHe, however, stressed the need to formulate regulations after deliberations with stakeholders to cater to the challenges of digital media “without stifling and putting restrictions on it”.\nPM Kakar said the current political scenario was “not a crisis, but a continuation of process in the transitional democracy of Pakistan”.\nHe expressed optimism that with the continuity of the democratic process, the people would gradually start linking parties with their performance and service delivery.\nPM Kakar emphasized the importance of local government system to address the civic problems faced by the people in remote areas such as south and north Waziristan.\n“There is a need to shun the urban-oriented governance and adopt a more inclusive approach of bringing the far-flung areas of the country at par with developed cities,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:41:02.163Z"
}
