{
  "title": "Business Community celebrates successful IMF review, advocates for self-reliance",
  "link": "https://www.app.com.pk/national/business-community-celebrates-successful-imf-review-advocates-for-self-reliance/",
  "date_published": "2023-11-24T07:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): In a testament to the resilience of Pakistan’s Business Community, the Pakistan Business Forum (PBF) has applauded the successful completion of the first review under the International Monetary Fund’s (IMF) Staff-Level Agreement (SLA).\nTalking to APP on Friday, PBF Chairman (Capital Area), Atif Ikram Sheikh said, “This achievement, secured amidst a challenging economic climate and stringent IMF conditions, underscores the unwavering commitment of Pakistani businesses to contribute to the nation’s economic well-being.”\nWhile recognizing the significance of the IMF review, the PBF has also emphasized the need for Pakistan to chart a course towards self-reliance, breaking free from the cycle of external financial dependence. Atif Ikram Sheikh, Chairman (Capital Area) of the PBF, has eloquently articulated this vision, advocating for a focus on trade and industry as catalysts for economic growth and internal resource generation.\nSheikh’s call for a strategic shift away from IMF reliance aligns with his proposal to levy a 40% tax on windfall profits earned by commercial banks during 2021-2022. This measure, coupled with stricter controls over speculative dollar trading, is seen as crucial for stabilizing Pakistan’s financial landscape.\nEchoing Sheikh’s sentiments, PBF Vice Chairperson Balochistan, Zubaida Jalal, has stressed the importance of confidence-building measures to foster a vibrant business ecosystem. She has advocated for rationalized utility prices, lending rates, and a reduction in the State Bank of Pakistan’s key policy rate, all of which are deemed essential for spurring economic activity.\nMoreover, the PBF has called for rationalizing Export Finance Scheme (EFS) and Long Term Financing Facility (LTFF) rates to improve businesses’ access to finance. This enhanced financial accessibility is seen as a critical enabler for businesses to boost their competitiveness and contribute more significantly to the national economy.\nThe PBF’s steadfast commitment to Pakistan’s economic prosperity is evident in its unwavering support for the business community. By advocating for self-reliance through trade and industry, the PBF is paving the way for a future where Pakistan stands as a resilient and financially independent nation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:41:04.861Z"
}
