{
  "title": "Islamabad Capital Police launch special two-day campaign for safety of motorcyclists",
  "link": "https://www.app.com.pk/national/islamabad-capital-police-launch-special-two-day-campaign-for-safety-of-motorcyclists/",
  "date_published": "2023-11-24T08:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): Islamabad Capital Police have started two-day campaign to ensure safety of motorcycle riders and educate them about traffic rules.\nFollowing the directions of Islamabad Capital City Police Officer (ICCPO) Dr. Akbar Nasir Khan, this campaign has been launched to ensure safe ride of motorcyclists. This campaign has been partnered with a private company and Chief Traffic Officer Muhammad Sarfaraz Virk would overall supervise it.\nDuring the inaugural phase of the campaign, the education team is disseminating crucial information to citizens, emphasizing road safety and traffic regulations. As part of this effort, motorcycle side mirrors and electric components will undergo thorough checks to ensure secure travel for riders.\nFollowing the awareness phase, strict enforcement actions will be taken against riders of motorcycles lacking side mirrors and those using faulty electric components. The second phase will specifically address motorcycles without glass and those with defective electric equipment.\nUnder Chief Traffic Officer Muhammad Sarfaraz Virk’s supervision, specialized squads have been also constituted to oversee the campaign’s execution. City residents are urged to rectify their motorcycle side mirrors and electric components, including signals, front and backlights, within the designated two-day period.\nIn the subsequent phase of the campaign, legal measures will be enforced against motorcycle riders failing to adhere to the rules, especially those without glass and possessing defective electric components.\nThe primary goal of this special initiative is to provide citizens with maximum protection and awareness concerning road safety and traffic laws, ultimately reducing the occurrence of accidents.\nIslamabad Capital Police is taking proactive measures to enhance the city’s traffic system and provide improved travel facilities for its residents.",
  "retrievedAt": "2025-08-11T10:40:39.385Z"
}
