{
  "title": "ECO announces Youth Award in art, culture, sports fields for member countries",
  "link": "https://www.app.com.pk/national/eco-announces-youth-award-in-art-culture-sports-fields-for-member-countries/",
  "date_published": "2023-11-24T13:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 24 (APP): The Economic Cooperation Organization (ECO) has announced the ECO Youth Award in the fields of research projects including arts – preferably regional – culture and sports fields for the member states.\nThe youths from the 10 member states will be eligible for the award including Iran, Pakistan, Turkiye, Afghanistan, Azerbaijan, Kazakhstan, Kyrgyz Republic, Uzbekistan, Tajikistan and Turkmenistan, according to a message received from Pakistan Embassy in Tehran, where the ECO headquarters is also located.\nA total ten awards, one from each member state will be announced every year with a cash award of USD1,000 amongst the youth of 18-30 years of age, selected from the nominations made by each member state.\nThe need for the expansion of relations among the peoples in the ECO region, along with the significant role of youth as a major driving force for the ECO countries development, has increased the importance of planning to maximize their optimal participation in the activities implemented by the ECO Cultural Institute (ECOCI).\nThe Youth Award initiative has been proposed with the aim to discover young talent and to pave the way to further popularize ECO Cultural Institute.\nAs there will be one winner from each member country, there will be no competition between countries.\nThe award is presented annually to the winners selected from the nominations made by the ECO member countries on occasions such as the ECO Day.\nIn order to identify the ECO top youth, call for nominations will be published on ECOCI website and the Ministry of Culture of each ECO member state will nominate up to a maximum of three persons.\nThe Award Committee, comprising the Cultural Attachés of ECO member states in Tehran will judge and select one winner from each country.\nThe ECO Award will be presented during a ceremony on the occasion of ECOCI Day/ECO Day.",
  "retrievedAt": "2025-08-11T10:40:14.198Z"
}
