{
  "article_id": "2025-03-23_06c1c12ab8085e0489088cf7f4e0ee0c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-offers-russian-language-course/",
    "retrieved_at": "2025-08-27T13:58:00.502Z"
  },
  "metadata": {
    "title": "AIOU offers Russian Language Course",
    "author": null,
    "date_published": "2025-03-23T09:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 232,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 23 (APP):In a significant step towards promoting international languages, Allama Iqbal Open University has introduced a three-month, face-to-face Russian language course. According to the AIOU, the course will be conducted under the supervision of an expert and experienced Russian instructor. Classes will be held three days a week, with each session lasting three hours. To facilitate students, two groups (Morning session 10 am to 1 pm) and afternoon session (2 pm to 5 pm) have been formed. Last date for admission is April 10, while classes will commence on April 14. For online registration and further information, students can contact the university's Director of International Affairs, Dr. Zahid Majeed, at his phone number 0321-6840501 or via official email: zahid_majeed@aiou.edu.pk. The university's Vice Chancellor, Professor Dr. Nasir Mahmood, is keen on providing young individuals with global education and employment opportunities. The university has also introduced short-term courses in Turkish, Chinese, and Japanese languages. Additionally, special offices have been set up on campus to support the promotion of these languages. The Russian language course is being offered in collaboration with Allama Iqbal Open University, the Ministry of Education, and the Russian Federation's Center for International Cooperation. The students' performance will be assessed continuously, followed by a final examination. Successful candidates will be awarded an officially recognized certificate, which will be beneficial for Master's and Ph.D. scholarships in Russia and Central Asian countries.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}