{
  "title": "NAB authorises filing reference against Nawaz Sharif",
  "link": "https://www.app.com.pk/national/nab-authorises-filing-reference-against-nawaz-sharif/",
  "date_published": "2020-01-16T03:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):The Executive Board Meeting (EBM) of National Accountability Bureau (NAB) on Thursday authorised filing corruption references against former Prime Ministers Nawaz Sharif, Syed Yousaf Raza Gillani and former President Asif Ali Zardari for inflicting billion of rupee losses to national exchequer.\nThe EBM chaired by Chairman NAB Justice (Retd) Javed Iqbal authorised filing three corruption references against former Prime Ministers Syed Yousaf Raza Gilani, Muhammad Nawaz Sharif, former President Asif Ali Zardari, Khawaja Anwer Majeed, Khawaja Abdul Ghani Majeed in fake bank account cases.\nThe suspects have been involved in getting gifts and vehicles from government in violation of rules and regulations, which inflicted losses to the national exchequer, said a press release issue here.\nThe EBM okayed filing corruption reference against Kamran Shafi former ambassador and Wajid Shams-ul-Hassan former high commissioner in United Kingdom for inflicting $27,000 and 28,000 pounds to the national exchequer.\nThe EBM accorded approval of filing corruption reference against Abdullah Alvi honorary secretary State Bank of Pakistan Staff Cooperative Housing Society and others for cheating people and devouring their Rs 7.8 million.\nThe EBM also authorised conducting four investigations against various personalities including Nishat Chaunian limited, its officers/ officials, Nepra and Central Power Purchasing Agency,others, officers of Sindh Health Department, members Procurement Committee, Program Manager Hepatitis Prevention and Control Programme, government of Sindh and others,Rehmat Baloch,Health Minister Balochistan,Quetta and others,Ejaz Hussain Jakhrani, former MNA,District Jacobabad and others.\nThe EBM authorised conducting nine inquiries against several suspects including the management of Safe City Project, Islamabad, TEPA, officers/officials of LDA and others,Muhammad Ramzan Awan,former secretary local government Sindh and others, Xen Muhammad Ashiq, Project Director Muhammad Riaz, Gapco, Gujranwala and others, officers/officials of Bank of Khyber, Peshawar and others,Sardar Ashiq Hussain Gopang, MNA,Javed Iqbal, Patvari,Alipur,MJuzaffargarh and others,Messrs Teaching Hospital,senior purchase officer/ officials of Teaching DHQ hospital,DG Khan,pharmacy suppliers and others, Shaukat Basra,former MPA,Parliamentary secretary,Punjab, Haroonabad, Bahawalnagar and others,owners, directors and others of Messers Abdullah Shah Ghazi Sugar Mills limited.\nThe EBM also accorded approval of sending inquiry against officers/officials of Capital Development Authority (CDA) to CDA for legal action.\nThe EBM approved sending inquiry against Shakil Ahmed, former DG Parks and others of Horticulture Authority, Lahore to chief secretary Punjab for further legal proceedings.\nThe EBM approved transferring inquiry against NGOs,SDPI, Fafen, FAO and others to Interior Ministry for further proceedings.\nThe EBM authorised transferring the ongoing inquiry against officers of FATA Rural Program Project, directorate of Education and others to relevant department for legal action. The EBM authorised transferring ongoing inquiry against Syed Arif Khan,director messers Kanal View Peshawar and others to Peshawar Development Authority for further action.\nThe EBM authorised closing inquiry against officers/ officials , others of Punjab Thermal Power Limited, Faisalabad Industrial Estate Development, Zulfikar Bukhari son of Wajid Bukhari and others, management, officers/officials of Lahore Knowledge Park Company due to the absence of evidence.\nJustice Javed Iqbal Chairman NAB said NAB has directly or indirectly recovered Rs 158 billion in last 28 months.\nThe conviction ratio of Bureau is 70 percent.\nNAB has filed 630 corruption references in various Accountability courts in last 28 months.NAB has arrested 45 accused in Modarba/ Musharka cases and striving hard to recover looted money worth billions from them.\n1275 corruption references valuing Rs 943 billion were in different Accountability courts.",
  "retrievedAt": "2025-08-11T18:37:58.743Z"
}
