{
  "title": "579 Pakistanis in Saudi jails released so far under crown prince’s clemency: FO",
  "link": "https://www.app.com.pk/national/579-pakistanis-in-saudi-jails-released-so-far-under-crown-princes-clemency-fo/",
  "date_published": "2020-01-16T04:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):Saudi Arabia has so far released 579 Pakistani prisoners under the clemency announced by Crown Prince Mohammad Bin Salman in February last, the Foreign Office said Thursday.\nThe Saudi Crown Prince during a visit to Pakistan had vowed to release 2,000 Pakistani prisoners as a goodwill gesture.\nForeign Office Spokesperson Aisha Farooqi at a weekly press briefing said on issue of Pakistanis in Saudi jails, the mission was in touch with the Saudi authorities and mentioned that 1,500 additional prisoners had been released under other sorts of clemency or on completion of their sentences.\nShe said overall 10,000 Pakistani were imprisoned in 28 countries across the world, half of the which were convicted of criminal charges including smuggling.\nShe said the country’s embassies and consulates in last few years arranged over 13,000 consular access meetings in different countries and jurisdictions in an effort to assist Pakistani prisoners.\n“The government is fully cognizant of its responsibilities and is engaged with other governments for the release of Pakistani prisoners,” she said.\nThe Foreign Office spokesperson said the visit of Prime Minister Imran Khan to Davos, Switzerland to attend the World Economic Forum was on the cards, details of which would be shared in due time.\nOn restoration of stalled peace process between the United States and Taliban, she said Pakistan welcomed resumption of talks and hoped for their conclusion at the earliest.\nNegotiations and other agreements including ceasefire were welcomed by Pakistan, she added.\nAisha Farooqi confirmed that a Taliban delegation headed by chief of Hizb-e-Wahdat Mardam-e-Afghanistan Haji Muhammad Mohaqiq visited Islamabad a few days back on invitation of a think-tank and the Foreign Office was aware of the activity.",
  "retrievedAt": "2025-08-11T18:37:57.229Z"
}
