{
  "title": "PM for all possible steps to curb hoarding, profiteering",
  "link": "https://www.app.com.pk/national/pm-chairs-meeting-on-commodities-price-control/",
  "date_published": "2020-01-16T06:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):Prime Minister Imran Khan Thursday directed the authorities concerned to take all possible measures to curb hoarding and profiteering, besides devising a time-based mechanism to provide relief to the masses.\nChairing a meeting to review the steps to control the prices of commodities and measures for common man’s relief, the prime minister said the government realized that the people, particularly the low-income class, had been facing difficulties amid the course of economic reforms.\nPlanning Minister Asad Umar, Food Security Minister Khusro Bakhtiar, Advisor on Commerce Abdul Razzak Dawood, Advisor on Finance Abdul Hafeez Sheikh, special assistants to PM Dr Firdous Ashiq Awan and Nadeem Afzal Chan and former finance minister Shaukat Tareen, also attended the meeting.\nThe prime minster said the government was striving to provide maximum relief to the people, despite difficult economic conditions.\nHe informed the meeting that the government had allocated Rs 190 billion for Ehsaas Program and the poor were also being given health insurance cover of Rs 7,20,000. The government had also provided Rs 7 billion to the the Utility Stores Corporation to reduce the eatables’ prices.\nHe asked the provincial governments to point out other relief measures and also devise a time-based mechanism which should also define the role of all ministries.\nThe prime minister directed the authority concerned to immediately finalize the proposal for increasing the monthly cash grant under Benazir Income Support Program.\nHe also instructed his commerce adviser to finalize the proposal to reduce the fertilizer’s price by Rs 400 for relief of the small farmers.\nThe prime minister said as the common man’s relief was among government’s priorities, so all the ministries concerned should furnish a detailed report to him within two days, containing the measures and their status of their implementations in this regard.",
  "retrievedAt": "2025-08-11T18:38:04.243Z"
}
