{
  "title": "Rumours of rift die down with allies reposing confidence in Imran Khan’s leadership: Firdous",
  "link": "https://www.app.com.pk/national/rumours-of-rift-die-down-with-allies-reposing-confidence-in-imran-khans-leadership-firdous/",
  "date_published": "2020-01-16T06:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Thursday said all the rumours about a rift between the Pakistan Tehreek-e-Insaf (PTI) and its allied parties had died down with reposing of full confidence by the latter in the leadership of Prime Minster Imran Khan.\nTalking to the media after attending Chinese Spring Festival Gala here, she said the prime minister during the the PTI’s Core Committee meeting thanked the leadership of allied parties for supporting him in the larger national interest, continuity of democracy, and political and economic stability.\nHe also announced to continue efforts for the resolution of people’s problems with the cooperation and consultation of allied parties, she added.\nDr Firdous said the core committee was also briefed about the third meeting of United Nations Security Council within few months on the Kashmir issue, which was put on the back burner in the past.\nShe said the committee decided to observe February 5 as the solidarity day with Kashmiris with full fervour, both at the government and party levels, while an effective strategy would be adopted to highlight the issue at international level.\nShe said the prime minister approved the proposals of Legal Reform Committee for amendments in laws for resolution of the people’s problems. She hoped that the bench and the bar would play their role in dispensation of speedy justice.\nDr Firdous said the committee expressed its satisfaction over the recent passage of public interest bills from the parliament and that spirit would hopefully remain alive for such other bills.\nThe committee also decided that efforts would be made to create consensus over the National Accountability Amendment Bill without compromising on zero-tolerance over corruption.\nThe prime minister issued a directive that functions should be organized at district levels, in which PTI legislators and leadership should meet the common people and give proposals for ending inflation.\nThe SAPM said the committee also expressed its satisfaction over Rs 7 billion subsidy on edible items being sold through Utility Stores, establishment of 172 shelter homes, Insaf Health Card scheme which had benefitted over 7 million families, Langar Khanas, Humarmand Pakistan Programme and Ehsaas programme initiatives for providing relief to the poor segments of the society.\nThe committee voiced its concern over the treatment meted out to Indian Muslims by hardline Hindu government in India.\nThe committee also expressed its disappointment over the attitude of a minister in a TV talk show and banned his participation in talk shows. The prime minister renewed the commitment that the honour of the national institutions would be protected.\nShe said the committee also expressed its grief and sorrow over loss of precious lives in heavy snowfall and rains in various parts of the country. The prime minister directed the National Disaster Management Authority to prepare a data of the affected people so that steps should be taken for providing relief to them.\nReplying to questions, she said the UNSC meeting could not be called without active support of China. The prime minister told the committee that Pakistan enjoyed strong relations with China, which had always stood by it in difficult times.\nShe said it was the Pakistan Muslim League-Nawaz, which was doing politics on the health of Nawaz Sharif as he was seen dining at London restaurants with his absconding sons and relatives.",
  "retrievedAt": "2025-08-11T18:38:06.556Z"
}
