{
  "title": "Dr Sania reviews self-registration of Ehsaas beneficiaries in Chakwal",
  "link": "https://www.app.com.pk/national/dr-sania-reviews-self-registration-of-ehsaas-beneficiaries-in-chakwal/",
  "date_published": "2020-01-16T03:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP):Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr Sania Nishtar Thursday visited Chakwal to review the quality of services and facilities being established by NADRA at the special purpose counters for self-registration of Ehsaas beneficiaries to ensure inclusion of all deserving persons.\nAccompanied by Secretary, Poverty Alleviation and Social Safety Division and senior officials from NADRA, the special assistant visited Choa Saiden Sahah and Kallar Kahar areas in Chakwal.\nShe took round of facilities provided at the two self-registration sites, met the staff and people present there and enquired about the current arrangements.\nDr Nishtar took keen interest in getting their feedback as well to improve the entire registration process.\nCurrently, the government has rolled out several social protection and poverty alleviation programmes in the field and many of them are in the pipeline to benefit various segments of the poor and disadvantaged population of Pakistan.\nIn order to identify the right population of beneficiaries for the right Ehsaas interventions, the national socio-economic registry (NSER)-digital survey is underway by BISP to ensure 100 percent coverage of the population. The survey will be completed this year in three phases.\nTo ensure utmost transparency in the survey process of Ehsaas programme so that no deserving citizen of Pakistan is left out from the social welfare net,NADRA has committed to mobilize fully equipped self -registration centres in all districts across Pakistan in three phases linked to the completion of survey.\nIn the first phase, NADRA is initiating a self-registration drive by the end of this month beginning with 15 districts across Pakistan including Chakwal where the survey is about to be completed.\nThis self-registration drive will then be counterverified keeping in view the integrity and transparency of the programme through data analytics.\nThis self-registration drive is linked to the launch of the Ehsaas Kifalat programme in the last week of January 2020.\nEhsaas’ Kifalat is the government’s safety net programme through which it will give cash stipends to seven million most deserving and poorest women all over the country.\nDuring the visit, Dr. Nishtar also met the dwellers of slums residing in the impoverished suburbs of Chakwal.\nAs conversations unfolded, she discussed about the status of registrations of dwelling families with NADRA database and their accessibility to channels and sources of information locally available to them so that Ehsaas could extend maximum benefits to the most deserving.\n“Particularly, Ehsaas is trying to do its best to ensure the inclusion of disadvantaged in the social safety net and to improve their access to all the windows of opportunities created for them by Ehsaas”, she said.\nContinuing the point, she elaborated, “The registration of the vulnerable and impoverished with NADRA and NSER is the foremost priority of Ehsaas as it is their prerequisite to benefit from Ehsaas social protection programme”.\nLater, Dr. Nishtar visited the Basic Health Unit in Khairpur area of Chakwal and appreciated the services provided to the local communities at the unit and spoke to the staff and patients.\nShe also took round of the labour room, ward, emergency room, EPI room and dispensary. She was told that average OPD at the facility is 40 patients.\nFurthermore, the delegation led by SAPM also visited the BISP Tehsil offices in ChoaSaiden Shah and KallarKahar.\nIt was discussed that BISP Tehsil offices, wherever located at accessible points will also facilitate NADRA in the Ehsaas self-registration drive.",
  "retrievedAt": "2025-08-11T18:37:59.423Z"
}
