{
  "article_id": "2025-10-10_0d41333b708665aee24495ba60629f49",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/jury-finalizes-results-of-iiui-student-reel-contest-2025/",
    "retrieved_at": "2025-10-12T00:03:11.559Z"
  },
  "metadata": {
    "title": "Jury finalizes results of IIUI Student Reel Contest 2025",
    "author": null,
    "date_published": "2025-10-10T15:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 234,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 10 (APP): A meeting of the jury to finalize the results of the \"IIUI Student Reel Contest 2025 - The Silent Hercules: Builders Behind the Scenes\" was held at International Islamic University Islamabad (IIUI). The contest was launched under the vision and directives of IIUI President, Prof. Dr. Ahmed Saad Alahmed, aimed at celebrating the dedication of the university's unsung heroes - the labourers and custodial staff who contribute tirelessly behind the scenes. A total of 14 shortlisted reels were evaluated in the final round. The jury comprised senior journalist from Express News and content creator Fiaz Mahmood; Dr. Asma Mansoor, In-Charge Protocol and Public Relations; Dr. Qurat ul Ain Malik and Dr. Rooh ul Amin, Assistant Professors, Department of Media and Communication Studies; Dr. Inaam ul Haq, Director Administration; and Muhammad Nauman, Assistant Director Protocol and Public Relations. After a detailed evaluation based on creativity, storytelling, technical quality, and thematic relevance, the jury declared Syeda Zainab Tehseen and her team as the first prize winners, Muhammad Muzzamil Hussain as the second position holder, and Saqib Alam as the third prize winner. The judges appreciated the students' enthusiasm and creativity, announcing that those who did not secure top positions would also receive appreciation certificates. The IIUI President will soon confer cash prizes, shields, and certificates upon the winners and participants in a special ceremony, organized by the Protocol and Public Relations Office.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}