{
  "article_id": "2025-07-03_35f69efc86b8e41472442149ce4a9329",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ndma-warns-of-widespread-rains-flash-floods-starting-sunday/",
    "retrieved_at": "2025-08-27T09:12:35.443Z"
  },
  "metadata": {
    "title": "NDMA warns of widespread rains, flash floods starting Sunday",
    "author": null,
    "date_published": "2025-07-03T13:27:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 436,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 03 (APP):The National Emergencies Operation Center (NEOC) of National Disaster Management Authority (NDMA) on Thursday advised vigilance as heavy rain, thunderstorms, and potential flash floods are expected to affect various parts of the country from July 6 to 10. Impact-based weather alerts from the National Emergencies Operation Center (NEOC) warned that predicted monsoon activity combined with a strong westerly wave may affect multiple regions of the country from July 6 to 10, while northern areas face an elevated flash flood risk from July 7 to 12. Isolated rainfall and thunderstorms are expected in Islamabad and in Punjab, including Rawalpindi, Attock, Jhelum, Chakwal, Mianwali, Sargodha, Khushab, Gujranwala, Gujrat, Faisalabad, Lahore, Kasur, Okara and adjoining areas from July 6 to 10. Widespread moderate to heavy rainfall is also expected across northern and central Punjab, while southern Punjab districts including Multan, Khanewal, Bahawalpur, Bahawalnagar, Rahim Yar Khan, and Dera Ghazi Khan may receive low to moderate rainfall. In Khyber Pakhtunkhwa, heavy rain and thunderstorms are anticipated in Dir, Swat, Chitral, Kohistan, Shangla, Buner, Battagram, Swabi, Nowshera, Charsadda, Malakand, Mansehra, Abbottabad, Peshawar, Mardan, Haripur, Bannu, and Kohat. Gilgit Baltistan and Azad Jammu & Kashmir will experience moderate to heavy rainfall, especially during evening and night hours, with flash flood risk in Gilgit, Skardu, Hunza, Astore, Diamir, Ghanche, Shigar, Muzaffarabad, Neelum Valley, Rawalakot, Haveli, and Bagh. These conditions may lead to flash flooding in local streams and nullahs, landslides, road blockages, and power/communication disruptions. In Sindh, isolated to moderate rainfall is expected in Sukkur, Nawabshah, Kashmore, Hyderabad, Karachi, Tharparkar, Mirpur Khas, Umerkot, Sanghar, Jamshoro, Tando Allahyar, Thatta, Badin, and Mithi, with heavy rainfall likely in Ghotki, Khairpur, Shikarpur, Larkana, Jacobabad, and Dadu. These may result in urban flooding, traffic congestion, and infrastructure damage. Balochistan is expected to receive scattered to heavy rainfall in Quetta, Zhob, Ziarat, Kalat, Khuzdar, Awaran, Barkhan, Jaffarabad, Kohlu, Sibi, Dera Bugti, Loralai, Lasbela, and Naseerabad. Waterlogging, traffic disruption, and damage to weak structures due to strong winds and lightning are possible. NDMA advises the public to take precautionary measures including avoiding unnecessary travel, staying indoors during intense weather, and securing household items and vehicles. Tourists are strongly advised to avoid traveling to high-altitude or flood-prone areas during this period. Local administrations must ensure readiness of response teams, clearance of drainage channels, and public awareness. Motorists are cautioned to avoid driving through flooded roads and underpasses. Emergency services are on high alert for possible rescue and evacuation operations. Citizens are encouraged to stay updated through NDMA's official advisories and to download the Pak NDMA Disaster Alert App for real-time weather alerts, safety guidance, and early warnings.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}