{
  "title": "Pakistan striving for peace sans compromise on key national interests: Dr Moeed",
  "link": "https://www.app.com.pk/national/pakistan-striving-for-peace-sans-compromise-on-key-national-interests-dr-moeed/",
  "date_published": "2021-03-21T08:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): The two-day Islamabad Security Dialogue has ended on Thursday past week with its clear message to the world that the country’s national leadership with clear vision and direction is striving to unveil a new era of regional peace, stability and development with Pakistan at the core of all global economic activities amid its geo-economic location potential.\nAt the opening session of the country’s first ever hosted international security dialogue, Special Assistant to the Prime Minister (SAPM) on National Security Division Dr Moeed Yusuf said Pakistan was striving for peace and would never compromise on her key national interests along with unveiling its economic security paradigm shift.\nThe country’s national leadership was on the same page to roll out a comprehensive national security framework based on a clear strategic vision which it scarcely had any in the past.\nIt was the formal task of the National Security Division to put the well deliberated and thought out national security framework in a documented form for consistent\nimplementation. National Security was a combination of traditional and non-traditional pillars of the security policy.\nNational Cohesion was paramount to ensure national security whereas three pillars were identified to lay the foundation of comprehensive the country’s first comprehensive national security framework.\nThe National Security Adviser said the New Comprehensive Security Framework (CSF) was based on the three pillars of military, economic and human security with economic progress at the core.\nThe Economic Security lens of National Security framework namely connectivity, development partnerships and regional peace were interlinked. “It will also lead to a cultural shift as it demands to have all inclusive approach of the government and proactive policy making,” he added.\nThe new National Security framework encapsulated unapologetic and self confident behavior of Pakistan, firm stand on principle stance and consistency of policies along with introspective and pragmatic approach, the SAPM said.\nThe National Security Adviser was of the view that it was the country’s vision to benefit from the geo-economic location as the country wants to be the center of economic activities in the world.\nChina Pakistan Economic Corridor (CPEC) is a North to South Connectivity benefiting all neighbouring countries and expediting Pakistan’s linkage with Central Asia, Iran, Afghanistan whereas it could be extended for Eastern connectivity.\nHowever, the burden lies on India’s shoulder to resolve principle disputes on equitable basis to maintain regional peace.\nThe Security Dialogue was divided into interactive sessions with leading experts, federal ministers and the Prime Minister’s special assistants enunciating diverse opinions on multifaceted issues starting from Comprehensive National Security, Economic Security at the Core, Responsibility Within: Instituting a Human Security Paradigm, Regional Peace and Security and Evolving World Order and Pakistan.\nThe first consultative session titled “Comprehensive National Security” was convened by Director Regional and Global Studies of Institute of Strategic Studies, Research and Analysis (ISSRA) of the National Defence University (NDU) Ambassador (R) Fouzia M Sana.\nThe session was moderated by Former Foreign Secretary Ambassador (R) Riaz Khokhar where former President NDU Lieutenant General (R) Aamir Riaz, former Foreign Secretary Ambassador (R) Riaz Muhammad Khan deliberated on Security Challenges in a Transforming Global and Regional Environment and Geostrategic Compulsions in a Troubled Neighbourhood respectively whereas US Ambassador (R) Cameron Munter who virtually participated in the session discussed Pakistan’s Security Imperatives, A View from Abroad.",
  "retrievedAt": "2025-08-11T20:31:36.805Z"
}
