{
  "title": "1 in 5 children globally does not have enough water to meet every day need : UNICEF",
  "link": "https://www.app.com.pk/national/1-in-5-children-globally-does-not-have-enough-water-to-meet-every-day-need-unicef/",
  "date_published": "2021-03-21T13:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP):The United Nations Children Fund (UNICEF) revealed that more than 1.42 billion people including 450 million children across the world live in areas of high, or extremely high, water vulnerability.\nThis means that 1 in 5 children worldwide do not have enough water to meet their everyday needs’ said UNICEF analysis report .\nThe new released analysis – part of Water Security for All initiative – identifies areas where physical water scarcity risks overlap with poor water service levels.\n“The world’s water crisis is not simply coming, it is here, and climate change will only make it worse. Children are the biggest victims,” UNICEF Executive Director Henrietta Fore said.\nAccording to UNICEF, when wells dry-up, children are the ones missing school to fetch water while when droughts diminish food supplies, children suffer from malnutrition and stunting.\nSimilarly, when floods hit, children fall ill from waterborne illnesses and when water resources decline, children cannot wash their hands to fight off diseases.\nThe analysis showed that children in more than 80 countries live in areas with high or extremely high water vulnerability.\nEastern and Southern Africa has the highest proportion of children living in such areas, with more than half of children – 58 per cent – facing difficulty accessing sufficient water every day.\nIt is followed by West and Central Africa (31 per cent), South Asia (25 per cent), and the Middle East (23 per cent).\nSouth Asia is home to the largest number of children living in areas of high or extremely high water vulnerability – more than 155 million children.\nChildren in 37 ‘hotspot’ countries face especially dire circumstances in terms of absolute numbers, the proportions of children affected, and where global resources support and urgent action must be mobilized.\nThis list includes Afghanistan, Burkina Faso, Ethiopia, Haiti, Kenya, Niger, Nigeria, Pakistan, Papua New Guinea, Sudan, Tanzania and Yemen.\nDemand for water continues to increase dramatically while resources are dwindling.\nIn addition to rapid population growth, urbanization, water misuse and mismanagement, climate change and extreme weather events also reduce available quantities of safe water, exacerbating water stress.\nAccording to UNICEF previous report, almost 1 in 4 children globally will live in areas of extremely high water stress by 2040.",
  "retrievedAt": "2025-08-11T20:31:30.630Z"
}
