{
  "title": "252 tubewells being solarized in Balochistan to benefit 0.6m population",
  "link": "https://www.app.com.pk/national/252-water-tubewells-being-solarized-in-balochistan-to-benefit-0-6m-population/",
  "date_published": "2021-03-21T08:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): A gigantic project to solarize 252 tubewells in various parts of Balochistan is in full momentum to provide uninterrupted power supply to residents as well as overcome the line losses.\n“Initiated 1.5 years back and Alhamdulillah now being done and giving service. Changing of government and community tube wells from diesel and electricity to solar power,” Balochistan Chief Minister Jam Kamal Khan said on Twitter.\nInitiated 1.5 years back and Alhamdulillah now being done and giving service.\nChanhing of Government and community tube wells from diesal and electricity to Solar power\nPhase one 250 schemes.\nبلوچستان کمیونٹی اور سرکاری پانی پروجیکٹ کو شمسی توانائی\n#EmergingBalochistan pic.twitter.com/WMHZgLPyFE\n— Jam Kamal Khan (@jam_kamal) March 19, 2021\nIn first phase, the government would solarize 252 existing water supply schemes, the chief minister said as he inaugurated a scheme in Shakerzai Syedan locality. The scheme cost around Rs 7.6 million to complete.\nSimilarly, water schemes in Chaghi, Jaffarbad, Kharan, Lasbella, Loralai, Naseerabad, Pashin, Quetta, Sibi, Suhbat Pur, Zhob and Ziarat loaclities would also be solarized.\nMost of the said schemes are nearing completion.\nAt inauguration ceremony, the authorities concerned told chief minister that around 598,540 people would benefit from the scheme.\nAddressing the event, Jam Kamal said the project’s objective was not just to supply water rather it would also bring prosperity to the area.\nHe said the government, which executed the projects to increase their figures or just to give away contracts, could not work.\nHe said unfortunately, the same tendency prevailed the previous governments which executed projects without any proper homework.\nSimilarly, the Balochistan government is providing solar geysers to cold areas, which currently use woods or gas for heating.\nThis shall inshallah revolutionaries cold areas of Balochistan…. We are putting solar geasers in far flung cold areas of Balochistan..Who buy wood and do heating\nBut, inshallah this will change with time now, A new start\nZero bill of wood, gas and fuel#EmergingBalochistan pic.twitter.com/SFSCwqQ0E7\n— Jam Kamal Khan (@jam_kamal) March 20, 2021\n“This shall Inshallah revolutionize cold areas of Balochistan. We are putting solar geysers in far flung cold areas of Balochistan who buy wood and do heating,” he said\nHe said the installation of solar geysers would change their lives altogether.\n“A new start – zero bill of wood, gas and fuel,” he remarked on Twitter.",
  "retrievedAt": "2025-08-11T20:31:36.745Z"
}
