{
  "title": "Travel Advisory: Pakistan bans travel from Cat C countries, as Covid-19 spikes",
  "link": "https://www.app.com.pk/national/travel-advisory-pakistan-bans-travel-from-cat-c-countries-as-covid-19-spikes/",
  "date_published": "2021-03-21T07:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 21 (APP): Amidst a spike in the Covid-19 cases, Pakistan’s Civil Aviation Authority again updated its travel advisory putting a complete travel ban for international travelers from 12 Category C countries.\nCivil Aviation Authority withdrew all earlier exemptions given to Pakistani passport holders, Pakistan Origin Cardholders, and those having National Identity Card for Overseas Pakistanis (NICOP).\n“The temporary measure is being introduced in continuation to the steps being taken to contain the spread of Covid-19 in Pakistan,” the revised letter said.\nThe Civil Aviation Authority modified the list of the countries placed in Categories A, B, and C for all international passengers, or all those arriving on chartered private aircraft flights, in view of the third wave of the deadly pandemic.\nA CAA letter available with the APP said the Revised Categorized Country List would be effective from March 23, 2021, 0001 hours up to April 05, 2021.\nCategory A countries: (20) includes; Australia, Bhutan, China, Fiji, Japan, Kazakhstan, Laos, Mauritania, Mongolia, Morocco, Myanmar, Nepal, New Zealand, South Korea, Saudi Arabia, Sri Lanka, Singapore, Trinidad and Tobago, Tajikistan, and Vietnam.\nInternational travelers from Category A countries can travel to Pakistan and do not require a Covid19 PCR Test to enter the country.\nCategory B includes all those countries not included in either Category A or C, fall in Category B. Travelers from all these countries require a Covid19 PCR Test before the commencement of travel to enter Pakistan, and it should not be more than 72 hours old, the CAA instructions say.\nCategory C countries: (12) includes; Botswana, Brazil, Colombia, Comoros, Ghana, Kenya, Mozambique, Peru, Rwanda, South Africa, Tanzania, and Zambia.\n“There will be a complete travel ban on inbound travel to Pakistan from Category C countries including withdrawal of exemptions earlier provided,” the Travel Advisory says.",
  "retrievedAt": "2025-08-11T20:31:36.802Z"
}
