{
  "title": "Nation renews pledge to transform Pakistan into true Islamic welfare state",
  "link": "https://www.app.com.pk/national/nation-renews-pledge-to-transform-pakistan-into-true-islamic-welfare-state/",
  "date_published": "2021-03-21T14:00:00.000Z",
  "source": "APP",
  "content": "M. Aslam Gulzar-Shumaila Noreen\nISLAMABAD, Mar 21 (APP): The whole nation and its leadership have reiterated firm resolve to transform the country into a true Islamic welfare state in line with the vision of Quaid-e-Azam Muhammad Ali Jinnah.\nMarch 23, the Pakistan Day, has a special significance not only in the history of Pakistan but also in the Islamic world when the Muslims of the subcontinent began their struggle by passing a historic resolution for establishment of a separate homeland based on a single ideology.\nAs a result of the seven-year’s unprecedented struggle and invaluable sacrifices, Pakistan came into being on August 14, 1947 after the passage of Lahore Resolution, commonly known the Pakistan Resolution, on March 23, 1940.\nThis was the day when the Muslims living in the subcontinent decided to have an independent state – the Islamic Republic of Pakistan. Since the creation of Pakistan, under the ideology of ‘one-nation one-destination,’ the entire nation celebrates this day with zeal and fervor to achieve the goals of a strong and prosperous Pakistan.\nSpeaker National Assembly Asad Qaiser sees this day as of utmost importance. “March 23rd has great significance in our history. On this day we celebrate our independence. On this day we had laid foundation for achieving a great target.”\nHowever, he noted, “although the goal of establishing an independent state had been achieved but the nation was still moving towards its real destination of self-sufficiency and prosperity.”\nMedia error: Format(s) not supported or source(s) not found\nHe expressed hope that Pakistan would soon become a state as dreamt by its founders. “Our government is taking far-reaching steps to transform the country into a state in line with the vision of Quaid-e-Azam.”\nAsad Qaiser appreciated the role of Armed Forces in national defence and termed them as ‘great and valuable asset’ for the nation playing an important role to ensure national integrity and sovereignty. “I must pay homage to ‘Jawans’ who sacrificed their lives in line of duty to defend the motherland.”\nHe called upon all segments of society to fully participate in celebrating Pakistan Day to prove them to be a lively and vibrant nation.\nMinister for Parliamentary Affairs Ali Muhammad Khan highlighted background and objectives of the Pakistan Day that had a basis on just socio-economic principles. “Our elders created an independent homeland for us and now it is our responsibility to take practical measures instead of raising mere slogans.”\nHe said it was unfortunate that with the passage of time we forgot our commitment to the nation and could not carry forward the vision of the creators of Pakistan. “It seems an outcome of the failures of our predecessors that people elected Imran Khan as Prime Minister with a hope to achieve the goal of a welfare state.”\nThe minister called for promoting the culture of self-accountability and said, “let us promise on this March 23rd that everyone holds himself accountable for his deeds. Let us rethink whether we all are doing justice to our country and the nation.”\nHe also mentioned to the sufferings of people of Illegally Indian Occupied Jammu and Kashmir, who were blood-bathed whenever they said “We are Pakistanis, Pakistan is ours.”\nRecounting on the struggle of Pakistan Tehreek-e-Insaf (PTI) for establishing an Islamic welfare state, he said Prime Minister Imran Khan was standing firm against the status quo.\n“It is true we are confronting number of problems. But, we have not given up and wage struggle against corruption and other menaces,” he said. “We are confident to steer country out of these challenges by promoting merit, justice and accountability.”\nThe minister said his grandfather Pir Muhammad Khan struggled for creation of Pakistan as a worker of All India Muslim League and today he, treading of feet of elders, was struggling to materialize the dreams of the creators of this country.\n“Prime Minister Imran Khan is committed to create a nation envisioned by our elders,” he said. “We are following the footsteps of our forefathers to achieve the goals of truthfulness, righteousness and justice for welfare and well being of our people.”\nAmeer of Jamaat-e-Islami Pakistan Sirajul-Haq said that emergence of Pakistan is a great event in human history and it is the second state in the world after the Islamic State of Madinah which is purely based on an ideology. “March 23, 1940 resolution was an important milestone that made the people to wage a struggle to create an independent homeland just within seven years.”\nHe regretted that even after 74 years, the Quaid’s dream of rule of law and justice for all could not be materialized. “We need to strive for creating a truly Islamic and prosperous society as envisioned by our forefathers to make our coming generations proud of their motherland.”\n“Let us teach our younger generation, thoughts and vision of Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal to make them pioneers in nation building and role model for rest of world,” he said.\nSiraj-ul-Haq said it is time to do away with 74 years old status quo to bring transparency in all spheres of life. “We desire our new generation to fully dutiful to Allah and the motherland.”\nPakistan People’s Party leader Senator Rehman Malik said March 23, 1940 and subsequent freedom movement embodies glaring examples of commitment, righteousness and integrity.\n“Today again the whole nation is expecting that every member of the society including politicians, leading figures, intellectuals and different school of thoughts move forward in the light of Quaid-e-Azam Muhammad Ali Jinnah’s teachings.”\nHe hoped that every Pakistani will work for the country keeping in view the sacrifices rendered during the creation of Pakistan.\n“I pray that we not only speak of democracy but do what democracy really demands of us. We should not be disappointed, work hard to find our strategy, work on it then Allah will help us”, he said.\nRehman Malik urged the government to find ways for development of the younger generation, especially the unemployed youth and make them a productive workforce for welfare and well being of the country.\nChairman Senate Standing Committee on Defence Production, Lt. Gen. (R) Abdul Qayyum called upon all political leadership to collectively move forward to achieve the goals set by our elders. “We have to look forward by shunning our egoist attitudes to ensure continuity of democracy create welfare oriented society.”\nHe said the new generation was unaware of the sacrifices rendered during freedom movement and there is need to teach them about the cost of freedom, they are enjoying today.\n“An independent homeland is blessing of Allah Almighty. Creation of Pakistan on Ramazan 27 was not a coincident. It was Allah’s choice,” he said. “Since independence, we have achieved a lot but still we fall short of achieving what our founder fathers had envisioned.”\nHe called upon youth to play their vital role in nation building. “You are leaders of future. If you show strong faith, perseverance and courage, you will be successful.”\nQayyum said Pakistani nation has taken strides in various fields to make the motherland a truly Islamic welfare state. “We need to continue with the same passion and enthusiasm of March 23, 1940 and freedom movement to further cement our national bonds under the motto of ‘one nation, one destination.’",
  "retrievedAt": "2025-08-11T20:31:30.079Z"
}
