{
  "title": "NUMS- QMUL novel findings can become milestone in eradication of TB in Pakistan",
  "link": "https://www.app.com.pk/national/nums-qmul-novel-findings-can-become-milestone-in-eradication-of-tb-in-pakistan/",
  "date_published": "2021-03-21T10:03:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 21 (APP): The “novel findings” of National University of Medical Sciences’ (NUMS) scientist Dr. Sidra Younis, in collaboration with Queen Mary University London (QMUL), in diagnosing latent tuberculosis infection, can become a milestone in addressing the root cause of TB prevalence across the country.\nThe international community will be commemorating World Tuberculosis Day on Mar 24 to raise public awareness about its devastating health and social impact.\nPakistan remains the 5th top country world-wide in terms of high incidence of TB while it is ranked 4th in drug resistant TB across the globe. Of the 570,000 people infected annually in Pakistan, about 42,000 die.\n“NUMS aims to address major health issues of Pakistan and TB is at the top of the list. NUMS in collaboration with QMUL, has developed a novel diagnostic test for the non-symptomatic tuberculosis infection.\nOnce validated and approved, this test can be a milestone towards eradicating the disease from high TB burden countries like Pakistan,” said Vice Chancellor NUMS, Lt Gen Syed Muhammad Imran Majeed HI(M) (Retd), in his remarks about the research of Dr. Sidra Younis, Assistant Prof, NUMS Department of Biological Sciences.\nHer postdoctorate research at QMUL in 2019, under mentorship of Prof Adrian Martineau, led to a novel method for diagnosing latent TB infection.\nThe non-symptomatic form of the TB is called latent TB infection. About one fourth of the world’s population is estimated to have latent TB infection. To eradicate the active TB it is very important to diagnose and treat the persons with latent TB infection.\nThe existing tests for the latent TB have less specificity and sensitivity. Therefore, it is not possible to identify the group of people who are infected with latent TB.\nThis research can help identify group of people with latent TB, who can be administered preventive therapy. NUMS is targeting the root cause of the spread of this disease through research, said Dr. Sidra whose findings have been published in an international journal, “The Lancet Microbe”, which publishes only novel findings.\n“Pakistan has the world’s 5th highest TB burden. WHO End TB strategy cannot be achieved until patients with latent Tuberculosis infection are identified and treated with preventive therapy. We evaluated a novel microbiological test for identification of the Mycobacterium tuberculosis in latent tuberculosis infected patients.\nThis diagnostic test has potential applications in the diagnosis of latent TB infection, in monitoring response to preventive therapy and as an outcome measure in clinical trials of interventions to prevent or treat latent TB infection,” said Dr. Sidra Younis whose one year research in London on blood samples from Ethiopia led to these findings.\nShe is now working on blood samples collected from TB Hospital Asghar Mall, Rawalpindi to validate the diagnostic test in the local population.",
  "retrievedAt": "2025-08-11T20:31:34.561Z"
}
