{
  "title": "Azerbaijan expresses interest to invest on motorways in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jan 30 (APP): Federal Minister for Communications, Privatization and Board of Investment Abdul Aleem Khan along with a high-level delegation held talks with Minister for Digital Development and Transport Rashad Nabiyev in Baku, Azerbaijan.\nIn the meeting, it was decided that delegation from Azerbaijan will visit Pakistan in February to review feasibility and other opportunities for investment in Pakistan especially in the projects of Motorways M-6 and M-9 Sukkur, Hyderabad, Karachi, said a press release issued here Thursday.\nFurthermore, options for business-to-business and government-to-government collaboration for the construction of highways between Pakistan and Azerbaijan were also considered in the meeting. The federal minister called on the Minister of Transport of Azerbaijan Rashad Nabiyev and said that it was imperative to improve the means of transportation from Pakistan to the Central Asian States and especially both countries Pakistan and Azerbaijan can make significant progress in this regard.\nThe minister said that there was considerable scope for bilateral cooperation in the field of communications to improve logistics. He added that there were historical, religious and deep friendly ties between Azerbaijan and Pakistan which need to be further strengthened.\nAzerbaijani Minister Rashad Nabiyev said that his country was looking for significant progress in bilateral cooperation and investment with Pakistan and the visit of this delegation led by Federal Minister Abdul Aleem Khan will bring positive progress in this regard. The meeting also discussed matters of mutual investment between the two countries under Public-Private Partnership.\nIn this meeting, the Chairman of the National Highway Authority gave a briefing on the projects of M-6 and M-9 Motorways while negotiations were held with Azerbaijani officials on mutual partnership with Pakistan on rail, road and other means of communications.\nCoordinator of SIFC Lt. Gen. Sarfaraz Ahmed and Federal Secretary Petroleum Momin Ali Agha were also present from Pakistan in the meeting of with high level delegation. It is worth mentioning that Federal Minister for Communications, Privatization and Board of Investment Abdul Aleem Khan has arrived in Baku, Azerbaijan today where he is expected to hold meetings with other Ministers and key Government officials, as well.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:12:48.331Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/azerbaijan-expresses-interest-to-invest-on-motorways-in-pakistan/",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T14:13:00.000Z"
}
