{
  "title": "Saudi ambassador reaffirms Kingdom’s unwavering support for Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jan 30 (APP): Saudi Ambassador, Nawaf bin Said Al-Malki on Thursday officially launched the Shelter and Winter Kits Project 2025 reaffirming the Kingdom’s unwavering support for Pakistan.\nSpeaking at the ceremony, Ambassador Al-Malki said Saudi Arabia, through the King Salman Humanitarian Aid and Relief Center (KSrelief), has donated 84,500 shelter and winter kits to assist vulnerable communities across Pakistan.\nHe said the aid will be distributed in all four provinces, as well as Gilgit-Baltistan and Azad Jammu & Kashmir, ensuring relief for those in need during the harsh winter season.\nExpressing his gratitude, the Saudi envoy stated, “It is my pleasure to participate in this ceremony on behalf of my country, the Kingdom of Saudi Arabia, to hand over this generous gift to our brotherly nation, Pakistan. The KSrelief continues to serve humanity globally, and in Pakistan, it remains steadfast in providing support whenever needed.”\nReaffirming Saudi Arabia’s deep-rooted ties with Pakistan, he emphasized the strong commitment of King Salman bin Abdulaziz Al Saud and Crown Prince Mohammed bin Salman bin Abdulaziz to further strengthening bilateral relations. “The Government of Saudi Arabia will always stand by its Pakistani brothers to elevate our brotherly relations to new heights,” he added.\nThe ambassador concluded by praying for peace, prosperity, and stability in both nations, underscoring the shared values and solidarity between Saudi Arabia and Pakistan.\nSaudi Arabia has consistently extended humanitarian assistance to Pakistan through KSrelief, supporting disaster-stricken communities, healthcare initiatives, and poverty alleviation programs. The latest winter relief package is expected to bring much-needed comfort to thousands facing extreme weather conditions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:13:49.794Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/saudi-ambassador-reaffirms-kingdoms-unwavering-support-for-pakistan/",
  "dateList": "2025-01-30",
  "date_published": "2025-01-30T12:43:00.000Z"
}
