{
  "title": "UN chief calls upon Tehran to renounce nuclear weapons - World - DAWN.COM",
  "author": null,
  "content": "DAVOS: Iran must make a first step towards improving relations with countries in the region and the United States by making it clear it does not aim to develop nuclear weapons, UN Secretary-General Antonio Guterres said on Wednesday.\n\nHe also said he hoped all parties in Gaza would realise they would benefit from a permanent truce that could open the path to negotiations over a two-state solution and urged countries to ease sanctions on Syria.\n\n“The most relevant question is Iran and relations between Iran, Israel and the United States,” Guterres said as he discussed the situation in the Middle East at the World Economic Forum in Davos.\n\n“Here my hope is that the Iranians understand that it is important to once and for all make it clear that they will renounce to have nuclear weapons, at the same time that they engage constructively with the other countries of the region.”\n\nThe UN nuclear watchdog chief, Rafael Grossi, touched on the same theme in Davos, saying Iran is “pressing the gas pedal” on its enrichment of uranium to near weapons grade. Iran has always said its programme is entirely peaceful and it has the right to enrich uranium to any level it wants. “I think this is a clear indication of an acceleration,” Grossi said.\n\nIAEA head says Tehran is ‘pressing the gas pedal’ on its enrichment of uranium to near weapons grade\n\n‘Absolutely indispensable’\n\nGrossi also called on the Trump administration and Iran to hold talks, emphasising that dialogue was “absolutely indispensable” to move forward in nuclear negotiations with Tehran. “Without that dialogue, there’s not going to be any progress,” Grossi told reporters at the World Economic Forum in Davos, Switzerland.\n\nComments from President Donald Trump and members of the new administration show “there is a disposition” to have a “conversation and perhaps move into some form of an agreement”, Grossi said. Iranian officials also recognise that talks are needed, he noted.\n\nIran’s nuclear programme has grown “dramatically” in terms of capabilities, facilities and inventory of nuclear material since the end of Trump’s previous term in 2021, Grossi added.\n\nDuring his first term, Trump pursued a policy of “maximum pressure” against Iran, withdrawing the United States from a 2015 landmark nuclear deal which imposed curbs on its nuclear programme in return for sanctions relief.\n\nTehran adhered to the deal until Washington’s withdrawal in 2018, but then began rolling back its commitments. Efforts to revive the pact have since faltered.\n\nThe IAEA said last month that a revamp of Iran’s Fordo enrichment plant would lead to an increase in the rate of production of uranium enriched up to 60 per cent, closer to the 90pc needed to make a nuclear weapon.\n\nThe rate of production will jump around sevenfold to more than 34 kilogrammes (75 pounds) of highly enriched uranium per month, it said. Iran insists on its right to nuclear energy for peaceful purposes, and denies it is seeking an atomic weapons capability.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:54:02.547Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887095/un-chief-calls-upon-tehran-to-renounce-nuclear-weapons",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:53.000Z"
}
