{
  "title": "Imran says neither he nor Bushra benefited from Al Qadir Trust case - Pakistan - DAWN.COM",
  "author": null,
  "content": "Former premier Imran Khan said on Thursday that neither he nor his spouse Bushra Bibi benefitted financially from the Al-Qadir Trust case, and that business tycoon Malik Riaz could testify that he was the only prime minister who “never sought anything from him for personal or financial gain”.\n\nImran and Bushra were convicted last week in the £190m Al-Qadir Trust case in which Riaz and his son are also co-accused and proclaimed offenders. Following the conviction, the National Accountability Bureau (NAB) swung into action on Tuesday against Riaz to bring him back to Pakistan from the United Arab Emirates.\n\nA post from Imran Khan’s X account today said: “Neither Bushra Bibi nor I have financially benefitted from the Al-Qadir Trust in any way.\n\n“Malik Riaz will testify that I was the only Prime Minister who never sought anything from him for personal or financial gain.”\n\nImran added that “unlike [Asif Ali] Zardari, I did not have a Bilawal House built for me, nor did I sell One Hyde Park at double its value like the Sharif family did.\n\n“The future of Pakistan’s youth is important for me, and it was for this reason that Al-Qadir University was established,” the post read.\n\nThe post came in the backdrop of Riaz’s post on X a day ago, in which he had said he would “not testify”. “This was my decision yesterday and this is my decision today, no matter how much you oppress me, Malik Riaz will not testify!” the property tycoon had said in response to the government’s decision regarding his extradition.\n\nMeanwhile, Information Minister Attaullah Tarar had called on the father and son to present and defend themselves in the courts.\n\nAs per the court verdict of Imran and Bushra Bibi’s conviction, the “property of the sham … Al-Qadir University Project Trust” was forfeited to the federal government. The other accused, namely Riaz, his son Ahmed Ali Riaz Malik, former accountability czar Mirza Shahzad Akbar, former PM’s aide Zulfi Bukhari, Farhat Shahzadi and Ziaul Mustafa Nasim have already been declared proclaimed offenders and perpetual warrants for their arrest and the confiscation of their properties has been ordered.\n\nThe detailed verdict, spanning 148 pages, recalled that the Supreme Court had held that the grant of land by the Sindh Board of Revenue to the Malir Development Authority (MDA), and the MDA’s subsequent exchange of the land with the Bahria Town (Pvt) Limited were all illegal and a result of collusion amongst all the stakeholders.\n\nSubsequently, Bahria Town agreed to pay a total sum of Rs460 billion for the land. The verdict said that funds from foreign bank accounts, previously frozen by the UK’s National Crimes Agency, were repatriated to settle the liabilities of Bahria Town instead of being added to the national kitty.\n\nIn its reference against Imran, NAB had alleged that the then cabinet approved a confidential deed in 2019 to give £190m seized by the NCA, and returned to Pakistan, back to Riaz.\n\nThe bureau had said that Imran and Bushra Bibi got billions of rupees and land measuring hundreds of kanals from Bahria Town for legalising the money. As per the reference, Riaz’s son transferred 240 kanal of land to Shahzadi, while Bukhari received land under a trust, which NAB argued did not exist at the time of transfer.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/2318591918f88b9.png",
  "retrievedAt": "2025-08-26T07:53:33.263Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887193/imran-says-neither-he-nor-bushra-benefited-from-al-qadir-trust-case",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T11:14:32.000Z"
}
