{
  "title": "SIFC focusing on promoting investment in country - Pakistan - DAWN.COM",
  "author": null,
  "content": "Special Investment Facilitation Council is focusing on promoting investment in the country, a day after the body’s executive committee stressed the importance of close coordination and cooperation among relevant stakeholders to strengthen the country’s industrial sector, state-run Radio Pakistan reported on Thursday.\n\nThe SIFC is a committee that helps foreign investments, intending to improve the ease of doing business for investors and to attract investments from other countries.\n\nIn May last year, the Pakistan Business Council (PBC) had advised the SIFC to focus on transforming the investment climate. PBC chief executive Ehsan Malik urged the council to address fragmentation and silo working of key ministries to ensure long-term predictability of policies.\n\nIn September, four countries allocated $27 billion]3 for investment by launching various mega projects in Pakistan under the SIFC framework.\n\nThe council is “focusing on promoting investment in the country, [while] the National Institute of Public Administration and the Pakistan Administrative Staff College are working together to formulate strategies for increasing industrial investment,” Radio Pakistan said.\n\nIt added that a research group will prepare a detailed plan to address the barriers to industrial development.\n\n“A strategy is also under consideration to increase foreign investment in the industrial sector by twenty billion dollars over the next five years,” the report added.\n\nA day ago, Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal chaired the committee’s 12th meeting in Islamabad. The meeting reviewed the progress of ongoing projects and policy initiatives across various sectors.\n\n“The meeting commended the ongoing efforts to grant industrial status to the warehousing and logistics sectors,” Radio Pakistan said.\n\nIts objective was to further improve the investment climate in the country and pave the way for progress across key sectors, strengthening Pakistan’s position on the global stage, it added.\n\nDuring the meeting, various ministries presented updates on projects and policy-level actions being pursued through the SIFC forum.\n\nThe committee engaged in detailed discussions and reached a consensus on policy aspects related to critical sectors, including industry, agriculture and livestock, mining and minerals, oil and gas, and ports, the report said.\n\n“In alignment with directives from the prime minister during the 11th Apex Committee meeting, the committee focused on fast-tracking the implementation of the revised framework for Special Economic Zones (SEZs),” it added.\n\nAdditionally, the committee directed swift action on various aspects of port and shipping infrastructure.\n\nSpecific focus was given on enhancing terminal handling to facilitate smoother exports and imports, in line with the committee’s objective to improve trade logistics.\n\nThe committee directed the use of the SIFC forum to expedite cross-sectoral matters through policy-level actions and stakeholder consultations.\n\nFederal ministers, the National Coordinator of SIFC, federal secretaries, provincial chief secretaries, and senior government officials attended the meeting.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/23133213c7dc8ed.png",
  "retrievedAt": "2025-08-26T07:53:33.201Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887185/sifc-focusing-on-promoting-investment-in-country",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T10:06:36.000Z"
}
