{
  "title": "A dying light - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT appears that some Supreme Court justices will not go gently into the night. Though the institution’s authority and esteem now seem to wane with every passing day, their fight to resist total capture, as ordained by the 26th Amendment, continues undeterred.\n\nThey may be up against formidable odds and gravely disadvantaged by their institution’s inability to maintain a united front, but their continued refusal to surrender is what gives the public hope that at least a part of the institution still clings to life.\n\nAs the concepts of lawfulness, fairness and justice become ever more remote, power must be reminded where the lines are drawn. It may be that the lines will still be crossed — such is the conceit of those who feel they are themselves the law — but as long as there are those who will insist on calling a spade a spade, hope will not be lost.\n\nThere is currently an ongoing dispute within the SC over a case that was transferred from a regular bench that was already hearing it to the constitutional bench.\n\nSeveral senior justices and members of the legal community have highlighted that the case, once it started being heard, could not simply be taken from the bench hearing it and handed to another. That this was done in this case via an administrative order even prompted one of the justices to reportedly remark, “Where it is felt that the decision may be against the government, then the case is withdrawn from the bench. This is not correct.”\n\nThe wider community, too, has raised serious concerns about the implications of this incident on the independence of the judiciary, with the All Pakistan Lawyers Action Committee reminding the judiciary that “[The judges] are duty-bound to act as guardians of justice, not facilitators of vested interests.”\n\nIt must be pointed out here that disputes and confusion over who gets to hear what case were anticipated and warned of by many jurists when the 26th Amendment was being passed.\n\nSince its enactment, the repercussions have been devastating not just for the SC but also for its judges, whose power and prestige seem to have been reduced to that of a junior officer. Even the office of chief justice of Pakistan has not been immune to its ravages.\n\nMeanwhile, the constitutional bench has emerged as a parallel court that seems to enjoy overarching jurisdiction and authority over all consequential matters. The problems this is creating will soon come to a head.\n\nThe apex court must acknowledge the objections that have been raised regarding the 26th Amendment and fix the matter before a full court. It is important that they are settled quickly and comprehensively for the sake of the institution.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:14:12.055Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887122/a-dying-light",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:22:30.000Z"
}
