{
  "title": "Fraudulent plot transfers detected in Capital Development Authority - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Dozens of fraudulent plot transfers have reportedly been detected in the federal capital under the Capital Development Authority’s watch.\n\nA parliamentary panel on Wednesday took up one such case where the file of a house located in Sector I-10/4 went mysteriously missing, putting its rightful owner in trouble.\n\nSources within the civic agency revealed that in most cases, missing files could be deliberate attempts of CDA employees and their blue-eyed property dealers to cover up their alleged wrongdoings.\n\nThey said that in the past, a large number of plots were allotted to land affectees (those whose land had been acquired by CDA and they were entitled to get plots from CDA) on the basis of bogus documents/claims. Subsequently, those plots were further sold out to bonafide purchasers, who kept selling them to others.\n\nSources reveal dozens of illegal transactions carried out under civic agency’s nose; CDA confirms 87 such cases\n\nWhen the matter came under the radar of the Federal Investigation Agency (FIA) and CDA’s security directorate, the initial transfer files started going missing, putting the last purchasers who got the plot transferred from CDA, in great trouble.\n\nSources said those involved in fraudulent allotments were apparently behind the sudden disappearance of files to save their skin.\n\nWhereas, in a number of other cases, the plots, which were transferred by CDA itself several times, are now not being further transferred.\n\nInterestingly, the CDA itself made transfer deeds of these plots several times, taking pictures of buyers and sellers, and issuing allotment letters.\n\n“Those who purchased the plots and got them transferred from CDA are not at fault. If the initial allotment was bogus, then action should be taken against those who made the first allotments. Recoveries should be made from them to compensate aggrieved citizens,” said an official of CDA.\n\nHe said that multiple such cases are being probed by the security directorate while dozens of such cases are lying pending with the estate affectees wing.\n\nIn its written reply to the Senate body, the CDA acknowledged that 87 such cases were identified and nullified after due process.\n\n“Out of the 87 cases, 68 are first transfers of the plots,” the civic agency said.\n\n“The estate wing has referred 31 cases to the security directorate to initiate inquiries,” read the CDA reply.\n\nThe civic agency alleged that there was a mafia working outside CDA that operated in collusion with black sheep within the agency to defraud the public. It said four employees were terminated in the last six months over misconduct.\n\n“CDA is taking severe action against employees found guilty in such cases and discouraging mafias involved in looting the public by faking documents,” the agency said.\n\nMeanwhile, the Senate Functional Committee on Government Assurances, chaired by Senator Abdul Shakoor Khan got the updated status of various government assurances given by the federal government.\n\nInitially, the assurance regarding the missing file of a house located in Sector I-10/4, Islamabad was taken up.\n\nThe matter was raised by Senator Mushtaq Ahmed.\n\nCDA officials stated that the matter was pending before a civil court and there wasn’t anything that could be done except representing the case before the CDA board upon conclusion or withdrawal of civil suit.\n\nThe committee was told that CDA has initiated the inquiry against those involved in the fraud.\n\nSenator Abdul Shakoor Khan astonishingly remarked how come the CDA failed to notice the legality of the file during the earlier five transfers.\n\nHe said that it was unfortunate that the individual had to bear the burden of the malafide practices of CDA officials.\n\nThe committee disposed of the matter, stating that the CDA failed to implement the assurance and provide any relief to the aggrieved party.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:58:35.191Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887033/fraudulent-plot-transfers-detected-in-capital-development-authority",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:15:30.000Z"
}
