{
  "title": "Knife attacker kills two in Germany - World - DAWN.COM",
  "author": null,
  "content": "BERLIN: A knife attacker in Germany killed a two-year-old child and a man and seriously wounded two other people on Wednesday, said police, who arrested an Afghan suspect at the scene.\n\nIt is the latest in a series of deadly knife attacks to have shaken Germany in recent months, fuelling concerns over public safety.\n\nThe stabbings happened in a public park in the centre of the Bavarian city of Aschaffenburg at around 11:45am, police said. The attacker targeted a group of children from a daycare centre who were in the park, according to German media.\n\n“Two people were fatally injured,” police said, while another two were seriously hurt and receiving treatment in hospital. The suspect, a 28-year-old man from Afghanistan, was arrested “in the immediate vicinity of the crime scene”, police added, without indicating a motive.\n\nGerman media reported that the man was said to have had psychological issues for which he had received treatment. The suspect lived in an asylum centre in the area, news outlet Der Spiegel reported.\n\nInterior Minister Nancy Faeser said she was “deeply shocked” by the attack. “The investigation will clarify the background to this terrible act of violence,” she said in a statement. Following the attack police said there were “no indications of other suspects” and no further danger to the public.\n\nA second person who was held by police was being treated as a witness. Authorities had cordoned off the park in Aschaffenburg, around 36 kilometres southeast of Frankfurt in the west of Germany.\n\nPolice said train traffic around the scene had been suspended, with services delayed or diverted. The suspect had tried to flee across the train tracks, the Sueddeutsche Zeitung newspaper reported.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6791746a3e8bc.jpg",
  "retrievedAt": "2025-10-12T00:58:49.501Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887104/knife-attacker-kills-two-in-germany",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:53.000Z"
}
