{
  "title": "Judge Rana derided as ‘installed’ was posted to capital under PTI rule - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Although it has been trying to paint the judge who sentenced Imran Khan in the Al-Qadir Trust case as ‘incompetent’ and ‘installed’, Accountability Court judge Nasir Javed Rana was actually transferred to the capital at the time when the PTI was in power, Dawn has learnt.\n\n“The government is so scared of me… they had me sentenced by an unscrupulous judge who had been removed from judicial service by the Supreme Court in 2004,” PTI founder Imran Khan had said in his first reported comments on the verdict handed down in the £190 million corruption case.\n\nIndeed, Mr Khan and his party have been at pains to discredit the Accountability Court judge who sentenced the PTI leader and his wife, Bushra Bibi, on Jan 17.\n\nNasir Javed Rana was restored to judicial service by former LHC chief justice\n\nThe verdict was deferred thrice; first, the judge postponed the judgement, scheduled to be announced on Dec 23 citing winter vacations, giving Jan 6 as the new date. On that day, the judgement was again deferred since the judge was on a training course.\n\nThe next date for announcement of the judgement was Jan 13, but since Mr Khan and Bushra Bibi did not appear before the court, the judge fixed the matter for Jan 17, when the verdict was actually announced.\n\nFollowing the pronouncement, Opposition Leader Omar Ayub and party spokesperson Sheikh Waqqas Akram were among those who called the judge’s competence into question, with the latter claiming that the judge was previously declared “unfit for judicial service” and had judicial powers were also withdrawn.\n\nEven Advocate Faisal Hussain, one of Mr Khan’s legal advisers, criticised him as being “a hand-picked judge who was declared not eligible to be a judge by the Supreme Court”.\n\nHe had also warned that he would “expose the history of the judge”, but never shared any details.\n\nBack story\n\nIt is a matter of record that in Oct 2004, the Supreme Court withdrew the judicial powers of Nasir Javed Rana — who was a magistrate in the Punjab Judicial Service at the time — for granting the 10-day remand of senior lawyer Habib Wahabul Khairi, in violation of the law.\n\nThe Lahore High Court was directed to take further action against the official, who “has a strong tendency for committing any mischief and is absolutely unfit for judicial service,” then-chief justice of Pakistan Justice Nazim Hussain Siddiqui had observed.\n\nThe observation came in a 14-page judgement on a suo motu notice on the illegal detention of Mr Khairi, who was arrested under Sections 420 (cheating and dishonestly inducing delivery of property of fraudulent deeds and disposition of property), 468 (forgery for purpose of cheating) and 471 (using as genuine forged document) of the Pakistan Penal Code (PPC).\n\nThe order said that it was not possible to take a lenient view of the official’s guilt, as evidence suggested that Khairi was never produced before him.\n\nAt the time, the CJP had observed that the high court was required to complete action against the magistrate, in accordance with the law, within two months.\n\nThe matter was referred to then-Lahore High Court chief justice Chaudhry Iftikhar Hussain, and heard by a three-member LHC tribunal, which exonerated him. Justice Hus­sain then reinstated him on June 23, 2007.\n\nFollowing his reinstatement, his services were eventually transferred from the LHC to the Islamabad High Court (IHC) on April 15, 2019, and then-IHC chief justice Athar Min­allah was “pleased to appoint” the judge for a period of three years on a deputation basis.\n\nConnection with PTI minister\n\nInsiders claim that Mr Rana was an acquaintance of Fawad Chaudhry, a relative of ex-LHC CJ Chaudhry Iftikhar Hussain who also remained a federal minister in the PTI cabinet.\n\nDocuments seen by Dawn indicate that Mr Rana was repatriated to the LHC on March 3, 2021 “consequent upon the promotion” from additional district and sessions judge to district and sessions judge. As per a notification of June 30, 2021 — issued on the directions of Justice Minallah — Rana was again posted to the Islamabad Judicial Service for a period of three years.\n\nA notification from Aug 2, 2024, issued by incumbent IHC CJ Justice Aamer Farooq, retained the services of Nasir Javed Rana with the Islamabad judiciary.\n\nDawn made several attempts to contact Fawad Chaudhry, but he remained unavailable for comment. His brother, Advocate Faisal Hussain, told Dawn that Rana was cleared by the disciplinary committee of the LHC, comprising two judges.\n\nHe confirmed that his uncle, Chaudhry Iftikhar Hussain was the LHC CJ at the time, but maintained that most judges knew him and his brother due to their family’s legal background.\n\nAdvocate Faisal Hussain also denied any relationship between his brother and the judge, claiming that Nasir Javed Rana had recently dismissed a post-arrest bail application filed before him by Fawad Chaudhry.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://www.dawn.com/2012/12/28/fraud-inquiry-against-senior-judge/",
  "retrievedAt": "2025-08-26T07:54:04.052Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887109/judge-rana-derided-as-installed-was-posted-to-capital-under-pti-rule",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:32.000Z"
}
