{
  "title": "Imran says to call off talks with govt if judicial commissions not formed today: Gohar - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI Chairman Barrister Gohar Ali Khan on Thursday said that party founder Imran Khan directed to call off talks with the government due to a delay over the formation of judicial commissions.\n\nThe PTI and the government had been engaged in talks to bring down political temperatures. After two rounds of meetings, the third round was held seven days ago (Jan 16) in which the PTI formally presented its demands in writing.\n\nDespite weeks of negotiations, the dialogue process has hardly moved forward on major issues — the formation of judicial commissions and the release of PTI prisoners.\n\nOn Monday, the government assured the PTI of a response to the opposition’s ‘charter of demands’ within seven working days after the party warned it would boycott the next round of talks if judicial commissions were not formed to probe the May 9 and November 26 incidents.\n\nSpeaking to reporters outside Adiala Jail today after meeting Imran, Barrister Gohar said that the government had promised to form the requested judicial commissions within seven days, but it failed to do so.\n\n“The PTI founder (has) said to call the talks off over the government’s failure to form the judicial commissions,” he said.\n\nHe added that the PTI was hopeful of continuing the talks but they have to be called off “due to non-cooperation from the government.”\n\n“Negotiations cannot move forward if the commission is not announced today,” he said.\n\nHe noted, however, that negotiations could continue if a three-judge commission was formed.\n\n“According to the PTI founder, the party will continue its efforts under the law and Constitution,” Gohar said. “On the instructions of [Imran], we will join various opposition parties and struggle together.”\n\nThe government had urged the opposition a day ago to remain part of the dialogue, promising to respond to its demands in the fourth round of talks on Jan 28.\n\nAddressing the situation in a press conference outside Parliament House, Senator Siddiqui urged the party to not forsake dialogue for political stability’s sake, saying that he could not understand the reason for the PTI’s threat to abandon talks.\n\nHe said the two sides had already agreed to give the government time to furnish its formal written response to the PTI’s demands, adding that the deadline was not yet up.\n\n“I don’t have the words except that they were in a hurry to arrive and are in a hurry to depart. The impatience with which they came is the same with which they are going back. We ask them to stay some days and not go back, let the weather become pleasant.”\n\nSiddiqui said the coalition parties had “almost” formed an opinion on the PTI’s demands. “They should reconsider if it is in their power and if they can form an opinion apart from their founder’s opinion,” he added.\n\nThe senator pointed out that the government side had exhibited restraint at many points during the talks and ignored many actions by the PTI since it wanted to progress talks in the “spirit of negotiations, democracy and give and take”.\n\nHe called on the PTI to reconsider its course of action or submit its complaints in written form.\n\nIn its demands, the PTI asked that the first commission be tasked to conduct an in-depth inquiry into various aspects, including the “legality of the events that led” to Imran’s arrest on May 9, 2023.\n\nIt further sought a probe into the “legality of the manner of the arrest and those responsible for the break-in into the premises of the Islamabad High Court by the rangers and the police”.\n\nReferring to the nationwide violent protests that occurred on May 9 last year, it asked that the “events across the country after Imran’s arrest” be also inquired into.\n\nThe PTI specifically asked for a probe into the “circumstances in which groups of individuals were able to reach various high-security locations at which property damage is said to have been caused”. It sought an “examination of the CCTV recordings at each location where damage is said to have been caused by protesters”.\n\nMoreover, the party said that if the CCTV footage is “not available, the causes of this lack of availability” be investigated as well.\n\nThe PTI demanded that the “manner in which those arrested in connection with the events of 9 May were apprehended and then kept in custody as well as the circumstances of their release” be also looked into. “Were the human rights of these individuals violated, including through torture? How were the lists of those to be arrested compiled?” it asked.\n\n“Were multiple FIRs (first information reports) registered against the same individual concerning May 9, 2023, and sequential arrests carried out in abuse of the process of the law?” the party further asked.\n\nIt also sought a review of “instances of media censorship and restrictions on reporting related to the incident, including harassment of journalists”.\n\nBringing reoccurring internet disruptions into the discussion, the PTI demanded that the “vires and legality of government’s imposition of internet shutdowns and its impact before, during and after the unrest” be examined, with responsibility fixed for it.\n\nSince Imran’s incarceration on Aug 5, 2023, based on several cases, his party’s relationship with the government, as well as the establishment, has turned exceedingly sour. The PTI has held several protests over the last year, most of which escalated into violence after facing state repression.\n\nSeeking the formation of a separate commission over its November ‘Final Call’ protest in Islamabad, the PTI asked for another in-depth inquiry into the events of November 24 to 27.\n\nFollowing the power show, tensions escalated as there were renewed calls to ban the party and task forces formed against an alleged “malicious campaign” as the PTI claimed a dozen deaths of its supporters, which the government officially denies.\n\nHowever, after Imran formed a five-member committee to hold talks with “anyone” and his lawmakers had a softened stance in the parliament, the government constituted its own committee comprising ruling coalition members.\n\n“Was there firing of live ammunition and other forms of physical assault on the protestors in Islamabad? If so, who ordered the use of live ammunition and other violent actions against the protestors? To what extent was the use of force excessive? If so, who was responsible for the excessive use of force?” the PTI asked.\n\nIt also asked for the “number of the martyrs and the injured and of the persons who went missing after 24 to 27 November 2024”.\n\nThe opposition demanded that the “state of the CCTV recordings at the various hospitals and medical facilities in Islamabad” during those four days be examined and ascertained.\n\n“Were the records of hospitals and other medical facilities tampered with? If so, under whose directions and command was this done? Were the hospitals prevented from releasing information about the fatalities and the injuries?” the PTI asked.\n\nIt also sought the same for the CCTV footage “recorded at the various premises from China Chowk to D Chowk on the Blue Area”, where the PTI convoys had gathered for their Islamabad protest.\n\n“What difficulties were faced by those seeking to register FIRs and initiate other legal action with respect to the events of 24 to 27 November?” the party asked.\n\nIt sought a review of “instances of media censorship and restrictions on reporting related to the incident, including the harassment of journalists”.\n\nIt reiterated its demand to decide the legality of what it said was the “government’s imposition of internet shutdowns”, and its impact before, during and after the unrest.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/231428585a53d4b.png",
  "retrievedAt": "2025-08-26T07:53:33.120Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887191/imran-says-to-call-off-talks-with-govt-if-judicial-commissions-not-formed-today-gohar",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T09:32:06.000Z"
}
