{
  "title": "Govt plans prompt closure of utility stores - Business - DAWN.COM",
  "author": null,
  "content": "• Committee to finalise strategy in seven days\n• No clarity on PM’s Ramazan package\n\nISLAMABAD: The federal cabinet has formed a high-level committee to develop a comprehensive strategy for the prompt shutdown of Utility Stores Corporation operations nationwide.\n\nA Cabinet Division notification on Wednesday showed that the committee will be led by Industries and Production Minister Rana Tanveer Hussain, and it is tasked with submitting a report to the cabinet within seven days. The notification was issued after the federal cabinet’s approval on Tuesday.\n\nThe committee will comprise seven members, including the state ministers for finance and revenue, information technology, federal secretaries in finance, industry and production, privatisation, and the Benazir Income Support Programme (BISP).\n\nAccording to the terms of reference (TORs), the committee will determine the modalities for the immediate closure of the operation of the Utility Stores Corporation. The committee will also work out arrangements for placing permanent USC employees in the surplus pool or absorption against existing vacancies in other federal government organisations.\n\nTraditionally, the prime minister’s Ramazan package is offered to the general public through utility stores. However, the committee will now also prepare a strategy for providing the Ramazan package in coordination with the BISP.\n\nThe committee is also tasked to determine the arrangements for the safekeeping and maintenance of the assets and property owned by the USC, pending privatisation and any other matter ancillary to the closure of the utility stores.\n\nThe Ministry of Industries and Production will provide secretariat support to the committee. The committee will finalise its report within seven days for submission to the federal cabinet.\n\nIt is worth noting that there were rumours that the government would discontinue subsidies on sugar, wheat, and cooking oil.\n\nIn December 2024, another proposal was considered to close 1,000 loss-making USC outlets nationwide. However, another proposal was to restructure the corporation to improve its financial sustainability.\n\nThe government will face the daunting task of accommodating USC’s 3,800 employees. The industries and production minister repeatedly said that the government had no intentions of closing the USC.\n\nIn January, the Economic Coordination Committee approved Rs1.7 billion to settle the pending liabilities of USC under the Prime Minister’s Relief Package. However, no additional budget was allocated for the upcoming Ramazan relief package.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6791706da1d5a.jpg",
  "retrievedAt": "2025-08-26T07:53:49.299Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887083/govt-plans-prompt-closure-of-utility-stores",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:15:52.000Z"
}
