{
  "title": "Must work with Kabul to help millions: UN Assistance Mission in Afghanistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Disengagement is neither an option nor helpful to Afghans. Global community must collectively engage with Afghanistan to create an entry point for helping millions of Afghans that are in distress, and also help the country deal with its longstanding challenges.\n\nThese remarks were made by the head of the Pakistan-based liaison office for the UN Assistance Mission in Afghanistan (UNAMA), Malick Ceesay, during the launching ceremony of Complex Terrorism Landscape in Pakistan-Afghanistan Region: Afghan Emirate as Counter-Terror Partner, the latest publication of the Centre for Research and Security Studies (CRSS).\n\nThe research publication offers critical insights into the evolving dynamics of militancy in the region and explores the heightened threats posed by the Tehreek-i-Taliban Pakistan (TTP) and the militant Islamic State group following the Taliban’s return to power in Afghanistan in August 2021.\n\nThe UNAMA representative said that peace and stability of Afghanistan was the concern of the entire international community and not just of the UN, all wanting to see the country prosper, stable and enjoy lasting peace as a matter of Afghanistan and international interest.\n\nCRSS research offers critical insights into threats posed by TTP and IS after Taliban takeover of Kabul\n\nThe CRSS research, in its key highlights, notes that contrary to the initial optimism about Taliban rule that it might bring decline in transnational terrorism and lead to regional stability, the threats have instead only intensified and it has introduced new complexities\n\nThe country also witnessed a sustained rise in overall violence (resulting from terrorism and counter-terrorism operations), and terror attacks on Pakistan’s security forces and their resulting fatalities, for the fourth consecutive year since 2021, which coincides with the Taliban’s return to power in Afghanistan.\n\nThe TTP and the militant Islamic State group now dominate the militant landscape in the region, where a closer look at them as two primary militant actors reveals that each is pursuing distinct and divergent but equally destabilising agendas. The TTP, rooted in Deobandi ideology, seeks an Islamic state in Pakistan and exploits local grievances. The IS, a Salafi-jihadist group, prioritises transnational jihad, carrying out mass casualty attacks and targeting religious minorities.\n\nIt recommends that Pakistan needs strategic clarity on the nature of the TTP threat and must adopt a deradicalisation strategy that does not treat militancy as a monolith. Instead, it should take into consideration the distinct ideological, socio-political, and economic drivers of groups like the TTP and IS.\n\nThe report underscores the importance of holding the Taliban accountable for their commitments under the Doha agreement while engaging them for counterterrorism cooperation. It highlights the need to integrate counterterrorism efforts into broader governance and development frameworks for sustainable peace.\n\nThe rise of IS and the consolidation of TTP through splinter groups poses twin challenges. Their divergent objectives “localised versus transnational jihad” demand different and targeted responses, said the principal author of the report, Dr Aamer Raza, from the department of Political Science, University of Peshawar.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:58:19.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887086/must-work-with-kabul-to-help-millions-un-assistance-mission-in-afghanistan",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:24.000Z"
}
