{
  "title": "Experts call for fair distribution, action against ‘tanker mafia’ to ease Karachi’s water woes - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: Water is increasingly becoming scarce in the city, mainly due to its theft by corrupt elements who are making millions from it, rampant population growth, ageing infrastructure, line losses and various other factors which need the government’s attention on urgent basis otherwise the city’s water woes would keep growing.\n\nThese were the views of speakers at a seminar, “Water Scarcity in City: A Discussion on Issues and Causes,” organised by the Urban Resource Centre (URC) on Wednesday, where architect and urban planner Arif Hasan stressed that along with resolving all the issues mentioned above, it is crucial to build dams around the Kirthar Range like the Thado Dam as only that can help ensure the increasing water demand of the metropolis.\n\nDuring his presentation at the event, electrical engineer and URC board member Mansoor Raza explained that Karachi had been witnessing a rampant population growth for the past many years which had led to increasing demand of water.\n\n“Besides, ageing infrastructure, unjust distribution, line losses and water theft are the main reasons why the essential utility is so less than how much is required. Even that water what is provided is of poor quality as multiple surveys have shown,” he added.\n\nMoreover, he said it is well documented who “the tanker mafia” is and the influential people involved in it. “And there is what some people call a ‘conspiracy theory’, that this mafia is making millions of rupees. And if that is the case, why would water be provided to lines and not tankers?” he asked.\n\nArif Hasan says dams around Kirthar Range are necessary to resolve long-term water needs of Karachiites\n\nArif Hasan said that there is a lot of corruption when it comes to water management in Karachi. He said even the World Bank estimates were quite inaccurate when it came to the cost of water related projects as the international organisation provided way higher estimates than the actual cost. That, he added was done so that Pakistan could be made to ask for loans.\n\nMr Hasan stressed that along with addressing all the issues mentioned by other speakers, it is crucial to construct dams around the Kirthar Range, just like the Thado Dam has been built, as only that can help ensure the increasing water demand of the metropolis in a significant manner.\n\nHe also said that there is “no culture of storing rainwater in Karachi”, which is important to address the city’s water scarcity problem.\n\nResearcher Nudrat Fatima Junaid while providing an overview of the K-IV project said that the mega project is supposed to significantly reduce the gap between water demand and supply by providing 650 MGD (million gallons per day) water.\n\nHowever, she also pointed out how much delays the project had faced so far since it was initiated in 2002 and how the cost had also increased exceptionally.\n\nFarhan and Rasha, two students from the Sir Syed University of Engineering and Technology, delivered a presentation on Dumlottee Wells in the Malir district, which were constructed by the British Raj in the 19th century to provide water supply to the city.\n\nThe key points highlighted in the presentation were how the wells were now lying useless and that if revived and properly restored, they can help provide sufficient water in city areas. Sand and gravel is also being dug out from them illegally. However, they pointed out that when the water board once approached the Sindh government for reviving and restoring them, the government had rejected the proposal.\n\nThe experts also stressed that there is an urgent need to devise a mechanism against water wastage throughout the city, just like many developed countries, as a large amount of water goes wasted on unimportant things.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T00:58:33.213Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887062/experts-call-for-fair-distribution-action-against-tanker-mafia-to-ease-karachis-water-woes",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:16:03.000Z"
}
