{
  "title": "Govt slashes T-bill rates by up to 41bps - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The government again slashed the cut-off yields on treasury bills at the auction on Wednesday, reflecting a higher possibility of ano­t­her interest rate next week.\n\nThe T-bills rates were cut by up to 41 basis points as the government raised the amount within the auction target. The return on a 12-month tenor was redu­ced by 41bps to 11.38pc compared to 49bps at the auction held on Jan 8, making the total reduction of 90bps this month. The State Bank of Pakis­tan’s (SBP) policy rate is 13pc, slashed by 900bps from 22pc since June 2024 in five intervals.\n\nMost financial experts and analysts believe that the SBP would cut the interest rate by 100bps in its Monetary Policy Committee’s meeting scheduled for Jan 27. The government cut the return on the six-month T-bill by 39bps to 11.40pc. In the previous auction, the rate was cut by 21bps.\n\nThe short-term three-month papers that attracted the lowest bids in the auction noted a decline of 20bps to 11.58pc against a 21bps cut in the last auction.\n\nThe bidding pattern also shows that the investors were interested in parking their liquidity for longer periods, anticipating further cuts in the interest rate.\n\nThe government recei­ved a total bid of Rs1.401 trillion, with the highest Rs864bn for 12-month papers justifying the market’s perception about interest rate cuts. The government raised Rs220.3bn through biddings and Rs105.2 throu­­gh non-biddings, generating Rs325.5bn.\n\nThe government raised Rs3.3bn for three-, Rs5bn for six- and Rs212bn for 12-month papers. It was also noted that the government had raised less than the maturity amount during several auctions. The maturity amount on Jan 22 was Rs515bn, while the government raised Rs325.5bn against the au­­ction target of Rs350bn.\n\nBankers believe that the T-bill rates and KIBOR indicate a likely cut of 50-100bps on Jan 27. However, some suggest the SBP should pause and not reduce interest rates since inflation could rise due to many factors, including possible changes in global trade.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:53:48.863Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887080/govt-slashes-t-bill-rates-by-up-to-41bps",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:15:52.000Z"
}
