{
  "title": "Common standards sought for info on parliamentary websites - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Free and Fair Election Network (Fafen) has called for the standardisation of information and accessibility features across parliamentary websites as a prerequisite to enhance their usability and transparency.\n\nSuch reforms are essential not only to improve public engagement in the parliamentary processes but also as a key countermeasure against the spread of disinformation that undermines parliamentary work and democratic processes, Fafen notes in its latest report on Parliamentary Transpa­rency and Openness in Pakistan.\n\nWhile parliamentary websites in Pakistan have evolved into vibrant hubs of updated information, often outperforming the websites of many federal ministries and divisions, they still exhibit significant disparities in transparency, accessibility, and usability.\n\nSome platforms provide extensive legislative information, while others fail to meet even minimum standards. These inconsistencies restrict public access to critical information and exacerbate the risks of misinformation and disinformation in an already polarised political environment.\n\nSays such reforms are key countermeasure against spread of disinformation\n\nMoreover, a robust digital presence of legislatures aligns with Pakistan’s broader digital transition agenda and the government’s e-governance goals, as outlined in successive development plans.\n\nFafen urges the parliamentary leadership across all legislatures to develop and adopt common standards for information availability and presentation on their websites. These standards should emphasise enhanced transparency, user-frie­ndly design, and improved citizen engagement, enabling the public to access timely, accurate, and comprehensive legislative information.\n\nFafen’s report on Parliamentary Transparency and Openness assessed the availability, usability and accessibility of content and features on the official websites of Senate, National Assembly, and provincial assemblies of Baloch­istan, Khyber Pakhtunkhwa, Punjab and Sindh, employing the framework by the Inter-Parliam­entary Union (IPU) in its guidelines for parliamentary websites.\n\nThe recommendations offered in these guidelines were adapted to the Pakistani context. According to the assessment, the Senate website leads by ensuring the availability of over two-thirds (69 per cent) of the IPU-recommended information and features on its platform.\n\nPunjab Assembly closely follows with 64 per cent and the National Assembly 61 per cent adherence to the recommendations. These platforms provide more comprehensive and user-friendly access to legislative information, setting a higher benchmark for transparency and accessibility. However, the provincial assemblies of Khyber Pakhtun­khwa, Sindh and Baloc­histan significantly lag behind with 51 per cent, 40 per cent and 38 per cent scores, respectively.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/23104625144a05f.png",
  "retrievedAt": "2025-10-12T00:58:49.928Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887107/common-standards-sought-for-info-on-parliamentary-websites",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:32.000Z"
}
