{
  "title": "Relief convoy reaches Kurram amid heavy security - Pakistan - DAWN.COM",
  "author": null,
  "content": "• KP govt to convene jirga to highlight responsibilities of peace accord signatories\n• Military operation in parts of Kurram concludes after four days\n\nPESHAWAR / KURRAM: A convoy of 61 vehicles carrying relief supplies reached Kurram on Wednesday under tight security, officials confirmed.\n\nThe convoy, loaded with flour, medicines and vegetables, was escorted by police, district administration and security forces. It arrived in the Alizai area of the restive Kurram district via Bagan, the site of a deadly attack on a similar convoy on Jan 16, which claimed the lives of two security personnel and eight truck drivers.\n\n“The convoy left for Parachinar at 1pm. Anyone responsible for any untoward incident will be dealt with,” a source said.\n\nMeanwhile, the Khyber Pakhtun­khwa government announced plans to convene a jirga comprising signatories of the Dec 31, 2024, peace accord bet­ween warring factions in Kurram. The purpose is to remind them of their obligations to maintain law and order in the district.\n\nA meeting chaired by KP Chief Minister Ali Amin Khan Gandapur was attended by the provincial police chief, additional chief secretary (home) and other officials. According to an official statement, it was decided that the demolition of bunkers in the district would resume immediately, with regular monitoring of the process. Arrange­ments for temporarily displaced persons would also be prioritised.\n\nIt was stressed during the meeting that the political leadership and public representatives must take visible steps to restore peace. It also underscored a commitment to act against militants and extremists on both sides without discrimination.\n\nThe meeting resolved that both factions must submit a procedure for de-weaponising the district to the government as soon as possible. The district administration and police will lead efforts to arrest suspects named in FIRs, with support from other law enforcement agencies.\n\nThe government also decided to arrest elements disrupting peace and their facilitators, ensuring legal action against them. Special contingents may be deployed to secure the Kurram Road, and the police will finalise plans for temporary and permanent recruitment to maintain security.\n\n“Steps will be taken immediately for the restoration and beautification of Bagan Bazaar,” the statement noted, adding that a uniform narrative on the Kurram situation would be presented to the media and negative propaganda would be countered effectively.\n\nMilitary operation ends\n\nA military-led operation against miscreants in the Ochat, Charkhel, Dadka­mar and Zarana areas of Kurram concluded on We­d­n­esday after four days.\n\nThe district administration claimed to have confiscated a huge cache of arms and destroyed eight bunkers. Officials warned of strict action in case of any violations of the peace agreement.\n\nThe Thall-Parachinar Road has remained closed since Nov 21 following a deadly reprisal attack on a convoy of 200 passenger vehicles travelling from Para­chi­nar to Peshawar. The attack in Bagan claimed over 130 lives and sparked armed clashes between two groups.\n\nWithin 36 hours, Bagan Bazaar came under attack, resulting in over 500 shops and 600 houses being burned. The road’s closure has caused severe shortages of food and medicine in Kurram.\n\nA truce brokered by a KP government committee on Nov 23 was extended for seven days. A grand jirga later negotiated a fragile peace deal on Dec 31.\n\nHowever, the agreement suffered a major blow when a relief convoy was attacked on Jan 16, killing truck drivers and security personnel. This led to a military operation in Bagan on Jan 19.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:53:34.197Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887114/relief-convoy-reaches-kurram-amid-heavy-security",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:15.000Z"
}
