{
  "title": "47 Pakistani varsities in 2025 world rankings - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A total of 47 universities from Pakistan have made it to the Times Higher Education (THE) World University Rankings for 2025.\n\nQuaid-i-Azam University Islam­abad is ranked between 401 and 500 in the rankings, followed by several other institutions ranked between 601 and 800.\n\nThese include Air University Islamabad, Capital University of Science and Technology, COMSATS University Islamabad, Gove­rnment College University Faisalabad, National University of Sciences and Technology Islam­abad, Sukkur IBA University, University of Engineering and Technology Taxila and University of Malakand Dir Lower.\n\nAbdul Wali Khan University Mardan, International Islamic University Islamabad, Khwaja Fareed University of Engineering and Information Technology Rahim Yar Khan, Lahore University of Management Sciences, PMAS Arid Agriculture University Rawalpindi, The Islamia University of Bahawalpur, University of Central Punjab Lahore, University of Engineering and Technology Peshawar, University of Gujrat, University of Lahore, University of Management and Technology Lahore, University of the Punjab Lahore and University of Veterinary and Animal Sciences Lahore are ranked between 801 and 1000.\n\nTwelve universities are ranked between 1001 and 1200, eight others between 1201 and 1500, and five institutions fall in the 1501+ range. Another 48 universities are listed as “reporters,” meaning they provided the necessary data but did not meet the eligibility criteria for ranking.\n\nOxford retains top spot in Times Higher Education rankings for ninth consecutive year\n\nThe 2025 rankings include more than 2,000 institutions from 115 countries and territories.\n\nOxford remains in the top spot for the ninth consecutive year, aided by improvements in industry engagement and teaching. MIT has risen to second place, surpassing Stanford, which has dropped to sixth.\n\nChina is also edging closer to the top 10, enhancing its global research influence. Meanwhile, Australia’s top five universities have slipped in the rankings, reflecting a decline in reputation and international outlook. Three new countries — Brazil, Saudi Arabia and the United Arab Emirates — have joined the top 200, signaling the rise of emerging markets in higher education.\n\nThe rankings are based on the latest WUR 3.0 methodology, which uses 18 carefully calibrated indicators to assess institutions across five key areas — teaching, research environment, research quality, industry engagement and international outlook. The 2025 rankings feature 2,092 ranked universities, with 185 new entries compared to the previous year. In total, 472,694 data points were collected from 2,860 institutions that submitted data.\n\nPublished in Dawn, January 23rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/231503216b5b557.jpg",
  "retrievedAt": "2025-08-26T07:54:07.690Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1887089/47-pakistani-varsities-in-2025-world-rankings",
  "dateList": "2025-01-23",
  "date_published": "2025-01-23T02:14:24.000Z"
}
