{
  "title": "Sukkur Hyderabad Motorway to be completed in 30 months",
  "link": "https://www.app.com.pk/national/sukkur-hyderabad-motorway-to-be-completed-in-30-months/",
  "date_published": "2022-12-14T07:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP):A mega project of the National Highway Authority (NHA), Sukkur-Hyderabad Motorway (M6), would be completed in a record time of 30 months and it would be constructed according to international standards.\nTalking to APP here on Wednesday, an official of NHA said that the 15 interchanges, a major bridge over the Indus River, 19 overpass bridges, 82 bridges over canals, 6 flyovers, and 10 service areas would be constructed on a 306 km long mega project.\nHe said that along with Sukkur-Hyderabad Motorway, a service road of 61 kilometers will be constructed. He said the cost of the project would be Rs307 billion and after its completion, a maximum speed of 120 kilometers will be allowed.\nHe informed that the motorway will pass through the districts of Jamshoro, Hyderabad, Matiari, Benazirabad, Naushahro Feroze, Khairpur, and Sukkur. He said that after every 50 kilometers service and rest areas would be constructed on both sides of the motorway.\nHe said that the construction of M-6 was a long-standing demand of the people of Sindh, which was fulfilled during the current democratic government. He said that the government was striving to provide a solid infrastructure for development.\nHe said the construction and expansion of national highways were at the top of the priorities of the government. He said NHA was encouraging private sector involvement in the construction of structures and M-6 will also be constructed on a public-private partnership.\nHe highlighted that the speed of economic and social development will increase by providing new employment opportunities in the areas through which M-6 will be constructed.\nHe said the prominent feature of this highway is to provide the fastest transport facility according to international standards between Hyderabad and Sukkur. He said that agricultural commodities will get access to the markets of the entire region easily.\nHe underlined that with the completion of the project North-South commercial traffic and passenger movement will be fast and the path to reforms in industrial development will also be paved.",
  "retrievedAt": "2025-08-11T16:00:45.070Z"
}
