{
  "title": "No development in PTI govt sans renaming Nawaz Sharif’s era projects: Marriyum",
  "link": "https://www.app.com.pk/national/no-development-in-pti-govt-sans-renaming-nawaz-sharifs-era-projects-marriyum/",
  "date_published": "2022-12-14T16:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Wednesday said Imran Khan-led government had closed down several projects of the Pakistan Muslim League-Nawaz’s previous government and even renamed some of them which were inaugurated by the then prime minister Nawaz Sharif.\n“The Pakistan Tehreek-e-Insaf regime changed the name of the PML-N’s era Youth Programme with Kamyab Jawan Programme and shelved 80 per cent of its projects,” she said while addressing a news conference flanked by Prime Minister’s Special Assistant on Youth Affairs Shaza Fatima Khawaja.\nNawaz Sharif, as the prime minister, had launched the Prime Minister’s Youth Programme in 2013 to provide employment opportunities to young people, she added.\n“No ruler can achieve the objective of development by affixing their own nameplates on the existing projects,” the minister said sarcastically. The projects became successful if the same were launched with a focus on people’s welfare, she added.\nMarriyum said the PTI government would not have sent its political opponents to death cells in jails by filing fake cases if it had anything to do with political norms and values.\nShe said the nation fully knew how the PTI government ruined the national economy during its four-year tenure. It would have been better for the country had Imran Khan invited the heads of international firms to the Prime Minister’s House instead of (Daily Mail’s) David Rose to hatch a conspiracy against PM Shehbaz Sharif.\nThe minister said the PTI’s “propaganda group” was imposed on the country in 2018, which did not launch even a single new project for the country’s development and people’s welfare. Now, the same people were out to create chaos and political instability in the country to divert people’s attention from their four-year misrule marred by incompetency, inefficiency, theft, and corruption.\nThey were the people, who had tried to make the Youth Programme controversial at its launch by describing it as a political gimmick, Marriyum recalled.\nShe said PM Shehbaz Sharif revived the Prime Minister’s Youth Programme after taking charge of the office, with Shaza Fatima Khawaja assigned its responsibility as SAPM. It was being restarted while keeping in view the problems being faced by the youth in different sectors, she added.\nUnder the programme, small and large loans were also being revived, which were closed by the previous government, and the step would help provide job opportunities to over 50 million youth, between the age of 15 to 29 years, the minister said.\nMarriyum said there was also a plan to give innovation awards under the Prime Minister’s Youth Programme. Sports opportunities were also being created which would not only generate employment for the youth but also ensure their skill development, she maintained.\nIt was a positive programme for 68 percent of the population – the youth who could avail its facilities through its website pmyp.gov.pk, she said.\nMarriyum recalled that Shehbaz Sharif as Punjab chief minister had launched the laptop scheme in the province.\nShe said the projects like the China-Pakistan Economic Corridor, Health Card Scheme and Youth Programme were started during the Nawaz Sharif government, which were aimed at the country’s development, besides the provision of jobs to people.\nTo a query, she said in 2010, the then-prime minister issued orders to renovate two Pakistani buildings in Washington.One of them had been completely renovated and the Ministry of Foreign Affairs was working to rent it out, while the renovation of the second one could not be done as the United States government had terminated its diplomatic status in 2018.\nShe said Pakistan had paid some 1.3 million dollars as taxes for the two buildings since 2019. “If the second building is not sold then we will have to pay $ 100,000 per month,” the minister noted.\nShe said an inter-ministerial committee had decided to sell the building and the bidding had been done in a transparent manner which was higher than the previous one. The Federal Cabinet had decided to sell the building immediately so as to avoid payment of more taxes.\nHad such decisions been made in time, many things would have been different today, she remarked.\nTo another question, she said in 2013, the youth had voted for the PML-N in droves. However, during the past four years, the younger generation had been persistently incited by the PTI leaders towards chaos, anarchy and divisions in the country, she added.\nThe minister said the PTI did not sign any contract for the purchase of the liquefied natural gas though it was available at cheap prices during its four-year rule.\nMarriyum said the visit of the Tajikistan president to Pakistan was of sheer importance during which agreements would be signed in various sectors, including IT and trade, whose details would be shared with the media.",
  "retrievedAt": "2025-08-11T16:00:48.863Z"
}
