{
  "title": "Govt stabilizing inherited tattered economy with tireless efforts: PM",
  "link": "https://www.app.com.pk/national/govt-stabilizing-inherited-tattered-economy-with-tireless-efforts-pm/",
  "date_published": "2022-12-14T16:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP)):\nPrime Minister Muhammad Shehbaz Sharif on Wednesday said the government would fulfill its current programme with the International Monetary Fund (IMF), besides ensuring all possible facilitation to the exporters to boost the country’s exports.\nHe said the incumbent government had inherited an economy in ruins and in a miserable situation, but with consistent hard work, they had stabilized it.\nThe prime minister was addressing a high-level meeting over the economic situation held in the PM House. The meeting was attended by ministers for finance, economic division, planning, defence, the State Bank of Pakistan governor, presidents of Habib Bank and Alflah Bank, and other relevant authorities, the PM Office Media Wing said in a press release.\nThe meeting expressed concerns that during the tenure of the former government, the economic situation of the country had been in tatters with the worst mismanagement and destruction-like situation.\nWhen the former government came to power, the GDP during 2018, stood at 6.1 per cent, but instead of improving it, bad governance and economic mismanagement pushed the economy into a stalemate.\nThe meeting was of the view that in 2018, the public debt was Rs 25 trillion which during March 2022 and after a period of 42 months, reached Rs 44.5 trillion. Similarly, the incumbent government also inherited the economic indicators in bad shape.\nIt also shared that due to floods, the economic turnaround efforts felt the shocks, but still the government helped 33 million people despite the economic difficulties.\nThe meeting resolved that they would steer the country out of the economic challenges gradually like it had controlled the shortage of edibles, crops, and other essential goods during the period of floods.\nDuring the meeting, the country’s economic situation was deliberated comprehensively, besides the IMF ninth review, and steps to control the current account deficit were also discussed.\nThe prime minister, while reiterating to complete the IMF programme, directed the relevant authorities to take necessary steps to control the financial and current account deficits.\nHe also underlined the need for focusing on the required policy and administrative reforms in that regard.\nThe prime minister also directed for provision of all facilities to the exporters, necessary facilities at ports, identification of new markets, besides support in the import of raw material and machinery.\nHe said currently, the total volume of IT export was $2 billion which could be taken to $5 billion easily by extending facilities to entrepreneurs and startups.\nThe prime minister observed that overseas Pakistanis should be encouraged to send their remittances to the county through banking channels with the provision of facilities.\nHe also stressed on reforms in the energy sector with full concentration, adding that reduction in the circular debt was among the government’s top priorities.\nThe prime minister said besides enhancing power production, they needed to address the issue of circular debt.\n“We are required to make efforts for increasing and producing energy at indigenous level, so as to end dependence on import of fuel,” he added.\nThe prime minister noted that with the import of costly fuel, common people were burdened and they had to rid the public of this agony.\nHe directed for the running of a campaign to conserve energy with improvement in the general approach to its usage as its saving was a national requirement.\nThe prime minister also directed the federal ministries to ensure energy saving and overcome expenditures with austerity.",
  "retrievedAt": "2025-08-11T16:00:46.514Z"
}
