{
  "title": "Work on ‘Lawyers’ Protection Bill’ to be finalized with consultation: Law Minister",
  "link": "https://www.app.com.pk/national/work-on-lawyers-protection-bill-to-be-finalized-with-consultation-law-minister/",
  "date_published": "2022-12-14T13:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Federal Minister for Law and Justice Senator Azam Nazeer Tarar on Wednesday said that the work on the Lawyers’ Protection Bill was being continued in a rapid pace and consultations were being held with the provinces to finalize it.\nThe bill would be finalized after consultation with a six-member committee of all the provinces, Islamabad and Pakistan Bar Councils representatives, he said.\nThe minister expressed these views in a meeting held with a delegation of lawyers in the Ministry of Law and Justice, here, said a press release.\nThe delegation of lawyers included members of Pakistan Bar Council, Vice Chairman Islamabad Bar Council, Vice Chairman Khyber Pakhtunkhwa Bar Council, Vice Chairman Sindh Bar Council, Chairman Legal Education Committee Balochistan & Sindh Bar Councils and others.\nOn the assurances and promises of the minister, the lawyers’ delegation agreed to postpone the sit-in call in consultation.\nOn the demand to withdraw the review petition against Justice Qazi Faez Isa case, the law minister apprised that the approval had been obtained from the federal cabinet and the delegation of lawyers would be informed regarding further development on the matter.\nOn the demands regarding grants to the Bar Councils, the minister said that for the first time in the history of Pakistan, the lawyers grant had been made a part of the federal budget and finance bill.\nThe minister further assured that the meeting of the lawyers’ delegation would be arranged with Prime Minister Shehbaz Sharif and the demands of the lawyers would be presented before the latter.\nThe delegation of lawyers apprised the law minister about the other problems being faced by the lawyers. Meanwhile, the minister assured full cooperation and immediate steps to resolve their problems.\nIn a meeting, a detailed discussion was also held regarding the Bars Vocational Course in the light of the orders of the Supreme Court.",
  "retrievedAt": "2025-08-11T16:00:50.592Z"
}
