{
  "title": "Senate, Libya’s House of Representatives to set up coordination committees",
  "link": "https://www.app.com.pk/national/senate-libyas-house-of-representatives-to-set-up-coordination-committees/",
  "date_published": "2022-12-14T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): The Senate of Pakistan and Libya’s House of Representatives on Wednesday agreed to constitute a coordination committee on both sides in order to fix modalities, ensure implementation of memorandums of understanding (MoUs) signed in different areas, and further cement parliamentary relations between the two brotherly countries.\nThe delegation, led by Secretary General of the Parliament of Libya Abdualla Almasri Mussa, held a meeting here at the Parliament House with Senate Secretary Qasim Samad Khan, flanked by high officials including Additional Secretary Legislation, Additional Secretary IPR, and Director General Coordination.\nThe delegation was given a briefing about the overall structure, functioning, and hierarchy of the Senate Secretariat.\nQasim Samad Khan acquainted the delegation with the parliamentary system and its business. He committed that the Senate with all the available resources could help and support Libya in running their House of Representatives.\nHe reiterated the resolve for furnishing training to the legislators and officers of the Libyan Parliament at the Pakistan Institute of Parliamentary Services, saying the offer extended by Senate Chairman Muhammad Sadiq Sanjrani in that regard was still on the table.\nThe meeting stressed cooperating in different areas inter alia, including information technology, strengthening legislation, and helping each other at international forums, including the Asian Parliamentary Assembly (APA), Inter-Parliamentary Union (IPU), and PIUC.\nAbdualla said the partnership in various areas and high-level exchanges would strengthen the brotherly relations between the two countries.\nHe recommended setting up of a secretarial-level committee on both sides, which was welcomed by the Senate Secretary.\nBoth sides nominated their focal persons for the smooth running of the affairs of the coordination committee and fixing modalities discussed in the meeting.",
  "retrievedAt": "2025-08-11T16:00:49.260Z"
}
