{
  "title": "PM to announce loan schemes next week for youth, flood-affectees: Shiza Fatima",
  "link": "https://www.app.com.pk/national/pm-to-announce-loan-schemes-next-week-for-youth-flood-affectees-shiza-fatima/",
  "date_published": "2022-12-14T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 14 (APP): Special Assistant to Prime Minster on Youth Affairs Shiza Fatima on Wednesday informed that Prime Minister Shehbaz Sharif would announce loan schemes next week for the youth to set up their small businesses, and for flood-affected crops in the recent deluge.\nAddressing a press conference along with Minister for Information and Broadcasting Marriyum Aurangzeb, she said that the government had decided to announce a ‘national youth employment policy’, according to which around 2 million youth would be provided employment during the next year.\nShe said the government through the skill development programme would train one hundred thousand youth, whereas Rs 50 billion would be disbursed under agriculture loan schemes to help flood affectees and for the generation of employment.\nShe said the economic condition of the country was at its worst when Pakistan Muslim League (Nawaz) assumed power, adding the incumbent government took out the country of the ‘economic trap’.\nThe special assistant held that “youth is an asset for the country and to bring the country towards the path of growth is impossible without their support”.\nShe said the ‘Prime Minister Youth Programme’ was aimed to make the youth of the country an ‘invaluable asset’ and the said programme was ensuring the provision of small loans for the youth on easy terms since 2013. However, this programme was re-launched with minor changes.\nShe said youth from the age of 18 to 45 would be able to get benefits from the ‘Prime Minister Youth Programme’, whereas, under the new scheme, 25 per cent quota had been allocated for female youth.\nShe said the youth can apply for the loan under three different categories. The first category is of Rs, 500,000 loan on zero markup; the second category of loan is from Rs.500,000 to Rs. 15,00,000 which would be provided on a 5 per cent mark up; and under the third category, Rs. 15,00,000 to Rs  75,00,000 loan would be provided at a 7 percent mark up rate.\n“These loans are being given on easy terms for a period of 8 to 9 years,” said Shiza adding that applications for the loan can be downloaded from PM’s online portal and the government would ensure the processing of loans applications within 45 days.",
  "retrievedAt": "2025-08-11T16:00:49.179Z"
}
