{
  "title": "More than one-fifth of constituencies in draft delimitation exceed 10 % population variation: FAFEN",
  "link": "https://www.app.com.pk/national/more-than-one-fifth-of-constituencies-in-draft-delimitation-exceed-10-population-variation-fafen/",
  "date_published": "2023-09-30T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): Free and Fair Election Network (FAFEN) on Saturday revealed that as many as 180 constituencies of national and provincial assemblies as proposed by the Election Commission of Pakistan (ECP) do not meet the legal preferability of 10 per cent variation in the population, undermining the principle of equal suffrage that was otherwise upheld by the Parliament through latest amendments in the Elections Act, 2017.\nAccording to the amendments enacted on August 4, 2023, after parliamentary approval, the Election Commission was expected to disregard district boundaries to ensure that the variation among the population of an assembly’s constituencies does not ordinarily exceed 10 per cent, said a statement.\nThis variation among the population of constituencies may be identified by comparing the population of a constituency with the average population per seat of an assembly, also called quota per seat. The quota is calculated by dividing the population of a province, as determined by the last census officially published, by the number of seats of that province in national or provincial assemblies, as provided in the Constitution.\nThe quota for each National Assembly (NA) constituency for Khyber Pakhtunkhwa was calculated at 907,913, Islamabad Capital Territory 787,954, Punjab 905,595, Sindh 913,052 and Balochistan 930,900. Similarly, the Provincial Assembly (PA) seat quota for Khyber Pakhtunkhwa was established at 355,270, Punjab 429,929, Sindh 428,432, and Balochistan 292,047.\nAn analysis of the preliminary report of delimitation 2023 and draft lists of constituencies reflects that the parliamentary emphasis on minimizing the population variation was not extensively used to ensure the equality of votes in constituencies of an assembly.\nThe recently added provision in the law was only employed in delimiting 11 National Assembly constituencies – six in Khyber Pakhtunkhwa, three in Punjab, and two in Sindh – and one Punjab Assembly constituency. As a result, the number of constituencies with more than 10 per cent variation in population went up from 170 – 82 NA and 88 PAs – in 2022 delimitation to 180 – 83 NA and 97 PAs – in the 2023 draft lists of constituencies.\nThis means that more than one-fifth of the total constituencies demarcated do not comply with Section 20 (3) of the Elections Act, 2017. The proposed NA constituencies with more than 10 per cent population variation included 35 constituencies in Punjab, 22 in Sindh, 21 in Khyber Pakhtunkhwa, and five in Balochistan. Similarly, the PA constituencies included 30 in Khyber Pakhtunkhwa, 26 in Punjab, 25 in Balochistan, and 16 in Sindh.\nFAFEN believed that the issue of inequality of population among constituencies of an Assembly has persisted as the ECP did not update Rules 10 (4) and 10 (5) of the Election Rules 2017 to reflect the spirit of Section 20(3) provisioned by the recent amendment that reads, “it shall not be necessary to strictly adhere to the existing district boundaries in exceptional cases.” However, a proviso under Rule 10 (5) of the Elections Rules 2017 allows the ECP to calculate the quota for determining population variation by dividing the total population of the district by number of seats allocated to that district.\nAs a result, the largest NA constituency NA-39 Bannu has a population of 1,357,890, which is nearly three times bigger than the smallest constituency, NA-1 Chitral Upper-cum-Chitral Lower with a population of 515,935. Similarly, the largest proposed NA constituency in Punjab is NA-49 Attock-I with a population of 1,126,142, against the smallest NA-61 Jhelum-II having a population of 690,683. In Sindh, NA-209 Sanghar-I is proposed to have a population of 1,172,516, while NA-221 Tando Muhammad Khan is carved out a population of 726,119. In Balochistan, NA-255 Sohbatpur-cum-Jaffarabad-cum-Usta Muhammad-cum-Nasirabad has a population of 1,124,567 in contrast NA-261 Quetta-I has a population of 799,886.\nFor the PAs, Khyber Pakhtunkhwa’s largest constituency PK-93 Hangu (528,902) hosts almost three times the population of the smallest i.e., PK-1 Upper Chitral (195,528). Similarly, the largest PA constituency in Sindh, PS-75 Thatta-I has a population of 556,767, while PS-79 Jamshoro-II is the smallest with a population of 354,505. Punjab’s largest PA constituency, PP-177 Kasur-III has a population of 510,875, while the smallest PP-84 Khushab-IV has a population of 359,367. In Balochistan, PB-51 Chaman with a population of 466,218 is the largest constituency, which is two and a half times bigger than the smallest constituency i.e. PB-23 Awaran with a population of 178,958.\nSuch inequalities in the constituencies’ population may potentially result in a greater number of representations by voters. FAFEN calls upon the Election Commission to enhance the voter-friendliness of the process of filing representations on the draft constituencies. Currently, every voter seeking to file a representation on delimitation has to travel to Islamabad for its submission and subsequently for hearings at the ECP Secretariat, which bears additional costs and efforts. ECP may consider allowing submission of the representation at its district, regional, and provincial offices.\nSimilarly, the hearings on these representations may be arranged at the provincial level. FAFEN also urges the ECP to direct the Pakistan Bureau of Statistics (PBS) to promptly publish on its website the census block-wise data of population as under Rule 12(2), voters would require this data for filing representations.",
  "retrievedAt": "2025-08-11T09:53:36.921Z"
}
