{
  "title": "PTI lawyer booked for assaulting PML-N Senator on TV Show",
  "link": "https://www.app.com.pk/national/pti-lawyer-booked-for-assaulting-pml-n-senator-on-tv-show/",
  "date_published": "2023-09-30T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 30 (APP): PTI lawyer, Sher Afzal Khan Marwat, has been booked in a case for physically assaulting Pakistan Muslim League-Nawaz (PML-N) Senator Dr Afnan Ullah Khan during a live TV show.\nThe incident, which took place on the set of a private television channel, was caught on camera and went viral on social media. The first information report (FIR) was lodged by Senator Dr. Afnan Ullah Khan at Islamabad’s Aabpara Police Station. In the FIR, he stated that Marwat attacked him during the talk show, where he had been invited as a guest. The senator alleged that Marwat threatened to kill him and provided evidence of the incident, including videos.\nAccording to the FIR, “During the heated debate, Sher Afzal Marwat suddenly attacked me and tried to hit me and also threatened that I will face consequences and he will not spare me and gave life threats.”\nDr. Afnan Ullah Khan also mentioned that Sher Afzal Marwat posted about the attack on social media platform X, formerly known as Twitter.\nThe scuffle between the two political leaders began with a heated argument and escalated into the use of abusive language. It eventually led to physical violence, with both Marwat and the senator pushing, slapping, and punching each other. The TV show crew had to intervene to separate them.\nBoth parties confirmed the incident, which was widely shared on social media. Senator Dr. Afnan Ullah Khan stated that Marwat attacked him and emphasized that he does not believe in violence but is a “soldier of Nawaz Sharif.”\nMarwat, in his response, accused the TV show host of spreading misinformation about the incident and claimed that Senator Afnan Ullah Khan had run away and sought shelter in a nearby room.\nThe incident has sparked legal controversy, with Senator Afnan Ullah Khan seeking legal action against Sher Afzal Khan Marwat, while Marwat plans to initiate a defamation case and criminal complaint against the senator.",
  "retrievedAt": "2025-08-11T09:53:37.025Z"
}
