{
  "title": "Institutions are guardians of national security, not for fulfilling Imran’s ‘nefarious political agenda’: Marriyum",
  "link": "https://www.app.com.pk/national/institutions-are-guardians-of-national-security-not-for-fulfilling-imrans-nefarious-political-agenda-marriyum/",
  "date_published": "2022-10-03T17:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 3 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb Aurangzeb on Monday said the national institutions were guardians of national security and defence, and not “personal guards” of former prime minister Imran Khan who had termed them “watchmen”.\nThe state institutions were not there to help Imran Khan to come back to power, though his entire politics was based on “crutches” and he was again trying to get back the same but to no avail, she said while addressing a presser.\nThe minister alleged that Imran desired the institutions “to violate their constitutional oath and become part of his game”. The nation, however, would never forgive “the foreign agent, conspirator and liar”, who, she claimed, had played with the national security and violated the Constitution.\n“There is a need to make an example out of Imran Khan so that in future no one could play with the national interests and the Constitution,” she added.\nMarriyum said during the past two months, Prime Minister Shehbaz Sharif had worked day and night to personally supervise the relief and rehabilitation activities in the flood affected areas.\nThe unprecedented floods had caused catastrophic losses and it seemed difficult to cope with the ravage, but the prime minister, the armed forces, provincial governments, the National Disaster Management Authority (NDMA) and the civil society were making concerted efforts to provide relief to the flood victims, she added. Besides, she said, friendly countries had also supported Pakistan in the hour of need for which “we are grateful to them”.\nShe pointed out that during the prime minister’s recent visits to the United States and Uzbekistan for Shanghai Cooperation Organization summit and United Nations General Assembly session, the focus of his activities remained on floods.\nThe minister said joint surveys were being carried out with the cooperation of local governments for providing assistance to the affected people in the reconstruction process.\nMarriyum said at the time when PM Shehbaz was busy in flood relief activities, audio leaks of another person who remained the country’s chief executive for nearly four years, were surfacing.\nPreempting his ouster from power, she said, Imran Khan waived a paper at a rally on March 27 claiming that a foreign conspiracy”, as he could be heard repeatedly saying,”we have to play with this cipher”.\nShe said the cipher was sent on March 7, received at the Foreign Office on March 8, and the Prime Minister House sought its copy on March 9. It was astonishing as to why the then PM did not inform the nation about the so-called conspiracy against his government instantly, she added.\n“Imran Khan, however, staged the drama of conspiracy on March 27 when he realized that the no-confidence motion against him would succeed as his allies had decided to part their ways with him.”\nShe alleged that a “thief, corrupt and incompetent” Imran Khan had destroyed the country’s economy, made a deal on Kashmir, and created chaos and anarchy in the country.\nThe minister said as per the leaked audios, Imran Khan had decided to “play with the cipher”, but was not ready to mention the name of the conspiring country. It was agreed to hold a meeting on the cipher, with minutes containing the word “conspiracy”, but the audios had exposed his drama, she added.\nMarriyum said the first audio was leaked on September 27, and the second one surfaced September 30, which had the conversation about convening of the meeting of the then foreign minister, foreign secretary and three to four ministers on the cipher, and as to how its minutes were to be prepared.\nThe September 30 audio leak also revealed that the cipher would be called as a letter, she added.\nTaking a jibe at Imran Khan, she said those who had been struggling for “real freedom” were saying in the audio leak that they would not dare to mention the name of the country, which they would blame for the so-called conspiracy.\n“Imran Khan repeatedly said in the audio leak that the name of America should not come out of our mouths,”, the minister said.\nThe minister claimed that Imran Khan knew that he was playing with the country’s interests, national security and the Constitution by doing politics over the cipher. “Imran Khan misled the nation, and played with the national security and interests,” she added.\nHe said Imran Khan had befooled the people, tried to spread anarchy in the country, he dissolved the National Assembly and violated the Constitution for his own interests , but he was not even ashamed that he played with the country for the sake of his political gains and thirst for power.\n“Why is Imran Khan afraid (of arrest) today, while he kept his political opponents in jails for four years,” the minister said.\nBesides, he had filed references against the opposition leaders in courts, and misused state power to victimize them, and all that in nexus with NAB, she added.\nFor Imran Khan  the sensitive issue of national security was just a political one, she said, citing the Secrecy Act which stated that the cipher could not be made public.\nShe said Imran Khan had not denied his two audio leaks which seemed to be confession.\n“Imran Niazi jailed political opponents, used Tayyaba Gul’s video, blackmailed NAB chairman and created NAB-Niazi nexus to achieve his ulterior motives,” she stressed.\nThe minister said there was concrete evidence against Imran Khan, and the Federal Cabinet had discussed it in detail and a sub-committee cabinet was formed in this regard.\nShe said the sub-committee had decided that the matter fells under the purview of criminal investigation. “This matter will be brought to a logical conclusion by conducting a thorough investigation,” she maintained.\nShe said that Imran Khan’s recent audio leaks were of the time  when he was in the prime minister’s chair. Imran should have known that such games leave a bad impact on foreign relations and national security matters.\nPakistan was facing the consequences of his antics, the minister regretted.\nThe video of Imran Khan’s remarks about missing of cipher in an interview with private news was also played during the press conference.\nMarriyum said Imran  had a copy of  the cipher but now it’s gone missing. “This is the document on which the entire game was played, the constitution was violated, the National Assembly was dissolved,” she added.\nMarriyum said  that Imran Khan received  this copy in the Prime Minister House and took it with him and today he claimed that he did not know its whereabouts.\nShe questioned  if such a person should  not be called a traitor, then what should be called.\nShe said that Imran Khan had made a mockery of the country,befooled the people, used the state of Madinah and the holy terms  like Amr-bil-Maluf for his political motives.\nMarriyum  said that Imran Khan was thrown out of power through a democratic process.\nShe said  that Imran Khan threatened the institutions every day, shouted at judges and then apologized.\nShe said that Imran Khan was a loser and a liar.",
  "retrievedAt": "2025-08-11T15:40:08.272Z"
}
