{
  "title": "President receives credentials from ambassadors-designate of Denmark, Switzerland, others",
  "link": "https://www.app.com.pk/national/president-receives-credentials-from-ambassadors-designate-of-denmark-switzerland-others/",
  "date_published": "2022-10-03T12:17:00.000Z",
  "source": "APP",
  "content": "President Dr Arif Alvi on Monday received the diplomatic credentials of the ambassadors-designate of Netherlands, Denmark, Switzerland, Finland, Zimbabwe and Senegal at a Presentation of Credentials Ceremony here at Aiwan-e-Sadr.\nAmbassador of the Kingdom of Netherlands Henny Fokel de Vries, Ambassador of the Kingdom of Denmark Jakob Linulf, Ambassador of Switzerland Georg Steiner, Ambassador of Finland Hannu Ripatti, Non-Resident High Commissioner of Zimbabwe Lt Gen (Retd) Martin Chedondo, and Non-Resident Ambassador of Senegal Saliou Niang Dieng presented their credentials and also made separate calls on the president.\nTalking to the ambassador of the Netherlands, the president said that Pakistan desired to forge a long-term and multi-dimensional partnership with the Netherlands, especially in the fields of trade, agriculture, investment, energy, culture, education and people-to-people contacts.\nHe said that the Netherlands had become the second largest export destination for Pakistani products in the European Union (EU) with a bilateral trade volume of USD 2.3 billion.\nHe expressed the hope that the Netherlands would continue to extend its support for Pakistan’s GSP plus.\nTalking to the Danish ambassador, the president said that Pakistan desired to further strengthen relations with Denmark in all spheres, especially in political, economic, trade, investment and defence fields.\nHe proposed that Pakistani tech companies could offer their cost-effective and high-quality services and products to Denmark.\nThe president highlighted the importance of ease of travelling between the two countries for further improving the bilateral economic relations as well as people-to-people contacts.\nTalking to the Swiss ambassador, the president said that Pakistan highly valued its partnership with Switzerland in economy, trade and commerce as well as in the sphere of socio-economic development and humanitarian assistance.\nHe said that Swiss companies could invest in Pakistan’s tourism sector which had great potential to attract tourism traffic from across the globe.\nPresident Alvi said Pakistan could learn from Switzerland’s highly developed tourism and hospitality industry, besides benefitting from Swiss expertise to train human resources connected with the tourism industry.\nTalking to the ambassador of Finland, the president urged the need to enhance interactions between the business communities as well as the Chambers of Commerce and Industry of the two countries to fully achieve the potential of bilateral trade volume.\nHe said that Pakistan would welcome Finnish expertise in the transport sector, including environmentally sustainable transport technologies.\nTalking to the high commissioner of Zimbabwe, the president expressed Pakistan’s desire to enhance cooperation in the agricultural, pharmaceutical and defence sectors.\nHe also underlined the need for enhancing bilateral trade volume to its fullest potential.\nTalking to the ambassador of Senegal, the president said that Pakistan considered Senegal an important country in the West African region, and expressed satisfaction over the excellent state of relations between the two countries\nDuring the meetings, the president emphasised the need for further strengthening the international partnerships for countering climate change and moving toward the goal of zero emission of greenhouse gases.\nHe said that the international community should commit itself to help the most vulnerable countries, including Pakistan, to improve their capacity and resilience to mitigate the effects of climate change-induced disasters.\nHe briefed the envoys on the recent catastrophic super floods caused by the emission of greenhouse gases where Pakistan’s contribution was less than 1% but it was facing the brunt of climate change in the form of unprecedented floods, forest fires, heat waves and droughts.\nPresident Alvi thanked the international community for its continued support for Pakistan during the recent floods and expressed the hope that the international community would further step up its contribution to relief and rehabilitation of the flood-hit population and reconstruction of lost infrastructure.",
  "retrievedAt": "2025-08-11T15:40:16.561Z"
}
