{
  "title": "Pakistan greets China on 76th National Day, reaffirms strategic partnership",
  "author": null,
  "content": "ISLAMABAD, Oct 01 (APP):Federal Interior Minister Mohsin Naqvi has extended heartfelt felicitations to the leadership, Communist Party, and people of the People’s Republic of China on the occasion of its 76th National Day, praising Beijing’s remarkable journey of progress and its steadfast support to Pakistan.\nIn his message, Naqvi lauded the Chinese leadership for achieving economic stability and sustainable development within a short span, noting that “with perseverance, adherence to principles, and a spirit of collective welfare, China has attained a distinguished place among the comity of nations.”\nHe described China’s extraordinary accomplishments in economic, social, and military spheres as a source of regional development and stability.\nPaying tribute to China’s “glorious history, cultural heritage, and astonishing progress,” Naqvi reaffirmed Pakistan’s unwavering friendship and historic bond with its “iron brother.”\nThe minister highlighted that Pakistan-China relations are rooted in strategic partnership, citing the China-Pakistan Economic Corridor (CPEC) as a shining example of bilateral cooperation.\n“From the towering peaks of the Himalayas to the rugged Karakoram and the depths of the seas, the everlasting friendship between Pakistan and China stands as a testimony of trust and resilience,” he remarked.\nNaqvi underscored that China has always stood by Pakistan during crises, regional tensions, and domestic challenges, adding that ties with Beijing form a permanent and central pillar of Pakistan’s foreign policy.\n“From Gwadar to Khunjerab, from energy to communications, China has played a key role in strengthening Pakistan’s economic foundations,” he noted, while stressing that the Pakistan-China strategic partnership remains vital for ensuring balance and development in the region.\nSaluting the dedication, hard work, and innovation of the Chinese nation on its National Day, Naqvi prayed for China’s continued progress, prosperity, and global rise.\n“Long live Pakistan-China friendship,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:43:33.956Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-greets-china-on-76th-national-day-reaffirms-strategic-partnership/",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T13:16:00.000Z"
}
