{
  "title": "PAL hosts 57th session of ‘Chai, Kitabein Aur Baatein’",
  "author": null,
  "content": "ISLAMABAD, Oct 01 (APP):The Pakistan Academy of Letters (PAL), Wednesday hosted the 57th informal session of its popular weekly literary series “Chai, Kitaabain Aur Baatain” at its premises, bringing together members of the literary and artistic community.\nThe session was presided over by the Academy’s Director and Chief Editor, Muhammad Asim Butt, who warmly welcomed poets, writers, and notable personalities from the arts and literary circles.\nThis week’s gathering was dedicated to celebrating the literary contributions of renowned author, poet, novelist, columnist, and Tv drama writer Shoaib Khaliq, with a special focus on his newly released novel “Jism Aik Jazeera”, recently published by Sang-e-Meel publications.\nSpeaking about his novel, Shoaib Khaliq shared that he wrote the entire novel in indirect speech.\n“The aim behind writing this novel was to highlight one of the most pressing issues of our time — how smart phones and modern technology are adversely affecting human relationships by weakening interpersonal communication and diminishing the beauty of real human connections,” he explained.\nKhaliq further described Jism Aik Jazeera as a blend of real-time events and fictional storytelling, offering readers a layered and thought-provoking experience.\nAttendees praised Shoaib Khaliq for his insightful and timely contribution to contemporary literature, lauding both his latest work and his longstanding contributions to the literary world and drama industry. Many expressed hopes that the novel would receive an overwhelming response and set new records, owing to its unique theme and approach.\nConcluding the session, Director Muhammad Asim Butt extended heartfelt thanks to all participants for their valuable time and presence.\nProminent literary figures in attendance included Habib Chaudhary, Daud Kaif, Dr. Samina Akhtar, Shoaib Khan, Mehr-un-Nisa, Maha Khan, Muhammad Wasim Faqeer, Hamza Hussain Sheikh, and Hameed Qaiser, among others.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:42:46.167Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pal-hosts-57th-session-of-chai-kitabein-aur-baatein/",
  "dateList": "2025-10-01",
  "date_published": "2025-10-01T18:19:00.000Z"
}
