{
  "article_id": "2025-01-24_3169fd3857e2064307c94d2bb6a19c1c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistans-foreign-policy-intact-and-in-place-bilawal/",
    "retrieved_at": "2025-08-27T12:00:03.853Z"
  },
  "metadata": {
    "title": "Pakistan’s foreign policy intact and in place: Bilawal",
    "author": null,
    "date_published": "2025-01-24T11:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 24 (APP):Chairman of the Pakistan Peoples Party (PPP), Bilawal Bhutto Zardari, on Friday asserted that Pakistan's foreign policy is intact and in place. Speaking informally with journalists at the Parliament House, he said that Pakistan's nuclear and missile technology are gifts from Shaheed Zulfikar Ali Bhutto and Shaheed Mohtarma Benazir Bhutto. He categorically said that the PPP would never compromise on these strategic assets. Bilawal dismissed the question when asked about attending former US President Donald Trump's inauguration, stating, \"This was a topic circulated by the media; one should direct this query to them.\" He clarified, \"I am attending the breakfast event as a tradition of the PPP. I hold no official position, so I do not plan formal meetings with US authorities. However, I intend to connect with Shaheed Mohtarma Benazir Bhutto's friends.\" Regarding speculation about the PPP joining the government, Bilawal denied any such intention. Commenting on the Prevention of Electronic Crimes Act (PECA), Bilawal highlighted the PPP's consistent opposition to the ordinance during the PTI government. \"Our opposition was constructive, as we provided input that was incorporated into the legislation. The final draft reflects our efforts to improve the law,\" he said. He underscored the importance of engaging with other political parties and consulting journalists' organizations during the legislative process. \"It would have been better to involve representatives from media and digital platforms when the legislation was at the committee level,\" he said. Bilawal reaffirmed the parliament's exclusive authority over constitutional amendments, such as the 26th Amendment. \"Only the parliament has the power to roll back such amendments,\" he asserted.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}