{
  "article_id": "2025-01-24_12edae371a2b991757b12ef9f8851576",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/govt-resolved-to-equip-youth-with-skills-as-per-global-market-demand-pm/",
    "retrieved_at": "2025-08-27T12:00:10.865Z"
  },
  "metadata": {
    "title": "Govt resolved to equip youth with skills as per global market demand: PM",
    "author": null,
    "date_published": "2025-01-24T07:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 203,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 24 (APP): Prime Minister Shehbaz Sharif on Friday said that the incumbent government was resolved to equip the country's youth with modern skills to cope with the global market's demand. The prime minister, in a meeting with Vice Chancellor of University of London Wendy Thomson, who called on him here, said that Pakistan's youth were capable of proving their mettle in all fields of life and bringing laurels to the country. He told the visiting dignitary that the Pakistani nationals were serving the international market having graduated from the University of London and other globally renowned institutions. The prime minister said that the government had introduced various programs including merit-based foreign scholarships and employment, and was also formulating new strategies in this regard. Vice Chancellor Wendy Thomson appreciated Prime Minister Shehbaz for the recent initiatives taken by his government to promote education in the country. Minister for Information and Broadcasting Attaullah Tarar, Economic Affairs Minister Ahad Khan Cheema and other relevant senior officers attended the meeting. Ishtiaq Ahmed, APP's Foreign Editor, leads coverage of the Prime Minister, President and Foreign Office, bringing over 20 years of journalism experience from local and international publications - Reach out at 03335293238/ ishtiaqrao@gmail.com/ X: ishtiaqrao",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}