{
  "article_id": "2025-01-24_542d77a4ea4086ca445f7c1771e82c04",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cabinet-committee-briefed-on-rightsizing-of-revenue-division-mopass/",
    "retrieved_at": "2025-08-27T12:00:07.278Z"
  },
  "metadata": {
    "title": "Cabinet Committee briefed on rightsizing of Revenue Division, MoPA&SS",
    "author": null,
    "date_published": "2025-01-24T10:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 397,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 24 (APP):The Cabinet Committee on Rightsizing of the Federal Government was given detailed presentations here on Friday by Revenue Division and the Ministry of Poverty Alleviation & Social Safety (MoPA&SS) regarding their mandates, organizational structures, budget allocations, expenditures, and the impact of their work on public services. The meeting of the federal committee was virtually chaired by Federal Minister for Finance and Revenue, Senator Muhammad Aurangzeb, from Davos, Switzerland, according to press release issued by finance ministry here. Representatives from Revenue Division highlighted key aspects of the Federal Board of Revenue (FBR) transformation plan, focusing on initiatives designed to modernize the Customs Department. The transformation plan, approved by the Prime Minister on September 19, 2024, aims to improve operations, including automation and technology integration, such as the Faceless Customs Assessment and Examination. The Rightsizing Committee was briefed on steps taken by the Division to streamline operations, including the abolition of 158 posts (BS-18 and below) and the designation of 27 posts (BS-16 to 20) as \"dying posts\" as part of the Cabinet decision on August 27, 2024. In response to challenges faced by the FBR, the Revenue Division proposed a one-time dispensation from the requirement to abolish 60% of vacant posts within its field formations. Senator Aurangzeb acknowledged the challenges the FBR had faced due to under-investment over the years and reiterated the importance of embracing technological advancements, such as the implementation of automation systems, to improve efficiency and service delivery. The Ministry of Poverty Alleviation & Social Safety also presented its work, which spans across multiple departments with overlapping functions. The Minister remarked that while much progress had been made, the fragmented approach to various departmental verticals had hindered scaling up the impact on public policy outcomes and public service delivery. The Chair commended the presentation and emphasized the need for a more integrated approach. The Minister tasked the sub-committee of the Rightsizing Committee with conducting a thorough review of both the Revenue Division and the Ministry of Poverty Alleviation & Social Safety to better assess the structure, functions, and efficiencies of these federal government organs. The sub-committee will engage with both entities to identify opportunities for improved public service outcomes in line with the committee's mandate. The meeting concluded with a clear directive for a follow-up examination, with a focus on rightsizing measures that ensure effectiveness, better service delivery, and sustainable public policies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}