{
  "article_id": "2025-01-24_843a5c56159f4c57c7a32d9816649daf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-navy-ships-visit-oman-during-overseas-deployment/",
    "retrieved_at": "2025-08-27T11:59:18.437Z"
  },
  "metadata": {
    "title": "Pakistan Navy ships visit Oman during overseas deployment",
    "author": null,
    "date_published": "2025-01-24T13:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 24 (APP): Pakistan Navy Ships TABUK and RAH NAWARD visited Port Sultan Qaboos, Muscat, Oman. Upon arrival at the port, Pakistan Navy ships were warmly received by Omani authorities according to a news release issued by Director General Public Relations (Navy). During the visit, the Mission Commander, along with the Commanding Officers, held meetings with the naval leadership of Oman. He called on Director General Ops and Plans Royal Navy of Oman, Commander Maritime Security Centre and Commandant Said Bin Sultan Naval Base. During these interactions, matters of mutual interest, Navy-to-Navy engagements, and cooperation in maritime security were discussed. Ambassadors, diplomats and Military Attaches of various countries also visited the ships. Pakistan Navy Ships were opened for visitors, wherein a large number of Pakistani community including students from Pakistan School, Muscat visited onboard PN ships. Following the port call, PNS TABUK conducted a Passage Exercise with a Royal Oman Navy ship AL SHAMIKH. The exercise at sea aimed to enhance interoperability between the two navies and promote shared learning through coordinated activities. Pakistan and Oman are maritime neighbours and frequent visits of dignitaries, port calls by ships, joint exercises and coordinated patrols are regular features. The visit of PNS TABUK and RAH NAWARD will further strengthen bilateral relations between the two navies.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}