{
  "article_id": "2025-01-24_707739044e471c23c1af15efd793e927",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dr-aafia-siddiquis-mercy-appeal-rejected-in-us-ihc-told/",
    "retrieved_at": "2025-08-27T11:59:19.495Z"
  },
  "metadata": {
    "title": "Dr. Aafia Siddiqui’s mercy appeal rejected in US: IHC told",
    "author": null,
    "date_published": "2025-01-24T14:36:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 228,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 24 (APP):The Islamabad High Court (IHC) was informed on Friday that former US President Joe Biden had rejected the appeal of mercy for release and repatriation of Dr. Aafia Siddiqui. Justice Sardar Ijaz Ishaq Khan of IHC heard the case regarding the release of Dr. Aafia from a US jail. During the course of proceeding, Dr. Fawzia Siddiqui and her American lawyer Clive Smith appeared in the court through video link, while the petitioner's lawyer Imran Shafiq and the Additional Attorney General were also present in the court. The lawyer told the court that former US President Joe Biden rejected Dr. Aafia Siddiqui's mercy plea. During the hearing, the court was also informed that the US has refused to sign an agreement with Pakistan for the release of prisoners. Justice Sardar Ijaz Ishaq Khan remarked that the US is showing us our worth. The former US President pardoned his son's sentence but did not release our prisoner. On the occasion, reports containing details of the foreign visits of the Prime Minister and Foreign Minister were presented in the court. The Foreign Office also submitted the answer regarding not attending the meetings related to Dr. Aafia by Pakistani Ambassador to the US. The Ministry of Foreign Affairs submitted a report containing answers to court questions. The court then adjourned the hearing of the case for two weeks.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}