{
  "article_id": "2025-06-21_2c6fb66b981caa52916b28a3cd9efa3f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sarfraz-bugti-vows-no-compromise-on-balochistans-rights-focuses-all-sector-in-budget-2025-26/",
    "retrieved_at": "2025-08-27T16:19:13.927Z"
  },
  "metadata": {
    "title": "Sarfraz Bugti vows no compromise on Balochistan’s rights, focuses all sector in budget 2025-26",
    "author": null,
    "date_published": "2025-06-21T16:57:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 429,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 21 (APP):Balochistan Chief Minister (CM) Mir Sarfraz Bugti on Saturday reaffirmed his government's commitment to protecting the province's rights, stating that there would be no compromise on Balochistan's interests. He described the opposition's walkout from the assembly session as part of the democratic process and assured that the concerns of the people of Khuzdar would be addressed. Speaking during the Balochistan Assembly's budget session chaired by Speaker Abdul Khaliq Achakzai, CM Bugti responded to the opposition's protest over the exclusion of the Jhalawan Medical College Khuzdar project from the Provincial Public Sector Development Program (PSDP). He assured the house that a detailed briefing would be conducted on the matter, after which a formal policy statement would be issued. He emphasized that no development scheme would be ignored and the government would ensure no party suffers a loss. Earlier in the session, lawmakers from both treasury and opposition benches presented their recommendations on the provincial budget. The opposition staged a walkout in protest against the removal of the Jhalawan Medical College project from the PSDP. However, they later returned and rejoined the proceedings. Provincial Minister for Planning and Development Zahoor Buledi described the budget as balanced and said it focuses on social protection programs, youth empowerment through loans and employment opportunities, and development across the province. He added that along with power plants, fertilizer production units would be also established. A fund of Rs 200 million has been allocated to address water scarcity in Gwadar. Despite Washuk being an opposition stronghold, the district has been granted a development package worth Rs 5 billion, Buledi noted. Similarly, Rs 5 billion has been allocated for renewable energy projects, and Rs 3 billion has been earmarked for affordable transportation facilities in Quetta. \"This government is committed to the development of the common man,\" he said, adding that the province is no longer being criticized for underutilizing development funds as was the case in the past. During the debate, National Party parliamentary leader Dr Abdul Malik Baloch criticized the removal of Jhalawan Medical College from the budget, calling it a dangerous decision. He urged the finance ministry to provide the full PSDP book to the members and follow the proper legislative procedures. Other lawmakers including Mir Younus Zahri, Zamrak Khan Achakzai, Rehmat Saleh Baloch, and Ghulam Dastagir Badini also presented their suggestions on the budget. During the session, prayers (Fateha) were also offered for the late mother of Supreme Court Justice Jamal Khan Mandokhail and for Dr Siddique Ullah Tareen. The session of the Balochistan Assembly was later adjourned until June 23.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}