{
  "article_id": "2025-06-21_5cd4312088dd16c1e4cb2c0388ecbc67",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/omani-bikers-enjoy-traditional-hospitality-in-sargodhas-tehsil-bhalwal/",
    "retrieved_at": "2025-08-27T16:19:01.228Z"
  },
  "metadata": {
    "title": "Omani bikers enjoy traditional hospitality in Sargodha’s tehsil Bhalwal",
    "author": null,
    "date_published": "2025-06-21T11:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 366,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "SARGODHA, June 21 (APP): Members of the Oman's Busher Biker Club visited on Saturday Sultan Farm House at Chak No 5 SB of tehsil Bhalwal, Sargodha, where they received a warm and traditional welcome by local hosts. A special event was organized in their honour featuring horse riding, tent pegging, and a captivating horse dance, showcasing the vibrant cultural heritage of Sargodha district. The program was organized under the supervision of Kashif Iqbal Gujjar, while Usman Hashmi, a prominent overseas Pakistani residing in Oman, also participated alongside other distinguished guests. The Omani bikers appreciated the warm hospitality extended to them and lauded the rich cultural traditions, natural beauty, and the friendly nature of the Pakistani people. They particularly praised the lush agricultural landscapes and pleasant atmosphere of the Sargodha district. Talking to APP, Mohammed Al-Nabhani, a member of the Busher Bikers Club, expressed his admiration for the deep-rooted ties between Oman and Pakistan, terming such visits as a powerful symbol of growing cultural exchange and people-to-people contact. He also commended the Pakistani government's initiatives to promote tourism and preserve cultural values. The visiting delegation encouraged other Omani citizens and international tourists to explore Pakistan and experience its unmatched cultural richness and natural beauty firsthand. Prominent overseas Pakistani residing in Oman, Usman Hashmi, said that the visit of Omani bikers to Pakistan would play a vital role in strengthening people-to-people contacts and promoting cultural exchanges between the two brotherly nations. He said the presence of Omani bikers in Pakistan reflects a significant step toward the promotion of tourism and cultural relations between the two countries. The delegation includes Issa Al-Hasani, Mohammed Al-Nabhani, Kamil Al-Wahbi, Majid Al-Rawahi, Mohammed Al-Minini, Majid Al-Wahabi, and Mohammed Al-Rawahi. The goodwill visit is part of a broader initiative planned under the patronage of the Embassy of Pakistan in Oman to foster bilateral ties. The journey to Pakistan is a visionary effort led by Atif Ali, a Pakistani national residing in Oman. The initiative aims to arrange a cultural and diplomatic motorcycle journey of Omani bikers to Pakistan, contributing to deepening brotherly relations between the two countries. This project also seeks to promote unity, friendship, and regional cooperation in a modern and meaningful way.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}