{
  "title": "India temple stampede kills 9 in Andhra Pradesh",
  "author": "AFP | Reuters",
  "content": "At least nine people were crushed to death after a massive crowd surge at a Hindu temple in southern India’s Andhra Pradesh on Saturday, state officials said.\n\nThe stampede occurred as worshippers crowded into the Sri Venkateswara Swamy temple in the city of Srikakulam on Ekadashi, a day Hindus consider auspicious, said Pawan Kalyan, the state’s deputy chief minister.\n\n“An inquiry will be conducted into the tragic incident,” Kalyan said in a statement, adding that the temple was run by private individuals. He put the death toll at nine.\n\nAndhra Pradesh Governor S. Abdul Nazeer expressed his “profound grief on the death of nine pilgrims in the stampede”.\n\nAs many as 25,000 devotees crowded into the temple, which can accommodate only about 2,000, leading to the crush, state minister Anam Ramanarayana Reddy added, while district officials have been told to provide the injured with medical help.\n\nA total of 18 injuries have been reported so far, the collector and magistrate of Srikakulam district Swapnil Dinkar Pundkar said, while two critically injured patients have been moved to a tertiary care hospital for treatment.\n\nThe government will pay compensation of $2,300 to the families of the dead, and $570 to the injured, Prime Minister Narendra Modi said in a post on X.\n\nModi gave his condolences to those “who have lost their near and dear ones”. “I pray that the injured recover soon,” Modi added.\n\nDeadly stampedes and crowd crushes are a common occurrence at big Indian gatherings and religious festivals.\n\nIn September, at least 36 people were killed after a stampede broke out at a campaign rally of popular actor-turned-politician Vijay in Tamil Nadu state.\n\nAnd in June, a sudden crowd surge at a Hindu festival in the coastal state of Odisha triggered a stampede that killed at least three people and injured several others.\n\nThe previous month, six people were crushed to death in the western state of Goa after thousands gathered for a popular fire-walking ritual.\n\nIn January, at least 30 people were killed in an early morning crush at the Kumbh Mela, a Hindu mega-festival in the northern city of Prayagraj.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/012014279fb57fa.webp",
  "retrievedAt": "2025-11-01T16:18:52.198Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952572/india-temple-stampede-kills-9-in-andhra-pradesh",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T15:14:37.000Z"
}
