{
  "title": "Punjab speaker seeks legal protection for local govt system",
  "author": "Iftikhar A. Khan | Amjad Mahmood",
  "content": "• Malik Ahmad Khan insists effective governance impossible sans empowered local bodies\n• ECP expresses inability to hold polls until next year, in absence of ‘prerequisites’\n • Reminds province LG polls are their ‘joint responsibility’; Punjab chief secretary assures CEC requirements will be met\n\nLAHORE/ISLAMABAD: With the Election Commission of Pakistan (ECP) expressing its inability to hold local government polls in the country’s most populous province until next year, the Punjab Assembly speaker has called for a constitutional amendment to protect the tenure of local bodies and strengthen the LG system across the country.\n\nSpeaking at a press conference in La­­hore on Friday, Speaker Malik Muh­ammad Ahmad Khan said the Punjab As­­sembly had unanimously passed a resolution calling for an amendment to Article 140-A of the Constitution to ensu­­re empowerment and protection of local bodies, along with mandatory and timely elections for effective governance.\n\nHe said 35 opposition members had also contributed to the resolution, underscoring its bipartisan support.\n\nHe emphasised that the proposed amendment aims to devolve power to the grassroots level, strengthening the democratic process through empowered institutions at the district, tehsil, and union council levels.\n\nHe warned that the absence of effective local governance weakens the relationship of trust between the state and the people.\n\nThe speaker found it alarming that in Punjab’s 77-year history since independence, local governments have remained non-functional for about 50 years — a pattern he attributed to successive governments undermining the system.\n\nWhile provincial assemblies cannot amend the Constitution, Mr Khan urged parliament to take the lead in ensuring that administrative powers reach the grassroots level.\n\nHe cautioned political parties against shortening LG terms for political convenience, stressing the need for every government to guarantee timely elections.\n\nHe suggested convening a multi-party conference to develop consensus and build a unified platform for introducing the 27th constitutional amendment.\n\nNo LG polls this year\n\nLocal government elections in Punjab will not be possible before the second quarter of next year, as the ECP will not have all the prerequisites to hold the electoral exercise during the current year.\n\nThis was the main takeaway from a meeting, presided over by Chief Election Commissioner (CEC) Sikandar Sultan Raja in Islamabad on Friday, that reviewed preparations for the LG polls in the province.\n\nAt the meeting, the CEC reminded Punjab government representatives that holding local government elections in the province was the joint responsibility of both, the provincial government and the ECP. The commission called on the Punjab government to share all related rules, data, notifications, and maps to enable “timely” steps for the delimitation of  constituencies.\n\nPunjab Chief Secretary Zahid Akhtar Zaman said the provincial government was sincere in holding LG elections and had already shared the draft delimitation rules under the Local Government Act 2025 with the ECP.\n\nThe CEC directed the ECP office to immediately review the draft rules and give its opinion to the provincial government. The chief secretary assured the forum that the draft of the Local Government (Conduct of Election) Rules would be sent to the ECP by Nov 15 for its feedback. He said the Punjab government would supply the demarcation notification and the classification of town corporations, municipal corporations, municipal committees, and tehsil councils to the ECP by Dec 22 this year.\n\nSimilarly, notifications regarding the number of additional union councils would be issued by Dec 31, along with certified maps of each town corporation, municipal corporation, municipal committee, and tehsil council by Jan 10, 2026.\n\nOnce these prerequisites were in place, the ECP would begin the delimitation process.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/010843425c2ed72.webp",
  "retrievedAt": "2025-11-01T16:24:05.849Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952483/punjab-speaker-seeks-legal-protection-for-local-govt-system",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:19.000Z"
}
