{
  "title": "Not planning to enter politics again anytime soon, says ex-PTI leader Ali Zaidi",
  "author": "Dawn.com",
  "content": "Former PTI leader and ex-federal minister Ali Haider Zaidi on Saturday refuted reports of him “planning a political relaunch”, saying that he had no plans of doing so anytime soon.\n\nZaidi was among the top PTI leadership who quit either the party or politics altogether amid a state crackdown on the party following the May 9, 2023 riots, which witnessed military installations being vandalised in protest of Imran’s arrest earlier that day.\n\n“Some [are] suggesting that I’m planning a political relaunch. Let me be clear: I am not planning to enter politics anytime soon,” Zaidi said on X.\n\nThe first reason Zaidi stated for not rejoining politics was that his “financial circumstances and my personal family obligations” would not allow it.\n\n“Secondly, there is no politics in a country where the corrupt, the land grabbers, the extortionists, even those with blood on their hands are gifted power through a rigged election, protected by a compromised judiciary, which even today, fails to deliver justice,” he claimed.\n\n“When justice dies, politics loses its purpose,” the former PTI Sindh president said.\n\n“Imran Khan was, and remains, the only leader who truly tried to change this system. Sadly, he’s rotting in jail. And we all know why,” he added.\n\n“I wish all my old colleagues well,” Zaidi further said.\n\nThe clarification comes after Daily Ausaf and The Express Tribune reported, citing sources, that senior politicians who were part of the PTI’s “old leadership” were planning to relaunch a political movement calling for Imran’s release.\n\nThe media reports had claimed that ex-ministers Fawad Chaudhry and Asad Umar, former Sindh governor Imran Ismail, former MNA Mahmood Moulvi, and ex-Punjab Assembly speaker Sibtain Khan were expected to lead the initiative once released. All of them, except for Sibtain, had parted ways with the PTI following the May 9 riots.\n\nAccording to the Tribune report, sources said the veteran leaders intended to bring on board other experienced political figures from Khyber Pakhtunkhwa and Sindh. “The movement will pick up real pace after Shah Mahmood Qureshi’s release, when the old guard will be seen back in active political action,” the publication reported a source as saying.\n\nThe reports come after Chaudhry and Ismail posted near-identical statements on X yesterday, saying they had not only met PTI vice president Qureshi, who was hospitalised recently, but also party leadership and workers imprisoned at Lahore’s Kot Lakhpat jail.\n\n“If the PTI leadership can’t even go to inquire about him (Qureshi), then saying that we shouldn’t even visit him is strange logic,” they said.\n\nThey affirmed that the entire PTI wanted Imran to be freed from prison and alleged that some elements within the party wanted otherwise so “their leadership can keep shining”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/0113180815e75a5.webp",
  "retrievedAt": "2025-11-01T16:19:38.812Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952544/not-planning-to-enter-politics-again-anytime-soon-says-ex-pti-leader-ali-zaidi",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T08:08:27.000Z"
}
