{
  "title": "Islamabad’s Daanish School to be completed by December",
  "author": "Kashif Abbasi",
  "content": "ISLAMABAD: The Ministry of Federal Education on Friday announced that the Daanish School in Kuri will be completed by the end of December, and classes are scheduled to begin in the upcoming academic session starting March–April 2026.\n\nParliamentary Secretary for Education Farah Naz Akbar visited the under-construction Daanish School in Kuri to review the progress of ongoing development work. Officials briefed her that the project was advancing at full pace, with 82 per cent of the work completed so far.\n\nThe parliamentary secretary was informed that the project would be completed this year, enabling the school to start operations from the next academic session.\n\nThe Rs4.8 billion project, which includes Rs1 billion for land acquisition, was launched under the directive of Prime Minister Shehbaz Sharif.\n\nClasses scheduled to start in March next year\n\nAs part of the same initiative, three such schools are being constructed each in Azad Jammu and Kashmir (AJK) and Gilgit-Baltistan (GB).\n\nOut of these six schools, work is underway on five, three in GB (Sultanabad, Ghanche, and Astore, with around 25 percent progress) and two in AJK (Bagh with 34 per cent and Bhimbar with 33 per cent progress).\n\nOn Friday, the Ministry of Education opened bids for the construction of another school in Neelum, AJK.\n\nAdditionally, the ministry will construct three Daanish Schools in Balochistan, two in Sindh, and one in Chitral. Bids for the construction of schools in Balochistan were also opened on Friday.\n\nRecently, while chairing a meeting, Prime Minister Shehbaz Sharif directed authorities to expedite work on the under-construction Daanish Schools. He said the establishment of these institutions to provide quality education to deserving and talented students was among the top priorities of the government.\n\nThe prime minister also ordered the installation of smart boards in all classrooms, the establishment of digital libraries and a merit-based, transparent recruitment process for teaching staff.\n\nThe Project Management Unit (PMU) of the Ministry of Education has been overseeing the execution of these school projects.\n\nDuring her visit, Ms Akbar stated that the Kuri project was progressing according to schedule and would be completed within the given timeframe, ensuring that the upcoming academic session could commence in March 2026.\n\nShe added that similar Daanish School projects, a flagship initiative of the prime minister, were underway in other regions and would soon serve as beacons of learning and opportunity for underprivileged children across Pakistan. She appreciated the Ministry of Education and the PMU for adhering to the project timeline.\n\nLater, she planted a tree on the school premises as part of the ongoing tree plantation campaign.\n\nIt is pertinent to mention that Daanish Schools provide free, quality education to underprivileged children.\n\nThe initiative was launched in Punjab in 2010 by then Chief Minister Shehbaz Sharif and offers boarding facilities for students. After assuming office as Prime Minister, Mr Sharif directed the Ministry of Education to establish similar schools across other regions.\n\nMoreover, a Daanish University will also be established in Islamabad’s Sector H-16, with 100 acres of land already allocated by the Capital Development Authority (CDA) and approved by the federal cabinet for the project.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01090849f705807.webp",
  "retrievedAt": "2025-11-01T16:22:36.432Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952414/islamabads-daanish-school-to-be-completed-by-december",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:56.000Z"
}
