{
  "title": "Centrists beat Wilders party after knife-edge Dutch polls",
  "author": "Agencies",
  "content": "AMSTERDAM: Dutch centrist party D66 won the most votes in Wednesday’s general election, putting its 38-year-old leader Rob Jetten on course to becoming the youngest-ever prime minister in the Netherlands.\n\nWith almost all votes counted, pro-EU liberal D66 can no longer be overtaken by the far-right Freedom Party (PVV) led by Geert Wilders.\n\nJetten claimed victory based on the election body’s announcement and urged mainstream parties from the left to the right to unite.\n\n“Voters have clearly indicated the need for cooperation,” Jetten told reporters on Friday. “We want to find a majority that will eagerly work on issues such as the housing market, migration, climate and the economy.”\n\nWilders did not concede defeat and in a social media post called Jetten “arrogant” for not waiting for the announcement of the final result next week.\n\nJetten’s D66 is now expected to take the lead in a first round of talks to form a coalition government, a process which usually takes months.\n\nWith around 18 per cent of the votes, the party will need three coalition partners to reach a simple majority in the 150-seat lower chamber of parliament.\n\nWilders also called for an investigation into what he said was “a stream” of claims of alleged voter fraud sent to him from sources from all over the country. He said he had no idea whether the reports had substance, but that they should be investigated.\n\nPacemaker now sets his own pace\n\nAs a talented junior athlete, Rob Jetten once ran as a pacemaker for future Olympic champion Sifan Hassan.\n\nNow the 38-year-old is setting his own pace at the head of Dutch politics.\n\nJust like Hassan, who won the Paris Olympic marathon with an astonishing late surge last year, Jetten timed his own political run perfectly.\n\nWith a positive message and youthful energy, Jetten dragged the D66 from fifth in the polls with a month to go.\n\n“We’ve done it,” he told jubilant supporters at the election party, on a stage surrounded by a sea of Dutch and European flags.\n\n“We have run a very positive campaign because we want to get rid of all the negativism in the Netherlands over the past few years,” he said on election day.\n\n“I want to bring the Netherlands back to the heart of Europe because without European cooperation, we are nowhere,” he added.\n\nJetten has had a head-spinning rise up the political hierarchy.\n\nEntering parliament at the tender age of 30, he became leader of the D66 just a year later, the youngest ever to hold the post.\n\nHis carefully rehearsed lines and bookish glasses earned the self-confessed geek the unwelcome nickname of “Robot Jetten” in his early career.\n\nBut he shed the glasses after laser eye surgery and adopted a less earnest demeanour that saw him impress in his ubiquitous media appearances during the campaign.\n\n“The best advice I got then was to tell your story as if you were sitting around the table with your mates,” he said, referring to the early years. A quirk of the calendar handed Jetten even more positive exposure.\n\nHe reached the final of popular TV quiz show The Smartest Person, filmed in spring but broadcast in the run-up to election day.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/69055150ec2e3.gif",
  "retrievedAt": "2025-11-01T16:23:11.128Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952471/centrists-beat-wilders-party-after-knife-edge-dutch-polls",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:37.000Z"
}
