{
  "title": "France arrests Afghan with suspected links to Islamic State offshoot",
  "author": "AFP",
  "content": "A 20-year-old man from Afghanistan suspected of having links to an offshoot of the Islamic State group has been arrested in France, anti-terrorism prosecutors said on Saturday.\n\nThe man was charged with participating in a criminal terrorist organisation and financing a terrorist enterprise, the National Anti-Terrorism Prosecutor’s Office (PNAT) said.\n\nThe suspect, who was arrested in Lyon last week, was placed in pre-trial detention.\n\n“He is suspected of having been in contact with IS-K (Islamic State in Khorasan),” the anti-terrorism unit said.\n\nThe man is suspected of “sending funds” and helping translate and relay “the propaganda of this terrorist organisation”, PNAT added.\n\nThe IS-K, the militant group’s branch in Afghanistan, also operates in Pakistan and former Soviet countries in Central Asia, including Uzbekistan.\n\nThe group has been responsible for deadly attacks in Afghanistan and Russia, including an attack on a Moscow concert hall in March 2024 that killed 150 people.\n\nAccording to French daily Le Parisien, the Afghan, who arrived in France several years ago, was arrested by officers from the DGSI domestic intelligence agency when he was already in an administrative detention centre in Lyon.\n\nLe Parisien said that the suspect, already under investigation for glorifying terrorism, was editing and disseminating extremist propaganda on TikTok and Snapchat social networks.\n\nFrance has been repeatedly targeted by extremist attackers over the past decade, often by individuals inspired by Al-Qaeda or the Islamic State group.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01212021a71efa6.webp",
  "retrievedAt": "2025-11-01T16:32:03.284Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952574/france-arrests-afghan-with-suspected-links-to-islamic-state-offshoot",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T16:20:32.000Z"
}
