{
  "title": "India wants to keep Pakistan ‘busy’ on western and eastern fronts: Defence Minister Khawaja Asif",
  "author": "Dawn.com",
  "content": "Defence Minister Khawaja Asif said on Saturday that India wanted to keep Pakistan busy and engaged on the eastern and western fronts amid tensions with Kabul and New Delhi.\n\nPakistan and Afghanistan agreed early on Friday morning to continue a ceasefire between the two countries following a rapid deterioration of ties and a brief conflict along their shared border last month.\n\nThe Istanbul talks followed a sharp escalation in tensions that saw Pakistan launch Oct 9 airstrikes on Tehreek-i-Taliban Pakistan sanctuaries in Afghanistan, triggering Oct 11 border clashes that continued for days before a ceasefire was formalised in Doha on Oct 18-19. The Istanbul agreement came after days of deadlock that nearly brought the process to a halt, with mediators pulling both delegations back to the table even as Pakistan’s team had already begun preparations to return home.\n\nMeanwhile, an uneasy peace persists between Pakistan and India after their May conflict earlier this year that led to a United States-brokered ceasefire. Since then, Indian political and military leadership, including chiefs of the military branches, have continued to make aggressive statements, repeating terrorism allegations that Pakistan has repeatedly refuted and also warning of “geographical changes” in the course of any future conflict.\n\n“If there is a need for evidence, then we have it, about what involvement India has in terrorism [in Pakistan] and how it wants to keep us busy on two fronts: the eastern and western,” said the defence minister while talking to Geo News today.\n\nHe added that Indian Prime Minister Narendra Modi was “silenced” after the defeat dealt to India during the May conflict and expressed hope that talks with Afghanistan would reach a reasonable conclusion.\n\n“Everyone is onboard — politicians, the establishment and the Pakistani nation — that an immediate solution to the Afghanistan issue is very necessary, which is that terrorism from Afghan soil should be completely stopped,” said the minister in reference to the country’s western neighbour.\n\nAsif said the preferable solution would be for both states to maintain a civilised relationship.\n\nThe second round of negotiations with Afghanistan produced a three-point understanding — the continuation of the ceasefire, the establishment of a monitoring and verification mechanism to ensure peace, and penalties for violations.\n\nThe operational details of that mechanism are expected to be finalised when the “principals”, senior representatives from both sides, meet again in Istanbul on Thursday.\n\nEarlier today, Information Minister Attaullah Tarar said that a fisherman from Pakistan was arrested by the Indian Coast Guard and was coerced into carrying out tasks for the neighbouring country’s intelligence agency.\n\nA few days ago, Asif had stated that India was waging a “low-intensity” war against Pakistan from Afghanistan, adding that New Delhi was trying to “settle the score” after facing defeat in the four-day conflict with Islamabad in May.\n\nSeparately, the information ministry rubbished remarks by Afghan Taliban spokesperson Zabihullah Mujahid about details of a prisoner exchange scheme in the Istanbul talks.\n\nAriana News reported that he claimed Pakistani was informed in the talks that the Islamic Emirate was willing to deport people Islamabad considered a security threat but Pakistan did not accept the offer.\n\nIt added that he said that Pakistan requested the Afghan side to control such people within Afghanistan instead of deporting them.\n\nResponding to the development, the information ministry said it “rejects deliberate twisting of facts” by Mujahid.\n\n“Pakistan had demanded that terrorists in Afghanistan posing a threat to Pakistan be controlled or arrested. When the Afghan side said that they were Pakistani nationals, Pakistan immediately proposed that they be handed over through designated border posts, consistent with Pakistan’s long-standing position.\n\n“Any claim to the contrary is false and misleading.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/011811516a7409f.webp",
  "retrievedAt": "2025-11-01T16:32:04.583Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952563/india-wants-to-keep-pakistan-busy-on-western-and-eastern-fronts-defence-minister-khawaja-asif",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T13:46:22.000Z"
}
