{
  "title": "Pakistan Agr­icultural Research Council reform pledged after China identifies major gaps",
  "author": "Amin Ahmed",
  "content": "• Underfunding, outdated labs, brain drain plague the country’s apex agri-research body, joint assessment finds\n• Tanveer announces high-level panel to ensure execution of reform plan\n\nISLAMABAD: The Minister for Food Security vowed to transform the country’s apex agricultural research body, after a joint assessment conducted alongside China identified chronic under-investment, outdated laboratories and equipment, weak research commercialisation, and persistent brain drain as major challenges for Pakistan Agr­icultural Research Council (PARC).\n\nThe comprehensive study, carried out by the Chinese Ministry of Agriculture and Rural Affairs and the Chinese Academy of Agricultural Sciences, in collaboration with PARC, aimed to identify structural gaps in Pakistan’s agricultural research system and\npropose a roadmap for institutional revitalisation in line with global scientific standards.\n\nThe joint study assessed the performance, infrastructure, and capabilities of PARC, National Agricultural Res­earch Centre (NARC), and its eleven research institutes.\n\nThe report emphasised that overcoming these challenges requires a holistic reform strategy focused on sustainable funding, efficient performance evaluation, stronger linkages between research and farmers, and better coordination between federal and provincial research bodies.\n\nIt also underscored the need to align research priorities with national goals of food security, climate resilience, and economic growth through the development of a National Agricultural Science and Technology Roadmap. The findings of the assessment were discussed at a high-level meeting in Islamabad on Friday, chaired by Minister for National Food Security and Research Rana Tanveer Hussain.\n\nHe announced that the government would revamp PARC under the Strategic Reform and Coop­eration Plan with China.\n\nThe minister said the government was fully committed to transforming  PARC into a modern, efficient, and innovation-driven institution capable  of leading the country’s food security agenda.\n\nMr Hussain praised the efforts of the Chinese ministry and academy for  their valuable support in preparing a forward-looking reform roadmap for  Pakistan’s agricultural research sector.\n\nHe added that the  recommendations of the Chinese ministry and academy would be  implemented “in letter and spirit” to make PARC a hub of agricultural  advancement, ensuring that farmers benefit directly from modern  technology, value addition, and res­earch-based solutions.\n\nThe  minister announced the formation of a high-level implementation  committee comprising representatives from the Ministry of National Food  Security and Research, PARC, and other key stakeholders to ensure timely  execution of the reform plan with clear milestones and accountability  mechanisms.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01081105027ab2f.webp",
  "retrievedAt": "2025-11-01T16:24:08.269Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952497/pakistan-agricultural-research-council-reform-pledged-after-china-identifies-major-gaps",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:14.000Z"
}
