{
  "title": "FBR sets new milestone with 5.9m filers",
  "author": "Mubarak Zeb Khan",
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) has received a record 5.9 million tax returns for the tax year 2025 compared to 5 million returns filed in the same period last year, showing an increase of 17.6 per cent.\n\nThe returns received until Oct 31, which is the last date for the filing of tax returns for the tax year 2025.\n\nAn official announcement of the FBR said that, as per the directions of the Prime Minister Shehbaz Sharif, no blanket extension in the filing deadline has been granted. However, taxpayers facing genuine hardships may approach their respective field formations through FBR’s IRIS system for an extension in filing their returns.\n\nOut of the filed returns, 3.6m taxpayers filed returns with tax payments, reflecting an 18.6pc rise in taxpayers who contributed revenue along with their returns, compared to the same period in 2024.\n\nMoreover, individual taxpayers have paid nearly Rs9 billion more than last year, growing from Rs60bn to Rs69bn this year, representing a 15pc increase in tax payments from individuals.\n\nIndividual tax payments up 15 per cent to Rs69 billion\n\nThis recorded a significant increase in income tax return filings for tax year 2025, marking a new milestone in voluntary compliance and taxpayer awareness.\n\nThe FBR appreciates the growing cooperation of citizens and reiterates its commitment to facilitating honest taxpayers through simplified processes, digital tools, and responsive communication, ensuring that Pakistan’s tax system becomes fairer, transparent, and inclusive.\n\nThe rise in return filings is the outcome of a comprehensive outreach campaign. As part of these efforts, nationwide robocalls and WhatsApp messages were disseminated to remind citizens of their civic duty to file tax returns.\n\nIn addition, FBR sent a series of behaviourally informed messages to taxpayers using third-party data, beginning with congratulatory notes, followed by informational messages about rights and obligations, and finally cautionary reminders, with nearly 800,000 such nudges issued across the country.\n\nComplementing these initiatives, targeted emails were also sent to around 70,000 taxpayers, highlighting the indicative income levels of comparable peers to encourage accurate and timely filing.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01072906b854be3.webp",
  "retrievedAt": "2025-11-01T16:23:08.819Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952487/fbr-sets-new-milestone-with-59m-filers",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:25.000Z"
}
