{
  "title": "Revenue shortfall hits Rs274bn in July-Oct",
  "author": "The Newspaper's Staff Reporter",
  "content": "ISLAMABAD: The Federal Board of Revenue (FBR) missed its collection target by nearly Rs274 billion in the first four months of the current fiscal year due to a decline in domestic sales tax collection.\n\nFBR collected Rs3.835 trillion between July and October against the target of Rs4.108tr. However, the collection is 12pc higher compared to the year-ago figure of Rs3.834tr.\n\nThe revenue shortfall is primarily attributed to a slowdown in domestic sales tax collection, driven by several factors. The decline is largely due to power outages and increased solarisation, both of which have significantly reduced taxable consumption from conventional utility sources.\n\nAs a result revenue collection fell short of the target by Rs75bn in October, to Rs951bn, against the projected target of Rs1.026tr for the same month. However, it recorded growth of 8pc compared with last year’s collection of Rs 879 bn in October FY25.\n\nThe FBR issued Rs206bn in refunds and rebates to taxpayers during the month of July-October  FY26, up from Rs170bn a year earlier, an increase of 21.17pc.\n\nDuring July-October FY26, income tax collection reached Rs1.796tr, falling short of the target by Rs103bn against the target of Rs1.899tr. This reflects an 11pc increase from Rs1.611tr collected last year.\n\nSales tax collection amounted to Rs1.359tr, falling short of the Rs1.542tr target by Rs183bn, though it marked a 10pc increase over last year’s Rs1.236tr. Customs duty collection stood at Rs420bn, surpassing the Rs407bn target by Rs13bn, though it grew by 12pc compared to Rs376bn last year.\n\nThe Federal Excise Duty collection reached nearly its target, reaching Rs259bn against the projected target of Rs260bn and a growth of 21pc from last year’s Rs214bn.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/010750536439b5b.webp",
  "retrievedAt": "2025-11-01T16:23:14.457Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952489/revenue-shortfall-hits-rs274bn-in-july-oct",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:25.000Z"
}
