{
  "title": "Overall public debt rises Rs9.3tr in FY25",
  "author": "Khaleeq Kiani­",
  "content": "ISLAMABAD: With a track record of 3.6 per cent increase in the overall public debt-to-GDP ratio to 74.5 per cent during FY25, the Ministry of Finance (MoF) on Friday hoped to reduce it to almost 70pc in the current year and to 63.3pc by FY28.\n\nIn its Debt Sustainability Analysis Report 2026-28, the MoF projected the public debt to remain sustainable over the medium term, supported by macroeconomic stability and continued fiscal consolidation, albeit with ‘a moderate risk arising from gross financing needs (GFN)’.\n\n“As of the end of June 2025, the Public and Publically Guaranteed (PPG) debt-to-GDP ratio stood at 74.5pc, depicting a year-on-year increase of 3.6 percentage points from 70.9pc at the end of June 2024”, reads the report. It attributed the increasing debt-to-GDP ratio to the depreciation of the rupee against major currencies, coupled with easing inflation and a persistently high policy rate (as compared to inflation), which raised the real interest rate.\n\nIn contrast, the slight increase in real GDP growth and the rise in the primary surplus helped reduce PPG debt as a percentage of GDP. Overall, the domestic PPG debt-to-GDP ratio rose to 49.8pc in FY25 from 46.2pc in FY24, while the external PPG debt-to-GDP ratio remained broadly unchanged.\n\nIn absolute terms, the overall PPG debt reached Rs84.79tr (74.5pc of GDP), compared to Rs74.62tr (70.9oc of GDP) in June 2024.\n\nTotal public debt stood at 70.8pc of GDP by the end of June 2025, the MOF noted, and was expected to decline to 60.8pc by FY28. Moreover, guarantees are 3.8pc of GDP by the end of June 2025, expected to decline to 2.5pc by FY28. As such, the public and publicly guaranteed (PPG) debt is expected to remain sustainable over the medium term (FY26-FY28). The decrease in public debt would be mainly driven by prudent economic management and fiscal consolidation, it promised.­\n\nAs of end-June 2025, Pakistan’s public debt was recorded at Rs80.52 trillion (70.8pc of GDP), up from Rs71.24tr in June 2024 (67.7pc of GDP), an increase of almost 9.3tr in a single year. Domestic debt accounted for the largest share and showed a relatively higher rise, whereas external debt remained broadly stable in dollar terms. “This shift reflects the government’s policy to rely more on domestic sources, thereby reducing exposure to exchange rate volatility and external refinancing risks.”\n\nPublicly guaranteed debt stood at Rs4.27tr, up from Rs3.38tr a year earlier. This increase in publicly guaranteed debt was mainly due to the incorporation, for the first time, of guarantees from commodities operations into the total guarantees issued limit as contingent liabilities.\n\nThe government promised to remain focused on a sustainable debt path by managing risks, diversifying financing sources, and aligning borrowing with fiscal and external sector stability. Rising exports, foreign investment, and remittances, along with lower global energy prices, are likely to bolster foreign exchange reserves and ease external account pressures. The exchange rate is projected to remain broadly stable, it said.\n\nUnder the baseline scenario, the PPG debt-to-GDP ratio is estimated at 63.3pc in FY28, a decline from 74.5pc in FY25 owing to continued fiscal consolidation and growth-interest rate differential. Based on the underlying macro fiscal assumptions in the baseline scenario, the PPG debt-to-GDP ratio stays within the prudent benchmark range. The GFN-to-GDP ratio has been estimated to decline from 26.1pc in FY25 to 15.6pc in FY28 — still higher than the 15pc benchmark.­\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01080045ac1692c.webp",
  "retrievedAt": "2025-11-01T16:23:09.811Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952488/overall-public-debt-rises-rs93tr-in-fy25",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:25.000Z"
}
