{
  "title": "A manmade mental crisis",
  "author": "Murad Moosa Khan",
  "content": "“We need to stop just pulling people out of the river. We need to go upstream and find out why they’re falling in” — Desmond Tutu\n\nTHERE is much talk of a ‘mental health crisis’ in Pakistan currently. Campaigns for ‘raising awareness and reducing stigma’ have been launched, encouraging people to talk about and seek help for mental health issues. There is a call for increased funding, upscaling mental health services and integrating mental health into primary care. These are all important and mental health definitely needs to be prioritised. But it is also equally important to reflect on what is driving this mental health crisis in Pakistan and what can be done about it.\n\nThe mental health crisis is not merely a health issue. It is a reflection of how power, inequality, and governance intersect to shape the emotional lives of millions of Pakistanis. The crisis is not a natural disaster but manmade — the outcome of 78 years of brutalisation of the people through social and economic injustice, political instability and structural poverty.\n\nPakistan’s history is defined by political turbulence. For almost half of its existence, Pakistan has had direct military rule and an indirect one even when there is a façade of civilian government. The events of the last three years, the stolen mandate, state violence and oppression, emasculation of the judiciary and parliament have all but eroded what little public trust there was in state institutions. This has serious psychological consequences. Pakistanis live in a permanent state of uncertainty. Political chaos is fuelling collective anxiety, cynicism, and a loss of civic sense. Fear and distrust have become national emotions.\n\nFor millions of Pakistanis, psychological suffering is inseparable from economic hardship. Rising inflation, unemployment and collapsing purchasing power has turned everyday life into a test of survival. When families cannot afford school fees or electricity bills, when people feel they cannot make ends meet, when savings evaporate overnight, mental distress is the natural outcome. Poverty is not only material deprivation; it is psychological violence inflicted by an unequal system.\n\nOver 60 per cent of Pakistan’s population is under 30 years of age. What should be a demographic dividend has become a demographic crisis. Young people face shrinking opportunities, high unemployment, and an outdated education system disconnected from labour markets. Merit is sacrificed for nepotism and favouritism; hard work is replaced by connections. A society that denies its youth opportunity also denies them hope. No wonder every other young person wants to leave the country.\n\nFor millions of Pakistanis, psychological suffering is inseparable from economic hardship.\n\nThis suffering is not a ‘test of God’; it is political. The failure to provide social justice, address poverty, provide basic necessities, to control corruption — by neglecting social development — represents a deliberate abdication of state responsibility. The emotional cost is borne silently in our homes and workplaces across the country. This is criminal.\n\nAmong the many silent tragedies, Pakistan is the tragedy of suicides. The World Health Organisation estimates that between 13,000-20,000 people die by suicide each year and 10-20 times more attempt suicide, mostly by young people, under the age of 30 years. Poverty and unemployment stand out as major causes. This in a country that was created in the name of Islam, whose central tenet is social justice. We need to ask ourselves why then is the prohibition on suicides not having its deterrent effect in a country with 97pc Muslims.\n\nThis silence is strategic. To confront the mental health crisis would be to confront its root causes — poverty, inequality, corruption, and misgovernance. Instead, individuals are told to be patient, to pray, or to endure. Endurance, in this context, is not resilience; it is resignation. There is no greater insult than to label the silent suffering of Pakistanis as ‘resilience’. People have no choice but to struggle on.\n\nAddressing the mental health crisis in Pakistan requires far more than setting up clinical services, increasing the number of psychiatrists and psychologists, setting up crisis helplines or offering interventions through apps or digital platforms. It demands a reordering of political and economic priorities. This means addressing the root causes of the mental distress of the population. We need truly representative governments, not one that is imposed on us. We need to curb corruption, which has eaten into the moral fabric of our society. We need to declare a national emergency in education in the country. Why are 25m children out of school in Pakistan? What is the future for them? We can spend billions of dollars over four days in a ‘war’ with one of our neighbours but cannot provide universal health coverage to our people.\n\nNearly one in three Pakistanis are estimated to be in need of mental healthcare. Yet, there is no separate budget for mental health and mental health spending is estimated to be less than 0.5pc of the national health budget. Whatever little is there, is eaten up by corruption and mismanagement. Access to psychiatric care remains confined to a few major cities, where it is largely unaffordable for the vast majority.\n\nPakistan’s vulnerability to climate change has added a devastating dimension to the mental distress of its population. The 2022 floods displaced over 30m people, destroying homes, livelihoods, and communities. It was replayed in the recent floods in Punjab and KP. Many survivors continue to experience post-traumatic stress, anxiety, and depression — yet mental health remains absent from national disaster response and recovery plans. A nation’s true strength is measured not by the size of its economy or its armed forces, but by peace of mind of its citizens. Until Pakistan learns to prioritise the mental well-being of its people as a central pillar of its policies, our crisis of the mind will remain, silently but unmistakably, of our own making.\n\nThe writer is a consultant psychiatrist.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/69055b4d02d56.jpg",
  "retrievedAt": "2025-11-01T16:20:56.761Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952510",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:07:08.000Z"
}
