{
  "title": "South Korean president Lee asks China’s Xi for help in engaging North Korea",
  "author": "Reuters",
  "content": "South Korean President Lee Jae Myung sought Chinese President Xi Jinping’s help in efforts to resume talks with nuclear-armed neighbour North Korea on Saturday, while Xi told Lee he was willing to widen cooperation and jointly tackle the challenges they face.\n\nLee hosted Xi at a state summit and dinner after an annual summit of the Asia-Pacific Economic Cooperation (Apec) in the South Korean city of Gyeongju, marking Xi’s first visit to the United States’ ally in 11 years.\n\nBeijing attaches great importance to relations with Seoul and sees South Korea as an inseparable cooperative partner, Xi said ahead of the summit, according to Lee’s office.\n\nLee, who was elected president in a snap election in June, has promised to strengthen ties with the US while not antagonising China and seeking to reduce tensions with the North.\n\n“I am very positive about the situation in which conditions for engagement with North Korea are being formed,” Lee said, referring to recent high-level exchanges between China and North Korea.\n\n“I also hope that South Korea and China will take advantage of these favourable conditions to strengthen strategic communication to resume dialogue with North Korea.”\n\nLee has called for a phased approach to denuclearising North Korea, starting with engagement and a freeze on further development of nuclear weapons.\n\nIn a statement on Saturday, Pyongyang, a military and economic ally of China, dismissed the denuclearisation agenda as an unrealisable “pipe dream”.\n\nNorth Korea has repeatedly and explicitly rejected Lee’s overtures, saying it will never talk to the South. In recent years Pyongyang abandoned its longstanding policy of unification with the South and called Seoul a main enemy.\n\nLeader Kim Jong Un said he would be willing to talk to the US if Washington drops demands for denuclearisation, but he did not publicly respond when US President Donald Trump offered talks during his visit to South Korea earlier this week.\n\nTrump and Lee announced a surprise breakthrough in talks to lower US tariffs in return for billions of dollars in investment from South Korea. The US president then departed before the main Apec leaders’ summit.\n\nSouth Korean national security adviser Wi Sunglac told a briefing that China expressed its willingness to cooperate for peace and stability on the Korean peninsula, but the leaders did not specifically discuss what kind of role China would play.\n\nBoth sides also agreed that the US-North Korea dialogue was most important, the adviser said.\n\nChinese state media reports on the meeting with Lee made no mention of the North Korea discussions.\n\nAccording to Xinhua, Xi proposed ways to open a new chapter in relations, including having each country “respect each others social systems and development paths, accommodate core interests and major concerns, and properly handle differences through friendly consultation“.\n\nXi also called for upholding multilateralism and increasing cooperation in areas such as artificial intelligence, biopharmaceuticals, green industries and aging populations, Xinhua reported.\n\nDuring Xi’s visit, China and South Korea signed seven agreements including a won-yuan currency swap and memorandums of understanding on online crime, businesses that cater to aging populations, and innovation, among other issues.\n\nSouth Korea is a military ally and major trading partner of the US, but is also heavily reliant on trade with China.\n\nHundreds of protesters joined an anti-China rally in Seoul today as Xi and Lee met.\n\nProtesters carried placards saying “South Korea belongs to South Korea” and “China Out”, while chanting “Chinese and Communism, get out of South Korea” as they marched through the vibrant shopping street in the Hongdae area.\n\nKim Hye Kyung, a 64-year-old conservative protester, said she joined the rally to “protect liberal democracy” in her country.\n\nAmid a rise in such protests, in October, Lee ordered a crackdown on anti-Chinese and anti-foreigner rallies that he said were harming the country’s image and economy.\n\nWi said Lee and Xi had a “productive” discussion about Chinese sanctions on five US-linked units of South Korean shipbuilder Hanwha Ocean. Beijing has said the sanctions were related to security risks stemming from the company’s cooperation with US investigations.\n\nWi said there were discussions at the summit about years-long restrictions on South Korean entertainment content, effectively banned after the 2017 deployment of the US-led Terminal High Altitude Area Defense (THAAD) missile defence system in South Korea.\n\nHe said the two sides could keep communicating on the matter at the working level as they shared the need for cultural exchanges.\n\nLee also raised the issue of structures placed in disputed waters between the countries, which China claims are for fishing purposes.\n\nOn the sidelines of an Asean defence summit in Malaysia on Saturday, South Korea’s defence minister met his Chinese counterpart and raised the issue of Chinese military activity in Korea’s Air Defence Identification Zone (KADIZ).\n\nSeparately, Xi took the centre stage at the Apec summit earlier today to push a proposal for a global body to govern artificial intelligence and position China as an alternative to the US on trade cooperation.\n\nThe Apec is a consultative forum of 21 nations representing half of global trade, including the US, China, Russia and Japan. The summit, hosted by South Korea this year, unfolded under the shadow of rising geopolitical tensions and aggressive economic strategies — ranging from US tariffs to China’s export controls — that have pressured global trade.\n\nXi’s comments were the first by the Chinese leader on an initiative Beijing unveiled this year, while the US has rejected efforts to regulate AI in international bodies.\n\nXi said a World Artifical Intelligence Cooperation Organisation could set governance rules and boost cooperation, making AI a “public good for the international community”.\n\nIn remarks published by the official news agency Xinhua, Xi added, “Artificial intelligence is of great significance for future development and should be made for the benefit of people in all countries and regions.”\n\nChinese officials have said the organisation could be based in the commercial hub of Shanghai.\n\nWhile advanced chips made by California-based Nvidia are central to the AI boom, China-based developer DeepSeek has rolled out lower-cost models taken up by Beijing in a push for what it calls “algorithmic sovereignty”.\n\nXi also urged Apec to promote the “free circulation” of green technologies, a cluster of industries from batteries to solar panels that China dominates.\n\nXi announced that China will host the 2026 Apec summit in Shenzhen, a major hub for manufacturing, from robotics to electric car production.\n\nThe Chinese president said the city of nearly 18 million had been a fishing village until it boomed as one of the country’s first special economic zones in the 1980s.\n\nTrump did not attend the Apec leaders’ summit in the South Korean city of Gyeongju, flying back to Washington directly after a meeting with Xi that yielded a one-year deal to partially roll back trade and technology controls.\n\nIn Trump’s absence, analysts had expected Xi to use the Apec meeting to promote China as champion for its own brand of multilateral cooperation on trade and economic development.\n\nFacing deepening fractures in the global trade order, Asia-Pacific leaders adopted a joint declaration that emphasised the need for resilience and shared benefits in trade as the annual Apec summit ended.\n\nWhile Trump did not attend the summit, Washington’s views were still on display in the declaration, analysts said, which, unlike last year’s document, did not mention multilateralism or the World Trade Organisation (WTO).\n\n“It is a result of member countries acknowledging, at least to some degree, that it will be difficult to restore a free trade order based on multilateralism and the World Trade Organisation,” said Heo Yoon, a professor of international trade at Sogang University in Seoul.\n\n“We cannot deny anymore that there is a paradigm shift in the global trade order,” Heo added.\n\nWith Trump’s swift exit before the leaders’ summit, China positioned itself as a steady advocate of free and open trade, a role the US has dominated for decades.\n\nHowever, Heo and analysts say the joint declaration suggests that member nations were wary of giving an impression that the US was undermining free trade while picturing China as a guardian of multilateralism.\n\n“Few countries believe there can be a new trade order that excludes the US,” he said.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01180454b98c846.webp",
  "retrievedAt": "2025-11-01T16:19:51.530Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952547/south-korean-president-lee-asks-chinas-xi-for-help-in-engaging-north-korea",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T09:45:02.000Z"
}
