{
  "title": "Hurricane claims 50 lives across Caribbean",
  "author": "Reuters",
  "content": "KINGSTON: Melissa, one of the strongest storms on record to make landfall in the Caribbean, began to dissipate on Friday after sowing devastation across much of Jamaica, cutting off communities in Cuba, drenching Haiti and leaving fifty people dead.\n\nMelissa was the most powerful storm ever to directly hit Jamaica, and the first major hurricane to do so since 1988. Forecaster AccuWeather estimated $48 billion to $52 billion in damage and economic loss across the western Caribbean.\n\nMelissa pounded southwestern Jamaica on Tuesday as a powerful Category 5 hurricane, well above minimum wind speeds for the strongest hurricane classification, and devastated many areas already battered by last year’s Hurricane Beryl.\n\nJamaica’s information minister confirmed at least 19 deaths on Friday, but said there were indications more bodies would be recovered. Some 462,000 people remain without power and emergency food distributions have started, she said.\n\nIn Haiti, which was not directly hit but suffered days of torrential rains from the slow-moving storm, authorities reported at least 31 deaths and 20 more missing.\n\nAt least 23 people, including 10 children, died in Haiti’s southern town of Petit-Goave when a river burst its banks. Roads, houses and farmland were also damaged by the rains.\n\n“It is a sad moment for the country,” the head of Haiti’s transitional presidential council said. “In addition to the deaths and missing people, there is a lot of material damage: houses have been destroyed, fields flooded, livestock lost and roads cut off.”\n\nAuthorities also warned of the risk of cholera, which re-emerged in Haiti in 2022 and spreads through contaminated water.\n\nIn Cuba, which Melissa struck as a Category 3 hurricane, no deaths were reported as of Friday, though it caused extensive damage to homes, roads and crops. Hundreds of thousands were evacuated from eastern Cuba and around the island’s second-biggest city, Santiago de Cuba.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/690550442de99.gif",
  "retrievedAt": "2025-11-01T16:23:23.446Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952464/hurricane-claims-50-lives-across-caribbean",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:37.000Z"
}
