{
  "title": "Car price hike: Competition Commission of Pakistan told to conclude inquiry in six months",
  "author": "Wajih Ahmad Sheikh",
  "content": "LAHORE: The Lahore High Court (LHC) has upheld notices by the Competition Commission of Pakistan (CCP) to an automobile manufacturer and ordered the regulatory body to conclude its 2018 inquiry into increased prices of cars within six months.\n\nAtlas Honda Cars (Pakistan) Limited had approached the court through a petition challenging vires of notices issued by the CCP, whereby the manufacturer was required to provide information in relation to a suo motu inquiry under section 37(1) of the Competition Act, 2010, concerning increase in prices of vehicles.\n\nAdvocate Waqas Ahmad Mir argued on behalf of the petitioner/company that the entire proceedings initiated by the CCP were without lawful authority.\n\nHe contended that the inquiry, having been initiated in 2018, has been pending for years without conclusion, which amounts to harassment and is a violation of the petitioner’s right to due process. The counsel further argued that the CCP had never formally communicated the grounds or prima facie reasons for the initiation of the suo motu inquiry, leaving the petitioner in the dark as to the precise allegations it must meet.\n\nHe maintained that the impugned notices were a testament to the CCP’s arbitrary exercise of power. The CCP through its counsel Barrister Asadullah Chattha, opposed the petition, primarily on the ground of maintainability.\n\nIt was argued that the petitioner, by its own conduct, was not entitled to challenge the proceedings.\n\nThe counsel explained that the petitioner/company received the first notice in 2018, replied to it and subsequently participated in the proceedings, even giving a detailed presentation in March 2021.\n\nIn his rebuttal, the counsel for the petitioner said the compliance with earlier notices was done in good faith and did not create an ineligibility to challenge a continuing illegality. In his judgement, Justice Raheel Kamran ruled that even assuming the petition maintainable, the grounds of challenge raised by the petitioner are unfounded and contrary to the record.\n\nThe judge observed that the impugned notices were merely in continuation of the pending inquiry and it is not for the court to sit in appeal over the CCP’s assessment of what information is relevant to its investigation.\n\nHe maintained that the CCP is the master of its own proceedings and unless mala fides are alleged and proven, the LHC will not interfere in the investigative stage. Concluding the judgement, the judge observed that although the relevant law does not prescribe any statutory time frame for conclusion of an inquiry by the CCP, principle of fairness demands that such proceedings are not kept pending for an indefinite period and must be concluded within a reasonable time.\n\nPublished in Dawn, November 1st, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/11/01090016bc37c3e.webp",
  "retrievedAt": "2025-11-01T16:22:36.747Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1952426/car-price-hike-competition-commission-of-pakistan-told-to-conclude-inquiry-in-six-months",
  "dateList": "2025-11-01",
  "date_published": "2025-11-01T01:06:50.000Z"
}
