{
  "title": "PM pins hope on civil servants to steer country out of current challenges",
  "link": "https://www.app.com.pk/national/pm-pins-hopes-on-civil-servants-to-steer-country-out-of-current-challenges/",
  "date_published": "2023-01-14T10:54:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 14 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday urged the civil servants to serve the country and nation with their utmost capacities and expressed the hope that they were capable of steering the country out of the current challenges.\nAddressing the passing out ceremony of probationary officers of the Pakistan Administrative Service (PAS), the prime minister reminded them that after assuming their basic responsibilities in the practical life, they would be confronted with issues like unemployment, poverty, disease, lack of education and delayed response to public problems.\nAppreciating the civil bureaucracy, the prime minister said that he personally knew a number of good officers who had strived to serve the country by shedding their sweat and blood.\nIn a veiled reference to the previous government, the prime minister said baseless allegations were leveled against certain officers which caused embarrassment for their families.\nHe said due to such a situation, the civil bureaucrats, thought twice before taking any step in the performance of their duties which was a real stumbling block.\nThe prime minister stressed that it should be a collective agenda of them all and the political hierarchy to provide an enabling environment to the civil bureaucracy to serve the masses with dedication. If an amicable environment was provided to the civil servants, they could excel with their full potential, he added.\nHe observed that in the world, there was not a difficulty that could be surmounted.\nReferring to the performance of the bureaucracy, the prime minister cited that he had set a two-month target for the civil administration for the establishment of education facilities in one of the flood-affected areas of Balochistan and during his recent visit to the province, he admired them for establishing a smart school within the stipulated timeframe.\nTerming them as ‘Future of Pakistan’, the prime minister expressed the optimism that they would perform with dedication and honesty as the nation had attached expectations to them.\n“Let’s move to transform Pakistan into Quaid’s and strive to turn it stronger. The people will remember you for your yeoman’s service,” he said.\nThe ceremony was attended by Governor Punjab Balighur Rehman, retired judge, officers and a number of families.\nThe prime minister elaborating his viewpoint over the economic challenges faced by the country also regretted that during the past 75 years, different governments whether headed by the political leadership or military dictators could not address the economic issues.\nIn the past, time was wasted with the creation of chaos and protests, he added.\nThe prime minister said that sustainable development goals (SDGs) could be achieved if their bus could have moved at fast pace and on the right track and they could not have sought foreign loans.\nThe prime minister said during his recent visit to the United Arab Emirates, the UAE president had very graciously and affectionally expressed his willingness to grant a further $1 billion loan to Pakistan.\nHe apprised him that Pakistan was passing through economic issues and meeting the International Monetary Fund’s (IMF) conditionalities.\nThe prime minister said that it really embarrassed him to ask for further loans and also lauded the Kingdom of Saudi Arabia for the financial support.\nHe opined that it was a not a right solution to their economic challenges as the loans would be returned back.\nThe prime minister also congratulated the officers of PAS on the completion of their courses and said that they were the brightening stars of the nation, holding keys of country’s future in their hands.\nHe also commended them for serving the flood-affected people and visiting different areas of the country.\nEarlier, Director General Civil Services Academy, Lahore Omer Rasul highlighted the role and contributions of the academy in training the future bureaucrats to serve the county and masses with their capabilities and dedication.\nThe prime minister also gave away certificates to the outstanding officers.",
  "retrievedAt": "2025-08-11T05:44:21.820Z"
}
