{
  "article_id": "2025-10-21_67951ce2ead0d96942d4485aaa06240d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/business/pide-xinjiang-university-sign-mou-to-boost-research-innovation/",
    "retrieved_at": "2025-10-21T11:21:33.721Z"
  },
  "metadata": {
    "title": "PIDE, Xinjiang University sign MoU to boost research, innovation",
    "author": null,
    "date_published": "2025-10-21T16:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 442,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "URUMQI, China , Oct 21 (APP):The Pakistan Institute of Development Economics (PIDE) and Xinjiang University held a symposium and signed a Memorandum of Understanding (MoU) in Urumqi, China, to strengthen academic and research collaboration.\\n\\nThe event marks an important milestone in fostering institutional cooperation, research partnerships, and people-to-people linkages between Pakistan and China under the framework of the China-Pakistan Economic Corridor (CPEC) and the Belt and Road Initiative (BRI), a news release said on Tuesday.\\n\\nThe symposium was chaired by Dr. Liu Zhengjiang, Vice President of Xinjiang University, who also served as the Master of Ceremony.\\n\\nThe session began with the introduction of attendees, followed by the screening of a promotional video highlighting Xinjiang University's academic achievements and international outreach.\\n\\nDr. Ma Xinbin, President of Xinjiang University, delivered the welcome remarks, emphasizing the historic friendship between Pakistan and China and reaffirming both institutions' commitment to advancing cooperation in research, education, and cultural exchange.\\n\\nIn his address, Dr Muhammad Nadeem Javaid, Vice Chancellor of PIDE, emphasized the pivotal role of academic collaboration in promoting regional economic integration, innovation, and sustainable development.\\n\\nHe noted that partnerships such as the one between PIDE and Xinjiang University are vital for generating research-driven policy insights that align with the broader vision of CPEC and the Belt and Road Initiative.\\n\\nFollowing the speeches, both sides engaged in productive bilateral cooperation talks, exploring opportunities for joint research, faculty and student exchanges, capacity-building programs, and policy dialogue on regional economic development.\\n\\nThe ceremony concluded with the signing of the Memorandum of Understanding, symbolizing a shared commitment to fostering academic exchange, collaborative research, and knowledge-sharing initiatives between the two institutions.\\n\\nA group photograph marked the conclusion of the event, capturing the spirit of friendship and cooperation between the two academic communities.\\n\\nKey attendees from PIDE included Dr. Muhammad Nadeem Javaid, Vice Chancellor, PIDE and Member Planning Commission of Pakistan and Dr. Muhammad Muzammil Zia, Executive Director (CPEC).\\n\\nFrom Xinjiang University, participants included Dr. Ma Xinbin, President; Dr. Liu Zhengjiang, Vice President; Naikereman-Yibulayin, Director of International Cooperation and Exchanges; Dr. Li Pu, Dean, School of International Cultural Exchange; Dr. Zeng Yan, Vice Dean, School of Economics and Management; Dr. Xu Jun, Associate Professor, School of Economics and Management; and Dr. Ma Lijuan, Associate Professor, School of Foreign Languages and Interpreter.\\n\\nAlso present was Liu Lei, Board Member of the Xinjiang Diplomacy Association, who expressed the association's continued support for academic initiatives linking scholars, researchers, and policymakers from both countries.\\n\\nThis collaboration between the PIDE and Xinjiang University paves the way for future cooperation in joint academic programs, research publications, student and faculty exchanges, and policy dialogue.\\n\\nIt represents a major step in strengthening academic diplomacy and deepening Pakistan-China relations through shared knowledge, innovation, and sustainable development.\\n\\n",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}