{
  "article_id": "2025-07-29_5b464857e2d6edd3cb72f0d75f8011fc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fc-deployment-at-tobacco-processing-units-a-crucial-first-step-says-ftt-chairman/",
    "retrieved_at": "2025-08-27T10:17:47.149Z"
  },
  "metadata": {
    "title": "FC deployment at tobacco processing units âa crucial first stepâ, says FTT Chairman",
    "author": null,
    "date_published": "2025-07-29T17:38:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 443,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 29 (APP):The governmentas decision to deploy Frontier Constabular (FC) personnel at Green Leaf Threshing (GLT) units in Khyber Pakhtunkhwa has been hailed as a along-overdue but courageous stepa by Muhammad Ameen, Chairman of Fair Trade in Tobacco (FTT), who warned that much more needs to be done to dismantle Pakistanas vast illegal cigarette trade. Speaking to reporters in Islamabad on Tuesday, Ameen welcomed the deployment of 144 FC personnel at GLT facilities a key processing points for raw tobacco a calling it a turning point in efforts to crack down on what he described as a criminal network siphoning nearly Rs. 400 billion annually from the national exchequer. aThere are only 13 GLTs in the country, and they are fully traceable. If we cannot control the tax leakage there, then where?a Ameen asked, urging the Federal Board of Revenue (FBR) to intensify enforcement actions at these sites. The illegal cigarette industry, largely operated by over 40 local manufacturers, accounts for 56% of the market yet contributes only Rs. 5 billion in taxes, according to Ameen. In stark contrast, two multinational companies with 44% market share paid close to Rs. 300 billion last year. aThis is not just a revenue problem; it is a structural sabotage of the economy,a he said. Ameen emphasized that the presence of FC personnel at GLTs is only the beginning. He called for rigorous monitoring of the volume of processed tobacco, its reconciliation with leaf purchases by manufacturers, and close scrutiny of how much adjustable excise duty is ultimately paid. aThis is a national betrayal,a he added, warning that tax theft on such a massive scale is undermining public finances more than the combined federal budgets for education and health. He also criticized the weak enforcement of the governmentas Track and Trace System a a digital monitoring mechanism designed to curb tax evasion a revealing that only 19 out of 413 registered cigarette brands are currently in compliance. aThese numbers speak for themselves. The system must be strengthened and implemented across the board,a he said. With Pakistanas economy facing growing fiscal pressure, Ameen urged authorities to adopt a zero-tolerance policy toward non-compliant manufacturers and ensure continuous enforcement a not just at GLTs, but throughout the supply chain, including warehouses, retailers, and border crossings. aEnforcement must become the new normal,a Ameen said. aWe need audit trails, real-time monitoring, and transparency in tax adjustments to dismantle this parallel economy.a He concluded by highlighting the toll this illicit trade has taken on law-abiding tobacco farmers, particularly in rural areas. aThis is about justice a for growers, for the economy, and for every Pakistani who pays their dues honestly,a he said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}