{
  "article_id": "2025-07-29_479407b3a8495a1166a2b8e8fe7fc1fc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/junaid-chaudhry-launches-ambitious-plan-to-expand-national-shipping-fleet-by-600-in-three-years/",
    "retrieved_at": "2025-08-27T10:20:30.868Z"
  },
  "metadata": {
    "title": "Junaid Chaudhry launches ambitious plan to expand national shipping fleet by 600% in three years",
    "author": null,
    "date_published": "2025-07-29T08:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 318,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 29 (APP):Federal Minister for Maritime Affairs Muhammad Junaid Anwar Chaudhry has launched a major initiative to expand and modernize national shipping fleet as part of efforts to strengthen maritime infrastructure and reduce reliance on foreign vessels. Chairing the agreements' signing meeting, the federal minister said the initiative is designed not only to cut sea freight bill and conserve foreign exchange, but also to support climate-smart maritime practices by strengthening a cleaner, more efficient domestic fleet. The minister said Pakistan plans to increase its shipping capacity by 600% over the next three years, with a focus on incorporating greener technologies and energy-efficient vessels into the state-owned fleet. Under his leadership, the Karachi Port Trust (KPT) and Port Qasim Authority (PQA) have signed separate agreements with the state-run Pakistan National Shipping Corporation (PNSC), pledging financial support for the fleet expansion plan. The agreements were signed by A. Abdullah Zaki, representing KPT's Transition Management Committee, and Rear Admiral (R) Syed Moazzam Ilyas HI(M), Chairman of PQA, with PNSC CEO Syed Jarar Haider Kazmi. The accords were finalized days after a high-level policy meeting chaired by Junaid Chaudhry, in which maritime stakeholders agreed to align fleet modernization with environmental sustainability and national climate goals outlined by the prime minister's office. KPT and PQA officials stressed that modernizing the fleet would not only conserve foreign exchange and enhance trade connectivity but also significantly lower the environmental cost of sea freight by minimizing fuel consumption and enabling compliance with international emission standards. \"This initiative reflects our broader vision to modernize the maritime sector, boost operational efficiency, and introduce advanced technologies across all institutions,\" Junaid Chaudhry said, adding that the government remains committed to transparency and merit-based decision-making. The initiative forms part of Pakistan's efforts to position itself as a regional maritime hub while contributing to global efforts to decarbonize the shipping industry, one of the largest contributors to greenhouse gas emissions worldwide.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}