{
  "title": "PM launches 30 pc targeted subsidy scheme for 20 mln poor families",
  "link": "https://www.app.com.pk/national/pm-launches-30-pc-targeted-subsidy-scheme-for-20-mln-poor-families/",
  "date_published": "2022-03-07T07:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): Prime Minister Imran Khan on Monday launched the Ehsaas Riyayat Ration Scheme aimed at providing a monthly subsidy of 30 percent on daily use items to 20 million households.\nUnder the targeted subsidy for the poor and middle class, the prices of flour, cooking oil, ghee and pulses will be considerably reduced.\nPrime Minister Imran Khan said helping the poor was the best aspect of humanity and was in line with the commandments of Almighty and the teachings of Prophet Muhammad (Peace be upon Him).\nHe expressed satisfaction that the socio-welfare programme of Ehsaas provided financial assistance to deserving people in pandemic, which was acknowledged internationally.\nThe prime minister appreciated the progress of Ehsaas programme with a target to alleviate poverty in the country.\nPM Imran Khan mentioned that 98 percent of the financial assistance under the Ehsaas programme was disbursed among needy women.\nHe said the country could not prosper unless the resources were invested for the uplift of women, particularly their education and health.\nThe prime minister urged the public to pay taxes and vowed that all such money would be spent on their welfare and development.\nWith the surge in global oil prices, he said the rate of commodities in Pakistan were still less compared with rest of the world.\nHe mentioned that the government recently announced a big subsidy on petrol and diesel for the relief of consumers.\nImran Khan said the government’s national health insurance programme was a major step in facilitating the common man in getting free medical treatment.\nPM’s Special Assistant on Social Welfare Senator Sania Nishtar said Ehsaas programme had completed its three successful years in line with the principles of transparency.\nShe mentioned that also under the Ehsaas Kafalat scheme, the distribution of Rs 71 billion of cash assistance would also be initiated.\nDr Nishtar said the Ehsaas programme continued without any break during the pandemic to provide financial support to the deserving segment of society.",
  "retrievedAt": "2025-08-11T14:29:31.750Z"
}
