{
  "title": "Imam asks for formulating strategy to curb outbreak of LSD",
  "link": "https://www.app.com.pk/national/imam-asks-for-formulating-strategy-to-curb-outbreak-of-lsd/",
  "date_published": "2022-03-07T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP):Minister for National Food Security and Research Syed Fakhar Imam on Monday directed the department concerns to formulate strategic and operational plan on emergency basis to curb spread of Lumpy Skin Disease (LSD) and its economic cost to the farmer.\nThe minister was chairing a meeting on curbing the spread of disease in cattle and buffaloes in the country, which was also attended by Federal Secretary Ministry of National Food Security and Research Tahir Khursheed and representatives from livestock departments of all provinces.\nThe minister said that a technical task force will be formulated to develop standard operating procedures to control the spread of diseases. He said that action must be taken on emergency basis to curb the spread and damage of this disease. The minister also asked all the stakeholders for strictly following the guidelines and said that a special task force would be constituted that will meet on daily basis in the first week and then on weekly basis to ensure efficient management of the issue.\nMeanwhile, Animal Husbandry Commissioner Dr Muhammad Akram informed the meeting that 500,000 vaccines to be imported to tackle the spread of LSD, adding that the disease only affected cattle and buffaloes and certain wild animals, which has been confirmed for the first time in Pakistan through clinical and laboratory diagnosis.\nIt was informed that LSD was a viral disease of cattle, buffaloes and certain wild animals causing economic losses due to loss of condition, decreased milk production, abortions, infertility and it also damaged hides. The causative virus is spreading mainly by vectors such as tsetse flies, mosquitoes and ticks. Dr. Akram said that it is widespread epidemic across many countries of Asia, Africa and Europe. Disease can however be successfully controlled by vaccination.\nThe minister was also apprised that the vaccine would be imported, whereas as an alternate goat pox vaccine is being used which has shown great results.\nDirector General Livestock of Sindh Province Dr Nazeer Hussain told that about 18,000 animals were diagnosed with LSD in the province and approximately 3,500 animals have been recovered. He said that the virus was spread in major cities such as Karachi, Hyderabad and Thatta.\nRepresentative of Punjab Livestock Department said that the movement of animals from the affected areas has been banned to ensure the outbreak of virus in other cities.",
  "retrievedAt": "2025-08-11T14:29:22.743Z"
}
