{
  "title": "Women’s emancipation linked with their economic empowerment: President",
  "link": "https://www.app.com.pk/national/womens-emancipation-linked-with-their-economic-empowerment-president/",
  "date_published": "2022-03-07T10:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 7 (APP): President Dr Arif Alvi on Monday terming economic empowerment a major contributory factor in women’s emancipation said huge responsibility lay on the society to help women thrive in their fields by ensuring them a safe environment.\nAddressing here at an event in connection with International Women’s Day, the president said both Islam and the Constitution of Pakistan provided equal rights to women and allowed their participation in professional and social domains.\nBegum Samina Alvi also attended the event themed ‘Gender equality today for a sustainable tomorrow’, which was jointly organized by United Nations Women, UN Population Fund, European Union, UKAid and the government of Canada.\nPresident Alvi said with the example of Hazrat Khadija, the wife of Prophet Muhammad’s (Peace be upon Him) as a businesswoman, there was no bar on the women including in Pakistan to indulge in entrepreneurship.\nHe called upon women entrepreneurs in the country to benefit from the modern information technology and explore the global markets.\nHe, however, stressed the need for ensuring freedom to women at public spaces so as to help them perform their duties comfortably and without any stress of social pressures.\nThe president expressed satisfaction over the steps taken by the government for emancipation of women including programmes for financial and digital empowerment, amendments in property rights law and strong legislative framework regarding the incidents of rape and acid crimes.\nHe mentioned that banks at present were offering loans especially to women to help them become financially self-reliant.\nTo control the cases of harassment and exploitation, he said instant verdict by the courts was crucial to avert nonappearance and reluctance of witnesses, which ultimately benefited the culprit.\nPresident Alvi said Quaid-e-Azam Muhammad Ali Jinnah was a great supporter of women’s rights and always favoured their inclusion in national mainstream being the representative of half of the population.\nFederal Minister for Human Rights Dr Shireen Mazari said Women’s Day was the time to celebrate womanhood, mark their progress and realize their challenges.\nShe said the women in Pakistan were progressing, may it fighter pilots or musicians, who made mark in their respective fields.\nDr Mazari stressed that society needed to give breathing space to women and also allow them to raise voice for themselves, whether through the platforms of Aurat March or Hijab March.\nShe mentioned that her ministry had broadened the scope of harassment law especially by defining the definition of workplace.\nEuropean Union Ambassador Androulla Kaminara said it was significant for Pakistan to ensure equality of women in the society and stressed joint efforts of all stakeholders towards achieving the goal.\nShe emphasized importance of women’s representation in parliament and their inclusion in climate-related initiatives.\nShe said 85 percent of EU programmes were focusing on gender equality, particularly relating to economic empowerment and skill development of women.\nPresident Alvi and Begum Samina also visited the stalls of handicraft set up on the occasion showcasing the craft of women entrepreneurs.",
  "retrievedAt": "2025-08-11T14:29:28.344Z"
}
