{
  "title": "Mazari reaffirms national & int’l commitments for protection of women rights",
  "link": "https://www.app.com.pk/national/mazari-reaffirms-national-intl-commitments-for-protection-of-women-rights/",
  "date_published": "2022-03-07T18:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 07 (APP): Federal Human Rights Minister Dr Shireen M Mazari has reaffirmed national and international commitments for the protection of women’s rights with especial emphasis on this year’s theme “gender equality today for a sustainable tomorrow”, recognizing the contribution of women and girls around the world, who are leading the charge on climate change adaptation, mitigation and response to build a more sustainable future for all.\nThe minister, in a message on the occasion of International Women’s Day, said it was unfortunate that Pakistan was among the top 10 most vulnerable countries to climate  change and the more alarming was that adverse climate change had direct impact on women and their economic and social prosperity.\nIn Pakistan, she said, “a significant portion of our workforce, specifically comprising women, is directly involved in the agriculture sector and resides in rural areas. In the aftermath of increasing droughts, rising temperatures and seasonal flooding, working women often find themselves without access to land, shelter and means of food production.”\nMazari said,”On this day, I would like to congratulate not just the women of Pakistan but women all over the world for their relentless efforts and sacrifices which they have made and are still making to free this world from discrimination, inequality and gender biases.”\nShe said as part of the positive measures taken by the Ministry of Human Rights in light of the Covid-19 pandemic, special emphasis was placed on the protection and welfare of women.  The ministry, she said, had played a leading role in spreading awareness among women, including women in prisons and victims of gender based violence.\nThe ministry had also initiated a rigorous gap analysis of Pakistan’s Covid-19 response with a human rights perspective to identify areas where Covid-19 or its preventive measures have led to violations in human rights of certain population groups, she added.\n“We are committed to protect women’s social, political and economic rights with particular focus on marginalized women. In this regard, discriminatory laws against women are being amended continuously with the support of women parliamentarians.”\nShe said the present government had taken concrete steps towards strengthening legislation to address issues such as violence against women, domestic abuse, harassment, social protection, economic participation and inheritance.\nThe Islamabad Capital Territory Senior Citizens Act, 2021, ICT Rights of Persons with Disability Act, 2020, Legal Aid and Justice Authority Act, 2020, Protection against Harassment of Women at the Workplace (Amendment) Act, 2022, Zainab Alert, Response and Recovery Act 2019, Protection of Journalist and Media Professionals Act, 2021, The Protection of Women’s Property Rights Act 2020, the Letters of Administration and Succession Certificates Act 2020 were significant pieces of legislation passed by the present government for the protection of human rights including women rights, the minister added. Dr Mazari said,”The Ehsaas Programme is our flagship social protection programme designed to provide social assistance to women and improve financial inclusion and economic empowerment of women.\n“I would like to emphasize that a lot still needs to be done, and the foremost step is to bring a positive change in the attitude of men towards women in Pakistan. Affirmative actions are being taken to sensitize and bring awareness amongst our citizens about the women’s rights protected under the Constitution of Pakistan and as well under the many international conventions ratified by Pakistan,” she said.\nThe minister said she also urged the international community, United Nations agencies and NGOs (non-governmental agencies) to play their due role to stop the massive human rights’ violations in the Illegally Indian Occupied Jammu and Kashmir, including abuse and mass violence against Kashmiri women.\n“The world must also act against the deprivation of Muslim women’s rights in India today as a deliberate policy of the BJP government. There cannot be a selective approach to women rights by the international community,” she concluded.",
  "retrievedAt": "2025-08-11T14:29:33.065Z"
}
