{
  "title": "Over 14,000 security personnel to safeguard gatherings during Muharram",
  "link": "https://www.app.com.pk/national/over-14000-security-personnel-to-safeguard-gatherings-during-muharram/",
  "date_published": "2023-07-19T07:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP):The Capital police have made security plan for the upcoming processions and religious gatherings during holy month of Muharram and a total of 14,000 security personnel would be deployed to safeguard faithfuls in the city.\nUnder the special directives of Islamabad Capital Police Officer (ICCPO) Dr. Akbar Nasir Khan, the police had finalized the plan for holy month, a police spokesman said.\nThe plan received formal approval after a thorough review, and all wings of the police had been instructed to ensure seamless coordination to ensure the success of the plan, he added.\nDIG (Operations) Syed Shehzad Nadeem Bukhari directed all relevant officials to maintain close communication with peace committees and organizers of Majalis and processions.\nHe directed to ensure cooperation with the police and law enforcement officials to facilitate smooth security operations.\nThe federal capital is set to witness a total of 181 religious gatherings (Majalis) and 965 processions during the holy month.\nThe DIG issued strict orders for enhanced security arrangements during the religious gatherings, including thorough checks of participants.\nWalk-through gates are to be installed at the entrance points of Majalis to ensure efficient screening.\nMetal detectors will be utilized to thoroughly screen participants at Majalis and processions.\nThe police, along with peace committees, are to exercise strict vigilance to ensure effective security measures.\nIn addition to the Police, Rangers and FC would provide assistance to ensure elaborate security arrangements.\nThe DIG has instructed all Zonal DPOs, SDPOs, and officers in charge of police stations to arrange proper lighting in coordination with relevant authorities and clear bushes near the places of worship.\nTo maintain order and safety, the processions will strictly adhere to predetermined routes and timings, and effective patrolling, including the use of commando vehicles, will be implemented.\nThe CPO emphasized the significance of close coordination among all wings of the police.\nThe traffic staff is directed to ensure arrangements that avoid any inconvenience to road users, and special deployments will facilitate the smooth flow of traffic during alternate routes when processions take place.\nParking lots will be situated at a considerable distance from the processions, with proper security arrangements and the use of metal detectors at entry and exit points to enhance safety measures.",
  "retrievedAt": "2025-08-11T08:57:22.192Z"
}
