{
  "title": "On new Islamic year, PM urges countrymen to promote tolerance, social justice",
  "link": "https://www.app.com.pk/national/on-new-islamic-year-pm-urges-countrymen-to-promote-tolerance-social-justice/",
  "date_published": "2023-07-19T14:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 19 (APP): On the advent of the new Islamic year on Wednesday, Prime Minister Shehbaz Sharif urged countrymen to strive for emulating the noble teachings of the Holy Prophet Muhammad (PBUH) and his companions besides building a society featuring principles of social justice and equality.\n“Let us pledge today that we will strive to emulate the noble qualities established by our Prophet Muhammad (PBUH) and his companions. Let us promote tolerance, understanding and respect for each other regardless of our differences. Let us work towards building a society that upholds the principles of social justice, equality and compassion,” the prime minister said in his message to the nation at the start of Hijri year 1445.\nExtending greetings to the nation and the whole Muslim Ummah, the prime minister prayed to Allah Almighty that the new Islamic year proved to be a year of peace, progress and prosperity for Pakistan as well as the Muslim world.\nHe also prayed that the new year also brought ease to the lives of Muslims suffering across the world and people of Kashmir and Palestine got deliverance from oppression and achieve peace, progress and prosperity.\nHe said the new Islamic year also reminded the moments when the family of the Prophet Muhammad (PBUH) sacrificed their lives under the leadership of Hazrat Imam Hussain (RA) and became immortal in the battle between truth and falsehood.\nThe prime minister said that Imam Hussain (RA) and his companions sacrificed their lives to uphold the principles of truth and justice, and his unwavering belief against oppression and tyranny was an everlasting example of courage and sacrifice.\nHe said the said events were also a reminder of the values ​​of compassion, justice, and unity which also taught the followers to stand up against injustice and oppression besides working for a society featuring peace, harmony, and co-existence.\nPrime Minister Shehbaz said that Allah Almighty had reduced the economic difficulties of Pakistan consequent to the government’s hard work and prayed for the country’s permanent riddance from the economic problems.\nHe prayed to Allah Almighty to make Pakistan a cradle of progress and prosperity and that the whole nation got united setting aside their differences.",
  "retrievedAt": "2025-08-11T08:57:05.517Z"
}
