{
  "title": "National IT seminar to converge efforts for IT growth; its role in sustainable development",
  "link": "https://www.app.com.pk/national/national-it-seminar-to-converge-efforts-for-it-growth-its-role-in-sustainable-development/",
  "date_published": "2023-07-19T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 19 (APP): A national Information Technology (IT) seminar and the soft launch of related projects will be held here on Thursday which would help converge efforts to achieve a shared objective for fostering an environment conducive to IT growth, due to its paramount role in shaping knowledge-based economy and ensuring sustainable development of Pakistan.\nThe seminar would be attended by Prime Minister Muhammad Shehbaz Sharif as the chief guest while Chief of Army Staff General Syed Asim Munir would be the guest of honour, PM Office Media Wing said in a press release.\nThe seminar will be attended by ministers of planning, development & special initiative, foreign affairs, finance, defense, defense production, information technology and telecommunication, information and broadcasting, chief ministers of Punjab, Sindh, KPK and Balochistan, governor State Bank of Pakistan, chairman Federal Board of Revenue, IT experts, military and civil officials.\nThe foreign dignitaries including diplomats and industry leaders from Gulf Countries, China and EU will also attend the seminar.\nNational IT seminar is a unique opportunity for all stakeholders to collaborate for sustainable and profitable future especially in the field of IT.\nThe seminar is being arranged under the ambit of Special Investment Facilitation Council (SIFC) which will focus on five major economic sectors including defense production; agriculture; mines & minerals, energy sector and IT industry, the press release said.\nThe immense potential of IT industry can also galvanize other industries through automation, digitization, Business Process Reengineering (BPR) and integration of Artificial Intelligence (AI).\nThe seminar will also elaborate the impact of new budget on IT sector, industry landscape, measures to increase IT exports from short to mid term, development of requisite skills set, efforts to attract foreign investment and issues being faced by enterprises and startups.\nImpact of SIFC on continuity of policies and ease of doing business will also be highlighted.\nThe seminar will include display of stalls by major IT companies of Pakistan and successful startups along with soft launch of Tech DestiNation Pakistan, Techlift Boot Camp, 1st Knowledge Park for Women Bagh (AJ&K), Agri Tech Incubator Faisalabad and Center of Excellence in Gaming and Animation.",
  "retrievedAt": "2025-08-11T08:57:05.648Z"
}
