{
  "title": "Global South Civil Society Month of Action on Heatwaves to begin on February 14",
  "author": null,
  "content": "ISLAMABAD, Feb 10 (APP):The Global South Civil Society Month of Action on Heatwaves will officially commence on February 14, bringing together civil society, experts, and community leaders to raise a unified voice against the causes, losses, and damages caused by heatwaves.\nHeatwaves, intensified by climate change, were becoming more frequent, prolonged, and severe, disproportionately affecting communities with limited resources to adapt.\nThe Global South, which contributes the least to global greenhouse gas emissions, suffers the most from rising temperatures, water shortages, crop failures, and heat-related health crises.\nThe Global South Month of Action on Heatwaves will be marked across Africa, Asia, Europe and Fareast and other regions with an objective to amplify the civil society voice urging the Global North to take necessary measures urgently to save lives in the Global South.\nThroughout the month, civil society organizations, activists, researchers, and policymakers would engage in various advocacy campaigns, media interactions, and community-driven initiatives to demand action on heatwaves.\nThe campaign seeks to ensure that climate adaptation and resilience-building remain at the forefront of global policy discussions.\nDevcom-Pakistan Executive Director Munir Ahmed has been designated as the Regional Director Asia for the Global South Civil Society on Heatwave on a voluntary-basis.\nSpeaking on the urgency of the issue on Monday, he emphasized the responsibility of industrialized nations in addressing the crisis.\nMunir Ahmed said: “The Global North must act now to control Greenhouse Gas emissions and allocate funds to save the lives of vulnerable Global South communities from extreme heatwaves.\nEvery delay in action translates to more deaths, displacement, and destruction. The industrial states must acknowledge its historical responsibility and provide the necessary financial and technical resources to mitigate the worsening impacts of climate change.\nThe Global South Month of Action on Heatwave is a crucial moment to consolidate our voices and demand urgent global responses to this escalating crisis.”\nDr. Carlos Ferreyra, the visionary behind the initiative, highlighted its key objectives: “The Global South Month of Action on Heatwave is a unified movement designed to draw international attention to the catastrophic consequences of heatwaves and to demand immediate, effective policies to counteract them.\nOur aim is to create a consolidated civil society voice that pushes for climate justice, enhanced adaptation measures, and increased financial support for the most affected regions. Governments, international institutions, and climate stakeholders must step up to protect vulnerable populations from the life-threatening impacts of extreme heat.”\nThroughout the month, civil society organizations, activists, researchers, and policymakers will engage in various advocacy campaigns, media interactions, and community-driven initiatives to demand action on heatwaves.\nThe campaign seeks to ensure that climate adaptation and resilience-building remain at the forefront of global policy discussions.\nAdding a scientific perspective to the campaign, Dr. Ghulam Rasool, former Director General of the Pakistan Meteorological Department, underscored the increasing severity of heatwaves due to climate change: “Scientific data from recent years clearly indicates that heatwaves are intensifying, with rising temperatures breaking historical records.\nThe Global South is experiencing unprecedented levels of heat stress, leading to severe health impacts, agricultural losses, and water scarcity.\nWithout immediate action to reduce greenhouse gas emissions and implement large-scale adaptation measures, millions will face unbearable living conditions.\nThe Global South Month of Action on Heatwave is a crucial platform to push for data-driven policies that prioritize the protection of human lives and ecosystems.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:34:34.802Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/global-south-civil-society-month-of-action-on-heatwaves-to-begin-on-february-14/",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T12:41:00.000Z"
}
