{
  "title": "IPDS,  IICA sign MoU to boost Central Asia-South Asia ties",
  "author": null,
  "content": "ISLAMABAD, Feb 10 (APP): The Institute of Peace and Diplomatic Studies (IPDS) and Uzbekistan’s International Institute for Central Asia (IICA) on Monday signed a Memorandum of Understanding (MoU) marking a significant step towards enhancing regional cooperation between Central Asia and South Asia.\nThe two institutes discussed various subjects related to enhancing Pakistan and Uzbekistan’s relationship, including trade and investment, cultural heritage, education, and climate change challenges.\nWelcoming the delegation, Dr Farhat Asif, President of IPDS, emphasized the institute’s commitment to fostering dialogue, research, and collaboration on pressing international issues. She focused on the importance of intellectual and institutional ties between Central and South Asia, noting that this partnership will contribute to regional connectivity, peace, and prosperity.\nSpeaking at the event, Ambassador Javlon Vakhabov reaffirmed IICA’s dedication to strengthening partnerships across South Asia. He emphasized the historical and economic linkages between the two regions, pointing out that while these connections remain underutilized, they hold immense potential for collaborative growth. He further noted that, in an era of shifting geopolitical landscapes, deepening engagement between Central and South Asia is not just advantageous but imperative.\nThe MoU between IPDS and IICA establishes a framework for joint research, academic exchanges, policy dialogues, and capacity-building programs. This collaboration will address key regional challenges, including trade, connectivity, security, and cultural diplomacy, fostering knowledge-sharing and policy innovation. The agreement signifies a commitment to institutionalizing shared objectives and deepening cooperation on issues of mutual interest.\nAmbassador Javlon Vakhabov discussed fostering cooperation between Central Asia and South Asia and provided insightful perspectives on the future of regional integration. He stressed the need for sustainable partnerships and strategic initiatives to unlock economic and diplomatic opportunities.\nBoth sides, during the discussion, shared about the possible practical steps to enhance partnership to higher levels by exchanging opportunities and insights. There is a need for regular exchange between both countries, especially scholars and practitioners, for fostering dialogue and cooperation, they added.\nIPDS and IICA shared their dedication to bringing this partnership to fruition. “This MoU is not merely a formal agreement but a testament to a sustained commitment toward regional cooperation and shared prosperity,” they noted. Moreover, they highlighted how the platform has continuously fostered discussions that shape strategic policies, diplomatic initiatives, and global developments, bringing together diplomats, policymakers, and scholars in meaningful discourse.\nThe Uzbek delegation is currently in Pakistan and meeting various think tanks and scholars to open new doors for cooperation and strengthen collective efforts in advancing diplomacy, policy research, and regional connectivity between Central and South Asia.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:33:42.928Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ipds-iica-sign-mou-to-boost-central-asia-south-asia-ties/",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T14:42:00.000Z"
}
