{
  "title": "From chaos to convenience:Online cabs transform Capital transportation",
  "author": null,
  "content": "ISLAMABAD, Feb 10 (APP):The advent of online cab services had brought a sigh of relief to commuters in Islamabad, providing a convenient and reliable transportation solution.\nFor years, residents of the capital city have struggled with inadequate public transportation, relying on overcrowded buses and taxis that often refuse to use meters. However, with the launch of online cab services, commuters could now book rides with ease, using their smartphones.\nSaira Ahmed a student shared her experience of switching to online cab services saying “I was getting so frustrated with the taxi drivers who would always refuse to take me to my destination,but now with online cab service , I could just book a ride and get to where I need to go without any hassle.”\nThe online cab services had been a game-changer for her as no longer she has to worry about finding a taxi or negotiating fares adding that It’s all so convenient and hassle-free, she stated.\nShe continued that online cab services have not only provided a convenient transportation solution but have also improved road safety, with GPS tracking and real-time monitoring, commuters can feel secure during their journeys.\nAbdul Sammad,  an online cab driver said that the popularity of online cab services has also created new economic opportunities for drivers.\nMany drivers had switched from traditional taxi services to online cab services, citing better earning potential and more flexible working hours.\nHe further stated that “I used to drive a taxi, but I would often go hours without getting a fare,But now, with online can service, I could get multiple fares in a single day. It’s been a huge improvement for me financially.”\nWith their convenience, reliability, and safety features, online cab services were bringing relief to commuters and creating new economic opportunities for drivers,he said.\nHe told that he was skeptical at first, but online cab services had really improved his  livelihood adding that he got more fares and he can support his family better.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:35:11.000Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/from-chaos-to-convenienceonline-cabs-transform-capital-transportation/",
  "dateList": "2025-02-10",
  "date_published": "2025-02-10T10:36:00.000Z"
}
