{
  "title": "President, PM, DPM felicitate nation, scientists as Pakistan launches first space mission ICUBE-Q",
  "link": "https://www.app.com.pk/national/president-pm-dpm-felicitate-nation-scientists-as-pakistan-launches-first-lunar-satellite/",
  "date_published": "2024-05-03T11:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):President Asif Ali Zardari, Prime Minister Shehbaz Sharif and Deputy Prime Minister and Foreign Minister Ishaq Dar on Friday felicitated the nation and the scientists as Pakistan launched it first lunar mission ICUBE-Q.\nThe president and the prime minister, in the separately issued statements, paid tribute to the core committee of the Institute of Space Technology including its member Dr Khurram Khurshid, SUPARCO, China’s space body and the students who took part in the project.\n“The successful launch of the space mission will prove to be a milestone in Pakistan’s space programme. The whole nation feels proud for this significant achievement in the space technology,” he remarked.\nThe president also lauded cooperation between Pakistan and China in the field of space, and said Pakistan had yet to achieve more milestones in the sector.\nPresident Zardari expressed the hope that Pakistan’s space research institutes and scientists would bring more laurels to the country through their enhanced hard work, dedication and planning.\nPrime Minister Shehbaz Sharif said the Pak-China friendship, which was dubbed as higher than Himalayas, deeper than the oceans and sweeter than the honey, had gone beyond the borders to reach the space.\nTerming the ICUBE-Q launch Pakistan’s first step in the space, he said just like the nuclear field, the country’s scientists, engineers and experts were proving their mettle in the space technology as well.\nThe acceptance of Pakistan’s mission among eight countries was the recognition of the capabilities of Pakistan’s scientists and experts, he added.\n“This is a historical milestone in the technological development. By this achievement, Pakistan has entered a new era of exploring the space for productive purposes,” the prime minister said as he watched the launching ceremony live on Pakistan Television and expressed his pleasure for Pakistan joining the nations which have sent lunar satellites.\nPrime Minister Shehbaz said that the achievement would help build Pakistan’s capacity in the satellite communications, besides opening up new avenues for scientific research, economic development and national security.\n“Our sons of the soil have proved that they have the capability, passion and expertise to explore the space. God willing, Pakistan will achieve excellence in the fields of space and economy too as it had done in the field of nuclear technology on May 28, 1998. By realising the dream of self-dependence in the communications infrastructure, Pakistan will join the comity of nations playing a leading role in the sector,” he remarked.\nCalling Pakistan’s development in science and technology, modern sciences and skill development the need of the hour, the prime minister reiterated the resolve to uplift the youth in the said fields to ensure that the country achieved excellence in the field of inventions.\nIn a separate statement, Deputy Prime Minister and Foreign Minister Ishaq Dar also congratulated the young Pakistani students and scientists on the launch of lunar orbital mission ICUBE-Q.\n“Today’s launch from Hainan in China, is a good example of countries and organizations coming together for space cooperation and shared benefits. It shows the promise of Pakistani youth,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:17:18.484Z"
}
