{
  "title": "ICT admin, ILO call for better rights for workers",
  "link": "https://www.app.com.pk/national/ict-admin-ilo-call-for-better-rights-for-workers/",
  "date_published": "2024-05-03T13:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):The Islamabad Capital Territory Administration organized an event on Friday in collaboration with International Labour Organization (ILO) to celebrate Labour Day with a focus to improve and work for better workers’ rights.\nThe event was attended by various dignitaries, including the Additional Deputy Commissioner East, Usman Ashraf, and Commissioner Social Security Hospital, Rabia Aurangzeb, and others.\nIn her address, Commissioner Social Security Hospital, Rabia Aurangzeb  underscored the need for organizations to prioritize the health and well-being of their workers.\nShe stated that “no nation can make progress unless its workers do have better rights.”\nShe said that her department was committed to providing quality healthcare services to labourers.\nDr. Shahzad Ali Khan, Vice-Chancellor of the Health Services Academy, reinforcing his institution’s support for social security and the ongoing efforts to address workers’ health issues.\nHe mentioned that their academy was fully prepared to make significant contributions to improving the welfare of workers and that Labour Day served as a crucial reminder of the challenges they face.\nILO Country Director Ger Thomas also attended the event, acknowledging the rapid growth of issues like climate change, economic instability, and unemployment.\nHe stressed that workers were the backbone of the economy, and their welfare required the cooperation of all stakeholders. According to Thomas, efforts to ensure workers’ rights and well-being were central to building a better society.\nOn the occasion, Member National Assembly Anjum Aqeel Khan discussed the implementation of labour laws in Pakistan, stating that while they exist, enforcement remains inconsistent.\nHe highlighted that labour is the “capital of the country” and announced plans to give bonuses to hardworking workers.\nHe also expressed his commitment to ensuring working women receive full rights and protection.\nAddressing the audience, Deputy Commissioner Islamabad, Irfan Nawaz Memon, urged people to commit to treat their subordinates better and highlighted that many security guards were hired by companies but receive low wages.\nMemon’s address called for a broader shift in attitudes toward workers, emphasizing that real change starts from within the home. The event also included discussions about health risks faced by workers in Pakistan.\nOverall, the Labour Day event in Islamabad served as a platform to honor the hard work of labourers while calling for improved treatment and recognition of their contributions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:17:14.069Z"
}
