{
  "title": "Pakistan marks World Press Freedom Day",
  "link": "https://www.app.com.pk/national/pakistan-marks-world-press-freedom-day/",
  "date_published": "2024-05-03T17:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 3 (APP): The World Press Freedom Day observed across the world including Pakistan on Friday to celebrate hard work, dedication and services of the journalists for bringing positive change in the society by unearthing truth.\nA number of walks, events and special ceremonies were held across the country including Azad Jammu Kashmir (AJK) to uphold the international right of press freedom and promoting responsible journalism.\nIn Islamabad, the Press Council of Pakistan (PCP), National Press Club and other media organizations held seminars, walks and special events to recognize the contributions of journalists’ community to the society, and also highlight importance of responsible journalism.\nPresident Asif Ali Zardari has emphasized the need to initiate measures for the safety and security of the journalists enabling them to freely report on important issues, without fear.\n“The Constitution of Pakistan guarantees the freedom of the press; however, it is also the responsibility of the media to abide by journalistic ethics and report responsibly and accurately, keeping in view the national interest,” the president said in his message on the occasion of the World Press Freedom Day.\nPrime Minister Shehbaz Sharif, in his message, assured that the incumbent government would make all-out efforts to uplift the media industry and resolve the issues confronting it.\nThe prime minister also reiterated the resolve for government’s maximum cooperation to protect the rights of media industry as well as the media workers.\nHe paid tribute to the journalists, media workers, writers and cameramen and lauded their fight for truth.\nChairman Senate Syed Yusuf Raza Gilani called for collective working for the collective rights and welfare of the journalist community.\nOn the World Press Freedom Day, the Senate Chairman extended his profound acknowledgement and commendation to journalists in Pakistan and across the globe for their invaluable contributions to society.\n“On this important day, let us reaffirm our shared commitment to guarding and sustaining freedom of the press which plays a pivotal role in upholding democracy, promoting accountability, and providing a platform for diverse voices”, he said.\nChairman Pakistan People’s Party (PPP) Bilawal Bhutto Zardari has extended sincere solidarity to journalists and media professionals worldwide on World Press Freedom Day.\nEmphasizing the paramount importance of press freedom, he reaffirmed his party’s staunch support for the invaluable role of a free and independent press in fostering democracy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:16:23.529Z"
}
