{
  "title": "Pakistan’s historic lunar mission launched onboard China’s Lunar probe",
  "link": "https://www.app.com.pk/national/pakistans-historic-lunar-mission-launched-onboard-chinas-lunar-probe/",
  "date_published": "2024-05-03T12:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP): Institute of Space Technology (IST) a leading high-end university of Pakistan had the distinct honor of launching a Cube Satellite ICUBE-Qamar (ICUBE-Q) in Lunar orbit onboard the China’s Chang `E-6 Mission on Friday at 14:18 PST from Wenchang Space Launch Site, Hainan, China.\nCubeSats are a class of small satellites used by academic institutes for experimental and research purposes in Low Earth Orbits, generally with an altitude of less than one thousand km.\nHowever, these satellites are now finding many applications in higher orbits and deep space missions. Moon is in an elliptical orbit at an average distance of around 384 thousand km from the earth which makes it challenging to communicate with and control small satellites.\nAccording to a news release issued by IST, the opportunity to release CubeSat in Lunar orbit from Chang-E`6 mission was offered by China National Space Agency (CNSA) through Asia Pacific Space Cooperation Organization (APSCO) to APSCO member states.\nAfter thorough evaluation, Pakistan’s proposal was accepted out of all APSCO member states.\nThe design, development and qualification of ICUBE-Q was led by faculty members and students of the IST in collaboration with China’s Shanghai Jiao Tong University (SJTU) and support from Pakistan National Space Agency SUPARCO.\nICUBE-Q carried two cameras as payload for imaging Lunar surface and Earth/Moon images from Lunar orbit besides having 3-axis altitude control for desired orientation, onboard computer, thermal control, telemetry and tele-command and payload data communication modules for connecting through deep space network.\nChang’E6 rocket will take five Earth days to reach Moon orbit. ICUBE-Q will be deployed on May 08 in a carefully selected 12-hour elliptical orbit that will allow imaging of the desired Lunar surfaces.\nIST is a federally chartered university that pioneered the development of CubeSats in Pakistan by launching its first CubeSat “ICUBE-1” in Low Earth Orbit in November 2013.\nAccording to the Head of Electrical Engineering and Computer Science Department at IST and co-lead on the satellite project, Khurram Khurshid, “This is Pakistan’s first deep space mission which is a historic moment that would pave the way for launching other deep space missions in the future.\nAround 100 students, along with the faculty members, contributed to various aspects of the satellite, including electrical engineering for electronics, aerospace engineering for control systems, computer science for software and mechanical/materials engineering for identifying materials suitable for the moon’s harsh environment, he said.\nAccording to the timeline of the launch of Chang’e 6 probe, at 5:27pm (BJT) on May 03, the Long March 5 Y8 rocket, carrying Chang’e-6 spacecraft, blasted off from Wenchang Space Launch Site.\nAbout 37 minutes after the liftoff, the Chang’e 6 probe separated from the rocket, and was sent to the Earth-Moon transfer orbit with a perigee of 200km and an apogee of about 380,000km.\nNext, it will make a soft landing on the far side of the Moon, to collect lunar samples and carry out scientific detection work.\nAfter the samples are sealed in a container, the ascender will take off from the moon and dock with the orbiter-reentry capsule combination in lunar orbit. The re-entry capsule will then carry the samples back to Earth. The entire process is expected to last about 53 days.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:16:53.221Z"
}
