{
  "title": "Senate Chairman calls for collective work to ensure welfare of journalist community",
  "link": "https://www.app.com.pk/national/senate-chairman-calls-for-collective-work-to-ensure-welfare-of-journalist-community/",
  "date_published": "2024-05-03T10:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 03 (APP):Chairman Senate Syed Yusuf Raza Gilani on Friday called for collective work for the rights and welfare of the journalist community in the country.\nOn the World Press Freedom Day, the Senate Chairman extended his profound acknowledgement and commendation for journalists in the country and across the globe for their invaluable contributions to society.\n“On this important day, let us reaffirm our shared commitment to guarding and sustaining freedom of the press which plays a pivotal role in upholding democracy, promoting accountability, and providing a platform for diverse voices”, he said.\nThe Chairman Senate said : “As someone who has studied journalism, I have a personal connection to this noble profession and a deep appreciation for the dedication and courage of journalists. Their work is central to the democratic values we hold dear.”\nFrom conflict zones to areas afflicted by violence and unrest, journalists across the world are doing a remarkable job braving all risks and obstacles with integrity and bravery while maintaining the highest standards of professional excellence, he said.  “We must ensure they can do their jobs without fear or intimidation” he added.\nThe Senate Chairman called for protecting press freedom and creating a safe environment for journalists. He said the government and the public to support journalists and recognize their role in promoting transparency and justice.\n“Press freedom is a cornerstone of robust and progressive democracy and a key driver of inclusive progress. On this World Press Freedom Day, let’s honor those who bring us the news and let us commit to safeguarding their rights,”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:17:20.514Z"
}
