{
  "title": "Govt. to revamp passport policy for ‘married women’",
  "link": "https://www.app.com.pk/national/govt-to-revamp-passport-policy-for-married-women/",
  "date_published": "2024-05-23T10:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP):Director General Immigration and Passports, Mustafa Jamal Kazi said on Thursday that a committee was formed to revamp passport policy, pertaining to the condition of a “married woman’s” passport bearing the name of her husband instead of the father.\nThe committee was tasked to address discrepancies between the policies of the National Database and Registration Authority (Nadra) and the passport issuing authority regarding married women, Kazi told a private news channel.\nHe said according to current policy a married woman’s passport bear her husband’s name instead of her father’s that raised concerns about contradictions between the policies of these two institutions and perceived discrimination against women.\nThe DG Passport further explained that while Nadra’s registration is local and used only within Pakistan, a passport is an international document and must comply with international agreements.\n“Women often face difficulties when their passports use their father’s name, especially when traveling with their children without the children’s father.\nThis can complicate establishing the biological relationship,” said Kazi.\nHe noted that the passport authority has faced litigation in recent years due to issues arising from undeclared divorces.\nAccording to the law, citizens must register and declare both marriage and divorce, but problems occur when these events are not officially documented and complicating custodianship matters, he added.\n“It is legal for a married woman to enter her husband’s name along with her own in the passport,” Kazi said, emphasizing the need for proper registration and documentation to avoid complications.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:41:10.422Z"
}
