{
  "title": "Acting President stresses to continue work for preserving biodiversity",
  "link": "https://www.app.com.pk/national/acting-president-stresses-to-continue-work-for-preserving-biodiversity/",
  "date_published": "2024-05-23T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP):Acting President Yusuf Raza Gilani has stressed the urgent need to continue work in preserving biodiversity and addressing the challenges posed by climate change.\nThe Acting President, in his message in connection with the International Day of the Markhor, said, “Our efforts to protect the Markhor have involved not just government’s action but also the active participation of local communities and international partners.”\n“As we observe the International Day of the Markhor, we celebrate more than just the survival of an iconic species; we celebrate the spirit of resilience and the power of collective action”, he said.\n“The Markhor, our national animal, is a symbol of Pakistan’s natural beauty and our dedication to environmental stewardship.”\nHe said the United Nations’ recognition of May 24 as the International Day of the Markhor highlighted the importance of conserving the magnificent species and its habitat.\n“The Markhor’s journey from near extinction to a growing population is a story of hope and an exemplary model of successful conservation.”\nHe said Pakistan, as a committed signatory to the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES), proudly announced its elevation to CITES Category I.\nThis elevation, achieved through rigorous legislative and enforcement measures, was a resounding affirmation of “our dedication to the wildlife conservation”, he added.\n“Let us celebrate this day by renewing our pledge to protect our wildlife and natural habitats. Together, we can ensure that the Markhor continues to thrive in the mountains of Pakistan and that our environment remains healthy and vibrant for future generations,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:40:15.367Z"
}
