{
  "title": "Edu ministry requests Power Division for provision of uninterrupted electricity in ICT Schools amid heatwave",
  "link": "https://www.app.com.pk/national/edu-ministry-requests-power-division-for-provision-of-uninterrupted-electricity-in-ict-schools-amid-heatwave/",
  "date_published": "2024-05-23T09:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 23 (APP):Ministry of Federal Education and Professional Training has requested the Power Division (Ministry of Energy) to ensure the provision of uninterrupted electricity in the government schools of Islamabad Capital Territory (ICT) in order to save the students especially till Grade-5th from the scorching heat wave.\nAccording to the details, in this regard Secretary, the Ministry of Federal Education has written a letter to the Ministry of Energy (Power Division), drawing the attention of relevant authorities towards power outrage during school hours in ICT.\n“Thousands of students at present are studying in more than 400 schools/ colleges of Federal Directorate of Education (FDE) under this Ministry are suffering inversely due to extreme hot summer under the scorching temperature of 40 degree Celsius.”\n“Moreover, unprecedented power outrage in the country as well in ICT during school hours add further miseries to the students of schools/colleges” the letter said.\n“As numerous cases are reported during school hours in the number of schools/ colleges regarding unconsciousness and dehydration of students due to hot weather and absence of electricity,” the Education Ministry’s letter said.\n“Early Childhood Education (ECE) to grade 5th students are more vulnerable to bear this present heat wave in the absence of electricity due to their early age factor,” it added.\n“Thus, the above situation needs your kind intervention to ease the miseries of the students of schools/ colleges from current heat wave by ensuring uninterrupted power supply during school hours in ICT as well in the country.”\n“It is therefore requested that authorities under your kind control may be issued necessary directions for uninterrupted power supply for the schools/ colleges of ICT during school hours until the announcement of summer vacation,” it concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:41:27.398Z"
}
