{
  "title": "PR retrieves over seven acres land worth Rs 116 mln in Rawalpindi division",
  "link": "https://www.app.com.pk/national/pr-retrieves-over-seven-acres-land-worth-rs-116-mln-in-rawalpindi-division/",
  "date_published": "2021-01-03T12:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP):Pakistan Railways (PR) has retrieved over seven acres railway land worth over Rs116 million from the land encroachers in Rawalpindi Division in its operation against land grabbers.\nThe operation was launched under the supervision of Divisional Superintendent of Rawalpindi Division Munawar Shah on the direction of Railways Minister Azam Khan Swati.\nAzam Khan Swati congratulated the PR officers, who took part in the operation against the land grabbers in Rawalpindi and Karachi divisions adding that the ministry would deal land grabbers with iron hands.\nThe minister said that instructions have been issued to all the divisions to launch a grand operation to get rid of railway land grabbers.\nRailways Minister said that incompetence and corrupt elements would not be tolerated at any cost, adding that the officers who would perform in good faith be appreciated at the Ministry level.\nRecently, the ministry has retrieved as many as 180.754 acres of its precious land in eight divisions of the country in its anti-encroachment drive conducted during last year.\n“Regular anti-encroachment operations are being carried out at all railway divisions with assistance of Railways Police and District Administration,” an official said.\n“Pakistan Railways has owned 167,690 acres land across the country out of which Punjab has 90,326 acres, Sindh 39,428 acres, Balochistan 28,228 acres and Khyber Pakhtunkhwa has 9,708 acres,” he added.\nHe said the Geographic Information System (GIS) survey had also been conducted under the project of computerization of railway land records in which all the encroachments and leases had been recorded in the Pakistan Railways Land Management Information System (PRLMS) software.\nThe official said the database was under verification and being compiled. For the last two years, he said, Pakistan Railways has been doing its utmost to get the problem of land encroachment resolved where thousands of acres of land had been occupied for commercial, residential and agriculture purposes.",
  "retrievedAt": "2025-08-11T20:12:43.134Z"
}
