{
  "title": "PDM using seminary children to protect ill-gotten money of its leaders: Murad",
  "link": "https://www.app.com.pk/national/pdm-using-seminary-children-to-protect-ill-gotten-money-of-its-leaders-murad/",
  "date_published": "2021-01-03T18:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 3 (APP): Federal Minister for Communications and Postal Services Murad Saeed Sunday said that Pakistan Democratic Movement (PDM) was using seminary children for public meetings to protect undeclared assets and money of its leaders.\nTalking to a private television channel, he said Maulana Fazlur Rehman was dragging innocent children of Seminaries to fill gap of public meetings and rallies.\nAll indecent tactics were being used by Fazlur Rehman to protect corruption and illegal money of opposition leaders, he stated.\nThe real faces of corrupt leaders including Jamiat-Ulama-e-Islam Fazl (JUI-F) Chief have been exposed before the nation with every day, he added.\nThe minister made it clear that the incumbent government would never grant national reconciliation ordinance (NRO) to any corrupt.\nThe Pakistan Tehreek-e-Insaf (PTI) government had rejected the unfair demand of Opposition regarding NRO or relief from corruption cases, Murad Saeed stated.\nAfter failure of their unjust demand, he said, the PDM had taken out rallies in different parts of the country against the government.\nMurad lauded the role of Prime Minister Imran Khan for seminary children of Pakistan and the oppressed Muslim states, saying, the prime minister had raised the voice of oppressed Islamic nations at different international fora including United Nations.\nThe PM, he said, had provided an unprecedented opportunity to seminary children so that they could also become doctors, judges and engineers after availing formal education at religious schools.\nHe said Imran Khan would continue playing constructive role for poor segments of the society.\nThe entire nation, he said, had rejected the negative agenda and anti-state narrative of PDM.\nThe minister assured that the country would make progress in every field under the guidance of Imran Khan.",
  "retrievedAt": "2025-08-11T20:12:41.013Z"
}
