{
  "title": "Pakistan urges UN role for immediate release of detained Kashmiri leader Asiya Andrabi",
  "link": "https://www.app.com.pk/national/pakistan-urges-un-role-for-immediate-release-of-detained-kashmiri-leader-asiya-andrabi/",
  "date_published": "2021-01-03T09:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 03 (APP):Pakistan on Sunday approached the United Nations Secretary General in New York and the UN High Commissioner for Human Rights in Geneva to seek immediate release of Kashmiri political leader Asiya Andrabi.\nAsiya Andrabi, also a human rights activist,was incarcerated in infamous Tihar Jail in India whose life was in danger owing to imminent risk of persecutory conviction by a sham court on 18 January 2020, according to a Foreign Office statement.\nPakistan told the UN bodies that as a champion of human rights and an ardent advocate of women empowerment, Andrabi had worked tirelessly for social reforms and realization of fundamental freedoms for the people of the Indian Illegally Occupied Jammu and Kashmir (IIOJK) for over four decades.\nShe founded an organisation called Dukhtaran-e-Millat (DeM), which was one of the biggest women rights organizations in IIOJK working on women’s education, empowerment, well-being and protection – especially against physical violence and abuse at the hands of Indian occupation forces.\nAsiya Andrabi has been under illegal and inhuman incarceration for more than 15 years on fabricated charges under draconian laws aimed at further perpetuating India’s illegal occupation of IIOJK through brutalization of the Kashmiri people.\n“The Indian authorities have now put Ms. Andrabi on trial on trumped up charges; deliberately accelerated the trial; and set aside due process, reflecting malicious intent with clear indications of looming judicial murder,” the Foreign Office statement said.\nThe spokesperson said that India’s blatant attempts to portray the legitimate Kashmiri struggle as “terrorism”, and to prosecute its leaders through concocted cases, was a clear violation of the UN Charter, UN Security Council and UN General Assembly resolutions, and international human rights and humanitarian law.\nPakistan called upon the UN to urge India to drop all fabricated charges against Asiya Andrabi, her husband and her associates and provide them complete legal protections including the right to a free and fair trial.\nPakistan also sought release all detainees, especially political prisoners and human rights defenders in IIOJK; repeal draconian laws such as AFSPA, PSA, and UAPA.\nIndia has also been asked to allow UN-supervised investigations into cases of extra-judicial executions and other serious and systematic human rights violations; and fully implement all recommendations of the two Kashmir reports of OHCHR, including the establishment of a UN Commission of Inquiry.",
  "retrievedAt": "2025-08-11T20:12:43.419Z"
}
