{
  "title": "Federal, provincial govts on same page to address Balochistan issues: CM Balochistan",
  "link": "https://www.app.com.pk/national/federal-provincial-govts-on-same-page-to-address-balochistan-issues-cm-balochistan/",
  "date_published": "2024-03-29T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 29 (APP): Chief Minister Balochistan, Mir Sarfraz Bugti, Friday said that both the federal and Balochistan provincial governments are on the same page to address issues of the province.\nAddressing a press conference along with leaders of allied political parties in Islamabad, he said that the state is using the relevant tools to prevent threats and causes of insurgency in Balochistan.\nHe said that the leadership of Balochistan was united for resolving the issues of province. He said the Balochistan government was making efforts to promote the good governance as the beneficiary of such governance was common people of the province, who is main victim of bad governance.\nHe mentioned that all parties were actively involved in providing relief to the common men of the province. He said that for the first time in history, Senators have been elected from the province unopposed.\nIn response to a question, he stated that violence cannot guarantee the provision of rights to Balochistan as all the rights granted to Balochistan to date have been conferred by the country’s parliament.\nHe expressed gratitude to the Pakistan People’s Party, Jamiat Ulema-e-Islam, Awami National Party, and Pakistan Muslim League-Nawaz for giving him the opportunity to serve the people of Balochistan as Chief Minister.\nPaying tribute to the security forces for foiling terrorist attacks in Gwadar and Turbat, the Chief Minister said the vigilant jawans thwarted the terrorist attack in Gwadar by killing the suicide bombers within a period of only twenty minutes.\nIn response to another question, he mentioned that over 2,000 teachers are drawing salaries without working, and doctors are also receiving salaries without providing services to the government or the people. He expressed resolve to check such malpractices.\nRegarding smuggling, he stated that while the government discourages it, a lenient approach has been taken due to the lack of job opportunities. However, the government does not condone smuggling.",
  "retrievedAt": "2025-08-11T01:38:12.729Z"
}
