{
  "title": "COVID-19 fatality rate in Pakistan still ‘very low’: Mirza",
  "link": "https://www.app.com.pk/national/covid-19-fatality-rate-in-pakistan-still-very-low-mirza/",
  "date_published": "2020-04-17T06:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Special Assistant to the Prime Minister on National Health Services Dr Zafar Mirza on Friday said the coronavirus fatality rate of 1.9% in Pakistan was still ‘very low’ as compared to the global figure of 6.7%.\nDr Mirza, in a briefing on COVID-19, said the reason behind the low number of deaths in Pakistan was the immediate measures taken by the government to control the spread of the contagion.\nHe said the country would have the capacity to carry out 20,000 coronavirus tests on daily basis by the end of current month as it had one million diagnostic kits for disease. The testing capacity was gradually improving as today 6,264 tests, the highest number in a day, were conducted.\nHe said the government would soon announce the national policy on ‘tracing, testing and quarantine’ as the basic strategy to diagnose the disease and its curtailment through isolation and quarantine.\nHe said the government had decided to introduce an information technology based platform ‘Yaran-e-Watan’ for engaging 30,000 Pakistani doctors and health professionals working in different countries, who wanted to contribute towards the national cause.\nHe said work was underway on the guidelines for the holy month of Ramazan with the consultation of stakeholders concerned, which would be issued very soon for the people.\nDr Mirza said it was not fair that the recent deaths in Karachi were being attributed to COVID-19 without the medical reports confirming that they were corona positive.\nSharing the breakup of corona cases, Dr Zafar Mirza said 497 new cases were reported across the country during the last 24 hours, including 59 from Punjab, 340 from Sindh, 58 from Khyber Pakhtunkhwa, nine from Islamabad Capital Territory (ICT) and eight from Gilgit Baltistan (GB).\nHe said 1,765 patients had recovered from the contagious disease, with total 135 deaths, 11 during the last 24 hours. Some 44 patients were in critical condition.",
  "retrievedAt": "2025-08-11T19:06:59.121Z"
}
