{
  "title": "Sindh government urged to facilitate industrialists trying to meet export orders",
  "link": "https://www.app.com.pk/national/sindh-government-urged-to-facilitate-industrialists-trying-to-meet-export-orders/",
  "date_published": "2020-04-17T04:45:00.000Z",
  "source": "APP",
  "content": "KARACHI, Apr 17 (APP):Federal Minister for Maritime Affairs, Ali Haider Zaidi here on Friday said that Prime Minister Imran Khan had advised the provincial governments to handle COVID-19 related situation in accordance to their respective dynamics.\nTalking to media persons during his visit to an Ehsaas Center in Korangi district to review the ongoing cash distribution under Ehsaas Cash Relief initiative, he said during series of meetings with the representatives of different trade and industrial bodies from Karachi, he was informed that they had to complete their export orders that would help the country to earn critically needed foreign exchange. Reactivating of factories and industrial units were also desperately sought by the worker, he added.\nHe said the current global crisis with its implications on the economy as well as on the lives of the masses in general demanded that a pragmatic approach was adopted towards formulation of Standard Operating Procedures (SOPs) to protect people against the coronavirus.\nThe minister said the industrialists had assured to strictly implement SOPs for the safety of workers and the environment. Zaidi said he was also informed that most of the workers had their homes in the colony on the factories’ premises while there were also mentioned to be a regular transport service arranged by them for the laborers living not very close to their work place.\n“In the given situation I hope the Chief Minister will look into the issue and facilitate the workers as well as factory owners with a mechanism to ensure that safety is not compromised – which definitely no body wants and that also require sensitization of the people about essential precautions on regular basis and in a vigorous manner,” he said.\nPrudence, he reiterated was utmost and mentioned that he too was asked to close operations at Port Qasim but keeping in view the fact that ships carrying grains imported for the country were handled there and the decision could lead to food security like situation the operation continues to be sustained with foolproof arrangement to ensure that safety of workers, handlers and staffers may not be compromised in any manner.\nAcknowledging that national consensus was all the more needed in crisis like situation, he said for the purpose, the prime minister had been regularly holding national council meetings with the objective to ensure collective decisions.\nAli Haider Zaidi said no body was against lockdown but ground realities could also not be ignored as people belonging to low income or middle income localities in Karachi.\n“Yes it is being fully observed in DHA, PECHS and other affluent localities,” said the federal minister emphasizing that provincial authorities must understand that Ramazan was fast approaching and people were getting increasingly distressed.\n“I repeat no body is against necessary precautions but people have to be motivated about relevance of the same for themselves and their respective families with due and meaningful assurance that their source of livelihood is not to be jeopardized,” he said.\nOn the occasion, he also appealed to the owners of media houses to provide relief to the workers ( the news men and auxiliary staff – particularly cameraman and technicians ) during this challenge who were the backbone of the industry and major source of income for the proprietors.\n“They are our frontline fighters who along with doctors, paramedics, nurses, law enforcers, scouts, social workers and volunteers are realizing their responsibilities against odd conditions,” Zaidi said.\nThe federal minister said that he planed to visit each of the Ehsaas Centers functional in Karachi and also meet local bodies of traders and industrialists to get their suggestions and recommendations about the measures being adopted to handle COVID induced crisis.\nHe said all efforts were being made to facilitate each and every section of the society on the directions o the prime minister ensuring that all opportunities were availed to stabilize economy and consequently the social well being of the masses was ensured.",
  "retrievedAt": "2025-08-11T19:07:00.940Z"
}
