{
  "title": "Around one million signed up for tiger force: Usman Dar",
  "link": "https://www.app.com.pk/national/around-one-million-signed-up-for-tiger-force-usman-dar/",
  "date_published": "2020-04-17T01:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Special Assistant to the Prime Minister on Youth Affairs Muhammad Usman Dar Friday said around one million people had registered themselves for the Corona Relief Tiger Force (CRTF) which indicated that citizens had responded to the call of their prime minister, passionately.\nAddressing a press conference here, he said the Pakistan Citizen Portal (PCP) had registered over 0.95 million people while some 50,000 signed up through a website, which was launched after receiving complaints about occurrence of an error on the portal.\nThe prime minister’s Corona Relief Tiger Force, which was set up to carry out relief and rescue activities across the country in wake of coronavirus pandemic, opened its registration on March 31 and closed it on April 15.\nUsman said the tiger force received an overwhelming response from all the provinces as it included 626,000 from Punjab, 146,000 from Sindh and 136,000 from Khyber Pakhtunkhwa.\nHe noted that a whooping number of professionals including doctors, engineers, lawyers, retired army personnel and others had joined the tiger force, which showed the success of Prime Minister Imran Khan’s initiative.\nGiving break up, he said more than 300,000 students, 133,000 social workers, 50,000 doctors, 40,000 teachers and 17, 000 health workers had registered themselves on the PCP to render their volunteer services for the country in the wake of coronavirus.\nThe special assistant expressed his gratitude for the people, who have shown keenness in supporting the government’s relief efforts across the country.\nHe pointed out that a notification, containing the Terms of References (ToRs) for the tiger force, had been forwarded to the chief secretaries and secretaries to the chief ministers and governors of all the provinces.\nThe special assistant hinted at assigning the duties to registered health professionals by next week. A meeting with the officials of Ministry of Health would be arranged shortly to discuss the modalities in that regard.\nHe said the tiger force would help poor and needy people in getting registered for Ehsaas Emergency Cash Programme. In case of extreme curfew, they would also provide ration to the people of their locality at their doorsteps.\nHe said the Prime Minister’s Office had shared the Code of Conduct (CoC) for tiger force members with the district administrations. The membership of tiger force would be cancelled for violating the CoC.\n“The tiger force is an additional human support to the system and it is the success of Prime Minister Imran Khan’s decision that now we own a standby force of one million people which is ready to work in collaboration with district administrations, National Disaster Management Authority, Pakistan Army and other frontline fighters,” he said while responding to the criticism of opposition on the tiger force.\nAccording to the notification shared with the district administrations regarding the tiger force, the deputy commissioners would notify three committees for different administrative tiers as per the composition and ToRs defined by the government for management and supervision of the CRTF at field level. The committees would be set up at district, tehsil and union council or village level.\nThe district administrations would also ensure that the volunteers’ services were utilized for carrying out the relief activities as per their jobs description defined under the separate ToRs.\nAccording to those ToRs, the members of CRTF were ought to perform multiple duties including ration distribution, identification of deserving people, quarantine centres management, transportation and mobilization of workers, non-intrusive surveillance of home quarantine, data collection of labourers, public awareness against coronavirus and other tasks.\nThe tiger force members would perform the aforementioned duties in their respective localities by following the instructions of respective local administrations.\nThe district administrations were advised to treat the volunteers politely and respectfully. It would also appreciate and guide them during their duty time.\nA code of conduct for the CRTF members was also shared with the district administrations. The code of conduct involved display of identity cards, completion of assigned task by the local administration, work in assigned areas, good behaviour, maintenance of daily log and many others.\n.",
  "retrievedAt": "2025-08-11T19:06:54.222Z"
}
