{
  "title": "Modi poised to eliminate non-Hindu communities especially Muslims in India: AJK President",
  "link": "https://www.app.com.pk/national/modi-poised-to-eliminate-non-hindu-communities-especially-muslims-in-india-ajk-president/",
  "date_published": "2020-04-17T05:55:00.000Z",
  "source": "APP",
  "content": "MIRPUR (*AJK): Apr 17 (APP):Azad Jammu and Kashmir President Sardar Masood Khan Friday said that abolition of disputed status of occupied Kashmir, making it part of the Union of India, change of domicile policy and laws and introduction of many new laws are part of the Bharatiya Janata Party (BJP) and Rashtriya Swayamsevak Sangh (RSS) plan designed to cleanse India from the followers of other religions particularly Muslims, and to materialize the dream of Akhand Bharat.\nUnder this plan, he said in an interview with an English monthly periodical of Pakistan, non-Hindus including Muslims would be eliminated in a systematic ethnic cleansing, and India would be turned into an absolutely Hindu state.\nHe said that although the civil society of India was raising its voice against the plan of the BJP and the RSS, but it is helpless to block the Hindu fanaticism. The civil society of India needs support and practical help of the international community particularly the civil society of neighbouring countries, he added.\nThe AJK president said that the actions of the incumbent Indian fanatic regime have led to a grave human tragedy and it has become necessary to create awareness in the Western countries, and mounting pressure on the governments of these countries, they are prevented from appeasing India.\nAt present, he maintained that the Western governments are busy in appeasing India in different forms. In spite of voices being raised by media, parliaments and the human rights of the West, these governments are trying to hide the crimes against humanity being committed by the Indian government in occupied Kashmir, Uttar Pradesh, Delhi and Assam state, he said adding that they were doing all this because they consider India a big market and they have executed several trade and investment agreements with India.\nSardar Masood Khan said to the Indian ruling party BJP and the RSS, India belongs to Hindus alone while Muslims, Sikhs, Christians and followers of other religions are foreigners or non-Indians. The Indian rulers hate untouchables particularly Dalit community who are considered as under-privileged Hindus in the Indian system, he said adding that Hindutva is designed to establish the supremacy of privileged Hindus and some people believe that this obsolete ancient concept can be defeated in the present age only through an international human rights campaign and the media.\nThe AJK president said that the BJP which is the flag bearer of Hindutva philosophy enjoys the unconditional support of the RSS. He added that the RSS is the world largest paramilitary militia with more six million members and volunteers, and being the so-called champion of religious, political and cultural rights of the Hindu community, it believes in achieving its objectives through violent extremism and terrorism.",
  "retrievedAt": "2025-08-11T19:06:59.902Z"
}
