{
  "title": "PM says strict action ‘inevitable’ against smugglers, hoarders",
  "link": "https://www.app.com.pk/national/pm-says-strict-action-inevitable-against-smugglers-hoarders/",
  "date_published": "2020-04-17T07:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Prime Minister Imran Khan on Friday terming smuggling a curse for national economy said strict action was inevitable against smugglers, hoarders and profiteers to eliminate such ills from the society.\nChairing a meeting to control smuggling, crackdown on hoarders and eliminating locust attacks on crops, the prime minister said smuggling and hoarding resulted in inflation that put direct financial burden on general public and poor.\nThe meeting was attended by Interior Minister Brig (retd) Ijaz Shah, Minister for National Food Security Syed Fakhar Imam, Planning minister Asad Umer, Minister for Economic Affairs Khusro Bakhtiar, Finance Adviser Dr Abdul Hafeez Sheikh, PM’s Special Assistant on Information and Broadcasting Dr Firdous Ashiq Awan, Chairman National Disaster Management Authority General Muhammad Afzal and senior officials.\nThe prime minister emphasized the role of intelligence agencies in checking smuggling and hoarding and called for appointment of honest and dutiful officers at checkpoints.\nHe also stressed effective coordination among the provinces with monitoring on daily basis and directed to ensure smooth working without any administrative hurdle.\nThe participants were briefed about target of wheat procurement for next year and provision of ‘bardana’ (gunny bags) for farmers.\nKhusro Bakhtiar told the meeting that Punjab government and Pakistan Agricultural Storage and Services Corporation (PASSCO) took timely steps for wheat procurement and other provinces needed to follow the suit.\nHe said that last year, four million ton wheat was procured with this year’s target as 8.2 million ton, however mentioned some difficulties in this regard following the recent rains.\nThe Prime Minister stressed comprehensive strategy to ensure provision of wheat and flour to consumers.\nThe meeting discussed ongoing emergency regarding the attacks of locust swarms on crops and the steps taken so far to control including spray of pesticides through planes and other machines.\nPurpose-built spray aircraft and machinery has already been imported from China, however more equipment is required which was delayed due to coronavirus lockdown, the meeting was informed.\nPrime Minister Imran Khan termed locusts another big problem for the country and directed availability of funds for its elimination.",
  "retrievedAt": "2025-08-11T19:06:58.637Z"
}
