{
  "title": "Firdous urges media to play proactive role in educating people about measures to defeat COVID-19",
  "link": "https://www.app.com.pk/national/firdous-urges-media-to-play-proactive-role-in-educating-people-about-measures-to-defeat-covid-19/",
  "date_published": "2020-04-17T08:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan on Friday asked the media to play a proactive role in educating the asses about the importance of preventive measures, including social distancing, to defeat the coronavirus pandemic.\nShe said the protection of media persons from the COVID-19 was the government’s priority. Her ministry had approached the National Disaster Management Authority for the provision of personal protection kits, which would be distributed among the media professionals through press clubs.\nThe SAPM was talking to the media on the occasion of distribution of personal protection kits among the media persons here at the National Press Club (NPC).\nShe said like other sectors, the government was considering a relief package for the media workers, who were already facing a financial crisis and the coronavirus had further added to the problems.\nBeing the incharge of Ministry of Information and Broadcasting, it was her responsibility to raise voice for the protection of the rights of media professionals at the government forums, she added.\nDr Firdous said the Federal Government would look after the medical requirements of coronavirus affected journalists, who could enlist themselves at a mobile phone app, which had been launched in consultation with the provincial information ministers.\nShe said along with the coronavirus, the other front for the nation was to fight against unemployment, hunger and poverty.\nShe said keeping in view the problems of daily-wagers and labourers, the Federal Cabinet had approved an ordinance giving legal effect to the incentive package for the construction industry.\nUnder the ordinance, she said, a fixed tax regime was being introduced for builders and developers. There would be no withholding tax on the construction material except cement and steel, she added.\nAs per the ordinance, tax had been reduced by 90 per cent for low cost houses to be constructed by the Naya Pakistan Housing Authority, she said.\nThis incentive package, she said, would be applicable to the projects to be initiated before the end of current year as well as the ongoing ones, which would get themselves registered under the scheme.\nShe said a one-time exemption had been given on the capital gain tax for a house measuring 500 square yards and flat of 4000 square yards.\nShe said the construction industry would be eligible to avail the facilities, which were being availed by other industries for the import of plants and machinery.\nDr Firdous said over one million youth had got themselves registered themselves for the Tiger Volunteers Force, who with the help of philanthropists would play an active role in the supply of edibles and other relief goods to the vulnerable people at their doorsteps.\nThe youth volunteers would also monitor the availability of\nitems at the Utility Stores and the provision of subsidies to the consumers, she added.\nThe SAPM said the world, which had been reeling under the lockdown for the last few weeks due to the coronavirus, should now feel the pain of the people of Indian held Kashmir, who had been virtually imprisoned by the brutal Indian occupation forces since first week of August last year.",
  "retrievedAt": "2025-08-11T19:06:56.831Z"
}
