{
  "title": "Pakistan stepping up support for international research to fight COVID-19 : Fawad ch",
  "link": "https://www.app.com.pk/national/pakistan-stepping-up-support-for-international-research-to-fight-covid-19-fawad-ch/",
  "date_published": "2020-04-17T01:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 17 (APP):Federal Minister for Science and Technology Fawad Ahmed Chaudhry Friday announced that Pakistan would be started the first phase of ‘clinical trial for a novel coronavirus vaccine’, as the world’s scientists including Pakistan in race to find a way to combat the deadly pathogen.\nTalking to private news channel, Fawad ch said Pakistan is fully contributing to the 66 global studies being conducted on Coronavirus adopting three different approaches including Re-purposed Drugs, Antibodies and Vaccines.\nThis is Pakistan’s major step towards international efforts for controlling COVID-19 disease mortality, he said, adding, the quality of Testing kits not be compromised anymore under DRAP authority it would be strictly\nchecked.\nHopefully Pakistan would be among the list of those countries which defeating Coronavirus”, the minister said.\nThe Drug Regulatory Authority of Pakistan (DRAP) had also prepared a strict rules and regulations for quality Testing Kits in country, he added.\nAll the major health researchers in the world were focusing on this research and Pakistan was also included in such efforts, he added.\nFawad said we were in dire need of safety kits, masks and ventilators amid COVID-19 outbreak, while we have increased our capacity in health system against this pandemic and now we will start manufacturing the ventilators indigenous on our own.\nDrug Regulatory Authority of Pakistan (DRAP) has completed legal proceedings in this regard and licensing process will start within a week before manufacturing, he added.\nHe said the people should follow the guidelines as precautionary measures and observe social distancing, stay at home and thus stay strong.\nFawad Chaudhry said, “It is a matter of happiness that Pakistan’s young engineers and Scientists are standing with us in this difficult time”.\nThe minister added that a team led by Dr Attaur Rahman was also closely working with the World Health Organization for the development of an anti-coronavirus vaccine.\nThe Drug Regulatory Authority of Pakistan (DRAP) has granted permission for conducting clinical trials for COVID-19 patients and trials of locally produced ventilators would also be started soon in Pakistan, he added.\nPakistani researchers working under government-approved projects, adding, they can develop a vaccine for coronavirus but the process will take little time, he added.\nHe also admires Dr. Atta-ur-Rahman for leading this clinical trials for the vaccine.\nAs with all drugs and medical devices, government will assess and monitor the safety and effectiveness of all products authorized under the DRAP.\nThe minister urged the people to avoid social and religious gatherings and meetings with people, adding, citizens should adopt volunteer isolation; this is the only solution to contain coronavirus”.",
  "retrievedAt": "2025-08-11T19:06:54.225Z"
}
