{
  "title": "COMSTECH launches 3rd OIC Youth Forum in Dhaka to harness Biotechnology for Global Food Security",
  "author": null,
  "content": "ISLAMABAD, Sep 14 (APP): With the world grappling with climate change, rising populations, and mounting food insecurity, the Coordinator General of OIC-COMSTECH, Prof. Dr. Muhammad Iqbal Choudhary, on Saturday opened the 3rd OIC Youth Forum on Agricultural Biotechnology at North South University (NSU), Dhaka. The landmark two-day event brings together policymakers, scientists, and youth leaders from across the Muslim world to explore biotechnology as a game-changing solution for sustainable agriculture and global food security.\nThe opening ceremony was attended by distinguished dignitaries, including Chief Guest Dr. Salehuddin Ahmed, Advisor to the Ministry of Finance and Ministry of Science and Technology, Government of Bangladesh; Mr. M.A. Kashem, Member, Board of Trustees, NSU; Mr. Aziz Al Kaiser, Chairman, Board of Trustees, NSU; Mr. Benajir Ahmed, Member, Board of Trustees; Ambassador Khusrav Noziri, Assistant Director-General, IOFS; and Prof. Abdul Hannan Chowdhury, Vice-Chancellor, NSU, who chaired the session.\nIn his keynote address, Prof. Choudhary recalled that the Youth Forum was envisioned as a platform for young scientists across OIC member states to connect, innovate, and collaborate.\nHe highlighted the success of earlier editions in Islamabad and Kazakhstan, and emphasized that the Dhaka forum focuses on agricultural biotechnology and genome editing technologies—key tools in combating food insecurity and climate change.\nProf. Choudhary dedicated this year’s forum to the people of Gaza, who continue to face hunger and deprivation, underscoring the moral urgency of scientific solutions to food scarcity.\nHe urged youth participants to seize the opportunity, engage actively in debates, and forge collaborations. “Youth are a transformative force for our societies. Their engagement is vital in advancing responsible, ethical, and impactful biotechnology,” he stressed.\nAcknowledging Bangladesh’s growing partnership with COMSTECH, he cited the COMSTECH-Bangladesh Scholarship Program, which has enabled several young scholars to pursue higher studies and research in Pakistan and other OIC countries.\nThe forum’s inaugural session concluded with a group photo and networking, reflecting the spirit of collaboration and innovation.\nOver the next two days, technical sessions will feature experts from Turkiye, Malaysia, Azerbaijan, Pakistan, Kazakhstan, Saudi Arabia, the UK, and other countries, providing a dynamic platform for knowledge-sharing and international cooperation in agricultural biotechnology.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:53:44.790Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/comstech-launches-3rd-oic-youth-forum-in-dhaka-to-harness-biotechnology-for-global-food-security/",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T12:54:00.000Z"
}
