{
  "title": "4th international conference on teaching, learning concludes at IIUI",
  "author": null,
  "content": "ISLAMABAD, Sep 14 (APP):The Department of Teacher Education, Faculty of Education, International Islamic University Islamabad (IIUI), in collaboration with the Iqbal International Institute for Research & Dialogue (IRD) and the National Book Foundation, concluded a two-day 4th International Conference on Innovation in teaching and learning (ICITL-2025).\nThe conference gathered national and international scholars, policymakers, and practitioners to deliberate on emerging trends in education. The sessions covered digital transformation, curriculum innovation, inclusive pedagogies, assessment reforms and the ethical use of Artificial Intelligence(AI) in classrooms, said a press release on Sunday.\nIn the closing ceremony Dr. Azhar Mahmood, incharge programs, faculty of education, welcomed the participants and appreciated their active contribution over the two days.\nPresenting the conference report, Dr Fouzia Ajmal, Conference Secretary, shared that the event featured seven keynote addresses, more than 80 paper and poster presentations and a panel discussion.\nThe recommendations included aligning curricula with global job market needs, responsible adoption of technology and AI, standardized teacher licensing and strengthening inclusive education through training and assistive resources.\nKeynote speakers and their addresses included Prof. Dr Jameel-Un Nabi, Vice Chancellor, University of Wah – Progressive Strategies for Dynamic Times to Improve Education and Learning, Professor James O’Meara, Dean of Global and Community Engagement, Texas A&M International University, USA – Disruptive Internationalization: Transforming Teacher Education to Provide International Experiences for All, alongwith others.\nGuest of Honour, Mr. Aftab Ahmad Khan, Secretary General, Pakistan National Commission for UNESCO (PNCU), noted UNESCO’s ongoing work on AI-related training in schools.\nIn the closing session, Dr. Muhammad Munir Kayani, Conference Chair and Chairperson, Department of Teacher Education, thanked participants and collaborators. He said the conference underscored the importance of inquiry-driven teaching, digital pedagogies, and international cooperation for improving education quality.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:53:40.350Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/4th-international-conference-on-teaching-learning-concludes-at-iiui/",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T19:03:00.000Z"
}
