{
  "title": "Flood-hit farmers battle fodder crisis as prices skyrocket",
  "author": null,
  "content": "ISLAMABAD, Sep 14 (APP):The flood-hit farmers in many areas of the country are facing a growing crisis — not just of water, but of hunger. While floodwaters have receded in many areas, the damage lingers. Stagnant water has destroyed green fields, leaving thousands of cattle without fodder and pushing prices to record highs.\nPakistan’s livestock — including buffaloes, cows, goats, and sheep — rely on several key types of fodder. These include green fodder crops like maize (makai), sorghum (jowar), barseem (Egyptian clover), and lucerne (alfalfa); dry fodder such as wheat straw (bhusa) and rice husk; and concentrated feed like wanda (a mix of grains, oilcakes, minerals, and molasses). These were either swept away by floods or remain inaccessible due to waterlogging and broken supply chains.\nFederal Law Minister Azam Nazeer Tarar told Parliament that the disaster displaced 2.1 million people, killed nearly 1,000, damaged over 9,000 homes, and led to the death of more than 7,000 livestock. Now, farmers struggle to feed the animals they managed to save.\nIn Jhang, farmer Imran stood by his starving cattle. “The floods took my crops, my fodder, my peace of mind. My cattle may die before help arrives,” he said.\nTasawar Abbas from the same area lost half his buffaloes. “The calves drowned. The survivors may now die of hunger,” he said.\nKhalid Bajwa from Sialkot saw his rice and fodder fields destroyed. “Wheat straw and wanda are double the price. How do I feed my cattle when I’ve lost everything?”\nRai Faisal Farooq of Al-Khidmat Foundation brought fodder to Jhang — bought at double the rate. “Wanda that cost Rs 2,000 now costs Rs 4,200. I collected money from schoolchildren, but it’s never enough,” he said.\nFareed Maghiana added: “Silage now sells for Rs 1,700 instead of Rs 700. Wheat straw has doubled too. Green fodder is gone.”\nWarehouse owners admit prices will rise further. “We are businessmen. Stocks are low and demand is high,” said Amir Hayat of Jhang.\nElderly Sughran Bibi wept as she recalled her buffalo dying of hunger after surviving the flood. “Her milk was my daily bread. Now I have nothing.”\nIn Sialkot, volunteer Faisal said farmers were paying Rs 1,150 for a small bag of silage. “Animals are collapsing. We’re trying to help, but costs are rising fast.”\nYousaf Haider of Al-Khidmat Foundation said they’ve fed over 1,000 animals, but demand is growing daily. “Without continuous supply, animals will die.”\nDespite NGO help, the need is far greater. Hoarding and profiteering continue. Experts warn that without fodder subsidies, livestock deaths will rise — deepening farmers’ losses.\nVeterinary doctor Sadiq Umar warned of disease outbreaks like FMD, HS, and Anthrax, worsened by water exposure and starvation. “Weakness, low milk production, and death are looming threats.”\nThe floods may have passed, but the crisis remains. Yet in every village, from schoolchildren donating coins to farmers sharing feed, stories of resilience shine through — even as hunger continues to haunt the land.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-09-19T16:53:16.196Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/flood-hit-farmers-battle-fodder-crisis-as-prices-skyrocket/",
  "dateList": "2025-09-14",
  "date_published": "2025-09-14T14:21:00.000Z"
}
