{
  "title": "SAPM Malik underlines need for strengthening Pak-Saudi skills development cooperation",
  "link": "https://www.app.com.pk/national/sapm-malik-underlines-need-for-strengthening-pak-saudi-skills-development-cooperation/",
  "date_published": "2023-11-26T07:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): A Pakistani delegation led by Special Assistant to the Prime Minister (SAPM)on Overseas Pakistanis and Human Resource Development (OP&HRD), Jawad Sohrab Malik, visited the Technical and Vocational Training Corporation (TVTC) of Saudi Arabia in Riyadh on Sunday.\nThe delegation included Ambassador of Pakistan Ahmad Farooq, Director General of Bureau of Emigration & Overseas Employment (BEOE) Akram Khawaja, Joint Secretary Emigration Aurangzeb, and Community Welfare Attachés, said a press release.\nThe Saudi side was represented by Deputy Governor Eng. Abdulrahman Almarwani, Director General of International Cooperation Eng. Sultan Alsunaya, Supervisor at the Deputy Governor Office for Training and Quality Policies, Dr. Khaled Al-Othman, and International Cooperation Specialist at the Directorate of International Cooperation, Khaled Alshehri.\nThe Deputy Governor of the Technical and Vocational Training Corporation (TVTC) welcomed the Pakistani delegation.\nThe meeting was held in a very cordial manner.\nThe Technical and Vocational Training Corporation (TVTC) team gave a detailed presentation on the working of TVTC.\nSAPM, Jawad Sohrab Malik appreciated the great role of the Technical and Vocational Training Corporation (TVTC) in the skills development of Saudi nationals.\nBoth sides discussed ways to strengthen cooperation in skills improvement for workers.\nIt is pertinent to note here that Navtec and Technical and Vocational Training Corporation (TVTC) will soon sign a Memorandum of Understanding (MoU) in this regard.\nThe visit of the Pakistani delegation to the Technical and Vocational Training Corporation (TVTC) was a positive step forward in strengthening cooperation between Pakistan and Saudi Arabia in the field of skills development. Both sides are committed to working together to create new opportunities for Pakistani workers in Saudi Arabia.",
  "retrievedAt": "2025-08-11T10:42:30.060Z"
}
