{
  "title": "FCCU’s Islamabad-Rawalpindi alumni celebrates annual-2023 reunion",
  "link": "https://www.app.com.pk/national/fccus-islamabad-rawalpindi-alumni-celebrates-annual-2023-reunion/",
  "date_published": "2023-11-26T10:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): The Islamabad-Rawalpindi chapter of Forman Christian College University (FCCU) Alumni Association joyously held its annual reunion for alumni and their families over the weekend.\nThe gathering welcomed a prestigious array of attendees, including bureaucrats, ambassadors, army officers, ministers, industrialists, businessmen and other distinguished individuals, said a news release issued here Sunday.\nDr Kauser Abdullah Malik, an esteemed alumnus and Federal Minister for National Food Security and Research, graced the event as the chief guest. Dr Jonathan Addleton, the revered Rector of FCCU, was the guest of honor.\nNotable alumni, Senator Mushahid Hussain Syed and former Chairman of National Accountability Burueau (NAB) Chaudhry Qamar Zaman, were also present as esteemed guests of honor.\nExpressing their delight at being part of the Formanite gathering, Dr Kauser Abdullah Malik and Senator Mushahid Hussain Syed extended their heartfelt congratulations to the Rector of FCCU for his outstanding contributions to the university’s development and growth.\nThey lauded the multidimensional work taking place at FCCU, highlighting its pivotal role in nurturing responsible citizens.\nDr Addleton shared insightful details regarding several new initiatives that have transformed the college, emphasizing the recent naming ceremony for the sports fields and library at FC College.\nMuhammad Mobeen, the chapter secretary, adeptly moderated the event, providing updates on the past year’s activities and offering a preview of forthcoming plans.\nHe stressed the importance of active participation from every Formanite in the “A Talk with Formanite” series.\nInaugurating the programme with a warm welcome, Malik Fateh Khan, the Chapter President and a senior Formanite, extended heartfelt greetings to the esteemed attendees.\nOn behalf of the executive committee, he acknowledged and commended Azeem Chaudhry and Usman for their valuable contributions to the chapter in previous years.\nAdditionally, he expressed appreciation for Adeel Riaz and his team from the advancement office in Lahore for their consistent support and presence at all Islamabad gatherings.\nThe presence of esteemed alumni, including Col Munzor Bakshi from the 1960s, Professor Arif, former professor of FCC, and former principal of Govt College Islamabad H-8, Malik Akber, Iftikhar Malik, and Ashraf Jehangir Qazi, former ambassador and special representative of the UN Secretary-General, was a source of immense pride for their fellow alumni at the event.\nThe contributions of Professor Arif Akber and Ashraf Jehangir Qazi were particularly noteworthy and inspiring to all attendees. Notably, the event was attended by senior female Formanite Kukab and youngest Formanite Assad from the class of 2017.\nThe event culminated with a gracious vote of thanks delivered by Col. ® Wahid Khan on behalf of the Chapter’s executive committee. Shields were presented as tokens of appreciation to the esteemed guests and committee members, followed by group photos and a delightful dinner.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:42:48.426Z"
}
