{
  "title": "Experts stress green-ecosystem conservation through Miyawaki forests",
  "link": "https://www.app.com.pk/national/experts-stress-green-ecosystem-conservation-through-miyawaki-forests/",
  "date_published": "2023-11-26T14:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 26 (APP):Experts believe the impact of urbanisation on environment is profound, multifaceted and is manifested at the global, local and regional scale.\nGrowing Miyawaki forests mean to build a healthy, biodiverse habitat that can look after itself, as the method becomes self-sustaining, said experts adding that “you can step away and let nature get to work”. Various global survey reports reveal that the top five hazards, which the world is facing, were all related to environment. Those events include the failure of climate change mitigation and adaptation, human-made environmental damage and global ecosystem collapse, irregular weather events, major natural disasters, biodiversity loss, and related disasters. The largest socio-transformation of digital era is urbanisation, driven by multiple socioeconomic and environmental processes. Miyawaki forests grow 10 per cent faster, 30 per cent denser and contain 100 per cent more biodiversity than other tree variety.\nCentral Business District (CBD) CEO Imran Amin told APP on Sunday that the global irregular-pattern of environmental hazards and climate change is directly inter-linked, that is taking place at a fast pace due to the augmentation of unplanned developmental projects and magnitude of multiplying population, that is major cause of expansion in cities.\nHe said that to harvest the short-term benefits, the CBD Punjab had marked a significant leap towards combating smog and environmental conservation with the start of a series of Miyawaki forests’ plantation, to mitigate the environmental hazards. He said that the designated site for the forest, spanning over four kanals within the CBD Punjab ‘Bab District,’ would be a sustainable plan, that will accommodate nearly 12,000 plants.\nAlready, 800 plants have found roots in the rich soil, laying the foundation for a thriving green ecosystem.\nBrigadier Mansoor Janjua (retd), Additional Secretary Environment said that since these forests are quick to establish, maintenance-free after the first two-to-three years, and can be created on sites as small as 3sq metre, Miyawaki forests are viable solutions for cities looking to rapidly build climate resilience.\nNoted environmentalist Mahmood Khalid Qamar said “If we study the impact of urbanisation on the environment, there are around six core aspects of environmental pollution, air pollution, including ecosystems, land use, biogeochemical cycles, solid waste management, water pollution and the climate itself. Therefore, it can be said that cities are an amplifier having great relevance to environmental and climate adaptation strategies. But because the processes result from changes in city-form and function, therefore, urban climate can be managed through climate-sensitive urban design.\nEnvironmental hazards and climate mitigation goals can also be addressed by integrating the principles of climate-sensitive and water-sensitive urban design—through the passive microclimate modulating role of urban vegetation. Global Joint efforts to restore the ecosystem through sustainable climate change measures are essential to protect the planet earth and improve the livelihood of its inhabitants directly dependent on its green resources, he emphasised.\nUnfortunately, as a result of widespread and intensifying eco-degradation phenomena, during the present time frame, some trends, and impacts of climate changes have become irreversible and have prevailed globally.\nIn this connection, to grow maximum forests with good yields a method of growing dense green cover in best possible time was experienced by developing by the Japanese botanist and plant ecology expert Professor Akira Miyawaki, and draws inspiration from nature’s ecosystems to create 100 percent organic, dense and diverse pioneer forests in shortest time.\nMoreover, going through various global reports on rapid deforestation, the Biologists and Scientists believe through their various research-based findings, have expressed concerns on global irreversible climate changes, happening at a fast pace in every region impacting global climate and ecosystems.\nThrough its recent research-based findings, the latest report of the Intergovernmental Panel on Climate Change (IPCC), released recently reveal many changes  being observed in climate change, are unprecedented even in a span of thousands of years, such as continued sea-level rise are irreversible over hundreds to thousands of years, it said.\nHowever, strong and considerable reductions in emissions of carbon dioxide (CO2) and other greenhouse gases (CFCs) would limit climate change while stabilizing temperatures during the next 20 to 30 years, further reveals IPCC Working Group-I report, Climate Change 2021, the report further observed.\nIt is worth mentioning here that this Physical-Science Based report was approved by the 195 member governments of the IPCC, through a virtual session that was held over two weeks.\nIt may be mentioned here that the current Working Group-I report is the first accomplishment of the IPCC’s Sixth Assessment Report (AR-6) which would be completed in 2022.\nIn response to the released IPCC report, Antonio Guterres, the Secretary-General of the United Nations (UN) in his tweet had said that the report’s evidence was irrefutable: greenhouse gas emissions were choking the planet Earth and placing billions of people in danger. Global heating was affecting every region on Earth, with many of the changes becoming irreversible. We must now act decisively to avert a climate catastrophe, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:42:25.123Z"
}
