{
  "title": "PM for improving taxation system to boost economic growth",
  "link": "https://www.app.com.pk/national/pm-for-improving-taxation-system-to-boost-economic-growth/",
  "date_published": "2023-11-26T18:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 26 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Sunday stressed the need to improve the taxation system to boost the country’s economic growth.\nIn an interview with PTV news, the prime minister said the private sector should take the responsibility of wealth creating and play role of engine of growth for the country, while the government’s focus should be on policy making and taxing that wealth.\nHe said the government spending of the accumulated tax should also be done in a more responsible way.\nThe prime minister visited the PTV headquarters here on the 59th anniversary of the founding of PTV where he also cut the cake to celebrate the anniversary along with employees of PTV.\nOn the occasion, the prime minister congratulating the PTV said that the Pakistan Television played important role in propagating the Pakistan’s soft image and identity across the world.\nTo a question with respect to Balochistan’s natural resources, the prime minister said most of the valuable minerals and resources such as gold and copper had not been exploited yet.\nHe maintained that after the 18th amendment, the new exploration and exploitation of mineral resources’ issue had been settled as these would be divided at ratio of 50:50 between the province and the federation.\nThe Balochistan’s major resource potential particularly copper and gold is going to be exploited in coming days and the value addition of the resources would also be done in the country that would yield great benefit to the province and the country as a whole.\nThe prime minister highlighted that the exploration was being done at the right time, because in the past Pakistan as a state was not prepared for exploration due to issues of capacity, financial and technical expertise.\nTo a question about his future plan after end of caretaker setup, the prime minister pointed out that he had not anticipated any particular role for himself. “But yes, if I could contribute on the floor of the parliament, that could be a wonderful opportunity.”\nHe said he enjoyed more as a member of parliament as compared to his role as executive.\nAs regards PTV, the prime minister said PTV had played number of amazing dramas, music and other programs besides presenting learning and informative programmes.\nHe suggested the PTV authorities to document and present the old civilization of the region in effective way. “We are one of the oldest civilization, we have got rich culture in terms of poetry, music, dance, and along with that it is a land of Khushahl Khan Khattak, Shah Latif Bhttai, Bullhay Shah, Waris Shah, and we have hundreds of people of that calibre as well,” he added.",
  "retrievedAt": "2025-08-11T10:42:04.488Z"
}
