{
  "title": "IPRI study warns of rising political polarisation fueled by social media surge in Pakistan",
  "author": null,
  "content": "ISLAMABAD, Jul 16 (APP):The Islamabad Policy Research Institute (IPRI) on Wednesday launched a comprehensive research study titled “Social Media Impact on Political Polarisation in Pakistan,” highlighting the growing influence of digital platforms in deepening political divides across the country.\nThe launch ceremony, held here, was attended by Federal Minister for Information and Broadcasting Ataullah Tarar, alongside senior academics, researchers, and policy stakeholders.\nThe book is the result of rigorous qualitative and quantitative research and includes the use of datafication to interpret emerging digital trends. It evaluates the interplay between social media platforms and the increasingly polarised political atmosphere in Pakistan. Drawing on insights from academics, civil society, government stakeholders, and digital users, the study presents a wide-ranging analysis of how platforms such as Facebook, Instagram, WhatsApp, TikTok, X (formerly Twitter), and YouTube are shaping discourse in the public sphere.\nThe prescriptive part of the research focused on: Digital Literacy, Social Media Accountability, Design Changes in Social Media Platforms to promote dialogue instead of conflict, Fact Check Mechanisms, Strong Libel Laws, and last but least Indigenous SM Platform.\nThe speakers underscored that the onus is on leaders across disciplines like politicians, religious leaders, government entities, and individuals to ensure secure use of social media. It was also noted that social media does not create polarization, rather it shapes and amplifies it.\n“It gives a stage from which belief can gain momentum, whether in goodwill or hostility. Whether it is a view that tolerates dissent, or one prepared to defend itself, be it through words, or unfortunate instances, through weapons,” said Director Advocacy & Communications, IPRI Siddique Humayun..\nThe research notes that between 2017 and 2025, the number of social media users in Pakistan more than doubled, growing from 31 million to 66.9 million, thereby expanding the digital space for political engagement, but also amplifying ideological divides.\nThe study calls for urgent and coordinated efforts from policymakers, political parties, civil society, and media platforms to mitigate these effects. It recommends introducing digital literacy into educational curricula, holding social media companies accountable for harmful content, moderating online discourse, promoting fact-checking initiatives, and exploring indigenous digital platforms to reduce reliance on foreign-owned networks.\nTo mitigate social media’s polarizing effects, the study recommends enhancing digital media literacy, regulating the spread of misinformation, promoting inclusive discourse, and encouraging critical engagement with content to disrupt echo chambers.\nEarlier, President IPRI Lt Gen (retd) Majid Ehsan elucidated on the growing role of social media in shaping political attitudes, behaviours, and divisions in the country. He said that the study situates itself in the context of Pakistan’s rapidly expanding digital landscape, where platforms like X, Facebook, TikTok, WhatsApp, YouTube, and Instagram have become central to how people receive, discuss, and contest political ideas.\nHe pointed out that the research explores how social media interacts with partisan identities, how it enables both engagement and exclusion, and what this means for political polarisation in Pakistan.\nDirector Research Brig (retd) Dr Raashid Wali Janjua, who spearheaded the research, quoted Jonathan Haidt from US Surgeon General’s report, saying that after the “introduction of like and share buttons on Facebook and Instagram between 2009-2012, the suicide rates in Generation Z went up by 62% and amongst girls 180% with female drug use rising up to 112%.”\nSimilarly, the Twitter (now X) became a nastier place after introduction of share button. The design features meant to promote platform engagement encouraged factionalism in academic as well as political spaces.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:42:57.017Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ipri-study-warns-of-rising-political-polarisation-fueled-by-social-media-surge-in-pakistan/",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T11:40:00.000Z"
}
