{
  "title": "FOSPAH holds Khuli Kacheri at UC Sihala",
  "author": null,
  "content": "ISLAMABAD, Jul 16 (APP):The Federal Ombudsperson Secretariat for Protection Against Harassment at the Workplace (FOSPAH) held a Khuli Kacheri at Union Council Sihala, here on Wednesday.\nThe khuli kacheri was held by Federal Ombudsperson Fauzia Viqar, who listened to women’s stories of dispossession, exploitation, and injustice. Mehreen Baloch, Additional Deputy Commissioner (ADC) East, was also present and guided the complainants at the spot, said a press release.\nThe open forum gave voice to women from surrounding rural communities many of whom have long been silenced in matters of inheritance and ownership. From unlawful land grabs to denial of rightful shares, the women came forward with courage and hope.\nAmong the attendees was Bibi Asma, a widow who shared that her in-laws had illegally seized her inherited land, leaving her and children without security. Another complainant Mahrana Bibi spoke of how her brother-in-law forcefully occupied her house and confiscated all original ownership documents, stripping her of legal proof.\nFOSPAH’s legal experts on site provided immediate guidance, outlining institutional remedies available under the Enforcement of Women’s Property Rights Act, 2020. The cases were documented for formal follow-up, and complainants were assured that justice would not remain out of reach.\n“For many women, especially in underserved areas, Khuli Kacheris are the only accessible path for reclaiming their rights,” said Ms. Fauzia Viqar.\nFauzia Viqar also visited the Union Council’s vocational center, where young girls are receiving training in sewing and tailoring to enhance their economic independence. She appreciated the initiative and stressed the importance of economic empowerment as a pillar of gender equality.\nThis public forum is part of FOSPAH’s wider mission to address gender-based inequalities in property ownership; an issue often compounded by social stigma, legal illiteracy, and familial pressure. By stepping into local communities, FOSPAH continues to democratize access to justice, ensuring no woman is left behind.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:41:50.533Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/fospah-holds-khuli-kacheri-at-uc-sihala/",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T13:38:00.000Z"
}
