{
  "title": "NA Committee on Finance meets",
  "author": null,
  "content": "ISLAMABAD, Jul 16 (APP): The National Assembly Standing Committee on Finance and Revenue met here Wednesday under the chairmanship of  Syed Naveed Qamar and discussed different matters relating to economic growth and progress in the country.\nThe committee considered the Parliamentary Budget Office Bill, 2025”, moved by Rana Iradat Sharif Khan, MNA, and constituted a sub-committee under the Convenorship of Dr Nafisa Shah for detailed deliberation on the Bill and submission of its report within 30 days.\nThe Members of National Assembly (MNAs) including Ali Zahid, Arshad Abdullah Vohra and  Muhammad Mobeen Arif, will be the members of the newly appointed sub-committee, said a press release.\nThe committee expressed serious concern over the absence of the Secretary, Industries and Production, and deferred the agenda item relating to the new Electric Vehicle Policy.\nDr Mirza Ikhtiar Baig, presented the report of the sub-committee on “The Corporate Social Responsibility Bill, 2025”, moved by Dr Nafisa Shah. The committee adopted the report and deferred the discussion on the report for the next meeting of the committee.\nThe Committee deferred discussion on “The Starred Question No. 40”, Moved by Ms. Sharmila Sahiba Faruqui Hashaam, “The Starred Question No. 38”, Moved by Ms. Aliya Kamran, MNA, “Non-Implementation of Minimum Wages, as announced by the Federal Government in its departments’’ matter raised by Syed Rafiullah, MNA, and “Islamic Banking” matter received from Syed Iftikhar Hussain Naqvi, Member Council of Islamic ideology, for the next meeting of the committee.\nThe meeting was attended by the MNAs including Rana Iradat Sharif Khan, Syed Sami Ul Hassan Gilani, Ali Zahid, Dr Nafisa Shah, Mirza Ikhtiar Baig, Muhammad Jawed Hanif Khan, Arshad Abdullah Vohra, Muhammad Mobeen Arif, Usama Ahmed Mela.\nThe meeting was also attended by Bilal Azhar Kayani, the Minister of State for Finance, Syed Rafiullah and Ms. Aliya Kamran, MNAs/Movers of the Starred Questions. The secretaries and officers from the Finance and Revenue Divisions were also present during the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:41:14.026Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-committee-on-finance-meets-2/",
  "dateList": "2025-07-16",
  "date_published": "2025-07-16T15:21:00.000Z"
}
