{
  "title": "Sherry blows alarms over ravaging fire at Sherani District",
  "link": "https://www.app.com.pk/national/sherry-blows-alarms-over-ravaging-fire-at-sherani-district/",
  "date_published": "2022-05-20T17:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Friday expressed her grave concerns over ravaging forest fire getting out of hands and urged the provincial government to take cognizance of its repercussions.\nThe Climate Change Minister chaired the second meeting of the PM’s Task Force on Global Warming and Heat Wave held here at the Ministry of Climate Change.\nFederal Minister for National Food Security Tariq Bashir Cheema, along with secretary information, Chairman NDMA and provincial secretaries attended the meeting. The meeting was convened to apprise the minister on the functioning of the Task Force till now, said a news release.\nThe Climate Change Minister said, “The pine nut trees are burning and three deaths have already been reported. NDMA has provided a helicopter for the mission, now the provincial governments need to apprise the Federal government on what is being done there.”\nDuring the meeting, the Federal Minister was apprised about the establishment of the central coordination unit.\nThis unit will ensure inter-provincial coordination and will allow Federal government to stay updated on the current climate change situation throughout the country.Another task achieved by the MoCC since the first meeting is the setting up of IT portal which will be completed by 31st May.\nThe ministry had also received information on actionable decisions from the provinces. The meeting further included updates on the ongoing information sharing and vigilance on heatwave. Further, livestock departments were advised to adopt a proactive approach in providing the needed information on Heatwave and water scarcity affecting the livestock.\nMinistry of Water Resources was directed to provide information on the current water situation in the country so that informed decisions can be taken on the matter.Provincial Chief secretaries provided information on the water situation of their regions. Chief Secretary Sindh reported high water stress still faced by the region.\nThe issue of shutting down tubewells to preserve ground water was also discussed during the meeting. Lining of canals and other water bodies was stressed and information on the water availability in each province was requested of the provincial chief secretaries.",
  "retrievedAt": "2025-08-11T14:56:35.831Z"
}
