{
  "title": "PTI chief misusing KP govt resources: Kundi",
  "link": "https://www.app.com.pk/national/pti-chief-misusing-kp-govt-resources-kundi/",
  "date_published": "2022-05-20T12:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): Spokesman Pakistan Peoples Party (PPP) Faisal Karim Kundi said that Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan was misusing the resources especially, helicopter of Khyber Pakhtunkhwa government to attend the public gathering across the country.\nAddressing a press conference along with Minister for Information and Broadcasting Marriyum Aurangzeb, he said that the next general elections would be held in consensus with coalition partners and not on the ambition of Imran Khan as he had already become a past.\nThe spokesman said that Imran Khan during his tenure, not protected Pakistani prisoner Dr Aafia Siddique and now become the counsel of Farah Gogi which was disgusting.\nHe said that dissident Members of Provincial Assembly, Punjab had voted to Hamza Shahbaz Sharif in the day light against the policies of the PTI leadership.\nPakistan is going to improve relation with United States of America (USA), European Union and all the countries for which Minister for Foreign Affairs, Bilawal Bhutto was on foreign official tour, he said.\nForeign Minister Bilawal in his foreign tour defended Imran Khan’s tour to Russia as country’s interest must be kept supreme.\nHe said Chairman Pakistan Tehreek-e-Insaf (PTI) Imran Khan should highlight the performance of his nearly four years rule to the masses in public gatherings by avoiding criticizing the national institutions.\nFaisal Kundi questioned Imran Khan whether he would talk against the apex court and the Election Commission of Pakistan (ECP) after the decision of ECP de seating 25 members of Punjab Assembly!\nHe said all the PTI MNAs including former Speaker National Assembly are still availing perks and privileges including salaries, allowances, car facility and accommodation in Parliament Lodges.\nTo a question, Faisal Kundi wondered that the person who was selected in general election 2018 now demanding the free and fair polls in the country.",
  "retrievedAt": "2025-08-11T14:56:24.876Z"
}
