{
  "title": "ECP accepts disqualification reference against 25 dissident PTI MPAs",
  "link": "https://www.app.com.pk/national/ecp-accepts-disqualification-reference-against-25-dissident-pti-mpas/",
  "date_published": "2022-05-20T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP): The Election Commission of Pakistan (ECP) Friday ordered to de-seat 25 dissident Pakistan Tehreek-e-Insaf’s (PTI) members of Punjab Assembly, accepting the disqualification reference against them.\nEarlier, the ECP had reserved its decision on the disqualification references against 25 dissident Punjab MPAs of the Pakistan Tehreek-e-Insaf (PTI).\nThe arguments in the case were already completed on the disqualification reference which was sent to the ECP by Punjab Assembly Speaker Chaudhry Pervaiz Elahi against the PTI’s dissident members.\nDuring the last hearing, the counsel for the dissident members of the provincial assembly argued that the MPAs were unaware of the directions given by the parliamentary party about voting in favour of Pervaiz Elahi for Punjab’s chief minister.\nOn which, the PTI counsel, Syed Ali Zafar said, “By taking the defence and claiming they were not aware of parliamentary party directions regarding who to vote for in the election of the chief minister when the entire world and the nation knew about it,\nand the same was being discussed in talk shows and reported in the newspapers, is like saying that the MPAs were, though awake, yet sleeping all this time,” he added.\nThe counsel claimed that meeting of the parliamentary party was held on April 1, its decision was reported in the press the next day, that notices to all MPAs of the Punjab Assembly were issued on April 2 by the chief whip,\nand another notice was sent on April 4 by PTI General Secretary Asad Umar, that another meeting was held in April in which the same decision was taken, and that a notice was sent on April 7 for the third time.",
  "retrievedAt": "2025-08-11T14:56:28.345Z"
}
