{
  "title": "NACTA to be made fully operational to eradicate terrorism from country: Rana Sana Ullah",
  "link": "https://www.app.com.pk/national/nacta-to-be-made-fully-operational-to-eradicate-terrorism-from-country-rana-sana-ullah/",
  "date_published": "2022-05-20T18:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 20 (APP):A high level meeting to ensure law and order situation in the country besides security to the Chinese citizens in Pakistan held on Friday here with Minister for Interior Rana Sana Ullah in the Chair.\nThis meeting was convened on the special directives of Prime Minister Shahbaz Sharif, said a press release.\nSecretary Interior Yousuf Naseem Khokhar, Chief Secretaries of four provinces including Azad Jammu and Kashmir and Gilgit-Baltistan, IGPs, Chairman NADRA, NACTA Coordinator, Chief Commissioner and IG Islamabad, representatives of other law enforcement agencies and senior officials of Interior Ministry also attended the meeting.\nThe meeting aimed at reviewing the steps taken to ensure law and order situation in the country. Provision of foolproof security to the Chinese nationals in Pakistan was also part of the agenda of the meeting, it was further said.\nThe minister said that National Counter Terrorism Authority (NACTA) would be made fully operational as it could be a very effective institution to eradicate terrorism from the country.\nAnti-terrorism departments would be modernized to prevent terrorist incidents, he added.\nHe said Punjab Anti-Terrorism department like institution would also be set up in other provinces. Lucrative salaries, perks and privileges would be given to the staff deputed in the Anti Terrorism departments, he added.\nSana Ullah said the role of Anti-Terrorism Department was key in maintaining law and order in the country and preventing terrorist incidents. Security of Chinese citizens was top priority and there would be no compromise on it, he added.\nHe said incidents of Dasu Dam and Karachi University were very unfortunate. The entire Pakistani nation grieved over the loss of Chinese citizens in these terrorist incidents, he said.\nHe stressed the need to streamline security coordination between the federation and the provinces.\nThe minister said the Centre would provide all necessary resources to the provincial, AJK and GB governments. A special cell had also been set up in the Interior Ministry to ensure protection of foreign nationals, he said and added the cell would coordinate among the provincial governments.",
  "retrievedAt": "2025-08-11T14:56:35.363Z"
}
