{
  "title": "Journalists urged to use RTI for investigative reporting, countering fake news",
  "link": "https://www.app.com.pk/national/journalists-urged-to-use-rti-for-investigative-reporting-countering-fake-news/",
  "date_published": "2024-09-08T14:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 08 (APP):A two-day seminar was concluded by the Friedrich Nauman Foundation for Freedom (FNF-Pakistan) on Sunday with the main objective to capacitate journalists on the use of Right to Information laws for investigative reporting and countering fake news.\nThe Punjab Transparency and Right to Information Act, 2013, was passed by the Punjab Assembly in 2013 for promoting transparency in the working of provincial authorities by securing citizens’ access to information, a news release said.\nWhile addressing the participants, Muhammad Anwar, Head of Programs and Administration of FNF Pakistan, said journalists can promote investigative journalism through the use of RTI. This ultimately strengthens the credibility of their stories, he further added.\nWhile sharing the legislative landscape of RTI in Pakistan, Syed Raza Ali, Program Manager of FNF Pakistan, access to information is guaranteed under Article 19A of the Constitution and explained there are five RTI laws in Pakistan.\nHe further described, being the 4th pillar of democracy, journalists are the representatives of the people in terms of using RTI Act for investigating and publicizing information of public interest.\nAccessing information through RTI Act, especially young journalists, can contribute to ensuring transparency in public, professional, and social spheres. Provincial public bodies are legally bound to provide the requested information within 14 working days under the Punjab Transparency and Right to Information Act 2013.\nIn case the public bodies fail to provide the requested information, citizens can lodge complaints before the Punjab Information Commission, Ali added. The Punjab Information Commission is an independent appellate authority that has the power to direct, summon, and penalize officials who obstruct the flow of information, he further added.\nWhile talking about critical thinking to counter fake news, it is important for every journalist to know how to check facts and report, said Mr Ubaid Ur Rehman, a rights activist.\nIt is a time for news media to tack more closely to professional standards and ethics, to avoid the publishing of unchecked information. Investing in critical thinking is more important than ever, as it helps to limit the risks of disinformation posed by the advent of technologies such as the internet and artificial intelligence, he further added.\nWhile addressing participants, Saeed Akhtar Ansari, former information commissioner of the Punjab Information Commission said, journalists should exercise their right of access to information for investigative stories.\nUzma Kardar, PMA, while concluding remarks urged journalists to use RTI tool for countering fake news. More than 30 journalists, rights activists and students attended the seminar and commended the efforts of FNF-Pakistan for organizing such a seminar and called on the journalists’ organizations to hold similar sessions for young journalists in order to promote investigative reporting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:52:42.664Z"
}
