{
  "title": "8-member Kashmiri delegation departs for Geneva",
  "link": "https://www.app.com.pk/national/8-member-kashmiri-delegation-departs-for-geneva/",
  "date_published": "2024-09-08T13:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 7 (APP):An eight-member Kashmiri delegation, representing voices from both sides of the Line of Control, has departed for Geneva to participate in the 57th session of the United Nations Human Rights Council (UNHRC).\nThe delegates are the senior Hurriyat leaders including Ghulam Muhammad Safi, Convener of All Parties Hurriyat Conference Azad Jammu and Kashmir chapter, Altaf Hussain Wani of the All Parties Hurriyat Conference (APHC) and the Permanent Representative of the World Muslim Congress to the UN in Geneva, Sardar Amjad Yousaf Khan, Executive Director of the Kashmir Institute of International Relations (KIIR), Ms Shamim Shawl, Permanent Representative of the International Muslim Women’s Union, Syed Faiz Naqashbandi, senior APHC-AJK leader, Dr Shagufta Ashraf, Associate Professor at the University of Kotli, AJK, Dr Raja Sajjad Lateef, Executive Director of the Kashmir Peace Research Institute (KPRI) and Naila Altaf Kayani, a broadcaster, said a press release.\nDuring their visit, they are scheduled to engage in critical discussions with key officials from the Human Rights Council, including Special Rapporteurs, diplomats, and representatives from international non-governmental organizations.\nThe primary objective of this visit is to highlight the ongoing human rights violations in Indian illegally occupied Jammu and Kashmir. The delegation aims to inform the global community about the Indian government’s efforts to alter the demographics of the territory. They seek to expose the Indian government’s propaganda that claims peace, normalcy, and development have returned to Kashmir following the abrogation of Articles 370 and 35A. The delegation intends to present the realities on the ground, including increasing militarization and human rights violations.\nAdditionally, they plan to address the Indian government’s attempts to conduct fraudulent elections, which are no substitute for a plebiscite as envisaged in the United Nations Security Council resolutions.\nAlongside their official meetings, the Kashmiri delegation will host seminars and symposiums on the sidelines of the UNHRC session. These events aim to raise awareness about the urgent need for a resolution to the lingering Kashmir dispute and to expose what they describe as India’s detrimental actions in the occupied territory.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:53:04.518Z"
}
