{
  "title": "Danish Company seeks long-term collaboration with Pakistan for mineral extraction",
  "link": "https://www.app.com.pk/national/danish-company-seeks-long-term-collaboration-with-pakistan-for-mineral-extraction/",
  "date_published": "2024-09-08T17:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 08 (APP): Mikko Keto Global CEO of FLSmidth (a Danish Company) on Sunday identified vast potential in Pakistan’s geology, especially in Balochistan’s Tethyan Metallogenic Belt, to produce crucial minerals for the energy transition and looked forward to a long-term partnership.\nIn a statement, he said that FLSmidth,( Danish multinational technology company based in Copenhagen, Denmark), had been eager to engage in a long-term partnership to ensure the sustainable tapping of Pakistan’s vast mineral potential.\nHe highlighted that the country’s exceptional geology, especially along the Tethyan Metallogenic Belt in Balochistan, had offered a unique chance to produce essential minerals for the energy transition.\nAfter expressing his heartfelt gratitude to Jakob, Linulf, Shoaib, and all others who contributed to the success of his Pakistan trip, he had acknowledged the fruitful talks he had with the government regarding emerging mining opportunities during his recent visit to Islamabad, Pakistan, and had reaffirmed their long-standing commitment to a country where they had been active for fifty years.\nAccording to Mikko Keto, it was clear from all the discussions that the public and private sectors were deploying all efforts to support a thriving and responsible mining industry for the benefit of the country and its people.\nMikko Keto observed that, following the discussions, it was apparent that concerted efforts were being made by both the public and private sectors to foster a flourishing and responsible mining industry, to the advantage of the nation and its populace.\nShoaib Sarwar, Pakistan’s Ambassador to Denmark, said Mikko Keto, Global CEO of FLSmidth, recently visited Islamabad to explore business prospects in the mining sector.\nNotably, FLSmidth, a prominent Danish company, has already made significant contributions to Pakistan’s cement industry, with over 80% of the country’s cement plants installed by them. However, this marks the company’s first foray into Pakistan’s mining sector.\nFollowing his visit, Mikko Keto stated that he had returned from a productive trip to Islamabad, where he had engaged in discussions with the government to explore emerging mining opportunities and reaffirm their long-term commitment to Pakistan, a country where they have been active for over five decades.\nJamil Qureshi, Secretary of SIFC, said that it was great to see Mikko Keto, CEO of FLSmidth, welcome their interest in the mining sector, making them the second Danish company, after MAERSK, to present business proposals. He also appreciated the efforts of the Danish Ambassador in facilitating economic collaboration.\nDenmark Ambassador in Islamabad Jakob Linulf expressed his pleasure in sharing highlights from FLSmidth CEO Mikko Keto’s visit to Pakistan, during which the company announced its entry into the country’s thriving minerals industry.\nAccording to the Ambassador, the visit included meetings with several high-ranking officials, including the Minister of Finance, Minister of Commerce, Minister of Petroleum, Minister of Privatization, and the head of SIFC.\nThe Denmark Embassy in a statement expressed its excitement in announcing the visit of FLSmidth’s CEO, Mikko Keto, to Pakistan, a significant move towards developing a sustainable and thriving mining sector in the country.\nFounded in 1885 in Denmark, FLSmidth has been a key player in Pakistan for over 50 years, providing cutting-edge technology to the cement industry. With an existing sales office in Islamabad and partnership with Qadbros Engineering in Lahore, FLSmidth was proud to support local manufacturing and employ a skilled workforce to meet Pakistan’s industrial needs.\nAs Pakistan’s vast mineral resources emerged as crucial to the global energy transition, FLSmidth committed itself to fostering a world-class mining ecosystem. With its expertise in mineral processing, combined with decades of on-ground experience, FLSmidth was uniquely positioned to drive this transformation.\nDuring his visit, Mikko Keto, accompanied by Danish Ambassador Jakob Linulf, held constructive talks with Federal Ministers Musadik Malik, Muhammad Aurangzeb, Abdul Aleem Khan, and Jam Kamal Khan to tap into the vast potential that lies ahead.",
  "retrievedAt": "2025-08-10T20:52:16.306Z"
}
