{
  "title": "Govt striving to revive economy, generate employment opportunities: FM",
  "link": "https://www.app.com.pk/national/govt-striving-to-revive-economy-generate-employment-opportunities-fm/",
  "date_published": "2020-06-13T05:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 13 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi Saturday said the government was fully striving to restore the economic activities in the country amid challenges posed by the COVID-19 pandemic and felicitated its economic team on presenting the public-friendly fiscal budget\nThe foreign minister, in a video statement, said the budget for the fiscal year 2020-21 was presented in unusual circumstances as the global economy was reeling under the negative impacts of the coronavirus pandemic.\nHe said the government did not burden the people by not levying new taxes, a salient feature of the budget, rather it made efforts to reduce the burden of the past regimes by slashing the direct taxes, duties, tariff and regulatory duties.\n“Our objectives are focused upon easing of financial burden on the masses, avoidance of wastage of resources, revival of economic activities and stemming of unemployment,” he added.\nDue to economic downturn, Qureshi said, the country’s revenue witnessed a reduction of Rs 800 billion, and the exports increased during the period from last July to March 2019-20, which showed a slide down between March to June.\nHe said the previous regimes spent a major chunk of the budget on the payment of interest on the loans, but the Pakistan Tehreek-e-Insaf’s (PTI) government did not seek such loans rather it had to pay back them.\nThe minister said Prime Minister Imran Khan was making efforts for the debt relief from the global lending bodies not only for Pakistan but also for all the developing economies of the world. He expressed his satisfaction that so far, G20 and Paris Club had provided some waiver to the country.\nHe said the government was focusing on the major international lenders to provide Pakistan further relief so that the available resources could be diverted for provision of jobs and eradication of poverty.\nThe minister said efforts were being made to bring reforms in the Federal Board of Revenue and to enhance the tax collection. With the tax automation, the tax collection would be improved, he observed.\nQureshi said they were striving to keep the wheels of economy moving, which had been stalemated. For the economic growth, they were focusing on those sectors, which generated employment opportunities, including the agricultural sector which could bolster the economy. A huge amount in the budget was set aside for the betterment of that sector and the water resources, he added.\nAbout the locust attack, the foreign minister said a sum of Rs10 billion was allocated for overcoming the challenge, besides Rs 50 billion was earmarked for the agricultural sector.\nHe said a number of initiatives were announced for the construction sector to encourage investment. All-out efforts were afoot to turn the negative growth rate into positive one, about two per cent growth rate target would be taken upward in the next years, he added.\nHe said keeping the growth rate in mind, it was decided that there would be no cut in the Public Sector Development Programme (PSDP), rather it would be supplemented further for the economic growth.\nThe minister said the 7th National Finance Award had tied the hands of Federal Government as it would have to utilize the allocated 40 percent of the total revenues after the distribution of 60 percent income among the provinces.\nThe government had decided to stick to its process of reduction in the official expenditures, he added.\nForeign Minister Qureshi said despite India’s nefarious designs, the defence budget had not been increased to avoid burden on the public, which was a major step. Keeping in view the economic situation, the armed forces had been fully supporting and cooperating the government in that regard, he added.\nThe government, he said, was focusing on those segments of society, which had been living below the poverty line. Under the Ehsaas Programme, the erstwhile Rs 178 billion amount allocated in the last year was now enhanced to Rs 208 billion in the fiscal budget.\nThough, he said, health and education sectors had been the provincial subjects, but the government allocated a huge amounts for the betterment of sectors too.",
  "retrievedAt": "2025-08-11T19:20:08.620Z"
}
