{
  "title": "Parliamentarians asked to fulfill assets’ submission requirement by Dec 31st",
  "link": "https://www.app.com.pk/national/parliamentarians-asked-to-fulfill-assets-submission-requirement-by-dec-31st/",
  "date_published": "2020-12-22T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 22 (APP):The Election Commission of Pakistan (ECP) has once again drawn attention of members of the parliament and provincial assemblies towards mandatory requirement under Section 137 of the Elections Act, 2017 on submission of yearly statements of assets and liabilities by December 31st.\nAccording to an official of ECP, all parliamentarians have to submit to the ECP by December 31st, 2020, yearly statements of assets and liabilities including their spouse and dependent children as on the preceding 30th day of June on Form-B.\nHe added as per reproduced requirement, every member of an assembly and Senate will submit to the Commission, on or before December 31st each year, a copy of statement of assets and liabilities including assets and liabilities of his spouse and dependent children as on the preceding thirtieth day of June on Form B.\nThe commission, on the first day of January each year through a press release, will publish the names of members who failed to submit the requisite statement of assets and liabilities within the period specified under sub-section (1).\nHe said that the Commission will, on the sixteenth day of January, by an order suspend the membership of a member of an assembly and Senate who fails to submit the statement of assets and liabilities by the fifteenth day of January and such member will cease to function till he or she files the statement of assets and liabilities.\nHe added if any member submits the statement of assets and liabilities under this section which is found to be false in material particulars, he or she may within one hundred and twenty days from the date submission of the statement, be proceeded against for committing the offence of corrupt practice.\nHe said that the prescribed form along with instructions and guidelines prepared in this regard can be obtained free of cost from the Election Commission Secretariat, Islamabad, offices of Provincial Election Commissioners in each Province, Senate Secretariat, National Assembly Secretariat and Secretariats of Provincial Assemblies. Form can also be downloaded from the ECP’s website www.ecp.gov.pk.",
  "retrievedAt": "2025-08-11T20:10:23.371Z"
}
