{
  "article_id": "2025-01-09_93de97b89e9f8cb46fc490c7bf100cab",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-appreciates-gandapur-on-learning-correct-way-of-protest/",
    "retrieved_at": "2025-08-27T11:29:39.363Z"
  },
  "metadata": {
    "title": "Tarar appreciates Gandapur on learning correct way of protest",
    "author": null,
    "date_published": "2025-01-09T13:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 208,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 09 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Thursday appreciated Chief Minister of the Khyber Pakhtunkhwa Ali Amin Gandapur on understanding about the correct way to hold a protest in the country. \"Ali Amin Gandapur has finally learnt the right way to protest,\" said the minister while sarcastically responding to the statement made by the CM KP today in a gathering regarding his newfound approach for holding a protest. The CM KP had specifically commented on the comparison recently drew by Prime Minister Shehbaz Sharif between the protest strategies adopted by the people in Japan and the opposition in Pakistan. The minister, in a news statement, said the whole nation knew the usual tactics of chaos, violence and arson opted by the Pakistan Tehreek-e-Insaf (PTI) during their protests. \"It is commendable that for the first time in ten months, the Chief Minister has chosen the correct manner of protest,\" he added. He said it would have been quite better if he had protested peacefully with sounds like 'oooo oooo' on November 26 and May 9 instead of resorting to aggression and arson. Protests, in the civilized society, are held in a peaceful manner without disrupting the normal life, he remarked.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}