{
  "title": "Ministry unveils innovations to enhance Hajj facilities, introduces short-term package: Secy",
  "link": "https://www.app.com.pk/national/ministry-unveils-innovations-to-enhance-hajj-facilities-introduces-short-term-package-secy-2/",
  "date_published": "2024-04-29T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 29 (APP): Secretary, Religious Affairs, Dr. Syed Atta-ur-Rehman on Monday shed light on crucial aspects pertaining to the upcoming Hajj with a focus on optimizing the pilgrimage experience and addressing pertinent concerns delineating the ministry’s strategies and innovations.\nAddressing a press conference along with other officials here, he commenced the discourse by acknowledging the challenges encountered in fully utilizing the Hajj quota in preceding years.\nDr. Atta-ur-Rehman, expressing unwavering determination, underscored the imperative of maximizing the utilization of the Hajj quota in the ensuing year, highlighting the repercussions of under utilization, which could potentially lead to a reduction in the quota for future years.\nDispelling misconceptions surrounding the number of pilgrims under the government scheme, he clarified that there had been no reduction in pilgrim numbers this year.\nDr. Atta-ur-Rehman said there was the reduction in per capita allocation by Rs. 100,000 compared to the previous year, prompting concerted efforts to alleviate financial burdens, including fee reductions imposed by airlines.\nHe emphasized the ministry’s commitment to enhancing the pilgrimage experience outlining a series of innovative initiatives introduced for the upcoming pilgrimage season. He said notable among these innovations was the introduction of short-term Hajj packages spanning 20 to 25 days, complementing the traditional 40-day pilgrimage.\nAdditionally, Dr. Atta-ur-Rehman unveiled the enhanced services such as separate room accommodations for families, a dedicated Hajj app facilitating communication and providing essential information, and specialized bags with modern features.\nHe mentioned the meticulous selection process for Moavineen-e-Hujjaj through the National Testing Service (NTS) to ensure the competence of Hajj assistants, bolstering pilgrim support services.\nHighlighting the ministry’s endeavours to streamline logistical operations, Dr. Atta-ur-Rehman announced significant improvements in infrastructure and services. He said the expansion of the “Road to Makkah” facility to Karachi airport, alongside Islamabad, promised to expedite departure procedures for pilgrims.\nHe said medical personnel, selected through NTS, guaranteed expertise in addressing health-related concerns during the pilgrimage. Extensive training programmes focused on spiritual preparedness, with an emphasis on worship and prayers, were conducted for pilgrims, he added.\nHe said the provision of a dedicated train facility from Mina would enhance transportation options, while the transition towards a paperless system facilitated efficiency in the entire Hajj process.\nConcluding his remarks, Dr. Syed Atta-ur-Rehman affirmed the Ministry of Religious Affairs and Interfaith Harmony’s steadfast commitment to enhancing the Hajj pilgrimage experience.\nThrough innovative measures and logistical advancements, he said the ministry endeavoured to ensure accessibility, affordability, and efficiency while prioritizing the spiritual welfare of pilgrims.",
  "retrievedAt": "2025-08-11T02:10:57.075Z"
}
