{
  "title": "More rain-windstorm/thunderstorm likely at isolated places: PMD",
  "link": "https://www.app.com.pk/national/more-rain-windstorm-thunderstorm-likely-at-isolated-places-pmd/",
  "date_published": "2024-04-29T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP):Pakistan Meteorological Department (PMD) has forecast more rain-windstorm/thunderstorm with isolated hailstorm for isolated places in upper Khyber-Pakhtunkhwa, upper Punjab, Islamabad, Gilgit-Baltistan and Kashmir during the next 24 hours.\nDry weather with gusty winds is likely in most parts of the country.\nAccording to the synoptic situation, a strong westerly wave was affecting upper parts of the country and likely to persist during the next 24 to 36 hours.\nIsolated/moderate to heavy rainfall may generate flash floods in local nullahs/Streams of Dir, Swat, Chitral, Mansehra, Kohistan and Kashmir on April 29.\nHeavyfall may cause landslides in upper Khyber-Pakhtunkhwa, Murree, Galliyat, Kashmir and Gilgit-Baltistan may affect the vulnerable locations during the period. Windstorm/hailstorm and lightning may affect human lives, standing crops, loose structures like electric poles, vehicles and solar panels etc during the period.\nDuring the last 24 hours, rain-windstorm/thunderstorm occurred in Kashmir, Gilgit-Baltistan, Khyber-Pakhtunkhwa and upper/central Punjab.\nHailstorm was also observed at few places in Potohar region, Islamabad, Murree, Galliyat and Khyber Pakhtunkhwa.\nThe rainfall recorded was Kashmir: Rawalakot 76mm, Kotli 46, Garhi Dupatta 37, Muzaffarabad (City 32, Airport 31), Gilgit-Baltistan: Astore 49, Chilas 31, Bagrote 21, Skardu 13, Bunji, Gilgit 11, Hunza 06, Gupis 03, Khyber-Pakhtunkhwa: Saidu Sharif 49, Kalam 31, Balakot 26, Pattan 20, Malam Jabba, Kakul 18, Cherat 11, Dir (Upper 11, Lower 08), Bannu 10, Mirkhani, Chitral 08, Drosh 06, Parachinar, Takht Bai 05, Bacha Khan Airport, Peshawar 02, Punjab: Jhelum 38, Murree 31, Mandi Bahauddin, Mangla 26, Gujranwala 20, Sialkot (Airport 12, City 04), Attock 08, Chakwal 06, Joharabad 05, Islamabad (Airport 03, Zero Point 02, Bokra, Golra 01), Rawalpindi (Kacheri 03, Chaklala 02, Shamsabad 02), Hafizabad 02, Sheikhupura, Bahawalnagar, Faisalabad, Narowal 01mm.\nThe highest maximum temperatures recorded were Mithi, Shaheed Benazirabad 41C, Dadu, Hyderabad and Karachi 40C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:11:18.729Z"
}
