{
  "title": "President confers Nishan-i-Imitaz (M) upon Commander Turkish Land Forces",
  "link": "https://www.app.com.pk/global/president-confers-nishan-i-imitaz-m-upon-commander-turkish-land-forces/",
  "date_published": "2024-04-29T11:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 29 (APP):President Asif Ali Zardari on Monday conferred Nishan-i-Imtiaz (Military) upon Commander of the Turkish Land Forces General Selcuk Bayraktaroglu, in a special investiture ceremony held at the Aiwan-i-Sadr.\nThe ceremony was attended by Chief of Army Staff General Syed Asim Munir, senior military leadership and other senior officials.\nThe Nishan-i-Imtiaz (M) was conferred upon General Selcuk Bayraktaroglu in recognition of his illustrious services.\nLater, the visiting Commander of Turkish Land Forces, General Selcuk Bayraktaroglu, also called on the President, at Aiwan-e-Sadr.\nThe meeting was also attended by the Chief of Army Staff, General Syed Asim Munir.\nThe meeting discussed matters pertaining to defence cooperation between the two brotherly countries.\nBoth sides emphasised the need for further expanding bilateral ties for the mutual benefit of Pakistan and Turkiye.\nTalking to the Commander of Turkish Land Forces, the president said that Pakistan was proud of its relations with Turkiye, which had always supported Pakistan on core issues.\nHe expressed satisfaction over the collaboration between Pakistan and Turkiye on a number of projects that would further strengthen bilateral ties.\nThe president highlighted the need for increasing people-to-people contacts, as well as promoting cooperation in the areas of agriculture, education, art and culture to bring the people of Pakistan and Turkiye further closer.\nHe said that President Recep Tayyip Erdogan was a true and sincere friend of Pakistan who had made telephonic calls to him on his election as well as at the beginning of Ramzan-ul-Mubarak.\nThis showed his commitment to broadening Pak-Turkiye ties, he added.\nCommander of Turkish Land Forces General Selcuk Bayraktaroglu reiterated the desire to further improve defence cooperation with Pakistan.\nHe said that both countries could significantly contribute to the promotion of regional peace and stability.\nThe president congratulated the Commander of Turkish Land Forces on receiving the Nishan-i-Imtiaz (Military) and hoped that he would continue to play his role to further strengthen defence cooperation between the two brotherly countries.\nAccording to citation read out in the ceremony, Turkish commander ‘is a sincere and close friend of Pakistan’ and played a prominent role in promoting and strengthening the defence relations between two brotherly countries.\nGeneral Selcuk Bayraktaroglu is an officer of high intellect and his excellent administrative qualities earned him the reputation of being a courageous and professionally competent officer.\nHe had served on different military posts.\nIn recognition of his excellent services and outstanding achievements, he was promoted to the rank of General in 2021 and appointed as commander of Turkish Land Forces in August 2023.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:11:44.890Z"
}
