{
  "title": "Civil society, private sector & academia’s collaboration with govt vital for digital transformation: Shaza",
  "link": "https://www.app.com.pk/national/civil-society-private-sector-academias-collaboration-with-govt-vital-for-digital-transformation-shaza/",
  "date_published": "2024-04-29T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 29 (APP):Minister of State for Information Technology and Telecommunication, Shaza Fatima on Monday said that collaborations among the government, civil society, private sector and educational institution is vital for achieving digital transformation in the country.\nShe expressed these views in her special remarks at the Country Digital Ecosystem Diagnostic Report: Validation Workshop dialogue hosted by the Sustainable Development Policy Institute (SDPI) and the Asian Development Bank (ADB) to facilitate knowledge exchange among key stakeholders, driving sustainable development in Pakistan’s digital landscape.\nThe Country Digital Ecosystem Diagnostic Report: Validation Workshop is a crucial milestone in the ongoing efforts to assess and enhance Pakistan’s digital landscape. The diagnostic report provides key insights into Pakistan’s digital ecosystem, identifying strengths, weaknesses, opportunities, and threats across different pillars.\nShaza Fatima emphasized the importance of diagnostic reports and research surveys for the government in creating well-informed policies, strategies, and their implementation.\nShe stressed that short-term, medium-term, and long-term plans must be based on available data to ensure effective decision-making in the digital transformation journey.\nShe acknowledged the challenges and opportunities Pakistan faces in this transformation. She also emphasized Prime Minister Shehbaz Sharif’s vision of national and digital transformation across economic, governance, and societal verticals. Khawaja also stressed the need for private sector leadership in this transformation, with the government facilitating through policies and regulations.\nShe outlined the ministry’s targets for IT exports and revenue, focusing on two pathways include streamlining data flows for digital identity creation and crafting enabling policies in consultation with stakeholders.\nDr. Abid Qaiyum Suleri, Exective Director, SDPI expressed gratitude for the support of ADB’s partnership with SDPI, which facilitated the completion of the Country Digital Ecosystem Diagnostic Report.\nAddressing the widespread integration of telecommunication and digital technology into Pakistani life, Dr. Suleri highlighted a significant issue: approximately 52% of the population lacks access to digital technologies due to infrastructure constraints as revealed by both the UNDP report and an independent study conducted by SDPI.\nHe emphasized the shared recognition in both reports of the immense potential for enhancing digital technology and communication in Pakistan.\nIn his concluding remarks, Dr. Suleri also highlighted the significant role of digitalization in combating climate change, emphasizing the necessity of leveraging various technologies, including robotics, for data analysis and adopting digital agriculture practices.\nHe highlighted the workshop’s potential to pave the way for addressing these challenges and maximizing the benefits of digitalization.\nAsad Aleem, Asian Development Bank of Pakistan said that today’s validation workshop will be a consultative dialogue process aimed at gathering valuable insights for the diagnostic report.\n“The Asian Development Bank (ADB) is transforming into a private and digital bank. As part of this transformation, ADB has integrated climate components into its projects, aligning with directives from its board.\nAdditionally, many projects include digital components, with some fully dedicated to climate and digital portfolios,”\nhe said.  Aleem said ADB stands as the second-largest partner of the Pakistani government, with an ongoing portfolio totalling around $9 billion.\n“We collaborate with provincial governments and annually approve approximately $2 billion in additional funding.\nThis year, a substantial portion of the pipeline, around $1.95 billion, is allocated for climate, digital, and infrastructure projects.”\nWhile the government plays a crucial role in providing policy frameworks, it’s equally essential for the private sector to take the lead in digital transformation, he said.\nIn his keynote address by Capt (Retired) Muhammad Mahmood, Additional Secretary (In charge), Ministry of Information Technology & Telecommunication,  praised the efforts of SDPI and other stakeholders in shedding light on key insights and findings regarding Pakistan’s digital landscape.\nHe emphasized the need for a more organized and holistic approach towards digitization, covering society, economy, and governance.\nMahmood expressed eagerness to review the finalized report and the forthcoming framework, which would assist in aligning recommendations with broader digitization objectives. He also called for collaboration to address existing challenges.\nIn his concluding remarks, Mahmood highlighted ongoing efforts of the government, such as the establishment of the Digital Commission and the Digitalization Authority, aimed at implementing digital initiatives.\nHe underscored the importance of coordination and integration among various initiatives to ensure their effectiveness.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:11:18.728Z"
}
