{
  "title": "Afridi urges PDM leaders not to speak language of Modi",
  "link": "https://www.app.com.pk/national/afridi-urges-pdm-leaders-not-to-speak-language-of-modi/",
  "date_published": "2020-10-14T12:30:00.000Z",
  "source": "APP",
  "content": "QUETTA, Oct 14 (APP): Chairman, Parliamentary Committee on Kashmir Shehryar Khan Afridi Wednesday urged opposition leaders not to speak the language of Indian Prime Minister Narendra Modi by blaming state of Pakistan and holding public rallies and rather initiate debate in the Parliament.\nTalking to media here after a grenade blast in Quetta, Afridi said that the enemy has once again tried to destabilise Balochistan by a grenade attack which was an act of cowardice but asserted that the enemy would fail in its evil designs.\nHe also visited the site of grenade attack and met those injured in the attack.\nHe said that those who had been looting rich resources of the country for decades were now trying to fool the people again by launching an anti government movement in the garb of Pakistan Democratic Movement (PDM).\n“We will allow the opposition to hold rallies but the opposition leaders must realise that it is time to get united and fight the expansionist designs of India,” he said.\nHe said the international media was calling Narendra Modi as a fascist, the opposition needed to stand by the government and help project the cause of Kashmir.\nHe said that in wake of India’s worst defeat in Ladakh, Maulana Fazlur Rehman, Nawaz Sharif and other opposition leaders must stop blaming state institutions as this is enemy’s agenda to blame the state institutions.\nHe said while Pakistani narrative was getting popular on Kashmir, the opposition leaders had started to blame the armed forces dancing on tune of the enemy.\nHe argued that when in power, Nawaz Sharif and Asif Zaradri never speak against the state of Pakistan but they only speak the language of India whenever they are out of power.\nHe said that the people would not be fooled again by the corrupt politicians who have kept Pakistanis deprived of its resources since past four decades.\n“Prime Minister Imran Khan has been active in restoring the pride and self belief of Pakistanis and such acts of terrorism can’t deter our resolve to revive Pakistan into a\nvibrant and thriving economic power of the world,” he added.\nShehryar Afridi said Balochistan development is a test for the coalition government and Prime Minister Imran Khan would leave no stone unturned to develop Balochistan into an attractive investment and tourism hub of the region.\nHe said that Pakistan was heading towards a positive trajectory and Imran Khan had foiled the evil designs of the enemy.\nWithout naming Pashtun Tahaffuz Movement (PTM) leaders, Shehryar Afridi said those who wanted to fool the Pashtuns with the slogans of Lar Bar were actually trying to destabilise Pakistan on whims of the enemy.\nHe said that such elements have been exposed time and again and no one can divide Pakistani nation on ethnic, linguistic, religious or sectarian lines.\nHe said that Indian occupation forces had made all efforts to subjugate the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) but it would fail.\nHe said that China, Pakistan Economic Corridor (CPEC) had provided an opportunity for the region to revive in economic terms but some groups on whims of the enemy were trying to stop this development process of Pakistan.\nHe said with the Afghan peace process gaining success, it was time ripe for the region to brace CPEC and put the region back on track of economic growth.\nKashmir Committee Chairman said India was being exposed due to its Hindutva regime and Pakistan was rising as a peaceful and economic power.\nEarlier, while addressing a seminar titled ‘Dukhtran-e-Pakistan Conference for National Integration’ held here at Sardar Bahadur Khan Women University Quetta, Shehryar Khan Afridi said that daughetrs of Balochistan are pride of Pakistan.\n“Fifth generation hybrid war has been imposed upon us and women have to play a leading role in thwarting the enemies’ designs by projecting the true image of Pakistan,” he said.\nHe said the enemy was confusing the Balochistan people in the name of deprivations and economic disparities and in the garb of ethnic, religious and sectarian divisions.\nQuoting examples of services of women from Islamic history, Shehryar Afridi urged young female students to play a bridging role between various groups of the society and urge for peace, development, education and economic empowerment.\nReferring to the blast in Quetta, Shehryar Afridi said that acts of cowardice by enemy could not demoralise the people of Pakistan and the nation would defeat the menace of terrorism.\nHe urged the students to project true image of Pakistan and Balochistan through writing blogs and articles and act as social media activists.",
  "retrievedAt": "2025-08-11T19:53:59.166Z"
}
