{
  "title": "Conference on “Oppression of Kashmiris under Indian Occupation” held",
  "link": "https://www.app.com.pk/national/conference-on-oppression-of-kashmiris-under-indian-occupation-held/",
  "date_published": "2020-10-14T13:32:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Oct 14 (APP): President Azad Jammu and Kashmir, Sardar Masood Khan on Wednesday said that for the past 73 years India has been committing war crimes against humanity in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nCalling India’s actions as human rights violations is a mere euphemism as they are committing massacres, killings, arbitrary detentions, torture, ethnic cleansing and genocide. International law and international humanitarian law covers all these violations and India should be brought to task for the crimes being perpetrated against innocent Kashmiris.\nThe AJK President said this while addressing an online conference on “Oppression of Kashmiris under Indian Occupation”, organised by the Lahore Centre for Peace Research (LCPR), said news release issued by AJK President office.\nThe conference was moderated by Chairman LCPR and former Foreign Secretary Ambassador Shamshad Ahmad Khan. Other speakers included Senator Sherry Rehman, Ambassador Zamir Akram, President of Jammu and Kashmir Council for Human Rights Dr. Syed Nazir Gilani and Mashal Malik.\nThe President said that right now the most serious crime that India is committing is settler colonialism.\nHe said that for over seven decades in an attempt to annexe the territory and win the hearts and minds of the Kashmiris, India has either used brute force or enlisted the help of pro-Indian politicians. “All these inducements and blandishments did not work. Still to this day, Kashmiris chant slogans of Azadi and aspire to join Pakistan”, he said.\nThe RSS-BJP regime, said Masood Khan, talks of the ‘final solution’; which for them is importing non-State Hindus into the IIOJK by the millions and permanently changing the demography of the region. He added that in the past 3 to 4 month over 1.8 million Hindus from all over India have been given Kashmiri domiciles.\n“They plan to take this number to 5-6 million in the near future. The process of settling Jews under the Balfour declaration took a century but India is replicating the same in just a matter of years.\nThis sort of unhindered and rapid influx of settlers has not been witnessed before. The Hindu zealots have introduced a policy, on the same pattern introduced by the Nazi party where Jews were disenfranchised, dispossessed, pushed into concentration camps and ultimately killed or forced to migrate”, said Masood Khan.\nThe AJK President said that war is being imposed on us and the Hindutva driven BJP-RSS regime yearns to fulfil its imperialistic agenda. He said that we must launch a proactive political and diplomatic offensive against Hindutva. “We must highlight that the world largest terrorist organisations the RSS with six million members who are indoctrinated and also provided military training,” he said.\nThe AJK President said that, unfortunately, the UN has washed its hands off the Kashmir issue. He said that over the past year India was severely censured by the international media, world parliaments and the civil society.\nEven though three informal sessions of the UNSC were conveyed on Kashmir, no resolution or presidential statement was made, and a lockdown is seen in the UNSC. Major world powers are reluctant to take action against India due to realpolitik and economic interest.\nThe AJK President suggested transforming the Kashmir movement into an international civil rights movement like the anti-Vietnam or the anti-Apartheid movement. This pressure, he said has to come from the international citizenry and only then the will the UN take notice.\nHe urged reaching out the civil society, women rights groups, human rights activists and academics. He said that we must also prepare a legal case against India, as all the steps taken by the extremist BJP-RSS regime, particularly after August 5, are illegal. He said that this case can be referred to various courts and tribunals that could be set up precisely for this purpose.\nMasood Khan also proposed to impose a Boycott Divestment and Sanctions movement against India. Countries around the world are responding but we have to take this movement to the higher playing field and achieve a critical pitch, he said, adding that with the help of Kashmiris teaching and studying at leading universities around the globe we would be able to fill the intellectual gap and propagate the true narrative of Kashmir as opposed to the false narrative peddled by India.\n“We have to penetrate further into the communication realm. We were provided a communication bonanza last year and we must not lose out on that space”, he said.\nAppreciating the role of the Pakistani-Kashmiri diaspora community, the President said that we must leverage the strengths of this community as they have already played a key role in highlighting the issue. “Our 10 million strong diaspora community have acted as a catalyst and internationalised the Kashmir issue”, he said.\nIn his final remarks, he said that we should reach out to the global arms control and disarmament community to warn them of the very obvious possibility of a nuclear war in\nour region. This war has to be averted as this region has become a nuclear flashpoint.",
  "retrievedAt": "2025-08-11T19:53:57.970Z"
}
