{
  "title": "Envoy highlights Pakistan’s smart lockdown strategy at D-8; expresses readiness for int’l cooperation",
  "link": "https://www.app.com.pk/national/commissioner-d8-lockdown/",
  "date_published": "2020-08-16T09:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): Pakistan’s Commissioner for D-8 Tariq Karim Sunday said that “smart lockdown” policy and other measures by Pakistan’s government had significantly improved pandemic situation in the country with notable reduction in new cases and fatality rate.\nIn his interventions at Special virtual session of the D-8 Commission, he highlighted Prime Minister Imran Khan’s major initiatives to combat the pandemic including $8 billion relief package for vulnerable groups. The initiatives included Ehsaas Emergency Cash Program and “Global Initiative on Debt Relief” for developing countries.\nThe session, co-chaired by Turkey (as current chair) and Bangladesh (as incoming chair), was attended by D-8 Commissioners/Representatives and the D-8 secretary general.\nThe meeting discussed various issues related to preparations for the 10th D-8 Summit to be held in Dhaka.\nThe D-8 Commissioner for Bangladesh briefed on the programme and events being planned for the next Summit.\nDirector General EC&OIC Tariq Karim, who participated in the meeting as Pakistan’s commissioner for the session also expressed Pakistan’s readiness to enhance international cooperation to combat the pandemic.\nHe also apprised the participants of the worsening human rights and humanitarian situation in Indian Illegally Occupied Jammu and Kashmir (IIOJK) in the wake of year-long inhuman military siege, communication blackout, and egregious violations of human rights.\nHe stated that despite widespread international condemnation, the Indian occupation forces continued to brutalize and disenfranchise the Kashmiris.\nHe stressed the importance of the world community and brotherly nations taking steps to alleviate sufferings of the Kashmiri people and to promote the realization of their inalienable right to self-determination.\nIn his remarks, the D-8 Secretary General Dato’ Ku Jaafar Ku Shaari updated member states on the activities and initiatives of the Secretariat.\nHe informed about the steps taken by the Secretariat and D-8 Health and Social Protection programme office (D-8 HSP) in order to provide support and strengthen cooperation among Member States in response to the COVID-19 crisis.\nThe secretary general also updated on the status of various D-8 projects and initiatives.\nPakistan is a founding member and key contributor to the D-8 activities. Other members include Bangladesh, Egypt, Iran, Indonesia, Malaysia, Nigeria and Turkey.",
  "retrievedAt": "2025-08-11T19:40:21.093Z"
}
