{
  "title": "2-year performance: Multiple initiatives taken to implement PM’s vision for expats, labourers welfare",
  "link": "https://www.app.com.pk/national/2-year-performance-multiple-initiatives-taken-to-implement-pms-vision-for-expats-labourers-welfare/",
  "date_published": "2020-08-15T23:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): The Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD) has made great strides for the welfare of Pakistani expatriates and social protection of labourers under the vision of Prime Minister Imran Khan.\nThe ministry had taken multiple initiatives for creation of more overseas employment opportunities, welfare of Pakistanis abroad, and provision of decent working conditions and social protection to the workers in the country, a senior officer of the OP&HRD ministry told APP on Sunday.\nHighlighting the ministry’s two-year performance, he said 496,286 and 382,439 Pakistani emigrants proceeded abroad during 2017 and 2018 respectively for prospective job assignments.\nMore than 968,000 emigrants had been registered by the Bureau of Emigration and Overseas Employment in the same period for foreign jobs, he added.\nHe said the ministry had signed the Memoranda of Understanding (MoUs) with Saudi Arabia, United Arab Emirates, Japan and Kuwait for boosting manpower export to those countries. More markets were being explored to create employment opportunities for Pakistanis, he added.\nThe officer said it was the first government which had made sure 100 per cent biometric verification of intending emigrants to streamline the registration process, improve service delivery and curb malpractices in the emigration process.\nBiometric verification system at all the seven protectorate offices had been linked with the National Database and Registration Authority (NADRA).\nHe said the National Identity Card for Overseas Pakistanis (NICOP) condition for the migrants had been abolished to reduce cost of migration. One-window facilitation desks for the collection of all registration fees including welfare fund, insurance charges and promotion fees had been set up at all the protectorate offices.\nEstablishment of Machine Readable Passport (MRP) facility at Overseas Pakistanis Foundation (OPF) Headquarters, Qatar Visa Centers, dedicated desk in Model Police Station F-6, Islamabad, online complaint redressal system, Naya Pakistan Calling and creation of online linkage with destination countries for employment promotion was among other initiatives taken by the OP&HRD ministry for welfare of expats.\nHe also highlighted the initiatives, taken for providing safe and secure investment opportunities to the overseas Pakistanis in real estate sector. It included OPF Greens (Farm Housing Scheme) Lahore spanning over 355 Kanals and development of OPF Town at Raiwind Road, Lahore.\nThe officer said the ministry had also finalized plan for construction of 50 Country Homes and 126 housing units comprising six apartments in OPF Housing Scheme, Zone-V, Islamabad and high-rise apartment buildings at OPF Housing Scheme Raiwind Road, Lahore, He said the ministry had also played a leading role in bringing back over 300,000 citizens to the country under the world’s largest evacuation operation, launched after the global travel came to a halt due to the coronavirus pandemic.\nThe officer said the ministry had provided Rs 20 million to the government for sending cooked meal to the stranded Pakistanis students in Wuhan and later ensured subsidized air travel for their return.\nSharing details of the pro-labourer steps, he said, the Employees Old-Age Benefits Institution (EOBI) pensioners had been given a top up of total 62 per cent during the last 20 months of Pakistan Tehreek-e-Insaf (PTI) government.\n“They are drawing Rs 8,500 pension in this year,” he added.\nHe said the EOBI had given a raise of 30 percent in 2019 after which the annuity reached Rs 6,500.\nFrom September, the officer said pension would be delivered to EOBI pensioners at the door steps by using different modes such as postal services.",
  "retrievedAt": "2025-08-11T19:40:25.155Z"
}
