{
  "title": "Excavation of Buddhist site; Dillu Roy unveils ancient town planning",
  "link": "https://www.app.com.pk/national/excavation-of-buddhist-site-dillu-roy-unveils-ancient-town-planning/",
  "date_published": "2020-08-16T16:35:00.000Z",
  "source": "APP",
  "content": "By Qazi Iftikhar Ahmad\nMULTAN, Aug 16 (APP): Sandwiched between grandeur of Suleman mountain range and the might of roaring river Indus, the plain strip that runs through Dera Ghazi Khan division is believed to be hiding evidence and clues to Buddhist civilizations once surviving and thriving there.\nThis land has witnessed many Royal families, Kings, Rajas and Sardars and their ruined forts, cities and villages are hidden under the soil accumulated over centuries of human interventions and weather impact. Dillu Roy ruins awaited decades for excavation to tell the tales of the rise and fall of the dynasties of ancient times and the culture that prevailed then.\nMound Dillu Roy or Dillu Roy Ther (Ther being Seraiki equivalent of English word Ruins), dating back to the Buddhist era was declared a protected site in 1962 by Punjab archaeology department and it was in fiscal year 2017-18 when the government launched a Rs 17.323 million project to build a boundary wall around the Buddhist site ruins for protection from private collectors of artifacts and to undertake excavation.\nThe wall has almost been completed while a team of experts, led by the lone archaeologist of Punjab archaeology, deputy director south Muhammad Hassan, was assigned  the task    by director general archaeology Muhammad Ilyas Gill to excavate the site.\nDillu Roy is believed to be a prince who once ruled this area.\nAccording to a myth narrated by noted travelogue writer Dr. Abbas Birmani in his book ‘Tilismati Wadiyan’ or ‘Magical Valleys’, Dillu Roy was a cruel ruler and the city faced destruction due to a curse from a woman. He described the ruins as ‘A speaking city asleep’.\nIt is located at the border line of DG Khan and Rajanpur districts, however, most part of the ruins lie in Kot Chutta tehsil of DG Khan and rest in tehsil Jampur of district Rajanpur.\nHowever, it is nearer to Jampur i.e only eight (8) kilometres to its north west and 20 kilometres south of Kot Chutta.\nThe excavation began in Jan 2020 and concluded on Mar 20, 2020.\n“It was a 45-day exercise, which, however, lasted for 52 days due to shortage of skilled workers”, the archaeologist said adding: “Fortunately its completion coincided the novel coronavirus lockdown but we were done with the project by that time.”\nHassan said that the contour of the mound was intact and the watch tower structure stands surviving on a cultural heritage site.\nThe site covers almost 50 acre area and divided into two parts roughly 35-45 meters.\nThe excavation was undertaken on scientific lines on three selected points and 22 squares measuring 5×5 meters were opened.\nBesides this, the ruins of fortification wall and other mud brick structures, occupational levels have been revealed in different squares under dug.\nThe archaeologist said that the vertical limited excavation of season 2020 has added new valuable information about Hindu-Shahi, Gupta, Sassaian, and Kushan dynasties which have been recorded in their chronological sequence. “It seems the most of the upper part of the mound was subjected to human vandalism and rain disturbed. Scanty cultural deposits of the last phase of this city were recorded. The diggings unveiled material evidence which helped link the missing gaps of the Gupta, Sassaians and Kushan periods, he said.\nThe excavation yielded a treasure of information and cultural material like pottery and small finds which belong to 2nd to 7th century AD.\nHassan said: “Though limited both in time and extent, the excavation produced some material relic of Brahmanical character in pre-Muslim levels, which in the absence of dateable evidence, can not be placed securely within the known dynastic division of Hindu India.”\nThe chronological sequence of Mound Dillu Roy can be compared with various sites in Gandhara like Taxila, Shaikhan Dheri, Badalpur, Kashmir Smast etc.\nExcavation brought to light some 1370 small artefacts consisting of terracotta bowls, human moulds, animal and human figurines, terracotta beads, stone beads, grinding mill, iron and copper objects of household nature, shell bangles, glass and copper rings, bangles and amulets.\nHowever, some of these deserve a special mention including a seated lion in gray schist stone panel depicting Jataka story, a terracotta Buddhist plaque and a clay female seated statue.\nThe typical Gandharan style small figure of lion’s (Simha) left side shows a sturdy lion in upright seated position.\nHowever, right side of the lion is strikingly different and unusual. It represents episodes associated with the Buddha like Naga Apalala and episodes of the Visvantara Jataka.\nThe discovery of terracotta Buddhist plaque is also very interesting but unfortunately partly broken. These figures were drawn in Indian style which are well known from Mauryan and particularly Shunga period down to very late period.\nThe remarkable clay female seated statue was found at the depth of 42cm from thesurface on floor level. The mud clay the statue was in broken condition with its head, an arm and torso separated and it looked as if it was fixed in a wall or placed on a cornice at a reasonable height. “Most probably, this figure is Parvati due to her prominent breasts and third eye.”\nDiscovery of a thick deposit of clay bullae/sealings was unique. “More than 1000 clay bullaes were found and such type of sealings were commonly used for different purposes like official documents, private letters or personal seals, banker or merchant stamps, Buddhist codes for teaching and religious purposes.”\n“These usually display personal names, and titles.  The bullaes/sealings in different imprints and scripts, decorative burnt bricks, and inscribed baked bricks are of paramount archaeological interest”, the archaeologist said.\nThe discovery of he added.seals, tablets was made during surface collection. These seals depict human figure along with Brahmi script. Some figures are fascinating and provoke thoughts for further study. These are related to Indian and Greek mythologies. Many figures of these mythologies have been reported but stylistically these are new and different from the others,” he added.\nHassan said that the excavation season 2020 was helpful in finding new information and substantiated earlier assessments that it was Buddhist site from Sytho-Parthian era.\nHowever, he added, the ruins still hold more information and vast potential for further excavation and more discoveries particularly the Sytho-Parthian and Greek periods.",
  "retrievedAt": "2025-08-11T19:40:20.876Z"
}
