{
  "title": "Overseas Kashmiris congregation urges UN, EU to take stringent notice of human rights abuses in IIOJK",
  "link": "https://www.app.com.pk/national/overseas-kashmiris-congregation-urges-un-eu-to-take-stringent-notice-of-human-rights-abuses-in-iiojk/",
  "date_published": "2020-08-16T02:36:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJk): Aug 16 (APP): The speakers while addressing a largely-attended Kashmir conference held in Italian city of Brescia the other day to mark India’s Independence Day as black day urged the United Nations (UN) and European Union (EU) to take immediate notice of Human rights violations in Illegally Indian Occupied Jammu and Kashmir (IIOJK), says a message reached here on Sunday.\nThe conference was organised by Tehreek-e-Kashmir (TeK) Europe Itlay.\nOn the occasion President TeK United Kingdom ( UK) Raja Fahaim Kayani said that since August 5, 2019 people of IIOJK were under lock down and during these days India silently gave more than 400,000 Hindu extremists domiciles or Kashmir citizenship certificates to purchase land and property in the occupied valley aimed to change its demography and convert muslim majority state into minority.\n” India has no right to celebrate August 15 as its independence day . New Delhi has snatched the right of vote from the people of Kashmir,” he said, adding Kashmiris ultimate demand was to give them right of self-determination accepted by the UN.\nPresident TeK UK Kayani further said that it was time for world powers to put pressure on India to stop rising human rights violations in IIOJK and give Kashmiris chance to decide about their political future as per the UN resolutions.\nAnother Kashmiri leader and President TeK Itlay Mehmood Sharif said that people in Europe were with Kashmiri brothers who had been fighting for the right of self-determination adding “How long India will continue the illegal and inhuman siege of Kashmir and one day New Delhi has to give Kashmiris their birth right that is plebiscite.”\nSecretary General TeK Italy Jamshed Cheema said that Pakistanis and Kashmiris living in Itlay would continue to support Kashmiris in their right of self-determination struggle. This conference on the day when India was celebrating independence day but at the same time New Delhi had suppressed the freedom of Kashmiris, Cheema said , adding that they would continue to raise IIOJK issue across Europe till its final and durable settlement as per the wishes of the people of IIOJK.\nThe other speakers of the Kashmir conference also supported Kashmiris ongoing freedom struggle and vowed to continue their support in future to settle Kashmir dispute once for all to bring peace, security and tranquility in South Asia.",
  "retrievedAt": "2025-08-11T19:40:22.054Z"
}
