{
  "title": "PCAA seeks ‘comprehensive report’ on IIAP damage caused by rains",
  "link": "https://www.app.com.pk/national/pcaa-seeks-comprehensive-report-on-iiap-damage-caused-by-rains/",
  "date_published": "2020-08-15T23:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 16 (APP): Pakistan Civil Aviation Authority (PCAA) on Sunday took strong note of the damage caused by recent rains at Islamabad International Airport (IIAP), seeking a ‘comprehensive report’ and ‘permanent solution’ of the issue within three days from the quarters concerned.\nThe August-14 wee hours’ heavy thunderstorm, lashed the airport with 56 mm rain in less than 90 minutes, which was accompanied by 37 knot winds. “The thunderstorm ended just before 04:00 a.m.,” an Aviation Division news release said.\n“As a result, heavy leakage of water occurred at various points of airport including Concourse halls, Domestic arrival lounge, CIP lounges and International departures area. Furthermore, numerous pieces of false ceiling also dropped down at some locations.”\nThe Director General (DG) PCAA has issued directives for a comprehensive report along with a permanent solution within three days.\nAccording to the Airport Manager and his maintenance staff, heavy leakage occurred due to torrential rain that resulted in over flowing of drains at rooftop of the passenger terminal building.\nThe authority said multiple solutions of the issue were under consideration, including adding up more water pipes for quick ejection of rain water through increased drains or changing the entire drainage design over the rooftop.\n“The DG has directed that Project Director IIAP and Airport Manager IIAP shall submit a joint report on the solution to this recurring problem and will also take all necessary measures to prevent the same in future,” the news release said Minister for Aviation Ghulam Sarwar Khan is expected to visit the the airport on Monday along with senior officers of the Aviation Division and PCAA.",
  "retrievedAt": "2025-08-11T19:40:26.660Z"
}
