{
  "title": "Water scarcity poses risk to Sindh’s populace: Climate Minister",
  "link": "https://www.app.com.pk/national/water-scarcity-poses-risk-to-sindhs-populace-climate-minister/",
  "date_published": "2022-05-14T17:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Federal Minister of Climate Change Senator Sherry Rehman on Saturday said that the distribution of water in the country must be fair, timely and equitable, particularly in times of stress.\nDuring The Indus River Event in Karachi, she acknowledged the efforts of the Expedition Indus team on their successful completion of 30 days of rafting all the way from north to south of the Indus River.\nShe said “we laud their heroic efforts to actually map this artery of life over 30 days, and to engage with communities along the way on how their lives and livelihoods are impacted by changes in the quality of water from pollution, reduction in flows, and the losses in its ecosystem. Expedition Indus has been a great initiative and should be an eye-opener for all”\nWhile talking about water scarcity in Sindh, Senator Sherry Rehman stressed, Sindh, being at the tail end of Indus River, is directly impacted by 60 per cent shortage of water in the Indus, putting at risk the provincial population, agriculture and livestock. Kotri barrage downstream should have an adequate 15,000 cusecs of water, but instead less than 2,000 cusecs are being released. It is a grave calamity to see that there is no river flow after Kotri. Due to this severe shortage, farmers are dangerously at a risk of losing their cotton, rice and other crops in Sindh.”\nShe went on to talk about the plight of the Indus River and its delta, “Indus supports various forms of life and biodiversity even as it faces climate challenges and adverse effects due to human activities. The region is home to a rich biodiversity of migrating water birds, fish, and one of the last remaining species of freshwater dolphins. The Delta has shrunk to a shocking 92% since the earliest it was recorded. The placements of dams and barrages have added to the shrinkage. There is little to no sediment that reaches the delta anymore, which is resulting in saline-sodic lands in turn forcing people to migrate to cities that are already filled to the brim.”\nShe further stated, “it is heartbreaking to see fishing communities like Mohana give up their traditional fishing grounds and be forced to migrate to areas closer to the barrages, but with high-interest loans to buy boats and fishnets, their livelihood is further compromised. There is a continual loss of social life in communities along the length of the Indus River. Those who remain have no resources to migrate, surrounded by lands where nothing grows anymore. Upto 78% of water is unfit for drinking, studies have found arsenic beyond the permissible limit prescribed by WHO in the water samples collected from RO plants near the delta. The industrial waste dumping into the Indus has been an on-going issue and a threat to the communities as well as the biodiversity.”\nHighlighting the high level of urgency to protect the Indus River System she announced the start of an ‘Indus Recharge Initiative’, “the policy framework is already in the pipeline and should be released by mid-June.”\nShe finally concluded by expressing the need for ministries to work together before it is too late, “the Indus River is Pakistan’s lifeline. It has existed for thousands of years and is a part of our heritage. On priority, we need to regulate water flows annually below the Kotri barrage. The Water Accord of 1991 needs to be implemented, the distribution needs to be fair, that is the only way out of a dying river Indus in Sindh. Policymakers need a better understanding of why the flow of the river Indus to the sea is important, it is not wastage. If freshwater does not flow towards the delta, there is a huge loss of biodiversity, culture, and heritage. Rehabilitation of the Indus ecosystem and flow would be a solution where Interprovincial efforts would be seriously required. After some time. Sindh will face severe environmental and livelihood issues in the future, south Sindh is already in the position of CIM(Climate-Induced Migration). We need to give this mighty river its flow back, and clean it off toxins. Like all great rivers, we will give its own species rights and declare it a living entity with its own environmental rights, which is being done for big water bodies and rivers in the world. If the Indus is at risk, Pakistan is at risk. The Climate Ministry will work on a Recharge Indus policy and report back with an action plan for the provinces.”",
  "retrievedAt": "2025-08-11T14:54:03.232Z"
}
