{
  "title": "Responsibility of economic woes lies over PTI shoulders, says Rana Sanaullah",
  "link": "https://www.app.com.pk/national/responsibility-of-economic-woes-lies-over-pti-shoulders-says-rana-sanaullah/",
  "date_published": "2022-05-14T16:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 14 (APP): Federal Minister for Interior Rana Sanaullah on Saturday said that Pakistan Tehreek e Insaf (PTI) was responsible for damaging the economy.\nHe made these remarks while talking to a private news channel on Saturday, also slamming the PTI chairman for promoting filthy language among young children besides spreading anarchy in the country.\nCommenting on rising inflation, he said PTI leaders had made harsh agreements with the  International Monetary Funds (IMF). Whereas, the minister said that Pakistan Muslim League (Nawaz) government was making efforts to make soft agreements with the IMF to provide relief to a common man. On the talks of removing subsidy, the minister said, the PML-N could not unilaterally abolish it without consulting the coalition partners. He said, removing subsidy from different products including petroleum would increase hardship of already inflation-hit people.\nMoreover, the interior minister, Rana Sanaullah said, we will have to take hard decisions in consultation with coalition partners for reducing subsidy on various items.\nIn reply to a question about public meeting called by PTI in Sialkot Church ground, he said, we would not allow any person to violate law and order. He said the government holds  responsibility to provide security to every citizen.\nDispelling the impression given by the PTI leaders for weak security arrangements, he said that government had  provided full security to PTI leaders for organizing public meeting.\nExpressing resentment over indecent language used by PTI leaders at public places, he said that Imran Khan’s workers and supporters should avoid  using derogatory language at Church ground. “No one is allowed to disturb peace and tranquility in any part of the country,” he warned.",
  "retrievedAt": "2025-08-11T14:54:03.228Z"
}
