{
  "title": "Difficult time is over, best people running the country: Rana Tanvir",
  "link": "https://www.app.com.pk/national/difficult-time-is-over-best-people-running-the-country-rana-tanvir/",
  "date_published": "2023-05-06T15:32:00.000Z",
  "source": "APP",
  "content": "LAHORE, May 06 (APP):Federal Education Minister Rana Tanvir Hussain said on Saturday that the most difficult times of the country were over now, and the best people were running it at the moment.\nHe was addressing a ceremony held for distribution of wheelchairs among special students under the Prime Minister’s Electric Wheelchair Scheme, organised by the Higher Education Commission (HEC) at the Punjab University here .\nHe urged the universities to improve their quality of education and making money should not be the purpose of their establishment.\nHe said that the initiative of electric wheelchairs for physically challenged students was launched in 2018, and so far more than 600 such young people had received the chairs from the HEC.\nHe said that special persons were precious assets to society, and it was a responsibility of the government to provide opportunities to them to help them achieve their desired goals. He said the incumbent government was trying to fulfill its responsibilities on this front as well.\nThe minister asked all departments including the educational institutions to build ramps in their buildings to facilitate the special citizens. He said that the Pakistan Muslim League-Nawaz (PML-N) launched such programmes for the youth whenever it got a chance to serve them. He said that the PML-N, during its tenure, gave away laptops to the youth besides scholarships for higher education to talented students.\nRana Tanvir said that it was a matter of pride for the PML-N that it always promoted merit, good governance and initiated welfare projects for masses. He said that during its previous tenure, loadshedding was one of the major issues of the nation, and the then prime minister Nawaz Sharif and the incumbent premier Shehbaz Sharif resolved the issue of loadshedding on war-footing basis.\nThe minister said the PML-N government had introduced Metro Bus Service in Lahore, Multan and the twin cities of Rawalpindi and Islamabad, and the common people were facilitated directly.\nThe minister urged students to get vocational education as the skilled people were in high demand across the world.\nHe regretted stopping of the ranking system for the national universities, he said it should be restarted at the national level.\nResponding to questions of the media persons, he said that amendments to the NAB Act could be passed by reaching consensus among all parties including Pakistan Tehreek-e-Insaf (PTI).\nHe said all political parties had agreed that elections should be held on the same date in the Centre and provinces, but the PTI had objections on the final date.\nThe minister said that Imran Khan once again sat in the wheelchair so he should be given status of national special person, and the government should provide him an electric wheelchair. He said that Imran blamed others that they were cowards, but now he (Imran) himself was appearing before the courts by hiding his face under a black basket.\nPunjab University Vice Chancellor Professor Dr Khalid Mehmood, HEC Director Ayesha Ikram also spoke.Special students also shared their problems with the minister.\nIn the ceremony , electric wheelchairs were given to 37 special students from different universities of the province.",
  "retrievedAt": "2025-08-11T08:27:06.299Z"
}
