{
  "title": "ICT admin rejects PTI’s application about public rally",
  "link": "https://www.app.com.pk/national/ict-admin-rejects-ptis-application-about-public-rally/",
  "date_published": "2023-05-06T07:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 6 (APP): The Islamabad Capital Territory (ICT) administration has rejected the application about the permission of peaceful public rally from Zero Point to Fatima Jinnah Park (F-9) here on Saturday.\nThe application was moved by Ali Nawaz Awan, President, Pakistan Tehreek-e-Insaf (PTI) chapter to the District Magistrate.\nAccording to the documents issue by the ICT Administration here Saturday, it is stated that Section 144 Cr.PC. is imposed on all kind of public gatherings in Federal Capital by this office vide order dated 23rd March, 2023.\nHowever, in Constitutional Petition No. 2 of 2022, the Honorable Supreme Court has directed that a mechanism may be worked out with the political parties regarding conduct of rallies and the days and venue thereof.\nMoreover, the Honorable Islamabad High Court in Writ Petition No. 1082/2022 observed that political\nparties are expected to strictly comply with the regulations and restrictions prescribed in the interest of maintaining public order and imposition of reasonable restriction in the context of regulating/exercising the right guaranteed under Article 16 of the Constitution is within exclusive domain of executive authorities’ vis a vis Article 15 of the Constitution.\nThe Honorable Islamabad High Court in W.P No 1515 of 2023 directed the undersigned to grant hearing to the petitioner and decide the application in accordance with law through reasoned order given that it involves fundamental rights of the petitioner and members of the petitioner guaranteed under Articles 15, 16, 17 and 19 of the Constitution.”\nIt is also observed that the visit of Foreign Minister of China along with delegation coincides with the proposed rally. Allowing the rally on this route will disrupt the security of VIP movement.\nFurthermore, in the light of letter received from Law Enforcement Agencies dated 5th May 2023, there is a possibility of terrorist activities in twin cities and any opportune target can be hit. The rally/large gathering of people on main Express Highway or any other in Federal Capital is not advisable in these circumstances.\nIt was also stated, with grave concern that in the past, the terms and conditions of NOCs issued to you were never completely complied with and violations were committed despite submission of affidavits which created law and\norder situation and caused damage to public properties.\nThus, this office cannot rule out the possibility of violation of the agreed terms and conditions.\nIn view of above, the instant application has been examined and the permission for holding public rally from Zero Point to Fatima Jinnah Park (F-9), Islamabad on 6th May is hereby “Regretted”.",
  "retrievedAt": "2025-08-11T08:27:12.795Z"
}
