{
  "title": "PM attends coronation of King Charles III",
  "link": "https://www.app.com.pk/national/pm-attends-coronation-of-king-charles-iii/",
  "date_published": "2023-05-06T14:20:00.000Z",
  "source": "APP",
  "content": "LONDON, May 6 (APP): Prime Minister Muhammad Shehbaz Sharif represented Pakistan at the coronation ceremony of King Charles III here on Saturday. The coronation is the first occasion in 70 years that a British monarch has been anointed. Earlier, his mother, the late Queen Elizabeth II had ascended the throne in 1953.\nPrime Minister Shahbaz Sharif representing Pakistan, conveyed best wishes on behalf of the government and the people of Pakistan to the King.\nEarlier, on Friday, the Prime Minister attended a gathering of Commonwealth leaders at the Commonwealth Secretariat in London.\nSpeaking at the event, the Prime Minister noted that the accession of the new King, who is also head of the Commonwealth, opened new vistas and fresh avenues for the multilateral forum and was an opportune moment to infuse the organisation with even greater energy and sense of purpose.\nHe underscored the significance of Pakistan-Commonwealth partnership, particularly on youth empowerment and youth engagement.\nOn the sidelines, he interacted with a number of global and Commonwealth leaders including UK’s Prime Minister Rishi Sunak and Secretary General Commonwealth Patricia Scotland.\nThe Prime Minister is also due to meet First Minister of Scotland Humza Yousaf on Sunday. Hamza who was recently elected by the Scottish Parliament to head the devolved Scottish government, is the first Muslim and first British Pakistani to do so.\nPakistan and the UK enjoy a deep and enduring friendship grounded in historic affinities and abiding people to people linkages.\nThe Prime Minister’s participation at the coronation underscores the enduring and multifaceted ties that continue to exist between the two friendly countries, inter alia through the Royal family’s longstanding and affectionate association with Pakistan and its people.",
  "retrievedAt": "2025-08-11T08:27:08.024Z"
}
