{
  "title": "President orders restoration of WAPDA welfare grant to special person",
  "link": "https://www.app.com.pk/national/president-orders-restoration-of-wapda-welfare-grant-to-special-person/",
  "date_published": "2024-01-06T07:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 06 Jan (APP): President Dr Arif Alvi has directed WAPDA to immediately pay  and restore a welfare grant to a retired employee’s special child from the date of its discontinuation.\nHe also ordered WAPDA to initiate disciplinary proceedings against delinquent officials who decided to stop the welfare grant despite the fact that the grant had been issued for life after fulfilling the required criteria, President Secretariat Press Wing said in a press release on Saturday.\nWhile accepting a representation of Syed Noor Ali Zaidi (the complainant) against Wafaqi Mohtasib’s decision, the president said that the delinquent officials caused an embarrassing situation, not only for the family of a retired employee but also for WAPDA by unjustly stopping the welfare grant to a person with disability (PWD) who had been declared unemployable for life and was totally dependent on his parents.\nHe said that WAPDA should contact the Ministry of Human Rights, which had a definite programme to teach more than 50 skill sets to PWDs and later link them to possible employers.\nHe stressed that on such issues, it was the responsibility of institutions like WAPDA to guide PWDs, take social responsibility and ensure that they become employable.\nAs per details, the complainant had alleged before Wafaqi Mohtasib that he was a special child of a retired employee of WAPDA, that the medical board had declared him unemployable for life and recommended him for WAPDA Welfare Fund under the rules.\nAccording to him, he was getting the welfare grant regularly until he attained the age of 21 when WAPDA struck his name off from the WAPDA medical treatment book.\nFeeling aggrieved, he approached wafaqi mohtasib, who passed the order that WAPDA did not commit any maladministration as the complainant was 30 years of age and was not entitled to the free medical facility and welfare grant, as per rules.\nFeeling aggrieved, the complainant raised the matter with the president by filing a representation against the mohtasib’s order.\nThe president, in his decision, further observed that a few key facts had escaped the notice of the wafaqi mohtasib, which established that the complainant was entitled to the welfare grant.\nHe pointed out that the complainant had been declared by WAPDA’s own medical board as “deaf and dumb since birth”, “unemployable for life” and “totally dependent on his parents” in 1996.\nHe observed that the managing committee of Wapda welfare fund had sanctioned a welfare grant for life for the complainant in 1996.\nThe president also referred to welfare fund rules which provided for the provision of welfare grants to special children of WAPDA employees subject to the provision of medical certificates, adding that NADRA had also issued a CNIC to the complainant depicting him as a “person with disability for life”.\nThe president concluded that the welfare grant was issued to the complainant as per rules and the question that who decided to stop the welfare grant and why needed to be investigated.\nHe also asked WAPDA to initiate disciplinary proceedings against delinquent officials and report compliance within 30 days to the Mohtasib.",
  "retrievedAt": "2025-08-10T23:26:17.302Z"
}
