{
  "title": "17 Pakistani female university students to participate in future of women in energy scholars program in Qatar",
  "link": "https://www.app.com.pk/national/17-pakistani-female-university-students-to-participate-in-future-of-women-in-energy-scholars-program-in-qatar/",
  "date_published": "2022-06-03T13:56:00.000Z",
  "source": "APP",
  "content": "According to a press release issued by the U.S Embassy in Pakistan, the start of the U.S.-Pakistan Women’s Council’s (USPWC) inaugural four-week Future of Women in Energy Scholars Program will help women learn about working in the energy sector.\nThis program will foster women’s participation and leadership in Pakistan’s energy sector by providing young women the opportunity to study energy issues and energy infrastructure at Texas A&M University’s campus in Qatar. Following their two-week program in Qatar, the students will return to Pakistan for a two-week familiarization trip to engage with key Pakistani public and private-sector organizations in Islamabad and Lahore to learn about Pakistan’s energy sector.\nAccording to the press release, U.S. Ambassador to Pakistan Donald Blome said, “Coinciding with the 75th anniversary of establishing diplomatic relations between the United States and Pakistan, we are excited to launch the USPWC’s Future of Women in Energy Scholars Program. Through this program, the U.S. Mission in Pakistan is helping Pakistani women to pursue career opportunities in the energy sector and help them develop networks for a vibrant future.”\nThe USPWC Executive Director Radhika Prabhu said, “The USPWC Future of Women in Energy Scholars Program will give young women hands-on experience in the energy sector. Congratulations to these future leaders!”\nThe U.S.-Pakistan Women’s Council is a public-private partnership that seeks to increase women’s economic participation in Pakistan by catalyzing commitments from the private sector, civil society, and government leaders in both countries to advance women’s economic empowerment in Pakistan.\nThe program is jointly sponsored by the U.S. Mission Pakistan, the U.S. Department of State, the U.S. Department of Energy, the U.S. Agency for International Development (USAID), Texas A&M University, and a number of public-sector and private-sector energy employers interested in promoting women’s advancement in the energy sector.\nThe program is a product of the U.S. government’s commitment to advance women’s educational and economic participation in Pakistan’s energy sector during the U.S.-Pakistan Energy Dialogue in September 2021.\nThe Pakistani women students in the program are currently pursuing bachelor’s degrees in science and engineering at private and public universities throughout Pakistan and were chosen through a rigorous selection process.",
  "retrievedAt": "2025-08-11T15:01:17.025Z"
}
