{
  "title": "Efforts on card to start two-way flights between Pak-China",
  "link": "https://www.app.com.pk/national/efforts-on-card-to-start-two-way-flights-between-pak-china/",
  "date_published": "2022-06-03T08:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP): Efforts on card by the Ministry of Federal Education and Professional Training for operating two-way special flight between Pakistan and China in order to facilitate the Pakistani students enrolled in Chinese universities.\nThe relevant Chinese authorities, in that regard, would be requested for two-way operating special flight so that students in China could also be facilitated in coming back to Pakistan, the official sources from the Ministry of Federal Education and Professional Training told APP.\nIn first phase, Ministry of Federal Education and Professional Training in collaboration with the Ministry of Affairs and other relevant institutions was making all-out efforts for the return of Pakistani students to China in order to continue their studies in Chinese universities that were halted due to Covid-19.\nAccording to the sources, the initiative has been taken on the special directions of Federal Education Minister Rana Tanveer Hussain who took special interest in that regard and put the issue on top priority.\nThe authorities concerned ensured speedy execution of these students so that their educational loss can be minimized on emergency basis.\nIn that regard, a special charter flight of PIA will fly on June 7th to take Pakistani students to Xian, China, the sources said adding that, the minister was informed that all formal approvals for a charter flight have been gained from the government of China. The flight will take approximately 150 students back to China, contingent on issue of Chinese visas to Pakistani students.\nThe sources informed that the ticket prices have been highly subsidized so that they are affordable for the students, adding, 112 student visas have been issued to the Pakistani students while 17 visas are still pending.\nA number of meetings had taken place between Ministry of Federal Education and Professional Training, Ministry of Foreign Affairs, Higher Education Commission and Aviation Division with the Cultural Counselor in Chinese Embassy in order to start the return of Pakistani students to China, they told. The process of returning Pakistani students has been started in coordination with the Chinese government, they said.\nZhang Heqing, Cultural Counselor in Chinese Embassy informed that 96 Visas have been issued and reiterated that Chinese Embassy in Islamabad would assist in providing remaining visas to students, the sources said.\nPakistan government has thanked the Chinese government for the support and called Pakistan and China iron brothers. Education Minister hoped that such cultural exchange would lead to enhanced bilateral relationship and trade, the sources added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:01:28.571Z"
}
