{
  "title": "Need stressed for augmenting training courses to improve performance of officers",
  "link": "https://www.app.com.pk/national/need-stressed-for-augmenting-training-courses-to-improve-performance-of-officers/",
  "date_published": "2022-06-03T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP): Joint Secretary Ministry of Information and Broadcasting Muhammad Arshad Muneer on Friday stressed the need for augmenting training courses for officers and officials of the Ministry and its attached departments to enhance overall performance.\nHe was speaking as chief guest at the graduation ceremony of 33rd Mid Career Management Course training programme (4th domain-specific course) held  at Information Services Academy.\n He hinted at making the capacity-building courses mandatory for in service  officials of the ministry and its attached departments.\nHe appreciated the Information Service Academy (ISA) for conducting\ncapacity-building courses to improve the performance of officials.\n Director-General ISA Saeed Javed in his address said that training was important to meet the new challenges in the field of media. He said that job of the information officers had become challenging in view of fifth generation media warfare and the introduction of social/digital media platforms.\nHe extended gratitude to the Ministry of Information for providing support to the institution for conducting different training programs for the officials and officers of the ministry and its attached departments.\nDirector Training ISA Ghazala Ambreen shared the details of the training course and said that it was the fourth such course. Previously three Domain Specific courses had been held successfully.\nAt the end, participants of the course were awarded shields and\ncertificates on completing the course. Later, the chief guest inaugurated the Digital and Social Media Simulation Lab and the Studios which have been established by the ISA to impart training to new entrants in the information group in the spheres of social and digital media along with enhancing the officers skill in the area of broadcasting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:01:27.588Z"
}
