{
  "title": "Balochistan successfully holds free, fair first phase of LG polls: FAFEN",
  "link": "https://www.app.com.pk/national/balochistan-successfully-holds-free-fair-first-phase-of-lg-polls-fafen/",
  "date_published": "2022-06-03T16:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 3 (APP): Balochistan has successfully completed the controversy-free first phase of the local government (LG) polls to elect over 6,000 general councilors, with prompt acceptance of the results by all major political parties.\n“Such an acceptance augurs well for democracy and development in the province where the integrity of electoral exercises has previously been questioned,” the Free and Fair Election Network (FAFEN), in its report on LG election in Balochistan released on Friday.\nDespite sporadic illegalities and irregularities, the elections remained largely peaceful, orderly and better-managed. FAFEN observers reported a large number of voters turning out to vote on election-day.\nAlthough majority of polling stations (65 percent) were categorized as sensitive or most-sensitive security-wise, the election-day remained largely peaceful with scattered incidents of local violence reported in some districts.\nAs many as 17,774 candidates, including 17,642 male and 132 female were in the run for general seats fielded by 17 political parties in 6,259 wards (5,345 rural and 914 urban wards) in municipal corporations, municipal committees and union councils.\nThe Election Commission of Pakistan had set up a total of 6,237 polling stations, including 671 male, 652 female and 4,914 combined. These polling stations had a total of 13,533 polling booths, including 6,867 for men and 6,307 for women to facilitate 3,614,724 voters – 2,043,828 male and 1,570,896 female voters.\nFAFEN said following the May 29 elections of representatives on general seats, the ECP was now due to hold indirect elections for the seats reserved for women, peasants or workers, and religious minorities, and the elections for chairmen and vice chairmen of the local councils.\nMoreover, the ECP had yet to announce schedule for general seats elections in two major districts with sizeable urban population in the province i.e. Quetta and Lasbela, which were earlier withheld because of issues with the delimitation of wards, it added.\nFAFEN noted that after the expiry of LGs in Balochistan on January 27, 2019, it took over three years for the ECP to conduct LG elections, which faced delay on one pretext or the other by the provincial government. Lack of consensus among political parties over amendments to the Balochistan LG Act (BLGA), 2010 and delimitation of constituencies remained the primary hurdles before the conduct of election.\nThe report mentioned that though the ECP had taken extraordinary measures over the last few years to improve inclusivity of elections particularly by focusing on women, persons with disabilities and transgender people, women participation as candidates had remained a cause of serious concern.\n“As witnessed during Khyber Pakhtunkhwa (KP) LG elections, only 132 women (less than one percent) contested in various wards in urban and rural councils of Balochistan. No woman contested elections on any general seat in 10 districts – Killa Abdullah, Chaman, Nushki, Chagai, Zhob, Sherani, Killa Saifullah, Harnai, Ziarat and Surab. Such low contestation by women reinforces the need for political parties to reform their local structures and organization to encourage more women and other members of marginalized segments of population to emerge as leaders.”",
  "retrievedAt": "2025-08-11T15:01:12.592Z"
}
