{
  "title": "SC seeks record of high-profile cases pending with NAB, FIA",
  "link": "https://www.app.com.pk/national/sc-seeks-record-of-high-profile-cases-pending-with-nab-fia/",
  "date_published": "2022-06-03T16:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 03 (APP): The Supreme Court on Friday directed the Federal Investigation Agency (FIA) and the National Accountability Bureau (NAB) to submit record of all the high-profile cases along with evidence.\nA five-member larger bench of the apex court headed by Chief Justice of Pakistan (CJP) Umar Ata Bandial and comprising Justice Ijazul Ahsan, Justice Munib Akhtar, Justice Sayyed Mazahar Ali Akbar Naqvi and Justice Mohammad Ali Mazhar heard the suo moto notice case.\nThe CJP had taken the suo moto notice on the recommendations of an SC judge on perceived interference in the independence of prosecution branch in the performance of its duties for investigation and prosecution of pending criminal matters involving persons in authority in government.\nDuring the course of proceedings, the chief justice said the government should take adequate steps to bring the NAB amendments within the ambit of the law. The court did not want to interfere in the executive powers right now.\nHe asked Attorney General for Pakistan (AGP) Ashtar Ausaf about the process to remove names from the Exit Control List (ECL).\nThe AGP responded that freedom of movement and to travel abroad were constitutional rights of every citizen and a person’s name could not be put on the ECL simply because of ongoing investigations by NAB and the FIA.\nHe said the Federal Government analysed a person’s right to freedom of movement and the allegations levelled against him before putting his name on the ECL.\nHe said the cabinet members’ names were removed from the ECL so the government could function smoothly.\nUpon this, the CJP remarked that the court was aware the government had freed a person it had instructed to be jailed. The AGP replied that the reference against the said person was from 2018. The chief justice responded that the apex court’s order was from 2021.\nAttorney General Ashtar Ausaf said the court’s orders had been implemented but the person was freed after the case was concluded.\nChief Justice Bandial said if an agency was investigating someone, the government should hold discussions with it prior to removing the person’s name from the ECL.\nThe attorney general said names were put on the ECL on NAB’s instructions. The chief justice observed that it meant the NAB considered the matter prior to issuing instructions. NAB did not put every suspect’s name on the ECL, he said, adding according to NAB, the names of people who had looted billions, were removed.\nUpon this, the AGP said NAB could request inclusion of a person’s name to the ECL again.\nThe chief justice said NAB would refer again only if it knew of the removal. The name of a suspect, the SC had directed to put him on the ECL, was also removed, he added.\nJustice Mazahar Ali Akbar Naqvi said it would have been better for the government to look at each case individually.\nChief Justice Bandial said the court desired that justice be done with everyone through implementation of the law. He asked why the changes were applied retroactively. The AGP said the purpose was not to benefit specific people.\nJustice Munib Akhtar asked whether an amendment should be carried out if the relatives and friends of those who were doing it, benefitted from it. He asked why there was a hurry to remove the names from the ECL.\nChief Justice Bandial said Khawaja Saad Rafique’s name was on the ECL. The attorney general said Khawaja Saad Rafique was not present in the cabinet meeting that approved the amendments.\nUpon this, Justice Munib Akhtar said Khawaja Saad Rafique had approved the amended rules. He asked whether the ministers should not have kept themselves separate from the matter.  He also questioned how one could take a government decision for personal benefit. Whether there was a code of conduct for ministers regarding personal cases, he asked.\nThe AGP said as per the code of conduct, a personal case was not sent to the minister concerned.\nJustice Munib Akhtar asked why the code of conduct was not implemented.\nThe chief justice said the court was not hearing the case to punish anyone.\nJustice Munib Akhtar asked who had decided that the amendments would be applied retroactively. The AGP replied that the decision was made by a sub-committee.\nThe chief justice said honesty, fairness and transparency should be taken into consideration while exercising powers.\nFIA Director General Tahir Rai said eight persons, including PPP’s Sharjeel Memon, had travelled abroad and not returned afterwards.\nThe chief justice observed that dates were not written correctly in the FIA’s list for names on the ECL. The justice system needed to be improved and no innocent person should remain in jail, he added.\nThe chief justice directed the FIA DG  to inform the court if someone tried to forcibly get a case registered.\nThe bench also said the FIA could change officials other than the investigation officers and prosecutors.\nThe NAB prosecutor general said the court’s directives could be implemented only after appointment of new NAB chairman.\nThe chief justice said the court expected the government to appoint the new chairman after consideration. The court was observing the matter and expected good from the government, he added.\nThe CJP also directed NAB to ensure that it was not used for revenge.\nLater, the case was adjourned till June 14.",
  "retrievedAt": "2025-08-11T15:01:13.280Z"
}
