{
  "title": "Sino-African Cooperation on Green and Low-Carbon Development: New Initiatives and EVs discussed",
  "link": "https://www.app.com.pk/national/sino-african-cooperation-on-green-and-low-carbon-development-new-initiatives-and-evs-discussed/",
  "date_published": "2024-09-02T16:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP):As the China-Africa Cooperation Summit 2024 approached, the Belt and Road Initiative Green Coalition (BRIGC) Monday organized a pivotal session, “Sino-African Cooperation on Green and Low-Carbon Development: New Initiatives and EVs.”\nThe session was not merely a glimpse into future collaboration, but a beacon of hope for a new development model that places people’s needs at the forefront, eliminates poverty, and steers nations toward growth and development, all while upholding a steadfast commitment to environmental sustainability, a news release said.\nIt marked a significant stride towards fostering partnerships for sustainable development and realizing our collective aspirations.\nIt is widely anti-dialogue and gave us a glimpse of Chinese and African priorities, which they will discuss and finalize at the upcoming summit. A wide range of experts and speakers from Africa contributed to the session. They unanimously highlighted the importance of Chinese investment, especially in green sectors. They urged China to invest more in green infrastructure and industrial development.\nIt is pertinent to highlight here that Africa desperately needs investment and development assistance. It was pointed out by some studies Africa is looking to bridge the infrastructure investment gap, which is around US$ 100 billion annually.\nAfrica considers BRI to be an excellent opportunity to bridge this gap. Moreover, they rely on China as a trusted friend. It is not rhetoric; it is based on the data and facts. For example, from 2000 to 2022, Chinese institutions extended US$ 134.1 billion as loans and development assistance to African countries. It is important to mention here that the assistance was without any lectures or strings on democracy or development models. The development assistance helped Africa their agenda of development.\nThe BRI is expected to increase further investment, accelerating the continent’s development because it touches many points of the African Union’s Agenda 2063. The process has already started, and China is investing in transport, energy, agriculture, and many other areas through the Forum and BRI. A comprehensive list of projects can be assessed at the Forum website and the National Development and Reform Commission of China.\nIn conclusion, the participants were of the view that the China-Africa Cooperation Summit 2024 and  “Sino-African Cooperation on Green and Low-Carbon Development: New Initiatives and EVs” indicate that China is committed to the development of less developed countries and the welfare of common people without any distinction or strings of conditionalities, such as so-called democracy or human rights.  China is striving to create a fair, equal, and dignity-based global system where everyone has the right to a decent life, development, and independent choices according to their needs and circumstances.\nLastly, the participants expressed satisfaction with the direction and performance of the green development agenda under the BRI and China-Africa Cooperation.\nDr Zhang Jianyu, Executive Director, Green BRI Coalition elaborated on the objectives of the dialogue.\nHe also explained, what China is doing and how China promoting Green development through BRI.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:41:19.700Z"
}
