{
  "title": "Approval accorded to set up new National Cyber Crime Investigation Agency: NA told",
  "link": "https://www.app.com.pk/national/approval-accorded-to-set-up-new-national-cyber-crime-investigation-agency-na-told/",
  "date_published": "2024-09-02T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP): Minister for Information and Broadcasting Attaullah Tarar apprised the National Assembly that approval has been given to set up new National Cyber Crime Investigation Agency in the country as FIA lacked cyber-crimes investigation capacity.\nResponding to supplementary questions during the Question Hour, the minister said that hand-holding would continue till fully operationalization of new cyber crime investigation agency. It would also be examined which employees of FIA would be merged in the new cyber-crime investigation agency, he added.\nHe said that cyber crimes cases already with FIA would not be ended rather these would be transferred to the new agency.\nThe minister said that employees of abolished ministries would either be retained or be given golden handshake. After dissolution of Public Works Department (PWD), some of its employees would be retained while others would be given golden handshake, he added.\nTo a separate question, the minister said that the government has taken some new initiatives for skills development of youth in the country. National Vocational and Technical Training Commission (NAVTC) was being revamped, he added.\nAttaullah Tarar said local manpower would be trained as per market demand of other countries. The IT exports witnessed increased and was recorded as $ 3.1 billion, he added.\nTo another question, he said that proper survey was being carried out before construction of any road adding that it was need of the hour to construct 10th Avenue. After traffic count, it was decided whether the road would be constructed or not, he added.\nThe minister said that besides Margalla National Park, Lakeview Park and other green areas were developed in the federal capital.\nTo a question, the minister said that 44 vehicles and 532 police officers/officials were performing security duties with the dignitaries round the clock. Out of total, 34 vehicles were security duty with judges, four with ministers and six with bureaucrats. The total monthly expenditure incurred upon was around Rs 47,885,605.\nTo a separate question, he told that cleanliness and renovation of Parliament House and Parliament Lodges was the responsibility of Capital Development Authority (CDA). There was room for improvement in cleanliness and renovation of both Parliament House and Lodges, he added.\nHowever, he said that very meager amount of Rs 60 million was allocated for cleanliness and renovation of the Parliament House and Lodges in the budget.\nHe urged the Speaker to constitute special committee of the House in this regard.",
  "retrievedAt": "2025-08-10T20:40:48.518Z"
}
