{
  "title": "DC calls for peaceful resolution to IIUI protests",
  "link": "https://www.app.com.pk/national/dc-calls-for-peaceful-resolution-to-iiui-protests/",
  "date_published": "2024-09-02T15:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 02 (APP): Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon on Monday held a meeting with the Acting President of the International Islamic University Islamabad (IIUI) to discuss the ongoing student protests in the campus.\nThe meeting was attended by Deputy Inspector General (DIG) Mustafa Tanveer, Additional Deputy Commissioner General, and concerned Assistant Commissioners.\nAmid growing student unrest at the university, top officials convened to address the situation and explore possible resolutions. The primary focus of the discussion was the impact of the student protests on the university’s administration and the overall campus environment.\nConcerns were raised about the challenges, the university’s administration is facing due to the ongoing unrest, which has disrupted the normal functioning of the university.\nDuring the meeting, the officials were briefed on the university’s new hostel policy, which has been a point of contention among the protesting students. The university’s administration expressed its concern that some students were trying to escalate the situation, creating additional difficulties for other students and the university as a whole.\nDuring the meeting, the DC emphasized the need for a peaceful resolution, stating that efforts would be made to resolve the matter through mutual understanding.\nHowever, the meeting also highlighted the importance of identifying and addressing the elements that were disrupting the university’s teaching system. It was decided that legal action would be taken based on the requests made by the university administration to ensure a peaceful environment in the university.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:41:25.062Z"
}
