{
  "title": "Anti-polio drive continues in ICT: 23% target achieved on 1st day",
  "link": "https://www.app.com.pk/national/anti-polio-drive-continues-in-ict-23-target-achieved-on-1st-day/",
  "date_published": "2024-04-30T13:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Additional Deputy Commissioner East Usman Ashraf on Tuesday visited several polio vaccination points in the Federal Capital to monitor progress and motivate the teams.\nTalking to APP, Islamabad Capital Territory Administration Spokesman, Dr Abdullah Tabassum said that the city’s polio vaccination drive entered its second day with a successful start, reaching 23 percent of its target on day one. As health teams move across the district, local officials were working to ensure that every child was vaccinated.\nAdditional Deputy Commissioner East Usman Ashraf has encouraged the workers to spread the word about the importance of polio vaccinations and to ensure that no household was left behind.\nDuring his visits, Usman Ashraf emphasized the need to deliver the polio vaccine message to every household, ensuring that everyone understood the importance of vaccinating children against this potentially crippling disease.\nIn the Bani Gala area, five families initially refused to vaccinate their children. However, after discussions with the Assistant Commissioner, they agreed to participate in the campaign.\nThese conversations highlighted the ongoing challenge of combating vaccine hesitancy, but also the importance of local officials in convincing parents to prioritize their children’s health.\nThe polio campaign is set to continue across the district until May 5. To reach as many people as possible, vaccination teams have been deployed to schools, parks, and other public spaces.\nLocal authorities encourage parents to cooperate with the teams and to report any missed households to the administration, ensuring that all children have the opportunity to be vaccinated.\nOn the occasion, Deputy Commissioner East urged the residents to be vigilant and inform the administration if the polio teams did not reach their area. He also encouraged community leaders and educators to support the campaign and spread the word about the benefits of vaccination.\nAs the polio drive progresses, officials were calling on parents to ensure their children receive the vaccine. They emphasized that polio was a serious disease, and vaccination was the best way to protect against it.",
  "retrievedAt": "2025-08-11T02:12:38.604Z"
}
