{
  "title": "Experts demand moderation in tax system",
  "link": "https://www.app.com.pk/national/experts-demand-moderation-in-tax-system/",
  "date_published": "2024-04-30T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, April 30 (APP):The experts at the pre-budget stakeholder consultation on Tuesday demanded the government to ensure moderation in tax system and cumbersome regulatory steps for macroeconomic stability in Pakistan.\nThe Sustainable Development Policy Institute (SDPI) with the support of the Revenue Mobilisation, Investment and Trade (REMIT) programme funded by Foreign, Commonwealth and Development office organised the stakeholder pre-budget consultation titled “Optimizing Revenue and Public Spending for Inclusive Growth Pre-Budget Consultative workshop” at a local hotel in Lahore.\nIn her welcome remarks, Nagham-e-Tehniat Jerral, Governance Adviser and Tax Lead – REMIT said that UK is a close partner of Pakistan in its development journey with key ambition to make the latter achieve its economic potential.\nPakistan has the beneficial youth population, ideal location at the heart of fastest growing markets, six million diaspora and women potential to play a substantial growth in the economic growth, she added.\nShe mentioned that World Bank in its report indicated that Pakistan economy could go beyond $5 trillion by 2057 with correct interventions and reforms in its economic system.\nMs. Jerral said in global race for trade and investment, Pakistan is lagging behind since past three decades, whereas revenue mobilization is also one of the challenges faced by the country amid small tax revenue being collected which was half of the total potential.\nShe claimed that tax collection was insufficient as compared to the population of Pakistan.\nHamed Yaqoob Sheikh, Team Lead – REMIT briefed the participants on REMIT which was an FCDO-funded programme based on reforms in the economy of Pakistan with the objective to bring macroeconomic stability.\nThe main areas of focus of the programme included revenue, investment, improving and enhancing trade of Pakistan, he added.  “The purpose of the dialogue is to come up with recommendations and solutions to provide guideline to the government for corrective measures. REMIT has the edge that it can lead the policy recommendations to the highest level forum,” he said.\nDr. Wasif Ali Memon, Chairman, Sindh Revenue Board said that political will was very important to implement reforms and taxation measures then no change can happen in the system,\nHe added that the country needed to do retrospection of its conduct during the process of seeking International Monetary Fund (IMF)’s prorgram as it had availed some 25th so far.\n“With a tax-to-GDP ratio below double figures, the burden of taxes falls heavily on the salaried class, leading to tax evasion. It’s time to reform the tax system for a fairer distribution of the burden.”\n“Increase in utility charges, gas, electricity and petroleum charges will keep the country in the vicious circle and leaving the industry crying in crises. We have strange ties at western and eastern borders that make the country unable to become a vendor industry for China along with continuously changing revenue loss and tariff,” he added.\nHe recommended that the country should be consistent in its approach and demand IMF to indigenise its policies with the macroeconomics of Pakistan.\nAnwar Kashif Mumtaz, President, Pakistan Tax Bar Association highlighted that masses have lack of trust on the revenue departments that was hinderance to promote tax paying culture. However, it was necessary to have paradigm shift in the mindset of tax payers and non-filers.\n“The government has to take harsh decisions as there is no traders’ friendly government concept in the world,”\nhe stated. During the first panel discussion on “Broadening Revenue Stream, Trade Competitiveness”, Kaiser Bengali, Director, Engro Powergen Qadirpur Ltd. said the country lacked a cogent and well-defined privatization policy or discourse at the cabinet level for state-owned enterprises (SOEs).\nHe underlined that there has never been any strategic factor considered during privatization of PTCL or banking entities as there was no such policy on the issue that led to the loss of precious state assets of strategic nature.\nHe emphasized that it was important to privatise management not the assets as the latter were of strategic value.\nNaheed Memon, Member Board of the Privatization Commission of Pakistan said the country needed cogent privatisation policy for medium to long term goals along with abandoning of successive regulation choking the businesses in the country.\n“The biggest hurdle in mobilizing investment in Pakistan is the cumbersome regulatory environment.\nPrioritizing mobilizing domestic investments is crucial, and foreign direct investments (FDIs) should not be the only focus,” she added.\nAsif Haroon Partner A F Ferguson and Co. said the country was stagnant in terms of exports and dollar-rupees parity.\nHowever, there is no consistency in taxation policy, implementation and environment as the taxation regime changes with the change of governments whereas too much cumbersome regulatory environment due to laborious paper work further aggravates the situation.\n“Gaps in taxes paid by different groups of the society and lack of trust among masses for paying taxes is a serious hinderance to the issue that needs to be resolved,” he said.\nSaif Junejo, Chairman Exports Processing Zones Authority said that Pakistan’s six export processing zones are falling short of their potential as Karachi Export Processing Zone (EPZ), planned for 3,000 acres, is only developed on 300 acres, in phases.\nHowever, as compared to Jebel Ali Free Zone’s US$104 billion, Karachi export processing zone generated only US$600-700 million, about 75% of national export processing zone revenue.\nRafiq Mustafa, Secretary, Social Protection Department said the biggest constraint on the effectiveness of public expenditure is the quality of governance and provincial and national institutions that are part of the governing processes such as public financial management system, procurement and human resource hiring system, and monitoring and evaluation (M&E) system.\nDuring the second panel discussion, Income Tax, Sales Tax, and FED: Optimizing Taxes for Growth, former chairman Federal Board Revenue (FBR), Shabbar Zaidi said to create a conducive environment for the investors it was necessary to bring changes to the prevailing taxation models for efficient services and swift processing mechanism.\n“It is pertinent to streamline and simplify processes for resolving the balance of payment crisis and other prevailing trade challenges. Pakistan must adopt learnings from regional states like Iran’s Chabahar Free Trade–Industrial Zone which is much larger than Karachi’s EPZ and Bangladesh has several EPZs to facilitate trade,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:12:36.906Z"
}
