{
  "title": "Romina announces Climate Awards for journalists, unveils vision to enhance climate resilience through cooperation",
  "link": "https://www.app.com.pk/national/romina-announces-climate-awards-for-journalists-unveils-vision-to-enhance-climate-resilience-through-cooperation/",
  "date_published": "2024-04-30T16:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP): Prime Minister’s Coordinator on Climate Change, Romina Khurshid Alam on Tuesday announced to organise countrywide Climate Journalism awards for environmental reporters under the patronage of the Prime Minister and unveiled her multi-disciplinary vision to enhance resilience against environmental degradation and global warming impacts through cooperation among stakeholders to preserve the dwindling natural reserves and ecosystems vital for human survival.\nIn a formal interaction with the climate beat reporter, the PM’s aide announced that the journalists covering the beat environment and climate change would be called as climate force of the Ministry as they are the force behind every policy endeavour benefitting the society through its effective communication and are the champions of climate action.\nRomina said, “Environment is very close to everyone’s heart and media’s role is very crucial in educating the masses through informed reporting on whooping impacts of environmental degradation triggered through irresponsible anthropogenic activities.”\nThe Ministry, she said under the patronage of the Prime Minister will confer awards in the categories of print, electronic and social media to the climate reporters, whereas the minister expressed her intention to hold these awards after every six months or on yearly basis.\nShe said it was her third time at the Ministry of Climate Change and Environmental Coordination and was thankful to Prime Minister Shehbaz Sharif for entrusting her with this responsibility. On the occasion, the PM’s Coordinator paid an emotional homage to her mentor former Minister for Climate Change, Late Senator Mushahid Ullah Khan who supported her throughout her career to seek active role in policy making. The prime minister’s speech at World Economic Forum (WEF) also focussed on peace and climate change, she added.\nThe Ministry would initiate its drive through single-use plastics’ ban enforcement, whereas all officials working on various projects within the Ministry would be engaged to launch inclusive and holistic action, she added.\nThe PM’s Coordinator informed that she has adopted walk-in policy at the office of the Minister to open the doors for all from businessmen to layman for recommendations, suggestions and joint ventures to augment environment conservation interventions.\n“There is overwhelming response to my office after this policy. However, the Ministry has increased its social media footprint and has its accounts on X (erst-Twitter), Instagram, Tiktok and Radio for effective public outreach and communication,” she said.\nThe Ministry was also taking Pakistan Electronic Media Regulatory Authority (PEMRA) to be taken on board for ensuring airtime under its corporate social responsibility, she added.\n“We will take all provinces together as after devolution many subjects have been devolved but we have to promote inclusive dialogue as Pakistan is facing warlike situation due to climate change,” she noted.\nThe National Adaptation Plan has all our commitments and priorities to protect vulnerable communities in the country through sustainable solutions, whereas the Ministry would extensively work on Indus basin restoration, recovery and restoration of ecosystems, she said.\nThe Recharge Pakistan project focussing climate resilience through ecosystem adaptation through integrated flood management, glacial lake outburst flood (GLOF) project in Gilgit Baltistan and Khyber Pakhtunkhwa implemented to empower communities, Electric Vehicle Policy, and up-scaled Green Pakistan Programme are the mainstay initiatives to enhance climate resilience, Romina said.\n“Public awareness is must and masses should be told about violators of climate laws. However, schools are more engaged on climate literacy and education started both in public and private schools. We have a core team that works like a brain to me that will provide research for well informed decision making. We have engaged real estate, public and private sectors in the PM’s climate committee formed that includes think-tanks and the former expert bureaucrats,” she said.\nThe Coordinator underlined that climate tourism would be promoted, whereas recently World Earth Day marathon at Margalla Hills National Park gave a clear message to the masses to adhere to no plastics and anti-littering slogans.\nThe Ministry was also engaging entertainment industry to initiate activities to highlight environment conservation, whereas climate economy and fashion through recycling, whereas historically the women in South Asia region have been leaders to promote conservation through their sustainable practices. Like in Punjab, Sindh and Balochistan women produce traditional dresses by reusing sustainable items and taking inspiration from it, recycling fashion industry would be promoted and all red tape bottlenecks would be removed, she said.\nOn the occasion, Member Climate Change Planning Commission, Nadia Rehman said the new climate strategy of the Ministy was holistic and included media and advocacy that was important. However, climate change has gained a lot of momentum at the government level as environment involves everything from mobility to living, food to shelter and clothes to entertainment it included all.\nDirector General Environmental Protection Agency, Farzana Altaf Shah urged the print and electronic media journalists to highlight and promote plastic free slogan to end the menace of plastic pollution.",
  "retrievedAt": "2025-08-11T02:12:13.210Z"
}
