{
  "title": "Workshop on Islamic Journals held at AIOU",
  "link": "https://www.app.com.pk/national/workshop-on-islamic-journals-held-at-aiou/",
  "date_published": "2024-04-30T12:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 30 (APP):A training workshop on “Islamic Journals: Integrity and Editing Standards”  was organized by the Islamic Research Index, Department of Islamic Thought, History and Culture, Faculty of Arabic and Islamic Studies, Allama Iqbal Open University the other day.\nPurpose of the training was to train editors and improve the quality of journals. Chairman, National Rahmatul-lil-Alameen Wa Khatam an-Nabiyyin Authority, Khurshid Ahmad Nadeem was the chief guest of the inaugural session while Dean, Faculty of Arabic and Islamic Studies, Prof. Dr. Mohyuddin Hashmi presided over the event.\nOther speakers included Dr. Hafiz Muhammad Sajjad, Dr. Shah Moinuddin Hashmi and Dr. Muhammad Riaz.\nAddressing the ceremony, Khurshid Nadeem emphasized the importance of research for any institution.\nHe stated that the quality of an institution could be determined by its research work, making it necessary to pay special attention to quality of the research conducted.\nAdditionally, he highlighted the significance of proofreading in research and stated that even prominent researchers take small tasks like proofreading very seriously and give it their utmost attention.\nProf. Dr. Mohyuddin Hashmi said that faculty would be publishing six research journals this year, with three already being published and the other three almost ready for publication.\nDuring his speech, he emphasized the importance of incorporating creativity in research, as research without a creative process is meaningless.\nDr. Hashmi also discussed the three criteria of research and provided a detailed explanation of ethical standards, stating that they were an essential part of religion and were particularly crucial in today’s world.\nAdditionally, he announced a three-day international conference organized by the faculty of Arabic and Islamic Studies, which will be held from May 22 to 24. The conference will focus on the topic of Ijtihad Bil-Maqasid.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:13:01.280Z"
}
