{
  "title": "War, then water: Pakistan’s border villagers face back-to-back evacuations - Pakistan - DAWN.COM",
  "author": null,
  "content": "When floodwaters from across the Indian border surged into her village in Pakistan’s Punjab this month, Shama knew what to do: gather her four children and prepare to leave.\n\nIt was the second time this year she has had to flee, after abandoning her home during cross-border fighting between India and Pakistan in May.\n\n“How many times do we need to evacuate now?” the 30-year-old mother said, her husband away ferrying their 10 cows to higher ground on a boat. “We lost out on so much during the war like school days for the children, and now the water is forcing us out again. Trouble is trouble.”\n\nShama’s ordeal is echoed across flood-hit Kasur, where families say they are exhausted by repeated displacements within months, first from the fighting, now from nature.\n\n“The floods started earlier this month and only got worse,” said 27-year-old mother Bibi Zubaida, who lives with seven relatives in a three-bedroom house opposite a mosque that now broadcasts evacuation calls.\n\nFrom the mosque loudspeakers, usually reserved for the call to prayer, came a different message: boats were ready for anyone who wanted to leave.\n\n“When you live here, you choose to live with the threat of war and the threat of floods. Where does one go?” Zubaida said.\n\nKasur lies just a few kilometres from the Indian border. From their rooftops and rescue boats, residents said they could see Indian checkposts across the horizon, a reminder of how closely their fate is tied to decisions made on the other side.\n\nThe nations share rivers that were regulated for more than six decades under the Indus Waters Treaty. That agreement was suspended by India earlier this year, following the shooting of 26 people by militants that New Delhi said were backed by Islamabad, which Pakistan denies.\n\nThat attack triggered brief but intense cross-border battles between the nuclear-armed neighbours, driving villagers like Shama from their homes.\n\nThen came the monsoon, and the rivers turned to flood.\n\nOn narrow wooden boats, families balanced motorcycles, belongings, and bleating goats alongside their children, as rescue workers steered them through fields now turned into rivers.\n\nRescue worker Muhammad Arsalan said many villagers hesitated to evacuate. “People don’t always want to leave because they’re scared of thieves stealing what they’re leaving behind. They’re reluctant because they’ve done it so many times already,” said Arsalan, who has ferried more than 1,500 people to safety by boat in recent days.\n\n“They love their goats and sheep, and sometimes refuse to leave without them,” he added, pausing to clear leaves stuck in the motor before restarting another run.\n\nThe Punjab provincial disaster management authority said flows in the Sutlej River at Ganda Singh Wala were the highest in decades, after a breach at an Indian barrage. At least 28 deaths have been reported so far, with water pushing further south through Punjab and threatening new areas.\n\nIn India, cloud bursts in Ramban and Mahore regions of Indian-occupied Jammu and Kashmir killed 10 people. Pakistani officials said the crisis was worsened by India’s decision to suspend the Indus Waters Treaty, halting the decades-old exchange of river data.\n\nIslamabad also accused India of releasing large volumes of water without adequate warning.\n\n“If the treaty was in operation, we could have managed the impact better,” Pakistan’s Planning Minister Ahsan Iqbal told Reuters on Friday.\n\nIndia has denied deliberately flooding Pakistan. It has blamed incessant monsoon rains and said it issued multiple flood alerts. Two gates of the Madhopur barrage on the Ravi River were damaged by surging water, Indian officials said.\n\nFarmers say the deluge has wrecked their livelihoods. “Thirteen of my 15 acres are gone,” said Muhammad Amjad, a rice and vegetable grower. “Women and children are mainly evacuated. Men stay behind to guard whats left.”\n\nThe back-to-back displacements have underscored the vulnerability of communities straddling Pakistan’s volatile eastern border.\n\nOfficials warn the crisis could worsen as climate change intensifies monsoons and cross-border river disputes strain disaster planning.\n\n“I’ve seen many floods, but they are coming too often now,” said Nawabuddin, a 74-year-old landowner, recalling the most memorable floods he witnessed in his lifetime — 1988, 2023 and now this one.\n\n“We don’t want war, we don’t want excess water. We just want to live,” said Zubaida, whose newly renovated home and farmland now lie underwater.\n\nHeader Image: Residents travel with their belongings on a boat as they head towards higher ground, following the monsoon rains and rising water level of the Sutlej River, in Chanda Singh Wala village near the Pakistan-India border in Punjab’s Kasur district, on August 29. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/30112444a6b3c4a.webp",
  "retrievedAt": "2025-09-06T09:55:28.272Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938389/war-then-water-pakistans-border-villagers-face-back-to-back-evacuations",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T08:48:57.000Z"
}
