{
  "title": "Protective dykes blown up to save Punjab cities as raging waters head southwards - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Chenab, Ravi, Sutlej overflow simultaneously for the first time\n• Over 429,000 residents evacuated, 20 lives lost across three rivers\n• Ninth spell of monsoon rains begins\n• 855,000 cusecs expected at Head Trimmu within 24 hours\n• Bunds breached to protect Jhang city, explosives deployed on embankments to save Multan\n• Worst Sutlej flooding since 1955 compounded by Indian dam breach\n\nLAHORE: In an unprecedented flood crisis, the Punjab government has initiated controlled breaches of key flood bunds to divert surging waters from the Chenab, Ravi and Sutlej rivers, as all three major rivers overflowed simultaneously for the first time in the country’s history.\n\nWith 855,000 cusecs expected to reach Head Trimmu within 24 hours, authorities have evacuated over 429,000 residents, deploying explosives and breaching embankments to protect urban centres from catastrophic flooding.\n\nTorrential monsoon rains ravaged both Pakistan and India this week, with further heavy downpours forecast for this weekend.\n\nBunds near Athara Hazari in Jhang district were breached to relieve pressure on Head Trimmu, situated downstream of the confluence of the Jhelum and Chenab rivers.\n\nTo prevent inundation of Jhang city, the Rivaz Bridge flood bund was breached, and residents from adjacent villages were evacuated. Explosives were deployed near Rungpur and Sher Shah bunds to divert water away from Head Muhammad Wala, where a surge of up to 800,000 cusecs is anticipated.\n\n“There was no other way to drain the water,” Relief Commissioner Nabil Javed said, defending the drastic measures. “We are deploying all available resources and machinery to protect lives and infrastructure.”\n\nExplosives were also deployed, with dynamite installed near the Rungpur and Sher Shah bunds to strategically divert water from Head Muhammad Wala.\n\nData released by Punjab’s Provincial Disaster Management Authority (PDMA) on Friday revealed that flows were predominantly steady with a notable improvement at Rivaz Bridge on the Chenab River, where the water level is now holding steady at 521.9 feet against the critical gauge of 526 feet.\n\nHowever, the National Disaster Management Authority (NDMA) issued a flood warning for the Chenab River at Head Marala. As a precautionary measure, the NDMA sent out alerts via SMS to mobile phone users. The authority warned of a high flood risk at Marala, Khanki and Qadirabad headworks, urging residents in these areas to remain prepared for any emergency situation.\n\nWater flow\n\nOn Friday, Marala and Khanki headworks were steady at 109,540 and 174,472 cusecs, respectively, while Qadirabad Headworks was at 175,272 cusecs and falling.\n\nChiniot Bridge remained at a very high but steady 855,000 cusecs, and Trimmu Headworks was steady at 128,215 cusecs.\n\nConditions on the Ravi River were mixed; Head Jassar was steady at 82,140 cusecs, and Ravi Syphon was falling at 160,515 cusecs. Shahdara was steady at 159,847 cusecs; however, Balloki Headworks continued to rise, reaching 180,520 cusecs. Sidhnai Headworks remained steady at 29,278 cusecs.\n\nThe Sutlej River was showing incre­a­sed activity at its upstream point, with Ganda Singh Wala rising at 385,569 cus­ecs. Downstream, Sule­­manki Headworks was steady at 138,058 cusecs, and Islam Headworks was steady at 60,814 cusecs.\n\n20 lives lost, millions affected\n\nAccording to PDMA data, over 1.46 million people in 1,769 mouzas have been affected due to extremely high floods in the Sutlej, Ravi and Chenab rivers, with a total of 20 lives lost.\n\nThe government has evacuated over 429,177 people, of whom 3,565 were living in 365 relief camps, and 300,174 cattle were transported to safety.\n\nPDMA Director General Irfan Ali Kathia said the Sutlej River is facing the worst flooding since 1955. He said that the catastrophic inflow of water is a result of a dam breach in India, and it is increasing the threat to Kasur.\n\nIn 1955, more than 2,000 people lost their lives and crops were devastated in East Pakistan (now Bangladesh) due to heavy floods caused by monsoon rains. Those floods also impacted 15 million people in Sindh and parts of India.\n\n“We have been compelled to deliberately breach the embankment to save Ka­­s­ur city from devastation due to unprecedented water flow,” Mr Kathia said.\n\nHe said the crisis is widespread and evolving rapidly. “The Sutlej is not the only concern; the Chenab and Ravi rivers are also overflowing, marking the first time in Pakistan’s history that three major rivers have flooded simultaneously,” he added.\n\nThe PDMA chief termed it a “historic flood situation”, particularly noting the severe impact at Qadirabad Headworks.\n\nCommunities living downstream were bracing for impact, and water is expected to reach Sidhnai Headworks within 36 hours, while Okara, Sahiwal and Pakpattan remain on high alert.\n\nAround 40 to 45 villages were already inundated in Mandi Bahauddin before the water receded back into the river. He said that 28 people lost their lives so far, though timely rescue operations have mitigated further casualties.\n\nHe said that evacuations in vulnerable areas continued, including those near Trimmu, where water levels are rising steadily. “The area downstream of Trimmu may not withstand this pressure,” Mr Kathia warned, though he expressed hope that damage could be minimised.\n\nA statement from the PDMA has said the ninth spell of monsoon rains began, as heavy rains were forecasted till Sept 2.\n\nThe rains were predicted in Rawalpindi, Murree, Galiyat, Attock, Chakwal, Jhelum, Gujranwala, Lahore, Gujrat, Sialkot, Narowal, Hafizabad, Mandi Bahauddin, Okara, Sahiwal, Kasur, Jhang, Sargodha, Mianwali, Dera Ghazi Khan, Multan and Rajanpur, the PDMA spokesperson said.\n\nArrangements in Multan\n\nEarlier, National Highway Autho­rity (NHA) Chairman Shahryar Sultan and Multan Commissioner Amir Kareem Khan visited the Head Muhammad Wala breaching section and Bund Bosan to review the flood management arrangements.\n\nMr Khan briefed about the current flood situation and the measures being taken to mitigate potential risks.\n\nHe said that a flood surge of up to 800,000 cusecs is expected in the Chenab River within the next two days. “The Head Muhammad Wala Road will be breached if Multan city faces any threat. The final decision will be made by the technical committee of the Irrigation Department.”\n\nHe said that over 119,715 people have so far been safely relocated across the division and a total of 84 relief camps have been set up. He said that uninterrupted provision of meals and medical care is being ensured in all relief camps, while arrangements have also been made for the supply of fodder and water for livestock. The assessment of losses will be carried out once the water recedes, and full compensation will be provided to the affected families, he added.\n\nMultan Deputy Commissioner Waseem Hamid Sindhu said the administration has set a target of relocating 300,000 residents to safer locations and assured that all riverine areas will be evacuated by Saturday night.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/300807153c5fdff.webp",
  "retrievedAt": "2025-10-12T03:56:19.050Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938274/protective-dykes-blown-up-to-save-punjab-cities-as-raging-waters-head-southwards",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:05.000Z"
}
