{
  "title": "Prime minister of Yemen’s Houthi government killed in Israeli strike: media report - World - DAWN.COM",
  "author": null,
  "content": "The prime minister of Yemen’s Houthi government and several other ministers were killed in an Israeli strike on the capital Sanaa, the news agency run by the group said on Saturday, citing a statement by the head of the Houthi Supreme Political Council, Mahdi al-Mashat.\n\nA number of others were wounded in the strike, carried out on Thursday, it said without providing details.\n\nIsrael said on Friday that the airstrike had targeted the Iran-aligned group’s chief of staff, defence minister and other senior officials and that it was verifying the outcome.\n\nThe Houthi-run news agency ran a statement from the defence minister shortly after it confirmed the prime minister’s death and quoted him as saying the group was ready to confront Israel.\n\nThe statement did not mention Thursday’s airstrike and it was unclear if it was made before or after the attack.\n\nAhmad Ghaleb al-Rahwi became prime minister nearly a year ago, but the de facto leader of the government was his deputy, Mohamed Moftah, who was assigned on Saturday to carry out the prime minister’s duties.\n\nRahwi was seen largely as a figurehead who was not part of the inner circle of the Houthi leadership.\n\nThe Israeli military said its fighter jets had struck a compound in the Sanaa area where senior Houthi figures had gathered, describing the attack as a “complex operation” made possible by intelligence-gathering and air superiority.\n\nOn Thursday, Israeli security sources said the targets had been various locations where a large number of senior Houthi officials had gathered to watch a televised speech recorded by leader Abdul Malik al-Houthi.\n\nThe Iran-aligned Houthis have attacked vessels in the Red Sea in what they describe as acts of solidarity with the Palestinians in Gaza. They have also fired missiles towards Israel, most of which have been intercepted. Israel has responded with strikes on Houthi-controlled areas of Yemen, including the vital Hodeidah port.\n\n“We remain steadfast in our genuine position of supporting and standing with the people of Gaza, and in building and developing the capabilities of our armed forces to confront all challenges and dangers,” Mahdi al-Mashat’s statement said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/302105073b9c955.webp",
  "retrievedAt": "2025-09-06T09:55:24.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938470/prime-minister-of-yemens-houthi-government-killed-in-israeli-strike-media-report",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T16:10:57.000Z"
}
