{
  "title": "Ganda Singh faces ‘historic’ peak - Pakistan - DAWN.COM",
  "author": null,
  "content": "KASUR: The waterflow at the Ganda Singh Headworks crossed the “exceptionally very high” flood level on Friday after crossing 385,000 cusecs mark, described as the highest in three decades.\n\nPunjab PDMA Director General Irfan Ali Kathia said that Rahimyar embankment would be breached to save Kasur city.\n\nThe district administration vacated the Talwar Post at Ganda Singh and Kothi Fateh Muhammad at Kanganpur where it had established its camps. Cracks started developing at the Talwar Post, forcing rescuers and the administration to move their camps away from the spot.\n\nOn Friday evening, floodwater also submerged the Joint Check Post (JCP) where flag hoisting ceremony was held everyday. According to locals, it was the first time after 1988 when the water reached the JCP. The administration, with the help of local police, started making announcements through the loud speakers of mosques to vacate 17 vulnerable villages.\n\nEmbankment to be breached to save Kasur city; PDMA\n\nAccording to DPO’s spokesperson Sajad Ali, the deployment of police had been increased to 710 from 600 on Friday in view of the situation. He said that DPO Essa Khan was monitoring the evacuation operation.\n\nIn Mandi Usmanwala area of Chunian tehsil, nine villages had been cut off from main roads by the floodwater of Sutlej. The villages include Rajowal, Najabat, Sadar, Rangaywala, Bodh Singh, Bairi Peer, Vehari, Jalokay Dona, and Jhanga Singh. Army and police were evacuating the area as water level continue to rise.\n\nTehsil administration and Rangers also shifted their camps from Kothi Fateh Muhammad to an elevated area near village Chhaber. Army, local police and tehsil administration were preparing to start an evacuation operation on Saturday (today) from a dozen villages.\n\nMeanwhile, the River Ravi was also swelling and approaching “high level flood”, threatening dozens of villages in Phoolnagar, Pattoki and Halla areas. Villages including Bhaiphero, Rakh Jok, Nathi Kgalas, Lambay Jageer, Kot Sardar, Hinjray Kalan, Baharwal Kalan, and Nau Shahrakay had been declared vulnerable. Administration issued warnings, made announcements and an evacuation operation would be started in the next 24 hours.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:55:37.624Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938250/ganda-singh-faces-historic-peak",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:49.000Z"
}
