{
  "title": "CM Bugti inaugurates advanced facilities at Quetta Civil Hospital - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Sarfraz Bugti inaugurated a series of cutting-edge medical facilities at Civil Sandeman Hospital on Thursday, a step he said was his government’s commitment to health sector reforms and ensuring accessible, high-quality healthcare for the public.\n\nThe newly launched services include a 1.5 Tesla MRI machine, a Cath Lab and a fully digitised pharmacy system, aimed at enhancing medical services within the province’s public healthcare sector.\n\nThe inauguration ceremony was attended by Health Minister Bakht Muhammad Kakar, Adviser Naseemur Rehman Malkhail and several members of the provincial assembly.\n\nDuring his visit, CM Bugti inspected the new equipment and praised the dedication of medical professionals, particularly Dr Waseh, who gave up a lucrative position in England, earning Rs3.2m a month, to serve in Balochistan for a modest salary of Rs150,000.\n\nHe disclosed that Rs1 billion had been allocated in the budget for the reconstruction of the Civil Hospital. He emphasised that the MRI machine should operate 24/7 and that the Cath Lab was fully functional.\n\nAddressing concerns about corruption, CM Bugti highlighted the implementation of the digital pharmacy system as a crucial step in ensuring accountability.\n\nCM Bugti reiterated that the government remained open to constructive suggestions and dialogue but stressed that public interest would always be non-negotiable. He issued a firm warning against political involvement by government employees, stating that violations under the BEDA Act would be met with strict action.\n\n“The government will not bow to pressure or blackmail,” he declared.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:56:17.456Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938325/cm-bugti-inaugurates-advanced-facilities-at-quetta-civil-hospital",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:18.000Z"
}
