{
  "title": "SHC asks why K-Electric hasn’t adopted prepaid billing system - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Uninterrupted electricity be provided to those paying their bills on time, bench observes\n• Asks JI counsel to satisfy court about maintainability of petition against loadshedding\n\nKARACHI: The Sindh High Court on Friday questioned why K-Electric had not introduced a prepaid billing system for its consumers to reduce line losses and power theft.\n\nA two-judge bench headed by Justice Muhammad Iqbal Kalhoro asked this while hearing a petition filed by the Jamaat-i-Islami against K-Electric and others seeking an end to the loadshedding.\n\nAt the outset of the hearing on Friday, the counsel for the power utility argued that as per an order of the apex court, National Electric Power Regulatory Authority should be approached over technical issues of loadshedding.\n\nThe bench directed the counsel for the petitioners to come prepared at the next hearing to advance arguments about maintainability of the petition. It also noted that there could be various reasons behind loadshedding, including line losses, but uninterrupted electricity be provided to those consumers who were paying their bills on time and not involved power theft.\n\nThe bench further remarked why the KE had not enforced a prepaid card system for its customers and it would take around five years to complete if the work on such a policy started now.\n\nThe counsel for the KE claimed that around 70 per cent city’s feeders were exempted from loadshedding and efforts were made to curtail power theft after the privatisation of the power utility.\n\nThe lawyers for the power utility also said that the suggestion of court regarding the prepaid card policy to be conveyed to the officials concerned.\n\nJI Karachi chief Monem Zafar and two other leaders had petitioned the SHC and impleaded the power ministry, the KE and Nepra as respondents.\n\nThe petitioners contended that the KE, responsible for electricity generation, transmission and distribution in Karachi, had been observing loadshedding for an average duration of 10 to 16 hours daily in various localities of the city even during heatwaves and attributing the measure to power theft-related losses.\n\nThe petitioners also asserted that out of the 2,109 feeders in Karachi, 1,500 faced no loadshedding while the others were subjected to outages according to their loss rates.\n\nThe petitioners claimed that high-loss areas in Karachi faced up to 7.5 hours of loadshedding when energy demand peaked whereas low-loss areas faced no outages.\n\nThe also maintained that the KE had increased the duration of loadshedding in phases with the city now facing two to four hours of outages at night while 40pc of the city was experiencing the worst power outages.\n\nThe petitioners asked the court to order the KE to immediately halt the practice of loadshedding and adhere to the Nepra’s Performance Standards Rules and the Nepra’s Fine Regulations.\n\nThe petitioners also sought a directive for the KE to develop and implement a comprehensive plan to eliminate loadshedding besides taking measures to curb power theft and improve infrastructure as soon as possible.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:55:39.067Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938286/shc-asks-why-k-electric-hasnt-adopted-prepaid-billing-system",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:42.000Z"
}
