{
  "title": "Killing of taxi driver by police sparks violent clashes in Indonesia - World - DAWN.COM",
  "author": null,
  "content": "JAKARTA: Hundreds of Indonesians protested at sites across Jakarta on Friday over the death of a civilian hit by a police vehicle, triggering calls for police reform in the first major test for President Prabowo Subi­anto’s nearly year-old government.\n\nThe civilian, a motorcycle ride-sharing driver, was hit at the site of violent clashes on Thursday near parliament as police sought to disperse demonstrators protesting over lawmakers’ pay and education funding.\n\nThe protests on Friday afternoon prompted a number of schools in the capital to allow students to leave early and banks and businesses to ask employees to work from home. The military was deployed in some areas.\n\nDrivers, students in colourful jackets and Indo­nesians from other walks of life descended on the country’s parliament and police headquarters in Jakarta to stage protests, throwing rocks at the gates and chanting “Kill­­er! Killer!”\n\nWearing their signature green jackets, drivers also staged protests in other cities, including Bandung and Surabaya on Java island and Gorontalo on Sulawesi.\n\nAfter darkness fell, he­­avy rain dispersed some students and drivers from the police headquarters, tho­­­ugh a few remained kee­ping alight a fire built from tyres and bamboo while singing patriotic son­gs.\n\nPolice fired tear gas at protesters trying to enter the headquarters.\n\nProtesters torched a building belonging to the lower house of Indonesia’s parliamently legislative wing in Bandung, a city about 150 kilometres sou­theast of the capital. A pol­­ice post was set on fire in Makassar city, on Sula­wesi.\n\nMotorcycle driver Pen­di Nasir, 43, who was amo­ng the protesters in Jak­a­rta, called for a transparent investigation from by pol­­ice over the death of the driver, Affan Kur­n­i­awan.\n\n“We don’t want our colleagues here to become victims of this riot again,” he said, calling for action against those at fault.\n\nStand-up comedian Aci Resti attended a protest at the parliament against a generous housing allowance for lawmakers.\n\n“I’m here to voice the opinions of my friends, who are fed up with everything, with the members of the House of Rep­r­e­s­e­ntatives, with everything, with the government,” she said.\n\nProtesters were undeterred by earlier remarks by Prabowo calling for calm, expressing condole­n­ces for Affan Kurn­i­a­wan’s death and ordering a thorough probe of the incident.\n\n“I am shocked and disappointed by the excessive actions of the officers,” Pr­­a­­­bowo, whose pre­sidency nears its one-year anniversary in October, said in a video message. “I have ordered a thorough and transparent investigation … and officers inv­o­lved must be held accountable.”\n\nThe unrest has rattled investor confidence in So­­utheast Asia’s largest eco­nomy. The rupiah closed 0.9 per cent weaker aga­inst the dollar at 16,495, while the stock index fell as much as 2.3pc to hit its lowest point since Aug 12, before finishing down 1.5pc.\n\n“If Prabowo isn’t careful … protests may devolve into chaos,” Made Sup­riatma, a visiting fellow at the ISEAS-Yusof Ishak Institute in Singapore, said.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b23bd6d2ece.gif",
  "retrievedAt": "2025-09-06T09:55:40.721Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938315/killing-of-taxi-driver-by-police-sparks-violent-clashes-in-indonesia",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:35.000Z"
}
