{
  "title": "NA body concerned over non-payment of dues to private media organisations - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The members of the National Assembly Standing Committee on Information and Broadcasting on Friday expressed their concerns over the blackout of the opposition by the state-run media and non-payment of the advertisement dues to the newspapers and television channels.\n\nThe committee headed by Pullain Baloch also took notice of the non-payment of salaries to the Pakistan Television Corporation (PTV) employees, besides receiving a briefing by Managing Director of the state-run Associated Press of Pakistan (APP) Asim Khichi on the functioning of the organisation.\n\nPrincipal Information Officer (PIO) Mobashir Hassan informed the committee that the ministry had so far paid Rs6.5 billion to the newspapers and TV channels, adding that another Rs1.5bn would be paid to the TV channels by the end of September.\n\nThe committee also took up the issue of the missing Quaid-i-Azam’s image in the official advertisements on the occasion of the country’s independence day. The ministry official said the advertising agency had admitted its mistake. However, the committee deemed the apology insufficient given the significance of the omission.\n\nAPP adds: Earlier, while briefing the committee, the APP MD stated that an internal inquiry had uncovered embezzlement exceeding Rs1.24 billion in a project.\n\nAccording to him, additional irregularities were also detected in employees related expenses, fake appointments, and provident fund accounts, leading the FIA to register a case against 16 individuals, including former executive directors, managers, and clerical staff.\n\nThe committee members while praising the MD for playing the role of a whistleblower directed him to take all necessary measures for the recovery of embezzled funds.\n\nMr Khichi also informed the committee that the organisation’s official website was generating annual revenue of Rs2.4 million, reflecting its growing digital monetisation potential.\n\nHe said the cabinet’s approval was awaited for signing agreements on news exchange with 11 foreign news agencies. Additionally, he said, a demand of Rs300 million had been placed before the Finance Division to incorporate pension enhancements announced in the last three federal budgets.\n\nSecretary Information Ambreen Jan informed the committee that following the earlier approval of Rs11 billion to settle outstanding dues of PTV employees, the ministry was now set to request an additional Rs4.5 billion from the Finance Division to settle outstanding dues of PTV employees.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:55:37.359Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938257/na-body-concerned-over-non-payment-of-dues-to-private-media-organisations",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:57.000Z"
}
