{
  "title": "Flood situation worsens in housing schemes on Multan Road - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The situation in various residential areas, including ParkView City society on Multan Road, worsened in the wee hours of Friday after the floodwater accumulated up to five to six feet there and damaged houses, valuables and structures.\n\n“Almost half of the ParkView City society is full of water. In most houses of its six blocks, the accumulated water level is five to six feet, which is impossible to be drained out by the residents on their own. Moreover, the residents have already shifted either to their native towns or the relatives in Lahore,” Muhammad Abdullah, a resident of the society, says while explaining Friday’s situation to Dawn when contacted.\n\nAt present, according to him, various blocks of the society, including Diamond, Crystal, Silver, Tulip (Extension), Overseas (Extension) and Platinum, are under water.\n\n“From the housing society’s Main Gate (Multan Road) to the fourth roundabout, there is no water. However, soon after passing the fourth roundabout, one can see water everywhere. Like others, a huge quantity of water is accumulated at our home. Moreover, our other house, which is under-construction these days, is also full of water,” he adds.\n\nMost houses are inundated with 3-4 feet floodwater\n\nTalking to Dawn, Waryam, a local real estate agent, says 1,500 to 2,000 houses, most of them five-marla, have been submerged by 3-4 foot floodwater.\n\n“The situation at 10 marla houses is also the same. Besides this, the empty plots, land etc is also full of water. At present, no residents are living there as all had left the area by Thursday night,” he added.\n\nAccording to an official source, the next three days are very critical. “There are reports that around 300,000 cusecs floodwater is likely to be released by India soon. If it comes, it may cause massive devastation in Lahore. Let’s see what happens in the coming days, since the river capacity to bear the water is 250,000 cusecs,” he warns.\n\nThe situation has worsened at Mohlanwal along the Multan Road where water entered the locality and submerged many houses. This locality is also very near to the Ravi river.\n\nLahore Deputy Commissioner Syed Musa Raza says the water level in the Ravi River is gradually reducing as the situation on Friday was better than Thursday. However, he warns that anything bad may happen in the coming days if India releases floodwater more than the capacity (250,000 cusecs) of the Ravi.\n\nHe says though even if India releases 300,000 cusecs, Lahore will receive it at Jassar point in next three to four days.\n\n“But till reaching Jassar, it will be reduced to 200,000 or so that can flow and pass through Ravi easily,” he maintains.\n\nThe DC says the 220,000 cusecs floodwater, which was flowing in the Ravi on Thursday night onwards, has now reduced to 160,000 cusecs.\n\n“I think the situation will improve in the coming days in case India does not release water and there are no rains in the catchment areas of the Ravi,” he said.\n\nWhen this report was filed at 10pm, the floodwater in Ravi had receded to 151,000 causes at Shahdara. “The floodwater at the moment is 151,000 cusecs,” Mr Raza said and added that after receding of water, the official teams are focusing on provision of services at the 18 flood relief camps in Lahore.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b22bf542fd5.jpg",
  "retrievedAt": "2025-09-06T09:55:38.618Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938252/flood-situation-worsens-in-housing-schemes-on-multan-road",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:49.000Z"
}
