{
  "title": "Theme Park owner arrested for raising illegal scheme in Ravi - Newspaper - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Anti-Corruption Establishment (ACE) has arrested the owner of Theme Park, an ‘illegal’ housing scheme raised in the river bed of Ravi.\n\nThe scheme was completely inundated by the swollen river last week.\n\n“Khushi Muhammad built this illegal housing scheme in the Ravi land, made residential plots on 12,000 kanals inside the river bed and sold them to citizens by fraud. The suspect had not built the society as per law and even couldn’t establish any kind of sewage system in the fake housing scheme and since the entire area was inside the river, therefore, all the houses in the illegal housing scheme were submerged by the floodwater,” an ACE spokesperson said in a statement on Wednesday.\n\nHe said the ACE had also sought record of all illegal housing schemes established in the Ravi bed from the River Urban Development Authority (Ruda) and the Lahore Development Authority (LDA) so that action could be taken against those housing schemes as per the law.\n\nACE seeks record from Ruda, LDA: promises strict action\n\n“Theme Park was not approved by the relevant departments. Keeping in mind public complaints, the ACE has decided to take strict action against all such illegal housing schemes which are established on river land,” he said and added the construction of housing societies on river land could not be permitted at all and indiscriminate action would be taken against already-established illegal housing schemes as well.\n\nA source said Khushi Muhammad was a police constable before he kicked off this project — Theme Park — with a small piece of land.\n\n“By exploiting the loopholes in the system and greasing the palm of the officials concerned, he continued acquiring more land in the river bed and sold the same to the citizens. He also managed to transfer billions of rupees abroad.\n\nInterestingly, it is the National Accountability Bureau (NAB) which usually initiates action against the housing societies involved in fraudulent activities but in this case the ACE stepped in first.\n\n“It will be a test case for Punjab Chief Minister Maryam Nawaz whether she successfully lays hands on those involved in this mega corruption housing scam along the river bed or buckles under the pressure of those who have strong connections in certain corridors,” an official source said and added not only the owners of such societies but top officials in bureaucracy that helped them build structures on the river land with impunity should be taken to task.\n\nFederal Minister for Communication Aleem Khan, also the president of Istehkam-i-Pakistan Party (IPP) which was dubbed as king’s party at the time of its inception in 2023, had got a major relief same year following NAB’s decision to close an inquiry against him for allegedly occupying and encroaching public passages and illegal extension of the Park View housing society both in Lahore and Islamabad under the new accountability laws.\n\nThe property tycoon was accused of illegally occupying ‘public passages’ and illegal extension of River Edge Housing Society Lahore and also illegal extension of a housing society (Park View) in Islamabad, thus minting money from general public by selling plots in unapproved phases.\n\nThe LDA had raised an objection saying the housing scheme was situated in a river area which could not be utilised for any residential purposes. “It is not safe for the people’s lives to allow residential construction there (Ravi area),” the LDA had informed NAB.\n\n“The land also fell in an agricultural area and did not carry the characteristics of urban property thus the scheme was not approved. Despite this, Aleem Khan and others started selling the plots falling in the area for which approval was refused,” NAB had alleged. It is a big question mark how come RUDA, LDA or TMAs approved structures along the river bed.\n\nIn recent days, billions of rupees of residents have been lost in various housing schemes and katchi abadis after floodwater entered their houses and business premises in Lahore. This area comes under the Ravi Riverfront Urban Development Project being executed along a 46km long stretch of Ravi by RUDA.\n\nPublished in Dawn, September 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:56:09.627Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939600/theme-park-owner-arrested-for-raising-illegal-scheme-in-ravi",
  "dateList": "2025-08-30",
  "date_published": "2025-09-04T03:47:34.000Z"
}
