{
  "title": "Karachi man sentenced to 14 years in prison for throwing acid on his sister - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A sessions court sentenced a man to 14 years in prison for throwing acid on his sister over a property dispute.\n\nAfter hearing prosecutor Irfana Qadri, complainant counsel Bahzad Akbar and defence side, Additional District and Sessions Judge Abdul Zahoor Chandio, who was also the presiding officer of the Gender-Based Violence Court (South), found Muhammad Ramzan guilty of throwing acid on his sister Sughra after she refused to give up her share in the inheritance property to her brother.\n\n“This case involves a heinous crime, specifically targeting a woman with acid, an act that causes lifelong physical and psychological trauma. Such offences are not merely crimes against an individual but are a scourge on society and an affront to public policy,” the judge observed.\n\nThe court also handed down additional sentences; two years’ imprisonment for injuring with a knife to the victim and four years each for attacking her sons — Naeem and Waseem — who had rushed to rescue their mother.\n\nThe court also imposed a total compensation of Rs450,000 for injuring the victims.\n\nAccording to the state prosecutor, in November 2022 the victim had gone to her brother’s house in Manzoor Colony, where he (the accused) threw acid on her. However, she managed to escape and ran to a nearby house, but the accused chased her and again attacked her and her sons with a knife.\n\nThe prosecutor further stated that the accused had lost his share of the inheritance in gambling and was putting pressure on his sister to hand over her share to him, and over her refusal, he threw acid on her.\n\nIn its order, the court noted that the accused in his statement claimed innocence and denied the allegations.\n\nHowever, it added that the accused failed to provide any alternative version of the events or offer any plausible explanation for the injuries sustained by the victims.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:55:39.568Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938287/karachi-man-sentenced-to-14-years-in-prison-for-throwing-acid-on-his-sister",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:21:42.000Z"
}
