{
  "title": "Talk of ‘hybrid system’ is admission of dictatorship: Justice Minallah - Pakistan - DAWN.COM",
  "author": null,
  "content": "Supreme Court Justice Athar Minallah on Thursday said that the talk of a “hybrid system” prevalent in the country actually amounted to an admission to the presence of a dictatorship.\n\nWhat had previously only been a term coined by analysts to describe the unique system of governance currently in vogue, is now apparently being worn as a badge of honour. Defence Minister Khawaja Asif had in July spoken in glowing terms about the ‘hybrid regime’ that currently runs the country. The term is used to describe the informal power-sharing arrangement, whereby the country’s military holds a great deal of influence on the incumbent civilian setup and has a big say in the way the affairs of the state are managed.\n\nIn remarks on the issue while addressing the Karachi Bar Association (KBA) today, Justice Minallah said: “It is something to accept that people today say there is a hybrid system, that [actually] means there is dictatorship and there is no constitutional governance.”\n\nHe blamed what he said was the “lack of constitutional governance” in the country that was responsible for elite capture over the rule of law or the Constitution.\n\n“I had to write in many high court orders that there is no rule of law or Constitution in the country; there is elite capture,” he explained.\n\nHe said that the history of the country’s judiciary was “not something to be proud of for me”.\n\nThe judge said that his generation had passed its time, caused whatever destruction it could to the country, and should never be afraid to admit it, adding that they could not blame anyone else and that this had kept happening throughout the country’s history.\n\nJustice Minallah said that, as per the oath, judges had to impartially decide cases in accordance with the law and defend the Constitution without fear or favour, adding that the judiciary at all levels was bound to the oath and answerable to God and the people.\n\nHe explained that if there was a lack of constitutional governance in the country and he, as a judge, did nothing about it, he would not only be violating the Constitution but also his oath.\n\n“Unfortunately, we are taught distorted history, and no one tells us the truth. Our generation did whatever it could do; the most we can do now is to hand over the baton to you and at least tell you the truth.\n\n“The societies in which the truth is eliminated and truth ceases to be spoken are destroyed.”\n\nJustice Minallah further said that no lesson had been learnt from history.\n\n“The root of the country’s split in 1971 was laid down in the dissolution of the constituent assembly by the civil-military bureaucracy,” he said, pointing out that while there had always been free and independent judges in the country’s history, “the judiciary has never played the role that it ought to have.”\n\nHe said the Constitution was the expression of the people’s will and premised on the people’s right to rule through elected representatives, adding that it demanded that no institution or political officeholder would engage in political engineering and that any representatives would be elected through fair and transparent means.\n\n“Unfortunately, that too has remained a dream for our history.”\n\nHe said the only way forward was to abide by the Constitution and govern the country accordingly, together with the upcoming young generation.\n\n“This idealism of the youth will bring a change in the country. We know that fundamental rights are meaningless, there is no freedom of expression, there is a restriction on political thoughts and criticism,” he said, adding that the country would not have split if there had not been a clampdown on the freedom of expression.\n\nResponding to the judge later in the day, Asif pointed out his role as a provincial minister in the former NWFP government under the tenure of former dictator Pervez Musharraf and called for self-reflection.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/041650119a7e19c.webp",
  "retrievedAt": "2025-10-12T03:55:44.554Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1939684/talk-of-hybrid-system-is-admission-of-dictatorship-justice-minallah",
  "dateList": "2025-08-30",
  "date_published": "2025-09-04T13:59:44.000Z"
}
