{
  "title": "One policeman martyred, 3 terrorists killed in Kohat shootout - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least one policeman was martyred and three terrorists were killed in a firing incident in Khyber Pakhtunkhwa’s Kohat district, police said on Saturday.\n\nAccording to Regional Police Officer Kohat Abbas Majeed Marwat, “One policeman was martyred and two others were injured in an operation against terrorists.”\n\nHe said, “Three terrorists have been killed and several others injured as police retaliated [against terrorists] in the mountains of Darmalak.” An operation is underway to arrest the injured terrorists, the official added.\n\n“We will not let the sacrifices of our martyrs go in vain and our war against terrorism will continue.”\n\nEarlier today, a statement from the Rescue 1122 read, “A tragic incident of firing on a police vehicle took place near the Darmalak police post in Kohat.”\n\nAs a result of the firing, one policeman was martyred on the spot and two policemen were injured, the statement said, adding that the injured officials were taken to Kohat District Headquarters Hospital.\n\nRecent terrorist attacks have predominantly targeted the police, law enforcement agencies’ personnel and security forces. In response, the state has also intensified its counterterrorism operations.\n\nEarlier this month, two Federal Constabulary personnel were martyred and 18 others were injured in a terrorist attack in KP’s Hangu district.\n\nOn August 14, five cops were martyred and another eight left injured as militants attacked police checkpoints at different locations across KP, including Peshawar, Upper Dir and Lower Dir.\n\nThree “wanted terrorists” were killed during a joint operation between the regional police and the Counter Terrorism Department in Bannu district in July.\n\nPakistan has witnessed an uptick in terror activities over the past year, especially in KP and Balochistan, after the proscribed Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/3015214955f6b91.webp",
  "retrievedAt": "2025-09-06T09:55:24.742Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938419/one-policeman-martyred-3-terrorists-killed-in-kohat-shootout",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T10:37:52.000Z"
}
