{
  "title": "Provinces or local government? - Newspaper - DAWN.COM",
  "author": null,
  "content": "RECENT media reports indicate that the ‘27th constitutional amendment’ is likely to divide the existing four federating units into 12 provinces.\n\nBefore finalising such a decision, parliamentarians must consider a superior alternative — to use this amendment to delineate local government (LGs) responsibilities and functions in Article 140-A of the Constitution and insert an additional list in the Fourth Schedule supplementing the federal and provincial lists.\n\nThere are compelling arguments why the division may not achieve the intended goal of providing public services to citizens. The timing is not ideal, as it could hinder the economy’s transition from stabilisation to sustained inclusive growth. Article 239(4) requires the provincial assemblies to pass a resolution to create new provinces. Achieving a two-thirds majority for these resolutions is unlikely, and political tension could increase at a time when stability is needed for economic reform.\n\nThere are compelling arguments why more provinces may not achieve the intended goal.\n\nSecond, even if this happens, dividing assets and liabilities, handling legal disputes, restructuring administrations, reassigning civil servants, delimiting constituencies and redrawing boundaries would distract policymakers from their focus on economic recovery.\n\nA third aspect is the potential for significant increases in public expenditure due to additional offices, residences, vehicles, equipment, benefits, protocol, and operating costs for numerous ministers, legislators and bureaucrats, affecting fiscal consolidation efforts.\n\nFourth, decision-making and dispute resolution at the CCI, NFC and NEC may be delayed as provinces extend negotiations to support their respective claims. Fifth, citizens’ access to ministers and legislators would remain restricted compared to that of nazims and councillors also residing in the same villages and cities.\n\nSixth, business costs would escalate as companies operating nationwide would fall under 12 jurisdictions and file separate tax returns with different rates. Seventh, intra-regional inequalities would become sharper as relatively well-endowed areas such as Peshawar and Hazara in KP, Quetta in Balochistan, central and western Punjab and southern Sindh would do well compared to other provinces in the same region.\n\nWhat should Article 140-A and the new Fourth Schedule list prescribe for LGs?\n\na) LGs would have complete control over education in primary and secondary schools up to Matric, healthcare up to district hospitals, water supply, sewerage, solid waste disposal, population planning, sports, mass transit, roads, bridges within district limits, prosecution, social welfare, and community and women’s development. All staff up to Grade 16 would be transferred along with their salary and allowance budgets.\n\nb) Nazims would be directly elected on a party basis and half the seats of various corporations and councils allocated on through proportional representation, reserved for women, technocrats, minorities, peasants and labourers. Large urban areas would have metropolitan corporations with the mayor heading the district government.\n\nFor example, the Lahore Metropolitan Corporation nazim would supervise and oversee agencies such as LDA, WASA, the waste management company, the Mass Transit Authority, and the Lahore Industrial Estates Development Company in addition to devolved departments. For other districts, there would be a mix of district councils and municipal corporations/committees. In predominantly rural areas, the district council nazim would head the district government. Each province would design its own configuration of union, town, tehsil, municipal and district councils depending on population, area and density. What Punjab may choose may not fit the needs of Balochistan with its small population and larger area.\n\nc) In the context of fiscal decentralisation, the Provincial Finance Commission will allocate a minimum of 30 to 40 per cent of the provincial share from the divisible tax pool (without disturbing the existing NFC award allocation to the provinces) to LGs, granting them autonomy in budget formulation and implementation. The PFC would give preference in allocation to backward districts as advanced districts can mobilise revenues from their own sources, incentivised by matching grants.\n\nThe LG would assess and collect urban immovable property tax, capital gains tax, agricultural tax, cesses, user charges and fees, and spend these resources in their respective jurisdictions. Evidence shows that raising taxes or charging user fees for services at the local level is relatively easy. The district accounts officer would report administratively to the district nazim, but be professionally supervised by the province’s accountant general.\n\nAudit of accounts at all tiers of government would be done by the auditor general of Pakistan. CEOs of corporations and district councils would act as principal accounting officers for issues under their control, head the district development working party (for approval of ADP projects), and district accounts committees.\n\nd) Administratively, current LG and local council service staff should be replaced with experts, professional managers and specialists recruited by the Public Service Commission at market-based salaries. Citizen-facing roles should be filled by young, qualified, courteous and capable officers. Devolved departments’ district executive officers must have the legal powers to resolve citizens’ issues without referring the matter to provincial secretariats.\n\ne) A subsection defining province-LG relations must be inserted and include performance indicators, monitoring and evaluation, audits, etc. Provision for suspending or superseding LGs should not be at the discretion of the chief ministers. Deputy commissioners can assist LGs but not interfere in their daily affairs.\n\nIf effectively implemented, strengthening LGs may offer substantial advantages relative to the creation of new provinces. First, it would minimise dissatisfaction with the government as citizens would be able to access basic services at the grassroots level.\n\nSecond, they would have a say in setting priorities and decision-making, leading to efficient resource allocation and cost-effectiveness.\n\nThird, it would enable political parties to become training grounds for a critical mass of young leaders to gain hands-on experience for shouldering responsibilities as future provincial and federal ministers.\n\nFourth, it would promote political inclusion and deter dynastic politics by giving representation to marginalised and excluded groups — women, minorities, peasants and labour, professionals, and experts — in the governance structure.\n\nFifth, people may be more willing to pay taxes when collected by their local representatives instead of distant central authorities, as they would directly observe the benefits. Finally, there would be no large increase in unproductive expenditure as elected LG officials live in their own residences within the community, while their offices and facilities are already in place.\n\nThe writer is former chairman, National Commission for Government Reforms and former adviser to the PM on institutional reforms.\n\nPublished in Dawn, August 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b2424e4e012.jpg",
  "retrievedAt": "2025-09-06T09:55:35.300Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938348",
  "dateList": "2025-08-30",
  "date_published": "2025-08-30T00:22:09.000Z"
}
