{
  "title": "BISP chairperson for carrying out need assessment to make skill development program more beneficial",
  "link": "https://www.app.com.pk/national/bisp-chairperson-for-carrying-out-need-assessment-to-make-skill-development-program-more-beneficial/",
  "date_published": "2024-08-22T16:12:00.000Z",
  "source": "APP",
  "content": "KARACHI, Aug 22 (APP):The chairperson Benazir Income Support Program (BISP) Rubina Khalid, on Thursday, emphasized carrying out a need assessment of the industrial sector while designing a skill development program so that students could be able to get employment instantly after completion of their training.\nShe expressed the views while chairing a review meeting and addressing a ceremony held at Lasbela Industrial Estates Development Authority (LIEDA) in Hub town of Balochistan on the occasion of handing over of 4 Mobile Registrations Vans (MRVs) to BISP Balochistan Zone to facilitate registration process in far-flung areas.\nAdvisor to Chief Minister Balochistan for Industries and Commerce Mir Ali Hassan Zehri, Directors Generals of BISP, Managing Director LIEDA Fareed Muhammad Hasni, local leaders of Pakistan Peoples Party, and others were also present at the occasion.\nSenator Rubina Khalid terming BISP as a ray of hope for the deserving and destitute segments of society said that Shaheed Benazir Bhutto envisioned the social security program aimed at economic empowerment of women folk and later President Asif Ali Zardari has transformed the dream into a reality.\nThe BISP has given identity to millions of women around the country who earlier were deprived of their fundamental right of recognition, she said adding that PPP has always taken the lead in initiatives for the development and economic empowerment of women as well as elevating dignity and status of women in the society.\nUnderscoring the significance of reaching remote areas to address the issues of backwardness and a sense of deprivation in Balochistan, the BISP chairperson said that her organization was working on different projects to extend its outreach to the uncovered population.\nWe are taking various measures for the registration of deserving women, the opening of bank accounts of the beneficiaries, the issuance of ATM cards, and ensuring timely disbursements while maintaining transparency and good governance in the BISP.\nShe said that it was made clear to all staffers that there was zero tolerance for corruption in the organization and uncivilized and ill-mannered behavior toward any beneficiary woman would not be tolerated at any cost.\nShe said that BISP is going to open more offices in Balochistan while 4 new Mobile Registration Vans were provided to extend registration services to those females of far-flung areas who were left unregistered due to lack of accessibility or other issues.\nMir Ali Hassan Zehri, addressing the ceremony, highlighted the measures taken by the government for the development of the area and facilitation of the people. He said that PPP believes in the service of people and it was various steps for their welfare.\nHe said that the provincial government was ready to work with BISP across the province for the betterment of the citizens and it will extend fullest cooperation to BISP for the achievement of the set objectives.\nThe BISP chairperson, while chairing the review meeting, stressed on imparting training of employment-oriented skills and said that LIEDA was a big industrial zone of Balochistan.\nShe directed that a need assessment of the zone should be carried out and the skill development program must be aligned with the requirements of industries locally as well as abroad so that students completing their training could get employment at the earliest.\nShe also emphasized the participation of local government representatives in the registration process employing local people to get better results and spreading awareness among the masses particularly beneficiary women about the disbursement procedure of BISP that does not require any fee or charges.\nDirector General BISP Islamabad Naveed Akber and Director South Zone Munir Sasoli, briefing at the occasion informed that BISP centers were operational in 43 tehsils and 158 sub-tehsils of Balochistan while 2 million beneficiaries in Balochistan were taking benefit of income support initiatives of BISP.\nLater, Senator Rubina Khalid and the ACM Mir Ali Hasan Zahri cut the ribbon to make the handed-over MRVs operational. They planted a sapling at LIEDA and also visited a food manufacturing factory in the industrial zone.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:53:13.981Z"
}
