{
  "title": "NCGSA to host Pakistan’s first-ever workshop on Space Law and Policy",
  "link": "https://www.app.com.pk/national/ncgsa-to-host-pakistans-first-ever-workshop-on-space-law-and-policy/",
  "date_published": "2024-08-22T09:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 22 (APP): The National Center of GIS and Space Applications (NCGSA), in collaboration with the Institute of Space Technology (IST), is set to host Pakistan’s inaugural Workshop on ‘Space Law and Policy’ on September 03-04.\nAccording to the NCGSA, this groundbreaking event will be the first of its kind in the country, focusing on the critical and emerging domains of space law and policy.\nWith the increasing relevance of space activities in global geopolitics and national security, this workshop aims to equip participants with the knowledge needed to navigate the complex legal and regulatory frameworks governing space.\nResource persons from renowned organizations including Access Partnership, Singapore; Pakistan Space Activities Regulatory Board (PSARB); National Defence University (NDU), Pakistan; Asia-Pacific Space Cooperation Organization (APSCO), China; and the National Center for Cyber Security (NCCS), Pakistan, will share their expertise and insights during the two-day event.\nThe key topics on the agenda include International Space Treaties and Agreements, Space Governance and Regulatory Frameworks, National Space Policy of Pakistan, Space Diplomacy, Liability and Insurance in Space Activities, and Space Sustainability focusing on debris and environmental protection.\nThe workshop will also address the increasingly critical issues of Space Security and Cyber Security, reflecting the intersecting challenges that lie at the forefront of contemporary space law and policy discussions.\nThis landmark event represents a significant step forward for Pakistan in the global space community, aligning with the objectives of the newly approved National Space Policy.\nIt positions the country to actively engage in and contribute to international space law and policy, fostering a vibrant exchange of ideas and setting the stage for future developments in this essential field.\nThis workshop underscores the NCGSA’s dedication to advancing Pakistan’s capabilities in space activities and governance. Mandated by the Higher Education Commission, NCGSA plays a pivotal role in fostering academic excellence and research in space science and technology.\nBy aligning with the objectives of the National Space Policy, NCGSA is not only shaping the future of Pakistan’s space endeavors but also positioning the nation as an active participant in the global discourse on space law and policy.",
  "retrievedAt": "2025-08-11T04:53:19.385Z"
}
