{
  "title": "Frontier Constabulary being restructured to strengthen internal security: Talal Chaudhary",
  "author": null,
  "content": "FAISALABAD, Jul 14 (APP): Minister of State for Interior and senior PMLN leader Senator Talal Chaudhary said that the Frontier Constabulary (FC) is being restructured and renamed Federal Constabulary only to bolster internal and national security of Pakistan.\nHe was addressing a press conference at the Deputy Commissioner’s office here on Monday and FC Commandant Riaz Nazir Gara was also present. The minister said that revamping of FC is not a politically motivated decision but it is an institutional necessity to improve coordination, compensation and capability of this force across all provinces and territories of Pakistan.\nIt is purely a defence-related issue to strengthen national defence by providing support to the law enforcement agencies, he added. He said that the FC had played a pivotal role in maintaining peace and security within the country and along its borders for nearly a century, yet this force has not been accorded the recognition and benefits comparable to other security forces in Pakistan.\nHe lamented that despite limited salaries and fewer privileges, FC personnel have consistently served the nation with unwavering dedication. “Now the Prime Minister Shehbaz Sharif and Federal Interior Minister Mohsin Naqvi have decided to transform FC into a federal force to address the disparity with upgraded structure and scope under the new name of Federal Constabulary,” he added.\nHe clarified that while the name is being changed, the identity and core function of the FC as a constabulary remain intact. The restructuring would help ensure that its personnel receive salaries, training and benefits equal to those of other national security forces, he added.\nHe said that the FC has long involvement in combating drug trafficking, smuggling and supporting civil law enforcement agencies during sensitive events like Muharram, elections and anti-polio campaigns. Now it would continue to carry out these responsibilities under its new federal framework, he added.\nHe said that with reorganization, the jurisdiction of Federal Constabulary would be expanded to include all four provinces as well as Gilgit/Baltistan and Azad Jammu & Kashmir.\nHe said that recruitment will be opened to all citizens from across the country and the federal government would bear all operational and financial responsibilities, relieving the provinces of any budgetary burden.\nFC revamping would include updated training modules, capacity-building initiatives and a modernized command structure designed to uplift the morale and effectiveness of its personnel, he added.\nFC Commandant Riaz Nazir Gara provided historical context and said that the FC was established in 1913, originally known as the North-West Frontier Constabulary. It was operated under an act that is now over 100 years old.\nRecognizing the urgent need for reform, he said that the FC would be realigned into a more robust and federally managed institution with clearly defined command tiers including platoons, companies and wings.\nHe said that the FC has 41 wings and its 36 wings are currently deployed under the security division. The revamped structure would streamline these units for improving efficiency, he added.\nCommandant Gara disclosed that 423 FC personnel have laid down their lives in the line of duty which is a testament to the commitment and sacrifice of this force.\nThe reorganization would help honor these sacrifices by providing a better command structure, improved facilities and clearer career pathways for FC members, he added.\nThe State Minister and FC Commandant both urged the public, media and stakeholders to carefully read the new ordinance related to the Federal Constabulary to avoid misconceptions.\nThis transformation is a strategic and institutional reform which would help address the internal security challenges and enhance operational capability of one of the oldest law enforcement bodies of the country, they added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T09:33:10.218Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/frontier-constabulary-being-restructured-to-strengthen-internal-security-talal-chaudhary/",
  "dateList": "2025-07-14",
  "date_published": "2025-07-14T16:30:00.000Z"
}
