{
  "title": "ECC approves textile policy with certain amendments",
  "link": "https://www.app.com.pk/national/ecc-approves-textile-policy-with-certain-amendments/",
  "date_published": "2022-02-09T14:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): Economic Coordination Committee (ECC) of the Cabinet here on Wednesday approved Textiles and Apparel Policy, 2020-25 with certain amendments.\nThe ECC met here with Federal Minister for Finance and Revenue Shaukat Tarin in the chair, whereas Minister for National Food Security and Research Syed Fakhar Imam, Federal Minister for Energy Hammad Azhar, Federal Minister for Privatization Muhammedmian Soomro, Adviser to the Prime Minister on Commerce and Investment Abdul Razak Dawood, federal secretaries and senior officers attended the meeting.\nThe Ministry of Commerce submitted revised Textiles and Apparel Policy, 2020-25 after incorporating few changes along-with implementation report.   The ECC after deliberation approved the policy with certain amendments, said a press release.\nThe ECC discussed in details and approved summary submitted by Ministry of Communication for issuance of sovereign guarantee or SBLC worth of Rs. 6944.0 million against Operational Viability Gap Funding (VGF) for the construction of Sialkot (Sambrial) – Kharian Motorway project on BOT basis.\nThe Ministry of Energy, Petroleum Division submitted a summary on 15 years’ extension of lease contract between Saindak Metals Limited and MCC China for Saindak Copper Gold Project. The ECC after detailed discussion allowed the extension of lease contract and recommended to review financial aspect of the project annually by the professional expertises.\nThe ECC also approved Ministry of Energy, Petroleum Division’s summary on determination of RLNG sale price for PLL’s supply to K-Electric (KE).  On another summary of Ministry of Energy, Petroleum Division, for revision of gas price of Mazarani Gas field held by M/s PPL and GHPL, the ECC approved the proposal of revision of gas price applicable to Mazarani Gas Field from US $ 1.75/MMBTU to US $ 3.75MMBTU from 1st September 2021.\nThe ECC also considered and approved Technical Supplementary Grants submitted by different ministries and divisions.     The ECC deferred Power Division’s two summaries on Settlement of Payables to Government Owned Power Plants and Reinstatement of Tax on dividend for investors/shareholders of IPPs.",
  "retrievedAt": "2025-08-11T14:17:36.795Z"
}
