{
  "title": "President for further simplifying registration procedure for foreign companies",
  "link": "https://www.app.com.pk/national/president-for-further-simplifying-registration-procedure-for-foreign-companies/",
  "date_published": "2022-02-09T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 9 (APP): President Dr Arif Alvi Wednesday called for further simplifying the registration procedure for foreign companies to make Pakistan an attractive destination for business and investment.\nThe president, during a meeting with Pakistani-American diaspora in the IT sector, via video link, urged all stakeholders to address the procedural issues and facilitate foreign investors who wanted to open companies in Pakistan.\nHe said that Pakistan’s ICT sector had great potential and it was essential to encourage investment in this vital sector by effectively showcasing the opportunities available in the country, particularly to the Pakistani-origin IT investors based in the USA.\nThe participants of the meeting expressed satisfaction over the progress made by the relevant government organizations in simplifying the registration process for foreign investors.\nExecutive Director of the Securities and Exchange Commission of Pakistan Khalida Habib told the meeting that the registration process had been made easier via one window operation and companies could now be registered online through the e-services portal of SECP.\nChairman Special Technology Zone Authority Amir Hashmi apprised the meeting that his organization was in the process of developing technology clusters in line with best international practices enabling companies to invest in Pakistan’s ICT sector.\nHe further informed that foreign companies had committed to invest $570 million that would help generate 15,000 jobs in the country.\nAdvisor to PM on Commerce and Investment highlighted that Pakistan’s IT exports had risen by 36% during July-December 2021 and efforts were underway to further develop this sector to enhance exports.\nAddressing the meeting, the president appreciated the measures taken by SECP, STZA, Ministry of IT and Telecom, and the Board of Investment for facilitating and encouraging foreign investors to do business in Pakistan.\nHe advised to further improve coordination between the relevant stakeholders to address the procedural issues that would help increase ICT exports and attract investments in Pakistan.\nThe meeting was attended by the Advisor to PM on Commerce and Investment, Abdul Razak Dawood, SAPM on CPEC Affairs Khalid Mansoor, Secretary Ministry of T and Telecom Dr Muhammad Sohail Rajput, Chairman Board of Investment Muhammad Azfar Ahsan, Secretary BOI Fareena Mazhar, Chairman Special Technology Zones Authority Amir Hashmi, Executive Director of the SECP Khalida Habib, and other senior officials of the Government.\nAmbassador of Pakistan in the United States, Dr Asad Majeed Khan, and members of Pakistani diaspora in the USA, including Dr Naveed Shervani, Moazam Chaudhary, Saleem Ahmad, Idris Kothari, Ahsan Sohail, Waheed Qureshi, Amir Khan, Ahmad Ayub and Faysal Sohail, attended the meeting via video link.",
  "retrievedAt": "2025-08-11T14:17:46.917Z"
}
