{
  "title": "Shehbaz, Maryam orchestrated ‘no-trust motion’ drama to flee country: Fawad",
  "link": "https://www.app.com.pk/national/shehbaz-maryam-orchestrated-no-trust-motion-drama-to-flee-country-fawad/",
  "date_published": "2022-02-09T16:00:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 9 (APP): Minister for Information and Broadcasting Chaudhry Fawad Hussain on Wednesday said Pakistan Muslim League-Nawaz (PML-N) President Shehbaz Sharif and Vice President Maryam Nawaz had orchestrated the drama of no-confidence motion against Prime Minister Imran Khan for fleeing from country.\n“The purpose of no-trust move by Shehbaz and Maryam is nothing but only to get a chance for going abroad, but we will not let them succeed in such attempts until they return the looted public money,” he said while addressing a condolence reference in memory of senior journalist Rahimullah Yousafzai and Editor-in-Chief of Daily Frontier Star Professor Dr Hafiz Sanaullah here at the Peshawar Press Club.\nFawad said ironically, the opposition parties were comprised ‘political dwarfs’, who did not do research on major socio-economic issues and eventually became a source of ‘fake news’.\nHe said it were the PML-N and the Pakistan Peoples Party (PPP), which while in power for 10 years ((2008-18)) had taken massive loans of Rs 23 trillion. The country in fact was plagued with a ‘decade of darkness’.\nSome Rs 6 trillion loans were taken from 1947 to 2006 and spent on the construction of Islamabad, purchase of Gwadar, raising and equipping the armed forces, and developing roads infrastructure, he added.\nHe said the present government had to borrow money for repaying the past regimes’ loans of 18 billion dollars in the next two years.\nAppreciating the people of Khyber Pakhtunkhwa for constantly reposing confidence in the leadership of Prime Minister Imran Khan, Fawad said the political journey of ‘change’ was started from the province in 2013, which helped abolish the two-party system in the country.\nIt was unprecedented that the Pakistan Tehreek-e-Insaf (PTI) was again given a two-third majority in the 2018 general election, he added.\nHe said the government was striving to transform Pakistan into a true Islamic social welfare state on the pattern of Riyast-e-Madina for the socio-economic emancipation of the downtrodden and under-privileged.\nIt was PM Imran Khan, who had made serious efforts to put the country in the right direction, he added.\nThe minister said the revolutionary Sehat Sahulat Card programme had been launched in Khyber Pakthunkhwa, Punjab, Gilgit Baltistan and Azad Kashmir to provide every person free treatment of upto Rs one million in the country’s top hospitals.\nTo ebb away inflation and price hike, he said, the PM’s Ration Subsidy Programme was launched under which 30 percent subsidy on essential commodities were being provided to the poor segments of the society.\nSuch projects, he said, had laid a strong foundation for the establishment of a true Islamic social welfare state in the country.\nAccusing former finance minister Ishaq Dar and his team of deindustrializing the country, he said the ill-planned economic policies of the PML-N government put the reliance of economy on service sector, which caused spike in unemployment and production of the unskilled labour.\nHe said the present government during the last three years reinvigorated the agriculture and industrial sectors. Besides substantial increase in cotton production during the current year, bumper crops of wheat, rice, and sugarcane, maize were achieved.\nFawad said the price of palm oil in the world market was close to $1,300 per metric tonne, which was around $500 per metric tonne when Prime Minister Imran Khan had come into the power.\nLikewise, the prices of petroleum products had jumped to $92 dollars from $40, he added.\nThe inflation increased due to the import of essential commodities from abroad, he said, pointing out the initiatives taken by the present government for curbing the price-hike through increase in income.\nHe said an amount of Rs 1,100 billion was injected in the agriculture sector while investment of Rs 1,000 billion was brought in the construction sector.\nFawad said the government’s anti-coronavirus policies won laurels at the global level with the renowned financial organizations like Bloomberg and others appreciated Pakistan for not only stabilizing the economy, but also protecting the people from starvation during the time of pandemic.\nAll the institutions were working in close coordination and understood the vision of PM Imran Khan, he said, adding it was the only Pakistan Tehreek-e-Insaf (PTI) government which had given political stability to the country.\nThose were the achievements of PTI government which ushered in progress and prosperity of the country, the minister said.\nHe said the political future of Sharif Family was heading towards a dead end, while the PPP was facing leadership crisis as it had no other option except Bilawal Bhutto. Both the political parties would be unable to match popularity of the PTI in the 2023 general election.\nThe PTI government’s pro-people policies, he said, would come to fruition in years to come and the party would get an overwhelming majority in the upcoming general election on the basis of its outstanding performance and record development works.\nTo a question about the coalition partners of government, he said every political party took decision that suited their political interest. “The political status of those who will be leaving PM Imran Khan, will be doomed and their stature will eventually become zero in eyes of public,” he added.\n“The people will join the PTI in droves in upcoming days and hardly a single person will leave the party that has ended the hereditary politics of PPP and PML-N in Pakistan,” he maintained.\nPaying glowing tribute to senior journalist Rahimullah Yousafzai and Prof Dr Hafiz Sananullah for promotion of journalism, Fawad said both were highly professional and credible journalists, who had earned great respect due to their professionalism and unbiased approach.\nHe observed that the habits of propagating misinformation and fake news on the basis of personal likening and disliking should be avoided as such negative practices were harmful for the society.\nHe said there was complete freedom of press in Pakistan and journalists were free to perform their professional obligations.\nThe major hurdle in the way of free press, he said, was keeping the journalists out of the editorial policies and providing the control to the owners of media outlets. He called upon the journalists bodies and regulatory bodies to work for press freedom.\nThe minister said most of the media organizations had earned over 40 percent profit, but did not increase salaries of their working journalists, cameramen and photographers.\nFawad said 100 big corporate companies of the country had earned Rs 929 billion profit and some of them increased salaries of their workers by responding to the call of the prime minister.\nThe minister said the journalists of KP and members of the Peshawar Press Club (PPC)had sacrificed their lives in the war against terror. Several journalists embraced martyrdom in a suicide attack on the PPC in the past.\nTo a question about disqualification of Senator Faisal Vawda, he said all legal options were available to Vawda to get justice from relevant forums.",
  "retrievedAt": "2025-08-11T14:17:29.012Z"
}
