{
  "title": "Action against illegal residents not targeted at Afghan refugees: FO spokesperson",
  "link": "https://www.app.com.pk/national/action-against-illegal-residents-not-targeted-at-afghan-refugees-fo-spokesperson/",
  "date_published": "2023-10-05T10:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): Pakistan on Thursday said its recent decision to deport illegal residents was not targeted at Afghan refugees but was against all foreigners without having valid visa documents.\nForeign Office spokesperson Mumtaz Zahra Baloch at a weekly press briefing said the national policy towards the Afghan refugees in the country “remained unchanged” and their safe repatriation was a separate issue.\nThe spokesperson said the ongoing operation was against the individuals who had either overstayed their visas or did not have the valid documents to stay.\nBaloch clarified that the operation had nothing to do with the Afghan refugees that Pakistan had been hosting for several decades despite its economic constraints.\nShe confirmed that the bilateral trade between Pakistan and Afghanistan continued to take place, however, stressed that Pakistan would not accept the misuse of transit trade facilities.\nPakistan, she said, had been clearly articulating its concerns about the threats emanating from Afghanistan.\n“We believe in diplomacy and will continue to engage with the Afghan authorities to ensure that the Afghan soil is not used to foment terrorism,” she said.\nShe said that Pakistan was in contact with the Indian authorities and urged them to issue visas to Pakistani spectators and journalists who wished to see the International Cricket Council (ICC) World Cup in India.\nShe said that it was the responsibility of the host country to provide security and a conducive environment for the Pakistan cricket team and emphasized that sports should not be mixed with politics.\nShe said that the Pakistan team was visiting India not for a bilateral cricket series and thus had every right to participate in the international series.\nTo another question, the spokesperson said the Ministry of Foreign Affairs had received the formal communication from the Election Commission to invite international observers for the upcoming general election. She said the process would be facilitated in accordance with the policy and past practice.\nOn Palestine, she said Pakistan’s policy was clear that it supported a two-state solution on the basis of pre-1967 borders.\nThe spokesperson outlined the engagements of Foreign Minister Jalil Abbas Jilani, who is currently in China at the special invitation of Foreign Minister Wang Yi for participation in the Third Trans-Himalaya Forum for International Cooperation being held in Tibet Autonomous Region.\nShe said the FM in his keynote address delivered today at the opening ceremony of the forum underscored Pakistan’s commitment to ecological balance and urged policy coordination and experience-sharing between countries in the region.\nShe said FM Jilani and Chinese Foreign Minister Wang Yi held a bilateral meeting on the sidelines of the Forum and emphasized the positive trajectory of bilateral ties, they discussed various aspects of the Pakistan-China friendship and exchanged views on regional and global matters.\nThe two foreign ministers reaffirmed their commitment to the China-Pakistan Economic Corridor (CPEC) and pledged to enhance high-level exchanges and strategic communication for continued cooperation, she said.\nIn Tibet, she said, FM Jilani met Deputy Prime Minister of Mongolia, Sainbuyan Amarsaikha where the two sides reaffirmed their commitment to high-level exchanges, and enhance bilateral trade and investment.\nBaloch said Pakistan and the Gulf Cooperation Council (GCC) had concluded the negotiations on the Free Trade Agreement (FTA), the first such agreement concluded by the GCC with any country since 2009.\n“We look forward to the early signing, ratification, and implementation of the Agreement which we believe will contribute to growth and mutual prosperity and mark a new chapter in economic relations between Pakistan and GCC,” she said.\nIn its capacity as the coordinator of the Geneva-based Organization of Islamic Cooperation (OIC) Group, she said, Pakistan co-organized with the OIC Observer Mission in Geneva an event titled ‘Mapping the efficacy of normative framework on religious discrimination, intolerance, and hatred’.\nThe event aimed to raise awareness of the growing phenomenon of religious discrimination, intolerance, and hatred and the need for strengthening the normative framework for its redressal from a human rights perspective, she said.\nThe FO spokesperson said that the Indian forces continued to commit serious human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nShe said that in September, the Indian troops killed 13 Kashmiris in extra-judicial killings and arrested 157 civilians and activists. Those arrested were mostly booked under the draconian laws promulgated by the occupation authorities in IIOJK Public Safety Act (PSA) and Unlawful Activities (Prevention) Act (UAPA), she said and added that such oppressive measures and human rights violations must end and the Kashmiri leaders be set free so that the Kashmiri people could freely exercise their right to self-determination.",
  "retrievedAt": "2025-08-11T09:57:52.412Z"
}
