{
  "title": "Solangi,Turkish envoy  agree to enhance cooperation in diverse fields",
  "link": "https://www.app.com.pk/national/solangiturkish-envoy-agree-to-enhance-cooperation-in-diverse-fields/",
  "date_published": "2023-10-05T07:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 5 (APP): Pakistan and Turkiye on Thursday agreed to promote bilateral cooperation in diverse fields including economy, trade, culture, tourism, media and people to people contacts.\nThis was decided in a meeting between Caretaker Federal Minister for Information and Broadcasting Murtaza Solangi and Ambassador of Turkiye Mehmet Pacaci who called on the minister here.\nMurtaza Solangi said that Pakistan highly valued its relations with the brotherly country Turkiye.\n“Pakistan and Turkiye have always supported each other in difficult times,” Murtaza Solangi added.\nStrongly condemning the recent bomb blast in Turkiye, the minister said Pakistan had faced the scourge of terrorism and Turkiye was also suffering from the same menace.\n“We are a strong country and incidents of terrorism cannot weaken us as a nation,” reiterated Murtaza Solangi.\nIn the meeting, the need to expand cooperation in the fields of media, drama and films was also emphasized.\n“Film and drama can play a key role in improving the global image of any country,” Murtaza Solangi said adding Turkish plays were very popular in Pakistan.\nExpressing the desire to co-produce movies with Turkiye, Murtaza Solangi said that Turkish filmmakers could benefit from tax amnesty given the film industry in Pakistan.\n“Northern parts of Pakistan are rich in natural beauty and Turkish filmmakers can utilize these beautiful tourist areas,” Murtaza Solangi remarked.\nMoreover, he said that cooperation between the two countries in the fields of media was the need of the hour.\nHe suggested that Pakistan and Turkiye should promote their culture together and in this context, joint films can also be exhibited at Pakistan, China Center.\nTurkish ambassador said that Pakistan and Turkiye were cooperating in every sphere of life including media.\nHe said the Turkish government wanted to bring Turkish films to Pakistani cinemas.\nMehmet Pacaci said that the Republic of Turkiye was celebrating its 100th anniversary, and they wanted to make these events memorable together with Pakistan.\nThe Turkish ambassador also appreciated the interest of the minister for information in the promotion of regional cooperation.",
  "retrievedAt": "2025-08-11T09:58:04.175Z"
}
