{
  "title": "Pakistan needs to capitalize on opportunities amid crisis due to evolving global order: Speakers",
  "link": "https://www.app.com.pk/national/pakistan-needs-to-capitalize-on-opportunities-amid-crisis-due-to-evolving-global-order-speakers/",
  "date_published": "2023-10-05T15:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): The Speakers at a conference discussing peace and security on Thursday underscored that the country needed to capitalize on the opportunities amid crisis due to the evolving global order shifting from the West to the East.\nThe Centre for Afghanistan Middle East and Africa (CAMEA) at the Institute of Strategic Studies Islamabad (ISSI), in collaboration with the United States Institute of Peace (USIP), is hosting a two-day International Conference on “Navigating Peace & Security in the Region & Beyond: Pakistan’s Role”.\nThe two-day international conference brings together an amalgamation of academics and practitioners from around the world. The Conference stretches over two days and has six diverse working sessions focusing on Afghanistan, the Middle East, Pakistan-US bilateral ties, counterterrorism, regional peace and security as well as non-traditional security challenges.\nAmbassador Asif Durrani, Pakistan’s Special Representative on Afghanistan was the Chief Guest at the occasion. Dr. Andrew Wilder, Vice President of Asia Centre, USIP, Ambassador Sohail Mahmood, Director General, ISSI and Amina Khan also spoke in the inaugural session.\nIn her welcome remarks, Director CAMEA, Amina Khan stated that the contemporary global landscape is witnessing profound shifts, in which Pakistan finds itself at a critical juncture amidst this transformative milieu.\nOn a global scale, the pursuit of security, stability, and progress is beset by a myriad of challenges, including conflicts, warfare, economic uncertainties, natural calamities, climate change, poverty and overpopulation.\nThe outbreak of the COVID-19 pandemic starkly exposed the shortcomings of a fragmented multilateral system in formulating coordinated responses to a crisis that continues to wreak havoc and inflict severe damage on the global economy.\nKhan highlighted that the evolving global trends not only present challenges but offer a spectrum of opportunities, encompassing both economic and political dimensions, for Pakistan. The onus firmly rests upon the nation to assume leadership and proactively define its destiny within the multifaceted tapestry of these unfolding scenarios.\nAmbassador Sohail Mahmood, Director General ISSI, while expressing his views, elucidated that the world is currently facing an unprecedented level of fragility, polarization and conflict risks. Various security threats, including traditional and non-traditional, have increased global volatility and concerns about nuclear conflict are heightened, as symbolized by the “Doomsday Clock” being set at 90 seconds to midnight.\nIn addition, the world is currently marred by major challenges including major-power competition, ongoing wars, terrorism, the pandemic’s effects, economic downturn, and climate change. The outcome of these transformations is uncertain, with ongoing debates about the decline of the West, globalization’s fate, and the potential for a new Cold War.\nThere is a shift in global power to the East, a growing desire for multipolarity, and a trend toward issue-based coalitions; while a semblance of stability and predictability are sought after by many nations.\nWhile shedding light on the regional challenges, Ambassador Mahmood focused on the geostrategic and economic transformation in South Asia and beyond. In the aftermath of the U.S. withdrawal from Afghanistan, security threats persist, but a significant shift is observed in the Middle East.\nChina-brokered reconciliation between Iran and Saudi Arabia is having a regional impact. The Middle East is undergoing reforms, reshaping geopolitics and economics, driven by green initiatives, trade, investment, and connectivity.\nIn contrast, South Asia remains mired in history and the bitter past, unable to move towards reconciliation, peaceful resolution of disputes, regional cooperation and connectivity, as well as economic integration. In addition, the dangerous impulses of the ‘Hindutva’ ideology are shaking the foundations internally in India and increasing the risks for peace and security in South Asia.\nWhile talking about Pakistan and the United States, Ambassador Sohail Mahmood stressed the longstanding friendship between the two partners. In this changing environment, it is increasingly becoming important to find new, stable anchors for the relationship that can help advance Pakistan’s economic development goals and enable a positive contribution to peace and security at the regional and international levels.\nHe concluded by saying that Pakistan must navigate this complex and rapidly transforming global and regional environment and make its way forward as it is a pivotal state in its own right. As a middle power, Pakistan has both the potential and the possibility of making a hugely positive contribution to regional and international peace, security and prosperity. In a nutshell, the task for Pakistan was to manage the complicated geopolitics and accentuate its pivot to geo-economics.\nDr. Andrew Wilder, Vice President of Asia Centre, USIP, in his remarks, stated that a lot of time is spent on focusing and prioritizing security over peace. The world is going through rapidly changing and worrying times with many serious threats and challenges with weak and fractured multilateral systems. The world is still reeling from the lingering effects of the Covid pandemic, the Russia and Ukraine crisis growing tensions between China and the US and the existential threats posed by climate change.\nAmbassador Asif Durrani, Pakistan’s Special Representative on Afghanistan during his address stated that Pakistan is at the crossroads of three major regions – South Asia, Central Asia and the Middle East – this geographical setting has added to the challenges for Pakistan including its relations with India, and the changing dynamics in Afghanistan.\nIn this regard Pakistan’s role becomes pivotal; Pakistan being at the front lines of the US War on Terror paid a tremendous cost in terms of lives – a cost completely ignored by the international community.\nAmbassador Durrani while talking about the regional dynamics in South Asia and the geographical setting of Pakistan opined that due to perennial tensions with India, difficult relations with Afghanistan and sanctions on Iran, trade in the region has remained a victim.\nHe concluded by saying that Pakistan and Afghanistan enjoy a symbiotic relationship and despite difficult patches in the relationship both the countries have stood strong together on various issues in the past. It is important for the international community and the world to not ignore and understand the current dispensation of power in Afghanistan and work on reconciliation steps.\nHowever, the most pivotal point is for the Afghans to understand that the key to the stability of Afghanistan is with them. Unless they do not bring normalcy to Afghanistan no outsider including Pakistan can do much. There are no governing spaces for the Tehrik-i-Taliban Pakistan (TTP) in Pakistan and any threat will be neutralized.\nAt the moment security issues in Pakistan are feeding into the prevailing economic woes. However, despite challenges on multiple fronts Pakistan is sustaining the pace against terrorism and moving ahead with resilience and resolve.",
  "retrievedAt": "2025-08-11T09:57:28.642Z"
}
