{
  "title": "Chiropractors provide drug-free back pain relief: Dr Arsalan",
  "link": "https://www.app.com.pk/national/chiropractors-provide-drug-free-back-pain-relief-dr-arsalan/",
  "date_published": "2023-10-05T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP): Chiropractors employ High-Velocity Low Amplitude Thrust (HVLA) manipulation technique to provide rapid pain relief along with improved mobility, flexibility and movability.\nTalking to APP here on Thursday, Dr. Arsalan Sajjad explained that chiropractic practice involves joint manipulation, mostly of the spine to grade five thrusts. He said this technique can also be applied to the wrist, ankle, foot and knee joints.\nHe said that during a chiropractic procedure, the joint is rotated to its maximum range of motion and then a quick, controlled force is applied. He explained that the cracking sound produced comes from gas bubbles bursting in the joint fluid and not by the bones themselves.\nHe said that chiropractic sessions must be performed by licensed professionals for safety and proper diagnosis should precede any chiropractic sessions. “Patients with advanced osteoarthritis are not recommended for chiropractic sessions and they should consult orthopaedic surgeons instead”, he added.\nDr. Arsalan outlined key differences between chiropractic care and physiotherapy saying that chiropractors focus on the spine and rapid manipulation while physiotherapists address a wider range of injuries providing long-term solutions through graded mobilization. He said that physiotherapists also utilize pain management techniques by mobilizing joints and muscles.\nFor conditions like pelvic tilt, he said that chiropractic relieves pain quickly but physiotherapy is needed to target muscles and restore normal alignment over time.\nDr. Arsalan emphasized that chiropractic provides instant relief for posture imbalance, sciatica, muscle spasms and related issues. He said that minor disc bulges and nerve impingement can often be treated successfully this way by avoiding surgery.\nHe advised MRI, x-ray and physical diagnostic tests to determine the issue and if uncontrolled urinary and bowel issues are present patients would probably need surgery.\nDr. Arsalan stated that while chiropractic is not magic when applied appropriately by certified practitioners it can bring fast relief from joint and spinal pain without drugs or surgery.\nHe advised the patients to have faith and when more than one session is advised. He also recommended investing in proper footwear, mattresses and pillows to maintain joint health.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:58:03.710Z"
}
