{
  "title": "Turkish classes start at NIHCR Quaid-i-Azam University",
  "link": "https://www.app.com.pk/national/turkish-classes-start-at-nihcr-quaid-i-azam-university/",
  "date_published": "2023-10-05T10:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 05 (APP):Turkish classes have been started in National Institute of Historical & Cultural Research (Center of Excellence) Quaid-e-Azam University, Islamabad with the collaboration Yunus Emre Institute Turkey.\nVice-Chancellor, Quaid-e-Azam University Islamabad Prof. Dr. Niaz Ahmad Akhtar, formally inaugurated the classes in ceremony held here yesterday.\nWhile addressing the students as Chief Guest, teachers and scholars, VC QAU expressed his happiness and determination and said that the cultural, civilizational and historical development between Pakistan and Turkey will be enhanced by the promotion of Turkish language.\nHe said the main objective of educational institutions is to make students skilled, responsible and civilized citizens.\nHe said the educational institutions have to expose them to education compatible with modern sciences and arts, so that they can cope with the modern world.\nDr Niaz Akhtar further said the language is the guarantee of cultural identity and survival of any region and an important and reliable source of understanding its culture and lifestyle.\nOf course, he said, proficiency in the Turkish language will be helpful in improving students’ academic and research skills, and in familiarizing them with modern global trends.\nHe also praised the services of the National Institute of Historical & Cultural Research (Center of Excellence) Quaid-e-Azam University, and said that it is an important historical institution as its publications and research efforts on the subject of history and culture are of great importance.\nMeanwhile addressing the event as Guest of Honor, Mohammad Aslam Dhariwal imparted knowledge to the students about Islamic history, Turkish culture and language and urged them to learn the basic lesson of greatness in hard work.\nDr. Sajid Mahmood Awan, Director National Institute of Historical & Cultural Research (Center of Excellence) Quaid-e-Azam University, and spoke on the impact of Turkish culture and language on the region and on the centenary of the end of the Ottoman Caliphate.\nAt the end of the ceremony, the Vice-Chancellor Prof. Dr. Niaz Ahmad Akhtar started plantation drive by sapling the pine tree donated by Ali Ranjha Ratwal and Muhammad Aslam Dhariwal in the garden of NIHCR.",
  "retrievedAt": "2025-08-11T09:57:54.582Z"
}
