{
  "title": "Pakistan, Bahrain reiterate desire to expand bilateral cooperation",
  "link": "https://www.app.com.pk/national/pakistan-bahrain-reiterate-desire-to-expand-bilateral-cooperation/",
  "date_published": "2021-11-18T13:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Pakistan and Bahrain on Thursday reiterated their desire to further promote and expand bilateral cooperation in various areas of mutual interest.\nIn a meeting between President Dr Arif Alvi and the visiting parliamentary delegation of Bahrain, the two sides emphasized the need to further improve trade, economic and political relations.\nThe delegation was led by the Speaker of the Council of Representatives of Bahrain, Fawzia Bint Abdulla Zainal.\nWelcoming the delegation, the president said that Pakistan and Bahrain enjoyed excellent relations in various fields which were based on common bonds of religion and culture.\nHe highlighted that Pakistan had great potential for exports in agriculture, food items, livestock, fisheries and surgical instruments to Bahrain and the volume of trade between the two sides needed to be enhanced.\nHe added that Pakistan was an attractive destination for foreign investors as it offered enormous trade and investment opportunities and the business community of Bahrain required to benefit from these opportunities.\nThe president also underlined the need to make collective efforts by both the brotherly countries to counter the challenge of Islamophobia.\nHe also shed light on the atrocities being committed by the Indian security forces in the Illegally Occupied Jammu and Kashmir and urged the international community to play its role in resolving the long outstanding dispute in accordance with UN Security Council resolutions.\nPresident Alvi reiterated the invitation to King Hamad bin Isa Al Khalifa and the Crown Prince Salman bin Hamad Al Khalifa to visit Pakistan.\nHe deeply thanked the Government of Bahrain for establishing King Hamad University of Nursing and Associated Medical Sciences in Islamabad.\nFawzia Bint Abdulla Zainal said that both countries enjoyed good relations and supported each other at international fora.\nShe emphasised the need to further broaden bilateral cooperation between the two brotherly countries.\nShe also conveyed warm regards from the King and the Prime Minister of Bahrain to the President.",
  "retrievedAt": "2025-08-11T21:37:47.235Z"
}
