{
  "title": "Pakistan strongly condemns extra-judicial killing of five Kashmiris in IIOJK on Nov 17",
  "link": "https://www.app.com.pk/national/pakistan-strongly-condemns-extra-judicial-killing-of-five-kashmiris-in-iiojk-on-nov-17-5/",
  "date_published": "2021-11-18T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Pakistan on Thursday strongly condemned the extra-judicial killing of another five Kashmiris by Indian occupation forces in Kulgam area of Indian Illegally Occupied Jammu and Kashmir (IIOJK) on November 17.\nThe Indian occupation forces have martyred at least 30 Kashmiris in fake encounters or so called “cordon and search operations” since 1st October 2021.\nThe Foreign Office said the killing spree of innocent Kashmiris perpetuated by Indian occupation forces continues with shameless impunity.\nIt further exposes the unspeakable violence being perpetrated by the “Hindutva” inspired extremist BJP-RSS combine that has turned IIOJK into an inferno where no one, not even innocent civilians, professionals, women, children and elderly are safe from the state-terrorism of the occupation forces, it added.\nThe FO condemned the inhuman and callous practice of the Indian occupation forces of not handing over the mortal remains of the martyred Kashmiris to their families in many instances.\n“Usurping the fundamental rights of Kashmiri families by denying them the right of proper burial of martyrs further exposes the current Indian government’s moral bankruptcy,” it said.\nThe FO said the killings of Kashmiri civilians by Indian occupation forces also vindicates the irrefutable facts provided by Pakistan recently in a comprehensive dossier exposing human rights violations and war crimes committed by Indian occupation forces in IIOJK.\nIt said that Pakistan called on the international community to take immediate notice of the Indian state-terrorism in IIOJK and hold India accountable for the egregious human rights violations of the innocent Kashmiri people.\n“Pakistan also urges the international community to play its role for a just and peaceful resolution of the Jammu and Kashmir dispute in accordance with the relevant UNSC resolutions and wishes of the Kashmiri people for durable peace and stability in the region,” it said.",
  "retrievedAt": "2025-08-11T21:37:47.012Z"
}
