{
  "title": "Pakistan, Bahrain for constructive engagement to avert humanitarian crisis in Afghanistan",
  "link": "https://www.app.com.pk/national/pakistan-bahrain-for-constructive-engagement-to-avert-humanitarian-crisis-in-afghanistan/",
  "date_published": "2021-11-18T17:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): The Speaker of Council of Representatives of Bahrain Fawzia Bint Abdullah Zainal Thursday called on Prime Minister Imran Khan here wherein the two sides called for a constructive engagement of the international community and collective response to avert humanitarian crisis in Afghanistan.\nHighlighting the serious humanitarian situation in Afghanistan, the prime minister urged constructive engagement of the international community and urgent measures to prevent the looming humanitarian crisis in the face of serious economic challenges in Afghanistan.\nDuring the meeting with the Speaker, who was accompanied by a parliamentary delegation, the prime minister also stressed the need for unfreezing of Afghanistan’s financial assets.\nThe Speaker agreed with the prime minister for a constructive and collective response of the Islamic world to the situation in Afghanistan, and support for the Muslim causes.\nThe prime minister warmly welcomed the Speaker and her delegation.\nThe Speaker expressed gratitude for the hospitality accorded to the delegation and conveyed earnest regards to the prime minister from the leadership of the Kingdom.\nShe stressed that her visit was a reaffirmation of long and historic fraternal ties of the two countries.\nRecalling continued and close cooperation, bilaterally as well as at multilateral fora, the Speaker expressed desire to further strengthen mutual collaboration, in particular in the fields of trade, commerce and investment.\nLauding the contributions of a sizeable Pakistani Diaspora in Bahrain, the Speaker termed Pakistanis in Bahrain as kin of the Bahraini people.\nReciprocating the warm sentiments of the Bahraini leadership, the prime minister reiterated his invitation to the King and the Crown Prince of Bahrain to visit Pakistan.\nHe expressed special gratitude to the leadership of Bahrain for the care afforded to the 120,000 strong Pakistani diaspora, in particular during the testing times of the global pandemic.\nThe prime minister reaffirmed Pakistan’s desire to forge closer ties with the Kingdom in all facets of cooperation.\nApprising the visiting dignitary on the ongoing and egregious human rights violations in the Indian Illegally Occupied Jammu and Kashmir (IIOJK), the prime minister stressed the need for the international community, in particular the Muslim world, to raise its voice for the protection of the fundamental rights of the Kashmiri people.\nHe also highlighted Islamophobia as the leading issue faced by Muslims globally, and emphasized the importance of unity and solidarity among the Ummah to tackle such issues collectively.\nThe Speaker of the Council of Representatives of the Kingdom of Bahrain along with her delegation is visiting Pakistan from November 17-21, 2021 on the invitation of the Speaker of the National Assembly.",
  "retrievedAt": "2025-08-11T21:37:44.993Z"
}
