{
  "title": "Special powers being given to Rangers, Police, FC: Sheikh Rasheed",
  "link": "https://www.app.com.pk/national/special-powers-being-given-to-rangers-police-fc-sheikh-rasheed/",
  "date_published": "2022-03-16T07:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP):Interior Minister Sheikh Rasheed Ahmed on Wednesday said special powers were being given to Police, Rangers and Frontier Constabulary (FC) in federal capital from March 20 to April 2.\nTalking to media persons after workshop on Anti Human Trafficking organized by the United Nations here, the minister said Police, Rangers and FC have full capability to deal with any untoward situation.\nHe said around 1000 personnel of FC and Rangers have been summoned to Islamabad for performing security duty adding that if needed more personnel would be deployed to ensure law and order situation.\nSheikh Rasheed said the government would provide full security and protection to both rallies of March 25 and March 27. Ensuring protection to lives and properties of the people were the responsibility of Interior Ministry, he added.\nHe said if the opposition wished to hold rally on March 27 then they should meet Deputy Commissioner Islamabad for devising its modalities. The administration would provide safe passage to the opposition rally, he added.\nHowever, he reiterated that no one would be allowed to take law into their hands and violators would be dealt with iron hands.\nThe minister said Pakistan was facing international threats of terrorism adding that maintenance of peace and countering terrorism was not only responsibility of the government but also the opposition.\nRegarding no confidence motion against the Prime Minister, he said there would be no assembly session on March 27 due to Sunday. Full protection would be given to all people, he added.\nHe regretted that Maulana Fazlur Rehman was dragging the country towards anarchy. He cautioned Maulana Fazlur Rehman that PPP and PML-N would escape and you (Maulana) would be trapped. Maulana Fazlur Rehman was playing the role of Mola Jaat, he remarked.\nRasheed said PM Imran Khan would become stronger after March 25 and his popularity has increased manifold in recent weeks. As per his political wisdom, Imran Khan would be a winner, he said.",
  "retrievedAt": "2025-08-11T14:32:49.581Z"
}
