{
  "title": "NAB authorizes conducting 11 inquiries, two investigations against corrupt elements",
  "link": "https://www.app.com.pk/national/nab-authorizes-conducting-11-inquiries-two-investigations-against-corrupt-elements/",
  "date_published": "2022-03-16T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): The Executive Board Meeting (EBM) of National Accountability Bureau (NAB) chaired by its chairman Justice Javed Iqbal authorized conducting 11 inquiries and two investigations against various personalities on allegations of looting public exchequer.\nAccording to NAB spokesman, the EBM authorized conducting inquiries against various personalities included Messers ACE Group (ACE marketing group, Pvt, ltd), ACE, Builders, PVT, Ltd and others, management of Utility Store Corporation,Officers, officials and others of Punjab Cooperative Board of Liquidation, Anjum Pervaiz, former senior General Manager, Pakistan Railways and others, officers,officials of Ministry of Housing and Works, officials, officers and others of State office, owners,\nsponsors of Shaukat Marvat Group of Companies, officers, officials and others of Forest department, Javed Memon, Chief Engineer, Irrigation Department, Larkana and others, Professor Ghulam Asghar Channa, Vice Chancellor and others of Shaheed Benazir Bhutto Medical University, Larkana, engineer Sardar Ali Shah, Project Director of Right Bank Outfall Drain, Hyderabad circle and others and inquiry was also authorized against Pritam Das, superintending engineer, Irrigation department, Govt of Sindh, Ali Muhammad, Contractor, AMB and Company, Pvt, Limited and others.\nNAB-EBM also authorized conducting two investigations against various personalities including Ghulam Haider Jamali, Former Inspector General, Police, Sindh, Karachi and others, officers/ officials of District Director, Agriculture, department, DI Khan and others.\nThe Executive Board Meeting okayed sending the complaint against Adam Khan Automobiles Pvt. Ltd. and others to IG Khyber Pakhtunkhwa for legal action.\nThe EBM authorized the closure of inquiries against CDA officers / officials and others and Mohammad Omar Work, former Superintendent of Police, in accordance with the law.\nJustice Javed Iqbal, Chairman National Accountability Bureau said that NAB’s faith was corruption free Pakistan.\nNAB was pursuing a policy of accountability for all in accordance with the law. Mega corruption cases against big fish especially money laundering, fake accounts, assets in excess of income, illegal housing societies and the accused in the Mudaraba scandal should be brought to a logical conclusion in accordance with the law.\nHe said that over the last four years, the esteemed accountability courts have not only convicted 1,405 accused but also recovered Rs 584 billion directly and indirectly from corrupt elements in the last four years which is a record success.\nHe said that NAB was a national anti-corruption body. NAB always believes in performing its duties in accordance with the constitution and law.\nNAB does not belong to any political party, group or individual but only to the state of Pakistan.NAB was Pakistan’s focal point under the United Nations Convention against Corruption. In addition, NAB was the chairman of the SAARC Anti-Corruption Forum.\nNAB was the only organisation which has signed a memorandum of understanding (MoU) with China to oversee China-Pakistan Economic Corridor (CPEC) projects being completed in Pakistan, said the chairman NAB, adding, “This was an honour for Pakistan.”\nReputed national and International organizations like Transparency International Pakistan, World Economic Forum, PILDAT and Mishal Pakistan have also appreciated NAB’s performance. According to a survey of Gillani and Gallup Pakistan 59 people have confidence in NAB.\nThe meeting was attended by Deputy Chairman NAB,Zahir Shah, Prosecutor General Accountability, Syed Asghar Haider, Director General Operations, Hasnain Ahmed, Director General NAB headquarters, Irfan Mangi, Director General NAB Rawalpindi, Masood Alam Khan , DG Operations, and other senior officers of bureau.",
  "retrievedAt": "2025-08-11T14:32:46.165Z"
}
