{
  "title": "With huge public support, government to sail through current political situation: PM",
  "link": "https://www.app.com.pk/national/with-huge-public-support-government-to-sail-through-current-political-situation-pm/",
  "date_published": "2022-03-16T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Prime Minister Imran Khan on Wednesday said the huge public support would make his government sail through the current political situation.\nThe prime minister expressed these views in a meeting with the Members of National Assembly.\nThose who called on the prime minister included MNAs Makhdoom Zain Hussain Qureshi, Muhammad Ibrahim Khan, Tahir Iqbal, Aurangzeb Khan, Riaz Fatyana, Sardar Nasrullah Dareshak, Najib Haroon, Sardar Muhammad Khan Leghari, Asma Qadeer and Javeria Zafar.\nThe MNA from Sindh Saima Nadeem, Member Provincial Assembly Sindh Rabia Azfar, General Secretary PTI Mobin Jatoi and Arsalan Ghumman also called on the prime minister.\nFederal Ministers Shah Mehmood Qureshi, Makhdoom Khusro Bakhtiar, Syed Ali Zaidi and Special Assistant Malik Amir Dogar were also present in the meetings.\nThe parliamentarians congratulated the prime minister on the adoption of a resolution in the United Nations to prevent Islamophobia.\nThe prime minister said the government had raised its voice at every forum to eradicate Islamophobia.\nHe said the government’s efforts led to the support on the move against Islamophobia by world leaders, including Russian President Vladimir Putin and Canadian Prime Minister Justin Trudeau.\nPM Imran Khan congratulated the entire Muslim Ummah on the landmark  achievement of the passage of the resolution.\nThe prime minister said that PTI had always focused on the aspirations of the people.\nHe urged the members of the National Assembly to intensify public relations and mobilize the workers in their constituencies.\nThe meetings also discussed progress on development projects and political issues in the respective constituencies",
  "retrievedAt": "2025-08-11T14:32:45.528Z"
}
