{
  "title": "Adaptation of unanimous resolution against Islamophobia at UNGA great achievement of Ummah: Farrukh",
  "link": "https://www.app.com.pk/national/adaptation-of-unanimous-resolution-against-islamophobia-at-unga-great-achievement-of-ummah-farrukh/",
  "date_published": "2022-03-16T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Minister of State for Information and Broadcasting Farrukh Habib said on Wednesday that it was great achievement of entire Muslim Ummah that  the UN General Assembly unanimously passed a resolution against Islamophobia moved by Pakistan’s permanent representative on behalf of OIC and decided to observe  March 15 International Day for Combating Islamophobia every year.\nAddressing a press conference here, the minister said that Prime Minister Imran Khan always raised the issue of Islamophobia, at international forums on behalf of 1.5 billion Muslims and conveyed that  Islam was a religion of peace and has nothing to do with terrorism.\nHe said Prime Minister Imran Khan forcefully presented the case of Muslim population and highlighted its sensitivities. He said the very voice of Imran Khan is heard and given importance at the international level.\nThe minister said during the Organization of Islamic Cooperation (OIC) in Mecca in 2019, Prime Minister Imran Khan spoke on Islamophobia and the dignity and honour of the Holy Prophet.\nFarrukh said that in his address to the UN General Assembly in September 2019, Prime Minister Imran Khan raised the issue of Islamophobia and honour of prophethood before the world.\nThe minister said that due to the hatred spread against Muslims through Islamophobia Muslims were targeted in the world, the attack inside a mosque in New Zealand and Hijab ban in India and attack on Muslim women in the West were its manifestation.\nHe said that during the OIC meeting in 2020, our Foreign Minister Shah Mehmood Qureshi demanded that March 15 should be declared as the International Day for Combating Islamophobia, Farrukh Habib said that the credit goes to PM Imran Khan for declaring March 15 as International Day of Islamophobia who time and again raised the issue at all relevant global forums.\nAs a true lover of the Holy Prophet, being a true Muslim, Imran Khan fought the case of Islam in front of the world which finally realized the truth of his words.\nWest in the past was not ready to listen but thanks to the efforts of the Prime Minister Imran Khan today they have supported the position of Imran. He said that Russian President Putin raised his voice against Islamophobia, a resolution was also tabled in the US House of Representatives.\nHe said that the past rulers used to adopt apologetic attitude and could not convey the sentiments of Muslims about the Holy Prophet before the world community but after becoming the Prime Minister, Imran Khan gave up his apologetic attitude.\n“Prime Minister Imran Khan will continue to represent the sentiments of Muslims of the entire world”, he said.\nHe criticized Fazlur Rehman, who he said was indulged in character assassination of the PM terming him as western agent which was contrary to the facts.\nTaking a jibe on so-called religio-political parties doing politics in the name of Islam, he said that objective of their politics was Islamabad not Islam.\nThe world pays attention to Imran Khan’s words, we have to do more work on Islamophobia, Farrukh Habib said adding that ever since Imran Khan became the Prime Minister, he has exposed the oppression of humanity all over the world, including Kashmiris. He cited the example of Pakistan hosting the OIC meeting on Afghanistan.\nForeign ministers of 57 countries will be present in Pakistan on March 22-23 and on this occasion everyone needs to adopt national thinking and stop getting political mileage.\nReplying to a question ,he said Peaceful political activity, he said was the beauty of democracy and the PTI government has always allowed such activities.",
  "retrievedAt": "2025-08-11T14:32:45.730Z"
}
