{
  "title": "COVID-19 restrictions removed as positivity ratio declines: Asad Umar",
  "link": "https://www.app.com.pk/national/covid-19-restrictions-remove-as-positivity-ratio-declines-asad-umar/",
  "date_published": "2022-03-16T10:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 16 (APP): Federal Minister for Planning, Development and Special Initiatives, Asad Umar on Wednesday said that all restriction, which were imposed to curb the spread of COVID-19 pandemic in the country has been removed, besides expediting the vaccination campaign to provide vaccine cover to 100% population.\nAddressing a press conference along with Adviser to Prime Minister on Heath Dr. Faisal Sultan at National Command and Operation Center (NCOC), Asad said that decision to lift restriction was taken after witnessing the continued decline in COVID positivity ratio in last 8 weeks.\nBesides, he said that the number of hospitalized patients reduced, where as the numbers of critical patients also reduced, adding that the number of critical patients start reducing since October, 2020 and was recorded at the lowest level.\nThe minister said that due to the continues efforts of the government vaccination campaign across the country was on with full swings, adding that overall 87 percent citizen above age of 12 year had been provided 1st doze of vaccine.\nHe further informed that 70 percent of local population were provided full vaccine cover, adding that efforts on to bring 100 percent population under vaccine cover to end the pandemic from the country that would benefit socially and economically.\nAsad said that currently fully vaccinated people were allowed for air traveling, adding that this restriction would also be removed after achieving about 80 to 85 percent vaccination targets to avert the harmful impact of virus.\nThe minister further informed that NCOC would continue monitoring the situation on daily basis and recommend the remedial measures in case of any emerging situation for immediate and prompt action.He also congratulated all the department concerns and their efforts to control the spread of virus in the country.\nHe also thanked health worker especially lady health workers who played key role and remained on front line to provide their services to overcome this pandemic.\nHe said that the disease was ending but not ended and called for taking second doze of vaccine as soon as possible to further step forwarding to end the pandemic.",
  "retrievedAt": "2025-08-11T14:32:48.242Z"
}
