{
  "title": "Thai university announces undergraduate scholarships in economics",
  "link": "https://www.app.com.pk/national/thai-university-announces-undergraduate-scholarships-in-economics/",
  "date_published": "2024-05-07T07:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP):The Faculty of Economics of Chulalongkorn University, Thailand has established the “Undergraduate Scholarship Program for International Students” to provide financial assistance to qualified non-Thai students who wish to study in Thailand through the competitive international EBA program.\nAccording to the Higher Education Commission (HEC), the EBA program is Thailand’s most important and innovative program in the field of economics.\n“With a vision to be an internationally competitive program that aims to produce economists who are highly qualified to contribute to society with ethical and social responsibility”, its primary objective is to produce outstanding undergraduates.\nTo fulfill its vision, the EBA program pursues the mission of equipping students with excellent and in-depth knowledge that meets international standards of excellence.\nIt was also intended to emphasize the development of basic competencies for lifelong learning, such as skills and personal attitudes, and to consider this as an integral part of a high-quality undergraduate education in economics.\nThe latest curriculum in the EBA program focuses on private-sector economics, a field that meets students’ general interests and career goals.\nMultilateral and bilateral exchange agreements with several leading institutions in the European Union and Asia have provided excellent opportunities for EBA students to study abroad for one or two semesters.\nThe EBA program was awarded the AUN-QA (ASEAN University Network Quality Assurance) certification in 2015.\nFurthermore, EBA is increasing the number of its partner institutions in every corner of the world. Our exchange number of incoming and outgoing students has been raised to promote an international atmosphere in the program, the sources added.\nFor further information regarding the funding, application procedure, deadline, and eligibility criteria please visit the below mentioned link http://www.eba.econ.chula.ac.th/about/eba.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:21:11.900Z"
}
