{
  "title": "SRO for wheat procurement issued during PTI Govt: Kakar",
  "link": "https://www.app.com.pk/national/sro-for-wheat-procurement-issued-during-pti-govt-kakar/",
  "date_published": "2024-05-07T17:38:00.000Z",
  "source": "APP",
  "content": "QUETTA, May 07 (APP): Former caretaker prime minister and Senator Anwar-ul-Haq Kakar on Tuesday said the allegations of corruption against the caretaker government regarding wheat procurement were baseless and contrary to the facts.\n“The procurement was conducted in accordance with prevailing laws and SROs (Statutory Regulatory Orders). The SRO for wheat procurement was issued during the Pakistan Tehreek-e-Insaf (PTI) government, and no additional permits were given by the caretaker setup,” he clarified.\nSenator Kakar, while talking to the media, noted that speculations in the media arose due to ignorance of national import policies and prevailing laws. Wheat procurement was conducted through a legal process where not even a single penny of corruption could be committed.\nHe regretted the media trial of the caretaker government on the basis of misinformation, which, he said, was due to a lack of knowledge and understanding of laws and procedures pertaining to government affairs.\nRegarding the procedure for wheat procurement from abroad, the former prime minister said, ‘It is carried out under wheat import policies and national laws. The relevant authority issues notifications and holds deliberations on taxation and other matters before final approval.”\nPakistan, he said, “produces around 27 million metric tons of wheat annually, with a shortfall of three to four million metric tons, which is addressed through its procurement following a formal legal process”.\nAfter the 18th Constitutional Amendment, he said, all the provinces sent their wheat requirement details to the Food Security and Research Department.\nHe said the Federal Government, based on the recommendations of the Economic Coordination Committee (ECC) and the provinces’ needs, “takes a decision regarding wheat procurement”.\nIn line with the recommendations of ECC during the PDM (Pakistan Democratic Movement) government, the caretaker government, under his command, facilitated the private sector to meet the requirement of ordinary citizens and mitigate the possibility of wheat shortfall in the country, he said while clarifying the “misconception about the wheat import”.\nThe SRO for wheat procurement was issued during the PTI government, and the caretakers did not gave any special approvals, he reiterated.\nIt was a legal matter which was being presented as illegal through baseless media trial and causing confusion, the former PM deplored.\nSenator Kakar criticized the media for creating stories based on speculation. “It is against the norms of journalism to report a story without any knowledge,” he lamented.\nHe said there was a dire need for a healthy debate in the media on the issues of national importance and their solutions.\n“We have stifled healthy debates on national issues and wasted our energy on tarnishing the image of the caretaker government by distorting the facts,” he deplored.",
  "retrievedAt": "2025-08-11T02:20:52.262Z"
}
