{
  "title": "PM assures resolution of issues facing Japanese businessmen within a week",
  "link": "https://www.app.com.pk/national/pm-assures-resolution-of-issues-facing-japanese-businessmen-within-a-week/",
  "date_published": "2024-05-07T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP):Prime Minister Shehbaz Sharif on Tuesday, while calling for enhanced Pakistan-Japan trade and investment cooperation, assured that the government would resolve the issues facing Japanese businessmen within a week through mutual collaboration.\nThe prime minister, in the meeting with a delegation of Japanese companies and business figures in Pakistan led by Japanese Ambassador Wada Mitsuhiro, said a committee had been formed to resolve the issues confronting the Japanese firms to promote their business activities in the country.\nHe told the delegation that the Japanese companies should exploit Pakistan’s existing immense potential for investment in the industry of electric vehicles.\nPrime Minister Shehbaz said that being time-tested friends, the trade relations between Pakistan and Japan spanned over decades.\nHe said it was high time both countries promoted trade and investment ties in multiple sectors, reiterating the resolution of problems facing Japanese industrialists and traders.\nThe delegation members expressed confidence in the Government of Pakistan’s pro-business policies and measures to promote investment.\nThe Japanese ambassador apprised the prime minister of the upcoming visit of a 20-member delegation of renowned Japanese firms which would prove to be a milestone in enhancing the bilateral trade and investment.\nThe delegation members viewed that a special focus on investment and pro-business policies of Prime Minister Shehbaz-led government would help enhance the confidence of foreign investors, besides increasing the country’s exports.\nThe prime minister was told that the Japanese firms had started preparations for manufacturing of hybrid vehicles in Pakistan which was lauded by the prime minister.\nThe representatives of different Japanese firms, while briefing the prime minister about their business activities in Pakistan, said that they were also exporting goods from Pakistan after value addition.\nFederal ministers Jam Kamal Khan, Muhammad Aurangzeb, Rana Tanveer Hussain and Abdul Aleem Khan, Minister of State Shaza Fatima Khawaja, Chairman of Federal Board of Revenue and relevant senior officers attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:21:40.648Z"
}
