{
  "title": "Mashhood discusses PM’s Youth Loan Scheme with SBP",
  "link": "https://www.app.com.pk/national/mashhood-discusses-pms-youth-loan-scheme-with-sbp/",
  "date_published": "2024-05-07T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 07 (APP):The Chairman of the Prime Minster Youth’s Programme (PMYP) Rana Mashhood Ahmed Khan on Tuesday convened a high-level meeting with representatives from the State Bank of Pakistan (SBP) and partner banks to discuss the progress and plans regarding the Prime Minister’s Youth Business Loan Scheme (PMBLS) and the establishment of E-Rozgar Centers across Pakistan.\nThe meeting served as an opportunity to review the achievements of the loan scheme and explore collaborative strategies to empower youth entrepreneurship in the country further.\nThe PMBLS, a flagship initiative of the Prime Minister’s Youth Programme, has successfully disbursed Rs 84.6 billion to youth across Pakistan, providing them with vital financial support to pursue their entrepreneurial ventures in just one year of its relaunch.\nNotably, among the beneficiaries, 16,000 are women, reflecting the programme’s commitment to gender inclusivity and empowerment.\nDuring the meeting, participants engaged in constructive discussions on the effectiveness of the loan scheme and explored ways to enhance its outreach and impact.\nEmphasis was placed on streamlining processes, improving accessibility, and addressing the evolving needs of young entrepreneurs.\nFurthermore, the meeting delved into the formation of E-Rozgar Centers across Pakistan, which are envisioned to serve as catalysts for youth empowerment and employment generation in the digital era.\nThese centres will provide training and resources to equip young individuals with the necessary skills to thrive in the online marketplace, thereby enhancing their employability and entrepreneurial potential.\n“The Prime Minister’s Youth Programme remains committed to fostering a conducive environment for youth entrepreneurship and innovation,” said the Chairman of PMYP.\n“Our partnership with the State Bank of Pakistan and other financial institutions is instrumental in realizing this vision, and together, we will continue to empower the youth of Pakistan to realize their full potential.”\nThe meeting concluded with a renewed commitment to collaboration and innovation in advancing youth entrepreneurship and employment opportunities in Pakistan.\nThe participants expressed optimism about the transformative impact of the Prime Minister’s Youth Programme initiatives and pledged to work closely to ensure their continued success.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:21:33.784Z"
}
