{
  "title": "UK police close Shahzad Akbar acid attack probe for finding no suspects: Report",
  "link": "https://www.app.com.pk/national/uk-police-close-shahzad-akbar-acid-attack-probe-for-finding-no-suspects-report/",
  "date_published": "2024-05-07T06:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 07 (APP): The UK police have shut down a probe into a reported acid attack on former Assets Recovery Unit (ARU) head Shahzad Akbar after finding no suspects during an around six-month-long investigation, according to a media report published Tuesday.\n“We have explored all lines of enquiry and have not been able to identify any suspects,” the report quoted a police source linked with counter-terrorism policing.\nCalling it an extremely complex investigation, the Hertfordshire Constabulary said, “Since November, officers have been working hard to try and trace those involved. On this occasion, we have explored all lines of enquiry and have not been able to identify any suspects. Incidents of this nature are thankfully rare in Hertfordshire and the safeguarding of any victim remains our priority. Should any new information come to light, we will act on this accordingly.”\nThe media report also quoted an intelligence source confirming that the investigation has been closed after no suspects were found during the “dedicated investigation” marking the review of several hours of footage including the entry and exit points of the local area in Royston. The decision to close the investigation was made after the forensics didn’t create any headways and no clues were found, it added.\nIn November last year, the Herts police said they were contacted by the ambulance service just before November 26, 2023 at 4.45pm on Sunday to reports of an assault in Royston. “It is believed an acidic solution was used. A 44-year-old man received hospital treatment and has now been discharged. Safety of any victim is paramount and we believe this is an isolated incident,” the police had said.\nAccording to the media report, Imran Khan’s former advisor holds evidence and documents in the £190 million corruption case. He took away these state-owned papers and refused to cooperate with the inquiry. The Cabinet Division had also sent him a letter asking questions about his role in the £190 million properties settlement case and Imran Khan and Bushra Bibi’s Al-Qadir Trust case.",
  "retrievedAt": "2025-08-11T02:20:50.940Z"
}
