{
  "title": "UNESCO Urges Strengthening Independent Environmental Journalism to Combat Climate Change Disinformation",
  "link": "https://www.app.com.pk/national/unesco-urges-strengthening-independent-environmental-journalism-to-combat-climate-change-disinformation/",
  "date_published": "2024-05-07T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 07 (APP): UNESCO Islamabad, in collaboration with Fatima Jinnah Women University, convened a significant event in connection with World Press Freedom Day (WPFD) on Tuesday at the university premises.\nAttended by over a hundred participants including civil society, youth, media professionals, academia and diplomatic missions, the event emphasized the critical role of independent environmental and scientific journalism in addressing climate change issues.\nThis year’s WPFD theme, “A Press for the Planet: Journalism in the face of the Environmental Crisis,” underscored the pivotal role media can play in combating the climate crisis, both globally and in Pakistan, says the press release.\nThe event highlighted the pressing need to bridge the gap between climate change information and journalistic reporting on environmental issues, stressing the importance of reliable, fact-based reporting in fostering societal change to fight disinformation.\nAntony Kar Hung Tam, Officer in Charge of UNESCO Islamabad, emphasized, “The information ecosystem holds the key to addressing this existential crisis. In an era marked by the exponential growth of digital platforms, access to reliable information and the strengthening of independent environmental and scientific journalism have become more crucial than ever.”\nWhile discussing the need to increase climate change reporting, Prof. Dr. Uzaira Rafique, Vice Chancellor of Fatima Jinnah Women University, emphasized the necessity for credible and research-based news stories to strengthen climate change reporting in the country.\nPakistan has long grappled with the devastating impacts of climate change, with incidents such as floods affecting millions of lives. Despite governmental efforts, climate change media reporting within the country often lacks prioritization. Moreover, there exists a visible gap between the abundance of academic or scientific studies on climate change and the limited media attention it receives.\nRecognizing the importance of integrating the voices of youth in climate change narratives, young scholars who recently finished their academic research on climate change reporting shared that climate change content on digital platforms is limited due to various reasons including their search algorithms and lack of consistent reporting on these issues.\nThe seminar engaged a diverse group of experts to explore avenues for enhancing credible and fact-based information dissemination on climate change.\nMoving forward, UNESCO reaffirms its commitment to safeguard the safety of journalists, and support access to information to ensure that free and pluralistic information can help citizens in protecting democracies and our planet.",
  "retrievedAt": "2025-08-11T02:21:41.557Z"
}
