{
  "title": "ONIC announces partnership with foodpanda to expand digital lifestyle ecosystem",
  "link": "https://www.app.com.pk/national/onic-announces-partnership-with-foodpanda-to-expand-digital-lifestyle-ecosystem/",
  "date_published": "2024-05-07T14:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 7 (APP):ONIC, Pakistan’s first digital telecommunication brand, dedicated to enhancing the lives of its consumers announced a partnership with foodpanda, the country’s premier online delivery platform.\nThis collaboration marks a significant milestone in Onic’s journey to enhance its digital offerings and create a comprehensive digital lifestyle ecosystem for its users, said a news release.\nThrough this partnership, Onic aims to integrate foodpanda’s robust delivery services into its existing digital platform, providing customers with seamless access to a diverse range of culinary options at their fingertips at greater prices.\nBy leveraging foodpanda’s extensive network of restaurants and delivery capabilities, ONIC will empower users to order food and groceries conveniently with the vouchers provided.\nThe partnership was solidified between Omer Bin Tariq, Head of Pakistan for ONIC and Muntaqa Peracha, CEO, foodpanda.\nCommenting on the partnership, Hatem Bamatraf, President and Group CEO, PTCL & Ufone 4G, said, “We are excited to join hands with foodpanda to elevate the digital lifestyle experience for our customers. Pakistan’s market is rich with space to grow in and provide unparalleled services to our consumers. With this partnership, we are only delivering on the promise of a truly digital brand. While our core is digital telecommunication services, we want to also communicate to our consumers that we think of their everyday ease and needs. This is one of the first steps to providing a digital lifestyle brand to consumers in Pakistan.”\nMuntaqa Peracha, CEO, foodpanda, expressed enthusiasm on the collaboration and stated, “We are thrilled to partner with onic to enhance our customers’ digital experience. This collaboration marks a significant milestone in the growth of digital services in Pakistan. With onic onboard, we aim to create a more robust and comprehensive approach to reaching and serving our consumers, ensuring a bigger and better experience for all.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:21:57.493Z"
}
