{
  "title": "Gilgit Baltistan is shinning face of Pakistan: Firdous Ashiq Awan",
  "link": "https://www.app.com.pk/national/gilgit-baltistan-is-shinning-face-of-pakistan-firdous-ashiq-awan/",
  "date_published": "2020-01-11T03:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP):Special Assistant to Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan on Saturday said that Gilgit Baltistan is shinning face of Pakistan.\nAddressing an audience at Pakistan National Council of Arts (PNCA) she said that Prime Minister of Pakistan’s narrative linked with tourism is a strategy to market the face of Gilgit Baltistan.\nPrime Minister Imran Khan wants to bring your enlightened, moderate and progressive face before the world, said Fidous Ashiq Awan while addressing the audience as chief guest at “Mystical Musical Colors of Karakoram” at PNCA Auditorium, Islamabad.\nShe said the government aims to preserve, protect and present the potential of Gilgit-Bailstistan to the world while seeking tourist’s attention towards to the untouched beauty of the area.\nAdmitting that the people of the area are still deprived of their basic fundamental rights guaranteed in the constitution, she assured the crowd that it is the top most priority of Prime Minster Imran Khan to empower the people Gilgit Baltistan.\n“People of Gilgit baltistan are defense shield of Pakistan and their sacrifices for the country are written in the history with golden words” she said.\nAppreciating the support of Italian Ambassador to Pakistan Stefano Pontecorvo to the Burushaski research academy for their work to promote the culture of Gilgit Baltistan, she said that The artists, vocalists and singers from the area are the true ambassadors of Pakistan.\nShe said that Pakistan is a land of opportunity and full of capabilities but only challenge is that there is lack of opportunities for the people, however the government is making efforts to create opportunities.\n“Let me appreciate your role as one of the helping partner as one of the donor and you have really given your all best possible assistance support and grant for this organization”, she said.\nAbout Burushaski research academy, Firdous Ashiq Awan said that the academy is spreading a message of love for humanity through their tremendous work.\nShe said humanity is above than religion and our Prophet (PBUH) was a champion of human rights who gave a message of love for humanity.\nShe further said that God created a system of punishment and reward right after creating a human being to make him a complete man so everybody has to pass through the process of punishment and reward.\nAll the problems and challenges, a common man is facing at the moment are temporary, said Firdous adding The future is bright after passing this temporary phase.",
  "retrievedAt": "2025-08-11T18:36:28.260Z"
}
