{
  "article_id": "2025-01-15_ba6d128ed809684933aa0f1333de1db8",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885200/saudi-al-rajhi-takes-dakar-lead-as-al-attiyah-wins-stage-nine",
    "retrieved_at": "2025-10-12T00:51:49.235Z"
  },
  "metadata": {
    "title": "Saudi Al-Rajhi takes Dakar lead as Al-Attiyah wins stage nine - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-15T01:03:56.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6786d84f817e5.jpg",
    "categories": [],
    "word_count": 455,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "HARADH: Qatari Nasser Al-Attiyah hit the gas on Tuesday to win stage nine of the Dakar Rally as Saudi Yazeed Al-Rajhi took the lead in the drivers' standings. South African Henk Lategan was dethroned having dominated the standings since stage two and is now 7min 09sec behind the Saudi driver with three days to go. \"It was a messy, messy, messy day for us but it's not the end of the world, we're still in it,\" said Lategan. Five-time champion Al-Attiyah covered the 357km special between Riyadh and Haradh in 2hr 52min 59sec, to keep in touch with a sixth Dakar title. \"It was a good stage. I can be happy with the result. There are three days left, we really have to focus, everything is open,\" said Dacia driver Al-Attiyah, who is fourth over 25 minutes behind Al-Rajhi. The Qatari finished 2min 47sec ahead of Belgian Guillaume de Mevius' Mini and 3min 12sec ahead of Al-Rajhi's Overdrive. \"We did a great job like we planned to,\" said Al-Rajhi. \"It won't be easy, but we will fight to the end. Everything is going well for us.\" Having had to open the road following his victory in stage eight, Lategan crossed in his Toyota 11th on the day, 16min 2sec off the pace. \"It's a bit of disaster to be honest,\" said Lategan. \"It was really a mess, about 13 km in and we got lost. We thought we missed the way point but we actually had it. It wasn't great and when we got lost we got one puncture and then towards the end, we got another one and the wheel is actually flat.\" Swede Mattias Ekstrom (Ford) is third overall at 24min 50sec, less than a minute ahead of Al-Attiyah. BENAVIDES ON THE DOUBLE On the bikes, Argentine Luciano Benavides (KTM) claimed his second straight stage win as Australian Daniel Sanders finished third to hold the overall category lead. KTM's Benavides finished 1min 54sec ahead of French driver Adrien Van Beveren (Honda) after the 357m special. Sanders crossed in third 3min 4sec off the pace to extend his lead on second-placed Spaniard Tosha Schareina (Honda) to 14min 45sec. Benavides started first after winning the eighth stage and opened the road, also benefitting from a bonus of 4min 51sec for a time of 3hr 15min 38sec. The 29-year-old Argentine achieved the fifth Dakar stage win of his career and is now fourth overall, 27min 44sec behind his team-mate Sanders. \"Honestly, it was super hard to open,\" said Benavides. \"There were many points with tricky navigation. It wasn't easy but I'm really happy with the rhythm I had opening because today I had to pay extra attention to the notes.\" Published in Dawn, January 15th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}