{
  "article_id": "2025-01-15_f6d3e470c6a96e437c18cc07dd833d6f",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1931280/no-change-in-national-leadership-army-chief-says-in-first-interview-to-media",
    "retrieved_at": "2025-10-12T01:12:27.336Z"
  },
  "metadata": {
    "title": "‘No change in national leadership,’ army chief says in first interview to media - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-08-16T16:33:51.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 647,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "Chief of Army Staff (COAS) Field Marshal Asim Munir has personally dismissed speculation about changes in the presidency and premiership as the work of elements conspiring against the ruling setup, in remarks quoted on Saturday by a local newspaper. Suhail Warraich, senior editor for the Daily Jang newspaper, wrote today that the army chief had spoken to him in person on the matter during a recent meeting between the two in Brussels. Field Marshal Munir had stopped over in Belgium on his return from last week's visit to the United States. \"The talk started with politics, especially on rumours that there is some effort to change the president of Pakistan as well as the prime minister. Field Marshal Munir clearly said, during both the Brussels gathering and in his two-hour discussion with me, that the rumours about a change were completely false,\" the column said. \"When informed that this 'news' had been circulated by both civil and military agencies, he [Field Marshal Munir] said this could not be possible. 'In fact, there are elements behind this who oppose both the government and the authorities and wish to create political anarchy,'\" the army chief was quoted as saying. Last month, speculation was rampant that President Asif Ali Zardari may soon step down, potentially paving the way for the army chief to assume the country's presidency. The reports on social media had claimed that work was underway to replace the current parliamentary system with a presidential form of government. Some reports had also claimed that President Zardari had set one condition for his exit - a key role for his son Bilawal Bhutto-Zardari in the new dispensation. The rumours were summarily addressed and rubbished by Interior Minister Mohsin Naqvi twice and by military spokesperson Lt Gen Ahmed Sharif Chaudhry as \"nonsense\". Field Marshal Munir was also reported as saying on stage at the Brussels gathering that: \"God has made me protector of the country. I do not desire any position other than that.\" The army chief praised the prime minister and his 18-hour work streak, the federal cabinet and the government, especially their \"determination and courage\" during the May conflict with India. \"On a question about politics, he [the army chief] said that political reconciliation is possible only if there is a sincere apology,\" the column read. Although it does not specify who the army chief was referring to or who the question was about, it can be inferred that he may have been referring to the PTI and its incarcerated leader. The military considers the PTI the \"planners and architects\" of the May 9 riots and in May 2024, demanded an apology from Imran Khan, who in turn claimed that the army owes an apology to him since he was \"abducted\" by the Rangers on May 9. However, days later, he offered to apologise on the condition that the involvement of PTI supporters in the violent protests was proved through CCTV evidence. Scores of PTI leaders have recently been convicted in cases over the riots and disqualified. On foreign relations, the army chief was said to have expressed confidence in maintaining equilibrium between the US and China. \"We will not sacrifice one friend for the other,\" Field Marshal Munir was quoted as saying. The army chief also described US President Donald Trump's efforts for peace as \"genuine\", and said Pakistan had taken the lead in nominating him for the Nobel Peace Prize, which was then followed by other nations. The column further said the army chief had warned India against destabilising Pakistan's peace through the use of \"proxies\", and also cautioned Afghanistan against \"pushing the Taliban into Pakistan\", or it would be met with a response. \"He said that we have shown kindness and favours to Afghans for years, but instead of repaying them, a conspiracy is being hatched against us in collaboration with India,\" the column read.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}