{
  "article_id": "2025-01-15_e1dc416b18480ba5343236443f0e6a65",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885237/sanjdi-coal-mine-rescue-operation-concludes-all-bodies-retrieved",
    "retrieved_at": "2025-08-26T07:42:36.366Z"
  },
  "metadata": {
    "title": "Sanjdi coal mine rescue operation concludes; all bodies retrieved - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-15T01:03:29.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 383,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "QUETTA: The bodies of all 12 labourers trapped at a depth of over 4,000 feet in a coal mine after a methane gas explosion have been retrieved following a six-day rescue operation. \"The last victim of the Sanjdi mine tragedy was recovered on Tuesday morning, from a depth 3,000 feet deep in the mine,\" Chief Inspector of Mines Balochistan Ghani Baloch told Dawn, adding that the operation has been completed and a probe into the incident ordered after the mine is closed. Balochistan Chief Minister Sarfraz Bugti has ordered the suspension of a mines inspector posted in the Sanjdi coal mine field. The investigation into the incident has been assigned to the Chief Minister's Inspection Team, with an emphasis on adopting modern mining safety measures used worldwide in Balochistan's coal mines. Presiding over a high-level meeting on Tuesday, the chief minister expressed anger over the failure to implement standard safety measures in coal mining within the province and stressed the importance of ensuring regular inspections at all costs. CM orders probe, suspension of mines inspector The meeting discussed recent mining accidents in Balochistan, and a briefing was provided by the Mines and Minerals Development Department. The meeting was attended, among others, by KP Assembly's opposition leader Dr Ibadullah Khan, provincial Minister for Finance and Mineral Development Mir Shoaib Nosherwani, Principal Secretary Babar Khan, Special Secretary Mines Mohammad Farooq and PDMA DG Jahanzeb Khan. Referring to the recent mine accidents, the chief minister expressed concern over the recurring incidents, expressing dissatisfaction with the performance of inspection teams. He said there is no justification for inspectors not being able to access the mines due to security concerns. \"If concerned officials are unable to perform their assigned tasks, they should resign and go home,\" CM Bugti said, adding that clear accountability should be established for accidents and those responsible must be punished. He noted that the second accident at the same company in one year seemingly indicated negligence. He directed that the Rescue and Training Wing be equipped with the latest technology and instructed the Mines and Minerals Department to prepare a comprehensive proposal. CM Bugti also ordered that compensation for workers who died in accidents be paid promptly and that all mine workers be registered with the relevant authority. Published in Dawn, January 15th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}