{
  "article_id": "2025-01-15_54a362e1ae9145698e28d13d4ebf969a",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885230/yoon-a-no-show-as-court-begins-impeachment-trial",
    "retrieved_at": "2025-08-26T07:42:23.182Z"
  },
  "metadata": {
    "title": "Yoon a no-show as court begins impeachment trial - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-15T01:04:08.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/6786dfc1cab25.jpg",
    "categories": [],
    "word_count": 525,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "SEOUL: South Korea's constitutional court opened the impeachment trial of President Yoon Suk Yeol on Tuesday over his failed martial law bid, but quickly adjourned the first hearing after the suspended leader didn't show up. Yoon's Dec 3 power grab plunged South Korea into its worst political crisis in decades, after he directed soldiers to storm parliament in an unsuccessful attempt to stop lawmakers voting down his suspension of civilian rule. He was impeached soon after and suspended from duty, but has gone to ground in his residence since, refusing summonses from investigators probing him on insurrection charges and using his presidential security team to resist arrest. The trial's first of five hearings lasted just minutes with Yoon not in attendance. Although his failure to attend - which his team have blamed on purported safety concerns - forced a procedural adjournment, the hearings will continue without Yoon, with the next set for Thursday. Additional hearings are already scheduled for Jan 21, Jan 23 and Feb 4. The court's eight judges will decide mainly two issues: whether Yoon's martial law declaration was unconstitutional and whether it was illegal - either of which could prove grounds to uphold his impeachment. Six of the eight judges must vote in favour of Yoon's impeachment for him to be removed from office. The National Assembly's legal team told reporters in front of the court before the trial began that there were \"overwhelming reasons for the immediate dismissal\" of Yoon. The court has up to 180 days from Dec 14, when it received the case, to make its ruling. Former presidents Roh Moo-hyun and Park Geun-hye did not appear for their impeachment trials in 2004 and 2017, respectively. Yoon's lawyers have argued the court must utilise the full 180 days - specifically to examine what \"led to the declaration of martial law\". The attempt to place South Korea under military rule for the first time in more than four decades lasted just six hours. \"This impeachment case focuses solely on the martial law situation,\" lawyer Kim Nam-ju said. \"Since most of the individuals involved have already been indicted and the facts have been somewhat established, it doesn't seem like it will take a long time.\" Lawmakers also impeached Yoon's stand-in last month, adding to the country's political instability, and the current acting president has appeared unwilling to wade into the standoff, instead urging all parties to negotiate a solution. Arrest attempt In a parallel criminal inquiry, a joint team of investigators from the Corruption Investigation Office (CIO), which is probing Yoon over insurrection, and police are preparing a fresh attempt to arrest the president. An earlier attempt failed after Yoon's presidential guards blocked access to investigators, while rival camps of protesters rallied outside his home. Yoon's chief of staff Chung Jin-suk said his office was \"ready to consider all options for investigation or visits\" to the sitting leader \"at a third location\". If the new warrant is executed successfully, Yoon would become the first sitting South Korean president to be arrested. If eventually convicted in that case, Yoon faces prison or even the death penalty. Published in Dawn, January 15th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}