{
  "article_id": "2025-01-15_06a26eb4be7e9c64991d0c473030bc9c",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885345/power-minister-awais-says-tariff-for-electric-charging-stations-cut-by-45pc-to-rs39",
    "retrieved_at": "2025-08-26T07:42:09.951Z"
  },
  "metadata": {
    "title": "Power Minister Awais says tariff for electric charging stations cut by 45pc to Rs39 - Business - DAWN.COM",
    "author": null,
    "date_published": "2025-01-15T09:07:35.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/151339017779229.jpg",
    "categories": [],
    "word_count": 801,
    "reading_time_minutes": 5
  },
  "content": {
    "article_body": "Power Minister Awais Leghari on Wednesday said that the government had made the \"critical\" decision to make electric vehicles (EVs) more available to the citizens, reducing the tariff to electric charging stations by 45 per cent. Pakistan's journey towards EVs began in 2016-2017, and the National Electric Vehicle (NEV) policy was officially launched in 2020, according to the Ministry of Climate Change. The initiative was launched as transportation accounts for 43pc of the airborne emissions in the country. Addressing a press conference, the power minister said that Prime Minister Shehbaz Sharif had decided to make EVs cheaper for the people. \"Charging station tariffs will decrease from Rs71.10 to Rs39.70,\" he said, adding that this was an approximate tariff reduction of 45pc. The power minister also said the permission to install charging stations would be given within 15 days. He spoke against the usage of petrol and diesel, adding that the foreign exchange was burdened by a $6 billion import bill and that the government made a decision today to make EVs more available to people. \"So, today, we made a decision - the prime minister held a meeting and decided that the tariff of Rs71.10 distribution companies used to bill charging stations will be reduced by approximately 45pc to Rs39.70,\" he said, adding that by reducing electricity prices, people who own electric motorcycles and small cars would be able to access those charging stations more. Awais did not say when the new tariff regime would be rolled out. \"We want the investor as well as the consumer to benefit from this policy,\" he said, adding that lower tariff EV stations would encourage even those using two-wheelers or three-wheelers to switch from petrol powered vehicles. Leghari said the government would also help arrange green energy loans for the owners of two-wheelers and three-wheelers to buy batteries. Energy imports make up the majority of the country's external payments, and the move to support EVs will help preserve foreign currency reserves, the minister said. The reform of the energy sector is a key part of the International Monetary Fund (IMF) $7bn bailout of Pakistan's economy. In November 2024, amid reservations from key stakeholders, the government had announced the New Energy Vehicle (NEV) policy aimed at transitioning 30pc of all new vehicles - imported and locally manufactured - in Pakistan to electric power by 2030. The new policy includes EVs and other emerging energy sources like hydrogen. As part of the policy, the government introduced subsidies of Rs50,000 for electric motorcycles and Rs200,000 for three-wheelers (rickshaws), with a total allocation of Rs4 billion. These subsidies will be distributed through auctions. So far, two companies have been granted licences, and 31 more applications are under review. Additionally, it was noted that the IMF had no objections to the tax exemptions and subsidies provided under the NEV policy. More initiatives include offering free electric bikes or scooters to 120 high-achieving students and reducing duties on EV components to encourage local manufacturing. The government is also set to establish a New Energy Fund and a New Energy Vehicle Centre to support these measures. Currently, the key global EV manufacturer, BYD Group of China, has obtained a manufacturing licence in Pakistan, while Dewan Motors is also set to launch its EVs under the completely knocked down (CKD) licence. Prime Minister Shehbaz Sharif, in his address to the federal cabinet, called the decision to reduce the tariff to electric charging stations necessary to combat climate change. \"If you want to promote electric vehicles - through which pollution will lessen - the commercial aspect of that, whether its to encourage charging stations or plants then the tariff of Rs70 is not viable,\" he said, adding the countries around the globe were promoting the EV culture with speed, providing ease and incentives. \"So I think the minister of power and his team's proposition, I commend it,\" he said. Yesterday, the federal cabinet had approved the power division's recommendation to revise the negotiated settlement agreements with 14 independent power producers (IPPs) aimed at reducing electricity costs and saving Rs1.4 trillion for the national exchequer. After discussion with the 14 IPPs under the revised agreements, the cabinet approved the recommendation of reductions of Rs802bn in terms of profit and cost for them. An amount of Rs35bn in excess profits from previous years will be deducted from these IPPs. The meeting's members were briefed that of the 14, 10 IPPs operated under the 2002 Power Policy while four others were established under the 1994 Power Policy. The attendants were further told that an agreement with one IPP from the 1994 policy had already been previously cancelled. The revised agreements were projected to save the government Rs1.4tr over their applicable duration, with annual savings of Rs137bn that would benefit power consumers, the meeting's participants were informed.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}