{
  "article_id": "2025-01-15_7d2d7868abbee87a49a750ec6b3de887",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1885384/south-africa-accused-of-horrific-crackdown-as-78-corpses-pulled-from-besieged-mine",
    "retrieved_at": "2025-08-26T07:42:06.377Z"
  },
  "metadata": {
    "title": "South Africa accused of ‘horrific’ crackdown as 78 corpses pulled from besieged mine - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-15T13:59:52.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/15185129fd42483.jpg",
    "categories": [],
    "word_count": 675,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "At least 78 illegal miners have been pulled out dead from a South African mine where police blocked food and water supplies for months in what trade unions described as a \"horrific\" state crackdown on desperate people trying to eke out a living. A total of 78 bodies and 166 survivors - some of them emaciated and disorientated - have been hauled out so far in a court-ordered rescue operation that began on Monday, with hundreds more men still stuck two kilometres below the surface in a gold mine at Stilfontein, southwest of Johannesburg. Police had stopped food and water supplies from being taken into the mine since August until a court ruled in December that volunteers could send down essential aid for the miners, known locally as \"zama zamas\". \"Our mandate was to combat criminality and that is exactly what we've been doing,\" said Athlenda Mathe, national spokesperson for the South African police, speaking at the site. \"By providing food, water and necessities to these illegal miners it would be the police entertaining and allowing criminality to thrive,\" she said. The death toll makes the crackdown on the Stilfontein mine one of the deadliest on miners in recent South African history. As the toll has mounted, so has criticism of the police and of the government, which says the siege was part of a much-needed crackdown on illegal mining. \"These miners, many of them undocumented and desperate workers from Mozambique and other Southern African countries, were left to die in one of the most horrific displays of state wilful negligence in recent history,\" the South African Federation of Trade Unions said in a statement on Tuesday. The Democratic Alliance, the second-biggest party in the ruling coalition, said today the situation at the mine had got \"badly out of hand\" and called for an independent inquiry. All 166 of the survivors rescued so far were immediately arrested and charged with criminal offences, including illegal immigration, trespass and illegal mining, police said. None were hospitalised and all were taken into police custody. \"If you come out and you are able to walk they take you straight to the cells,\" said Mzukisi Jam, a civil society activist, who has been at the site throughout the rescue operation. Only two of the bodies have been identified and claimed by their families, Mathe said. Rescue efforts were in their third day today with a red cylindrical metal cage being painstakingly lowered into the mine to extract survivors and corpses. The cage can hold about a dozen people or dead bodies at once. \"If you stand at the sides you can see the bodies being taken out of the cage and it's incredibly distressing,\" said Jessica Lawrence of civil rights group Lawyers for Human Rights, who was at the scene. Mannas Fourie, CEO of a private rescue firm involved in the operation, said each round trip took up to 45 minutes. \"Even the illegal miners that are at the bottom, they're quite keen to get into the cage so we're loading as many people as we can at one time and we bring them up to the surface,\" he told Johannesburg's Radio 702. Illegal mining costs the South African government and the precious metals industry hundreds of millions of dollars a year in lost sales, taxes and royalties. \"It's a criminal activity. It's an attack on our economy by foreign nationals in the main,\" said Mining Minister Gwede Mantashe, speaking at the site on Tuesday. Police said 1,576 unlicensed miners had emerged from the mine by their own means before the rescue operation began. All of them were arrested, and 121 of them have already been deported to their home countries, it said. Most were from Mozambique. Many others came from Zimbabwe and Lesotho. Only 21 of them were South Africans, police said. Typically, the zama zamas - from an isiZulu expression for taking a chance - move into mines abandoned by commercial miners and seek to extract whatever is left. Some are under the control of violent criminal gangs.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}