{
  "title": "Pakistan has always stood for peace: PM",
  "link": "https://www.app.com.pk/national/pakistan-has-always-stood-for-peace-pm/",
  "date_published": "2021-02-27T05:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 27 (APP): Prime Minister Imran Khan on Saturday said Pakistan always stood for peace and remained ready to move forward to resolve all outstanding issues with India through dialogue.\nThe Prime Minister congratulated the nation and saluted the armed forces on the second anniversary of the country’s response to India’s illegal, reckless military strikes against Pakistan.\n“As a proud and confident nation, we responded with determined resolve at a time and place of our choosing,” he said in a series of tweets.\nAlso Read: Botched Indian “Operation Bandar” – 2 IAF aircraft down, 1 pilot captured\nI congratulate the entire nation & salute our Armed Forces on the 2nd Anniversary of our response to India's illegal, reckless military adventure of air strikes against Pakistan. As a proud & confident nation, we responded with determined resolve at a time & place of our choosing\n— Imran Khan (@ImranKhanPTI) February 27, 2021\nImran Khan said, “We also demonstrated to the world Pakistan’s responsible behaviour in the face of India’s irresponsible military brinkmanship, by returning the captured Indian pilot.”\nHe welcomed the restoration of a ceasefire between Pakistan and India along the Line of Control.\n“The onus of creating an enabling environment for further progress rests with India,” he said.\nI welcome restoration of the ceasefire along the LOC. The onus of creating an enabling environment for further progress rests with India. India must take necessary steps to meet the long-standing demand & right of the Kashmiri people to self determination acc to UNSC resolutions.\nThe Prime Minister stressed that India must take the necessary steps to meet the long-standing demand and right of the Kashmiri people to self-determination according to the United Nations Security Council resolutions.",
  "retrievedAt": "2025-08-11T20:25:25.328Z"
}
