{
  "title": "Mega development package to be announced for Sindh: Asad Umar",
  "link": "https://www.app.com.pk/national/mega-development-package-to-be-announced-for-sindh-asad-umar/",
  "date_published": "2021-02-27T17:29:00.000Z",
  "source": "APP",
  "content": "TANDO ALLAHAYAR, Feb 27 (APP): Federal Minister for Planning, Development and Special Initiatives Asad Umar Saturday said Prime Minister Imran Khan would soon announce a development package for Sindh on the lines of the mega package which was given to Karachi.\nAddressing the workers convention of Pakistan Tehreek-e-Insaf (PTI) in Tando Allahyar district, the minister informed that he would submit the proposals of development schemes of Sindh to the PM next month for approval.\n“The PM directed me to specially review the needs of Sindh’s people for development,” he said.\nHe recalled that a mega development package was announced for Karachi five months ago and that a similar package would soon be announced for other districts of Sindh.\n“We would have collected development schemes from Sindh while sitting in Islamabad but until you don’t go to the ground and ask the people what they want, you can’t figure out the right priorities,” he observed.\nHe said the remotely planned schemes failed to produce the desired results.\nUmar observed that Tando Allahyar is the center of agriculture but the farmers and people associated with the agriculture sector know that the farmers did not receive the right prices for their crops.\nHe announced that a food processing center would be built in the district which would help farmers get better income.\nThe minister said the Pakistan Peoples Party has been ruling Sindh for the last 50 years.\nHe noted that Sindh was blessed with the resources but the irony was that the rulers not the common people were prospering.\n“The rulers aren’t working for the interests of the people but only for the sake of minting money, making properties,” he added.\nResponding to the demand of PTI Tando Allahyar chapter’s leader advocate Ali Ahmed Palh, the minister assured that the gas supply would be provided to the villages and suburbs of the district soon.\nHe said PM Khan’s policy was to provide gas on priority to an area which was producing that natural resource.\nHe assured that after returning to Islamabad he would take up the issue with the petroleum ministry, adding that in the next budget allocation would be made for supply of gas to the aforesaid areas.\nHe also assured that a center of National Database and Registration Authority (NADRA) would be opened in Jhano Mari taluka of the district in next few months, saying that he was known for keeping his promises.\nReplying to a query of a local PTI leader, Umar told that two federal ministers were already working on an agriculture package which would financially support the farmers.\nEarlier, Palh informed the minister that 4 gas fields were operating in the district yet a large number of villages and suburbs had not supplied gas so far.\nHe demanded that the contractual employment under which the contractors get a large part of salary of the employees working in the gas fields should be abolished and the employees should be given their full salaries.\n“We have come to know that the gas companies keep up to Rs 25,000 for the contractual staff who actually end up getting Rs 8,000 to Rs 10,000,” he complained.\nPalh also called for establishing a federal university and technical college in Tando Allahyar.\nThe minister later visited the local press club and residence of Palh where he interacted with the local leaders of PTI.",
  "retrievedAt": "2025-08-11T20:25:17.177Z"
}
