{
  "title": "PM to announce mega development package for Sindh districts soon: Asad Umar",
  "link": "https://www.app.com.pk/national/pm-to-announce-mega-development-package-for-sindh-districts-soon-asad-umar/",
  "date_published": "2021-02-27T14:24:00.000Z",
  "source": "APP",
  "content": "HYDERABAD, Feb 27 (APP):Federal Minister for Planning, Development and Special Initiatives Asad Umar on Saturday said federal government would announce mega development package for other districts of Sindh like Karachi in next visit of Prime Minister Imran Khan to Sindh in the end of this month.\nHe said this while addressing a press conference here at HESCO Headquarter after meeting with provincial leadership of Pakistan Tahreek -e- Insaf (PTI), MQM-Pakistan and Grand Democratic Alliance (GDA).\nHe said PTI had emerged as popular party of the country after recent elections held in Sindh and Punjab as Pakistan Muslim Leage-N and Pakistan Peoples Party had won their own seats with low margin as compared to 2018 general elections while PTI had secured more votes despite losing these seats in last general elections.\nPakistan Tahreek -e- Insaf and allies MQM-P and GDA were democratic parties therefore, their members and leaders always raised questions related to party and political affairs, he said while replying to a question. He said Liaquat Ali Jatoi had been summoned by party leadership to clarify his statement.\nAsad Umar said to streamline performance of government institutions like NADRA, WAPDA, NHA, power distribution companies and other federal organizations, meeting with stakeholders held to deliberate on different proposals for paving way for betterment of these institutions.\nRumors about toppling of the PTI government were being spread by opposition since day one of the incumbent government and first of all they had set a deadline of December 2019 and Maulana had organized long march and staged sit in at Islamabad but he had returned back after failing to achieve his goals, he said.\nWhile rejecting opposition’s propaganda about rigging in by-polls in Punjab, Khyber Pakhtunkhwa and Sindh, Umar said majority of the seats on which by elections held were the seats of Pakistan Muslim League-N and Pakistan Peoples Party in Punjab and Sindh where they had won these seats with low margin and Pakistan Tehreek-e-Insaaf had secured more votes than it had obtained in 2018 general elections.\nHe said out of the two seats of KP, one seat was of PTI and one of the opposition from which PTI had won opposition’s seat but lost its own.\nAsad Umar said meeting of Council of Common Interests (CCI) had been postponed due to Senate election activities and Imran Khan was the first prime minister who had regularly holding CCI meetings and Sindh Chief Minister Syed Murad Ali Shah was the one who had been given most of the time to present his point of view in these meetings.\nSetting aside rumors about rifts in government and its allies, Asad Umar said elections in Pakistan had become dirty business where rates for the conscience were being fixed for purchasing their votes therefore, such rumors were being circulated by opposition parties.\nReplying to a query regarding arrest of opposition leader in Sindh Assembly, Asad Umar said Haleem Adil’s arrest was worst example of victimization as Shaikh was the one who had exposed corruption of PPP’s provincial government.\nHe said not only PTI but those who were not part of PPP government in Sindh had been under victimization and government machinery was being used against them.\nAsad Umar said in past people of Sindh always voted for PPP due to love and affection with Bhutto and his family but now people casting their votes to save them from their terror and threats of being victimized.\nHe said cases of coronavirus had drastically decreased in the country due to prudent policies of the incumbent government but this pandemic was not completely over therefore, people should adopt precautionary measures and use face masks outside.\nGovernment has decided to lift ban on routine economical activities from next mont Asad Umar said and appealed to the general public to adopt preventive measures and got themselves vaccinated as availability of the vaccine in large quantity would be ensured from next month.\nHe said rumors about side effects of the vaccines were wrong and asked general public not to pay heed to them.\nIn response to question regarding performance of HESCO and load-shedding, Asad Umar said to improve performance of Hyderabad electric supply company and Sukkur electric power company, decision had been taken to invest more money in these companies to facilitate consumers.\nHe said main reason of the load-shedding was a failure of the system as it had become obsolete and needs to be revamped, adding, once it had been upgraded this problem would be resolved.\nHe further said with the support of Asian Development Bank smart metering project was under consideration and would be approved in the next meeting of the ECNEC and after implementation on it these issues would be resolved permanently.\nSindh Government has no objection over K-4 project and it was given to wapda with consent of Sindh, Asad Umar said, adding that previously this project had to be completed with the funding of 50 percent each by federal and Sindh governments but now this project would be completed by federal government with 100 percent funding.\nHe said Sindh government had submitted papers for the change of implementation agency while ECNEC had also accorded approval in that regard.\nThe federal minister said Federal Board of Revenue had collected tax target of current financial more than set goal till now and it would keep it continue in remaining months of the year.\nThe minister was accompanied by PTI, MQM-P and GDA leaders during the press conference.\nEarlier, Asad Umar held meeting with PTI leaders, MQM-Pakistan and GDA leaders at HESCO’s conference hall and reviewed political and development related matters.",
  "retrievedAt": "2025-08-11T20:25:21.300Z"
}
