{
  "title": "Cybercriminals use various means to mint money on social media: Senate told",
  "link": "https://www.app.com.pk/national/cybercriminals-use-various-means-to-mint-money-on-social-media-senate-told/",
  "date_published": "2022-10-07T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 7 (APP):Minister of State for Law and Justice Senator Shahadat Awan on Friday said cyber criminals used different\nmodus operandi to lure innocent people in a bid to mint their hard-earned money on the social media.\nResponding to the question, raised by Senator Seemee Ezdi, he told Senate that the major tools used in these frauds were mobile Subscribers Identity Module (SIMs) which were activated fraudulently by using different techniques like silicon thumb impression etcetera.\nHe said it was the mandate of Pakistan Telecommunication Authority (PTA) to check and monitor illegal SIMs biometric verification under Section- 17 of the Prevention of Electronic Crimes Act (PECA), 2016 (unauthorized issuance of SIM cards).\nHe said such offences were dealt under Section-13 (Electronic Forgery) Section-14 (Electronic Fraud), Section-16 (Unauthorized use of Identity Information) and Section-17 (Issues of illegal SIMs) of PECA-2016.\nThe FIA Cybercrime Wing had taken serious steps in these matters, he said adding during the current year, it had received 21,259 complaints of financial fraud which is the criminal offence under Sections 13, 14 of PECA-2016.\nHe said out of 21,259 complaints, 3,894 were converted into regular inquiries and 352 cases were registered whereas 415 accused were arrested.\nIn 2021, the FIA Cybercrime Wing registered 3,894 enquiries, 652 cases and 703 accused were arrested, he said adding during the current year, the FIA Cybercrime Wing had registered 33 cases and 69 accused were arrested.\nHe said in 2021, 22 cases were registered and 53 accused were arrested under Section 17 (Issuance of illegal SIMs) of PECA-2016.\nHe also informed that the PTA was planning to introduce live finger detector (LFD) system to eradicate silicon thumbs.",
  "retrievedAt": "2025-08-11T15:41:34.660Z"
}
