{
  "title": "President urges social media influencers to create awareness on breast cancer",
  "link": "https://www.app.com.pk/national/president-urges-social-media-influencers-to-create-awareness-on-breast-cancer/",
  "date_published": "2022-10-07T13:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 7 (APP): President Dr Arif Alvi on Friday called upon social media influencers to create awareness about breast cancer and highlight the need for conducting regular self-examinations for its early detection.\nThe president, addressing the social media influencers as part of the breast cancer awareness campaign, here said social media could prove an effective platform for creating awareness about breast cancer and helping reduce the mortality rate in Pakistan caused by this deadly cancer.\nHe said that if breast cancer was detected at early stages, 99% of breast cancer patients could be saved and could live healthy and normal lives.\n“If the cancer is detected at the 3rd and 4th stages, the 5-year survival rate is up to 86% and 28% respectively, which can be significantly higher if detected and treated at an early stage”, he added.\nThe president highlighted that breast cancer incidents were highest in South Asia as compared to the other regions and were even higher in Pakistan due to a lack of screening programmes in the country.\n“Our country does not have the resources to provide clinical screening facilities to all the breast cancer patients across the country due to the small number of screening machines but the same function can be performed by the women themselves. If they find any growth in their breast areas or around it, they should immediately report and seek medical help”, he said.\nPresident Alvi said that the incidents of breast cancer could be minimized by adopting a healthier lifestyle like regular exercise, a balanced diet, and avoiding smoking, alcohol and other drugs.\nThe president said that women needed to be empowered in financial and economic terms and provided space in society and public places to enable them to perform all the routine functions without harassment, intimidation or fear.\nHe said that a harassment-free environment for women would help them contribute to the socioeconomic development of the country.\nThe president said that social media influencers should use creative means for spreading breast cancer awareness among the population, especially in small towns and rural areas.\nHe added that creative images, videos and other products, which were made keeping in view cultural and social norms, could help spread the message of early detection, self-examination and seeking timely medical aid.\nPresident Alvi said that taboo attached to breast cancer needed to be removed by educating not only the females but also the male members of the population at all levels, including schools, colleges and universities.\nThe president emphasized that according to Islamic teachings, women should breastfeed their babies for at least two years as according to WHO, children should not be fed even water or other food during the first six months.\nHe said that proper nutrition for the mother and children during the first thousand days was important to avoid stunting.\n“Unfortunately, the stunting ratio in Pakistan is around 40% which is extremely high, which reduces the mental and physical health of the child, besides reducing the productivity, efficiency and prosperity of the nation”, he added.\nHe called upon the social media influencers to contribute to the efforts of Samina Alvi, who had been instrumental in creating breast cancer awareness for four years. With her committed efforts the rate of reporting of breast cancer cases at early stages had been increasing by 10% every year, he added.\nThe president said that the successful awareness campaign regarding early detection and self-examination would reduce the burden on the public health system and would help avoid chemotherapy, radiography and other expensive surgical interventions.\nBegum Samina Alvi, while speaking on the occasion, said that early examination was the only way to control and reduce the incidents of breast cancer.\nShe said that a well-thought-out and coordinated plan of action had been devised, besides sending letters to the prime minister, MNAs, MPAs, media, and all chambers of commerce across the country to become partners in the breast cancer awareness campaign, which would continue for throughout the year.\nEarlier, Oncologist Dr Fauzia Abdus Samad emphasized the need for living a healthier life and conducting self-examination and mammograms to diagnose the disease at its early stages and to get it treated while avoiding significant expenditures.\nA large number of social media persons attended the interactive session and raised questions responded by the president, Samina Alvi and Dr Fauzia.",
  "retrievedAt": "2025-08-11T15:41:35.802Z"
}
