{
  "title": "Resonance of Imran’s audio leak on horse trading to increase every day: Marriyum",
  "link": "https://www.app.com.pk/national/resonance-of-imrans-audio-leak-on-horse-trading-to-increase-every-day-marriyum/",
  "date_published": "2022-10-07T17:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 07 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb on Friday said the third audio leak of PTI Chairman was really an affront for Imran Khan and its resonance would enhance with every day.\nImran Khan did play a serious game with national interests and security with his devilish tricks to achieve ulterior motives, she said while addressing a press conference.\nLambasting the PTI chairman, she said that buying the conscience of elected members of the parliament used to be a ‘shirk’ for Imran but now it was a ‘Sawab’ after Imran’s audio leak on horse trading.\nImran Khan was the leader of ‘Jaib Bharo’ movement and not ‘Jail Bharo Movement’, she said while referring to his claim of Jail Bharo movement.\n“A slave to watches, rings, a few pieces of land, diamonds and having lust for power, had no right to take an oath of true freedom from the people”, she opined.\nShe said how ironic it was that a person who violated the constitutional oath of the office of the Prime Minister, was taking an pledge (oath) from the people.\nImran Khan after coming to power made the country an economic subservient, destroyed the national economy and now he had agenda apparently against the nuclear Pakistan, she remarked.\nShe said that PTI chairman Imran Khan was lying on daily basis and trying to befool the people.\nThe minister opined that Imran Khan thought that by lies on regular basis, would make people believe at a later stage.\nShe said that the government team was now feeling exhausted in countering the fallacies of Imran, but he was never seemed tired.\nShe said that in the recent past the audio of Imran Khan was leaked in which he said that the PTI leadership would play with the cipher but would not mention the name of US.\n“This audio leak was an affront for Imran Khan’s narrative of real freedom, which echoes every day but falls on deaf ears of Imran Khan,” the minister said.\nShe said that Imran Khan took advantage of the people who listened tohim as he took them as just fools.\nHe befooled the people with lies, he befooled the people by playing his so-called tricks, she added.\n“Imran Khan is a liar, hypocrite and a foreign agent who played with the economy of the country, deprived the people of their jobs, compromised on Kashmir issue and foreign policy.\nShe said Imran Khan came to power in 2018 after the failure of RTS system and played games with the development of the country, caused unprecedented inflation, chaos, intolerance and tried to destroy the social fabric of the society.\nMarriyum said that Imran Khan distorted the image of Pakistan in the world by saying that the whole of country was corrupt.\nWhen his seat of power jolted , he sent a message to the whole world that the country of 220 million people was slave and subservient, she added.\nCastigating Imran, she said there was no iota of shame since he did not realize that these words would harm the national interest, security and the honour of the country in the world.\n“Imran has nothing to do with anyone, his lust commences with his own ego and ends with power,” she said adding that he destroyed the country’s economy, snatched people’s jobs, made a deal on Kashmir, damaged the morality of the society, filled hispockets, committed robberies during his rule.\nHowever she said the agenda of “the foreign agent” had yet not beenaccomplished as he had other objectives, so his agenda wasincomplete so far.\nThe minister said that his aim was to divide the country into four parts ( God forbid) and make it bankrupt financially.\nThe previous rulers wanted to make the country Sri Lanka, they had almost had reached their goal but it remained incomplete with removal of their government through democratic method of no-confidence motion, she said .\nMore gifts and diamond rings of Tosha Khana were yet to be taken by Imran and his cronies, the country’s economy was yet to be destroyed completely, Marriyum said.Following loss of power by Imran Khan, his enmity with the country was fully exposed as he wanted to cling to power at all cost, she said.\nShe said that Imran Khan indulged in horse trading during the 2018 election, purchased loyalties in Senate elections , Khyber Pakhtunkhwa, Balochistan elections and evenin his party’s elections.\nWhen Imran Khan came to know about the no-confidence motion against him , he said in the audio leak: , “I have bought five MNAs,” and now for Imran Khan, horse trading was no more a “shirk” but an act of “ sawab”.\nShe reminded that it was Imran who used to say that whoever did horse trading, committed a “shirk” and today’s audio leak was proof that “shirk” had been committed and it had been done by Imran Khan himself.\n“We used to say earlier that the mastermind of all these things is Imran Khan himself and now it was proven that he is the person behind all the ugly actions of the PTI”, she said.\nImran Khan said, in the closed room that he had to play with the cipher, and outside he said that there had been a foreign conspiracy: he said in the closed room that loyalties of five MNAs had been purchased by the PTI but in public he said that horsetrading was a “shirk”.\nThis was food for thought for those who listen to Imran Khan’s speeches, she added.\nShe said today he claimed that they havebeen struggling for real freedom which was a big joke with the nation.\nThe minister said that from Bushra Bibi’s audio leak with Arsalan toShaukat Tareen’s audio leak forcing the Punjab and KP financeministers not to cooperate with the federal government over IMF loanissue, from cipher to today’s horse-trading audio, there has been no denial byImran Khan. She said that according to ECP, Imran Khan used the charity funds forhis political objectives and the ECP verdict has not been challengedanywhere, nor its contradiction was issued.\nMarriyum Aurangzeb said the government did not believe in politicalvictimization but will take action against the people who violated thelaw.\nShe said the government would ensure to make powerful people likeImran Khan and his cronies, accountable over their wrong doings.\nRejecting Imran’s claim of development in PTI era, she said inflationrate of edible commodities soared from two percent to twenty percentin Imran Khan’s government. Flour price rose from Rs 35 per kg to Rs100, whereas sugar prices soared to 120. She said that edible oilprice was Rs 120 per kg when PTI came to power in 2018 but it touchedRs 540 in its tenure. Similarly, she said that tariffs of electricityand gas also skyrocketed in PTI tenure.\nShe said Imran Khan not only failed to create 10 million new job opportunitiesbut 5 million people lost their jobs in PTI’s four year. He failed toend corruption in 90 days but set new records of corruption in allsectors and failed to built 5 million housing units.\nShe said that Maryam Nawaz was acquitted by IHC in Avenfield case onmerit as NAB failed to provide any link of Nawaz Sharif or Maryam withthose properties.\nShe said Imran Khan, despite misuse of a state power, NA,FIA and otheragencies, failed to prove even a single rupee’s corruption chargesagainst Sharif family.",
  "retrievedAt": "2025-08-11T15:41:50.348Z"
}
