{
  "title": "Pakistan has completed journey from ‘terrorism to tourism’: Firdous",
  "link": "https://www.app.com.pk/national/pakistan-has-completed-journey-from-terrorism-to-tourism-firdous/",
  "date_published": "2020-02-19T02:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Wednesday said Pakistan which had been put on the path to progress by the incumbent government, had successfully completed its journey from ‘terrorism to tourism’. .\nIt was amply clear from the statement of United Nations Secretary General António Guterres about tourism that Pakistan had emerged as a destination for tourists and investors, she said while talking to the media here flanked by NDRMF Chief Executive Lt Gen (retd) Nadeem Ahmed.\nDr Firdous said the National Disaster Risk Management Fund (NDRMF) had decided to launch development projects in various areas of Balochistan, which were vulnerable to drought and floods. She said no strategy was devised by the past regimes for tackling national disaster risks, but today NDRMF was taking pre-emptive measures under a well-planned strategy to mitigate the effects of natural calamities, which were not only laudable, but also proof of a changed Pakistan. The Fund would secure the country’s future, she added.\nThe SAPM said institutions like the NDRMF existed in some developed countries. The donations made by the well-to-do people would surely and promptly reach the needy, besides covering the damages of natural disasters. She said international donors had already pledged billions of dollars funds, which would be used by the NDRMF on development projects in backward areas, particularly Balochistan.\nThe NDRMF projects would also help improve the country’s eco-system, she added.\nShe said the world confidence in Pakistan had restored as an honest leadership was at the helm of its affairs. On the contrary, the past rulers used to keep their personal interests supreme, she added.\nThe SAPM said a strategy would be devised for providing monetary support to the journalists in case of non- payment of salaries by the media owners.\nResponding to a question, she said Prime Minister Imran Khan was making utmost efforts to minimize the problems being faced by the masses. An effective strategy was being devised to check smuggling. There would be zero tolerance for the smugglers.\nThe elements responsible for wheat flour and sugar crises, she said, would be dealt with iron hands. The prime minister was determined to provide relief to the people by reducing prices of essential items.\nTo a question, she said Pakistan Muslim League-Nawaz leader Rana Sanaullah was running a ”save me campaign” and was haplessly looking towards his leaders sitting in London.\nShe said the Ehsaas programme, the flagship programme of the government for poverty alleviation, would continue. The prime minister would hand over assets (resources) to the people under the programme at a ceremony in Layyah on Friday.\nShe said Prime Minister Imran Khan’s vision of a ‘Clean and Green Pakistan’ would become reality.",
  "retrievedAt": "2025-08-11T18:49:39.792Z"
}
