{
  "title": "Encroachment on KCR land to be removed within 30 days: Sheikh Rashid",
  "link": "https://www.app.com.pk/national/encroachment-on-kcr-land-to-be-removed-within-30-days-sheikh-rashid/",
  "date_published": "2020-02-18T22:59:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 19 (APP):Minister for Railways Sheikh Rashid Ahmed Wednesday said that his ministry, in line with the directives issued by the Supreme Court, with the help of Sindh government will remove encroachment and vacate Railways land to be used for Karachi Circular Railway (KCR) project within next 30 days.\nAddressing a press conference here after holding a meeting with Sindh Chief Minister Syed Murad Ali Shah who was accompanied by a team of provincial officers concerned, Sheikh Rashid said fifty feet area on each side of 4.5 kilometers long KCR track would be cleared of all kind of encroachments.\nHe said actually the Railways land along the track was around 140 feet both sides of the track but for the time being, the ministry was going to regain its limited land required for KCR project.\n“I have also asked the police to set up pickets on the land being vacated from encroachers,” he said.\nEvery inch of Railways land would be retrieved including that allegedly occupied by the Builders of Hayyat Regency project and Pakistan Stock Exchange and the amount received would be used for KCR project.\nThe minister said as the bridge financing Federal and Sindh governments would\nallocate Rs 20 billion for KCR; with equal share. However, he said, timely completion of the project would depend on receipt of dollars two billion from China.\nHe said, in today’s meeting, it was decided to form a committee tasked with timely execution of KCR. In the committee, Federal Government would represented by BPS-21 and Sindh Government by BPS-20 officers.\nNext meeting with Sindh Government would be held very soon to expedite the KCR process. Chinese Ambassador to Pakistan was also scheduled to visit Karachi and discuss KCR project matters in next few days.\nSheikh Rashid said KCR would have new and modern train, track and 24 station.\nHe reassured that things about KCR were moving fast and he was very confident that this much awaited intra-city railways network would be completed in time.\nHe said PTI government under the leadership of Imran Khan was seriously discussing and finding solutions to cut gas and electricity prices.\nTo a media question, Sheikh said Imran Khan’s government would complete its five years tenure.\nThe minister said Punjab Forensic Department’s report had endorsed his stance that fire in Tezgam train was caused by burst of a cylinder.",
  "retrievedAt": "2025-08-11T18:49:49.212Z"
}
