{
  "title": "National medicine policy to be announced in next two weeks: Mirza",
  "link": "https://www.app.com.pk/national/national-medicine-policy-to-be-announced-in-next-two-weeks-mirza/",
  "date_published": "2020-02-19T02:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):Special Assistant to the Prime Minister on National Health Services Dr Zafar Mirza on Wednesday said that the government has completed work on national medicine policy which would be announced in next two weeks for reforming the pharmaceutical industry.\nAddressing the 5th Pharma Summit organized by the Pakistan Pharmaceutical Manufacturers’ Association (PPMA) here, Dr Mirza said that besides the national medicine policy, five year action plan was also devised for its implementation.\nHe said that regulatory system was also being made predictable and easy for growing the pharma sector in the country.\nHe said the government was committed to reforming the pharma sector and all bottle necks were being removed in this regard.\nDr Mirza said efforts were also being made that only best possible people could run the regulatory authority.\nHe urged the pharma sector to shun practice of unethical promotion of their certain products.\nEarlier, speaking on the occasion, Advisor to the Prime Minister on Commerce Abdul Razak Dawood said the government was committed to increasing the country’s exports by removing all the obstacles and roadblocks.\nSpecial focus was also being given to increase the exports’ volume through tariff rationalization, trade related investment, institutional reforms and easing of business regulations, he added.\nHe said textile was leading export of the country but now new sectors including pharma were identified which could enhance the country’s exports.\nHe said pharma industry was very important for us and strategy was being developed to reform it for enhancing pharma exports.\nAbdul Razak Dawood said that African countries have around 1.3 billion populations with $ 2.7 trillion GDP and the government also wanted to double our trade with them in next five years.\nHe urged the pharma sector to look towards African countries for capturing their markets.\nHe said revitalizing the exports of the pharma sector was one of the government priorities to boost the national exchequer.\nA special pharmaceutical export promotion committee has also been set up to encourage production and exports of medicines and medical products, he added.\nHe called upon the pharma industry to come forward in order to enhance the current volume of over $ 300 million exports to over $ 3 billion.\nHe lauded the PPMA for organizing the summit.\nEarlier, Chairman PPMA Mian Zaka ur Rehman said that Pakistan has a strongest pharma industry in all Muslim countries and 98 per cent of country requirement was being fulfilled locally.\nHe said that the pharma sector has witnessed 20 per cent growth in last two years and added that we could fulfill the requirement of whole region as Almighty blessed us with raw materials being used in manufacturing medicines.\nHe said there were tremendous opportunities for pharma sector to export their products in African countries.\nHe said the summit would discuss in detail issues related to functioning, regulation, control, growth, and advancement of the Pakistani pharmaceutical industry.\nFormer State Minister and ECO Trade Development Authority of Pakistan, Tariq Ikram said Pakistan has rich potential to export phamra products to the other countries. The current export volume of phama sector could easily be enhanced to $ 5.4 billion from $ 300 million, he added.",
  "retrievedAt": "2025-08-11T18:49:42.165Z"
}
