{
  "title": "Federal, Sindh govts to coordinate in mitigating implications of gas leak",
  "link": "https://www.app.com.pk/national/federal-sindh-govts-to-coordinate-in-mitigating-implications-of-gas-leak/",
  "date_published": "2020-02-19T02:06:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 19 (APP):Federal Minister for Maritime Affairs Syed Ali Haider Zaidi and Sindh Minister for Local Bodies in a meeting held at Karachi Port Trust head office have decided to jointly adopt a series of measures to mitigate implications of gas leak incident in Keamari Town.\nThey on the occasion also expressed their grief over the loss of lives in the wake of occurrence and agreed that its impact has currently been scaled down to a great extent, said a spokesman of the KPT on Wednesday.\nIt was acknowledged that as a precaution the ship carrying soyabean that may have triggered the allergens in the affected area, has already been asked to shift to Port Qasim and off-load the remaining cargo, in accordance with the standard operating procedure (SOP).\nThe meeting was also attended by Keamari Town MPA, Shahnawaz Jadoon, Karachi Commissioner, Iftikhar A Shallwani, Additional Inspector General of Police, Ghulam Nabi, COS 5 Corps Brigadier Sami, Col IS 5 Corps Colonel Nasir, Rangers 90 Wing, Lt.Col. Shabbir Nasser, Director General of Sindh Environmental Protection Agency, Naeem Mughal, Dr. Amir Haider and Dr. Shakil Ahmed (HEJ), Marine Environment Specialist, Dr. Rashid Yahya Usmani and other KPT officials.\nThe participants discussed options to resolve the crisis and it was decided that a committee be formed to co-opt the services of experts and technical who may forward recommendations to avert such incidents in the future.\nThe committee to be headed by Karachi Commissioner was also assigned the task to probe into the matter further ascertaining the root cause and determine the reasons for the incident that started developing on February 16 and kept on affecting the people for two consecutive days.\nIt was agreed that the incident was localized affecting a few neighborhoods of the Railway Colony and did not spread to any other part of Karachi.",
  "retrievedAt": "2025-08-11T18:49:42.105Z"
}
