{
  "title": "Senators delegation held meetings with King of Bahrain, Chairman Shura Council",
  "link": "https://www.app.com.pk/national/senators-delegation-held-meetings-with-king-of-bahrain-chairman-shura-council/",
  "date_published": "2020-02-19T05:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 19 (APP):A Pakistani senators’ delegation led by Senate Chairman Muhammad Sadiq Sanjrani held meetings with King of Bahrain Hamad Bin Isa Al-Khalifa, Chairman, Shura Council of Bahrain Ali Bin Saleh Al-Saleh and Interior Minister of Bahrain and exchanged views on further strengthening bilateral cooperation and parliamentary linkages.\nIn his meeting with Chairman of the Shura Council, Chairman Senate Muhammad Sadiq Sanjrani observed that Pakistan places its relationship with Bahrain at high esteem and desires to further broaden the already existing fraternal ties, said a press release.\nChairman Senate was accompanied the delegation including Senators Fida Muhammad, Mirza Muhammad Afridi, Sajjad Hussain Turi, Hafiz Abdul Karim, Manzoor Kakar, Abida Azeem, Keshoo Bai and Kalsoom Perveen.\nChairman Senate also underlined the need to enhance parliamentary cooperation through frequent interactions and exchange of delegations.\nHe said that enhanced parliamentary cooperation would be of great value in opening up new avenues for bringing the two sides more close and pave the way for people to people contacts.\nChairman Senate appreciated Bahrain’s support in the OIC and Human Rights Council in Geneva on Kashmir issue. While expressing gratitude, Chairman Senate said that both the countries express same views on major issues and have supported each other in testing times.\nChairman Senate also raised the situation in Indian occupied Kashmir and said that Indian atrocities and lockdown have entered the 7th month and the Indian government is involved in brutal violation of human rights in occupied valley.\nChairman of the Shura Council of Bahrain while welcoming the delegation said that Pakistan and Bahrain have a shared vision of promoting regional peace and development.\nHe said that Pakistan is an important country for Bahrain and we want to further expand mutual cooperation and linkages.\nThe Pakistan side, later, called on the King of Bahrain Hamad Bin Isa Al-Khalifa and apprised about the purpose of this visit.\nChairman Senate said that high level political contacts between the two sides would auger well for future growth and prosperity.\nThe King of Bahrain lauded Pakistan’s efforts for promoting regional peace, stability and development.\nThe delegation also held meeting with Interior Minister of Bahrain and exchanged views on matters of mutual interests and bilateral significance.",
  "retrievedAt": "2025-08-11T18:49:38.459Z"
}
