{
  "title": "Pakistanis can no more be fooled by gimmicks of corrupt, failed political thugs: Shehryar Afridi",
  "link": "https://www.app.com.pk/national/pakistanis-can-no-more-be-fooled-by-gimmicks-of-corrupt-failed-political-thugs-shehryar-afridi/",
  "date_published": "2020-12-13T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Chairman Kashmir Committee Shehryar Khan Afridi Sunday said that Pakistani nation could no more by fooled by a bunch of political stooges who had time and again looted the national exchequer since 1980s.\nTalking to media persons here after the ground breaking ceremony of a project , he said that the people of Pakistan were aware of the true agenda of the rejected politicians who had formed an alliance in a bid for their political existence.\n“After being rejected by the voters in successive elections since 2018, the rejected politicians now have formed an alliance under PDM to help save each other.\nPeople rejected them in 2018 general elections, in FATA polls and again in Gilgit Baltistan. But the corrupt and crooked politicians are making their last ditch efforts to fool the people again with political gimmicks,” he said.\nAfridi said that by rejecting the political gimmick of PDM, the people would show that they stood beside Prime Minister Imran Khan’s vision of prosperous Pakistan.\n“The politicians who have gathered in the name of PDM today, in the past have been calling each other thieves, plunderers and corrupt.\nBut these same political thugs stand united today to save their plundered wealth. Just like 2018, their defeat will be declared at the hands of common people, ” he added.\nShehryar Afridi deplored that despite NACTA’s threat alert, a bunch of rejected politicians were bent upon playing with the lives of the people of Lahore to further their political interests. The PDM leadership would be held fully responsible for causing any harm to masses, he added.\nThe chairman kashmir committee said that the Indian forces were openly violating the ceasefire agreement on the Line of Control (LOC), bombing unarmed Kashmiris while our brave forces were fighting the enemy on LOC.\n“Under such circumstances, some corrupt politicians are hiding in the guise of PDM and planning riots in the country in the name of long march. While the government and the people are united in fighting the monster of Coronavirus, a bunch of politicians with vested interests want to use people to save their plundered wealth, ” Afridi asserted .\nHe said that the Pakistani nation could not allow these politicians to play with the national interest. The time had come for public to hold these thieves accountable, he added.\n” These thugs have repeatedly robbed the people in the name of democracy. Now they have once again come together to deceive people with empty and false slogans. The people have come to know the reality of these hollow and false slogans. People are no longer ready to be fooled by these thieves, ” he remarked.\nAfridi said Modi, Covid and PDM were all contemporary enemies of Pakistan.\n” This bunch is attacking Pakistan’s interests from all sides. Under the leadership of Imran Khan, we will unite to defeat the three enemies of Pakistan, ” he concluded.",
  "retrievedAt": "2025-08-11T20:08:21.404Z"
}
