{
  "title": "ICT launches drive for awareness on labour laws",
  "link": "https://www.app.com.pk/national/ict-launches-drive-for-awareness-on-labour-laws/",
  "date_published": "2020-12-13T05:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): Directorate of Labour and Industries, Islamabad Capital Territory (ICT) has launched a drive to raise awareness on various labour laws among the employers and workers.\nUnder the drive, banners containing educational material in that regard were displayed alongside major and service roads across the city.\nPanaflex standees were also exhibited with the premises of leading employers offices and small industries as well as inside the shopping malls to sensitise workers about their rights.\nThe campaign was aimed at enhancing stability of the working relationship between its two parties and help them understand their rights and responsibilities, said Director Labour and Industries, ICT, Sadia  Haider in an exclusive chat with APP.\n“The department was committed to providing all means of protection to workers’ rights while ensuring employers’ interests are being met,” she said. The ICT labor department, she said was making all out efforts to ensure that workers’ rights were respected, and that they have access to redress when abuses occur.\n“We have provided relief of millions of rupees to the workers by ensuring strict implementation of labour laws in the federal capital during the ongoing year, ” she remarked.\nThe payments of workers were being recovered through judgments under the Wage Act, against complaints lodged by workers for non-payment or delay in wages from their owners, she said.\nSadia said, despite the coronavirus pandemic the department remained actively engaged in the redressal of workers’ complaints.\nHeavy fines were being imposed against those employers who did not adhere to labour laws, she maintained.\nTo a query, she said the department was committed for the elimination of child/bonded labour from Islamabad.\nHowever, she said it was not possible for the department to evaluate the number of children working in houses, but there was a plan to carry out door to door survey in collaboration with UNICEF to determine the actual figures in that regard.\nThe compilation of data would eventually help ensure the enactment of law to end the child domestic labor, she concluded.\nPoverty was the main reason behind the child labor, she said and underscored the need to educating the masses about the rights of children and helping them understand that children are meant to be at school and not work.\nSome 247 factories and 4,005 shops/establishments were registered with the ICT Labour Department, an official source in ICT administration told APP.\nOut of total 92 marble units in the federal capital, around 68 so far were registered, he said.",
  "retrievedAt": "2025-08-11T20:08:24.498Z"
}
