{
  "title": "Face mask demand help fashion designers, tailors earn livelihood amid COVID-19",
  "link": "https://www.app.com.pk/national/face-mask-demand-help-fashion-designers-tailors-earn-livelihood-amid-covid-19/",
  "date_published": "2020-12-13T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 13 (APP): As COVID-19 pandemic has changed the fashion industry, leading textile and fashion brands not only in Pakistan but globally have come up with new creative designs of face masks to match with their collections which was gripping the attention of fashion conscious people specially youngsters.\nThe fashion industry is gearing up and making variety of masks as people are increasingly becoming safety conscious and are seen wearing face masks as they step out.\nAccording to designers, face masks are now the latest fashion accessory and part of the lifestyle worldwide, not just another healthcare item.\n“We are receiving large orders for all types of textile masks with different cloth materials and designs”, said Saira Rizwan a veteran designer while talking to a private news channel.\n“Our fashion masks have received a good response from our regular customers,” another Nida Azwer said, adding, we aimed to continue selling face masks for good because they had become essential goods for customers.\n“The pandemic hurt the fashion business greatly, particularly after retail malls were ordered to close,” Tabassum Mughal said but we have adjusted to survive, shifting to face masks to gain new opportunity to get income.”\nA citizen Sabahat Sheikh commented that since Covid-19 had taken over the world, the big brands had begun producing face masks, adding, it was not just Pakistani brands, but international brands were also making masks as well. While these masks are sustainable and environmentally friendly.\nAnother designer who is making bridal face masks said that these masks were heavily embellished and compliment her bridal dresses. These masks are for brides whose weddings are happening amidst coronavirus.\nThe coronavirus pandemic has made the face mask a staple of our everyday wardrobe, said Azfar Subhan a tailor.\nHe further said the markets and fashion houses were brimming with variety of ready to wear face masks which boasting of quirky prints, bedazzling embellishments, elegant embroideries, hand-painted designs to attract the people and some of families while visiting tailoring shops were also demanding their matching masks.\nAn official of local company also commented that his management had designed a face masks with logo of its company which gave a new look and safety to all employees.",
  "retrievedAt": "2025-08-11T20:08:22.070Z"
}
