{
  "title": "Islamabad police establish first cyber crime investigation unit to combat digital offenses",
  "link": "https://www.app.com.pk/national/islamabad-police-establish-first-cyber-crime-investigation-unit-to-combat-digital-offenses/",
  "date_published": "2024-01-11T11:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): The newly inaugurated Cyber Crime Investigation Unit within the Pakistan police department has been officially established as part of Islamabad Police’s efforts to strengthen the fight against cybercrimes.\nThis milestone initiative comes on the heels of amendments to the Prevention of Electronic Crimes Act (PECA), empowering Islamabad Police to register cybercrime cases under Section 30.\nSeeking to harness specialized expertise, Islamabad Police have collaborated with the Federal Investigation Agency (FIA) to leverage technical assistance in the investigation of cybercrimes. The partnership is geared towards addressing the intricate challenges posed by cyber threats and ensuring a robust response to the evolving landscape of digital offenses.\nThe successful completion of the first phase of training for 60 officers from Islamabad Police, in collaboration with the FIA, marks a crucial step in building a skilled workforce proficient in handling cybercrime cases. These officers have undergone specialized training to equip them with the knowledge and tools necessary for effective cybercrime investigations.\nTo streamline and centralize efforts, the Cyber Crime Investigation Center has been established at the F-6 Service Center. This state-of-the-art facility will serve as a hub for coordinating and conducting in-depth investigations into cybercrimes, providing a dedicated space for experts to analyze and respond to digital offenses.\nOperating under the authority of CPO Safe City and the oversight of SSP (Safe City), the officers of the Cyber Crime Investigation Unit will execute their responsibilities with precision, ensuring a thorough and coordinated strategy in addressing cyber threats.\nIn a citizen-friendly move, individuals are encouraged to approach any police station to request the inclusion of cybercrime cases, fostering community involvement in the fight against digital offenses.\nThe F-6 Cyber Crime Investigation Center is set to become operational from January 15, further fortifying Islamabad’s capabilities in combating cyber threats. The collaborative efforts between Islamabad Police and the FIA underscore a commitment to eliminating emerging forms of criminal activities and safeguarding the digital landscape for the residents of the federal capital.",
  "retrievedAt": "2025-08-10T23:33:01.401Z"
}
