{
  "title": "BISP Chairperson calls for promoting saving culture",
  "link": "https://www.app.com.pk/national/bisp-chairperson-calls-for-promoting-saving-culture/",
  "date_published": "2024-01-11T18:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP):Chairperson Benazir Income Support Programme (BISP), Dr. Muhammad Amjad Saqib Thursday said that saving is an important financial product that plays a pivotal role in individual protection.\nWhile addressing in a brainstorming session on Saving Scheme at BISP headquarters, Dr. Muhammad Amjad Saqib emphasized the importance of promoting a savings culture, revealing plans for the BISP saving scheme aimed at encouraging 150,000 customers to save.\nDuring the session, Dr. Amjad Saqib underlined the moral responsibility to support needy families while respecting their dignity. The event brought together BISP officials, representatives from various banks, and other financial institutions to discuss the design of Saving Product that would resonate with consumers and promote financial empowerment.\nDr. Amjad Saqib expressed his commitment to offer the best and most convenient Saving Product.\nHe stressed the need for simplicity in the product design and requested the nomination of focal persons from interested banks for efficient collaboration. Dr. Amjad Saqib said that BISP currently provides financial support to 9.3 million needy families, and under the BISP Savings Scheme the government would add an additional amount of Rs. 400.\nThe brainstorming session included a detailed briefing on the BISP Savings Scheme, where suggestions from bank representatives regarding savings product design were highly appreciated.\nDr. Amjad Saqib praised the efforts of the BISP team for their role in designing the Saving Scheme.\nThe key officials were also present at the session include Additional Secretary BISP Dr. Muhammad Tahir Noor, DG NSER Naveed Akbar, DG Finance Wasim Ahmad, DG OM Dr. Asim Ijaz, and Director Malik Muhammad Abu Bakr.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:32:40.965Z"
}
