{
  "title": "Freelancers to start receiving payments from PayPal in February: Minister",
  "link": "https://www.app.com.pk/national/freelancers-to-start-receiving-payments-from-paypal-in-february-minister/",
  "date_published": "2024-01-11T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): Caretaker Federal Minister for IT and Telecommunication Dr. Umar Saif on Thursday said that under the pilot project, 10,000 freelancers would start receiving payments from PayPal in February.\nAddressing a Tech Destination Pakistan event that featured the launch of E-Rozgar Centers in the country, he said, “In February, we are going to start the first pilot project in which 10,000 freelancers in Pakistan would be able to start receiving payments through PayPal.”\nThe minister further mentioned that in March, the program would be scaled up and everyone would have access to payments from PayPal and Stripe across the country.\nHe clarified that while PayPal itself is not coming to Pakistan, an agreement has been reached where remittances would be channeled through PayPal via a third party.\nUnder the newly devised program, the freelancers will not need to open a PayPal account. Instead, individuals outside the country will make payments from their PayPal accounts, and the funds will be promptly deposited into the freelancers’ accounts, the minister explained.\nThe minister said that the government has devised a mechanism for the opening of bank accounts for freelancers. He mentioned that only freelancers would have to provide evidence that they have an account on Fiverr, Upwork, Elance, Toptal, or Crossover.\nThe minister added, “The IT industry would have a 50 percentdollar retention policy, which means that whatever you earn, you can keep 50 percent of that in dollars. You will get a debit card from that bank so that you can freely spend that money domestically or internationally.”\nHe highlighted that the government has allocated enough funds for the establishment of E-Rozgaar centers across the country through a public-private partnership mode, facilitating an interest-free loan to shortlisted/qualified individuals and companies.\nHe said that the main objective behind the E-Rozgaar centers is to provide state-of-the-art infrastructure to enhance freelancers’ productivity and bolster Pakistan’s digital ecosystem.\nUnder the program, more than 250 E-Rozgaar Pakistan centers would be established through the public and private sectors.\nHe said that the initiative would foster inclusivity in the digital, financial, and economic sectors by cultivating a culture of freelancing and entrepreneurship in Pakistan.\nCurrently, he informed that work on almost 40 E-Rozgaar centers is in progress, and it is expected that all these E-Rozgaar centers shall be made operational by 19th February 2024.\nDr. Umar Saif said that the first standardized quality test for the 75,000 information technology graduates would be conducted on January 15.\nHe highlighted significant decisions made to revamp IT education in collaboration with various entities, including HEC, the National Computing Accreditation Council, the Examination Testing Council, the Pakistan Software Export Board, and the Pakistan Software Houses Association.\nDr. Saif said students who successfully pass the test will be offered job opportunities through the Industry Placement Program. He added that funds will be allocated to support special industry courses in universities, aiming to prepare students for current industry trends and needs.\nHe mentioned that the students would get a stipend from the government, and the companies that give them apprenticeships would get cash awards from the government.\nAt the same time, he said, the IT industry also needs highly skilled manpower, which is certified by international enterprise platforms Google’s and Microsoft’s, Cisco’s. “So this year, we’re going to train 16,000 people. These are people who already have IT skills but need international certifications in technologies like Salesforce, Cisco, Microsoft, Oracle financials, etc,” he added.\nHe said the government, under the SIFC, had taken some radical steps to facilitate the IT firms, which helped increase IT revenue by 13 percent during the last month.\nFederal IT Secretary Hassan Nasir Jami said within a short period, the IT ministry had introduced multiple initiatives to enhance IT exports and facilitate freelancers.\nHe said the IT ministry was committed to developing an IT ecosystem and called upon entrepreneurs, students, and developers to take advantage of opportunities available.",
  "retrievedAt": "2025-08-10T23:32:55.422Z"
}
