{
  "title": "CII chairman for imposing strict punishments for child abusers, abductors",
  "link": "https://www.app.com.pk/national/cii-chairman-for-imposing-strict-punishments-for-child-abusers-abductors/",
  "date_published": "2024-01-11T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): Council of Islamic Ideology (CII) Chairman Dr Qibla Ayaz on Thursday stressed the need for legislation imposing strict punishments for child abusers and abductors to send a strong message to the criminals and curb such crimes.\nHe was speaking at a seminar on “Addressing the plight of missing children and the corresponding legal framework in Pakistan”, organized by the Sustainable Development Policy Institute (SDPI) in collaboration with the Roshni Research and Development Welfare Organization – commonly known as Roshni Helpline 1138.\nThe CII chairman said that political instability and social discord created a space for evil forces in the society to easily commit various crimes, including child abductions and serial abuse.\n“The high prevalence of illiteracy allows fake religious figures (peers) to prey on aggrieved parents and further adds to their misery,” he added.\nSDPI Executive Director Dr Abid Qaiyum Suleri said that the issue of missing children and overall abuse of child rights could not be resolved by any single institution and only collective wisdom and collaboration could be the effective remedy.\nHe said that the diverse professional and social background of the speakers highlighted the multi-dimensional nature of the issue and the need for collective as well as individual responsibility.\nTauseef H Farooqi, former chairman of NEPRA, said that public regulators had a massive role to play in that regard.\nHe recalled that the National Electric Power Regulatory Authority (NEPRA) had taken five key CSR initiatives among which the awareness about missing children through electricity bills had been crucial. The loss of a child for a family was much more devastating as compared to the death.\nDr Jahanzeb Khan, Director General of Zainab Alert Response and Recovery Agency (ZARRA) said that the agency was mandated to issues alert when a report for a missing child was made through the Pakistan Electronic Media Regulatory Authority (PEMRA) and Pakistan Telecom Authority (PTA).\nHe said that the law enforcement agencies were responsible to immediately lodge a FIR for missing children and notify to ZARRA.\nHe highlighted that the law-enforcement agencies had notified 2271 cases, out of which 1411 children were recovered.\nHe maintained that child rights and child protection were shared responsibilities and any progress “in these domains is not possible without collective efforts”.\nDr Syed Kaleem Imam, former federal secretary, stressed the need for addressing root causes of the issue to ensure the safety of the children. He emphasized that understanding and addressing the underlying psychological and social causes behind such predatory behaviour was crucial.\nStrengthening of law-enforcement must go hand in hand with scaling up individual responsibility and cognizance, he said,, suggesting the sensitization and capacity building of law-enforcement personnel, especially female police officers.\nDr Tabassum Naz, Director of Schools, Federal Directorate of Education, stressed the need for preventative measures to protect children.\n“We need to identify the weak links which lead to the issue of missing children and address the root causes.” The proactive role of children and increasing vigilance over children could save them from such mishaps.\nShe pointed out that “our society being male dominant, is more relaxed about the security of boys, which is contributing to the higher prevalence of missing reports among the boys”.\nEarlier, Executive Director of Roshni Helpline 1138, Muhammad Ali, shared that Roshni Helpline had assisted over 20,000 families and successfully recovered over 9600 children nationwide because of the helpline’s innovative campaigns initiated to raise awareness about the issue.\n“This remarkable achievement was made possible through the concerted efforts of volunteers, law enforcement agencies and other stakeholders,” he added.\nIn 2023, he said, the helpline 1138 received a total of 2633 reported cases, with 658 families still awaiting the return of their loved ones. Notably, 70 per cent of the cases reported in the last five years involved boys, and children aging between 11 to 17.\nHe said,”According to our findings, about 99 per cent missing children are from lower and lower middle classes.”\nHe added that male children were more at risk of abduction as compared to female ones since boys security was usually taken for granted.\nHe highlighted the challenges faced by Roshni Helpline, including its awareness for ZARRA Act 2020 which had significantly contributed to the safety, security, recovery, and rehabilitation of the missing children.",
  "retrievedAt": "2025-08-10T23:32:28.535Z"
}
