{
  "title": "Govt resolute in commitment to combat terrorism on soil of Pakistan: Solangi",
  "link": "https://www.app.com.pk/national/govt-resolute-in-commitment-to-combat-terrorism-on-soil-of-pakistan-solangi/",
  "date_published": "2024-01-11T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP):Caretaker Federal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi said on Thursday that the government was resolute in its commitment to combat terrorism on the soil of this country.\nHe was delivering his speech as chief guest at the launching ceremony of the Annual Security Assessment Report by the Pakistan Institute for Conflict and Security Studies (PICSS).\n“On behalf of the federal government, let me assure you that we are constantly working to address the issue of terrorism through various hard and soft measures”, he said.\nHe said that Pakistan had repeatedly asked interim Afghan government to address Pakistan’s counter-terrorism concerns, especially the space available to militant groups like TTP to operate in and from Afghanistan.\n“Pakistan expects a positive response from the Afghan government. Pakistan has also raised the issue of access\nto modern weapons in Afghanistan to these militant groups besides involvement of Afghan nationals in anti-state violence in Pakistan”, he said adding without addressing the issue of terrorism, both countries could not embark on the journey of economic growth and development.\nMurtaza Solangi said on Thursday that there would be no negotiations with armed terrorist groups.\n“There will be no talks with terrorists as long as they are armed and do not accept the constitution of Pakistan”, Murtaza Solangi said categorically. He said that JUI Chief Maulana Fazl ur Rehman’s visit to Afghanistan was unofficial.\nIn a statement, he said that before leaving for his visit,  Fazl ur Rehman took a briefing from various institutions.\n“If any politician wants to play a constructive role for the improvement of relations between the two countries, we have no objection”, Murtaza Solangi said. The minister said that government will use the insights from this report to refine its strategies and ensure the safety and security of our citizens. He applauded the dedicated team of researchers at PICSS for its tireless efforts for producing a comprehensive and insightful security report.\n“Your commitment to understanding and addressing complex security challenges is commendable, and your work forms the backbone of informed policy decisions”, he maintained.\nThe minister said that in today’s dynamic world, data-driven reports were the cornerstone of informed decision-making and PICSS had set an exemplary standard in this regard. He opined that such reports not only provide a comprehensive understanding of the security landscape but also serve as a roadmap for policymakers. The invaluable insights derived from data are crucial for developing effective strategies to safeguard our nation.\nPakistan Institute for Conflict and Security Studies (PICSS) is not a new name in media and it is quite encouraging to note today that it is equally popular among the diplomatic community.\nThe minister said that PICSS made valuable contributions for society by conducting various research studies.\nHe said that  PICSS’s country-wide campaign “Pakistaniat” to engage youth has touched  his heart as this was an excellent approach to safeguard our youth from falling prey to extremist ideologies.\nHe said, he was glad to note that  PICSS applied data driven approach and provides objective analysis of security and conflict-related developments in Pakistan and the immediate neighbourhood.\nThe minister said, he was also happy to note that PICSS had developed a database of anti-state violence in Pakistan since 2001 and now has expanded it to the whole of South Asia including Afghanistan.\nThis can be beneficial for researchers to conduct research on various issues of militancy besides allowing PICSS researchers to conduct research and prepare weekly, monthly and annual reports like the one being formally launched today.  Stressing the need for a more robust engagement between governments and think tanks, he said that such events underscore the importance of fostering collaborative environments.\n“It is through such partnerships that we can bridge the gap between theory and practical, implementable solutions.”\nThe minister said that PICSS Annual Security Assessment Report 2023 was an outcome of thorough research which presented data in a very easy-to-understand format.\nEmphasizing the pivotal role media organizations play in shaping public opinion and awareness, Solangi said that building strong liaisons between media and think tanks, like PICSS was crucial. Such partnerships will provide the media with a deeper understanding of the intricacies of the security landscape, enabling them to disseminate accurate and well-informed news, he opined.\nHe said  PICSS self-sustaining financial model to generate funds for its operations was a role model for other institutes and think tanks as this  provided  enough space to operate independently and without any influence.\nThink tanks should be independent from any influence to conduct unbiased research and analyses for greater good of the society, he said and added that he was confident that think tanks like PICSS will continue to provide research-based advice for the policy makers to deal with various conflict and security related issues that plague our country and society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T23:33:21.499Z"
}
