{
  "title": "KSA fully dedicated to enhance facilities for Hajj & Umrah pilgrims: Ashrafi",
  "link": "https://www.app.com.pk/national/ksa-fully-dedicated-to-enhance-facilities-for-hajj-umrah-pilgrims-ashrafi/",
  "date_published": "2024-01-11T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 11 (APP): Prime Minister’s Special Representative on Religious Harmony and Pakistani Diaspora in the Middle East and Muslim Countries Hafiz Muhammad Tahir Mahmood Ashrafi on Thursday said that the Kingdom of Saudi Arabia (KSA) was dedicated to enhancing facilities for the Hajj and Umrah pilgrims.\nHe was talking to the media on his return after attending a four-day Hajj and Umrah Services Conference and Exhibition, organized by the Saudi Government in Jeddah.\nMinister for Religious Affairs Aneeq Ahmed, Chairman of the Hajj Organizers Association of Pakistan Jamal Khan Tarkai, Sardar Sajid Ali, Hafiz Muhammad Tariq, Akhlaq Ahmed, and other dignitaries actively engaged in the conference.\nAshrafi, who is also the chairman of Pakistan Ulema Council, stated that the Government of Pakistan was making comprehensive efforts to offer optimal facilities to prospective pilgrims.\nHe said in pursuit of bolstering coordination with Saudi officials for Hajj and Umrah services, two agreements were signed. Additionally, prizes were conferred upon select sponsoring companies during the inaugural session of the conference and exhibition.\nAshrafi emphasized that the event placed significant importance on enhancing the overall environment for Hajj and Umrah pilgrims.\n“It demonstrated a steadfast commitment to improving and promoting services for the pilgrims,” he added.\nHe noted that the conference drew the attention of numerous leaders, fostering discussions on future trends and creating opportunities for local and international partnerships, agreements, and initiatives.\nThe event also aimed to showcase the Kingdom’s efforts in terms of Hajj and Umrah services and arrangements, he maintained.",
  "retrievedAt": "2025-08-10T23:32:19.994Z"
}
