{
  "title": "Railways all set to restore Akbar Bugti Express in March",
  "link": "https://www.app.com.pk/national/railways-all-set-to-restore-akbar-bugti-express-in-march-2/",
  "date_published": "2024-02-18T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Pakistan Railways is set to restore one more passenger train `Akber Bugti Express` from Quetta to Lahore to facilitate the passengers of the routes and generate more revenue for the department.\n“The decision to restore Akber Bugti Express train has been taken on the directions of the caretaker Minister for Railways Shahid Ashraf Tarar,” an official in the Ministry of Railways told APP.\nHe said the train would facilitate the people of Quetta and Punjab provinces to travel to Balochistan and vice versa.\nCurrently, the Jaffer Express is the only operational passenger train in Balochistan being run between Quetta – Peshawar, besides local Chaman and Hurnai trains.\nTo a question, he said in a bid to accommodate passengers, Pakistan Railways expanded the network of its express trains to 96 last year, running all over the country to better felicitate the commuters.\n“Before completing the network of 96 trains over the entire railway network, the last year the figure of trains is 86 which will be improved after the concentrated efforts of the department,” he added.\nThey said He said the facilities being provided to the passengers at railway stations include waiting rooms, vending stalls, station restaurants, wheelchairs, an information desk, computer reservation facilities, public address system to inform the public about the arrival/departure of trains, provision of paramedics and 1st aid facility, online reservation facility, passenger insurance service and revival of help desks at stations facilities in trains.\nAbout punctuality, he said the overall punctuality ratio of trains has improved from 76 to 93 percent in five months owing to close monitoring and stern measures taken by Pakistan Railways at the divisional and ministry levels.\n“With the punctuality of trains and concrete measures taken by the department in the last five months, the number of passengers has increased by over 20 million, which is ample proof of the department’s achievement,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:46:24.148Z"
}
