{
  "title": "Fly Jinnah inaugurates first international flight connecting Islamabad and Sharjah",
  "link": "https://www.app.com.pk/national/fly-jinnah-inaugurates-first-international-flight-connecting-islamabad-and-sharjah/",
  "date_published": "2024-02-18T13:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP):Fly Jinnah, Pakistan’s low-cost carrier, celebrated the inaugural flight of its first international route from Islamabad, Pakistan to Sharjah, UAE with a dual ceremony at Islamabad International Airport before departure and at Sharjah International Airport, where the aircraft received a warm welcome upon arrival.\nThe inaugural flight carried onboard Fly Jinnah’s senior leadership along with a group of travel agents, media, and social media personalities among others said a news release.\nThe inaugural ceremony at Sharjah International Airport was welcomed with a traditional water cannon salute and followed by a welcome ceremony at Sharjah Airport attended by Pakistan’s Ambassador in the UAE, Faisal Niaz Tirmizi, in addition to senior management representing Sharjah International Airport and Air Arabia.\nCommenting on the occasion, Fly Jinnah’s spokesperson said: “Yesterday marked a significant milestone for Fly Jinnah as we inaugurated our first international flight after a successful year of domestic operations. Sharjah’s location serves as a perfect gateway to the United Arab Emirates with its proximity to the rest of the country. This step also reflects our unwavering commitment to providing our passengers with more travel options as we look forward to expanding our network to more exciting destinations”.\nFly Jinnah remains steadfast in offering convenient and affordable service to its passengers. With its modern fleet of five Airbus A320 aircraft, the airline currently connects five major cities in Pakistan, namely Karachi, Lahore, Islamabad, Peshawar, and Quetta, in addition to the newly launched international destination to Sharjah in the UAE.\nIn addition to the extra comfort provided by the most generous seat-pitch of any economy cabin, the carrier offers affordable and value-driven travel experiences through “SkyCafe” onboard menu where passengers can enjoy a wide variety of delicacies between snacks, sandwiches, and meals at affordable prices. The aircraft is also equipped with “SkyTime”, a free in-flight streaming service that allows passengers to stream a wide selection of entertainment directly to their devices.\nCustomers can now book their flights by visiting Fly Jinnah’s website (www.flyjinnah.com), by calling the call centre (111-000-035) or through travel agencies.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:46:00.404Z"
}
