{
  "title": "Friends of Margalla Hills, civil society protests; demand CDA to de-seal visitors’ info centers",
  "link": "https://www.app.com.pk/national/friends-of-margalla-hills-civil-society-protests-demand-cda-to-de-seal-visitors-info-centers/",
  "date_published": "2024-02-18T14:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 18 (APP): The Friends of Margalla Hills National Park and members of the civil society on Sunday staged a peaceful protest outside the CDA-sealed visitors’ information center at Trail-5 to condemn the civic agency’s move that deprived many national and international tourists of credible knowledge on the wildlife and nature of the national park.\nThe protestors held placards with slogans written on it particularly “Save Margalla Hills”, “CDA Leave Margalla Hills”, “STOP Destroying Margalla Hills” and chanted slogans “We will have to protect Margalla Hills”.\nA protestor requesting anonymity told APP that the demonstration and rally of Islamabad’s civil society and friends of Margalla Hills at Trail-5 was against the sealing of visitor information centers by the Capital Development Authority (CDA).\nHe said the Islamabad Wildlife Management Board (IWMB) staff was holding special awareness sessions for the masses visiting the national park. “After myriad of efforts, all the trails of the Margalla Hills were made plastic and littering free which was mainly due to the dedicated efforts of the Board staff and the members of the civil society supporting its nature preservation efforts,” he added.\nHe added that the protestors only demanded the federal capital’s civic agency de-sealing of the Visitor Information Centres at Trail-5 & 6.”The CDA illegally sealed the visitor information centers on Trail-5 & 6, where many domestic and foreign tourists were educated on the national park’s biodiversity and its protection. The CDA’s move has posed a threat to the Margalla Hills National Park and its wild animals, he alleged.\nIt may be mentioned here that the CDA through its Board’s decision has moved a summary to reclaim the old Islamabad Zoo from the IWMB and establish a modern Zoo for the federal capital residents. However, the Board in response had moved to the Supreme Court of Pakistan to seek its help for implementation of the Islamabad High Court’s decision that mandated the Board to officially manage the Zoo as the civic agency’s maltreatment of wild animals particularly the Asian Elephant, Kavaan and the pair of Brown Bears brought a bad name to the country.\nThe CDA in strange effort sealed the visitors information centres at the Trail-5 & 6 stating the reason that its land use was only permissible for official purposes of the Board whereas the latter had violated the condition by allowing residence to its staff.",
  "retrievedAt": "2025-08-11T00:45:38.634Z"
}
