{
  "title": "CM Maryam removes Lahore’s Mayo Hospital CEO, medical superintendent over complaints - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Chief Minister Maryam Nawaz on Thursday sacked the chief executive officer and the medical superintendent of the Mayo Hospital on complaints of patients and their attendants.\n\nDuring a visit to the hospital, patients and their attendants made complaints to her regarding non-availability of medicines, poor treatment conditions and uncleanliness.\n\nExpressing her displeasure, she reprimanded the administration of the Mayo Hospital.\n\n“The condition of Mayo Hospital is pathetic… people come to the hospital with the expectation and hope of getting timely treatment but the administration here is unaware about the condition of wards,” the CM said and added whatever was happening to the patients, had it happened to their near and dear ones then they would have realised.\n\nOrders outsourcing of rural health centres\n\n“Why should the people be punished for someone’s mismanagement. Why are the patients and their families being badly treated in the Mayo Hospital for not getting even syringes and branula,” she said and noted presence of insects in the cardiology ward.\n\nA girl told the CM that her mother was sick. She said she got tired of running around all night for getting medicines. After listening to her girl, the CM summoned an emergency meeting at Mayo Hospital and conducted a detailed inquiry into the affairs of the hospital and sought an explanation from all the stakeholders.\n\nShe directed to undertake immediate steps to pay all outstanding dues of medicines. She directed to ensure 100 per cent supply of medicines at Mayo Hospital and directed the health secretary to identify those responsible for committing negligence and take stern action against them.\n\nThe CM also sought a comprehensive plan for the repair of Mayo Hospital. She also checked the supply of medicines, syringes, branulas and other items in the store.\n\nShe reviewed the emergency block, ICU, cardiology and other wards of Mayo Hospital.\n\nShe ordered removal of Mayo Hospital CEO Dr Ahsan and MS Dr Faisal Masood from their positions.\n\nMeanwhile, the CM ordered outsourcing of rural health centres across Punjab.\n\n“Health centres will be provided with medical and diagnostic facilities on a par with big hospitals. General surgery, gynaecology, diagnostics, medical tests and other facilities will also be made available,” she said and added these health centres would remain open 24/7 a week after outsourcing RHCs.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:49:24.426Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896235/cm-maryam-removes-lahores-mayo-hospital-ceo-medical-superintendent-over-complaints",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:09:42.000Z"
}
