{
  "title": "Eight arrested, stolen drugs recovered in Dera Ghazi Khan - Pakistan - DAWN.COM",
  "author": null,
  "content": "DERA GHAZI KHAN: As many as eight people, including health department employees, have been arrested and millions of rupees worth of stolen medicines recovered after a scandal involving the theft and illegal sale of government medicines surfaced here some days back.\n\nThe investigation, which has uncovered a vast network involved in the illicit trade of medicines, is expected to lead to more arrests in the coming days.\n\nThe scandal came to light when Pervez, a health department employee, was caught while attempting to transport government medicines to Peshawar.\n\nFollowing his arrest, Chief Drug Inspector Faisal Mahmood initiated a thorough investigation, leading to the registration of case No. 207/25 at Gadai Police Station. The scope of the investigation has since been expanded, with the case now being handled by senior officials from the Anti-Corruption Establishment and the health department.\n\nProbe into scam continues\n\nOver the past two days, Anti-Corruption Circle Officer Malik Abdul Majeed, Chief Drug Inspector Faisal Mahmood Khan, and a team from the health department conducted raids at the Central Health Centre in Sarwarwali. During the operation, they recovered ‘DTL Fail’ medicines and other drugs worth millions of rupees, which were hidden in old rooms. Three rooms at the Sarwarwali Health Centre and two rooms at the district health office have been sealed.\n\nAccording to health department sources, approximately 1,400 cartons of children’s food supplements, including Ready-to-Use Therapeutic Food (RUTF), and other medicines worth nearly Rs1 billion have been seized so far.\n\nThe ongoing investigation by the health department and the ACE has revealed a large network involving health employees and private individuals. This network has been allegedly purchasing medicines from hospitals and government health centres across Punjab and other parts of the country, and selling them in cities like Peshawar, Lahore and Quetta. The illegal operation is believed to have been ongoing for the past five to six years.\n\nAmong those arrested are Pervez, Athar Sheerani, Amir Timur, former storekeeper Bashir Ahmed, Malik Ahmed, Farhan, Ali Usman, Zafar, and private individuals Siraj, Ikramullah, Azam, Bilal from Multan, Ali, and Numan Pathan from Peshawar. The ACE has also arrested Ali Usman and Zafar from the Lahore health department DG office, while raids are ongoing to arrest the remaining suspects.\n\nTwo of the arrested individuals, Bashir and Timur, were presented before area magistrate Muhammad Ahsan, where the investigating officer requested a 12-day remand. The court granted a two-day physical remand to the ACE investigation officer and the suspects are scheduled to appear in court again on March 8.\n\nSource say more arrests, including health department officials and employees, are expected as the probe continues. The case is being closely monitored by senior officials from the health department, police and ACE to ensure a thorough investigation and bring all involved parties to justice.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:49:07.584Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896225/eight-arrested-stolen-drugs-recovered-in-dera-ghazi-khan",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:09:43.000Z"
}
