{
  "title": "IHC bench on missing persons dissolved as judge recuses - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A special bench of the Islam­abad High Court (IHC), which was scheduled to hear the missing persons’ cases on Thursday, was dissolved when one of the three judges recused himself from hearing.\n\nThe bench, headed by Justice Mohsin Akhtar Kayani and having Justice Tariq Jahangiri and Justice Arbab Mohammad Tahir as its members, was to take up several cases pertaining to enforced disappearances.\n\nHowever, as the bench assembled, Justice Kayani announced that Justice Tahir had stepped down. He then sent the case files to the chief justice for the reconstitution of bench.\n\nJustice Tahir was among those six judges who, through a letter, had accused an intelligence agency of meddling in the judicial affairs.\n\nHowever, he distanced himself from the five judges — Justice Kayani, Justice Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Rafat Imtiaz — who had raised objection over the recent transfer of judges and subsequent change of seniority list.\n\nJustice Kayani sends matter to chief justice for bench reconstitution; Justice Tahir doesn’t cite reason for recusal\n\nEarlier in October, Justice Tahir and Justice Jahangiri had dissented from Justice Kayani’s directive for holding an in-camera briefing from military and civil intelligence agencies on the matter related to the Baloch missing persons.\n\nBoth the judges had questioned the IHC’s authority and jurisdiction for holding in-camera proceedings on security matters related to Balochistan.\n\nJustice Kayani’s order sought a comprehensive presentation on each case, including the circumstances of the disappearance, the state’s response and the feasibility of the prosecution or recovery. He also inquired about a long-term policy to address the issue.\n\nJustice Kayani had directed the registrar office to arrange for the in-camera proceedings in the court, to be attended only by intelligence officials, law officers and defence ministry representatives.\n\nWhen the order, authored by Justice Kayani, was shared with Justice Jahangiri and Justice Arbab, both members of the bench opposed it.\n\nThe dissenting note states: “With utmost respect at our command, we are unable to subscribe the direction to the extent of conducting in-camera proceedings/briefing regarding security situation of province of Balochistan as the said territory is outside the jurisdiction of this court.”\n\nBoth judges, however, stated in a note jointly signed by them that “we would like to hear the learned attorney general for Pakistan in the matter in light of the decision of the federal cabinet on the next date of hearing”.\n\nThe two judges were of the opinion that “under Article 90 of the Constitution, the executive authority of the federation is exercised by the federal government. The federal government consists of the prime minister and federal ministers, which acts through the prime minister who is the chief executive of the federation. The prime minister and members of his cabinet are elected representatives. They represent will of the people of Pakistan”.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:01:32.015Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896262/ihc-bench-on-missing-persons-dissolved-as-judge-recuses",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:10:03.000Z"
}
