{
  "title": "Arshad Sharif murder case: Govt seeks time from SC to ratify mutual legal assistance pact with Kenya - Pakistan - DAWN.COM",
  "author": null,
  "content": "The government has sought more time from the Supreme Court to ratify a mutual legal assistance agreement with Kenya in journalist Arshad Sharif’s murder case as the constitutional bench took up the hearing on Friday.\n\nSharif was shot in the head when Kenyan police opened fire on his car in October 2022. He had left Pakistan in August 2022 after multiple cases of sedition were registered against him in different cities.\n\nIn August last year, former chief justice of Pakistan Qazi Faez Isa had explained that the Arshad Sharif murder case was not fixed before a five-judge larger bench as it did not require any constitutional interpretation.\n\nIn July, the top court had referred the case back to the three-judge committee constituted under the Supreme Court (Practice and Procedure) Act, 2023 to re-fix it before a five-judge bench.\n\nFriday’s suo moto case was taken up by a six-member constitutional bench headed by Justice Aminuddin Khan.\n\nAt the outset of the hearing, the federal government sought more time to ratify the mutual legal assistance agreement with Kenya.\n\nAdditional Attorney General (AAG) Aamir Rehman informed the court that a mutual legal assistance agreement has been signed with Kenya, the process of ratifying the agreement was underway.\n\nHe added that the document would be ratified by the president within a month.\n\nThe members of the constitutional bench raised questions over the case’s slow progress.\n\nJustice Hassan Azhar Rizvi asked why the agreement had not been ratified yet if it was signed on December 10 last year.\n\nWhile addressing the AAG, Justice Jamal Khan Mandokhail asked: “Will we have to ask you for a progress report on a daily basis?”\n\nMeanwhile, Justice Muhammad Ali Mazhar, while speaking to the AAG, said: “More time is being sought even after three months?”\n\nJustice Rizvi observed that a well-known journalist of Pakistan was mercilessly murdered. “Why is the Pakistani government not supporting the journalist’s family in Kenya?”.\n\nThe joint secretary (interior) informed the court that the Ministry of Interior had written a note to the Ministry of Foreign Affairs for mutual legal cooperation.\n\nJustice Rizvi directed that a progress report be submitted to the court on a daily basis.\n\nJustice Khan remarked: “Our concern is that so much time has passed, why has there been such a delay in the Arshad Sharif [murder] case?”\n\nJustice Naeem Akhtar Afghan remarked that the Kenyan court had issued a decision which should be brought to the court record. “The Kenyan High Court gave its decision in July and you have not brought it to the court record,” he said.\n\nThe SC directed that the Kenyan High Court’s decision be brought to court record and adjourned the hearing for a month on the request of AAG Rehman.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/0716555547facf6.jpg",
  "retrievedAt": "2025-08-25T15:00:49.956Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896382/arshad-sharif-murder-case-govt-seeks-time-from-sc-to-ratify-mutual-legal-assistance-pact-with-kenya",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T09:30:21.000Z"
}
