{
  "title": "Fear and favour - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT came as something of a pleasant shock. Pakistan, long sidelined in America’s list of foreign policy priorities, received a surprise commendation in the US parliament on Wednesday.\n\nUS President Donald Trump, while addressing the Congress for the first time since taking power, credited Pakistan for arresting the “mastermind” behind the 2021 Kabul airport bombing, which had killed 13 American soldiers and 170 Afghan citizens.\n\n“I want to thank especially the government of Pakistan for helping arrest this monster,” Mr Trump said.\n\nThe development triggered much excitement in Pakistan, with Prime Minister Shehbaz Sharif quickly thanking the US president for “appreciating Pakistan’s role and support” and reminding him of Pakistan’s “critical role in counterterrorism efforts aimed at denying safe havens to terrorists”. Thrilled TV pundits and commentators, too, seized on the development, with many taking it as an indicator that the ice between Washington and Islamabad may have finally thawed. Meanwhile, there must have been much disappointment in the opposition camp, which has been waiting eagerly for Mr Trump’s endorsement of their own cause.\n\nIt would be wise, however, not to get swept up in the excitement just yet. It is quite likely that Mr Trump was merely scoring a few political points against his predecessor, Joe Biden, whom he blames for botching the US withdrawal from Afghanistan. By taking credit for nabbing a key antagonist from that tumultuous period, he may have wanted to demonstrate strength against Mr Biden’s perceived weakness.\n\nIt is also worth remembering that Mr Trump is a very transactional person, always looking to maximise his advantage in any situation. It would, therefore, be quite surprising if the arrest of one terrorist completely overhauled Islamabad’s diplomatic equation with Washington.\n\nIn fact, a new Reuters report suggests Pakistanis could face US visa restrictions as soon as next week. The final decision is to be based on a US government review of countries’ security and vetting risks, three informed sources have told the international wire service. Pakistan has been recommended for inclusion in the list, along with Afghanistan, according to Reuters.\n\nThe Trump administration’s position on Pakistan will become clearer with time, but what our leaders need to do immediately is to stop giving it more leverage by constantly seeking its approval. Our problems are ours alone to solve — the sooner we recognise that, the better.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:00:50.353Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896298",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T02:41:30.000Z"
}
