{
  "title": "Army act already upheld by earlier courts, Constitutional Bench told - Pakistan - DAWN.COM",
  "author": null,
  "content": "• SCBA says civilians should not be tried by military courts, all steps should aim at elimination of terrorism\n• Hamid Khan recalls that suspects in Rawalpindi Conspiracy case faced special tribunal, not military trial\n\nISLAMABAD: The Supreme Court Bar Association (SCBA) stated before the Constitutional Bench (CB) on Thursday that the provisions of the Pakistan Army Act (PAA) 1952 being deliberated upon today had already been upheld by earlier courts which found them to be within the framework of the Constitution and therefore cannot now be termed unconstitutional or illegal.\n\nAt the same time, the SCBA in a statement said it believes that civilians should not be subjected to trial before military courts.\n\nThe statement came after the SCBA’s executive committee met on Wednesday to deliberate and formulate its views on the issue. The one-page statement, issued on behalf of SCBA President Mian Muhammad Rauf Atta, was furnished before the CB on Thursday.\n\nHeaded by Justice Aminuddin Khan, the seven-judge bench had taken up a set of 38 intra-court appeals moved by the federal and provincial governments, Shuhada Forum Balochistan, etc against the October 2023 verdict.\n\nThe statement said the SCBA will continue to work for constitutional values in the country and it believes that security, peace, and law and order are also primary constitutional values. Moreover, the people of Pakistan deserve peace and harmony in the country, especially in view of recent increase in security threats and terrorist attacks on the innocent civilians.\n\nTherefore, it emphasised, all legal and constitutional measures should be directed towards the elimination of terrorism from Pakistan and for peace and security for its citizens.\n\nAccording to the statement, the SCBA believes in upholding the law and the Constitution in Pakistan and always advocated maintaining the enforcement of the provisions of Constitution.\n\nIt said the association had always stood for the principle that the law must be applied equally and without any discrimination.\n\nThe association stressed that it was for the Supreme Court to interpret the provisions of applicable law and determine their constitutionality as well as the applicability in the given facts and circumstances of each case.\n\nFirst constitution\n\nMeanwhile, senior counsel Hamid Khan, appearing on behalf of the Lahore Bar Association and Lahore High Court Bar Association, in his arguments cited the historical aspect of the army act by stating that when the act came, Pakistan was being governed through the Government of India Act. The first Constitution in Pakistan came in 1956 after which the fundamental rights were introduced for the first time, he added.\n\nThe counsel recalled how the first amendment to the army act was introduced in 1967, adding that the first trial on allegations of hatching a conspiracy — known as the Rawalpindi Conspiracy case — was held in 1951.\n\nThe counsel argued that people like Faiz Ahmed Faiz were nominated in that case and then Rawalpindi Conspiracy Special Trial Act 1951 was introduced to try the suspects on charges that through the Rawalpindi conspiracy they wanted to impose a communist system in the country.\n\nHe said the accused included many civilians as well as Gen Akbar Khan, adding that the trial was conducted through a special tribunal and not by a military trial.\n\nJustice Muhammad Ali Mazhar wondered whether the special tribunal was formed only to try the accused involved in the Rawalpindi Conspiracy case.\n\nThe counsel explained that the point he was making was that the Rawalpindi Conspiracy case involved top civilians as well as non-civilian officers, but the trial was done not through by the military trial but through the special tribunal, adding that the military court was first formed in 1953.\n\nThe counsel recalled how when the Ahmadiyya riots broke out in Lahore in 1953, selective martial law was imposed in the city. And to try the accused in­­volved in the riots, military courts were formed, he said, adding that Maulana Abdul Sattar Niazi and Maulana Maududi were also tried by those courts.\n\nThe CB then postponed further proceedings to Monday.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:49:09.374Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896263/army-act-already-upheld-by-earlier-courts-constitutional-bench-told",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:10:03.000Z"
}
