{
  "title": "Uproar over member’s arrest dominates Senate - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PTI lawmaker held for illegal poaching, Senate told\n• Shibli says Bappi’s arrest not made in ‘normal manner’; law minister defends action\n• BAP senator chides chair for withholding SBP bill vote result\n• Sherry urges rethink of counter-terror strategy\n• Chair urges all stakeholders to ensure house is run with grace\n\nISLAMABAD: After a strong protest by the opposition, the Senate was informed on Thursday that PTI lawmaker Aon Abbas Bappi had been arrested on charges of illegally poaching Chinkara deer in Cholistan.\n\nThe issue of Mr Bappi’s arrest and alleged manhandling was raised by Leader of the Opposition Syed Shibli Faraz, who termed the move part of “fascist” steps being taken to push the opposition to the wall.\n\nImmediately after suspension of the question hour, Mr Faraz said police had arrested Mr Bappi during a raid at his Multan residence. He wondered whether a proper procedure was followed for the arrest and prior intimation was conveyed to the Senate Secretariat.\n\n“If not, then it is just a formality to be a member of the house and the senators have no dignity,” he said, adding that the house should assert itself to restore its respect.\n\nPreviously, he recalled, Senate Chairman Syed Yousaf Raza Gilani had issued production order for PTI Senator Ejaz Ahmad Chaudhary, but it was not implemented.\n\nHe said video footage of Mr Bappi’s arrest showed that police had barged into the premises and resorted to vandalism.\n\nLaw Minister Azam Nazeer Tarar said they had the same concerns about the arrest as the opposition had, but a system should work under certain rules despite the fact that lawmakers had some privileges about their arrest or release.\n\nHe said Mr Bappi was wanted by the Bahawalpur police in a case registered by the Punjab Wildlife Department against the senator for illegal hunting of Chinkara deer.\n\n“Hunting in Cholistan is a serious crime because certain endangered species live over there,” Senator Tarar said, adding that the action was taken as per the law and it was not an illegal detention, which was his primary concern. “We will take up the matter with the Punjab government, police and the complainant department,” he added.\n\nMr Faraz, however, claimed that the arrest was not made in a normal manner, adding that police did not show arrest warrant. He said police first went to Mr Bappi’s factory. “It sounds like a cheap joke that all this was done on the charge of (illegal) hunting,” he said.\n\nThe Parliamentary Leader of PTI, Ali Zafar, called the action political victimisation and said the law minister should have censured the officials who had narrated the “funny” story of arrest to him. He appealed to the chair to cease the business of house till Senator Bappi is produced.\n\nHeated exchange\n\nThe highlight of the day was an exchange of hot words between BAP’s Manzoor Ahmed Kakar and Deputy Chairman Syedaal Khan, Nasar who chaired the proceedings at the time.\n\nAmid Mr Zafar’s speech, Mr Kakar sought permission to speak first.\n\nWhen the chair asserted that the floor was not with Mr Kakar, the latter shouted, telling the former to “behave and avoid using your hands to express yourself”.\n\nMeanwhile, the PTI members walked out of the house to protest Mr Bappi’s arrest.\n\nIn his ruling, the deputy chairman ordered his office and the law minister to share a comprehensive report on the arrest at the earliest. He ruled that members would be allowed to speak as per the rules of business, adding that house would not be run under anyone’s dictation or pressure.\n\nThe chair urged the leader of the house, the opposition leader and parliamentary leaders of all parties to talk to one another to ensure that the house is run with grace and dignity.\n\nMr Kakar, however, chided the deputy chairman for withholding the result of vote count on the SBP amendment bill tabled by PTI’s Mohsin Aziz.\n\n“Where were the constitution, law and rules you often talk about,” he asked.\n\nPPP’s parliamentary leader Sherry Rehman raised the alarm on escalating terrorism, calling for a united national response.\n\nSpeaking on a point of public importance, she warned that the situation posed an existential threat to Pakistan’s security and economy.\n\n“We need a dedicated session to discuss this rising terror threat, followed by a joint resolution in parliament, a formal condemnation, and a high-level in-camera briefing to formulate a strategic response,” she urged.\n\nCase against senator\n\nDerawar police in Bahawalpur booked Senator Bappi and nine others in the alleged illegal hunting case.\n\nThe FIR was lodged on March 1 by Muhammad Hakim Khan, head watcher of the Wildlife Department. The complainant alleged that on the night of Feb 28 at Toba Nooranwali, ten armed persons, including Mr Bappi, were illegally hunting deer in the desert.\n\nWhen they were stopped, they opened fire, threatened officials with dire consequences and attempted to bundle them in their vehicles. But on request, they spared the complainant, but his team spotted five slaughtered deer in their vehicles.\n\nMajeed Gill in Bahawalpur also contributed to this report\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/070750134ccbd7c.jpg",
  "retrievedAt": "2025-10-12T01:49:58.688Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896272/uproar-over-members-arrest-dominates-senate",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:21:53.000Z"
}
