{
  "title": "New Zealand set for ‘scrap’ with India on slower pitch in Dubai: Santner - Sport - DAWN.COM",
  "author": null,
  "content": "DUBAI: New Zealand skipper Mitchell Santner on Thursday said a slower pitch in familiar territory for India in Dubai will make for a tight contest in the ICC Champions Trophy final.\n\nThe two teams clash on Sunday to decide the winners of the eight-nation tournament held in Pakistan and the United Arab Emirates.\n\nRohit Sharma’s India are playing all their games at the Dubai International Stadium after they refused to tour hosts Pakistan because of unspecified reasons. They beat Australia in the first semi-final on Tuesday.\n\nNew Zealand defeated South Africa in the second semi-final at the Gaddafi Stadium in Lahore on Wednesday and now move back to Dubai where they lost the last group match to India by 44 runs.\n\n“I guess finals cricket is different, but for us what we have been doing to get us to this point has been good,” Santner said on his arrival in Dubai.\n\n“But obviously we have come against a good side, who have played all their games in Dubai and know that surface and we will be better for the run we had the other day against them,” the skipper said.\n\n“Obviously the surface will dictate a little bit of how we want to operate. Will be slower than what we got in Lahore, might be more of a scrap.”\n\nThe tournament’s tangled schedule, with teams flying in and out of the UAE from Pakistan while India have stayed put, has been hugely controversial.\n\nThe pitches have been vastly different in the two countries.\n\nPakistan tracks produced big totals — the Black Caps posted a Champions Trophy record 362-6 before restricting South Africa to 312-9 in the semi-final in Lahore, in contrast to the slow and turning decks of the Dubai stadium.\n\nBut Santner said the team has taken the travel in their stride.\n\n“It’s all part of the challenge,” said Santner. “We have been to every place here obviously into Pakistan and Dubai. But I think the guys understand that it’s part of it these days.”\n\nNew Zealand won a tri-series tournament in Pakistan with South Africa as the third team and had many of their players in top form getting into the 50-over tournament.\n\nLeft-hander Rachin Ravindra hit his second century of this tournament in the semi-final clash and put on 164 runs with in-form Kane Williamson, who hit 102.\n\n“Obviously that tri-series before — the tournament was handy in guys getting in form, especially into one of these tournaments which are quite short, three games and you’re into the semis,” said Santner.\n\n“We have had a bit of a roll on and hopefully it continues.”\n\nThe captain added: “We are here now and boys are pretty excited for the challenge ahead. One day off at training but the boys be fizzing and ready for the main event.”\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/07105349770cf47.jpg?r=105532",
  "retrievedAt": "2025-10-12T01:49:04.153Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896342/new-zealand-set-for-scrap-with-india-on-slower-pitch-in-dubai-santner",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T03:50:43.000Z"
}
