{
  "title": "Experts at Karachi seminar call for measures against unregulated traffic noise - Pakistan - DAWN.COM",
  "author": null,
  "content": "Health experts on Friday held a seminar at Karachi’s Civil Hospital and called for measures to address noise pollution caused by unregulated traffic.\n\nThe discussion was held today to mark the World Hearing Day, which was observed on March 3, in collaboration with the Dow University of Health Sciences (DUHS), and was attended by several experts in the field.\n\nAccording to the head of the ENT Department, Zeba Ahmed, the unregulated noise from traffic and at workplaces such as factories was a form of pollution requiring government-level measures.\n\nAhmed highlighted that hearing impairments can be caused by excessive use of mobile phones, Bluetooth devices, earbuds, and hands-free equipment emitting radiation.\n\nDuring the seminar, ENT residents discussed various ear-related diseases, diagnoses, and treatments.\n\nAt least 100 patients of Chronic Suppurative Otitis Media (CSOM) underwent surgery at the Civil Hospital from January 2024 to March 1, 2025, according to data presented at the session.\n\nThe seminar also discussed delays in treating ear pain or inflammation, which lead to surgery, and even complete hearing loss. Many patients approach doctors only at the final stage of their illness, necessitating the use of hearing aids.\n\nAhmed highlighted that the day served as a reminder of hearing care facilities globally, focusing on disease prevention, therapy, and rehabilitation methods to preserve hearing.\n\nShe emphasised the importance of preventive measures recommended by the World Health Organisation (WHO), which begin at home. “Training and awareness about hearing care should start within households,” she said.\n\nNoise pollution can cause health problems to people residing in urban areas, but traffic noise is often overlooked in Karachi. Researchers found that every five-decibel increase in 24-hour noise level correlates with a 34pc increase in heart attacks, strokes, and other heart-related problems.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:00:50.315Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896380/experts-at-karachi-seminar-call-for-measures-against-unregulated-traffic-noise",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T09:01:03.000Z"
}
