{
  "title": "India & Trump 2.0 - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE recent Modi-Trump meeting ended with many predictable outcomes and a few surprise announcements. The predictable outcomes include the India-US willingness to cooperate on strategic affairs and mitigate irritants related to economic and tariff issues.\n\nThe surprise announcements include the extradition of Mumbai attack suspect Tahawwur Rana and the sale of fifth-generation fighter jets.\n\nThe meeting has paved the way for more high-level engagements during Donald Trump’s presidency. The India-US 2+2 ministerial dialogue was initiated under Trump 1.0. It proved to be instrumental in deepening India-US ties. The structured dialogue has developed an unprecedented level of trust between the top leadership of the US and India. The dialogue will continue to take place on a regular basis under Trump 2.0.\n\nMoreover, the significance of the Quad grouping will further grow under Trump 2.0. It is likely that the Trump administration will push to expand the Quad membership by incorporating other likeminded regional countries and converting it to ‘Quad Plus’ to secure Washington’s strategic interests.\n\nFurther, Trump’s aggressive approach towards China will prove to be a breath of fresh air for India. New Delhi has often voiced concerns over China’s growing influence in South Asia. The victory of political leaders in smaller South Asian states with a tilt towards China and last year’s Monsoon Revolution in Bangladesh put India’s neighbourhood foreign policy under pressure during 2023-2024.\n\nHowever, Beijing’s projects, such as the Belt & Road Initiative and strategic cooperation with South Asian states, will be under scrutiny during Trump 2.0. New Delhi has the ability to repair its relationship with the smaller South Asian states, and Trump’s aggressive stance against China would caution South Asian countries about entering Beijing’s camp.\n\nTrump’s presidency offers strategic opportunities to India.\n\nHowever, New Delhi’s policy of ‘strategic autonomy’ will be under scrutiny by the Trump administration. During Joe Biden’s administration, India managed to remain neutral in the Russia-Ukraine conflict. Despite Western pressure, it purchased Russian oil on discounted prices, giving a lifeline to Russia’s sanctioned and war-torn economy. However, Indian defiance of the Trump administration in such kinds of confrontations will not be met with a measured American response.\n\nSimilarly, New Delhi adopted a policy of muting dissident voices abroad during the Biden administration. The Amit-Doval duo will likely remain cautious about aggressively following this policy during Trump’s tenure. Further, New Delhi cannot defend the issue of Indian illegal immigrants in the US. Trump’s aggressive policy on illegal immigrants will compel India to agree to repatriate illegal Indian immigrants.\n\nIndia initially agreed to take back 18,000 illegal immigrants, which demonstrates New Delhi’s willingness to cooperate with the Trump administration. However, the repatriation and accommodation of 725,000 Indians will have sociopolitical implications for Indian society and government.\n\nAnother major challenge to India-US relations under Trump 2.0 seems to be their different priorities regarding bilateral trade and tariffs. India is benefiting from a $32 billion surplus in the $118bn bilateral trade. In 2018, Trump elevated India’s Strategic Trade Authorisation Tier 1 status.\n\nHowever, due to New Delhi’s conservative economic policies, the US raised duties on India’s steel and aluminium industries. India responded with higher taxes on American exports, such as almonds and apples. Subsequently, Trump withdrew India’s GSP status in June 2019, citing India’s failure to give equitable and reasonable access to its markets.\n\nWhile New De­­lhi wants the reinstatement of this status, the Trump administration seems more interested in negotiating sector-speci­fic adjustments to get an equitable share in trade. India’s announcements to buy $10bn additional energy and increase defence purchases will reduce the trade imbalance. However, the finalisation of a bilateral trade agreement will be a hard nut to crack. Both sides failed to sign a similar agreement despite exhaustive negotiations in 2020.\n\nTrump’s presence in the White House offers several strategic opportunities to New Delhi. However, the India-US relationship will also face some irritants in foreign policy and the economic domain. As of now, trends in the India-US relationship under the Trump administration show a positive trajectory. Minor adjustments will help New Delhi to significantly avail the benefits of emerging strategic opportunities.\n\nNarendra Modi’s call to Trump, S. Jaishankar’s visit to the US, and the Modi-Trump summit suggest that New Delhi is ready to adapt to the new realities of American politics.\n\nThe writer is director of the India Study Centre at ISSI.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67ca5e447e7b9.jpg",
  "retrievedAt": "2025-10-12T01:49:43.017Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896300",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T02:48:50.000Z"
}
