{
  "title": "Judges take exception to changes in IHC culture - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Justice Sattar concerned over practice of court staffers seeking ‘gratuity’ from litigants\n• Justice Imtiaz questions changes to rules concerning authority of senior puisne judge\n\nISLAMABAD: Two judges of the Islamabad High Court (IHC), Justice Babar Sattar and Justice Saman Rafat Imtiaz, have separately expressed concerns over a recent practice of demanding gratuity by the court staff and changes to the rules that stripped the senior puisne judge of their powers.\n\nIn a letter issued to the secretaries of the acting chief justice and all the judges of the IHC, Justice Sattar observed that “the pernicious practice of court staff chasing after counsel and/or litigating parties, who have been granted relief by the court, to demand gratuity and handouts has begun raising its ugly head in Islam­abad High Court recently”.\n\nThe judge wrote that “the staff of Islamabad High Court are full time employees of the court and are paid appropriate compensation for their services and duties as fixed by law [therefore], for an emp­loyee to seek gratuity from a counsel or a litigating party for having been gra­nted some relief by the court is an act of misconduct.\n\n“It is common knowledge that court staff demanding gratuity and handouts from litigating parties and/or their counsels in certain other high courts… Such practice has thus unfortunately seeped into the culture of such courts. There is no such practice in Islamabad High Court and it is great relief that such baleful practice has never taken root in the practice culture in the Islamabad High Court,” Justice Sattar stated. He said that “it is therefore alarming that demand of gratuity/handouts have been reported in the backdrop of certain court staff recently…transferred from other high courts to Islamabad High Court”.\n\nThe judge suggested that the registrar of the IHC can verify by reviewing the video footage of the past couple of weeks to confirm whether any court staff can be seen demanding such gratuity/handouts, and proposed strict action against the staff involved in this practice.\n\nPowers of senior-most judge\n\nIn a related development, Justice Imtiaz expressed reservations over the change to rules by the administration committee headed by former IHC chief justice Justice Aamer Farooq.\n\nFollowing the change to the rules, Justice Mohsin Akhtar Kayani, who previously held key decision-making responsibilities, has lost much of his authority.\n\nThe IHC Administration Committee, which was previously composed of the chief justice, the senior puisne judge, and a senior judge, was restructured to include Chief Justice Dogar and two of his nominees.\n\nThe changes were formalised through amendments to Rule 237, Chapter 10 of the High Court Rules.\n\nThe revised provision now states, “The Administration Committee, headed by the chief justice, ordinarily shall consist of three judges. However, the chief justice, if deemed appropriate, may nominate more members of the committee.”\n\nAdditionally, Rule 239 now says, “Each member of the Administration Committee shall act as an administration judge, and the powers and duties of each administration judge shall be defined by the chief justice from time to time.”\n\nPreviously, the senior puisne judge automatically held the position of administration judge, which gave them substantial authority over court affairs.\n\nHowever, the new rules grant the CJ discretionary powers to assign administrative duties, significantly limiting Justice Kayani’s role.\n\nAccording to the judge, the rule could only be amended in a full court meeting as provided in the Constitution. According to Article 202 of the Constitution, subject to the Constitution and law, a high court may make rules regulating the practice and procedure of the court or of any court subordinate to it.\n\nA senior official of the IHC clarified that the administration committee headed by the chief justice was the relevant forum to amend the rules, as there was no provision to make or change the rules in a full court meeting.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/07085648dc57d13.jpg",
  "retrievedAt": "2025-10-12T01:48:26.189Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896273/judges-take-exception-to-changes-in-ihc-culture",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:21:53.000Z"
}
