{
  "title": "Pakistan backs US move to reclaim military assets - World - DAWN.COM",
  "author": null,
  "content": "• FO warns of threat from US weapons abandoned in Afghanistan\n• Rejects Indian minister’s remarks on Kashmir as ‘provocative’\n\nISLAMABAD: Pakistan on Thursday endorsed a United States plan to recover military equipment left behind in Afghanistan, citing security concerns over its use by terrorist groups.\n\nForeign Office spokesperson Shafqat Ali Khan, speaking at a weekly media briefing, said Pakistan supports the idea of the US reclaiming its weapons but dismissed claims that Islamabad was actively facilitating such actions.\n\n“The assertion of Pakistan supporting any US action in this regard is too speculative. This is not what we have said. This is a matter between Afghanistan and the US,” he said.\n\n“USA left its weapons there. We have supported the idea that the US can try to get its weapons back. Our concern is that those weapons have been found being used by terrorists in their operations inside Pakistan. We have flagged it,” he said.\n\nHe maintained that if Washington could retrieve the equipment, it “would be helpful for the overall regional security environment”.\n\nThe remarks come days after Pakistan extradited Mohammad Sharifullah, an Islamic State-Khorasan (IS-K) operative, to the US.\n\nCaptured near the Pakistan-Afghanistan border, he was wanted for his role in planning the Aug 26, 2021, suicide bombing at Kabul’s Abbey Gate during the US withdrawal from Afghanistan.\n\nPresident Donald Trump, in a March 4 address to Congress, had hailed Pakistan’s cooperation in securing Sharifullah’s extradition. National Security Adviser Mike Waltz later discussed the issue with Foreign Minister Ishaq Dar, who backed the US plan to reclaim its weapons from Afghanistan.\n\n“He (Mr Dar) appreciated President Trump’s announcement to withdraw the US military equipment left behind in Afghanistan,” according to a Foreign Office readout of the conversation.\n\nEvolving stance\n\nPakistan’s position on Mr Trump’s announcement regarding weapons left behind in Afghanistan has evolved, with the latest statement marking the most explicit endorsement of retrieval efforts. The shift follows the latest security cooperation between the two countries in the capture and handover of Shareefullah.\n\nThe Foreign Office spokesman confirmed that intelligence sharing between Pakistan and the US remains an ongoing process and that Shareefullah was extradited under United Nations Security Council (UNSC) Resolutions 1267 and 1373, which mandate member states to take specific actions to counter terrorist threats.\n\n“Our security cooperation with the US has been an ongoing process. Security, counterterrorism, and intelligence cooperation is ongoing. There was not any hiatus which would need to restart because of a particular event,” the FO spokesperson said.\n\nIndian provocation on Kashmir\n\nThe spokesman also urged Indian leaders to implement United Nations resolutions on Jammu and Kashmir rather than making provocative statements, dismissing recent remarks by Indian External Affairs Minister Subrahmanyam Jaishankar as baseless and delusional.\n\nMr Khan, responding to Mr Jaishankar’s comments at a Chatham House session in London, condemned the increasing frequency of “unwarranted claims” by Indian officials over Azad Jammu and Kashmir.\n\n“With regards to the unfortunate and regrettable statement, we are witnessing an alarming increase in provocative statements from different Indian leaders asserting unwarranted claims over Azad Jammu and Kashmir. However, historical facts, legal principles, moral considerations and ground realities all refute these fictitious claims,” Mr Khan said.\n\nHe reaffirmed that Jammu and Kashmir remains an internationally recognised disputed territory, as designated by relevant UN Security Council resolutions.\n\n“Jammu and Kashmir is an internationally recognised disputed territory and the relevant UN Security Council resolutions clearly\n\nstipulate that its final status shall be determined by the will of its people through a free and impartial plebiscite under UN auspices,“ Mr Khan said.\n\n“The Indian leaders would be wise to help implement these resolutions instead of harbouring delusions of grandeur.”\n\nMr Jaishankar earlier asserted that India was waiting for what he described as the “return of the stolen part of Kashmir, which is under illegal Pakistani occupation”.\n\n“I think the path we are waiting for is the return of the stolen part of Kashmir… When that’s done, I assure you, Kashmir (issue is) solved,” he had said in response to a journalist’s question.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/070900504befb46.jpg",
  "retrievedAt": "2025-10-12T01:49:23.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896268/pakistan-backs-us-move-to-reclaim-military-assets",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:22:00.000Z"
}
