{
  "title": "LHC raises alarm over amendment to Income Tax Ordinance - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The La­­hore High Court’s (LHC) Rawalpindi bench raised serious concerns on Wedn­esday over recent amendments to the Income Tax Ordinance, 2001, noting the change significantly impacts taxpayers’ rights and burdens the judicial system.\n\nJustice Jawad Hassan, presiding over a tax dispute petition, noted that the Tax Laws (Amend­ment) Act 2024 had eliminated one level of appeal previously available un­­d­er the Income Tax Ordi­n­ance. The judge noted this amendment would subst­antially increase the caseload at the high court, further straining limited judicial resources.\n\nJustice Hassan obser­ved that decisions by tax authorities often lack clear reasoning and legal references, exacerbating taxpayers’ difficulties.\n\nHe added that the situation also discriminates ag­­ainst taxpayers since the Federal Board of Revenue (FBR) is exempt from cou­rt fees while ordinary litigants must pay Rs50,000 per tax reference.\n\nThe judge cited previous judgements, including Chenab Flour Mills vs Federation of Pakistan (PLD 2021 Lahore 343) and Ramzan Sugar Mills vs FBR (2021 PTD 1321), which declared the FBR as a regulatory body responsible for fiscal matters.\n\nThe court directed Dr Ishtiaq A. Khan, director general of FBR, to appear at the next hearing on March 25 and provide a detailed explanation on the policy rationale behind the amendment.\n\nIt also asked the FBR to explain the impact of the amendment on the judicial process and taxpayers’ rights as well as the delay in tax litigation and justice administration caused by the new law.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:01:32.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896264/lhc-raises-alarm-over-amendment-to-income-tax-ordinance",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T01:10:03.000Z"
}
