{
  "title": "Sindh defends costly off-roaders for bureaucrats before SHC - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh government on Thursday defended its decision to buy costly vehicles for junior bureaucrats and informed the Sindh High Court that the spending of around Rs2 billion for procurement of 138 double cabin vehicles was a necessity.\n\nThey also asserted that these funds were already allocated in the budget of respective offices of assistant commissioners (ACs) for the current financial year and the decision to make centralised procurement was made keeping in view the efficiency, accountability and transparency in the process.\n\nThe reply filed on behalf of the secretary of services, general administration and coordination department further contended that apart from observing fiscal discipline, the government was actively inspecting and condemning un-roadworthy and unserviceable vehicles through motor vehicle inspectors paving way for an open auction of these condemned assets.\n\nThis initiative has already resulted in the recovery of more than 50 per cent of such vehicles which have been re-assigned to the appropriate departments and field offices, it maintained.\n\nSays 4x4 vehicles ‘necessary’ for assistant commissioners as officers in other provinces also have similar cars\n\nThe comments were filed in response to two petitions impugning a letter written on Sept 3, by the services, general administration and coordination department to the secretary of finance department for the release of nearly Rs2 billion funds to procure 138 vehicles (4x4 double cabins) for ACs across the Sindh.\n\nIn September, the SHC had restrained the provincial government from pursuing its plan to procure such vehicles and directed the top provincial officer to inform it about relevant rules/bylaws for such entitlement and comparison with the policy as adopted by the province of Punjab.\n\nThe secretary of services in his para-wise comments also submitted that other provinces have similarly equipped their administrative officers as the Punjab government had procured 4x4 double cabin vehicles in October for ACs while Khyber Pakhtunkhwa had also purchased such vehicles for officers of district administration over the last five years.\n\nIt maintained that in Sindh, only one vehicle was procured for the official use of the commissioner of Larkana during the last 10 years as no other vehicle was purchased for officers of the district administration.\n\nThe reply also stated that the ACs were the backbone of provincial administration tasked with enforcing government policies and decisions. They play a crucial role in maintaining law & order, price control, polio eradication, food management, election duties and other essential functions, it added.\n\n“As already submitted, the decision to procure double-cabin is not rooted in extravagance but in necessity. Assistant commissioners are tasked with critical duties that often required them to navigate challenging terrains and respond swiftly to emergencies,” it said.\n\nThe secretary services in his reply also argued that the petition did not merit consideration and may accordingly be dismissed with costs and the earlier stay order granted in the subject matter may also be vacated.\n\nEarlier, the petitioners, including Jamaat-i-Islami’s MPA Mohammad Farooq, had asserted that it was misuse of public money especially when the entire province was suffering from budgetary deficits, while almost the whole province had plain land and thus, there was no justification to purchase such luxurious vehicles.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:01:04.975Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896326/sindh-defends-costly-off-roaders-for-bureaucrats-before-shc",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T03:24:13.000Z"
}
