{
  "title": "SpaceX’s Starship explodes in space, again raining debris over Caribbean - World - DAWN.COM",
  "author": null,
  "content": "SpaceX’s massive Starship spacecraft exploded in space on Thursday minutes after lifting off from Texas, prompting the FAA to halt air traffic in parts of Florida, in the second straight failure this year for Elon Musk’s Mars rocket programme.\n\nSeveral videos on social media showed fiery debris streaking through the dusk skies near south Florida and the Bahamas after Starship broke up in space shortly after it began to spin uncontrollably with its engines cut off, a SpaceX live stream of the mission showed.\n\nThe failure of the eighth Starship test comes just over a month after the seventh also ended in an explosive failure. The back-to-back mishaps occurred in early mission phases that SpaceX has easily surpassed previously, a setback for a programme Musk had sought to speed up this year.\n\nThe 403-foot (123-meter) rocket system is central to Musk’s plan to send humans to Mars as soon as the turn of the decade.\n\nThe Federal Aviation Administration briefly issued ground stops at the Miami, Fort Lauderdale, Palm Beach and Orlando airports because of “space launch debris.” It said it had opened a mishap investigation into the incident.\n\nThe rocket lifted off about 6:30pm. ET (2330 GMT) from SpaceX’s sprawling Boca Chica, Texas, rocket facilities. The Super Heavy first-stage booster flew back to Earth as planned and was successfully grabbed in midair by a SpaceX crane.\n\nBut minutes later, SpaceX’s live stream showed the Starship upper stage spinning in space, while a visualisation of the rocket’s engines showed multiple engines shut down. Then the company said it had lost contact with the ship, and announcers immediately drew a connection to the previous flight.\n\n“Unfortunately, this happened last time too, so we’ve got some practice now,” SpaceX spokesperson Dan Huot said on the live stream.\n\nIn a statement late Thursday, SpaceX said Starship experienced an “energetic event” in its aft section, which resulted in the loss of several engines.\n\n“This in turn led to a loss of attitude control and ultimately a loss of communications with Starship,” the statement said. “Final contact with Starship came approximately 9 minutes and 30 seconds after liftoff.”\n\nSpaceX said there were no toxic materials among the debris.\n\nThe Starship failure in January ended eight minutes into flight when the rocket exploded, raining debris over Caribbean islands and causing minor damage to a car in the Turks and Caicos Islands.\n\nThe FAA, which regulates private rocket launches, said its investigation would require SpaceX to examine the failure’s cause and get the agency’s sign-off before Starship can fly again.\n\nThe FAA last month approved SpaceX’s launch license for Thursday’s test flight while its investigation into the company’s previous Starship failure remained open. In doing so, the FAA said it had reviewed SpaceX’s license application and early details from the company’s mishap investigation before determining that Starship’s eighth flight could proceed.\n\nStarship was aiming to make nearly a full orbit around Earth and re-enter over the Indian Ocean for a splashdown, simulating a landing sequence that SpaceX wants to soon carry out on land as a key next phase of the rocket’s development.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/07112451f1009ea.jpg",
  "retrievedAt": "2025-10-12T01:49:09.670Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896361/spacexs-starship-explodes-in-space-again-raining-debris-over-caribbean",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T06:28:10.000Z"
}
