{
  "title": "Trump threatens new Russia sanctions over Ukraine attacks - World - DAWN.COM",
  "author": null,
  "content": "President Donald Trump on Friday threatened new sanctions and tariffs on Russia over its bombardments of Ukraine, after previously suspending US aid to Kyiv in a stated bid to encourage diplomacy.\n\n“Based on the fact that Russia is absolutely ‘pounding’ Ukraine on the battlefield right now, I am strongly considering large-scale banking sanctions, sanctions and tariffs on Russia until a ceasefire and final settlement agreement on peace is reached,” Trump wrote on his Truth Social platform.\n\n“To Russia and Ukraine, get to the table right now, before it is too late,” he wrote.\n\nTrump’s threat comes after Russia launched major drone and missile attacks Friday on Ukraine’s energy infrastructure.\n\nDays earlier, the Trump administration suspended US military aid deliveries and intelligence-sharing with Ukraine after a dispute with President Volodymyr Zelensky.\n\nTrump and Vice President JD Vance, on February 28, berated Zelensky in a televised meeting at the White House, accusing him of ingratitude for billions of dollars in US weapons.\n\nTrump has since faced harsh criticism from allies and domestic opponents who say he has sided with Russia, which invaded Ukraine in 2022.\n\nThe United States voted with Russia and against its European allies on United Nations resolutions that called for ending the war without stressing Ukraine’s territorial integrity.\n\nLast month, Trump spoke with Russian President Vladimir Putin by telephone in an initial step toward resuming normal relations and undoing sweeping sanctions imposed under former president Joe Biden over the Ukraine invasion.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/072109156b375ed.jpg",
  "retrievedAt": "2025-08-25T15:00:48.469Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896434/trump-threatens-new-russia-sanctions-over-ukraine-attacks",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T16:10:25.000Z"
}
