{
  "title": "Jamshoro police ‘retain’ FIR against nearly 100 Sindh University students - Pakistan - DAWN.COM",
  "author": null,
  "content": "DADU: The Jamshoro police have retained the FIR registered against nearly 100 Sindh University students — 37 of them activists of different nationalist groups’ student wings — allegedly involved in a clash with police on Tuesday (March 4).\n\nMany of the booked suspects were rounded up soon after the complaint against them was lodged by SI Saleem Panhwar following the clash. However, they were set free after negotiations between Jamshoro SSP Zafar Siddique and some senior leaders of the political and nationalist parties that participated in an event at the university on the controversial canals issue.\n\nIt was learnt that the SI’s complaint was converted to an FIR later in the night.\n\nAccording to SI Panhwar, the FIR was registered with the approval of higher police officers.\n\nMany were rounded up after March 4 protest against canals project and clash with police at the university, but later freed on SSP’s order\n\nViolence on March 4\n\nThe March 4 event at the SU was organised by certain nationalist parties, including Jeay Sindh Qaumi Mahaz (JSQM) and its student wing, to pay tribute to those Sindhi students who had participated in the movement launched on March 4, 1967 against ‘One Unit’.\n\nThe event featured a march from the SU campus to the nearby section of the Indus Highway. However, strong contingents of police deployed along the route of the march tried to stop several hundred male and female students, as well as activists of the participating nationalist parties, from heading towards the highway.\n\nThis led to a clash between the two sides and police had to lob teargas shells and apply baton charge to disperse the marchers. The participants reacted to the police action by pelting police and their mobile vans with stones, causing injuries to some policemen and damage to at least two police vehicles.\n\nControversial canals\n\nThe speeches made at the event focused on the federal government’s controversial six-canal plan, corporate farming and other projects being regarded as detrimental to Sindh’s vital interests.\n\nAccording to the FIR, the students participating in the rally illegally blocked the Indus Highway and caused disruption in the flow of vehicular traffic. When police arrived at the scene to restore order, they were attacked by the marchers, it claimed, adding that two policemen, constables Farhan Loond and Sadaqat Ali, suffered injuries from the stones thrown at them.\n\nThe constables were admitted to the Liaquat University of Medical and Health Sciences (LUMHS) for treatment. Two police vehicles were damaged during the incident, it added.\n\nIt said that despite making attempts, the police could not arrest more than 10 students due to the presence of a large number of protesters. The traffic movement was, however, restored eventually after the crowd dispersed, it said.\n\nMeanwhile, Zubair Hussain Panhwar, Zahid Keerio and other student leaders have condemned registration of the FIR and called it a false and politically motivated case. They vowed to continue their struggle against the six canals.\n\nSindh United Party (SUP) President Syed Zain Shah, in his press statement, has demanded quashment of the FIR. Instead, action should be taken against those police officers and personnel, including the SSP, DSP and SHO of Jamshoro, who were involved in applying baton-charge and lobbing teargas shells to disperse the peaceful protesters, he said.\n\nHe warned of a severer public reaction if the demands were not met.\n\nPublished in Dawn, March 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/071030185c5e1f4.gif",
  "retrievedAt": "2025-08-25T15:01:04.416Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896311/jamshoro-police-retain-fir-against-nearly-100-sindh-university-students",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T03:00:44.000Z"
}
