{
  "title": "Rights advocates concerned by reported US plan to use AI to revoke student visas - World - DAWN.COM",
  "author": null,
  "content": "Rights advocates raised alarm, including free speech concerns, on Thursday after it was reported that the US State Department will use artificial intelligence to revoke visas of foreign students who it perceives as supporters of Palestinian Hamas fighters.\n\nThe US Constitution’s First Amendment protects freedom of speech and assembly. Free speech advocates like the Foundation for Individual Rights and Expression (FIRE) and pro-Palestinian groups said AI should not be relied upon for assessments related to the decades-old and nuance-filled Israeli-Palestinian conflict.\n\nAxios cited senior State Department officials to report that an AI-fueled “Catch and Revoke” effort will include AI-assisted reviews of tens of thousands of student visa holders’ social media accounts.\n\nThe report also said officials were checking news reports of demonstrations against Israel’s policies and Jewish students’ lawsuits highlighting foreign nationals allegedly engaging in anti-Semitism.\n\nFox News separately reported that the State Department revoked the visa of a student who allegedly participated in what the department termed as “Hamas-supporting disruptions.”\n\nThe revocation marked the first such action, according to the report.\n\nAI tools “cannot be relied on to parse the nuances of expression about complex and contested matters like the Israeli-Palestinian conflict,” Sarah McLaughlin, a scholar at FIRE, said.\n\nThe American-Arab Anti-Discrimination Committee said the reported developments “signal an alarming erosion of constitutionally protected free speech and privacy rights.”\n\nThe State Department was working with the Department of Justice and the Department of Homeland Security, according to Axios.\n\nThe State Department did not comment directly on the reports, but Secretary of State Marco Rubio said on social media that the United States “has zero tolerance for foreign visitors who support terrorists.”\n\nHe added that “violators of US law — including international students — face visa denial or revocation, and deportation.”\n\nThe other two departments did not immediately respond to requests for comment.\n\nPresident Donald Trump signed an executive order in January to combat anti-Semitism and has pledged to deport non-citizen college students and others who took part in pro-Palestinian protests that have been ongoing for months amid Israel’s invasion of Gaza after Hamas’ October 2023 attack.\n\nThe Fox News report did not mention any details about the person whose visa was revoked except that it was revoked on Wednesday, that the person was a university student and that the US Immigration and Customs Enforcement will proceed with removing that person from the country. It cited the State Department.\n\nSome pro-Palestinian groups are Jewish themselves, and many protesters have denounced antisemitism and Hamas.\n\nThere have been incidents of Islamophobia and anti-Semitism in pro-Palestinian protests and pro-Israeli counter-protests. The Trump administration has thus far announced no steps aimed at countering Islamophobia.\n\nTrump has said he will stop federal funding for educational institutions that allow what he called illegal protests.\n\n“Agitators will be imprisoned/or permanently sent back to the country from which they came. American students will be permanently expelled or .. arrested,” Trump said on Tuesday.\n\nWashington has designated Hamas as a “foreign terrorist organisation.”\n\nThe group’s October 7, 2023, attack killed 1,200 people, with over 250 taken as hostages including Israeli military personnel, according to Israeli tallies.\n\nIsrael’s subsequent military assault on Gaza has killed more than 48,000 Palestinians, according to Gaza authorities. It has internally displaced nearly everyone there, caused a hunger crisis and led to accusations of genocide and war crimes that Israel denies.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/071224241f69b68.jpg",
  "retrievedAt": "2025-10-12T01:49:40.296Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1896372/rights-advocates-concerned-by-reported-us-plan-to-use-ai-to-revoke-student-visas",
  "dateList": "2025-03-07",
  "date_published": "2025-03-07T07:37:28.000Z"
}
