{
  "title": "Interior Minister condemns terror attack on anti-polio team in South Waziristan",
  "author": null,
  "content": "ISLAMABAD, Apr 21 (APP):Interior Minister Mohsin Naqvi Monday strongly condemned the terrorist attack carried out by Khawarij militants on a police team assigned to provide security to an anti-polio vaccination team in South Waziristan. The attack, which was swiftly repelled by the alert and courageous police personnel, failed to cause any harm to the vaccination team or the security staff.\nAccording to official sources, the terrorists attempted to target the police contingent guarding the polio team in a remote area of South Waziristan. However, the police responded with exceptional bravery and professionalism, successfully thwarting the attack. One of the attackers was neutralized on the spot, while the rest fled the scene.\nInterior Minister Mohsin Naqvi lauded the efforts of the police, stating, “The Khawarij terrorists’ attempt to sabotage the polio campaign has been foiled by the bravery of our police officers. I salute their courage and commitment to their duty.” He further lauded the force for killing one of the assailants.\n“By ensuring the safety of the anti-polio team, our police personnel have not only fulfilled their professional duty but also upheld a crucial national cause,” the minister added. He emphasized that the government remains resolute in its mission to eradicate polio from the country and will not allow any elements to disrupt public health campaigns.\nMinister Naqvi said by offering a heartfelt salute to the “brave sons” of the police force, saying their valor was a source of pride for the entire nation.\nAuthorities have launched a search operation in the area to track down the fleeing militants, and security has been further tightened in the region to prevent any incident.\nThe polio vaccination campaign resumed following the incident without any delays, reaffirming the commitment of health workers and law enforcement agencies to serve the people in even the most challenging conditions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:44:20.203Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-minister-condemns-terror-attack-on-anti-polio-team-in-south-waziristan/",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T14:02:00.000Z"
}
