{
  "title": "No leniency for rioters: Tarar",
  "author": null,
  "content": "LAHORE, Apr 21 (APP):Federal Law Minister Azam Nazeer Tarar has stated that individuals involved in attacking state installations or damaging public property will not be garlanded with flowers and must face legal consequences.\nSpeaking to the media here on Monday, the minister emphasized that those who set government properties and police vehicles on the fire should not expect leniency. “When you attack installations or burn police vehicles, you won’t be welcomed with flowers,” he said.\n“Those involved in riots or attacks on military installations will be held accountable according to the law, and we will fully respect the court’s decisions,” he stated, adding that the courts are functioning independently and are regularly hearing cases.\nHe highlighted the contrast in the treatment of political figures, noting that former prime ministers once had to walk to court without VIP protocols, whereas today some individuals enjoy special access. “In fact, nowadays it’s almost VIP treatment—doors open, cars come with flags, and people attend bar functions,” he added.\nTarar said that the 26th Constitutional Amendment was part of structural reforms aimed at improving the system. He expressed the view that no further amendments are required at this stage but did not rule out the possibility of future amendments if necessary. “No one has knowledge of the unseen. If the need arises, all coalition parties and Parliament will come together to decide the way forward,” he added.\nHe also acknowledged the positive impact of establishing a constitutional bench, which has helped reduce the burden of daily cases.\nFurthermore, he voiced support for judicial infrastructure reforms, advocating for all courts in Lahore to be housed in a single complex, similar to the Karachi model. “This would benefit both the bar and the judiciary in terms of scheduling, administration, and accessibility,” he said. He acknowledged the efforts of Lahore High Court Chief Justice Aalia Neelum in this regard.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:42:35.795Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/no-leniency-for-rioters-tarar/",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T11:15:00.000Z"
}
