{
  "title": "Minister Pirzada chairs 40th Executive Board Meeting of FGEHA",
  "author": null,
  "content": "ISLAMABAD, Apr 21 (APP):Federal Minister for Housing and Works Mian Riaz Hussain Pirzada presided over the 40th Executive Board meeting of the Federal Government Employees Housing Authority (FGEHA) on Monday.\nThe meeting agenda included finalizing the disposal of FGEHA’s commercial properties under the revised Joint Venture (JV) and Public-Private Partnership (PPP) Rules 2025, and reviewing progress on key housing projects including Park Road, EFPRO, and F-14/F-15 projects. Other items discussed were the reimbursement of delayed completion charges submitted by the allottees of sub-sector G-14, and the endorsement of the HR Committee’s recommendations.\nThe agenda also included revisions in possession charges for FGEHA specified areas and approval of condominium law and rules for apartment buildings.\nIt was decided that eleven high-value commercial plots located in Mauve Area, G-13/4, G-14/2, the Skyline Project in Islamabad, Sky Gardens in Rawalpindi, and Cantt Station, Karachi will be offered through a mixed model comprising PPP, lease-operate, and open auction modes, in accordance with the revised JV Rules 2025.\nThis approach, inspired by previously successful models, aims to serve wider public interests and promote sustainable community development. The proposed commercial developments and land use include five-star hotels, international hospitals, IT tower, shopping mall, international school, apartment complexes, and mixed-use properties. The integrated model is expected to stimulate economic activity and maximize long-term public asset value.\nDuring the review of the Park Road Project, the board approved revisions in the land-sharing formula and layout plan, ensuring alignment with public welfare goals and legal frameworks. The board also approved the revision of possession charges for FGEHA specified areas and the reimbursement of delayed completion charges of sub-sector G-14.\nMoreover, the board decided to share the draft Condominium Act and Rules with the ICT Administration through the Ministry of Interior before presenting them for the federal cabinet. The board also endorsed the abolishing of redundant posts in FGEHA, while deferring the creation and upgradation of few posts to resubmit this item with detailed justifications.\nOn this occasion, Minister Pirzada directed the Additional Secretary, Ministry of Housing & Works, to investigate and submit a detailed report regarding staffing in subordinate bodies. He emphasized strict compliance with the Prime Minister’s directives on organizational rationalization.\nThe minister instructed that all loopholes hampering implementation be identified to ensure accountability and efficiency within the ministry and its attached organisations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:44:19.563Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/minister-pirzada-chairs-40th-executive-board-meeting-of-fgeha/",
  "dateList": "2025-04-21",
  "date_published": "2025-04-21T14:06:00.000Z"
}
