{
  "article_id": "2025-08-19_8e2ba231cd6dfdd5d15f5d06a496f88e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-seeking-improved-relations-with-us-uk-dpm/",
    "retrieved_at": "2025-08-20T04:53:32.243Z"
  },
  "metadata": {
    "title": "Pakistan seeking improved relations with US, UK: DPM",
    "author": null,
    "date_published": "2025-08-19T07:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 591,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 19 (APP): Deputy Prime Minister and Foreign Minister Muhammad Ishaq Dar Monday said Pakistan was seeking to improve its relations with the United Kingdom and the United States and will enhance trade ties with these countries. In an interview with state broadcaster Pakistan Television, he said during his meeting with UK's Parliamentary Under Secretary of State, they discussed various bilateral and regional issues including matters related to Afghanistan and Iran. The DPM is in London holding meetings with the UK leadership during his three day visit. He said he will hold a meeting with Secretary General of Commonwealth on Tuesday, adding Pakistan was an important member of Commonwealth and proactively participated in its activities. He will also meet with UK Deputy Prime Minister Angela Rayner to discuss bilateral and regional issues, trade and economy. He said Pakistan was seeking to expand its bilateral trade with the United Kingdom with the aim to increase it from the present level of $ four billion. To a question, he said the European Union had lifted ban on flights of Pakistan International Airlines while the PIA flights to UK particularly Manchester will resume in early September. He said while presiding the meeting of United Nations Security Council, Pakistan got passed a resolution for peaceful settlement of disputes. He told that as President of the UN Security Council his statement on peaceful resolution of disputes was officially adopted and put on the website of the United Nations. Pakistan also presided over a session on strengthening of partnership between the United Nations and Organization of Islamic Cooperation, he mentioned. He recalled that during an international conference called by France and Saudi Arabia at the United Nations, Pakistan forcefully presented its viewpoint calling for end of war in Gaza, provision of uninterrupted supply of aid to people in Gaza and for the reconstruction of the Gaza strip. He said he presented principled stance of Pakistan fully supporting Palestinians' right to self-determination and the establishment of an independent state of Palestine with Al-Quds Al-Sharif as its capital, based on the pre-1967 borders. To a question, the Deputy Prime Minister said in the recent past he had a constructive meeting with the US Secretary of State Marco Rubio during which they held a comprehensive discussion on regional issues, bilateral cooperation and anti-terrorism. Pakistan wanted to improve its relations with the United States, he said while appreciating role of the United States in the ceasefire reached between Pakistan and India after a conflict in May this year. On May 10, Secretary Rubio contacted him and told that India wanted ceasefire, after which Pakistan also gave its consent for cessation of hostility, he recalled. He said Pakistan was always desirous of peace, and mentioned that in June Pakistan nominated the US President Donald Trump for Nobel peace prize for his efforts to stop the war between Pakistan and India. Replying to a question, he said Indian Prime Minister Narendra Modi should accept that Pakistan defeated India in the recent conflict. But Indian PM continued to give political statements to hide his embarrassment and for public consumption, he remarked. He lauded role of the United States, United Arab Emirates, Saudi Arabia, Azerbaijan and United Kingdom in halting conflict between Pakistan and India. He said his meeting with the Pakistan diaspora was cancelled because of the tragic loss of lives in the recent flash floods in Pakistan. He commended the Pakistani diplomats and media for highlighting narrative of Pakistan and the leadership of armed forces for achieving success on the military front.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}