{
  "article_id": "2025-08-19_d5afa42aee5ff70b6ff7a7a4942bd338",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-army-rescues-6903-treats-6304-in-flood-hit-regions-ispr/",
    "retrieved_at": "2025-08-20T04:52:42.067Z"
  },
  "metadata": {
    "title": "Pakistan Army rescues 6,903, treats 6,304 in flood-hit regions: ISPR",
    "author": null,
    "date_published": "2025-08-19T23:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 344,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 19 (APP):Director General Inter-Services Public Relations (ISPR), Lieutenant General Ahmed Sharif Tuesday said that Pakistan Army rescue teams have successfully evacuated 6,903 stranded individuals and provided medical treatment to 6,304 patients in flood-affected areas. Briefing the media alongside Federal Minister for Information and Broadcasting Attaullah Tarar and National Disaster Management Authority (NDMA) Chairman Lieutenant General Inam Haider Malik, Lt Gen Sharif emphasized that relief and restoration efforts are ongoing, with additional personnel deployed to support communities in crisis. A total of 585 tonnes of ration have been allocated for flood-hit populations, from Army reserves, as directed by the Chief of Army Staff (COAS). Army aviation units are conducting aerial sorties to deliver supplies and evacuate residents from remote regions. Six sorties are scheduled for Tuesday, targeting inaccessible areas. In Buner, Swat, and Shangla, two battalions each have been deployed, while Frontier Corps wings are active in Bajaur and a company in Swabi. Relief logistics are bolstered by 2,500 tonnes of ready-to-eat rations was available, he said adding that with an additional 5,000 tonnes stocked at the Nowshera base for immediate deployment. Infrastructure restoration is also underway. In Khyber Pakhtunkhwa, 90 roads were damaged, with 110 critical repair points identified. Nine roads have been fully restored, and partial repairs completed at 86 locations. Jaw Bridge repair is 40 percent complete and expected to reopen within days. The Karakoram Highway, previously blocked at eight points, has been fully cleared. Restoration work continues at Astore bridges and along the Jaglot-Skardu Road. In Gilgit-Baltistan, the Engineering Brigade has repaired multiple bridges and is working to reopen roads in Shangla and Buner. The Signal Unit, in coordination with Pakistan Telecommunication Corporation Limited (PTCL), has restored 16 BTS towers to support emergency communications. Three Army medical units are operating nine medical camps in Khyber Pakhtunkhwa and Gilgit-Baltistan, having treated over 6,300 patients. Urban search and rescue teams are active in Buner, supported by two medical battalions. Medical teams from Combined Military Hospital and Military Hospital have also been deployed to provide continuous care in Buner, Shangla, and Swat.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}