{
  "article_id": "2025-08-19_4104af933d53f2700eeed0d36c310f31",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-deputy-donate-salaries-to-support-flood-victims/",
    "retrieved_at": "2025-08-20T04:53:32.565Z"
  },
  "metadata": {
    "title": "NA Speaker, Deputy donate salaries to support flood victims",
    "author": null,
    "date_published": "2025-08-19T19:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 291,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 19 (APP):National Assembly Speaker Sardar Ayaz Sadiq and Deputy Speaker Syed Ghulam Mustafa Shah have announced the donation of their one-month salary to support victims of the recent flash floods in Gilgit-Baltistan, Khyber Pakhtunkhwa, and Azad Jammu and Kashmir. In a joint condolence message, the Speaker and Deputy Speaker expressed profound grief over the tragic loss of lives and widespread devastation caused by the floods. They extended heartfelt sympathies to the bereaved families and assured full solidarity with the affected communities. Speaker Sardar Ayaz Sadiq emphasized that aiding and rehabilitating flood victims is a national duty, urging citizens across the country to actively participate in relief efforts. \"Every Pakistani has a responsibility to actively participate in the relief and rehabilitation efforts for the flood victims,\" he stated. Expressing deep sympathy for those affected, the Speaker noted that countless families are enduring immense hardship and grief. \"For those who have lost loved ones and whose bodies have not been recovered, their pain is especially difficult to alleviate,\" he added. Reiterating his condolences, Speaker Sadiq stressed that the nation stands united in times of crisis and that it is a collective responsibility to support those affected. \"We cannot abandon the flood victims in their time of need,\" he said, calling on the entire nation to come forward in support of relief and rehabilitation efforts. He noted that the people of Pakistan have consistently set an example of brotherhood and selflessness during difficult times. The Speaker also prayed for the elevation of the ranks of those who lost their lives in the floods and extended heartfelt sympathies to the families mourning their loved ones. He particularly mentioned the devastation in Buner, where entire families were affected, and expressed solidarity with the victims.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}