{
  "title": "Efforts afoot to Coronavirus challenges: Dr Zafar",
  "link": "https://www.app.com.pk/national/efforts-afoot-to-coronavirus-challenges-dr-zafar/",
  "date_published": "2020-02-01T02:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 1 (APP):The government is fully alive to Coronavirus challenge and devised a strategy for diagnosis and treatment of infected persons if found in Pakistan, said Special Assistant to the Prime Minister on Health Dr Zafar Mirza on Saturday.\nAddressing a news conference, the SAPM said all ministries and divisions are on board to tackle Coronavirus patients when and where found in the country.\n“Kits for diagnosis and treatment of Coronavirus would be received this evening while an effective awareness campaign is also on cards to sensitize people,” he added.The SAPM said there was no patient with Coronavirus was detected here, adding that some four Pakistani were diagnosed in China with the disease and their health was improving by each passing day.\nThe government of Pakistan and the Embassy in China were in constant contact with the affected students and their families for provision of every best medical treatment over there.\nPakistan stands with the stance of Chinese government who was pursuing the recommendation of World Health Organization to overcome the spread of disease, he maintained.\nZafar said quarantine has been initiated in China for Pakistani travelers to make them disease free as well as to prevent the spread of it.\nHealth Declaration Card would be distributed amongst all the passengers in view of Novel Coronavirus outbreak and passengers are advised to fill up the form and handover to Health Staff in the International Arrival Lounge.\nThe form contains demographic information of passenger, travel history and health status like issue of fever, cough and shortness of breath.\n“It is top priority of the government to keep people of the country safe from the deadly virus and no stone will leave unturned in that regard,” he said.\nGiving recent update on the spread of virus, he said at least 249 people were killed in china and 11,947 affected across the globe.",
  "retrievedAt": "2025-08-11T18:43:40.758Z"
}
