{
  "title": "Haleem Adil asks CM to step down for telling lies during budget session",
  "link": "https://www.app.com.pk/national/haleem-adil-asks-cm-to-step-down-for-telling-lies-during-budget-session/",
  "date_published": "2021-06-16T12:37:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 16 (APP): Opposition Leader in Sindh Assembly Haleem Adil Sheikh along with other party MPAs on Wednesday lashed out at Chief Minister Syed Murad Ali Shah for stating false, fabricated and baseless statistics while presenting the fiscal budget.\nHe stated this while addressing a press conference at his office in Sindh Assembly building here.\nPTI leader claimed that their decision to register the peaceful protest during the session was democratic right to expose the corrupt and wicked rulers of Sindh, who according to him, had failed to provide any relief to the people of the province and to bring changes in the damaged infrastructure by not carrying out schemes despite having more than enough funds at their disposal.\nHe claimed that the PPP rulers in Sindh had crossed all limits of the loot and plunder and caused widespread destruction and devastation everywhere.\nAdil Sheikh reiterated that the PPP rulers in Sindh received Rs 8,912 billion over past 13 years but they had done nothing for the people of the province adding, he said, that more than 80 percent of the amount was released to the Sindh government by the Federal government.\nHaleem Adil said that PPP rulers only spent the huge amount of Rs.1,646 billion on different so-called development schemes while the rest was lavishly spent on the merry-masking, dance parties and construction of the palatial places.\n“The corrupt rulers have committed the malpractices and embezzlement of Rs.7,226 billion by showing the amount to have spent in non-development”, he added, saying that those involved in such massive scams would have to be accountable for their huge corrupt practices and depriving the people of the province of all the basic amenities of life for past many years.\nHe said that Sindh Chief Minister had been holding the keys of Sindh’s treasure for the past 13 years and he was only interested in pleasing his masters by greasing their palms. ”\nMurad Shah over past 13 years had plundered the public money of Sindh mercilessly” he added and asked him to stop crying over the schemes announced by the Imran Khan-led Federal government for Sindh during the current fiscal budget.\nHe said that according to the government documents, Sindh government had spend Rs 1,450 on the education, Rs 1,768 on health, Rs 900 billion on the local government, Rs 800 billion on law and order and other departments but the ground realities from school buildings to hospitals and from overflowing gutters to the unabated killing of innocent cops during the encounters due to poor state of vehicles including APCs spoke contrary to their tall false claims.\n“The dilapidated school buildings have been turned into cattle pens, the hospitals of the province have turned into slaughter houses and big cities get inundated after light showers,” he remarked.\nHe said that incompetent rulers did not bother to spend even a single penny on nearly four hundred sanctioned schemes while they left as many as 2,246 schemes and projects across the province in doldrums despite the fact during past two years the sanctioned budgetary allocations could not be spent due to unknown reasons by the high-ups of Sindh government.\nHe further claimed that the Sindh government still had over Rs 85 billion in its kitty at a time when the financial year was likely to be over.\nHaleem said that the Federal government had already earmarked for different mega projects including a mega water scheme commonly known as K-IV water project and many other schemes for Karachi. The PTI leader made it clear that they would not allow PPP rulers to further ruin Karachi.\nHe said that Prime Minister Imran Khan was very much interested in adding more lights to Karachi by launching more projects. He said that the Sindh government during the upcoming fiscal year would get Rs 300 billion more and previous year they had received Rs 700 due to Covid-pandemic from the Federal government.\nHe further said that the budget presented by Shah was nothing but the jugglery of the words to hoodwink the people of the province while the Federal budget was the best one, which would provide relief to everyone across the country.",
  "retrievedAt": "2025-08-11T20:51:12.182Z"
}
