{
  "title": "Effective policing system inevitable for country’s prosperity: PM",
  "link": "https://www.app.com.pk/national/effective-policing-system-inevitable-for-countrys-prosperity-pm/",
  "date_published": "2021-06-16T14:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 16 (APP): Prime Minister Imran Khan Wednesday said that effective policing system was inevitable for country’s prosperity as peace and rule of law were prerequisite for wealth creation and attracting investment.\n“The police is supposed to ensure law enforcement. The law enforcement does not mean to put only poor vendors in jail. You should rather be lenient to them but strict to the powerful law violators,” the prime minister said.\nHe was addressing the inauguration of Eagle Squad comprising 100 well equipped patrol bikes for strict vigilance against street crimes across the city while being in constant connectivity with Islamabad Safe City headquarter.\nMinister for Interior Sheikh Rashid Ahmed, Inspector General Jamilur Rehman and Senator Faisal Javed attended the event besides the police officials who simultaneously performed their duties of monitoring the city’s streets and roads through cameras installed across the city.\nLIVE #APPNews : Prime Minister Imran Khan addressing inaugural ceremony of newly established “Eagle Squad” of Islamabad police at Safe City Headquarters #Islamabad @ICT_Police\nhttps://t.co/gSyROfwG9I\n— APP  (@appcsocialmedia) June 16, 2021\nAs per details, the Rs29 million project also consisted of training 500 police personnel who, while being on duty, would carry primary weapon MP5 and Glok Pistol 9mm as secondary weapon.\nThe bike patrol would also be equipped with LTE sets and could be GIS mapped and GPS based positioned.\nThe prime minister said if someone violated law, the police must take action regardless of his position “even if he is Imran Khan.”\nHe said only the societies with rule of law could prosper and repeatedly cited Hadith calling for uniform laws and indiscriminate action against the criminals.\nThe prime minister said in 60s Pakistan was progressing fast and enjoyed respect among comity of nations but it was undermined after the rule of law was compromised.\nThe prime minister assured the interior ministry of all out support to further upgrade the Safe City project what he believed would also save the manpower who otherwise have to bear harsh weather conditions while being deputed at check posts.\nHe said Eagle Squad was a better way to check the street crimes and again assured for extending resources for the project.\nHe said a country with peace and rule of law always attracted investment and led to wealth creation.\nHe said it would create good impression for the country when the foreign investors would witness a good police and protected environment in the federal capital.\nInterior Minister Sheikh Rasheed Ahmed said the Eagle Squad would replace the police check posts which used to cause traffic mess particularly for the commuters moving towards Murree.\nHe said all police check posts had been removed except one near French Embassy.\nHe said the ICT Police had also been equipped with hi-tech vehicles and another 16 would be added as the federal government had allocated “sufficient” budget for the project.\nHe said 300 police personnel removed from check posts would be used for the Eagle Squad.\nThe interior minister pointed out the shortage of women police personnel and sought approval to enhance their strength besides requesting the prime minister to approve a “law and order” allowance for ICT police, just like provinces.\nThe interior minister said his ministry was about to launch e-passport facility which would be also be available within 48 hours against additional charges of Rs2000.\nEarlier, Director Operations Syed Bilal, in his presentation, said by introducing IT, the ICT police had achieved transparency, efficiency and rule of law besides improving its working.\nA documentary was also played recounting ICT Police’s other initiatives including bicycle patrolling unit, police facilitation centers, reconciliation committees, e-police desk, dispute resolution units, gender protection unit, and launch of drive against over speeding and use of fancy number plates and tinted glasses.",
  "retrievedAt": "2025-08-11T20:51:08.663Z"
}
