{
  "title": "All resources to be utilized for welfare of people: Ch Sarwar",
  "link": "https://www.app.com.pk/national/all-resources-to-be-utilized-for-welfare-of-people-ch-sarwar/",
  "date_published": "2021-06-16T13:47:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jun 16 (APP): The government would utilize all available resources for improving the living standard ofpeople by providing them all basic amenities, said Governor Punjab Chaudhary Muhammad\nSarwar.\nHe was addressing a gathering while inaugurating a water filtration plant at Primary School\nChak No.214-RB Dhadiwala Sharqi here on Wednesday.\nFaizullah Kamoka, Chairman NA Standing Committee on Finance and Economic Affairs, Mian Khayal Ahmad Kastro, Provincial Minister for Culture and Colonies, President Sarwar Foundation Faisalabad Mirza Muhammad Asghar and a large number of people were also present.\nThe governor said the PTI government wanted to transform the country into a welfare state and in this connection, all basic amenities were being provided to the masses, including potable water, adding that the government was providing health cards to every citizen in Punjab whereas problems of the farming community was also being resolved on a top priority for agricultural development.\nHe said the government had set up Aab-e-Pak Authority which had planned to provide clean drinking water to 15 million people by the end of this year.\nHe said the government was also taking steps to improve life standard of the poor and in this connection Rs 256 billion had been allocated in the budget of new fiscal year so that the poor could be provided a substantial assistance.\nHe said that the government had also fixed minimum wage of Rs 20,000 for workers and this steps would also help to mitigate sufferings of the downtrodden segment of the society.\nLater, the governor also inaugurated a water filtration plant in Government High School Chak No.204-RB Canal Road Faisalabad and said that two more water filtration plants would be installed in this area very soon.\nThe governor also planted saplings in both schools under the PM Clean & Green Pakistan programme.",
  "retrievedAt": "2025-08-11T20:51:09.464Z"
}
