{
  "title": "Govt protected rights of people in budgets: Dr Firdous",
  "link": "https://www.app.com.pk/national/govt-protected-rights-of-people-in-budgets-dr-firdous/",
  "date_published": "2021-06-16T15:20:00.000Z",
  "source": "APP",
  "content": "SIALKOT, June 16 (APP):Special Assistant to Chief Minister Punjab on Information Dr Firdous Ashiq Awan said on Wednesday the PTI government had protected the rights of people from all walks of life including farmers, health and education and the business community, in the federal and provincial budgets.\nTalking to the media here at DC office, she said that past rulers, royal family and the followers of “Zale Subhani” had indebted the Punjab province of twelve hundred billion rupees.\nShe said the opposition was making hue and cry without going through federal and provincial budgets.\nIn the light of Prime Minister Imran Khan’s vision, Chief Minister Punjab Sardar Usman Buzdar and his team worked hard day and night to fix the sick and dilapidated economy and presented such an excellent budget, she added.\nThe SACM said the PTI government had promised health reforms and Rs 100 billion were going to be spent on national health card for free health insurance of hundred percent population of Punjab, adding that 29.2 million people were going to be part of healthcare.\nCommenting on the rumpus in National Assembly, she said that opposition members insulted and injured women in the assembly and violated democratic norms. She said that opposition members injured the Member National Assembly Maleeka Bukhari.\nDr Firdous said the sanctity of the House was violated by insulting each other inside the Parliament. She said, “We are committed to serve the people by healing the wounds of economy”.\nShe said that Pakistan was now moving ahead successfully towards the goal of economic stability due to positive and effective economic policies being implemented by the PTI government under the dynamic leadership of Prime Minister Imran Khan.\nThe PTI government in Punjab had given stability to the economy by presenting a surplus budget, she said.\nThe SACM said that Sialkot was the Industrial city which earns billions of dollars through exports and pay billions of rupees taxes annually to the government.\nA new industrial zone was going to be built along the Sialkot-Lahore Motorway, she said and added that 13 Special Economic Zones (SEZs) were being set up under the Punjab government which would help in development and prosperity besides eradication of unemployment.\nA housing colony for workers would be built with the help of workers welfare fund under the labour ministry, she added.",
  "retrievedAt": "2025-08-11T20:51:06.001Z"
}
