{
  "title": "UK police investigating suspected arson at England mosque as hate crime - World - DAWN.COM",
  "author": null,
  "content": "Police said on Sunday they were investigating a suspected arson at a mosque in southern England as a “hate crime”, days after a fatal attack on a synagogue. Officers were called to the incident at the mosque in the south coast town of Peacehaven late on Saturday.\n\nNo one was injured, but the blaze caused damage to the mosque’s front entrance and a vehicle parked outside.\n\nAccording to a statement from Sussex Police, emergency services were called to the fire at the building in Phyllis Avenue at about 9.50pm UK time on Saturday (1:50am PKT, Sunday).\n\n“This is a fast-moving investigation, and we are urging anyone with relevant information to report it to us. This includes anyone with CCTV, Ring Doorbell, dashcam, and mobile phone footage in the area at the time,” Sussex Police Detective Superintendent Karrie Bohanna said in the statement.\n\n“We understand the concerns this has caused within the community, and the impact that will be felt by the Muslim community as a result.\n\n“There is already an increased police presence at the scene, and there are also additional patrols taking place to provide reassurance at other places of worship across the county.”\n\nBohanna added that the Sussex Police had a “zero-tolerance approach to hate crime”, adding there was no place for hate across the county.\n\nA volunteer working at the mosque, who chose not to be named, told the BBC that “two people tried to enter through the front door, only to find it locked.”\n\n“They then poured a liquid at the entrance and near a car parked outside, which was set alight. It could have been murder,” the man said.\n\nHe added that two people inside the mosque managed to escape, per the report.\n\nMember of the Scottish Parliament and ex-first minister Humza Yousaf said in a post on X that such incidents were taking place because all Muslims were blamed for the actions of a few extremists.\n\n“We warned you. Many politicians & media outlets have put a target on every Muslim’s back by blaming all of us, and Islam, for the horrific Synagogue attack,” he said.\n\n“Thursday’s attack was the actions of one deranged extremist. This is what happens when you blame an entire community.”\n\nThe fire follows Thursday’s attack on a synagogue in northern Manchester in which two people died and three others were seriously injured.\n\nBritish police later they accidentally shot a victim, as well as one of the survivors, as they attempted to stop an attacker who appeared to be wearing an explosive belt.\n\nThe attacker, shot dead by officers at the scene, was not carrying a firearm, said Greater Manchester Police chief constable Steve Watson, though one of those killed suffered a gunshot wound.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/05151008712b075.webp",
  "retrievedAt": "2025-10-16T20:43:06.502Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946774/uk-police-investigating-suspected-arson-at-england-mosque-as-hate-crime",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T10:11:09.000Z"
}
