{
  "title": "Theme Park hit by flooding again, claims a resident’s life - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A resident of Theme Park – a worst flood-hit residential locality in the city – drowned after water level in the Ravi suddenly rose early on Saturday morning, increasing the level of already accumulated floodwater in a couple of blocks and inundating streets of the locality again.\n\nThe situation created panic among thousands of residents who gathered on the spot and staged a protest against the Rescue 1122 for responding late to their emergency calls to save life of Muhammad Arsalan (20) and Water and Sanitation Agency (Wasa) for carrying out drainage at a slow pace.\n\n“Since the drainage activity in the low-lying blocks (near Ravi) had been underway for the last many days, water being drained suddenly started coming back fast to these blocks after the water level in the river rose massively,” Saleem Abbas, a social worker and a Theme Park resident, said while talking to Dawn on Saturday.\n\n“At around 4am or so, the water started coming back to the locality, increasing level of the already accumulated water from 5 to 7/8 feet and inundating again the streets and roads of the blocks from where the floodwater recently receded, enabling the residents to visit and clean their houses,” he said.\n\nDC rejects impression that Ravi’s level rose due to closure of Balloki headworks’ gate for fishing\n\nAccording to Mr Abbas, Arsalan along with his two neighbours entered the floodwater just to see the situation of his house. After they entered, Arsalan went to the deep side unknowingly and started crying before drowning. On this a number of residents gathered there. Some of them kept calling Rescue 1122 repeatedly but no one reached there in the shortest possible time.\n\nFinally, Arsalan drowned and later the rescue teams reached there with boats to search for the body. At last, they found the body and handed it over to the heirs. “The Theme Park floodwater finally killed my son after destroying our house,” Abbas quoted the deceased’s mother as having said while mourning near the body of her son.\n\nHe also shared some videos showing gathering of the people on the spot and rescue team’s efforts to search for the body and criticism on the respective assistant commissioner.\n\nAccording to another resident, Shahid, the death of Arsalan created panic and fear among the residents. “A large number of people witnessed these scenes on the spot and this created immense fear among them,” he added.\n\nAnother resident said the situation in Khalid Bin Waleed, Overseas, New Bilal and Panjtan blocks is very serious, as the houses and infrastructures are still submerged completely there. “And the Saturday’s rise in the water level again diminished the hopes of speedy drainage from these blocks,” he said.\n\nWhen contacted, Lahore DC Syed Musa Raza said the Ravi’s level suddenly rose to 15,000 cusecs, leading to increase in the level of already accumulated floodwater in a couple of blocks. “In fact we made a temporary water channel below the level of these low-lying blocks so as to ensure speedy drainage through use of dewatering machines. But when the water level in the Ravi suddenly surged, the river water started entering these blocks by pushing back the water coming from the temporary channel,” he said.\n\nHowever, the DC said, the authorities resumed drainage after water level in the Ravi considerably reduced. “You cannot imagine the money the government is spending on the rescue and relief services in Theme Park alone. And we will surely recover this amount from those who developed this scheme illegally,” he said, adding that the relief efforts ensured drainage of the entire floodwater from 35 blocks of this scheme so far. “And we will also clear a couple of remaining blocks of water soon,” the DC said.\n\nTo a question, he said Arsalan along with three others entered the water despite knowing the depth. However, he slipped into a depression filled with water and drowned. He rejected the impression that the Ravi’s level rose due to closure of the gate at Balloki headworks for facilitating fishing.\n\n“The water level rose from 9,000 to 15,000 cusecs suddenly in the downstream and not due to Balloki,” the DC maintained.\n\nPublished in Dawn, October 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://www.dawn.com/news/amp/1940322",
  "retrievedAt": "2025-10-12T13:09:31.356Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946630/theme-park-hit-by-flooding-again-claims-a-residents-life",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T02:09:24.000Z"
}
