{
  "title": "Germany on alert after sighting of multiple ‘military’ drones - World - DAWN.COM",
  "author": null,
  "content": "MUNICH: Drones have been spotted at airports and military installations across Germany over the past two days, Bild newspaper quoted a confidential police report as saying, suggesting sightings this week at Munich Airport were the tip of the iceberg.\n\nThe disruption came as the country celebrated German Unity Day on Friday — a national holiday — and as Munich geared up for the final weekend of Oktoberfest, which draws hundreds of thousands of people the city every day.\n\nDozens of flights were diverted or cancelled at Munich Airport on Friday after both runways were closed following the second drone sighting in two days. Operations resumed, with delays, on Saturday morning.\n\nThere is mounting concern that Russia could be behind a growing number of recent drone incursions in the airspace of Ukraine’s European allies. Russia, which is fighting a war in Ukraine, has denied any involvement.\n\nHigh alert\n\nGerman Interior Minister Alexander Dobrindt said the first night’s incident was a “wake-up call” on the threat from drones. “The race between the threat from drones and the defence against drones is becoming more and more difficult,” he told Bild, adding that “more financing and research” on the issue was urgently needed at the national and European levels.\n\nGerman Aerospace Industries Association (BDLI) CEO Marie-Christine von Hahn said the incident proved the need to develop an anti-drone defence system as quickly as possible. “We now need to act quickly, together with politics, industry and security authorities,” she said, adding that “We as an industry are ready to do our part in this security partnership”.\n\n‘Military drones’\n\nQuoting the confidential police report which it said it had seen, Bild said on its website the drones spotted at Munich Airport were “used militarily”, without giving further details or saying where they had come from. Other sightings in the past three days, it said, included a drone seen on Friday morning flying about 700 metres (0.4 miles) from Frankfurt Airport, Germany’s largest hub, and a small aircraft reported flying over an ammunition depot in northern Germany on Friday afternoon.\n\nThree drones were also seen the day before, seemingly flying in formation, above a base of the Federal Police’s airborne unit near the northern town of Gifhorn, it said.\n\nA 41-year-old Croatian man has been detained and is being investigated for public order violations in connection with the Frankfurt incident, the newspaper said.\n\nArms race\n\nThe German defence ministry confirmed a media report that drones had been spotted flying over Erding military base near Munich Airport at around the time of the airport’s first closure on Thursday evening. The Erding base is home to some of the German armed forces’ drone research and development. Those sightings left about 11,500 passengers stranded over two evenings and caused dozens of flights to be cancelled, diverted or postponed.\n\nDobrindt, hosting a migration-focussed summit of European interior ministers in Munich on Saturday, told reporters he would equip police with a drone defence unit.\n\n“We are in an arms race,” he said. “We want to rise to that challenge.”\n\nFlight operations\n\nEuropean aviation has repeatedly been thrown into chaos in recent weeks by drone sightings and air incursions. Dobrindt has promised legislation making it easier for the police to ask the military to shoot drones down.\n\nFlights resumed “progressively” on Saturday at Munich airport, but delays were expected after a drone scare caused a second shutdown in as many days, affecting over 6,500 passengers, the operator said.\n\nAirports in Denmark, Norway and Poland have recently suspended flights due to unidentified drones, while Romania and Estonia have pointed the finger at Russia, which has brushed off the allegations.\n\nPublished in Dawn, October 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-16T20:43:20.195Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946676/germany-on-alert-after-sighting-of-multiple-military-drones",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T02:08:09.000Z"
}
