{
  "title": "KP cabinet approves withdrawal of ‘false’ May 9 cases filed by caretaker provincial govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Khyber Pakhtunkhwa cabinet has recommended the withdrawal of several “false cases” related to the May 9, 2023 riots against supporters of the PTI, which rules the province, it emerged on Sunday.\n\nAt the time of the May 9 riots, a caretaker government with Mohammad Azam Khan as the chief minister was in power in KP, after the PTI had dissolved the provincial assembly as rifts with the Centre grew.\n\n“For the public’s information, I want to inform that 29 false cases were registered on May 9, 2023 in anti-terrorism courts that were based on political victimisation, lack of evidence and misuse of authority,” said KP Advocate General Shah Faisal Uthmankhel in a video statement seen by Dawn.com.\n\nUthmankhel said KP CM Ali Amin Gandapur took notice of the matter as “courts had already acquitted all suspects in most of the cases”, while some suspects were discharged and some cases were sent to ordinary civil courts.\n\nIt could not be confirmed whether the cabinet had recommended withdrawing all 29 cases mentioned by the advocate general or some of them.\n\n“This proves that all the anti-terrorism cases were illegal, unconstitutional and based on political victimisation,” he said, adding that the KP cabinet decided that the home department will withdraw the cases.\n\nRecalling that the cabinet appointed KP Additional Advocate General (AAG) Muhammad Inam Yousafzai as the special prosecutor for the cases, Uthmankhel said Yousafzai appeared in the court and submitted an application for withdrawing the cases.\n\n“The court examined the documents thoroughly and fixed October 15 as the next date for hearing arguments on the withdrawal.”\n\nUthmankhel further asserted that the cases forwarded to ordinary courts had “no testimonies either so, God willing, they will soon be ended”.\n\nThe video clip also included screenshots of letters sent by the KP Home and Tribal Affairs Department to the advocate general’s office. They included a recommendation of withdrawal for a case filed in Mardan on May 9, 2023 at the City police station.\n\nA letter dated October 3 showed that the KP cabinet wrote to its home department, saying that the matter of withdrawal was placed before the cabinet on an “urgent basis” after Uthmankhel wrote to CM Gandapur, who approved taking up the matter.\n\nThe KP cabinet also sought an implementation report on its decision on a “top priority basis”.\n\nA response letter written by the KP home department to Uthmankhel on October 3, seen by Dawn.com, conveyed the cabinet’s approval of his recommendation to withdraw the cases.\n\nIt stated that the “KP additional chief secretary (home)/ home secretary was permitted to withdraw from the prosecution of FIR No. 833” under Section 7c (additional powers of district public prosecutor) of the KP Prosecution Service (Constitution, Functions, and Powers) Act 2005, read with Section 494 (effect of withdrawal from prosecution) of the Code of Criminal Procedure.\n\nThe cabinet also approved the appointment of AAG Yousafzai as special prosecutor in the Mardan case.\n\nOn May 9, 2023, military installations and state-owned buildings were vandalised as PTI supporters protested the arrest of ex-premier Imran Khan, who was released later but has been imprisoned in various cases since August 2023. Following the riots, thousands of protesters, including the party’s top leadership, were arrested.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/051909104296445.webp",
  "retrievedAt": "2025-10-12T13:09:04.348Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946790/kp-cabinet-approves-withdrawal-of-false-may-9-cases-filed-by-caretaker-provincial-govt",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T14:30:40.000Z"
}
