{
  "title": "First of 3 supermoons to be seen on Tuesday night: Suparco - World - DAWN.COM",
  "author": null,
  "content": "A supermoon will be visible in the night sky late Tuesday evening (Oct 7), the first of three supermoons set to occur in 2025, according to the Space and Upper Atmosphere Research Commission (Suparco).\n\nA supermoon occurs when the moon reaches its closest point to Earth in its elliptical orbit, causing it to appear unusually large and bright — up to 14 per cent larger and nearly 30pc brighter than a typical full moon.\n\nAccording to an official statement by a Suparco spokesperson, the first supermoon will occur at 8:47pm PKT on Tuesday, rising in the east just after sunset and setting in the west just before dawn.\n\n“This year, the October 7 supermoon will be at a distance of 224,599 miles (about 361,457 kilometres) from Earth, making it 6.6pc larger and 13pc brighter than an average full moon,” the statement said.\n\nThis supermoon will appear close to the planet Saturn, which can be spotted west of the Moon on Monday and Tuesday evening.\n\nIt added that the brightest supermoon of the year is expected to occur in November, when the moon will be 221,817 miles (about 356,980 km) away.\n\nThe phenomenon will be visible not just in Pakistan but across the globe, offering a “breathtaking sight” in the night sky. Following this, two more supermoons will be visible on November 5 and December 5.\n\nIn September, a rare blood moon — a total lunar eclipse — eluded Karachi stargazers as heavy cloud cover blocked the view.\n\nIn August of 2023, a once-in-a-decade “super blue Moon” lit up the sky, with “blue” simply referring to a full moon seen twice in the same month.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/05130439e250ba1.webp",
  "retrievedAt": "2025-10-16T20:43:44.488Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946764/first-of-3-supermoons-to-be-seen-on-tuesday-night-suparco",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T08:48:56.000Z"
}
