{
  "title": "US Republicans alarmed over shutdown strategy - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: President Donald Trump’s freezing of funds for Democratic-led states has raised concerns among some centrist Republicans in the US Congress, who worry that leaning into these divisions could make it harder to end an ongoing government shutdown.\n\n“You’re going to create a bad faith environment here that could put us further out. They need to be very judicious,” Republican Senator Thom Tillis, who is involved in informal bipartisan talks to end the shutdown, told reporters in the US Capitol this week. The government shutdown entered its fourth day on Saturday, making it the fifth longest in US history.\n\nTrump warned Democrats earlier in the week that he could make “irreversible” cuts to the federal government during a shutdown and the White House has so far frozen $28 billion in infrastructure funds that had been headed to New York, California and Illinois — all home to sizable Democratic populations and critics of the president.\n\nTrump and his Republican allies have also taunted Democrats on social media with manipulated images of prominent lawmakers including House Democratic leader Hakeem Jeffries that drew on stereotyped images of Mexicans, despite the reality that Republicans will need the votes of at least seven Senate Democrats to pass a funding bill to reopen the government. Vice President JD Vance this week dismissed concerns about the images, calling them a joke.\n\nA small band of Republicans warned that the Trump administration could end up bearing the brunt of the blame for the shutdown, heading into next year’s midterm elections that will determine control of Congress.\n\nTillis, a North Carolina lawmaker who announced his retirement after clashing with Trump earlier this year, said he hoped the White House was coordinating its actions with Senate Majority Leader John Thune and House of Representatives Speaker Mike Johnson, who are trying to persuade their Democratic counterparts to support a short-term funding bill that would reopen federal agencies and fund government operations through Nov 21.\n\nOthers disagree with Tillis’ concerns, including Johnson, who endorsed the president’s approach. “President Trump is just as anxious as we are to get the government back open, because real Americans are being harmed by the Democrat shenanigans. And is he trying to apply pressure to make that happen? He probably is, yeah. And I applaud that,” Johnson told reporters.\n\nCompromises\n\nSenate Democrats, who are demanding a permanent extension of federal subsidies to help people afford healthcare insurance under the Affordable Care Act, have voted down the funding bill four times. Democrats also want protection against White House actions to withhold or cancel funding allocated by Congress.\n\n“If OMB goes about canceling things, just like the rescissions that were foundational to past compromises, you destroy the credibility of future compromises,” Tillis said, using the acronym for Vought’s Office of Management and Budget.\n\nWhite House has so far frozen $28bn in infrastructure funds for Democratic-led states\n\n“Trust, that’s how this place runs well, when it runs well.” The Senate left town after failing to pass a funding measure on Friday, setting the stage for the shutdown to last until at least Monday.\n\nThere were no signs that Republicans and Democrats could reach a deal to reopen agencies anytime soon, raising the specter of a prolonged closure that could lead to an erosion of key government services including air traffic control.\n\n“We’re all Americans. We shouldn’t be targeting different areas in ways that would be viewed as punitive. That’s just not what we do,” said Republican Senator Lisa Murkowski of Alaska, a Trump critic who the president tried to oust from office in the 2022 election.\n\n“Let’s not further divide people, politically. This is already stressful enough, and we just don’t need to do that, Murkowski added. Democrats have been riled by Trump’s use of the shutdown to single out his opponents for mockery and insults.\n\nObviously I don’t agree with the insults. But there have been plenty of insults in both directions. Let’s be fair,” said Republican Senator Susan Collins, who said both sides need to stick with the facts and work to end the shutdown that becomes more harmful with each passing day. “Does it help when the Democrats are ridiculing and insulting the president?” she asked.\n\nPublished in Dawn, October 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:09:31.917Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946669/us-republicans-alarmed-over-shutdown-strategy",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T02:08:09.000Z"
}
