{
  "title": "Police claim arrest of Teefi Butt in Dubai - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Police claimed on Saturday to have arrested Khwaja Tareef Butt alias Teefi Butt from Dubai, who was allegedly involved in killing Tipu Truckaanwala’s son Ameer Balaj Tipu.\n\nThe arrest was made with the help of Interpol.\n\nPolice said DSP Khalid Waria of the extradition cell was in Dubai to arrest two declared suspects when a raid was conducted. The operation, carried out in coordination with Dubai Police, took place inside a flat where Teefi Butt was unexpectedly present at a party.\n\nThe DSP identified Teefi Butt and initiated the arrest process. Currently, Teefi Butt is in Dubai police custody.\n\nAccording to Lahore police, red warrants have already been issued against Teefi Butt. He will be handed over to Lahore police and flown to Pakistan.\n\nCCD seeks transfer of case\n\nPolice sources said Teefi Butt had initially fled to Glasgow (UK) soon after the murder of Ameer Balaj Tipu. More recently, he travelled to Dubai for renewal of his London visa after it expired, which ultimately led to his capture.\n\nEarlier, the Crime Control Department (CCD) has formally requested Lahore capital city police officer (CCPO) to transfer the investigation of the Ameer Balaj murder case to them. The case was originally registered at Chuhng Police Station. Officials said the decision on transferring the investigation will be finalised once Teefi Butt is brought back to Pakistan.\n\nAmeer Balaj Tipu was killed during a marriage ceremony in February 2024. Teefi Butt and Aqeel Butt alias Gogi Butt were nominated in the case. Gogi Butt is currently out on bail and Teefi Butt has been declared an absconder.\n\nTrader kidnapped: Muzaffargarh police on Saturday could not recover a trader kidnapped from Tehsil Alipur two days ago.\n\nShahid, a trader of Kundai, was receiving threats for ransom from Katcha area dacoits. He also submitted the complaint to Kundai police station and demanded protection.\n\nHowever, the trader was kidnapped in broad daylight from the Kundai Bazaar. As many as 15 Katcha area dacoits, including Jhabail Gang, carrying heavy arms approached the market and took away the trader.\n\nKundai police registered the case and started investigation.\n\nAccording to the first information report, Zaffar alias Zaffari Jhabail, Ghuman Jhabail, Ghulam Qadri alias Gumni, and 15 to 16 other heavily armed men approached the shop of Shahid and took him and two motorcycles away.\n\nIt further stated that Shahid had a land dispute with the dacoits and they kidnapped him.\n\nMuzaffargarh District Police Officer (DPO) Syed Ghazanfar Shah told Dawn that the abductee was located and police had cordoned off the gang members.\n\nHe said they were making efforts, including negotiations, for safe recovery of the abductee.\n\nHe said Shahid was not kidnapped for ransom but there was a land dispute between the trader and members of the gang.\n\nIn July, more than 30 heavily armed members of multiple gangs stormed the Langarwah area of Alipur tehsil in Muzaffargarh district and snatched 260 buffaloes from locals.\n\nThe gang members pushed the cattle into the Indus River and relocated them to a nearby forest known as Zakheera.\n\nLater, after a 12-day stand-off, the police recovered 100 lifted buffaloes when the members of the dacoit gangs surrendered after negotiations.\n\nPublished in Dawn, October 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:09:31.439Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946626/police-claim-arrest-of-teefi-butt-in-dubai",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T02:09:24.000Z"
}
