{
  "title": "Pakistan leads region in used car imports - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The import of used cars in Pakistan is much higher than its regional peers and other countries. However, different countries have implemented various strategies to balance consumer demand, environmental concerns, and industrial priorities.\n\nExperiences from India, Bangladesh, Kenya, South Africa, Nigeria, Sri Lanka, and the Philippines provide practical insights. Measures such as age limits, pre-export inspections, phased implementation, fiscal incentives, and administrative controls can guide Pakistan in maintaining quality, safeguarding the environment, and balancing consumer access with industrial protection.\n\nAs per a report of the Institute of Cost and Management (ICMA), Pakistan’s average import of used cars per year stood at 34,000 units followed by 21,802 by Thailand, 532 by Vietnam and 235 units by India.\n\nBangladesh permits the import of used cars under specific conditions to balance consumer demand with quality control and revenue generation. As of June 2025, vehicles must be no more than four years old, imported directly from the country of origin, and accompanied by a previous registration or de-registration certificate. The importation process involves customs duties, VAT, and mandatory inspections to ensure compliance with national standards.\n\nNeighbours curb influx of old vehicles through age caps and safety checks\n\nSri Lanka lifted its five-year ban on private car and motorcycle imports in February 2025, allowing personal use vehicle imports under specific conditions. Individuals are permitted to import one vehicle per year, provided they use a registered vehicle importer. This phased reopening aims to stabilise the market and manage foreign exchange reserves while meeting consumer demand.\n\nIndia enforces stringent regulations on the importation of used vehicles to protect its domestic automotive industry and ensure compliance with safety and environmental standards. As of 2024, used vehicles must be under three years old, right-hand drive, and meet specific engine capacity restrictions. The import ­process involves extensive documentation, high import duties (up to 125pc for used cars), and mandatory compliance testing. Additionally, a minimum ­roadworthiness period of five years is required from the date of ­importation.\n\nKenya has implemented a controlled liberalisation approach to used car imports, aiming to balance affordability with environmental and safety considerations. As of July 2025, only vehicles manufactured from July 2018 onward are eligible for import, effectively enforcing a rolling seven-year age limit. This policy is designed to improve air quality, reduce reliance on older vehicles, and support local vehicle assembly. Importers must comply with pre-export inspection requirements and domestic roadworthiness certification.\n\nSouth Africa restricts used car imports to protect its domestic automotive manufacturing sector. Importation is generally allowed only under specific circumstances, such as for returning nationals or immigrants with permanent residence status.\n\nThese individuals may import one vehicle per family, subject to compliance with import duties and VAT. The importation process requires obtaining a permit and adhering to documentation requirements.\n\nNigeria has tightened its used vehicle import regulations to reduce the influx of older, potentially polluting cars. As of May 2025, only vehicles manufactured in 2015 or later are eligible for import without facing punitive duties. Vehicles older than 10 years are either barred or subjected to heavy import penalties. The import process requires specific documentation, including a bill of lading, bill of entry, marine insurance, and evidence of VAT payment.\n\nIn the Philippines, only qualified individuals may import used vehicles, and they must secure a Certificate of Authority to Import (CAI) from the Fair-Trade Enforcement Bureau (FTEB) of the Department of Trade and Industry (DTI) before the actual importation. Imported vehicles are subject to a 40pc customs duty, 10pc VAT, and an ad valorem tax ranging from 15pc to 100pc, depending on the vehicle’s piston displacement.\n\nIn the early 1990s, commercial imports of cars were largely prohibited to protect local assemblers. This resulted in fewer cars in the market, higher prices, and limited options for buyers.\n\nIn the early 2000s, growing demand for affordable cars led the government to allow imports under special schemes such as the Gift Scheme, Baggage Scheme, and Transfer of Residence Scheme, mainly for overseas Pakistanis. While these cars were meant for personal use, many entered the local market through dealers. Consumers gained more choice and prices dropped slightly, but local carmakers protested, saying these imports hurt their sales and investment.\n\nIn 2,005, the government reduced duties, making it easier to import used cars. Consumers accessed small, fuel-efficient Japanese cars, and imports rose quickly. By 2,008, local carmakers lobbied for tighter restrictions, leading to increased duties and a lower age limit for imports. This reduced imports and strengthened local manufacturer protection.\n\nIn 2012, the maximum age of imported used cars was cut from five years to three years, sharply reducing inflows. Simultaneously, the Automotive Development Policy (ADP) encouraged investment in local assembly. Some new entrants joined, but car prices remained high and choice limited.\n\nDuring 2012-2020s, ongoing push and pull consumers continued to complain about high prices, limited choice, and lower safety standards than regional peers. Industry groups warned that too many imports could reduce local investment, slow parts production, and increase pressure on foreign exchange. The government alternated between relaxing and restricting imports, creating a cycle of policy shifts.\n\nIn September 2025, the federal government had allowed commercial imports of used cars up to five years old. Duties will be reduced gradually.\n\nThe policy aims to protect local manufacturers, offer consumers more affordable choices, and ensure imported cars meet safety and environmental standards. This is a key step toward a more balanced automotive market.\n\nPassenger vehicles under five years old can be imported commercially until June 30, 2026. A 40pc regulatory duty applies in the first year, reducing by 10pc each year until it reaches zero by FY30.\n\nThis phased approach helps balance consumer benefits with protection for local manufacturers. All imported vehicles must meet safety and emission standards, ensuring that older, unsafe, or inefficient vehicles do not enter the market.\n\nPublished in Dawn, October 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:09:43.401Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946688/pakistan-leads-region-in-used-car-imports",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T02:07:36.000Z"
}
