{
  "title": "Backlog cleared, licence processing time cut to four days: PMDC - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: After decades of complaints from the medical community regarding delays in registration, licence renewal and related services, the Pakistan Medical and Dental Council (PMDC) has announced that it has cleared its longstanding backlog.\n\nIn a statement, the council also claimed that it had significantly improved its internal systems, reducing the processing time for medical and dental licences to just four working days.\n\nIn May 2024, a digitisation initiative was launched and the council started multiple online portals, including the Registration Portal, Postgraduate Qualification Portal, Experience and Faculty Portal and the MDCAT Portal.\n\nAccording to a spokesperson, the total number of cases received in a year was 175738, of which 173373 cases have been completed and issued.\n\n“Thousands of applications for registrations, postgraduate qualifications and faculty verification have been processed in record time, reducing delays and clearing backlogs. Applicants can now track their cases in real time, ensuring accountability and eliminating unnecessary hurdles. The new portals have reduced the need for physical visits, enabling stakeholders to access essential services at any time and from anywhere,” he said.\n\nThe PMDC has also launched its licensing system in Lahore and Karachi, marking a major step toward facilitating medical and dental graduates and practitioners.\n\nPMDC President Prof Rizwan Taj stated that the development demonstrated the council’s hard work and broader vision to digital transformation, ensuring that medical and dental professionals across Pakistan benefit from a faster, more reliable and transparent regulatory process.\n\n“The Council remains enthusiastic to further strengthen its IT infrastructure and introduce additional digital solutions to achieve minimal human interaction, faster turnaround times, and global best practices in medical and dental regulations. The small number of cases that are pending are mostly because of delays or complexity in third-party verification and by law PMDC cannot expedite the cases without verification,” he said.\n\nPublished in Dawn, October 5th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T13:09:30.338Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946611/backlog-cleared-licence-processing-time-cut-to-four-days-pmdc",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T02:09:35.000Z"
}
