{
  "title": "Landslides and floods kill 64 in Nepal, India - World - DAWN.COM",
  "author": null,
  "content": "Landslides and floods triggered by heavy downpours in Nepal and neighbouring India have killed more than 60 people, officials said on Sunday, as rescue workers raced to reach cut-off communities in remote mountainous terrain.\n\nTorrential downpours have lashed Nepal since Friday, leaving rivers in spate and many areas in the Himalayan nation inundated.\n\nAt least 44 people have died in rain-triggered disasters and five are missing, Shanti Mahat, spokeswoman for Nepal’s National Disaster Risk Reduction and Management Authority, told AFP.\n\nAt least 37 were killed by landslides in the worst-affected eastern district of Ilam.\n\n“Heavy rains overnight caused the landslides,” said local district official Sunita Nepal.\n\n“With roads blocked, some areas are difficult to reach. Rescue workers are heading there on foot.”\n\nRivers in the capital Kathmandu have also swelled, inundating settlements along their banks.\n\nSecurity personnel were deployed to assist rescue efforts with helicopters and motorboats.\n\n“There is some damage, but thanks to the authorities’ prior flood alert, we were able to move some belongings to a safe place,” said vegetable seller Rajan Khadga, 38.\n\nLandslides have blocked several highways and disrupted flights, leaving hundreds of travellers, many returning after celebrating the Hindu festival of Dashain, stranded.\n\nPrime Minister Sushila Karki said government agencies were “fully prepared for rescue and relief”.\n\n“Your safety is our utmost concern. Do not hesitate to seek necessary assistance,” she said in an address, adding that the government has declared Sunday and Monday public holidays and urged people not to travel unless necessary.\n\nAcross the border in India, at least 20 people were killed in the tea-growing hill district of Darjeeling in West Bengal state after heavy overnight rain unleashed flash floods and landslides that destroyed homes and infrastructure.\n\n“In the wake of last night’s heavy cyclone in the Darjeeling hills, over 20 people have lost their lives,” said Harsh Vardhan Shringla, a lawmaker in India’s upper house.\n\nFootage on Indian television news showed rescue workers using cables to access cut-off regions as raging waters smashed into bridges and caved in roads.\n\nPrime Minister Narendra Modi said he was “pained by the loss of lives”.\n\n“The situation in Darjeeling and surrounding areas is being closely monitored in the wake of heavy rains and landslides,” he said in a statement on social media.\n\nIndia’s weather department on Sunday issued a red alert for “extremely heavy rainfall” in sub-Himalayan areas, including Darjeeling, until Monday.\n\nRelentless downpours also swelled rivers in neighbouring Bhutan, prompting the Indian army to join rescue efforts.\n\nMilitary helicopters were deployed to evacuate several civilians stranded in the border town of Phuentsholing, the army said in a statement.\n\nMonsoon rains, usually from June to September, bring widespread death and destruction every year across South Asia, but the number of fatal floods and landslides has increased in recent years.\n\nExperts say climate change has worsened their schedule, frequency and intensity.\n\nThe Kathmandu-based International Centre for Integrated Mountain Development warned in June that communities faced heightened disaster risks this monsoon season.\n\n“Rising temperatures and more extreme rain raise the risk of water-induced disasters such as floods, landslides, and debris flows,” it said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/10/0515024898076c6.webp",
  "retrievedAt": "2025-10-12T13:09:06.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1946775/landslides-and-floods-kill-64-in-nepal-india",
  "dateList": "2025-10-05",
  "date_published": "2025-10-05T10:15:49.000Z"
}
