{
  "title": "UK govt put on notice over G20 meet in IIoJK",
  "link": "https://www.app.com.pk/national/uk-govt-put-on-notice-over-g20-meet-in-iiojk/",
  "date_published": "2023-05-16T08:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):Strongly urging against participating in the so-called G20 meet in Indian Illegally occupied Jammu and Kashmir (IIoJK), the UK government has been put on notice against such a move which violates international law and UN mandate on IIoJK.\nFahim Kayani, president Tehreek-e-Kashmir (TeK) UK, alongwith Muhammed Ghalib President TeK EU, Haji Muhammad Sadiq ,Rehana Ali, Ch Ikram ul Haq and Yasir Alam submitted petition at 10 Downing Street – the governance center of British government in London – calling on the UK government to reject Indian invitation to the G20 meet in IIoJK, said a press release received from London here on Tuesday.\nIn its yet another mischievous attempt to mislead international community, India has invited G20 officials for a tourism-related meeting in the occupied valley between May 22 and 24.\n“Through this petition, we demand the UK government to not send its representative to the so-called G20 meeting in IIoJK on the invitation of India,” Kayani said after submitting the petition to the PM UK’s office .\n“Through this meeting,” the Kashmiri diaspora leader said: “the Hindu fascist regime in New Delhi led by murderous Narendra Modi wants to cover its illegal actions taken on IIoJK on August 05, 2019.”\n“IIoJK is a UN-designated disputed territory and any such event in IIoJK is violation of UN resolutions on Kashmir,” said Kayani, reminding the UN has granted Kashmiris right to self-determination to choose their political future.\n“It is only India which has sabotaged fulfilling the UN promises on Kashmir and any attendance of G20 members during this event between May 22 and 24 tantamount to be complicit in violating UN resolutions on Kashmir,” Kayani explained.\nIndia, current chair of G20, is holding a tourism-related meeting in IIoJK next week. Pakistan and Kashmiris around the world have categorically rejected such a move and have called on G20 nations to avoid accepting Indian invitation in this regard.",
  "retrievedAt": "2025-08-11T08:30:24.934Z"
}
