{
  "title": "SC adjourns NAB amendment case for indefinite period",
  "link": "https://www.app.com.pk/national/supreme-court-adjourned-hearing-of-a-petition-challenging-amendments-in-nab-law/",
  "date_published": "2023-05-16T16:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): The Supreme Court (SC) on Tuesday adjourned hearing of a petition challenging amendments in the National Accountability Bureau (NAB) law till date in office.\nA three-member SC bench headed by Chief Justice of Pakistan Umar Ata Bandial and comprising Justice Ijaz Ul Ahsan and Justice Syed Mansoor Ali Shah heard the case filed by Pakistan Tehreek-e-Insaf (PTI) Chairman Imran Khan.\nDuring the course of proceedings, the CJP addressed Federal Government’s lawyer Makhdoom Ali Khan, who appeared before the court through video link from Karachi, said today he had appeared from such a distance.\nMakhdoom Ali Khan responded that in view of the previous day’s situation, he felt that it would be difficult to reach the court, and there was also no social media to get information.\nThe chief justice asked Makhdoom Ali Khan to speak carefully as what he stated in the court would be posted on social media without the context like the words “good to see you”.\nHe observed that it was the 46th hearing of the case and the bench wanted the case to be wrapped up.\nThe court directed Makhdoom Ali Khan and Imran Khan’s lawyer Khawaja Haris to submit summaries of their arguments.\nThe CJP remarked that after the replies, they would decide whether the case needed further hearing or not. If the court reached a conclusion after going through the written material, it would inform the parties accordingly.\nHe said today was the 46th hearing of the case and Khawaja Haris had so far given arguments in 26 and Makhdoom Ali Khan in 19 hearings.\nHe further said the court did not want to hang the case any longer because the bench might not be available during the court holidays.\nHe said many things were right in the amended NAB law and there were also some mistakes which would be judged.He asked Khawaja Haris asked to look into the amendments and tell the court what was wrong in them and where the fundamental rights were violated.\nThe court itself could not decide that fundamental rights were affected by the changes in NAB law, he added.\nJustice Ijaz instructed Imran Khan’s lawyer to also include response to Makhdoom Ali Khan’s objections in his reply.\nKhawaja Haris told the court that the government had made the third amendment in the NAB law yesterday. On which the chief justice said the government was also testing the court.\nKhawaja Haris further said that the government had amended the NAB law for returning the references and referring same to the relevant forums.\nMakhdoom Ali Khan said Imran Khan had also benefitted from the NAB amendments. A case came before the Supreme Court last week, he said, adding for the first time in constitutional history, a person had benefited from the law which he had challenged.\nHe said Imran Khan wanted no one else to benefit from the law. It was also the first time in history that a Prime Minister challenged his amended law on leaving office, he added.\nMakhdoom Ali Khan argued that the Constitution did not allow a person critical of the law to take advantage of it. The petitioners had not been able to explain how the NAB Act directly contravenes fundamental human rights, he added.\nHe said the case against the NAB amendments was a lengthy exercise over speculation.\nHe said the government approved the NAB amendments in a joint session of the Parliament yesterday. The President returned the NAB amendments without his signature and the law was re-approved by the Parliament, he added.\nHe raised the question why Imran Khan did not challenge the NAB law in the trial court first. On which the chief justice said that he (Makhdoom) had already raised that point in an excellent manner that the petition was not based on solid grounds.\nKhawaja Haris said that the court could do judicial review on any law under Article 184/3 cases. Courts all over the world strike down laws, he added.",
  "retrievedAt": "2025-08-11T08:30:28.148Z"
}
