{
  "title": "Parliamentarians in mixed opinion put their weight behind trial of PTI protestors in military Courts",
  "link": "https://www.app.com.pk/national/parliamentarians-in-mixed-opinion-put-their-weight-behind-trial-of-pti-protestors-in-military-courts/",
  "date_published": "2023-05-16T11:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): The Parliamentarians on Tuesday in a mixed opinion put their weight behind the decision of the Army to trial the Pakistan Tehreek-e-Insaf (PTI) protestors in military courts for desecrating the state institution’s installations and memorials of the martyrs of the Armed Forces.\nTalking to APP outside the Parliament, Defence Minister Khawaja Muhammad Asif said the blatant and violent attack on the Army’s installations and its residences gave a justification to allow the government to trial the PTI protestors under the military courts.\n“When Army installations and memorials will be attacked then the state institution is being forced to take action. Just like Article 209 of the Constitution, the Army and other institutions have constitutional provisions to protect their honour and sanctity,” he said.\nHe further said the Pakistan Democratic Movement (PDM) protest was a peaceful activity and as per the law whereas the same facility could be extended to other political and social groups if they exercise the same restraint within the limits of the law.\nMember National Assembly (MNA), Syed Ali Musa Gilani of Pakistan Peoples Party Parliamentarians (PPPP) said the cases against a political party’s workers in military courts should not be held in a democracy.\nHe added that the political workers trial should not be held in military courts, but rather in the civil courts whereas those identified other than the political workers should be held accountable as per law in the military courts.He condemned the trial of political workers in the military courts.\nMNA, Nasir Musazai of PTI opined that the protestors should be charged as per Army Act who attacked Balahisar Fort and Corps Commander’s House in Lahore which was equal to enmity with the country.\nHe underlined that the PDM protest was held a day earlier and no damage was incurred to any property or institution, whereas Article 144 was imposed to protect the federal capital from the damage of protestors which did not happen.\nMNA, Javaid Latif of Pakistan Muslim League-Nawaz (PML-N) said the PTI had been proved as a terrorist organisation after the attacks on the key sensitive state installations and there was no room to hold dialogue with the terrorists.In that case, he said there were also many terrorist organisations in the country and the coalition government could never hold dialogue.\nMNA, Shagufta Jumani of Pakistan Peoples Party Parliamentarians (PPPP) observed PTI chief Imran Khan was the blue eyed of the Apex Court. He was arrested a day before and the next day was presented in the Supreme Court from the pathway used by the judges to enter the court. The way Khan was welcomed, received and got bails and given liberty by the Courts was regrettable, she added.\nWhat happened on May 9 was ignored completely by the Court as the way Metro busses were damaged that were established from the precious national exchequer and tax payer’s money.\nShe regretted that Imran Khan had disowned his party workers which was shameful and pitiable for his party workers who blindly followed him.\n“Imran Khan was getting bail in every case but he resisted his arrest whereas politicians extend their arrest themselves like former President Asif Ali Zardari did during his arrest by the Police. But the Chief Justice’s conduct for Imran Khan expressed his tilt towards the latter’s personality,” she added.\nMNA, Syed Imran Shah of PML-N said, “We are all bound to the law but the way Imran Khan resisted his arrest had aftershocks on 9th May across the country. The people get exposed when they get power or authority that happened in the case of Imran Khan as his loyalty to the nation was well exposed before everyone after that unfortunate incident.”He said a national accused who was arrested and under remand, whereas his arrest was declared legal by the Islamabad High Court (IHC) and the National Accountability Bureau (NAB) but the Chief Justice of the Apex Court welcomed him which was regrettable.He pointed out that Rana Sanaullah was also arrested but no attacks were made on the state’s assets whereas the apex court and IHC condemned these attacks but he (Imran Khan) did not.He mentioned that politics had no end of word for dialogue but the time had passed.\nParliamentary Secretary for Communications, Shahida Akhtar Ali said it was the politicians’ job to hold dialogue as issues were not resolved through confrontation rather consultation.\nThe Apex court judge made such remarks for an individual who was accused against his code of conduct and as per Shariah a judge’s conduct should be impartial so that not impact was made on the justice, she added.However, she clarified that amid confrontation no dialogue was possible sans cooperation.\nSenator Kamran Murtaza of Jamiat Ulema-e-Islam Pakistan (JUI-P) said the Supreme Court should not do other’s job as it could not dictate the government for holding talks.\nParliamentary Secretary for Health, Dr Shazia Sobia Aslam Soomro said the coalition government particularly her party PPPP had always offered charter of democracy and economy to PTI chief. However, he (Imran Khan) lacked confidence to hold talks and throughout his political career, he never acted as a politician.She underlined that Khan should come to dialogue to resolve the political crisis for national good.\nMNA, Asiya Azeem of PTI said the parliamentarians had no way out other than dialogue. The solutions to many serious conflicts even like wars were dialogue and consultation, she added.“Elections will be held as tenure of the current government is going to be completed in the next few months. It should not be a matter of ego for any at this point of time,” she said.\nMNA, Qadir Mandokhel of PPPP said the Supreme Court should focus on resolving 1.8 million pending cases and the Chief Justice was outgoing and should work on solving pending cases to leave his positive impression and work better.The SC should stop intrusion in the work of other institutions and the parliament, she added.\nMNA, Nawabzada Iftakhar Ahmad Khan Babar of PPPP said the PDM gave a proper application to the Deputy Commissioner of the federal capital prior to hold demonstration on the Constitution Avenue.\nMNA, Qaiser Ahmed Sheikh of PML-N said there was no precedent in the world to attack state institutions for political motives which was done by the PTI.\nHe said strict action should be taken against these inimical protestors as per the law. He added that if there was any violation of the law in the PDM protest then it should be challenged in the courts as law gives liberty to all.\nParliamentary Secretary for Climate Change and Environmental Coordination, Naz Baloch said the protest was the right of the PDM and there was no damage to any infrastructure in the capital but the PTI not only in the country but in abroad outside the residence of former prime minister Nawaz Sharif were staging protest and bringing embracement to the country.\nMNA, Usama Qadri of Muttahida Qaumi Movement of Pakistan (MQM-P) said what PTI did, could not have been done by country enemies in the past seven decades.\nThe culprits should be penalized strictly as per the law, whereas the courts should serve the purpose for which they were being mandated.",
  "retrievedAt": "2025-08-11T08:30:17.801Z"
}
