{
  "title": "Political will needed at global level to address climate stress equitably: Sherry Rehman",
  "link": "https://www.app.com.pk/national/political-will-needed-at-global-level-to-address-climate-stress-equitably-sherry-rehman/",
  "date_published": "2023-05-16T13:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP):“The race against time necessitates both critical mass and political will to address the climate crisis, given that we are likely hurtling towards a 2-degree plus world,” said Federal Minister for Climate Change & Environmental Coordination Senator Sherry Rehman.\nMinister Rehman was speaking virtually at the Austrian World Summit 2023 during a panel discussion titled “We Have the Power to Reach Our Climate Targets”. She was joined by Leonore Gewessler, Federal Minister of Climate Action, Environment, Energy, Mobility, Innovation and Technology, Austria and Angus Robertson MSP, Cabinet Secretary for Constitution, External Affairs and Culture, Scotland.\nMinister Rehman said that unlocking climate finance is crucial for building resilience in countries vulnerable to climate change “The path ahead is clear and straightforward: climate finance must be affordable, agile, and easily accessible in times of disaster. We need a clear understanding of the Loss and Damage Fund and the Adaptation Fund at the global level. Unfortunately, the Adaptation fund, despite its existence for years, has been underfunded and ineffective.\nWe must ensure that the Loss and Damage fund, which restored trust in the multilateral process of climate change conferences, does not become a ghost fund. These funds require reliable sources of capitalization to fulfill their purpose and to make a transformative shift, we need creative solutions to reform the multilateral development banks (MDBs) and international financial architecture.\nThe current Bretton Woods system is insufficient in addressing the climate crisis and the lack of financial resources is a significant impediment. as the billions required have become trillions, as the billions have never materialized.This growing anxiety is particularly prevalent in the developing world,” said the Minister.\n‘The COP system should also consider the involvement of big business by bringing them to the negotiations table, as they possess the leadership, funding, and emission reduction solutions that can contribute to the necessary changes” the minister said.\nIn response to a question on the impact of climate change in Pakistan, Minister Rehman said, “We are in a race against time, a race for survival. It’s transforming our life choices: the way we produce, manufacture, and grow, as well as how we consume anything as it has a significant impact on our future.\nProtecting our people has emerged as an immediate priority, particularly as we witnessed nearly one-third of our country submerged underwater.After 2022 for Pakistan, we are in a fight to prevent the vulnerable from succumbing to the burdens of both accumulated debt and the losses inflicted by climate stress. In these circumstances, vulnerability can be a death sentence for those living in the arcs of vulnerability. Climate change is not just a threat multiplier but an existential threat, and it necessitates the collective efforts of everyone to curb emissions and mitigate the impacts.”\nSpeaking about the urgent issues and demands of the developing countries, Minister Rehman said, “Pakistan is literally the poster child of climate stress, and the mega-floods of 2022 have shifted our focus towards prioritizing adaptation.It is crucial for vulnerable countries to adapt to the ever-increasing unpredictability and exogenous shocks caused by climate change.\nAdditionally, the international community must allocate the necessary level of climate financing and adaptation funding to rebuild communities in climate-vulnerable countries and ensure their resilience. Building resilience and adaptation within our societies is critical for not just survival but also for getting to a better place tomorrow.” She said that the COP conferences hold great significance as they provide a platform to create islands of salvation for the world.\n“The establishment of a Loss and Damage Fund at COP27 was historic, as we were able to garner support from various stakeholders and achieve a critical mass of consensus. The success of such initiatives underscores the power of collective efforts and paves the way for further transformative solutions in addressing the challenges posed by climate change,” she concluded.",
  "retrievedAt": "2025-08-11T08:30:31.436Z"
}
