{
  "title": "NSC urges resolving political differences through talks, not confrontation",
  "link": "https://www.app.com.pk/national/nsc-urges-resolving-political-differences-through-talks-not-confrontation/",
  "date_published": "2023-05-16T16:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 16 (APP): The meeting of the National Security Committee on Tuesday vowing “zero tolerance” against violence and miscreancy in the country, emphasised the resolution of political differences through dialogue as per democratic values, without any confrontation.\nThe meeting, chaired by Prime Minister Shehbaz Sharif, resolved to bring all the elements involved in May 9 riots and arsons to justice as no desecration of security installation, public properties and national dignity would be tolerated.\nThe forum called for national unity and harmony amidst the complex geo-strategic situation caused by the global political confrontation as well as the enemies’ policy of instability.\nAttended by federal ministers, Chairman of the Joint Chiefs of Staff Committee, three services chiefs, heads of the security institutions and senior officers, the NSC decided to observe May 9 as Black Day.\nThe participants expressed full solidarity and support to the armed forces of Pakistan and strongly condemned the attacks on security installations to serve personal or political interests.\nThe meeting endorsed the decision of booking and trying the miscreants, planners, instigators and facilitators as per the constitution and relevant laws including the Pakistan Army Act and Official Secret Act.\nThe forum made it categorically clear that no leniency to be shown towards those involved in attacks on security installations and places under any agenda.\nThe participants also paid tribute to the martyrs and their family members.\nThe meeting instructed for full implementation of the social media rules and regulations to overcome the propaganda patronised by foreign elements through local facilitation, and penlise the perpetrators.",
  "retrievedAt": "2025-08-11T08:30:31.206Z"
}
