{
  "title": "PM vows to defeat opposition’s no-trust motion, down 3 wickets with one ball",
  "link": "https://www.app.com.pk/national/pm-vows-to-defeat-oppositions-no-trust-motion-down-3-wickets-with-one-ball/",
  "date_published": "2022-03-11T12:32:00.000Z",
  "source": "APP",
  "content": "TIMERGARA, Mar 11 (APP): Prime Minister Imran Khan on Friday vowed to defeat the opposition parties’ no-trust motion, saying he would bring three wickets down with an in-swinging yorker.\n“Insha Allah, your captain will win this match of no-trust motion in the parliament”, Imran Khan said while addressing a huge public gathering at Blambat Ground in Timergara, the district headquarter of Lower Dir.\nReferring to the opposition’s no-confidence motion, the Prime Minister said he has been wishing for such a move by them, who have been talking to dislodge his government by hurling threats of sit-ins or long marches.\n“Insha Allah everything will stand transparent. No-trust motion has provided me an opportunity to take three wickets with one ball,” Imran Khan maintained.\nThe Prime Minister on this occasion also announced to hold a mammoth Pakistan Tehrik-e-Insaf (PTI) rally at D-Choke, Islamabad, on a day before voting on the no-trust motion in the National Assembly.\n“A day before the no-trust move [in National Assembly] Insha Allah there will be a sea of people at D-Choke,” he said.\nThe Prime Minister described Nawaz Sharif, Asif Ali Zardari and Maulana Fazlur Rehman – the leaders PML-N, PPP and JUI-F – as a “bouquet of thieves” and today they were at his aim.\nForeign Minister Makhdoom Shah Mahmood Qureshi and Chief Minister Khyber Pakhtunkhwa Mahmood Khan also addressed the public gathering.\nPrime Minister Imran Khan referred to the statement of Maulana Fazlur Rehman made at a press conference about the country’s important institutions, and maintained that Pakistan was today secure due to a strong army.\nHe cited the examples of destruction – due to wars – in Islamic countries including Iraq, Syria, Libya and Afghanistan and said that countries without the strong defence were not secure.\nThe Prime Minister then referred to some past incidents like attacks against courts, attempts to buy judges to secure favorable verdicts, influencing journalists and remarked that the people, who had damaged institutions in the past, were talking now talking about improving the institutions.\nHe said that Nawaz Sharif, who was now sitting abroad and went to speak lies about his health and earlier through a deal with former President Pervez Mushhar, started the politics of “Changa Manga” and buying the loyalties of the members of parliament.\nThe Prime Minister said that Nawaz Sharif, who once tried to bribe a former army chief by offering a BMW, also held a secret meeting with Indian Prime Minister Narendra Modi in Kathmandu.\nSimilarly, Imran Khan said that Maulana Fazlur Rehman during a meeting with US Ambassador said if he was given opportunity he would better serve them.\nPrime Minister Imran Khan said that PML-N, PPP and JUI-F, which ruled Pakistan for 30 to 35 years, besides burdening the country with huge debt also brought disrespect for the green passport due to their bad governance.\nHe said that civilians including children, women and elderly people in the country lost their lives due to 400 drone attacks during the period of 2008 to 2018, but neither Asif Ali Zardari nor PML-N leaders dared to condemn those attacks and tell the world that those were contrary to international law.\nHe said it was PTI which staged protests against the drone attacks. “How the leaders who have their billions of rupees assets abroad can condemn such attacks?” Imran Khan remarked.\nSimilarly, the Prime Minister said that during the government of Nawaz Sharif, Narendra Modi made accusations of terrorism against Pakistan Army, but he (Nawaz Sharif) instead of taking up the issue with his Indian counterpart asked Foreign Office Spokesman not to issue any anti-India statement.\nHe said that when the heads of government in a country had their assets or money abroad, it cannot a follow an independent foreign policy.\nThe Prime Minister questioned that people like Asif Ali Zardari, who sought the help of US in protecting him from the country’s army through a letter – a reference to memo-gate scandal –, Shehbaz Sharif, who by speaking English and wearing suit and tie also seeks the help of West for getting an opportunity to serve, or Fazlur Rehman would be bringing in improvement in institutions?.\n“It is my message for the bouquet of thieves, forget to see such dreams,” he remarked.\nPrime Minister Imran Khan referred to a video clip of the meeting between Nawaz Sharif and US President Barrack Obama – also available on social media, and said that he (Nawaz Sharif) with pre-written notes in his hands was looking confused.\nImran Khan also mentioned the recent PPP long march led by Bilawal Bhutto Zardari and remarked that at the conclusion of the rally of people hired from Sindh, the only message of Bilawal was “Kanpain Tang Rahi Hain”.\n“Such things happen when you make someone a leader by force,” he further remarked.\nThe Prime Minister said that his government, in line with PTI’s manifesto, was striving to make the country a welfare state on the patterns of Riasat-e-Madina established by Holy Prophet Muhammad (Peace Be Upon Him).\nHe in that respect also mentioned his government’s welfare-oriented programs including the facility of health insurance, under which Rs. one million was provided to a family for medical treatment; interest-free loan of Rs. 500,000 for 3 million families, interest-free housing loan of Rs. 2 million for the poor and middle income classes as well as interest-free loan of Rs. 500,000 for farmers.\nImran Khan said in view of the rising inflation, a global phenomenon, his government had introduced an Ehsaas Ration scheme under which the poor and deserving will get essential food items including wheat flour, ghee, sugar and pulses at 30% less / subsidized rates.\nSimilarly, he said, after the cut of Rs. 10 at per liter price of petrol and diesel, the prices of these petroleum products were cheaper than UAE.\nThe Prime Minister also highlighted rule of law and strong justice system with the accountability of the rich and poor like as some of the major pillars of Riasat-e-Madina and said that his government was heading in that direction.\nImran Khan said that the objective establishing the Rehmatul Al Alamin Authority was to get the country’s youth aware about the life and teachings of Holy Prophet (PBUH). A subject of Sunnah has also been added in the curriculum, he added.\nForeign Minister Makhdoom Shah Mahmood Qureshi speaking on the occasion mentioned the crash incident of an Indian flying object in Mian Channu and urged the world including the International Aviation Association to take notice of the incident, which could hit the international flights of cause loss of lives on ground.\nHe said that Pakistan was a peaceful country, and its patience should not be tested. “Today’s Pakistan does not have a prime minister, who offered saris as gift. Now Imran Khan is the Prime Minister,” he remarked.\nChief Minister Khyber Pakhtunkhawa Mahmood Khan said that by the people of Lower Dir have given their decision about March 31 local government elections in favor of PTI through today’s huge rally.\nHe said that the government will be doing all to address the problems of Lower Dir people through various development schemes including schools, colleges, roads and other civic amenities.",
  "retrievedAt": "2025-08-11T14:31:02.691Z"
}
