{
  "title": "World must probe Indian so-called clarification on supersonic projectile crash into Pakistan: Dr Moeed",
  "link": "https://www.app.com.pk/national/world-must-probe-indian-so-called-clarification-on-supersonic-projectile-crash-into-pakistan-dr-moeed/",
  "date_published": "2022-03-11T18:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP): National Security Adviser (NSA) Dr. Moeed Yusuf on Friday demanded the world community to probe the Indian so-called clarification on supersonic projectile crash into Pakistan as it directly threatened the civilian lives who were airborne in commercial airlines during the high speed object’s flight at 40,000 feet height.\nAddressing an important media briefing in the backdrop of Indian supersonic projectile object crash into Pakistan on March 9 and India’s Ministry of Defence explanation of the incident after three days of the event, he said Pakistan has repeatedly told the world that Indian Modi regime was moving on a fascist ideology that did not act on any logic rather jeopardizes stability of the region and it’s people.\nDr Moeed said India did not bother to take Pakistan into confidence before launching such hi tech object.\n“The supersonic projectile traveled on March 9th, from India traveling at 40,000 feet covered an area over 250 km and landed inside Pakistani territory. It has taken more than two days for India to accept that this was their missile launched ostensibly due to a technical malfunction during maintenance,” he mentioned.\nThe NSA underscored that India used to make unnecessary and concocted criticism on Pakistan at global fora where the global community should investigate and takeIndia to task for it’s responsible conduct.\n“It should be investigated by the world either it was any sinister plot of India behind this incident,” he urged the world fraternity.\nThe NSA said India had become a huge threat for the region and the world as it could not control it’s defence assets.\nThere had been repeated incidents of uranium thefts reported in India where people were caught on road carrying the radioactive nuclear material, he said, adding “Can India be a responsible nuclear state?”\nHe noted that the same Modi regime in 2019 carried out bombardment on another nuclear state of Pakistan. “But thanks to Almighty Allah the received a befitting response and the intruding Indian jets were given a crushing response.”\nHe extended his gratitude while revealing the fact that no life and property losses were reported in the impact area where the projectile crashed.\nDr Moeed said India has become a serious threat, after this incident, for the entire world and it should not considered as an ordinary issue as the projectile was not a toy that traveled over a long distance and crashed into Pakistani territory.\nHe mentioned that the India behaviour was that of a rogue nation and it’s atrocities in Indian Illegally Occupied Jammu and Kashmir were eye opener for the world.\nThe NSA hoped that the world community would realize the threat after Indian negligence and incompetence to handle hi-tech weapons.\nHe questioned that if this incident occurred the western world then the world response would have been different.\nThe NSA mentioned that the height of this missile was similar to that commercial airliners airborne at that time and that it could have landed anywhere on ground and caused heavy damages.\n“It took India two and a half day to release official statement that too after Pakistan revealed that it was there missile and ashamed India where they simply responded it as a malfunction during routine maintenance”, he said.\n“If the world keeps it’s eyes close now to manifest irresponsibility of a state that has a nuclear capability. I am not what message we are giving in terms of demand and sincerity towards peace not only in South Asia and in the world We are unfortunately dealing with a rogue actor we are dealing with a regime that has proved it’s recklessness. It is time for everyone to wake not only for Pakistan sake or South Asia rather for the global peace,” the NSA concluded.\nDr Moeed earlier in a series of tweets on his official Twitter handle wrote, “On March 9th, a supersonic projectile from India traveling at 40,000 feet covered over 250 km & landed inside Pakistani territory. It has taken more than 2 days for India to accept that this was their missile launched ostensibly due to a technical malfunction during maintenance.”\nHe further wrote, “This raises serious questions about India’s ability to handle such sensitive technology. This missile traveled close to the path of international and domestic commercial airlines and threatened the safety of civilians.\nIt is also highly irresponsible of Indian authorities not to have informed Pakistan immediately that an inadvertent launch of a cruise missile had taken place.”In a nuclear environment, he said such callousness and ineptitude raises questions about the safety and security of Indian weapon systems.\n“Already, there have been multiple incidents of uranium theft in India and its citizens have even been arrested while smuggling uranium in the recent past.\nRemember, this is a state apparatus being run by a fascist ideology that has already proven its recklessness by trying to bomb Pakistan in 2019.\nWe have constantly called on the world to look at India’s irresponsible behavior that continues to pose a threat to regional stability. Our calls have been ignored,” he said.\nGiven this incident, and earlier ones, he demanded that the world must consider whether India was able to ensure the safety and security of its nuclear and other high-end weapon systems.\n“It is hard to believe anything this Indian government says. Therefore, the real circumstances surrounding this incident must also be investigated to ascertain if this was an inadvertent launch or something more intentional.\nRegardless, the world must remove its blinders about Indian state’s behavior within its country, its diplomatic direction, & its disregard for the need for peace & stability in its neighborhood. The world must treat this incident with the urgency, sensitivity & alarm it deserves.”",
  "retrievedAt": "2025-08-11T14:30:58.813Z"
}
