{
  "title": "Japanese support restored over 50,700 households in Khyber and Kurram Districts",
  "link": "https://www.app.com.pk/national/japanese-support-restored-over-50700-households-in-khyber-and-kurram-districts/",
  "date_published": "2022-03-11T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):The Government of Japan and Japan International Cooperation Agency (JICA) in collaboration with the government of Khyber Pakhtunkhwa (KP) and Food and Agriculture Organization of the United Nations (FAO), supported 50,762 households under the “Project for Restoration of Livelihoods in the Merged Areas” in Khyber and Kurram districts.\nJapan’s grant of US$ 5.3 million was extended in continuation of the initial support of US$ 5 million for “The Project for Assistance to the Recovery and Development of the Agricultural Economy in FATA”, implemented from 2015 to 2017, as vital support for 77,200 returning families/households in the merged areas.\nThe Phase II of the initial project focused on adopting climate-smart and resilient agricultural interventions, including the dissemination of improved practices for increasing livestock, poultry and inland fisheries’ production, introduction of efficient water harvesting methods, and rehabilitation of irrigation structures, and executed Integrated Natural Resource Management (INRM) plans.\nFurthermore, the project also contributed to enhance agricultural productivity and value addition, and develop key value chains and functional markets for sustainable food supply and improved nutrition, said a news release issued here Friday.The ceremony was held in Islamabad to celebrate the completion of the project which was attended by the Ambassador of Japan, WADA Mitsuhiro, Chief Representative of JICA Pakistan, FURUTA Shigeki, FAO Representative in Pakistan, Farrukh Toirov, Secretary Agriculture, Government of Khyber Pakhtunkhwa, Dr. Muhammad Israr Khan, and high level officials of relevant departments.\nSpeaking on the occasion, the Ambassador said, we recognize the livelihoods in Pakistan have been increasingly affected by the Afghanistan humanitarian crisis, and we consider sustainable agriculture essential for securing livelihoods. Through our strong partnership demonstrated by this project, I hope we will continue to work together to achieve sustainable development in Pakistan, he said.\nChief Representative of JICA Pakistan Office FURUTA Shigeki, noted, the project has contributed to ensuring food security through sustainable agriculture development, value addition in agriculture and capacity development of those who engage in the fields of agriculture and livestock. It has also promoted the restoration and improvement of the livelihoods in Kurram and Khyber Districts. Building sustainable livelihoods is essential to achieve peace and stability in the region, and where peace and stability exists, further development and prosperity can be realized, he added.\nHighlighting the achievements of the Project, Farrukh Toirov, Deputy FAO Representative in Pakistan said, the economy of newly merged districts, based mainly on subsistence agriculture, has historically been weaker than the rest of the country, which was further accentuated by the mass-scale exodus of population to other areas as IDPs.\nThe support provided by the Government of Japan has played a very crucial role in the recovery and rehabilitation of the returned families in Khyber and Kurram district of KP. Therefore, apart from its original mandate, FAO also supported its target beneficiaries against the Covid-19 and Locust infestation. More than 50,700 HHs were supported through the provision of quality inputs to resume their agri-base livelihoods and to start new enterprises under agricultural value chains. FAO has scaled-up its interventions to ascertain improved farming practices and enhance productivity and thus created linkages of farmers with the outside markets, he expressed.\nSecretary Agriculture, Livestock, Fisheries and Cooperatives’ Department, government of KP, Dr. Muhammad Israr Khan while appreciating the performance of the project, said that the government of Japan, through JICA, has been supporting the rehabilitation of IDPs in Khyber and Kurram districts since 2015. During the 1st phase of their support from July 2015 to September 2017, about 77,000 families were assisted; and now under the second phase started in April 2018 and ended in December 2021, more than 50,700 families have been supported.\nHe said that agriculture was the mainstay of the people in the merged districts and plays a very pivotal role in their livelihoods. Therefore, the Government of KP is making all its efforts to enhance agriculture production and increase their sources of income through various developmental initiatives. He further said that apart from supporting IDPs.",
  "retrievedAt": "2025-08-11T14:31:01.236Z"
}
