{
  "title": "Opposition making hue and cry as defeat of no confidence motion imminent: Farrukh",
  "link": "https://www.app.com.pk/national/opposition-making-hue-and-cry-as-defeat-of-no-confidence-motion-imminent-farrukh/",
  "date_published": "2022-03-11T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 11 (APP):Minister of State for Information and Broadcasting Farrukh Habib on Friday said the opposition was making hue and cry over arrest and abduction of its members of National Assembly as it was unable to complete numbers for the success of the no confidence motion which was doomed to fail.\nAddressing a press conference along with Secretary PTI International Chapter Dr Abdullah here, he said that no JUI-F worker was arrested during its long march.\nSimilarly Bilawal Bhutto Zardari led a long march from Karachi to Islamabad and none of the PPP workers was arrested and no hurdles were created in its way as the government believed in democratic right of protest.\nOn the contrary, he said that when PTI started its long march during PML-N era, an entire province was blocked and rubber bullets were fired on the participants.\nThe minister said the government wanted that the opposition should bring a no confidence motion in the House so that their bluff of support should be exposed once for all.\nHe said that the PTI government was fully confident of defeating the no trust motion as it enjoyed support of its allies.\nFarrukh said that it was a matter of routine to hold consultations and meeting with other party leaders and there was no reason to doubt any body’s intentions.\nHe said that despite many challenges, the government had always taken its allies on board and addressed their grievances, adding in future it would continue the same policy.\nThe minister said that the prime minister despite not having clear majority, followed independent foreign policy.\nHe claimed that Hamza Shahbaz Sharif had criticized the prime minister’s remarks about EU but when in power the previous rulers used to follow the dictates of the western powers.\nHe reminded that when the PPP and PML-N were in power over 400 drone attacks were carried out in Pakistan’s territory.\nFarrukh Habib said that the entire nation had supported the prime minister’s stance about ” absolutely not”, as he believed in dignity and honour of the nation.\nThe minister said the prime minister’s stance on Islamophobia had been appreciated all over the world.\nHe urged to take notice of the JUI-F workers attack on the Parliament lodges as the political parties were not allowed to train the armed activists.\nFarrukh said that the goons of JUI-F tried to harass the members of the parliament and their families residing in the lodges.\nHe said that overseas Pakistanis sent $ 30 billion in remittances last year which stood at $ 18 billion per year till 2018.\nThe minister said overseas Pakistanis had played an important role in making Imran Khan as Prime Minister.\nHe hoped that record remittances would come this year in the country.\nIn the past no government was ready to empower overseas Pakistanis, he said adding the biggest demand of the overseas was the right to vote.\n“Our government gave overseas the right to vote through legislation”, Farrukh Habib said.\nMoreover, he said the process of power of attorney had been made online and ‘Roshan Digital Account’ was launched for the facilitation of expatriates.\nThe minister said that ‘Roshan Digital Account’ had accumulated $ 3.5 billion in digital accounts.\nHe said that under this account, overseas Pakistanis could avail bank loans for purchase of the houses.\nThe minister said that overseas Pakistanis would like to thank the prime minister through the Overseas Convention to be held on March 13, to 15, in Islamabad.\nHe said that Prime Minister Imran Khan would address the convention on March 15.\nFarrukh Habib paid tributes to the efforts of Pakistanis abroad for the development of the country and termed them precious assets.",
  "retrievedAt": "2025-08-11T14:31:08.777Z"
}
