{
  "title": "Pakistan needs to develop coherent national policy for horticulture development:Jawad",
  "link": "https://www.app.com.pk/national/pakistan-needs-to-develop-coherent-national-policy-for-horticulture-developmentjawad/",
  "date_published": "2021-12-25T11:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):Pakistan yet to take an appropriate pie from global cake at the account of horticulture exports, despite the fact that the global trade in horticulture had increase four times over two decades and stood at more than USD 200 billion in 2019, said FPCCI Chairman Standing Committee on Horticulture Exports, Ahmad Jawad.\nTalking to APP here on Saturday, he said that since 1947, agriculture sector has received inconsistent attention. There have been times of great development however it can be argued that last two decades have been worse for the agriculture. A research conducted by the International Food Policy Research Institute (IFPRI) revealed that the Total Factor Productivity, one of the most informative measures of agricultural productivity, has been negative over the past two decades. This shows that our growth is now reliant on inputs or increase in area under cultivation.\nHe said according to the Agriculture Census 2010, 78 percent of the farmers in Pakistan have land-holdings of less than 7.5 acres. Wheat, cotton, maize, sugarcane and rice are the main crops grown by these farmers. These crops are labor intensive and mechanization plays a small role.\nThis means that sowing of these traditional crops is of little competitive advantage for these subsistence farmers as compared to high value agriculture. Therefore, it is high time to capitalize on the opportunities offered by horticulture and it has to be given a central role in order to boost the agriculture growth.\nAs per a report of Food and Agriculture Organization (FAO) of the United Nations, rising living standards and burgeoning population will swell the demand for horticulture products by 70% over the next thirty years.\nHe said Pakistan retains only 1.5% share in world exports of citrus fruits and 2.8 percent share in world exports of potatoes; however through upgrading our production methods, seed varieties, processing infrastructure and produce quality, we could easily exported USD 2.2 billion worth of horticulture commodities in next two years.\nJawad further told that Egypt provides a good case study for Pakistan to learn by implementing a Sustainable Agricultural Development Strategy since 2009, Egypt has focused on capturing export markets for its horticulture commodities and currently exports about USD 3.2 billion worth of oranges, grapes, potatoes, strawberries and onions to the Russian Federation, European Union and the Middle East.\nJawad was of the view that: “Pakistan has the potential to export processed citrus products and potato fries and chips, however the unavailability of industrial gradevarieties, surplus production, and processing capacity have been the binding constraints for making export quality food products”.\nHe said Pakistan needs to increase its output by improving yields and attaining exportable surplus crops. There is currently an emphasis on catering to the domestic market. India was one of the key players in this industry through value addition but in our last 70 years the concerned ministries didn’t work on it aggressively, the more down-fall started when we devolve agriculture and its allied sectors to provinces through 18th Amendment.\nHe said currently Pakistan’s horticulture sector suffers from low-yields as compared to its peer countries, unavailability of the necessary seeds for industry grade produce of fruits and vegetables, weak contract enforcement for contract farming, poor on-farm sanitary and phytosanitary standards (SPS) enforcement, inadequate post-harvest infrastructure for packing, handling and transportation, lack of protocols for certifications of health and safety standards, and unassured supply of raw material to processors.\nHowever, under CPEC, China is potentially a large export destination for Pakistan’s fruit commodities, but exports are restricted due to stringent SPS compliance requirements enforced by China. For instance, citrus trade is not permitted via land and air routes to China, and therefore Pakistan has to transport its mandarins by sea to the eastern Chinese ports, increasing cost and time. It would be cheaper and easier to export via land which yet to pending a quarantine agreement between Pakistan and China.\nSimilarly industry and academia linkage would pay dividends to enhance horticulture exports.It was a prerequisite for transforming the agriculture sector into a hi-tech industry and enabling it to compete at global level.\n“We as a developing nation can generate surplus amount of wealth from industry academia linkages (IAL). It possesses a wide range of benefits that can influence universities, companies, society and nation. The benefits relating to society through IAL are numerous”, he added.\nThe Pakistan Horticulture Development and Export Company (PHDEC) initially worked somehow well, it latter virtually becomes dormant, he said.He said it is high time the government to announce certain incentives ie owners or operators should get only leased land in special economic zones (SEZs) on a 15-years basis which would be a great push to horticulture sector dwindling infrastructure.\n“I must say Pakistan needs to develop a coherent national policy for horticulture development that integrates the views of all the stakeholders, i.e. farmers, input service providers, agriculture traders and provincial and federal governments. Seed certification regime, swift approval of crop protection chemicals which are safe anddevelopment and adoption of horticulture produce quality standards are the main areas to be worked on”, he said.\n“A growing and developed horticulture sector can create avenues of employment for the rural poor, enhance house hold income, provide people with quality fruits and vegetable and open opportunities for exports”, he added.",
  "retrievedAt": "2025-08-11T21:45:34.484Z"
}
