{
  "title": "Air Chief pays tributes to Quaid-e-Azam, felicitates Christian community on Christmas",
  "link": "https://www.app.com.pk/national/air-chief-pays-tributes-to-quaid-e-azam-felicitates-christian-community-on-christmas/",
  "date_published": "2021-12-25T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):Chief of the Air Staff, Pakistan Air Force (PAF) Air Chief Marshal Zaheer Ahmed Baber Sidhu on Saturday paid tribute to the founder of Pakistan Quaid-e-Azam Muhammad Ali Jinnah on his birthday anniversary.\nIn his message, he said, “25th December marks the birthday of Quaid-e-Azam Muhammad Ali Jinnah. Indeed, the father of our nation was a great leader gifted with precision of intellect, fairness of outlook, strong character and charming personality”, said a PAF media release.\nHe further said, “Above all, he was a visionary who could see far ahead of times and whatever he prescribed proved to be correct and true. On the strength of his golden principles of Unity, Faith, and Discipline, he united and led the Muslims of the Sub-Continent and eventually succeeded in carving a separate homeland for them. No doubt, he achieved a task the like of which few men in history have had to their credit. Certainly, he will ever remain an eternal source of inspiration and guidance for us all”.\nIn his message to PAF Personnel he said, “In line with Quaid’s vision for PAF being ‘Second to None’, let me remind you that in the uncertainties of the present world, we must enhance our capabilities. As such, I urge you to redouble your efforts to vigorously pursue PAF’s future-focused goal of becoming a “Next-Generation Air Force”.\n“I am sure with dedicated hard work, resilience and determination; you will be able to take PAF to new heights of glory in the times ahead. I am proud that Pakistan Air Force has a glorious history and has always lived up to the Nation’s expectations”.\nOn the happy occasion of Christmas which also falls on 25th December, the Air Chief extended his warm greetings to Christian personnel serving in PAF and said that their services for Pakistan, as indeed Pakistan Air Force, are commendable and held in high esteem”.",
  "retrievedAt": "2025-08-11T21:45:40.271Z"
}
