{
  "title": "NA Speaker, Saudi Shura Council Chairman discuss strategic ties, regional unity",
  "author": null,
  "content": "ISLAMABAD, Oct 07 (APP):Speaker of the National Assembly Sardar Ayaz Sadiq met with Chairman of the Saudi Shura Council, Dr. Abdullah bin Mohammed bin Ibrahim Al-Sheikh, on Tuesday where both leaders held comprehensive discussions on bilateral relations, parliamentary cooperation, regional developments, and the unity of Muslim Ummah.\nDuring the meeting, Speaker Ayaz Sadiq highlighted that Pakistan and Saudi Arabia enjoy deep-rooted relations based on faith, brotherhood, and mutual trust.\n“Saudi Arabia has always been a sincere friend of Pakistan,” he said, emphasizing that the newly signed Pakistan–Saudi Strategic Mutual Defence Agreement marks a “historic milestone” and “a proud achievement” for Pakistan.\nHe added that the agreement reflected both countries’ enduring friendship, confidence, and shared commitment to regional peace.\nSadiq noted that the accord opened a new chapter of long-term partnership and mutual development. “Parliamentary cooperation will play a key role in bringing the peoples of both nations closer,” he remarked.\nThe Speaker also conveyed best wishes for King Salman bin Abdulaziz, Crown Prince Mohammed bin Salman, and the Saudi people, paying tribute to the Saudi leadership’s role as Custodians of the Two Holy Mosques.\nHe lauded Saudi Arabia’s significant contribution to preserving the cultural and moral heritage of the Muslim Ummah and commended its leadership for its “visionary efforts toward the Ummah’s unity and prosperity.”\nLauding Riyadh’s diplomatic leadership, Ayaz Sadiq said: “We deeply appreciate Saudi Arabia’s positive and leading role in calling for a ceasefire in Gaza,” adding that the Kingdom’s continued support for Pakistan’s stance on Kashmir and its solidarity during the Pakistan–India conflict were “deeply valued.”\nHe underlined that Pakistan’s government and opposition stand united in their commitment to strengthening relations with Saudi Arabia.\nThe Speaker announced that Dr. Abdullah bin Mohammed bin Ibrahim Al-Sheikh will be conferred Pakistan’s highest civil award in recognition of his efforts to enhance Pakistan–Saudi relations.\nExpressing gratitude for the warm welcome, Dr. Al-Sheikh said he was “delighted to visit Pakistan,” reaffirming that Saudi Arabia attaches great importance to its relations with Pakistan.\n“Our defense agreement has brought our two nations even closer — it is not directed against any country,” he clarified.\nHe stressed the need to expand inter-parliamentary cooperation, describing Pakistan as a vital country in the Islamic world.\n“Saudi Arabia views Pakistan as a key partner in its foreign policy, and unity among Muslim nations is essential for addressing the challenges facing the Ummah,” Dr. Al-Sheikh said.\nVideo Playerhttps://www.app.com.pk/wp-content/uploads/2025/10/saudi-shura.mp400:0000:0000:00Use Up/Down Arrow keys to increase or decrease volume.\nBoth leaders underscored the importance of strengthening economic cooperation, regional connectivity, and solidarity among Muslim nations.\nThe meeting was attended by Deputy Speaker Syed Ghulam Mustafa Shah, Federal Minister for Religious Affairs Sardar Muhammad Yousuf, Saudi Ambassador Nawaf bin Saeed Al-Maliki, and several Members of the National Assembly, including Syed Hafeezuddin, Zeib Jaffar, Malik Aamir Dogar, Sehar Kamran, Mujahid Ali, and Noor Alam Khan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:56:28.732Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/na-speaker-saudi-shura-council-chairman-discuss-strategic-ties-regional-unity/",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T14:53:00.000Z"
}
