{
  "title": "Pakistan, Malaysia call for Gaza ceasefire, commend efforts for Palestinian statehood",
  "author": null,
  "content": "KUALA LUMPUR, Oct 7 (APP): Pakistan and Malaysia have called for an immediate, unconditional and permanent ceasefire, an end to the blockade on Gaza, the protection of all civilians and for unimpeded flow of humanitarian assistance to those affected immediately.\nThe two sides also commended the international community’s efforts to find pragmatic measures in resolving the question of granting a Palestinian statehood.\nAccording to a joint statement issued on Tuesday at the conclusion of the three-day official visit of Prime Minister Muhammad Shehbaz Sharif to Malaysia from 5–7 October 2025, the leaders of the two countries held a bilateral meeting on 6 October 2025 to discuss bilateral ties and exchange views on regional and international issues of mutual interest.\nDuring the meeting, they also discussed geopolitical issues, particularly the ongoing conflicts in the Middle East and the humanitarian situation in Rakhine State, Myanmar, which affects the Rohingya Muslim community. In this context, both leaders strongly condemned the ongoing genocide in Gaza and reiterated their unwavering support for the Palestinian people’s right to self-determination and the establishment of a sovereign, viable, contiguous, and independent Palestinian state, based on pre-June 1967 borders with Al-Quds Al-Sharif as its capital.\nThe leaders also agreed to reconvene, at a mutually convenient time, the Joint Commission Meeting at the level of the Foreign Minister.\nThey reaffirmed their commitment to promoting balanced and sustainable economic ties through enhanced market access, business facilitation, and the effective utilisation of the Malaysia–Pakistan Closer Economic Partnership Agreement (MPCEPA).\nMalaysia expressed its intention to expand palm oil exports to Pakistan and also agreed to ensure a stable and sustainable supply chain, while upholding environmentally responsible practices.\nThey also acknowledged the growing global demand for halal products and services, and agreed to strengthen cooperation in the field of halal.\nBoth leaders acknowledged the importance of sustainable agricultural practices and agreed to explore joint research, innovation, and the development of sustainable agricultural production methods.\nThe leaders expressed satisfaction with the strong ongoing defence collaboration under the purview of the Joint Committee on Defence Cooperation (JCDC) platform, since its establishment in 1997.\nCooperation between the two countries has been tremendously strengthened through high-level visits, regular bilateral meetings at ministerial and military levels, military-to-military engagements and defence industry linkages. Both sides also agreed to further deepen the bilateral defence cooperation, particularly in the field of defence science, technology, and industry, through knowledge and technology transfer.\nThe two sides welcomed further cooperation in education, including technical and vocational training, and the enhancement of institutional partnerships.\nRecognising the importance of aviation in fostering greater connectivity and promoting people-to-people exchanges, the leaders agreed to enhance air travel services and explore opportunities for increased connectivity between Malaysia and the Islamic Republic of Pakistan.\nEfforts will focus on increasing air traffic rights to enable the expansion of flight routes and facilitating the growth of air travel, thereby strengthening economic, business, and tourism ties between the two nations.\nThe leaders agreed to explore collaboration in healthcare, pharmaceuticals, and medical devices, with the aim of enhancing public health and commercial exchanges in these sectors.\nBoth leaders expressed optimism in expanding tourism cooperation, particularly in light of Malaysia’s “Visit Malaysia 2026” (VM2026) and “Malaysia Year of Medical Tourism 2026” (MYMT2026) campaigns. Malaysia extended a warm welcome to Pakistani travelers, and the leaders agreed to enhance tourism promotion and cultural exchanges from both sides.\nBoth leaders recognised the importance of people-to-people ties and welcomed the positive contribution of the Pakistani diaspora in Malaysia to national development. They reaffirmed their commitment to strengthen cooperation in the area of labour, including technical training and skills development.\nAcknowledging the importance of energy security and sustainability, the leaders agreed to explore cooperation in the fields of renewable energy, energy transition, and climate resilience, including knowledge-sharing, joint research and investment in clean energy projects.\nBoth leaders reaffirmed their support for enhanced collaboration in science, technology, and innovation (STI), including cooperation in areas such as artificial intelligence and digital transformation.\nThey underscored the critical importance of regional cooperation in disaster management and risk reduction, and committed to enhancing the exchange of knowledge and best practices in humanitarian assistance, emergency response, and post-disaster recovery and reconstruction.\nThe leaders expressed their commitment to enhance cooperation in cybersecurity and efforts in combating transnational organised crimes, terrorism, terrorism financing as well as cybercrime. They agreed to continue exchanging information and expertise to address emerging security challenges.\nThe leaders noted the active cooperation on key issues within the framework of international organisations, particularly the United Nations (UN) and the Organisation of Islamic Cooperation (OIC), Developing-8 Organisation for Economic Cooperation (D-8).\nBoth leaders reiterated their shared commitment to strengthening the solidarity of the Muslim Ummah and upholding the true values of Islam.\nThe two leaders also reaffirmed their commitment to a peaceful and stable Afghanistan and a sustainable future for its people. They emphasized the importance of continued engagement with the interim Afghan authorities, particularly for combating terrorism, to prevent the use of Afghan soil against other countries. They also stressed the importance of maintaining humanitarian assistance and capacity building for the Afghan population.\nThey condemned all forms of Islamophobia, xenophobia and incitement to violence, and reaffirmed their call upon the international community to undertake concerted action to combat intolerance, negative stereotyping, stigmatisation, discrimination, and violence against persons based on religion or belief.\nThe leaders welcomed the adoption of UN General Assembly Resolutions 76/254 and 78/264, reaffirming the significance of the International Day to Combat Islamophobia, and encouraged the Secretary-General to pursue the development of an action-oriented Plan in consultation with Member States, to effectively address Islamophobia and related forms of religious hatred.\nThe leaders further welcomed the appointment by the Secretary-General of Miguel Ángel Moratinos Cuyaubé of Spain as the UN Special Envoy to Combat Islamophobia on 7 May 2025, noting his concurrent role as the High Representative for the UN Alliance of Civilizations, and expressed their support for his mandate as part of collective international efforts to counter intolerance and promote peaceful coexistence.\nPrime Minister Shehbaz Sharif reaffirmed the Pakistan’s strong support for Malaysia’s ASEAN Chairmanship and expressed confidence in Malaysia’s leadership in steering ASEAN towards deeper regional integration, peace, and prosperity.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:56:21.553Z",
  "source": "APP",
  "link": "https://www.app.com.pk/global/pakistan-malaysia-call-for-gaza-ceasefire-commend-efforts-for-palestinian-statehood/",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T14:31:00.000Z"
}
