{
  "title": "Pak-EPA to hold hearing on New Downtown Project in Islamabad tomorrow",
  "author": null,
  "content": "ISLAMABAD, Oct 07 (APP): The Pakistan Environmental Protection Agency (Pak-EPA) has announced that a public hearing on the Environmental Impact Assessment (EIA) for the proposed Infrastructure Development of the New Downtown Project in Sector D-16/4, Zone-II, Islamabad, will be held on Wednesday, October 8, 2025, at 11:00 a.m. at Galaxy Marquee, near Tarnol rail crossing, GT Road, F-15, Islamabad.\nThe session will be presided over by the Director General, Pak-EPA, and aims to seek public input on the project’s potential environmental implications before final approval.\nAccording to an official notification issued by Khair Ullah, Deputy Director (EIA/M), stakeholders, community representatives, and the general public are invited to attend and share their views.\nThe project, submitted by Raja Naseer Ahmed, Secretary of the Cabinet Division Employees Cooperative Housing Society (CDECHS), includes large-scale infrastructure development under the “New Downtown Project” aimed at urban expansion and housing in Islamabad’s Zone-II.\nThe EIA report submitted to Pak-EPA outlines the existing environmental conditions of the project area, potential environmental and social impacts, and proposed mitigation measures to minimize ecological disruption during and after construction.\nEarlier, as part of the EIA review process mandated by the Pakistan Environmental Protection Act, 1997 and IEE/EIA Regulations, 2000, Pak-EPA published a public notice on September 6, 2025, in leading Urdu and English newspapers inviting feedback from citizens and relevant stakeholders.\n“The public hearing provides a vital platform for transparency and community participation in environmental decision-making,” a Pak-EPA spokesperson told APP.\nHe emphasized that such forums allow for broader scrutiny of projects that could affect local ecosystems, infrastructure, and residents’ quality of life.\nInterested participants can review the detailed EIA documents at the Green Library, Pak-EPA, Islamabad, or through the proponent’s office at CDECHS.\nA digital version of the report is also available on the official Pak-EPA website at environment.gov.pk.\nStakeholders have been requested to confirm their participation at the earliest to ensure smooth arrangements for the hearing.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-10-11T23:56:01.035Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pak-epa-to-hold-hearing-on-new-downtown-project-in-islamabad-tomorrow/",
  "dateList": "2025-10-07",
  "date_published": "2025-10-07T14:59:00.000Z"
}
