{
  "title": "Survey of Pakistan completes 93 percent tasks of geo tagging, properties digitization of ETPB",
  "link": "https://www.app.com.pk/national/survey-of-pakistan-completes-93-percent-tasks-of-geo-tagging-properties-digitization-of-etpb/",
  "date_published": "2021-09-05T10:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): Survey of Pakistan has completed the 93 percent tasks of field surveys, geo-tagging, and digitization of the properties under the project of `Geo-tagging/Mapping and development of the MIS System of Evacuee Trust Property Board (ETPB)’.\nAccording to an official source, the project was assigned to the Survey of Pakistan by the Prime Minister of Pakistan, Imran Khan.\nThe scope of the project includes field survey for delimitation of properties on the ground, geo-tagging/digitization of properties, development of the android application, geo-portal as well as a management information system, and development of APIs for system integration.\nThe hosting of the developed application, portal, and MIS on the SoP server is also part of the project. The project also includes consultancy services for the establishment of a data center at ETPB.\nThe duration of the project is 01 year whereas the cost of the project is PKR 28 (M). The project was started on July 10, 2021 and will be concluded on October 06, 2021.\nThe official source revealed that 93 percent task of field survey, geo-tagging, and digitization of the properties has been completed under the project.\nA field survey of the remaining properties (7%) is in process in the district of Jhang, Lahore, and Shikarpur. Android Application has been developed and deployed at the SoP server.\nMoreover, the Geo-portal and MIS are also up and running on SoP servers. The enrichment/verification of data records and capturing of real-time pictures of the properties through the android application by the ETPB is in process.\nAs an outcome of the project, all the un-billed properties have been surveyed/ geo-tagged and brought into the rent circle. Few land-use changes have also been identified.\nThese are, changes of land type from agriculture to residential, from residential to commercial, and from Kachi Abadi to built-up. These changes help to generate more revenue for the ETPB. Resultantly as reported by the ETPB that revenue collection has increased 27 % from PKR 1907 (M) to PKR 2431 (M).\nMoreover, as the project would mature further, better assessment of leased/rented properties would further improve the revenue, the source said.",
  "retrievedAt": "2025-08-11T21:10:38.656Z"
}
