{
  "article_id": "2025-08-20_6e3899f17d5539f493e5bb8ef9261352",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nha-to-remain-active-until-full-restoration-of-roads-in-gb-aleem-khan/",
    "retrieved_at": "2025-08-22T00:35:28.290Z"
  },
  "metadata": {
    "title": "NHA to remain active until full restoration of roads in GB: Aleem Khan",
    "author": null,
    "date_published": "2025-08-20T12:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 278,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 20 (APP): Federal Minister for Communications Abdul Aleem Khan met Governor Gilgit-Baltistan (GB) Syed Mehdi Shah on Wednesday and discussed the post-flood situation, road rehabilitation and relief efforts in the region. Governor Mehdi Shah praised the swift response and relief operations carried out by the National Highway Authority (NHA) and the Communications Ministry, noting that timely deployment of heavy machinery in such difficult circumstances was commendable and had played a vital role in the opening of the road network in GB, said a press release. Both leaders expressed grief over the loss of precious lives and public property in various districts due to rains but noted that joint efforts of the federal and provincial governments have accelerated the process of reopening transport routes. Governor GB also thanked Federal Minister Abdul Aleem Khan for personally visiting Gilgit-Baltistan. Abdul Aleem Khan said that this natural calamity was indeed a major challenge; however, NHA, FWO and other institutions immediately responded and began emergency work from day one with additional machinery and workforce deployed from Punjab and Sindh. He added that he was personally in Gilgit-Baltistan to oversee the restoration of the affected highways. They also talked about Naltar Expressway, Babusar Road, Ghizer Expressway and other key routes and noted that progress is being reviewed on a daily basis. Abdul Aleem Khan told that heavy machinery and the dedicated workforce of the National Highway Authority working diligently at the affected sites and that NHA will remain fully engaged until complete restoration of the roads. Abdul Aleem Khan further stated that the restoration process has accelerated due to strong coordination between the concerned agencies and opening of highways is being materialized.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}