{
  "title": "India’s quest for permanent UNSC seat a pipe dream: Experts",
  "link": "https://www.app.com.pk/national/indias-quest-for-permanent-unsc-seat-a-pipe-dream-experts/",
  "date_published": "2021-08-21T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD,  Aug 21 (APP): The deadlocked negotiations at the United Nations aimed at expanding the Security Council will resume later this year, with experts giving little hope for a breakthrough as India, Brazil, Germany and Japan – G4 – remain inflexible in their demand for permanent membership of the 15-member body.\nThe G-4’s push for a seat on UN’s high table is being firmly resisted by Italy/Pakistan-led Uniting for Consensus (UfC) group, which stands  for enlarging the two-year non-permanent category. UfC argues that adding more permanent members will not make the Security Council more effective and undermine the fundamental principle of democracy that is based on periodic elections.\nAmong the G-4, India appears to be most anxious and vocal in the relentless campaign for a more prominent role in the Security Council. It’s Hindu-nationalist Prime Minister, Narendra Modi, beseeched the UN General Assembly last year to heed to India’s long-standing demand.\n“Till when do we have to wait? Till when will India be kept away from the UN’s decision-making process?,” he had asked.\nIn a sharp response within an hour, Pakistan’s UN Ambassador Munir Akram reaffirmed  Pakistan’s opposition to Modi’s plea to the 193-member Assembly, saying there’s no place for a fascist state in the Security Council.\n“It’s a pipe dream,” Ambassador Akram said. “The world does not want a fascist state as a permanent member of the Security Council.”\nIndeed, it will remain India’s pipe dream as the procedures to get to the goal are not only long and complicated but questions have also risen about New Delhi’s qualification for permanent membership, especially after its 5 August 2019 unilateral annexation of occupied Jammu and Kashmir in violations of UN resolutions, and placing the disputed region under an oppressive military lockdown.\nIn June,  India miserably failed in its desperate attempt to shape the reform process to work in his group’s favour when the  General Assembly adopted a draft decision, by consensus, to pave the way to continue intergovernmental Negotiations (IGN) on restructuring the Security Council during its  next — 76th — session.\nThe G-4 had had moved an amendment that sought to make an “elements paper” on areas of divergence and convergence — drafted by the representatives of Poland and Qatar in their capacity as co-chairs of the negotiations — a basis for future discussions. The move met with strong opposition and the amendment was withdrawn, a step that diplomats said was a big setback to the aspirants for permanent membership.\nFull-scale negotiations to reform the Security Council began in the General Assembly in February 2009 on five key areas — the categories of membership, the question of veto, regional representation, size of an enlarged Security Council, and working methods of the council and its relationship with the General Assembly.\nDespite a general agreement on enlarging the Council, as part of the UN reform process, member states remain sharply divided over the details.\nThe G-4 have shown no flexibility in their push for expanding the Council by 10 seats, with six additional permanent and four non-permanent members.\nOn the other hand, the UfC group has proposed a new category of members — not permanent members —  with longer duration in terms and a possibility to get re-elected.\nThe Security Council is currently composed of five permanent members — Britain, China, France, Russia and the United States — and 10 non-permanent members elected to serve for two years.\nIndia, currently a non-permanent member of the Security Council, had hoped to improve its prospects for a permanent seat, but it’s conduct has become controversial. As president of the council for the month of August, India used its powers to keep Pakistan out of the debates on the situation in Afghanistan, despite the fact that Islamabad, as an immediate neighbour, has vital interest in the discussions.\nIn addition, there are reports about disquiet prevailing among a majority of  members that India portrayed itself as a champion against terrorism at a recent council meeting, and also for turning that meeting into its “signature” event.\nReacting to India’s tactics, Ambassador Munir Akram said he was not surprised by India’s anti-Pakistan partisanship, saying, “this confirms Pakistan’s long-held contention that India does not deserve to be a member of the Security Council, much less to aspire for peaceful relationship of this body whose resolutions on Jammu and Kashmir it has defied and violated for decades and where its 900,000 occupation Army is committing massacre and human rights violations with impunity.”\nMeanwhile, according to media reports, India continues with its design to change the demographic structure of the occupied territory in clear violation of international law, including the 4th Geneva Convention, having already issued over 3.4 million fake domicile certificates.\nDiplomatic observers said it was “ironic” that India was seeking the permanent membership of the Security Council, whose resolution it has violated with impunity.\nThe resolutions established self-determination as the governing principle for the settlement of the Kashmir dispute. “This is the world body’s commitment to the people of Kashmir,” one observer said.\nThe resolutions endorsed a binding agreement between India and Pakistan reached through the mediation of the United Nations Commission for India and Pakistan (UNCIP) that a plebiscite would be held, under agreed and specified Conditions.\nThe Security Council has rejected the Indian contention that the people of Kashmir have exercised their right of self-determination by participating in the “election” which India has from time to time organized in the held Kashmir, it was pointed out. The 0.2% turn out during the 1989 “elections” was the most recent clear repudiation of the Indian claim.\n“It is evident that Indian deliberately committed to defy UN resolutions about peaceful settlement of Kashmir problem, time and again the world community has openly expressed their serious concerns about Indian attitude which has been a source of disturbance to regional peace involving three nuclear armed states,” according to an analyst.\n“The international community be made aware of the difference between words and actions of a country which present itself as world’s largest functioning democracy and a tolerant secular state,” he said.  “The time has come that world must recognize the actual face of a country involved in gross human rights violations  pursuing Hindutva policy and is set to become a fascist Nazi state.”\n‘India is a country which has waged 20 wars with its neighbors since independence and acted as a peace spoiler, fomenting terrorism and instability across the region, especially in Pakistan,’ the analyst pointed out.\n“International stakeholders and members of UN General Assembly be reminded of their combined responsibility to compel India to act in line with the UNSC resolutions on Kashmir issue before aspiring for a permanent UNSC seat.”",
  "retrievedAt": "2025-08-11T21:06:49.547Z"
}
