{
  "title": "NUML, Azerbaijan University of Languages join hands to promote culture",
  "link": "https://www.app.com.pk/national/numl-azerbaijan-university-of-languages-join-hands-to-promote-culture/",
  "date_published": "2021-08-21T11:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): The National University of Modern Languages (NUML) and Azerbaijan University of Languages have joined hands to promote cultural diversity of the two brotherly nations in their respective institutions.\nThe initiative aimed at to understand and promote each other’s cultural and historical perspectives that could further enhance public interaction of the two countries and would ultimately help to boost economic cooperation.\nAssistant to Rector of Azerbaijan University of Languages Anar Rahimov, along with media spokesperson of Azerbaijan Embassy Islamabad Elchin Mehdiyev visited NUML and met with Rector Major General (Retd) Muhammad Jaffar.\nRahimov informed the Rector NUML about the newly inaugurated Pakistan Cultural Center at the Azerbaijan University of Languages and noted that with the initiative of Rector Kamal Abdulla, they intend to open the Azerbaijani Language and Culture Center at NUML, as well as to teach Azerbaijani Multiculturalism subject in brotherly Pakistan from next term.\nAnar Rahimov while talking to APP, said that the implementation of such projects will further deepen relations between the two countries, strengthen people to people contacts, as well as contribute to the development of scientific and educational ties between Azerbaijan and Pakistan.\nHe said that the two countries highly valued their ties which are based upon on strong historic, cultural and religious bonds, besides having an excellent cooperation at various international fora which needed to be further expanded in the areas of trade, economy and culture for the mutual benefit of the two sides\nLater, Rector NUML Major General (Retd) Muhammad Jaffar has welcomed Rector Kamal Abdulla’s intention of opening of the Azerbaijani Language and Culture Center and teaching of Azerbaijani Multiculturalism subject at NUML from the next term.\nHe assured his full cooperation regarding establishment of new study centre and expressed confidence that the university administration would provide all necessary assistance for the inauguration of the said center.\nThe Azerbaijani Language and Culture Center is scheduled to be inaugurated here at NUML in September 2021.",
  "retrievedAt": "2025-08-11T21:06:48.987Z"
}
