{
  "title": "President promulgates Ordinance for establishing Federal Government Properties Management Authority",
  "link": "https://www.app.com.pk/national/president-promulgates-ordinance-for-establishing-federal-government-properties-management-authority/",
  "date_published": "2021-08-21T16:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 21 (APP): President Dr. Arif Alvi has promulgated an ordinance titled “The Federal Government Properties Management Authority Ordinance, 2021” to establish the Federal Government Properties Management Authority.\nThe President issued the ordinance 2021 under Article 89 of the Constitution of the Islamic Republic of Pakistan.\nAccording to Ordinance, “Whereas it is expedient to effectively manage and utilize assets of Federal Government through attracting private investment, from inland and abroad and to undertake special projects.\nIf and when desired by the Government in collaboration with private investors, local or foreign and is so doing to generate revenue, facilitate job creation, develop Pakistan’s human resource, enhance exports, bolster economic growth and improve service delivery to the people”.\n“The authority shall be a body corporate, having perpetual succession and a common seal, with power and functions to acquire, hold and utilize assets as per provisions of this Ordinance, and shall sue and be sued in the said name.\nThe headquarter of the Authority shall be at Islamabad and it may, with the prior approval of the Government, set up as many offices all over the country as when and where required.\nThe Government may transfer any assets to the Authority and upon such transfer this Ordinance shall exclusively apply to the transferred assets.\nThe Authority shall create a database of assets owned by various Government entities, recommend to the government such assets to be transferred to the Authority for investment,\ntake possession of any asset transferred to the Authority, undertake all legal measures to ensure assets handed over to the Authority and identity Government assets suitable for the development of projects, etc.",
  "retrievedAt": "2025-08-11T21:06:47.753Z"
}
