{
  "title": "PM, Russian Deputy PM discuss ways to enhance economic cooperation",
  "link": "https://www.app.com.pk/national/435484/",
  "date_published": "2022-02-24T18:21:00.000Z",
  "source": "APP",
  "content": "MOSCOW, Feb 24 (APP): Russian Deputy Prime Minister Alexander Novak along with his delegation met with Prime Minister Imran Khan in Moscow on Thursday and Pakistan-Russia economic relations, with a special focus on cooperation in the field of energy, were discussed.\nHighlighting the government’s reforms undertaken in different sectors with the aim of improving business environment, the Prime Minister expressed confidence that Russian companies and businesses would benefit from Pakistan’s improved business environment and invest in different sectors of Pakistan’s economy.The Prime Minister reiterated the importance of Pakistan-Stream Gas Pipeline as a flagship economic project between Pakistan and Russia. The two sides also discussed cooperation on prospective energy related projects.Expressing satisfaction on current level of cooperation in the fields of energy, trade, investment, railways etc., both sides agreed that Inter-Governmental Commission (IGC) was the pivotal platform to further advance specific projects.Following the meeting, the Prime Minister had an interactive session with notable businessmen of Pakistan and Russia over the dinner. The Prime Minister stated that Pakistan as a market of more than 220 million people provided opportunity for trade and investment. The Prime Minister stated that forthcoming Investment Conference to be held in March in Pakistan would be an opportunity for metallurgical, energy, construction and oil and gas companies to explore the immense potential in Pakistan.\nForeign Minister Makhdoom Shah Mahmood Qureshi and Advisor on Commerce and Trade Abdul Razzak Dawood also addressed the gathering.The Prime Minister along with a high-level delegation is on a two-day visit to the Russian Federation from 23-24 February 2022. Earlier, the Prime Minister held summit meeting with President Putin in the Kremlin.",
  "retrievedAt": "2025-08-11T14:23:57.741Z"
}
