{
  "title": "Edhi team reaches Afghanistan, starts survey for provision of humanitarian services",
  "link": "https://www.app.com.pk/national/edhi-team-reaches-afghanistan-starts-survey-for-provision-of-humanitarian-services/",
  "date_published": "2022-02-24T10:31:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 24 (APP):A team of Edhi Foundation, Pakistan’s largest humanitarian organization, has reached Afghanistan for extending help to distressed Afghans.\nThe team is headed by Saad Edhi, son of Abdul Sattar Edhi (Late), founder of the Edhi organization, says a statement issued here on Thursday.\nThe team members are meeting different people from government representatives to heads of international humanitarian organizations for discussing areas that needed more support.\nOn Wednesday, the Edhi team met with representatives of the International Red Crescent and also distributed edible items about people gathered there in need of assistance.\nSpeaking on the occasion, “Saad Edhi said his organization is fully standing with Afghan brethren in this hour of trial and will extend all possible help to them.”\nHe said, “The organization will also provide help to Afghan in field of medicine apart from distribution of edible goods.”\nEfforts would also be made to provide better ambulance service for coping with emergencies, Saad went on to say.\nSpeaking on the occasion, Vice President International Red Crescent, Noor ud Din Toorabi appreciated the services being provided by Edhi Foundation for help of needy human beings.\nHe also lauded the gesture of the organization of extending its services to neighbouring Afghanistan for the help of needy Afghans.\nHe said”Afghans are thankful to foundation of Abdul Sattar Edhi (late) for providing humanitarian services to them.”\n“Afghanistan is currently passing through a difficult phase and is in grip of humanitarian crisis. The timely decision of Edhi Foundation is very much laudable,” he reiterated.",
  "retrievedAt": "2025-08-11T14:24:08.633Z"
}
