{
  "title": "Pakistan earns $892mln by exporting transport services during FY 2023",
  "link": "https://www.app.com.pk/national/pakistan-earns-892mln-by-exporting-transport-services-during-fy-2023/",
  "date_published": "2023-08-24T10:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):Pakistan earned US $892.890 million by providing different transport services in various countries during the current fiscal year (2022-23) as compared to the corresponding period of last year.\nThis shows a growth of 9.69 per cent as compared to $813.980 million earned through the provision of services during the corresponding period of the fiscal year (2021-22), the Pakistan Bureau of Statistics (PBS) reported.\nDuring the period under review, the exports of sea transport services witnessed an increase of 74.76 per cent, going up from $146.650 million last year to $256.290 million during the year under review.\nAmong the sea transport services, the exports of freight services surged by 38.65 per cent from $94.610 million last year to $131.180 million whereas the exports of other sea transport services also increased by 140.41 per cent from $52.040 million to $125.110 million current year, the PBS data revealed.\nThe exports of air transport services however witnessed a decrease of 4.47 per cent, declining from $644.160 million last year to $615.360 million during July-June (2022-23).\nAmong the air transport services, the exports of passenger services dipped by 1.65 per cent, from $427.440 million to $420.380 million, whereas the exports of freight services declined by 25.10 per cent, from $32.950 million to $24.680 million, in addition, the export of other air transport services dipped by 7.33 per cent from $183.770 million to $170.300 million.\nMeanwhile, the exports of road transport services during the year under review witnessed a nominal decline of 1.23 per cent by going down from $14.660 million to $14.480 million during this year, it added.\nAmong the road transport services, the exports of freight services increased by 4.55 percent, from $4.180 million to $4.370 million during the fiscal year under review, while other road services dipped by 3.53 percent to $ 10.480 million from $10.110 million.\nThe export of postal and courier services also decreased by 20.56 per cent, from $8.510 million to $6.760 million, the data revealed.",
  "retrievedAt": "2025-08-11T09:17:39.448Z"
}
