{
  "title": "Embracing energy efficient, renewable solutions to limit Pakistan’s carbon footprint",
  "link": "https://www.app.com.pk/national/embracing-energy-efficient-renewable-solutions-to-limit-pakistans-carbon-footprint/",
  "date_published": "2023-08-24T18:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 24 (APP):The speakers at the opening plenary of the first ever Local Conference of Youth (LCOY Pakistan) on Thursday said the country should embrace a just and clean energy transition to ward off impending risk of increasing carbon footprint due to growing economy and development.\nThe LCOY is an event under the umbrella of YOUNGO, the official youth constituency of the United Nations Framework Convention on Climate Change (UNFCCC).\nIts aims are to be a space to boost youth climate action locally and create input into international conferences.\nIt represents a national version of the International Conference of Youth (COY), which takes place immediately before the Conference of Parties (COP), the annual UN Climate Change Conference.\nLCOYs are organized under the UNFCCC and its designated youth constituency, known as YOUNGO.\nYOUNGO, as the official youth constituency within the UNFCCC, serves as a platform to represent young people and their organizations in global climate negotiations and discussions.\nEnergy Expert, Waqas Idrees while moderating the session opened up the plenary with his introductory remarks.\nHe briefed the participants about the opening plenary theme “Energy of the Future”.\nHe mentioned that a total of three plenaries would be conducted during the two-day LCOY Pakistan that would focus on intricacies of climate change.\nHe mentioned that the plenaries would discuss the four thematic areas based on the letter to the COP focused areas namely fast-tracking the energy transition and slashing emissions before 2030; transforming climate finance; Putting nature, people, lives, and livelihoods at the heart of climate action; and mobilizing for the most inclusive COP ever.\nIdrees underlined that the global stock take would be made for the first time at COP-28 that would review the temperature limits under Paris Agreement whereas the global stock take was done after every three years.\nThe discussions at LCOY would be compiled into a policy paper and submitted to the UNFCCC, he added.\nDirector Governance and Policy, World Wide Fund for Nature (WWF-Pakistan), Dr Imran Saqib Khalid while opening the plenary said the world passing through the era of global boiling and re-imagining the planet at 424 parts per million (ppm).\nHe added that there was record heat in the US and forest fires in Canada that left thousands of hectares land burnt and it also impacted New York’s air quality and environment.\nHe presented the journey of rise in carbon dioxide emissions since 1845 from 280 ppm to 411 ppm in 2020.\nHe highlighted that since 1995 some 28 COP meetings were held but nothing substantial was achieved to limit carbon emissions and global warming.\nThe world had to realise the damage incurred to the environment due to their development and harmful activities jeopardising their future, he added.\nTechnology and Energy Expert, Ermeena Malik said climate change was not a poor person’s problem but rather climate mitigation and adaptation required financial and intellectual resources.\nHowever, a wealthier nation would be in a better condition to ensure these resources for its climate resilience, she added.\nThe third world countries had limited resources and they would require urgent resources for other issues of grave concerns that hampered their efforts to address environmental degradation, she said.\n“Policy should be in conformity with the environment we live in. Policy lag is more dangerous than a policy change but the energy policy in Pakistan has several problems primarily there was no central framework or policy on collective energy resources since independence. It resulted into inadequate access to energy of the consumers,” Ermeena Malik said.\nHowever, she said for the first time in 70 years of Pakistan a holistic policy work on energy sector was underway that would bear fruits in next five years.\nRenewable Energy and Efficiency expert, Asad Mehmood said that informed policy making was the key to achieve clean energy transition whereas energy efficiency was all about behavioural change among the masses.\nMoreover, he said the regulators should also ensure strict enforcement of the regime and laws to ensure proper access to energy and its just utilisation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:17:46.060Z"
}
