{
  "title": "NA Speaker for enhancing Parliament to Parliament contacts for strengthening Pak-Saudi ties",
  "link": "https://www.app.com.pk/national/na-speaker-for-enhancing-parliament-to-parliament-contacts-for-strengthening-pak-saudi-ties/",
  "date_published": "2023-05-10T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 9 (APP): The National Assembly Speaker Raja Pervez Ashraf Wednesday emphasized that enhancing Parliament to Parliament contacts pivotal for strengthening Pak-Saudi ties.\nHe was talking to Chairman of Majlis-e-Shura of Saudi Arabia Dr. Abdullah Mohammad Al-Sheikh accompanied by Saudi parliamentary delegation on the margins of two-day International Constitutional Convention in Islamabad on Wednesday.\nWhile warmly welcoming the Chairman, the Speaker thanked him for visiting Pakistan to attend the convention in lieu of month-long activities to commemorate fifty years of the Constitution of Pakistan.\nRaja Pervez Ashraf said Pakistan enjoys historical relations with Saudi Arabia and both countries always stood by each other through thick and thin.\nHe also applauded that unbreakable ties Saudi Arabia and Pakistan is essential for regional prosperity.\nThe Speaker expressed satisfaction over the revival of Saudi-Iran ties and said that this revival would bring regional stability.\nWhile discussing parliamentary cooperation, the Speaker shared that Pakistan’s parliament is well on its digitalization and under the initiative we have achieved great success so far and the same can be transmitted and shared with Majlis Al Shura, as digitalization is the need of the hour.\nThe Chairman extended invitation to the Speaker for visiting Majlis Ash Shura to discuss and further enhance parliamentary cooperation.\nDr Abdullah Mohammad Al-Sheikh also congratulated the Speaker on the 50th anniversary of the Constitution.\nHe also appreciated the organization for successfully organizing of month-long activities and wished enduring peace and prosperity for Pakistan.\nHe said that such exchanges would further strengthen the ties between both nations which are already tied in deep religious cultural and brotherly ties.",
  "retrievedAt": "2025-08-11T08:28:11.802Z"
}
