{
  "title": "Cabinet approves army’s deployment in two provinces, Capital",
  "link": "https://www.app.com.pk/national/cabinet-approves-armys-deployment-in-two-provinces-capital/",
  "date_published": "2023-05-10T16:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP):In view of the prevailing law and order situation, the Federal Cabinet chaired by Prime Minister Muhammad Shehbaz Sharif on Wednesday approved the deployment of the Pakistan Army under Article 245 of the Constitution in Punjab and Khyber Pakhtunkhwa provinces on the recommendation of the Ministry of Interior.\nThe cabinet also approved the deployment of the army in the Islamabad Capital Territory.\nThe cabinet, in its meeting, took stock of the overall situation of the country and strongly condemned violent incidents leading to damages to properties in different cities, the PM Office Media Wing said in a press release.\nThe meeting berated the Pakistan Tehreek-e-Insaf and its chairman Imran Khan for their continuous diatribe against national institutions and their leadership, and observed that efforts at levelling of despicable allegations of murder attacks to dragging the national institutions into politics had been made for quite some time with continuity.\nThe meeting pointed out that the PTI leadership with a thought-out plan had been targeting the intelligence agencies and their officers which had now turned into terrorist attacks on sensitive installations and buildings.\n“The more this attitude is condemned, the less it will be,” the press release in the Urdu language quoted the meeting, adding that such an attitude was in conformity with the PTI’s past mechanism and mode of working which had been now exacerbated.\nSuch an attitude was neither constitutional and legal nor democratic, but based upon terrorism and enmity towards the country which would not be tolerated in any manner, it was stressed.\nThey also noted that the NAB had arrested Imran Khan in accordance with the law and in connection with serious case pertaining to pieces of evidence of corruption and corrupt practices. The Islamabad High Court had also termed his arrest as legal.\nThe Accountability Court, in today’s hearing and arguments, had also found his arrest as legal. But the PTI leadership had been provoking their followers that had created serious law and order situation across the country, the cabinet observed.\nThe meeting also strongly condemned damages caused to the government and private buildings, looting, torching and ransacking of the buildings of Radio Pakistan, APP, PTV and their infrastructure, and disrupting the national broadcast, setting of vehicles and record on fire and the reported injuries caused to officials.\nThey also strongly denounced the open terrorism by torching of Edhi ambulances and harassing of passengers and public, besides condemning the defiling of the monuments of Shuhada and Ghazi, and setting Chagi model in Peshawar on fire.\nThe cabinet made it clear that holding of protest was a basic constitutional right that should be within the confines of the constitution and legal limits, but such kind of lawlessness could not be allowed in any civilized country and society of the world.\nThe meeting decided that all the actions against the constitution and laws would be dealt with iron hand and the elements involved in terrorist activities and damages would not be accorded any leniency, stressing upon effective steps that should be taken for the protection of public and private properties and the public lives.\nProtection of the lives of people was the prime responsibility of the state and it would be ensured at all costs, it was added.\nThe participants also praised the general people for their refusal to the anti-state and terrorist attitude showed by the PTI during these violent protests as they stood with the constitution and law.\nThe cabinet lauded the law enforcement agencies, administration and the armed forces of Pakistan for their commitment to safeguarding the public lives and properties in the face of dangers.\nThe prime minister apprised the meeting about his participation in the King Charles III coronation in the United Kingdom and said that he conveyed the good wishes of the people of Pakistan.\nThe King also accepted an invitation to visit Pakistan, he said, adding that he also held a meeting with the British Prime Minister Rishi Sunak and they agreed to strengthen the bilateral ties and cooperation in all other sectors.\nThe meeting also accorded its approval to sale of the oldest building of Pakistan Chancery in R-Street Washington DC at the best offer. The cabinet was apprised that an offer of $7.1 million was already received.\nThe meeting also ratified its decisions taken during its meeting on energy on April 28, this year, besides endorsing its earlier decisions of April 28 and May 10 of the Economic Coordination Committee.",
  "retrievedAt": "2025-08-11T08:28:04.475Z"
}
