{
  "title": "Constant cooperation must for addressing challenges to constitutional democracies: Tarar",
  "link": "https://www.app.com.pk/national/constant-cooperation-must-for-addressing-challenges-to-constitutional-democracies-tarar/",
  "date_published": "2023-05-10T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Federal Minister for Law and Justice, Senator Azam Nazeer Tarar on Wednesday said the constant contact and cooperation among the global states was a must for addressing pressing challenges faced by the constitutional democracies.\nAddressing the plenary session titled Constitutions in the Changing World—Balance Stability and Adaptability on the International Parliamentary Convention to Commemorate the Golden Jubilee of the Constitution of the Islamic Republic Pakistan, the Minister underscored the challenges faced by democracies the world around.\nTarar said, “The rise of hybrid democracies, populism, nationalism, depleting level of truth, and rising migration are the existing threats to democracies.\nHe added that intense polarization was another rising threat that would let to economic inequality and democratic disconnect.\nTarar underlined that the deepening gulf between the political elite was also eroding democracy.\nMoreover, he said amid the prevailing scenario challenges to judicial independence and media integrity had also threatened democracies, he added.\nThe federal minister said sub-national and the local level governments were helpful in managing disasters and crisis management in any untoward situation.\nHe commented that the governments would need to avoid locking in old economic structures, business models and invest in information technology and high-tech infrastructure development.\nThe Minister noted that an ambitious policy to address climate change made economic management better and it was needed to cut trade barriers to climate-friendly goods and bring reforms.\nHe also highlighted that social media and the spread of digital techs had posed more threats to the rights of the people.\nThe tests for the government private sector and tech community were created to ensure security and rights, he said.\nSenator Farooq Hamid Naik of Pakistan Peoples Party Parliamentarians (PPPP) said, “The Constitution protects citizens’ rights and freedoms by limiting government powers and ensuring the rights of the masses.\nHe added that stability was necessary for the smooth functioning and working of the government.\n“Adaptability for Constitution is equally important so that it can live with the changing demands and needs of the time.”\n“Changes in the constitution will have to be made in a responsible and balanced manner,” he said.\nSenator Naik informed the Convention that the Parliament so far made 26 amendments to the Constitution, to address various challenges in prevailing times due to the growing influence of non-state actors, rising misinformation, and others.\nThe democratic institutions remained responsible for the reach and rehabilitation of the people promoting transparency and accountability in the system, he added.\nClimate change, terrorism, and migration needed to be addressed by the democracies whereas digital platforms could help in managing natural disasters, the Senator said.\nSenator (R) Farahtullah Babar of PPPP said the constitutional democracies were facing challenges the world over but these have been pronounced more in Pakistan.\nThe challenge of populism was rising in constitutional democracies and Pakistan was also facing it, he added.\nFake news, he said had threatened democracies and institutions not only the private sector but also others involved in perpetrating wrong information.\nDeputy Speaker of the Mili Majlis of Azerbaijan, Adil Abish Oglu Aliyev said the Constitution included the opinions of all the people that were being amended from time to time.\n“Internet and social media have become a part of our lives now that cannot be abolished,” he said.\nHe said the incidents of human rights violations and genocide were a matter of concern whereas legislation should be made in that regard.\n“We can benefit from each other’s experiences. International relations can be improved through social media, but it is affected by its misuse,” he added.",
  "retrievedAt": "2025-08-11T08:28:15.971Z"
}
