{
  "title": "Activation of Loss & Damage Fund critical for climate resilience of vulnerable countries: Sherry Rehman",
  "link": "https://www.app.com.pk/national/activation-of-loss-damage-fund-critical-for-climate-resilience-of-vulnerable-countries-sherry-rehman/",
  "date_published": "2023-05-10T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Federal Minister for Climate Change and Environmental Coordination Senator Sherry Rehman on Wednesday called the global community to activate the global loss and damage fund to enhance climate resilience of the vulnerable countries facing direct impacts of global warming and environmental degradation.\nAddressing the third breakout session titled “A multilateral framework for global responsibility and climate justice.\nA case study of 2022 floods in Pakistan” held in connection with the international parliamentary convention to commemorate the golden jubilee of the Constitution of the Islamic Republic of Pakistan here, the minister said the vulnerable communities across the globe were facing two-pronged risks due to adverse impacts of climate change as one being trapped in the debts extended by the foreign nations and institutions and the other was exacerbating climate crisis repeatedly hitting them hard with unprecedented calamities.\nThe session was convened by Convener, National Taskforce on Sustainable Development Goals (SDGs) MNA Romina Khurshid Alam who made opening remarks while kicking of the session.\nSenator Rehman urged the diplomatic delegations of the brotherly nations to raise their voices on the global financial architecture intended to enhance climate resilience and adaptation of the vulnerable countries.\nShe added that there was a dollar needed to be invested in normal development but it required $4 to be invested to ensure climate resilient development, due to which vulnerable nations were facing more burden of the climate catastrophes.\nThe minister underlined that the entire world would have to move towards a low carbon and climate resilient future.\n“We believe that what happens in one country will not stay in that country but rather will grip other states as well,” she added.\nThe minister termed climate change as an existential threat that had transcended the levels of climate crisis and emergency due to its rising scale and catastrophic impacts.\n“Pakistan has been the ground zero of climate change in 2022 as it embraces the century’s biggest floods due to monster monsoon rainfall that left 33 million population and one third of the country submerged under rainwater,” the Senator said.\nThe country witnessed unprecedented climate events from raging heat waves, resulting forest fires and abnormal monsoon rainfalls that left the country badly impacted and its vulnerable communities exposed to food and nutritional crisis, she added.\nShe regretted that the multilateral response to climate crisis was slow whereas the climate change was raging with every passing year to a record level.\nBritish Member of the Parliament, Imran Hussain said Pakistan was facing a number of climate risks as it faced the devastating 2022 floods whereas the response of the international community was relaxed and lacked responseinconformity with the damages inflicted by climate events.\nParliamentary Secretary for Climate Change and Environmental Coordination, Naz Baloch said the environmental rights of the masses like clean air, environment as fundamental rights of the citizens.\nShe added that it was necessary to educate the children as young ambassadors on climate justice and rights to nurture an informed generation of the country to tackle climate change.\nStudent and Young Climate Activist, Zainab Waheed presented the youth perspective of climate change and informed the forum on her endeavours as an activist.\nDeputy Chairman State Council of Sultanate of Oman, Sheikh Dr. Al-Khattab bin Ghalib bin Ali Al-Hinai said the Sultanate had a great passion for climate change mitigation and was taking proper steps to ensure greenhouse gases emissions.\nHe added that there was need to have joint efforts on carbon storage and capture to reduce carbon emissions.\nHe added that renewable energy induction without proper incentives for the conventional industry was futile.\nHe said the oil companies in Oman were playing their role in reducing carbon emissions.\nChairman Syrian-Pakistani Parliamentary Friendship Committee Dr Muntaher Ibrahim also addressed the forum whereas the Member of Pakistan-Iran Parliamentary Friendship Committee Abu-Ul-Fazal also expressed his views on the occasion.",
  "retrievedAt": "2025-08-11T08:28:13.958Z"
}
