{
  "title": "18th Amendment fully empowered ECP making it autonomous: Azam Tarar",
  "link": "https://www.app.com.pk/national/18th-amendment-fully-empowered-ecp-making-it-autonomous-azam-tarar/",
  "date_published": "2023-05-10T16:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Law Minister Azam Nazeer Tarar said the election process was strengthened through the 18th Constitutional Amendment, as it had empowered the Election Commission of Pakistan (ECP) making it fully autonomous.\nThe 18th Amendment also strengthened the federation as well providing autonomy to the provinces, he added speaking at the breakout session “ Constitution and Representation: Ensuring Free and Fair Election here..\nHe said the ECP had the authority to fix the date for elections, besides organizing free, fair and transparent polls.\nThe minister said, “The ECP and high courts have equal authority and power.”\nThe PTI government, he said, had introduced the electoral reforms amendment bill having E-voting and biometric voting provisions. However, it was cancelled through an amendment in May 2022 by the Parliament, passing the original bill due to possible reservations of rigging in the coming elections, he added.\nUnder the spirit of 1976 Elections Law, appointing elections date should be the sole prerogative of the ECP and no one even the President could interfere in it, he added.\nResponding to a question, he said that in the past the establishment and the judiciary influenced the election process and expressed the hope that both the institutions had now learnt a lesson from history.\nThe minister claimed that the courts also interfered in the domains of the ECP and the Parliament which was contrary to the Constitution.\nSenator Murtaza Javed viewed democracy was the name of a mindset. Holding free, fair and transparent elections always remained a challenging task in Pakistan, he added.\nEarlier chairing the session, Advisor to the Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira, in his opening remarks, said democracy witnessed many ups and down, besides facing many challenges in Pakistan but the Charter of Democracy (CoD) signed by the leadership of Pakistan Peoples Party (PPP) and Pakistan Muslim League (PML-N) paved a way to strengthen the political system in the country.\nHe said, “We will move forward to take benefit from the experience of each other.” Informing the participants about democracy, Constitution, elections and the political system, he said that there were two major political parties – PPP and PML-N which always had a hostile attitude towards each other but later the two inked the CoD for strengthening democracy in Pakistan.\nHe said the historical 18th Amendment was carried out with the consensus of all political parties present in the then Parliament (2008-2013), amending around 103 articles. All decoration sections incorporated in the Constitution by the dictator were abolished and the 1973 Constitution was restored in its original form, he added.\nHe said a new Election Commission of Pakistan (ECP) was formulated in light of the 18th Amendment, having complete autonomy.\nPunjab Minister for Law and Justice Kanwar Muhammad Dilshad said the ECP should be fully free to perform its function as per its constitutional mandate. “The Chief Election Commissioner (CEC) asked him to highlight the issue at all forums,” he added.\nKanwar Dilshad said all the cases, including foreign funding, Toshakhana or contempt of ECP cases, being heard by the Commission were stayed by courts. The foreign funding case proceedings remained stayed for over five years.\nThe provincial minister, who is also a former ECP Secretary, said the CEC had written a letter to the Senate and National Assembly to empower again the ECP for giving a date for elections. A parliamentary committee was also set up to look into the matter, he added.\nHe said the caretaker government continued to work till taking the oath of the newly elected chief minister. A wrong impression was given that the caretaker set-up could only work for 90 days. The election should be held within 90 days after dissolution of assemblies but it could be delayed due to valid reasons, he added.\nHe said the Defence Ministry had submitted important documents in the Supreme Court about arrangements for the forthcoming elections.\nTo another question, he said the introduction of the electronic voting machine (EVM) was a good effort but the Pakistan Tehreek-e-Insaf (PTI) wanted to implement it without consulting the ECP. Unfortunately, the EVM issue was politicized, he added.\nThe forthcoming government should work on it, he said.",
  "retrievedAt": "2025-08-11T08:28:08.286Z"
}
