{
  "title": "May 9 a dark day of national history: ISPR",
  "link": "https://www.app.com.pk/national/may-9-a-dark-day-of-national-history-ispr/",
  "date_published": "2023-05-10T16:38:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, May 10 (APP): The Inter-Services Public Relations (ISPR) on Wednesday termed May 9 a dark day in national history in the wake of violent incidents that took place against the Pakistan Army after the arrest of the Pakistan Tehreek-e-Insaf (PTI) chairman who was taken into legal custody on Tuesday (from the Islamabad High Court by NAB officials).\nAccording to an ISPR news release, immediately after the PTI chief’s arrest, there were organized attacks on army installations and anti-army slogans were raised.\nOn the one hand, it said, the evil elements (PTI workers mobs) vigorously stirred up public sentiments to fulfill their limited and selfish goals, and on the other, they did not get tired of highlighting the importance of the army for the country while throwing dust in the eyes of the people which was an example of their dual standards.\n“What the eternal enemy of the country could not do for 75 years, this group (PTI), wearing a political cloak, in the lust for power, has done,” it added.\nThe ISPR said the army showed extreme patience, tolerance and restraint and without caring about its own reputation acted with extreme patience and tolerance in the wider interest of the country.\n“Army should have given its immediate response which could have been used for its (PTI) nefarious political purposes – Army’s mature response thwarted this conspiracy – We are well aware that behind this are the orders, and directives of some evil leadership of the party. There was and is complete pre-planning,” it said.\nThe facilitators, planners and political activists involved in those operations had been identified and strict action would be taken against them as per the law and all these evil elements would now be responsible for the consequences, the military’s media wing said.\nThe ISPR warned that any further attack on the army, including all law enforcement agencies, military and state installations and properties would be severely retaliated against by the very group that wanted to push Pakistan into a civil war and had repeatedly attacked them.\n“It has also been expressed,” it said. “No one can be allowed to incite people and take the law into their hands.”",
  "retrievedAt": "2025-08-11T08:28:02.647Z"
}
