{
  "title": "Ahsan Iqbal directs provincial governments to complete ongoing field operation",
  "link": "https://www.app.com.pk/national/ahsan-iqbal-directs-provincial-governments-to-complete-ongoing-field-operation/",
  "date_published": "2023-05-10T17:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Federal Minister for Planning Development and Special Initiatives Ahsan Iqbal Wednesday directed provincial governments to complete the ongoing field operation of 7th Digital Population and Housing-2023 by May 15.\nThe minister made these directions while chairing a Census Monitoring Committee (CMC) meeting to review progress over the ongoing exercise of Census Field Operation, said a press release issued here.\nThe meeting was attended by the Federal Minister for Information Technology and Telecommunication Syed Amin Ul Haque, Chief Census Commissioner, Pakistan Bureau of Statistics (PBS), Dr Naeem uz Zafar, Provincial Chief Statistics and other stakeholders.\nIt is noted that on May 1 the government extended the field operation of the 7th population and Housing-2023 till May 15, 2023.\nDuring the meeting, Chief Census Commissioner appraised the Minister on the progress of field operations and the targets achieved by the PBS since the deadline had been extended on May 1.\nHe informed the meeting that the Demographer Committee was constituted in pursuance of the decision of the 9th meeting of CMC for analysis is the demographic trends by studying the growth rate. According to him, the other factors in the abnormal blocks after detailed deliberations recommended opening those districts all over Pakistan for at least 10 days’ whose population growth is less than 1.5, while closing other districts above the average.\nAccordingly, after approval of CMC the districts with growth rate less than 1.5 were closed all over Pakistan but on request of CM Sindh it remained open for enumeration from May 1 to 15.\nAhsan Iqbal directed provincial Chief Commissioners to fill the gaps identified by the PBS and complete the exercise on May 15 which is the closing date of the exercise. “Finish this exercise on May 15 so that the Census report can be submitted to the CII for final approval, ” said the minister, while reiterating that this is the national exercise and all eyes are on the government.\nThe minister further added that there should be no controversy over the huge exercise as the country is already facing the worst crisis while directing all the stakeholders to use all their resources to make this exercise successful.\nThe government has spent Rs 34 billion for this Digital Census and in order to ensure good governance, the government needs to have accurate data about the population and its distribution. It is noted that after sending a report to the CII Election Commission of Pakistan ECP will take four months for delimitation.",
  "retrievedAt": "2025-08-11T08:28:02.634Z"
}
