{
  "title": "NA speaker terms Parliament as centre of power, sole legislative organ of state",
  "link": "https://www.app.com.pk/national/na-speaker-terms-parliament-as-centre-of-power-sole-legislative-organ-of-state-2/",
  "date_published": "2023-05-10T09:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP):The Parliament House was abuzz with delegates from more than 17 countries who have gathered for a two-day international constitutional convention aiming to celebrate the Golden Jubilee Celebrations of the Constitution of Pakistan here on Wednesday.\nThe gathering has attracted speakers, deputy speakers, constitutionalists, and representatives from various walks of life also in the House.\nIn his opening address, National Assembly (NA) Speaker Raja Pervaiz Ashraf highlighted the pivotal role of Parliament as the centre of power and the sole legislative organ of the state.\nHe emphasized that the parliament represents the will of the people and, therefore, all state institutions are accountable to it.\nThe speaker, besides sharing insights into the struggles and efforts involved in the journey towards the 1973 Constitution, expressed disappointment over the disruptions caused by multiple episodes of dictatorships, including the execution of the first democratically elected Prime Minister and architect of the Constitution, Shaheed Zulfiqar Ali Bhutto.\nDrawing attention to the significance of the 18th amendment, he noted that it restored the original spirit of the Constitution and ensured complete provincial autonomy envisioned by Quaid-i-Azam Muhammad Ali Jinnah.\nHowever, he stressed the need to fully fulfill the promises outlined in Article 26, Article 3, Article 25, and Article 25-A of the Constitution, thereby eliminating gaps between promise and performance.\nQuoting late leader Shaheed Mohtarma Benazir Bhutto, the speaker reiterated that democracy is not a product but a continuous process.\nHe emphasized that democracy encompasses essential elements such as free and impartial media, women’s participation, transparent elections, and an impartial judiciary. These building blocks of democracy were promised in the 1973 Constitution, aiming to establish an ideal Islamic and federal parliamentary democracy.\nThe international constitutional convention provides a platform for participants to exchange ideas, insights, and experiences related to constitutional governance. The event aims to reinforce the commitment to democracy, constitutionalism, and the rule of law. The convention includes discussions on various topics, including the role of parliament, constitutional rights, political processes, and the challenges and opportunities faced in upholding democratic principles.\nThe convention serves as a forum for sharing experiences, strengthening international partnerships, and fostering a deeper understanding of constitutional practices worldwide. As the convention unfolds, participants are engaging in thought-provoking discussions, examining ways to enhance democracy, protect constitutional rights, and foster an inclusive and vibrant political environment.\nThe event underscores Pakistan’s commitment to upholding its Constitution and provides a platform for international cooperation in promoting democratic values and principles.\nThe celebrations and deliberations at the international constitutional convention symbolize Pakistan’s dedication to strengthening its democratic institutions, ensuring the supremacy of the Constitution, and advancing the ideals of justice, equality, and progress for its people.",
  "retrievedAt": "2025-08-11T08:28:14.867Z"
}
