{
  "title": "‘Fascist PTI involved in destructive activities since 2014, more dangerous than India’: Dastgir",
  "link": "https://www.app.com.pk/national/fascist-pti-involved-in-destructive-activities-since-2014-more-dangerous-than-india-dastgir/",
  "date_published": "2023-05-10T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Federal Minister for Energy Engineer Khurram Dastgir Khan on Wednesday alleged that the Pakistan Tehreek-e-Insaf (PTI) was a fascist party which had been involved in destructive activities since 2014, targeting both public and private properties.\nThe party was more dangerous for Pakistan than its arch-rival India, he said while addressing a press conference.\nDrawing historical parallels, Khurram Dastgir said, “Fascism, which had emerged in Italy and Germany a century ago, has now got its foothold in Pakistan under the leadership of Imran Khan, who had compromised the national interests by selling the disputed Kashmir territory in 2019.”\nIt was not the “Tehreek-e-Insaf” (Movement for Justice) as it claimed itself to be, but a “Tehreek-e-Intishaar” (Movement for Chaos), with a track record of sowing the seeds of disorder and anarchy in the country, he added.\nThe minister referred to many instances of violence perpetrated by the ‘fascist party’ over the years. He recalled in 2014 over 100 policemen, including the then Senior Superintendent of Police Ismatullah Junejo, were injured in a violent incident during the PTI’s so-called sit-in in Islamabad, and its workers had also attacked the Pakistan Television (PTV) and the Parliament House.\nIn 2016, it resorted to blocking the Attock Bridge as a launching pad for attacks on the Federal Capital, he added.\nThe party, he said, continued its violent activities to date, destroying both private and public property, besides causing financial losses to the country. For the last one year it had kept the country unstable.\nHe said some 78 policemen had been injured in the violent protests since the lawful arrest of Imran Khan. Moreover, an ambulance was torched in Peshawar, besides ransacking at the Army House in Lahore and the General Headquarters (GHQ) in Rawalpindi.\nHe said it was Imran Khan who was responsible for all the destruction occurred across the country as he had been continuously instigating his party workers over the year for indulging in violent activities, including attacking and setting ablaze public buildings. In fact, he had a political ideology centered on chaos and disruption, which he had imbued in his workers, he added.\nHe should be tried for treason charges as he had instigated rebellion among the institutions, he added.\nThe minister said Imran Khan had been arrested for corruption and corrupt practices. He had been issued over 10 notices by the National Accountability Bureau for answering its queries regarding corruption he allegedly committed in the name of Al-Qadir Trust.\nThe amount of £190 million laundered by business tycoon Malik Riaz was transferred to Pakistan by the United Kingdom’s National Crime Agency (NCA) in 2019, but instead of the national exchequer, it was returned to Malik Riaz without the approval of the Federal Cabinet under a shady deal, he elaborated.\nAnother case should be filed against Imran Khan for illegally diverting public money of over Rs 60 billion to fill the coffers of Malik Riaz, he remarked.\nThe minister said in return Malik Riaz gifted 458 kanals of land to the Al-Qadir Trust, which was subsequently transferred to Imran Khan’s wife Bushra Bibi. The Trust was formed only for the purpose of receiving their share as both Imran Khan and his wife were the only signatories to its deed, he added.\nKhurram Dastgir said besides the Al-Qadir Trust case, which was under investigation of NAB, Imran Khan would have to answer for his other “crimes” such as violation of the Constitution during the no-confidence vote.\nHe also questioned the PTI chief’s cypher conspiracy and his subsequent appeals for external assistance.\nThe minister said the opposition parties had got 68 percent of the total votes cast in the 2018 general election, but the PTI leadership because of getting charge of the government, instituted fabricated cases against the rivals.\nHe, however, expressed the optimisim that the ‘fascist party’ would receive a fatal blow from the people in the next general election. Whatever occurred yesterday was a “waterloo of the Project Imran”, which indicated that Pakistan could not be ruled by a “fascist approach”, he added.\nKhurram Dastgir said the people were still deprived of the power, which the Constitution guaranteed them and the Pakistan Muslim League-Nawaz would realize that promise.\nHe said the judiciary should deliver speedy and prompt justice to the people of Pakistan. He specifically called upon the judiciary to “undo injustice meted out to PML-N Quaid Nawaz Sharif”.",
  "retrievedAt": "2025-08-11T08:28:06.792Z"
}
