{
  "title": "Islamabad Security Dialogue: Ahsan Iqbal highlights challenges confronted by Pakistan",
  "link": "https://www.app.com.pk/national/islamabad-security-dialogue-ahsan-iqbal-highlights-challenges-confronted-by-pakistan/",
  "date_published": "2023-05-10T15:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 10 (APP): Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Wednesday said Pakistan was facing multiple challenges on various fronts including economic, social and security.\n“And the incumbent government is making all-out efforts to tackle the confronted challenges effectively,” the minister said while addressing the opening ceremony of the ‘Islamabad Security Dialogue-2023,’ organized by the National Security Division and the Ministry of Foreign Affairs here.\nAs a result of the government’s prudent policy, the minister said for the first time in the history of Pakistan, there was a bumper production of 27.5 million tons of wheat, which would have a positive impact on strengthening the national economy.\nCommenting on security-related matters, Ahsan Iqbal said during 2013- 2018, the then-government of Pakistan Muslim League-Nawaz (PML) took several measures to eliminate terrorism from the country.\nBut unfortunately, he said there was a resurgence of terrorism-related incidents due to the discontinuity of PML-N policies; and the incompetency of the previous PTI government.\nThe minister said the incumbent government was fully determined to uproot the menace of terrorism from the country, expressing firm resolve that no subversive activity would be tolerated at any cost.\nHe said the country’s Armed Forces rendered unmatched sacrifices while eliminating terrorist elements from the country, which never be allowed to go waste.\nHe said Pakistan was ready to share its terrorism-tackling experiences with the rest of the world for achieving peace.\nHe said Pakistan was playing its due role in achieving durable peace in the region including Afghanistan, adding a stable and prosperous Afghanistan was inevitable for peace and stability in the country.\nThe minister said Pakistan believed in promoting bilateral ties with all its neighbouring countries including India.\nAhsan Iqbal informed the Security Dialogue participants that the coalition government had launched a strategy to implement short-term and long-term projects for economic stability.\nTo steer the country of the financial crisis and turn around Pakistan to a stable platform, he said the incumbent government was making concerted efforts to develop a framework based on five Es (Exports, E-Pakistan, Equity, Energy and Environment) which needed to be pursued vigorously.\nThe minister said Pakistan, which is one of the sufferers of negative impacts of the global weather-changing patterns, had effectively taken up its case at the United Nations Climate Change Conference-2022, known as COP27, apprising the forum about Pakistan’s concerns in this regard.\nThe minister said the incumbent government would make all-out efforts to ensure implementation of the recommendations, which would be given by the participants of the ‘Islamabad Security Dialogue,’ in letter and spirit.",
  "retrievedAt": "2025-08-11T08:28:07.818Z"
}
