{
  "title": "OEC to export English language teachers to Japan",
  "link": "https://www.app.com.pk/national/oec-to-export-english-language-teachers-to-japan-2/",
  "date_published": "2024-08-03T09:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP):Overseas Employment Corporation (OEC) an attached department of Ministry of Overseas Pakistanis and Human Resource Development (OP&HRD) would export Assistant (English Language) teachers at Japanese Public Schools.\nAn official source told APP, he said that our esteemed client in Japan urgently seeking around 30 an Assistant English Language Teachers who meets the prescribed qualifications and experience as following bachelor’s degree or equivalent with one year experience and age limit 24 to 45.\nHe said that male and female both could apply for this job and salary package could be exceeded 220,000 yen and free transportation. He told that this job will be on one year contract base from April 7, 2025 to  March 24, 2026.\nNo criminal record, fit to work (no transmission disease, with proof of medical certificate 03 months prior to deployment), Proof of financial reserve, a minimum of 600,000 yen in reserve after payment of flight tickets if the applicant is on the Private Residence Track, whereas, a minimum of 300,000 yen in reserve after payment of flight tickets if the applicant is on the shared accommodation track.\nInclude with CV a ‘Self-Introduction Video’ (up to a maximum of 03 minutes), ability to attend training sessions conducted by M/s Borderlink in Pakistan and arrive at location(s) in Japan determined by M/s Borderlink not later than March 31, 2025.\nPrivate Residence Track: applicants must be able to pay upfront costs for apartments, ranging from 250,000 to 350,000 yen.\nShared Accommodations Track: applicants must agree to share housing for a minimum of 01 years from date of employment.\nPreference areas including basic Japanese skill, local teaching certificate, TESOL, TOEFL, and/or CELTA certification. Further he said that the interested candidate could apply via OEC’s website https://oec.gov.pk/.\nHelp-Desk Team: for technical support, contact the OEC-Helpdesk team at UAN: 0311-0011-632 or Email:\nThe applicant will submit/attach the deposited Bank challan amounting to Rs. 1000/- generated at the time of online application submission, closing date: 5 August 2024.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:20:44.875Z"
}
