{
  "title": "Mohsin Naqvi meets Commander of Iraq’s Rapid Response Unit, Lieutenant General Dr. Tahmeir",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-meets-commander-of-iraqs-rapid-response-unit-lieutenant-general-dr-tahmeir/",
  "date_published": "2024-08-03T08:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Minister for Interior Mohsin Naqvi met with a high-level Iraqi delegation led by Commander of Iraq’s Rapid Response Unit Lieutenant General Dr. Tahmeir Ismail here on Saturday.\nDuring the meeting, matters of mutual interest, including not taking passports from Pakistani pilgrims in Iraq and providing more facilities to them were discussed in detail.\nMoreover, training of Iraqi police in Pakistan, cooperation in the Safe City project, enhancement of mutual cooperation to prevent illegal immigration and human smuggling were also discussed.\nThe Iraqi delegation invited Minister of Interior Mohsin Naqvi to visit Iraq.\nThe Interior Minister emphasized that the proposal of not taking passports from pilgrims traveling to Iraq requires immediate action added that hopefully, the Iraqi Government will soon make a final decision in this regard.\nThe Commander of the Iraqi Rapid Response Unit said that they will discuss the issue of not taking passports from Pakistani pilgrims with the DG Passport, and hoped that the issue will be resolved.\nHe added that the brothers and sisters coming from Pakistan are our respectable guests.\nHe highlighted that Pakistan has decided to provide visa-free facility to Iraqi citizens, which will be implemented soon.\nHe added that all possible cooperation for the training of Iraqi police and in the Safe City project will be provided.\nThe Iraqi delegation included Brigadier General Commander of Protection Regiment Aqeel Kazim, Brigadier General Abdul Hussain, Muhammad Suhail, and others.\nFederal Secretary Interior Khurram Ali Agha and MD NRTC Brigadier Muhammad Asim were also present on the occasion.",
  "retrievedAt": "2025-08-11T04:20:24.050Z"
}
