{
  "title": "PM appreciates participation of welfare organizations, philanthropists in relief activities",
  "link": "https://www.app.com.pk/national/pm-appreciates-participation-of-welfare-organizations-philanthropists-in-relief-activities/",
  "date_published": "2020-05-06T10:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 6 (APP):Prime Minister Imran Khan on Wednesday appreciated the efforts of providing relief to the poor people hit by the lockdown due to the coronavirus in the Azad Jammu and Kashmir (AJK) and Gilgit Baltistan, and said full participation of welfare organizations and philanthropists in relief activities was very encouraging.\nThe prime minister said the Pakistani people had not only shown adherence in every difficult time but had always fully helped their countrymen with full devotion and enthusiasm.\nThe prime minister was talking to Minister for Kashmir Affairs and Gilgit Baltistan Ali Amin Gandapur, who called on him here at the PM Office. Kashmir Orphan Relief Trust (KORT) Chairman Chaudhry Muhammad Akhtar, Consultant Rupani Foundation Sabauddin and Pakistan Tehreek-e-Insaf leader from Bostan (United States) Atif Khan also accompanied the minister.\nThe KORT chairman told the prime minister that the Trust had already provided ration to 20,000 affected families of the coronavirus and would disburse food items among more families.\nSimilarly, Rupani Foundation was providing relief to 20,000 families in Gilgit Baltistan, and it was further increasing its circle of activities.\nPTI leader Atif Khan informed the prime minister about the provision of donations in the PM’s Corona Fund and other relief activities from the Pakistani community in the US .\nThe prime minister appreciated the services of KORT and Rupani Foundation.\nThe Minister for Kashmir Affairs and Gilgit Baltistan informed the prime minister about various relief activities in the Azad Jammu and Kashmir and Gilgit Baltistan\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:10.489Z"
}
