{
  "title": "Allied govt vows to defeat PTI conspiracy to sabotage IMF programme",
  "link": "https://www.app.com.pk/national/allied-govt-vows-to-defeat-pti-conspiracy-to-sabotage-imf-programme/",
  "date_published": "2022-08-26T19:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): The allied parties in the government on Friday in a joint statement stated that the country was bracing for a devastating situation caused by floods but at this difficult stage, the government of Khyber Pakhtunkhwa indulged in politics and refused to implement the condition laid down in the agreement with the International Monetary Fund (IMF).\nThe allied parties said the letter of the finance minister of the Khyber Pakhtunkhwa government to Minister for Finance Miftah Ismail was a ploy to drown Pakistan in the flood of economic crisis.\nThey said it was Imran Khan who signed the agreement with IMF on tough conditions and tied down the hands and feet of the Pakistani economy. Then Imran Khan himself violated the agreement and got the programme suspended and laid landmines in the foundation of the Pakistan economy by giving subsidy so that Pakistan could economically default.\nIn the statement, the coalition partners said the government was compelled to take very determined and difficult decisions in order to save Pakistan from default.\nAfter persistent efforts of four months, the value of the rupee and the economic condition started to improve.Although the people were still drowning in the four years of economic disaster and the deluge of inflation caused by Imran Khan, they asserted.\nThey said the government of Pakistan Tehreek I Insaf (PTI) knew that the IMF would hold its board meeting on August 29 to revive the economic programme of Pakistan.\nAt this time, the government of Khyber Pakhtunkhwa took a step with bad intention . This action proved that a foreign aided party was bent upon pursuing an agenda for economic destruction of Pakistan, they said adding, “Like before, we will defeat this conspiracy as well and will defend the economic sovereignty of Pakistan.”\nThe allies said the government was fully focused and giving priority to the rescue and relief of the flood affectees. “As at this time assistance and rehabilitation of the flood affectees should be national priority. We will not let the operation, of saving lives of flood affectees and mitigation of their difficulties, fall prey to politics.”",
  "retrievedAt": "2025-08-11T15:28:21.446Z"
}
