{
  "title": "PM expresses resolve to fully support, assist flood-hit areas",
  "link": "https://www.app.com.pk/national/pm-expresses-resolve-to-fully-support-assist-flood-hit-areas/",
  "date_published": "2022-08-27T09:10:00.000Z",
  "source": "APP",
  "content": "SAJAWAL, Aug 27 (APP): Prime Minister Muhammad Shehbaz Sharif on Saturday said that the entire country was badly affected with flash floods due to incessant monsoon rains, and resolved to overcome the issues with collective efforts.\nThe prime minister said that the heavy downpours in the season had caused human losses, damaged road and links infrastructure across Khyber Pakhtunkhwa, Punjab, Sindh and Balochistan.\nDuring a visit to review rescue and relief operations in flood-hit areas of Faqirani Jat, Oplano and others, the prime minister was given a detailed briefing over the situation and the relief efforts. Sindh Chief Minister Syed Murad Ali Shah and the federal ministers also accompanied the prime minister.\nSpeaking on the occasion, the prime minister said that he had witnessed the vast area which was inundated by flood water.\nIn Swat and Kalam, flash floods had caused human and financial losses, swept away road infrastructure and bridges, and now headed towards Charsadda and Nowshehra posing a severe threat there, he said, adding the district administrations, rescue agencies and the armed forces had been fully supporting the rescue and relief efforts and evacuating the people to safe places.He said considerable damage was caused to the Munda dam.\nThe prime minister said in the flood affected areas, rescue and relief efforts were being carried out. Unfortunately, he said huge losses were witnessed across the country, but with joint and continuous efforts, they would overcome the issues posed by the natural catastrophe.\nOn the occasion, the prime minister also appreciated the efforts of the chief minister, administration and the armed forces for their rescue and relief operations in these areas.\nThe chief secretary, director general provincial Disaster Management Authority, deputy commissioner, officials of Pakistan Navy and other relevant authorities briefed the prime minister on the relief operations, flood situation and rehabilitation of the damaged infrastructure.",
  "retrievedAt": "2025-08-11T15:28:20.129Z"
}
