{
  "title": "UK extended assistance to Pakistan in flood relief efforts",
  "link": "https://www.app.com.pk/national/uk-extended-assistance-to-pakistan-in-flood-relief-efforts/",
  "date_published": "2022-08-27T14:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): The UK is providing urgent support to Pakistan after flooding in the south of the country killed at least 900 people. Extreme monsoon rainfall has affected millions of people, with 700,000 homes destroyed.\nIn response to the disaster, the UK will provide up to £1.5m support the relief effort, a press release on Saturday said. The UN is carrying out a needs assessment over the weekend, and a UN appeal is expected to be launched on Tuesday.\nLord (Tariq) Ahmad of Wimbledon, Minister of State for South and Central Asia, North Africa, UN and the Commonwealth and the Prime Minister’s Special Representative on Preventing Sexual Violence in Conflict, said: “The floods in Pakistan have devastated local communities and the UK is providing up to £1.5 million to help the immediate aftermath. We are witnessing the catastrophe that climate change can cause and how it impacts the most vulnerable.\n“My thoughts and prayers are with all the victims and their families and I would like to pay tribute to everyone involved in the relief efforts. We are also working directly with the Pakistan authorities to establish what further assistance and support they require. The UK stands with the people of Pakistan during this time of need.”\nThe UK also provides assistance to Pakistan through international organisations working directly with the victims of the disaster, including the World Bank and the United Nations.\nIt is worth mentioning here that the £1.5m of humanitarian funding is an allocation from existing support to Pakistan and will go to the relief efforts in the areas worst-hit by the flooding.\nUK also pledged over £55m to partner with Pakistan to fight climate change, manage water more sustainably and unlock climate investment in November 2021 during the COP26 Conference in Glasgow.\nThe Global Climate Risk Index report notes that Pakistan has reported 502 deaths and a loss of $3.772 billion as a result of 173 extreme weather events between 2000 and 2019.\nPakistan is among the most disaster-prone countries in South Asia and has suffered an estimated US$18 billion in damages due to disasters during the past decade. This has included: recurrent floods; earthquakes; droughts; and urban shocks (such as heatwaves and dengue). Overall, in Pakistan, 25% of households (49 million people) are estimated to be moderately or severely food insecure, whereas 10% of the households (21 million people) are classified as severely food insecure. The Multi-Dimensional Poverty Index suggests that 36.43 million people are chronically vulnerable.\nPakistan is the 8th most at risk country globally from the impacts of Climate Change (an improvement from 5th most at risk country in 2020). This year, Pakistan has and is experiencing consecutive extreme climactic events. The country moved directly from winter into summer temperatures with a number of extreme heat waves, causing rapid glacial flash floods and forest fires.\nDuring the 2020 floods in Pakistan, the UK announced a £800,000 aid package through the National Disaster Consortium (NDC) and provided immediate relief in rural Sindh who many who had lost their homes. It also provided life-saving clean water, sanitation and shelter to over 55,000 vulnerable people in Pakistan to help them recover from the devastating floods.",
  "retrievedAt": "2025-08-11T15:28:13.295Z"
}
