{
  "title": "India declares mentally unsound person as terrorist to defame Pakistan",
  "link": "https://www.app.com.pk/national/india-declares-mentally-unsound-person-as-terrorist-to-defame-pakistan/",
  "date_published": "2022-08-27T17:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 27 (APP): Another proof of the Indian government’s nefarious propaganda to defame Pakistan has come to fore as it is presenting a mentally unsound Pakistani national as a terrorist.\nTabarak Hussain, a resident of Sabzkot village of Kotli in Azad Jammu and Kashmir and mentally unsound, was shot at and arrested in injured condition by Indian troops after he inadvertently crossed the Line of Control in Naushera area of Rajouri district of Indian Illegally Occupied Jammu and Kashmir a few days ago.\nSoon after his arrest, the Indian army and media trained their guns at Pakistan and unleashed their propaganda to prove that Tabarak Hussain was a terrorist sent by Pakistani authorities to carry out an attack on an Indian army post, Kashmir Media Service (KMS) reported on Saturday.\nHowever, some videos of Tabarak Hussain have emerged on social media in which he is not seemed to be a normal person and even a layman can judge that he is mentally unsound. In some of these videos, he can be seen tied with ropes and chains so that he does not leave his home or harm himself or other people.\nNow the Indian officials’ claim that he was paid a meager amount of Rs 30,000 by a colonel of Pakistan intelligence agency to attack the Indian army post is a white lie and a part of Indian nefarious attempts to defame Pakistan and its intelligence agencies at the international level.It is worth mentioning here that Tabarak Hussain was arrested on April 25, 2016 also by the Indian authorities when he accidentally crossed the LoC and had to spend 26 months in imprisonment before being repatriated via the Attari-Wagah border due to his mental condition.",
  "retrievedAt": "2025-08-11T15:28:10.435Z"
}
