{
  "title": "NA speaker for sharing Eid happiness with underprivileged, marginalised people - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: National Assembly Speaker Sardar Ayaz Sadiq has extended warmest felicitations to the entire nation and the Muslim Ummah on the joyous and sacred occasion of Eidul Fitr.\n\nIn a message released to media by the National Assembly Secretariat here on Sunday, the speaker remarked that this sacred festival was a manifestation of affection, tolerance, and selflessness.\n\n“Eidul Fitr is a divine blessing granted by Allah Almighty following a month of fasting, prayers, and self-discipline, and should be celebrated with simplicity while embracing its true essence,” said the speaker while emphasising that “the true spirit of Eid lies in sharing happiness with the underprivileged and marginalised segments of society.”\n\nHe urged the nation to remember those who were deprived of basic necessities and to extend a helping hand to those in need.\n\n“By fostering the values of empathy and solidarity, society can strengthen the bonds of social harmony and mutual respect,” he added.\n\nMr Sadiq stated that while celebrating this joyous occasion, oppressed people of Palestine and Indian-occupied Kashmir, who continued to endure unimaginable atrocities should be remembered on this occasion. He lamented that Israeli aggression in Gaza had led to the martyrdom of thousands of innocent Palestinians, while relentless bombings had destroyed homes of innocent Muslims in Palestine, leaving millions without access to food, water, and medical care.\n\nSimilarly, the people of occupied Jammu and Kashmir remained victims of brutal oppression under Indian occupation. He called upon the international community to take immediate and effective measures to alleviate the sufferings of these oppressed populations.\n\nThe speaker underscored that Eidul Fitr served as a reminder of the significance of unity and cohesion, particularly at a time when Pakistan was facing numerous challenges.\n\nHe urged the nation to stand together to overcome these adversities and prayed that this blessed occasion brings peace, prosperity, and progress to every citizen of Pakistan.\n\nSimilarly, National Assembly Deputy Speaker Ghulam Mustafa Shah also extended heartfelt greetings to the nation and reaffirmed Pakistan’s unwavering solidarity with the people of Palestine and Kashmir. He expressed hope that Allah Almighty would soon grant them the blessing of freedom.\n\nHe prayed that Eidul Fitr proved to be a harbinger of peace, prosperity, and development for Pakistan and the entire Muslim world.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:18:32.798Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901401/na-speaker-for-sharing-eid-happiness-with-underprivileged-marginalised-people",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:53.000Z"
}
