{
  "title": "Third suspect in M-4 motorway rape case arrested in Faisalabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: Faisalabad’s Sandalbar police claimed to have arrested on Sunday the third suspect in the case pertaining to rape of a married woman during a robbery on Tuesday last near M-4 motorway bridge on Jhang Road.\n\nA city police spokesperson says that after his arrest, the third suspect was sent to jail on judicial remand for his identification parade. The two other suspects who were arrested earlier had already been shifted to jail for the same purpose, he added.\n\nComplainant Adnan Maseeh had said in the FIR that he was on way to his native village, Chak 62 JB, Chanakay, on Tuesday night, along with his wife, a sweeper in a hostel of the University of Agriculture, when two armed men intercepted them.\n\nHe said the suspects, who were later joined by their third accomplice, tied him to a tree with a rope and gang-raped his wife in a sugarcane field.\n\nCity Police Officer (CPO) Sahibzada Bilal Umar has praised the police team for arrest of the third suspect.\n\nChief Minister Maryam Nawaz, taking notice of the incident, had sent Punjab IGP Dr Usman Anwar to the the house of victim, assuring her that the culprits would be arrested soon and brought to justice.Punjab Women Protection Authority Chairperson Hina Parvez Butt had also visited Faisalabad and met with the victim.\n\nTWO KILLED: A man and his minor nephew were killed allegedly after a youth opened indiscriminate fire on the house of his opponents at Chak 302 GB, Bhatti Wala, on Sunday.\n\nAccording to the FIR registered by Chuttiana police under section 302 of the PPC, the complainant, Umer Shahbaz, said the suspect, Liaqat Ali, opened indiscriminate fire at his house, leaving his younger brother Umer Hayat (33) and his eight-month-old son Ahsan Ali critically injured.\n\nHe said the injured died while being shifted to the DHQ hospital.\n\nPolice are conducting raids to arrest the suspect.\n\nGUNNED DOWN: Faisalabad’s Thikriwala police claimed on Sunday that a murder androbbery suspect, who was freed by his accomplices two day back from custody, was allegedly killed by his accomplices during an “encounter” on Sunday.\n\nDijkot police had claimed that the suspect, Shahid Ali Heera, was arrest and being taken to a place for recovery of booty two days ago when his armed accomplices attacked the police van and freed him.On early Sunday, a Thikriwala police patrol party signaled a car to stop.\n\nThe car occupants opened fire on the police, who retaliated.After crossfire, the attackers fled away and the police found a body that was identified as Heera’s.Police sources say Heera had allegedly killed a poor rickshaw driver over resistanceduring a robbery a few days ago after snatching his rickshaw and Rs300 from him.\n\nThree months ago, the suspect had allegedly thrown an 18-month-old kidnapped child into a manhole after his parents failed to pay him ransom money, resulting in the toddler’s death.\n\nACCIDENT: A man died after his motorcycle was hit by a speeding car on Faisalabad-Sahiwal Road near Gujrati Chowk, Samundri tehsil, on Sunday.\n\nThe deceased was identified as Waris Ali (55), a government contractor of Chak 446 GB.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:34:57.406Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901403/third-suspect-in-m-4-motorway-rape-case-arrested-in-faisalabad",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:52.000Z"
}
