{
  "title": "Iran supreme leader Khamenei rebuffs Trump threat over nuclear deal - World - DAWN.COM",
  "author": null,
  "content": "Iran’s Supreme Leader Ayatollah Ali Khamenei said on Monday the US would receive a strong blow if it acts on President Donald Trump’s threat to bomb unless Tehran reaches a new nuclear deal with Washington.\n\nTrump reiterated his threat on Sunday that Iran would be bombed if it does not accept his offer for talks outlined in a letter sent to Iran’s leadership in early March, giving Tehran a two-month window to make a decision.\n\n“The enmity from the US and Israel has always been there. They threaten to attack us, which we don’t think is very probable, but if they commit any mischief they will surely receive a strong reciprocal blow,” Khamenei said.\n\n“And if they are thinking of causing sedition inside the country as in past years, the Iranian people themselves will deal with them,” he added.\n\nIranian authorities blame the West for recent unrest including 2022-2023 protests over the death in custody of Mahsa Amini, a young woman detained for allegedly flouting hijab rules, and nationwide protests in 2019 over fuel price rises.\n\nLast week, Iran responded to the US letter, with President Masoud Pezeshkian explaining on Sunday that Tehran would not enter direct negotiations with Washington but was willing to continue talks indirectly as per an injunction from Khamenei.\n\n“An open threat of ‘bombing’ by a head of state against Iran is a shocking affront to the very essence of international peace and security,” Foreign Ministry Spokesperson Esmaeil Baghaei tweeted on Monday.\n\n“Violence breeds violence, peace begets peace. The US can choose the course and concede to consequences.”\n\nIn his first 2017-21 term, Trump withdrew the US from a 2015 deal between Iran and world powers that placed strict limits on Tehran’s disputed nuclear activities in exchange for sanctions relief. Trump also reimposed sweeping US sanctions.\n\nSince then, Iran has far surpassed that deal’s limits on uranium enrichment.\n\nWestern powers accuse Iran of having a clandestine agenda to develop nuclear weapons capability by enriching uranium to a high level of fissile purity, above what they say is justifiable for a civilian atomic energy program. Tehran says its nuclear programme is wholly for civilian energy purposes.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/3113463281a0770.png",
  "retrievedAt": "2025-08-25T15:34:49.802Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901485/iran-supreme-leader-khamenei-rebuffs-trump-threat-over-nuclear-deal",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T09:30:07.000Z"
}
