{
  "title": "First line of defence - Newspaper - DAWN.COM",
  "author": null,
  "content": "IF foreign policy is the country’s first line of defence it is disconcerting how successive governments have left the foreign ministry in an increasingly weakened state over the years. This has eroded the professional excellence once associated with it and driven morale to an all-time low. Pakistan’s foreign service has long needed serious attention and reform to be able to adapt to global changes and leverage opportunities in a more multipolar world. Periodic review and reform are in any case required to make any institution fit for purpose. Yet little effort has been made to reinvigorate, reboot and strengthen the ministry.\n\nA major factor for its weakening in recent years has been greater encroachment on its domain by the military establishment. Governments, especially in the post-2018 hybrid civil-military arrangement, have not stood in the way of the foreign ministry having to cede more and more ground to Rawalpindi. This has resulted in the ministry losing its centrality in the foreign policy-making process. Some would argue this isn’t new as the military always had a decisive say in key policy areas such as India and Afghanistan. To the extent that Pakistan’s foreign policy has been security-oriented the military has had a major voice in its formulation. But in recent years, the military’s role has extended beyond this, which has increasingly marginalised the foreign ministry in policymaking and management of diplomatic relations.\n\nToday, the foreign service is also under pressure from officers of the Pakistan Administrative Service to give up posts and areas of responsibility relating to economic diplomacy on the ostensible grounds of ‘efficiency’. Their assertion rests on the claim that they are better versed in economic and trade issues even though they lack specialist skills and have little knowledge of international affairs or global markets. If this were to succeed it would further whittle down the foreign ministry’s role.\n\nAnother reason for the ministry’s weakening over time is the lack of leadership by the head of the service, the foreign secretary. Ministers have shown no interest in strengthening or reforming the Foreign Office as their priorities lie in the political arena. But failure to do so by successive foreign secretaries has taken a heavy institutional toll. An unnecessarily timid and submissive attitude towards other stakeholders has defined the conduct of recent holders of this office with few exceptions.\n\nPakistan’s foreign ministry needs reform to make it fit for purpose.\n\nThis is a sorry departure from the past. In the 1990s and 2000s, foreign secretaries did not shy away from standing up to a military ruler and giving policy recommendations to prime ministers even when that did not accord with their views. The foreign secretary’s fundamental responsibility is to fearlessly offer sound advice, resist flawed or whimsical decisions taken elsewhere and defend policy determination by MoFA. The foreign secretary must ensure promotions and postings are made on merit, not favouritism or political considerations. His/her job is also to foster a culture of open in-house discussion, not discourage independent, out-of-the-box thinking.\n\nThe structural deficiencies in the foreign ministry’s working methods, organisation and training of personnel need to be urgently fixed. The ministry still operates in silos and remains reactive rather than proactive. To make the ministry more relevant and help it regain lost ground the quality of its policy inputs has to be improved. That will make it harder for other stakeholders to ignore its views and just dictate to it. Clear objectives and priorities should be set at the beginning of the year with regular review and reassessment undertaken throughout the year. The policy planning division needs to be revitalised and placed at the core of the ministry’s strategic functioning.\n\nA complete overhaul of working methods should be undertaken to improve communication within headquarters, between divisions that often operate in silos, and with missions. The information flow is either too slow or absent, seriously handicapping mission work. Ambassadors can only be effective if they are kept regularly briefed. Sharing of timely information is impeded by a communication and feedback system that needs urgent modernisation, without compromising security. It also needs a change in mindset from one that prizes monopolising information over sharing it. Of course, the ministry itself has to have access to information and be kept on board when policy decisions are taken elsewhere.\n\nMajor reform is also needed in several areas of training. The generalised initial training has to be replaced by more specialised training in which practical aspects of diplomacy should be taught along with knowledge of foreign policy. In other words, training modules should be focused on how to negotiate and communicate as well as teach skills for public diplomacy, especially to deal with a complex media landscape — modern tools every diplomat needs. This is important in a world in which multiple non-state actors shape a country’s foreign policy outlook. Certainly, use of social media should be in the diplomat’s toolkit, but as of now, the foreign ministry has yet to evolve any rules for its use. Diverse expertise is required on a complex array of global issues. Training should cater to these rather than be stuck in mental maps of the past.\n\nForeign policy cannot be conducted on the cheap. This is why an adequately resourced ministry having financial autonomy is crucial to the performance of its core functions. Pakistan’s foreign ministry/ missions are among the world’s most under-resourced. The ministry must have the means to adapt quickly to changing needs. For that, it needs greater financial authority within an enlarged budget. The numerical strength of the service also needs to expand, especially as the volume of work and complexity of international issues have increased and so have avenues for diplomatic outreach. The financial burden on the exchequer can be offset by cutting down the support staff of a tail-heavy service.\n\nThese decisions are obviously for the government to take. But the foreign ministry can help itself by urging the prime minister to set up a task force to propose reforms. Until then, it should try to regain its influence by offering quality analysis and policy advice that can also persuade the military establishment to treat the ministry as the country’s first line of defence.\n\nThe writer is a former ambassador to the US, UK and UN.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e9e065227cc.jpg",
  "retrievedAt": "2025-08-25T15:34:53.791Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901437",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:48:11.000Z"
}
