{
  "title": "Chand Raat and last-minute deals in Karachi - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Savvy shoppers opt for affordable designer dupes\n• Farshi shalwar becomes major craze\n\nKARACHI: There are several staples to Eidul Fitr and last-minute Eid shopping or shopping on Chand Raat is one of them. It has its own charm.\n\nRemember the children’s socks that you had forgotten all about until now? What about the matching Chunri that you had thought of pairing with your new dress? And what about the milk for Sheer Khurma? What happened to that packet of vermicelli you thought you had in your kitchen cabinet? Isn’t it there?\n\nThe bangles, the henna application, the last-minute tailor trips for alterations, new footwear, matching bag … no matter how prepared you think you are for the big celebration the next day, something or the other always turns up that pushes you into that dreaded one last trip to the market.\n\nWith no more Taraweeh prayers to say on Chand Raat, there is nothing else to stop you from venturing out almost as soon as you break your fast. What about dinner you say? Oh that too can be grabbed outside.\n\nNow let’s get down to the practicalities of Eid shopping. There won’t be any parking space, don’t take the car. For Eid shopping, especially on Chand Raat, rickshaw is the king.\n\nEid shopping this year depended on the weather and your activities. If you were going to spend the three days of Eid entertaining or being entertained in cool air-conditioned environs, you may very well have gone for Eid collections from all the branded designer outlets.\n\nBut if you were to slave in the kitchen, cooking Sheer Khurma and the other traditional delicacies followed by lunch, etc, you are definitely didn’t want the silk, chiffon, net, polyester, linen suits or dresses.\n\nThere is always a variety of breathable cotton voile suits and dresses. It was also wise to go for something didn’t require too much ironing so that voile or lawn could do with a percentage of polyester.\n\nBrands vs dupes\n\nThere are very expensive designer lawn suits, stitched and unstitched, available in high-end shops and there are also the designer dupes, copies and replicas. And when the replicas are not lacking in quality, why would you be going for originals? So instead of shopping for clothes and accessories under the roof of a cool mall, for many it was doing the same under the open sky.\n\nThere is an entire market of copies selling on the footpaths of Hyderi, Tariq Road, Jama Cloth Market, the Gold Mark shopping centres, the Millennium Mall and the like, which were thronged by customers soon after iftar every day. Mind you, they did check the high-end shops, too, but mostly to see if the copies being sold were similar to what hung from their racks and rails.\n\n“I came here to get something reasonable for my maid and her daughter,” said Ms Hammad selecting embroidered lawn suits on the footpath outside Rabi Centre at Tariq Road.\n\n“But the huge variety of suits available here are of such good quality that I could not resist picking up a couple for both me and my daughter. Paying under 3,000 rupees for each dress also left me with an extra sum to also get new footwear and matching bags along with other accessories,” she gushed, adding that a designer label would have taken out Rs6,000 to Rs7,000 from her shopping budget.\n\nWith the traditional glass bangles taking a back seat to metallic bangles and bracelets there were also plenty of those available by the wayside. Still, the artificial jewellery stalls had raised their usual prices by Rs100 to 150 ahead of Eid although expert bargaining from the customers made that plan fall flat on its face.\n\nFarshi shalwar\n\nThere is a trend these days of the farshi shalwar, which looks like a mix between palazzo pants, a shalwar and a pyjama.\n\nEven the suits selling on footpaths were costlier by a thousand rupees or so, if paired with a farshi shalwar. The trendy item of clothing has also given a fresh lease of life to tailors.\n\nThose who are experts in stitching the farshi shalwar, charged more, by around Rs2,000 per suit, actually.\n\nChand Raat witnessed a huge rush at the special Eid markets springing up in various areas.\n\nThey were mostly good for henna design applications, accessories shopping and shopping for children mainly. They also offered a chance for family outings, if anyone had the time to relax in their shopping frenzy.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e9d9b881ec4.gif",
  "retrievedAt": "2025-08-25T15:35:08.502Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901397/chand-raat-and-last-minute-deals-in-karachi",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:46.000Z"
}
