{
  "title": "The roots of crisis - Pakistan - DAWN.COM",
  "author": null,
  "content": "CONVENTIONAL coverage of politics in Pakistan tends to focus on personality clashes and day-to-day occurrences that fill up our news channels. This is expected given the pressures that come with running a 24/7 news cycle, replete with 10 different breaking stories a day. What remains missing though is good materialist analysis, ie, analysis that makes an assessment of deeper trends shaping politics. In other words, the personality clashes and egos that we focus on are merely playing out on a terrain shaped by broader social and economic transformations.\n\nPrincipally, there are three such transformations that are currently at play in Pakistan. Demographic change, economic stagnation, and technological disruption. Each of these three has impacted the political sphere through a different array of influence vectors.\n\nLet’s start with demography. The 2023 census recorded a population of 241.49 million, growing at 2.55 per cent annually. The fertility rate having decreased from 4.88 to 3.41 births per woman, is still considerably higher than regional neighbours India and Bangladesh. Resultantly, the country hosts a population that is predominantly young, with nearly two-thirds under 30 years old and 30pc between 15 and 29. More tellingly, the youth population grew at 2.7pc annually, slightly faster than the national growth rate.\n\nThis youth bulge is frequently talked about, but its scale and possible impact remains under-analysed.\n\nThis youth bulge is frequently talked about, but its scale and possible impact remains under-analysed. A direct outcome that we see is the rise in the working-age population: Approximately 1.3m young Pakistanis enter the labour market each year.\n\nAdditionally, this working age population is now increasingly better educated. Educational attainment generally shows substantial progress. The 2023 census indicates that the 20-29 age group has a degree attainment of nearly 14pc, more than double the national adult average. Of considerable note is that women’s higher education rates now exceed men’s by two percentage points, suggesting significant changes in educational access and gender dynamics.\n\nPolitical participation among youth has also transformed. Given the overall demographic shape of the country, young voters now constitute almost 50pc of the total electorate. While 18- to 29-year-olds historically voted at lower rates, the 2024 election saw a dramatic shift. In 2013, only 26pc of this age group voted, compared to 55pc of all adults. By 2024, youth voter turnout increased to 48pc, matching the general electorate’s participation rate.\n\nSo the first piece of the puzzle is a young population (and electorate), with growing rates of educational credentials entering the labour force. What are they confronted with?\n\nThey enter into adulthood facing an economy with immense structural vulnerabilities. Between 2012 and 2024, the country experienced growth averaging 3.8pc, which is significantly lower than regional economies like India and Bangladesh.\n\nThe year 2023 represents the coming together of multiple economic pressures, demonstrating the broken nature of the economic base: record-high inflation reaching nearly 38pc, depleted foreign exchange reserves bringing the country close to default, further exacerbated by economic fallout from catastrophic floods in 2022.\n\nEconomic management of this crisis involved implementing import restrictions and raising the central bank discount rate to prevent a balance-of-payments crisis. As a result, economic growth stagnated, reaching only 2.3pc in 2024. While sovereign default was avoided through an IMF programme and inflation has abated this year, fundamental economic weaknesses remained.\n\nThis economic condition is the creation of a political economy that operates on rents and misallocation of resources, under the influence of interest groups that are able to exercise considerable influence through policy mechanisms such as amnesty schemes, subsidised energy, and import controls. Consequently, Pakistan’s capacity to compete in export markets and generate foreign exchange remains limited, and balance-of-payments crises remain around the corner.\n\nHowever, as one economist colleague put it, the economy continues to work reasonably well for some (at the cost of the rest). The aforementioned elites in protected industries and sectors continue to make a killing. Similarly, the security establishment’s own economic footprint appears to have increased. The latest endeavour to appropriate desert land in Cholistan and redirect water through new canals serves as an example.\n\nSo a young population and a structurally compromised economy are features one and two. The third and final feature is the rise of an ‘online and tuned-in citizenry’.\n\nIn the 2023 census, 71pc of all households (90pc in urban areas) reported receiving information via television, while 96pc of all households reported using their mobile phones to access information. The corresponding figures for print and radio were 7pc and 6pc respectively, signalling a sharp decline since the early 2000s.\n\nThis massive transformation in how information is accessed has taken place with the overall rise in mobile connectivity in the country. According to the Pakistan Telecommunication Authority, there are currently around 200m cellphone connections, of which just over 66pc utilise mobile broadband, largely in urban areas.\n\nPertinently for those thinking about ‘digital terrorism’, social media usage is expanding at considerable pace — according to a survey conducted in late 2021/ early 2022, 51pc of respondents consumed at least one form of social media (WhatsApp, Twitter, YouTube, TikTok or Facebook). As these figures are from three years earlier, the number is expected to have increased exponentially in the same period.\n\nGiven the three features documented here, it is a mystery how anyone can still think that status quo modes of doing politics (through patronage), maintaining control (through censorship), and exercising power (through centralised, executive authority) can provide any sustained stability. When taking this broader view, it becomes clear that political instability is not the outcome of ego clashes or dislikes. Rather it is the result of a yawning divide between how the state operates and what the society it attempts to control actually expects.\n\nThe writer teaches sociology at Lums.\n\nX: @umairjav\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e9e096b12b2.png",
  "retrievedAt": "2025-08-25T15:34:54.386Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901438/the-roots-of-crisis",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:48:11.000Z"
}
