{
  "title": "PHC acquits man in wife killing case after being pardoned by her parents - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court has set aside conviction of a man sentenced to life imprisonment for killing his wife after he was pardoned by her parents.\n\nA bench consisting of Justice Mohammad Ijaz Khan and Justice Sabitullah Khan accepted an appeal filed by the convict Muhibullah observing that the compromise effected between the parties seemed to be genuine, free from any influence, coercion and duress.\n\nThe bench observed that the offence in question was compoundable, therefore, the appeal was allowed on basis of compromise.\n\nAs the deceased woman, Ms Saeeda, was issueless, therefore her parents were her only legal heirs.\n\nHer parents had appeared before the trial court and had recorded their respective statements in support of the compromise, wherein they had stated that due to intervention of the local elders, they had effected compromise with the appellant and pardoned him by waiving off their right of qisas and diyat.\n\nThe appellant was convicted by an additional sessions judge in Upper Dir on Dec 11, 2024, and was sentenced to life imprisonment and was also ordered to pay compensation to the tune of Rs500,000 to the legal heirs of the deceased woman.\n\nThe occurrence had taken place in the jurisdiction of Gandigar police station, Upper Dir, on Sept 11, 2022.\n\nThe complainant in the case was father of the deceased woman named Jalat Khan.\n\nThe police claimed that they had received report about presence of dead body of a woman at a local hospital in Upper Dir. They stated that when the police party reached the hospital they found Jalat Khan present with the body.\n\nHe told police that his daughter Ms Saeeda was married to the appellant, Muhibullah, around 40 days prior to the occurrence.\n\nHe claimed that when he received information that his daughter had died, he went to the house of the appellant where he found the body of his daughter lying on a charpoy.\n\nHe said he was told by women of the house that his daughter had committed suicide. However, he stated that on examining her body, he found marks of violence and strangulation.\n\nThe complainant and the prosecution had not put forward any motive for the commission of the offence.\n\nAdvocate Ashfaq Hussain appeared for the appellant and argued that the offence was compoundable and parents of the deceased had pardoned the appellant without any duress.\n\nJUVENILE GRANTED BAIL: A single-member bench comprising Justice Salahuddin Khan granted bail to a juvenile suspect arrested in an honour-related murder of his stepmother in Swat district.\n\nThe bench accepted petition of the suspect on condition of furnishing two surety bonds of Rs100,000 each.\n\nThe petitioner’s counsel Ashfaq Ahmad stated that his client was a juvenile as according to his school record he was born on May 10, 2010. He said at the time of occurrence on Feb 27, 2025, he was below 15 years of age.\n\nHe argued that under section 6 of the Juvenile Justice System Act, he was entitled to the concession of bail.\n\nReferring to different judgments of the superior courts, the bench also observed that the petitioner was entitled to bail on the ground of his juvenility.\n\nThe FIR of the occurrence was registered at Kabal police station under section 302 of Pakistan Penal Code.\n\nThe police claimed that the deceased woman was having relations with a person named Suleman, who had then killed her husband Bakht Zareen a month before the present occurrence.\n\nIt was stated that a nephew of the deceased Bakht Zareen had then fired at the deceased woman resulting in injuries to her. While the family members were rushing the woman to hospital, the present petitioner had fired at her resulting in her death.\n\nEarly this month, an additional sessions judge had rejected bail plea of the petitioner observing that the offence carried capital punishment which fell in the prohibitory clause of section 497 of the Code of Criminal Procedure.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:34:55.301Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901343/phc-acquits-man-in-wife-killing-case-after-being-pardoned-by-her-parents",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:48:05.000Z"
}
