{
  "title": "Murree Road-Srinagar Highway underpass expected to be ready in mid-May - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The city managers are expecting completion of the ongoing Murree Road underpass to link it with Srinagar Highway in mid-May.\n\nWork on the project and widening of Murree Road on both sides from near Lake View Park to the underpass continues at full pace.\n\nThe work started a few weeks ago and according to PC-I the project is supposed to be completed in 60 days at an estimated cost of Rs900 million.\n\nThe CDA is executing it as part of Serena Interchange project, which was completed in February this year.\n\nAccording to PC-I, the project is supposed to be completed in 60 days at an estimated cost of Rs900 million\n\nThe worth of the Serena Interchange project was Rs4.2 billion and according to CDA 15pc expansion of any project was legitimate; therefore, the project is being constructed with a variation of 15pc.\n\nAsked why the tender process was skipped, a CDA officer said, “As per rules and regulations, we can execute this project without new tender as 15pc variation and extra work is legally covered. So instead of going for a new tendering process, we engaged the existing contractor to save time, as this work is also part of the Serena Project.” He said no illegality was involved and before starting this project, the matter was placed before the CDA board which unanimously decided that it should be executed as part of the previous contract of Serena Interchange, the officer said.\n\nIt may be noted that without the underpass, motorists coming from Murree side had no direct link to enter Srinagar Highway.\n\nResidents of Murree and other adjoining areas had been demanding the CDA construct another underpass on Murree Road for smooth entry to Srinagar Highway.\n\nCurrently, motorists have to go to Dhokri roundabout to take a turn to enter Srinagar Highway, and often face traffic mess at the junction. Later on, when the matter was brought into the notice of CDA management, they decided to engage Nespak as a consultant, which proposed construction of a single underpass and expansion of existing roads.\n\nWork on the Serena Interchange project worth Rs4.2 billion was inaugurated by Prime Minister Shehbaz in February this year. CDA completed the project in three months.\n\nRecently, the CDA also executed the multibillion Jinnah Avenue project with questions arising about its design. Official sources said that the civic agency was also set to start construction of a new road to link existing Margalla Avenue with Peshawar Motorway (MI).\n\nThe demarcation of the road has been completed and Islamabad Capital Territory (ICT) revenue department has geared up its efforts for land acquisition. Out of the total 3.4 km road portion, 1.8 km falls in Rawalpindi while 1.6 in Islamabad which will be constructed by the CDA. Officials said that PC-I of the project was already approved and estimates and design work had been undertaken.\n\nThe project worth Rs5.45 billion (construction and land acquisition) was approved by the civic body in August 2023 and once started work on it would be completed in eight months.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:34:57.087Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901366/murree-road-srinagar-highway-underpass-expected-to-be-ready-in-mid-may",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:58.000Z"
}
