{
  "title": "More outlaws killed than civilians or security men: Centre for Research and Security Studies - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Think tank sees 13pc drop in overall violence in first quarter of 2025\n• KP, Balochistan account for 98pc of fatalities\n\nISLAMABAD: Fatalities among outlaws surpassed civilian and security losses in the first quarter of 2025, the first time this has happened during the last 12 years.\n\nIn its report for the first quarter of 2025, the Centre for Research and Security Studies (CRSS) also claimed that overall violence dropped by 13 per cent as compared to the last quarter of 2024.\n\nThe period under review saw some promising trends in the security landscape of Pakistan such as fatalities of militants and insurgents outnumbered the cumulative losses of civilians and security forces personnel for the first time in 12 years. Notably, less fatal losses among civilians and security forces personnel, compared to the fourth quarter of the year 2024, were observed and nearly 13pc reduction in overall violence was reported.\n\n“Despite progress, KP and Balochistan remain epicentres of violence, accounting for 98pc of all fatalities, with attacks growing bolder and militant tactics evolving — including the unprecedented hijacking of Jaffar Express. Projections warn of over 3,600 fatalities by year-end if current trends persist, potentially making 2025 one of Pakistan’s deadliest years,” it stated.\n\nOverall toll\n\nDuring the first quarter of 2025, the country witnessed 897 violence-linked fatalities and 542 injuries among civilians, security personnel and outlaws.\n\nThe casualties, totalling 1,439, stemmed from 354 incidents of violence including terrorist attacks and counter-terror operations.\n\nCompared to the fourth quarter of 2024, as many as 1,028 fatalities were recorded, these figures mark nearly 13pc decline in overall violence.\n\nRegional impact\n\nMajority of the fatalities and incidents of violence were recorded in Khyber Pakhtunkhwa and Balochistan provinces, with both accounting for over 98pc of all fatalities and 94pc incidents, cumulatively.\n\nIndividually, while KP suffered over 63pc of all violence-related fatalities, compared to Q4 2024, it witnessed a promising 18pc reduction in violence.\n\nBalochistan suffered 35pc of all fatalities in the period under review. However, when compared to the last quarter, it recorded an alarming 15pc surge in violence.\n\nVictim-specific analysis\n\nAgainst 495 outlaws eliminated, civilians and security personnel suffered 402 fatalities, which account for nearly 19pc fewer losses as compared to outlaws.\n\nTheir combined losses accounted for nearly 45pc of all fatalities compared to outlaws’ making up over 55pc of total recorded this quarter. It is for the first time in 12 years that the number of outlaws’ fatalities surpassed the combined fatalities of civilians and security forces.\n\nEqually positive, the civilians and security personnel suffered almost 50pc and 13pc less fatal losses, respectively, in the period under review compared to Q4 2024. In contrast, the fatalities of outlaws including militants and insurgents increased by over 20pc.\n\nClaims by banned outfits\n\nBased on the claims and newspaper reports, the number of fatalities from violence claimed by the militant and insurgent outfits appeared to have dropped in Q1 2025 from 316 in Q4 2024 to 229, marking a 28pc decrease.\n\nOver 500 people suffered violence (313 deaths and 217 injuries) during the holy month of Ramazan with various banned groups, including the Tehreek-i-Taliban Pakistan (TTP), TTP-Gul Bahadur Group, IS-Khorasan, BLA, and Sindhudesh Revolutionary Army, claiming responsibility for these attacks.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:18:18.884Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901463/more-outlaws-killed-than-civilians-or-security-men-centre-for-research-and-security-studies",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:19.000Z"
}
