{
  "title": "KP govt wants teaching hospitals to ensure transparent utilisation of funds - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa government has asked medical teaching institutions (MTIs) to provide their account details as part of the policy to ensure spending of funds transparently.\n\nA notification issued to all MTIs directed them to send soft and hard copies regarding their receipts and expenditure to health department in the light of cabinet’s decisions. It said that the order was circulated to all 10 MTIs to conduct financial audit of the institutions.\n\nThe PTI-led government passed Medical Teaching Institutions Reforms Act (MTIRA), 2015, from the assembly and started its imposition in teaching hospitals and their affiliated medical and dental colleges in a phased manner.\n\nThe law is meant to accord financial and administrative autonomy to MTI-covered institutions and improve patients’ care.\n\nSeeks details of their bank accounts for audit\n\nPrior to imposition of the law, teaching hospitals and colleges were administered by health department. After enforcement of the law, these hospitals and colleges are now managed by their respective Board of Governors (BoGs), which takes all financial and administrative decisions.\n\nMTIs get one-line budget from government and spend the same in line with their needs. They appoint people, spend budget, abolish posts and create new positions according to their requirements. Before getting the status of MTIs, these institutions had to get approval from health department for everything including appointments, transfer, repairs and procurements etc.\n\nSources in health department told Dawn that MTIs got budget from government on quarterly basis but like other hospitals, they did not provide account details to government and spent the same independently.\n\n“The previous PTI-led government made some amendments to MTIRA, including sharing account details with government for transparency. However, the MTIs are not sharing details as per law,” they said.\n\nThe caretaker government in the province had suspended funds to MTIs briefly which had not only affected the employees, who used to receive their salaries belatedly, but there was extreme shortage of medicines in the teaching hospitals.\n\nSources said that the caretakers had done that because they did not have influence on MTIs as those were managed by BoGs.\n\nArchitects of MTIRA told Dawn that as per amendment, all MTIs were accountable to health minister and chief minister as they could terminate BoGs and replace them anytime.\n\nHowever, they said, most of politicians wanted MTIs to give them preferential treatment, which was not possible in autonomous institutions. “MTIRA has been introduced to free tertiary care hospitals from politicians and bureaucrats, who used to call shots before enforcement of the law,” they said.\n\nThey said that as per law, MTIs accounts were audited by government while they could create, re-designate or abolish posts provided that financial implications did not exceed the annual budget.\n\nThe law says that government may also do special audits anytime, by third party. Those opposed to MTIs were talking about financial audits of all teaching hospitals and their accountability but they did not know the law and just wanted interference nothing else, said architects of the law.\n\n“MTIs are providing 90 per cent curative services to patients while district and peripheral health facilities are very poor so all the burden are placed on MTIs. So if you have put the entire burden on MTIs, you have to give them appropriate budget as well,” they said.\n\nThey said that MTIs were criticised by PTI ministers and MPAs because they did not get the protocol which they expected.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T15:34:55.316Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901350/kp-govt-wants-teaching-hospitals-to-ensure-transparent-utilisation-of-funds",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:48:04.000Z"
}
