{
  "title": "Punjab livestock dept issues alert about lumpy skin disease - Pakistan - DAWN.COM",
  "author": null,
  "content": "SAHIWAL: Secretary of Punjab Livestock and Dairy Development, Saqib Ali Ateel, issued an alert regarding the re-emergence of Lumpy Skin Disease (LSD), a viral infection affecting cattle in central and south Punjab.\n\nThe secretary said the department had indigenously developed a vaccine to counter LSD and “we are not worried but there is a need to adopt precautions measures in this regard.”\n\nThis came out in a handout sent by the department to local divisional directorate of livestock department, Sahiwal.\n\nThe secretary has directed the officials to immediately develop inter-provincial check post for LSD at Punjab borders linking to Sindh. The directive calls for developing LSD awareness campaign in Sahiwal division.\n\nDirector Rana Abdur Rouf said keeping in view the instructions many awareness centres have been established.\n\nIn the Sahiwal division, around seven checkpoints have been developed at different roads. The check posts/awareness counters were developed at Qutab Shahna Bridge, Iqbalnager, Shaikh Fazil, Okara Toll Plaza, Harrapa Toll Plaza, Mari Pattan, Pakpttan, Chowk Marla and Arifwala Chowk.\n\nThe handout says the emergence of LSD raised concerns among dairy and livestock farmers across Punjab.\n\nReports said Lumpy Skin Disease, first detected in Pakistan in November 2021, caused widespread damage to the livestock sector in 2022. Sources reveal that the recent outbreak has impacted cattle in south Punjab, particularly in areas bordering Sindh, near cities such as Moro and Naushero Feroze.\n\nData says in the year 2022 alone, LSD affected over 62,000 animals in Punjab, resulting in the death of 4,656 cattle and significant financial setbacks for ordinary and milking farmers.\n\nThe Punjab livestock department instructed the livestock director in Bahawalpur to prioritise the establishment of inter-provincial checkposts to monitor animal movement.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:18:04.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901353/punjab-livestock-dept-issues-alert-about-lumpy-skin-disease",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:59.000Z"
}
