{
  "title": "A questionable pivot towards crypto - Business - DAWN.COM",
  "author": null,
  "content": "Recent moves by Pakistan’s government to cultivate a cryptofriendly environment starkly contradict the long-held warnings of its central bank.\n\nIn 2018, the State Bank of Pakistan (SBP) issued a stern warning cautioning financial institutions against the high risks of virtual currencies. Yet, in a dramatic policy reversal, the government has launched initiatives such as the Pakistan Crypto Council, seemingly eager to capitalise on global digital trends without first addressing unresolved regulatory deficiencies.\n\nGlobally, the digital asset revolution is gaining formidable momentum. There are now over 560 million crypto users worldwide, and emerging markets are witnessing robust growth. Crypto sectors in some regions are projected to grow at a compound annual rate of approximately 7.1 per cent, with markets such as India registering retail trading volumes of around $1.9 billion in the last quarter of 2024.\n\nNigeria reported that nearly 32pc of its population actively engages with digital currencies, generating transaction volumes estimated at $400m. In Brazil, stablecoins account for as much as 90pc of all crypto flows, highlighting how digital assets are becoming essential in regions where traditional banking infrastructure is limited.\n\nPakistan’s foray into cultivating crypto-friendly policies despite a deficient AML/CFT regime sparks serious regulatory concerns about volatile digital currencies\n\nYet, Pakistan’s rapid embrace of digital currencies appears to be a leap before looking. Although Pakistan made commendable strides in addressing its Financial Action Task Force (FATF) action plan — progress that culminated in its removal from the FATF grey list in October 2022 — critical regulatory and enforcement gaps remain.\n\nThis progress, while significant, has not resolved longstanding vulnerabilities in the nation’s anti-money laundering (AML) and counter-terrorist financing (CFT) frameworks. The FATF’s recent follow-up reports indicate that Pakistan still faces challenges with certain recommendations, particularly in areas related to enhanced due diligence and the supervision of non-financial businesses.\n\nThe SBP’s 2018 warning remains as relevant as ever. The report emphasised that virtual currencies, by their very decentralised and opaque nature, are prime conduits for money laundering and illicit finance. Globally, the stakes are high: estimates suggest that in 2024 illicit crypto transactions may have reached as high as $40.9bn, with approximately $10.8bn linked to cybercrime. Such staggering figures underscore the dangers inherent in hasty and under-regulated crypto adoption.\n\nPakistan’s pivot towards crypto-friendly policies appears to be driven by a desire to mirror the success stories of other emerging markets rather than by a clear-eyed assessment of its own regulatory readiness. The launch of the Pakistan Crypto Council in March 2025 is marketed as a means to modernise the financial landscape and attract foreign investment.\n\nHowever, this is little more than a political gambit — an attempt to showcase modernisation and digital innovation while ignoring the unresolved deficiencies in its AML/CFT regime.\n\nThis approach is particularly perilous when one considers the high-profile collapses that have marred the global crypto scene. The collapse of FTX in 2022, which obliterated billions in investor wealth, stands as a stark reminder of the volatility and systemic risks posed by digital asset markets. Earlier failures, such as the Mt. Gox debacle in 2014 and the QuadrigaCX fiasco in 2019, further illustrate how inadequate regulatory oversight can precipitate catastrophic losses.\n\nIn parallel, the notorious Silk Road online black market — which used Bitcoin to facilitate the illicit drug trade before its shutdown in 2013 — demonstrates how digital currencies can be exploited by criminal networks when left unchecked.\n\nWhile some emerging markets have managed to integrate digital currencies into their economies through balanced, risk-based regulatory frameworks, Pakistan’s recent policy shift appears to be reckless. By prioritising crypto initiatives without fully cementing its regulatory foundations, Pakistan risks exposing its financial system to the very dangers its central bank warned against nearly seven years ago.\n\nThe irony is palpable. Global markets like India and Nigeria are reaping the benefits of digital finance by ensuring that regulatory reforms go hand in hand with technological adoption. India, for example, is cautiously exploring a state-backed digital currency while considering restrictions on private cryptocurrencies, thereby maintaining a balance between innovation and stability.\n\nConversely, Pakistan’s abrupt pivot seems to prioritise the allure of modernity over the hard work of establishing a robust, enforceable framework — one that can safeguard against money laundering, terrorist financing, and the systemic risks highlighted by the FATF.\n\nIt is essential to recognise that Pakistan’s removal from the FATF grey list in October 2022 does not signal an end to its AML/CFT challenges. The FATF follow-up reports indicate that while Pakistan has made significant improvements, certain key recommendations remain only partially addressed. The nation’s journey towards full compliance is far from over, and any further expansion into the digital asset space without resolving these deficiencies could invite serious repercussions.\n\nFor Pakistan, the current crypto policy pivot is a high-stakes gamble. It is an overt display of a desire to join the global digital revolution, yet it risks undermining the integrity of its financial system by creating new vulnerabilities. The risks are not merely theoretical.\n\nIf the crypto market’s volatility were to trigger another high-profile collapse similar to FTX or exacerbate criminal activity akin to the Silk Road phenomenon, the fallout could be disastrous not just for investors but for the entire economy.\n\nIn conclusion, while the promise of digital currencies is real and the global market continues to expand, Pakistan must tread cautiously. The government’s crypto-friendly initiatives, though aimed at modernisation, are premature without first fortifying the nation’s AML/CFT regime and ensuring robust regulatory oversight.\n\nThe SBP’s 2018 report, with its stark warnings, should serve as a reminder that innovation cannot come at the expense of financial security. Pakistan must complete its regulatory reforms and close the remaining gaps highlighted by the FATF before it can safely harness the potential of digital assets.\n\nThe writer is former head of Citigroup’s emerging markets investments and author of ‘The Gathering Storm’\n\nPublished in Dawn, The Business and Finance Weekly, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e8951f234d2.jpg",
  "retrievedAt": "2025-08-25T15:35:20.076Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901170/a-questionable-pivot-towards-crypto",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:27.000Z"
}
