{
  "title": "Civil society gathers outside Karachi Press Club on Eidul Fitr to demand release of BYC’s Sammi Deen - Pakistan - DAWN.COM",
  "author": null,
  "content": "The civil society in Karachi demanded on Monday the release of Baloch Yakjehti Committee (BYC) leader Sammi Deen Baloch, who has been in detention for the past week after she led a protest against the arrest of her colleague Dr Mahrang Baloch.\n\nSammi and five others were taken into custody last Monday for violating a freshly imposed Section 144. Despite a judicial magistrate discharging the activists and ordering their release the next day, Sammi was detained shortly later under the Maintenance of Public Order (MPO) ordinance for 30 days.\n\nSammi’s sister Mehlab Deen Baloch — flanked by renowned lawyer Jibran Nasir and activist Sheema Kermani, among others — addressed a press conference outside the Karachi Press Club on the first day of Eidul Fitr today.\n\nMehlab, who says her father was forcibly disappeared 15 years ago, recalled the Karachi protest earlier this week and said: “Despite the court order for [Sammi and others’] release, […] they were put behind bars again under MPO3 for 30 days on the directives of the PPP’s [Sindh] government.”\n\nShe alleged that the PPP, while advocating for women’s rights, was “not ready to give those rights to Baloch women”. She demanded that the cases against Sammi be quashed and she be released.\n\nThe press conference — which saw thin attendance on the first day of Eidul Fitr — proceeded peacefully without any obstructions, with police (including women cops) monitoring it from the opposite road.\n\nKhizar Qazi, Sindh vice-chairperson of the Human Rights Commission of Pakistan, and academic Nida Kirmani were also present at the press conference.\n\n“The political circles think they can silence us but as long as enforced disappearances do not end, these voices cannot be silenced,” Mehlab asserted.\n\nSpeaking to Dawn.com, Mehlab detailed that she and her sister had been recording their protests on Eidul Fitr outside the press clubs in Quetta and Karachi for the last 15 years.\n\n“The day of Eid is much more difficult for us to spend than other days, so we only satisfy ourselves by bringing our baba’s photo to the press club and speaking about him,” she said.\n\nHowever, she added, this year was harder for her as Sammi — her activist sister often seen leading protests — was behind bars herself, leaving Mehlab and her mother at the helm.\n\n“I have come here alone with both of their pictures, and am requesting the state and authorities to recover my father and release my sister, who has been imprisoned without any crime,” Mehlab told Dawn.com.\n\nAddressing the press conference after her, Nasir — who earlier in the day attended a hearing of a widely criticised cybercrime case against senior journalist Farhan Mallick — slammed the government’s actions.\n\n“After asking for 15 years, the answer she (Sammi) got was that ‘you will also be disappeared and put in jail’,” the lawyer said. “What are we (government) wanting to achieve through this injustice and oppression?” he asked.\n\nNasir claimed that a majority of the public does “not even want to look towards” the country’s leaders. “If you won’t leave any room for respect yourself, then don’t complain about the future generations.\n\n“Those trying to speak democratically and peacefully, please talk to them,” he said, urging the government to engage with the protesters.\n\nNasir quoted claims by Mahrang’s sister, Nadia Baloch, that her detained sister was not being provided with hygienic food or water, which had worsened her health. “Even if you consider us criminals and prisoners, you stooped so low that you cannot even give us the rights of a prisoner.”\n\nThe renowned lawyer further asserted that such actions were not limited to the “so-called peripheries” in Balochistan and Khyber Pakhtunkhwa as he highlighted Mallick’s arrest. “How did he spend his Eid? His wife, daughter and friends were waiting for the judge to arrive at the court in the morning.”\n\nIn a post on Instagram after the press conference, Nasir said the detentions of Baloch activists were a “question mark on the government and the judiciary’s independence”. “What freedom would a government and judiciary confined in the chains of fear and self-interests give to the citizens?” he quipped.\n\nAlso present at the press conference, Kermani, founder of the cultural action group Tehrik-i-Niswan, wondered: “Is protesting peacefully a crime?\n\n“The state needs to think of the results of what it’s doing, and the results will be very bad because when women and children take to the streets, a revolution begins, which we are seeing right now,” the activist added.\n\nSpeaking to Dawn.com, Kermani alleged: “Sammi’s father and hundreds of other young girls’ fathers, brothers and husbands have been forcefully disappeared, and they’re not told whether they are dead or alive.\n\n“[…] If you want to arrest somebody, arrest that person, put the charges against that person, bring that person to court and say this is what we are accusing you of. Let that person find defence or stand up in court and fight his or her case,” she asserted.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/312017301f8ccf9.jpg",
  "retrievedAt": "2025-08-25T15:34:52.995Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901505/civil-society-gathers-outside-karachi-press-club-on-eidul-fitr-to-demand-release-of-bycs-sammi-deen",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T15:40:24.000Z"
}
