{
  "title": "Chaos in the global shipping industry - Business - DAWN.COM",
  "author": null,
  "content": "The Trump administration’s proposed massive port fees on Chinese-built and –operated cargo vessels set in motion the bigger threat of a trade war besides potentially disrupting global supply chains and creating uncertainty in the global maritime industry.\n\nThe proposed US action to curb China’s dominance in shipping and revive its own shipbuilding industry will expand the punitive tariffs against China and other countries by President Donald Trump beyond just goods trade.\n\nThe US media views Washington’s pushback against China’s dominance in the shipbuilding industry as part of the president’s widening global economic and trade war, with the world’s largest ocean freight companies confronting the threat of fines of up to $1.5 million for Chinese-made container ships that call on the US ports.\n\nThe Trump administration says the fees would curb China’s growing commercial and military dominance on the high seas and promote domestically built vessels.\n\nThe world’s largest ocean freight companies are being threatened with fines of up to $1.5m for Chinese-made container ships that call on the US ports\n\nIn addition to port fees of up to $1.5m for each US port of call on ocean carriers using Chinese-made vessels to move trade, the US Trade Representative re­­­quires that one per cent of US exports move on US-flagged and -operated ships, then 3pc within two years, 5pc within five years and 15pc within seven years. The plan further targets owners and operators with new vessel contracts for building at Chinese shipyards, with ‘additional fees’ that could be added to the port call fees.\n\nCurrently, China builds 61pc of the world’s new merchant vessels, a maritime and offshore industry news website, gCaptain, has reported. In contrast, the US share has fallen to just 0.1pc in the world’s commercial shipbuilding market in two decades, the Associated Press quoted a report by the Centre for Strategic and International Studies.\n\nTo completely avoid the fees in the current proposal, vessel operators must be based outside of China, have fleets with fewer than 25pc of ships built in China and have no Chinese shipyard orders or deliveries scheduled within the next two years.\n\nThe proposal builds on a determination under Section 301 of the 1974 Trade Act by former president Joe Biden’s administration that China’s effort to dominate the maritime, logistics, and shipbuilding\n\nsectors could be challenged under US laws because of its subsidies to Chinese manufacturers. The findings were released just as Trump assumed office on January 20.\n\nThe idea has sent a shockwave through the US maritime industry because it threatens the survival of the same shipping companies and customers that would drive demand for orders from the American shipyards Trump wants to rebuild, with the industry arguing that the fees will harm the competitiveness of America’s own maritime sector while failing to curtail China’s lead and reshaping global maritime operations, affecting trade flows, freight rates and even fleet renewal strategies.\n\nThe World Shipping Council claims the United States Trade Representative (USTR) proposal would add between US$600-800 per container, “which would double the cost of US shipping exports”, noting that 98pc of ships that call at US ports could be affected by the proposal.\n\nBloomberg News has reported that business owners and industry officials say the proposals would make American goods too expensive internationally, resulting in a loss of jobs for American workers, divert trade away from the US to Canada and Mexico and force up global freight rates and inflation at home.\n\nAt the USTR public hearing held last week to assess the impact of this measure on American businesses and workers, shipping industry representatives warned the measure would be counterproductive, and only serve to penalise US consumers, businesses, and especially farmers, raising prices and threatening jobs.\n\nAnalysts agree that the proposals — another form of tariffs with a bluntness that makes it even more nonsensical than tariffs — would disrupt global trade more than President Donald Trump’s approach to tariffs by injecting chaos and uncertainty into the container shipping supply chain. “If the intention is to drastically increase costs for US importers and make exports uncompetitive, this proposal is likely to do the job,” Lars Jensen of Vespucci Maritime said in a LinkedIn post.\n\nThe potential port fees have limited the availability of ships needed to move agriculture, energy, mining, construction and manufactured goods to international buyers, according to Reuters.\n\nVessel owners have already refused to provide offers for future US coal shipments. “Policymakers must reconsider these damaging proposals and seek alternative solutions that support American industries,” World Shipping Council President & CEO Joe Kramek said.\n\nThe China Shipowners’ Association said the proposed actions targeting Chinese-built vessels and Chinese shipping companies directly infringed upon China’s status as a “most-favoured nation” under World Trade Orga­nisation (WTO) rules besides being in direct contravention of the 2003 Sino-US Maritime Agreement, which stipulates that vessels from the two countries shall receive fair and non-discriminatory treatment regarding port access, services and fees when calling at each other’s ports.\n\n“The US Section 301 investigation and its proposed sanctions not only violate WTO rules but also undermine fair competition in the global shipping market, harming US economic interests. Protectionist policies cannot reverse the decline of the US shipbuilding industry; instead, they risk further fragmenting global supply chains and destabilising the global economy,” Chinese maritime industry experts were quoted by media saying.\n\nThis US action, cloaked in the rhetoric of “national security” but rooted in narrow trade protectionism, exposes the systemic failures of US industrial policy and highlights deep-seated contradictions in its economic governance.\n\nPublished in Dawn, The Business and Finance Weekly, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/67e8a3e13ea3a.gif",
  "retrievedAt": "2025-08-25T15:35:20.748Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901241/chaos-in-the-global-shipping-industry",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:27.000Z"
}
