{
  "title": "Israel approves new bypass road in occupied West Bank - World - DAWN.COM",
  "author": null,
  "content": "JERUSALEM: Israeli Prime Minister Benjamin Netanyahu’s office on Sunday announced the approval of a road project in the occupied West Bank that would separate traffic for Palestinians and Israelis near the Maale Adumim settlement.\n\n“The security cabinet approved last night Defence Minister Israel Katz’s proposal for the construction... of a new road network in the Maale Adumim area,” the office said in a statement, referring to the large settlement east of Jerusalem, home to more than 40,000 people.\n\nThe project “will thus improve traffic flow and strengthen transportation infrastructure between Jerusalem, Maale Adumim and the eastern Binyamin region, allowing for the continued development of settlements in the E1 area,” Netanyahu was quoted as saying.\n\nThe international community has warned repeatedly that Jewish settlement construction in the E1 corridor, which passes from Jerusalem to Jericho, would slice the West Bank in two and compromise the contiguity of a future Palestinian state.\n\nAnti-settlement NGO Peace Now slammed the project as a “new apartheid road”, with one of the planned roads rerouting Palestinian traffic away from the main artery used by Israelis, to reach a number of villages.\n\n“We continue to strengthen the security of Israeli citizens and expand our settlements,” Netanyahu said, according to the statement. Palestinian Islamist movement Hamas condemned the project.\n\nIn a statement, it said “the continued expansion of settlement projects in occupied Jerusalem exposes the malicious intentions of the occupation.” Israel seized the West Bank and east Jerusalem in the Six-Day War of 1967 in moves never recognised by the international community.\n\nIsraeli settlements in the Palestinian territories are considered illegal by the United Nations and most foreign governments.\n\nSeveral far-right Israeli ministers are openly advocating for Israel to annex all or part of the West Bank, capitalising on US President Donald Trump’s second term.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:18:12.353Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901442/israel-approves-new-bypass-road-in-occupied-west-bank",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:41.000Z"
}
