{
  "title": "Balochistan’s Malik, Bugti condemn attack on BNP sit-in - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Former Balochistan Chief Minister Dr Abdul Malik Baloch and chieftain of Bugti tribes Nawab Aali Bugti have strongly condemned the suicide attack on a sit-in held by the Balochistan National Party (BNP).\n\nThe two leaders said the attack was a “conspiracy” to worsen the law and order situation in Balochistan, which was foiled.\n\nOn Saturday, a suicide bomber attempted to enter the sit-in site near the Lakpass area of Mastung district.\n\nHowever, as he was intercepted by security guards, he detonated the explosives strapped to his body away from the protest site.\n\nDr Baloch, who also leads the National Party, said the provincial government was responsible for the safety of the protesters.\n\nHe urged the government to remove roadblocks and allow the protesters to enter Quetta.\n\nHe also extended his best wishes to the leaders and participants of the protest.\n\nMeanwhile, in a separate statement, National Party’s central spokesperson condemned the alleged crackdown and arrests of BNP leaders and supporters.\n\nHe said the arrests aimed to halt BNP’s “peaceful and democratic long march”.\n\nThe spokesperson claimed the government handles every political process through force and in an undemocratic manner, which highlights their lack of political insight.\n\nThe statement also mentioned that Balochistan is currently facing a critical situation, with Dr Mahrang Bal­o­ch, Sammi Din Baloch, Bebow Baloch, Bebarg Baloch and other leaders of the Baloch Yakjehti Committee detained under Section 3 of the Maintenance of Public Order (MPO) for participating in peaceful protests.\n\nThe families of these detainees were concerned about their health, which is genuinely alarming.\n\nIn a statement issued on Sunday, the Nawab Bugti emphasised that it was the government’s responsibility to ensure the safety of the protesters.\n\nWhile expressing solidarity with the demands of BNP leader Sardar Akhtar Mengal, Mr Bugti called for the release of the detained activists.\n\nHe added the protesters should be allowed to continue their peaceful march in Quetta.\n\nMr Bugti demanded that those responsible for the attack be brought to justice and that the security of all long march participants be guaranteed.\n\nHe noted that the incident was not isolated but rather part of the ongoing cycle of violence in Balochistan.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:18:18.283Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901458/balochistans-malik-bugti-condemn-attack-on-bnp-sit-in",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:19.000Z"
}
