{
  "title": "US attempts to rally regional nations into an anti-China bloc - World - DAWN.COM",
  "author": null,
  "content": "WHEN the current US president entered the White House, he spoke of a “new beginning” for US-China relations. Yet his administration is showing it is intent on inflaming tensions, pressuring Asian allies to weaponise their trade and security ties with the United States to contain China.\n\nThe visits of US Defence Secretary Pete Hegseth to Japan and the Philippines have laid bare this cynical strategy — one that demands absolute loyalty from allies while offering them nothing but economic coercion and geopolitical instability in return.\n\nHegseth’s rhetoric in Tokyo was typical of Washington’s doublespeak. He praised Japan as an “indispensable partner” in countering what he called “communist Chinese military aggression”, and invoked a shared “warrior ethos” between the US and Japan.\n\nYet these hollow words ring false when contrasted with the US administration’s treatment of Japan in trade and security. The US has slapped a 25 percent tariff on all imported Japanese automobiles, a direct blow to one of Japan’s most critical industries.\n\nMeanwhile, the US leader himself publicly questioned the benefits of the US-Japan Security Treaty to the US, complaining that Washington is obligated to defend Japan while Tokyo offers no reciprocal guarantee.\n\nThis is the reality of the US’ alliances in Asia: they are not partnerships of equals, but instruments of US dominance. Japan, like Europe, is expected to follow Washington’s lead on security — hosting US bases, aligning with Nato’s expansion into Asia, and escalating military spending — while simultaneously enduring punitive trade policies.\n\nThe message is clear: submit to the US’ geopolitical agenda, or face economic retaliation. Tokyo is certainly not blind to this trap. The sudden resignation of former prime minister Fumio Kishida was not driven by external threats, but by domestic economic strains worsened by his government’s unquestioning alignment with US policy. His administration’s decision to double defence spending in a short period — largely to fund US-backed military upgrades — placed an unsustainable burden on Japan’s economy.\n\nNow, Prime Minister Shigeru Ishiba faces an impossible choice. If Japan further opens its strategic southwestern islands to US forces — particularly near the contested East China Sea and Taiwan — it will sabotage Tokyo’s efforts to stabilise relations with Beijing. Yet if it resists Washington’s demands, it risks trade penalties and political pressure.\n\nThe US has already demonstrated its willingness to strong-arm allies, as seen in Hegseth’s meeting with Philippine President Ferdinand Marcos Jr, where security assurances came with an unmistakable price tag attached. Japan knows the same applies to its own alliance.\n\nWashington’s lofty talk of a “free and open Indo-Pacific” is nothing but a euphemism for rallying regional nations into an anti-China bloc. The US does not seek stability or mutual prosperity — it seeks vassal states that will host its military assets, buy its weapons, and isolate Beijing at their own economic expense.\n\nBut this strategy is backfiring. Asian nations, including Japan, are increasingly aware that blind obedience to Washington brings more risks than rewards. The US administration’s erratic trade policies, its transactional view of alliances, and its willingness to stoke regional conflicts for its own gain have left even close allies wary. Japan, in particular, must recognise that it cannot eat from China’s bowl in trade while smashing China’s pots in security.\n\nA stable economic relationship with Beijing is incompatible with serving as a forward base for US containment efforts.\n\nThe US is not a reliable partner. Its alliances are not defensive pacts but tools of coercion, designed to maintain the US’ hegemony at the expense of regional stability. To maintain the regional stability that is essential for their well-being, Japan, like other Asian nations, must pursue an independent foreign policy — one that prioritises diplomacy over confrontation, and mutual benefit over subservience to Washington’s demands.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:18:16.517Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901450/us-attempts-to-rally-regional-nations-into-an-anti-china-bloc",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:41.000Z"
}
