{
  "title": "BNP-M sit-in continues after talks with govt fail - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Akhtar Mengal refuses to end protest until BYC leaders are released\n• Quetta remains inaccessible after authorities place more containers\n\nQUETTA: Negotiations bet­ween Sardar Akhtar Mengal and a government delegation failed on Sunday, as the Balochistan National Party-Mengal (BNP-M) leader refused to call off the sit-in at Lakpass until his demands were met.\n\nMr Mengal insisted that the protest would continue until the release of all detained Baloch Yakjehti Committee (BYC) female leaders, including Dr Mahrang Baloch, and until protesters were allowed to enter Quetta peacefully.\n\nA government team, led by provincial minister Zahoor Ahmed Buledi, met with BNP-M leadership, including Mr Mengal, Agha Musa Jan, Sajid Tareen Advocate, Mir Akhtar Hussain Langove, Sana Baloch and Mir Hammal Kalmati, to urge an end to the protest.\n\nThe delegation cited security concerns and travel disruptions for residents of Sindh, Punjab and Khyber Pakhtunkhwa as reasons to call off the sit-in.\n\nHowever, Mr Mengal remained firm, stating, “We have a one-point agenda — the release of Dr Mahrang and other female detainees.”\n\nKey routes blocked\n\nThe BNP-M protest at Lakpass entered its third day on Sunday, with hundreds of participants blocking key access routes. The local administration has refused to allow the marchers to enter Quetta.\n\nAs a result, residents from 12 districts — including Mastung, Kalat, Surab, Khuzdar, Hub, Lasbela, Noshki, Kharan, Dalbandin, Nokundi and Washuk — are facing severe travel difficulties ahead of Eidul Fitr.\n\nTo prevent BNP-M’s long march from entering Quetta, the provincial administration has reinforced security, placing shipping containers and barricades at Lakpass Tunnel, Kund Mesori, Aghbarg, and other key entry points.\n\nThe blockade has left hundreds of travellers stranded, unable to return home for the holiday, while patients requiring medical attention struggle to reach hospitals due to restricted access.\n\nIn a significant political development, a delegation from the Jamiat Ulema-i-Islam (JUI-F) Balochistan, led by Senator Maulana Abdul Wasey, visited the BNP-M sit-in camp to exp­ress solidarity and discuss the ongoing situation. The delegation also incl­uded Senator Kamran Murtaza Advocate, MPA Nawabzada Mir Zafarullah Zehri, and Mir Usman Pirkani.\n\nDuring their visit, the JUI-F representatives eng­a­ged with BNP-M leaders and shared their perspectives on the protest and the government’s response.\n\nDespite repeated calls for dialogue, the Balochi­stan government continues to block BNP-M’s long ma­rch, keeping the Lakpa­s­s route closed for the third consecutive day. This has severed Quetta’s connectivity with multiple districts, affecting thousands of people, particularly those traveling for Eid celebrations.\n\nOn Sunday, authorities further tightened restrictions by placing additional containers at Kund Mesori and Aghbarg, effectively cutting off Quetta’s major entry and exit points. The move has doubled the hardships for citizens.\n\nPublished in Dawn, March 31st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/03/310822307ec3327.png",
  "retrievedAt": "2025-08-25T15:35:35.435Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1901375/bnp-m-sit-in-continues-after-talks-with-govt-fail",
  "dateList": "2025-03-31",
  "date_published": "2025-03-31T00:47:07.000Z"
}
