{
  "article_id": "2025-07-24_eb6a50152161a63556de70e85f99bd54",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ctbcm-policy-to-be-implemented-in-next-two-months-awais-leghari/",
    "retrieved_at": "2025-08-27T10:03:15.435Z"
  },
  "metadata": {
    "title": "CTBCM policy to be implemented in next two months: Awais Leghari",
    "author": null,
    "date_published": "2025-07-24T13:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 287,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 24 (APP):Minister for Power Division Sardar Awais Ahmed Khan Leghari on Thursday said that Competitive Trading Bilateral Contract Market (CTBCM) policy will be implemented in next two months for the first time in the country's history adding that after that the government will not purchase electricity directly. The Minister expressed these views during a meeting with a high-level World Bank delegation led by Ousmane Dione, Regional Vice President for the Middle East, North Africa, Afghanistan, and Pakistan, said a press release. He said under CTBCM model, electricity will be freely traded in the market. Mechanisms such as \"wheeling charges\" are being introduced, and the government's role will be confined strictly to the regulatory framework, he added. He said that this transition will be gradual and guided by a comprehensive strategy to maintain stability in the system. The Minister also briefed the delegation in detail about the government's energy sector reforms, net metering policy, privatization efforts, regulatory improvements, and investment opportunities. He said that Pakistan's policy clearly leans toward promoting the private sector and ensuring transparency, and that the government wants international investors to become partners in this journey. Ousmane Dione appreciated the energy sector reforms underway in Pakistan and stressed that energy is the foundation of development, playing a crucial role in the progress of any country. He said that the World Bank would continue to support Pakistan in this sector. He said the World Bank stands shoulder to shoulder with the Government of Pakistan in promoting a sustainable, reliable, and investment-friendly energy system. The Minister also presented the delegation with a comprehensive booklet outlining the ongoing reforms in the energy sector and expressed hope that the current partnership would grow stronger in the future.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}