{
  "article_id": "2025-07-24_f32c67b9c806c3731e362d87b9c2f10d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/oic-comstech-ningbo-university-launch-global-certificate-course-on-applied-biomedical-ai/",
    "retrieved_at": "2025-08-27T10:03:52.166Z"
  },
  "metadata": {
    "title": "OIC-COMSTECH, Ningbo University launch Global Certificate Course on Applied Biomedical AI",
    "author": null,
    "date_published": "2025-07-24T08:59:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 275,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 24 (APP):A landmark international certificate course on Applied Biomedical Artificial Intelligence was launched today at the COMSTECH Secretariat, Islamabad. Jointly organized by OIC-COMSTECH and Ningbo University, China, the 19-day hybrid-format program has drawn participation from over 1,000 young scientists, researchers, and professionals from 30 countries. The course aims to equip participants, especially from low- and middle-income OIC member states, with practical skills in applying AI technologies to biomedical research and healthcare innovation. The participants, attending both physically and virtually, are required to complete at least 80% of the sessions to receive certification. The inauguration ceremony began with the welcome address from Prof. Dr. M. Iqbal Choudhary, Coordinator General of OIC-COMSTECH. He emphasized the transformative role of AI in disease diagnosis, drug discovery, predictive analytics, and personalized medicine, calling the initiative a milestone in international scientific collaboration. Prominent Chinese scientists delivered keynote addresses, including Prof. Dr. Liu Xinmin, Chief Scientist at the Institute of Drug Discovery, Ningbo University, who stressed the importance of global partnerships in advancing biomedical research. Joining virtually, Academician Prof. Dr. Zhao Yufen, Director at the Institute of Drug Discovery Technology, served as guest of honour and highlighted the need to cultivate AI-driven talent for global health challenges. The technical session featured Prof. Dr. Yuzong Chen, Deputy Director of the State Key Lab of Chemical Oncogenomics, who provided an overview of the course and delivered the first lecture, focusing on advanced AI applications in chemical genomics and drug development. The event concluded with an interactive Question and Answer session, marking the beginning of what is expected to be a high-impact initiative to promote long-term scientific cooperation between the OIC and China.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}