{
  "article_id": "2025-07-24_1ed706558c4f661973e40df2c6cbd6ec",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ksrelief-distributes-4000-relief-kits-across-ajk-reaching-over-28000-disaster-affected-residents/",
    "retrieved_at": "2025-08-27T10:03:23.988Z"
  },
  "metadata": {
    "title": "KSrelief distributes 4,000 relief kits across AJK, reaching over 28,000 disaster-affected residents",
    "author": null,
    "date_published": "2025-07-24T09:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 248,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, July 24 (APP): The King Salman Humanitarian Aid and Relief Centre (KSrelief) has successfully distributed 4,000 Shelter Non-Food Item (NFI) kits to internally displaced and disaster-affected families across seven districts in Azad Jammu and Kashmir (AJK) in a significant humanitarian effort. The large-scale distribution, carried out in close coordination with the State Disaster Management Authority (SDMA) AJK, targeted vulnerable communities in Muzaffarabad (325 kits), Jhelum Valley (542), Neelum (433), Kotli (766), Bhimber (151), Poonch (881), and Haveli (902). Each NFI kit contained critical emergency supplies, including shelter materials, solar panels with LED lights, warm blankets, kitchen sets, water coolers, plastic mats, and antibacterial soap - for providing both immediate relief and long-term support to households facing harsh conditions. The initiative, implemented in collaboration with the National Disaster Management Authority (NDMA), SDMA, and local partner Hayat Foundation, has directly benefited more than 28,155 individuals, reinforcing KSrelief's growing humanitarian footprint in Pakistan. SDMA Director General Sardar Waheed, who participated in the distribution ceremony in Muzaffarabad, lauded the Kingdom of Saudi Arabia and KSrelief for their timely and impactful assistance. \"This collaboration is a testament to the deep bonds between Saudi Arabia and the people of AJK. The relief has reached the most vulnerable communities with transparency, efficiency, and dignity,\" he noted. The distribution reflects KSrelief's ongoing commitment to disaster response and resilience building, particularly in regions vulnerable to natural calamities. The organization continues to play a vital role in alleviating human suffering in Pakistan through coordinated, needs-based humanitarian assistance.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}