{
  "article_id": "2025-07-24_68276b1f4b31bab4cde35ec086079a28",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/solid-evidence-against-accused-in-may-9-incidents-case-resulted-in-award-of-punishment-to-accused-tarar/",
    "retrieved_at": "2025-08-27T10:03:27.371Z"
  },
  "metadata": {
    "title": "Solid evidence against accused in May 9 incidents case resulted in award of punishment to accused: Tarar",
    "author": null,
    "date_published": "2025-07-24T09:31:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 266,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 24 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar said on Thursday that there was solid evidence against the accused of May 9 tragedy and they were awarded punishment on its basis. Talking to the media, he said CCTV footage was available, and it was known who were involved in these incidents. To a question, he said in the 190 million pound case, the founding chairman of PTI could not present any evidence in his favour. The minister said that the PTI leadership having no defence in 190 million pounds case, so they were trying to hide behind religion and the State of Medina. \"They say that we were talking about the state of Medina, so we were convicted in the 190 million pound case\", Attaullah Tarar added. \"The answer to the 190 million pound case is not religious, nor is the state of Medina. They should tell the nation how they used billions of rupees of the business tycoon. The minister said that the sons of the founding chairman of the Pakistan Tehreek-e-Insaf had the right to campaign, but wherever they are going, they should tell people that their father had been convicted in the 190 million pound corruption case. He said the sons of PTI founding chairman should carry the fact sheet of the 190 million pound case with them and tell anyone they meet that this was a corruption case, not a political one. He remarked that the PTI leadership was trying to give the impression that the 190 million pound case is a politically motivated case, which was wrong.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}