{
  "article_id": "2025-07-24_0e84eabab4618711414d566e999dd08f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-forms-committee-for-improving-civil-service-structure/",
    "retrieved_at": "2025-08-27T10:03:18.668Z"
  },
  "metadata": {
    "title": "PM forms committee for improving civil service structure",
    "author": null,
    "date_published": "2025-07-24T09:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 307,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 24 (APP): Prime Minister Shehbaz Sharif on Thursday formed a committee under the chairmanship of Minister for Planning Ahsan Iqbal to develop recommendations for aligning the civil services with modern-day requirements and improving the civil service structure. The prime minister directed the committee to present comprehensive reform-based recommendations after detailed consultations within one month. Presiding over a meeting regarding civil services reforms here, the prime minister directed to develop recommendations regarding merit-based recruitment of top talent, development of KPI-based performance targets for promotions, and improvement of the ACR (Annual Confidential Report) system and suggestions for effective alternatives. The recommendations should also include a plan to enhance officers' capacity through modern technology and systems, he said, stressing that recommendations must aim at laying the foundation for a sustainable system, ensuring improved governance, and establishing a continuous mechanism to align the civil services with contemporary demands. He said reforms that aimed to simplify the lives of ordinary citizens and make the civil service more people-friendly were among the top priorities of the government. The meeting was attended by Federal Ministers Ahsan Iqbal, Azam Nazeer Tarar, Ahad Khan Cheema, Sardar Awais Khan Leghari, Ali Pervaiz Malik, Advisor to PM Rana Sanaullah, Minister of State Bilal Azhar Kayani, Special Assistants Haroon Akhtar, Tariq Bajwa, Dr. Jehanzeb Khan (Secretary Apex Committee, SIFC), and other senior officials. During the briefing on civil service reforms, it was stated that suggestions were being developed following consultation on recruitment, training, performance evaluation, salary improvement, and promotions in the civil service. A comparative analysis of civil service reforms in other countries of the region with Pakistan was also presented. The meeting was informed that the final recommendations will focus on improving governance, enhancing the quality of life of the common citizen, and ensuring merit-based recruitment of top talent at the core of civil service reforms.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}