{
  "article_id": "2025-07-24_4d738bacfab13a550cf4a4a34452082a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/naqvi-pays-tribute-to-martyred-soldiers-in-mastung-operation/",
    "retrieved_at": "2025-08-27T10:01:44.777Z"
  },
  "metadata": {
    "title": "Naqvi pays tribute to martyred soldiers in Mastung operation",
    "author": null,
    "date_published": "2025-07-24T15:51:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 231,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 24 (APP): Federal Interior Minister Mohsin Naqvi has paid glowing tribute to Major Zeeyyad Salim Awal and Sepoy Nazam Hussain, who embraced martyrdom while courageously fighting against terrorists in Mastung, Balochistan. In a statement issued here on Thursday, the Interior Minister expressed heartfelt condolences to the bereaved families and praised the fallen soldiers for their unwavering courage and selfless devotion to duty. \"Major Zeeyyad Salim Awal and Sepoy Nazam Hussain displayed exceptional bravery in the line of duty and succeeded in eliminating three terrorists before making the ultimate sacrifice,\" he said. Mohsin Naqvi emphasized that the two soldiers laid down their lives for the security and sovereignty of the country and were granted the highest honour in the form of martyrdom. \"Their sacrifice will never be forgotten. Shaheed Major Zeeyyad Salim Awal and Sepoy Nazam Hussain will live forever in our hearts,\" he stated. The Minister noted that the nation owes its peace and stability to the blood of its martyrs. \"The entire country is proud of the supreme sacrifices rendered by our brave sons. They have written a new chapter of heroism in the fight against terrorism,\" he added. Naqvi reiterated the government's firm resolve to continue the war against terrorism until the last terrorist is eliminated. He assured the families of the martyrs that the nation stands shoulder to shoulder with them in their hour of grief.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}