{
  "title": "Overloading of public transport raises safety concerns in DIKhan",
  "link": "https://www.app.com.pk/domestic/overloading-of-public-transport-raises-safety-concerns-in-dikhan/",
  "date_published": "2025-08-03T20:27:10+05:00",
  "source": "APP",
  "content": "DERA ISMAIL KHAN, Aug 03 (APP): Widespread violations of transport laws continue across Dera Ismail Khan, as public transport vehicles particularly coasters and flying coaches, operate with illegally installed extra seats, causing severe discomfort to passengers. The unchecked practice persists under the watch of the district administration and Regional Transport Authority (RTA), drawing criticism from citizens and commuters alike.\n\nThese violations are commonly observed on routes from General Bus Stand, Bannu Adda, Tank Adda, Paroa Adda, and adjoining areas such as Paharpur and Kulachi. Transporters, in a bid to increase profits, have modified vehicles to carry more passengers than permitted, often cramming individuals into tightly packed and unsafe conditions.\n\nPassengers travelling on these routes voiced their frustrations. “We are packed like goods. There’s hardly any space to sit or even breathe properly,” said Asad Imran, a daily commuter from Rangpur.\n\nAnother passenger, Kubra Bibi, travelling with her children, stated, “The heat, lack of space, and prolonged travel in these conditions is unbearable. It’s especially dangerous for women and children.”\n\nCommuters criticized the authorities for turning a blind eye. “Where are the transport inspectors? Why is no one stopping these violations?” asked Malik Saleem, a traveler from Paroa.\n\nCivil society members have also expressed alarm, urging the district administration and RTA to launch a sustained and transparent crackdown. They emphasized that ignoring the issue not only endangers lives but also undermines public trust in government institutions.\n\nThe public has demanded immediate and effective enforcement of transport laws, regular inspections, and strict penalties for violators to ensure safe, legal, and respectful travel conditions for all passengers.",
  "retrievedAt": "2025-08-03T15:42:21.355Z"
}
