{
  "title": "SCCI president emphasizes dialogue to address tax concerns of hotels, marriage halls",
  "link": "https://www.app.com.pk/domestic/scci-president-emphasizes-dialogue-to-address-tax-concerns-of-hotels-marriage-halls/",
  "date_published": "2025-08-03T20:27:10+05:00",
  "source": "APP",
  "content": "SARGODHA, Aug 03 (APP): Sargodha Chamber of Commerce and Industry President Khawaja Yasir Qayyum has stressed the importance of dialogue, mutual understanding, and cooperation for resolving issues faced by the business community.\n\nHe made these remarks while addressing a special event held in honour of Commissioner Punjab Revenue Authority, Rai Naveed Ahmad, attended by a large number of restaurant and banquet hall owners  on Sunday.\n\nIn his address, Khawaja Yasir Qayyum highlighted that the hospitality sector, particularly marriage halls and restaurants, is facing several challenges related to taxation. He urged the Punjab Revenue Authority to play a key role in resolving these issues to ensure that individuals involved in this sector can earn their livelihood with dignity.\n\nDuring the event, owners of hotels and marriage halls  shared their concerns and challenges, calling for simplified procedures and fair policies to support their sector, which significantly contributes to the local economy.\n\nCommissioner PRA Rai Naveed Ahmad assured the participants that the goal of his department is not to harass businesses unnecessarily.\n\nHe emphasized that anyone operating within the legal framework would be fully protected.\n\nHe added that matters related to taxes can be resolved through mutual dialogue and understanding, and expressed his desire to see the restaurant and banquet hall sector flourish, particularly in cities like Sargodha, where many people depend on this sector for employment.\n\nChairman of the Standing Committee on Restaurants and Banquet Halls, Rao Jawad Tariq, also addressed the gathering and shed detailed light on the specific issues faced by the sector.\n\nThe event concluded with Senior Vice President Mian Muhammad Imran thanking the honorable guests and reaffirming the Chamber’s commitment to resolving the issues of its members, traders, and citizens through the platform of the Sargodha Chamber of Commerce and Industry.",
  "retrievedAt": "2025-08-03T15:43:18.261Z"
}
