{
  "article_id": "2025-06-26_38a855c559b46bc4b2a2530ce763948c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nab-prosecutor-given-time-for-preparation-in-appeals-of-pti-founder-bushra-bibi/",
    "retrieved_at": "2025-08-27T16:30:36.542Z"
  },
  "metadata": {
    "title": "NAB prosecutor given time for preparation in appeals of PTI founder, Bushra Bibi",
    "author": null,
    "date_published": "2025-06-26T15:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 397,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 26 (APP): A division bench of Islamabad High Court (IHC) on Thursday granted time to NAB's special prosecutor for preparation in appeals seeking suspension of sentences of PTI founder and Bushra Bibi in 190 million pounds reference. During the hearing of the 190 million pounds case, Acting Chief Justice Islamabad High Court Justice Sarfaraz Dogar said while talking to the PTI lawyer that you want to put pressure on me. A two-judge bench comprising Acting Chief Justice Sardar Sarfaraz Dogar and Justice Muhammad Asif heard the appeals. Special Prosecutor Javed Arshad Advocate and Rafe Maqsood appeared in the court on behalf of National Accountability Bureau (NAB). On this occasion, the three sisters of the founder of PTI, Chief Minister Khyber Pakhtunkhwa Ali Amin Gandapur, Opposition Leader Omar Ayub, Senator Shibli Faraz, Faisal Javed and other party leaders were also present in the court. During the hearing, Special Prosecutor Javed Arshad Advocate told the court that he was appointed as the prosecutor in this case yesterday. He also presented the notification of appointment in the court and said that this is an important case and he should be given 4 weeks to understand it so that he can read the record and appear in court with full preparation. He said that he has never been a part of this case, so giving him a proper opportunity would be in line with the requirements of transparency. PTI founder's lawyer Barrister Salman Safdar took the stand that the NAB is continuously adopting the method of postponement. This case is not ordinary, but a woman has also been punished in it and the general attitude of the courts is that women's punishment is suspended. We should be given a chance to start our case so that we can present arguments, he said. During the hearing, the Acting Chief Justice warned the lawyers and other people present in the court to take care of the decorum of the court and not put unnecessary pressure on the court. Addressing Barrister Salman Safdar, the Acting Chief Justice said that you want to put pressure on me. The court said that the next date of hearing will be given in the written order. The court accepted the request of NAB for time to prepare the case and adjourned the hearing. The court directed that the parties should start arguments at the next hearing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}