{
  "article_id": "2025-06-26_4f998a47aad461536210d289263f1a0f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/technology-sector-is-engine-of-rapid-development-yousaf-raza-gilani/",
    "retrieved_at": "2025-08-27T16:30:37.236Z"
  },
  "metadata": {
    "title": "Technology sector is engine of rapid development: Yousaf Raza Gilani",
    "author": null,
    "date_published": "2025-06-26T15:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 584,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "PESHAWAR, Jun 26 (APP): Chairman Senate Syed Yousuf Raza Gillani said on Thursday that technology sector is the engine of rapid development, it is a transformative force for every sector of our economy and Pakistan's digital economy has shown remarkable growth, with IT exports surging and projected to reach $ 5 billion in the current year. He was presiding presided over the convocation of Ghulam Ishaq Khan Institute of Engineering and Technology at Topi, district Swabi as a chief guest, conferring degrees on 548 graduates in which 470 were BS students, 65 MS and 13 PhD scholars. The convocation was attended by students, their parents, and heads of various universities and academic staff of GIK Institute. Addressing on the occasion, Gillani said higher education is the very cornerstone of our nation's future, as a nation, we have embraced the reality that our transition to a knowledge-based economy depends not on traditional assets, but on building human and intellectual capital for sustainable growth. He said that we are living through the Fifth Industrial Revolution, where Artificial Intelligence, machine learning, and the internet are not just emerging concepts but are actively reshaping industries. \"I have long held that our national policies must be oriented towards preparing our future generations for this revolution,\" said Gillani who had also remained prime minister of the country. \"The Government's commitment is reflected in initiatives like the Digital Nation Pakistan; and the establishment of special technology zones to drive growth and investment in this critical sector.\" He said that the landscape of education itself is evolving, digital tools and e-learning are making education more accessible and inclusive and Pakistan needs energy, passion, tolerance, determination and talent. He lauded the graduates and their parents while highlighting the pivotal role of educated youth in the economic development of the country, encouraging them that they should come forward to use their knowledge and skills to induce result-oriented society and strengthen the economy. He directed to graduating students that their potential contribution would have a significant impact on the country's progress and economic prosperity. Engr Salim Saifullah Khan, President of GIK Institute parent body, Society for Promotion of Engineering Sciences and Technology in Pakistan (SOPREST) paid rich tributes to founder of the institute and former president of Pakistan, late Ghulam Ishaq Khan late, Dr A Q Khan, father of Pakistan's nuclear program, who was GIK Institute project director and other founding members. Prof Dr Fazal Ahmad Khalid, Rector GIK Institute said that universities are power of knowledge and latest technological breakthroughs and innovation in the field of science and technology has changed the world's landscape and GIK has always been involved in research work since its inception in 1993. Prof Dr SM Hasan Zaidi, Pro-Rector academics said said that GIK Institute has remained a beacon of science and technology, innovation and result-oriented research, while working to further strengthen academic-industry collaboration. Munir Iqbal and Jamshad Bashir were two MS graduates who received gold medals. Ghulam Ishaq medal for best academic performance among all undergraduates was awarded to Muhammad Ramiz Saud and Quaid-e-Azam medal to Said Basim Mehmood. Faculty-based gold medals were awarded to Muhammad Ramiz Saud, Shoaib Nasir, Muhammad Arsal, Duaa Khan, Sardar Muhammad Abdullah Khan, Haris Zeb, Muhammad Nofil Bin Mehar, Wajee-ul-Hassan, Muhammad Farhan and Muhammad Ali. The scholars who completed their PhD were: Sundus Khushnood, Muhammad Umar, Shafiq-Uz-Zaman, Muhammad Ehtisham Hassan, Usama Arshad, Hafiz Muhammad Zeeshan Yousaf, Saba Tariq, Mehboob Ul Haq, Sajid Khan, Asif Ullah, Babar Ashfaq, Atif Muzaffar and Hafiz Muhammad Rizwan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}