{
  "article_id": "2025-06-26_9c91b24e5d7a03573c51cb0cbb7b4d72",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kashmiri-delegation-seeks-end-to-indias-systematic-torture-unchecked-prison-brutalities-in-kashmir/",
    "retrieved_at": "2025-08-27T16:28:54.585Z"
  },
  "metadata": {
    "title": "Kashmiri delegation seeks end to India’s systematic torture & unchecked prison brutalities in Kashmir",
    "author": null,
    "date_published": "2025-06-26T10:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 414,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 26 (APP):On the eve of International day against torture, the Kashmiri delegation organised a protest cum awareness camp at Geneva outside United Nations at Broken Chair to apprise the world about the India's systematic torture of Kashmiris in occupied territory of Jammu and Kashmir. The participants of the protest demonstration held banners and placards in their hands inscribed with slogans calling for an end to torture in Kashmir-a UN recognized disputed territory where the Indian state has been using torture as state tool to suppress peoples legitimate struggle for right to self determination, received a press release from Geneva here on Thursday. Referring to different forms of abuses taking place in the region, the speakers said that human rights violations in Jammu and Kashmir range from mass killings, enforced disappearances, torture, rape and sexual abuse. \"Torture has been used routinely by all the security forces operating in Kashmir as a systematic mechanism to create a fear psychosis amongst the Kashmiri populace\", they added. Citing media reports, they said that the Indian state was using torture as an instrument to crush Kashmiris' ongoing struggle. Referring to Jammu Kashmir Coalition of Civil Society's report, which produced documented evidence about the dangerous torture techniques employed against Kashmiri prisoners, they said that Prisoners in Indian occupied Kashmir have been subjected to abuse and torture, including \"electrocution, water-boarding, sleep deprivation and sexualised torture\". Terming custodial torture as one of the cruelest forms of human rights abuse, they pointed out that hundreds of Kashmiris have died in custody as a result of the India's prison brutality that goes unchecked and often unnoticed at international level. Torture, they mentioned, has become a state-sanctioned tool of systematic oppression used to control the region's majority community that has refused to accept government's diktats. They observed that the world has turned a blind eye to India's systematic torture against Kashmiris despite growing calls of justice for torture victims and holding Indian government accountable. While torture and custodial deaths continue to haunt Kashmiris, the speakers said that immunity enjoyed by the Indian forces under a regime of draconian laws has dimmed prospects of free and fair justice for the victims of extra-judicial killings. Of those who spoke on the occasion included the head of delegation Mr. Altaf Hussain Wani, Ghulam Muhammad Safi Convenor APHC , Sardar Amjad yousaf Executive Director KIIR, Chadary parveez Ashraf , Syed Faiz Naqashbandi , Mrs Shamim Shawl, Dr. Saira Shah, Naila Altaf Kani and Ms Mehr ur Nisa.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}