{
  "article_id": "2025-06-26_d1c7b9c5f4b0e66b35f80ce9b9328470",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nationwide-cricket-talent-hunt-trials-from-june-27/",
    "retrieved_at": "2025-08-27T16:29:20.654Z"
  },
  "metadata": {
    "title": "Nationwide ‘Cricket Talent Hunt’ trials from June 27",
    "author": null,
    "date_published": "2025-06-26T08:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 214,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 26 (APP):The Prime Minister Youth Program (PMYP) is poised to launch cricket talent hunt trials from Quetta on June 27, marking a crucial step in identifying and nurturing young cricketing talent nationwide. The Cricket Talent Hunt Program is a landmark initiative in the government's comprehensive strategy to promote youth empowerment, encompassing sports development, education, employment, and digital opportunities. The trials aim to scout for exceptional young cricketers who can represent Pakistan at the international level. According to an official, in collaboration with Lahore Qalandars, talented youngsters will get the opportunity to showcase their skills and compete for coveted spots in top-tier teams. The trials will be conducted in various cities, providing a platform for aspiring cricketers from diverse backgrounds to demonstrate their abilities. The talent hunt will include both male and female categories, with regional trials held at major venues across Pakistan. Finalists will be included in the Player Development Program, offering training, grooming, and exposure at national and international levels. The Prime Minister Youth Program's cricket talent hunt initiative is expected to inject fresh talent into Pakistan's cricketing landscape, fostering a new generation of cricket stars. With its focus on grassroots development, the program promises to unearth hidden gems and provide them with the necessary support to excel in the sport.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}