{
  "article_id": "2025-06-26_0b0cddbcfbd616c1131b0465361bf135",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-reaffirms-commitment-to-eradicate-torture-uphold-human-dignity-fo/",
    "retrieved_at": "2025-08-27T16:29:00.666Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms commitment to eradicate torture, uphold human dignity: FO",
    "author": null,
    "date_published": "2025-06-26T08:03:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 265,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 26 (APP): As the world observes the International Day in Support of Victims of Torture on Thursday, Pakistan reiterated its solidarity with the victims of torture worldwide and reaffirmed its continued commitment to eradicating torture and upholding human dignity. \"Islam upholds the sanctity and dignity of every human being. Any act of torture or cruel, inhuman, or degrading treatment is incompatible with the values of justice, mercy, and compassion that are at the core of Islamic teachings,\" the Foreign Office spokesperson said in a message on the Day. He said that guided by these values and its international obligations, Pakistan remained committed to eradicating torture and strengthening protections for all individuals. \"Legal reforms, institutional safeguards, and oversight mechanisms continue to be strengthened by Pakistan to ensure accountability and uphold the rule of law. Measures are also being taken to provide victims with medical, legal, and psycho-social support,\" he remarked. The spokesperson said that Pakistan remained gravely concerned at the widespread and systematic use of torture as an instrument of oppression in situations of foreign occupation. He highlighted that the people of the Occupied Palestinian Territory and Indian Illegally Occupied Jammu and Kashmir (IIOJK) continued to be subjected to the worst forms of torture and other cruel, inhuman, or degrading treatment or punishment by the occupying powers to suppress their right to self-determination. \"On this day, Pakistan reiterates its call on the international community to condemn the crimes of these occupying powers and to hold them accountable, in addition to helping end the plight of the victims of their torture and oppression,\" he added.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}