{
  "article_id": "2025-06-26_d0c2f7904ec9e9073e435ecceb41c857",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-committee-calls-for-gender-reforms-amid-concerns-over-global-gender-gap-ranking/",
    "retrieved_at": "2025-08-27T16:31:02.211Z"
  },
  "metadata": {
    "title": "NA committee calls for gender reforms amid concerns over global gender gap ranking",
    "author": null,
    "date_published": "2025-06-26T12:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 303,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 26 (APP): The Special Committee on Gender Mainstreaming of the National Assembly, chaired by Dr. Nafisa Shah, MNA, has voiced serious concern over Pakistan's ranking at 148 in the Global Gender Gap Index Report 2025. The Committee stressed that while flaws in data collection and reporting may have influenced the ranking, the underlying gender disparities demand urgent attention and policy action. During a meeting held in connection with the upcoming International Day of Parliamentarism on June 30, the Committee unanimously passed a resolution highlighting the need for concrete steps to achieve gender equality in the country. The day, celebrated globally in line with a 2018 United Nations General Assembly resolution, honors the role of parliaments in promoting peace, development, and democracy. The resolution aligns with the Inter-Parliamentary Union's 2025 campaign titled \"Achieving Gender Equality: Action by Action,\" focusing on three core themes: Promoting parity in parliament and politics Encouraging gender-sensitive institutions Combating gender-based violence and discrimination The Committee expressed dismay over the non-implementation of its earlier recommendations, urging the Federal Government to establish a Cabinet Committee on Gender Mainstreaming. This, it stated, would give political ownership to women's rights at the federal level and ensure the inclusion of women parliamentarians in budget-making and development planning processes. To advance legislative reform, the Committee also constituted a Sub-Committee tasked with reviewing family and inheritance laws in the Islamabad Capital Territory (ICT). The members of the Sub-Committee are: Terms of Reference (TORs) for the Sub-Committee include reviewing and suggesting amendments to the following laws: 1. Dowry and Bridal Gifts (Restriction) Act, 1976 The Sub-Committee is expected to submit its report within one month. The meeting was attended by several parliamentarians, including Mr. Aqeel Malik, Ms. Shaista Pervaiz, Ms. Shahida Rehmani, Senator Rubina Qaim Khani, Senator Khalida Ateeb, and officials from relevant ministries and divisions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}