{
  "article_id": "2025-06-26_b7eef695007451f9081831a13af20d14",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-passes-finance-bill-2025-with-majority-votes/",
    "retrieved_at": "2025-08-27T16:30:34.323Z"
  },
  "metadata": {
    "title": "NA passes Finance Bill 2025 with majority votes",
    "author": null,
    "date_published": "2025-06-26T16:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 769,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 26 (APP): The National Assembly on Thursday passed the Finance Bill 2025 after a clause-by-clause consideration, incorporating specific amendments. Minister for Finance and Revenue, Senator Muhammad Aurangzeb moved the motion for consideration of the Finance Bill, 2025 to give effect to the financial proposals of the federal government for the year, commencing on July 1, 2025. The motion was passed with majority vote which led to the passage of Finance Bill-2025 after clause-by-clause reading and adopting amendments after due process of voting. All the amendments presented by the opposition were rejected. The total outlay of the federal budget for the fiscal year 2025-26, is Rs 17.573 trillion. The budget outlines a comprehensive fiscal plan for building competitive economy focusing to enhance exports, improve foreign exchange reserves, reduce fiscal imbalances and encourage economic productivity. The budget projected economic growth rate at 4.2% for the fiscal year 2025-26. The inflation is expected to remain at 7.5%, while the fiscal deficit has been estimated at 3.9% of GDP and the primary surplus is projected to reach 2.4% of GDP. The revenue collection target by Federal Board of Revenue (FBR) has been set at Rs 14,131 billion, showing an increase of 18.7 percent compared to fiscal year 2024-25. The federal excise duty has been calculated at Rs 8,206 billion while the non -tax revenues are project at Rs 5,147 billion. The net income of federal government would be Rs11,072 billion whereas its expenditures have been estimated at Rs17,573 billion, out of which Rs8,207 billion would be spent on mark up payments. The current expenditures of federal government were Rs.16,286 billion. As many as Rs1,000 billion have been earmarked for the Public Sector Development Programme while total Annual Development Plans (ADPs) exceeds Rs 4,000 billion. Since defence of the country was top priority of the government and Rs 2,550 billion would be provided for it whereas Rs 971 billion were kept for civil administration expenditures; Rs 1,055 billion for pension expenditures and Rs 1,186 billion for subsidy on electricity and other sectors. Likewise, Rs 1,928 billion would be provided for BISP grants, and Azad Jammu and Kashmir, Gilgit-Baltistan and newly merged districts of Khyber Pakhtunkhwa. The government intended to increase the coverage the flagship initiatives of Benazir Income Support Programme under which the number of beneficiary families will be increased to 10 million. The government has increased the allocated amount for this by 21% to Rs 716 billion. The budget raised salaries of employees from Grade 1-22 by 10 percent and enhanced pension of retired employees by 7 percent. The disparity reduction allowances have also been raised by 30 percent for eligible employees while special relief allowances for military officers and soldiers/JCOs has also been provided in the budget. Meanwhile, many tax and relief measures were introduced in the budget for the fiscal year 2025-26 as the income tax rate for those earning upto Rs 3.2 million were slashed. The government reduced income tax rate for those earning between Rs 0.6 million and Rs1.2 million annually to just 1 percent. As per the finance bill the digital sales tax on services would remain within the jurisdiction of provinces, while the GST tax on solar panels would be charged at 10%. It would be applicable on the imported parts of solar panels that constitute 46 percent. Hence solar panels' prices would increase by only 4.6 percent. Tax will not be imposed on pension commutation or gratuity however, only those individuals receiving pensions above Rs 10 million would be taxed. Those over 75 years of age are fully exempted The government has proposed imposing sales tax on the import of raw cotton and yarn, to reduce the price gap between imported and local products and support the domestic agriculture sector. The new tax measures have been carefully designed to avoid burdening the common man. Instead, the focus is on high-income segments and wealthier businesses. Export-oriented industries have been largely exempted from new taxes to preserve global competitiveness. In terms of income tax reforms, tax rate on inter-corporate dividends derived from mutual funds and similar instruments has been raised from 25% to 29%, bringing it in line with other sources of income The government also announced upcoming policy measures, including a new Industrial Policy, progress on the Electric Vehicle (EV) Policy, and comprehensive energy sector reforms aimed at achieving sustainable growth. It is pertinent to mention here that the budget for fiscal year 2025-26 is a balanced plan focused on providing public relief, promoting industry, curbing government expenditures, enhancing revenues, and ensuring fair tax enforcement-all aimed at fostering sustainable growth and driving an export-led economy.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}