{
  "article_id": "2025-08-04_fc19d96b53ecc305972ddad288783967",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cjp-visits-shc-emphasizes-citizen-centric-judicial-infrastructure/",
    "retrieved_at": "2025-08-10T10:13:17.142Z"
  },
  "metadata": {
    "title": "CJP visits SHC, emphasizes citizen-centric judicial infrastructure",
    "author": null,
    "date_published": "2025-08-10T15:09:50+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 284,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 04 (APP): The Chief Justice of Pakistan, Justice Yahya Afridi, accompanied by Justice Junaid Ghaffar, Chief Justice of the High Court of Sindh, and Judges Justice Zafar Rajput and Justice Iqbal Kalhoro, held a meeting today with the District and Sessions Judges of the Karachi Division at the Sindh High Court building. According to a press release issued here Monday, the Chief Justice of the High Court of Sindh apprised the Chief Justice of Pakistan regarding the proposed construction of a state-of-the-art Judicial Complex in Karachi, comprising 125 fully equipped courts along with all requisite amenities. The project is intended to address the growing needs of the judicial system in Karachi and is expected to commence shortly. The Chief Justice of Pakistan welcomed the initiative and underscored the importance of sustainable, scalable, and forward-looking infrastructure planning. He stressed that future forecasting must be integrated into the design to ensure the long-term viability of the complex. In this regard, he recommended that structured consultations be held with all relevant stakeholders-including judges and members of the district bar-to gather practical input keeping in view the technicalities so that a refined proposal may be placed before the government for timely execution. Highlighting the ongoing efforts to automate Pakistan's justice sector, the Chief Justice further emphasized that the development of judicial infrastructure must follow a citizen-centric approach. In this context, he called for the inclusion of a modern Facilitation Centre within the Judicial Complex to assist litigants and the public at large, ensuring improved access to information and services focused on facilitating litigants, lawyers and general public. The visit reaffirmed the judiciary's commitment to institutional development, participatory planning, and the delivery of accessible and efficient justice.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}