{
  "article_id": "2025-08-04_639ef74c2b58f59a09979f3824ade362",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-reaffirms-unflinching-support-to-kashmiris-pm/",
    "retrieved_at": "2025-08-10T10:11:30.203Z"
  },
  "metadata": {
    "title": "Pakistan reaffirms unflinching support to Kashmiris: PM",
    "author": null,
    "date_published": "2025-08-10T15:09:50+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 503,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 04 (APP): Prime Minister Muhammad Shehbaz Sharif said Pakistan reaffirmed its unflinching stance and moral, political and diplomatic support to its Kashmiri sisters and brothers till the realization of their inalienable right to self-determination. In a message on 'Youm-e-Istehsal' observed on August 5, he said, \"On this Youm-e-Istehsal, the Government of Pakistan and I reaffirm the unwavering solidarity of the Pakistani people with our Kashmiri sisters and brothers.\" \"We reiterate our strongest condemnation and rejection of India's illegal and unilateral actions taken since 5 August 2019 aimed at altering the demographic structure, and political landscape of Illegally Indian Occupied Jammu & Kashmir (IIOJK), in complete defiance of international law, norms and principles, as well as the relevant resolutions of the UN Security Council,\" he added. He said, \"Youm-e-Istehsal is a sobering reminder of India's rejection of peace and stability and its pursuit of a policy of brutality and unilateralism. The continued denial of the basic human rights, dignity and identity of Kashmiris that live under India's illegal and unconscionable occupation is a recipe for regional instability.\" The prime minister said, \"Realizing that it's illegal occupation cannot be sustained by any other means, India has doubled down on a nearly eight-decade regime of state terrorism and oppression.\" \"The brave Kashmiri people have endured this brutality with incredible dignity. Today is a day for all Pakistanis, and all peace-loving people of the world, to salute the unwavering resilience and heroic spirit of sacrifice of the Kashmiri people,\" he remarked. \"Efforts to silence the genuine leadership of the Kashmiri people are part of the wider hegemonic and extremist agenda that informs India's illegal occupation of Jammu & Kashmir. The imprisonment of Kashmiri leaders and activists, including Shabbir Ahmed Shah, Muhammad Yasin Malik and Masarrat Alam Bhatt will never dim the resolve of our Kashmiri sisters and brothers,\" he said adding, \"The continued defiance of Kashmiris in an environment of unending intimidation across the illegal Indian occupation is further proof of the indomitable courage of the Kashmiri people.\" He said, \"India's illegal occupation of Jammu & Kashmir remains the defining conflict in South Asia and the reason for India's continued rogue behavior. India's unprovoked aggression against Pakistan in May 2025, and its swift and comprehensive military defeat are only the latest evidence of the urgent need for the international community to ensure that resolution of the Jammu & Kashmir dispute becomes a global priority.\" \"Honouring the will and aspirations of the Kashmiri people, in accordance with UN Security Council resolutions provides the only path forward towards lasting peace in South Asia,\" he stressed. The prime minister said, \"On this day, I wish to reiterate that seeking a just resolution of the Jammu & Kashmir dispute remains a key pillar of our foreign policy and call upon the international community to urge India to halt its human rights crimes in IIOJK; reverse its unilateral and illegal actions of 5 August 2019; repeal the draconian laws; and implement the UN Security Council resolutions on Jammu & Kashmir.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}