{
  "article_id": "2025-08-04_bdc2de488a106ccb23a81cd411196689",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/youm-i-istehsal-aphc-reaffirms-resolve-against-indian-occupation/",
    "retrieved_at": "2025-08-10T10:13:46.996Z"
  },
  "metadata": {
    "title": "Youm-i-Istehsal: APHC reaffirms resolve against Indian occupation",
    "author": null,
    "date_published": "2025-08-10T15:09:50+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 475,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 04 (APP):Senior leader of the All Parties Hurriyat Conference (APHC) and former Information Secretary Imtiaz Wani on Monday said that August 5 is one of the darkest and most painful turning points in the modern history of Jammu and Kashmir. He described the day as a symbol of India's aggressive and unlawful actions aimed at dismantling the disputed region's constitutional, legal, and historical status. In a statement issued on the eve of Youm-i-Istehsal (Exploitation Day), Wani condemned the Indian government's move to revoke Articles 370 and 35A, which granted Jammu and Kashmir limited autonomy under the Indian constitution. He stated that the revocation was a unilateral, unconstitutional, and illegal step carried out under the Modi government's Hindutva ideology. \"This act was not only an attack on Kashmir's identity but a blatant violation of international law, United Nations resolutions, and universally recognized human rights,\" Wani said. The APHC leader said the subsequent bifurcation of the region into two union territories under New Delhi's direct control reflected India's colonial ambitions and complete disregard for the aspirations and rights of the Kashmiri people. \"The aftermath of this decision effectively turned occupied Kashmir into an open-air prison,\" he added. Over one million Indian troops were deployed across towns and villages, transforming civilian spaces into militarized zones. Fundamental political, civil, religious, and social rights were suspended. Press freedom, internet access, and independent journalism were harshly restricted-conditions not seen in any functioning democracy. He noted that thousands of Kashmiri youth were arrested without trial and transferred to distant prisons in India. Government employees were dismissed for their political beliefs, and large-scale issuance of domicile certificates to non-residents was carried out to forcibly alter the region's demographic makeup-an act that violates the Geneva Conventions and UN Charter. Wani emphasized that these actions amounted to a deliberate attempt to erase the cultural identity, political will, and geographic integrity of Kashmiris. Reaffirming APHC's commitment to the right to self-determination, Wani said, \"Kashmir's freedom movement is a peaceful, legal, and internationally recognized struggle. Our goal is clear-to secure the inalienable right of Kashmiris to decide their future through a UN-mandated plebiscite.\" He called upon the United Nations, Organisation of Islamic Cooperation (OIC), global human rights bodies, independent journalists, and civil society to take serious notice of the ongoing repression, human rights abuses, and India's demographic manipulation in the region. Wani also appealed to the people of Jammu and Kashmir, the diaspora community, and global supporters of human rights to observe Kashmir Exploitation Day*on August 5 through peaceful protests, demonstrations, and solidarity events. \"These efforts should send a clear message to India and the world that Kashmiris reject the illegal occupation and all actions stemming from it,\" he stated. \"Our resistance is grounded in truth and justice, and it will continue until we achieve our legitimate and internationally promised right to freedom,\" Wani concluded.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}