{
  "article_id": "2025-08-04_80fd451b8c5e98659736b6f72b3d85df",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/kashmiri-people-do-not-accept-indias-unilateral-actions-of-august-5-2019-abdul-rashid-lone/",
    "retrieved_at": "2025-08-10T10:13:49.608Z"
  },
  "metadata": {
    "title": "Kashmiri people do not accept India’s unilateral actions of August 5, 2019: Abdul Rashid Lone",
    "author": null,
    "date_published": "2025-08-10T15:09:50+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 362,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 04 (APP):Acting Chairman of Jammu and Kashmir Mass Movement, Abdul Rashid Lone, has declared August 5, 2019, as one of the darkest days in Kashmir's history, stating that India's unilateral and illegal actions cannot alter the disputed status of Kashmir. Talking to APP he said that the entire Kashmiri nation observes this day as a Black Day to reject the Modi government's unlawful actions and to reaffirm their demand for the fundamental right to self-determination. Abdul Rashid Lone stated that India's attempt on August 5, 2019, to change the legal status of the disputed territory of Jammu and Kashmir, with malicious intentions of bringing demographic changes to the occupied region, has turned the entire valley into the world's largest human prison, where all basic rights have been stripped, making the lives of citizens unbearable. The number of occupying forces has been alarmingly increased to forcibly impose these illegal actions on Kashmiris through military might, turning Kashmir into the world's largest militarized zone, where human rights violations are being committed on a massive scale. The Acting Chairman of Mass Movement clarified that the revocation of Articles related to Jammu and Kashmir's special status is contrary to the Indian Constitution, United Nations resolutions, the Geneva Convention, the will of the Kashmiri people, and international laws. The Indian Constitution itself states that Article 370 cannot be unilaterally revoked. The Kashmiri people reject such unilateral and illegal actions by India. He further stated that on August 5, marking six years of India's unlawful and unilateral actions in illegally occupied Jammu and Kashmir, the Black Day is being observed. He called upon the people of the occupied territory to observe a complete strike, civil curfew, and large-scale protest demonstrations on August 5 to make it clear to India and the world that Kashmiris reject these unilateral actions and demand only their right to self-determination, which India itself promised through United Nations resolutions. Expressing gratitude to the Government of Pakistan for officially declaring August 5 as Youm-e-Istehsal, he expressed hope that Pakistan would continue its support for the Kashmiri cause and keep exposing India's oppression, tyranny, and state terrorism in occupied Kashmir on the global stage.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}