{
  "article_id": "2025-08-04_be9d6d72e4a388fcc0fe3d260368b0d1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-wins-four-bronze-medals-at-ioi-2025-in-bolivia-a-milestone-achievement-on-the-global-stage/",
    "retrieved_at": "2025-08-10T10:13:06.876Z"
  },
  "metadata": {
    "title": "Pakistan wins four Bronze Medals at IOI-2025 in Bolivia: a milestone achievement on the global stage",
    "author": null,
    "date_published": "2025-08-10T15:09:50+05:00",
    "image_url": null,
    "categories": [],
    "word_count": 407,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 04 (APP): In a stellar display of skill and determination, Pakistan's national team clinched four bronze medals at the prestigious International Olympiad in Informatics (IOI) 2025, held in Bolivia from July 27 to August 3.Bolivia travel guide The team, comprising four brilliant young minds, Pakistan proudly ranked 32nd among 86 participating countries, outperforming many technologically advanced and developed nations, including Germany, Austria, Turkey, France, Italy, New Zealand, Spain, Finland, the Netherlands, Belgium, and Saudi Arabia, said a press release issued here on Monday. This achievement marks a significant leap forward for Pakistan, which last year ranked 46th with two bronze medals at IOI 2024 in Egypt. The Ministry of Federal Education and Professional Training, Government of Pakistan, had entrusted the Federal Board of Intermediate and Secondary Education (FBISE) with the responsibility of organizing Pakistan's annual participation in IOI-every year, a global competition that showcases the best young programming talent from around the world. In response to this national mandate, FBISE issued official notifications to all educational boards across the country, including the Inter Boards Coordination Commission (IBCC), in order to attract students from all streams including those from the Cambridge stream. The same was also notified to the Directorates of Education and FBISE-affiliated institutions. As a result, a total of 528 students from across Pakistan registered for the Pakistan Olympiad in Informatics (POI). FBISE successfully conducted two rigorous rounds of nationwide testing to identify and select the most outstanding young programmers. The first round of Pakistan Olympiad in Informatics (POI) was held at 12 examination centers across the country, including Lahore, Karachi, Quetta, Multan, Peshawar, Gilgit-Baltistan, Muzaffarabad, Rawalpindi, and Islamabad. After a tough competition, 25 students were shortlisted, culminating in the final selection of the top four performers. The following four shining stars represented Pakistan at International Olympiad in Informatics (IOI) 2025 and each secured a bronze medal, Muhammad Aneeq, Ghulam Junaid, Muhammad Saram and Ahmed Imran Malik. This landmark success underscores the merit-based, transparent selection process implemented by FBISE. It is a testament to the untapped potential and brilliance of Pakistan's youth in computer science and informatics. FBISE extended heartfelt congratulations to the students, their families, mentors, and partner institutions for their dedication and excellence that have brought international recognition and immense pride to the nation. This victory not only marks a milestone in Pakistan's journey in international informatics but also reflects the growing emphasis on STEM education and youth empowerment in the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}