{
  "title": "Shared networks, green energy key to unlocking Pakistan’s digital potential: CEO, Telenor",
  "link": "https://www.app.com.pk/national/shared-networks-green-energy-key-to-unlocking-pakistans-digital-potential-ceo-telenor/",
  "date_published": "2024-08-08T11:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP):Chief Executive Officer (CEO) of Telenor Pakistan Khurrum Ashfaque has underscored the critical role of shared network infrastructure and green energy initiatives in managing business costs and fostering innovation.\nDuring a panel discussion at the GSMA Digital Nation Summit he emphasized the necessity of collaboration and innovation to bridge the gap and unlock Pakistan’s economic potential through accelerated digital transformation.\nHe said, “By investing in shared network infrastructure and prioritizing green energy solutions, we can manage costs more effectively and drive the innovation needed to connect the unconnected, thus propelling Pakistan towards its digital aspirations.”\nAs Pakistan continues its journey towards becoming a digital nation, Telenor Pakistan’s initiatives in shared networks and green energy stand as pivotal components in achieving this vision.\nTelenor Pakistan has already made significant strides in reducing its carbon footprint. The company has implemented energy-efficient solutions, and reduced power consumption across its operations.\nThe company’s dedication to sustainability and innovation sets a benchmark for the industry, highlighting the transformative power of digital connectivity and environmental responsibility.\nThe GSMA’s also launched a report, “Realising Pakistan’s Aspiration to Become a Digital Nation,” which details Pakistan’s progress in mobile connectivity and smartphone.\nThe report highlights notable progress in mobile broadband coverage, with 81% of the adult population now living in areas covered by 3G or 4G networks, a significant rise from just 15% in 2010.\nAdditionally, smartphone ownership has surged to 63% by the end of 2023. Despite these achievements, only 23% of the population subscribes to mobile internet services, revealing a critical gap in connecting the unconnected.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:29:29.508Z"
}
