{
  "title": "Talal Chaudhry dismisses PTI founder’s apology offer as ‘face-saving attempt’",
  "link": "https://www.app.com.pk/national/talal-chaudhry-dismisses-pti-founders-apology-offer-as-face-saving-attempt/",
  "date_published": "2024-08-08T12:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP):Pakistan Muslim League-Nawaz (PML-N) Senator Talal Chaudhry on Thursday fired back at Pakistan Tehreek-e-Insaf (PTI) founder Imran Khan’s offer to tender a conditional apology for the May 9 incidents, terming it a “face-saving tactic” that comes too little, too late.\nTalking to a private news channel, Chaudhry slammed Khan’s attempt to justify the violent clashes that erupted on May 9, which resulted in widespread property damage and injuries to several individuals.\nThe PML-N leader demanded an unconditional apology from Khan, holding him squarely responsible for the chaos and destruction unleashed by his party’s supporters.\nHe said that the person who ‘confessed’ to the crime is now demanding evidence. Talal Chaudhry has revealed that Imran Khan’s own family and party workers were at the forefront of the May 9 violence.\nHe said that the PTI ‘desecrated’ military installations, sensitive buildings, and even attacked our national TV station and Parliament House.\nIt is time for Imran Khan to take responsibility and apologize sincerely, without conditions. Anything less would be an insult to the nation, he stressed.\nReplying a question, he vehemently demanded swift justice for the martyred and innocent civilians who lost their lives in the May 9 incidents.\nHe emphasized that the nation will not tolerate any further delays in bringing the perpetrators to book.\nChaudhry asserted that the government must take concrete steps to ensure that those responsible for the senseless violence are held accountable and punished accordingly.\nHe also called for a transparent and impartial investigation into the events, stressing that the families of the martyrs and the nation at large deserve to know the truth.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:29:50.954Z"
}
