{
  "title": "PM approves reform programme for easing of doing business, investment",
  "link": "https://www.app.com.pk/national/pm-approves-reform-programme-for-easing-of-doing-business-investment/",
  "date_published": "2024-08-08T17:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP):Prime Minister Shehbaz Sharif Thursday approved the launch of the largest reform programme of Ease of Doing Business in the history to attract business and investment in Pakistan.\nThe first digital registry of Pakistani laws and rules was initiated to promote business and investment.\nThe prime minister thanked the international institutions which expressed interest in funding the project.\nHe directed that agreements with the international institutions which were interested in funding of the project, should be finalized.\nHe especially thanked the American development partners for their interest in assistance for the implementation of the agenda of economic reforms of the government.\nHe said besides meetings and consultations the relevant officials and ministries should ensure timely implementation of the policy measures.\nThe prime minister formed a special committee which would fully focus on the implementation of the project.\nHe said in the first phase of the project, sectors of high importance would be reformed. He thanked\nDr Scott Jacob for working on the project. He appreciated the Investment Board and other relevant departments for assistance in formulating a strategy for the project.\nBesides Dr Scott Jacob, federal ministers Muhammad Aurangzeb, Ahad Khan Cheema, Attaullah Tarar, Abdul Aleem Khan, Minister for State Shaza Fatima Khawaja, chief secretaries of the four provinces and high level officials attended the meeting.\nThe meeting was informed about the details of the project and the timeline for its implementation.\nIt was briefed that all the laws and rules for investment would be compiled together and digitized and all the unnecessary laws and rules which were hurdle in the way of investment and business would be abolished.\nBureaucratic hurdles would be removed and the time needed for registration and permits and other important steps would be reduced through digitization. These steps would not only create ease in doing business and making investments but would also put the private sector on fast pace progress.\nIt was further briefed that this project would bring Pakistan among those countries in the world which were most suitable for ease of doing business and investment.\nThe prime minister set the target that in the first part of the project, highly important laws and rules should be collected and compiled on priority basis by December 2024.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:28:41.268Z"
}
