{
  "title": "Ulema, Mashaikh may play pivtal role for promotion of tolerance & unity in society: Army Chief",
  "link": "https://www.app.com.pk/national/ulema-mashaikh-may-play-pivtal-role-for-promotion-of-tolerance-unity-in-society-army-chief/",
  "date_published": "2024-08-08T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): Chief of Army Staff (COAS), General Syed Asim Munir on Thursday urged the Ulema and Mashaikh (religious scholars) to work for promotion of tolerance and unity in the society in order to banish the tendency of extremism.\nAddressing the National Ulema Convention the COAS said the Pakistan Army was working hard to end strife from the motherland as per the commandments of the Allah Almighty as it was the greatest crime to Allah on the land.\nHe said, “We do not consider those as Pakistanis, who do not follow Shariat and Constitution.” The religious scholars should bring back moderation in the society and reject dissension, he added.\nThe western civilization and way of life was not the nation’s ideal, it should be proud of its own civilization, he said and mentioned the verses of Allama Dr Muhammad Iqbal’s poetry that stated Muslim ummah has no comparison to the western nations as the followers of the Holy Prophet (PBUH) are a special nation.\nThe COAS noted that the Pakhtun brothers and the people of Khyber Pakhtunkhwa had rendered great sacrifices in the war against terrorism and the Armed Forces along with the nation stand with them appreciating their efforts.\nFor more than 40 years, he said Pakistan has hosted millions of Afghan refugees, adding, “We are explaining to them not to oppose their neighbour, brotherly Islamic country and long time friend for the sake of subversive Kharijite (referring to TTP).”\nHe said the Kharijite were a great strife or fitnah in the society as Allama Iqbal said: “Education may be a fitna if it deviates you from Allah Almighty. Property, children, estates may also be temptation or strife if it diverse you from justice; and the sword for injustice will be a strife including the slogan of Takbeer.”\nHe said “We ask people to opt for peaceful protest for their demands.”\nThe COAS speaking on extremism said, “Allah says that there is no compulsion in religion. Crime and smugglers mafia are supporting terrorism.” The anarchy was spread through social media, he added.\nSpeaking on the honorable Prophethood, the Army Chief said, “No one has the courage to desecrate the glory of the Holy Prophet (SAW). If someone tries to create anarchy in Pakistan, by God, we will stand against him.”\nHe underscored that no power in the world could harm Pakistan because this country was built to last.\n“Millions of Asim Munir, millions of politicians and millions of scholars are sacrificed for Pakistan because the country is more important to us,” he said. “If you want to know the importance of the state, ask Iraq, Syria and Libya,” he added.\nHe queried that the inimical elements who used to claim that they had dumped the two nations theory into the Bay of Bengal, ‘where are they today?’\nThe Army chief said, “Partition of Kashmir is an incomplete agenda of Indo-Pak. My heart cries out over the atrocities in Palestine and Gaza. We should draw a lesson from Palestine that we have to protect ourselves and make Pakistan strong.”",
  "retrievedAt": "2025-08-11T04:29:06.172Z"
}
