{
  "title": "Inaugural meeting of Young Parliamentarians Forum held",
  "link": "https://www.app.com.pk/national/inaugural-meeting-of-young-parliamentarians-forum-held/",
  "date_published": "2024-08-08T18:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP):The inaugural meeting of the Young Parliamentarians Forum (YPF) was held on Thursday, presided over by Syeda Nosheen Iftikhar, President of YPF, and co-chaired by Rana Mashhood Ahmad Khan, Chairman of the Prime Minister’s Youth Program (PMYP).\nIn his inaugural address, Chairman PMYP’s Rana Mashhood Ahmad Khan provided an in-depth overview of the PMYP and explained the core components of the program, which were structured around the “4E’s”: Education, Employment, Engagement, and Environment.\nHe said that these four pillars were the focus of the ongoing youth-focused initiatives across the country.\nRana Mashhood in his keynote address said that Punjab was the pioneer province in developing a comprehensive Youth Policy in 2011 to empower youth, adding the Prime Minister’s Talent Program (PMTP) was initiated in 2013 during his tenure as the Deputy Speaker of the Punjab Assembly, further solidifying his commitment to youth development.\nThe Chairman highlighted several existing and upcoming initiatives under the PMYP including, PM Skill Development Programs (NAVTTC), PM Youth Laptop Scheme, Pakistan Education Endowment Fund, Youth Business and Agriculture Loan Scheme, PM Youth Internship Program, National Innovation Award, setting up of the PM National Youth Council, PM National Volunteer Corps, PM Digital Youth Hub, PM Talent Hunt, Youth Sports League, PM Sports Academies, Green Energy Solarization and PM Green Youth Movement to empower the future generation.\nThe Chairman PMYP also highlighted Pakistan’s leadership role on the international with the upcoming chairmanship of the 10th Commonwealth Youth Ministers meeting.\nMoreover, he informed the meeting that Pakistan is preparing to host the Commonwealth Heads of Government Meeting (CHOGM) in 2026, marking another milestone in its commitment to global youth collaboration.\nSyeda Nosheen Iftikhar, President of YPF, on the occasion, endorsed the initiatives outlined by the PMYP and expressed her commitment to facilitating and promoting these programs across all relevant platforms, ensuring that the objectives of youth empowerment are achieved effectively.\nThe meeting was also attended by other members of the YPF Board.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:29:01.211Z"
}
