{
  "title": "Australia-Pakistan partnership bolsters anti-human trafficking efforts",
  "link": "https://www.app.com.pk/national/australia-pakistan-partnership-bolsters-anti-human-trafficking-efforts/",
  "date_published": "2024-08-07T19:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Australia is stepping up to help Pakistan combat human trafficking with a new phase of support in latest initiative will strengthen vital systems and provide targeted training for investigators.\nPhase II of the Trafficking in Persons (TIP) Reporting Enhancement project, funded by the Australian Government, is set to boost Pakistan’s fight against human trafficking. This phase will upgrade the TIP hotline and referral system with better infrastructure and a secure data management system.\nThe project will also enhance the Federal Investigation Agency’s (FIA) capacity by providing targeted training, improving their ability to handle trafficking cases effectively.\nThe project was launched at a signing ceremony attended by Neil Hawkins, the Australian High Commissioner to Pakistan, and Geir Tonstol, the International Labour Organization (ILO) Country Director for Pakistan. The Director General of the FIA was also present.\nPhase II builds on the first phase’s achievements, which included setting up a Management Information System (MIS) for TIP reporting and creating a framework for a TIP facilitation center. The current phase aims to further strengthen the FIA and users of the TIP Reporting Portal.\nILO Country Director for Pakistan, Geir Tonstol expressed enthusiasm for the second phase, aiming to improve the capacities of provincial and federal entities in reporting trafficking cases.\nHe emphasized a comprehensive approach to tackling trafficking, focusing on prevention, protection, prosecution, participation, and partnerships.\nTonstol also highlighted the importance of enabling conditions like freedom of association to eliminate unacceptable work forms. By integrating fundamental labor rights, workers can voice their concerns and advocate for their rights collectively.\nAustralian High Commissioner to Pakistan, Neil Hawkins emphasized Australia’s commitment to combating human trafficking and modern slavery in Pakistan.\nHe stated that Australia’s support is about safeguarding human rights, advancing development, and enhancing Pakistan’s global standing. Partnering with the ILO and FIA, the goal is to create a stronger, more coordinated response to protect vulnerable individuals.\nThe project aims to improve both domestic and cross-border efforts against human trafficking and smuggling. By enhancing communication and collaboration among relevant authorities, the strengthened TIP reporting system will play a crucial role in preventing trafficking and protecting vulnerable populations.",
  "retrievedAt": "2025-08-11T04:30:15.321Z"
}
