{
  "title": "Info ministry organises quiz show among students to celebrate Independence Day",
  "link": "https://www.app.com.pk/national/info-ministry-organises-quiz-show-among-students-to-celebrate-independence-day/",
  "date_published": "2024-08-08T10:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP): Ministry of Information and Broadcasting Islamabad organized a quiz Show in commemoration of 78th Independence Day Celebrations of Pakistan here on Thursday at Information Service Academy.\nA large number of students, teachers from different government schools of ICT and officials from the Ministry of Information and Broadcasting, and Information Service Academy had also participated in the quiz show.\nCash prizes were distributed among the winners and runner up students teams of the quiz show competition.\nExecutive Director General Information Service Academy Mr. Arshad Munir distributed the cash prizes and appreciation certificates among runner up team of IMCB G/9-4 and the winner team of IMCG F/10-2.\nSpeaking on the occasion as Chief Guest, Arshad Munir said that I hope the participating students had learn a lot and got more knowledge about their country’s history.\nHe also shed light on the sacrifices of our forfathers rendered for getting a separate homeland.\nPakistan, he said, was established on14 August, 1947 when Quaid-i-Azam made a history by achieving a separate country on the basis of a two nation ideology.\n“Today’s event shows that our history is based on research, he said adding that it also ensures that our coming new generations were well aware of the Pakistan’s history”.\nHe said that we are an intelligent nation and achieving our status in the fields of sports, IT, education and other sectors across the world.\nToday’s participation of students in the Quiz Show and knowledge about their history proved the new generations commitment and interest with their homeland, he remarked.\nHe also congratulated the students and teachers of FDE Schools and Colleges, and the Ministry of information and Broadcasting for holding this outstanding event.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:29:34.175Z"
}
