{
  "title": "Quiz contest held among students at ISA to mark Independence Day",
  "link": "https://www.app.com.pk/national/quiz-contest-held-among-students-at-isa-to-mark-independence-day/",
  "date_published": "2024-08-08T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): The Ministry of Information and Broadcasting, Islamabad on Thursday organized a Quiz Show in commemoration of 78th Independence Day Celebrations of Pakistan here at the Information Service Academy (ISA).\nA large number of students, teachers from different government schools of ICT and officials from the Ministry of Information and Broadcasting, and Information Service Academy attended the event.\nSpeaking on the occasion, Executive Director General ISA Arshad Munir expressed confidence that the participating students would learn immensely from the quiz competition and get more knowledge about their country’s history.\nHe also shed light on the sacrifices of the country’s forfathers rendered for getting a separate homeland.\nPakistan, he said, was established on14 August, 1947 when Quaid-i-Azam made a history by achieving a separate country on the basis of Two-Nation ideology.\nHe said the event showed the new generation was well aware of Pakistan’s history.\nHe termed Pakistanis as competent nation which was bringing laurels in the fields of sports, information technology, education and other sectors.\nArshad Munir congratulated the students and teachers of FDE Schools and Colleges, and the Ministry of information and Broadcasting for holding this outstanding event.\nTwelve students of intermediate level from Islamabad’s Model Colleges run by the Federal Directorate of Education participated in the Independence Day Quiz Show. Six teams of students comprising three girls and three boys, participated in the qualifying round, of which three teams qualified for the final round. After an interesting competition, Islamabad Model College for Women (Post Graduate) F10/2 bagged the first position.\nTrophies, cash prizes and certificates of appreciation were awarded to the first, second and third position winners.",
  "retrievedAt": "2025-08-11T04:29:32.597Z"
}
