{
  "title": "75 anniversary of US-Pak relations demonstrates their people’s ties: Schofer",
  "link": "https://www.app.com.pk/national/75th-anniversary-demonstrates-enduring-ties-of-people-of-pakistan-us-schofer/",
  "date_published": "2022-08-20T15:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP): Deputy Chief of Mission of U.S embassy in Pakistan Andrew Schofer on Saturday said the 75th anniversary of relations between Pakistan and the United States demonstrated the enduring people-to-people ties of the two countries.\nHe celebrated the importance of the United States and Pakistan’s 75 years of bilateral relations when he met with approximately 700 alumni of U.S. government-sponsored exchange programs said a news release.\nAlumni of U.S. educational and professional exchanges gathered to share their experiences and to continue strengthening ties between the United States and Pakistan.\nRecognizing the extensive contributions that members of Pakistan-U.S. Alumni Network (PUAN) have made to their communities since the organization’s founding in 2008, the Deputy Chief of Mission remarked, “the 75th anniversary of relations between our two countries demonstrates our enduring people-to-people ties.The future depends not just on our leaders; it depends on our people. PUAN and its 37,000 members are a great example of the power of that people-to-people relationship.”\nDuring his speech, Deputy Chief of Mission Schofer also highlighted the countries’ strong bilateral partnership, including the 77 million COVID-19 vaccine doses the United States has committed to Pakistan, as well as the historic trade and investment relationship, which continues to see the United States as Pakistan’s number one export destination.\nThe Islamabad-Rawalpindi Chapter reunion brought together politicians, scholars, journalists, business leaders, cultural leaders, and students for their first post-COVID era event.\nThe chapter reunion featured a job fair which brought international and local companies to offer on-site job recruitment. PUAN alumni have led dozens of service activities in the Islamabad area during the past year, improving their communities in the fields of education, leadership development, and women’s empowerment.\nPUAN Country President Syed Khurram Gillani and Islamabad-Rawalpindi Chapter President Syed Shahid Kazmi encouraged participants to volunteer for the network’s philanthropic activities and to spread the knowledge they gained in the United States.\nThe network also recognized several prominent alumni and volunteer mentors who have given back to their communities with Distinguished Alumni and Emerging Leader awards.\nThe U.S. government funds one of the largest professional and academic exchange programs in Pakistan, sending approximately 800 Pakistanis to the United States on exchanges every year. Over the past 75 years, we have funded more than 14,000 Pakistanis to study in the United States and more than 22,000 young Pakistanis have participated in our English language programs.\nPUAN organizes events across Pakistan through 14 regional chapters. Activities include community service projects, leadership training, roundtable discussions, and entrepreneurship programs.",
  "retrievedAt": "2025-08-11T15:25:58.759Z"
}
