{
  "title": "EQuIP chair conferred second highest civil honour ‘Hilal-e-Quaid-i-Azam’",
  "link": "https://www.app.com.pk/national/equip-chair-conferred-second-highest-civil-honour-hilal-e-quaid-i-azam/",
  "date_published": "2022-08-20T13:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 20 (APP):The Equality and Inclusion Partnership (EQuIP) Chairman Dr James Shera MBE, has been awarded the second highest civil honour, the Hilal-e-Quaid-i-Azam, by the President of Pakistan for his services to the country.\n“The award seeks to recognise those who have made notable and worthy contributions to the national interests. It is bestowed by the President of Pakistan once a year on the eve of Independence Day, which falls on the 14th August each year,” said a news release received on Saturday.\nIt was only this year, in 2022, that James retired as Councillor in the Benn Ward of Rugby borough, having served as the longest standing elected member for forty consecutive years.\nThe award also came after a long line of accolades, with James having received the Sitara-e-Pakistan in 1992. He then went on to receive three honorary doctorates – was made an MBE in 2007 for services to the NHS and an Honorary Freeman of the Borough of Rugby in 2017 for his long-standing services to the borough and its residents, it said.\nChief Executive of EQuIP Junaid Hussain commented, “We are once again elated for James and are so proud of his recognition by the President of Pakistan. We are living through challenging times, coming out of the pandemic and straight into a fuel and food crisis.\n“It is these types of activities that James has harnessed and excelled at over the years, that are needed in today’s climate more so, which bring communities together for the wider benefit of society. We have a lot to learn from James, who has dedicated his life to serving others, not only in the UK but abroad as well.”\nJames will receive his honour from the President of Pakistan on the 23rd March 2023, which is the country’s Republic Day.",
  "retrievedAt": "2025-08-11T15:26:00.025Z"
}
