{
  "title": "No pressure on Pakistan, says Babar - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Underlining that home conditions will give Pakistan an edge, leading batter Babar Azam insists that there will be no pressure on the home team when the ICC Champions Trophy starts here in Karachi on Wednesday.\n\n“There is no pressure of anything,” Babar told the International Cricket Council (ICC) website on the eve of the prestigious eight-nation event.\n\n“What has happened in the past is beyond us. We have discussed mistakes we have made and we have worked on them. So we will try not to do what we have done in the past.”\n\nBabar’s form will be vital if Pakistan are to improve on their recent tournament record. They have been knocked out in the group stage at the last two World Cups and suffered the same fate at last year’s T20 World Cup after losing to co-hosts United States.\n\nPakistan kick-off their Champions Trophy mission against New Zealand on Wednesday, a clash which will include two of biggest names in the event, with Babar set to go head-to-head with Kiwi star Kane Williamson.\n\nJoe Root, Steve Smith and Virat Kohli are part of the respective England, Australia and India squads but Babar stands in a league of his own in ODIs, heading into this competition as the world’s top-ranked batter.\n\n“When you have responsibility as a senior player in any team and the team relies on you and has belief in you, then I take it in a positive way,” the 30-year-old Babar said.\n\n“I try to give my best in every match. I try to perform so that Pakistan win and I enjoy my cricket.”\n\nHome advantage could be the key if Pakistan are to experience a change in fortunes. Babar’s home city of Lahore is among the three Pakistani cities hosting matches and he believes local knowledge will help his side thrive.\n\n“When you play at home you get that edge as you know the conditions,” he said.\n\n“You have a knowledge of how the pitch will behav but still you have to play good cricket because all other teams are among the best.”\n\nBabar was a precocious and promising 22-year-old when he helped Pakistan win the ICC Champions Trophy in 2017. Almost eight years on, he has developed into one of the world’s best batters across all formats and has his sights set on helping his country repeat the feat.\n\nThe right-hander refuses to live in the past and wants to make more memories in front of Pakistani public.\n\n“I am very excited,” he said. “We are going to have an ICC tournament in Pakistan after a very long time. As a player, I am very excited, and all the fans are excited.\n\n“It means a lot to be hosting the competition. The hospitality here in Pakistan is great and people love cricket here. Cricket puts everyone in one place. It unites everyone and the whole of Pakistan is busy praying that Pakistan wins. Everyone is united in that,” the batter stated.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b51f1b3f01a.gif",
  "retrievedAt": "2025-10-12T01:32:16.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892892/no-pressure-on-pakistan-says-babar",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:09:02.000Z"
}
