{
  "title": "Govt ordered to stop using Gas Infrastructure Development Cess funds for arbitration costs - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Public Accounts Committee (PAC) on Tuesday directed the government to cease using funds from the Gas Infrastructure Development Cess (GIDC) to cover arbitration costs.\n\nThe directive came after PAC discovered that funds meant for key gas infrastructure projects — including the Iran-Pakistan (IP) Pipeline, the Turkmenistan-Afghan­istan-Pakistan-India (TAPI) Pipeline and LNG-related initiatives — were being diverted to legal and court expenditures instead.\n\nThe committee was informed that the government had spent Rs955 million on the TAPI project and also covered arbitration costs with Iran using GIDC funds.\n\nThe members expressed concern over the slow progress of gas infrastructure projects, which has led to the accumulation of Rs350 billion in unutilised GIDC funds.\n\nThe Auditor General’s office reported that the federal government had only utilised Rs3.7bn for operational expenses of Inter State Gas System (ISGS) and repayment of its loan from Government Holdings Private Limited (GHPL).\n\nMNA Hina Rabbani Khar suggested that the government redirect the funds to green energy or projects closer to the objective.\n\nPAC Chairman Junaid Akbar Khan gave Petroleum Division Secretary Momin Agha one month to present alternative plans for the IP and TAPI projects.\n\nHowever, Mr Agha reque­sted an in-camera briefing, citing the sensitivity of the projects.\n\nHis request was denied after PPP MNA Naveed Qamar argued that these projects were already public knowledge.\n\nThe PAC also summoned the NAB chairman and the FIA DG for a briefing on Cnergyico Pk, formerly known as Byco Petroleum, which has defaulted on Rs70bn in payments to the government.\n\nThe matter came up during a discussion on an objection raised by the Audit Depa­rtment over the non-payment of petroleum levy and late payment surcharge (LPS) on the sale of petroleum, oil and lubricants (POL), resulting in a Rs14bn loss to the government.\n\nThe committee also flagged the non-realisation of Rs33.9bn in Gas Development Surcharge (GDS), which had benefited private fertiliser and power companies that failed to make the required payments.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:31:35.827Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892847/govt-ordered-to-stop-using-gas-infrastructure-development-cess-funds-for-arbitration-costs",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:41.000Z"
}
