{
  "title": "Perilous traffic - Newspaper - DAWN.COM",
  "author": null,
  "content": "FOR several weeks now, Karachi has seen an uptick in traffic-related tragedies, with many people killed by speeding dumpers, trucks and water tankers. Unsurprisingly, public anger has erupted, with miscreants setting alight some of the heavy vehicles.\n\nFrom the Bushra Zaidi accident in Nazimabad in 1985 to the tragic death of Imran Arif and Amna Arif in the Karsaz area some months ago, the list of road tragedies is a long one. Many of those who have survived death have been left with life-altering injuries and mental health problems. Buckling under people’s pressure, the government has formed a ‘road checking committee’ to oversee motor vehicle fitness and general road safety.\n\nTraffic management is an urban governance matter. Traffic police are responsible for managing the movement of vehicles, regulating errant drivers and other vehicle operators, and initiating action that can lead to legal proceedings when traffic offences are committed. They are answerable to the police high command and the relevant provincial department.\n\nIt is commonly observed that traffic cops resort to snap checking in a careless manner. They are on the lookout for motorbikes, rickshaws, smaller cars, pick-ups, heavy-load vehicles, etc. Challans are issued for incomplete papers to satisfy the higher-ups. Meanwhile, the vehicles of law-enforcement agencies that often flout traffic rules, such as using sirens when they are not needed, are spared, as are underage, unlicensed, often wealthy, individuals racing in fancy vehicles. Tinted glasses are par for the course. Vehicles that lack number plates also go unnoticed. On busy corridors, motorbikes and cars can be spotted speeding on the wrong side of the road.\n\nIndeed, there is no respite for law-abiding drivers hit by errant vehicles. In road scuffles, it is usually those who shout the loudest or flex their muscles the most who emerge victorious. Common public spaces such as those underneath bridges and overpasses are transformed into rickshaw stands. These vehicles are often operated by teenagers who do not bother about traffic regulations.\n\nUrgent reforms are needed to prevent death on the roads.\n\nIn this context, it was amusing to see the mayor of Karachi recently complain. The municipality is responsible for managing public spaces along designated corridors of movement. More often than not, major roads have broken footpaths and are crowded with encroachments. Walking is a huge challenge. Children and their parents have to carefully negotiate their way through moving vehicles to reach schools in Saddar and other busy areas. For road-widening projects, the space for vehicles is increased while footpaths become narrower. The BRT Red Line construction has destroyed sidewalks at many points. In certain neighbourhoods such as Defence Housing Authority, major streets have no sidewalks. Khayaban-e-Shaheen, which links DHA with Clifton, is an example. In addition, cycling and non-motorised transport operators find it extremely difficult to exist on such streets.\n\nAggression on the roads is very common. Chasing vehicles that seem to speed away, causing a sudden obstruction, disregarding the traffic lights, harassing those who abide by the traffic rules at a stop sign, intimidating pedestrians crossing the road and parking on the footpath are everyday sights in this city.\n\nMotorcyclists are also culpable. Many try to change lanes without indicators at high speed, or ride with more than the allowed number of passengers, flout the helmet rule, and use mobile phones without stopping their bikes. Interaction with errant drivers and bike riders will reveal that most do not even possess elementary knowledge about traffic rules and regula-tions.\n\nObtaining a driving licence through the official process is also considered unnecessary. When checked by a traffic cop, drivers know well how to strike a deal. The operators of heavy vehicles, SUVs, etc, believe in driving fast, often going out of control and causing serious injuries and death on the roads. Gun-toting guards in pricey vehicles protect the errant motorist from being questioned.\n\nThis is a despicable scenario. Compre­hensive and urgent remedial measures are required. The so-called checking committee is an eyewash. Stakeholders, including residents, shopkeepers, parents taking their children to school, in fact all who daily negotiate death on the roads, must be engaged to evolve an oversight and solutions body. Karachi needs a ‘Citizen Traffic Liaison Committee’ that must be composed of members of civil society and experts to examine our traffic challenges, formulate solutions and oversee implementation. We can’t afford more tragedies on the roads.\n\nThe writer is an academic and researcher based in Karachi.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b5343da398e.jpg",
  "retrievedAt": "2025-10-12T01:32:08.169Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892942/perilous-traffic",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:35:05.000Z"
}
