{
  "title": "Lebanese search for dead in devastated villages as Israel withdraws - World - DAWN.COM",
  "author": null,
  "content": "KFAR KILA: Residents of south Lebanon returned to devastated villages on Tuesday, searching for the bodies of relatives killed in last year’s war between Israel and Hezbollah, as Israeli troops withdrew from most of the territory.\n\nIsraeli Foreign Minister Gideon Saar said Israel would complete its withdrawal from the south on Tuesday to meet a deadline set under a US-backed ceasefire, but that it would temporarily remain in five points needed for its security.\n\nHezbollah, which was badly pummelled in the war, said Israel was still occupying Lebanese territory and put the onus on the Lebanese state to get Israeli forces out. In the frontline village of Kfar Kila, barely a building was left standing.\n\n“I reached my neighbourhood and I couldn’t tell where my house had been,” said one resident, Noha Hammoud.\n\n“The entire neighbourhood is destroyed.”\n\nRescue workers had pulled several bodies from the rubble, and had even found two people still alive, she said. Local sources said those found dead and alive were fighters from Hezbollah, thousands of whom were killed in the war.\n\nSenior Lebanese politician Ali Hassan Khalil, who hails from the south, said hundreds of residents had gone to inspect several villages that became accessible, adding that the Lebanese army was still working to clear roads. However, Israel’s continued occupation left “an open wound”, he added.\n\nThe conflict, which began when Hezbollah opened fire on Oct 8, 2023 in support of its Palestinian ally Hamas, displaced tens of thousands of Israelis from northern Israel and more than a million people in Lebanon.\n\nAt the Israeli Kibbutz Misgav Am, next to the border with Lebanon, some residents visited and planted trees on Tuesday.\n\n“Although we had to evacuate, our hearts stayed here,” said one of the kibbutz members, Daniel Malik. “We really want to come back but there is big uncertainty because we don’t know when it will be safe,” he said. Israel sent forces into the south during a major offensive against Hezbollah, the culmination of a year of hostilities ignited by the Gaza conflict.\n\nIt inflicted major blows on the Iran-backed group, killing its leader Hassan Nasrallah and other top commanders and leaving it dramatically weakened.\n\n‘Joy and sadness’\n\nIn Yaroun, another frontline village in Lebanon, a woman held a bouquet of spring flowers in one hand and Hezbollah’s yellow flag in another as she surveyed the destruction. Rescue workers pulled at least one body from the rubble.\n\n“Our feeling is a mix of joy and sadness because there are still martyrs we have yet to find,” said returning resident Suhaila Daher. “All the destruction can be replaced, thank God, but the martyrs will not return.”\n\nThe terms of a US-brokered ceasefire required Israel to withdraw and barred Hezbollah from having any military presence in southern Lebanon, where the group enjoys political backing among Shia Muslims. The deal also requires the US-backed Lebanese army to deploy into the border region.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1911263837c62fb.jpg",
  "retrievedAt": "2025-08-25T19:44:21.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892916/lebanese-search-for-dead-in-devastated-villages-as-israel-withdraws",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:09:09.000Z"
}
