{
  "title": "Iran mulls moving capital to ‘lost paradise’ on southern coast - World - DAWN.COM",
  "author": null,
  "content": "TEHRAN: Faced with myriad problems including gridlocked traffic and a sinking earth surface in its current capital, Iran is considering a drastic solution — moving it to an altogether different location on the Gulf of Oman.\n\nThough the idea of moving the capital has cropped up on various occasions since the 1979 Islamic Revolution, the proposals were repeatedly shelved as unrealistic due to the massive financial and logistical hurdles. But reformist President Masoud Pezes­hkian, who took office in July, has recently revived the idea, citing Tehran’s growing challenges.\n\nThese include traffic snarls, water shortages, resource mismanagement, extreme air pollution, as well as subsidence — the gradual sinking of land mass due to either natural processes or human activity.\n\nIn January, government spokeswoman Fatemeh Mohajerani said the authorities were studying the possible relocation. “The Makran region is being seriously considered,” she said, without specifying a timeline.\n\nMakran is a largely undeveloped coastal area on the Gulf of Oman, stretching across Iran’s southern, impoverished Sistan-Baluchistan province and part of neighbouring Hormozgan province. It has repeatedly been touted as a frontrunner for the move.\n\n“The ‘lost paradise’ of Makran must be transformed into the future economic hub of Iran and the region,” said Foreign Minister Abbas Araghchi in a Sunday speech. In September, Pezeshkian said, “We have no choice but to move the economic and political centre of the country to the south and near the sea”.\n\nTehran’s problems had “only worsened with the continuation of existing policies”.\n\n‘Safe and appropriate’\n\nThe revival of relocation plans has reignited a debate over their necessity, with many highlighting Tehran’s historic and strategic significance. Lawmaker Ali Khazaei said that whatever future city is chosen, it must take into consideration Iran’s “rich culture”.\n\nTehran, designated the capital by Agha Mohammad Khan Qajar in 1786, has served as Iran’s political, administrative and cultural hub for over two centuries. Tehran province is currently home to around 18 million people, as well as a floating population of about two million people who commute there during the daytime, according to governor Moham­mad Sadegh Motamedian.\n\nThe landlocked city sits on a sloping plateau at the foot of the snow-capped Alborz mountain range, blending modern high-rises with historic palaces, bustling bazaars and leafy parks. Makran is meanwhile known for its fishing villages, sandy beaches and ancient history dating back to the time of Alexander the Great. Still, many oppose the possible relocation.\n\n“This would be a completely wrong move because Tehran really represents Iran,” said 28-year-old engineer Kamyar Babaei, a resident of the capital.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/19111641fde6127.jpg",
  "retrievedAt": "2025-08-25T19:44:19.282Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892911/iran-mulls-moving-capital-to-lost-paradise-on-southern-coast",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:09:09.000Z"
}
