{
  "title": "NA reaffirms support for Kashmiris’ struggle - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Natio­n­­al Assem­bly on Tuesday unanimously passed a resolution reaffirming Pakistan’s unwavering moral, political, and diplomatic support for the just struggle of the Kashmiri people to realise their inalienable right to self-determination.\n\nThe resolution was tabled by the Minister for Kashmir Affairs, Gilgit-Baltistan and Safron, Amir Muqam, who paid rich tribute to the courage and sacrifices of the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n\nThe resolution expressed grave concern over India’s continued efforts to consolidate its occupation of held Kashmir and undermine its internationally recognised disputed status, particularly following its illegal and unilateral actions of Aug 5, 2019.\n\nIt said that any political process in occupied Kashmir cannot serve as a substitute for the Kashmiri people’s right to self-determination. It also condemned systematic human rights violations in held Kash­mir under draconian laws.\n\nIt rejected provocative statements by Indian political leaders and senior military officers regarding Azad Jammu and Kashmir and Gilgit-Baltistan. It stressed that the solution of the Jammu and Kashmir dispute, in accordance with UN Security Council resolutions and the aspirations of the Kashmiri people, is essential for lasting peace in South Asia.\n\nThe House demanded that India must improve the human rights situation in held Kashmir, release all Kashmiri political prisoners, and repeal draconian emergency and counterterrorist laws.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1909464127a8f3a.jpg",
  "retrievedAt": "2025-10-12T01:32:09.765Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892932/na-reaffirms-support-for-kashmiris-struggle",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:47.000Z"
}
