{
  "title": "Out of control - Newspaper - DAWN.COM",
  "author": null,
  "content": "AS bodies continue to fall in Kurram despite a state-sanctioned ceasefire, one wonders how long local militants’ challenges to the state’s writ will be tolerated before a full-throttled response is launched.\n\nAnother spate of attacks on an aid convoy, which eyewitnesses said was instigated by locals, has threatened to undo the attempts to stabilise the region. Shortly after noon on Monday, the aid convoy, which was destined for Parachinar, came under attack in Lower Kurram. A firefight ensued, which continued for two hours, leaving a Pakistan Army soldier martyred and seven others injured.\n\nA few hours later, there was an attempt to loot the stranded trucks, triggering another gunfight between the security escort and looters. Five Frontier Corps personnel were left injured. Finally, another couple of hours later, an FC Quick Response Force dispatched to rescue the injured was ambushed near a local government school. Four FC personnel were martyred in the attack.\n\nKurram District has for long posed an administrative headache for the authorities. It has attained notoriety as a hotbed for sectarian and ideologically driven violence. Citizens in geographically boxed-in locations like Parachinar live a miserable existence, caught up in sectarian violence between local tribes.\n\nThe militants who control their surrounding areas have placed it under siege, and their virulent hatred seems to make no exceptions, not even for the old and the ailing or for sick children. Besieged thus, Parachinar went for months without adequate food supplies, medicine or fuel late last year.\n\nThe aid convoys, which started after the government finally managed to enforce a ceasefire between the warring factions at the beginning of the year, are supposed to meet the urgent human needs of the citizens of Parachinar. Not even the fact that they are under the protection of the state has deterred local spoilers from targeting them, however.\n\nA worrying aspect of Monday’s attacks is eyewitnesses’ claims that they were instigated by local mosques and led by locals. Equally shocking is the brazenness of the repeated attacks on the security escort, which included military and paramilitary personnel. The incident should not be seen as just a spillover of the local conflict but as an example of local miscreants growing so emboldened that they are now willing to take on the Pakistani state itself.\n\nIt is imperative, therefore, for the state to take greater control of the situation. It must eliminate any challenges to its authority. A plan to clean up Kurram has made some progress, but spoilers are still taking advantage of chinks in the state’s armour. There should be zero tolerance henceforth for those violating the peace pact. The peace committee responsible for keeping the agreement must hand over all miscreants. The peace process should not be imperilled at any cost.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:31:22.065Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892948/out-of-control",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:38:00.000Z"
}
