{
  "title": "Tail-enders give Pakistan respectable end as clinical NZ win Champions Trophy opener - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan failed to chase the 321 target set by New Zealand in the opening match of the International Cricket Council (ICC) Champions Trophy tournament at the National Stadium in Karachi. The Green Shirts ended their rollercoaster innings with 260 all out.\n\nThe stage was set for Team Pakistan in Karachi with an electric atmosphere in the stands at the sold-out National Bank Stadium as it hosted its first ICC tournament since 1996.\n\nHowever, it was not meant to be as old woes in the form of their death over bowling and a new one with opener Fakhar Zaman suffering a muscle strain hampered their chances in this match.\n\nSkipper Mohammad Rizwan felt that dew might be a factor later in the day and chose to bowl first after winning the toss, only for the dew to never become a factor in Pakistan’s batting innings.\n\nPakistan played a mammoth 152 dot-balls in their innings, with their lack of strike rotation coming back to haunt them at the end.\n\nThere were cameos by Khushdil Shah and Salman Ali Agha scoring 69 and 42 respectively but they were eclipsed by Will Young and Tom Latham’s centuries earlier in the day. Latham was adjudged player of the match for his 118 not out.\n\nFor New Zealand, Will O’Rourke was the pick of the bowlers getting 3 wickets, including Rizwan and opener Saud Shakeel in the first 10 overs.\n\nHe told Dawn.com that the ball tends to swing more under the lights and skidded more later on in the second innings compared to the first innings which helped to counteract the former effect.\n\nGoing forward, Pakistan face India on Sunday in a highly anticipated encounter, with the pressure on the Green Shirts to keep their hopes alive in the tournament by beating their arch-rivals.\n\nThe ICC termed it a “clinical” win.\n\nSpeaking to Dawn.com after the match about how the wicket played, New Zealand batter Glenn Philips said: “Today’s wicket definitely played differently, with a lot more spin in the evening again, which we found out a couple of years ago as well when we played here.\n\n“The pacers were harder to play during the day with the wicket going up and down. The Pakistan boys definitely bowled well, especially at the top, which made it tough for us to get away early on. But it was nice to see it spin in the evening.”\n\nMatch summary by Mir Shabbar Ali: The stands were filled to their capacity but the silence was almost deafening. The New Zealand bowlers could hardly err and Babar Azam would keep blocking.\n\nPromoted to the top of the order because Fakhar was forced to come out later after having left the field early in the New Zealand innings due to injury, Saud would casually lose his wicket.\n\nRizwan would become prey to a flying effort — quite literally — by Phillips at point before a half-fit Fakhar, coming in at four, would excite the crowds for a while before perishing.\n\nSalman’s short stay at the crease brought as much hope as there could possibly be before Khushdil and the lower order’s exploits made the result sound better than worse.\n\nIt was a 60-run loss, Pakistan’s effort was in contrast to the bigness of the occasion and the numbers in the stands, which deteriorated with each falling wicket.\n\nAfter being bludgeoned for 320 — thanks to centuries by Young and Latham — the hosts had no answer to the New Zealand bowlers, as they were bundled out with two overs and four balls to spare in their ICC Champions Trophy opener.\n\nTheir start in the tournament meant Pakistan now cannot afford to lose to India in their second match in Dubai if they are to qualify for the semi-finals.\n\nWith a big total to chase, Pakistan were required to get off to a flyer. But what happened was the other way round,\n\nThe hosts had scored only 22 runs in the first 10 overs, with Saud finding Matt Henry at deep third man off pacer Rourke and Rizwan becoming the bowler’s second victim.\n\nWith Fakhar finally coming in, the silent crowd finally rose from slumber, the celebrated southpaw hitting all his four boundaries early in his knock before his injury slowed him down and finally saw him cleaned up by spinner Michael Bracewell.\n\nWith Salman coming in, Pakistan scored 35 runs between the 28th and the 31st over, the batter taking on the New Zealand spinners with poise, only to be dismissed with the introduction of pacer Nathan Smith.\n\nBabar (60 off 94) had brought up his 50 in 81 balls, 49 of those dots before New Zealand captain Mitchell Santner ended his proceedings.\n\nKhushdil’s 69 off 49, which featured 10 fours and six and under-20 cameos by tailenders Naseem Shah, Shaheen Shah Afridi and Haris Rauf completed the damage control effort.\n\nEarlier, Young and Latham took the mantle to stabilise New Zealand following a shaky start before Phillips’ fireworks saw the visitors put up 320-5.\n\nThe ton-up pair combined for 118 off 126 to pull New Zealand out of danger after they had lost the likes of Devon Conway, Kane Williamson and Daryl Mitchell, leaving the side reeling at 73-3 by the 17th over.\n\nWhile Young hit a risk-free 107 off 113 (12 fours and six), Latham accelerated as he got deeper into his unbeaten knock for 118 off 104 (10 fours and three sixes).\n\nWith the base set, Phillips, who arrived to bat in the 38th over, smashed away three fours and four sixes for his 61 off 39.\n\nThe muscular right-hander put up 125 off 74 with Latham for the fifth wicket, 113 runs of which came in the last 10 overs, raising further questions over Pakistan’s ability to contain opposition in the death overs.\n\nThe hosts’ bowlers had looked dangerous to start with, as spinner Abrar Ahmed’s nagging googly pushed Conway to his backfoot before clipping away the left-hander’s off-stump in the eighth over.\n\nThe breakthrough opened doors for Pakistan, as pacer Naseem got veteran New Zealand batter Williamson four balls later, pitching one in the channel before it moved away just enough to find the right-hander’s outside edge for Rizwan to take a low catch behind the stumps.\n\nThe Pakistan pacers were steaming in as the crowd’s roar ascended in unison with his rhythm, and Haris pitching one short to Mitchell as he mistimed an attempt to clear mid-on to find Shaheen four overs later.\n\nBut it was all New Zealand after that, as Young looked settled bringing up his 50 in 56 balls in the 19th over. He brought up his fifty-run partnership with Latham with a sumptuous flick for four past square-leg off Naseem.\n\nLatham stamped the pair’s authority on the pitch with two sweeps for fours, to take New Zealand past the 150-mark in the 31st over.\n\nYoung brought up his century with a single off Abrar four overs later before completing the 100 partnership with Latham as frustration started to show in the Pakistan players’ body language.\n\nAfter Latham had reached his fifty, the left-hander punched Shaheen through extra cover for his fourth boundary before Young holed Naseem out to substitute Faheem Ashraf at deep square-leg in the 38th over.\n\nThe incoming Phillips announced his arrival with a handsome six down the ground off Khushdil Shah before Latham swept Abrar for a six and two boundaries to get 16 off the 44th over.\n\nPhillips lofted Haris with ease for another maximum in the next over for his second six as New Zealand crossed the 250-run mark. Latham brought up his eighth ODI century with a single off Shaheen in the 47th over, which also saw Phillips pull and flick the Pakistan pace spearhead for two more sixes.\n\nThe pair scored 34 more before Phillips perished on the third-last ball of the innings as New Zealand piled up what proved to be an impossible total to chase for Pakistan.\n\nSantner went for 15 runs in the 47th over after both the tailenders, Haris and Naseem, smashed the spinner over the boundary. However, Santner was successful in sending Haris back to the pavillion who looked dangerous for his 19 runs.\n\nHenry then dismissed Naseem on the second delivery of the 48th over to bring Pakistan’s innnings to a close. New Zealand won by 60 runs.\n\nO’Rourke, continuing, went for nine runs after he was dispatched for a six by Haris Rauf towards square leg. Pakistan’s score reached 245 for the loss of eight wickets after 46 overs.\n\nNaseem at the other end with a knowing smile: he of Asia Cup heroics fame, probably itching to have a go himself. These two have provided some memorable batting cameos in the past, even if this one comes too late to alter the match situation.\n\nRauf hits a big six. Heaves this over long-on with real conviction! For all the match situation, you can’t deny the entertainment value here. Rauf lives up to his reputation of giving it a mighty thwack when he gets the chance. Picks the length early, clears his front leg, and sends this sailing into the stands. The crowd finds its voice again.\n\nSantner came back into the attack to try and wrap up Pakistan’s innings, however, was sent for a mighty six by Rauf on the last ball of the over, collecting seven runs from it and bringing Pakistan’s total to 236 for the loss of eight wickets.\n\nESPN Cricinfo’s Matt Roller says: “The Champions Trophy format is so cut-throat. Pakistan waited 28 years for a home game at an ICC event and now likely have to beat India to avoid their next one being a dead-rubber.”\n\nAnd with that wicket, so go Pakistan’s hopes in this chase. That’s certainly what the fans in the stands believe as they leave the stadium in droves.\n\nKhushdil’s valiant effort came to an end after he was dismissed by O’Rourke on the fourth delivery of the 44th over while trying to drag Pakistan across the line all by himelf. A fantastic innings of 69 from 49 balls brings an end to all hopes Pakistan had. Four runs came from it to bring Pakistan’s chase to 229 for the loss of eight wickets.\n\nKhushdil then went after Henry in the next over, scoring two boundaries against the New Zealand pacer. Four more runs from it added 12 runs to it, ending 43rd over for Pakistan with the chase at 225 for seven after 43 overs.\n\nKhushdil is giving the remaining crowd at the National Stadium some hope with his hitting, now batting at 64 of just 43 deliveries he’s certainly not letting New Zealand get away with this match.\n\nFans in the newsroom are still putting their hopes in the dew to swing in, but with three wickets in hand and an above 12 RRR, it’s looking like New Zealand will take the win today.\n\nGoogle’s live win probability.\n\nO’Rourke was brought back into the attack by Kiwi’s skipper, however, Khushdil continued his onslaught, scoring 13 from the over bringing Pakistan’s chase to 213 for seven after 42 overs.\n\nHenry was brought back into the attack and he dismissed Shaheen’s last ball of the 41st over, with Shaheen edging to Latham from a regulation caught behind. Four runs came from it with Pakistan’s chase reaching 200 for the loss of seven wickets.\n\n“Pakistan need to swing for the hills. It’s the only thing they can do. The whole chase for me has been peculiar,” says Alex Hartley on BBC Radio 5 Sports.\n\nKhushdil dispatched Phillips for a six on the third ball of the 40th over as Pakistan collected three singles from the over to bring the chase at 196 for the loss of six wickets with the required run-rate at 12.5.\n\nBracewwell came into bowl his final over, giving away only four runs and ending his spell with 38 runs given for his 10 overs. Pakistan’s chase stood at 187 for the loss of six wickets with the required run-rate at 12.18.\n\nOverheard in the newsroom (at home): “The most hardworking folk in the Pakistan team are the lower order: they have to ball and bat.”\n\nShaheen came down the track, showing intent missing from our batters, and slapped Phillips for a six over the ropes. Two singles from it brings Pakistan’s chase to 183 for the loss of six wickets after 38 overs.\n\nWith the nigh-insurmountable required run rate, fans now just want the team to go down in a blaze of glory. Khushdil is slogging the ball every which way. And with him, Shaheen’s big hits are boosting the run rate. But the joy is understandably muted in the stands.\n\nKhushdil, much like Salman, dispatched Bracewell for two boundaries, taking 9 from the over and pushing Pakistan’s chase to 175 for the loss of six wickets.\n\nKhushdil dispatched Santner for two boundaries in the over, much to the relief for the home crowd, collecting 10 runs from the 36th over to take Pakistan’s chase to 166 for 6 after 36 overs.\n\nBracewell was brought back into the attack to dry up the runs and take the game away from Pakistan, more than it already has. Three singles from it brought Pakistan’s chase at 156 for the loss of six wickets after 35 overs.\n\nBabar departed in the next over by Santner after scoring his seventh boundary of the innings, skying one towards Williamson on midwicket. Three singles from it brought seven from the over with Pakistan’s chase at 153 for the loss of six wickets.\n\nBabar’s departure — in a sloppy shot — appears to have settled all doubts that Pakistan are headed for defeat. But there is still hope for those who are still there: Khushdil. Adversity makes heroes. If Khushdil rises to the occasion, he will win hearts and forever live up to his name.\n\n“The strike-rate was not good enough from Babar Azam when you’re chasing 300. In the powerplay, they were stuck. You can understand why he was playing that shot because he’s trying to get things moving,” says Alex Hartley, former England player, on BBC Radio 5 Sports.\n\nOverheard in the newsroom: “Why did Babar stick around cautiously for so long if this is the shot he was going to leave at?”\n\nBabar dispatched Smith for a six on the first delivery of his second over. Khushdil then opened his arms as well to dispatch Smith for a boundary square of the wicket. Two singles and two doubles bring 16 runs to Pakistan’s innings as the chase reaches 146 for the loss of five wickets after 33 overs.\n\nSantner then dismissed Tayyab Tahir in the next over who tried to drag the spinner to midwicket, only to be caught by Williamson on the leg side. Two singles from it ended the 32 over with Pakistan’s chase at 130 for five.\n\nNathan Smith was brought into the attack by Santner as the Kiwis looked for something to give, which it did after Salman skied a pull to square leg and was caught by Bracewell who came in from midwicket. Babar Azam also completed his 54th century on 82 deliveries. Pakistan’s chase reached 128 for the loss of four wickets after 31 overs.\n\n“Pakistan have got to that stage where they need to take risks,” said Alex Hartley, former England bowler, on BBC Radio 5 Sports Extra.\n\nSantner came back to slow Pakistan’s charge, however, the Green Team collected five from it as the game moved into deeper waters. Pakistan’s chase reached 124 for the loss of three wickets after 30 overs.\n\nSalman, for the third consecutive over, scored two boundaries, crossing the covers on the full on one occasion. He tried to deflect the fifth delivery for a boundary as well but a good effort in the fielding by New Zealand saved one for the Kiwis. Fifteen from the over ended the 29th over for Pakistan with the chase at 119 for the loss of three wickets.\n\n“Salman Ali Agha has played some nice shots. The pressure is on and we’ve seen him bat sensibly. He has a clear head and he’s thinking clearly in a tough situation. If you show a bit of intent, the opposition can feel the pressure. Can this continue for Pakistan? Babar Azam really has to do whacking from his end,” says Ramiz Raja on BBC Radio Sports.\n\nMeanwhile another commentator said: “Believers should stick around — there may be something special here.”\n\n“Pakistan have played the same ODI thrice against New Zealand in the last two weeks,” said cricket analyst Mazhar Arshad in a post on X.\n\nSalman hit two more boundaries on the first two deliveries of the 28th over to help Pakistan chase cross the 100 run mark. Two boundaries and two single gather 10 for Pakistan with the score at 104 for the loss of three wickets.\n\nSalman dispatched Phillips for two back to back fours in the 27th over, pleasantly received by the otherwise bored home crowd. Two singles from it ended the over with 10 from it and Pakistan’s chase at 94 for three.\n\n“Pakistan played 104 dot balls in their first 25 overs. It’s the most by them in a men’s ODI since the 2018 Dunedin ODI vs New Zealand, where they batted 117 dot balls, and were 9 down for 58,” says ESPN Cricinfo stats whiz Sampath Bandarupalli.\n\nSantner gave away only a single run in his third over, ending the over with Pakistan’s chase at 84 for the loss of three wickets.\n\nNew Zealand were 113/3 after 25 overs.\n\nThe chase for the home side reached 83 for the loss of three wickets at the halfway point. Three singles from Phillips fifth over took the required run rate above 9.5.\n\nThe run-rate is approaching 10 now. New Zealand were 110/3 at 24 overs.\n\nSalman scored an unusal boundary as he was beaten all ends up by and spinning Santner delivery, however, umpire did not signal byes. It seemed as if the ball had touched the stumps and deviated, not Salman’s bat. Three more runs from it ended the 24th over with Pakistan’s chase at 80 for the loss of three wickets.\n\nBracewell continued from the other end trying to choke Pakistan as pressure piled up on the Green Team. Only two runs from the over ended the 23rd over with Pakistan’s case at 72 for the loss of three wickets.\n\n“Very disappointing from Pakistan. We have not seen any positive intent playing at home, on a surface that should have helped you,” says Ramiz Raja on BBC Radio 5 Sports.\n\nSantner brought himself into the attack and gave away only a single, ending the 22nd over with chase at 70 for the loss of three wickets.\n\nGoogle’s live win probability.\n\nFakhar bails were uprooted as he tried to heave Bracewell again towards the leg side, only to miss the ball which went crashing into middle stump. Vice Captain Salman came out to bat after Fakhar was dismissed with the 21st over ending as Pakistan’s chase stood at 69 for three.\n\n“Fakhar Zaman got himself in a tangle. He exposed all of his stumps. Pakistan find themselves in a little bit of trouble. You feel Babar Azam will need to stay out there for a while. A strange old innings. The tempo was not set in the powerplay,” said Alex Hartley, former England bowler, on BBC Radio Sports.\n\nFakhar was dropped by Conway in the 20th over after the ball popped out of the Kiwi fielder’s hand as he dove forward. Only a single from the over ended 20 overs for Pakistan with the score at 66 for the loss of two wickets.\n\nBracewell was dispatched towards deep midwicket by Fakhar for another needed boundary. However, four back-to-back dots from Bracewell ended the over with five runs with Pakistan’s score at 65 for 2 after 19 overs.\n\nThe pair started to rotate the strike as they gathered five singles in the 18th over to nudge the score along. Five runs from the 18th over brings Pakistan chase at 60 for the loss of two wickets.\n\nFakhar, sluggish on his feet due to his muscle sprain, was struggling in the middle as Bracewell bowled a maiden over. Pakistan’s score stood at 55 for the loss of two wickets after 17 overs.\n\n“It’s all well and good getting a four, but if you’re not running the singles you need two boundaries — that makes it tricky,” says Henry Moeran, special BBC commentator.\n\nBabar played a half-kneeling pull to score his fifth boundary of the innings as Pakistan upped the ante. Rotating the strikes seems to be the most difficult thing for now with both batters relying on boundaries to score. Pakistan’s score stood at 55 for the loss of two wickets after 16 overs.\n\nPakistan now require 266 runs from 34 overs with a required run-rate of 7.8\n\nFakhar, who is sitting deep in his crease, seems unable to play regular strokes, however, the leftie swept Bracewell in the 15th over to collect eight runs from it. Pakistan’s score stood at 49 after 15 overs for the loss of two wickets.\n\nAnalysis by Dawn sports correspondent Mir Shabbar Ali: If Fakhar stays till the end, only then there’s a chance for Pakistan. New Zealand have kept it very tight so far.\n\nAs the players take a drinks break, the crowd is still hopeful with chants of ‘Fauji’ going around with the capacity crowd holding up their phone’s torches as the announcer gees them on.\n\nOverheard in the newsroom: “Chal bhai maar!” (Please hit it already!)\n\nAsk and ye shall receive, Fakhar hits a four.\n\nPhillips was brought into the attack by Santner, replacing O’Rourke who went for plenty in his previous over. Fakhar stepped out of the crease and dispatched Phillips for a boundary behind the bowler’s head. However, Fakhar, after miscuing a shot fell to the ground. It seems that the leftie is still looking uncomfortable after his knock in the first innings. Six runs from it ended the 14th over for Pakistan with the score at 41 for the loss of two wickets.\n\n“Despite the injury, Fakhar steps out and belts Phillips past him for four. The next ball is also slower and wider of off. Fakhar slashes it to cover and goes down on his haunches. Man down. The physio is out to tend to Fakhar,” says an analyst on ESPN Cricinfo.\n\n“Fakhar Zaman got himself in a tangle. He’s put himself in an unnatural position with that shot and that’s aggravated the injury that he has ongoing. He’s in a lot of discomfort,” said Aatif Nawaz, a BBC special commentator.\n\nBracewell continued with the attack and conceded only two runs in his over after some brilliant effort in the field by Smith to stop a certain boundary. Pakistan’s score stood at 35 for two after 13 overs.\n\nNew Zealand were 55/2 at the end of their 12th over.\n\nBabar deflected O’Rourke for a boundary behind point on the second ball of the 12th over as Pakistan tried to release the piling pressure. He went after O’Rourke again on the last ball of the over, almost dropping just short of the fielder on square and going for the covers with Pakistan’s score at 33 for two after 12 overs.\n\nChants of ‘Bobby’ going around the packed National Stadium in Karachi with the crowd expecting a special knock for the right-handed batter.\n\nThe Kiwis brought Michael Bracewell after the powerplay to dry up Pakistan’s runs. Fakhar came out to bat and stepped out twice in the same over to revert some pressure. He edged the last ball of the over for a single towards square, with Pakistan collecting only two runs from the over. Pakistan’s score stood at 24 for the loss of two wickets after 11 overs.\n\nNew Zealand were 48/2 for at the end of 10 overs.\n\nGlenn Phillip grabbed a blinder to dismiss the Pakistan skipper with the score at 22 for two after 10 overs. Both pacers, Henry and O’Rourke, ended the powerplay with less than an economy of 2.7 in their five overs with O’Rourke dismissing Saud and Rizwan.\n\n“You have got Tayyab Tahir and Khushdil Shah to come later in the innings. Those two can bat, Khushdil can whack it. But you don’t want to be giving those lads too much work,” Alex Hartley, former England bowler, on BBC Radio Sports.\n\nWith the score at 21 after nine overs, pressure piled up on the home side with commentator Bazid Khan stating, “Something’s got to give.”\n\nTwo singles from the ninth over made for a shaky start as Green Team tried to protect their wickets, with the required run rate moving upwards of seven.\n\nRizwan attempted a shot that was very reminiscent of shots played in Pakistan’s street cricket.\n\nPakistan took a single after nine deliveries with Kiwi bowlers making life difficult for the Pakistani batters. Babar went after a wide ball and connected, carving the field for a needed boundary.\n\nFive runs came from the eight over with the score at 19 for the loss of one wicket.\n\n“A little bit of dew, it’s getting to that time of night. There’s something on every game and that’s why it’s so great — it’s the knockouts from the start. These two in the middle are really struggling,” Alex Hartley, former England bowler, on BBC Radio Sports.\n\nA maiden by Henry added to Pakistan’s discomfort at the crease with the score staying at 14 for the loss of one wicket.\n\nSix overs in, New Zealand for 33/1.\n\nTaking their time, the Babar-Rizwan pairing looked to hold their ground early on as they sparsely rotated strike, gathering only two runs in the sixth over. Pakistan’s score stood at 14 for the loss of one wicket after six overs.\n\nPessimism is beginning to seep in as Dawn.com’s readers believe New Zealand is going to get the better of Pakistan.\n\nGoogle’s live win probability.\n\nHenry and O’Rourke kept it tight for the first spell of the Pakistan innings, conceding only 12 runs after five overs, dismissing Saud in the process. Babar smashed Henry for a glorious boundary through the covers, however, Henry smashed his pad on the next ball, taking it up with the umpire who said not out.\n\nWill O’Rourke dismissed Saud in his second over as he tried to smash the pacer after holding down one hand, facing 18 balls. Reaching for a slash outside the line, Saud sliced the ball to Henry at third man who grabbed a really good catch.\n\nSaud’s dismissal brought Skipper Rizwan to the crease, completing the Babar-Rizwan pairing on the crease. Pakistan stood at eight runs after the fourth over at the loss of one wicket.\n\nRizwan was the next man in as opener Fakhar Zaman was still not allowed to come into bat. The reason for this was his earlier absence from the field which meant he could not bat in the first 20 minutes of the Pakistan innings.\n\nThe newsroom is looking towards Babar Azam performing in Fakhar Zaman’s absence.\n\nSaud tried to hold one end down, scoring two runs in the over with Pakistan’s score at five after three overs.\n\n“The crowd LOVES Babar,” the 17-year-old enthusiast reports from the stadium as the newsroom debates his ability to score in vital matches. “Even when Pakistan were fielding, as he would come near the boundary, everyone would get out of their seats and run for the boundary and start chanting his name.”\n\nA nervy start from the pair as the Kiwi bowlers flirted with some purchase off the pitch early on. Only one single and a wide brought two from the over with Pakistan’s score at three for loss of no wicket after two overs.\n\n“You have got to adapt to what happens. I thought they would go old school with Babar Azam and Mohammad Rizwan. Pakistan need to take confidence in the chase they had against South Africa. They will know they don’t have to go crash, bang, wallop from the off,” Alex Hartley, former England bowler, on BBC Radio Sports.\n\nOverheard in the newsroom: “Still waiting for the dew!”\n\nFakhar Zaman — the only conventional opener in the side — who strained himself while fielding did not open with both part-time opening options — Saud Shakeel and Babar Azam — starting off the innings for the Green Team.\n\nMatt Henry opened the attack for the Kiwis while Saud put first runs on the board with a single in front of short midwicket, ending the first over with a single run.\n\nInnings summary by Abyan Amir: At the halfway mark, the match was destined for a thrilling second innings with New Zealand scoring 320 for the loss of 5 wickets. Latham was the top-scorer for New Zealand with a brilliant 118 not out, while Young rescued the New Zealand innings earlier with a hundred of his own after New Zealand were 3 down with just 73 on the board.\n\nDeath over bowling woes continued for Pakistan as they gave away 113 runs in the last 10 overs of the innings. Their agony was compounded by having just four men outside the 30-yard circle for the last two overs after being penalised for their slow over-rate.\n\nAt a ground where they chased down 352 with an over to spare just last week, this score is certainly attainable for team Pakistan. Hopes will be pinned on the opening pair of Babar and Fakhar to get a good start, that is, if Fakhar is allowed to open after his earlier absence from the field.\n\n“Experts”, or rather enthusiasts, within the newsroom are insisting that the dew will show up to help Pakistan chase this seemingly insurmountable total. Let us hope this is not wishful thinking.\n\nHaris, who had given 71 runs in his nine overs, leaked runs in the final as well. The pacer dismissed Phillips who was trying to ramp Haris, mistiming it to the fielder at short third man. Despite the wicket, 14 runs came in the over to take the Kiwis final total to 320 for the loss of five wickets.\n\n“It feels like too many, but we don’t know about the dew factor, will the dew come into play? What’s interesting is the Pakistan team have huddled around. They’ve chased a target like this down against South Africa recently - they will take confidence from that,” said Alex Hartley, former England bowler on BBC.\n\nDawn’s Sports In-charge Umaid Wasim says: It’s going to be a tough chase for Pakistan because now the pressure is on them. It’s a good score on a pitch that seemed to trouble New Zealand early on in their innings. The key is going to be ofcourse whether Fakhar Zaman will open for Pakistan. There’s been talk that there will be a 17-minute penalty which means that he can’t come out and open for Pakistan so who sets the tempo, what Pakistan do next? we need to wait and watch.\n\nAnalysis by Dawn sports correspondent Mir Shabbar Ali: The New Zealand fireworks, if anything, have brought the spotlight back to Pakistan’s prevailing death overs issues. The hosts’ bowlers seem clueless when they are taken on by hard-hitting batters like Glenn Phillips. Even through the middle overs, Pakistan did not look threatening when Will Young and Tom Latham easily built the base for Phillips. Pakistan, like always, need something special from the batters if they are to win this one.\n\nThe Green Team were penalised for a slow over rate and were just allowed four fielders outside the circle, rather than the usual five, ESPNCricinfo said.\n\nAnd the pendulum, it seems, has swung back to New Zealand.\n\n“This is a hammer blow when you’ve got to bring in another fielder as it creates another gap. Shaheen Shah will feel hard done by in that over. It’s an expensive over at this stage of the game. Going into the last over and New Zealand are well and truly on top,” Alex Hartley, former England bowler on BBC Radio Sports.\n\nHaris was given the same treatment by Latham on the other end, clubbing him for a six, just beating the fielder at deep square. The Kiwi batters — throughout the innings — did a remarkable job of not playing a lot of dot balls, managing pressure reasonably well.\n\nEleven came off of Haris’ ninth over to take the Kiwi score to 294 for the loss of four wickets.\n\nLatham joined the century party, completing the feat in only 95 deliveries. He did it with eight fours and two sixes.\n\nThe over started after Latham edged over a short for a boundary before Phillips dispatched Shaheen for consecutive sixes, ending the over with 18 runs. The Kiwi score stood at 283 for the loss of four wickets.\n\nNaseem tried to introduce variation to his deliveries, but the near-10-an-over run rate that the Kiwis have maintained continued. Five singles and a boundary gather nine runs for the Kiwis as the score stood at 265 for the loss of four wickets.\n\nHaris replaced Khushdil but the aggression displayed by the Kiwis continued as Phillips smashed Haris for a four and a six in the 45th over. Sixteen runs came from Haris’ eighth as the Kiwis reached 256 for the loss of four wickets.\n\nThe pressure was released even more after Latham dispatched Abrar for 16 runs in the 44th over as the south paw moved in to the 80s. The Kiwis look stable for a for a 300 score so far with the pair crossing the 50 run partnership for fifth wicket. The Kiwi score stood at 240 for the loss of four wickets after 44 overs.\n\nKhushdil continued to spin as admirable fielding in the twilight overs put the squeeze on the Kiwis. However, the building pressure was comfortably released by Phillips with a six on long off. A single and a double from the over end the 43rd over with the Kiwi score at 224 for 4.\n\nAfter a spell of pace from both ends, Rizwan brings back the spinners to find a way to put a halt to the Kiwi charge. The Kiwi’s are not necessarily being allowed to run away with the game as three runs from Abrar’s ninth over only conceded three runs.\n\nKhushdil returned to the attack as New Zealand now have six wickets in hand with 10 overs to go. Accurate spin bowling can dry up the runs, or go for run a ball which would not be the worst thing at this stage of the game.\n\nThree singles and a double end Khushdil’s sixth with the score at 212 for the loss of four wickets.\n\nAnalysis by Dawn sports correspondent Mir Shabbar Ali: “It was a classic ODI knock by Will Young. The right-hander stayed compact throughout but kept the scoreboard ticking in face of three wickets falling early into the innings. There was a bit of class about the boundaries and that six dispatched against Haris Rauf. The right-hander has set it up perfectly for the incoming Glenn Phillips.”\n\nLatham was locked in as he dispatched Naseem for a six on the second ball of the 40th over. A single and a double from the over bring nine off of it. The Kiwi score stood at 207 for the loss of four wickets after 40 overs.\n\nShaheen continued as Pakistan fell 10 minutes behind the over rate. Two wides and three singles from Shaheen end the over with five runs with the Kiwi score at 198 for four.\n\nYoung took charge as he smashed Naseem — who was brought back in the attack by Rizwan. The batter was trying to heave Naseem towards the leg side, only to top edge to Faheem Ashraf who brilliantly caught the Kiwi batter after charging in from deep square.\n\n“A slog from Will Young. Young did not venture into the shot. He tried to hit a six, but it was well caught by Faheem Ashraf, the substitute. Young has held the innings together, it’s a valuable effort,” said Ramiz Raja on BBC Radio 5 Sports.\n\nGlenn Phillips came to take the baton from the departing Will Young as the long batting line up of the Kiwis would prove to be crucial towards the end part of the first innings.\n\n“Energy is CRAZY,” confirms a 17-year-old enthusiast from the stadium to those of us watching in the newsroom.\n\nAn armchair analyst in our newsroom says “odd numbers look better in wickets”. Hint, hint, Pakistan.\n\nDawn’s Sports In-charge Umaid Wasim says: “The long-awaited breakthrough has arrived, to the joy of the Pakistan fans. Pakistan have an outlet here but now have to contain the dangerous Glenn Philips.”\n\nTwo singles and a boundary from the over gather six runs from the over bring the Kiwi total to 193 for the loss of four wickets.\n\nShaheen — brought back into the attack — was sent to the covers on the first ball by Latham via a beautiful drive through extra covers. The pacer bounced back, quite literally, with five dot balls to end the 37th over for the Kiwis, with their score at 187 for the loss of three wickets.\n\nA leading edge from Latham dropped short of the fielder at point as Pakistan desperately looked for a wicket.\n\nAfter Will Young’s century, Tom Latham notches up his own half-century. Together they have put 150 runs on the NZ scoreboard.\n\nRauf continued from the other end after an exhilarating 34th over, with Latham converting a deserving half century on the fourth delivery of the over. Consecutive half centuries against the southpaw as the Kiwis set in for a big total on what has turned into a flat surface. Hard work for the bowlers as the Kiwi scored eight runs in the 36th over to bring the total at 183 for the loss of three wickets.\n\nYoung completed his century in the 35th over with 11 fours and one six in his innings. The fourth-wicket partnership also crossed the 100-run mark as Abrar gave four singles in the 35th over to bring the Kiwi score at 175 for the loss of three wickets.\n\n“What an exceptional century that was. I like the way Will Young goes through the gears. He showed real maturity and was able to absorb that pressure when his partners were falling at the other end,” said Alex Hartley, former England bowler on BBC Radio.\n\nClose calls galore in this over.\n\nTom Latham had two close calls from the Haris over and things started to heat up in the game. He tried to pull Haris’ delivery going down the leg side, with Pakistan claiming for a caught behind. The decision was reviewed, however, a flat line on the nick-o-meter showed the batter did not edge it.\n\nLatham was then dropped by Salman on the very next delivery after he tried to pull Haris in front of square. Given two lifelines, the Kiwi batter then nailed Haris for a boundary on the fifth delivery. Seven runs from the over brought the Kiwi score at 171 for the for the loss of three wickets.\n\nOne question for the cricket experts out there: “We know there’s a doosra. Is there such a thing as a teesra?”\n\nAbrar continued with his seventh over as Young reached 99. An exceptional innings from the Kiwi batter. Five runs from the over brought the Kiwi score at 164 for the loss of three wickets.\n\nRizwan brought back Haris Rauf after drinks, who gave eight runs as nothing seemed to work for the home side. Young chopped down a length delivery for a boundary on the last ball of the over and moved to 96. A brilliant inning the opener so far brought the Kiwi score to 159 for the loss of three wickets.\n\nRizwan opted for spin this time from both ends, as he gave Abrar the ball to try and get a wicket. Three dots and three singles end a reasonably good over Pakistan, however, the Kiwi batters look unfazed by it. The partnership for the Kiwi pair stood at 78 from 88 balls as they now eye a 300+ score for their side.\n\n“New Zealand feel like they’ve been here a month, by all accounts. They’re probably not too nervous about the position they’re in. They can use that last 20 overs as a T20 format,” Katey Martin, Former New Zealand wicketkeeper on BBC Radio 5 Sports Extra.\n\nAmid NZ’s heroism, Pakistani fans in the stands have been displaying a spirit of sportsmanship. As Dawn’s sport’s Incharge Umaid Wasim notes, Pakistani fans have been cheering for the Kiwi batters as well.\n\nKhushdil was dispatched for two boundaries by Latham in his fifth over, conceding nine from it. Three dots and a single bring the Kiwi score to 148 for the loss of three wickets.\n\nFrom a fanboy who bleeds green in the newsroom: “It’s been three wickets for a while now, Pakistan.”\n\nThe bails went flying in the 29th over as Pakistan went up to the third umpire for a review for a run out. However, Young — who has been flawless so far — was comfortably safe. Naseem was also dispatched for a boundary on the second ball with Young looking to score quickly. An expensive over ended from Naseem giving away 10 runs in his seventh over with the Kiwi score at 139 for three after 29 overs.\n\nThe Kiwi side continued their strike rotation, gathering five runs from Khushdil’s fourth over. The Kiwi side will look to accelerate and up the ante if the Green Team does not get a wicket. The Kiwi score stood at 129 for the loss of three wickets after 28 overs.\n\nThe eight-team Champions Trophy launched in Karachi with the home side facing New Zealand at the sell-out 29,300 National Stadium.\n\n“Pakistan are unpredictable, they can surprise anytime,” said 24-year-old Kashif Khan, queueing in the morning with his Rs5,000 ticket.\n\nFans were adamant India would have been welcomed.\n\n“If India were here I would arrange a trail of rose petals leading them to the stadium,” Kashif said. “We love the Indian team in the same way that we love the Pakistani team — because it’s all about cricket.”\n\nSofia Babar, aged 45, was in the stands in Karachi during Pakistan’s 1996 tournament as World Cup co-hosts with India and Sri Lanka.\n\nQueueing today, she said: “I want my daughter to experience what I did all those years ago.”\n\n“It’s my first international match,” said 29-year-old Abdul Latif, whose age matches the hiatus global tournaments have taken from Pakistan.\n\n“I didn’t want to miss it,” he said, queueing with friends.\n\n“We want to show the world that Pakistan is safe,” said 53-year-old Asif Majeed, a third-generation Pakistani who travelled from his home in Britain to watch the match.\n\n“Win or lose, this event will do wonders for Pakistan’s image globally.”\n\n“Everybody’s excited and expecting good cricket because it’s happening in Pakistan,” Karachi Mayor Murtaza Wahab told AFP.\n\nBut 65-year-old fan Muhammad Yaseen struck a far more relaxed tone. “We don’t feel any tension,” he said. “Our hearts are alive.”\n\n“There is also less work as people prefer to stay at home and watch the match,” said Muhammad Arif, who works with a ride-hailing service.\n\n“But I know how important it is for Pakistan’s image, so it’s a small sacrifice on the part of people like us.”\n\nNaseem’s return spell encapsulated Pakistan’s mix of control and near-misses in the middle overs, with Young and Phillips continuing to negotiate the bowling intelligently.\n\nThe over looked set to be another tight one from Naseem until the final delivery was punished to the boundary. Earlier in the over, Pakistan had a glimmer of hope when a leading edge off the fourth ball failed to carry — another example of the bowlers creating half-chances without reward.\n\nWith Rizwan shuffling his bowlers in search of that elusive breakthrough, New Zealand have moved to 124/3 after 27 overs, setting up what could be a crucial period in their innings. Young continues to anchor the innings, while Pakistan know these next 10 overs could well determine the course of the match.\n\nAs Alex Hartley says on BBC Radio 5 Sports Extra: “If this partnership stays together for another 10 overs New Zealand can get above 300. If Pakistan can break it you would think 250 is on for them.”\n\nSalman’s third over yielded six valuable runs for New Zealand as both Young and Phillips displayed smart cricket, rotating the strike efficiently with well-judged singles and doubles.\n\nYoung, now on 76 off 86 deliveries including eight crisp boundaries and one six, has been the backbone of this innings, doing well in Pakistani conditions. His ability to keep the scoreboard moving against spin has been stellar, and with the innings at a crucial juncture, his progression from here could well determine the final outcome of New Zealand’s batting effort.\n\nShaheen conceded three singles in the 25th over, bringing the Kiwi total to 113 for three. Pakistan desperately looking for a wicket as Kiwi batters are getting very comfortable in the middle.\n\nSalman continued from the other end as boundaries started trickling for Kiwis. Latham dispatched Salman for a boundary on the third delivery of his second over. Three dots to end the over collected five runs from the over with the New Zealand score at 110 for three after 24 overs.\n\nYoung began to settle in as he dispatched Shaheen for a boundary on the fourth delivery of the 23rd over. Three more singles came from it as Kiwi score crossed the 100 run mark, standing at 105 for the loss of three wickets.\n\nVice Captain Salman Ali Agha replaced Khushdil for the Green Team. An around the wickets approach from the all rounder gave away three runs in the 22nd over with the Kiwi score at 98 for the loss of three wickets.\n\nOverheard in the newsroom: “Young is getting old [as Pakistani bowlers struggle to get him out]!”\n\nSkipper Rizwan calls on pace ace Shaheen again because the Kiwi batters are getting too comfortable. A single from this over brings the Kiwi score to 94 for the loss of three wickets. A good over by Shaheen.\n\nYoung then sweeped Khushdil for a boundary after Latham gave him strike with a single on the second ball of the 20th over. Young might be looking to settle in as he moves into the 60s. The Kiwi score stood at 93 for three after 20 overs.\n\nApparently it’s Azhar Ali’s birthday. Azhar Ali hit a 50 in the 2017 Champions Trophy final. Happy Birthday champ!\n\nMeanwhile, here are some nice reactions to consume to celebrate Haris Rauf’s big wicket (swipe through to see them all).\n\nMatch summary by Abdul Sattar Abbasi: At the 20-over mark of the Champions Trophy opener in Karachi, New Zealand find themselves in a challenging position after Pakistan’s decision to bowl first under expected dewy conditions. Despite Will Young’s promising start, standing in for the injured Rachin Ravindra, the Kiwis’ innings has been significantly dented by precise bowling from Pakistan’s attack.\n\nThe turning point came through Abrar Ahmed’s crafty carrom ball that deceived Convay, followed by Naseem Shah’s perfect delivery to dismiss Kane Williamson for a rare single-digit score — his first since January 2019. The pressure mounted as Haris Rauf, returning from his side strain, removed the usually reliable Daryl Mitchell for 10 off 24 balls. Young continues to hold the fort, having registered his third ODI 50 in Pakistan, but with the middle order being tested against a full-strength Pakistani bowling lineup featuring the returning Rauf, the visitors face an uphill task in setting a competitive total.\n\nYoung then pulled Haris in front of mid-wicket for a wonderfully timed boundary. The batter collected five runs from the over to bring the total to 86 for the loss of three wickets.\n\nYoung brings up his half-century after dispatching five fours and a six in his innings so far. A very stable innings from the opener despite repeatedly losing wickets on the other end.\n\nMeanwhile, as Pakistani fans face the possibility of an injured Fakhar Zaman, meme-ers are coping well with an arguably terrible situation.\n\nKhushdil Shah continued from the other end leaking three singles in his second over bringing the Kiwi score to 80 for three. The New Zealand side is again looking to settle their innings.\n\nMitchell was the next to depart for New Zealand after he was dismissed by Haris, caught by Shaheen Afridi at mid-on. A major breakthrough Pakistan as the dangerous Mitchell departs with the Kiwi score at 73 for the loss of three wickets.\n\nTom Latham — who scored a half-century in the final of the tri-series — came out to bat for the Kiwis. A double on the fourth delivery and two singles from subsequent deliveries ended the 17th over with score at 77 for the loss of three wickets.\n\nDawn’s sports correspondent Mir Shabbar Ali says: “The pitch does have something for the bowlers too. And it showed when Abrar made the ball move away enough to dislodge Devon Conway’s stumps. And how Naseem was rewarded for his nagging line and length to get the better of Kane Williamson was an indication towards the sporting nature of the surface.”\n\nThe stands are filling up a bit more, as Pakistani audiences continue the age old tradition of being fashionably late. Khushdil Shah was brought into the attack by skipper Rizwan from the University End replacing Abrar. Two singles from the over brought the Kiwi score to 73 for the loss of two wickets.\n\nThe pendulum swings in the other direction. We’re getting whiplash over here. Phew!\n\nHaris continued from the other end as the Kiwi batters continued to rotate the strike gathering three runs from the 15 over. Kiwi score stood at 71 for the loss of two wickets after 15 overs as drinks were called.\n\nThe Kiwi batters settled in as they continued to rotate the strike. Four singles and two dot balls bring the Kiwi total to 68 for the loss of two wickets after 14 overs.\n\nAn update on Fakhar Zaman: He is being assessed and examined for a muscular sprain and further updates will be provided in due course, according to the PCB. Fakhar was injured earlier during fielding.\n\nHaris Rauf, who was away since earlier this month recovering from an injury, was welcomed by Young with a six towards deep square. It was a top edge that went high but comfortably cleared the rope for their first six of the innings.\n\nA single and a wide brings eight runs from Haris’ first over, adding eight runs to the Kiwi innings, with the score at 64 for the loss of two wickets after 13 overs.\n\nPakistan’s efforts to stop the squeeze the Kiwis’ was ruined by an inside edge boundary in Abrar’s fourth over after four dot balls. A single to end the over bring five from it with New Zealand score at 55 for the loss of 2 wickets after 12 overs.\n\nAn excellent over by the Naseem was compromised by not-so-great fielding bringing two from it. The Kiwi score stood at 50 for the loss of two wickets after 11 overs.\n\n“There’s value to bowling a short ball. You might not get it right first time, but there’s a possibility of picking up a wicket. That got to Daryl Mitchell a bit quicker than he expected it to. A dolly catch at mid-on,” says Ramiz Raja on BBC Radio 5 Sports Extra.\n\nDarryl Mitchell is another obstacle that Pakistani bowlers need to surmount. He is also one of the steadiest New Zealand batters.\n\nHigh from his breakthrough, Abrar thunders from the other end as Kiwi batters looked to settle their innings. Three singles in the 10th over ended the Powerplay with the Kiwi score at 48 for the loss of two wickets. An interesting field to start the 11th over from Naseem with a short leg and slip in place. It seems as the pacer will try to bounce out the Kiwis.\n\nNaseem dismissed Williamson on the first delivery of his fourth over after finding some movement from the pitch. A good length delivery moving away from the right-hander trying to defend the ball with the full face of the bat, meets the edge and is caught behind by Rizwan.\n\nA picture perfect wicket for a swashbuckling fast bowler. And for that to be the legend himself works as a cherry on top.\n\nPakistan’s nemesis Daryl Mitchell came out to bat. Unfazed by a delivery missing his outside edge, the Kiwi batter dispatched an in-swinging delivery at the stumps for a boundary on midwicket. The Kiwi score stood at 45 for the loss of two wickets nine overs.\n\nSampath Bandarupalli, ESPN Cricinfo stats whiz, notes Williamson had gone 35 consecutive ODI innings without being dismissed under 10 runs before today.\n\nWATCH: Our pre-tournament thoughts with Dawn’s very own Umaid Wasim and Mir Shabbar Ali.\n\nAbrar drew first blood after he dismissed Conway on the third delivery of his second over as the change from the skipper bore fruit. New Zealand’s score stood at 39 after losing their first wicket, bringing the Kiwi legend Kane Williamson out to bat. A beautiful delivery from the leggie went away from Conway missing his outside edge and crashing into the stumps.\n\nA single from the rest of the over brought the score to 40 after the end of eight over with one Kiwi batter back in the pavillion.\n\nNaseem continued from the other end as Shaheen was replaced, but to no avail as Young continued with confidence dispatching Naseem for a boundary through covers on the third delivery of the seventh over. A single and a bye ended the seventh over for Kiwis with the score at 39\n\nThe first bowling change took place for the Green Team in the sixth over with skipper Rizwan bringing leggie Abrar Ahmed on attack, replacing Naseem. A decent start from the leg spinner saw only two runs come off the bat as a wide brings the total to three from the over. The Kiwis stand at 33 for the loss of no wickets after six overs.\n\nMeanwhile, six overs down and stadium yet to fill up (cricket fans, where you at?).\n\nDawn sports correspondent Mir Shabbar Ali says: “I believe Pakistan are more comfortable with chasing than defending. That looks like the only logical reason behind Pakistan’s decision to bowl first.\n\nThe pitch doesn’t seem to have anything in it. And its not like dew will come into play later on.\n\nA tight over from Shaheen was ruined on the last ball of the delivery as Young dispatched his delivery with a beautiful square drive. A crack coming from Young’s bat as two runs on the third delivery brought the over’s total to 6.\n\nKiwi stand at 30 after the end of fifth over, pacing their innings with an economy of six.\n\nWin probability is slowly swinging in NZ’s favour as the fifth over begins.\n\nYoung dispatches Naseem on the first ball of his second over for a boundary after a full delivery onto the pads. NZ batters are sly and are scoring the majority of their runs behind the keeper Rizwan.\n\nNaseem reined his line in a little, but was still on the leg side enough for Young to collect two. Young then collected a single on the fifth delivery as the opener tried flex his muscles. A dot to finish collected 7 runs from the over, bringing the Kiwi total to 24 for the loss of no wickets.\n\nThe over begins with two dots, after which another mistimed shot by Young sends the ball just shy of the boundary as the Kiwis collect another three runs. The outfield has been lightning quick so far, as the newsroom debates whether sending NZ out to bat was a good idea.\n\nAnother half pulled shot takes the ball to the covers for Kiwis second boundary of the innings behind the wicket keeper. Two singles to finish the over adds 9 runs to the Kiwis total bringing it to 17 for the loss of no wickets. Scrappy, but effective so far from the Kiwis.\n\nFrom the other end, Naseem Shah kept things keeps things tight with three consecutive dot balls to Conway, showcasing exemplary control in that corridor outside off. Young then picked up a single with a mistimed flick towards long-on, followed by another scratchy single through the covers that dragged to the long-on region.\n\nA thick inside edge on the fourth delivery brought New Zealand’s first boundary of the game. The lack of timing from the Kiwi bowlers suggests the pitch is not as easy to bat as it seemed early on. Naseem ends with a dot to bring New Zealand’s score to eight at the end of second over.\n\nThe Kiwi openers, while not looking entirely comfortable, have managed to move to 11 without loss in the second over, negotiating the early movement from Pakistan’s formidable new-ball pair.\n\nShaheen Afridi starts the over to Devon Young. There was no run; a classic new-ball delivery from the left-armer. He pitches on a good length just outside off, Young watchfully lets it pass through to the keeper, setting the early tone under these balmy conditions.\n\nThen Afridi bowls to Young, which he puts away for 3 runs, slightly full, driven through covers, not quite timed but enough to pierce the field, but there’s drama here! Fakhar puts in a full-length dive to prevent the boundary, but he’s come up grimacing. The physio’s been called out and – yes – Fakhar’s going to leave the field. Kamran Ghulam jogs on as the substitute fielder. Not what Pakistan needed, losing a key player so early in this crucial encounter.\n\nNow Conway will face his first ball with the score 3/0. Ready for the next delivery as Shaheen runs in again.\n\nFour back to back dots see Shaheen end the first over after giving away three runs.\n\nThe respective national anthems of the teams are being played as PCB chairman Naqvi, President Asif Zardari and his daughter MNA Aseefa Bhutto-Zardari are in attendance.\n\nPakistan spent nearly a decade in the wilderness of international cricket after gunmen attacked the Sri Lankan cricket team’s bus in Lahore in 2009, wounding six players. Top teams shunned Pakistan after the attack and it took the Pakistan Cricket Board (PCB) years to convince foreign counterparts that it was safe to visit.\n\nAfter losing the hosting rights to the 2009 Champions Trophy, Pakistan was also ruled out as co-hosts of the 2011 World Cup.\n\nAll seven teams, except India, will play in Pakistan for the current event in the three major cities.\n\nFans began gathering outside the main gate of the stadium a few hours before the tournament kicked off, excited to witness the Green Shirts perform on their home ground.\n\nPakistan: Fakhar Zaman, Babar Azam, Saud Shakeel, Mohammad Rizwan (C/WK), Salman Ali Agha, Tayyab Tahir. Khushdil Shah, Shaheen Afridi, Naseem Shah, Haris Rauf and Abrar Ahmed\n\nNew Zealand: Will Young, Devon Conway, Kane Williamson, Daryl Mitchell, Tom Latham (wk), Glenn Phillips, Michael Bracewell, Mitchell Santner (C), Matt Henry, Nathan Smith, Will O’Rourke\n\nUmpires: Richard Kettleborough (ENG) and Sharfuddoula (BAN)\n\nTV umpire: Joel Wilson (WIS)\n\nMatch referee: Andrew Pycroft (ZIM)\n\nAdditional reporting by Mir Shabbar Ali and Umaid Wasim.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/192148034f95e48.jpg",
  "retrievedAt": "2025-08-25T19:44:04.046Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892967/tail-enders-give-pakistan-respectable-end-as-clinical-nz-win-champions-trophy-opener",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T08:37:50.000Z"
}
