{
  "title": "Need for edible oil import jetty stressed - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: While supporting the establishment of a new dedicated jetty for edible oil, Maritime Affairs Minister Qaiser Sheikh on Tuesday said that the proposal would be further evaluated after consulting all stakeholders.\n\nHe emphasised that importing edible oil through Pakistan National Shipping Corporation (PNSC) vessels would help save valuable foreign exchange. Additionally, the tax exemptions for FATA and PATA would not be extended in the upcoming budget.\n\nDuring a visit to the Pakistan Vanaspati Manu­facturers Association (PVMA), Qaiser Sheikh announced the formation of a committee comprising representatives from PVMA, Port Qasim, Pakistan National Shipping Corporation (PNSC), and the Ministry of Maritime Affairs to address industry concerns and formulate solutions.\n\nThe minister disclosed that the PNSC has decided to add four more cargo ships to its 12-vessel fleet. He emphasised that alternative solutions would be explored in consultation with the industry, including chartering vessels. The government will provide the necessary facilities if expanding jetty capacity improves the situation.\n\nHe also assured PVMA members that steps would be taken to ensure the release of their blocked payments at utility stores.\n\nHe also revealed that MAERSK Lines is interested in investing $2bn in Pakistan’s port and shipping infrastructure. He acknowledged that demurrage charges at ports were causing significant financial losses to the industry. He promised the ministry was committed to resolving these issues.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:32:04.316Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892907/need-for-edible-oil-import-jetty-stressed",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:54.000Z"
}
