{
  "title": "Pakistan no longer isolated on world stage, says Ishaq Dar - Pakistan - DAWN.COM",
  "author": null,
  "content": "• At UN Security Council, FM Dar calls for global financial reform; expresses support for peace in Palestine\n• Calls for fresh approach to deal with terrorism; discusses economic and strategic ties with Chinese counterpart\n\nWASHINGTON: On his first visit to the US after the Trump administration took office, Deputy Prime Minister and Foreign Minister Ishaq Dar boasted that Pakistan had broken its diplomatic isolation through active diplomacy, and called for sweeping global reforms and strengthening the UN to create a more inclusive international order.\n\nIn remarks made on separate occasions, Mr Dar said Pakistan was no longer isolated in the global community, adding that the country’s economy was set to take off as a result of his government’s hard work.\n\nAddressing a high-level UN Security Council debate hos­ted by China, Mr Dar underscored the urgent need for restructuring both the UN and global financial institutions.\n\nThe existing frameworks have “failed to resolve long-standing conflicts and economic disparities”.\n\nHe pointed to unresolved crises — the war in the Middle East and Jammu and Kashmir dispute — and criticised the UN’s inability to enforce its resolutions and uphold its core principles.\n\nHe stressed the need for a system that is “more democratic, representative, and accountable,” one that truly serves the interests of all nations rather than a privileged few.\n\nThe foreign minister also reiterated Pakistan’s firm stance on India-held Kashmir, emphasising the right to self-determination for Kashmiris as enshrined in UN Security Council resolutions.\n\nThe minister said the ongoing tragedy in Palestine was evidence of “the failure to uphold the [UN] Charter and its principles”.\n\nThe January 15 ceasefire agreement between Hamas and Israel “offers a glimmer of hope” for a permanent ceasefire, Mr Dar added.\n\nHe also called for immediate and adequate aid to the Palestinian people.\n\nHe said Pakistan “fully supports the ceasefire agreement” and sees the two-state solution as “the only viable path to lasting peace between Israel and Palestine.”\n\nThe foreign minister called for a unified, non-discriminatory approach to combat terrorism, rejecting double standards in dealing with extremist threats.\n\nHe noted Pakistan’s sacrifices in the fight against terrorism and emphasised the need for an international strategy that does not conflate legitimate struggles for self-determination with terrorism.\n\nHe also highlighted cross-border threats from Afghanistan, particularly attacks by the Tehreek-i-Taliban Pakistan.\n\nWhile reaffirming Pakistan’s commitment to regional stability, he called on the Afghan government to take decisive action against terrorist groups operating from its soil.\n\nDespite security challenges, Pakistan remained committed to supporting Afghanistan’s humanitarian needs and long-term economic development, he added.\n\n‘Economic turnaround’\n\nEarlier, in an interaction with the Pakistani community in New York, Mr Dar painted an optimistic picture of Pakistan’s economic trajectory.\n\nHe cited the drop in inflation from 40 per cent to just 2.4 per cent as of January 2025 as an example of effective government policies and robust diplomatic efforts.\n\n“We are no longer isolated,” he said, adding that Pakistan now has many friends in the international community.\n\nHe encouraged the diaspora to contribute to the nation’s progress and urged them to increase remittances, invest in Pakistan, and explore business opportunities through the Special Investment Facilitation Council.\n\nHe also revealed plans to resume Pakistan International Airlines flights to New York, a move to strengthen economic and people-to-people ties.\n\nStrategic ties with China\n\nMr Dar also met China’s Foreign Minister Wang Yi and reaffirmed the deep-rooted friendship between the two countries.\n\nCalling China the “cornerstone” of Pakistan’s foreign policy, he lauded Beijing’s steadfast support for Pakistan’s sovereignty and its stance on Jammu and Kashmir.\n\nThe meeting focused on strengthening economic and strategic ties, with both sides expressing satisfaction over the progress of the China-Pakistan Economic Corridor.\n\nThe two leaders committed to enhanced multilateral cooperation, pledging to work closely on regional and global challenges, from economic disparities to security threats.\n\nThey emphasised the need for a balanced, just, and multipolar world order where no single country dominates at the expense of others.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1909123953e0572.jpg",
  "retrievedAt": "2025-08-25T19:44:48.034Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892851/pakistan-no-longer-isolated-on-world-stage-says-ishaq-dar",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:31.000Z"
}
