{
  "title": "Dream of hosting world cricket becomes reality - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The cricketing world has descended upon Pakistan — at long last. It’s a moment that’s been 29 years in the making, but that long wait will be worth it when Pakistan square off against New Zealand in the Champions Trophy opener at the National Bank Stadium on Wednesday.\n\nThe euphoria of holding an ICC tournament for the first time since 1996 is palpable; the routes to the venue are decked out in Champions Trophy branding, the stadium is decorated in bright green and blue hues, and President Asif Ali Zardari is expected to be in attendance at the opening game.\n\nAccording to Pakistan Cricket Board (PCB) chief Mohsin Naqvi, “Pakistan is fully prepared for the Champions Trophy”. But some fans are still struggling to come to terms with the sense of occasion.\n\n“If someone in 2015 told me that England and Australia will come to Pakistan, I’d have definitely laughed it off,” Mohammad Abdullah, a fan, told Dawn on Tuesday.\n\n“I’d have deemed it delusional. When Pakistan were announced as Champions Trophy hosts, I was only expecting it to be called off eventually. So, it’s a huge victory for Pakistan already.”\n\nTournament ends anticipation for a generation of Pakistanis who have been waiting for international cricket’s return\n\nPakistan has surely come a long way to host an ICC event for the first time after 1996 when the country’s status as a safe cricketing venue was stripped following an attack on the Sri Lankan team bus in Lahore in 2009.\n\nThat year, Pakistan lost the hosting rights to the 2009 Champions Trophy and was ruled out as co-hosts of the 2011 World Cup.\n\nAn era of empty, silent stadiums followed.\n\nFormer PCB chairman Najam Sethi, who was at the helm of the board when Zimbabwe became the first team to visit Pakistan after the 2009 tragedy, said the Pakistan Super League played a huge part in convincing teams to tour the country.\n\n“It was quite difficult [to convince teams to tour],” Mr Sethi told Dawn. “But the [advent] of PSL proved that security could be managed.”\n\nBoon for Pakistan cricket\n\nSixteen years on, international cricket has made a gradual return to Pakistan. More recently, the country’s stadiums have been renovated and upgraded for the Champions Trophy.\n\nIn an ambitious move by the Mohsin Naqvi-led PCB, the renovation work was completed in a little over 100 days, with Lahore’s Gaddafi Stadium and Karachi’s National Stadium undergoing major plastic surgery.\n\n“Pakistan have proved themselves as great hosts in the past and they will do so in the Champions Trophy as well,” former Pakistan captain Rashid Latif told Dawn. “This is a great opportunity for Pakistan to show their event organising capability to the world.”\n\nBut the Gaddafi Stadium will not host a single group match involving Pakistan.\n\nThe host team’s matches, which were initially scheduled by the PCB to be held in Lahore, had to be shifted to Dubai following India’s refusal to travel across the border for the tournament.\n\nThe decision was taken under the ‘hybrid’ model, which would see Pakistan play their 2025 Women’s World Cup and 2026 T20 World Cup matches outside host country India.\n\nFormer PCB chairman Ehsan Mani, who also served as the ICC president between 2003 to 2006, feels the tournament shouldn’t have been divided across two countries.\n\n“.. [H]ow the number of matches in Pakistan were truncated due to India’s refusal to tour was unfortunate,” he told Dawn. “The ICC should have dealt with the matter in a better way and ensured the tournament is held in Pakistan in its entirety. For me, it’s an abject failure on the ICC’s part.”\n\nBut he hoped the Champions Trophy would bring other benefits for Pakistan cricket.\n\n“It is definitely big for Pakistan to host an ICC event for the first time since 1996,” he said. “It should help Pakistan showcase itself to the world, its openness for both sport and business.”\n\nReaction from across the border\n\nThe Champions Trophy coming to Pakistan also triggered reactions within the Indian media, mostly critical views over Pakistan’s perceived lack of preparedness for the event.\n\nEven Pakistan’s name on the tournament’s logo — also printed on the Indian jersey — as hosts elicited outrage across the border.\n\nDespite the hostile narratives in India, Mr Sethi was positive that cricket relations would improve between the two countries over time.\n\n“I believe that sooner than later, India and Pakistan will resume bilateral cricket ties,” he said. “All that is needed is a diplomatic thaw between the governments of India and Pakistan.”\n\nFor that to happen, Pakistan would need to win the most anticipated fixture of the tournament against their arch-rivals. Led by Mohammad Rizwan, their recent losses against New Zealand in the tri-nation had raised questions over Pakistan’s prospects.\n\nAs compared to favourites India and New Zealand, Pakistan are short on specialist spinners and match-winning batters.\n\n“Organisation-wise, the PCB has done well, but to make an impact on the cricketing level, Pakistan need to win all their matches and hopefully the title,” Mr Latif noted.\n\nKeeping the cricketing shenanigans aside, it’s important for Pakistan to celebrate the arrival of the Champions Trophy.\n\n“Hosting an event of this magnitude makes us a part of world cricket’s celebrations,” another ex-PCB chief Ramiz Raja told Dawn.\n\n“From a global perspective, it can’t get better than this for Pakistan. It makes a positive impact on the nation’s psyche. The onus is now on us to deliver. We need to be rock solid in presentation and execution. Most importantly, we need to savour it and enjoy it.”\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67b4fce05d138.jpg",
  "retrievedAt": "2025-08-25T19:44:49.286Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892854/dream-of-hosting-world-cricket-becomes-reality",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:31.000Z"
}
