{
  "title": "Current account changes track, posts $420m deficit in Jan - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The current account posted a deficit of $420 million last month, almost the same as in Jan 2024, but the deficit slashed a rising surplus accumulated during the current fiscal year (FY25).\n\nFinancial market experts see the situation as alarming since the January deficit reflected a growing pressure on the country’s foreign exchange reserves. Even though remittances grew by $5 billion during the first seven months of the current fiscal year, the current account posted a deficit.\n\nAccording to data issued by the State Bank on Tuesday, the deficit stood at $420m last month — a marginal rise over $404m in January last year.\n\nBut December posted a surplus of $474m, raising the total for the first six months of FY25 to $1.2bn. The July-Jan period of FY25 still shows a surplus of $628m, compared to a deficit of $1.8bn in the same period of the last fiscal year.\n\nJuly-Jan current account shows surplus with $628m\n\nBoth the finance ministry and the State Bank are of the view that the current account would be plus or minus by 0.5 per cent of GDP at the end of FY25.\n\nThe State Bank’s foreign exchange reserves have been declining even though it purchased dollars from the inter-bank market. The SBP purchased $3.8bn from commercial banks during the first four months of the current fiscal year (July to October) to improve its reserves and repay foreign debt.\n\nHowever, the central bank’s reserves fell by $1bn in eight weeks — from Dec 13 to Feb 7.\n\nHigher remittances\n\nBankers said the unexpectedly higher remittances provided enough liquidity in the inter-bank market, helping SBP buy dollars to reach the target of $13bn by the end of FY25.\n\nAccording to the State Bank, export of goods rose to $19.2bn during the first seven months of FY25 — an increase of $1.349bn.\n\nThe increase in imports was larger than exports as the former went up by $3.27bn to $33.314bn during this period. Exports of services slightly increased to $4.749bn, compared to $4.473bn in the same period of the previous fiscal year.\n\nImports of services did not show any significant change, registering $6.678bn compared to $6.121bn of the last fiscal year.\n\nThe balance on trade in goods and services during July-Jan FY25 was negative at $16.068bn. The balance was in the negative at $13.866bn during the same period of last year.\n\nSo far the government is on the safe side with the current account surplus, but the trend shows the current account surplus would change soon with the deficit.\n\nIn case of the current account deficit in coming months, the biggest loss could be the destabilisation of exchange rate. The exchange rate has been stable for more than a year, protecting the economy from dollarisation.\n\nIf the exchange rate destabilises, the demand for dollars would shoot up and the entire balance sheet of external account would be upset.\n\nThe huge task of external debt servicing is still unresolved while the IMF’s scheduled mission next month is expected to ask the country for sources to repay the debt during FY25.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:31:28.240Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892904/current-account-changes-track-posts-420m-deficit-in-jan",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:54.000Z"
}
