{
  "title": "Foreign debt inflows plunge 38pc in July-Jan - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Amid a 66 per cent plunge in foreign inflows in the first half of FY25, the Economic Affairs Division (EAD) blocked the release of monthly data on external assistance for more than a month until a partial improvement to 38pc decline in seven months.\n\nThe EAD released two separate sets of debt data on Tuesday. In the first six months of the current year, foreign debt inflows amounted to $3.6bn, almost 66pc lower than $5.968bn in the same period last year. In an unprecedented step, the data was not released last month, although it is always uploaded on the website in the third week of the following month.\n\nThe second data set put total inflows at $4.585bn in July-January, which was also 38pc lower than the $6.31bn in the same period last fiscal year. The lower inflows this year were apparently because of delays in securing a bailout from the International Monetary\n\nFund (IMF) and subsequent $1bn disbursements.\n\nIn its monthly report on Foreign Economic Assistance (FEA) released on Tuesday, the EAD said that against its annual target of $19.4bn, total FEA in July to January amounted to $4.58bn when compared to $6.31bn in the same period last year with an annual target of $17.6bn.\n\nThis does not include about $1bn disbursed by the IMF on the last day of September 2024, which is accounted for separately by the State Bank of Pakistan, thus putting the total inflows at $5.58bn.\n\nLast fiscal year, the IMF had approved the 9-month $3bn Standby Arrangements and had released about $1.2bn in the first half of July that, helped Pakistan to put together a healthy tally of $2.9b in July alone. In comparison, inflows in July 2024 struggled at just $436 million.\n\nIn January, the EAD reported monthly inflows at $830m compared to $332m last year.\n\nThe EAD said that out of $4.585bn inflows in the first seven months, about $2.54bn were received for budgetary support or programme loans and the remaining $2.045bn for project financing. During the same period last year, EAD secured about $4.5bn as project aid and remaining over $1.8bn as programme loans.\n\nOf the total, inflows from multilateral stood at $2.322bn in 7MFY25 compared to $2.4bn in 7MFY24, while bilateral disbursements stood at $329m against $794m last year.\n\nThe EAD reported receiving about $500m from foreign commercial lenders in 7MFY25, showing a minor recovery from commercial banks that had stayed away from financing Pakistan last year. It may be noted that the government has budgeted $3.8bn financing from foreign commercial banks for the current year, showing a poor start, again due to the delayed IMF umbrella.\n\nThe government has also targeted the issuance of $1bn in international bonds.\n\nAnother major projection of $9bn inflows from bilateral partners — China and Saudi Arabia — targeted for the current fiscal year has also not materialised yet. Still, these are likely to be realised in the second half of the fiscal year. These projections include a $5bn time deposit from Saudi Arabia and a $4bn China SAFE deposit. These projections are critical for Pakistan to meet its external financing gap as part of the IMF programme.\n\nIn addition, Pakistan also received $1.127bn inflows from overseas Pak­istanis through Naya Pakistan Certi­ficates compared to $590m last year.\n\nThe Asian Development Bank led the multilaterals with a $1.49bn disbursement in 7MFY25, taking over the World Bank, which doled out $1.058bn. Last year, the ADB had released only $620m in seven months.\n\nADB was followed by the World Bank, which extended about $600m in seven months this year against $1.058bn last year.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:31:39.411Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892903/foreign-debt-inflows-plunge-38pc-in-july-jan",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:08:54.000Z"
}
