{
  "title": "Pakistan dispels alleged ‘mistreatment’ of Afghan refugees - Pakistan - DAWN.COM",
  "author": null,
  "content": "Foreign Office (FO) Spokesperson Shafqat Ali Khan on Wednesday issued a statement asserting that Afghan refugees in Pakistan were treated with “respect and dignity”, expressing hope that Kabul will create conducive conditions“ to receive refugees repatriated from Pakistan.\n\nThe spokesperson’s comments come a day after the Afghan Embassy in Islamabad issued a statement echoing the words of the acting Afghan Charge d’Affaires, alleging that Afghan refugees in Pakistan were being “arrested without warning or formal correspondence” and that the Pakistani government intended to expel all Afghans, even those with documents permitting their stay.\n\nThe embassy alleged that Afghan nationals in Islamabad and Rawalpindi were recently subjected to arrests, searches, and orders from the police to leave the twin cities and relocate to other parts of Pakistan.\n\nIn today’s statement, the FO spokesperson said that the assertions made by the acting Afghan Charge d’Affaires were “misplaced”.\n\n“I would like to remind him that Pakistan has hosted millions of Afghans for decades with respect and dignity, while extending traditional hospitality, sharing its resources and services such as education and health, even with very little international support,” Khan said.\n\nHe added that there were mechanisms within Pakistan’s Illegal Foreigners Repatriation Plan (IFRP) “to ensure that no one is mistreated or harassed during the repatriation process”.\n\n“We also extensively engaged the Afghan side to ensure smooth repatriation of Afghan nationals,” Khan added. “While Pakistan has done what it could, we expect interim Afghan authorities to create conducive conditions in Afghanistan so that these returnees are fully integrated into the Afghan society.”\n\nKhan added, “The real test of Afghan authorities would be to ensure that rights of these people about whom the Afghan Cd’A (Charge d’Affaires) talked are protected in Afghanistan.”\n\nOver 18,000 Afghan nationals returned to their country from the twin cities of Rawalpindi and Islamabad in January this year, with repatriations in the second fortnight of the month slightly higher than the first fortnight.\n\nAccording to the International Organisation for Migration (IOM), the pace of deportation of Afghan nationals from the Islamabad Capital Territory (ICT) and Rawalpindi has increased.\n\nBetween January 16 and 31, 291 heads of households were interviewed through a flow monitoring registry (FMR) form, while 9,846 Afghan returnees were identified through border crossing points of Torkham, Chaman, Ghulam Khan, Badini, and Bahramcha.\n\nSince September 15, 2023, at least 824,568 individuals have returned to Afghanistan while 2 per cent (18,577) of this total have returned since January 2025, the IOM said.\n\nThe majority of returnees are individuals between 18 and 59 years of age (46pc) and individuals between 5 and 17 years of age (30pc). Of the children under 10 who crossed the border, 502 had received polio vaccination.\n\nThe biweekly report said that 10pc of the returnee households were women-headed households, adding that no child-headed households were recorded during the said period. More men (52pc) than women (48pc) returned during the reporting period.\n\nAdditional reporting by Amin Ahmed",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:44:01.937Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893005/pakistan-dispels-alleged-mistreatment-of-afghan-refugees",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T13:29:10.000Z"
}
