{
  "title": "Man awarded life imprisonment, Rs500,000 fine by Rawalpindi court for raping niece - Pakistan - DAWN.COM",
  "author": null,
  "content": "A Rawalpindi additional sessions judge convicted a man of raping his niece, sentenced him to life imprisonment, and awarded a Rs500,000 fine, it emerged on Wednesday.\n\nAccording to the court order — dated February 18 and seen by Dawn.com — Raja Muhammad Shoaib was sentenced to life imprisonment and awarded the fine under Section 376(iii) (rape of a minor) of the Pakistan Penal Code.\n\n“In default of payment of [the] fine, the accused shall further undergo simple imprisonment for a period of 06-months,” the order read. “The accused is given the benefit of section 382-B CrPC (Code of Criminal Procedure).”\n\nThe order further read that the accused had the right to appeal the verdict within 30 days.\n\nThe case was initially reported on November 22, 2023, according to a first information report (FIR) seen by Dawn.com. The FIR, filed by the victim’s father, said he left his children at home on November 20 to attend a funeral, returning two days later. The children were left with Shoaib, their maternal uncle.\n\n“When I returned home, my neighbour was there with my daughter. She cried and told me that her maternal uncle had raped her in my absence and even previously,” the victim’s father said in the FIR. “She said that he threatened to kill her if she told anyone.”\n\nThe FIR was filed with Saddar Wah police under section 376(iii), while the girl was taken to THQ Hospital in Taxila for a medical examination.\n\nDespite the presence of strict anti-rape laws in the country, which could result in the death penalty or imprisonment lasting from ten to twenty-five years, incidents of sexual assault continue across the country.\n\nData collected by the non-governmental organisation Sahil revealed that that a total of 1,630 cases of child abuse were reported from across the country in the first six months of 2024.\n\nThe statistics included 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children and 18 cases of child marriages. In the six-month period, 48 cases of pornography after sexual abuse were also recorded.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:44:01.966Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1893013/man-awarded-life-imprisonment-rs500000-fine-by-rawalpindi-court-for-raping-niece",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T15:16:16.000Z"
}
