{
  "title": "Pindi police to shut down scrapyards for ‘security clearance’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: As Pakistan hosts the ICC Champions Trophy this month, the Rawalpindi police have decided to shut down all scrapyards in the garrison city for the ‘security clearance’ of the owners and employees working at these spaces.\n\nPolice said these establishments would remain closed till the security clearance of the employees, adding that they would initiate legal action if any of the employees were found involved in criminal activities.\n\nThe city police officer ordered all station house officers (SHOs) and sub-divisional police officers (SDPOs), for the security clearance of scrapyards located in their jurisdictions. The police have been directed to compile the record of scrapyards for their security clearance.\n\n“Until the security clearance is completed, all scrapyards must be closed,” the CPO’s directive said, adding that the scrapyards would be allowed to function after they were given security clearance certificates by the police.\n\nA senior police official said that they aimed to ensure foolproof security for the upcoming ICC Champions Trophy starting today and security clearance of scrapyards and their workers was part of this step. The ICC event featuring eight teams, will be held in Karachi, Lahore, Rawalpindi and Dubai till March 9, 2025.\n\n5,000 police officials for security\n\nThe police have been preparing a foolproof security plan for the tournament. City Police Officer Syed Khalid Hamdani also visited the Rawalpindi Cricket Stadium on Tuesday to review the security arrangements put in place for the ICC Champions Trophy.\n\nChief Traffic Officer Beenish Fatima, the Rawal SP, district administration officers, and other officials were also present on the occasion. The CPO conducted a detailed review of the security and other arrangements and gave instructions in this regard. According to the security plan, more than 5,000 Rawalpindi police officials will be on duty to maintain law and order.\n\nHe said the Rawalpindi Cricket Stadium hosted eight international cricket series in the last two years, adding that foolproof security would be provided to the international cricket teams visiting Rawalpindi for the tournament.\n\nAs part of the tightened security, the cricket stadium, teams’ routes and surroundings will be monitored with CCTV cameras.\n\nThe CPO said that with the cooperation of the district administration, Pakistan Army, Rangers and other institutions, an excellent atmosphere of law and order will be maintained, adding that the cricket fans and families would be provided with a pleasant atmosphere on the occasion of the Champions Trophy.\n\nUninterrupted traffic flow will be ensured during cricket matches as all resources are being utilised to ensure effective security arrangements on the occasion, he said.\n\nPublished in Dawn, February 19th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:32:09.190Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892823/pindi-police-to-shut-down-scrapyards-for-security-clearance",
  "dateList": "2025-02-19",
  "date_published": "2025-02-19T01:09:30.000Z"
}
