{
  "title": "Wafaqi Mohtasib team directs ETO to provide one-window facility, launch awareness campaign",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-team-directs-eto-to-provide-one-window-facility-launch-awareness-campaign/",
  "date_published": "2024-04-25T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): An Inspection Team from the Wafaqi Mohtasib’s Office on Thursday visited the Excise and Taxation Office, Islamabad under the directions of the Federal Ombudsman, Ejaz Ahmad Qureshi, with a view to ascertaining the difficulties being faced by the general public with regard to registration of vehicles.\nHeaded by a senior advisor, the inspection team met with the people there and listened to their complaints for prompt redressal.\nThe inspection team had submitted its report to the Wafaqi Mohtasib (Federal Ombudsman), who directed that a one window facilitation desk might be established therein to provide all facilities to the public under one roof.\nThe team was informed by the ETO Office that facilities relating to registration of the vehicles, transfer of registration and payment of token tax etc were currently available Online. Moreover, the ETO Office is also providing such facilities at the residence of the applicants by payment of a nominal fee of Rs. 1900.\nIt further informed that the mobile teams from the ETO Office are also providing the registration facilities to the general public at the public parks and other public places daily after 4 pm.\nCommending the provision of facilities, the Wafaqi Mohtasib directed the ETO Office to launch an awareness campaign in this regard for the benefit of the common man.\nDuring the visit, some of the petitioners informed the inspection team that the agent mafia active there, was charging Rs 200 for providing one registration form, whereas, Rs 50 were being charged for making a single photo copy. The fact of the matter, they say, is that the registration form for vehicles should be made available for free and the official rate for photocopy i.e. Rs. 5 and Rs.10 respectively, be enforced.\nThe inspection team instructed the administration to prominently display the respective requirements for registration, transfer and submission of token tax of the vehicles on the sign boards in English and Urdu, apart from providing the relevant information regarding online registration.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:07:21.627Z"
}
