{
  "title": "Identification specifics required to know about lawmakers put on travel stop lists: Atta Tarar",
  "link": "https://www.app.com.pk/national/identification-specifics-required-to-know-about-lawmakers-put-on-travel-stop-lists-atta-tarar/",
  "date_published": "2024-04-25T16:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar Thursday informed the National Assembly that for providing exact information about the names of legislators, if any, put on the travel stop lists, specific identification details like CNIC number or father’s name were required.\nDue to extensive nature of the lists, identification specifics would make it feasible to provide details about the lawmakers included in them, the minister said.\nHe was responding to a calling attention notice regarding non-removal of the names of members of the National Assembly and provincial legislators from the travel stop lists, including Exit Control List (ECL), Provisional National Identification List (PNIL) and Black List (BL).\nHe emphasized that a list of lawmakers containing their names, parents’ names, Computerized National Identity Cards (CNICs) and other details was required so that the reasons for inclusion of their names in the travel stop lists could be furnished.\nReferring to the criticism by the Leader of Opposition leader, the minister reminded them of their actions when they were in power. He called for showing respect for parliamentary norms instead of engaging in such criticism.\nThe opposition leaders should better provide a list of their members, if any, put on such lists if they were serious in resolving the matter.\nHe clarified that names were not added to the ECL unilaterally or arbitrarily, rather a specific process and procedure was followed for the purpose. Investigation agencies forwarded the names of people for inclusion in such lists.\nThe minister recalled the past instances of placing several members of his party, including Prime Minister Muhammad Shehbaz Sharif, on the Exit Control List and others lists.\nHe assured that once the proper details were provided they would provide the opposition the required information. As regards the lists, he stated that some 1,924 names were included in the PNIL and 4,842 in the ECL.\nThe minister clarified that the ECL, PNIL and BL were not categorized on the basis of professions such as businessmen, but rather compiled as per references filed by investigation agencies.\nHe said that every parliamentarian, regardless of their affiliation, had the privilege to seek information about any matter and the government respected that privilege.\nRegarding the opposition’s objection to providing the details, he questioned why it was problematic for them as it would streamline the process, enabling the government to furnish the information about each individual put on the lists more efficiently.\nAtta Tarar said that the Constitution guaranteed freedom of movement, and the laws governing the ECL were aligned with constitutional principles. Had the laws were unconstitutional, the courts would have struck them down.\nHe reiterated that the Interior Ministry received references from investigation agencies, containing comprehensive details and reasons for including names in such lists. He expressed readiness to provide these details and offered guidance on accessing information about the individuals concerned who had been added to the lists.\nHe remarked that the sponsors of the calling attention notice were serious about addressing the issues at hand. If they were committed to resolving the matter, then they should have proper documentation to support their stance.\nAamir Dogar, one of the sponsors of the notice, brought attention to 11 members whose names had been forwarded to the Interior Ministry. The minister pointed out that their specific details should have been included in the notice too.",
  "retrievedAt": "2025-08-11T02:06:09.829Z"
}
