{
  "title": "PM for political commitment, adequate investment to achive goal of malaria-free world",
  "link": "https://www.app.com.pk/national/pm-for-political-commitment-adequate-investment-to-achive-goal-of-malaria-free-world/",
  "date_published": "2024-04-25T08:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): As the world observes World Malaria Day on Thursday, Prime Minister Muhammad Shehbaz Sharif called for a vigorous political commitment and adequate investment strategies to reach the goal of a world free from the disease.\nThe prime minister, in a message on the Day, stressed the need to learn from each others’ experiences and support each others’ efforts in combating the disease.\nHe said the theme for World Malaria Day 2024 was “Advancing health equity, gender equality and human rights” which was an undertaking to involve multiple stakeholders i.e. policy makers, donors, healthcare providers, community members from all walks of life in fight against malaria.\nHe said the research and academic institutions needed to flag scientific advances to both experts and the general public, international partners, companies and foundations to showcase their efforts and reflect on how to further scale up malaria control interventions.\n“The aim of Government of Pakistan, in this regard, is to get more people involved in the fight against the disease that affects more than 1 million Pakistanis every year,” he remarked.\nPrime Minister Shehbaz said that despite the country’s achievements in malaria control, sustaining the gains still remains a challenge.\n“It is my belief that every individual has the right to live a healthy and prosperous life with dignity. Everyone must have access to quality assured malaria testing and treatment facilities, free of cost, at their door steps,” he added.\nThe prime minister said that the Ministry of National Health Services and Coordination through Common Management Unit Malaria, National and international partners, provincial counterparts, NGOs and private stakeholders had significantly enhanced the free malaria testing and treatment facilities in the malaria endemic districts across the country.\nHe said that as the government strived to provide equitable health services to the citizens, the role of the private sector and the global partners wad appreciable.\nHe called upon all partners, organizations, healthcare professionals, and individuals to unite in their efforts to end malaria.\n“We must work collaboratively to strengthen healthcare systems, increase access to quality diagnosis and treatment, and raise awareness about the importance of prevention and controlling measures of malaria,” the prime minister added.",
  "retrievedAt": "2025-08-11T02:07:22.661Z"
}
