{
  "title": "Allama Iqbal gave Muslim Ummah a new dimension of thinking, hope: Dar",
  "link": "https://www.app.com.pk/national/allama-iqbal-gave-muslim-ummah-a-new-dimension-of-thinking-hope-dar/",
  "date_published": "2024-04-25T15:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): Foreign Minister Senator Ishaq Dar on Thursday paying tributes to Allama Muhammad Iqbal, said that the great poet and philosopher gave the Muslim Ummah a new dimension of thinking and hope.\nHe stated this while addressing as chief guest at a special event to commemorate Allama Muhammad Iqbal titled “Bayad-e-Iqbal” organized by Allama Iqbal Council here.\nHe highly praised the whole team of Allama Iqbal Council led by its Chairman Allama Zulfiqar Ahmad Cheema for organizing this important event aiming to promote his philosophy, life, and contributions.\nThe minister said that no nation could survive without hope which Iqbal also taught through his poetry and other literary works. He told the gathering that that Allama Iqbal emphasized on the unity among Muslim Ummah and revivial of Islamic civilization.\nHe said that the high resilience, commitment and hope were a must for a nation to achieve the set goals.\nExpressing optimism for a great future of Pakistan, he said being a nuclear power, the country had all the potential to become an economic power.\nIshaq Dar underscored Iqbal’s teachings, urging youth to engage in continuous struggle, pursue knowledge, conduct research, and draw inspiration from the rich Muslim legacy.\nIn his address, Turkish Ambassador in Pakistan Dr. Mehmet Pacaci, also paid tributes to Allama Muhammad Iqbal, as he presented the idea of Pakistan as a separate homeland for the Muslims of sub-continent.\nSpeaking as a special guest, Dr. Masooma Iran, an official of Iran’s Foreign Office, paid tributes to the great poet and said that Allama Iqbal believed in the unity of Islamic nations and the solidarity of Muslim countries.\nTajikistan diplomat, Imam Ali Shifai, also shed light on the life and contributions of Allama Muhammad Iqbal and paid glowing tributes in his speech.\nEarlier, Chairman Allama Iqbal Council Islamabad Zulfiqar Ahmad Cheema said that those who did not pay tribute to their national heroes destined to fade away. Iqbal’s intellect would always remain guiding principle for the humanity, he added.\nMNA Ali Muhammad Khan and Dr Humaira Shehbaz also shed lights on the life and contributions of Allama Muhammad Iqbal.\nDr. Humaira Shehbaz spoke about the Persian poetry and books of Allama Muhammad Iqbal. The event was attended by a large number of people from different walks of life.",
  "retrievedAt": "2025-08-11T02:06:10.772Z"
}
