{
  "title": "Pakistan delegation arrives in Shahrisabz to participate in ECO Tourism Capital for 2024",
  "link": "https://www.app.com.pk/national/pakistan-delegation-arrives-in-shahrisabz-to-participate-in-eco-tourism-capital-for-2024/",
  "date_published": "2024-04-25T11:55:00.000Z",
  "source": "APP",
  "content": "SHAHRISABZ (Uzbekistan),, Apr 25 (APP): Pakistani Delegation of tourism experts, prominent artists, painters, media-persons, and traditional culinary expert, on Thursday arrived in Uzbekistan to be part of the celebration of ‘Shahrisabz – ECO Tourism Capital for 2024’ from April 25- 27.\nThe Pakistan delegation, under the initiative of Pakistan Tourism Development Corporation (PTDC) has embarked on Cultural Journey to Uzbekistan for “Shahrisabz – ECO Tourism Capital for 2024”.\nIt is led by Salman Javed, Senior Board Member of Pakistan Tourism Development Corporation (PTDC) and Convener of the Tourism Committee in FPCCI. It will participate in a series of events including a cooking competition, modest fashion show, and the International Folk Festival, all part of the festivities in “Shahrisabz – ECO Tourism Capital for 2024”.\nThe inauguration of Shahrisabz as the “Tourism Capital” of ECO (Economic Cooperation Organization) includes a wide array of events such as the ECO Tourism Forum, nomad games, gastronomy competitions, and other cultural showcases aimed at highlighting the rich culture and heritage of ECO countries while fostering cooperation in the field of tourism among member states.\nHighlighting the main features, the spokesperson of Pakistan Tourism Development Corporation (PTDC) stated that the Pakistani delegation would focus on ECO Region Tourism cooperation for the strengthening of people-to-people contact and cultural exchange between the participating countries.\nAmong the participants from ECO Member States, designers will showcase creativity skills in the “Modest Fashion Show”, while chefs, specializing in national dishes and desserts, will compete in the “Shahrisabz Cooking Competition”.\nAdditionally, ethno-sports athletes and folk artists from various countries will take part in the first International Nomad Games and the “International Folk Festival” of the ECO region respectively.\nThe official opening ceremony of the “Shahrisabz 2024 – ECO Tourism Capital” events is scheduled to take place today, in the Historical Center of Shahrisabz, Uzbekistan. All competition events have been organized in the form of festivals or exhibitions to strengthen friendships between member states and promote cross-cultural understanding.\nFrom March 27 to April 6, the plein-air artists visited the historic cities of Tashkent, Samarkand, and Shahrisabz, capturing the essence of Uzbekistan’s rich heritage through their masterpieces.\nThis initiative has brought together artists from Pakistan, Azerbaijan, Iran, Kazakhstan, Kyrgyzstan, Türkiye, Tajikistan, and Uzbekistan, who through their artistry, weaved together the tapestry of historical narratives and contemporary landscapes, reflecting the enduring allure of Uzbekistan’s ancient cities.",
  "retrievedAt": "2025-08-11T02:07:00.503Z"
}
