{
  "title": "Nutrition Int’l donates high-tech food lab to IFA for enhanced quality control",
  "link": "https://www.app.com.pk/national/nutrition-intl-donates-high-tech-food-lab-to-ifa-for-enhanced-quality-control/",
  "date_published": "2024-04-25T07:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 25 (APP): The Nutrition International has gifted a CDR Food Lab machine to the Islamabad Food Authority (IFA), promising faster and more accurate food inspections in the Federal Capital.\nTalking to APP, Deputy Director Operations (DDO) of Islamabad Food Authority (IFA) Tahira Saddique said that this high-tech equipment would allow the authority to check the quality of cooking oil and milk more effectively, ensuring safer food for the city’s residents.\nShe said that with the help of this machine IFA would overcome the big issue of rancid oil in the city and the department would be able to test oil on the spot through this mobile machine.\nNutrition International, a global organization focused on improving nutrition, made the donation during a ceremony in Islamabad.\nThe National Manager for Nutrition International, Zameer Haider, Director Food, Irfan Nawaz Memon along with key officials from the Food Authority were present on the occasion.\nTahira said that the new CDR Food Lab machine was a significant upgrade for the Food Authority’s inspection process.\nIt would allow for rapid testing of food products, helping the authority maintain strict quality standards. The machine’s precision in testing cooking oil and milk could help prevent substandard products from reaching the market, contributing\nto public health and safety, she added.\nShe said that the Nutrition International was not just donating the equipment; they were also providing expert training for the Food Authority’s staff. This support would ensure that the team could operate the new technology efficiently and make the most of its capabilities. By sharing their expertise, Nutrition International aimed at to build a more robust food safety system in Islamabad.\nOn the occasion, Director Food Irfan Nawaz Memon expressed his gratitude to Nutrition International for the generous donation and their commitment to food safety. He highlighted the importance of this partnership in improving food quality in the city. The new equipment and training would enable the Food Authority to carry out inspections more quickly and accurately, reducing the risk of foodborne illnesses.\nThis partnership between Nutrition International and the Islamabad Food Authority was a positive move toward a safer food supply for everyone, she added.",
  "retrievedAt": "2025-08-11T02:07:26.501Z"
}
