{
  "title": "Nowruz promotes peace, solidarity: Begum Samina Alvi",
  "link": "https://www.app.com.pk/national/nowruz-promotes-peace-solidarity-begum-samina-alvi/",
  "date_published": "2021-03-27T11:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): Begum Samina Arif Alvi on Saturday said Nowruz promoted values of peace and solidarity between generations and within families as well as fostered reconciliation and neighborliness.\nSpeaking at an event here to mark the celebrations of Nowruz, she said as it contributed to cultural diversity and friendship among peoples and different communities, Nowruz fitted closely with the UNESCO’s mandate.\n“This day is the celebration of the intangible heritage of the world.”\nThe Nowruz celebrations were organized by diplomatic community of nine countries in Islamabad including Turkey, Iran, Afghanistan, Kazakhstan, Kyrgyzstan, Turkmenistan, Tajikistan, Pakistan and Azerbaijan in collaboration with Serena Hotels.\nBegum Samina said it gave her immense pleasure to attend Nowruz celebrations.\n“I congratulate Serena Hotels and all the participating countries on this auspicious occasion. This is the beginning of the new year and a new hope to renew our commitments towards peace and humanity.”\nShe said Nowruz was a festivity marking the first day of spring and renewal of nature.\n“It includes rituals, ceremonies and cultural events, as well as the enjoyment of a special meal with loved ones,” she said adding Nowruz was celebrated for over 3000 years in the Balkans, the Black Sea Basin, the Caucasus, Central Asia, the Middle East and other regions.\nShe said the participating countries had given a message of peace and a bright future awaited those countries.\n“At this time, we also need to step up efforts to tackle the challenges of global warming. Climate change is already happening; temperatures are rising; drought and wild fires are starting to occur more frequently; rainfall patterns are shifting; glaciers and snow are melting, and the global average sea-level is rising.\nTo mitigate climate change, we need to reduce or prevent the emissions linked to human activities. Climate change will affect both hemispheres of the Earth.”\nShe emphasized that it was the moral obligation of the whole world to keep our planet cool and minimize the use of fossil fuels.\nShe told, “In Pakistan, the government has taken initiative of planting billion trees which is indeed a good step and we need to play our role in this regard. Similarly, we also need to utilize alternate sources of energy for power generation from solar and wind.”\nBegum Samina said our festivity and celebrations had been restricted due to emergence of Covid-19 pandemic during the last year.\n“I hope that the process of vaccination will complete soon and we will overcome this disease. We need to be vigilant at this time of crisis because carelessness can lead to problems.”\n“Therefore, we should observe SoPs, wash our hands, use a mask and keep physical distance,” she stressed.\nShe wished everyone a prosperous and happy Nowruz by saying, “May its spirit of harmony, peace and respect towards humanity serves as inspiration to us all.”\nParliamentary Secretary for Religious Affairs and Interfaith Harmony Aftab Jehangir, Dean of Diplomatic Corps and Ambassador of Turkmenistan Atadjan Movlamov and Chief Executive Officer of Serena Hotels Aziz Boolani also spoke on the occasion.\nBegum Samina Alvi visited the stalls set up by embassies of different countries which was followed by stage performances depicting cultures of the region.",
  "retrievedAt": "2025-08-11T20:33:10.426Z"
}
