{
  "title": "PIA flights resumption to Swat a milestone for promoting tourism",
  "link": "https://www.app.com.pk/national/pia-flights-resumption-to-swat-a-milestone-for-promoting-tourism/",
  "date_published": "2021-03-27T16:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 27 (APP): The resumption of PIA flights to important tourist destination of Swat after 17 years and landing of inaugural flight PK-640 at Saidu Sharif airport on 25 March was a peculiar achievement of government to promote tourism in the country.\nThe decision by the government was a longstanding desire of the local people and those associated with tourism industry. Chief Minister KPK Mahmood Khan, Federal Minister for Aviation Ghulam Sarwar Khan, Minister for Communications Murad Saeed, PIA’s CEO Arshad Malik, MNA Saleemur Rehman, MPAs from Swat and large number of notables from the area attended the historical and graceful ceremony.\nAs per schedule, two flights from Lahore to Saidu Sharif via Islamabad would operate weekly on Friday and Monday with fare of Rs 5888 for each passenger.\nThe Chief Minister said the opening of the airport would boost tourism in the entire Malakand division and create unlimited opportunities of jobs, trade and investment for the people of the division.\n“Promotion of tourism is one of the top priorities of the PTI government and vision of Prime Minister Imran Khan” he said and added that it was a historic day for the people of Malakand division, especially for Swat district which was badly affected by terrorism, floods and earthquake. It is another promise fulfilled by the PTI government,” he said, adding that the government was opening new spots in Swat and other districts of Malakand division to promote tourism.\n“An Austrian investor has selected Swat to establish a skiing village of hundreds of houses that will promote tourism and international skiing sports here”, he also told.\nThe resumption of flights would facilitate large number of tourists, especially Buddhists from abroad, wanted to visit their sacred sites in Swat.\nBesides scenic sites and tourist resorts, there are hundreds of archeological sites belonging to Buddhism where Buddhists and many of them wanted to come there.\nThe mountainous region of Swat was famous for adventure tourism and many trekkers and hikers loved to visit the area for trekking in the mountains.\nAll stakeholders of tourism industry have termed the resumption of flight an encouraging move by the government and said that it would enhance employment opportunities through boosting tourism besides creating livelihood opportunities in the district.",
  "retrievedAt": "2025-08-11T20:33:07.364Z"
}
