{
  "title": "Cadet College Sanghar holds 24th Annual Parents Day",
  "link": "https://www.app.com.pk/national/cadet-college-sanghar-holds-24th-annual-parents-day/",
  "date_published": "2021-03-27T13:35:00.000Z",
  "source": "APP",
  "content": "KARACHI, Mar 27 (APP): The 24th Annual Parents Day on Saturday was held at Cadet College Sanghar where Chief of the Naval Staff Admiral Muhammad Amjad Khan Niazi graced the occasion as Chief Guest.\nUpon arrival of the Chief Guest, an active contingent of cadets presented salutation and Guard of Honour.\nWhile addressing the ceremony, the Naval Chief congratulated the Principal of the college Commodore Muhammad Ashraf Bhatti for arranging the wonderful event and commended the efforts for making the college an outstanding and elite educational institution. The admiral also appreciated the teaching faculty, military training staff and physical training instructors for imparting quality education and training to the cadets, said a Pakistan Navy media release.\nEarlier, the Principal of college presented the Annual Report – 2020 and highlighted exceptional performance of cadets in the domains of academics, sports and co-curricular activities.\nLater, the Chief Guest gave away prizes to the winners for their outstanding overall performance during the year. Cadet Sarfaraz Shah and Cadet Hassan Laghari clinched highest prizes of Stick of Honour and Badge of Honor respectively.\nCadet Abdul Manan achieved Quaid-e-Azam Medal for his Best Academic performance. Furthermore, Cadet Muhammad Malook and Cadet Haroon John were declared as Best Rider and Best Sportsman individually.\nCadet Imam Bux was announced as Best Debater, Cadet Taj Muhammad as Best Shooter and Cadet Muhammad Daniyal as Best Athlete. Similarly, amongst the faculty and Staff, Muhammad Adnan achieved Best Staff Officer award, Allah Bux Best Employee award, Muhammad Nasir Tabasum Best Military Instructor award and Taj Ali Best Employee Award. Additionally, Ex-Cadet Dr. Khan Muhammad Memon, Dr. Sadiq Baloch and Lieutenant Usman Ali PN were given Best Alumni Award for their valuable services in various domains.\nDuring the colorful event, the Chief Guest also witnessed and appreciated various Science Projects, depictions of Arts prepared and presented by the cadets during Science and Arts Exhibition.\nThe event was followed by Parade, PT Show, Tiger Squad Drill and Tent pegging which was thoroughly enjoyed and performance of cadets was lauded by all.\nThe ceremony was attended by senior military officers, members of board of governors, College’s Alumni and parents of cadets while adhering COVID-19 SOPs.",
  "retrievedAt": "2025-08-11T20:33:09.944Z"
}
