{
  "title": "PDM creating hurdles to derail democracy: Sarwar Khan",
  "link": "https://www.app.com.pk/national/pdm-creating-hurdles-to-derail-democracy-sarwar-khan/",
  "date_published": "2021-03-27T18:34:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 27 (APP): Federal Minister for Aviation Ghulam Sarwar Khan on Saturday said that Pakistan Democratic Movement (PDM) wants political instability adding it was a group of blackmailer, spoilers and was creating hurdles to gain political mileage and to derail democracy flourishing in the country.\nAddressing the press briefing at Public Secretariat office Mall Road in Rawalpindi, the Federal Minister said PDM was designed for their personal interests who wanted to end pending cases against them and for seeking NRO from government.\nHe said that Pakistan Muslim League PML-N leadership is committing political terrorism.\nOpposition parties are also responsible for creating mistrust in the hearts of the people about politics and politicians, he said.\nFederal Minister pointed out that uncertainty is a poison killer for societies, countries and governments.\nHe was of the view that political process should continue in the country.\nThe apex court was attacked and slogans were chanted against the judges. Therefore, the PMN is a political terrorist group whose thinking is condemned. He further said that there is a rift within the PML-N, there are two groups, Hamza’s line is different while Vice President of PML-N Maryam Nawaz has different opinion.\nMinister said that there was no deal between the government and the Pakistan People Party PPP on any issue, Prime Minister Imran Khan still stands firm on his stance. Everyone should be held accountable, no case will be withdrawn, he added.\nReplying to a question regarding the reshuffle of ministries, said that Prime Minister Imran Khan is a team leader and he can assign any kind of responsibilities to anyone at any time. This is the first instance of a government taking action against its own members.\nThe government has made an open offer on national issues including electoral reform, economic reform, foreign policy and they should support the government on these national issues.\nIn response to a question regarding Rawalpindi Ring Road, Federal Minister said this is the propaganda of those who want to stop the process of development.\nThe first priority of the government is to fulfill the promises made to the people and regular efforts are being to address unemployment, reduction in inflation.\nAction against the perpetrators of inflation at all levels, he maintained.",
  "retrievedAt": "2025-08-11T20:33:07.061Z"
}
