{
  "title": "Opposition vows to take up issue of brutal murders in Sindh on assembly floor",
  "link": "https://www.app.com.pk/national/opposition-vows-to-take-up-issue-of-brutal-murders-in-sindh-on-assembly-floor/",
  "date_published": "2021-11-15T14:17:00.000Z",
  "source": "APP",
  "content": "KARACHI, Nov 15 (APP): Joint Opposition in Sindh Assembly Monday vowed to take up issue of murders of Nazim Jokhio, Fahmida Sial and death of desperate Gujar Nala affectee Zakia Shahid on the assembly floor through an adjournment motion, besides other public problems.\nLeader of the opposition in Sindh Assembly, Haleem Adil Sheikh along with parliamentary leaders and assembly members of PTI, MQM-P and GDA, while speaking to media persons at Sindh Assembly Building prior to the session, said that joint apposition had submitted a requisition for convening a session to discuss issues being faced by masses in the province including fabricated shortage and inflated prices of wheat flour, deteriorated law and order situation, street crimes, water scarcity, land grabbing and delay in sugarcane crushing.\nSheikh, who is also Central Vice President of PTI, said that it was constitutional and democratic right of the opposition to requisite assembly session for taking up issues of public concern but the provincial government while once again denying our right summoned the session with their own agenda.\n“If session of the assembly would have been convened timely Nazim Jokhio and Fahmida Sial might not had murdered,” Haleem Adil asserted alleging that a PPP MPA was involved in brutal murder of Fahmida Sial as his police guards and vehicles were accompanied with the assassin Shaheed Isran at the scene of the heinous crime.\nHe said that another son of Sindh Nazim Jokhio was ferociously murdered reportedly by a PPP MPA Jam Awais and his father Jam Abdul Karim. He said that relevant officials were reluctant to conduct postmortem of the dead body and registration of FIR and it was made possible after intervention of PTI lawmaker Raja Azhar.\nHaleem Adil said that all the opposition parties wanted to take up the issue on floor of the house so that victim families could get justice. “We know that PPP will try to escape but we will not let the treasury benches run away,” he vowed.\nHaleem was of the view that once PPP was called party of martyrs but now it had become a party of murderers as five six Sindh assembly members belonging to the party were under allegations of murders.\nHe while referring to death of Zakia Shahid- a hopeless affectee of Gujar Nala who lost her life due to cardiac arrest after demolition of her house- said that land grabbing was continue on thousands of acres of land in the metropolis in connivance with Sindh government but they did not have land to rehabilitate the poor people who were dislocated.\nProvincial departments and their sub ordinate authorities were involved in construction of Nasla Tower, Tijori Heights and number of other illegal buildings in Karachi while common citizens who invest their hardly earned money in such projects had to suffer, he maintained.\nParliamentary Leader of Muttahida Qoumi Movement Pakistan Muhammad Hussain said that Sindh government not only passed over joint opposition’s requisition for assembly session but also violated another constitutional requirement of convening meeting of Business Advisory Committee of Sindh Assembly that according to the rule set the agenda of the assembly proceeding for summoned session.\nHe said that PPP did not want discussion on problems of the masses and was trying to evade. “ It was undemocratic and unconstitutional attitude of treasury benches and we will record our protest against it on the floor of the house as well,” he maintained.\nParliamentary leader of Grand Democratic Alliance in Sindh Assembly Husnain Mirza, while speaking at the occasion, said that Sindh government although convening the session while ignoring the opposition’s requisition but it was better late than never.\nCertain matters of grave concerns to masses were on the agenda of the opposition and they wanted remedy to provide relief to the people of the province but government kept eluding and meanwhile two heart wrenching incidents of brutal murders took place, Mirza said adding that the entire Sindh was sad and dejected over killing of Nazim Jokhio and Fahmida Sial. He said that the issue would be taken on the floor through an adjournment motion.\nParliamentary leader of PTI in Sindh Assembly, Bilal Abdul Gaffar, while speaking to media persons at the occasion, said that whenever opposition place a resolution highlighting problems of masses government benches tried to obstruct it.\nChief minister Sindh, his cabinet and PPP legislators were accountable to people of Sindh and their representative assembly and PTI and other opposition parties were determined that they would not let them pass over the serious issue of murders of Nazim Jokhio, Fahmida Sial and Zakia Shahid, he said and vowed to take the issue to its logical end.\nBilal Abdul Gaffar terming it as the most vital issue at the time demanded that a fact finding judicial commission to be constituted to ascertain the facts and bring the culprits to justice.",
  "retrievedAt": "2025-08-11T21:36:34.734Z"
}
