{
  "title": "Railways offers 8 hospitals,36 dispensaries for isolation centres",
  "link": "https://www.app.com.pk/national/railways-offers-8-hospitals36-dispensaries-for-isolation-centres/",
  "date_published": "2020-03-14T06:28:00.000Z",
  "source": "APP",
  "content": "LAHORE, Mar 14 (APP):Railways Minister Sheikh Rashid Ahmad has offered 8 railways hospitals and 36 dispensaries to the provincial health departments for setting up isolation wards or centres for effected patients of corona virus.\nAddressing a press conference at the PR headquarters here on Saturday, he said that the railways had taken precautionary measures against corona virus and all divisions had been directed to ensure proper cleanliness at all railway stations.\nThe minister said the nation should not be afraid, and panic should not be spread as the religion also did not allow to do so and precautionary measures should be adopted.\nHowever, he said that no train was being shutdown and all 134 trains to remain operational to facilitate the rail passengers.\nHe said that few cases of corona virus had been registered in the country and all these cases had history of recent traveling from other countries.\nThe minister said that three trains including Lasani Express (runs between Lahore and Sialkot via Narowal), Jinnah Express (runs between Lahore and Karachi) and Fareed Express (runs between Lahore and Karachi) were being outsourced, whereas, seven more passenger trains would also be outsourced in phases.\n“Six freight trains will also be given to private firms to run,” he added.\nSh Rashid said that those trains would be privatized which were running in deficit.\nTo a question, he said that corona virus would never affect China Pakistan Economic Corridor (CPEC) and Main Line (ML-1) project would also be progressed according to the schedule.\nTo another question, he said that railways earned Rs 400 to 500 million more than the earning of the previous year.\nCommenting on the political leadership of the Pakistan Peoples Party (PPP) and Pakistan Muslim League-N, the minister said that these parties had lost their position in the national politics.\nHe said that PML-N leader Maryum was just demanding to send her out of the country, adding what did they do for the people as they were not willing to return to the masses.",
  "retrievedAt": "2025-08-11T18:57:03.669Z"
}
