{
  "title": "Ministry to enhance job quota, health insurance for disabled women",
  "link": "https://www.app.com.pk/national/ministry-to-enhance-job-quota-health-insurance-for-disabled-women/",
  "date_published": "2020-03-14T04:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):Special working women have demanded on Saturday the authorities concerned to provide them equal rights in jobs opportunities, healthcare, education and need to formulate a mechanism to address their issues.\nTalking to this scribe of the APP, an official of Ministry of Human Rights (MoHR) Mehmood Raza said, “Ministry was working to enhance the job quota for disabled women and would also plan to launch health insurance plan to benefit them with best possibilities and these plans would be implemented in our next bill.”\nAccording to details, the special working women were facing several hardships at offices in the federal capital due to lack of required facilities and therefore demanded the authorities concerned to provide them ease.\nAccording to them, most of the buildings were not constructed according to their physical disabilities or availability of medical practitioners for them to regularly treat their life-long diseases or managing any emergency like situation.\nSimilarly, they stressed on the need that the authorities should also constructed residential places according to special persons’ needs and the offices should also keep in view their requirements.\nNosheen Raza, a special working woman said mostly offices do not have special ramps for easy access of disabled women and added that it was a big headache for them to approach offices with the help of colleagues which was not possible on daily basis.\nShe said that all required facilities should be added in the buildings to make them disabled friendly.\nShe said disabled workers are keen to work but have to face discrimination when it come to their wages, they were always paid less.\nAnother woman there was need to launch awareness campaigns relating to our issues so that it would be resolve as soon as possible.\nDisabled women Afiqa Khan said,”Women Parliamentary Caucus annually hold awards for disabled women which was a positive gesture as a encouragement.”\nWhen contacted to Ministry of Human Rights an official of the ministry assured to formulate a policy to ensure facilities for special women to help them work in friendly environment.",
  "retrievedAt": "2025-08-11T18:57:08.038Z"
}
