{
  "title": "National Coordination Committee on Coronavirus holds first meeting",
  "link": "https://www.app.com.pk/national/national-coordination-committee-on-coronavirus-holds-first-meeting/",
  "date_published": "2020-03-14T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP):The first meeting of National Coordination Committee on Coronavirus was held here on Saturday to discuss plans to effectively curb the spread of disease by evaluating the situation on day to day basis.\nSpecial Assistant to the Prime Minister on National Health Services, Dr Zafar Mirza chaired the meeting of the National Coordination Committee which was constituted on the direction of Prime Minister Imran Khan. The meeting was also attended by the provincial chief ministers through video link.\nSpecial Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan and Special on National Security Division Dr Moaeed Yousaf also attended the meeting besides other members including Secretary Ministry of Information and Broadcasting Akbar Durrani, Secretary National Health Services Dr Tanveer Qureshi, Secretary Finance Naveed Kamran Baloch, Chairman National Disaster Management Authority (NDMA), Surgeon General of Pakistan and Director General Inter Services Public Relations (ISPR).\nThe meeting reviewed the implementation status of decisions of National Security Committee (NSC) and was informed that provinces had started implementing the decisions of the NSC.\nIt was informed that all educational institutions including public and private schools, universities, vocational institutions and Madaris had been closed in the country with immediate effect and till April 5.\nThe meeting decided to make and implement coordinated and effective strategy to fight coronavirus.\nIt was informed that taking the situation as a national challenge, all possible steps were being taken to ensure implementing national action plan and for this all available resources would be utilized to protect citizens from the disease.\nThe meeting was informed that effective screening mechanism had been adopted at all Points of Entry (POE) to have check on coronavirus patients. Proper screening mechanism has been developed at all airports besides availability of personal protection equipment kits for health staff and regular surveillance.\nThe committee expressed confidence that due to better health strategy there was no chance of outbreak of disease in Pakistan. It was informed that during last one month the federal government had taken several steps and adopted standard operating procedure (SOP) for prevention of the disease.\nThe committee was informed that the federal and provincial governments were on same page and implementing a unified policy to protect Pakistan from the virus.\nThe participants were of view that there was no need of creating any panic and advised citizens to take preventive measures against the disease.\nIt was decided that the Ministry of National Health Services, Ministry of Information and Broadcasting and ISPR will update the public about disease situation.\nDr Zafar said that so far 29 confirmed Coronavirus cases had been reported throughout the country. He added that disease diagnostic facility was being provided to Gilgit Baltistan with the support of National Institute of Health (NIH).\nHe said isolation rooms had been allocated in hospitals throughout the country, adding eight laboratories had been providing disease diagnostic facilities included NIH Islamabad, Shaukat Khanam Memorial Cancer Hospital Lahore, Public Health Laboratory Lahore, Nishtar Medical College Multan, Public Health Laboratory, Khyber Medical University Peshawar, Agha Khan University Hospital, Karachi, Dao Medical University Karachi and Public Health Laboratory Quetta.\nHe said the evolving situation demanded to form such a high-level body so that the pandemic could be curbed through coordinated efforts after taking unanimous decisions at the national level.\nHe said in case of any suspected coronavirus patient, information should be shared immediately with the health officials, doctors or at Health Ministry’s helpline number 1166.\nHe said for public awareness, the federal government and provinces were running an effective awareness campaigns.\nHe said the government had made all necessary arrangements to have a check on suspected coronavirus patients and its further spread.\nMirza said those citizens having coronavirus disease symptoms should contact the medical experts.",
  "retrievedAt": "2025-08-11T18:57:04.951Z"
}
