{
  "title": "MoHR strengthens regional role in promoting human rights across South Asia",
  "author": null,
  "content": "ISLAMABAD, Jun 30 (APP):The Ministry of Human Rights (MoHR) continues to demonstrate its commitment to both national and regional human rights advancement through strategic collaborations and forward-looking initiatives, said Secretary Ministry of Human Rights Abdul Khaliq Shaikh here on Monday.\nTalking to App, he said that with a focus on building a resilient human rights framework, MoHR’s active participation in South Asian and international platforms is playing a vital role in fostering regional cooperation and reform.\nOne of the ministry’s significant achievements is the development and implementation of Pakistan’s National Action Plan on Business and Human Rights, making it the first country in South Asia to introduce such a plan. This landmark initiative underscores Pakistan’s commitment to aligning corporate practices with human rights standards and sets a precedent for other nations in the region, he added.\nIn addition to domestic efforts, the MoHR continues to engage with key international partners, including the European Union, which has provided robust support in areas such as legal reforms, protection of minority rights, and institutional development. This cooperation reflects a shared commitment to upholding universal human rights principles, he added.\nAmid regional political complexities and ongoing human rights challenges, the MoHR’s proactive role is seen as a step toward greater regional integration and collective action on human rights concerns. These endeavors are critical not only for national progress but also for contributing to a more inclusive and rights-respecting South Asia, he added.\nKhaliq said that they also seek alignment with regional platforms such as the South Asian Human Rights Commission (SAHR). Although independent, SAHR represents a broader regional movement to empower human rights defenders and promote justice and equality across South Asia. Engagements with such bodies enhance Pakistan’s efforts to address cross-border issues such as conflict-related rights abuses, ethnic discrimination, and the marginalization of vulnerable communities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:38:14.075Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/mohr-strengthens-regional-role-in-promoting-human-rights-across-south-asia/",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T06:33:00.000Z"
}
