{
  "title": "CDA extends One-Window Facilitation Center hours to ensure timely dues payment",
  "author": null,
  "content": "ISLAMABAD, Jun 30 (APP):Capital Development Authority (CDA) kept its One-Window Facilitation Center open until midnight on June 30 to help residents clear their outstanding dues.\nThe initiative, taken under the instructions of CDA Chairman and Islamabad Chief Commissioner Muhammad Ali Randhawa, aimed to streamline payments ahead of the fiscal deadline and avoid legal penalties.\nThe extended hours — from 9 AM to 12 AM — allowed citizens to pay a range of charges including property dues, development fees, water bills, and installments for commercial and residential plots.\nAccording to CDA officials, the step was meant to accommodate public convenience and encourage timely compliance.\nThe initiative was supervised by Member Estate Talat Mahmood and Member Finance Tahir Naeem, who ensured smooth operations at the facilitation center.\nCitizens appreciated the CDA’s upgraded digital systems, professional staff, and transparent procedures, with many praising the authority for introducing a cashless and digitized payment model.\n“The expansion of service hours and the modernized setup has made it much easier to settle outstanding payments. We are grateful to Chairman Randhawa and the CDA team for making this process so efficient,” said a resident at the One-Window Center.\nCDA has made it clear that strict legal action will be taken against defaulters who fail to clear their dues by June 30.\nPenalties may include heavy fines, cancellation of property allotments or leases, and public disclosure of defaulter names in newspapers, which could impact legal and social standing.\n“Citizens should ensure all outstanding payments are made by midnight to avoid any legal complications,” a CDA spokesperson urged. “This is their last chance to resolve dues without facing punitive action.”\nResidents can obtain more information from CDA Headquarters or relevant offices during working hours.\nThe special arrangements reflect a broader push by the CDA under Chairman Randhawa to improve public service delivery, digitalize operations, and strengthen institutional transparency.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T16:38:42.685Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-extends-one-window-facilitation-center-hours-to-ensure-timely-dues-payment/",
  "dateList": "2025-06-30",
  "date_published": "2025-06-30T16:23:00.000Z"
}
