{
  "title": "Youth should play positive role for welfare of motherland, humanity: Mirza Afridi",
  "link": "https://www.app.com.pk/national/youth-should-play-positive-role-for-welfare-of-motherland-humanity-mirza-afridi/",
  "date_published": "2022-07-23T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 23 (APP): Deputy Chairman Senate Mirza Muhammad Afridi on Saturday urged the younger generation to play a positive role for the welfare of the motherland in particular and for the whole humanity in general.\nAddressing the eighteenth convocation of National University of Modern Languages (NUML), Afridi said that it was a matter of great pleasure for him to address the students on such an occasion which was very important for them, and their parents and teachers, said a press release.\nHe was of the view that students should hone their skills in such a way that they could perform at their best in today’s competitive environment. He congratulated the students for obtaining degrees in various fields. “You have achieved an important milestone on the path to success.”\nAddressing the students, Afridi said, “In the field, people will critically evaluate your physical and mental abilities as well as your moral outlook. I am sure your teachers have prepared you well for all the future challenges. Now It is your duty to play active role for the development of motherland.”\nHe urged the students that “for the prosperity of the nation you have to use your knowledge and understanding to the best of your ability and I assure you that you are a proud asset of our nation. Today’s world is one of discovery, creation and a constant struggle.”\nHe underlined that science and technology have brought significant changes in every field of knowledge. “In the era of “knowledge bang” and especially in a country like Pakistan, the responsibilities of universities are immense.”\n“Constitution of Pakistan guarantees freedom of expression to every citizen in a peaceful manner. I am sure that intelligent and capable young minds like you will play a productive role in building a stable society,” Afridi said.\nHe added that educational institutions had an important part to play for country’s development. NUML had quality faculty and its performance as an educational institution was exemplary, Afridi said while reminding the students that their university was the cornerstone for their future success.\nIn the end, the deputy chairman Senate awarded academic certificates and gold medals to the successful students. He also exchanged commemorative shields with the Rector NUML.",
  "retrievedAt": "2025-08-11T15:17:05.108Z"
}
