{
  "title": "Imran misleading nation through baseless propaganda: Rana Sanaullah",
  "link": "https://www.app.com.pk/national/imran-misleading-nation-through-baseless-propaganda-rana-sanaullah/",
  "date_published": "2022-07-23T10:24:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 23 (APP):Interior Minister Rana Sanaullah said on Saturday that a group under Imran Khan wanted to mislead the nation through its lies and baseless propaganda.\nTalking to the media, he said that Niazi had been propagating for the last threedays that his men were being purchased through greasing their palm, but thenumber of votes in the Punjab Assembly for chief minister’s election had exposedhis propaganda as not a single member of either sides (PTI and PML-N) votedagainst his party.\nHe said that Niazi was untrustworthy person and he (Imran) was pursuing the agendaof dividing the nation and misleading youth, adding that the person (Niazi) could causecolossal loss to the nation.\nCiting the trespassing of Supreme Court Lahore Registry by PTI workers on Friday night,the Interior Minister said that Deputy Registrar should have informed the governmentabout the situation.\nAs a lawyer, he said that courts should be respected, adding that Imran Khan usedderogatory language against courts while the courts were opened for him in the midnight.”\nThe minister said that Election Commission of Pakistan was not announcing verdict onForeign Funding Case in fear that Imran Khan may use derogatory and abusive languageagainst them.\nRana Sanaullah demanded the ECP to immediately announce the verdict on ForeignFunding Case as it was clear that Niazi took money from abroad to destabilize thecountry and a legal action should be now initiated against him.\nHe also appealed to the Chief Justice of Supreme Court to constitute a full bench tohear the cases, in which, PML-N was party.\n“I have never observed any lawyer of citing the decision of Zulfikar Ali Bhutto Shaheedcase in any proceedings which means that neither bar accepts the verdict nor courts,”he added.\nThe minister said that Article 63-A should be interpreted in letter and spirit.He reiterated that Imran was a trouble-maker so appropriate rangers force had beenprovided to provinces to deal with any untoward violence.",
  "retrievedAt": "2025-08-11T15:17:07.693Z"
}
