{
  "article_id": "2025-10-26_2cc492b1190048dc506bc984c34aa350",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/october-27-grim-reminder-of-most-sorrowful-moments-in-history-of-kashmir-dr-tariq-fazal-chaudhary/",
    "retrieved_at": "2025-10-26T15:22:58.826Z"
  },
  "metadata": {
    "title": "October 27 grim reminder of most sorrowful moments in history of Kashmir: Dr. Tariq Fazal Chaudhary",
    "author": null,
    "date_published": "2025-10-26T14:46:45.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/06/Dr.-Tariq-Fazal-Chaudhry-768x452-1.webp",
    "categories": [
      "National"
    ],
    "word_count": 428,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 26 (APP): Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhary on Sunday said that every year, 27th October stands as a grim reminder of one of the most sorrowful moments in the history of Kashmir. In his message on Kashmir Black Day, he said, seventy-eight years back, on this very date, Indian forces arrived in Srinagar and seized control, opening a painful era that persists without relief. From that moment onward, India has persistently blocked the Kashmiri people's fundamental right to decide their own future, a right guaranteed by multiple United Nations Security Council resolutions, he added. The minister said that, over almost eight decades, the residents of Indian Illegally Occupied Jammu and Kashmir (IIOJK) have faced immense suffering and suppression. \"We honour their unbreakable determination, bravery, and endurance amid constant threats and intimidation. Their firm commitment to securing their legitimate right to self-determination shows no signs of fading,\" he added. Following the actions of August 5, 2019, he said, India has escalated its unlawful and one-sided steps to change the region's population makeup and governance structure. Dr. Fazal said, alongside widespread violations of human rights, severe restrictions have been placed on basic freedoms like movement and speech. Through these harsh measures, he said, India has launched a deliberate wave of aggression and cruelty to mute authentic political demands and stifle the hopes of Kashmiris. He said, the illegal detention of key Kashmiri figures, including leaders, activists and journalists, under baseless accusations, starkly reveals this oppressive approach. Such prolonged confinements clearly breach global standards on human rights. The minister said Pakistan has repeatedly denounced these illicit actions, which flout international norms and disregard pertinent UN resolutions. \"Our stance on the Jammu and Kashmir issue has always been straightforward, steadfast, and grounded in principle. True peace and security in South Asia cannot be achieved without a fair and calm settlement of the Jammu and Kashmir conflict, aligned with the applicable UN Security Council resolutions and the desires of the Kashmiri populace.\" He said, the message is very clear from Pakistan that the people of IIOJ&K are not alone; the people and government of Pakistan will always stand with them at the diplomatic and moral levels. He said, \"Under the leadership of Prime Minister Shehbaz Sharif, the Government of Pakistan is raising a strong voice for the people of IIOJ&K on all diplomatic forums. We reiterate our firm solidarity with the people of Kashmir and pledge to remain committed to the Kashmir cause, making every effort to ensure that the Kashmiri people obtain their right to self-determination.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}