{
  "article_id": "2025-10-26_f216c068470fd5db9798e631b58bbe9b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/domestic/pmc-holds-convocation-2025/",
    "retrieved_at": "2025-10-26T10:28:08.471Z"
  },
  "metadata": {
    "title": "PMC holds Convocation 2025",
    "author": null,
    "date_published": "2025-10-26T10:22:27.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/04/Peshawar-Medical-College-1.jpg",
    "categories": [
      "National"
    ],
    "word_count": 303,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Oct 26 (APP):A grand convocation 2025 of Riphah International University, RIU, was held at Peshawar Medical College, PMC on Sunday, marking the successful completion of academic journeys for hundreds of graduates in the fields of Medicine, Dentistry, and Nursing. The ceremony celebrated graduates of Peshawar Medical College, MBBS Session 2019-2024, Peshawar Dental College, BDS Session 2020-2024 and Rufaidah Nursing College, Generic BSN Session 2021-2024. Prof. Dr. Anis Ahmad, Vice Chancellor of Riphah International University, Islamabad, graced the occasion as Chief Guest. The event was attended by faculty members, proud parents and distinguished guests, including Prof. Dr. Najibul Haq, Patron, Prime Foundation, Dr Nasir shah ,DG HEC, Dr. Prof. Zahoor Ahmad Swati, Director ,RIU Peshawar campus, Prof. Dr. Hafeez Ur Rahman, Dean, PMC; Prof. Dr. Mohammad Aman Khan, Principal, PMC, Prof. Dr. Saeed Anwar, Executive Director, Prof. Dr. Mohammad Raza, Principal PDC. During the ceremony, graduates received their degrees and took the Hippocratic and Professional Oaths, pledging to uphold the values of service, empathy, and professional excellence throughout their careers. Gold Medals and awards were presented to outstanding students in recognition of their exceptional academic achievements. Hoor Irfan Khan of PMC was declared Best Graduate MBBS 2019-2024, securing seven awards, including six Gold Medals. Aqsa Kiramat of PDC earned six awards, including five Gold Medals, as Best Graduate BDS 2020-2024, while Usman Afridi of Rufaidah Nursing College was named Best Graduate Generic BSN 2021-2024. Other distinguished recipients included Aliza Sajjad, PDC, with four medals, Zarmeena Ikram, PMC, with three, Gulalay Begum, PMC, with two Gold Medals and Maimoona Khan, PMC, Malaika Syed Bukhari, PDC and Maimoona Khanzada, PDC, each earning one Gold Medal for their outstanding performances. Addressing the gathering, Prof. Dr. Anis Ahmad congratulated the graduates and their families, urging them to uphold ethical values and dedicate their skills to serving humanity",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}