{
  "article_id": "2025-10-26_b67751ae2f851ee95b9fca119673502d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-iran-agree-to-form-joint-committee-for-swift-resolution-of-border-trade-issues/",
    "retrieved_at": "2025-10-25T22:54:12.767Z"
  },
  "metadata": {
    "title": "Pakistan, Iran agree to form joint committee for swift resolution of border trade issues",
    "author": null,
    "date_published": "2025-10-25T18:36:31.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/aleem-1.jpg",
    "categories": [
      "National"
    ],
    "word_count": 479,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 25 (APP):Pakistan and Iran have agreed to form a joint committee to resolve issues hampering border trade and logistics between the two countries, reaffirming their commitment to deepen economic cooperation and regional connectivity. This understanding was reached during a meeting between Iran's Minister for Roads and Urban Development Ms Farzaneh Sadegh and Federal Minister for Communications, Abdul Aleem Khan here, said a press release issued on Saturday. The newly constituted joint committee - comprising officials from both sides - will submit its final report within a week, with a special focus on addressing logistical hurdles faced by Iranian commercial trucks entering Pakistan. Following their discussion, Iranian Minister Farzaneh Sadegh also held meeting with Federal Minister for Railways Hanif Abbasi and Federal Minister for Commerce Jam Kamal Khan where a detailed review of Pakistan-Iran trade and connectivity was undertaken. Federal Minister for Communications Abdul Aleem Khan assured the visiting dignitary that all necessary measures will be taken to ensure the prompt clearance of Iranian trade trucks. He issued on-the-spot instructions to the National Logistics Cell (NLC), Federal Board of Revenue (FBR), and other relevant Authorities in this regard. Abdul Aleem Khan emphasized that Pakistan is committed to facilitating regional trade and connectivity, offering Iran access to conduct trade through Pakistan's transit routes to China and other countries. He added that it is encouraging to see Pakistan and Iran brotherly Islamic nations reviving close cooperation after some time which will have a positive impact on regional development. During the joint meeting, Federal Minister for Railways Hanif Abbasi proposed accelerating the implementation of the agreement signed with Iran in September, announcing that a review of the Islamabad-Tehran-Istanbul Train Project will be undertaken in December this year. Meanwhile, Federal Minister for Commerce Jam Kamal Khan expressed Pakistan's keen interest in enhancing the bilateral trade volume with Iran up to USD 10 billion. In response, Iranian Minister Farzaneh Sadegh thanked Federal Minister Abdul Aleem Khan for organizing the meeting at short notice, expressing Iran's desire to expand cooperation in Maritime Affairs through Chabahar and Gwadar Ports. She conveyed that the President of Iran attaches great importance to improving relations with Pakistan, adding that the Regional Transport Ministers' Conference held in Islamabad a highly encouraging development that will yield mutual benefits for all participating countries. Meanwhile, United Nations Special Envoy for Road Safety Jean-Henri Todd also called on Federal Minister for Communications Abdul Aleem Khan to discuss various aspects of road safety and secure travel. Federal Minister informed the UN representative that Pakistan is introducing a series of initiatives, including speed limit enforcement on Motorways and Highways, rapid medical response for accident victims and Air Ambulance Services. Mr Todd appreciated Pakistan's efforts in improving road safety and assured the UN's full cooperation and support. The meeting was also attended by Director General Rescue 1122 Dr Rizwan Naseer and Inspector General of Motorways Police.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}