{
  "article_id": "2025-10-26_6ed89a49b08eef931099821db3d508bb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/domestic/dr-kareem-defends-doctoral-dissertations-in-phd-economics/",
    "retrieved_at": "2025-10-26T11:22:56.294Z"
  },
  "metadata": {
    "title": "Dr Kareem defends doctoral dissertations in PhD Economics",
    "author": null,
    "date_published": "2025-10-26T10:55:14.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/01/The-University-of-Agriculture-Peshawar.jpg",
    "categories": [
      "National"
    ],
    "word_count": 215,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Oct 26 (APP):Dr. Fazal Kareem, a PhD scholar from the Department of Economics under the Faculty of Rural Social Sciences, successfully defended his doctoral dissertation under the supervision of Professor (R) Dr. Himayat Ullah Khan, former Dean of the Faculty. According to University of Agriculture Peshawar on Sunday, Dr. Fazal Kareemas research was titled aThe Relationship between Public Debt and Economic Growth in 11 Selected Asian Countries during 1991a2020.a His dissertation was evaluated and endorsed by renowned professors from Pakistan, the United Kingdom and Turkey. During the defense seminar, Dr. Fazal Kareem confidently answered the queries raised by the examiners and participants, demonstrating his in-depth knowledge and command over the subject. He was subsequently declared eligible for the award of the PhD degree in Economics. The event was attended by Professor Dr. Muhammad Zafar Ullah Khan, Dean Faculty of Rural Social Sciences; Professor Dr. Inayat Ullah Jan, Director Institute of Development Studies; Dr. Malik Muhammad Shafi, Additional Director Advanced Studies and Research; Dr. Shehzad Khan, faculty members, and students. The participants congratulated Dr. Himayat Ullah Khan and Dr. Fazal Kareem on the successful completion of the PhD, expressing hope that the research would contribute significantly to the field of economics and provide valuable insights into public debt management and economic growth in Asian countries.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}