{
  "article_id": "2025-10-26_92da4114e98304defe25cc488e894292",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/no-lasting-peace-without-resolution-of-jk-dispute-pm/",
    "retrieved_at": "2025-10-26T22:44:34.994Z"
  },
  "metadata": {
    "title": "No lasting peace without resolution of J&K dispute: PM",
    "author": null,
    "date_published": "2025-10-26T18:59:58.000Z",
    "image_url": "https://www.app.com.pk/wp-content/uploads/2025/10/uploads434916shehbazsharifpresserpid1664298063-0.jpg",
    "categories": [
      "National"
    ],
    "word_count": 448,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 26 (APP):Prime Minister Muhammad Shehbaz Sharif said that lasting peace and stability in South Asia would remain elusive without the just and peaceful resolution of the Jammu and Kashmir dispute, in accordance with the relevant UN Security Council resolutions and wishes of the Kashmiri people. In a message on Kashmir Black Day observed on October 27, he said, \"Every year the 27th of October marks the darkest day in the history of Kashmir. It was on this day, seventy-eight years ago, that the Indian Occupation forces landed in Srinagar and annexed it - a tragic chapter in human history that continues to this day. Ever since that fateful day, India continues to deny the Kashmiri people their inalienable right to self-determination, as enshrined in numerous resolutions of the United Nations Security Council.\" \"For nearly eight decades, the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) have endured enormous hardship and oppression. We salute their indomitable spirit, courage, and resilience, in the face of fear and persecution. Their unwavering resolve to attain the just and inalienable right to self-determination, remains undiminished,\" he added. The prime minister said, \"Since August 5, 2019, India has further intensified its illegal and unilateral actions, aimed at altering the demography and political status of IIOJK. In addition to human rights abuses, massive curbs have been imposed on freedom of movement and expression.\" \"By imposing such draconian laws, India has unleashed a systematic campaign of violence and brutality to silence the legitimate political voices and crush the aspirations of the Kashmiri people. The unlawful and unjustified incarceration of several prominent Kashmiri leaders and activists, as well as media personalities, is an ugly manifestation of this Indian extremist agenda. Their continued imprisonment, under fabricated charges, is in blatant violation of international human rights norms,\" he noted. The prime minister said, \"Pakistan has consistently condemned these unlawful measures, that defy international law and violate numerous relevant UN resolutions. We have steadfastly maintained our position on the Jammu and Kashmir dispute, which remains clear, consistent, and principled.\" \"As Prime Minister of Pakistan, I have always highlighted the plight of my Kashmiri brothers and sisters before the international community and echoed their calls for freedom from Indian occupation. \"I wish to assure the Kashmiri people, that they are not alone in their struggle, rather, the 240 million people of Pakistan stand resolutely beside them,\" he stressed. The prime minister said, \"We reaffirm our unwavering solidarity with the people of Jammu and Kashmir, and will never relent in our commitment to the Kashmir cause, until justice is done and the promise of self-determination, pledged by the international community, is finally fulfilled. Inshallah, that day is not far.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}