{
  "title": "Veterinary researchers made first ever isolation, molecular characterization of fatal disease in goats",
  "link": "https://www.app.com.pk/national/veterinary-researchers-made-first-ever-isolation-molecular-characterization-of-fatal-disease-in-goats/",
  "date_published": "2022-08-15T07:26:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Aug 15 (APP): Veterinary research scholars in Peshawar have made first ever isolation and molecular characterization of Mycoplasma capricolum subsp Capripneumoniae (Mccp) that causes sever and usually fatal respiratory disease known as `Contagious Caprine Pleuropneumonia’ (CCPP) in goats.\nThe study for molecular characterization of CCPP was conducted by scholars including Faisal Ahmad (College of Veterinary Sciences Department Peshawar University), Hadayatullah Khan, Directorate of Livestock and Dairy Development, Dr. Farhan Anwar Khan, Associate Prof College of Veterinary Science Peshawar University, Bryan D. Carson (Sandia National Laboratories, Albuquerque USA, Umar Siddique, College of Veterinary Sciences, Ijaz Ahmad, College of Veterinary Science, Muhammad Saeed, Faiz-ur-Rehman and Hanif ur Rehman of College of Veterinary Sciences.\n“CCPP causes respiratory complication among goats and is listed by World Organization of Animal Health as a noticeable animal disease, causing economic losses in terms of high morbidity (80 %) and mortality (60 %) as well,” informs Dr. Farhan Anwar, Associate Prof College of Veterinary Sciences Peshawar University.\nTalking to APP, Dr. Farhan said there was very limited information available on molecular characterization of MccP strains prevalent in Pakistan and the study was aimed to isolate Mccp local strain for development of diagnostics and vaccines.\n“We successfully isolated local strain of Mccp for the first time in Pakistan which could be further utilized for the development of diagnostics and control measures against infection in goats,” claims Dr. Farhan while sharing result of the study.\nAfter completion of study, the research scholars have also discovered vaccine of Contagious Caprine Pleuropneumonia and diagnostic kit with the help of which the disease can be contained and dairy farmers be protected from economic losses they face due to mortality of infected goats, he added.\nFarhan said in Pakistan there are around 82 million goats while in Khyber Pakhtunkhwa the number of goats is around 20 million.\nThe vaccine can also be utilized in treatment of wild ungulates including Markhor, national animal of Pakistan, ibexes and deer as they all belongs to goat’s family that fell victim to the disease and die due to lack of treatment and medicine, he disclosed.\nThe vaccine for CCPP can also be utilized in neighbouring Afghanistan where large number of people are associated with pastoral profession and keep ruminants in thousands of numbers.\nSharing details of research study, Dr. Farhan said ten goat flocks each in Gilgit Baltistan, Chitral, Swat, Buner, Hazara were randomly selected and sampled during November 2017 to December 2018.\nThe animals in each flock were showing clinical signs of respiratory distresses including muco-purulent nasal discharge, cough, anorexia, debility etc. The flocks were reared on pastures and each flocks ranged from 300 to 2000 animals.\nNine hundreds (900) samples were collected from animals that includes nasal swabs, tracheal swabs from naturally infected live goats showing clinical signs and lungs tissue (200), pleural fluid samples were taken from goats at necropsy.\nThe most common clinical signs recorded in this study were productive cough, severe mucopurulent nasal discharges, hyperthermia and deep abdominal respiration.\nDr. Farhan Anwar told APP that Contagious Caprine pleuropneumonia is reported throughout the world however the occurrence of this disease is more in under developed countries like Asia and Africa, causing huge economic losses.\nIn Pakistan, Sero-molecular prevalence of Mccp is reported in various regions including Baluchistan, Punjab and Northern areas including Khyber Pakhtunkhwa.\nIn this study, Mccp isolates were recovered from large number of goats of Gilgit Baltistan compared to other regions.\nThis high frequency in such region could be credited to an improper housing systems for large population of goats (ranges from 300 to 2000 in a single flock), exposure to intense cold during winter (CCPP outbreak season),inadequate use of antimicrobials by farmers and pastoralism, Farhan opined.\nThe successful isolation of the local virulent strain of Mccp from naturally infected goats paved the way for the whole genomic sequencing and further molecular research on virulence and antigenic factors of Mccp.\n“Government institutes or private organizations dealing with vaccine preparation and distribution should take benefit of this discovery of CCPP vaccine and initiate measures for its commercialization and availability for the help of dairy farmers of the country, he suggested.",
  "retrievedAt": "2025-08-11T15:24:32.982Z"
}
