{
  "title": "First Lady for concerted efforts to raise awareness about early diagnosis of breast cancer",
  "link": "https://www.app.com.pk/national/first-lady-for-concerted-efforts-to-raise-awareness-about-early-diagnosis-of-breast-cancer/",
  "date_published": "2022-08-15T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): First Lady Begum Samina Arif Alvi on Monday called upon the media, and national and international organizations working in Pakistan to make concerted efforts for raising awareness about early detection of breast cancer among women, especially those who live in the far-flung areas of the country.\nShe said that she had been leading the breast cancer awareness campaign for the last four years which had started yielding results as the number of women availing diagnosis services had increased significantly.\nBegum Samina Alvi made these remarks while chairing a meeting of the national and international organizations working in Pakistan for the prevention and cure of breast cancer, here at Aiwan-e-Sadr.\nThe meeting was attended by representatives of WHO, UNFPA, Islamabad Chamber of Commerce and Industries, NGO Green Star, Shifa International Hospital, Shaukat Khanum Hospital, Human Resource Development Network (HRDN), Aurat Foundation, Khyber Medical College & Khyber Teaching Hospital Peshawar, Dopasi Foundation, Pakistan Girl Guides Association (PGGA), World Food Program, and Roche Pakistan.\nAddressing the meeting, the first lady said that October was observed as breast cancer awareness month worldwide and they all needed to work in coordination for defeating this deadly disease by undertaking awareness activities throughout the year.\nShe said that Pakistan was one of the countries where the mortality rate, due to breast cancer, was the highest in the region due to the late diagnosis of the disease.\nShe said that communities should be involved to create awareness about the early detection of the disease, adding that the screening facilities should also be extended to the maximum areas.\nThe first lady urged the participants to chalk out a comprehensive plan for the entire year to sensitize women about the disease.\nIt was informed in the meeting that thousands of women were losing their lives to breast cancer every year due to the lack of awareness about its symptoms and late diagnosis.\nIt was further highlighted that the chances of survival were quite high if a patient with breast cancer was diagnosed in the initial stages.\nRepresentatives of organizations and NGOs briefed the first lady about their activities with regard to the awareness campaign and treatment of the disease.",
  "retrievedAt": "2025-08-11T15:24:31.464Z"
}
