{
  "title": "Hajj subsidy: Religious affairs ministry to distribute Rs. 5,107.35 mln to pilgrims in easing financial burden",
  "link": "https://www.app.com.pk/national/hajj-subsidy-religious-affairs-ministry-to-distribute-rs-5107-35-mln-to-pilgrims-in-easing-financial-burden/",
  "date_published": "2022-08-15T17:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor on Monday said a sum of Rs 5,107.35 million was being distributed in 34,049 pilgrims from Wednesday who had performed Hajj, 2022 on the government scheme.\nAddressing a press conference on the successful completion of ‘post Hajj operation’, he said the process of Hajj subsidy disbursement would be started from August 17, to August 31.\nThe minister said each pilgrim would be returned Rs150,000 as Hajj subsidy announced by the government during the pre-Hajj operation.\nThe government announced the following subsidy in a bid to share the financial burden of ‘Guests of Allah Almighty’ to some extent keeping in view the sudden increase in Hajj expenses due to rupee depreciation and inflation, he added.\nHe said the pilgrims would be sent a short message service (SMS) on their given cellular numbers for the collection of the said funds and the nominated banks would be bound to refund the amount to Hajj pilgrims according to their convenience such as; bank account, pay order or cash.\nHe asked the pilgrims to contact their banks concerned within the time frame adding it was mandatory to show SMS to the bank officials for the smooth transaction of their subsidy amount.\nPaying tribute to Secretary Aftab Akbar Durrani and his team, Minister Abdul Shakoor said they made extreme effort to make the Hajj arrangements a success story in a short span of time.\nHe said they provided excellent services to the pilgrims from all aspects and left no stone unturned for their ease and comfort.\nHighlighting the main features of this year’s Hajj, he said more than 15,000 pilgrims availed the facility of ‘Road to Makkah’ project from the Islamabad International Airport, they were provided accommodation closest to the Haram after 10 years in Makkah, 24/7 uninterrupted provision of transport to Haram, and provision of four and five-star hotels in Madina.\nIn addition, the tents in Mina were near to the Jamarat while in Arafat, they were close to the Masjid-e-Nimrah and Jabl-e-Rehmat (the Mount of Mercy), he maintained.\nThe minister further said the pilgrims, during their 40-day stay, were provided quality meal three times in a day besides arranging modern and luxury buses for their journey from Makkah to Madina and vice versa.\nHe said with the help of Hajj assistants the visit of Riaz-ul-Jannah in Madina and booking of the baggage and issuance of the boarding passes 24 hours in advance at their residences in Saudi Arabia were made possible for the pilgrims.",
  "retrievedAt": "2025-08-11T15:24:20.804Z"
}
