{
  "title": "Mushaal lambasts Indian govt for turning IIOJK into slaughter house",
  "link": "https://www.app.com.pk/national/mushaal-lambasts-indian-govt-for-turning-iiojk-into-slaughter-house/",
  "date_published": "2022-08-15T17:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 15 (APP): Chairperson Peace and Culture Organization Mushaal Hussein Mullick on Monday lashed out at the supremacist Indian government for turning the Indian Illegally Occupied Jammu and Kashmir (IIOJK) into a world’s largest slaughter house to terrorize Kashmiri people so as they could shun the freedom struggle.\nMushaal, who is the wife of Jailed Hurriyat Kashmiri Leader Yasin Malik, said this in a video message on India’s 75th Independence Day, which was observed as Black Day by Kashmiris living on both sides of Line of Control and across the world to highlight the Indian state terrorism and war crimes before the world.\nShe said that India and Pakistan are celebrating their 75th Independence Day but Kashmiri nation has been deprived of their fundamental rights to live with peace and harmony as citizens of Independent country due to India’s forceful and illegitimate occupation of the valley.\nMushaal said that the people of the scenic valley had been battling for their independence for the last over seven decades during which over 100,000 innocent Kashmiris were martyred.\nThe hurriyat leader stated that the fascist Indian forces unleashed a wave of barbarism and committed war crimes in the IIOJK but the international community and human rights organizations observed a criminal silence.\nMushaal said that the brave Kashmiri people would keep on the fight for the right to self-determination till breaking the shackles of Indian subjugation.\nMushaal said that Indian forces were committing war crimes, genocide against innocent and defenceless Kashmiris.\nShe went on to say that her husband Yasin was a face of peaceful resistance movement but he has been languishing in Tehar death cell for his sole crime to raise voice for the Kashmiris just and birth right of right to self-determination.\nThe chairperson stated that practically, she was living a life like a half widow and their ten year daughter was a half orphan for past eight and half years, as they did not see him.\n“I urged UN and their five permanent represent ivies and embassies around the World and every human being to feel pain of a mother and daughter,” she requested.\nMushaal appealed the world powers, UN bodies and human rights organizations to force the fascist Indian government to decide the Kashmir dispute as per the UN-agreed formula and aspirations of the people the valley.",
  "retrievedAt": "2025-08-11T15:24:19.629Z"
}
