{
  "title": "PM’s Ehsaas launches ‘Mazdoor Ka Ehsaas Report’ to safeguard labour welfare",
  "link": "https://www.app.com.pk/national/pms-ehsaas-launches-mazdoor-ka-ehsaas-report-to-safeguard-labour-welfare/",
  "date_published": "2021-05-01T12:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 01 (APP):Ehsaas hosted a webinar to e-launch, “Mazdoor Ka Ehsaas (MKE) Report” on Saturday to mark the celebration of Labour Day 2021.\nThe webinar was co-chaired by Special Assistant to the Prime Minister (SAPM) on Poverty Alleviation and Social Protection, Dr. Sania Nishtar and SAPM on Overseas Pakistanis and Human Resource Development (OPHRD) Syed Zulfikar Bukhari.\nThe newly launched MKE report recommends that every labour worker in Pakistan should be provided with the social protection and minimum standard of living.\nUnder the umbrella of Ehsaas, Dr. Sania had established the Ehsaas Labour Welfare and Social Protection Expert Group (LEG), in a tripartite arrangement.\nThe mandate of LEG was to propose evidence-based practical recommendations to safeguard workers’ welfare.\nThe LEG brought together distinguished experts representing the government at the federal and provincial levels, employers, trade unions, academia, private sector, development partners and NGOs.\nThe Expert Group made strenuous efforts to widely consult, deliberate and realistically propose crucial areas of interventions for expanding social protection with maximum multiplier gains for the labour class.\nThe MKE report recommends that as a first step towards providing social security coverage for every worker under the ‘Mazdoor ka Ehsaas’, a mechanism needs to be devised to register all informal sector workers, including those in the agricultural sector.\nTo this end, Poverty Alleviation and Social Safety Division (PASSD) is setting up a dedicated MKE Unit to continuously work for the welfare of informal sector workers, agriculture sector workers as well as workers in the formal sector who are not protected by current social security measures.\nFormally welcoming findings of the report, SAPM Dr. Sania stated, ‘Our prophet Muhammad (PBUH) was the first to stand for the rights of workers when he said to ‘pay the worker his wages before his sweat has dried’.\nThe MKE report is the first of its kind that will help the government to focus on universalizing the social protection system in Pakistan and with a particular emphasis on including informal economy workers in the fold of social protection.”\nAdding further she said, “Labour Force Survey 2017-18 microdata suggests that 24.89 million workers are at-risk for jobs disruption and income losses. The government has taken unprecedented steps to minimize the impact of COVID-19 pandemic.\nThe Ehsaas Emergency Cash 2020 is an example of that, which largely protected over 14.8 million daily wage earners and their households whose livelihoods had been adversely impacted by the COVID -19 crisis.”\nThe webinar offered a unique opportunity for all stakeholders to sit together and deliberate on avenues for action on policy recommendations of MKE report.\nThe panel included Dr. Aliya Khan, Labour Economist and representatives from Ministry of OPHRD, ILO, Employers Federation Pakistan, Pakistan Workers’ Federation, World Bank and Asian Development Bank.\nThe panel of experts widely lauded and endorsed the insightful findings of the MKE report and its recommendations for implementation.\nThe MKE report can be accessed at: https://www.pass.gov.pk/Document/Downloads/MKEF.pdf",
  "retrievedAt": "2025-08-11T20:41:03.299Z"
}
