{
  "title": "Ex-DG FIA Bashir Memon retracts allegations against PM",
  "link": "https://www.app.com.pk/national/ex-fia-dg-bashir-memon-retracts-allegations-against-pm/",
  "date_published": "2021-05-01T18:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP): Just days after his tirade, Former FIA Director General Bashir Memon Saturday retracted his allegations against Prime Minister Imran Khan of ordering him to file a case against Justice Qazi Faez Isa.\nMemon, who was widely reported to have alleged that the prime minister had directed him to file a case against Justice Qazi Faez Isa, now said Imran Khan never issued any such instructions to him.\nIn an interview with a private television channel (Hum News), the former FIA chief said the meeting with the prime minister, he had referred to, lasted just two to three minutes.\n“He (prime minister) has always been appreciative now and that time too. He appreciated my professionalism and said being a courageous person, you can do it. Go and do it properly,” he remarked.\nHowever, as the questioner interrupted him for clarification, Memon clarified that “the meeting lasted two to three minutes and no particular case was discussed.”\n“From the very first day, I have been saying the same. I said it everywhere. I will say what happened, not from my own,” Memon explained.\nClarifying again that the prime minister never mentioned the name of Justice Qazi Faez Isa also, he suggested the government to constitute a judicial commission to ascertain the facts.\n“I am talking of judicial commission. If I am wrong, I will prove to be a liar or will prove true, if I am right,” he remarked.\nHe said all including his visits to the Prime Minister House were on record including the objective of his visits.\n“I visited there many times. Even my staff would be knowing why I am going there. May be, the record would be available somewhere. There is nothing to worry about,” Memon said.\nوزیر اعظم کی ذات پر الزام لگائیں، ہیڈلائنز بنائیں اور بعد میں آرام سے یو ٹرن لے لیں، ٹی وی چینل سے کہو تو میڈیا کی آزادی میں خطرہ اور اگر مہمان سے پوچھو تو سیاسی انتقام کا نعرہ۔۔۔ یہ سلسلہ بند ہونا ہو گا pic.twitter.com/TE1MOZ7Fmj\n— Ch Fawad Hussain (@fawadchaudhry) May 1, 2021\nMinister for Information and Broadcasting Chaudhry Fawad Hussain took to Twitter and censured the tendency of getting media fame by targeting the prime minister and then retract the words so easily.\n“Hurl allegations against the prime minister, make headlines and later take a U-turn so easily. If you say something to TV channels, it is (considered) as attack on media freedom. If you question the guest, he calls it a political victimization. This will have to end,” the minister commented.",
  "retrievedAt": "2025-08-11T20:40:58.020Z"
}
