{
  "title": "Labour Day observed with renewed pledge to protect workers’ rights",
  "link": "https://www.app.com.pk/national/labour-day-observed-with-renewed-pledge-to-protect-workers-rights/",
  "date_published": "2021-05-01T18:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 1 (APP):International Labour Day on Saturday was observed across the world including Pakistan with a renewed pledge to protect the rights of workers.\nNo special May Day rally or ceremony was held in any area of the country to observe the day due to the prohibitory orders in form of the ongoing lockdown to avert spread of coronavirus in the country.\nVarious organizations of workers and laborers in different private and public sector institutions individually observed the day staying their homes to commemorate the supreme sacrifices of lives of the laborers in Chicago this day.\nPresident Dr Arif Alvi on the occasion has urged workers and employers of the country to come forward and play their role in making Pakistan a symbol of efficiency, cooperation and progress.\nPrime Minister Imran Khan in his message stated that the present government was committed to improve working and living conditions of the workers through better work environment, provision of housing and education facilities, and extending health cover to them and their families.\nForeign Minister Makhdoom Shah Mahmood Hussain Qureshi said the incumbent government was striving hard to bring real change in living standards of labourers. .\nMinister for Information and Broadcasting Chaudhry Fawad Hussain said Prime Minister Imran Khan’s mission was to change the lives of the working class and the downtrodden.\nMinister of State for Information and Broadcasting Farrukh Habib said the government was committed to give the working class its due rights and status in the society.\nChairman Senate Muhammad Sadiq Sanjrani said that the economic development and prosperity of the country was not possible without the tireless efforts of our laborers.\nNational Assembly Speaker Asad Qaiser said that Labour Day was an opportunity to acknowledge the contributions of working men and women, who are an indispensable pillar of the country.\nMinister for Human Rights Dr Shireen Mazari said that labourers’ role in national development and progress could not be avoided.\nSpecial Assistant to the Prime Minister (SAPM) on Overseas Pakistanis and Human Resource Development (OPHRD) Zulfikar Bukhari announced that the government would soon launch a ‘Kamyab Mazdoor’ project under the banner of Prime Minister’s Kamyab Jawan Programme.\nTo mark the International Labour Day, Sindh government launched Benazir Mazdur Card for provision of financial assistance and other facilities to workers.\nPunjab Chief Minister Sardar Usman Buzdar, in the wake of Labour Day, has announced to fix the minimum wages of workers at Rs 20,000.\nInternational Labour Day observed in the memory of massacre of labourers when the Chicago Police Department shot and killed ten unarmed demonstrators in Chicago, on May 30, 1937. The incident took place during the Little Steel strike in the United States.",
  "retrievedAt": "2025-08-11T20:40:57.996Z"
}
