{
  "title": "PM for widening tax net, swift privatisation of loss-making SOEs",
  "link": "https://www.app.com.pk/national/pm-for-widening-tax-net-swift-privatisation-of-loss-making-soes/",
  "date_published": "2023-09-06T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP): Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday, reiterating his government’s priority to widen the tax net, instructed all the relevant departments to work collectively for bringing in tax reforms.\nThe prime minister, chairing a meeting to discuss the matters pertaining to the Federal Board of Revenue and Privatisation Division, emphasised the need to improve coordination between federal and provincial governments to carry out tax documentation.\nHe said that the FBR was an important component of the government machinery.\nHe instructed the authorities concerned to fulfill the legal obligations to accelerate the privatisation of loss-making state-owned enterprises and asked all the federal ministries to cooperate with the Privatisation Division.\nIn the briefing, the prime minister was told that the FBR was determined to achieve the tax collection target of Rs9415 billion. The Board has collected Rs 538 billion in July this year against the target of Rs534 billion. In August, the tax collection of Rs669 billion was made against the target of Rs 648 billion.\nIt was told that the domestic tax collection has witnessed an increase of 38.7 percent during 2023-24 comparing the previous year.\nThe prime minister was told that digital tools were also being used to enhance the tax-to-GDP ratio and the FBR’s database was also being linked with other departments.\nThe FBR was also striving to achieve the target of including another one million taxpayers in the tax net as 182,000 new taxpayers had already been added this year.\nThe prime minister was told that the scope of Point of Sales syatem was being expanded to more cities and retailers.\nThe efforts are being made to add another 20,000 new retailers in the PoS this year besides formulating a strategy on Transit Trade Management System.\nIt was told that work on the customs digitalisation was underway and Pakistan Single Window system was being linked with more government institutions.\nThe Privatisation Division was working to improve working and service delivery of government corporations by  utilising the capabilities of the private sector.\nInterim Finance Minister Dr Shamshad Akhtar, Advisor Ahad Cheema, federal secretaries of finance, aviation and privatisation, FBR chairman and relevant senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T09:29:02.440Z"
}
