{
  "title": "ISSI eulogise 1965 War martyrs’ sacrifices on Defence Day",
  "link": "https://www.app.com.pk/national/issi-eulogise-1965-war-martyrs-sacrifices-on-defence-day/",
  "date_published": "2023-09-06T15:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): The speakers at a special seminar organised by the Arms Control and Disarmament Centre (ACDC) at the Institute of Strategic Studies, Islamabad (ISSI) on Wednesday paid homage and eulogised the sacrifices of the martyrs of the 1965 War.\nThe ISSI organized the event to mark Pakistan Defence Day under the theme, “Achieving Self-Reliance through Defence Indigenisation”, a news release said.\nDirector General ISSI, Ambassador Sohail Mahmood highlighted the invaluable services of the armed forces in the defence of Pakistan and of the nation, which stood like a solid rock with them, in thwarting Indian aggression on September 6, 1965.\nHe also expressed profound gratitude for the sacrifices of martyrs and their families and stressed that this was a Day to reaffirm our commitment to defend Pakistan at all costs. He highlighted that Pakistan lived in a difficult geostrategic neighbourhood marked by myriad threats and challenges.\n“Today’s security environment has significantly changed and besides traditional and non-traditional threats, new challenges like hybrid warfare have emerged, which not only have a physical effect on a country but also seek to undermine the spirit and morale of a nation,” he noted. Thus, Pakistan must have the ability to defend itself across the entire spectrum of threats and challenges. He concluded that self-reliance in defence was a critically important goal; a lot of progress had been made while a lot more was to be accomplished to reduce dependence on external sources and have robust indigenous capability.\nEarlier, Director of ACDC, Malik Qasim Mustafa in his remarks stated that the nation commemorates this national day as one of the proudest moments in Pakistan’s history when Pakistani soldiers sacrificed their lives to safeguard our freedom and protect our homeland.\nHe further highlighted the defence indigenisation journey from 1951, when the first ordinance factory to manufacture rifles and ammunition was established whereas now Pakistan had more than 20 major public units and over 100 private sectors that engaged in defence production of Pakistan.\nPakistan’s Major achievements include Tank Al Khalid, JF-17 Thunder, Super Mushshak, and K-8. He highlighted that Pakistan’s exports of arms, ammunition, parts, and accessories surged to $415.650 million in FY2023.\nIn her presentation, Aamna Rafiq, Research Associate ACDC, said that Pakistan started its defence journey in 1947 with only 33% of the defence assets from united India. There were no ordnance factories and assets at its inception to boost the country’s defence. Pakistan faced a war over Kashmir right at its inception, and still others in 1965 and 1971. Embargoes were placed, which underscored the need for self-reliance in ensuring Pakistan’s defence. In the seven decades since its inception, Pakistan has come a long way in self-indigenization in defence production. Her recommendations for enhancing defence indigenization included modernizing the roadmap to defence indigenization production, promoting public-private partnerships, establishing digital parks to tap into the tech industry, promoting R&D in universities, and promoting Arms for Peace initiative for defence exports.\nParticipants appreciated the services and sacrifices of Pakistan’s armed forces in safeguarding the country’s territorial integrity and sovereignty. Aspects such as national resolve, unity, resilience, social cohesion, and economic strength were emphasized. Participants reiterated the commitment to work for a strong Pakistan in a whole-of-the-nation approach.\nIn his concluding remarks, Ambassador Khalid Mahmood, Chairman BoG ISSI, stated that we not only need to commemorate the sacrifices that armed forces made during the 1965 war, but also those outside of the battlefield– such as in dealing with natural disasters and for peacekeeping around the world. He pointed out that more than 170 Pakistani soldiers have laid down their lives while rendering services in UN Peacekeeping operations. He further highlighted that, today, security is an all-embracing concept encompassing territory integrity, safeguarding ideological borders, and achieving economic security. As a nation, we have the responsibility to meet these challenges.",
  "retrievedAt": "2025-08-11T09:28:48.868Z"
}
