{
  "title": "Islamabad Police get two-day physical remand of Pervaiz Elahi",
  "link": "https://www.app.com.pk/national/islamabad-police-get-two-day-physical-remand-of-pervaiz-elahi/",
  "date_published": "2023-09-06T15:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP): An Anti-Terrorism Court (ATC) on Wednesday granted two-day physical remand of former Punjab chief minister Chaudhry Pervaiz Elahi to Islamabad Police in a case pertaining to protests and vandalizing the public property at the Judicial Complex.\nATC’s duty judge Sharukh Arjmand, who heard the case, also ordered the police to conduct medical examination of the accused and keep him in a good environment due to his old age. It granted permission to provide home food to the accused during the police custody and allowed his family members to meet him.\nDuring the course of proceedings, the prosecutor prayed the court to grant 15-day physical remand of the accused for the investigation into the case.\nDefence Lawyer Abdul Razzaq Advocate opposed the request for remand, saying that a baseless case had been fabricated against his client. Pervaiz Elahi had been discharged from many cases but later he was arrested in another case.\nThe lawyer said that the Lahore High Court (LHC) had stopped the authorities from arresting his client in any other case and ordered to drop him at his home amid security. Pervaiz Elahi was on way to his home when the Islamabad Police arrested him, he said, adding that the Islamabad High Court (IHC) had also stated that apparently the arrest of his client was against the law.\nHe said Pervaiz Elahi was arrested in a first information report in which he was not even nominated. His client was in Lahore at the time of appearance of Pakistan Tehreek-e-Insaf chairman in the Judicial Complex, Islamabad. How his client could be booked as an unknown accused as he had been the chief minister of Punjab and belonged to a renowned political family, he asked.\nThe lawyer said many accused, including the PTI chairman, had already been granted bails in the same case.\nThe court, however, granted the police two-day physical remand of the accused and ordered to produce him again on September 8.",
  "retrievedAt": "2025-08-11T09:28:45.817Z"
}
