{
  "title": "6 September recalls valor of brave sons of Sialkot at Chawinda tank battle",
  "link": "https://www.app.com.pk/national/6-september-recalls-valor-of-brave-sons-of-sialkot-at-chawinda-tank-battle/",
  "date_published": "2023-09-06T10:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): On September 6, the people paid glowing tributes to the brave sons of the land and armed forces of Sialkot region who battled against the enemy and defended the Motherland by sacrificing their lives in the battle of tanks at Chawinda during the 1965 Indo-Pak War.\nThe valiant Pakistan Army, with the active support of brave people of Sialkot, had repulsed an attack by Indians at the battlefield of Chawinda where the biggest tank battle, after the Second World War, was fought during the 1965 war.\nChawinda is known as the world’s biggest graveyard of 600 invading Indian tanks. The brave soldiers of Pakistan Army and the people of Chawinda-Sialkot had written a golden history of bravery by sacrificing their lives to defend their motherland in Sept 1965.\nIt was a rare show of bravery that the brave soldiers of Pakistan Army and the local people had laid down under the invading Indian tanks with bombs on their bodies, and blew up themselves, completely destroying hundreds of Indian\ntanks, said Defence Analyst Dr. Muhammad Khan while talking to a Private news channel.\nThe Chawinda based Ghazi of 1965 War also recalled that the whole of the world watched that the Pakistani nation was dropping even the last drops of their blood for defending Pakistan and knocked out the invading army.\nSeptember 6 stands out as a symbol of our enduring display of Unity, Faith and Discipline as a nation, said a citizen of Sialkot.\nNo doubt every year this day reminds us of determination, selflessness and sacrifices of our Armed Forces, which they had rendered for the Defence of Pakistan, said Maulana Abdul Khabeer Azad Chairman, Ruet-e-Hilal Committee.\nThe visiting people on the graveyards of Martyred has also paid rich tribute to all martyrs and Ghazis, adding, they said that September 6 stands out as a symbol of our enduring display of Unity, Faith and Discipline as a nation.\nThe world’s biggest tank battle was fought near Chawinda in 1965, said a citizen of Sialkot, adding, the Defence Day was observed in Sialkot with traditional zeal for the district had witnessed the historic tanks battlefield in 1965.\nA large number of people in Sialkot and other cities also visited the venue and showed keen interest in the exhibition related to the Defence Day, said Lt. Gen. (Retd.) Naeem Khalid Lodhi, a defense analyst, adding that the people were paying homage to the personnel who embraced martyrdom while defending the country during the 1965 war.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:29:09.599Z"
}
