{
  "title": "PM reviews measures to expand IT exports by over $5 bn",
  "link": "https://www.app.com.pk/national/pm-reviews-measures-to-expand-it-exports-by-over-5-bn/",
  "date_published": "2023-09-06T12:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday reviewed the measures taken by the ministry of Information Technology (IT) to expand exports by over $5 billion by bringing reforms in the sector.\nHe was chairing a meeting held here to review the ministry’s measures in IT and telecom sectors\nThe ministry informed the meeting about the plan with respect to increasing the country’s IT exports and measures being taken for development of the IT sector in the country.\nThe meeting was informed that the ministry was working to bring all the government services on federal level under one umbrella by digitizing it that would enable the government to improve the tax collection system and identifying the tax evaders. Furthermore, the goal of complete digitization of Pakistan’s economy would also be achieved.\nThe meeting was also informed that it would be made mandatory for all the university students across the country to get the IT training of international standard. “These measure would help increasing the international standard skilled workforce in the IT sector by over 200,000 that would help increasing the IT exports up to US$5 billion,” the meeting was told.\nWith respect to the free lancers in the country, the prime minister was told that the ministry was taking measures to provide training and facilities to the free lancers and facilitating easy inflow of remittances.\nThese measures include interest-free loans to the private sector for the provision of co-working spaces, access of freelancers to internationally popular payment service providers and provision of fast speed internet.\nAfter the implementation of these measures, it will be possible to increase the exports of this sector by 3 billion dollars.\nThe government is also taking steps for easy access to loans and investment for i-startups, due to which external investment of 1 billion dollars is expected in the next 6 months.\nThe ministry also presented the plan for bringing reforms in telecom sector and provision of high speed 5-G service.\nAppreciating the measures taken by the ministry in the telecom and IT sector, the prime minister assured that the government, during its short tenure, would provide all possible support to implement the steps taken by the ministry.\nHe said the measures would help improving the country’s economy besides creating more employment opportunities in the sector, and earning valuable foreign exchange reserves for the country.\nThe meeting was attended by Caretaker minister for information technology Dr Umar Saif, Advisor the the prime minister Ahad Khan Cheema and other relevant authorities.",
  "retrievedAt": "2025-08-11T09:29:06.923Z"
}
