{
  "title": "IHC serves notices on respondents in PTI chief’s pleas",
  "link": "https://www.app.com.pk/national/ihc-serves-notices-on-respondents-in-pti-chiefs-pleas/",
  "date_published": "2023-09-06T16:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):The Islamabad High Court (IHC) on Wednesday served notices to respondents in an appeal against cancellation of interim bails of Pakistan Tehreek-e-Insaf chairman due to non-pursuance in nine cases.\nChief Justice Aamer Farooq heard the plea filed by the former prime minister challenging cancellation of his bails in six cases.\nThe petitioner’s lawyer Salman Safdar Advocate argued that the PTI chairman had been appearing before the courts concerned. However, his bails were later terminated on technical reasons as he could not appear in the courts for being in jail in the Toshakhana case, he added.\nThe chief justice noted that three identical cases of PTI chief were also fixed before the IHC’s division bench.\nMeanwhile, a bench comprising the chief justice and Justice Tariq Mehmood Jahangiri heard the appeals of PTI chief.\nThe petitioner’s lawyer Salman Safdar said his client had already been given bails in five cases of similar nature but the respective Anti-Terrorism Court judges were transferred before judgments in three cases.\nThe lawyer said that they had been requesting the courts to issue directives for the production of PTI chairman as he was unable to arrive himself from jail. He claimed that as per his information his client had not been arrested so far in the said cases.\nJustice Jahangiri questioned how it was possible that the accused was not arrested after his bails were cancelled. The court would hear the other respondents about it, he said, adding the petitioner had to file post arrest bails if the arrests had been made.\nThe court served notices to the respondents and adjourned the case.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:29:01.350Z"
}
