{
  "title": "UNIDO celebrates women accomplishments in leather industry",
  "link": "https://www.app.com.pk/national/unido-celebrates-women-accomplishments-in-leather-industry/",
  "date_published": "2023-09-05T19:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):United Nations Industrial Development Organization (UNIDO) representative Ivan Kral on Wednesday appreciated the collaboration between PTA(SZ)-ES and Bahria University to mark a significant milestone on “Women Empowerment in Leather Sector”.\nA distribution ceremony was held in Karachi which celebrated the accomplishments of women in the leather industry and underscored UNIDO’s unwavering dedication to fostering gender equality and empowerment in this vital sector, said a UNIDO press release.\nIvan Kral highlighted UNIDO’s commitment to offering various learning options, both on-site and online, to promote a cleaner environment and sustainable development.\nThe program, aimed at fostering gender equality and women’s empowerment in the leather industry, offered practical training in key areas such as leather processing, cleaner production techniques, and solid waste management. The successful participants were awarded certificates of completion during the ceremony.\nGulzar Firoz, President of PTA(SZ)-ES, highlighted the significance of the Memorandum of Understanding (MoU) between PTA(SZ)-ES and Bahria University. He mentioned that this program was the second in a series, focusing on empowering women in the leather sector.\nHe also announced that the industry is committed to offering employment opportunities to qualified women in their units, thereby solidifying their dedication to gender inclusivity.\nThe event was a testament to the strong partnership between academia and industry, with Bahria University appreciating the efforts made to bridge this crucial gap. The university management expressed their intention to further explore avenues for collaboration to provide meaningful learning experiences for students that align with industry demands.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:30:20.455Z"
}
