{
  "title": "People, Armed Forces intertwined in unbreakable bond: NA Speaker",
  "link": "https://www.app.com.pk/national/people-armed-forces-intertwined-in-unbreakable-bond-na-speaker/",
  "date_published": "2023-09-06T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP): Speaker National Assembly Raja Pervez Ashraf Wednesday said that people and Pakistan’s armed forces are intertwined in an unbreakable bond.\nHe said that the Pakistani people and its Armed Forces are always ready to offer any kind of sacrifice for the protection of the country.\nHe also said that Pakistan is bound to progress and develop as it is blessed with patriotic people.\nRaja Pervez Ashraf expressed these views while talking to media representatives during his visit to the tomb of Shaheed Captain Sarwar Muhammad Shaheed in Gujar Khan on the occasion of Defense Day.\nThe speaker said that the people of Gujar Khan, a land of Martyrs, would continue to sacrifice their lives to protect Pakistan.\nHe said, “We are a nation of peaceful people but would prove an unbreakable wall to defend our motherland from any nefarious designs of enemies. While denouncing the 9th May vandalism he said, any action to create a chasm between people of Pakistan and its Armed Forces would never succeed.”\nHe said that no sane individual can dare to create a chasm between people and their forces.\nRaja Pervez Ashraf said that sacrifices rendered by our Armed Forces personnel are written in golden words in the bright annals of Pakistan’s history.\nLater on, the speaker also visited the mausoleum of Shaheed  Sawar Muhammad Hussain Shaheed in Gujar Khan.\nHe said that Pakistan is blessed with brave Armed Forces who are always ready to sacrifice their lives for the protection of the country.\nHe said that every Pakistani is ready to sacrifice his life to protect each inch of Pakistan’s land. He also said that 9th May is condemnable in every sense of word as it was enemies’ design to distance people and their armed forces.\nHe expressed his belief that Pakistan would continue to flourish and progress owing to sacrifices rendered by our Armed Forces personnel.\nThe speaker National Assembly also met with people of his constituency.\nHe said that resolving issues faced by common people has always been his top priority as being public representative.",
  "retrievedAt": "2025-08-11T09:29:04.579Z"
}
