{
  "title": "PRCS organizes ceremony to commemorate National Defense Day",
  "link": "https://www.app.com.pk/national/prcs-organizes-ceremony-to-commemorate-national-defense-day/",
  "date_published": "2023-09-06T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):Pakistan Red Crescent Society (PRCS) organized a remarkable ceremony at its National Headquarters on the occasion of Defense Day, dedicated to honoring the martyrs.\nIn his inaugural address, Muhammad Abaidullah Khan, Secretary General of PRCS, underscored the historical importance of September 6th and drew attention to Chairman Sardar Shahid Ahmed Laghari’s message. He emphasized that today also signifies a day of reaffirming our collective commitment to working together for the security, conservation, and prosperity of our nation.\nHe emphasized the vision of Chairman Sardar Shahid Laghari, who believes in timely response and upholding the tradition of safeguarding our nation at all times. “Today, we are here to pay homage to these martyrs who sacrificed their lives to secure our future, our heroes are a source of immense pride for us”, he added.\nAs a leading humanitarian organization, PRCS has consistently delivered exemplary services, regardless of whether the times have been marked by war or peace, and continues to serve humanity with distinction. The ceremony also included expressions of gratitude towards the martyrs’ families.\nDuring the event, PRCS Treasurer, Arshad Muhammad, delivered a speech in which he shed light on PRCS’s services and explored avenues for enhanced collaboration with the International Federation of Red Cross Red Crescent Societies (IFRC), International Committee of the Red Cross (ICRC), and Movement Partners.\nThe ceremony featured a musical performance by junior members of Red Crescent Clubs, with participants wearing traditional attire representing various cultures. PRCS also screened a documentary highlighting their efforts in rehabilitating prisoners, providing treatment to the wounded, and executing various relief activities.\nThe event was attended by notable figures, including representatives from the International Federation of the Red Cross Red Crescent Societies (IFRC), International Committee of the Red Cross (ICRC) in Pakistan, Movement Partners including Turkish Red Crescent Society, the German Red Cross and Norwegian Red Cross, dedicated volunteers and PRCS officers.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:29:07.006Z"
}
