{
  "title": "IIUI marks Defense Day of Pakistan",
  "link": "https://www.app.com.pk/national/iiui-marks-defense-day-of-pakistan/",
  "date_published": "2023-09-06T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): A ceremony was held here at the International Islamic University Islamabad (IIUI) on Tuesday to pay tribute to the martyrs of the country on Defense Day.\nChairman Higher Education Commission (HEC), Dr. Mukhtar Ahmed graced the ceremony as the chief guest that was held in the Council Hall of the new campus of the University. The event was also attended by President IIUI, Dr. Hathal Homoud Alotaibi, Vice Presidents of the university, Deans, senior faculty members, students and other relevant officials.\nDr. Mukhtar said that on the 6th September, 1965, our brave forces crushed the enemy. “The special feature of the 1965 war was the spirit of ideal love for the Pakistan Army and the people of Pakistan,” the Chairman HEC said.\nHe said today, there is crucial need to awaken and re-energize that spirit again. He said we are proud of the brave sons of the soil, especially the Shu­hada who laid down their lives but did not let the enemy move an inch to fulfil its nefarious designs. “The day exudes the spirit of unity and sacrifice in the defense of our motherland”, he said.\nStressing the need for unity, the Chairman HEC said these are high times to stand with each other and rise as a united nation. “It is time to put aside the minor differences and it is the hour of deciding to be a real nation”, he said.\nHe maintained that a large number of martyrs have sacrificed their lives to give us a safe and free homeland. Let’s be one to honor their cause, he added.\nAddressing the youth, he said our youth must recognize the sacrifices of the forefathers and the martyrs. He called upon the academicians to inculcate the love of homeland in the hearts and minds of students and let them know about the history of our brave heroes.\n“We owe our freedom and peace to the eminent sacrifices of our martyrs and veterans”, he said. Dr. Mukhtar added that today, we have gathered to mark the Defense Day to pay tributes to the martyrs and Ghazis and reaffirm our commitment to defend the motherland against all threats. To pay tribute to the martyrs, the recently released national song by ISPR was also played on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:29:00.821Z"
}
