{
  "title": "Salik welcomes CDA chief announcement for Mesaak Chowk, launches blood donation camp",
  "link": "https://www.app.com.pk/national/salik-welcomes-cda-chief-announcement-for-mesaak-chowk-launches-blood-donation-camp/",
  "date_published": "2023-09-06T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP):Former Federal Minister for Population Welfare and Chairman World Minorities Alliance J Salik on Wednesday thanked Chairman Capital Development Authority (CDA) Captain (R) Anwarul Haq Kakar for announcing the Mesaak (Harmony) Chowk in the federal capital and announced to launch a three-day blood donation camp to collect 1000 blood bottles in the Argentina Park from September 7th.\nThe Chairman of the Alliance during a media talk alongside Argentina Park demand to declare the Mesaak Square near the GPO in front of the Police Martyrs’ Memorial in G-6/2. On the occasion of National Defence and Martyrs Day,he also paid rich tribute to the martyrs and their supreme sacrifices for the motherland.\nTalking to the media, J Salik said that the Jarranwala incident hurt the sentiments of not only Christians but the entire nation.\nHe said, “The Holy Prophet (PBUH) in his famous Six Commandments ordered Muslims to protect the fundamental, civil and religious rights of their Christian brothers. Muslims should follow the instructions of the Holy Prophet (PBUH).”\nJay Salik told reporters that the senior judge of the Islamabad High Court, Justice Babar Sattar, while giving a verdict on the petition submitted by him, ordered the Prime Minister to make the six orders of the Holy Prophet (peace and blessings of Allah be upon him) as part of the national curriculum.\nHe further said that the country became free from British colonialism after the undying sacrifices of 300,000 people, including women, girls, children, youth and elders. However, at the end of his blood donation camp at Argentina Park, J Salik will start his nationwide campaign of 300,000 blood bags’ donation.\nTherefore, he said that after the incident of Jarranwala, it has been decided to start a nationwide campaign to remember the great sacrifices of our founders and martyrs of the nation to unite the nation and pay tribute to them.\nHe said, “This blood drive is being started from Islamabad and will be held across the country so that all the countrymen irrespective of creed and caste can donate blood for their motherland and their needy brothers and sisters. It will make Christians and Muslims united to donate blood for the country.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:29:25.044Z"
}
