{
  "title": "Pakistan’s annual 48.5m tons waste underscores untapped recycling business potential: Experts",
  "link": "https://www.app.com.pk/national/pakistans-annual-48-5m-tons-waste-underscore-untapped-recycling-business-potential-experts/",
  "date_published": "2023-09-06T14:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 6 (APP): The experts on Wednesday said Pakistan currently faces the formidable task of managing approximately 48.5 million tons of solid waste each year, with an annual growth rate of 2.4 percent driven by population growth and urbanization. It underscores an untapped potential for recycling business to both manage pollution and run a circular economy.\nPakistan’s waste management challenges and the untapped potential of its youth were brought to the forefront in a transformative one-day capacity-building workshop organized by the Institute of Urbanism (IoU) in collaboration with Heinrich Boell Stiftun (hbs), Higher Education Commission of Pakistan (HEC) and Green Youth Movement (GYM), a news release said.\nThe lack of proper waste management infrastructure has resulted in widespread pollution, environmental degradation and a significant toll on public health. The event drew attention to the pressing need for sustainable waste management practices and highlighted the pivotal role of the younger generation in shaping a cleaner and greener future for the nation.\nThe opening address was delivered by Dr. Ejaz Ahmed, Senior Research Fellow at IoU, who highlighted global examples of waste-to-energy initiatives and stressed the numerous opportunities available for youth in this domain.\nThe workshop’s significance was underscored by Syed Shahryar, Deputy Program Manager of HEC, who emphasized the role of education in harnessing the potential of Pakistan’s resource-rich landscape, and the important role GYM plays in educating students about emerging opportunities for youth in green economy.\nAyesha Majid, Program Coordinator at IoU, drew attention to the staggering global waste generation, which amounts to 2.01 billion tons of municipal waste annually. She underscored the importance of a circular economy approach, urging the adoption of the 7Rs: Rethink, Refuse, Reduce, Repurpose, Reuse, Recycle, and Rot. Pakistan’s waste management challenges were highlighted, including the lack of city-level policies and proper segregation measures.\nMuhammad Jibran, Lecturer at Pakistan Institute of Engineering & Applied Sciences (PIEAS), shared inspiring initiatives by the Green Youth Club at PIEAS. The club raised awareness through campus-wide initiatives and established waste segregation policies.\nDuring the panel discussion, Syed Gohar Abbas, CEO of GreenTech Polymer, highlighted his journey into recycling and stressed the range of opportunities available for newcomers. He underlined the global trend toward using recyclable resources and emphasized that recycling not only leads to cleaner and healthier cities but also offers financial benefits. He also encouraged the students of other GYM Clubs to adopt waste segregation policies at their campuses.\nWaleed Hameed, Director of Corporate Social Responsibility & Sustainability at Lasani Fiber, echoed the sentiment of opportunities in recycling. He urged students to get their “hands dirty” and embrace the recycling business. He outlined various materials that can be recycled, including polyethylene bags, bottle caps, and agricultural films.\nIn addition to discussions, the workshop engaged students in group activities aimed at generating innovative solutions for converting trash into treasure. These activities showcased the creative thinking and commitment of young participants to address Pakistan’s waste-related challenges.\nThe “Trash to Treasure” workshop represented a vital step towards nurturing a new generation of environmentally conscious and innovative leaders. With the combined efforts of IoU, hbs, GYM, and HEC, Pakistan’s youth are being equipped with the knowledge, tools, and inspiration needed to transform waste into valuable resources, contributing to a more sustainable future for the nation.",
  "retrievedAt": "2025-08-11T09:28:51.670Z"
}
