{
  "title": "Jamal Shah stresses preserving traditional art forms",
  "link": "https://www.app.com.pk/national/jamal-shah-stresses-preserving-traditional-art-forms-2/",
  "date_published": "2023-09-06T18:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP):Caretaker Federal Minister for National Heritage and Culture Jamal Shah Wednesday stressed the significance of nurturing both tangible and intangible heritage, besides preserving Pakistan’s cultural traditions and traditional art forms.\nSpeaking at the conclusion of the three-day event titled “Showcasing Art by Cinema Sign Board Painters” at the Lok Virsa Heritage Museum, the minister said the Culture Division was actively working on a plan to document and preserve fading traditional skills and artistic expressions.\nLok Virsa arranged the exhibition of cinema board paintings as part of the Pakistan Defence Day celebrations, featuring renowned artists from across the country.\nThe minister emphasized that the 6th September held a significant place in the country’s history. “On this day in 1965, Pakistan’s armed forces and its people effectively countered the enemy’s sinister plans. The bravery and valor they exhibited during that time are unparalleled in history.”\nThe entire nation paid tribute to the Martyrs and ‘Ghazis’ who made ultimate sacrifices in defense and security of the motherland, he added.\nThe minister said cinema board painters played a vital role in preserving and promoting the nearly extinct form of art in the country.\n“I’m pleased that Lok Virsa has arranged this significant exhibition highlighting cinema board paintings,” he added. “This art form, nearly on the brink of extinction, requires promotion.”\nHe said the National Heritage and Culture Division was committed to preserving the indigenous folk cultural heritage of the country, and in that regard it was the process to organize a national-level conference.\nThe folk singers through their songs paid tributes to the Martyrs, Ghazis, and national heroes.\nThe minister distributed awards and prizes among the artists and painters.\nA large number of residents of the twin cities visited the exhibition.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:28:59.387Z"
}
