{
  "title": "Ambassador Blome highlights benefits of U.S. Private Sector Investment, bilateral relations",
  "link": "https://www.app.com.pk/national/ambassador-blome-highlights-benefits-of-u-s-private-sector-investment-bilateral-relations/",
  "date_published": "2023-09-06T11:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 06 (APP): U.S. Ambassador Donald Blome visited Lahore September 4-6 to promote U.S.-Pakistan trade and economic ties, broaden and deepen cooperation with the people and government of Punjab.\nHe also discussed the importance of protecting and respecting human rights and fundamental freedoms for all, said a press release issued here on Wednesday by the U.S. Embassy.\nDuring his visit to PepsiCo’s FritoLay Snack plant and NetSol Technologies Ltd, Ambassador Blome and Consul General Hawkins reaffirmed the United States’ commitment to trade, investment, and development with and through the private sector in Punjab. Ambassador Blome highlighted the benefits of U.S. trade and investment and showcased the significant role U.S. companies play – creating jobs and giving back to local communities through corporate social responsibility initiatives that promote education, health, disaster relief, women’s empowerment, and skills development. “Pakistan has tremendous economic potential. The United States is working every day to help Pakistan make progress on economic reforms that will make it more competitive and better prepared to meet future challenges.\nThat includes our cooperation to build more reliable energy systems, strengthen and improve infrastructure, increase capacity for regional trade, and ensure that Pakistanis have the skills and training needed to compete and succeed in the 21st century,” Ambassador Blome said.\nWhile in Lahore, Ambassador Blome and Consul General Hawkins also met with caretaker Punjab Chief Minister Mohsin Naqvi.\nThe leaders discussed opportunities to expand U.S.-Pakistan economic ties, the importance of protecting the human rights and fundamental freedoms of religious minorities, and respect for democracy and rule of law.\nIn his meetings with representatives of religious groups, the Ambassador and Consul General Hawkins reiterated U.S. condemnation of recent attacks on Christian churches and homes, emphasized U.S. commitment to protect and promote religious freedom, and underscored the importance of protecting and respecting human rights and fundamental freedoms for all.\nThe Ambassador and Consul General discussed with Punjab Inspector General of Police Usman Anwar law enforcement cooperation, respect for the rule of law, the protection of human rights, and our shared interest in strengthening the professionalization of law enforcement – including by enhancing access to justice for women and girls and ensuring gender representation in the police force.\nThroughout his visit, the Ambassador welcomed the opportunity to engage with the people and the caretaker government of Punjab. He leaves Punjab grateful for the incredible warmth and hospitality and energized to continue strengthening our enduring partnership on education, economy, health, and rule of law.",
  "retrievedAt": "2025-08-11T09:29:06.944Z"
}
