{
  "title": "CDWP approves Rs 250 bn Chashma Righ Bank Canal project: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/cdwp-approves-rs-250-bn-chashma-righ-bank-canal-project-ahsan-iqbal/",
  "date_published": "2022-06-07T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 7 (APP):Minister for Planning and Development, Ahsan Iqbal Tuesday said that the Central Development Working Party (CDWP) has approved Rs 250 billion Chashma Right Bank Canal (lift cum gravity), and referred with recommendation to the Executive Committee of National Economic Council (ECNEC) for further approval.\nAddressing a press conference, the minister said, the project that was lingering on for 30 years would help irrigating 275,000 acres of lands in the Southern Districts of Khyber Pakhtunkhwa province.\nOut of total cost, the federal government would spend 65% while the rest 35% funds would be spent by the provincial government.\n“This project had a long standing issue and the current government took this project on priority and approved and included in the federal Public Sector Development Programme (PSDP) 2022-23”, he added.\nAhsan Iqbal said the federal government would try to complete the project as early as possible to bring revolution in the agriculture sector of the KP province.\nThe minister informed that the CDWP also approved power project of the Rs 900 billion Diamir Bhasha Dam project.\nHe said the PML-N government had started work on this project and spent Rs 120 billion for acquiring of land for the project.\nHowever, he regretted that the previous government delayed the project due to which the cost of the project increased from original Rs 480 billion to Rs 705 billion.\nHe said the previous government did not revise the project cost and did not give any financial plan for the additional cost of around Rs 225 billion.\nAhsan Iqbal further informed that on the direction of the Prime Minister, the Chaman-Quetta-Karachi (N-25) dualizing road project had also been approved.\nHe said the government was giving special priority to the Balochistan road project to improve the socio-economic condition of the local residents.\nThe Planning Minister pointed out that there was shortage of electricity near the Makran Coastal areas where Pakistan was getting 100 MW of electricity from Iran.\nHe said this amount of electricity was not sufficient to meet the requirement therefore he had met with the Iranian Ambassador in Pakistan who assured that the agreement for additional 100 MW electricity from Iran would be finalized soon.\nHe said he had also directed the concerned authorities to complete the 29 kilometers transmission line on Pakistan side within three to four months.\nThe minister said that the Civil Aviation Authority had also been given the task to complete construction of the New Gwadar International Airport by March 2023.Further, he said the water desalination plant in Gwadar would also be completed by October this year.\nHe informed that the CDWP had also approved University of Gwadar.To a question, the minister said the coalition government had started talks with the Chinese side to start the long-standing ML-1 railway project under China Pakistan Economic Corridor (CPEC).\nHe said the both sides have agreed to start the project. He hoped that work on the project might start within a year.\nHe informed that in previous four years In four years, the previous government did not work on the project therefore cost of project had been increased.\nSo now, he said the Chinese contractors are asking for the cost revision, therefore both Pakistan railways’ authorities and the Chinese contractors were engaged in reviewing the terms of financing.",
  "retrievedAt": "2025-08-11T15:02:43.562Z"
}
