{
  "title": "PTA conducts second nationwide mobile quality of service benchmarking test",
  "link": "https://www.app.com.pk/national/pta-conducts-second-nationwide-mobile-quality-of-service-benchmarking-test/",
  "date_published": "2022-02-28T13:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): Pakistan Telecommunication Authority (PTA) has conducted a second nationwide Network Performance Score (NPS) Benchmarking Campaign in different cities, towns, and motorways/highways throughout the country to assess the quality and performance of mobile networks in line with the latest NPS methodology.\nA total of five cities, four towns, and four motorways/highways were surveyed and more than 15,000 voice calls were made and 45,000 data tests were performed.\nThe Quality of Service (QoS) test covered an area including cities, towns, and roads in federal and provincial capitals of approximately 4,522 KM in length, said a news release issued here on Monday.\nNPS is a harmonized and integrative scoring methodology standardized by European Telecommunications Standards Institute (ETSI) that characterizes the overall network performance based on automated tests with commercial smartphones simulating the typical end-user behavior (voice call, browsing etc.) in a public network.\nNPS enables telecom regulators to compare and assess the quality of all mobile networks based on international standard KPIs. NPS is now part of Cellular Mobile Network Quality of Service (QoS) Regulations 2021 issued by PTA.\nBased on this, PTA has gained valuable insights about the performance of each mobile network operator. By making this survey public, PTA is spurring competition among the operators to improve their existing infrastructure to increase country-wide mobile network quality. Bringing Pakistan’s LTE networks at par with the internationally adopted standards will lay the foundation for a future roll-out of 5G technology on a sound footing.\nPTA conducts nationwide mobile QoS surveys on periodic basis to assess the network performance of all Cellular Mobile Operators (CMOs) with respect to licensed KPIs for voice, data, and SMS services. Results are available at PTA’s website for awareness of subscribers besides taking the same with concerned operator(s) for required actions to improve services wherever required.\nThe NPS report detailing the survey results can be seen at: https://pta.gov.pk/assets/media/second_network_performance_score_28022022.pdf",
  "retrievedAt": "2025-08-11T14:26:05.455Z"
}
