{
  "title": "Shehbaz using delaying tactics to avoid indictment in money laundering case: Farrukh",
  "link": "https://www.app.com.pk/national/shehbaz-using-delaying-tactics-to-avoid-indictment-in-money-laundering-case-farrukh/",
  "date_published": "2022-02-28T08:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Monday said Pakistan Muslim League-Nawaz (PML-N) President Shehbaz Sharif was using delaying tactics to avoid his indictment in the money laundering case filed by the Federal Investigation Agency (FIA).\n“It is my appeal to the court to accept the fresh petition of FIA seeking day-to-day hearing in Shehbaz Sharif case,” he said while addressing a news conference here.\n“We have said time and again that the justice should manifest it has been dispensed so that the powerful have fear of the law,” said Farrukh who believed that the daily hearing of Shehbaz’s case would eventually stop him to hamper the ongoing accountability process.\nHighlighting the significance of timely concluded court cases the minister cited a maxim, “justice delayed is justice denied.”\nThe minister said Shehbaz Sharif had sought adjournment in his case for nine times, while his lawyer filed some six different types of petitions to avoid his indictment in the money laundering case.\nHe said Shehbaz was to be indicted by the court on February 18, which was deferred till February 28. But today, his lawyer again sought a new date for the next hearing presenting lame excuses.\n“If Shehbaz Sharif thinks he is innocent then why there is a need to seek adjournments on regular basis,” he quipped asking the PML-N president to face the court if he did no corruption.\nShehbaz claimed that he did not commit corruption even of a single penny, but the case filed by FIA had badly exposed his loot and plunder of billions of rupees, the minister noted.\nThose who had done the corruption were now hiding themselves behind the adjournments, he added.\nHe said Rs16 billion were deposited in the accounts of 14 employees of Ramzan Sugar Mills whereas some 17,000 transactions were made into the fake accounts.\nHe said billions of rupees were poured in the account of Maqsood who was a peon in the Ramzan Sugar Mills and drawing nominal salary of Rs 10,000 per month.\nThe minister said people like Masroor Anwar were their front-men who used to deposit illicit money in the bank accounts of Shehbaz Sharif from 2008 to 2017.\nSimilarly, Farrukh said, Maryam Nawaz was using delaying tactics in her corruption case to avoid facing the consequences. It was the habit of Sharif family to adopt different tactics to protect themselves and their corruption.\n“The Sharif family was rightly described as Sicilian Mafia and Godfather as they use different tactics to avoid the courts,” he said while accusing Suleman Shehbaz of creating the network of fake accounts to launder the illegal wealth of his father.\nHe said Shehbaz Sharif’s name should be registered in the Guinness World Records book for inventing new ways of the corruption and money laundering.\nThe minister said Shehbaz had to give answer to the court for his corruption and submit evidence to prove his innocence.\nTo a query, he said the opposition did not have any charter of demand, but their only agenda was the loot and plunder.\nHe regretted that Pakistan Peoples Party (PPP) Chairman Bilawal Bhutto Zardari was striving to protect corruption of his father Asif Ali Zardari instead of following the footprints of his mother Shaheed Benazir Bhutto and grandfather Zulfikar Ali Bhutto.\nFarrukh said the PPP was ruling the Sindh province for the last 14 years, but did nothing for the welfare of the provincial dwellers.\nHe said the Haqooq-e-Sindh march of Pakistan Tehreek-e-Insaf was getting overwhelming response as it represented the wishes of the people of Sindh who had been deprived of basic amenities of life due to bad governance and corruption of the provincial government.\nThe minister said the long march of PPP against the government would soon relegate to “short and quick” march.",
  "retrievedAt": "2025-08-11T14:25:51.664Z"
}
