{
  "title": "Universities need paradigm shift towards online education to produce more graduates: President",
  "link": "https://www.app.com.pk/national/universities-need-paradigm-shift-towards-online-education-to-produce-more-graduates-president/",
  "date_published": "2022-02-28T09:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 28 (APP): President Dr. Arif Alvi on Monday urged the universities to broaden the scope of their education systems by promoting virtual dissemination of knowledge in order to increase the number of graduates in the country.\n“Besides the conventional brick-and-mortar system, our higher education system needs a paradigm shift to focus on online education as well to match the growing needs of the contemporary world,” the president said, in his address here at the 14th convocation of Sarhad University of Science and Information Technology Peshawar.\nPresident Alvi said by the year 2030, the world would be needing 80 million graduates in the field of information technology. In this regard, he said, Pakistan must produce graduates capable of exploiting global opportunities.\n“For Pakistan, making education common for all is the key to development. Virtual education is the only rapid way to achieve this goal,” he said.\nHe mentioned his already launched Presidential Initiative of Artificial Intelligence and Computing as an important step in reshaping and revolutionizing the country’s education, research, and business systems through the adoption of cutting-edge technologies.\nTerming Pakistan’s youth bulge as a valuable resource for the country, he asked the graduates to explore the world by acquiring quality knowledge and the latest skills.\nThe president said the world was reaching out to Pakistan in view of its human resource and emphasized the need to tap the opportunities as per the growing demand of the international market.\nRecalling Prime Minister Imran Khan’s recent visit to China as a win-win situation in terms of growth and development, he said the areas of agriculture, pharmaceutical, automotive, textile, and information technology offered vast scope for Pakistani students and professionals.\nPresident Alvi said Pakistan was emerging as a stable State with exponential development in various fields and advised the youth not to pay attention to the statements of despondency about the country.\nHe congratulated the graduates on securing positions in their respective disciplines and urged them to keep working hard by adhering to the principles of morality, Islamic traditions, and national identity.\nMinister for Higher Education, Khyber Pukhtunkhwa Kamran Khan Bangash said the provincial government was promoting higher education by facilitation both public and private sectors.\nHe mentioned that skill development, scholarships, and setting up new educational institutes were the priority areas of the KP government.\nEarlier, President Alvi awarded medals to the distinguished students of Ph.D., MS, Phil, Masters, Bachelors, and other associate degrees.",
  "retrievedAt": "2025-08-11T14:25:51.580Z"
}
