{
  "article_id": "2025-01-03_1908d793578849006f3d112a55147ead",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882839/south-africa-win-toss-and-bat-first-in-second-test-against-pakistan",
    "retrieved_at": "2025-08-26T06:02:32.872Z"
  },
  "metadata": {
    "title": "South Africa win toss and bat first in second Test against Pakistan - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-03T09:11:59.000Z",
    "image_url": "https://i.dawn.com/medium/2024/12/291704435efb020.jpg?r=171314",
    "categories": [],
    "word_count": 292,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "South Africa captain Temba Bavuma won the toss and elected to bat first in Fridays second and final test against Pakistan at a blustery Newlands as the home side seek to claim the series 2-0. \"It's hot and we expect the wicket to break up, we want to finish (the series) on a good note,\" Bavuma said. Pakistan skipper Shan Masood said his side were happy to bowl first. \"A bit less grass than usual (on the wicket) but we would have had a bowl anyway,\" he said. \"Both teams got what they wanted.\" South Africa hand a debut to firebrand 18-year-old fast bowler Kwena Maphaka as one of three changes to their side from the tense two-wicket win in the first test in Pretoria. He will be the youngest player in the country's test history, taking over from former spinner Paul Adams. Opening batter Tony de Zorzi has been ruled out with a left thigh strain and is replaced by all-rounder Wiaan Mulder, who will bat at number three with Ryan Rickelton moving to the opener position. Spinner Keshav Maharaj has recovered from injury and replaces seamer Corbin Bosch. Pakistan have made one change to their side with seamer Mir Hamza replacing Naseem Shah. South Africa have already sealed their place in June's World Test Championship final and while they await their opponents at Lords, this is scheduled to be their final five-day fixture for them before the marquee game. South Africa: Aiden Markram, Ryan Rickelton, Wiaan Mulder, Tristan Stubbs, Temba Bavuma (Capt), David Bedingham, Kyle Verreynne (wk), Marco Jansen, Keshav Maharaj, 1Kagiso Rabada, Kwena Maphaka Pakistan: Shan Masood (Capt), Saim Ayub, Babar Azam, Kamran Ghulam, Saud Shakeel, Mohammad Rizwan (wk), Salman Agha, Aamer Jamal, Khurram Shahzad, Mohammad Abbas, Mir Hamza",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}