{
  "article_id": "2025-01-03_a5a08f49468467bfae177c2ba308b913",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882685/karachi-mayor-seeks-direct-funding-from-centre-for-federal-uplift-schemes",
    "retrieved_at": "2025-08-26T06:03:13.840Z"
  },
  "metadata": {
    "title": "Karachi mayor seeks direct funding from Centre for federal uplift schemes - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-03T01:34:26.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 568,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "KARACHI: City Mayor Barrister Murtaza Wahab Siddiqi on Thursday expressed the hope that the federal government \"will soon open its treasury\" for the development of Karachi and also advised Islamabad that any forthcoming Centre-funded developmental work in the metropolis should be carried out through the local government (LG) institutions instead of federal agencies. Reflecting on his last conversation with Prime Minister Shehbaz Sharif, he expressed the hope that the city's needs would be met with tangible actions and not just with promises. He referred to a meeting with the PM almost a month ago, along with Pakistan People's Party (PPP) Chairman Bilawal Bhutto-Zardari, in which he had presented \"the case of Karachi\" before Shehbaz Sharif. \"The [PPP] chairman didn't only support me but also told the PM that Karachi is the industrial and economic capital of the country and for that he [PM] should open its treasury for the city,\" he said while talking to reporters after inaugurating Shaheed Waja Ahmed Karim Dad Family Park, Maula Madad Pumping Station and Shakoor Shaheed Pumping Station during his visit to Lyari. Inaugurates family park, two pumping stations in Lyari \"So I hope that the PM would not only send a letter in response to our request but would also disburse funds. I have also put the demand before the PM that any development work carried out in the city should be executed through the local government while taking the Karachi administration on board.\" He was of the view that to put an end to hypocrisy, it was essential to deliver good deeds and make them visible to the public. Reflecting on the progress of the past one and a half years, he affirmed that significant improvements had already been made, with more to come. \"The journey has just begun,\" he said. \"We will continue to highlight the development work undertaken by Bilawal Bhutto as all of us are united in achieving his vision for Karachi.\" The mayor also urged all political parties, including the Pakistan Tehreeki-Insaf, Muttahida Qaumi Movement Pakistan, Jamaat-i-Islami, and Pakistan Muslim League-N, to collaborate for the betterment of the city, saying: \"Our collective efforts will transform Karachi into a city we can all be proud of.\" Addressing the recent infrastructure improvements, Mayor Wahab highlighted the restoration of nine pumping stations in Lyari, along with ongoing efforts to beautify the surrounding roads. He was accompanied by Deputy Mayor Salman Abdullah Murad, Karachi Water and Sewerage Corporation CEO Asadullah Khan and local leaders of the PPP. \"This park is dedicated to Shaheed Waja Karim Dad, a prominent social leader of Lyari. The PPP never forgets its martyrs,\" he said and explained that the park was developed on the site of a former sewage pumping station and efforts had been made to revitalise the area and protect it from misuse, including drug addiction. \"A similar park has been established around Jamila Pumping Station in Lyari,\" he added. The mayor also outlined the strategy to address water scarcity and load-shedding issues in the area giving brief details of the planning to address the issue. In an effort to reduce water theft and improve infrastructure, Mayor Wahab referred to a project to lay an elevated pipeline system. The administration, he said, would handle this project itself and in August, a new canal will be laid to provide a more reliable water supply from the Hub Dam. Published in Dawn, January 3rd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}