{
  "article_id": "2025-01-03_2f535affb5367b54a597d2bca6ff634b",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882842/nothing-seen-in-negotiations-between-pti-govt-kp-governor",
    "retrieved_at": "2025-08-26T06:02:32.439Z"
  },
  "metadata": {
    "title": "‘Nothing seen’ in negotiations between PTI, govt: KP governor - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-03T10:32:03.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/03145825ef5d869.png",
    "categories": [],
    "word_count": 397,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Friday said that \"nothing was seen\" in the negotiations taking place between PTI and the government. The PTI yesterday sought more time from the government to consult party founder Imran Khan on the final negotiation agenda, ahead of the third meeting scheduled for next week. The first meeting between committees representing the government and the opposition PTI took place on Dec 23, kicking off long-anticipated talks between the rival parties to defuse prevailing political tensions. Sources had said that the PTI had decided to limit itself to two initial demands in yesterday's talks; the release of under-trial political prisoners and the formation of a judicial commission to probe the events of May 9, 2023 and Nov 26. Background discussions with party leaders revealed that it was annoyed by the \"illogical and absurd statements\" about the talks, being issued by government ministers, and wanted the ruling party to review its \"nonsensical approach and create a favourable environment for talks\". While speaking at the press club today, the governor said nothing could be seen to come out of the negotiations taking place between the two, adding that he had reservations over the meeting but would \"only pray for the committee.\" \"Negotiations are the solution to all problems,\" the governor said, adding that he did not see the PTI getting the NRO. The term NRO is used for the National Reconciliation Ordinance which former dictator Gen Musharraf had promulgated after a deal with the Pakistan Peoples Party in 2007, after which cases registered against politicians and others on political grounds had ended. Separately, while speaking about the KP Apex Committee formed by the chief minister, the governor said: \"The people who have disrupted the peace [in the province], how can they chair the meeting?\" Protesters continued their sit-in in Parachinar, headquarters of Kurram district as they announced that they would end their protest only when the roads are opened for traffic and they are made safe for public travel. The two sides signed the peace agreement in Kohat on Wednesday. Kundi said that the leader of the opposition should be part of the apex committee, terming it that the exclusion was the reason why he had reservations. \"Without the opposition, the apex committee has no value,\" the governor said. \"When I said we should go to Kurram, the CM reached there,\" Kundi said.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}