{
  "article_id": "2025-01-03_e694576864f83d3cb4f0392e084d5221",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882689/poverty-mental-illnesses-fuelling-suicides-in-tharparkar-experts",
    "retrieved_at": "2025-08-26T06:03:14.867Z"
  },
  "metadata": {
    "title": "Poverty, mental illnesses fuelling suicides in Tharparkar: experts - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-03T01:34:26.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 696,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "KARACHI: Experts have highlighted that growing mental health crisis and its lack of awareness, particularly in the Tharparkar region, are leading to high rate of suicides, affecting both Muslims and Hindus, with a higher incidence among Hindu scheduled castes. They were speaking at a programme at Karachi University (KU) on Thursday where they also pointed out that a significant number of people in the desert region believed that mental illnesses were contagious, while highlighting the need for continued education to dispel misconceptions and reduce stigma. The programme was held to share findings of a study project - Psychological Intervention to Reduce Suicide Rates in Remote Area of Pakistan, Tharparkar Desert - jointly conducted by Sindh Mental Health Authority (SMHA) and KU last year. It was designed as a descriptive cross-sectional study comprising interviews of over 5,000 residents across the desert region. The primary goal was to assess the mental health, knowledge, attitudes, and practices of the people in Tharparkar. Most people have various misconceptions about psychological problems, study shows Speaking at the event organised by KU's Office of Research, and Innovation, SMHA Chairman Senator Dr Karim Ahmed Khawaja said that the highest number of suicides in Pakistan were being reported from Tharparkar, Chitral, and Gilgit-Baltistan. The Tharparkar region, he said, had been experiencing significant mental health challenges, particularly related to poverty, social issues and increasing suicides. Sharing the study's findings, he said the results revealed that 52.55 per cent of respondents had an awareness of mental health issues. But, the overall level of knowledge was generally low, with 53pc of participants possessing poor knowledge of mental health. \"Interestingly, while 59.93 percent believed in medical treatments for mental health conditions, a large portion of the population (35.57pc) attributed mental illness to past sins, and 28.32pc linked it to supernatural causes,\" he said, adding that these beliefs indicated the prevalence of cultural and religious misconceptions surrounding mental health. Regarding the recognition of suicidal behaviour, respondents identified a combination of behavioural signs (31.07pc), followed by wandering (14pc) and aggression (12pc). Dr Khawaja observed that a lack of awareness about available services and the stigma surrounding mental health (both societal and familial) were also significant obstacles. Additionally, he said, many respondents (70pc) believed that mental illnesses were contagious, highlighting the need for continued education to dispel such misconceptions and reduce stigma. \"This belief, along with high levels of fear regarding interactions with mental health patients underscores the importance of fostering a more supportive community environment for those affected by mental health issues,\" he noted, adding that the study highlighted the need for targeted mental health campaigns and culturally sensitive programmes to improve mental well-being in Tharparkar. Principal Investigator Dr Saima Masoom Ali, also the faculty member of KU Department of Psychology, presented her project report and mentioned the team visited various locations to study the suicide issue in detail. \"One of the identified causes of suicide was borrowing money on interest and then being unable to repay it,\" she shared, adding that the dangers of substance abuse were also discussed with the participants. She concluded that a series of research and awareness sessions were conducted across Tharparkar and Umerkot to understand the causes behind suicide and to empower communities with coping mechanisms, education, and social support strategies. The sessions involved interactive discussions, activities, and multimedia presentations, addressing various themes such as mental health, social bonds, and small-scale entrepreneurship, she said. KU Dean Faculty of Arts and Social Sciences Prof Shaista Tabassum noted that much of our research is limited to statistics and lacks actionable recommendations. \"To ensure positive outcomes, research must include recommendations, as identifying problems is only the first step. Finding solutions is equally important,\" she added. KU Vice Chancellor Prof Khalid Iraqi underscored the need for discussing mental health issues openly. \"Our tragedy is that we still consider talking about certain subjects a taboo. We need to change this mind-set, recognize the disease for what it is, and promote awareness about it.\" Earlier, KU Director Dr Syeda Hoor Ul Ain in her welcome address expressed the hope that the collaborative research efforts of KU and SMHA would help understand and prevent suicides. Published in Dawn, January 3rd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}