{
  "article_id": "2025-01-03_7323ef0766e27df7ac07eddf35f7c559",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1882743/scba-hails-pti-shrugs-off-relief-handed-to-19-convicts",
    "retrieved_at": "2025-10-12T00:41:58.466Z"
  },
  "metadata": {
    "title": "SCBA hails, PTI shrugs off relief handed to 19 convicts - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-03T01:51:49.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 484,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "- Rauf Atta backs govt-opposition dialogue - Barrister Gohar slams 'conviction stigma' by military court ISLAMABAD: The acceptance of mercy petitions of 19 people convicted in the May 9 riots case by the army's courts of appeal drew mixed reactions on Thursday with the highest forum of the country's lawyers welcoming it but the opposition PTI expressing its disappointment. Supreme Court Bar Association (SCBA) President Mian Muhammad Rauf Atta said it was encouraging to see that the army's courts of appeal had accepted clemency petitions filed by 19 individuals for their involvement in the May 9, 2023 violence. \"We note that more than 67 people indicted in connection with these riots have also filed clemency appeals,\" the SCBA chief said in a statement, expressing the confidence that other petitions seeking clemency on humanitarian grounds would also be approved. \"It is equally heartening to see that these individuals have acknowledged their serious mistakes and expressed regret, which has led them to file these petitions,\" he said. It was evident that those alleged to be involved in the riots were politically manipulated and became tools of unrest, acting on the directives of their political handlers, said Mr Atta, adding \"nevertheless, a fault confessed is half redressed\". The acceptance of the clemency petitions is commendable. Those responsible for addressing such sensitive issues have provided these individuals with an opportunity for a second chance. They deserve equal recognition for their compassion in prioritising the well-being of the country and its citizens, he pointed out. \"We view this as a positive move towards lowering the political temperature amid the ongoing crises and polarisation,\" said the SCBA president. \"Now, it is crucial for political leaders to also demonstrate restraint, acknowledge their errors, and take on a constructive role in advancing the country's interests.\" Alluding to talks held between the government and PTI on Thursday, Mr Atta said, \"we understand that today marks the second round of dialogue between the government and the opposition\". He said it is important for all parties to recognise that the only way forward is through dialogue, discussions, mutual respect, constructive engagement and political tolerance. \"These elements are vital for fostering a strong and vibrant nation in terms of its economy, politics, democracy and security. We hope for successful conclusion of these talks,\" he concluded. PTI Chairman Barrister Gohar Ali Khan, meanwhile, reiterated his party's position on military trials, Dawn.com reported In response to a question regarding the development, he termed the decision by the military \"not a development\". \"PTI's position has not changed,\" he said while speaking to reporters. \"No civilian should be tried in military court. It remains unconstitutional and the matter will be decided by the Supreme Court,\" he emphasised. While calling the remission a \"good thing\", Mr Khan said, \"There should not be a conviction stigma by the military courts. This should be a civilian court.\" Published in Dawn, January 3rd, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}