{
  "title": "Mega water supply, sewerage projects finalized for city: Usman Dar",
  "link": "https://www.app.com.pk/national/mega-water-supply-sewerage-projects-finalized-for-city-usman-dar/",
  "date_published": "2020-09-13T11:42:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Sep 13 (APP): Special Assistant to Prime Minister on Youth Affairs (SAPM) Usman Dar on Sunday said that mega water supply and sewerage projects had been finalized for the city.\nA master plan had also been chalked out for providing upgraded and advanced municipal facilities to the people of Sialkot city, he added.\nHe expressed these views during a meeting held to review development projects in the city under Punjab Intermediate Cities Improvement Investment Program in collaboration with the Punjab government and Asian Development Bank, at DC Office here.\nProvincial Minister for Special Education Punjab Chaudhry Muhammad Akhlaq, Special Secretary Local Government Babar Awan Babar, Deputy Commissioner Sialkot Zeeshan Javed, DPO Sialkot Capt. (Retd) Mustansir Feroze, Program Director Punjab Intermediate Cities Improvement Investment Program Socrat Aman Rana, Deputy Program Director Imran Ali, Chief Engineer Dr. Javed Iqbal, GM Nespak Muhammad Zubair, ADE Revenue Mir Muhammad Nawaz, MD Salt Waste Management Karim Bakhsh and COMCS Faisal Shehzad were also present.\nSecretary Local Government Dr. Ahmed Javed Qazi and Commissioner Gujranwala Gulzar Hussain Shah also attended the meeting through video link.\nSAPM Usman Dar said that keeping in view the needs of the city for the next 30 to 40 years, the Punjab government hired services of experts from the Asian Development Bank and Nespak and work on the proposed project would begin in the next two months.\nHe said that supply of machinery, vehicles and equipment for solid waste management, construction of landfill site, transport planning and upgrading and maintenance of parks were also in the process of completion.\nDar said that completion of these projects would directly benefit one million residents of the city.\nOn this occasion, Provincial Minister for Special Education Punjab Chaudhry Muhammad Akhlaq directed the experts of Asian Development Bank and Nespak to complete the projects of sewerage and water supply within stipulated time period.\nHe said that under this program the projects would be monitored weekly in the DC office while the departments concerned should devise a mechanism to address complaints of citizens on daily basis.\nSecretary Local Government Punjab Dr Ahmed Javed Qazi, Special Secretary Local Government Babar Awan Babar and Commissioner Gujranwala Gulzar Hussain Shah said the Punjab government was going to spend billions of rupees to make Sialkot a smart city.\nThey said, to make this program successful, all stakeholders, execution agencies, district administration, municipal corporation and solid waste management officials must work together as a team so that the citizens could take full advantage of the huge investment of the Punjab government.\nThey said that in order to make Sialkot a smart district, work had been started on 12 initiatives including human resource management, financial management, e-bidding, e-auction, mapping of government lands.\nThey said that all the departments would work under the supervision of Deputy Commissioner Zeeshan Javed and would be responsible for the completion of Punjab Intermediate Cities Improvement Investment Program.",
  "retrievedAt": "2025-08-11T19:47:59.499Z"
}
