{
  "title": "Pak-China cooperation to bring economic stability in region: AJK President.",
  "link": "https://www.app.com.pk/national/pak-china-cooperation-to-bring-economic-stability-in-region-ajk-president/",
  "date_published": "2021-03-26T13:03:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): Mar 26 (APP): Azad Jammu and Kashmir (AJK) President Sardar Masood Khan has said that completion of energy projects under China-Pakistan Economic Corridor (CPEC) would help overcome the energy crisis at national level, and at the same time, it would bring a visible change in the socio-economic life of the people of AJK.\nHe expressed these views after a briefing given by the chief executive officer of China Three Gorges South Asia Investment (Pvt) limited Yao Feixiong on the hydropower generation project currently under execution at Karot Hollar in Kotli district of Mirpur Division late Thursday, under the CPEC initiative.\nWhile describing CPEC as an important project for the economic development of Pakistan, the AJK president said that on the one hand, it would help develop infrastructure in Pakistan and AJK, on the other, it will raise the living standard of people by providing job opportunities to the local educated people.\n“The execution of 720-MG Karot hydropower generation project would provide jobs to the local people and the completion of this project early next year will provide electricity to more than two million households in the country,” he added.\nHe maintained that the accomplishment of similar other CPEC projects will promote economic activity in AJK and provide jobs to the local educated youth.\nEarlier on arrival at Hollar, the state president was warmly received by the CEO China Three Gorges South Asia Investment (Pvt) Ltd Yao Feixiong, Deputy Executive Officer, General Manager (Environment and social safety), Manager Administration and other Chinese officials, and gave him a briefing on the Karot project.\nHe said it was a major pilot project of the CPEC, which is expected to be completed early next year and generate 3.2 billion units of cheap, clean electricity for Pakistan.\nThe president was told that the project which has a capacity of generating 3.2 billion units of electricity would be completed next year. At present 3,000 people including 1,000 Chinese citizens are working on the project.\nThe Chinese company officials thanked the state president for visiting the project. Later, Sardar Masood Khan took a round of different sections of the project and inspected the construction work.",
  "retrievedAt": "2025-08-11T20:32:57.051Z"
}
