{
  "title": "Dr Faisal launches polio immunisation drive in capital",
  "link": "https://www.app.com.pk/national/dr-faisal-launches-polio-immunisation-drive-in-capital/",
  "date_published": "2021-03-26T12:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 26 (APP): Special Assistant to the Prime Minister on National Health Services, Regulations and Coordination, Dr. Faisal Sultan on Friday launched a five-day national polio immunisation drive in the federal capital.\nThe nationwide campaign will start from March 29 to vaccinate over 40 million children under the age of five year. Around 285,000 frontline workers, respecting COVID-19 safety protocols, will go door-to-door in all 156 districts across the country to administer polio drops.\n“The campaign aimed to raise the immunity of children that remain at risk of the crippling disease,” Dr Faisal said while addressing on the occasion.\nHe said, “COVID-19 continues to challenge us, but we are committed to ensure continuity of the essential public health services during these difficult times.”\nHe added it was an absolute must that all eligible children age should stay protected against vaccine preventable diseases including polio. “Our 280,000 valiant Sehat Muhafiz frontline workers will knock on every door to vaccinate all eligible children in every corner of Pakistan,” he shared.\nHe said that it was every Pakistani’s national duty to ensure that their children, as well as those around, were administered polio vaccine without fail.\nHe said the year 2021 presented a unique opportunity to leverage the gains made in 2020, despite the challenges of the corona virus pandemic.\nDr Faisal said with the cooperation of the public, community leaders, parents and committed frontline workers the programme has successfully and safely implemented six campaigns in 2020.\nHe said frontline workers and programme staff have been diligently trained to adhere to COVID-19 precautionary measures, keeping communities and themselves safe from the virus.\nSpeaking on the occasion coordinator of the National Emergency Operations Centre, Polio Eradication Initiative (PEI), Dr Shahzad Baig said, “We have started witnessing the impact of our hard work over the last six months in terms of improved epidemiology. This is reflected by the declining polio cases and decreased detection of viruses in sewage samples.”\nHe said, “I commend our frontline workers for their amazing commitment and urge further intensifying pressure on the virus by vaccinating every child during the upcoming campaign.\nIt is critical that we sustain our progress to achieve eradication.”\nHe said that immunisation help save millions of lives and was widely recognized as one of the world’s the most successful and cost-effective health interventions. Yet, Pakistan has many unvaccinated or under-vaccinated children, putting them at serious risk of these potentially fatal diseases.\n“Polio campaigns are imperative to give quick immunity boost to children under the age of five.\nAlongside holding the back-to-back planned polio immunisation campaigns, the programme strives to enhance essential immunisation coverage across Pakistan,” he commented.",
  "retrievedAt": "2025-08-11T20:32:57.434Z"
}
