{
  "title": "Saidu Sharif airport to open up Malakand division for adventure sports, tourism: Aviation Minister",
  "link": "https://www.app.com.pk/national/saidu-sharif-airport-to-open-up-malakand-division-for-adventure-sports-tourism-aviation-minister/",
  "date_published": "2021-03-26T10:54:00.000Z",
  "source": "APP",
  "content": "SWAT, Mar 26 (APP): Federal Minister for Aviation, Ghulam Sarwar Khan here said Friday that the resumption of commercial flights from Saidu Sharif airport was landmark day for people of Malakand division that would further open up entire Swat district for tourism,adventure and mountains sports.\nAddressing a function after resumption of flights operation at Saidu Sharif airport here, the Aviation Minister said Swat district was known for its natural and mountainous beauty and reopening of Saidu Sharif Airport would give further boost to tourism, mountains and adventure sports in Kalam, Malam Jabba, Madayn, Gabeen Jabba and adjoining snow clad valleys.\nHe said the resumption of flights operation would help bolster exports, fruits, vegetable, carpet, handicrafts and woolen industries.\nGhulam Sarwar Khan said he had special love for Swat district as he was visiting it since 1960 due to its natural beauty.\nThe Federal Minister said he had visited the shrine of Pir Paba (now situated in Buner district) in 1960 when it was earlier become a part of Swat and was paying visit to Swat district almost every year to enjoy its pleasant weather and natural beauty.\nHe said people of Swat had faced every challenge with steadfast and bravery whether it was the devastated earthquake of 2005, floods of 2010 and menace of militancy and terrorism of 2008-09 and had sacrificed lives and properties for sake of the country.\nThe Minister said entire nation held sacrifices of people of Swat and security forces in war against terrorism in high esteem.\nGhulam Sarwar Khan recalled that people of Taxila and Wah cantt had also opened their hearts and minds for IDPs of Swat and extended full support to them during that time of need.\nHe thanked Prime Minister Imran Khan and Chief Minister Mahmood Khan on inauguration of flight operation and expressed hope that people of Malakand would take full advantage of this facility.\nChief Minister KP Mahmood Khan and Federal Minister for Communication, Murad Saeed was also present on the occasion.",
  "retrievedAt": "2025-08-11T20:32:59.020Z"
}
