{
  "title": "India’s monsoon rains arrive 8 days early, earliest in 16 years - World - DAWN.COM",
  "author": null,
  "content": "Monsoon rains hit the coast of India’s southernmost state of Kerala on Saturday, eight days earlier than usual, marking the earliest arrival in 16 years and providing the promise of a bumper harvest and relief from a gruelling heatwave.\n\nThe monsoon, the lifeblood of the country’s $4 trillion economy, delivers nearly 70 per cent of the rain that India needs to water farms and replenish aquifers and reservoirs. Nearly half of India’s farmland, without any irrigation cover, depends on the annual June-September rains to grow a number of crops.\n\nSummer rains usually begin to lash Kerala around June 1 before spreading nationwide by mid-July, allowing farmers to plant crops such as rice, corn, cotton, soybeans and sugarcane.\n\nThe onset of the southwest monsoon over Kerala on May 24 is its earliest onset since May 23, 2009, the India Meteorological Department (IMD) said on Saturday.\n\nThe monsoon has covered Kerala and parts of neighbouring Tamil Nadu and Karnataka, as well as parts of the northeastern state of Mizoram, the IMD said.\n\nConditions are favourable for the monsoon’s further spread into Goa, parts of Maharashtra, Andhra Pradesh, the northeastern states, West Bengal, and the remaining parts of Karnataka and Tamil Nadu over the next two to three days.\n\nSurplus pre-monsoon rainfall and an early monsoon onset will help farmers, especially in the southern and central states, to sow summer crops earlier than usual, said Ashwini Bansod, vice president for commodities research at Phillip Capital India, a Mumbai-based brokerage.\n\n“Abundant soil moisture and early sowing could potentially boost crop yields,” Bansod said.\n\nLast year, the monsoon reached the coast of Kerala on May 30, and overall summer rains were the highest since 2020, supporting recovery from a drought in 2023.\n\nThe IMD last month forecast above-average monsoon rains for the second straight year in 2025.\n\nThe department defines average or normal rainfall as ranging between 96pc and 104pc of a 50-year average of 87 cm (35 inches) for the four-month season.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:25:29.250Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913053/indias-monsoon-rains-arrive-8-days-early-earliest-in-16-years",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T11:54:45.000Z"
}
