{
  "title": "Saad Munawar becomes first Pakistani to summit Mt Everest from north side - Pakistan - DAWN.COM",
  "author": null,
  "content": "Mountaineer Saad Munawar on Saturday became the first Pakistani to summit the world’s tallest mountain, Mount Everest (8,848.86 metres), from its northern face.\n\nEarlier this month, two other Pakistani mountaineers achieved feats of their own, with renowned Pakistani climber Sajid Ali Sadpara summiting the world’s seventh highest peak, Dhaulagiri (8,167 m), without oxygen or porter support on May 11 and renowned Pakistani climber Sirbaz Khan successfully summiting Mt Kangchenjunga (8,586m), the third highest peak in the world, without supplemental oxygen on May 18.\n\nMunawar’s official Facebook account confirmed the feat, writing that he “raised the green flag at the summit of [the] highest peak in the world”.\n\n“This is the first time that a Pakistani has summited Mt Everest from the north side,” the post added. “Saad has safely descended back to Camp 3 for the night. Requesting prayers for safe descent back to the base camp during the next days.”\n\nAccording to climbers, the route to summit Everest’s northern face starts in Tibet, a different route from most mountaineers who ascend from the Nepalese side.\n\nAdditionally, according to mountaineering website Explorersweb, Chinese authorities only started issuing permits to summit the northern face last January.\n\nSummiting Everest from the north bypasses the Khumbu Icefall, a dangerous section on the South Side, making it safer in that aspect.\n\nMingma G, owner of the Imagine Nepal expedition team of which Munawar was a part, told Dawn.com that Saad Munawar and eight other foreign climbers successfully climbed Everest from the north side on Saturday morning.\n\n“Saad recently began climbing high-altitude mountains and has already conquered Aconcagua, Elbrus, Kilimanjaro, and Lobuche Peak in Nepal,” he added.\n\nKarrar Haidri, Secretary of the Alpine Club of Pakistan, also congratulated Munawar in a statement.\n\n“We are immensely proud to share that Saad Bin Munawar has made history as the first and only Pakistani to summit Mount Everest (8,848.86 meters) via the challenging North Side route — a feat that places him among the world’s elite mountaineers,” the statement read.\n\nThe club’s statement added that Munawar is a “renowned adventurer, mountaineer, and author [and] has long been a source of inspiration in Pakistan’s adventure community”.\n\n“Before this Everest ascent, he was the first Pakistani to summit Mt Aconcagua, the highest peak outside Asia,” the statement added. “His leadership in expeditions and mountaineering literature continues to motivate a new generation of climbers.”\n\nIn their statement, Imagine Nepal also congratulated the other climbers, including three women, for reaching the summit from the north side.\n\n“Dr Simone Molter from Germany conquered her first 8000m peak, fulfilling her dream after years of preparation and determination,” Imagine Nepal wrote.\n\n“Angela Yeung from South Africa stood on the world’s highest peak for a greater cause — “raising awareness and funds for survivors of gender-based violence through her Impilo Collection Foundation,” it added.\n\n“Chhiri Aangjum Sherpa from Nepal, completed her 4th continental summit, inspiring women everywhere with her strength, unity, and vision,” the statement continued. “These women are more than climbers — they are leaders, activists, and role models proving that no peak is too high when driven by purpose.”\n\nThe other climbers included Justin Moore Walker from the United States, Dawa Gyalje Sherpa, Ang Mingma Sherpa, Sonam Tashi Sherpa, Ngima Dorjee Sherpa, Lakpa Tenzing Sherpa, Dawa Kami Sherpa and Thupten Topchen Sherpa.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/242301114a4e33d.png",
  "retrievedAt": "2025-08-23T14:25:29.091Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913090/saad-munawar-becomes-first-pakistani-to-summit-mt-everest-from-north-side",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T18:13:40.000Z"
}
