{
  "title": "Anti-polio campaign to vaccinate over 10m children in Sindh starts on May 26 - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Sindh government on Saturday announced that it is launching a five-day polio vaccination campaign in the province from May 26 to inoculate over 10 million children in the province.\n\nEarlier this week, two new cases of polio were reported in Khyber Pakhtunkhwa’s Lakki Marwat and Bannu districts, taking the tally for the current year to 10.\n\nAccording to a press release, the campaign aims to immunise more than 10.6m children under the age of five across all 30 districts of Sindh.\n\n“The campaign is taking place from May 26 to June 1, 2025, and involves the efforts of over 80,000 trained polio workers going door-to-door with support from 25,539 law enforcement personnel to ensure that no child is missed,” the statement said. “Children between the ages of 6 and 59 months will also receive Vitamin A supplements to help boost their immunity.”\n\nAccording to the press release, this new campaign follows two previous drives in February and April. Earlier this week, Sindh Chief Minister Murad Ali Shah raised the issue of rising polio cases and expressed the need for accountability and collective action.\n\n“With continued virus circulation in some environmental samples and four polio cases reported in Sindh so far this year, this latest round of vaccinations reinforces the province’s resolve to interrupt transmission and protect children from the lifelong consequences of this preventable disease,” the press release read.\n\n“Polio anywhere is a threat to children everywhere,” it added, quoting a spokesperson from the Emergency Operations Centre (EOC) Sindh. “This campaign reflects our commitment to reach every child, even in the hardest-to-reach communities, and to ensure that Pakistan moves closer to eradication.”\n\nAccording to the EOC, polio teams will be active in 1,292 union councils, supported by district administrations and healthcare partners, delivering polio drops and engaging families at the doorstep.\n\n“EOC Sindh appeals to parents, teachers, religious leaders, community elders, and the media to join hands in this vital national effort,” the press release added. “To report missed children or ask questions about the vaccine, citizens can call the 1166 helpline or WhatsApp 0346-777-6546.”\n\nPakistan, one of the only two polio-endemic countries in the world, reported 74 cases in 2024.\n\nEarlier today, the KP government set a target of vaccinating approximately 7.3 million children under the age of five during a five-day anti-polio campaign, which also begins on Monday.\n\nChief Secretary Shahab Ali Shah inaugurated the campaign during a ceremony at Services Hospital, according to a press release.\n\nAdditional Secretary Health and Emergency Operations Centre coordinator Shafiullah Khan, representatives from Unicef and the World Health Organisation, and other officials were in attendance.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:25:29.469Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913074/anti-polio-campaign-to-vaccinate-over-10m-children-in-sindh-starts-on-may-26",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T15:38:41.000Z"
}
