{
  "title": "Stocks drift lower on budget-related concerns - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) continued its downward trend due to growing concerns about proposed tax measures in the upcoming federal budget, which is set to be unveiled on June 10 instead of June 2.\n\nTopline Securities Ltd said a range-bound session was observed at the exchange as the index traded between its intraday high of 389 points and low of 488 points with low volumes to finally close at 119,102.67, down 50.37 points or 0.04 per cent day-on-day.\n\nThe top positive contribution to the index came from Engro Holdings, Attock Refinery, Packages Ltd, Meezan Bank, and Pakistan Services Ltd, as they cumulatively added 280 points. Conversely, Fauji Fertiliser, MCB Bank, Systems Ltd, Mari Energies, Pakistan Petroleum, Habib Bank, Hub Power, and Engro Fertiliser, wiped out 257 points.\n\nAhsan Mehanti of Arif Habib Corporation said the market closed lower amid pre-budget uncertainty and concerns about weak exports.\n\nHe said mainly second- and third-tier scrips were traded as investors kept to the sidelines owing to uncertainty over the IMF-driven federal budget, which was expected to be challenging for the industry, exporters, auto, oil, and fertiliser sectors.\n\nAli Najib, Head of Sales at Insight Securities, said the PSX remained bearish due to investor caution ahead of the upcoming federal budget, concerns over proposed tax measures and profit-taking activities.\n\nIn addition, he added that the anticipated usual selling pressure during roll-over (from May to June contracts) commencing next week could be a reason for sluggish trading.\n\nMarket participants continued selective portfolio realignment in anticipation of key fiscal measures and potential policy shifts.Market participation weakened sharply as the trading volume plunged 42.68pc to 388 million shares while the traded value dipped 39.92pc to Rs18.51bn.\n\nPublished in Dawn, May 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/683115c2acf35.gif",
  "retrievedAt": "2025-08-23T14:26:01.056Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913001/stocks-drift-lower-on-budget-related-concerns",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T00:42:10.000Z"
}
