{
  "title": "Pakistan gets over $16bn in rollovers, new loans - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Pakistan received $16.08 billion in foreign loans and grants in the first 10 months of 2024-25, compared to an annual target of $19.2bn by June 30.\n\nWhile half of this portfolio was legacy rollovers from China, Saudi Arabia and the United Arab Emirates, fresh loans and grant inflows amounted to $6.086bn in July-April, almost 15 per cent lower than the comparable period of last fiscal year.\n\nIn its monthly report on Foreign Economic Assistance (FEA) released on Friday, the Economic Affairs Division (EAD) said that against its annual target of $19.4bn, FEA in July-April amounted to $6.086bn compared to $7.142bn in the same period last year with an annual target of $17.6bn.\n\nThis does not include about $1bn disbursed by the IMF in October as an upfront payment under the $7bn ongoing Extended Fund Facility (EFF) that is accounted for separately by the State Bank of Pakistan (SBP). This also does not include the subsequent $1bn IMF inflow last week.\n\nWith three rollovers and fresh disbursements, the total external assistance in 10MFY25 amounted to $16.08bn. This included $3bn rollovers by Saudi Arabia, $2bn by the UAE, and $3bn by China. Pakistan has a total annual rollover portfolio of about $12.7bn in safe deposits and loans from these three countries, leaving the country’s net international reserves (NIR) at around $3.3bn.\n\nThe foreign economic assistance recorded by the EAD showed inflows fell by about 15pc to about $6.086bn in July-April, apparently because of delayed IMF bailout and subsequent $1bn disbursements. Last year, these inflows, including IMF, amounted to $8.2bn during 10MFY24.\n\nIn April, the EAD reported monthly inflows at $576 million, compared to $555m in March, $237m in February and $830m in January.\n\nThe EAD said that out of $6.086bn, about $3.45bn was received for budgetary support or programme loans and the remaining $2.6bn for project financing. During the same period last year, the EAD secured about $2.3bn as project aid and $4.8bn as programme loans.\n\nOf the total, inflows from multilaterals stood at $2.98bn in 10MFY25 compared to $2.86bn last year, while bilateral disbursements stood at $372m against $878m last year, down 58pc.\n\nThe EAD reported receiving about $706m in loans from foreign commercial lenders (UAE-based) in 10MFY25, showing a minor recovery from commercial banks that had stayed away from financing Pakistan last year. It may be noted that the government has budgeted $3.8bn in financing from foreign commercial banks for the current year, showing a poor outcome, again due to the delayed IMF umbrella and economic conditions.\n\nThe government has also targeted $1bn in international bonds for the current year. A projection for $9bn inflow from China and Saudi Arabia was targeted for FY25. These projections include a $5bn time deposit from Saudi Arabia and $4bn China’s SAFE deposit. These projections are critical for Pakistan to meet its external financing gap as part of the IMF programme.\n\nIn addition, Pakistan also received $1.61bn from overseas Pakistanis through Naya Pakistan Certificates compared to $8861m in the same period last year. The Asian Development Bank disbursed $1.253bn in 10MFY25 compared to $708m a year ago, and $1.07bn was received from the World Bank.\n\nPublished in Dawn, May 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:14:13.780Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912993/pakistan-gets-over-16bn-in-rollovers-new-loans",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T00:42:11.000Z"
}
