{
  "title": "IMF says will continue budget discussions in ‘coming days’ as mission wraps up visit - Business - DAWN.COM",
  "author": null,
  "content": "The International Monetary Fund (IMF) on Saturday said it would continue discussions over the next fiscal year’s federal budget in the upcoming days as its mission concluded.\n\nPakistan and the Fund had opened high-level policy talks in Islamabad on May 19 to discuss the FY2025-26 budget. As deliberations with the IMF remained inconclusive, the government has postponed the budget announcement till June 10.\n\nIn a statement issued today, the IMF’s Pakistan mission chief Nathan Porter termed the recent discussions “constructive” and said: “We will continue discussions towards agreeing over the authorities’ FY26 budget over the coming days.”\n\n“Discussions focused on actions to enhance revenue — including by bolstering compliance and expanding the tax base — and prioritise expenditure,” Porter added.\n\n“We held constructive discussions with the authorities on their FY2026 budget proposals and broader economic policy, and reform agenda supported by the 2024 Extended Fund Facility (EFF) and the 2025 Resilience and Sustainability Facility (RSF),” Porter said, referring to the $7 billion loan programme and the climate fund deal, respectively.\n\n“The authorities reaffirmed their commitment to fiscal consolidation while safeguarding social and priority expenditures, aiming for a primary surplus of 1.6 per cent of GDP in FY2026,” the IMF official added.\n\nThe Fund noted that the staff visit “focused on recent economic developments, programme implementation, and the budget strategy” for FY2025-26.\n\nShedding light on other matters reviewed, Porter said: “Discussions also covered ongoing energy sector reforms aimed at improving financial viability and reducing the high-cost structure of Pakistan’s power sector as well as other structural reforms which will help foster sustainable growth and promote a more level playing field for business and investment.”\n\nThe government emphasised its commitment to “ensuring sound macroeconomic policy making and building buffers”, according to the statement.\n\n“In this context, maintaining an appropriately tight and data-dependent monetary policy remains a priority to ensure inflation is anchored within the central bank’s medium-term target range of 5–7 per cent,” Porter stressed.\n\n“At the same time, rebuilding foreign exchange (FX) reserve buffers, preserving a fully functioning FX market, and allowing for greater exchange rate flexibility are critical to strengthening resilience to external shocks.”\n\nThe IMF mission appreciated the federal and provincial authorities for their “hospitality, constructive discussions, and strong collaboration and commitment to sound policies”.\n\nAffirming that it will continue its close dialogue with the authorities, the IMF said its next mission associated with the next EFF and RSF reviews was expected in the second half of 2025.\n\nAs the federal government gears up for the budget, incarcerated ex-prime minister Imran Khan, whose PTI rules Khyber Pakhtunkhwa, has called on Finance Minister Muhammad Aurangzeb to meet him before the budget announcment.\n\nA post on Imran’s X account quoted Imran’s purported conversation with lawyers at Rawalpindi’s Adiala Jail, where he is imprisoned. The former premier doesn’t have access to his X account and someone else posts on his behalf, but the PTI has never revealed the identity of the social media handler.\n\nThe post read: “As party chairman, it is necessary for the government of Khyber Pakhtunkhwa to seek my guidance on budgetary and policy matters.\n\n“The people have elected PTI to govern, and therefore, the responsibility for policymaking also rests with us. Consequently, it is essential that [KP Chief Minister] Ali Amin Gandapur and the finance minister meet with me before the budget is presented,” it added.\n\nIn his post, Imran again stressed the importance of national unity. “The economy is in shambles; investors and the youth are steadily leaving the country,” he claimed, stating it as one of his reasons to call for a dialogue.\n\nThe KP government has called upon its federal counterpart to immediately convene a meeting of the National Finance Commission (NFC) and ensure the transfer of the constitutional share of funds allocated for the merged districts to the provincial government before the budget announcement.\n\nDuring the staff visit, the IMF mission had multiple rounds of discussion yesterday, including a wrap-up session with Aurangzeb, informed sources said.\n\nAn IMF delegation led by the director of the Middle East and Central Asia Department, Jihad Azour, met with Prime Minister Shehbaz Sharif on Thursday and with President Asif Ali Zardari the next day.\n\nThe defence allocations for next year had a reasonable budgetary impact, which could not be settled with the IMF staff before the meeting with Aurangzeb, although discussions between the Federal Board of Revenue’s top brass and the staff mission continued until evening.\n\nSources said the engagements with the IMF would now continue virtually over the next week till finalisation of the defence budget, and as a result, the revenue side of the equation and other estimates under the budget, including the federal public sector development programme that was now estimated at Rs1tr.\n\nSources said there is no plan to increase the rate of petroleum levy in the near future, except for a separate imposition of carbon levy on a number of items, starting with about Rs3 per litre and going up to Rs5 in the second year to meet a requirement of the RSF.\n\nThe sources said the relief measures for the salaried class, real estate, and expenditure control measures had been discussed with the IMF staff, but this would remain subject to an alternative resource envelope to be presented by the authorities, as fiscal consolidation would remain one of the central themes of the next year’s budget.\n\nThe budget announcement would be immediately followed by a comprehensive debate in the house and enable standing committees on finance to read through budget proposals and give their input before its passage by the two houses, well before June 30.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:15:04.592Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913028/imf-says-will-continue-budget-discussions-in-coming-days-as-mission-wraps-up-visit",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T04:20:01.000Z"
}
