{
  "title": "Provincial power dues swell to Rs161bn - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Power Division has sought recoveries of outstanding electricity bills against provincial governments estimated at Rs161 billion.\n\nPower Minister Sardar Awais Leghari on Friday told a meeting of the Senate Standing Committee on Power that the Council of Common Interests (CII) had approved at source deduction of 25pc of pending provincial bills and recovery of remaining arrears on reconciliation of bills. He said the Power Division had taken up the issue with the Ministry of Finance for recoveries.\n\nThe meeting of the standing committee was presided over by Senator Mohsin Aziz. A Power Division official told the meeting that total outstanding receivables from the provinces amounted to Rs161bn as of March 31, 2025. This included Rs10bn against Khyber Pakhtunkhwa, Rs42bn each against Punjab and Balochistan and Rs67bn against Sindh.\n\nThe meeting was told that these arrears had developed over the past three years as the provinces were reluctant to reconciliation bills. The panel chairman expressed strong displeasure over the negligence displayed at the provincial level and directed immediate recovery of the outstanding dues.\n\nSindh owes Rs67bn, Punjab and Balochistan Rs42bn each and KP Rs10bn\n\nThe meeting was told that the matter regarding the mechanism for at-source deduction of outstanding power sector payables of provinces was settled by the CII in February 2014 when it was unanimously decided that the Ministry for Water and Power would hold meetings with all the provinces for reconciliation and settlement of backlog and to discuss the principles and decide upon the mechanism for at source deduction of outstanding power sector payables of provinces.\n\nAs a consequence, a meeting on Aug 7, 2014, in the Ministry of Finance represented by all stakeholders, finalised the SOPs of 25pc at-source deductions from provinces under a template proforma regarding claims and verifications, and at-source deductions were started from July 1, 2014.\n\nResponding to a question, Mr Leghari said the government has decided to privatise three power distribution companies (Discos) — Islamabad Electric Supply Company (Iesco), Faisalabad Electric Supply Company (Fesco), and Gujranwala Electric Power Company (Gepco). In the second phase, Lesco, Mepco, and Hesco will also be privatised. He said Guddu and Nandipur power plants would also be privatised.\n\nThe committee expressed serious concern regarding employees’ future and instructed the ministry to develop worker-friendly policies, including voluntary early retirement options, to safeguard their interests.\n\nThe committee was told that investor engagement, roadshows, and restructuring processes regarding privatisation of power distribution companies were currently underway and were expected to be completed by January 2026.\n\nThe committee also discussed the high unit cost of electricity during peak hours. The minister explained that to meet nighttime demand, power generation companies must operate Residual Fuel Oil (RFO) plants, which were costly. These costs were then passed on to consumers. The chairman strongly criticized this practice and urged a transition to more efficient plants to reduce the burden on the public.\n\nThe meeting was told that the installation of 800,000 AMI (Advanced Metering Infrastructure) meters in Islamabad, Rawalpindi, and Taxila had been completed, which led to a 2pc reduction in line losses.\n\nPublished in Dawn, May 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:15:03.779Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912994/provincial-power-dues-swell-to-rs161bn",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T00:42:11.000Z"
}
