{
  "title": "Bangladesh student leader fears uprising gains at risk - World - DAWN.COM",
  "author": null,
  "content": "A key Bangladeshi party leader at the forefront of the revolt that ousted premier Sheikh Hasina warned on Saturday that an army-backed leadership could replace the interim government.\n\nNahid Islam, leader of the National Citizen Party (NCP), made up of many students who spearheaded the uprising that ended Hasina’s 15-year iron-fisted rule last year, said he worried about an “anti-democratic” future.\n\nMuhammad Yunus, the 84-year-old Nobel Peace Prize winner leading the caretaker government until elections are held, has called for rival political parties jostling for power to give him their full support.\n\nBangladesh has a long history of coups, and the army retains a powerful role.\n\nIslam, an ally of Yunus who previously served in his cabinet, told reporters on Saturday that he foresaw a situation similar to January 11, 2007, when a state of emergency was declared, resulting in a two-year-long military-backed government.\n\n“There are indications that a 1/11-style military-backed government could re-emerge — one that is anti-democratic and anti-people,” Islam said.\n\nBangladesh’s political crisis escalated this week as rival parties protested with competing demands.\n\nArmy chief General Wakeruz Zaman said this week that elections should be held by December, Dhaka’s newspapers reported, aligning with the demands of the powerful Bangladesh Nationalist Party (BNP).\n\nBut Islam said that the military’s role was “to ensure national security” and not to get involved in politics.\n\n“While the military is an essential institution for state security, it should not interfere in political affairs,” he said.\n\nYunus has said elections could come as early as December, but holding them later, at the latest by June 2026, would allow more time for the democratic reforms he says are needed.\n\nIslam said it was for those reforms that students launched their protests last year, but that Yunus told him during a meeting on Thursday that the pressure put on him had frustrated him.\n\n“He assumed office to bring about fundamental change. People expect to see trials, reforms, and a peaceful transition of power. Under the current circumstances, he feels he cannot deliver to those expectations,” Islam said.\n\n“There is a real fear that elections may not be free and fair but instead heavily restricted.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/241806181723770.jpg",
  "retrievedAt": "2025-08-23T14:25:29.100Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1913066/bangladesh-student-leader-fears-uprising-gains-at-risk",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T13:32:29.000Z"
}
