{
  "title": "Indian plots against Balochistan will never succeed: Tarar - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Minister visits Khuzdar bombing victims, their families\n• Says nation united, armed forces ready to tackle terrorism\n\nQUETTA: Federal Minister for Infor­mation and Broadcasting Attaullah Tarar has said that India wants to destabilise Balochistan through its proxies but its nefarious designs will never succeed.\n\nTalking to reporters after visiting the students injured in the Khuzdar bomb attack and meeting their families on Friday, the minister said that the children had made a great sacrifice in the heartbreaking incident.\n\n“No one can defeat the morale of the Pakistani nation,” he declared, referring to the high spirits of those affected by the incident.\n\nHe especially mentioned Subedar Saleem, who buried his two daughters, whereas his son was seriously injured in the school bus blast.\n\n“Despite the martyrdom and injuries of his children, Subedar Saleem continued to chant slogans in favour of Pakistan in front of the ambulance,” he remarked.\n\nMr Tarar also stated that four children of a person had suffered serious injuries but his morale was high as he said that his family was ready to give more sacrifices for the motherland.\n\nToday, Mr Tarar said, national and international media was brought to Khuzdar to inform them about the situation in the area.\n\nHe lamented that India had attacked a soft target after its humiliating defeat in the recent confrontation with Pakistan.\n\n“Kulbhushan Jadhav’s arrest from Balochistan is a clear manifestation of India’s involvement in terrorism. Militants Gulzar Imam Shambe and Sarfaraz Bangulzai have confessed to Indian patronage,” he pointed out.\n\nEven during Operation Marka-i-Haq, 33 attacks took place in Balochistan which were foiled by security agencies, he added.\n\nMr Tarar said that Prime Minister Shehbaz Sharif and Field Marshal Asim Munir were determined to uproot the scourge of terrorism and make Balochistan a cradle of peace. He recalled that the director general of Inter-Services Public Relations had presented evidence of India’s involvement in terrorist acts inside Pakistan.\n\nHe said the Pakistani nation was united and its armed forces were prepared to deal with terrorism.\n\nHe expressed the determination that Fitna-i-Hind would be fully exposed and its conspiracies defeated.\n\nThe minister stated that the Modi government had obsession with events in Balochistan.\n\nAlluding to Jaffar Express incident, he said that Fitna-i-Hind terrorists were shown on Indian media. These terrorists provided video clips of the Jafar Express incident to the Indian media, adding that it was open proof of Delhi’s direct involvement in terrorist activities in Balochistan.\n\nHowever, he pointed out, India had to eat humble pie in the conventional war with six of their planes downed and a major loss inflicted on them during Pakistan’s counter-attack.\n\n“Our armed forces, Prime Minister Shehbaz Sharif, Field Marshal Asim Munir, Air Chief Zaheer Ahmed Babar, and Naval Chief Naveed Ashraf played an exemplary role in giving a befitting reply to Indian aggression,” Mr Tarar remarked.\n\nHe said that all political parties, politicians and national institutions would work together to restore peace in Balochistan.\n\nIn reply to a question, he said all steps would be taken and necessary legislation would be done to ensure punishment to terrorists at all costs.\n\nTaking a jibe at Indian Prime Minister Modi, he said the “butcher of Gujarat” had faced a huge defeat in the recent conflict. While victory was being celebrated in Pakistan on May 10, questions were being asked about the Modi government in India.\n\nHe said that Indian media, political parties and civil society were raising serious questions but the Modi regime had no answers.\n\nIndia carried out a cowardly attack in the dead of night, but Pakistan’s armed forces gave a befitting reply to that.\n\nHe pointed out that India, in its effort to divert attention from its humiliation, had resorted to hurling threats.\n\n“We will expose Indian terrorist activities at all costs,” he added.\n\nDiplomatic success\n\nAnswering another question, Mr Tarar said it was Pakistan’s huge diplomatic success that the Kashmir issue has once again been highlighted on the global stage.\n\nHe said the government would take all possible steps to solve the problems of Balochistan with consistency and continuity.\n\nDuring his meeting with the families of the martyrs and the injured children, the minister appreciated their determination and courage.\n\nHe said the martyrs and the injured children were pride of the nation and their sacrifices would always be remembered.\n\nPublished in Dawn, May 24th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/24105851fbe4a7e.png",
  "retrievedAt": "2025-10-12T03:14:41.988Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1912986/indian-plots-against-balochistan-will-never-succeed-tarar",
  "dateList": "2025-05-24",
  "date_published": "2025-05-24T00:42:04.000Z"
}
