{
  "title": "Sherry Rehman for promoting culture of cleanliness, health, environmental responsibility on Eid-ul-Azha",
  "link": "https://www.app.com.pk/national/sherry-rehman-for-promoting-culture-of-cleanliness-health-environmental-responsibility-on-eid-ul-azha/",
  "date_published": "2023-06-29T09:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP):Federal Minister for Climate Change Senator Sherry Rehman on Thursday urged the nation  to promote a culture of cleanliness, health and environmental responsibility on the auspicious occasion of Eid-ul-Azha.\nIn her message on Eid-ul-Azha, the federal minister felicitated the entire nation.\nSenator Rehman said, “Today, on this auspicious festival, I appeal to all of you to uphold the spirit of generosity, compassion, harmony and environmental responsibility.\nShe underlined that pre-monsoon rains were continuing across the country before Eid this year, due to heavy rains water was standing in many small and big cities.\n“Our drains and sewerage systems are already under pressure from the rains. Citizens are requested to perform Qurbani only in specific and allocated places, doing Qurbani in the streets will increase the pollution and affect the water drainage system,” Sherry Rehman said.\nShe requested the masses to not throw sacrificial animal hides and entrails in open spaces and streets.\nBy taking a little precaution, she said we can not only maintain the cleanliness of our surroundings but also prevent the spread of diseases.\n“Another request to people is to avoid using single-use plastic bags and bottles while sightseeing and recreation activities,” Sherry Rehman further said.\nOn behalf of all the people of the Pakistan Peoples Party, it was an appeal to the honorable people to share happiness and blessings among the people around them, she added.\n“The people are requested to take care of the poor and deserving in times of need. We pray to Allah Almighty that this Eid brings us closer together as a nation and strengthens our bonds of unity,” the Minister said.",
  "retrievedAt": "2025-08-11T08:49:23.738Z"
}
