{
  "title": "Sanjrani extends Eid greetings",
  "link": "https://www.app.com.pk/national/sanjrani-extends-eid-greetings-2/",
  "date_published": "2023-06-28T19:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 28 (APP):Acting President Muhammad Sadiq Sanjrani has extended his heartfelt greetings to the whole nation on the blessed and joyful occasion of Eid-ul-Azha.\nHe in a statement issued here, said Eid-ul-Azha was a wonderful symbol of obedience as on this day we commemorate together the acts of obedience and submission performed by Prophet Ibrahim (Peace Be Upon Him) when he was commanded by God, in a form of a dream vision, to sacrifice his son, Hazrat Ismail (Peace Be Upon Him), which established such an eternal tradition of obedience and sacrifice that continued to be followed till the end of time.\nThis spirit of sacrifice has a universal status. No nation in the world can progress unless it has the spirit of sacrifice, he said.\nThe Acting President said we have to work together for the development and prosperity of the country. We should keep all our interests, preferences and prejudices behind us. Now is the time to overcome all our political affiliations and adopt a common plan of action for the development and prosperity of the country. This country came into being as a result of endless sacrifices, tolerance and stability, he said.\nHe said we should also take special care of our brothers and sisters who have been left behind due to the oppression of the situation.\nWe should keep an eye around us so that none of our neighbours can miss out on the joys of this holy occasion. On this day, we must remember the creators, martyrs and protectors of the homeland who sacrificed their lives for the great cause of protection, development and uplifting of the beloved country.\nI pray to Allah Almighty to grant us the true happiness of Eid-ul-Azha and accept our sacrifice with honour and grant us the ability to perform this great act of worship by its spirit, he said.",
  "retrievedAt": "2025-08-11T08:49:31.626Z"
}
