{
  "title": "Faithful to celebrate Shab-e-Qadr (Night of Power ) tomorrow night",
  "link": "https://www.app.com.pk/national/faithful-to-celebrate-shab-e-qadr-night-of-power-tomorrow-night/",
  "date_published": "2021-05-08T11:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 08 (APP):Faithful will celebrate the Shab-e-Qadr or the Night of Power across the country (tomorrow) Sunday night amid strict vigilance by mosque administrations and following the corona SOPs to stem deadly virus spread.\nLaylat al-Qadr, which is according to the Holy Quran, better than one thousand months, signifies the night when the first verses of the Holy Quran were revealed to holy Prophet Hazrat Mohammad (Peace Be Upon Him).\nThe holiest night would be observed in accordance with physical distancing as a measure against the coronavirus (COVID-19) pandemic on the 27th night of holy fasting month of Ramzan. There will be no congregational prayers on the occasion of Shab-e-Qadr in various mosques of the federal capital due to threat of coronavirus pandemic.\nHowever, some faithful are planning to perform special prayers, nawafil, milad, zikr, Quran Khwani and religious discussion in mosques and their houses in line with the traditional practices seeking mercy and blessings of the Almighty by strictly adherence to COVID-19 Standard Operating Procedures (SOPs) to efficaciously counter the disease.\nThe exact date of Laylat al-Qadr is unspecified, but is believed to have occurred on one of the last 10 nights of Ramzan.\nHazrat Aisha,wife of Prophet Muhammad (Radiallah Anha) stated that Rasool Allah (peace be upon him) said, “Look for Lailat-ul-Qadr in the odd nights of the last ten days of Ramzan.”\n“We the Muslims believe that on this night the blessings and mercy of Allah Almighty are abundant,” Mufti Jehangir Abbasi, a religious scholar, who runs online Holy Quran teaching academy told APP.\nMuslims are bestowed with several holy nights from Rajab-ul-Murajab\nto Ramzan-ul-Mubarak including Shab-e-Miraj, Shab-e-Barat and Shab-e-Qadr are celebrated in less than three months period, he said.\nSo valuable is this Night of Qadr that the Quran devotes a special Surah to it, says that; “Indeed, We sent the Qur’an down during the Night of Power. And what can make you know what the Night of Power is? The Night of Power is better than a thousand months. The angels and the Spirit descend therein by permission of their Lord for every matter. Peace it is until the emergence of dawn.” (97:1-5).\nThe night of prayers is of great significance to Muslims and they spend a lot of time praying and they keep reading the Qur’an believing that Almighty will hear them from heaven and either forgive their sins or satisfy all their heart desires. They go to devotion with sincere hearts believing that everything that they pray will come to pass.\nAccording to Islamic tradition, the prophet used to retreat for a month every year to the cave of Hira, which was located in a mountain outside of the city of Mecca.\nIt is believed that Angel Gabriel visited the prophet at the cave one night and inspired him to recite the first verses of the Quran to be revealed to him.\nAfter that night, the prophet is believed to have continued to receive revelations of the Quran over a 23-year period.\nDevotees visit graveyards to seek eternal blessings for the departed souls of their near and dear ones on this occasion.\nNewspapers publish special articles while state-run PTV and private television channels telecast special programs highlighting the significance of Lailat ul Qadr.",
  "retrievedAt": "2025-08-11T20:42:37.644Z"
}
