{
  "title": "Pakistan, Saudi Arabia agree on diversifying bilateral ties, impart strategic direction",
  "link": "https://www.app.com.pk/national/pakistan-saudi-arabia-agree-on-coordination-council-enhance-energy-media-cooperation/",
  "date_published": "2021-05-07T21:32:00.000Z",
  "source": "APP",
  "content": "JEDDAH, May 7 (APP): Pakistan and Saudi Arabia agreed to give a strategic direction to their bilateral relations through a Saudi-Pakistan Supreme Coordination Council and diversify the existing bilateral political, economic, trade, defence and security ties.\nThe bilateral ties were discussed in the meeting between Saudi Crown Prince Mohammed bin Salman and Prime Minister Imran Khan who arrive here Friday on three-day official visit to the Kingdom, according to a PM Office statement.\nFollowing the meeting, both the leaders signed an agreement on Establishment of the Saudi-Pakistan Supreme Coordination Council (SPSCC) what Imran Khan hoped would play a catalytic role in fostering enhanced bilateral cooperation in all fields.\nThe Council, co-chaired by the Prime Minister and the Crown Prince, is designed to impart strategic direction to the development of Pakistan-Saudi relations.\nDuring the meeting, the two leaders agreed to further strengthen, deepen and diversify the existing bilateral political, economic, trade, defence and security ties.\nSpecial emphasis was laid on increasing Saudi investments in Pakistan, collaboration in the field of energy, and increased job opportunities for Pakistanis in Saudi Arabia.\nBoth the sides also held wide-ranging talks on bilateral, regional and international issues marked by “exceptional cordiality and a commitment to fortify the upward trajectory in the bilateral relationship.”\nThe Prime Minister conveyed sincere regards to the Custodian of the Two Holy Mosques King Salman bin Abdulaziz, and thanked the Crown Prince for his invitation to him to visit the Kingdom. He also expressed gratitude for affording him the opportunity to visit the two Holy Mosques during the special days of Ramazan.\nThe two leaders reaffirmed the strong and historic bonds between the two countries rooted firmly in shared beliefs, common values, mutual trust and longstanding tradition of mutual support.\nThe prime minister reiterated Pakistan’s abiding support for the sovereignty and territorial integrity of the Kingdom, and expressed special reverence accorded to the Land of the Two Holy Mosques by the people of Pakistan.\nThe prime minister appreciated the Crown Prince’s recently launched “Green Saudi Arabia and Green Middle East” initiatives. He hoped to build upon the synergies between the vision of the Crown Prince and his own environment-related initiatives including the “10 Billion Trees Tsunami”.\nTo that end, we welcome an agreement to establish the Saudi-Pakistan Supreme Coordination Council, co-chaired by our PM and the Crown Prince, focussing on 3 key pillars: political/security, economic and cultural/social; this new structure will allow for greater collaboration. https://t.co/cXm5lJ8bK3\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 7, 2021\nAcknowledging the positive and constructive role of more than two million Pakistani Diaspora in the Kingdom, the two leaders discussed ways to maximize mutual benefit from cooperation in the human resource sector.\nThe prime minister thanked the Saudi leadership for taking considerate measures for the welfare of Pakistani expatriates during the COVID-19 pandemic.\nExchanging views on regional and international issues, the prime minister outlined his vision of a peaceful neighborhood to advance the objectives of national economic development.\n#عاجل\nتوقيع اتفاقية للتعاون في مجال مكافحة الجريمة.#رئيس_وزراء_باكستان_في_السعودية#واس pic.twitter.com/jePJdgoBR6\n— واس الأخبار الملكية (@spagov) May 7, 2021\nHighlighting the situation in IIOJK, Imran Khan stressed the importance of peaceful resolution of the Jammu and Kashmir dispute. He also highlighted Pakistan’s consistent efforts to support peace and reconciliation in Afghanistan.\nThe prime minister lauded the Crown Prince for the Kingdom’s efforts and initiatives aimed at reinforcing and further promoting regional peace and security.\nThe two leaders also witnessed signing of a number of bilateral agreements/Memoranda of Understanding (MoU), including Agreement on Cooperation in the Field of Combating Crimes; Agreement on Transfer of Convicted Individuals (Prisoners); MoU on Combating Illicit Traffic in Narcotic Drugs; Psychotropic Substances and Precursor Chemicals; and Framework MoU for financing of projects (totaling up to USD 500 million) in energy, hydropower generation, infrastructure, transport and communication and water resource development.\nThe prime minister extended an invitation to the Crown Prince to visit Pakistan at the earliest convenience.\nThe Crown Prince also hosted a dinner reception for Prime Minister Imran Khan and his delegation.\nThe prime minister, along with a high-level delegation, is visiting Saudi Arabia, at the invitation of the Crown Prince. He is accompanied by Foreign Minister Shah Mahmood Qureshi, Interior Minister Sheikh Rashid Ahmed and Senator Faisal Javed. Chief of Army Staff General Qamar Javed Bajwa is already in Saudi Arabia and participated in the delegation-level talks.",
  "retrievedAt": "2025-08-11T20:42:48.852Z"
}
