{
  "title": "Pak, Saudi FMs meet; discuss ways for fresh impetus to existing ties",
  "link": "https://www.app.com.pk/national/pak-saudi-fms-meet-discuss-ways-for-fresh-impetus-to-existing-ties/",
  "date_published": "2021-05-08T07:50:00.000Z",
  "source": "APP",
  "content": "JEDDAH, May 8 (APP): Foreign Minister Shah Mahmood Qureshi met his Saudi counterpart Prince Faisal bin Farhan and reviewed the entire gamut of bilateral relations, discussing ways to enhance cooperation in diverse areas.\nForeign Minister Qureshi is currently accompanying Prime Minister Imran Khan during his three-day visit to Saudi Arabia, at the invitation of Saudi Crown Prince Mohammed bin Salman.\nDuring the meeting held late Friday, Pakistan and Saudi FMs reaffirmed their mutual desire to further strengthen cordial relations between the two countries.\nFM @SMQureshiPTI held a meeting with  FM His Highness @FaisalbinFarhan.  FMs reaffirmed their mutual desire to further strengthen cordial relations between the two countries.\n#PakFMinKSA #AkhuwahPakSaudi pic.twitter.com/QZMTp151iu\n— Spokesperson  MoFA (@ForeignOfficePk) May 7, 2021\nBoth the foreign ministers reviewed the entire gamut of bilateral relations, discussing ways to enhance cooperation in diverse areas. They also discussed ways to provide fresh impetus to existing ties.\nThe two foreign ministers welcomed signing of Agreement on Establishing Pakistan Saudi Arabia Supreme Coordination Council co-chaired by the Prime Minister and Saudi Crown Prince.\nThey also exchanged views on regional and global issues of mutual interest. Qureshi briefed Prince Faisal bin Farhan on grave human rights situation in Indian Illegally Occupied Jammu and Kashmir and Pakistan’s consistent efforts to support ongoing peace and reconciliation process in Afghanistan.\nTo that end, we welcome an agreement to establish the Saudi-Pakistan Supreme Coordination Council, co-chaired by our PM and the Crown Prince, focussing on 3 key pillars: political/security, economic and cultural/social; this new structure will allow for greater collaboration. https://t.co/cXm5lJ8bK3\n— Shah Mahmood Qureshi (@SMQureshiPTI) May 7, 2021\nLater, in a tweet, Foreign Minister said, “Great to meet FM Faisal bin Farhan discussing enhanced cooperation across trade, investment, infrastructure, energy, tourism and manpower and finding new ways to strengthen our historic relationship.”\nWelcoming the agreement for establishing the Saudi-Pakistan Supreme Coordination Council, he said it would focus on three key pillars of political/security, economic and cultural/social cooperation.",
  "retrievedAt": "2025-08-11T20:42:43.850Z"
}
