{
  "title": "High time for int’l community to take tangible steps on climate change: FO",
  "link": "https://www.app.com.pk/national/high-time-for-intl-community-to-take-tangible-steps-on-climate-change-fo/",
  "date_published": "2021-06-06T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, June 6 (APP): Pakistan has urged the international community to raise ambition and translate political commitments on combating climate change and environmental degradation into tangible actions on ground.\n“Going forward, we reaffirm our commitment to playing our due role in combating climate crisis, protecting biological diversity, and ecosystem restoration,” Foreign Office spokesperson said in a press release on Sunday.\nPakistan has joined the international community in celebrating the “World Environment Day 2021”, as its global host, on June 5.\nFor last four decades, the spokesperson said, the world had been observing this day as the largest global platform for raising public awareness about the pressing environmental challenges.\n“As one of top ten most climate vulnerable countries, Pakistan highly values the global efforts to combat climate change, halt and reverse biodiversity loss, eliminate pollution, and restore ecosystems,” it was added.\nHowever, the spokesperson said, for developing countries like Pakistan, this would not be possible without provision of sufficient support by developed country partners in the form of means of implementation: green finance, technology transfer, and capacity building.\nThe observance of World Environment Day 2021 on the theme of “ecosystem restoration” was fully aligned with Prime Minister Imran Khan’s green vision, as manifested in Pakistan’s flagship “ecosystem restoration Initiative.”\nThis year’s World Environment Day carried special significance because it also witnessed the formal launch of “United Nations Decade on Ecosystem Restoration 2021-2030”.\nThe hosting of the day in Pakistan was an acknowledgment of the country’s swift transition towards a “clean and green” through a well-articulated climate change and environmental agenda consisting of a number of flagship green initiatives on the ground.\nPakistan was already in the midst of one of the world’s most ambitious efforts to expand and restore its forests, having already planted a billion trees as part of its 10 Billion Tree Tsunami Project.\n“In its quest for a green future, Pakistan has already set policies in motion to make by 2030, 60% of our energy mix, clean and green and shift 30% of road transport to electric vehicles,” the spokesperson further said.",
  "retrievedAt": "2025-08-11T20:49:06.516Z"
}
