{
  "title": "Problems of textile industry to be solved in consultation with industrialists, traders: Farrukh Habib",
  "link": "https://www.app.com.pk/national/problems-of-textile-industry-to-be-solved-in-consultation-with-industrialists-traders-farrukh-habib/",
  "date_published": "2021-06-06T17:12:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jun 06 (APP):Problems of textile industry will be solved in consultation with industrialists and traders, said State Minister for Information & Broadcasting Farrukh Habib.\nAddressing a reception hosted in his honor by former Chairman All Pakistan Cotton Power Looms Association (APCPLA) Chaudhary Javaid Sadiq Kahlon here on Sunday, he said that according to the vision of Prime Minister Imran Khan, the PTI government had not only dragged country out of the quagmire but also put it on way to progress and prosperity.\nHe said that in the past, Pakistani rulers used to rush for getting loans from IMF and other international institutions but today, these institutions were backing down and willing to give loan to Prime Minister Imran Khan but we will not take any new loan.\nHe said that Prime Minister Imran Khan was a visionary leader who wanted to promote industrial and economic activities in the country and due to his strenuous efforts, not only wheel of industries remained operational and but new machinery worth Rs.432 billion was also imported for industrial sector first time in history of Pakistan.\nHe said that PTI will present pro-people and business friendly budget for next fiscal year and no new tax would be added in it for greater national interest as well as to bring maximum forex in Pakistan.\nHe said that government had decided not to increase electricity and petrol prices though prices of these commodities witnessed increase in the international market.\nThe government intends to promote value added textile and sufficient funds would be earmarked in the upcoming budget for various public welfare projects including housing scheme, Insaf Sehat Card and Kamyab Jawan Programme.\nHe said that PML-N looted national wealth with great impunity and only 9 billion dollars were in the treasury when PTI came into power while in the first year alone we had to repay the installment on the loan of 10 billion dollars taken by the previous government.\nThe country was passing through crucial stage when PTI was mandated to power.\nHowever, due to visionary leadership of PM Imran Khan, the incumbent government gradually overcame the crisis and now all economic indicators were positive.\nWhen PTI came into power, the situation was very awkward. The industrialists were flying and shifting their industries to other countries. Various units of spinning mills were closed while power looms had become stock of junkyard. However, PTI government took some prudent decisions and provided business-friendly environment in Pakistan.\nThe PTI had formulated textile policy in consultation with textilers of Faisalabad and now this policy has started bringing fruits, he added.\nAPCPLA Chairman Rana Azhar Waqar, Senior Vice Chairman Chaudhary Jawwad Ikram Kahlon, Vice Chairman Muhammad Ajmal Kasuri, Chaudhary Basharat, President Faisalabad Chamber of Commerce & Industry (FCCI) Engineer Hafiz Ehtesham Javaid, Senior Vice President FCCI Chaudhary Tallat Mahmood, Chairman All Pakistan Sizing Industry Hajji Shakeel Ansari and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:49:06.601Z"
}
