{
  "title": "Govt hails Hague court’s award saying India must ‘let flow’ waters of western rivers for Pakistan’s ‘unrestricted use’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal government on Monday welcomed the decision by the Permanent Court of Arbitration (PCA) in The Hague to issue an “Award on Issues of General Interpretation of the Indus Waters Treaty (IWT)” in the Indus Waters case, stating that India must generally “let flow” the waters of the western rivers for Pakistan’s “unrestricted use”.\n\nIndia in April held the IWT in abeyance following the attack in occupied Kashmir’s Pahalgam that killed 26 — an incident New Delhi blamed on Islamabad without evidence. Pakistan termed any attempt to suspend its water share an “act of war”, noting the IWT had no provision for unilateral suspension. It later said it was considering court action, citing a violation of the 1969 Vienna Convention on the Law of Treaties.\n\nA supplemental award by the PCA in June held that India could not unilaterally hold the treaty in abeyance. India, in response, said it did not recognise the court or its decisions.\n\nA press release issued today by the PCA said it rendered an award on Friday in an arbitration initiated by Pakistan against India on August 19, 2016, pursuant to Article IX and Annexure G to the IWT.\n\n“This arbitration concerns the interpretation and application of the IWT to certain design elements of the run-of-river hydro-electric plants that India is permitted by the treaty to construct on the tributaries of the Indus, Jhelum and Chenab Rivers.”\n\nRegarding the overall approach to Article 3 (provisions regarding western rivers) of the IWT, the award said: “The general rule is that India shall ‘let flow’ the waters of the western rivers for Pakistan’s unrestricted use.\n\n“There are certain specified exceptions to this rule, including in relation to the generation of hydroelectric power, but these exceptions must be strictly construed: the design and operation of run-of-river hydroelectric plants must hew strictly to the requirements in the treaty, rather than to what India might consider an ‘ideal’ or ‘best practices’ approach.”\n\nIt further noted that questions relating to the balance between the parties’ respective rights and obligations in this regard were to be identified and addressed through the treaty’s procedures for notification, objection and dispute resolution in furtherance of the treaty’s objective and its obligations of mutual cooperation.\n\nThe PCA said that to date, India had not participated in the arbitration proceedings and had repeatedly objected to the court’s competence of the court, adding that it had addressed the issue on various counts before.\n\n“Throughout these proceedings, the court has ensured that India is fully informed in respect of the proceedings and that the opportunity to participate remains open to it. Notwithstanding this, the court has endeavoured to ascertain, understand, and consider India’s views, drawing on available materials, including the records of the commission, correspondence between the parties, and/or submissions by India in previous dispute resolution proceedings under the treaty,” the PCA said.\n\nIt added that it had also taken steps to test the accuracy of Pakistan’s claims, including by requesting further written submissions from Pakistan, by questioning Pakistan both before and during the hearing on the merits, by requesting that Pakistan produce historical evidence concerning the operation of the IWT and the Permanent Indus Commission, and by considering publicly available materials and jurisprudence not presented by Pakistan.\n\nThe PCA explained that the Aug 8 award addressed questions concerning the treaty’s overall interpretation and application, including in relation to Article 3 and Paragraph 8 of Annexure D (which concerns new run-of-river hydro-electric plants that India may construct on the western rivers).\n\n“The award also addresses a related question on the legal effect of decisions issued by dispute resolution bodies under the treaty (namely, courts of arbitration and neutral experts),” the PCA press release said.\n\n“The award is binding on the parties and without appeal,” the press release stated.\n\nA statement from the Foreign Office (FO) said Pakistan welcomed the award.\n\n“The award carries special significance in the wake of India’s recent announcement to hold the IWT in abeyance, and its earlier decision to boycott the proceedings of the Court of Arbitration. It is an endorsement of Pakistan’s historical stance on the afore-stated issues.\n\n“Pakistan remains committed to full implementation of the IWT. It also expects India to immediately resume the normal functioning of the treaty and faithfully implement the award announced by the Court of Arbitration.”\n\nAmong its 10 findings, the court said the awards of a court of arbitration were final, binding on the parties and had a controlling legal effect on subsequent neutral experts, subsequent courts of arbitration and the court that issued the award.\n\nFurther, it pointed out that to the extent that a court of arbitration and a neutral expert were operating at the same time on related matters, it was incumbent on both to pay attention to decisions of the other that had a binding or otherwise controlling effect.\n\nThe court said that the decisions of a neutral expert on matters within their competence were “final and binding” on the parties and any court of arbitration, in respect of the particular matter on which the decision was made.\n\n“Due to the vulnerability of Pakistan as the downstream riparian of a critical but shared nature resource, and the potential for serious conflict between India and Pakistan in this regard, the object and purpose of the treaty, as it relates to the western rivers, is to delimit the two states’ respective rights and obligations, in conjunction with mutual cooperation and effective dispute resolution procedures for whenever questions as to the interpretation and application of these rights and obligations arise,” the court reiterated about the treaty’s objectives and aims.\n\nThe award said Paragraphs 8(d), 8(e), and 8(f) of Annexure D, on low-level outlets, gated spillways, and intakes for the turbines respectively, contained specific directions about their existence, size and/or location (addressed below), which might depart from engineering best practices that sought to maximise efficiency or power output.\n\n“These limitations were of central significance in the treaty negotiations for addressing Pakistan’s concerns as to India’s ability to release virtually all the water in dam reservoirs, along with sediment, and to withhold a large volume of water when refilling the reservoirs,” the court said.\n\nOn maximum pondage, the award said that the pondage required for firm power was to be calculated based on the water accumulated over a seven-day period at the minimum mean discharge (a historically low flow rate), taking into account the daily and weekly downstream release requirements set out in Paragraph 15 of Annexure D and a “realistic, well-founded, and defensible projection of the plant’s installed capacity and anticipated load”.\n\nIt noted that maximum pondage should not be “more than twice this amount”.\n\nThe court further said that when designing a run-of-river plant, India was only entitled to freeboard the vertical distance in the dam wall from the full supply level to the top of the dam of a height necessary to address the safety of the dam as a whole from overtopping, with reference to internationally recognised standards.\n\n“For each of the components of dam design indicated above, the parties must cooperate from an early stage of planning by India for a new hydro-electric plant on the western rivers, such that India’s designs can be modified as necessary in light of valid concerns raised by Pakistan in relation to these components. Ultimately, India bears the burden of establishing that its designs are treaty-compliant,” the award’s findings concluded.\n\nHowever, the award clarified that the court did not address the application of its findings to the specific circumstances of the Kishenganga Hydro-Electric Plant or Ratle Hydro-Electric Plant — the two Indian projects presented in Pakistan’s arbitration request.\n\n“The court remains seized of issues raised in the request for arbitration and not yet decided, and will determine the next steps in the proceedings after seeking the views of the parties,” it said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/1120155251abc64.jpg",
  "retrievedAt": "2025-08-23T14:12:22.083Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930219/govt-hails-hague-courts-award-saying-india-must-let-flow-waters-of-western-rivers-for-pakistans-unrestricted-use",
  "dateList": "2025-05-13",
  "date_published": "2025-08-11T15:38:49.000Z"
}
