{
  "title": "Balochistan Assembly panel agrees on budget proposals - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan’s Parliamentary Committee rea­ched a broad consensus on Monday to align the prov­ince’s next fiscal budget and development programme with public needs, prioritising less privileged areas, education, healthcare, infrastructure and job creation.\n\nBalochistan Chief Minister Mir Sarfraz Bugti chaired the meeting on the budget and the Public Sector Development Programme (PSDP) at Chief Minister’s Secretariat in Quetta.\n\nParliamentary leaders and members from the Pakistan Peoples Party, PML-N, Awami National Party, Jamaat-i-Islami, and Balochistan Awami Party attended the session.\n\nParticipants praised Mr Bugti’s efforts to include all political parties in the budget process, calling it “a significant step towards strengthening democratic traditions.”\n\nLawmakers express satisfaction with transparent, inclusive budget planning\n\nChief Minister Bugti said the equal development of all districts remained the government’s top priority.\n\nHe added that “a budget formulated through consultation with all political stakeholders would not only reflect the aspirations of the people but also contribute to strengthening the province’s economy.”\n\nDetailed discussions were held on the budget framework and development initiatives.\n\nConcluding the meeting, the representatives expressed satisfaction with the “transparent and inclusive approach ado­pted for budget planning,” agreeing the budget would be a milestone for provincial development and welfare.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:02:59.823Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910709/balochistan-assembly-panel-agrees-on-budget-proposals",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:54:35.000Z"
}
