{
  "title": "Junaid Akbar submits resignation as PAC chairman to PTI - Pakistan - DAWN.COM",
  "author": null,
  "content": "PTI MNA Junaid Akbar on Tuesday said he had handed over his resignation as the chairman of the Public Accounts Committee (PAC) to the party.\n\nThe development came after it emerged that PTI founding chairman Imran Khan had directed Akbar to resign from the position and focus on provincial matters.\n\nIn a video statement issued today, Akbar confirmed that he had handed over his resignation to PTI Chairman Barrister Gohar Ali Khan, saying that he readily accepted the decision of the party and Imran.\n\n“Whatever the decision of the party and the decision of Imran Khan, I will not think for a moment and will readily accept it,” he said.\n\nAkbar said the position was a responsibility given by the party and he would accept any decision by the PTI founder, including handing over the party presidency or resignation from the assembly.\n\nPTI’s central information secretary Sheikh Waqas Akram, had confirmed to Dawn, that Akbar would step down as PAC chairman. He said Imran had conveyed the message through his sister Aleema Khan during their last meeting and announced that Akbar would be replaced by Omar Ayub Khan. He said Aleema conveyed the message to Salman Akram Raja after coming out of Adiala Jail.\n\nAkbar was elected unopposed as chairman of the PAC in January this year. In the same month, he was appointed by Imran as the president of PTI’s KP chapter, replacing Chief Minister Ali Amin Gandapur.\n\nThe position had been vacant since the February 2024 general elections, which brought the PML-N government to power. The PAC chairmanship is usually held by the leader of the opposition or their nominee, though there is no legal requirement for this parliamentary tradition.\n\nAfter the general elections, the PTI made several U-turns over nominating a candidate for the post of PAC chairman. Sher Afzal Marwat was initially nominated, followed by the names of Akram and Omar. Ultimately, Akbar’s name was finalised for the post.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/130922585deba1e.jpg?r=092352",
  "retrievedAt": "2025-08-23T14:11:21.640Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910779/junaid-akbar-submits-resignation-as-pac-chairman-to-pti",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T12:51:05.000Z"
}
