{
  "title": "Textile industry demands cheaper power - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pak­i­s­tan Textile Exporters Association (PTEA) has urged the government to rectify anomalies in the indu­strial electricity tariff, which will penalise large industries investing in high-voltage infrastructure.\n\nThe demand came from the association when the country’s textile exports have slowed down in the past few months owing to structural changes and the high cost of energy.\n\nIn a statement, PTEA Patron-in-Chief Khurram Mukhtar has called for immediate rectification of anomalies in the notified industrial electricity tariff, stating that the current structure discourages efficiency and penalises large industries investing in high-voltage infrastructure.\n\nMr Mukhtar highlighted that the National Electric Power Regulatory Auth­ority’s (Nepra) latest tariff imposes higher electricity rates on industrial consumers connected at 11kV (B3) and 132kV (B4) compared to those connected at the lower 400V (B2) level, contradicting international best practices and basic grid economics.\n\n“It defies logic that industries bearing the cost of their own high-voltage infrastructure — and relie­ving the national grid of transformation and distribution losses — are char­ged more than low-voltage users,” Mukhtar said.\n\nHe said that this has triggered a trend of industries artificially splitting their load into multiple low-voltage B2 connections, leading to higher system losses, grid inefficiencies, and revenue erosion for Discos.\n\nHe emphasised that globally, industries connected at higher voltages are incentivised through lower tariffs, typically 10-15pc cheaper than low-voltage users, in recognition of their lower burden on the utility’s infrastructure.\n\n“By contrast, our current tariff penalises efficiency and encourages regressive practices,” he added.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:11:53.407Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910681/textile-industry-demands-cheaper-power",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:33:22.000Z"
}
