{
  "title": "Govt repays $3.8 billion in third quarter - Business - DAWN.COM",
  "author": null,
  "content": "• SBP data shows $4bn interest paid on debt servicing in nine months\n• Overseas inflows ease pressure on growing trade deficit\n\nKARACHI: Pakistan paid over $3.8 billion in external debt servicing in the third quarter of the current fiscal year (FY25), including $1.263bn as interest, the State Bank reported on Monday.\n\nIn 2025, Pakistan’s external debt servicing amounted to $26bn and initially appeared to be a very difficult task; however, the government has come close to achieving the target.\n\nThe SBP data showed that Pakistan paid $2.134bn as principal during the first quarter (July-September FY25), while $1.343bn was paid as interest.\n\nThe State Bank reported that a total of $7.47bn was paid as principal during the first three quarters (July-March), while $3.99bn was paid as interest, bringing the total external debt servicing to $11.466bn.\n\nDuring the second quarter (October-December FY25), Pakistan paid the highest amount for external debt servicing, totaling $4.176bn, including $1.39bn as interest. In the third quarter (January-March FY25), Pakistan paid $3.813bn, including $1.263bn as interest.\n\nSBP Governor Jameel Ahmed recently said he was confident about rolling over $12.3bn while securing the necessary financial assurances. The financial sector believes that Pakistan has successfully managed to roll over its debts and will reach the external servicing target by the end of the fiscal year 2024-25.\n\nAt the same time, the State Bank is also expected to raise its foreign exchange reserves to $14bn. The central bank revised its target due to unexpectedly higher remittance inflows. It also raised the remittance target from $35bn to $38bn for FY25.\n\nIf remittances reach $38bn, this would be nearly $8bn, or 26pc, higher than the previous year’s inflow of $30.2bn.\n\nThe IMF’s recent approval of two major financing arrangements for Pakistan — a $1bn disbursement under the ongoing Extended Fund Facility and a new $1.4bn Resilience and Sustainability Facility aimed at supporting climate-related initiatives — is expected to further strengthen the State Bank’s reserves.\n\nThe government currently finds itself in a relatively comfortable position regarding the external account, as the current account recorded a surplus of $1.8bn during the first nine months of the current fiscal year.\n\nTrade deficit\n\nOther data, however, shows that imports have been increasing and the trade deficit is widening during the current year.\n\nBut higher inflows from overseas Pakistanis, along with support from the IMF and friendly countries such as China, Saudi Arabia and the UAE, have helped absorb the potential negative impacts.\n\nThe government had set ambitious targets for exports, aiming to push them to $60bn. However, a significant decline in agriculture and large-scale manufacturing prevented exports from even coming close to this goal.\n\nOver the first 10 months of the current fiscal year (July-April), exports totalled $26.86bn, reflecting a modest growth of 6.25pc from $25.28bn recorded during the same period last year. However, imports during this period rose to $48.21bn, up 7.77pc from $44.90bn.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:11:52.947Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910679/govt-repays-38-billion-in-third-quarter",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:33:22.000Z"
}
