{
  "title": "PM directs measures to broaden tax net, tech use to prevent evasion - Business - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Tuesday called for measures to broaden the tax net, directing the authorities to take strict action against individuals and sectors involved in tax evasion.\n\nThe Federal Board of Revenue (FBR) missed its collection target by nearly Rs831 billion in the first 10 months of the current fiscal year, mainly due to a decline in import volume and lower-than-expected inflation, which hit sales tax collections. The tax body collected Rs 2.299 trillion in July-April FY25 against the budgetary target of Rs 10.130tr. On monthly terms, it collected Rs846bn in April against the target of Rs963bn, which indicates a gap of Rs117bn.\n\nThe prime minister, chairing a review meeting on broadening the tax base and increasing tax revenue, said that the individuals and sectors capable of paying taxes must be brought into the tax net.\n\nHe also instructed the stringent accountability of officers and personnel assisting the tax evaders, according to a statement by the PM Office.\n\nThe meeting was informed that the tax revenue target equivalent to 10.6 per cent of GDP would be attained as a result of reforms in the FBR.\n\nThe prime minister lauded the efforts of the government’s economic team for swiftly heading towards achieving the FBR’s revenue targets for the current fiscal year. He said that expanding the tax net was the government’s priority to reduce the tax burden on the common man by lowering their tax rates.\n\nThe prime minister directed officials to complete the digital monitoring of cement and other sectors by next month. Besides, the efforts to increase tax revenue from the tobacco sector should be accelerated in collaboration with the provinces, PM Shehbaz said.\n\nHe directed that pending tax-related cases should be pursued effectively to ensure the recovery of the nation’s money. While calling for collective efforts for the country’s development, he said the national economy was stable and moving towards growth.\n\nThe participants were informed that the complete implementation of the Track and Trace System at cement plants nationwide led to a significant increase of billions of rupees in tax revenue. With the implementation of this system in the sugar industry, tax revenue increased by 35pc from November 2024 to April 2025.\n\nIt must be noted that the International Monetary Fund has revised the FBR revenue collection target for FY25, decreasing it to Rs12.333tr from Rs12.913tr, marking a reduction of Rs580bn. The shortfall is primarily attributed to reduced import tax collection, sluggish manufacturing growth and unexpectedly low inflation, which has dropped to the lowest single digits in decades.\n\nThe FBR paid Rs427bn in refunds to taxpayers in 10MFY25, up 1.18pc from Rs422bn in the same period last year. However, Rs43bn was refunded in April, almost the same amount as last year.\n\nIn July-April, income tax collection totalled Rs4.479tr, exceeding the target of Rs4.152tr by Rs327bn. The income tax collection grew 28pc compared to last year`s Rs3.505tr.\n\nThe sales tax collection fell short of the target by Rs774bn in 10MFY25, totalling Rs3.174tr against the target of Rs3.948tr. The sales tax collection rose 27pc compared to last year`s Rs2.498tr.\n\nThe customs collection also fell short of the projected target by Rs228bn to Rs1.043tr in 10MFY25 against the target of Rs1.271tr. The customs collection recorded a growth of 17pc when compared with last years Rs894bn. The Federal Excise Duty collection fell short of the target by Rs156bn to Rs603bn in 10MFY25. The excise duty recorded a growth of 33pc over last years Rs453bn.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/13191744c87979d.jpg",
  "retrievedAt": "2025-08-23T14:11:20.096Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910790/pm-directs-measures-to-broaden-tax-net-tech-use-to-prevent-evasion",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T15:43:28.000Z"
}
