{
  "title": "Another amendment? - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE dust from the 26th Amendment has yet to settle, but talk of a 27th one is already in the air.\n\nGiven the acrimony that surrounded the last attempt to tinker with the Constitution, one wonders if it will be any different this time. Much has changed since the last amendment was forced through the legislature.\n\nThe last time the Constitution was being amended, the government did not have the votes to get its bill passed. Lawmakers had to be roped in from the opposition benches to cobble together a two-thirds majority. Some came willingly, after cutting deals. Others had no choice. It did not matter. It was clear from the beginning that the law had to be passed.\n\nEven allied lawmakers did not have full knowledge of what they were voting for, and the law minister is said to have simply been handed a draft with clear instructions.\n\nTo be clear, there is nothing concrete that is known about the ‘27th Amendment’. For now, it seems merely to be a topic of discussion within the PML-N and its coterie of legal advisers. No proposal has been shared with the party’s allies, nor is there a draft that may be debated.\n\nStill, it has remained a topic of discussion ever since the government inherited a two-thirds majority courtesy of the Constitutional Bench that the 26th Amendment had helped set up. The two-thirds majority might be the main reason why the government does not seem too fussed. This time, there will not be a need to abduct, bribe or coerce opposition lawmakers.\n\nNor will any party not already allied to the regime be able to blackmail its way into receiving concessions, or to force the government to rethink its agenda. Indeed, the amendment will be seen through without any hiccups even if the regime were to decide that it must be passed tomorrow.\n\nIt is said that the government may be seeking more ‘fixes’ for the judiciary. The 26th Amendment apparently did not fix it enough.\n\nBut it would be deeply unfortunate if the amendment being debated is also focused heavily on a narrow agenda. Pakistan faces several deep-rooted issues that require urgent legislative intervention. These include matters like the possibility of a new province in south Punjab; the need to revisit the role and authority of caretaker governments; addressing the inability of the ECP in fulfilling its intended purpose; and the management of the growing burden of the NFC award, among many others.\n\nIf the government decides to take all stakeholders on board, especially the opposition, the new amendment could become an opportunity to build bridges where the 26th sowed divisions. Now virtually unchallengeable, the regime would benefit by showing some grace. With power comes responsibility, and it must start to demonstrate some.\n\nPublished in Dawn, August 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:03:08.250Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1930330/another-amendment",
  "dateList": "2025-05-13",
  "date_published": "2025-08-12T02:07:34.000Z"
}
