{
  "title": "First batch of white South Africans arrives in United States - World - DAWN.COM",
  "author": null,
  "content": "JOHANNESBURG: The Trump administration welcomed on Monday 59 white South Africans it has granted refugee status in the US for being deemed victims of racial discrimination, a move that has drawn criticism from Democrats and stirred confusion in South Africa.\n\nPresident Donald Trump has blocked mostly non-white refugee admissions from the rest of the world, but in February offered to resettle Afrikaners, the descendants of mostly Dutch settlers, saying they faced discrimination.\n\nAsked on Monday why white South Africans were being prioritised above the victims of famine and war elsewhere in Africa, Trump said, without providing evidence, that Afrikaners were being killed.\n\n“It’s a genocide that’s taking place,” Trump told reporters at the White House, going further than he has previously in echoing right-wing tropes about their alleged persecution.\n\n“I am not favouring Afrikaners because they are white,” Trump said, adding that their race “makes no difference to me”.\n\nSouth Africa maintains there is no evidence of persecution and that claims of a “white genocide” in the country have not been backed up by evidence.\n\nTreating white South Africans as refugees fleeing oppression has drawn alarm and ridicule from South African authorities, who say the Trump administration has waded into a domestic issue it does not understand.\n\nUS Deputy Secretary of State Christopher Landau greeted the first 59 Afrikaners to arrive in a hangar at Washington’s Dulles airport. He compared their journey to that of his own father, a Jew from Austria who fled Europe in the 1930s, first to South America and then to the United States.\n\nLandau did not repeat Trump’s claims of killings, but said many of the South Africans were farming families who had worked land for generations, but now faced the threat of that land being expropriated, as well as threats of violence.\n\n“When you have quality seeds, you can put them in foreign soil, and they will blossom,” he said. “We are excited to welcome you here to our country, where we think you will bloom.”\n\nTrump’s February order on resettling Afrikaners cited a land law introduced by South Africa this year that aims to make it easier for the state to expropriate land in the public interest, which has caused concern among some white South Africans, although no land has been seized.\n\nSome of the Afrikaners were heading to Democratic-leaning Minnesota, which has a reputation for welcoming refugees, while others planned to go to Republican-led states such as Idaho and Alabama.\n\nSenator Jeanne Shaheen, the most senior Democrat on the Senate Foreign Relations Committee, called the move “baffling”. “The decision by this administration to put one group at the front of the line is clearly politically motivated and an effort to rewrite history,” she said on Monday.\n\n‘Wrong end of the stick’?\n\nSpeaking at a conference in Ivory Coast, South African President Cyril Ramaphosa said the white Afrikaners had ostensibly left because they were opposed to policies aimed at addressing racial inequality persisting since apartheid, or white minority rule, which ended three decades ago.\n\n“We think that the American government has got the wrong end of the stick here, but we’ll continue talking to them,” he said.\n\nTrump said South Africa’s leadership was travelling to see him next week, and that he would not travel to a G20 meeting there in November unless the “situation is taken care of”.\n\nPeople interviewed in Cape Town said they bore no ill-will to their departing compatriots, but doubted they would find life much better in the US.\n\n“I don’t believe in running away from problems, you know, we’ve got a lovely country, and we make it work,” said Robert Skeen, a 47-year-old Afrikaner selling boerewors rolls, the South African equivalent of a hot dog.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/13100944eb8e0a3.jpg",
  "retrievedAt": "2025-10-12T03:02:25.381Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910690/first-batch-of-white-south-africans-arrives-in-united-states",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:33:36.000Z"
}
