{
  "title": "Shortage of books troubles students, teachers in KP - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Textbooks shortage has hit government schools in the Khyber Pakhtunkhwa province, leaving students and teachers to struggle with course management.\n\nStudents and teachers of the government high schools told Dawn that the new academic year began in the first week of April but they were still short of course books.\n\nDuring the last two decades, students received books from the provincial government free of charge at the start of scholastic year in April.\n\nTwo years ago, when the textbook costs reached over Rs10 billion, the government decided to deliver only half of the required books, directing the schools administration to collect old books from the students promoted to the next grades and fulfil the remaining book requirements.\n\nTextbook board claims it has printed all books requested by education dept\n\nThis year, a complex situation has emerged in schools as the textbook board claims that it has printed all the books requested by the education department but students and teachers have complained about a shortage of books.\n\nA teacher from a government high school in Peshawar cantonment area told Dawn that there was a shortage of certain books for sixth, seventh and eighth grades but the situation worsened for ninth and 10th graders as the majority of them were without books.\n\nHe said if there were over 40 students in grade 9, the government had provided just five new books of physics and 15 of biology, while the case with other books was no different.\n\n“We have collected old books from the promoted students but the majority of such books were in bad condition,” he said.\n\nThe teacher of another government high school in the city area said many students who sat the recent annual examination for grade 10 had not returned their books.\n\n“Now, they face a shortage of both new and old books,” he said.\n\nTeachers complained that the book shortage had compelled them to ask students to purchase books from the market where they’re available in abundance.\n\nWhen contacted, chairman of the Khyber Pakhtunkhwa Textbook Board Syed Mohammad Farrul Saqlain said the board had completed the printing of all books that were demanded by the elementary and secondary education department.\n\nHe said the board had handed over all printed books to the distribution centres established by the government in different parts of the province.\n\n“We print whatever is demanded by the education department. We published 34 million books on the demand of the education department for the current academic year,” he said.\n\nAn official of the education department insisted that the book crisis emerged as first, correct data of students wasn’t provided to authorities and second, most students didn’t submit their old books to the schools and even those, which were submitted, were in bad shape.\n\nA leader of the School Officers Association, a teachers association of high and higher secondary schools, demanded of the government to ensure the immediate delivery of free textbooks to students to prevent further learning loss.\n\nHe said teachers had asked students to share textbooks with each other in classrooms as a solution to shortages, but those without books struggled to manage homework.\n\n“The government should either provide new books to all students or abolish this policy of free books and ask parents to purchase books for their children from the market,” he said.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:11:38.258Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910614/shortage-of-books-troubles-students-teachers-in-kp",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:34:03.000Z"
}
