{
  "title": "Bulls dominate as PSX climbs over 1,000 points upon boost in investor sentiment - Business - DAWN.COM",
  "author": null,
  "content": "Bulls maintained a hold of the trading floor at the Pakistan Stock Exchange (PSX) on Tuesday as shares gained over 1,000 points, continuing their upward momentum following de-escalation between India and Pakistan.\n\nThe KSE-100 index opened with a gain of 2,769 points to stand at 120,067.12 points from the previous close of 117,297.73 at 9:30am. By 3pm, the index stood at 118,605.98 points, up 1.12 per cent.\n\nFinally, the index closed at 118,575.88 points, up 1.09pc or 1278.15 points compared to yesterday.\n\nA day earlier, the PSX gained a record 9pc, with the market mirroring the restored calm in the region after the Pakistan-India ceasefire. The development, announced by US President Donald Trump on Saturday, followed four days of tit-for-tat strikes between the nuclear-armed neighbours, as well as diplomacy and pressure from Washington.\n\nCommenting on today’s surge, Awais Ashraf, director of research at AKD Securities said: “Investor sentiment, initially lifted by the ceasefire, has been further boosted by Trump’s announcement to promote trade with both India and Pakistan.”\n\n“Energy stocks are gaining on expectations of a Rs1.5 trillion injection linked to the resolution of the circular debt. However, the market has yet to price in the potential impact of the International Monetary Fund tranche release and a policy rate cut to below 12pc,” he commented.\n\nYousuf M Farooq, research director at Chase Securities, also said that the market was factoring in improved macroeconomic indicators, lower interest rates and the potential reduction in super tax which would like boost corporate earning across the board.\n\n“With economic stability returning, the market’s price-to-earnings (PE) ratio is expected to gradually rerate to reflect these positive developments,” he added.\n\nSamiullah Tariq, head of research and development at Pak Kuwait Investment Company Ltd, also concurred that the market performed well in continuation of Monday.\n\n“Ceasefire, lower interest rate, IMF board approval, better corporate result expectations and a favourable budget expectation are driving market sentiment,” he said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/13153339d6c10ad.jpg",
  "retrievedAt": "2025-08-23T14:11:18.697Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910762/bulls-dominate-as-psx-climbs-over-1000-points-upon-boost-in-investor-sentiment",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T10:46:17.000Z"
}
