{
  "title": "10 years on, Safoora bus carnage perpetrators remain unpunished - Pakistan - DAWN.COM",
  "author": null,
  "content": "• CTD official Khattab says failure to deliver justice may embolden other militant groups\n• Defence counsel claims there’s no concrete evidence against his clients; alleges they faced maltreatment during interrogation\n\nKARACHI: A decade after the Safoora Goth bus attack that killed 47 members of the Shia Ismaili community, the counterterrorism official who arrested the terrorist gang expresses concern over the inordinate delay in executing their sentence, warning that failure to deliver justice to the victims’ families could embolden similar militant groups.\n\nMeanwhile, the lawyer for the five convicts sentenced to death by a military court in 2016 says he has been representing his clients before the high court, arguing that they were not given a fair trial.\n\nOn May 13, 2015, a group of armed militants had stormed into a bus ferrying members of the Shia Ismaili community near Safoora Goth, opened indiscriminate fire, killing 47, including 18 women, and wounding six others.\n\nA few days later, a Counter-Terrorism Department (CTD) team, headed by Raja Umer Khattab, had arrested five militants — Tahir alias Minhas alias Sain, Saad Aziz alias Tin Tin, Hafiz Nasir Ahmed, Mohammad Azhar Ishrat and Asad Rehman. They were said to be inspired by the militant Islamic State (IS) group, and involved in multiple incidents of targeted killings.\n\nIn 2016, a military court had sentenced them to death in the Safoora bus carnage case. However, 10 years after the attack, the case against the militants has yet to reach a logical conclusion due to their appeals pending hearing before the high court.\n\nTalking to Dawn, Mr Khattab has expressed concern that the failure to deliver justice could embolden other likeminded militant groups, warning that it could lead to a serious crisis.\n\nHe questioned why, even after a decade, the sentences had not been implemented.\n\nMr Khattab fears that the delay in executing their sentence could enable their accomplices in other militant groups to plan their release by orchestrating a hostage crisis.\n\nHe is convinced that these militants would pose a grave threat to society, witnesses, those who imprisoned them and their families if they secure their release. He believes that executing their sentences would have neutralised this threat.\n\nRecalls success in dismantling militant group\n\nRecalling how he succeeded in tracing the militant group, Mr Khattab said that he had visited the crime scene, where he came across a crucial lead during the search — a lead he had long been seeking, which eventually led him to the militant group’s leader, Tahir Sain.\n\n“I was inside the bus, and due to the blood spilled all over, I slipped and that’s when my hand landed on the very lead I had been searching for over a long period,” Mr Khattab recalled, adding that it was through this lead that he became certain about the involvement of a specific group in this incident.\n\nThe CTD official revealed that before the incident, terrorist groups had been under surveillance for years, during which several militants were arrested and valuable information was obtained from them.\n\nHe stated that the gathered intelligence indicated that a local wing of Al Qaeda was operating in Gulistan-i-Jauhar, where young men were engaged in translation work for propaganda purposes and were also involved in the preparation of improvised explosive devices (IEDs).\n\nWhen asked how they discovered that the local IS group was involved in several terrorist activities in Karachi, Mr Khattab said they had been monitoring a suspect in the Banaras area but failed to apprehend him as he managed to flee.\n\nHowever, while searching his house, they removed a wall frame and found a taped-over hole in the wall. As they removed the tape, a USB drive was there which contained a video, revealing that the local Al Qaeda militants were planning to declare themselves as the local chapter of IS.\n\nHe emphasised that after the disappearance of the suspected militant, IED attacks in Karachi stopped for some time. However, a few months later, members of the Bohra community were targeted in the Dhoraji area where, for the first time, a pamphlet bearing the name of Daesh, the Arabic acronym of IS, was found at the crime scene.\n\nHe recalled that a series of terrorist activities began, including targeted attacks on law enforcement agencies, a private school, American educationist Debra Lobo, rights activist Sabeen Mahmud, and finally the Safoora Goth bus carnage.\n\nMr Khattab disclosed that during the planning of the Safoora Goth massacre, internal disagreements emerged among the militants, with some suggesting that the victims be set on fire after being killed. However, since it was to be the first attack on the Ismaili community, that part of the plan was eventually put on hold, he added.\n\nHe claimed the group was planning to attack some fashion designers in the metropolis but failed as they were caught by the CTD.\n\nMy clients denied fair trial: defence counsel Senior lawyer Hashmat Habib has been representing the five convicts after a military court sentenced them to death in 2016.\n\nHe filed five identical applications, which are still pending before the Sindh High Court.\n\nIn the applications, Advocate Habib submitted that there was no concrete evidence against his clients, who allegedly faced maltreatment during interrogation.\n\nHe also stated that the accused were denied a fair trial and were not allowed to engage a defence counsel of their choice at the time of the trial by a military court.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:02:18.340Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910672/10-years-on-safoora-bus-carnage-perpetrators-remain-unpunished",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:33:43.000Z"
}
