{
  "title": "In rare interview, Imran’s sons call attention to their father’s incarceration - Pakistan - DAWN.COM",
  "author": null,
  "content": "In a rare public appearance, former prime minister Imran Khan’s sons — Suleman Khan (28) and Kasim Khan (26) — called attention to their father’s incarceration.\n\nImran, imprisoned since August 2023, is serving a sentence at the Adiala Jail in the £190 million corruption case and also faces pending trials under the Anti-Terrorism Act related to the May 9, 2023, protests.\n\nThis is the first time the two have publicly talked about their father’s incarceration. They were allowed by a court in November 2023 to contact him every week, but these talks, according to them, have not always been facilitated.\n\nIn an interview with X influencer Mario Nawfal on why they chose to speak out now, Kasim said: “We’ve gone through the legal routes. We’ve gone through every route that we thought would potentially get him out. We never thought he would be in there a fraction of how long he’s been in there. And it’s only getting worse. And, so, we’ve somewhat run out of those options. And now we’ve decided the only route of taking action is to come and speak publicly.”\n\nHe added: “What we want is international pressure on Pakistan right now, because currently he’s living in inhumane conditions. They’re not giving him basic human rights … They’re not really doing anywhere near enough. And what we want is global pressure.”\n\nOn the topic of a lack of success so far through legal channels, Suleman said: “We’ve exhausted other options [and] legal avenues and it’s gone very quiet. It seems, in the international media, it seems to have gone very quiet.”\n\nThe PTI has frequently complained about Imran’s facilities and has filed several petitions in the Islamabad High Court regarding the issue. On the other hand, the jail administration has refuted the claims.\n\nQuestioned about the calls by US official Richard Grenell for their father’s release, Suleman said the two had not had any contact with him so far but were grateful for “all the support he’s shown”.\n\nRegarding a message they had for the Trump administration on the topic, Suleman said: “We’d call for any government that supports free speech and proper democracy to join the call for our father’s release.”\n\nKasim similarly said he wanted the international community to “look at what’s going and hopefully take action and who better than Trump to gain the attention of.\n\n“We’d love to speak to Trump or try and figure out a way where he would be able to help out in some way. Because, at the end of the day, all we’re trying to do is free our father, bring democracy in Pakistan and just ensure his basic human rights.”\n\nTalking about the toll the situation had had on them, Kasim said “it’s been pretty brutal”.\n\nThe brothers claimed their phone calls were set up with their father at odd times with limited duration, adding that the failure to miss the calls “meant going a long time before they could talk to him again.”\n\nThey further claimed they spoke to Imran only once every two or three months.\n\nThe brothers said they did not want to participate in politics, adding that they had taken permission from Imran before speaking out in the interview.\n\nThe two have stayed away from the limelight, with their mother, British journalist and screenwriter Jemima Goldsmith, stressing that her sons had nothing to do with Pakistani politics.\n\nIn 2022, after anti-PTI protests were held outside her UK residence, she wrote on the former Twitter platform, “[…] I have got nothing to do with Pakistani politics and neither have my children. They are low-key private individuals who are not even on social media.”\n\nThe following year, Jemima expressed her disappointment with X owner Elon Musk for taking away the previous blue-tick verification from accounts after trolls made fake accounts of her sons.\n\n“Fake accounts pretending to be my children, created by imposters with a political agenda in Pakistan. This is exactly what I feared would happen when you took away Twitter’s verification blue ticks. FYI my children are not on social media & have no plans to be,” she said.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:11:21.852Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910789/in-rare-interview-imrans-sons-call-attention-to-their-fathers-incarceration",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T15:36:41.000Z"
}
