{
  "title": "Sinner eases into Italian Open last 16, Osaka dumped out - Sport - DAWN.COM",
  "author": null,
  "content": "ROME: Jannik Sinner cruised into the last 16 of the Italian Open on Monday after comfortably beating lucky loser Jesper de Jong 6-4, 6-2 in front of a delighted crowd in Rome.\n\nWorld number one Sinner continued his Foro Italico comeback from a three-month doping ban by dealing with De Jong and setting up a clash with Argentina’s Francisco Cerundolo — who defeated Sebastian Ofner 6-2, 6-4 — in the next round.\n\nSinner was knocked out in the last 16 by Cerundolo the last time he played here, in 2023, and he is under no illusions that the 17th seed will be a big step up after two low-ranked opponents.\n\n“Let’s see, he’s an amazing player, he has an amazing season until now,” said Sinner of Cerundolo. “It’s going to be tough. For sure I have to raise my level… It’s going to be a good challenge, a good test for me and we’ll see how it goes.”\n\nThe over 10,000 fans crammed into the centre court stands hope Sinner can end a 49-year wait for an Italian winner of the men’s tournament in the Italian capital.\n\nBut Monday’s win was in reality another warm-up for 23-year-old’s stated objective of arriving at the French Open in top form.\n\nDe Jong, ranked at a career-high 93rd in the world, offered some resistance in a low-key contest in which Sinner showed signs of rustiness.\n\nSinner threw away a three-game lead when 4-1 up in the first set before eventually going ahead in the match but he saw out the contest with little fuss, helped in part by De Jong hurting his wrist in a fall in the fourth game of the second set.\n\nTommy Paul struggled against Tomas Machac of the Czech Republic but the American ultimately prevailed 6-3, 6-7(5/7), 6-4.\n\nPaul will next face seventh seed Alex de Minaur as they Norwegian downed Hugo Dellien of Bolivia 6-4, 6-4.\n\nJakub Mensik beat Fabian Marozsan 6-4, 7-6(2) to reach the fourth round. Mensik converted three of six break points he earned and then produced a rock-solid second-set tie-break to seal an 89-minute triumph.\n\nThe big-serving Czech will take on 30th seed Hubert Hurkacz for a quarter-final spot after the Pole defeated Marcos Giron 6-3, 1-6, 6-1.\n\nIn the women’s draw, Jasmine Paolini cruised past Jelena Ostapenko and into the women’s quarter-finals, easing past her Latvian opponent 7-5, 6-2.\n\nSixth seed Paolini will face Diana Shnaider — who downed Belgium’s Elise Mertens 6-2, 6-3 — in the last eight as she eyes another deep run in a 1000 series tournament after losing to world number Aryna Sabalenka.\n\nEarlier, Naomi Osaka’s struggle for form at the top level continued with her 6-4, 3-6, 7-6(7/4) defeat to Peyton Stearns.\n\nIn the quarter-finals Stearns will face Elina Svitolina, a 6-4, 6-2 winner over Danielle Collins, after coming through an attritional match which lasted the best part of three hours on a baking centre court.\n\nOsaka is another big name that American Stearns has beaten in Rome after also knocking out fifth seed Madison Keys in the previous round.\n\nFormer world number one Osaka has looked a long way from the player who won four Grand Slams.\n\nShe returned last year from a 15-month break from tennis for the birth of her daughter.\n\nHer comeback was also hampered by an abdominal injury that forced her out of the Australian Open, after which early exits at Indian Wells and Madrid highlighted how far she was from her best.\n\nOsaka warmed up for Rome by winning a minor event in Saint Malo in France earlier this month.\n\nBut she has failed to get past the last 16 of a tournament higher than the WTA 125 series since losing the Auckland final back in January.\n\nCoco Gauff made short work of Britain’s Emma Raducanu, winning 6-1, 6-2 in just over an hour to reach the last eight where she will face Russia’s Mirra Andreeva. The 18-year-old Andreeva came from a set down to beat Denmark’s Clara Tauson 5-7, 6-3, 6-2.\n\nOn Sunday, four-time Grand Slam champion Carlos Alcaraz reached the fourth round at the Foro Italico for the first time after a battle with spirited Laslo Djere 7-6(7/2), 6-2 on centre court.\n\nIn the next round, Alcaraz — who was playing in his second match since suffering a thigh injury in his Barcelona Open final defeat by Holger Rune last month — will face Karen Khachanov.\n\nThe Spaniard was not at his best against Djere whose three career tournament wins have all come on clay, his most recent title in March, at the Chile Open in Santiago.\n\nThe 22-year-old was broken twice in the first set which looked like going either way until he took control in the eventual tie-break, before sweeping Djere aside in the second.\n\n“I just thought that I had to stay there mentally strong, waiting for my chances because I was playing great,” said Alcaraz. “I was playing great, moving, hitting the ball. It was just a few mistakes that I made.”\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68228d40af732.gif",
  "retrievedAt": "2025-08-23T14:11:51.685Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910629/sinner-eases-into-italian-open-last-16-osaka-dumped-out",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:33:29.000Z"
}
