{
  "title": "Police chase Bosan Gang after killing of landlord - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Police of Muzaffargarh and Rajanpur districts have launched a joint operation against the Bosan Gang involved in the killing of a landlord and injuring his son over a land dispute in the riverine area of Alipur tehsil.\n\nAccording to police, outlaws Almas and Fayyaz and some others had a land dispute with landlord Jeevan Bosan in Mad Sonhare Shah area. The landlord had stopped gang members from crossing his farm which led to an exchange of harsh words. One of the gang members shot at and injured Jeevan’s son Tayyab last week.\n\nPolice registered a case and raided their residences. Since the suspects had left their houses, police detained some females. Police also barred suspects’ relatives from harvesting their wheat.\n\nThe suspects were already declared proclaimed offenders in a kidnap for ransom case of Chaudhry Zafar, who belonged to Sahiwal. Zafar was also a landlord in the riverine area and was kidnapped six weeks ago. He reportedly earned freedom after paying Rs 10 million ransom. He was kidnapped allegedly by Zafar Jhabeel who was also a proclaimed offender in some murder cases and a close friend of the Bosan Gang.\n\nAnother landlord ‘pays ransom’ for release\n\nPolice said the suspects and their family members were busy harvesting wheat when Jeevan along with a police team approached the scene. The suspects opened fire at Jeevan who died on the spot.\n\nRajanpur District Police Officer Farooq Amjad reached the scene and launched an operation against Bosan Gang.\n\nIn a joint operation, the Crime Control Department (CCD) and the police demolished the hideouts of the gang who fled on a boat.\n\nOn Monday, the police found the boat dotted with blood stains. DPO Amjad told Dawn that they were chasing the gang and would arrest them soon. “The gangsters exchanged gunfire with police last night and fled away in the darkness while blood stains were found on the boat recovered during the operation,” he said.\n\nQuoting a family source of the gang members, he said that one of the members, Almas Bosan, was killed while three others were injured. “We are checking hospitals and other places to arrest other gang members”.\n\nHe also confirmed that the gang members had first shot at and injured the son of landlord Jeevan and were annoyed over the registration of a case against them.\n\nHe said that they were hurling threats of dire consequences at the landlord to take back the case and shot them for not doing so.\n\nHe said that the Bosan Gang members were facilitating Zafar Jhabeeal to carry out kidnap for ransom in the region. “We also offered them to surrender but they opened fire at police and they (police) had to retaliate,” he said\n\nAnswering a query about release of the kidnapped person, the DPO said that the landlord was released without paying any ransom as police had released their accomplice.\n\nPublished in Dawn, May 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:03:17.107Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910657/police-chase-bosan-gang-after-killing-of-landlord",
  "dateList": "2025-05-13",
  "date_published": "2025-05-13T01:33:49.000Z"
}
