{
  "title": "CDA chief directs construction of cycling tracks in diplomatic enclave",
  "link": "https://www.app.com.pk/national/cda-chief-directs-construction-of-cycling-tracks-in-diplomatic-enclave/",
  "date_published": "2024-05-12T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 12 (APP):Chairman of Capital Development Authority (CDA), Muhammad Ali Randhawa on Sunday has issued directives for the construction of cycling tracks in the diplomatic enclave.\nAs part of Chairman CDA’s vision, dedicated cycling tracks will be developed in the diplomatic enclave to offer diplomats and foreign communities an easy and environmentally friendly mode of transportation within the capital, according to a news release.\nDuring a recent meeting, the Chairman presented details of the project aimed at establishing cycling lanes throughout the federal capital.\nThe meeting was attended by key stakeholders, including officials from Member Engineering, Railways, NESPAK, ADB, Islamabad Cycling Association, and other relevant organizations.\nThe Chairman emphasized the significance of enhancing the city’s natural beauty alongside creating world-class cycling tracks that will not only benefit residents but also attract tourists to the city.\nAccording to the Chairman’s directives, the cycling tracks will be integrated amidst beautiful landscaping on both sides, enhancing the overall aesthetic appeal of the city.\n“Our top priority is to provide a conducive environment for cycling in Islamabad,” stated the Chairman.\nHe further added, “We are dedicated to promoting sustainable and healthy transportation methods and ensuring improved facilities for residents and visitors alike.”\nThe Chairman stressed the importance of adhering strictly to the project timelines for its timely completion.\nMuhammad Ali Randhawa highlighted that the Islamabad Bicycle Lane project will play a pivotal role in elevating the city’s foundational infrastructure to new heights and significantly contribute to Islamabad’s sustainable urban development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:27:46.076Z"
}
