{
  "title": "Pakistan wants to further strengthen bilateral ties with Japan: Chairman Senate",
  "author": null,
  "content": "ISLAMABAD, Feb 04 (APP): Chairman of the Senate Syed Yousa Raza Gilani on Tuesday reaffirmed Pakistan’s commitment to strengthening its ties with Japan and expanding cooperation in multiple sectors for the mutual benefit of both nations.\nDuring a meeting with Akamatsu Shuichi, Ambassador of Japan, the Chairman Senate emphasized the need to strengthen economic ties and address the trade imbalance between Pakistan and Japan.\nHe noted that the current bilateral trade remains below its true potential and called for joint efforts to unlock economic opportunities.\nHe stressed the importance of high-level visits and parliamentary exchanges to further cement bilateral relations.\nHe extended an invitation to his Japanese counterpart to visit Pakistan and noted that the last high-level visit from Pakistan to Japan was in 2019 when former President Arif Alvi attended the enthronement ceremony of Japan’s new Emperor. He reiterated the need for more leadership-level interactions to set a strategic direction for bilateral ties.\nHe also highlighted the role of the Parliamentary Friendship Group in the Pakistani Parliament as a key mechanism for enhancing collaboration.\nGilani commended Japan’s special assistance package in response to Pakistan’s devastating 2022 floods and acknowledged Japan’s contributions to educational scholarships and capacity-building programs for Pakistan’s civil service officers.\nHe welcomed Pakistan’s participation in Expo Osaka 2025 and highlighted the Technical Intern Training Program (TITP) and the Specified Skilled Worker (SSW) Program, under which Pakistan and Japan signed cooperation agreements in 2019.\nHe expressed appreciation for Japan’s decision to conduct skill tests in Pakistan under these programs, recognizing their potential to enhance bilateral workforce collaboration.\nThe Chairman emphasized the need for regular engagement through institutional mechanisms to consolidate and expand cooperation across various sectors. He urged Japan to revisit its security-related travel advisory for Pakistan, which he said would help boost investment, tourism, and people-to-people exchanges.\nHe underscored the resilience of diplomatic ties between Pakistan and Japan, established in 1952, and noted that both nations share common views on global peace and stability. He stressed the importance of continued collaboration to foster sustainable regional peace.\nGilani acknowledged Japan’s invaluable support through the Japan International Cooperation Agency (JICA), which has contributed to Pakistan’s health, education, gender equality, and disaster management sectors.\nHe also highlighted the potential for greater cooperation in climate change, stating that joint initiatives could enhance Pakistan’s ability to mitigate the risks of floods and other natural calamities. He praised the role of the Pak-Japan Friendship Forum (PJFF), launched in 2018, in promoting cultural exchanges and deepening public ties between the two nations.\nHe proposed leveraging Pakistan’s young workforce to address labor shortages in Japan, particularly in healthcare, construction, and transportation. He called for targeted training programs in Pakistan that align with Japan’s labor market needs.\nHe further emphasized the need to expand vocational education initiatives, particularly in South Punjab, to enhance the employability of Pakistani youth and prepare them for global economic opportunities.\nChairman Senate reiterated that Japan remains a key investment partner for Pakistan. He introduced the Special Investment Facilitation Council (SIFC), a cross-sectoral initiative aimed at simplifying the investment process and attracting foreign direct investment (FDI) in key sectors such as agriculture, minerals, information technology, and energy.\nDuring the meeting, Chairman Senate also invited the Ambassador of Japan to visit Multan, highlighting the city’s rich cultural heritage and its economic potential. He noted that the Multan Chamber of Commerce is actively promoting business opportunities and encouraged Japanese investors to explore potential collaborations.\nGilani praised the contributions of Pakistan’s 25,000-strong diaspora in Japan, recognizing their pioneering role in used automobile exports, carpet trade, and halal food industries. He acknowledged their importance as economic contributors to both Pakistan and Japan.\nHe reiterated the shared commitment of Pakistan and Japan to regional peace and prosperity. He emphasized the importance of continued dialogue and cooperation to address common challenges and promote stability in the region.\nIn response, Ambassador Akamatsu Shuichi reaffirmed Japan’s commitment to deepening economic cooperation with Pakistan and exploring new avenues for collaboration.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:21:32.911Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-wants-to-further-strengthen-bilateral-ties-with-japan-chairman-senate/",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T16:15:00.000Z"
}
