{
  "title": "Kashmir Solidarity Day to be observed on Wednesday with zeal",
  "author": null,
  "content": "ISLAMABAD, Feb 4 (APP):Kashmir Solidarity Day will be observed on Wednesday (February 05) with zeal and enthusiasm to express the whole-hearted support of Pakistani nation to the just struggle of Kashmiri people for their inalienable right to self-determination under the UN resolutions and to give strapping message to India to impede its atrocities against Kashmiris.\nThe day is marked to express solidarity with the oppressed Kashmiri people and to draw the attention of the international community to the Indian atrocities in the illegally occupied Jammu and Kashmir.\nPakistan is supporting Kashmir cause by politically, diplomatically and morally to pressurize India to stop genocide against innocent Kashmiri people who are struggling for fundamental right to self-determination.\nThe present government and all previous governments of Pakistan have highlighted India’s gruesome human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK) at all available international forums.\nPakistan wanted resolution of Kashmir issue as per United Nations’ Charters and all its resolutions to give Kashmiris plebiscite which is their long-lasting demands.\nAcross Pakistan and AJK, political parties, activists, and civil society groups are mobilizing for rallies, peace marches, and awareness events to highlight the plight of Kashmiris.\nPakistani embassies worldwide are also stepping up efforts to draw international attention, organizing documentary screenings and discussion forums on India’s continued oppression in the disputed territory.\nMain walk will be organized at Constitutional Avenue Islamabad which will attend by political leaders, students, media men and people belong to various segments of society.\nHuman chains by the Pakistani brethren with the people of AJK would be made at all seven bridges of AJK linking Pakistan including Kohala, Holar,  Bararkot, Dhalkot, Azad Pattan, Dhan Galli and Mangla bridge over various Kashmir’s born rivers falling in Pakistan will be made at 10.00 am on the Kashmir Solidarity Day.\nSirens will be blown and one minute silence will observed at 10:00 am to pay homage to the martyrs of Kashmir.\nPakistan Television (PTV), Radio Pakistan, Associated Press of Pakistan (APP) and private channels will telecast their programmes, documentaries, and feature stories to highlight Indian barbarism on oppressed Kashmiri people.\nPosters and billboards had been displayed around important Avenues, airports, and railway stations to highlight the plight of Kashmiri people and expose Indian atrocities.\nIn recognition of the day’s importance, the government has declared a public holiday across Pakistan and AJK, ensuring maximum public participation in solidarity activities.\nSpecial prayers will be held nationwide to honor the Kashmiri martyrs, while mass demonstrations will echo the demand for Kashmir’s right to self-determination, a promise made by the United Nations 78 years ago but yet to be fulfilled.\nAs the world watches, February 5 stands as a powerful reminder of Kashmir’s unresolved struggle and the urgent need for a just and lasting resolution to the conflict.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:23:06.139Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kashmir-solidarity-day-to-be-observed-on-wednesday-with-zeal/",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T11:50:00.000Z"
}
