{
  "title": "Pakistan’s unwavering solidarity fuels Kashmir’s resistance: Altaf Hussain Wani",
  "author": null,
  "content": "ISLAMABAD, Feb 04 (APP):Veteran Kashmiri rights activist and Senior Vice Chairman of the Jammu Kashmir National Front (JKNF), Altaf Hussain Wani, on Tuesday lauded Pakistan’s enduring support for the people of Kashmir, stating that it has kept the resistance movement alive in Indian-occupied Kashmir (IOK).\nSpeaking in a video message on the occasion of Kashmir Solidarity Day, Wani emphasized that February 5 is symbolic, but Pakistan’s solidarity with Kashmir has remained steadfast for over seven decades.\n“It is because of this moral and diplomatic support, because of the people of Pakistan standing behind Kashmiris, and because of Pakistanis across the globe raising their voices against Indian occupation and atrocities, that our struggle continues,” he said.\nWani highlighted the deep bond between the two, stating, “Kashmiris chant, ‘We are Pakistanis, and Pakistan is ours,’ just as Pakistan declares, ‘We are Pakistan, and Kashmir is ours.'”\nObserving this day, he stressed, is Pakistan’s way of sending a clear message to the world: “We will not leave the people of Kashmir alone. Pakistan stands by them in their struggle for the right to self-determination.”\nHe also acknowledged the role of Pakistan’s foreign missions in raising awareness about human rights violations in IOK and advocating for the implementation of long-pending UN Security Council resolutions on Kashmir.\nDespite India’s oppressive measures post-August 5, 2019, including restrictions on resistance, freedom of expression, and political activities, Wani noted that voices across the globe are growing louder in support of Kashmir’s cause.\nHe expressed heartfelt gratitude, saying, “I thank Pakistan and its people for their unwavering solidarity with Kashmir.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:23:07.439Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistans-unwavering-solidarity-fuels-kashmirs-resistance-altaf-hussain-wani/",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T11:43:00.000Z"
}
