{
  "title": "Minister Salik announces major reduction in Hajj package costs, announces refund of over Rs.4.75 bln to pilgrims 2024",
  "author": null,
  "content": "ISLAMABAD, Feb 04 (APP): Minister for Religious Affairs and Interfaith Harmony, Chaudhry Salik Hussain on Tuesday announced a significant reduction in Hajj package costs, providing financial relief to the aspiring pilgrims.\nAddressing a press conference flanked by Additional Secretary, Dr. Syed Atta-ur-Rehman here at the Ministry of Religious Affairs and Interfaith Harmony, he informed that the cost of the 40-day long Hajj package has been reduced by Rs.25,000, bringing the total to Rs.1,050,000. Pilgrims opting for this package will need to pay a third installment of Rs. 450,000.\nSimilarly, Minister Salik said the 25-day short Hajj package has been further reduced by Rs.50,000, setting the new price at Rs.1,100,000. The third installment for this package will be Rs.500,000.\nHe said all pilgrims are required to submit their third installment at the designated banks between February 6 to 14. The ministry has ensured that every pilgrim will receive a notification regarding their payment status through the ‘Pak Hajj’ mobile application, he added.\nIn another major development, Minister Salik announced the refund of over Rs.4.75 billion to the pilgrims 2024. He said the refunds have been categorized into seven different groups, based on factors such as accommodation in Mina, lodging in Makkah, and Maktab C allocation. Additionally, savings from Qurbani refunds and airfare reductions are also being passed on to the pilgrims.\nHighlighting the statistics of the refund process, Minister Salik said fourteen percent of the pilgrims (9,588 individuals) will receive Rs. 20,000, five percent (3,358 individuals) will receive Rs.35,000, nineteen percent (12,981 individuals) will receive Rs.50,000, twenty three percent (16,037 individuals) will receive Rs.75,000, twenty six percent (17,828 individuals) will receive Rs.90,000, ten percent (6,784 individuals) will receive Rs.110,000, and three percent (2,228 individuals) will receive Rs.140,000. The refunds will be transferred through the designated bank branches.\nMinister Salik confirmed that the transfer of funds to nominated banks will commence within the next two days, ensuring timely financial relief for the pilgrims.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:21:55.164Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/minister-salik-announces-major-reduction-in-hajj-package-costs-announces-refund-of-over-rs-4-75-bln-to-pilgrims-2024/",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T15:31:00.000Z"
}
