{
  "title": "Kashmiri’s struggle for right to self-determination remains alive despite suppression attempts; Senior APHC leaders",
  "author": null,
  "content": "ISLAMABAD, Feb 4 (APP):Senior Kashmiri leaders strongly condemned India’s oppressive policies in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and reaffirmed that the struggle for self-determination remains alive despite attempts to suppress it.\nSpeaking on the significance of Kashmir Solidarity Day, Hurriyat leader, Abdul Hameed Lone said,”February 5 is a day of global awareness and solidarity for the people of Kashmir. It serves as a reminder to the world, and particularly to India, that Pakistan’s 250 million citizens, its government and every institution stand firmly with the Kashmiri people”.\n“On this day, we seek to awaken the conscience of the international community and remind them of the promises made to us in 1949 and 1950. Unfortunately, on August 5, 2019, India took an illegal and unilateral step, violating UN Security Council resolutions. Kashmir is an internationally recognized disputed territory, and its significance at the global level cannot be ignored”, he said while talking to APP.\nIndia’s repeated claims that Kashmir is its ‘integral part’ are nothing but a hypocritical stance. Indian government must honor the commitments made by its first Prime Minister, Pandit Jawaharlal Nehru, and respect the UN resolutions that guarantee Kashmiris the right to self-determination.\n“Pakistan will continue to express unwavering solidarity until the Kashmir issue is resolved in accordance with the wishes of its people. The people and government of Pakistan will continue providing political, diplomatic, and moral support to the Kashmiri cause”, Lone said.\nSecretary General of the All Parties Hurriyat Conference (APHC), Advocate Parvez Shah also strongly condemned India’s actions, stating, “Today, the Pakistani government, along with all its institutions, is demonstrating unwavering solidarity with the people of Kashmir. This day holds immense significance as India continues its attempts to suppress the Kashmiri freedom movement and erase its identity”.\nThe Indian government has imprisoned Kashmiri political leaders, placed many under house arrest, and completely stifled freedom of expression. They have turned IIOJK into a no-access zone for international media and human rights organizations.\nBy doing so, India is trying to create the false impression that the Kashmiri resistance has ended—but the world must know that this movement is very much alive, he said.\nThe Kashmiri people have sacrificed over 100,000 lives for their right to self-determination and they understand the value of their struggle and remain resolute.\nShah said, “Pakistan’s observance of Kashmir Solidarity Day is a powerful message of support, assuring Kashmiris that they are not alone. The Pakistani government, its institutions, and the entire nation stand firmly with them”.\n“We are deeply grateful to the people of Pakistan for commemorating this day as a national occasion. It reinforces the commitment that Kashmir’s freedom is Pakistan’s top priority. The Pakistani leadership has always maintained that there will be no compromise on Kashmir. The day is not far when Kashmir will gain independence and become a part of Pakistan”, Shah said.\nBoth leaders urged the international community to take immediate notice of the human rights violations in IIOJK and push for the implementation of UN Security Council resolutions regarding Kashmir. They called for an end to Indian aggression and reiterated that the struggle for self-determination will continue until Kashmiris achieve their long-awaited freedom.\nAs Pakistan reaffirms its unwavering support, the people of IIOJK remain steadfast in their fight for justice, self-determination, and ultimate freedom.\nThe observance of Kashmir Solidarity Day across Pakistan, marked by rallies, speeches, and demonstrations, underscores Pakistan’s continued commitment to Kashmir’s right to self-determination. The event serves as a powerful call for global attention and justice for the people of Kashmir.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T12:22:43.501Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kashmiris-struggle-for-right-to-self-determination-remains-alive-despite-suppression-attempts-senior-aphc-leaders/",
  "dateList": "2025-02-04",
  "date_published": "2025-02-04T12:04:00.000Z"
}
