{
  "title": "COVID-19 national tally of active cases cross highest 82 thousands mark",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-cross-highest-82-thousands-mark/",
  "date_published": "2021-08-08T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP):The national tally of total active COVID-19 cases was recorded 82,076, the highest during fourth wave of pandemic on Sunday with 4,455 more people testing positive for the deadly virus and 2,148 people recovering from the disease during the last 24 hours.\nSixty-eight corona patients have died during past 24 hours, 64 of whom were under treatment in the hospitals and four of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Punjab followed by Sindh. Out of the total 68 deaths occurred, 27 of them were died under treatment on ventilators.\nThere were 4,282 COVID infected patients under treatment in critical condition with seven of them admitted during past 24 hours in various COVID dedicated healthcare facilities of the country.\nThe National COVID positivity ratio during past 24 hours was recorded 8.09 percent.\nThe COVID positivity ratio was the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 43%, Bahawalpur 40%, Peshawar 36% and Multan 34%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Hyderabad 68%, Abbottabad 55%, Karachi 62%, and Skardu 51%.\nAround 435 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan and Azad Jammu and Kashmir (AJK).\nSome 55,002 tests were conducted across the country on Saturday, including 15,405 in Sindh, 20,609 in Punjab, 10,158 in Khyber Pakhtunkhwa (KP), 4,875 in Islamabad Capital Territory (ICT), 1,658 in Balochistan, 684 in GB, and 1,613 in AJK.\nAround 961,639 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,067,580 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 26,874, Balochistan 31,138, GB 8,703, ICT 90,503, KP 147,973, Punjab 363,644 and Sindh 398,745.\nAbout 23,865 deaths were recorded in country since the eruption of the contagion. Around 6,189 people perished in Sindh, 20 of them died in the hospitals and one out of the hospital on Saturday.\n11,194 people died in Punjab died with 22 deaths occured in past 24 hours. Some 19 individuals died in the hospitals and three out of the hospitals.\nAs many as 4,540 people expired in KP, 16 of them died in hospitals on Saturday, 814 individuals died in ICT, three of them died in the hospitals in past 24 hours, 331 people died in Balochistan, 152 infected people perished in GB, two of them died in the hospitals on Saturday and 645 people died in AJK, four of them succumbed to the deadly virus in the hospitals on Saturday.\nA total of 16,448,406 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 4,731 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:03:29.518Z"
}
