{
  "title": "President, PM laud NCOC for its dedicated work",
  "link": "https://www.app.com.pk/national/president-pm-laud-ncoc-for-its-dedicated-work/",
  "date_published": "2021-08-08T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP): President Dr Arif Alvi and Prime Minister Imran Khan Sunday lauded the outstanding and dedicated work of National Command and Operation Center (NCOC), resulting in successful strategy to contain Covid 19 pandemic.\nIn their separate tweets, the president appreciated the outstanding working of National Command and Operation Center (NCOC) as an institute.\nOn his twitter handle, the president said that NCOC was unique platform laid by Prime Minister Imran Khan which proved its worth with a successful Covid 19 pandemic planning, bringing Pakistan in the forefronts of the comity of nations with regard to its successful strategy.\nMust appreciate work & institution of NCOC. Outstanding effort done by NCOC on the unique platform laid by the PM to ensure that the poor should not suffer with total lockdown. NCOC did wonders & proved that in smart planning Pakistan stands in the front row in comity of nations\n— The President of Pakistan (@PresOfPakistan) August 8, 2021\nThe prime minister, in his tweet, said that NCOC proved as linchpin in country’s Covid 19 response strategy.\nOn his twitter handle, the prime minister posted that government’s strategy to contain coronavirus had been appreciated by the world.\nWith the blessing of Allah Almighty, Pakistan was protected from the worst effects of the deadly infection, he further added.\nOur Covid 19 response strategy has been appreciated by the world and with the blessings of Allah has protected Pakistan from the worst effects of Covid. I want to pay tribute to the NCOC team which through its dedicated work has been the linchpin of our Covid response strategy.\n— Imran Khan (@ImranKhanPTI) August 8, 2021\nThe president and the prime minister reflected their thoughts on the dedicated efforts of NCOC as the body had successfully completed 500 days of its formation.\nEarlier, Minister for Planning and Development Asad Umar on his twitter account also shared a video documentary titled Azm-e-Alishan, featuring the NCOC efforts and nation’s response to the global pandemic.",
  "retrievedAt": "2025-08-11T21:03:29.335Z"
}
