{
  "title": "28 Pakistanis released from Saudi prisons reach Lahore",
  "link": "https://www.app.com.pk/national/28-pakistanis-released-from-saudi-prisons-reach-lahore-2/",
  "date_published": "2021-08-03T09:54:00.000Z",
  "source": "APP",
  "content": "LAHORE, Aug 03 (APP): The 28-Pakistanis, released from the Saudi Arabian prisons after a royal decree, Tuesday reached Lahore’s Allama Iqbal International Airport via chartered flight of the Pakistan International Airlines (PIA).\nThe 28 Pakistanis, who were imprisoned in various Saudi jails, have been released by the royal decree of Crown Prince Mohammed bin Salman after Prime Minister Imran Khan asked the Crown Prince for clemency during the former’s Pakistan visit in 2019.\nThe Pakistanis were received by Senator Ijaz Ahmed, on behalf of Prime Minister Imran Khan, and the Pakistanis raised the slogans ‘Long Live Prime Minister Imran Khan’ as soon as they set their foot on Pakistani soil. A large number of PTI workers, family and friends of the released Pakistanis had gathered at the airport to welcome the freed-Pakistanis and handed them Pakistan flags.\nTalking to the media men, Senator Ijaz Chaudhery said it was a moment of immense pleasure for the PTI government that 28 Pakistanis imprisoned in various Saudi Arabian jails have returned to their homes, adding that another 62 Pakistani prisoners had already reached the country before Eid ul Azha.\nTo a question, he said, “These Pakistanis will reunite with their families due to the untiring efforts of Prime minister Imran Khan”, adding that the Pakistan government was thankful to the Saudi government for the release of these Pakistanis.\nTo a query, he said the government was in talks was all the governments for the release of Pakistani prisoners, adding that the government was more focused on the gulf countries where the Pakistani diaspora was in the largest numbers.\nOverseas Pakistanis Foundation (OPF) officials, who were also present on the occasion, arranged a breakfast for the freed-Pakistanis after they came out of the lounge after coronavirus testing.\nThe Pakistan government bore the travel expenses of the 19 Pakistanis while the rest of the nine paid for themselves. The returning Pakistanis hail from different parts of the country including Mehmand Agency, Lower Dir, Sialkot, Swat, Kurram Agency, Charsaddah, Hangu, Mardan, Abbotabad, Peshawar and Larkana.\nTalking to APP upon their arrival, one of the released priosners Siraj Khan of Lower Dir said it was a long tale of hope and despair but Prime Minister Imran Khan became their messiah and made their release possible.\n“I am in the seventh heaven on returning to my homeland”, said Ghulam Murtaza of Larkana who profoundly thanked Almighty Allah and expressed his gratitude for premier Imran Khan for the kind initiative.\nHis eyes brimming with tears, Safdarullah Bacha of Charsaddah said his family was indebted to the PTI government for paying for the fines and other liabilities to make his return to his family possible. He said he was excited to return to his native city after a lapse of several years.",
  "retrievedAt": "2025-08-11T21:02:07.106Z"
}
