{
  "title": "China’s digital economy worth nearly $5.4T in 2020",
  "link": "https://www.app.com.pk/national/chinas-digital-economy-worth-nearly-5-4t-in-2020/",
  "date_published": "2021-08-03T17:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): China’s digital economy was worth nearly $5.4 trillion last year, ranking second in the world, that represented a year-on-year growth of 9.6 percent, the fastest in the world, Economic Information Daily report said.\nThe result was announced at the 2021 Global Digital Economy Conference, which is underway in Beijing, and co-hosted by the Beijing municipal government, the National Development and Reform Commission, the Ministry of Industry and Information Technology, the Ministry of Commerce, and the Cyberspace Administration of China.\nAccording to the global digital economy white paper released by the China Academy of Information and Communications Technology at the conference, last year, the value added for the digital economy reached $32.6 trillion in 47 nations, with a nominal growth rate of 3 percent on a yearly basis, China daily reported.\nAt the conference, more policy signals were released to further speed up the development of the digital economy, including R&D breakthroughs and iterative applications in high-end chips and key basic software, green smart data and computing facility layouts, and promoting digital transformation in the manufacturing sector.\nIn the wake of the fragile global economic recovery, the digital economy has become a key to realizing economic recovery and promoting sustainable development, as well as a new driver to boost high-quality development, said Zhuang Rongwen, director of the Cyberspace Administration of China.\nDeveloping the digital economy has enormous significance, said Xiao Yaqing, minister of Industry and Information Technology. Next, the country will strengthen efforts to tackle key problems in core technologies, strengthen areas of weakness and build an independent, controllable, safe and reliable information technology system.\nThe government will put more efforts into advancing digital transformation in the manufacturing sector, and also promote implementation of the “5G plus industrial internet” innovation development project and smart manufacturing project, Xiao said.\nDigital technologies should better empower small, medium and large enterprises to fully support industrial upgrading, Xiao said, adding that an open, fair and nondiscriminatory development environment should be built up for the digital economy.\nLocal governments are also actively planning a new round of measures to speed up the construction of a highland for the digital economy. According to a document published by the government of the Beijing municipality, after continual efforts over about 10 years, Beijing aims to become a leader in city digital smart transformation, global data deployment hubs, emerging digital industry incubators, global digital technology innovation, digital governance in China and digital economy opening-up.\nThe country should build new, quality and reliable bases for the digital economy, promote the popularization of information infrastructure, and explore new and innovative space for the digital economy, said Yu Xiaohui, vice president of the China Academy of Information and Communications Technology.",
  "retrievedAt": "2025-08-11T21:02:00.520Z"
}
