{
  "title": "Rule of law, justice shape societies: PM",
  "link": "https://www.app.com.pk/national/rule-of-law-justice-shape-societies-pm/",
  "date_published": "2021-08-03T15:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): Prime Minister Imran Khan Tuesday said that societies were shaped by rule of law with prevalent moral values and ethics, whereas justice was the criterion which ‘differentiated between a civilized society and a banana republic’.\nAddressing a book launching ceremony of analyst, writer and researcher Ikram Sehgal titled ‘A personal chronicle of Pakistan’, the prime minister said that a society rose when governed by equal sets of law for the privileged and the poor classes.\n“The human society is shaped by rule of law,” he said, adding contrary to it, the past ruling elite in Pakistan had plundered the country.\nHe said (in apparent reference to former rulers Sharif and Zardari) two corrupt families did the grave injustice with the country as they made the corruption acceptable to society.\nThe prime minister terming his constant struggle against corruption and injustices as ‘Jihad’ said that they were creating awareness among the masses about ‘the biggest cancer’.\nHe said in the developed countries, the society fought these evils on its own and the corrupt elements were ostracized.\nHe said that he came to politics to fight and wage struggle against social evils.\nQuoting Molana Romi, the prime minister said a society’s downfall started when its morality was collapsed, followed by financial and economic downfall.\nThe prime minister referring to his cricket experience said there were two types of players in game, the one who played for himself and the other who thought of the whole team. The former always earned esteem and respect.\nSimilarly, those leaders who thought of individual gains and personal interests were never respected by nations, while those working for the country always respected, he said, adding Quaid e Azam always worked and thought for a nation.\nNelson Mandela was adorned by his people because he forgave all his adversaries, he added.\nHe further said the idealists achieved success in life due to high aims and positive thinking whereas a pessimist lagged behind. He also cited example of Edmund Hillary, a New Zealand mountaineer, and the first climber to reach summit of the Mount Everest.\nThe prime minister said Pakistan was blessed with huge potential and natural resources with twelve different climatic zones, and huge untapped tourism prospects.\nHe said Switzerland, a country half of the size of Northern Areas of Pakistan, was earning $80 billion annually from mountain tourism.\nHe regretted that past leadership of the country never thought of the country as they spent their vacations abroad, established businesses and preferred to shop outside the country. They had Swiss accounts and Mayfair flats like properties, the prime minister said in veiled reference to the convicted PPP and PML-N leadership.\nThe prime minister said that UN report had unearthed that about $1000 billion were being laundered from the poor countries annually by their ruling and privileged classes, adversely  impacting the financial conditions of their respective countrymen.\nHe said all the poor countries had the same identical stories which were ruled by corrupt elite.\nReferring to recent unrest in South Africa, he said when the authorities tried to move against former president Jacob Zuma for his corruption, he incited people to come on the roads to evade accountability. Similarly, the privileged class in Pakistan that looted the country, hurled threats to dislodge his government, he added.\nThe prime minister sharing his long acquaintance with Ikram Sehgal, commended his efforts for writing books and raising different social issues. He said his writing reflected his patriotism and his concerns for the country’s issues.\nIkram Sehgal, speaking on the occasion, said that purpose of writing 12-vloume book was to make the people aware of the history of Pakistan.\nLauding the leadership of Imran Khan, he said that integrity and sincerity were the hallmarks of a true leadership.\nHe expressed the confidence that the prime minister would steer the country out of different challenges.",
  "retrievedAt": "2025-08-11T21:02:02.641Z"
}
