{
  "title": "Breast cancer can be checked through timely diagnostic: Begum Alvi",
  "link": "https://www.app.com.pk/national/breast-cancer-can-be-checked-through-timely-diagnostic-begum-alvi/",
  "date_published": "2021-08-03T17:05:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 03 (APP): First Lady Begum Samina Alvi on Tuesday said as breast cancer could be checked through timely diagnosis, women instead of ignoring the symptoms should seriously focus on diagnosis and treatment of the disease.\nThe government, after consultation with all stakeholders, was taking measures for awareness about breast cancer, she added.\nBegum Samina Alvi was speaking at a breast cancer awareness event held here at Sardar Bahadur Khan University.\nShe said that since the differently-abled persons were very close to her heart, she in coordination with the government institutions was striving for the provision of education and health facilities for them.\nBegum Alvi said she has been actively working for the welfare and betterment of women she had also taken various steps for their education and health, adding, the main objective behind these activities was to make the women self-reliant and  enable them to their role in the country’s socio-economic progress.\nMember Provincial Assembly and Parliamentary Secretary for Information Bushra Rind, Parliamentary Secretary for Women Development and Law Mahjabeen Sheeran and Vice Chancellor Sardar Bahadur Khan University Quetta Dr. Sajida Naureen were also present on the occasion.\nBegum Alvi said that as half of the country’s population comprised of women, no nation in the world could achieve progress by leaving half population aside.\nDepriving over 100 million of women from the basic facilities of education and health and was also not possible, she said.\nBegum Samina Alvi further said the provision of equal rights and opportunities to the women were also vital for making Pakistan a true Islamic welfare state.\nAbout depriving the women from their inheritance rights through various excuses, she said that passage of the Enforcement of Women’s Property Rights Act will help protect the women’s inheritance rights.\nBegum Ali also called for an awareness drive to ensure the implementation of 2% job quota of differently abled persons in various government departments.\nShe also called for ensuring the construction of ramps at various public and private building to facilitate the differently abled persons.",
  "retrievedAt": "2025-08-11T21:02:00.542Z"
}
