{
  "title": "WB poised to support PM Imran Khan’s clean and green Pakistan initiatives",
  "link": "https://www.app.com.pk/national/wb-poised-to-support-pm-imran-khans-clean-and-green-pakistan-initiatives/",
  "date_published": "2021-08-03T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 03 (APP): Regional Vice President of the World Bank Group for South Asian Region, Hartwig Schafer Tuesday called on Special Assistant to the Prime Minister on Climate Change Malik Amin Aslam.\nBoth the sides agreed to jointly work to boost Pakistan’s climate resilience against devastating impacts of climate change including floods, heatwaves and achieve environmental sustainability by increasing investment in green and clean energy sectors and enhancing the country’s technical know-how and capacity of the concerned sectors related to food, water, agriculture, forestry, clean and renewable energy sectors, according to a news release issued here.\nThe PM’s aide shared details of Prime Minister Imran Khan’s various clean and green initiatives including 10 Billion Tree Tsunami, Recharge Pakistan, Green Stimulus, Protected Areas Initiatives, Electric vehicle policy, Ecosystem Restoration Initiative and Innovative Financing based on performance relating to Nature Based Solutions being implemented by the climate change ministry.\nHartwig Schafer praised the PM’s initiatives and vision for Green and environmentally-sustainable and climate-resilient Pakistan.\nThe World Bank official also informed the PM’s aide that the International Development Association (IDA) was the part of the World Bank that helped the world’s poorest countries and the future IDA window of the WB will have 30% development finance linked to climate change co-benefits.\nHe also mentioned that the programmatic portfolio of the WB would not only have investment component but also budgetary support linked to policy-based actions relating to climate change.\nHe added that future development funding to all countries has to be filtered through the climate change lens and the World Bank Board had decided to link future development finance with climate performance.\nHe also praised the pro-climate policies of the Imran Khan government and offered full WB support for furthering the climate change agenda in Pakistan over the next decade.\nThe WB official suggested that IDA window offered a great opportunity for Pakistan to benefit from it for financially and technically supporting the clean and green initiatives of Pakistan.\nMeanwhile, Malik Amin Aslam thanked for the offer to benefit from the WB’s IDA financing window and vowed to utilize all available efforts to mop up funding from the IDA window to further support the PM’s clean and green Pakistan initiatives.",
  "retrievedAt": "2025-08-11T21:02:00.910Z"
}
