{
  "title": "COVID-19 national tally of active cases show continuous surge",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-of-active-cases-show-continuous-surge/",
  "date_published": "2021-08-03T09:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 3 (APP): The national tally of total active COVID-19 cases was recorded as 75,373 on Tuesday with 3,582 more people tested positive for the deadly virus and 1,355 people recovered from the disease during the last 24 hours.\nSixty-seven (67) corona patients have died during past 24 hours, 64 of whom were under treatment in the hospitals and three of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Punjab. Out of the total 67 deaths occurred, 35 of them died were under treatment on ventilators.\nThere were 3,398 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 7.19 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 38%, Lahore 21%, Peshawar 28% and Karachi 17%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Karachi 57%, Abbottabad 53%, Islamabad 35% and Peshawar 31%.\nAround 325 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan.\nSome 49,798 tests were conducted across the country on Monday, including 13,107 in Sindh, 19,752 in Punjab, 9,116 in Khyber Pakhtunkhwa (KP), 3,492 in Islamabad Capital Territory (ICT), 2,825 in Balochistan, 936 in GB, and 570 in AJK.\nAround 944,375 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,043,277 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 25,034, Balochistan 30,627, GB 8,318, ICT 88,344, KP 145,306, Punjab 358,387 and Sindh 387,261.\nAbout 23,529 deaths were recorded in country since the eruption of the contagion. Around 6,057 people perished in Sindh, 36 of them died in the hospitals on Monday.\n11,083 people died in Punjab died with 16 deaths occurred in past 24 hours. 13 individuals died in the hospitals and three out of the hospitals.\nAs many as 4,477 people expired in KP, nine of them died in hospitals on Monday, 804 individuals died in ICT, one death occurred in the past 24 hours in the hospital, 328 people died in Balochistan, 147 infected people perished in GB and 633 people in AJK died, five of them succumbed to the deadly virus in the hospitals on Monday.\nA total of 16,158,330 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 3,838 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:02:09.098Z"
}
