{
  "title": "Mobile wallet and digital banking customers may face disruptions as new SBP regulations take effect",
  "author": null,
  "content": "Citizens who have not yet completed biometric verification for their digital bank accounts and wallets may face service disruptions from October 25 as new regulations introduced by the State Bank of Pakistan (SBP) in July take effect.\n\nThe regulations, introduced through BPRD Circular No.1 of 2025, had mandated streamlining of account opening and customer onboarding processes by all institutions under the SBP’s regulatory ambit, including Banks, DFIs, MFBs, Digital Banks, and EMIs. As per the circular, issued on July 25, all SBP-regulated entities (REs) need to “streamline the account opening/customer onboarding process and improve the customer experience”.\n\nOne of the new requirements introduced was that biometric verification of the account or wallet operator should be made the primary verification method for all accounts and digital wallets. The prevailing system had allowed operators to take up to 60 days to complete biometric verification before a debit block was imposed on their account.\n\nWith the new regulations going into effect starting October 25, industry sources expressed fears that potentially tens of millions of account-holders who have not completed biometric verification could lose the ability to operate them. They also expressed concerns that the regulations may prevent individuals operating foreign currency accounts from sending or receiving remittances.\n\nFinancial institutions were given three months to comply with the requirements, which are part of customer due diligence and onboarding-related requirements under the SBP’s Anti Money Laundering/Countering Financing of Terrorism/Counter Proliferation Financing Regulations.\n\nThe scope and applicability of the SBP’s regulations pertaining to digital accounts and wallets had been expanded in the ‘Consolidated Customer Onboarding Framework’ introduced in July, and the change now “covers both in-branch and remote onboarding, and is applicable for opening accounts/wallets for Individuals and Entities (legal persons/arrangements), including Local Currency and Foreign Currency accounts, and explicitly mentioning Roshan Digital Accounts” and applies to all “SBP Regulated Entities (REs), including Banks, DFIs, MFBs, Digital Banks, and EMIs”.\n\nThe new framework also requires a “consolidated approach”, regardless of whether the onboarding process was performed in-branch or remotely. In the earlier framework, released in 2022, use of NADRA Verisys was allowed for verification at the time of account opening, while biometric verification was to be completed within 60 days.\n\nHowever, under the 2025 framework, biometric verification will be the primary method for “customers with CNIC/NICOP/POC/ARC/POR cards prior to establishment of the relationship/opening of the account/wallet”.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/242034417eb6cd4.webp",
  "retrievedAt": "2025-10-25T22:52:50.097Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950985/mobile-wallet-and-digital-banking-customers-may-face-disruptions-as-new-sbp-regulations-take-effect",
  "dateList": "2025-10-26",
  "date_published": "2025-10-24T15:35:52.000Z"
}
