{
  "title": "Tomatoes being sold at more than double the official rate in Rawalpindi",
  "author": "Aamir Yasin",
  "content": "RAWALPINDI: Tomato prices have surged in local markets, selling at Rs370–400 per kilogram, as traders attribute the hike to floods in Punjab and the closure of the Pakistan-Afghanistan border.\n\nThey, however, expect the situation to improve with supplies arriving from Swat and Sindh in the coming days.\n\n“Although the rate of tomatoes has dropped slightly from Rs600 to Rs370–400 per kg, it is still unaffordable for the common man as it is a daily-use item,” said Rawalpindi Fruit and Vegetable Market Association President Ghulam Qadir Mir while speaking to Dawn.\n\nExplaining the reasons behind the price hike, he said that floods during the monsoon season, the closure of the Pakistan-Afghanistan border, and the government’s negligence in bridging the demand-supply gap were the main factors.\n\nHe added that most of the tomato supply usually comes from Central Asia and Afghanistan, but border tensions had disrupted the trade. Meanwhile, local supplies from Punjab were also affected due to floods.\n\n“Iranian tomatoes reached the market, but in limited quantities. Over the last two days, some supplies from Swat and Sindh have arrived, and we hope that the demand-supply gap will narrow, stabilising prices by next week,” he said.\n\nMr Mir urged the government to take immediate measures to import tomatoes to stabilise prices.\n\nA senior official of the Punjab Agriculture Department said that tomato shortages typically begin in the winter season.\n\nHowever, the Punjab government had launched a project last year to grow tomatoes in the off-season in some parts of the province.\n\nHe added that the devastating floods destroyed many of these areas, but farmers were expected to resume cultivation soon.\n\nMeanwhile, the district administration has failed to enforce the official price list issued by the District Market Committee, as food items are being sold at inflated rates across the garrison city.\n\nPrice magistrates and other concerned departments appear helpless in implementing the directives.\n\nAccording to market data, tomatoes are being sold at Rs370–400 per kg against the official price of Rs180 per kg. Ginger is available at Rs600 per kg (official rate Rs520), garlic at Rs380 per kg (official rate Rs350), potatoes at Rs90 per kg (official rate Rs78), onions at Rs95 per kg (official rate Rs88), eggs at Rs350 per dozen (official rate Rs333), and chicken at Rs350 per kg (official rate Rs313).\n\nResidents of Rawalpindi have expressed anger over the unchecked price hike, particularly of tomatoes.\n\n“The shopkeepers are charging excessively, and no one stops them. Who can afford to buy tomatoes at Rs370–400 per kg? Most people have stopped buying them,” said Niaz Ahmed, a resident of Mohanpura.\n\nMuhammad Ayaz, a resident of Gawalmandi, said that the district administration had completely failed to control food prices. “People are struggling to buy sugar, wheat, meat, vegetables, and lentils,” he said.\n\nHe lamented that the common man’s income has not increased for years, while prices of essential commodities have multiplied. “There’s no one in the government to control this inflation,” he said.\n\nAbrar Ahmed, a resident of Dhoke Khabba, said that managing a household budget has become nearly impossible. “With limited income, we can’t bear the inflation anymore. I now work two jobs just to make ends meet,” he said.\n\nShopkeepers, however, defended themselves, saying they too were affected by high wholesale rates. “We purchase goods at higher prices from the wholesale market, so it’s impossible to sell them cheaply,” one shopkeeper said.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68fd25d0a8af5.gif",
  "retrievedAt": "2025-10-26T10:25:23.927Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951203/tomatoes-being-sold-at-more-than-double-the-official-rate-in-rawalpindi",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:57:10.000Z"
}
