{
  "title": "US, China reach rare earths, tariff pause for Trump and Xi to consider: US officials",
  "author": "Reuters",
  "content": "Top Chinese and US economic officials on Sunday hashed out the framework of a trade deal for US President Donald Trump and Chinese President Xi Jinping to decide on later this week that would pause steeper American tariffs and Chinese rare earths export controls, US officials said.\n\nUS Treasury Secretary Scott Bessent said the talks on the sidelines of the ASEAN Summit in Kuala Lumpur had eliminated the threat of Trump’s 100 per cent tariffs on Chinese imports starting November 1. Bessent said he expects China to delay implementation of its rare earth minerals and magnets licensing regime by a year while the policy is reconsidered.\n\nChinese officials were more circumspect about the talks and offered no details about the outcome of the meetings.\n\nTrump and Xi are due to meet on Thursday on the sidelines of the Asia Pacific Economic Cooperation (APEC) summit in Gyeongju, South Korea to sign off on the terms. While the White House has officially announced the highly anticipated Trump-Xi talks, China has yet to confirm that the two leaders will meet.\n\n“I think we have a very successful framework for the leaders to discuss on Thursday,” Bessent told reporters after he and US Trade Representative Jamieson Greer met with Chinese Vice Premier He Lifeng and top trade negotiator Li Chenggang for a fifth round of in-person discussions since May.\n\nBessent said he anticipates that a tariff truce with China will be extended beyond its November 10 expiration date, and that China will revive substantial purchases of US soybeans after buying none in September in favour of soybeans from Brazil and Argentina.\n\nUS soybean farmers “will feel very good about what’s going on both for this season and the coming seasons for several years” once the deal’s terms are announced, Bessent told the ABC programme ‘This Week’.\n\nGreer told the ‘Fox News Sunday’ programme that both sides agreed to pause some punitive actions and found “a path forward where we can have more access to rare earths from China, we can try to balance out our trade deficit with sales from the United States”.\n\nChina’s Li Chenggang said the two sides reached a “preliminary consensus” and will next go through their respective internal approval processes.\n\n“The US position has been tough,” Li said. “We have experienced very intense consultations and engaged in constructive exchanges in exploring solutions and arrangements to address these concerns.”\n\nTrump arrived in Malaysia on Sunday for a summit of the Association of Southeast Asian Nations, his first stop in a five-day Asia tour that is expected to culminate in a face-to-face with Xi in South Korea on Thursday.\n\nAfter the talks, Trump struck a positive tone, saying: “I think we’re going to have a deal with China”.\n\nTrump threatened new 100pc tariffs on Chinese goods and other trade curbs starting on November 1, in retaliation for China’s expanded export controls on rare earth magnets and minerals.\n\nChina and the United States rolled back most of their triple-digit tariffs on each other’s goods under a trade truce due to expire on November 10.\n\nThe US and Chinese officials said that in addition to rare earths, they discussed trade expansion, the US fentanyl crisis, US port entrance fees and the transfer of TikTok to US ownership control.\n\nBessent told NBC’s “Meet the Press” programme that the two sides have to iron out details of the TikTok deal, allowing Trump and Xi to “consummate the transaction” in South Korea.\n\nOn the sidelines of the ASEAN Summit, Trump hinted at possible meetings with Xi in China and the United States.\n\n“We’ve agreed to meet. We’re going to meet them later in China, and we’re going to meet in the US, in either Washington or at Mar-a-Lago,” Trump said.\n\nAmong Trump’s talking points with Xi are Chinese purchases of US soybeans, concerns around democratically governed Taiwan, which China views as its own territory, and the release of jailed Hong Kong media tycoon Jimmy Lai.\n\nThe detention of the founder of the now-defunct pro-democracy newspaper Apple Daily has become the most high-profile example of China’s crackdown on rights in Hong Kong.\n\nTrump also said that he will seek China’s help in US dealings with Moscow, as Russia’s war in Ukraine grinds on.\n\nTensions between the world’s two largest economies flared in the past few weeks as a delicate trade truce, reached after a first round of trade talks in Geneva in May and extended in August, failed to prevent the United States and China from hitting each other with more sanctions, export curbs and threats of stronger retaliatory measures.\n\nChina’s expanded controls of rare earths exports have caused a global shortage. That has prompted the United States to consider a block on software-powered exports to China, from laptops to jet engines, according to a Reuters report.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26234647beb0001.webp",
  "retrievedAt": "2025-10-26T22:42:30.917Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951386/us-china-reach-rare-earths-tariff-pause-for-trump-and-xi-to-consider-us-officials",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T18:47:29.000Z"
}
