{
  "title": "Three armed men killed in Quetta encounter identified as ‘kidnappers’, say police",
  "author": "Abdullah Zehri",
  "content": "Three armed men shot dead in a police encounter on the outskirts of Quetta were identified as members of a kidnapping gang, police said on Sunday, adding that weapons and a vehicle used in the abductions were recovered from the scene.\n\nThe incident occurred on Saturday in Quetta’s Killi Khali area, within the jurisdiction of the Brewery Police Station, where the suspects were killed during a shootout with police.\n\nSenior Superintendent of Police (SSP) Serious Crimes Investigation Wing, Imran Qureshi, told Dawn.com that after identifying the men killed in yesterday’s encounter, an investigation was launched, which revealed that all three were involved in kidnappings.\n\n“Two accomplices of the kidnappers managed to escape during the exchange of fire, while a police constable sustained injuries,” SSP Qureshi said.\n\n“Two of the slain suspects were identified as Nawab Ali and Ahmed Sultan, while efforts are underway with the help of NADRA (National Database and Registration Authority) to find out the identity of the third suspect.”\n\nAccording to the SSP, Police records and investigations showed that the suspects killed were wanted in several abduction cases by Quetta police and were part of a ransom-for-kidnapping gang.\n\nQureshi said the group had kidnapped Abdul Razzaq, the driver of the Gwadar University vice chancellor, releasing him after receiving Rs1.6 million in ransom. He added that Bashir Ahmed, a trader from Qila Abdullah, was freed after paying Rs8m, while Quetta resident Irfan Baig was released following a Rs10m ransom payment.\n\n“The slain suspects were wanted in two cases registered at the Sadar Police Station, three at Jinnah Town Police Station, and one at Industrial Police Station.\n\n“The Serious Crimes Investigation Wing is conducting further investigations into the case,” the SSP added.\n\nKidnapping for ransom in Balochistan remains a serious security challenge amid the broader insurgency and weak law-enforcement reach. In January, seven people, including an 11-year-old, were kidnapped from a picnic spot in the province, with Chief Minister Sarfraz Bugti confirming that the victims were believed to have been taken for ransom and that efforts were underway to recover them.\n\nIn July, another incident occurred in the Sardhaka area, where passengers were abducted, prompting a large-scale rescue operation by provincial authorities.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26131737894db64.webp",
  "retrievedAt": "2025-10-26T10:24:05.018Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951351/three-armed-men-killed-in-quetta-encounter-identified-as-kidnappers-say-police",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T09:05:44.000Z"
}
