{
  "title": "Manslaughter FIR lodged against seven policemen over death in custody",
  "author": "Imtiaz Ali",
  "content": "KARACHI: A manslaughter case was registered against seven policemen, and two of them were arrested on Saturday for their alleged involvement in the custodial death of a young man.\n\nMuhammad Irfan died in the custody of the Special Investigation Unit (SIU) after he, along with his three friends, was picked up from the Federal B Area on Oct 22. The cause of death is yet to be ascertained by doctors, but police claimed that he died of a heart attack.\n\nAdvertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\nWhile the case was registered on behalf of the state, the victim’s relatives on Saturday took his coffin and staged a sit-in outside the Edhi morgue in Sohrab Goth, demanding that the FIR be registered on their complaint.\n\nTheir protest caused one of the worst traffic jams on Shahrah-i-Pakistan, as long queues of vehicles were seen trapped in traffic on the track leading to Sohrab Goth.\n\nFamily’s protest outside Edhi morgue in Sohrab Goth causes traffic mess on Shahrah-i-Pakistan for hours\n\nA traffic police spokesperson in a statement said that movement of traffic from the Edhi Centre in Sohrab Goth towards Shafiq Mor on Rashid Minhas Road was stopped due to the protest.\n\nTraffic coming from Gulshan-i-Iqbal was being diverted to Shahrah-i-Pakistan from under the bridge, while vehicles coming from Water Pump were being diverted towards Al-Asif Square.\n\nMeanwhile, the Saddar police registered the case under Sections 319 (manslaughter)  and 34 (common intention) of the Pakistan Penal Code against nominated  SIU officers on behalf of the state through Inspector  Mumtaz Ahmed.\n\nSouth DIG Syed Asad Raza told Dawn that the SIU police had handed over the custody of two suspects nominated in the FIR — ASI Abid Shah and Constable Asif Ali — who had been arrested.\n\n“If need be, we shall convert the case to 302 [premeditated murder] and arrest more SIU officials if they were found involved,” the DIG added.\n\nHe also confirmed that “preliminary post-mortem report [of the victim, Irfan] establishes torture”.\n\nFamily’s protest. Meanwhile, a large number of relatives and community members staged a sit-in outside the Edhi morgue, carrying the coffin of Irfan, whose body was kept at the morgue.\n\nThey blocked the main road. A senior journalist and one of the protesters, Shahid Jatoi, told Dawn that they were protesting because the case had been registered on the complaint of the “killers”.\n\nHe said when the relatives had held a protest at the same venue on Friday night, police authorities had promised them that an FIR would be registered on the complaint of the heirs of the victim.\n\nSubsequently, Mr Jatoi added, the relatives visited the SIU/CIA centre on Friday night to lodge an FIR, but the police had already registered a case on behalf of the state.\n\nThey were informed that since an FIR had been registered, a second FIR could not be registered for the same offence.\n\nHe said that since the three other people, who had been detained along with Irfan, had been released and cleared of any wrongdoing, they believed that the victim and the others were “innocent”, but they had been tortured in the police custody, leading to the death of the young boy.\n\nThe protesters urged the chief minister of Sindh and the IG of police to provide them justice.\n\nMeanwhile, a traffic police spokesperson in a statement said that movement of traffic from the Edhi Centre in Sohrab Goth towards Shafiq Mor on Rashid Minhas Road was stopped due to the protest.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/261237528341e81.webp",
  "retrievedAt": "2025-10-26T10:25:23.145Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951251/manslaughter-fir-lodged-against-seven-policemen-over-death-in-custody",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:56:57.000Z"
}
