{
  "title": "Indian man arrested over alleged inappropriate conduct towards Australian women cricketers in Madhya Pradesh",
  "author": "AFP | Reuters",
  "content": "Indian police have arrested a man accused of stalking and inappropriately touching two Australian cricketers participating in the ICC Women’s World Cup in Madhya Pradesh, officials said on Saturday.\n\nThe incident happened in the central Indian city of Indore on Thursday morning when the two players left their hotel to go to a cafe, a day after Australia’s six-wicket victory over England in the group stage of the World Cup, when they were allegedly approached by a motorcyclist.\n\n“The security officers of the women’s Australian cricket team filed a complaint that two members of the team faced inappropriate behaviour,” additional deputy commissioner of police, Rajesh Dandotiya, told Indian news agency ANI.\n\n“A FIR (first information report) was registered, and the accused was identified and arrested following an intensive strategic operation.”\n\nHe has been charged under sections 74 and 78 of the criminal code that deal with assault or using criminal force against a woman with the intent to outrage her modesty and stalking, respectively. “We are examining if there were any shortfalls in the security protocols,” Dandotiya added.\n\nViolence against women remains a chronic issue in the world’s most populous country, where an average of nearly 90 rapes a day were reported in 2022.\n\nDandotiya said the 30-year-old man who was arrested has a criminal record.\n\nThe two players were not identified by Indian police or Cricket Australia, which confirmed the incident.\n\n“The matter was reported by team security to police, who are handling the matter,” Cricket Australia said in a statement.\n\nBoard of Control for Cricket in India Secretary Devajit Saikia said it was a “deeply regrettable and isolated incident.\n\n“We appreciate the swift and effective action taken by the Madhya Pradesh Police in apprehending the accused. The law will take its due course to ensure justice is served,” Saikia said.\n\n“We will also review our existing safety protocols and strengthen them further, if necessary, to ensure such incidents are not repeated.”\n\nThe Times of India newspaper reported that the team’s security manager received a distress message from one of the cricketers that said “… there is a guy following us trying to grab us”.\n\nTeam officials were informed and went to their location to assist the players, the paper said.\n\nA police patrol then escorted the players safely back to the team’s hotel.\n\nIndia has made strides towards gender equality and women’s empowerment in recent years but safety for women remains a serious concern.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/25172343ea02fee.webp",
  "retrievedAt": "2025-10-26T11:29:04.755Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951181/indian-man-arrested-over-alleged-inappropriate-conduct-towards-australian-women-cricketers-in-madhya-pradesh",
  "dateList": "2025-10-26",
  "date_published": "2025-10-25T11:59:27.000Z"
}
