{
  "title": "PMDC has resolved lingering out-of-syllabus questions issue: minister",
  "author": "Ikram Junaidi",
  "content": "ISLAMABAD: For years, the Medical and Dental Colleges Admission Test (MDCAT) has been marred by controversies over out-of-syllabus questions.\n\nOn Wednesday, Federal Health Minister Mustafa Kamal claimed that the Pakistan Medical and Dental Council (PMDC) had finally resolved the issue once and for all.\n\nHowever, he warned that universities, which have received over 80 per cent of the MDCAT fee, would be held responsible for any paper leak in the test, where 140,129 candidates will compete for 22,000 seats in medical and dental colleges.\n\nSpeaking at a press conference at the PMDC, the minister urged provincial authorities and universities to conduct a free, fair and transparent MDCAT on October 26.\n\nThe test will be held nationwide at 32 venues, including one international centre in Riyadh, Saudi Arabia.\n\nThe minister announced that the PMDC had achieved a major milestone by developing a uniform national syllabus and an item bank for the MDCAT, containing over 6,000 standardised questions. The syllabus was prepared in consultation with vice chancellors and other stakeholders across the country.\n\n“Universities have prepared tests from the national item bank to their full satisfaction. Provinces will be responsible if the MDCAT paper is leaked. I urge the media to help raise public awareness about the exam,” he said.\n\nMr Kamal praised PMDC President Prof Dr Rizwan Taj for creating the item bank.\n\nHe emphasised that if any university failed to ensure the smooth and transparent conduct of the MDCAT, or if any paper leakage, deviation from the approved syllabus, or breach of transparency occurred, the concerned university would be held fully responsible for the lapse.\n\nHe also stated that 50 per cent of the total allocated amount had already been released to universities to facilitate the smooth conduct of the examination. However, in case of any irregularity or misconduct, the remaining 50 per cent payment would be withheld.\n\nIt is worth mentioning that each student has paid Rs9,000 as the test fee, of which Rs7,500 will be paid to universities while Rs1,500 will be retained by PMDC as an administrative cost.\n\nAccording to the PMDC, the MDCAT score will carry at least 50 per cent weightage for admission to public and private medical colleges, will be valid nationwide, and will remain valid for three years. Universities must conduct pre-hoc and post-hoc analyses to ensure that no incorrect or out-of-syllabus questions appear in the exam.\n\nAll participating universities have been instructed to make comprehensive arrangements for MDCAT 2025, including the provision of suitable examination centres with proper seating, ventilation, temperature control, and drinking water.\n\nOther requirements include the installation of jammers to block electronic devices, walk-through gates at entry and exit points, deployment of security personnel, appointment of trained staff for invigilation, and secure printing and transfer of confidential question papers.\n\nUniversities have also been directed to arrange parent waiting areas, student verification counters, and other facilities to ensure a smooth and secure examination experience.\n\nThe test will be conducted through the University of Health Sciences, Lahore; Sukkur IBA University; Khyber Medical University, Peshawar; Bolan University of Medical and Health Sciences, Quetta; and Shaheed Zulfiqar Ali Bhutto Medical University, Islamabad.\n\nMeanwhile, Islamabad police on Wednesday dispersed protesting medical students through a baton charge.\n\nThe students had gathered outside the PMDC building, demanding that the passing marks for admission to medical and dental colleges be reduced from 65 per cent to 50 per cent.\n\nThey also claimed that the PMDC had directed colleges to ensure student attendance of at least 85 per cent and demanded that the requirement be reduced to 78 per cent.\n\nLater, Nazim Islami Jamiat-i-Talaba Punjab, Ahmed Abdullah, addressed a press conference outside the PMDC, urging the council to address students’ concerns. He criticised the Council’s “unwillingness” to resolve the issue.\n\n“Police arrested some students, but they were released following our intervention. We are giving a 10-day ultimatum to the PMDC to address the issue. Otherwise, we will hold another protest along with students,” he warned.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68f946a2aabf6.jpg",
  "retrievedAt": "2025-10-25T22:52:30.036Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950638/pmdc-has-resolved-lingering-out-of-syllabus-questions-issue-minister",
  "dateList": "2025-10-26",
  "date_published": "2025-10-23T01:58:27.000Z"
}
