{
  "title": "Journalist Matiullah Jan to be indicted in drug, terrorism case on Oct 31",
  "author": "Malik Asad",
  "content": "ISLAMABAD: The trial of senior journalist Matiullah Jan in an alleged drug smuggling and terrorism case is likely to begin by October 31, as the court has decided to indict him on that date in the narcotics case.\n\nThe Anti-Terrorism Court (ATC), presided over by Judge Tahir Abbas Sipra, handed over all case documents to Mr Jan on Friday.\n\nThe case, registered at Margalla Police Station on November 28 last year, accuses the journalist of snatching a government-issued rifle, hitting a vehicle at a police barrier and possessing narcotics.\n\nAccording to the FIR, Mr Jan’s car was stopped at a checkpoint in Sector E-9, where he allegedly resisted arrest, rammed his vehicle into a police barrier and snatched a rifle before being subdued.\n\nThe FIR invokes Section 9(2)4 of the Control of Narcotic Substances Act (CNSA) for possessing 100 to 500 grams of crystal meth and Section 7 of the Anti-Terrorism Act (ATA) for acts of terrorism.\n\nMr Jan’s trial has drawn strong criticism from journalist bodies and rights groups, who allege that he is being targeted for investigating reports of alleged deaths during law enforcement action against Pakistan Tehreek-i-Insaf (PTI) protesters.\n\nThe journalist was arrested on November 26, 2024, and initially remanded in police custody by ATC Judge Tahir Abbas Sipra. However, the Islamabad High Court (IHC) later overturned that decision and sent him to judicial custody.\n\nHis defence counsel, Advocates Imaan Mazari-Hazir and Hadi Ali Chatha, subsequently secured post-arrest bail from the same court.\n\nMeanwhile, Matiullah Jan wrote a letter to the Inspector General of Islamabad Police, alleging abduction and torture prior to his arrest.\n\nIn the letter, Jan stated that on November 27, 2024, he and fellow journalist Saqib Bashir were abducted from the Pims Hospital parking area by men in police uniforms, blindfolded and taken to an unknown location where they were tortured and illegally detained.\n\nHe claimed that police later registered a bogus FIR at Margalla Police Station, accusing him of terrorism and drug smuggling.\n\nJan said his colleague’s sworn affidavit before the Anti-Terrorism Court confirmed their abduction.\n\nRecalling his 2020 abduction, Jan said such acts violated his constitutional and professional rights, as well as the Protection of Journalists and Media Professionals Act, 2021.\n\nHe urged the IG to appoint an honest and independent officer to investigate the case on merit.\n\nSeparately, the prosecution submitted a 35-page supplementary challan to the court in the controversial tweet case against Imaan Mazari and Hadi Ali Chatha, who also represent Mr Jan in the ATC proceedings.\n\nThe challan was presented before Additional District and Sessions Judge Muhammad Afzal Majoka by Prosecutor Muhammad Usman Rana.\n\nIt includes notifications regarding bans on the Tehreek-i-Taliban Pakistan (TTP), Balochistan Liberation Army (BLA) and Pashtun Tahafuz Movement (PTM) and references several figures, including Mahrang Baloch, Manzoor Pashteen and Ali Wazir.\n\nDuring the hearing, both accused refused to accept the supplementary challan. Advocate Hadi Chatha objected that the prosecution had earlier indicated it would record witnesses’ statements rather than submit new evidence.\n\nJudge Majoka observed that the defence was neither accepting the challan nor presenting counsel, asking, “How will the case move forward?”\n\nThe defence requested additional time for legal preparation, after which the court adjourned the hearing until October 25.\n\nPublished in Dawn, October 25th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/250948415f4d7ee.webp",
  "retrievedAt": "2025-10-26T11:29:35.968Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951053/journalist-matiullah-jan-to-be-indicted-in-drug-terrorism-case-on-oct-31",
  "dateList": "2025-10-26",
  "date_published": "2025-10-25T00:00:10.000Z"
}
