{
  "title": "Netanyahu says Israel will decide which foreign troops acceptable to secure Gaza ceasefire",
  "author": "Reuters",
  "content": "Prime Minister Benjamin Netanyahu said on Sunday Israel would determine which foreign forces it would allow as part of a planned international force in Gaza to help secure a fragile ceasefire under US President Donald Trump’s plan.\n\nIt remains unclear whether Arab and other states will be ready to commit troops, in part given the refusal of Hamas to disarm as called for by the plan, while Israel has voiced concerns about the make-up of the force.\n\nWhile the Trump administration has ruled out sending US soldiers into the Gaza Strip, it has been speaking to Indonesia, the United Arab Emirates, Egypt, Qatar, Turkey and Azerbaijan to contribute to the multinational force.\n\n“We are in control of our security, and we have also made it clear regarding international forces that Israel will determine which forces are unacceptable to us, and this is how we operate and will continue to operate,” Netanyahu said.\n\n“This is, of course, acceptable to the United States as well, as its most senior representatives have expressed in recent days,” he told a session of his cabinet.\n\nIsrael, which carried out a genocide in Gaza for two years, continues to control all access to the territory.\n\nLast week Netanyahu hinted that he would be opposed to any role for Turkish security forces in Gaza.\n\nOnce-warm Turkish-Israeli relations soured drastically during the Israeli onslaught in Gaza, with Turkish President Tayyip Erdogan lambasting Israel’s devastating air and ground campaign in the small Palestinian enclave.\n\nUS Secretary of State Marco Rubio, on a visit to Israel aimed at shoring up the truce, said on Friday the international force would have to be made up of “countries that Israel’s comfortable with”. He made no comment on Turkish involvement.\n\nRubio added that Gaza’s future governance still needed to be worked out among Israel and partner nations but could not include Hamas.\n\nRubio later said US officials were receiving input on a possible UN resolution or international agreement to authorise the multinational force in Gaza and would discuss the issue in Qatar, a key Gulf mediator on Gaza, on Sunday.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26220715769de01.webp",
  "retrievedAt": "2025-10-26T22:42:35.831Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951387/netanyahu-says-israel-will-decide-which-foreign-troops-acceptable-to-secure-gaza-ceasefire",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T17:07:56.000Z"
}
