{
  "title": "CDA introduces one-window directorate to promote digital transactions",
  "author": "Ikram Junaidi",
  "content": "ISLAMABAD: While the Federal Board of Revenue (FBR) has been encouraging digital transactions, the Capital Development Authority (CDA) has taken a step toward making Islamabad a cashless model city by introducing its cashless One-Window Directorate.\n\nCDA Chairman and Chief Commissioner of Islamabad, Mohammad Ali Randhawa, inaugurated the cashless system at the One-Window Facilitation Centre.\n\nThe event was attended by Member Finance Tahir Naeem, Member Environment Esfandyar Baloch, the DG Building Control, directors of One-Window and the Estate wing, along with CEO Finnect Shah Nawaz Mahmood, representative of Bank Alfalah Faraz Yar Khan and representatives from other commercial banks, financial institutions and consumers.\n\nSpeaking on the occasion, Mr Randhawa said the initiative had been launched in line with the vision of Prime Minister Shehbaz Sharif and Federal Minister for Interior Mohsin Naqvi, keeping in view the facilities for citizens.\n\nObjective of initiative is to make Islamabad Pakistan’s first cashless model city, says chairman\n\n“The purpose of this initiative is to make Islamabad Pakistan’s first cashless model city.”\n\nOfficials gave a briefing about the procedures for the cashless and digital transactions and details of the functional QR code system connected through various digital platforms, including Easy Paisa and Jazz Cash.\n\nThe CDA chairman carried out a digital transaction to review the effectiveness of the system.\n\nHe said the initiative will not only help adopt an e-governance model but will also provide the citizens with easy, fast and most transparent digital payment facilities.\n\n“This step will also promote a cashless economy in the capital. Direct QR codes have already been introduced under the cashless system in the weekly bazaars. Similarly, the cashless system is being rapidly introduced in all Markaz, shopping centres, wholesale and retail markets of the city in a phased manner,” he said.\n\n“Our aim is to safeguard citizens from fraud and deception in all kinds of financial transactions through the safe, cashless and digital system.”\n\nMr Randhawa said very soon all services in Islamabad will be provided under one roof through the “Assan Khidmat Markaz.” He claimed that public dealings for the provision of services at the “Assan Khidmat Markaz” will be more professional and corporate in manner.\n\nHe said in the cashless system, customers and citizens will have an open choice regarding which bank or financial institution they associate with to carry out their transactions digitally. Furthermore, citizens will also have the facility of e-chalan.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26123405dfd4f20.webp",
  "retrievedAt": "2025-10-26T10:24:54.648Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951200/cda-introduces-one-window-directorate-to-promote-digital-transactions",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:57:10.000Z"
}
