{
  "title": "PM Shehbaz to lead high-level delegation to Riyadh from Oct 27 to 29 for investment talks",
  "author": "Abdullah Momand",
  "content": "Prime Minister Shehbaz Sharif will travel to Riyadh from 27 to 29 October to attend the Ninth Future Investment Initiative (FII9), leading a high-level delegation to explore avenues for strengthening economic and investment cooperation with Saudi Arabia, the Foreign Office (FO) said in a statement.\n\nThe FII9 will convene global leaders, investors, policymakers, and innovators to explore the theme, “The Key to Prosperity: Unlocking New Frontiers of Growth”. Thematic discussions will address global challenges and opportunities, focusing on key topics such as innovation, sustainability, economic inclusion, and geopolitical shifts.\n\n“At the invitation of His Royal Highness Crown Prince and Prime Minister Mohammed bin Salman, Prime Minister Muhammad Shehbaz Sharif will lead a high-level delegation, including Deputy Prime Minister/Foreign Minister Senator Mohammad Ishaq Dar, as well as senior Cabinet Ministers — to Riyadh from 27 to 29 October 2025 to participate in the Ninth Edition of the Future Investment Initiative (FII9),” the FO statement said.\n\n“During his stay, the prime minister will engage with the Saudi leadership to explore avenues for enhanced cooperation in the trade, investment, energy, and human resource sectors. The discussions will also cover regional and global issues of mutual interest and concern.”\n\nIt added that on the sidelines of FII9, PM Shehbaz will also interact with leaders from other participating countries and heads of international organisations.\n\n“These exchanges will highlight Pakistan’s investment potential and its readiness to pursue collaborations in sustainable development, in line with the ‘Think, Exchange, and Act’ model.”\n\nAccording to the FO, the visit will underscore Pakistan’s commitment to advancing economic diplomacy and fostering strategic partnerships in investment, technology, and sustainable development.\n\nIslamabad and Riyadh have long shared a multifaceted relationship rooted in strategic military cooperation, mutual economic interests, and shared Islamic heritage. These ties have encompassed economic assistance and energy supplies, with Riyadh being a significant source of financial aid and oil for Islamabad.\n\nLast month, the two countries signed a defence agreement, pledging that any attack on either nation would be treated as an act of aggression against both.\n\nIn 2024, they signed 34 memoranda of understanding (MoUs) worth $2.8 billion, following an earlier deal of 27 MoUs valued at $2.2bn.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2612175230ed16c.webp",
  "retrievedAt": "2025-10-26T10:24:17.835Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951344/pm-shehbaz-to-lead-high-level-delegation-to-riyadh-from-oct-27-to-29-for-investment-talks",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T07:21:56.000Z"
}
