{
  "title": "Medical entrance exam across country today",
  "author": "Ikram Junaidi",
  "content": "ISLAMABAD: More than 140,000 candidates are competing for 22,000 seats in medical and dental colleges today (Sunday) as the mandatory Medical and Dental Colleges Admission Test (MDCAT) is being conducted nationwide at 32 venues, including an international centre in Riyadh, Saudi Arabia.\n\nSeveral institutions are organising the test, including the Uni­ver­sity of Health Sciences in Lahore, Suk­kur IBA University, Khyber Medical Uni­versity in Peshawar, Bolan Uni­versity of Medical and Health Scie­nces in Quetta, and Shaheed Zulfi­qar Ali Bhutto Medical University in Islamabad.\n\nPakistan Medical and Dental Council (PMDC) President Dr Rizwan Taj said that all participating universities had assured him that the necessary arrangements for the test have been made.\n\n“All universities conducting the MDCAT were advised to thoroughly review and implement all required arrangements to ensure the fair, tr­­a­­­nsparent, and secure conduct of the examination,” Mr Taj said. He added that security measures in­­­­­c­l­u­­de the installation of jammers to blo­­­ck unauthorised electronic devices.\n\nOver 140,000 hopefuls compete for 22,000 spots\n\n“Examination venues will be eq­­u­ipped with proper seating arra­ngements and adequate facilities to ac­­commodate all candidates co­­mfortably,” he said.\n\n“Furthermore, universities are instructed to make ap­­­propriate arrangements for heating or cooling of the examination halls according to weather conditions and to ensure that drinking water is readily available to all candidates,” he added.\n\nTo ensure transparency and proper record-keeping, specific protocols have been established for the exam materials.\n\n“Universities shall provide bubble sheets with carbon copies to the candidates and must ensure complete secrecy and confidentiality of all question papers,” Mr Taj stated.\n\n“Question papers shall be ope­n­­ed only in the presence of witnesses to maintain transparency. After the conclusion of the examination, all bubble sheets must be collected promptly and kept in a safe and secured location”, he added\n\nHe also mentioned that the original examination papers of the MDCAT would be retained by the respective universities for a minimum period of 12 months from the date of the result declaration.\n\nMr Taj emphasised a swift and tra­­nsparent process for releasing results. The official answer key will be uploaded to university websites immediately after the exam, with full results expected within one week.\n\nMr Taj said that a comprehensive post-hoc analysis report had to be prepared and submitted within 10 days of the announcement of the final results. He further mentioned that universities were required to provide a facility for the re-checking of marks within three days following the announcement of the results.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26083246c8c53d5.webp",
  "retrievedAt": "2025-10-26T10:26:33.062Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951290/medical-entrance-exam-across-country-today",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:56:33.000Z"
}
