{
  "title": "Adiala jail superintendent directed to implement earlier IHC order allowing Imran twice-a-week meetings",
  "author": "Tahir Naseer | Dawn.com",
  "content": "The Islamabad High Court on Thursday directed the Adiala jail superintendent to implement a March 24 order that reinstated the twice-a-week meeting schedule for former prime minister Imran Khan.\n\nThe directive came as a larger bench, led by Justice Muhammad Sarfraz Dogar and including Justices Arbab Muhammad Tahir and Muhammad Azam Khan, collectively took up all 11 petitions filed by PTI leaders regarding Imran’s jail visitation. The ex-premier’s family and party have repeatedly accused prison authorities of “sabotaging” meetings with him.\n\nToday, the IHC directed Adiala jail’s Superintendent Abdul Ghafoor Anjum, who was present during the hearing, to allow Imran’s jail meetings, as per the earlier order, while abiding by standard operating procedures (SOPs).Advertisements\n\n\n\n            Video Player is loading.Play VideoPlayLoaded: 0%Remaining Time -0:00MuteFullscreenThis is a modal window.Beginning of dialog window. Escape will cancel and close the window.TextColorWhiteBlackRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentBackgroundColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyOpaqueSemi-TransparentTransparentWindowColorBlackWhiteRedGreenBlueYellowMagentaCyanTransparencyTransparentSemi-TransparentOpaqueFont Size50%75%100%125%150%175%200%300%400%Text Edge StyleNoneRaisedDepressedUniformDropshadowFont FamilyProportional Sans-SerifMonospace Sans-SerifProportional SerifMonospace SerifCasualScriptSmall CapsReset restore all settings to the default valuesDoneClose Modal DialogEnd of dialog window.Advertisement\n\n\n\n\n\n\n\n\n\n                X\n\nThis is a modal window.\n\nBeginning of dialog window. Escape will cancel and close the window.\n\nEnd of dialog window.\n\nIt directed the jail official to facilitate the meetings as per the lists provided by PTI Secretary General Salman Akram Raja, who also attended the proceedings.\n\nRaja and Anjum traded barbs during the hearing as the PTI leader claimed that “not even once” was the earlier IHC order implemented despite them giving a list of names, while the jail official asserted that “regular meetings” were held, but no list was received.\n\nPetitions taken up by the bench included those filed by newly elected Khyber Pakh­tunkhwa Chief Minister Sohail Afridi, who attended the IHC hearing. Shortly after it concluded, Afridi departed for Adiala jail but later claimed he was denied a meeting with Imran.\n\nThe PTI later posted a video on its X account of Afridi speaking to the media outside the Adiala jail. Afridi said on the occasion that he would be seeking policy guidelines from Imran during their meeting.\n\n“Nothing else is going to take place inside. I have to implement my leader’s policies in Khyber Pakhtunkhwa. He might give me some good advice inside […] There is nothing wrong with us wanting to meet our leader,” he added.\n\nA subsequent post reshared by the PTI’s account showed Afridi, along with several others, sitting on the ground. The post stated that they were not being allowed to meet Imran despite court directives.\n\n“A symbolic sit-in is under way,” it said.\n\nAccording to a statement later issued by the KP CM Secretariat, “Despite the court’s explicit permission, the chief minister was not allowed to meet his party leader (Imran).”\n\nSpeaking to media persons outside the Adiala jail, CM Afridi said that the refusal to implement a clear court order reflected not his weakness, but the “helplessness of the judiciary” itself.\n\n“If court orders are not being respected, it raises serious questions about the state of justice in the country,” he was quoted as saying.\n\nThe chief minister stressed that his visit was “purely Constitutional and aimed at seeking guidance from his party leader on key policy matters related to governance” in KP, the statement added.\n\n“For the past two years, I have not met my leader. Yesterday’s meeting was important for taking policy direction and moving forward in line with the vision of Imran Khan,” Afridi said.\n\nThe PTI leader asserted that he had followed every legal and administrative channel — including communications with the Punjab Home Department, the federal government, and the chief justice — before approaching the Islamabad High Court.\n\n“Whatever instructions come from Imran Khan, I will implement them in letter and spirit,” CM Afridi asserted. “No cabinet will be formed without the guidance of Imran Khan,” he affirmed.\n\nPunjab Advocate General (AG) Amjad Pervaiz and Islamabad AG Ayaz Shaukat appeared before the court today and presented their arguments on their separate appeals challenging the striking down of the bar on prisoners’ political talks.\n\nAt one point during the hearing, PTI’s Raja attempted to present his contentions but was stopped by Justice Dogar. The IHC chief justice told the lawyer to let the Punjab government counsel complete his arguments first.\n\nRaja said he wanted to assist the court, at which Justice Dogar said the former’s assistance was not needed.\n\nHere, Pervaiz referred to the 1992 Aftab Ahmad Khan Sherpao case, adding that it was held that a notice under Order 27A of the Code of Civil Procedure.\n\nJustice Tahir then asked Raja if he wanted to say something, at which the PTI lawyer said he wanted to assist the court.\n\nAfter Pervaiz completed his arguments, a representative from the attorney general’s office informed the court that he was supporting Pervaiz’s stance. In his arguments, Islamabad AG Shaukat said he had raised objections, but they were “dismissed”.\n\nAt this point, Raja claimed that the March IHC order had not been implemented  “on even one day”. “We give a list of names [for the meeting] repeatedly as per the court order, but those people are not allowed inside [the jail],” he said.\n\nHe went on to allege, “An outsider is added to the names given in the list.”\n\nAnjum, the jail superintendent, then asserted that the PTI leaders “regularly” have meetings with Imran. He further said that the jail administration received no list from Raja.\n\n“The court restricted them from speaking to the media after meeting [Imran, but] they speak to the media after coming outside [the jail],” Anjum said.\n\nIn response, Raja quipped, “The court said not to speak to the media at the [jail] gate; it did not say to tape our mouths.\n\n“We are kept a mile away from the Adiala jail, where we speak [to the media],” he added.\n\nSubsequently, the court ordered the Adiala jail superintendent to implement the March 24 order that allows Imran to have two meetings per week with visitors, while placing restrictions on the latter’s media interactions.\n\nThe bench observed that while the PTI leaders were not barred from holding a media talk, they should not speak at the jail’s gate, but rather in a “chamber” or somewhere else later. Raja assured the court that they would not speak at the prison’s gate.\n\nAmong the petitions taken up today were intra-court appeals (ICAs) against the October 2024 order by IHC’s Justice Sardar Ejaz Ishaq Khan that nullified a ban on political discussions during prisoners’ meetings with visitors.\n\nJustice Ishaq had issued the ruling on a plea filed by former PTI leader Sher Afzal Marwat. The subsequent ICAs were filed by the Islamabad chief commissioner and the Punjab government, and were taken up by a division bench in November 2024, according to APP.\n\nThe IHC then suspended the single-bench order that had ended the ban on political discussions.\n\nAs the Punjab AG began his arguments, his Islamabad counterpart informed the court that he had earlier objected that the Punjab and Islamabad AGs had not been issued notices in the case.\n\nJustice Tahir wondered whether it was mandatory to issue a notice to the AG as well, along with the attorney general. Pervaiz cited past Supreme Court orders in response, contending that following the said procedure was necessary.\n\nResponding to a question by Justice Tahir, the Punjab AG replied that the jail rules had been in place since 1984, with no amendments made since then.\n\nOn Justice Dogar’s directives, the Punjab AG read out his writ petition. Justice Tahir asked the counsel whether notices were issued to the attorney general, to which the Islamabad AG replied that neither the attorney general nor the advocate general was notified.\n\nPervaiz stated that even the Punjab government had not been made a party in the petition, but was made later on through a notice to its AG. “The Punjab government was not made a respondent in a proper manner.”\n\nAt this point, Justice Tahir then sought reasons for the single-member bench declaring the rules regarding political conversations illegal. Pervaiz responded that the decision was made based on various grounds, including contradictions with Article 19 (freedom of expression) of the Constitution.\n\nAccording to Rule 265 (letters and interviews) of the Pakistan Prison Rules 1978, the “discussion of political matters shall not be allowed” during a prisoner’s meeting, and letters also “shall not contain any reference” to politics.\n\nDuring his incarceration so far, Imran has written multiple letters to the chief justices of Pakistan, as well as three “open letters” addressed to the army chief. The ex-premier had also purportedly authored an essay published by The Economist in January 2024, just a month before the general elections.\n\nWhen the Punjab AG cited past rulings to argue that issuing notices to the relevant attorney general was necessary for striking down a law, Justice Dogar observed that the laws Pervaiz was referring to were for under-trial suspects.\n\n“The suspended rules were not even the federal rules,” Pervaiz said, adding that the laws fell within the Punjab government’s jurisdiction after the 18th Amendment.\n\nAt one point during the hearing, Rawalpindi police also made an appearance to have Imran’s sister Aleema Khanum sign a non-bailable arrest warrant issued for her in a case pertaining to the PTI’s November 26 protest.\n\nAfter City Police Deputy Superintendent of Police (DSP) Azhar Shah received Aleema’s signature on her arrest warrant, the police departed without arresting her. Yesterday, a Rawalpindi anti-terrorism court issued show-cause notices to two police of­­ficers for submitting a “fabricated” report claiming that Aleema had gone into hiding.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/231550247fb512e.webp",
  "retrievedAt": "2025-10-25T22:53:25.503Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950777/adiala-jail-superintendent-directed-to-implement-earlier-ihc-order-allowing-imran-twice-a-week-meetings",
  "dateList": "2025-10-26",
  "date_published": "2025-10-23T10:26:15.000Z"
}
