{
  "title": "PAA notifies short-term changes to flight routes in Karachi, Lahore regions due to ‘operational reasons’",
  "author": "Imtiaz Ali | Dawn.com",
  "content": "The Pakistan Airports Authority (PAA) on Saturday announced changes in certain routes for the Karachi and Lahore flight regions for the upcoming week to ensure “continued safety and effective management of air traffic”.\n\n“​The restrictions are effective from Tuesday, October 28, 2025, at 5:01am Pakistan Standard Time (PKT) and will remain in place until Wednesday, October 29, 2025, at 9am PKT,” said a NOTAM (notice to airmen) issued by the PAA today.\n​\n“This is a routine operational safety matter. The measure is being implemented for ‘operational reasons’ to ensure the continued safety and effective management of air traffic.”\n\nIn a separate development, open source tracker Damien Symon, also quoted by Reuters in earlier news reports, said Indian aviation authorities issued a NOTAM a day earlier “possibly for a military exercise/weapons test as India prepares for its Tri-Services Exercise across the border”.\n\nThe open source tracker stated that India had also issued a NOTAM for a tri-services exercise along its western border with Pakistan from October 30 to November 10, saying the “chosen area and scale of activity are unusual”.\n\nA map he shared showed that the exercise area extends from around the Indian city of Jaisalmer in Rajasthan to the disputed Sir Creek marsh area.\n\nThe creek area has been a point of contention for decades between the two nuclear-armed neighbours, and talks on the maritime boundary dispute have remained inconclusive thus far.\n\nIndian news outlet Firstpost also reported that NOTAM was for a “large-scale tri-services exercise” along the Pakistan border “amid rising tensions following Operation Sindoor”.\n\nIt added that the exercise will involve the three branches of the Indian military and is aimed at demonstrating the country’s “growing joint operational capabilities, self-reliance and innovation”.\n\nIt quoted the Indian defence ministry as saying that “troops from Southern Command will actively participate to validate joint operations across diverse and challenging terrains, including offensive manoeuvres in the creek and desert sectors, amphibious operations off the Saurashtra coast, and joint multi-domain operational exercises encompassing Intelligence, Surveillance and Reconnaissance (ISR), Electronic Warfare (EW), and Cyber capabilities.“\n\nCNBC-TV18 reported that as per officials, the exercise underscores India’s commitment to enhancing interoperability among its armed forces while “strengthening preparedness for future combat scenarios”.\n\nFirstpost reported that Indian Defence Minister Rajnath Singh had visited soldiers in Jaisalmer, Rajasthan, on Thursday and claimed Operation Sindoor had “sent a strong warning to Pakistan, which would now ‘think twice before attempting any misadventure against India’”.\n\nIndia Today reported that he had also visited the Bhuj Military Station in Gujarat the same day and warned Pakistan against any action in the disputed Sir Creek area.\n\n“If Pakistan dares to act in the Sir Creek sector, the reply will be so strong that it will change both history and geography,” the outlet quoted him as saying.\n\nSeparately, a press release from the Pakistan Navy said Chief of the Naval Staff Admiral Naveed Ashraf visited forward posts in the creek areas to review operational preparedness and combat readiness.\n\nThe naval chief said sea lines of communication (SLOCs) and maritime security were not just a military requirement but a “cornerstone” of the nation’s sovereignty and a “vital pillar” of economic prosperity and stability.\n\nHe emphasised that the navy PN was the “vanguard of peace and stability” in the Indian Ocean and a “significant stakeholder” in regional maritime security.\n\n“We know how to defend our sovereignty and every inch of our maritime frontiers from Sir Creek to Jiwani,” he added.\n\nHe also reaffirmed to the nation that the navy’s defence capabilities stood “as strong as our unwavering morale, from the shores to the sea”.\n\nDuring the visit, three state-of-the-art 2400 TD Hovercraft were also inducted into the Pak Marines, marking a “significant stride” in modernising the navy’s operational capabilities.\n\n“The newly inducted hovercraft are capable of simultaneously operating over a variety of surfaces, including shallow waters, sand dunes, marshy and boggy littoral zones, and can ply in areas where traditional craft are neither suitable nor designed to operate. This unique capability of undertaking simultaneous operations over land and sea provides an edge to Pak Marines in the performance of their assigned tasks. It will also strengthen PN’s capabilities for an effective and decisive response against all adversaries.\n\n“While addressing officers and men on the occasion, naval chief highlighted that the induction of these new platforms symbolizes PN’s vision to modernise and reaffirm unwavering resolve in bolstering defence of the country’s maritime frontiers, coastal belt particularly the creeks area.”\n\nEarlier in the week, United States President Donald Trump stated that he and Indian Prime Minister Narendra Modi had a phone call where they talked about having “no wars with Pakistan”.\n\nThe US president has repeatedly claimed credit for ending the conflict between Pakistan and India earlier this year in May. India has denied the claim that the US president was responsible for brokering the ceasefire via trade threats. Meanwhile, Prime Minister Shehbaz Sharif has praised Trump for his “leadership and proactive role” in helping the two neighbours achieve peace in the region.\n\nTensions between India and Pakistan escalated sharply in early May 2025 after an attack in Indian-occupied Kashmir’s Pahalgam prompted New Delhi to launch “Operation Sindoor” on May 7, targeting sites inside Pakistan and causing civilian casualties.\n\nIndia blamed Pakistan without presenting evidence, further inflaming hostilities between the two nuclear-armed neighbours. Pakistan later launched a retaliatory “Operation Bunyanum Marsoos”, leading to heavy artillery and drone exchanges before a US-led push helped broker a ceasefire.\n\nSince then, Indian political and military leadership, including chiefs of the military branches, have continued to make aggressive statements, repeating terrorism allegations that Pakistan has repeatedly refuted and also warning of “geographical changes” in the course of any future conflict.\n\nSingh had also said on May 30 that India would use the firepower of its navy in response to any future aggression by Pakistan, Reuters reported.\n\nThe Pakistani military has dismissed the statements as India attempting to “mould history to its liking by inventing outlandish, Bollywood-style scripts” in the aftermath of the May conflict while also issuing warnings of its own that any “imaginary new normal” the Indian leadership might be entertaining about bilateral dynamics would be met with a “new normal of swift retributive response”.\n\n“In the face of highly provocative statements of the Indian defence minister and its army and air chiefs, we caution that a future conflict might lead to cataclysmic devastation. In case a fresh round of hostilities is triggered, Pakistan shall not hold back. We shall resolutely respond, without any qualms or restraint,“ the military had said earlier in October.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/25201309ee8b79e.webp",
  "retrievedAt": "2025-10-26T11:29:19.745Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951183/paa-notifies-short-term-changes-to-flight-routes-in-karachi-lahore-regions-due-to-operational-reasons",
  "dateList": "2025-10-26",
  "date_published": "2025-10-25T15:11:31.000Z"
}
