{
  "title": "10 legislators join PPP, significantly increasing likelihood of the party installing its premier in AJK",
  "author": "Tariq Naqash",
  "content": "With developments gaining momentum on the political front in Azad Jammu and Kashmir (AJK), ten legislators — all elected on PTI tickets in the July 2021 general elections — announced on Sunday that they were joining the PPP, which has been eyeing the premier’s slot in the region.\n\nPPP lawmakers from AJK had also met party Chairman Bilawal Bhutto-Zardari and President Asif Ali Zardari yesterday to mull options for the removal of the incumbent PM Chaudhry Anwarul Haq.\n\nToday’s development has made the PPP the single largest party in the AJK Legislative Assembly.\n\nIn the 53-member assembly, the PPP now enjoys the support of 27 members, followed by the PML-N with nine, PTI with five, and two regional parties with one member each. The group of PTI renegades led by Haq has been reduced to ten members.\n\nThis has significantly increased the likelihood of the PPP becoming the ruling party.\n\n“Yes, we are now in a comfortable position to send the incumbent Prime Minister Chaudhry Anwarul Haq packing and replace him with a new leader of the house from our ranks,” PPP lawmaker Chaudhry Qasim Majeed told Dawn.com by telephone.\n\nHe confirmed that by Sunday evening, ten PTI legislators had joined the PPP in joint and separate meetings with Faryal Talpur at the Zardari House in Islamabad.\n\nAmong them were five lawmakers from the camp of AJK President Barrister Sultan Mahmood — including his son Yasir Sultan, brother-in-law Chaudhry Arshad, Chaudhry Akhlaque from the Mirpur division, Chaudhry Muhammad Rasheed from the Muzaffarabad division, and Sardar Muhammad Hussain from the Poonch division.\n\nAccording to senior PPP leader Azhar Iqbal Baralvi, Sabiha Siddique, a female member of the president’s camp, did not immediately join the party due to reservations over the possible nomination of Haq’s successor.\n\nLater, Zafar Iqbal Malik from Kotli also joined the PPP separately. Following in their footsteps, Abdul Majid Khan, Chaudhry Akbar Ibrahim, and Asim Sharif Butt from the refugee constituencies, as well as Sardar Faheem Rabbani from Poonch division, met Talpur jointly to announce their inclusion in the PPP.\n\nAll ten of these legislators are part of Haq’s cabinet. Among them, only the three refugee legislators had earlier announced their resignations from the cabinet, though no official notification regarding their resignation had been issued.\n\nPPP’s regional president Chaudhry Muhammad Yasin was not present at any of these meetings with Talpur.\n\nMajeed said the PPP parliamentary party held two meetings on Saturday — the first with Bilawal Bhutto-Zardari, where it was unanimously decided to oust Mr Haq. Later, the team met with President Asif Ali Zardari to inform him of their decision.\n\nMajeed claimed that more legislators were likely to join the PPP within the next two to three days.\n\nMeanwhile, the PML-N has announced that it will sit on the opposition benches.\n\n“We will not be part of the government formation process and will sit on the opposition benches,” said party’s regional president Shah Ghulam Qadir.\n\nMajeed also confirmed that President Zardari and Prime Minister Shehbaz Sharif were in contact regarding the ongoing political developments.\n\nHowever, he said he was unaware of who would succeed Haq as the prime minister. “This decision rests with President Zardari and the party chairman,” he added.\n\nSeparately, Chaudhry Azhar Sadiq, Works and Communications Minister and a close confidant of PM Haq, said the prime minister had no plans to dissolve the assembly.\n\n“Although the Constitution empowers him to do so, he will not take that step,” he told Dawn.com. “He [Haq] has consistently maintained that if his opponents gather 27 lawmakers, he will step down. If they have the required numbers, they can move the no-confidence motion — we will face it.”\n\nHowever, Sadiq added, “There are many a slip between the cup and the lip.”\n\nAll PPP members were scheduled to gather at the Sindh House in Islamabad on Sunday night to demonstrate their strength.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/262146317a85f6c.webp",
  "retrievedAt": "2025-10-26T22:42:34.319Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951385/10-legislators-join-ppp-significantly-increasing-likelihood-of-the-party-installing-its-premier-in-ajk",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T16:32:01.000Z"
}
