{
  "title": "Strong economic data fails to lift stock market in choppy week",
  "author": "Muhammad Kashif",
  "content": "KARACHI: The Pakistan Stock Exchange (PSX) showed little movement in the outgoing week, closing marginally lower despite strong macroeconomic data and easing geopolitical tensions.\n\nThe index declined by 502 points or 0.31 per cent week-on-week to 163,304.13, primarily due to profit-taking by investors and selling pressure, particularly from mutual funds, which were rumoured to be redeeming positions. This trend was reflected in the National Clearing Company’s data.\n\nWhile overall market sentiment was subdued, macroeconomic indicators, such as a current account surplus and a slight increase in foreign direct investment (FDI), provided some stability. Despite these developments, the market’s mixed sentiment highlights the challenges investors face amid fluctuating earnings and uncertain global economic conditions.\n\nIn September, Pakistan’s current account posted a surplus of $110 million, a notable improvement from the $52m deficit recorded in the same month last year. On a year-on-year basis, the country’s FDI increased slightly to $186m in September, compared to $175m in August. However, for the first quarter of FY26, net FDI inflows dropped by 34pc to $569m, compared to $865m during the same period last year.\n\nIndex stagnates on profit-taking, mutual fund redemptions\n\nThe market’s mixed sentiment was also reflected in the average daily trading volume, which decreased to 1.5bn shares, and the average daily traded value, which stood at Rs49.6bn. This represented a decline in market participation from the previous week.\n\nMacroeconomic data released during the week was relatively positive, with IT exports for September reaching a record high of $366m, up 25pc year-on-year. Power generation in September also showed a modest year-on-year increase of 0.8pc to 12,592 GWh, though it fell short of the reference target of 13,300 GWh. The cost of power generation dropped by 15pc year-on-year to Rs7.09 per kWh, driven by lower oil prices.\n\nThe country’s foreign exchange reserves also rose slightly, by $14m week-on-week to $14.45bn, providing some support to the local currency. The rupee remained stable against the US dollar, closing at Rs281.02, unchanged from the previous week.\n\nLooking ahead, analysts expect the KSE-100 index to remain volatile, with investor attention shifting to the upcoming Monetary Policy Committee meeting on Monday, where a decision on interest rates is anticipated. With select stocks continuing to report quarterly results, market sentiment may be influenced by earnings performance. Moreover, any updates regarding the International Monetary Fund’s (IMF) Executive Board approval could further impact investor confidence.\n\nDespite the recent dip, the KSE-100 remains attractively priced, trading at a price-to-earnings ratio (PER) of 8.58x, close to its 15-year average of 8.59x. The market offers a dividend yield of approximately 5.5pc, slightly below its historical average of 6.11pc. This, coupled with the lack of attractive alternative investment options, makes equities an appealing choice for some investors, particularly given the uncertain global economic outlook.\n\nMarket sentiment in the coming week is likely to be shaped by the progress of Pakistan’s negotiations with the IMF and the potential for foreign portfolio and direct investment flows. Analysts at AKD Securities suggest the market may remain resilient, especially if the IMF’s second review is successfully concluded and the country’s credit ratings improve.\n\nThe attractiveness of local equities is further bolstered by their current valuation, with the KSE-100 trading at a multiple of 7.4x and offering a dividend yield of 6.6pc. However, the market’s recovery will largely depend on the global economic environment and local corporate earnings.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2608462161b408b.webp",
  "retrievedAt": "2025-10-26T10:25:57.978Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951273/strong-economic-data-fails-to-lift-stock-market-in-choppy-week",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:56:40.000Z"
}
