{
  "title": "Unfinished blight",
  "author": "Editorial",
  "content": "ON World Polio Day, Pakistan finds itself teetering between progress and peril. Although this year’s tally of 30 cases so far is less than half of last year’s 74, the persistence of transmission shows how fragile these gains remain. While more than 200 countries and territories have eradicated polio, Pakistan remains among the last two where it still cripples children — a distinction no country should bear with pride.\n\nThe latest case, a 12-month-old boy from KP’s Torghar, brings the province’s total to 19, followed by nine in Sindh and one each in Punjab and Gilgit-Baltistan. Sewage surveillance in September found the virus in 44 of 127 samples — proof that, despite improving trends, it still circulates in high-risk zones.\n\nThe virus’ persistence is not due to a lack of effort. Last week’s national vaccination campaign was aimed at reaching more than 45m children. Yet the attacks on those performing this national duty remind us that the challenge is not merely medical.\n\nIn recent weeks, a security officer escorting a vaccination team in Swat was gunned down, another in Nowshera met the same fate, and a guard in Balochistan was killed protecting vaccinators. Each death underscores the peril in which Pakistan’s front-line health workers operate — and the limits of state protection for them.\n\nThe country’s approach, though vast in scale, still struggles with three persistent gaps. First, uneven coverage — especially in the aftermath of the floods — leaves pockets of unvaccinated children where the virus survives. Second, vaccine hesitancy continues to fester in certain communities. Third, an over-securitised model of vaccination that, while necessary, often intimidates those it seeks to reassure.\n\nPakistan has the infrastructure, campaigns and partners — domestic and international — to eradicate polio. But the final mile will need less bulk-mobilisation and more precision, trust and community ownership. Pakistan must recommit to three priority goals: reach every child — no exceptions, change minds as well as deliver drops, and integrate security with access and trust. For this, the aim must be zero missed children in every district and union council. Surveillance must translate into targeted action where the virus still shows up. It will not die unless it is deprived of hosts entirely.\n\nThe polio programme must also invest in community engagement. Campaigns must be co-produced with Lady Health Workers, local imams, teachers, and village elders. They must make the vaccination drive their own mission — safeguarding the neighbourhood’s children. Furthermore, building relationships with communities must be prioritised so that the presence of health workers is welcomed rather than feared.\n\nThe last mile will not be crossed in policy meetings but at the doorstep — where a vaccinator knocks in Torghar, where a register is marked in Sindh, and where a mother finally says yes.\n\nPublished in Dawn, October 24th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://www.dawn.com/_img/social-default.jpg",
  "retrievedAt": "2025-10-25T22:52:56.815Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950914/unfinished-blight",
  "dateList": "2025-10-26",
  "date_published": "2025-10-24T02:19:16.000Z"
}
