{
  "title": "Reform by bullet",
  "author": "Aiyan Tariq Bhutta",
  "content": "IN Pakistan, reform often arrives in the form of a new acronym. Every few years, a fresh department or authority is launched with a shiny name and a promise to fix what the last one could not. When the police fails, we create a new unit. When accountability falters, we build a new bureau. When governance collapses, we pass yet another law. It is the same old wine in a new bottle, only with a different label. The newly minted Crime Control Department (CCD) of Punjab is just the latest example of our refusal to fix what is broken and our obsession with simply renaming it.\n\nWhen the CCD was formed earlier this year, it was sold as a bold initiative to dismantle the mafias and gangs operating in the province. For a public long disillusioned with impunity, it sounded refreshing. But a few months in, the CCD’s operations already look alarmingly familiar.\n\nThe recent killing of Teefi Butt is not an isolated event. It is part of a pattern. Encounters have become the defining feature of this department’s policing style, where suspects are killed while allegedly trying to flee or resisting arrest. In some cases, the state’s response has gone even further, with reports of accused persons in sexual violence cases being shot in the genitals which are later reported as accidents. These are not acts of justice. They are acts of vengeance carried out under the state’s seal.\n\nAccording to the Human Rights Commission of Pakistan, more than 670 people have been killed in over 500 alleged encounters in Punjab since January 2025, many under the CCD’s watch. In its statement of Oct 13, the HRCP warned that these killings are being used as a substitute for the criminal justice system and that the CCD is fast becoming a parallel police force with sweeping, unchecked powers.\n\nWhen the state kills outside the law, it weakens its own legitimacy.\n\nThe Constitution promises every citizen the right to life and a fair trial, yet the CCD seemingly operates as if these guarantees are optional. Once the state begins to decide who deserves due process and who does not, law turns from a shield into a weapon.\n\nAs a lawyer, I understand the frustrations that drive this mindset. Our justice system is painfully slow and ineffective. Investigations are weak, prosecutions are half-hearted and trials drag on for years. But when the state abandons law in order to appear decisive, it does not restore order. It legalises chaos.\n\nThe CCD reflects a recurring national impulse to create new institutions instead of reforming the old. We have done it countless times. NAB was formed with lofty promises to end corruption and restore integrity, yet it became another tool for political engineering. The problem has never been the name on the building. It has always been the mindset within it.\n\nThe chief minister’s recent praise of the CCD as a step towards a ‘zero-crime’ Punjab might please her audience, but it rests on an illusion. No society on earth achieves zero crime. Mature nations aim for zero impunity. Crime does not vanish because the police kill faster. It fades only when citizens believe the law will protect them and punish those who violate it.\n\nWe’ve seen this story before. In the 1990s, Punjab’s police was given free rein to deal with dacoits and gangsters. For a time, encounter killings were celebrated as courage. Police competence was measured by the number of bodies they produced as some ‘encounter specialists’ became household names. But those powers soon turned political. Rivals were eliminated, innocent people were caught in the crossfire, and the line between justice and revenge blurred beyond re­­pair. Once a force learns that it can kill without consequence, it rarely stops at the guilty.\n\nThe real issue in Pakistan has never been a shortage of power. It is the ab­­s­ence of restraint. Our police laws re­­main outdated, training neglected, and institutions politicised beyond recognition. The Police Order of 2002 once promised merit-based appointments and independent oversight, yet successive governments have been unwilling to tolerate autonomy in a force they prefer to control for their narrow political interests.\n\nThe HRCP’s warnings cannot be brushed aside. Every time the state kills outside the law, it chips away at its own legitimacy. Each uninvestigated encounter sends a message that might is right, that law is a suggestion, and that some lives are too cheap to protect. This is not order. It is surrender. Pakistan does not need more departments and acronyms. It needs the courage to reform the ones it already has. True reform is not about new names and new buildings. It is about rebuilding trust, enforcing accountability and learning restraint. Fear can make people obey, but only justice makes them believe.\n\nThe writer is an advocate of the Supreme Court.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68f98a7e03243.jpg",
  "retrievedAt": "2025-10-25T22:52:33.333Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950712/reform-by-bullet",
  "dateList": "2025-10-26",
  "date_published": "2025-10-23T01:52:03.000Z"
}
