{
  "title": "Two new teams, as many venues on the cards for next PSL season, says CEO Salman Naseer",
  "author": "Dawn Sport",
  "content": "The Pakistan Super League (PSL) is set for its biggest expansion yet, with two new teams and two additional venues expected to feature in the next edition of the tournament, PSL Chief Executive Officer Salman Naseer revealed on Friday.\n\nSpeaking during a podcast released by the Pakistan Cricket Board (PCB), Salman said the board was “very seriously considering moving on to six venues this time,” adding that “HBL PSL 11, God willing, will be played across six venues.”\n\nHe said the long-forgotten Imran Khan Stadium, formerly Arbab Niaz Stadium, in Peshawar was “almost ready,” but required some final upgrades before it could host matches of international standard. “We are certainly trying to prepare it for PSL 11,” he said.\n\n“But what we need also is for the lease agreement to take place. For us to invest significantly as the PCB in this venue, we need to have a long-term lease in place.”\n\nSalman confirmed that Faisalabad was also being lined up as the other new host city.\n“The other venue, as people may have already guessed, since there are international matches scheduled there, is going to be Faisalabad,” he added.\n\nOn the league’s expansion plans, the PSL chief said the PCB was targeting two new franchises for the next season, with the tender process for team sales to begin in November. “There is a lot of interest and we are very keen to explore that interest,” he said.\n\n“And how things look right now, it seems there’s going to be a lot of competition here too.”\n\nThe PSL, which began in 2016 with five teams, expanded to six franchises with the addition of Multan Sultans in 2018. The inclusion of two more sides would mark its first major restructuring in seven years and push the total number of teams to eight.\n\nSalman’s revelations come a day after it emerged that the PCB had sent a legal notice to PSL franchise owner Ali Khan Tareen threatening termination of the franchise agreement with the board.\n\nAccording to sources, the PCB is unimpressed by Ali’s criticism of the PSL management for what he believed was incompetence to improve the league as a brand.\n\nWhile Multan Sultans said on Thursday the “PCB management to treat constructive criticism as a crime is outrageous”, Ali released an acerbic video late at night defending himself and apparently tearing apart the notice to conclude it.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/2416514580effdd.webp",
  "retrievedAt": "2025-10-26T11:28:58.667Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950974/two-new-teams-as-many-venues-on-the-cards-for-next-psl-season-says-ceo-salman-naseer",
  "dateList": "2025-10-26",
  "date_published": "2025-10-24T11:52:14.000Z"
}
