{
  "title": "Trump slams ‘dirty’ Canada despite withdrawal of anti-tariff advertisement",
  "author": "AFP",
  "content": "US President Donald Trump slammed Canada for playing “dirty” on Friday as a row over an advertisement featuring former leader Ronald Reagan that prompted Trump to scrap trade talks showed no sign of abating.\n\nThe Canadian province of Ontario said it would pull the offending anti-tariff ad on Monday so that negotiations could restart, after Trump alleged that the ad misrepresented the views of fellow Republican Reagan.\n\nBut Trump showed no sign of backing down, saying Ontario should not have let it air during the first two games this weekend of baseball’s World Series.\n\nAdding extra spice to the row, the World Series features a Canadian team, the Toronto Blue Jays, facing a US team, the Los Angeles Dodgers. The Blue Jays thrashed the Dodgers 11-4 in the first game on Friday.\n\n“Canada got caught cheating on a commercial, can you believe it?” Trump told reporters before heading on a trip to Asia.\n\n“And I heard they were pulling the ad — I didn’t know they were putting it on a little bit more. They could have pulled it tonight,” Trump added.\n\nAfter a reporter said the ad would be pulled on Monday, Trump replied: “That’s dirty play. But I can play dirtier than they can.”\n\nTrump announced on his Truth Social network on Thursday that he had “terminated” all negotiations with Canada over what he called the “fake” ad campaign.\n\nLess than 24 hours later, Ontario premier Doug Ford said he was suspending the ads after talking to Canadian Prime Minister Mark Carney about the spiraling row with Washington.\n\n“In speaking with Prime Minister Carney, Ontario will pause its US advertising campaign effective Monday so that trade talks can resume,” Ford said in a post on X.\n\nThe Canadian ad used quotes from a radio address on trade that Reagan delivered in 1987, in which he warned against ramifications that he said high tariffs on foreign imports could have on the US economy.\n\nIt cited Reagan as saying that “high tariffs inevitably lead to retaliation by foreign countries and the triggering of fierce trade wars,” a quote that matches a transcript of his speech on the Ronald Reagan Presidential Library’s website.\n\nThe Ronald Reagan foundation wrote on X on Thursday that the Ontario government had used “selective audio and video” and that it was reviewing its legal options.\n\nTrump said on Friday night that it was a “crooked ad”, adding that “they know Ronald Reagan loved tariffs”.\n\nTrump and Carney are both set to be at a dinner on the sidelines of an Asia-Pacific Economic Cooperation (APEC) in South Korea on Wednesday.\n\nBut Trump said he had no plans to meet Carney.\n\nThe latest twist in relations between the United States and Canada came just over two weeks after Carney visited Trump at the White House to seek a relaxation of stiff US tariffs.\n\nOn Friday, Carney had sought to calm the situation, saying that his country was ready to resume “progress” on trade talks “when the Americans are ready”.\n\nCanada has “to focus on what we can control, and realize what we cannot control,” he added as he headed to Asia.\n\nTrump’s global sectoral tariffs — particularly on steel, aluminum, and autos — have hit Canada hard, forcing job losses and squeezing businesses.\n\nFor now, the United States and Canada adhere to an existing North American trade deal called the USMCA, which ensures that roughly 85 per cent of cross-border trade in both directions remains tariff-free.\n\nBut in a speech on Wednesday, Carney said that the United States has raised “its tariffs to levels last seen during the Great Depression”.\n\n“Our economic strategy needs to change dramatically,” Carney added, saying the process “will take some sacrifices and some time.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/251105396e09ad6.webp",
  "retrievedAt": "2025-10-26T15:22:09.472Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951150/trump-slams-dirty-canada-despite-withdrawal-of-anti-tariff-advertisement",
  "dateList": "2025-10-26",
  "date_published": "2025-10-25T06:06:24.000Z"
}
