{
  "title": "Trump says will get Pak-Afghan conflict ‘solved very quickly’",
  "author": "Dawn.com",
  "content": "United States President Donald Trump said on Sunday that he would get the conflict between Pakistan and Afghanistan “solved very quickly”, calling Prime Minister Shehbaz Sharif and COAS Field Marshal Asim Munir “great people”.\n\nTensions between Islamabad and Kabul flared up earlier this month over accusations of terrorism, as border clashes killed 23 Pakistani troops as well as 200 Taliban and affiliated terrorists after an attack by Kabul, which it claimed was retaliation for Islamabad conducting air strikes in its territory. A first round of talks in Doha last weekend led to a ceasefire agreement, with both governments seeking to firm up the agreement in more talks yesterday.\n\nTrump, who was previously involved in brokering a ceasefire between Pakistan and India in May of this year as well as a peace deal between Israel and Gaza’s Hamas, arrived today in Malaysia to attend a summit of the Association of Southeast Asian Nations (Asean) in Kuala Lumpur, while also co-signing a ceasefire agreement between Thailand and Cambodia.\n\nAddressing the border dispute on the sidelines of an Asean summit today, Trump referred to it as “one of eight wars that my administration has ended in just eight months”.\n\n“We’re averaging one a month. There’s only one left,” he said. “Although I heard that Pakistan and Afghanistan have started up, but I’ll get that solved very quickly.”\n\nHe added, “I know them both … the Pakistan field marshal and the prime minister are great people, and I know we’re gonna get that done quickly. That one started up a few days ago.”\n\nReferring to his own role in halting wars around the world, the US president said, “I just feel it’s something I can do. I do it nicely.\n\n“I don’t need to do it, I guess,” he added. “But if I can take time and save millions of lives, that’s really a great thing. I can’t think of anything better to do.”\n\nTrump had previously thanked both Shehbaz and “my favourite” Munir for their efforts in securing the ceasefire deal in Gaza, while Shehbaz praised Trump’s “exemplary [and] visionary leadership” and reconfirmed Pakistan’s plan to nominate him for the Nobel Peace Prize 2026.\n\nWhen the fighting broke out between Pakistan and Afghanistan, the US president was quick to express interest in assisting with establishing peace, although he was at the time occupied with overseeing a hostage exchange between Hamas and Israel.\n\n“I said, ‘I’ll have to wait till I get back. I am doing another one,’” he told reporters at the time. “Because I’m good at solving wars, I’m good at making peace, and it is an honour to do it.”",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26140120e4ca667.webp",
  "retrievedAt": "2025-10-26T10:23:57.211Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951352/trump-says-will-get-pak-afghan-conflict-solved-very-quickly",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T09:15:34.000Z"
}
