{
  "title": "Railways suspends three officials  over auction ‘scam’",
  "author": "Khalid Hasnain",
  "content": "LAHORE: After cancelling the auction on Oct 23, the Pakistan Railways (PR) on Saturday suspended its three officers from service for being involved allegedly in holding ‘controversial’ activities.\n\nSince the officials were placed under suspension on the orders of the federal minister for railways, an inquiry against them has also been ordered, Dawn has learnt.\n\nThe officers suspended included Divisional Engineer-1 Muhammad Anjum, Deputy Director (Property and Land) Ziaul Jabbar and Senior Accounts Officer Ahmad Rabbani.\n\n“Besides suspending these officers, I have also ordered to initiate an inquiry against them with immediate effect. There is no room for the officers who failed to ensure transparency in the department,” Federal Minister for Railways Muhammad Hanif Abbasi said while talking to Dawn on Saturday.\n\nAuction already cancelled; probe into ‘irregularities’ ordered\n\nIt is pertinent to mention that the issue came into the limelight after the Ministry of Railways on Oct 17 entrusted the Rawalpindi divisional superintendent (DS) with the additional charge of the office of Lahore DS for a brief period of just three days (Oct 20 to 22) despite the availability of officers in Lahore that had raised eyebrows.\n\nThe decision to assign the look-after charge to the Rawalpindi DS was seen as an effort to allegedly ‘facilitate’ certain elements in winning significant auction of railway godowns and others in Badami Bagh and other prime spots for a period of five years and even more. However, later, on the orders of the minister, the ministry cancelled its earlier orders, entrusting another officer (Yousaf Leghari, chief mechanical engineer) with the Lahore DS charge for three days. But this decision couldn’t remove the concerns related to the scheduled auction, and finally, it forced the railway authorities to cancel the auction on October 23.\n\nThe properties presented to be given on lease through open auction included four godowns at Sher Shah Road, a parking stand at truck adda, measuring 42 marlas, one parking stand near L-Xing No-4, a shop at SDR shopping centre No-4, a restaurant at BBG near parking stand, a godown near L-Xing No 43 BTW GRW-GRWC, two bays under Garhi Shahu bridge, a parking stand near L-Xing No-9, a site for godown on the Railway Road and 10 shops at cement godown.\n\n“I will ensure getting the auction of properties held in a transparent manner,” the minister said, adding that he saved billions of rupees in bidding for the luggage vans and express cargo.\n\nEarlier, the minister presided over a meeting held here at the PR’s headquarters on Saturday.\n\nThe participants reviewed the reasons behind delays in the arrival and departure of passenger trains.\n\nThe minister, on the occasion, sought the removal of all engineering restrictions on the Lahore-Rawalpindi-Lahore route within one month in a bid to reduce travel time.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26113459b9deda4.webp",
  "retrievedAt": "2025-10-26T10:25:28.790Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951234/railways-suspends-three-officials-over-auction-scam",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:57:04.000Z"
}
