{
  "title": "IHC orders probe into ‘abduction of woman, her children’",
  "author": "Malik Asad",
  "content": "• Case linked to multimillion-rupee naval farms land scam\n• Plea alleges officials implicated woman in criminal case\n\nISLAMABAD: The Islamabad High Court has ordered the constitution of a joint investigation team (JIT) to investigate into the alleged abduction of a woman and her three minor children, an episode now linked to a multimillion-rupee Naval Farms land scam recently unearthed by a joint enquiry committee (JEC).\n\nJustice Mohsin Akhtar Kayani of the IHC issued the directives while hearing a petition filed by Muhammad Waqas and others.\n\nThe petition alleged that police officials, acting on behalf of unidentified people, abducted Sana Sohail, wife of Aleem Sohail, who worked in a private farm, along with her daughters — 12-year-old Harim, seven-year-old Laiba, and three-year-old Nimra — from Lahore on Sept 17.\n\nIt added that the officials later implicated the woman in a fabricated criminal case at the Tarnol police station in Islamabad.\n\nAccording to the court order, CCTV footage dated Sept 17 confirmed that the woman and her children were taken into custody at around 7am with the assistance of the Punjab police and transported to Islamabad.\n\nThey were later shown as arrested in an FIR, which was registered three days later under various provisions of the Pakistan Penal Code and the Arms Ordinance.\n\nThe judge observed that the incident occurred prior to the filing of the FIR, raising “serious questions about the legality of the police action”.\n\nThe investigation officer (IO) failed to identify those who had ordered the operation or to justify the presence of two Suzuki Alto cars and other vehicles recovered at the CIA centre in Islamabad.\n\nThe IHC directed the Islamabad police chief to appear in person on Oct 28 and explain the conduct of the Tarnol SHO and the IO.\n\nThe CIA centre SP was instructed to produce the vehicles and submit a detailed report describing how they were taken into custody.\n\nJustice Kayani also summoned the Federal Investigation Agency (FIA) director general and ordered the creation of a JIT to investigate into the alleged abduction, trespassing, and fabrication of criminal charges. The FIA DG was told to supervise the inquiry.\n\nThe order pointed out that Duty Jud­ic­ial Magistrate Yasir Mehmood Chaudhry had sent Ms Sohail to judicial custody and placed her children with the Child Pro­t­e­ction Bureau without the inquiry required under law concerning their welfare.\n\nThe member inspection team of the high court was directed to summon the magistrate for an explanation.\n\nThe IHC proceedings are closely connected to a separate high-level probe by the JEC, comprising high ranking officials including Islamabad Deputy Commissioner Irfan Nawaz Memon, director generals of the Inter-Services Intelligence and Intelligence Bureau, a senior superintendent of Islamabad police as well as a naval commander, which earlier uncovered a sophisticated land scam involving 136 kanals of property in Mera Begwal, Islamabad.\n\nThe JEC found that the land had been illegally transferred through a manipulated general power of attorney (GPA) and fraudulent documents.\n\nAccording to the JEC report, the GPA used for the transfer bore genuine signatures and thumb impressions of the landowner, Musharraf Rasool Cyan, but the sale clause was inserted later.\n\nThe inquiry also discovered fake stamp papers and affidavits and traced financial transactions exceeding Rs383.8 million.\n\nMuhammad Waqas, the petitioner in the IHC case, was identified as Mr Cyan’s farm employee, who had received the funds from land provider Faisal Mumtaz and the Pakistan Navy Benevolent Association. Mr Waqas, who earned Rs50,000 a month, withdrew or transferred Rs326.95m.\n\nAnother employee, Aleem Sohail, and his wife Ms Sohail — the woman allegedly abducted — were also found to have received large unexplained deposits.\n\nThe JEC expressed astonishment that the PNBA and Mr Mumtaz paid such huge sums to a farm worker without verifying ownership or contacting the actual landowner.\n\nIt recommended the cancellation of the fraudulent mutation, legal action against those involved, freezing of assets, as well as reforms in property registration and biometric verification systems.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26082831aa9ca5e.webp",
  "retrievedAt": "2025-10-26T10:26:25.134Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951294/ihc-orders-probe-into-abduction-of-woman-her-children",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:56:32.000Z"
}
