{
  "title": "Hungering for growth",
  "author": "Khurram Husain",
  "content": "FOR many months now Pakistan’s economy is stuck in what we can call a state of ‘peak stability’, where the raw application of stabilising measures — hikes in interest rates and taxes — have successfully plugged key deficits that were fuelling inflation and causing foreign exchange reserves to plummet. These measures stabilised the economy by choking all growth, the same tried and tested formula Pakistan has been using since 1988.\n\nBut the problem has always been the same: how to restart growth after stabilisation in a way that does not lead to a resurgence of the same deficits all over again. That has been the bane of Pakistan’s economy for too many decades now, booms followed by busts.\n\nIn the past, they always managed to get some sort of a bonanza from abroad to finance their growth. These inflows included borrowed money via the Foreign Currency Deposit Scheme in the 1990s, or the post 9/11 bonanza enjoyed by Musharraf, or the generous inflows from China and the Kingdom of Saudi Arabia in the middle of the 2010s, or the post Covid inflows and debt restructuring coupled with the temporary halt of the IMF programme in the period 2020 to 2022.\n\nThe few times we had adjustment without ensuing growth saw the country come to unendurable stagnation. Two examples would be the aftermath of the 2000 Stand-by Arrangement implementation (though 9/11 came along and changed everything) and the post Great Financial Crisis period following 2008.\n\nThe path from stagnation to growth was marked, in each case, with the same set of indicators moving in the same direction every time. First came the nascent signs of growth in the Large Scale Manufacturing Index. This was followed by rising import payments. Eventually, the import growth swamped exports, and the current account, which had been stabilised with much pain and sacrifice, returned to deficit. Then the deficits began to grow and the foreign currency reserves, which had peaked, began their downward slide. From there, things became unstoppable, because growth (of this sort) once begun, is very difficult to stop for any government.\n\nThe problem is how to restart growth after stabilisation in a way that does not lead to a resurgence of the same deficits all over again.\n\nThe government tries to shore up reserves with borrowed money, and once that effort runs its course, the reserves begin to fall. Once the fall gathers momentum the need to adjust the exchange rate rises and the government resists. Eventually, they are reduced to selling reserve dollars in the market in order to shore up the exchange rate, thereby accelerating the decline. Once reserves fall below certain thresholds it becomes necessary to adjust the exchange rate, and because they do it in one go, and at the last minute, the adjustment is traumatic and large.\n\nThus begins the eternal return to the IMF. Every government succeeds in putting this moment off long enough till they are no longer in power. And they all make the same argument: ‘while we were in power, the economy grew. It’s when the other guys came that everything started to go wrong.’\n\nThis is worth remembering and bearing in mind when looking at Pakistan today, because the same story is repeating itself all over again. Having hit ‘peak stability’ earlier this year, the government has been stuck in a low growth, low inflation equilibrium ever since. They cannot move forward towards growth. They cannot stay standing in this place for long either.\n\nEstimates of the number of new entrants to Pakistan’s labour force range as high as two million every year. If the economy is not creating 2m new jobs every year, then unemployment rises. Some of these new entrants find income-generating opportunities through creating new businesses of their own in our time, but these businesses are almost always in the services sector, and don’t create enough value to be the bedrock of job creation on the scale that is required for a country the size of Pakistan.\n\nAs unemployment rises so does the number of people living below the poverty line. And those urban middle class folks who saw their incomes devastated during the period of the inflationary spiral find life turning into endless drudgery as their household incomes remain insufficient to meet even middle class life requirements.\n\nThis cumulative build-up of misery across society is channelled upward via any institution that taps the voice of the people at scale, such as political parties, mass and social media. The government of the day finds itself struggling to message out its accomplishments, which appear to the people like superficial vanities. Thus is born the desperation to pump growth, the first requirement for which is dollars.\n\nThis was the story every time since at least 1998. Musharraf entered claiming he inherited a bankrupt economy and had to make difficult decisions to stabilise it. But he left a bankrupt economy in 2008, while claiming the economy grew while he was in power and crashed only when the others entered office instead. The PPP government claimed it inherited a bankrupt economy, as did Nawaz Sharif in 2013 and Imran Khan in 2018. Each left a bankrupt economy too, but they claimed things were going well while they were in power (except for the PPP which could not even mount that claim since it never got the chance to pump growth as there never was much of a bailout for them beyond the IMF).\n\nNow one more time the story is repeating itself, though we are in the early stages of the curve. The stabilisation part is done. The growth is yet to come. But even the small, incipient growth that the economy has registered in the past few months has caused import payments to rise and put pressure on the foreign exchange markets. The government is more unpopular than any in recent memory. And they are hungering for some sort of breakout. Whether or not it comes, it is worth remembering this tale always has the same ending.\n\nThe writer is a business and economy journalist.\n\nPublished in Dawn, October 23rd, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68f98b08e1527.jpg",
  "retrievedAt": "2025-10-25T22:52:38.702Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1950714/hungering-for-growth",
  "dateList": "2025-10-26",
  "date_published": "2025-10-23T01:57:05.000Z"
}
