{
  "title": "Trump kicks off Asia tour with Malaysia summit ahead of Xi meeting",
  "author": "AFP",
  "content": "US President Donald Trump arrived in Malaysia on Sunday on the first leg of an Asian tour that will include high-stakes trade talks with Chinese counterpart Xi Jinping.\n\nTrump is set to meet Xi in South Korea on the last day of his regional swing in a bid to seal a deal to end the bruising trade war between the world’s two biggest economies.\n\nAs he left Washington, Trump added to speculation that he could meet North Korean leader Kim Jong Un for the first time since 2019 while on the Korean peninsula, saying he was “open to it”.\n\nThe US president will also visit Japan on his first trip to Asia since returning to the White House in January in a blaze of tariffs and international dealmaking.\n\nTrump told reporters aboard Air Force One that he hoped for a\n“comprehensive deal” with Xi, adding that he expected China to make a deal to avoid further 100 per cent tariffs that are due to come into effect on November 1.\n\nIn Malaysia on Sunday, Trump is due to attend the Association of Southeast Asian Nations (Asean) summit — a meeting he skipped several times in his first term.\n\nHe is also set to sign a trade deal with Malaysia, and will witness the signing of a ceasefire agreement between Thailand and Cambodia.\n\n“We will be signing the Peace Deal immediately upon arrival,” Trump said on social media of the truce he helped broker after the deadliest clashes between Thailand and Cambodia in decades.\n\nTrump said he expected to meet Brazilian President Luiz Inacio Lula da Silva on the sidelines of the Asean summit to improve ties with the leftist leader after months of bad blood.\n\nDuring a refuelling stop in Qatar on the way from Washington, the US president met with leaders of the Gulf emirate, which is among the guarantors of the Gaza ceasefire deal spearheaded by Trump.\n\nAfter Malaysia, Trump is expected in Tokyo on Monday, where the following day he will meet Japan’s new Prime Minister Sanae Takaichi.\n\nThe US leader said he had heard “great things about her” and hailed the fact that she was an acolyte of assassinated former premier Shinzo Abe, with whom he had close ties.\n\nTakaichi said she told Trump in a phone call on Saturday that “strengthening the Japan-US alliance is my administration’s top priority on the diplomatic and security front”.\n\nJapan has escaped the worst of the tariffs Trump slapped on countries around the world to end what he calls unfair trade balances that are “ripping off the United States”.\n\nThe highlight of the trip is expected to be South Korea, where Trump will meet Xi for the first time since his return to office.\n\nTrump is due to land in the southern port city of Busan on Wednesday ahead of the Asia-Pacific Economic Cooperation (APEC) summit, and will meet South Korean President Lee Jae Myung.\n\nOn Thursday, global markets will be watching closely to see if the meeting with Xi can halt the trade war sparked by Trump’s sweeping tariffs, especially after a recent dispute over Beijing’s rare-earth curbs.\n\nTrump initially threatened to cancel the meeting and announced the fresh 100pc tariffs during that row, before saying he would go ahead after all.\nSouth Korea’s reunification minister has said there is a “considerable” chance that Trump and North Korea’s Kim will also meet.\n\nThe two leaders last met in the Demilitarised Zone (DMZ) separating the two Koreas during Trump’s first term.\n\nKim has said he would also be open to meeting the US president if Washington drops its demand that Pyongyang give up its nuclear arsenal.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26114337b6b2c80.webp",
  "retrievedAt": "2025-10-26T10:24:22.640Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951342/trump-kicks-off-asia-tour-with-malaysia-summit-ahead-of-xi-meeting",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T05:50:24.000Z"
}
