{
  "title": "Focusing on climate, trans community seeks freedom and identity",
  "author": "Shazia Hasan",
  "content": "KARACHI: The chunky jewellery glittered, bangles jingled, silver and gold gota kinari and tassels shimmered while the blue, pink and white transgender pride flag fluttered in the afternoon breeze.\n\nThe “DJ Wale Babu” was requested to play the anthem ‘Hum Hijre Hain’ and everyone sang in chorus as they stood up with heads held high in the name of freedom and identity.\n\nThat’s how the Hijra Festival on the theme of “From climate to identity, from struggle for liberation” this year kicked off at Burns Garden here on Saturday.Advertisements\n\n\n\n\n\n\n\n\n\n\n\n\n\n                X\n\n“My dress is from Generation, my bangles from Zainab Market and jewellery borrowed from my sister,” shared Dr Sarah Gill, the first known transgender medical doctor of the country, as she took over moderating responsibilities for the evening. The doctor, specialising in public health from Szabist these days, was also one of the organisers of the festival.\n\nHijra Festival demands implementation of employment quota reserved for trans persons\n\nWhile explaining the purpose of hosting the Hijra Festival,  transgender model Kami Chaudhry, its other organiser, explained that they desire the freedom to live life the way they are. “That’s why we set aside one day in the 365 days of the year when we can set aside our challenges, our struggles and sorrow, to celebrate our existence,” Kami said. “It is also a day when we raise awareness about our community and our rights as human beings, a day when we also highlight our demands,”  she added.\n\n“The theme of this year’s festival stresses climate change,  our identity, and the struggle to liberation. We are out on the roads under the harsh sun, and we are still outside, soaked to the skin in the rain because many of us don’t have a roof over our heads. And still we survive. We survive to bring up our demands, again for the umpteenth time,” Kami reminded. “We demand the full implementation of the employment quota reserved for transgender persons as well as the mandatory inclusion of the transgender community in disaster management,  relief, housing and health programmes so that no one is left behind in national policy and practice,” she added.\n\nBabli, a trans person from Islamabad, said that as a citizen of this country, her identity is important to her. “Some people believe that we are easy targets, so they paint a big question mark on our existence. But as citizens of Pakistan, we are as important as the president or prime minister of Pakistan, as we have the same green CNIC  as them and are deserving of the same rights as them,” Babli pointed out.\n\nSenior trade unionist Nasir Mansoor congratulated Dr Sara Gill and Kami Chaudhry on successfully holding the Hijra Festival for a third consecutive time. “You have to stand up for yourselves and fight for your rights,” he said.\n\nDean of the Faculty of Social Sciences at Szabist, Dr Riaz Shaikh also congratulated all trans persons at the festival for organising the event.\n\nSadia Chaudhry, a member of the Transgender Council and a town councillor from the Jamaat-i-Islami, said that she was very happy to be there. “I pray to meet you all again in happier times next year,” she said.\n\nMahnoor, another trans person, said that their community also works for climate awareness. “We have tree plantation drives as we also advocate climate awareness, but we also need integration and inclusion in society to make our efforts work,” she said.\n\nArzoo, Moazzam Jahan, Rumaisa, Bunny and trans activist Bindiya Rana also spoke.\n\nMeanwhile, Senorita, Hina Gul and Zehrish Khanzadi put up brilliant performances.\n\nPublished in Dawn, October 26th, 2025",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/68fd5064390e5.jpg",
  "retrievedAt": "2025-10-26T10:25:22.489Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951254/focusing-on-climate-trans-community-seeks-freedom-and-identity",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T01:56:56.000Z"
}
