{
  "title": "Mbappe, Bellingham strike as Real Madrid edge Barcelona in fiery El Clasico clash",
  "author": "AFP | Reuters",
  "content": "Goals from Kylian Mbappe and Jude Bellingham earned Real Madrid a 2-1 victory over Barcelona in a spiky El Clasico on Sunday that snapped a four-match losing streak against their rivals and extended their lead atop the La Liga standings.\n\nMbappe opened the scoring in the 22nd minute with a close-range finish after a perfectly timed through ball from Bellingham. However, Barcelona capitalised on a mistake by Arda Guler to equalise in the 38th minute through Fermin Lopez.\n\nReal regained the lead five minutes later when Bellingham tapped in from inside the six-yard box following an inspired run and cross by Vinicius Jr.\n\nReal had several chances but were denied by an excellent display from Barca keeper Wojciech Szczesny, who kept out Mbappe’s penalty early in the second half.\n\nBarcelona barely threatened Real keeper Thibaut Courtois after the break and finished the match with 10 men after midfielder Pedri earned a second yellow card for a sliding tackle from behind on Aurelien Tchouameni in added time.\n\nThe closing stages were marked by drama as Vinicius Jr reacted angrily to being substituted by manager Alonso, storming down the tunnel before returning to the bench.\n\nThe Brazilian was later involved in a heated exchange between players from both sides, prompting Spanish police to intervene and prevent a full-scale brawl.\n\nReal moved to 27 points at the top of the La Liga standings, five ahead of Barcelona in second.\n\nAfter four consecutive defeats to Barcelona across three competitions, Real Madrid entered the match like a team that was desperately in need of a statement win to validate the project of new manager Xabi Alonso.\n\nReal applied a relentless high press from the get-go and, roared on by a sold-out Santiago Bernabeu crowd, they cornered Barcelona in a match that started with controversy as referee Cesar Soto Grado overturned a penalty for Real Madrid after a VAR review.\n\nThe official ruled that Vinicius had kicked Lamine Yamal’s leg while attempting a shot, reversing his initial decision.\n\nBut it wasn’t the first call that left the Real players and coach fuming at the referee and a few minutes later Mbappe had a stunning long-range strike ruled out for offside, despite replays suggesting Barcelona’s Lopez may have been the last to touch the ball.\n\nReal kept piling on the pressure, dominating proceedings with over 75% of possession in the first half-hour but they were frustrated by Szczesny who made some remarkable saves to deny Mbappe, Dean Huijsen and Vinicius from close range.\n\nTheir persistence paid off when Mbappe latched onto Bellingham’s through ball and slotted home to break the deadlock, but Barcelona equalised against the run of play following Guler’s mistake.\n\nReal then responded emphatically, with Vinicius Jr tormenting Barcelona’s defence.\n\nThe Brazilian winger created Real’s second goal, breezing past Frenkie De Jong and Jules Kounde on the left wing before delivering a cross that Eder Militao headed back into the path of Bellingham, who tapped into an empty net in the 43rd minute.\n\nMarcus Sorg — the stand-in coach for Barca as Hansi Flick was suspended — sent defender Ronald Araujo up front during nine minutes of stoppage time but the centre-back could not trouble Real goalkeeper.",
  "tags": [],
  "categories": [
    "News"
  ],
  "image": "https://i.dawn.com/large/2025/10/26234950380e317.webp",
  "retrievedAt": "2025-10-26T22:42:30.204Z",
  "source": "DAWN",
  "link": "https://www.dawn.com/news/1951392/mbappe-bellingham-strike-as-real-madrid-edge-barcelona-in-fiery-el-clasico-clash",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T18:50:44.000Z"
}
