{
  "article_id": "2025-08-14_cc8425f513cdc644cbd4d2fc850994a3",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cda-chairman-visits-pakistan-sweet-home-highlights-unity-sacrifice-on-independence-day/",
    "retrieved_at": "2025-08-17T20:09:28.360Z"
  },
  "metadata": {
    "title": "CDA Chairman visits Pakistan Sweet Home, highlights unity, sacrifice on Independence Day",
    "author": null,
    "date_published": "2025-08-15T03:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 209,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 14 (APP):Chairman Capital Development Authority (CDA), Muhammad Ali Randhawa, visited Pakistan Sweet Home on Thursday as part of Marka-e-Haq and 79th Independence Day celebrations. Accompanied by CDA Member Administration and Estate, Talat Mehmood, the Chairman addressed students, emphasizing the importance of unity, faith, and sacrifice in the nation's journey. Welcomed warmly by Pakistan Sweet Home Patron-in-Chief, Zamurd Khan, and CDA CBA General Secretary, Chaudhry Muhammad Yaseen, the visit featured a symbolic cake-cutting ceremony to mark the occasion. Speaking to the students, Randhawa paid tribute to the martyrs and veterans of the independence movement, urging the younger generation to dedicate themselves to the country's development and prosperity. \"Pakistan's freedom was achieved through immense sacrifice. Our youth must uphold the values of hard work, commitment, and service to ensure a brighter future for the nation,\" he said. Commending Pakistan Sweet Home's role in providing education, shelter, and care to orphaned and underprivileged children, Randhawa described the initiative as a \"great national service.\" He pledged continued CDA support for welfare projects benefiting its students. Earlier, Zamurd Khan praised CDA's \"remarkable performance\" under Randhawa's leadership, noting improvements in civic services and community engagement. The event concluded with national songs, a flag-hoisting ceremony, and prayers for the country's peace, stability, and progress.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}