{
  "article_id": "2025-08-14_8b9d57a5cd1a6244f3e958b6c4088924",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-marks-independence-day-with-patriotic-fervor/",
    "retrieved_at": "2025-08-17T20:07:54.043Z"
  },
  "metadata": {
    "title": "AIOU marks Independence Day with patriotic fervor",
    "author": null,
    "date_published": "2025-08-14T21:12:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 428,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 14 (APP):Allama Iqbal Open University (AIOU) celebrated the anniversary of Pakistanas Independence Day with national zeal, patriotic fervor. The dignified ceremony began with the universityas smart and disciplined security guards presenting a Guard of Honour to Vice Chancellor Prof. Dr. Nasir Mahmood. This was followed by a flag-hoisting ceremony to the tune of the national anthem and a collective prayer was offered for the safety, progress and prosperity of Pakistan. After the ceremony, a seminar titled aPakistan: Destination after Destinationa was held under the chairmanship of the Vice Chancellor. The seminar was organized by the Department of History and the Department of Pakistan Studies in collaboration with the Directorate of Student Advisory and Counseling Services, said a press release issued on Thursday. The participants of the seminar included University Registrar Raja Umar Younas, Dean of the Faculty of Arabic and Islamic Studies Prof. Dr. Shah Mohyuddin Hashmi, Director General Regional Services Dr. Malik Touqeer Ahmed Khan, Director Administration and Coordination Prof. Dr. Syed Amir Shah, and Abdul Basit Mujahid. Addressing the seminar, Dr. Nasir Mahmood said that this year, Pakistan is celebrating Independence Day along with the glorious successes of Operation Maaraka-e-Haq and Operation Bunyan ul Marsoos. He noted that only seven countries in the world possess nuclear capability, and Allah Almighty has blessed Pakistan with this great power to effectively respond to any aggression from the enemy. He added that in May, an attempted attack by the enemy was foiled by the Pakistan Armed Forces, raising Pakistanas prestige before the world. For this, the entire nation pays heartfelt tribute to its armed forces. He further stated that despite countless challenges, Pakistan has remained on the path of progress, achieving remarkable success in every sphere of life. aCompared to twenty years ago, we stand today at a much more advanced stage of development,a he remarked. Speakers included Dr. Abdul Basit Mujahid, Chairperson of the Department of History Dr. Kishwar Sultana, Dr. Kausar Parveen, and Dr. Muhammad Sajid Khan. In their addresses, the speakers said that over the past years, Pakistan has turned the impossible into possible. At the time of its creation, there was only one university; today, there are over 500 universities and remarkable progress has been made in every field. They reaffirmed the resolve that the nationas dignity and honor would never be compromised and that everyone must work together for its continued development. The ceremony concluded with the cutting of the Independence Day cake, in which children and participants took part with great enthusiasm, raising resounding slogans of aPakistan Zindabada (aLong Live Pakistana).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}