{
  "article_id": "2025-08-14_181ab58925be814c5e31b53ab1fa96ea",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/independence-day-reminds-of-sacrifice-unity-ayesha-raza/",
    "retrieved_at": "2025-08-17T20:07:53.592Z"
  },
  "metadata": {
    "title": "Independence Day reminds of sacrifice, Unity: Ayesha Raza",
    "author": null,
    "date_published": "2025-08-14T22:01:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 205,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 14 (APP):On the occasion of Pakistanas 78th Independence Day, Prime Ministeras Focal Person on Polio Eradication, Ayesha Raza Farooq, has reaffirmed the nationas resolve to completely eliminate polio from the country. Extending heartfelt greetings to the nation, in a message, she said Independence Day is a reminder of sacrifice, determination, and unity. aRidding Pakistan of polio is an important continuation of our journey to freedom,a she emphasized, warning that the crippling virus robs innocent children of their dreams and the right to a confident, independent life. She urged the public to warmly welcome polio teams and ensure all children receive the essential drops, as polio causes lifelong disability. She praised the courage and dedication of frontline workers who are at the forefront of the fight against polio, adding that coordinated and sustained efforts are underway to eradicate the virus. aUnder the leadership of the Prime Minister, national and international partners remain committed to ending polio in Pakistan,a she noted. A special ceremony was also held at the National Emergency Operations Center (NEOC) to mark the 78th Independence Day. Ayesha Raza Farooq, NEOC Coordinator Anwaar ul Haq, and representatives of international partner organizations attended the ceremony. Participants renewed their pledge to make Pakistan polio-free.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}