{
  "article_id": "2025-08-14_6bc84f722158c51a88b43e1fcc7fe5b9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fbise-celebrates-independence-day-and-marka-e-haq-with-patriotic-fervor/",
    "retrieved_at": "2025-08-17T20:10:17.800Z"
  },
  "metadata": {
    "title": "FBISE celebrates Independence Day and Marka-e-Haq with patriotic fervor",
    "author": null,
    "date_published": "2025-08-14T23:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 233,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 14 (APP):Federal Board of Intermediate and Secondary Education (FBISE), Islamabad commemorated Pakistan's Independence Day with deep national pride and reverence along with celebrating Marka-e-Haq, paying homage to the nation's heroes and celebrating the spirit of freedom. The celebrations commenced with a graceful and dignified ceremony featuring Tilawat-e-Kalam-e-Pak, Naat sharif, milli naghma and the soulful rendition of the National Anthem, evoking a profound sense of patriotism among the audience. A large number of students from affiliated institutions, along with officers and staff members of FBISE, actively participated in the event, reflecting their love for the country and commitment to its future. The celebrations were personally led by Chairman FBISE, Dr. Ikram Ali Malik, While, Executive Director Inter Boards Coordination Commission (IBCC), Dr Ghulam Ali Mallah and Chairperson Private Educational Institutions Regulatory Authority (PIERA), Dr Sayeda Zia Batool jointly graced the event as guests of honour. Rich tribute was paid to the bravery, sacrifices and unwavering resolve of the valiant armed forces of Pakistan in defending the nation during the historic Marka-e-Haq against the staunch adversary, India. The event concluded with a heartfelt dua (prayer) for the continued peace, prosperity, and progress of Pakistan, and to honour the memory of the martyrs and heroes who laid down their lives for the homeland. FBISE remains committed to fostering patriotism and national unity among the youth through education and meaningful commemorations of our national history.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}