{
  "article_id": "2025-08-14_b03b59f6fa74d94d45466d9ffd533f93",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mohsin-naqvi-pays-tribute-to-nation-on-independence-day/",
    "retrieved_at": "2025-08-17T20:07:28.673Z"
  },
  "metadata": {
    "title": "Mohsin Naqvi Pays Tribute to Nation on Independence Day",
    "author": null,
    "date_published": "2025-08-14T22:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 325,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Aug 14 (APP):Federal Interior Minister Mohsin Naqvi has congratulated the nation on PakistanasA Independence Day, calling it a day of sacrifice, struggle, and the fulfillment of the dream of freedom. In his special message, Naqvi said Pakistan is a great blessing from Almighty Allah and it is the duty of every citizen to value and protect it. Quoting Quaid-e-Azam Muhammad Ali Jinnah, he said the creation of Pakistan was destined, not a gift, but the result of a long and determined struggle. The interior minister reminded the nation that blood, tears, and martyrdom were the price paid for independence. aTodayas Pakistan stands firmly on the foundation of those sacrifices,a he said, saluting the millions of Muslims who made invaluable contributions to keep the flame of freedom alive. Naqvi praised the martyrs who laid down their lives for the peace and defense of the country, calling them athe crown of honor for the nation.a He assured that their supreme sacrifices will always be remembered. He also paid tribute to the courage and resilience of the families of the martyrs, saying they are like family to the entire nation. Highlighting Pakistanas recent achievements, Naqvi said that by inflicting a crushing defeat on the enemy in the abattle for truth,a the country has proven that the motto of aFaith, Unity, Disciplinea remains its greatest strength, identity, and guarantee of survival. aThis is the Pakistan of 2025, fully capable of defending itself,a he said, adding that the nationas victory has made this yearas Independence Day celebrations even more special. Naqvi reaffirmed that Pakistanas defense is impregnable and no enemy can dare to cast an evil eye on the country. He stressed that the golden principles of aFaith, Unity, and Disciplinea are the keys to national progress and prosperity. On this occasion, the minister renewed the nationas pledge to move forward with fresh resolve and a new vision for a bright future, ensuring that Pakistan overcomes every challenge successfully.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}