{
  "title": "Govt striving hard to steer country out of crises: Awais Leghari",
  "link": "https://www.app.com.pk/national/govt-striving-hard-to-steer-country-out-of-crises-awais-leghari/",
  "date_published": "2024-06-15T16:22:00.000Z",
  "source": "APP",
  "content": "DG KHAN, Jun 15 (APP): Federal Minister for Energy Sardar Awais Ahmad Khan Leghari said on Saturday that the Pakistan Muslim League-Nawaz (PML-N) government was making sincere efforts to steer the country out of crises.\nHe said this while speaking to journalists during the inauguration an uplift project. Sardar Awais Ahmad Khan Leghari stated that there was a zero tolerance policy towards electricity theft. He affirmed the government’s commitment to providing maximum relief to the public. He stated that the dualization of Indus Highway from Dera Ismail Khan to Kashmore was his top priority for uplift of the region. He added that the project would be completed by 2027.\nHe highlighted that PML-N was committed to serve the public and alleviate the nation’s issues. He stressed that PML N’s focus remained on services towards masses rather than criticism.\nHe stated that road construction for public welfare had always been a PML-N priority. Work on dualization of N-55 Indus Highway will commence in September this year and is expected to be completed by October 2027. This project will stretch from Dera Ismail Khan through Dera Ghazi Khan and Rajanpur to Kashmore, including over 100 bypasses to facilitate smooth travel for residents. These bypasses will intended to ease traffic congestion in the city’s centers, he remarked.\nLeghari stressed that the construction of the dual carriageway would boost the economy and provide numerous employment opportunities for the local population. He also mentioned China’s significant investment in the region, with ongoing surveys in Dera Ghazi Khan to transfer industry, which will open new avenues for development for educated youth, labourers, and other sectors.\nAddressing the power sector, he stated that revolutionary steps were being taken, including a merit-based system with no tolerance for favouritism. He shared the successful eradication of electricity theft in the challenging Fort Munro area, resulting in 24-hour power supply, and reiterated the goal of eliminating electricity theft nationwide to provide cheaper electricity to the public.\nLeghari also pointed out the government’s progress in reducing electricity rates for industries by Rs 10.69, which surely boost industrial activity and create more job opportunities.\nHe noted the recent reduction in petrol and diesel prices to provide public relief and stated a significant decrease in the inflation rate from 41 percent to 13 percent.\nHe assured that the government was aware of the farmers’ issues and the government was working to provide maximum relief to masses.\nOn this occasion, the foundation stone for the dualization of the 4-kilometer road from Pul Dat to Shoria in Dera Ghazi Khan was also laid with a cost of Rs 582 million.\nThe ceremony was attended by district officers, PML-N workers, and a large number of local citizens.",
  "retrievedAt": "2025-08-11T03:18:12.664Z"
}
