{
  "title": "FM warns of strict lockdown if SOPs not followed by people",
  "link": "https://www.app.com.pk/national/fm-warns-of-strict-lockdown-if-sops-not-followed-by-people/",
  "date_published": "2020-05-31T12:39:00.000Z",
  "source": "APP",
  "content": "MULTAN, May 31 (APP):Foreign Minister Shah Mahmood Hussain Qureshi on Sunday showed concerns over violation of standard operating procedures (SOPs) by the people issued by the government to control the spread of the coronavirus.\nHe regretted that the public was not taking the coronavirus outbreak seriously. The number of COVID-19 cases were raising with each passing day and if the situation remained the same, the government would have to impose a strict lockdown, he warned.\nThe foreign minister was speaking to a delegation of Caterers and Marriage Halls Association, which called on him here.\nQureshi said the entire world was facing the COVID-19 challenge and the economies were staggering globally due to it.\nHe said the government wished to not only fight the virus, but also wanted to save the people from hunger. It was fully alive to the problems faced by the people from every walk of life owing to the coronavirus, he said, adding he would present the point of view of Caterers and Marriage Halls Association regarding the permission for opening the business in National Coordination Committee (NCC) meeting to be held on Monday in Islamabad if they committed to abide by the SOPs.\nEarlier, the delegation apprised him of the hardships faced by them during the lockdown. They said 90 per cent of the marriage halls were on rent and it was not possible for their owners to pay rent and salaries of the staff without business.\nThe association demanded the government to permit them opening of the business with the SOPs to earn livelihood for their families.\nThe delegation included Association President Nusrat Mian, General Secretary Kashif Mirza, Mahmood Mirza, Jamil Ahmad and others. \\932\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:34.659Z"
}
