{
  "title": "NCOC seeks cooperation of market associations for implementing SOPs",
  "link": "https://www.app.com.pk/national/ncoc-seeks-cooperation-of-market-associations-for-implementing-sops/",
  "date_published": "2020-05-31T03:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 31 (APP):National Command and Operation Centre (NCOC) on Sunday sought to engage market associations for the implementation of COVID -19 guidelines and Standard Operating Procedures (SOPs) in letter and spirit.\nChairing a meeting at National Command and Operation Centre (NCOC), Minister for Planning, Development and Special Initiatives Asad Umer said that the shopkeepers should strictly implement “no mask, no service,” policy.\nHe directed the NCOC to concentrate on the plan to ease the lockdown while strictly implementing the Standard Operating Procedure (SOPs). The forum suggested taking strict punitive action on violation of SOPs. It must be noted that NCOC is working to devise a long and short term strategy on COVID-19 titled “Living with the Pandemic”.\nAsad Umar directed the pursuing of a vigorous mass awareness campaign to highlight the measures taken by the government to contain COVID-19 and underscore its achievements in this regard. The campaign should focus on ensuring behaviour change of the people regarding COVID-19 while also underlining that the government aimed to safeguard the people from the pandemic.\nExpressing satisfaction over the availability of ventilators in countrywide hospitals, Asad Umar directed the concerned to provide latest information about the availability of beds and other related facilities for the information of the infected people.\nThe forum was told that the Resource Management System (RMS) would be rolled out across country from the 1st of June. Under this system, the hospitals would also share the details of local resources available to them, total admitted patients, denial of admissions, no of beds and ventilators available, as well as other facilities being provided to them.\nDr Zafar Mirza said that his Ministry was planning to mobilise retired doctors of public sector hospitals, young doctors, doctors on house jobs, and final year medical students to cope with the situation. Moreover, new doctors and paramedics would be recruited through walk-in interviews.\nThe forum was apprised that the provinces had been asked to ensure community mobilisation and set up call Centres in their respective areas by June 15. The forum was told that Sindh and Balochistan governments were not agreeing on imposing smart lockdown. Instead, they preferred the home quarantine policy.\nThe meeting was attended by Interior Minister Brig (Retd) Syed Ijaz Ahmed Shah, Minister for National Food Security and Research Fakhar Imam, Minister for Economic Affairs Makhdoom Khusro Bakhtiar, Special Assistant to the Prime Minister on National Security Dr Moeed Yousaf and Special Assistant to the Prime Minister on Health Dr Zafar Mirza.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:16:34.602Z"
}
