{
  "title": "Pakistan flag installed at UNSC as country becomes non-permanent member for 8th time - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Pakistani national flag was installed in front of the United Nations Security Council chamber, as the country began its eighth term as a non-permanent member (2025-26) of the 15-member body, according to a press release issued by the Permanent Mission of Pakistan to the United Nations on Thursday.\n\nPakistan on Wednesday began a two-year term as a non-permanent member of the United Nations Security Council (UNSC).\n\nElected in June to replace Japan, Pakistan now occupies one of the two Asia-Pacific seats on the UNSC. It will preside over the council in July, a key opportunity to set the agenda and foster dialogue.\n\nThis marks Pakistan’s eighth term on the council, providing an opportunity to shape discussions on pivotal international issues, but also posing significant challenges.\n\n“As part of the joining ceremony, flags of the five new incoming non-permanent members — Pakistan, Denmark, Greece, Panama and Somalia — were installed at UNSC’s stakeout at the UN Headquarters in New York,” the press release said.\n\nThe new members replaced Japan, Ecuador, Malta, Mozambique and Switzerland whose terms ended on December 31, 2024.\n\nPakistan’s Alternate Permanent Representative, Ambassador Asim Iftikhar Ahmad, installed the flag as part of the ceremony.\n\nThe country will also get a seat on the Islamic State (ISIS) and Al Qaeda Sanctions Committee, which is responsible for designating individuals and groups as terrorists and imposing sanctions.\n\nThe Security Council has 15 members, five of which — Britain, China, France, Russia, and the United States — are permanent ones. The 10 non-permanent seats of the Council are allocated by geographic region, with five replaced each year.\n\nThe Security Council is considered to be the most powerful body of the United Nations. The council, which is tasked to maintain international peace and security, can make legally binding decisions and has the power to impose sanctions and authorise the use of force against states.\n\n“Pakistan will continue to be guided by the purposes and principles of the UN Charter including maintenance of international peace and security and development of friendly relations among nations based on the principle of equal rights and self-determination,” Ambassador Ahmad said on Friday.\n\nSpeaking at the UNSC ceremony, he said, “Pakistan will always remain a strong voice for peoples under foreign occupation and oppression and the realisation of their right to self-determination.”\n\nThe Pakistani envoy said that Pakistan was convinced that cooperative multilateralism, with the UN at its core, was the best way of tackling today’s multifaceted challenges.\n\n“We need to earnestly address the root causes of long-outstanding and new conflicts, prioritise dialogue and diplomacy, and support confidence building at regional and global levels to reduce tensions, arrest the arms race, and enable an environment conducive for peace, stability and development,” he said.\n\nAhmad added that Pakistan will partner with fellow members to actively pursue just and peaceful solutions to the issues on the Council’s agenda, and strive to make optimal use of the tools at our disposal — from conflict prevention to peacekeeping to peacebuilding — to achieve durable peace.\n\n“Our success lies in upholding the UN Charter and international law under all circumstances, and in ensuring effective implementation of the Security Council’s own decisions,” Ahmad said.\n\n“Never forgetting our solemn duty towards the millions of men, women and children suffering in conflicts, Pakistan is assuming this responsibility, fully resolved to our collective endeavour for a more peaceful and secure world,” he added.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/03125356f01c602.png",
  "retrievedAt": "2025-08-26T06:02:32.981Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882834/pakistan-flag-installed-at-unsc-as-country-becomes-non-permanent-member-for-8th-time",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T08:17:06.000Z"
}
