{
  "title": "American Muslims in a state of shock after New Orleans terror attack - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Shock and fear have engulfed America’s Muslim community as they grapple with the aftermath of Wednesday’s terror attack in New Orleans, which claimed 15 lives and left dozens injured.\n\nProminent Muslim organisations, including the Council on American-Islamic Relations (CAIR) and the Islamic Shura Council of Greater New Orleans, have strongly condemned the violence and mourned the victims. Among those killed was Kareem Badawi, a Muslim American student from Baton Rouge.\n\nThe tragedy has heightened apprehensions within the community, particularly following a statement by President-elect Donald Trump, who appeared to link the attack to immigration.\n\n“When I said that the criminals coming in are far worse than the criminals we have in our country, that statement was constantly refuted by Democrats and the Fake News Media, but it turned out to be true,” Trump said. “The crime rate in our country is at a level that nobody has ever seen before.”\n\nIn its statement, CAIR, North America’s largest Muslim civil rights and advocacy group, expressed condolences to the victims’ families and categorically rejected extremist ideologies like those promoted by Daesh. The group highlighted the background of the attacker, reportedly a man with a history of drunk driving and spousal abuse, who allegedly plotted to kill his family before claiming to have had dreams urging him to join Daesh.\n\nCAIR described the crime as yet another example of why extremist groups “have been rejected by the overwhelming majority of the Muslim world — from Islamic scholars to mosques, organisations, and individual Muslims”.\n\nThe Islamic Shura Council of Greater New Orleans echoed similar sentiments, calling the attack a devastating blow to the local community.\n\n“Our prayers as Muslims of the Greater New Orleans Area are with the victims and their families during this difficult time, and we extend our deepest sympathies to all those affected,” the council said.\n\nMeanwhile, a mosque near the Houston home of Shamsud-Din Jabbar, who police say carried out the New Year’s Day attack, has urged its congregation not to respond to media inquiries and to refer to other Islamic organisations if contacted by the FBI.\n\nIn an Instagram story posted after the attacker’s identity was announced, Masjid Bilal condemned what it described as “terrible acts”. The post also advised, “If approached by the FBI and a response is necessary, please refer to CAIR and ISGH,” referring to the Council on American-Islamic Relations and the Islamic Society of Greater Houston.\n\nPublic records reveal Jabbar’s troubled past, including a 2003 theft charge in Houston and a 2005 driving with a suspended licence case in Beaumont, both of which resulted in probation and fines. The New York Times reported that Jabbar was honourably discharged from the Army and converted to Islam at some point. A man married to Jabbar’s ex-wife claimed Jabbar had been acting erratically in recent months, referencing bizarre behavior like “cutting his hair” after his conversion.\n\nCNN reported that Jabbar recorded a series of videos, apparently while driving at night, where he discussed his divorces and revealed chilling plans to lure his family to a fake celebration with the intent of killing them.\n\nBoth CAIR and the Islamic Shura Council of Greater New Orleans reiterated the Muslim community’s longstanding rejection of extremist ideologies, calling for collective efforts to combat violence and hate.\n\nPublished in Dawn, January 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677760a6383ba.jpg",
  "retrievedAt": "2025-10-12T00:42:11.349Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882768/american-muslims-in-a-state-of-shock-after-new-orleans-terror-attack",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T03:58:20.000Z"
}
