{
  "title": "Balochistan Assembly calls for restoration of train services - Pakistan - DAWN.COM",
  "author": null,
  "content": "• MPAs seek resumption of 4G in Panjgur, division of Washuk constituency into two\n• Cabinet okays guidelines for carbon trading\n• Green-lights $100m World Bank project\n\nQUETTA: The Balochistan Assembly on Thursday adopted three key resolutions addressing long-standing issues in the province, including the restoration of passenger train services to Sindh, Punjab and Khyber Pakhtunkhwa, the division of the Washuk constituency into two, and the restoration of 4G internet services in Panjgur.\n\nDuring the session, presided over by Speaker Abdul Khaliq Achakzai, MPAs also raised concerns over law and order issues.\n\nJamaat-i-Islami’s Maulana Hida­yatur Rehman moved a resolution criticising Pakistan Rail­ways for depriving Balochistan of safe and affordable travel. The resolution urged the federal government to restore daily train services, including the Akbar Bugti Express, Chiltan Express, Abba­sine Express and Balochistan Express.\n\nThe assembly passed a resolution by National Party member Mir Rahmat Saleh Baloch, deman­ding the restoration of 4G internet services in Panjgur, which have been suspended for three years.\n\nThe resolution called for provincial authorities to press the federal government to take practical steps to address the issue, which has impacted education, business and communication in the region.\n\nAnother resolution, moved by JUI-F’s Mir Zabid Ali Reki, proposed dividing the Washuk district into two constituencies for the next provincial assembly elections. The resolution emphasised that Washuk’s large geographical size and dispersed population necessitate equitable representation for effective governance.\n\nLaw and order\n\nFormer chief minister Nawab Aslam Raisani raised concerns over ongoing military operations in the province. Speaking on a point of order, he criticised the government for simultaneously discussing dialogue while continuing operations.\n\n“Arrested individuals are not being presented in court but are instead forcibly disappeared,” he alleged. Speaker Achak­zai said the matter would be raised with the chief executive forclarification.\n\nMir Rahmat Saleh Baloch highlighted deteriorating security in Panjgur, citing recent attacks, including the assassination of a local government representative and a mosque shooting.\n\nCabinet meeting\n\nMeanwhile, the Balochistan cabinet approved several key initiatives on Thursday, including policy guidelines for trading in carbon markets, the release of funds for water resource development under a World Bank soft loan and projects aimed at improving education in the province’s remote areas.\n\nUnder these guidelines, a federal-level carbon market working group will be established, with representation from all four provinces.\n\n“A joint policy on carbon markets will be developed through mutual consultation between provinces, including Balochistan,” Balochistan government spokesman Shahid Rind said at a a press conference after the meeting.\n\nThe cabinet also approved the Balochistan Foundational Learn­ing Policy, aimed at driving educational reforms, improving standards and increasing literacy rates.\n\nIt also sanctioned a $100 million five-year project to enhance educational quality, ensure the enrolment of out-of-school children and address issues related to accessibility in remote areas.\n\nThis initiative, in collaboration with the World Bank, seeks to provide basic facilities to schools lacking essential infrastructure.\n\nThe cabinet further approved the Regularity Act 2024, which legalises the temporary recruitment of teachers. Under this act, teachers hired at the union council and local levels will not be transferred to other locations, ensuring stability in the education sector.\n\nPublished in Dawn, January 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:03:00.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882739/balochistan-assembly-calls-for-restoration-of-train-services",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T01:51:49.000Z"
}
