{
  "title": "Work on Rawalpindi’s key water supply scheme begins sans complete land acquisition - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Work on Developing Resilient Environment and Advancing Municipal Services (DREAMS) project worth Rs34 billion has begun at Chahan Dam sans the complete acquisition of land to address Rawalpindi’s worsening water woes.\n\nAsian development Bank (ADB) has provided fund worth Rs34.124 billion to the Punjab government for four mega projects in the garrison city to provide clean water to its residents.\n\nThe overall scope of DREAMS involves replacement of existing conductance main from Rawal Lake filtration plant to waterworks at Sufaid Tanki on Saidpur Road for Rs3.031 billion, augmentation of water supply and formation of district metered areas in Khayaban-i-Sir Syed for Rs1.662 billion, integrated water supply system based on Chahan Dam for Rs28.556 billion and hydrological and hydro geological assessment of water resources for sustainable supply of water for Rawalpindi city and environs for Rs875 million.\n\nIn the first phase, the construction of a filtration plant at Chahan Dam has begun. However, so far, only 9 acres of land has been acquired out of the 20 acres for laying water supply line from dam to city areas and construction of main filtration plant and pumping station.\n\n“An amount of Rs1,200 million was allocated for the land acquisition. So far, a payment of over Rs600 million has been made,” said a senior official of from the district administration while talking to Dawn.\n\nHe said that the land collector was working to acquire the required land and would likely complete the process soon.\n\nMeanwhile, Rawalpindi Commissioner Aamir Khattak visited the DREAMS-1 project and reviewed the ongoing work.\n\nHe gave necessary instructions regarding the completion and quality of the project.\n\nDuring the visit, Rawalpindi Water and Sanitation Agency (Wasa) Managing Director Mohammad Saleem Ashraf, Rawalpindi Development Authority (RDA) Director General (DG) Kinza Murtaza and other reverent officials were present.\n\nWhile briefing the commissioner, Wasa DG Mohammad Saleem Ashraf said around 1 million people will benefit from the project.\n\nHe said the multi-billion rupee project will be completed by December 2027.\n\nThe commissioner was told that the objective of the DREAMS project was to conserve ground water and augment water from surface water sources at 25.8 million gallon daily (mgd).\n\n“The project will increase revenue for Wasa by Rs100 million per month and water quality management will be ensured as per World Health Organisation standards,” the Wasa chief said.\n\nRegarding the progress of the project, it was said that the project was started a month ago and physical progress so far stood at five percent.\n\nCommissioner Khattak directed officials that quality and transparency should be ensured in the project.\n\nPublished in Dawn, January 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T06:02:33.403Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882819/work-on-rawalpindis-key-water-supply-scheme-begins-sans-complete-land-acquisition",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T05:17:13.000Z"
}
