{
  "title": "Minority MNA ‘disowned’ by his party finally quits - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A legislator elected to the National As­­sembly on a seat reserved for minorities resigned on Thursday, after months of controversy that saw his own party accuse him of being involved in “illegal and anti-state activities.”\n\nA National Assembly Se­­cretariat notification, issu­­ed on Thursday, announced the resignation of Mohan Manjiani, effective from Dec 31, 2024.\n\nManjiani was elected to the lower house in an MQM-P ticket after the Feb 8, 2024 elections, but found himself at odds with his party at the very outset of the parliamentary term, in March last year.\n\nMQM-P sources confirmed the development, saying that “the party has already made its viewpoint very clear about the deposed legislator”.\n\nAt the time, the ECP’s suspended his membership on his party’s insistence that he had resigned. However, Manjiani immediately claimed that he had done no such thing and accused the party of ‘faking’ the whole episode.\n\nThe controversy began after the MQM-P’s coordination committee reportedly asked Manjiani to resign based “on a report from intelligence agencies”. The party had claimed that the resignation was sought on the basis of reports of his involvement in “illegal and anti-state activities”.\n\n“Mo­­han Manjiani was also no­­ted as being active in the In­­­dian Embassy in Isla­m­abad,” MQM-P said in a sta­­tement in March 2024. The development came just a day after claims surfaced on social media that Manjiani had ‘bought’ the minority seat from the party against a “certain amount of donation”.\n\nHowever, a dispute had emerged between the two sides and the ‘deal’ couldn’t materialise, which led to the party disowning him before the ECP.\n\nManjiani described his alleged resignation as being ‘staged and set up’ by the MQM-P. He also claimed that he was no longer in contact with the party, and that the supposed resignation bore his ‘forged signature’.\n\nPublished in Dawn, January 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6777429737959.gif",
  "retrievedAt": "2025-10-12T01:10:58.661Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882746/minority-mna-disowned-by-his-party-finally-quits",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T01:51:48.000Z"
}
