{
  "title": "Former crypto executive Do Kwon pleads not guilty in US - World - DAWN.COM",
  "author": null,
  "content": "NEW YORK: Former cryptocurrency executive Do Kwon pleaded not guilty to US fraud charges, at hearing in Manhattan federal court, on Thursday.\n\nThe South Korean cryptocurrency entrepreneur behind two digital currencies that lost an estimated $40 billion in 2022, appeared in US court to face criminal fraud charges after being extradited from Montenegro this week.\n\nFederal prosecutors in Manhattan charged Kwon, who co-founded Singapore-based Terraform Labs and developed the TerraUSD and Luna currencies, in March 2023 with two counts each of securities fraud, wire fraud, commodities fraud and conspiracy.\n\nAn updated 79-page indictment filed on Thursday charged him with an additional count of money laundering conspiracy.\n\nKwon, 33, has denied wrongdoing. He agreed last June to pay an $80 million civil fine and be banned from crypto transactions as part of a $4.55 billion settlement that he and Terraform reached with the US Securities and Exchange Commission.\n\nHe was due to appear at 12:30pm (1730 GMT) before US Magistrate Judge Robert Lehrburger in Manhattan federal court.\n\nIn Thursday’s indictment, the Manhattan US Attorney’s office alleged Kwon misled investors in 2021 about TerraUSD, a so-called stablecoin designed to maintain a value of $1.\n\nKwon allegedly told investors a computer algorithm known as “Terra Protocol” had restored the coin’s value when it slipped below its peg in May 2021, when in fact he arranged for a high-frequency trading firm to secretly buy millions of dollars of the token to artificially prop up its price.\n\nProsecutors said that false claim and others drove retail and institutional investors to buy Terraform products and boost the value of Luna, a more traditional token developed by Kwon that fluctuated in value but was closely linked to TerraUSD, to $50 billion by the spring of 2022.\n\n“Much of this growth followed Kwon’s brazen deceptions about Terraform and its technology,” the indictment said. When TerraUSD’s value began sliding again in May 2022, the trading firm warned that propping it up “wasn’t so simple this time,” according to the indictment.\n\nTerraUSD and Luna crashed that month, dragging down the value of other cryptocurrencies, including bitcoin, and caused wider havoc in the crypto market.\n\nProsecutors did not identify the trading firm, but it matches the description of Jump Trading, which SEC lawyers said in their civil case had propped up TerraUSD in May 2021. In a trial on the SEC’s claims, a federal jury in Manhattan found Kwon and Terraform liable last April for defrauding cryptocurrency investors.\n\nA lawyer for Terraform said in closing arguments in that trial that Terraform and Kwon had been truthful about their products and how they worked, even when they failed.\n\nPublished in Dawn, January 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/677743a2f0243.gif",
  "retrievedAt": "2025-10-12T00:42:27.528Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882748/former-crypto-executive-do-kwon-pleads-not-guilty-in-us",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T02:04:22.000Z"
}
