{
  "title": "Govt committed to eliminating TTP to ensure socio-economic development: PM Shehbaz - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif said on Friday the government was committed to eliminating the banned Tehreek-i-Taliban Pakistan (TTP) outfit to ensure the country’s socio-economic development.\n\nPakistan has recently witnessed an uptick in terror activities, especially in Khyber Pakhtunkhwa and Balochistan.\n\nTerror attacks have increased since the TTP broke a fragile ceasefire agreement with the government. With at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade.\n\nEqually alarming were the cumulative losses of civilians and security personnel: 1,612 fatalities, accounting for over 63 per cent of the total recorded the past year and marking 73pc more losses compared to 934 outlaws eliminated. The overall fatalities recorded last year were a record nine-year high, and over 66pc more than in 2023. On average, nearly seven lives were lost daily.\n\nAddressing a meeting of the National Action Plan Apex Committee, PM Shehbaz said: “The agenda of Pakistan’s progress and prosperity that we discussed yesterday can only be [realised] when all of us not only improve law and order across Pakistan but also the time has come to completely wipe out the TTP.”\n\nThe prime minister stressed that the federal government, the provinces and all relevant stakeholders should make a comprehensive plan in collaboration with the security forces.\n\nHe pledged that with unity of thought and action, the government would implement such plans in letter and spirit, to resolve all challenges faced by the country.\n\nThe premier pointed out that the government was aware that some terrorist intruders were living in the country, especially in KP and Balochistan, to disturb the peace and which countries were supporting them.\n\nReferring to the weekend’s skirmishes with Afghan forces at the border, he said a “befitting response” was given.\n\nIn July, the government, through an official notification, designated the TTP as Fitna al Khawarij, while mandating all institutions to use the term khariji (outcast) when referring to the perpetrators of terrorist attacks on Pakistan.\n\nThe prime minister also vowed to tackle the growing challenge of digital media, including misinformation and disinformation on social media platforms, calling it inevitable for the elimination of terrorism and extremism from the country.\n\n“On the digital front, the venom against Pakistan is being spitted through social media from some elements abroad. This is also a big challenge, which is supported by distorted facts and twisted reality,” the prime minister said.\n\nThe prime minister said that certain questions were being raised by distorting facts and twisting the reality on social media that were denting the state’s image.\n\n“If we don’t counter this challenge, all efforts [to eliminate terrorism and extremism in the country] will go to waste,” he said, expressing confidence that the government would overcome such challenges.\n\nPM Shehbaz also congratulated the nation on Pakistan assuming its non-permanent membership of the United Nations Security Council.\n\nThe meeting was attended by Deputy Prime Minister and Foreign Minister Ishaq Dar, the federal cabinet members, chief ministers of all provinces, Chief of Army Staff General Asim Munir and other senior officials.\n\nA day ago, the premier said the country’s economic progress depended on achieving “complete peace” amid the security challenges the country was facing.\n\nSpeaking at a meeting of the Special Investment Facilitation Council, he had said that economic development was directly linked with political stability as the strength of a country’s economy was deeply rooted in its political framework.\n\n“Security has become a big challenge today and we cannot move forward without crushing the head of [terrorism].”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/0316241016b2f2a.png",
  "retrievedAt": "2025-08-26T06:02:32.991Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1882849/govt-committed-to-eliminating-ttp-to-ensure-socio-economic-development-pm-shehbaz",
  "dateList": "2025-01-03",
  "date_published": "2025-01-03T11:55:23.000Z"
}
