{
  "title": "MQM founder Altaf Hussain’s condition has ‘greatly improved’: party official - World - DAWN.COM",
  "author": null,
  "content": "Muttahida Qaumi Movement (MQM) founder Altaf Hussain’s health has been on the mend after he was admitted to the hospital, according to a video by a party official posted on Saturday.\n\nHussain was recently hospitalised in London due to “severe illness”, where he underwent multiple tests. London-based senior party leader Mustafa Azizabadi told Dawn.com that the MQM founder’s treatment was ongoing and “hopefully it’s not something serious”.\n\nIn a video message posted early on X today, Azizabadi stated that the MQM founder’s health had improved since yesterday.\n\n“Altaf Hussain bhai (brother) has undergone some tests and blood transfusion has been given. The tests show that Altaf bhai’s health … has greatly improved,” Azizabadi said. “Doctors are treating him according to the test results.”\n\nHe highlighted that misinformation had spread about Hussain’s condition, calling it “upsetting”.\n\nAn update from MQM Coordination Committee Deputy Convener Qasim Ali said doctors conducted a detailed medical examination and agreed to continue treatment in light of the test reports from a day ago.\n\n“Doctors have advised continuing blood transfusions for Altaf Hussain today as well due to a decrease in blood count.”\n\nPreviously known as the Mohajir Qaumi Movement, Hussain founded his party in 1984 to represent the Urdu-speaking community, which had migrated to Pakistan amid Partition.\n\nUnder Hussain’s leadership, MQM swept the 1988 election in Sindh’s urban areas, emerging as the third-largest party in the country.\n\nThe MQM under Hussain was accused of using violent tactics to attain and retain political power. On the contrary, Hussain maintained that the state and other political parties have targeted MQM and its workers ever since its formation.\n\nHussain currently lives in London, where he has been in self-imposed exile since 1992. He was later granted British citizenship. From London, Hussain played an active role in politics, regularly broadcasting political speeches to his followers in Karachi.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/19150958f904cdc.png?r=151110",
  "retrievedAt": "2025-08-17T20:15:56.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923722/mqm-founder-altaf-hussains-condition-has-greatly-improved-party-official",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T12:09:54.000Z"
}
