{
  "title": "JUI-F chief Fazl advises ‘change’ in Khyber Pakhtunkhwa administration - Pakistan - DAWN.COM",
  "author": null,
  "content": "Jamiat Ulema-i-Islam-Fazl (JUI-F) chief Maulana Fazlur Rehman on Saturday suggested that there should be a “change” in the PTI-led Khyber Pakht­un­khwa government, adding that it would be better if the change came from within the ruling party amid reports of possible efforts afoot to bring a “regime change” in the province.\n\nPrime Minister Shehbaz Sharif had met two key leaders from the province, ostensibly to get a handle on the political situation. The PML-N-led ruling coalition in the Centre believes that the PTI government in KP has failed to deliver for over a decade, and recent events have further cemented their conviction that the provincial government is failing to safeguard the lives of the people. Meanwhile, the PTI has warned against any attempt to topple the provincial government through constitutional means.\n\nAddressing the matter at a press conference in Peshawar today, the JUI-F chief said, “My advice would be that there should be a change in the province but if the PTI is in the majority, then the change should be from within the majority of the PTI. If the same people come together to bring a change in the provincial government, then it will be better.”\n\nFazl said he preferred this option rather than the opposition coming together and bringing a change in the government.\n\nHe added that it was his belief and that of his party that the majority of the province was “fake” and a product of rigging but it could not tolerate any political struggle or uncertainty, thus it would be better if there was a change from within the ruling PTI.\n\nSpeaking on the prevailing security situation in the province, Fazl said, “The common citizen’s life is insecure today.\n\n“If the opposition parties contact us then will we talk to them and also try to hold an all party conference to discuss this issue and come up with a strategy to deal with it.”\n\nSpeaking about the merger of Fata with KP, he said, “We strongly opposed the merger when it was being done.”\n\nFazl said that the committee formed to bring reforms in ex-Fata did not have representation from KP.\n\n“From all the parties, only we have been asked for representatives for the committee, but we haven’t given our representatives,” he added. The JUI-F chief said that the party would take its decision in consultation with tomorrow’s grand tribal jirga.\n\n“Is this decision an admission of the failure of the previous decision (Fata merger) or another ploy to gain access to the minerals of the area?” he asked.\n\nThe JUI-F chief said that if he was content with the federal government’s decisions, then he would have joined them. “Both the federal and the provincial governments were a result of electoral rigging,” Fazl said.\n\nLater, JUI-F Senator Kamran Murtaza said, “We have had reservations against KP Chief Minister Ali Amin Gandapur.”\n\nSpeaking on Geo News programme ‘Naya Pakistan’, Murtaza said that he had personal reservations with Gandapur and his party did as well.\n\n“The reason is his inappropriate behaviour and language; he is not a well-liked personality for us,” the senator said.\n\n“However, we don’t want the government to fall. So if PTI itself takes that decision that a certain individual will not continue and will be replaced by another, JUI-F would certainly welcome that decision,” Murtaza said.\n\nHe added that Gandapur being from Dera Ismail Khan, the same district Fazl hailed from, was not a a factor in the decision.\n\nMeanwhile, KP Governor Faisal Karim Kundi said that the ex-Fata committee was not “about reversing the merger of Fata and the province”.\n\nAddressing a press conference in Peshawar, he said, “The committee was formed when the prime minister and Field Marshal [Asim] Munir visited and a jirga was held.\n\n“The provincial government said that the jirga system that had ended in the merged districts should be revived, and this is what the committee was formed for.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/12181440c05eb6d.png",
  "retrievedAt": "2025-08-17T20:15:47.789Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923729/jui-f-chief-fazl-advises-change-in-khyber-pakhtunkhwa-administration",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T13:39:16.000Z"
}
