{
  "title": "Tears and fury as families bury bus attack victims - Newspaper - DAWN.COM",
  "author": null,
  "content": "• One victim had married just three months ago; another’s father dies of shock when body brought home\n• CM Bugti reviews security situation, orders Levies, police to pursue suspects without jurisdictional constraints\n• PM Shehbaz condemns killings, vows strong action against terrorism\n\nQUETTA: The nine victims who were abducted and killed in Balochistan after gunmen stopped two passenger buses on a highway, were laid to rest in their native towns on Friday.\n\nThe attacks occurred on Thursday evening in the Sur-Dakai area, located on the border between the Zhob and Loralai districts, as the buses were travelling from Quetta to Punjab.\n\nSecurity forces recovered the bodies of all nine victims from the mountainous area of Doob in Zhob district during a search operation overnight. The bodies were shifted to the district hospital in Zhob and moved to their hometowns in Punjab on Friday morning.\n\nThe victims were identified as Muhammad Irfan (Dera Ghazi Khan), Sabir Ali (Gujranwala), Muhammad Asif (Muzaffargarh), Ghulam Saeed (Lodhran), Muhammad Junaid Ahmad (Gojra), Muhammad Bilal (Attock), Bilawal (Gujrat), and two brothers Usman and Jabir Toor (Lodhran).\n\nThe funeral prayers of Muhammad Asif, who had married just three months ago, were offered in his hometown and attended by thousands of people.\n\nThe bodies of the two brothers, Usman and Jabir Toor, from Dunyapur in Lodhran district, were brought from Quetta in ambulances. Dawn learnt that they had been travelling from Quetta to Multan to attend their father’s funeral when they were killed. A large number of people, including their family members and political figures, attended their funeral.\n\nThe victim Ghulam Saeed — a sepoy from Village 72/15-L, Chamb Kalan, Lodhran — was on his way to visit his ailing father when he was murdered by the attackers. Tragically, his ailing father couldn’t bear the news and died of shock when his son’s body was brought home.\n\nThe victim Junaid Ahmad was the son of journalist Iftikhar Ahmad Ansari.\n\nOn Thursday, the armed assailants intercepted the buses, AK Movers and Super Mekhtar, around 5:30pm. The atta­ckers then conducted identity checks on passengers and abducted 12 individuals. Three were later released, while the remaining nine were brutally murdered.\n\nThe banned Balochistan Liberation Front later claimed responsibility for the attack. The group’s spokesperson said it had killed the nine people after blo­cking the highway between Musa­khail-Makhtar and Khajuri, Dawn.com reported.\n\nThe Counter-Terrorism Department (CTD) of Balochistan Police has registered an FIR against unknown individuals for the abduction and killing of nine passengers in Zhob. CTD officials confirmed on Friday night that the FIR was registered following a complaint filed by the SHO of the Levies Thana in Zhob.\n\nCM reviews security\n\nMeanwhile, a high-level meeting on law and order, presided over by Balochistan Chief Minister Sarfraz Bugti, reviewed the province’s overall security situation with particular focus on the Sur-Dakai attack.\n\nInspector General of Police Balochistan, Moazzam Jah Ansari, and other senior security officials briefed the meeting on the motives behind the attack, the progress made in the investigation, and the actions taken by law enforcement agencies in response to the incident.\n\nCM Bugti termed the attack a serious attempt to challenge the writ of the state and issued strict instructions to ensure thatthe perpetrators are brought to justice.\n\n“Those who spill the blood of innocent civilians in Balochistan deserve no leniency,” he said, adding that the terrorists will be pursued relentlessly and decisive action will be taken against them. The chief minister emphasised the need for seamless coordination between police and Levies forces, instructing that jurisdictional boundaries must not hinder operations.\n\n“A united and effective response is imperative to ensure such elements never reemerge,” he said. “There will be no compromise on the enforcement of law in Balochistan,” Mr Bugti said. “The enemies of peace will be dealt with with full force.”\n\nAt the start of the meeting, Fateha was offered for the victims of the Sur-Dakai incident. Chief Minister Bugti paid tribute to the victims and reaffirmed his government’s commitment to maintaining peace and order across the province.\n\nPM condemns killings\n\nPrime Minister Shehbaz Sharif on Friday strongly condemned the kidnapping and killing of bus passengers, vowing to avenge the blood ofinnocent people, APP reported.\n\n“We will deal with terrorists with full force. The blood of innocent people will be avenged,” the prime minister said in a statement issued by his office. He said that the killing of unarmed civilians was a blatant act of terrorism by Fitnatul Hindustan. “With resolve, unity and strength, we will confront the scourge of terrorism and uproot it completely,” he resolved.\n\nTariq Saeed in Toba Tek Singh, Tariq Saeed Birmani in Dera Ghazi Khan and Majeed Gill in Bahawalpur also contributed to this report\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6871b026e487f.gif",
  "retrievedAt": "2025-08-17T20:16:20.946Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923667",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:46:32.000Z"
}
