{
  "title": "Punjab govt, opposition to talk out MPAs’ suspension - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The treasury and opposition in the Punjab Assembly have agreed to resolve issues through talks after days of acrimony and recriminations, which began with a raucous protest in the house during the chief minister’s speech last month.\n\nOn June 27, PTI lawmakers protested in the house during CM Maryam Nawaz Sharif’s speech, where she highlighted her government’s achievements and budget priorities.\n\nThe proceedings broke into a disarray as lawmakers surrounded the speaker’s dais and raised slogans. In response, Speaker Malik Ahmed Khan suspended 26 opposition lawmakers for 15 sittings and fined 10 MPAs Rs200,000 each for “damaging public property”.\n\nHe then filed disqualification references with the Election Com­mission against the 26 PTI legislators over “unparliamentary conduct”.\n\nThe speaker’s move drew widespread condemnation for being “excessive”. Experts said the move was “disturbing” and set a “dangerous precedent”.\n\nPA speaker meets penalised lawmakers; bipartisan committee to hold dialogue on deseating of members.\n\nThe speaker vehemently defended his neutrality and constitutional auth­ority to move against the opposition lawmakers, saying such powers had been exercised in the past and were legally valid.\n\nHowever, a hint of rapprochement between the government and the opposition appeared on Thursday when Speaker Khan invited the 26 PTI MPAs to present their point of view on the disqualification references filed by treasury members.\n\nThe suspended MPAs, led by Opposition Leader Ahmed Khan Bhachar, reached the speaker’s chamber by noon on Friday.\n\nThey were also joined by Finance Minister Mujtaba Shujaur Rehman, PML-N’s chief whip Rana Arshad and others.\n\nWhile formal hearings were held on applications submitted by the government members, discussions between the two sides continued for over an hour.\n\nThe two sides agreed to form a 15-member committee, headed by the speaker and having equal representation from the treasury and opposition, to sort out the issue.\n\nThe committee will meet at the assembly on Sunday to further the dialogue.\n\nThe speaker welcomed the move to find a “constitutional, legal, and parliamentary” solution to the issue.\n\n“Dialogue and consultation are the essence of parliamentary democracy. Every disagreement can be resolved through a positive, dignified, and constitutional approach,” he said.\n\nHe termed the entire process a “positive parliamentary tradition” and hoped all parties would move forward with “wisdom, patience, and a commitment to democratic values”.\n\nTalking to the media after the meeting, Mr Rehman said the speaker should make a decision in accordance with the Constitution and law and ruled out any leniency in penalising those who created a commotion in the house.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/12072627a306ad7.jpg",
  "retrievedAt": "2025-08-17T20:18:05.174Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923664/punjab-govt-opposition-to-talk-out-mpas-suspension",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:46:32.000Z"
}
