{
  "title": "Families evacuated in Charsadda as river swells after downpour - Pakistan - DAWN.COM",
  "author": null,
  "content": "CHARSADDA/DERA ISMAIL KHAN: The Jendi River flooded after a heavy rainfall in Charsadda, Tangi and nearby areas late on Thursday.\n\nThe spillways in the Playi Dam were opened due to an alarming surge in the water level, causing around 8,000 cusecs of water to enter the river.\n\nAssistant commissioner of Tangi Waqas Afridi urged residents living alongside the river, especially in Kanwar and Sherpao areas, to take precautionary measures and avoid crossing the river in view of the possible danger.\n\nA control room was established under the leadership of newly-appointed deputy commissioner Dr Azmat Wazir.\n\nThe district administration, Rescue 1122, irrigation department, police and other agencies visited various places of the Jendi River, Kanwar, Sherpao, Tarangzai, Utmanzai, Qazikhell, Plaza and Sharabhel.\n\nThe flood damaged a bridge and a gas pipeline in Tangi tehsil. The district administration said it had converted 53 government schools into temporary shelter homes to protect people, while vehicles of various agencies, including TMA, were being used to evacuate residents.\n\nA total of 105 people were evacuated to safer places from the areas affected by floodwaters. They included four from Sherpao Kanwar, 10 from Cheena Umarzai and 76 from Gaidar Kali.\n\nMeanwhile, six people, mostly persons with disabilities, were injured when the roof of a house collapsed in Mahmudabad Umarzai. All the injured were shifted to the DHQ hospital by Rescue 1122 after being given first aid. Six ambulances, disaster vehicles, water rescue vehicles and 90 rescue personnel participated in the rescue operation.\n\nThe district administration and rescue agencies are fully alert. Deputy Commissioner Charsadda Dr Azmat Wazir has made it clear that negligence will not be tolerated at any level. Citizens have been appealed to continue taking precautionary measures despite the decline in water level and to contact the control room on 0919220024 or 1122 in any emergency.\n\nMeanwhile, rain accompanied by strong winds lashed Dera Ismail Khan and Tank districts on Friday. According to the Pakistan Meteorological Department, 38mm of rainfall was recorded in Dera Ismail Khan city, with more precipitation falling in hilly and rural areas.\n\nThe downpour caused urban flooding in several low-lying areas such as Mohallah Jogianwala, Gandapur Chowk, New Town and adjacent informal settlements. Residents complained about poor drainage. Rescue 1122 and district administration teams were deployed for relief and evacuation efforts.\n\nThe water level at Chashma barrage on the Indus River rose rapidly. The irrigation department confirmed a moderate flood, saying several villages were submerged in riverine (kacha) areas. Evacuation operations via boats are under way in these areas.\n\nMeanwhile, flash floods were reported in mountainous streams and nullahs following heavy rainfall in the hills of South Waziristan and Jandola tehsil of Tank district.\n\nAccording to the Tank administration, residents of low-lying villages have been warned to take precautionary measures and relocate if necessary.\n\nThe PMD forecast more rainfall in the next 48 hours and issued a flood alert for vulnerable regions. Rainfall was also reported in southern regions like Bannu, Lakki Marwat, Karak and Kohat.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:16:27.746Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923560/families-evacuated-in-charsadda-as-river-swells-after-downpour",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:47:36.000Z"
}
