{
  "title": "Man killed by wife’s relatives over allegedly murdering her in Hyderabad: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "A 50-year-old woman was allegedly murdered by her husband over a domestic dispute in Sindh’s Hyderabad with the man himself beaten to death by the wife’s family in retaliation, according to the police.\n\nHusri Station House Officer (SHO) Juman Khoso told Dawn.com that a man killed his wife over “some domestic issue” in the village of Khuda Dino Panhwar. He added that the victim’s family members beat the suspect to death as well after the alleged murder.\n\n“The suspect used an axe and sticks in beating his wife to death and was also mercilessly beaten,” he said.\n\nKhoso said that neighbours of the couple claimed the suspect often used to beat his wife over petty issues and such incidents had become a matter of daily routine. “Even neighbours had given up intervening to resolve the issue,” he added.\n\nThe SHO said that as per the woman’s relatives, the suspect had previously served a jail term for the murder of two people.\n\nThe bodies were taken to the local branch of Liaquat University Hospital and the police were reported to have detained some suspects. No first information report has been lodged so far.\n\nIncidents of violence against women are common across the country. In December 2023, a study by the Asian Development Bank reported that domestic violence was emerging as a silent pandemic in Pakistan, posing a serious challenge to society and the state.\n\nIn April, a man was arrested for the murder of his wife over ‘honour’ in Karachi’s Gulshan-i-Iqbal neighbourhood.\n\nThe same month, another woman was alleged to have been murdered in a so-called honour killing near the Superhighway in Karachi, while a man was arrested on charges of killing his pregnant wife after he misled the police as to her cause of death.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/14192003fa4f929.jpg?r=192020",
  "retrievedAt": "2025-08-17T20:15:49.920Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923730/man-killed-by-wifes-relatives-over-allegedly-murdering-her-in-hyderabad-police",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T15:07:10.000Z"
}
