{
  "title": "Proposal outlines large-scale ‘humanitarian transit areas’ for Palestinians in Gaza - Newspaper - DAWN.COM",
  "author": null,
  "content": "LONDON: A proposal bearing the name of a controversial US-backed aid group and floated last week, described a plan to build large-scale camps, to be known as “humanitarian transit areas”, inside — and possibly outside — Gaza to house the Palestinian population.\n\nIt outlines a vision of “replacing Hamas’s control over the population in Gaza”.\n\nThe $2 billion plan, created sometime after Feb 11 and carrying the name of the US-backed Gaza Humanitarian Foundation (GHF), was submitted to the Trump administration, according to two sources, one of whom said it was recently discussed in the White House.\n\nThe plan describes the camps as “large-scale” and “voluntary” places where Palestinians could temporarily reside, deradicalise, reintegrate and prepare to relocate if they wish to do so.\n\nThe Washington Post made a reference to GHF plans to build housing compounds for Palestinian non-combatants in May.\n\nA slide deck goes into granular detail on the transit zones, including how they would be implemented and what they would cost.\n\nIt calls for using the sprawling facilities to “gain trust with the local population” and to facilitate US President Donald Trump’s “vision for Gaza”.\n\nThe aid group, responding to questions from Reuters, denied that it had submitted a proposal and said the slides “are not a GHF document.”\n\nGHF said it had studied “a range of theoretical options to safely deliver aid in Gaza,” but that it “is not planning for or implementing Humanitarian Transit Areas (HTAs)”.\n\nRather, the organisation said it is solely focused on food distribution in Gaza.\n\nA spokesperson for SRS, a for-profit contracting company that works with GHF, said “we have had no discussions with GHF about HTAs, and our ‘next phase’ is feeding more people. Any suggestion otherwise is entirely false and misrepresents the scope of our operations”.\n\nRelocation fears\n\nOn Feb 4, Trump first publicly said that the US should “take over” the war-battered enclave and rebuild it as “the Riviera of the Middle East” after resettling the population of 2.3 million Palestinians elsewhere.\n\nTrump’s comments angered many Palestinians and humanitarian groups about the possible forced relocation from Gaza. Even if the GHF proposal is no longer under consideration, the idea of moving a large portion of the population into camps will only deepen such worries, several humanitarian experts said.\n\nThe proposal was laid out in a slide presentation that a source said was submitted to the US embassy in Jerusalem earlier this year.\n\nThe US State Department declined to comment. A senior administration official said, “nothing of the like is under consideration. Also, no resources are being directed to that end in any way.”\n\nThe source working on the project said that it had not moved forward due to a lack of funds.\n\nIt was previously reported that GHF had attempted to set up a Swiss bank account from which to solicit donations, but UBS and Goldman Sachs declined to work with the organisation.\n\nThe Israeli Embassy in the US did not respond to a request for comment.\n\nIsmail Al-Thawabta, director of the Hamas-run Gaza government media office, said it “categorically” rejects the GHF, calling it “not a relief organisation but rather an intelligence and security tool affiliated with the Israeli occupation, operating under a false humanitarian guise.”\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/120959484b81d7e.jpg",
  "retrievedAt": "2025-08-17T20:16:10.724Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923631/proposal-outlines-large-scale-humanitarian-transit-areas-for-palestinians-in-gaza",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:47:03.000Z"
}
