{
  "title": "Lahore police avert mob attack on Ahmadi worship place - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The police reportedly thwarted a mob attack on a worship place of the Ahmadi community in Samanabad here on Friday.\n\nA strong contingent of force from several police stations responded to the emergency 15 call from the community when local residents were about to march towards their (Ahmadi) worship place.\n\n“Six SHOs, a DSP, a divisional SP and an SSP rushed to the site along with armed policemen on the direction of Lahore Operations DIG Faisal Kamran to rescue members of the Ahmadi community at any cost,” a police officer told Dawn. He said some women and children were also among the worshippers.\n\nAs the mob tried to surround the worship place, the police launched a major operation and rescued women, children and other worshippers, shifted them to a secured area and increased security of the worship place.\n\nPolice high-ups also engaged known local figures, including religious leaders, to maintain peace.\n\nAn Ahmadi worshipper told Dawn his community had built a worship place on Poonch Road and got it registered with the relevant government department. He said during their prayers, they heard some slogans outside the worship place, which terrified the community.\n\n“I also rushed out of the worship place using the backdoor, left my motorbike unattended and ran to avoid a possible attack.”\n\nHe said he witnessed many charged people gathering on the road, calling people to reach the site hurriedly. He said they seemed to be members of a religious party hurling some serious threats and demanding closure of the Ahmadi worship place.\n\n“The Ahmadi community took a sigh of relief when a heavy contingent of the police reached the site, took many of them into custody and rescued the worshippers, shifting them to a safe place,” he said.\n\nHe said the protesters had accused the Ahmadi community of violating the time schedule of worship on Friday. However, he rejected the charge and said they were following the given schedule.\n\nThe Operations DIG said the police managed to thwart the possible mob attack on the Ahmadi worship place. He said those who gathered outside the Ahmadi worship place were members of a religious-cum-political party pressing for a change in Ahmadi worship timing.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/04110050935a7f8.jpg?r=110056",
  "retrievedAt": "2025-08-17T20:16:44.040Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923584/lahore-police-avert-mob-attack-on-ahmadi-worship-place",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:47:21.000Z"
}
