{
  "title": "Air India crash report shows pilot confusion over engine switch movement - World - DAWN.COM",
  "author": null,
  "content": "A preliminary report depicted confusion in the cockpit shortly before an Air India jetliner crashed and killed 260 people last month, after the plane’s engine fuel cutoff switches flipped almost simultaneously and starved the engines of fuel.\n\nThe Boeing 787 Dreamliner bound for London from the Indian city of Ahmedabad began to lose thrust and sink shortly after takeoff, according to the report on the world’s deadliest aviation accident in a decade released on Saturday by Indian accident investigators.\n\nThe report by India’s Aircraft Accident Investigation Bureau (AAIB) about the June 12 crash raises fresh questions over the position of the critical engine fuel cutoff switches.\n\nAlmost immediately after the plane lifted off the ground, closed-circuit TV footage showed a backup energy source called a ram air turbine had deployed, indicating a loss of power from the engines.\n\nIn the flight’s final moments, one pilot was heard on the cockpit voice recorder asking the other why he cut off the fuel. “The other pilot responded that he did not do so,” the report said.\n\nIt did not identify which remarks were made by the flight’s captain and which by the first officer, nor which pilot transmitted “Mayday, Mayday, Mayday” just before the crash.\n\nThe commanding pilot of the Air India plane was Sumeet Sabharwal, 56, who had a total flying experience of 15,638 hours and, according to the Indian government, was also an Air India instructor. His co-pilot was Clive Kunder, 32, who had 3,403 hours of total experience.\n\nThe fuel switches had almost simultaneously flipped from run to cutoff just after takeoff. The preliminary report did not say how the switches could have flipped to the cutoff position during the flight.\n\nThe crash is a challenge for Tata Group’s ambitious campaign to restore Air India’s reputation and revamp its fleet, after taking the carrier over from the government in 2022.\n\nAir India acknowledged the report in a statement. The carrier said it was cooperating with Indian authorities but declined further comment.\n\nExperts have said a pilot would not be able to accidentally move the fuel switches.\n\n“If they were moved because of a pilot, why?” asked US aviation safety expert Anthony Brickhouse.\n\nThe switches flipped a second apart, the report said, roughly the time it would take to shift one and then the other, according to US aviation expert John Nance. He added that a pilot would normally never turn the switches off in flight, especially as the plane is starting to climb.\n\nFlipping to the cutoff almost immediately cuts the engines. It is most often used to turn engines off once a plane has arrived at its airport gate and in certain emergency situations, such as an engine fire. The report does not indicate there was any emergency requiring an engine cutoff.\n\nAt the crash site, both fuel switches were found in the run position and there had been indications of both engines relighting before the low-altitude crash, said the report, which was released around 1:30am IST today (1:00am PKT).\n\nAsked about the report, the father of first officer Kunder told reporters, “I am not from the airline”, declining to comment further during a prayer meeting held in the memory of the airline’s crew on Saturday in Mumbai, where emotional scenes played out among grieving relatives.\n\nThe US National Transportation Safety Board thanked Indian officials for their cooperation in a statement and noted that there were no recommended actions in the report aimed at operators of Boeing 787 jets or the GE engines.\n\nThe US Federal Aviation Administration said its priority was to follow the facts where they lead, and it was committed to promptly addressing any risks identified throughout the process.\n\nBoeing said it continued to support the investigation and its customer, Air India. GE Aerospace did not respond immediately to a request for comment.\n\nThe AAIB, an office under India’s civil aviation ministry, is leading the probe into the crash, which killed all but one of the 242 people on board and 19 others on the ground.\n\nMost air crashes are caused by multiple factors, with a preliminary report due 30 days after the accident, according to international rules, and a final report expected within a year.\n\nThe plane’s black boxes, combined cockpit voice recorders and flight data recorders, were recovered in the days following the crash and later downloaded in India.\n\nThe report said “all applicable airworthiness directives and alert service bulletins were complied [with] on the aircraft as well as engines.”\n\nThe airport closed-circuit TV recording from Ahmedabad had earlier shown the Air India plane rose to a height of 650 feet after it took off, but then suddenly lost altitude, crashing in a fireball into a nearby building.\n\nThe investigation report said as the Dreamliner lost altitude, it initially made contact with several trees and an incineration chimney, before hitting the building.\n\nAir India has faced additional scrutiny on other fronts after the crash.\n\nThe European Union Aviation Safety Agency said last week it plans to investigate its budget airline, Air India Express, after Reuters reported the carrier did not follow a directive to change engine parts of an Airbus A320 in a timely manner and falsified records to show compliance.\n\nIndia is banking on a boom in aviation to support wider development goals, with New Delhi saying it wants India to be a job-creating global aviation hub along the lines of Dubai.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/121306582f64c21.jpg",
  "retrievedAt": "2025-08-17T20:16:02.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923703/air-india-crash-report-shows-pilot-confusion-over-engine-switch-movement",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T08:19:03.000Z"
}
