{
  "title": "Foreigners withdraw over $1.5bn from T-bills in FY25 - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Foreign investment outflows from treasury bills (T-bills) exceeded $1.5 billion in FY25, with June recording the highest monthly outflow, according to data released by the State Bank of Pakistan (SBP) on Friday.\n\nThe data show that outflows from domestic bonds were 24pc higher than inflows during the fiscal year. Total foreign inflows in T-bills stood at $1.279bn — an improvement from the previous year — yet heightened geopolitical tensions between Pakistan and India increased risk perception among investors.\n\nJune witnessed a sharp pullback, with foreign investors purchasing just $24 million in T-bills while withdrawing $113m. Market analysts attributed the cautious investor behaviour to the four-day Indian aggression in May, followed by continued hostile rhetoric from Indian media and political leaders, which fuelled fears of further escalation.\n\nDespite record remittance inflows of $38.3bn during FY25, analysts warn that low export growth, weak foreign direct investment (FDI), and increasing foreign capital flight from local bonds could raise concerns for policymakers.\n\nAdding to the investor unease is the reduced return on government papers. The SBP slashed its policy rate to 11pc — down from 22pc in June 2024 — eroding the high yields that had previously attracted foreign investment into T-bills. Bankers believe further rate cuts remain possible, given the declining inflation trend, making a rebound in T-bill yields unlikely in the near term.\n\nSBP’s rate cut and India-Pakistan tensions dampen investor sentiment\n\nCountry-wise data show that the highest outflow of foreign investment in FY25 was recorded from the United Kingdom, with withdrawals totalling $924 million against an inflow of $750m. The United Arab Emirates saw the second-largest outflow, amounting to $256m, compared to an inflow of $277m.\n\nIn the case of the United States, the outflows significantly exceeded inflows. While the inflow from the US stood at just $26m during the year, the outflow reached $186m.\n\nEquity market sees net outflow\n\nThe equity market, known for its sensitivity to political and regional developments, also witnessed substantial foreign capital flight. In FY25, foreign inflows into equities stood at $460m, while outflows reached $815m — almost double. The market was visibly affected by the Indian aggression in May, which further dampened investor confidence.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/03/18094213f0397ab.jpg?r=094241",
  "retrievedAt": "2025-08-17T20:17:23.115Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923649/foreigners-withdraw-over-15bn-from-t-bills-in-fy25",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:46:50.000Z"
}
