{
  "title": "Police get three-day remand of eight SBCA officials, owner in Karachi’s Lyari building collapse case - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A judicial magistrate on Friday remanded in police custody eight officials of the Sindh Building Control Authority (SBCA) and the owner of a building that collapsed last week in Lyari for three days.\n\nInvestigating officer (IO) Zahid Hussain Shah produced the nine suspects before Judicial Magistrate (South) Kalsoom Mustafa Sahto and sought their 14-day physical custody for interrogation.\n\nAt the outset of the hearing, the prosecution informed the court that the incident occurred due to the “criminal negligence” of the SBCA officials and building owner as a result at least 27 people were killed and several others injured.\n\nThe prosecution alleged that the SBCA officials had “deliberately concealed official records” regarding the dilapidated condition of the building.\n\nDefence counsel oppose remand request of building control authority’s officers\n\nBut the IO requested the court to grant physical remand of the suspects, stating that he needed to interrogate them at length to trace the individual who had approved the building’s map, as well as to obtain information about other suspects still at large.\n\nOn the other hand, Advocate Javaid Ahmed Chhatari and other defence counsel opposed the remand, raising an objection over the arrests of suspects in this case. They contended that the held suspects had no role in the commission of the alleged offence.\n\nAfter hearing the counsel and prosecution, the court remanded the suspects in police custody for three days and directed the IO to produce them at the next hearing along with a progress report.\n\n“It is admitted fact that accused persons are specifically nominated in the contents of FIR and the arrest of unknown accused yet to be effected. Hence, accused are remanded to police custody for three days till 14.07.2025,” the order said.\n\nAccording to the FIR, the building was constructed in 1986. Its owner constructed the five-storey plus ground floor building in two portions, and for a considerable period, both portions (buildings) were in dilapidated condition and unliveable. It added that one building with 20 apartments collapsed on July 4 due to the “criminal negligence” of the SBCA officials and the owner.\n\nThe FIR said the SBCA officials were aware of the condition of the building over years till the collapse. It added that the officials “completely failed” to perform their official duty and “committed negligence and carelessness”.\n\nIt also said the officials “deliberately” did not mention in the official record that the building was dilapidated. It also added that the present owner of the building and other unknown owners also knew that it was not liveable for humans. Despite this, the owners gave several flats on rent to members of the Hindu community and committed negligence.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/10195044291465c.jpg?r=195049",
  "retrievedAt": "2025-08-17T20:16:50.173Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923608/police-get-three-day-remand-of-eight-sbca-officials-owner-in-karachis-lyari-building-collapse-case",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:47:10.000Z"
}
