{
  "title": "Alcaraz, Sinner set up blockbuster Wimbledon final clash - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Jannik Sinner crushed Novak Djokovic in the Wimbledon semi-finals on Friday to set up the latest instalment of his gripping rivalry with defending champion Carlos Alcaraz, who earlier tamed Taylor Fritz to reach his third straight final at the All England Club.\n\nThe showdown between the top two players in the world on Sunday will mark another chapter in a rivalry that has defined recent Grand Slam tournaments. Alcaraz and Sinner have now claimed the past six majors between them.\n\nWorld number one Sinner swept aside Djokovic in a 6-3, 6-3, 6-4 victory on Centre Court to reach his first Wimbledon final and his fourth successive Grand Slam title match. The 23-year-old Italian will now attempt to avenge his painful French Open defeat to Alcaraz, where he squandered three championship points in last month’s epic Roland Garros final.\n\n“It’s a tournament I always watched when I was young on the television and I would have never imagined that I can play here, you know in the finals, so it was amazing,” said Sinner.\n\n“From my side, I served very well today, I felt great on court, I was moving really well today.\n\n“We saw in the third set that he was a bit injured. He’s been in a very difficult situation but I tried to stay calm, to play the best tennis I can.”\n\nSinner, still wearing a white protective sleeve after injuring his elbow in a nasty fall against Grigor Dimitrov in the fourth round, was in complete control from the outset. He broke Djokovic in the third game, unleashing a barrage of relentlessly accurate groundstrokes.\n\nDjokovic, 38, wilted under the onslaught in the ninth game as Sinner converted his third set point. He came into the contest with questions over his fitness after tumbling to the turf late in his quarter-final victory against Flavio Cobolli.\n\nThe Italian did not let up at the start of the second set, breaking for a 2-0 lead. Djokovic was struggling to gain a foothold but held for 3-1 to roars from the crowd, desperate to witness a classic battle.\n\nChants of “Nole” rang around the stadium as fans tried to lift Djokovic but he was powerless to prevent Sinner from opening up a 5-2 lead. Djokovic saved a set point on his own serve but Sinner wrapped up the second set with only 69 minutes on the clock.\n\nDjokovic received treatment from the trainer between sets on the upper part of his left leg, apparently on the area he hurt in the match against Cobolli.\n\nHe broke for the first time in the match as he suddenly found a new gear, but was pegged back to 3-2 and roared in frustration at the changeover.\n\nStruggling physically, Djok­ovic was broken again as Sinner sealed victory with his fourth match point.\n\nThe Italian, the reigning US Open and Australian Open cha­m­pion, returned from a doping ban in May, losing the Italian Open final to Alcaraz before his collapse in the Roland Garros showpiece.\n\nNow he has a chance for reve­nge against the man who has won the past two Wimbledon titles and is the current top dog on grass.\n\n“It is a huge honour for me to share the court once again with Carlos,” said Sinner. “We try to push ourselves to the limit, he is for sure one of the players I look up to.\n\n“I love watching him, I think you all guys agree on that, what kind of talent he is but hopefully it’s going to be a good match like the last one.”\n\nSinner trails 8-4 in their head-to-head meetings, losing the past five matches. The Italian can take heart from beating Alcaraz in the Wimbledon fourth round in 2022 — his rival’s last defeat at the All England Club.\n\nEarlier in the day, twice defending champion Alcaraz battled past American Taylor Fritz 6-4, 5-7, 6-3, 7-6 (6) to reach his third consecutive Wimbledon final, rediscovering his A-game when it mattered most under a fiery sun on Centre Court.\n\nEyeing a sixth Grand Slam title, the Spaniard was eventually too strong for the metronomically consistent Fritz, whose biggest weapons were still not damaging enough to unsettle the second seed.\n\n“I’m not thinking about the winning streak or the results at all,” the 22-year-old said on court after wrapping up victory when the world number five sent a forehand long to decide a tense fourth-set tiebreak.\n\n“This is my dream — stepping on these beautiful courts and playing tennis in the most beautiful tournaments in the world. That’s all I try to think at every tournament and why I try to bring the joy to the courts.”\n\nHe certainly entertained a Centre Court crowd who lapped up a contest that pitted two hardened competitors with such contrasting styles against each other.\n\nFritz, who was bidding to become the first American man to reach the Wimbledon final since Andy Roddick in 2009, was so languid and smooth, emotionally and physically consistent from one point to the next.\n\nAlcaraz, on the other hand, was a fidgeting bundle of energy, exploding into life at key mom­ents, ripping top-spin forehands that drew gasps of admiration.\n\nFritz broke Alcaraz for the first and only occasion to take the second set as the Spaniard’s intensity levels dropped, but the champion quickly regained the upper hand, breaking twice in the third and coming through the tiebreak to clinch victory.\n\nIf Fritz’s game can be summed up succinctly as big serve, big forehand, then Alcaraz’s performance could be reduced to big serve, big forehand and everything else besides.\n\nIn the sets he won, his serve was almost untouchable. He won 100% of his first serve points in the first set, when he broke in the opening game and then smoothly saw it out.\n\nIn the third set, Fritz gained a single point in total on the Alcaraz serve, as the second seed broke for a 2-1 lead and again to wrap it up and reimpose his dominance.\n\nWhile the Fritz forehand produced an impressive 11 winners, Alcaraz’s more demonstrative stroke delivered a comparable 10.\n\nBut if they were evenly matched from the back of the court, at the net it was a totally different story.\n\nAlcaraz turned back the clock with repeated success on the serve-volley, an old Wimbledon favourite which is sporadically reincarnated on Centre Court.\n\nHe won 16 of 20 points with the tactic, which Fritz, despite his huge serve, attempted only twice. The Spaniard won 31 of 41 net points, more than double his 27-year-old opponent.\n\nFritz had his moments, pouncing when Alcaraz took his foot off the pedal to level the contest at one set all and spurning two set points in the tiebreak that would have forced the contest into a decider.\n\nYet Alcaraz was undoubtedly the better player on the day and now stands one match away from joining greats Bjorn Borg, Pete Sampras, Roger Federer and Novak Djokovic as the only men to win three successive Wimb­ledon crowns in the professional era.\n\n“Right now I don’t want to think about Sunday,” the Spani­ard said. “I just want to enjoy this moment and that I’ve got to a third final in a row. I will have time to think about Sunday, I’m goi­­ng to watch the other semi-final as well and let’s see.”\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6871a2bc8c73c.gif",
  "retrievedAt": "2025-08-17T20:17:13.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923616/alcaraz-sinner-set-up-blockbuster-wimbledon-final-clash",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:46:56.000Z"
}
