{
  "title": "Gruesome murders - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE spiral of violence in Balochistan continues, with the barbaric murder of at least nine individuals on Thursday.\n\nThe victims were pulled off two Punjab-bound buses travelling between Zhob and Loralai districts, and reportedly, the assailants checked their IDs before offloading them. The banned Balochistan Liberation Front has claimed responsibility for this atrocity.\n\nThis is not the first outrage of its kind, as over the past few years, there have been several incidents where non-Baloch victims have been targeted by separatists. Most of the victims have hailed from Punjab. On Friday, the bodies of the slain passengers were sent to their native areas.\n\nEarlier on Thursday, the army, at the corps commanders’ conference, had vowed to take action against proxies they believed were linked to hostile foreign forces, including Fitna al-Khawarij and Fitna al-Hindustan, the terms the military uses for the banned TTP and Baloch separatist groups, respectively. Both strands of militancy have their peculiar dynamics, which require targeted counterterrorism strategies to deal with.\n\nWhere Balochistan is concerned, there can be no justification for such gruesome killings, and the elements involved must be brought to justice. No cause can justify targeting innocent people — often from working-class backgrounds — who have come to Balochistan to make an honest living. In this regard the province’s nationalist forces that believe in working within the constitutional framework must clearly condemn the heinous murders of non-Baloch individuals.\n\nIt is also a fact that such grave crimes only end up hurting Balochistan, as talented individuals — teachers, doctors, engineers — will stay away from the province due to security concerns. Moreover, such violent episodes have a negative impact on Baloch citizens working or studying in other provinces, as these individuals face increased discrimination.\n\nWhile strong CT efforts are needed to uproot the terrorist networks responsible for such massacres, in the long run a securitised approach alone will not solve Balochistan’s militancy issues. Terrorist groups — whether local or foreign-backed — must be pursued and neutralised, but there needs to be a parallel political process in the province, while the local population’s genuine demands — regarding enforced disappearances, underdevelopment, lack of opportunities — must be addressed by the state. Separatists exploit these issues, accusing the state of not caring for the average Baloch.\n\nThe administration must prove these assertions wrong by encouraging political dialogue in the province, and addressing the socioeconomic concerns of the people. There can be no denying that most parts of the province are vastly underdeveloped, particularly where health and education are concerned. Hostile foreign actors will only exploit these weaknesses, which is why the state must address the issues with honesty. Long-term security can only be achieved when there is equitable development across Balochistan.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/112134244b26740.jpg?r=220927",
  "retrievedAt": "2025-08-17T20:16:19.637Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923682",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T01:35:43.000Z"
}
