{
  "title": "Multiple lapses led to River Swat tragedy, probe finds - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Advisories not heeded, warning systems malfunctioned\n• KP CM orders action against negligent officials\n\nPESHAWAR: Khyber Pakhtunkhwa Chief Minister Ali Amin Khan Gandapur has ordered action against officials of several government departments over their negligence, which led to the drowning of over a dozen people in a flooded river last month.\n\nOn June 27, at least 14 people, including 10 from the same family, died after being swept away in a flash flood triggered by heavy rains in the Swat River.\n\nThe committee, formed by CM Gandapur to fix responsibility, found negligence and shortcomings on the part of the district administration, irrigation and local government departments and Rescue 1122, which resulted in the tragedy.\n\nThe relevant departments will initiate action against officers found responsible and complete disciplinary proceedings within 60 days, read an official statement issued by the CM secretariat.\n\nThe 63-page report submitted by the Provincial Inspection Team (PIT) said weather advisories issued by the Provincial Disaster Management Authority (PDMA) and district administration “were not effectively implemented”.\n\nIt also highlighted a lack of coordination among the police, revenue, irrigation, rescue, tourism police, and other departments.\n\nThe malfunctioning of early warning systems resulted in delayed communication about the flood. Moreover, hotel owners failed to alert tourists about the dangers in riverine areas.\n\nThe emergency response by Rescue 1122 after receiving information of the accident was delayed, while the organisation was also short on trained personnel and necessary rescue equipment.\n\nThere was no clear designation of responsibilities among departments and institutions for riverside safety, and no risk classification existed for tourist spots along rivers, it read.\n\nThe report also stated that at the district level, there were no organised SOPs to ensure public safety during the monsoon season. The enforcement of Section 144, which would have stopped the victims from going into the river, was lax.\n\nThe report also pointed out construction along the river in violation of the rules. It said the regulatory mechanisms for approving building plans and defining encroachments were “ambiguous and inconsistent”.\n\nRecommendations\n\nThe PIT identified systemic shortcomings in dealing with such incidents and proposed measures to address these deficiencies.\n\nIt stressed the need for a special law to regulate construction activities along rivers effectively.\n\nThe report said the negligent departments and institutions identified in the inquiry report will have to take corrective measures, including the issuance of new protocols and regulatory frameworks, within 30 days.\n\nDuring the same period, comprehensive regulatory frameworks for river safety and building regulations would be prepared, with immediate enforcement of new laws and rules, and strict implementation of existing ones.\n\nTo ensure the implementation of the PIT recommendations, an oversight committee, headed by the KP chief secretary, will be formed. It will also transform PIT’s recommendations into actionable key performance indicators.\n\nThe oversight committee will submit monthly progress reports to the chief minister. It will incorporate river safety modules into the upcoming monsoon contingency plan and ensure the swift execution of plans to enhance Rescue 1122’s capabilities.\n\nTo prevent such incidents during the monsoon season, the PIT said a large-scale public awareness campaign would be launched throughout the province by relevant departments, including information, relief and tourism.\n\nThe report also highlighted steps taken by the provincial government and local administration after the incident.\n\nAn operation was launched to demolish encroachments along rivers across the province, the report said, adding 127 illegal buildings were sealed and constructions on over 682 kanals of land were demolished.\n\nA total of 1,874 kanals of encroached land was identified, out of which encroachments over 1,019 kanals were removed.\n\nThe demarcation of 609 kilometres of riverbeds was carried out, and 174 barriers were installed.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/120840546a3b4ed.jpg",
  "retrievedAt": "2025-08-17T20:17:47.703Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923656/multiple-lapses-led-to-river-swat-tragedy-probe-finds",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:46:37.000Z"
}
