{
  "title": "Massive Bara rally opposes military operation in Tirah Valley - Pakistan - DAWN.COM",
  "author": null,
  "content": "KHYBER: Thousands of peace campaigners from the restive Tirah Valley and Bara tehsil of Khyber tribal district on Friday staged a rally, opposing an imminent military operation in Tirah and forcible displacement of the residents.\n\nOrganised under the banner of Bara Siyasi Ittehad (BSI) at the Minara Jumaat Chowk, the peace rally, which later turned into an anti-military operation demonstration, was attended by thousands of people from all parts and corners of Bara and Tirah with parliamentarians, tribal elders, political parties’ representatives and civil society activists also in attendance.\n\nAmid vociferous sloganeering, the BSI president Hashim Khan Afridi declared that people of Tirah and Bara would not submit to any pressure regarding the start of a new military operation, forced displacement or formation of armed lashkars (peace committees).\n\nHe called upon the government to reconsider its policy about Qabayal (residents of the seven merged districts) as it was a flawed policy and had thus failed. “The government has to explain to the people as to how many militants had been killed during the previous military operations and how much the local population suffered,” he said amid thumping response from the rally participants, who called for reversing the decision of launching a military operation in Tirah.\n\nParticipants threaten to block roads if residents forced to vacate houses\n\nMr Afridi warned that if the security forces tried to forcibly evict residents of Tirah from their houses, the people of Tirah and Bara would block the Sheen Kamar Road and would not allow any family to be shifted to camps.\n\n“The displaced families of Tirah along with activists of BSI would establish protest camps in front of the Corps Commander’s House, Governor’s House and Chief Minister’s House in Peshawar till they were honourably sent back to their homes and the military operation halted.\n\nHe questioned the future of nearly 500 displaced families of Sipah, Kamarkhel, Kakakhel and Zakhakhel, who were forced to leave their houses in November 2023 but were still awaiting their return and were not even recognised as IDPs. “Why would we now agree to vacating our houses when we have such distressing examples of maltreatment of the displaced families before us,” he added.\n\nMNA Iqbal Afridi, MPAs Suhail Afridi, Abdul Ghani, former MNA Hamidullah Jan Afridi, tehsil chairman Mufti Kafeel and Tirah elders Mulana Hazrat Khan, Sher Afzal, Zahidullah, Khan Wali and others also addressed the rally.\n\nThey threatened in their emotional outbursts that people of Tirah and Bara would physically resist any military operation and forced eviction. “We will not vacate our houses at any cost and instead we will force both the militants and the military to leave our soil,” they cautioned.\n\nThey alleged that armed groups were allowed to re-enter Tirah under a well-thought-out plan in order to capture Tirah and its natural wealth. “Our elders were eliminated in order to terrorise the local population and put pressure on them for the start of another military operation,” they said as emotionally charged crowd raised full-throated slogans against any possible operation.\n\nThey said that they might be having political or tribal disputes among themselves but they were united for the restoration of peace in Bara and Tirah and were opposed to military operation and forced displacement.\n\nThe participants of the Bara rally, which most in the region believed was the biggest so far in any part of Khyber, also condemned the martyrdom of Awami National Party’s Bajaur leader Maulana Khan Zeb, and demanded the arrest of his killers.\n\nThe rally participants through a resolution demanded the release of Malak Naseer Ahmad Kukikhel, MNA Ali Wazir, Samad Lala and other political prisoners without delay.\n\nPublished in Dawn, July 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68717780628a5.jpg",
  "retrievedAt": "2025-08-17T20:16:29.615Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923566/massive-bara-rally-opposes-military-operation-in-tirah-valley",
  "dateList": "2025-07-12",
  "date_published": "2025-07-12T00:47:36.000Z"
}
