{
  "title": "2 ‘terrorists’ killed as attack on FC fort foiled in Qila Abdullah - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Security forces successfully foiled an attempt by unknown armed men to infiltrate the Frontier Corps (FC) fort in the Gulistan area of Qila Abdullah district and killed two attackers on Monday night.\n\nAccording to officials, a group of armed men launched an attack on the FC fort, which serves as its headquarters in Gulistan, located along the Quetta-Chaman national highway, and opened fire and threw grenades at the local population.\n\nHowever, security forces immediately retaliated and returned fire. A heavy exchange of gunfire ensued between the attackers and the security forces.\n\n“Security forces killed two terrorists who were attempting to damage the premises of the FC fort,” an official said, adding that the attackers wanted to create unrest in the area, but their efforts were thwarted due to the prompt response of the security forces.\n\nAccording to the officials, the firefight continued for some time, but the situation was brought under control. Additional troops were dispatched to the area, and Levies personnel were also sent from Chaman to control the situation.\n\nSix killed across Balochistan\n\nSix people, including a police officer and a dacoit, were killed in an armed clash, firing and a police encounter in Mastung, Zhob, Bolan and Turbat areas of Balochistan, police said on Monday.\n\nAccording to police officials, a constable was martyred and a dacoit killed during a heavy exchange of fire in the Chotu Mills area on the outskirts of Mastung town late on Sunday night.\n\nThe officials said armed dacoits snatched a pickup and fled. The vehicle owner reported the theft to the local police, who began chasing the dacoits. The dacoits opened fire, prompting the police to return fire. As a result of the hour-long exchange of fire, one dacoit was killed.\n\nConstable Shaukat Jan Shahwani was martyred in the gunfight, while two vehicle owners were injured. The bodies of the police officer and the unidentified dacoit were taken to the district hospital in Mastung. Further investigation is underway.\n\nIn another incident, unknown armed men blocked the CPEC highway in the Josak area of Turbat and searched all passing vehicles, including passenger buses, for about two hours.\n\nDuring the search, the armed men forcibly removed a man from a vehicle and later killed him. He was identified as Muhammad Sharif, a resident of Taunsa Sharif in Punjab. His body was shifted to the Turbat district hospital.\n\nSecurity forces were deployed to the area after receiving information about the incident, and a search operation was launched.\n\nIn Zhob, two people were gunned down by unknown assailants. According to police, the armed men opened fire on a vehicle near the Zhob bus station, killing two passengers, identified as Sohail Harifal and Muhammad Saleh. Their bodies were sent to the district hospital for medico-legal procedures.\n\nIn Bolan, one person was killed in an armed clash between two tribal groups in the Sanni area. Levies officials said the conflict stemmed from a land dispute between the two tribes.\n\nBehram Baloch in Gwadar also contributed to this report\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:02:23.485Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888165/2-terrorists-killed-as-attack-on-fc-fort-foiled-in-qila-abdullah",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:53:51.000Z"
}
