{
  "title": "Pakistan, China resolve to strengthen bilateral ties as Dar meets Chinese ambassador - Pakistan - DAWN.COM",
  "author": null,
  "content": "Pakistan and China reaffirmed their commitment to strengthening bilateral ties as Deputy Prime Minister and Foreign Minister Ishaq Dar held a meeting with the Chinese Ambassador Jiang Zaidong on Tuesday, the Foreign Office said.\n\nA day earlier, the FO rejected “baseless and unfounded” allegations targeting Pakistan’s commitment to China’s policies, stressing that Beijing continued to be Islamabad’s “all-weather strategic partner”.\n\nThe development came in response to growing criticism of Interior Minister Mohsin Naqvi’s participation in an event sponsored by the New Federal State of China (NFSC), an anti-China group. The FO described the One-China Policy as a consistent cornerstone of Pakistan’s foreign policy, emphasising that the country’s stance remains the same.\n\nPakistan has held strong bilateral relations with China which has supported it through many investments and development projects such as the China-Pakistan Economic Corridor project which was termed as a “lifeline” for the country’s economy.\n\nDuring today’s meeting, Dar and the Chinese ambassador reaffirmed the partnership, which was termed a “cornerstone of bilateral relations” between the two countries.\n\nThe progress of CPEC 2.0 was reviewed during the meeting, and both sides also expressed their commitment to further solidify their strategic partnership.\n\nAmbassador Jiang, on behalf of Chinese Foreign Minister H E Wang Yi, extended an invitation to Dar to attend a UN Security Council event ‘Practicing Multilateralism, Reforming and Improving Global Governance’ being hosted by China under its presidency of the UNSC, on February 18 in New York.\n\nThe deputy prime minister accepted the invitation, “underscoring Pakistan’s commitment to multilateral cooperation.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/28141018d6d885a.jpg",
  "retrievedAt": "2025-08-26T07:59:33.322Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888234/pakistan-china-resolve-to-strengthen-bilateral-ties-as-dar-meets-chinese-ambassador",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T10:05:09.000Z"
}
