{
  "title": "Convoy of oil tankers attacked in Kurram - Pakistan - DAWN.COM",
  "author": null,
  "content": "KURRAM: Miscreants opened fire on a convoy of oil tankers in Bagan area on Monday to disrupt the supply of diesel and petrol to Kurram tribal district.\n\nHowever, no damage was reported, with oil carriers successfully reaching Alizai area in the district afterward.\n\n“When our tankers reached Bagan Bazaar under police and security forces escort, the miscreants opened heavy fire from the nearby Talu Kunj area. However, we, despite the gun attack, safely transported tankers to Kurram,” driver Mohammad Qambar told Dawn.\n\nOfficials said food and other essentials were transported from Tal in Hangu district to Kurram in three convoys.\n\nThey said the first convoy had 62 vehicles, while the second convoy comprised 58 large cargo trucks.\n\nThe officials said the third convoy, including five tankers, successfully delivered petroleum products to Kurram on Monday for the first time since the closure of routes.\n\nMembers of the peace jirga said that they would discuss violation of the recent peace agreement, especially the firing on oil tankers in Bagan, and finalise a course of action against troublemakers.\n\nDue to prolonged closure of routes in Kurram, petrol and diesel reached Parachinar for the first time in a long period. The halted oil supply had forced people to travel on foot for miles.\n\nParliamentary leader of Majlis Wahdat-i-Muslimeen and MNA Engineer Hamid Hussain and provincial assembly member Ali Hadi Irfani condemned the attack and said vested interests were bent on creating unrest in Kurram despite the signing of a peace agreement.\n\nThey urged local leaders and residents to thwart conspiracies of troublemakers and play their due role for maintaining law and order.\n\n“A third party is actively trying to destabilise the situation in Kurram,” MNA Hussain said. He criticised authorities for “not fulfilling its duty of protecting public life and property effectively.”\n\nMPA Irfani said he would raise the issue in the peace jirga sitting today (Tuesday) and urge the jirga and government to fulfil responsibilities regarding repeated violations of the peace agreement.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:02:22.766Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888120/convoy-of-oil-tankers-attacked-in-kurram",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:54:44.000Z"
}
