{
  "title": "Direct flights between Pakistan, Bangladesh to launch soon: Bangladeshi envoy - World - DAWN.COM",
  "author": null,
  "content": "Bangladesh High Commissioner to Pakistan Mohammad Iqbal Hussain announced on Tuesday that direct flights between the two countries were expected to begin within the next few months.\n\nThe two countries were once one nation but split following a bloody civil war, which saw the territory previously referred to as ‘East Pakistan’ seceding to form the independent nation of Bangladesh.\n\nIn the years since the split, Dhaka’s leaders — especially the recently ousted regime of Sheikh Hasina — stayed firmly in the Indian camp, preferring to maintain close ties with New Delhi and keeping Islamabad at arm’s length. However, ever since a popular uprising that saw Hasina’s government toppled in August, there has been a thaw in ties between the two capitals, with trade and bilateral relations seeing a marked improvement.\n\nDuring a meeting with Islamabad Chamber of Commerce and Industry (ICCI) President Nasir Mansoor Qureshi today, the high commissioner said the announcement was a significant development set to enhance connectivity and foster stronger economic and cultural ties between the two countries.\n\nHe further revealed that cargo flights between Dhaka, Karachi and Lahore would also commence soon, further facilitating trade and business exchanges.\n\nHussain highlighted Bangladesh’s commitment to strengthening business partnerships with Pakistan, emphasising the ease of obtaining Bangladeshi visas online for Pakistani citizens.\n\nThe Bangladeshi official also encouraged both countries to explore joint ventures and industrial collaborations to maximise bilateral benefits, pointing out the ample opportunities for businessmen from both sides to ink joint ventures for mutual prosperity which highlighted the vast potential for trade and investment.\n\nHussain mentioned opportunities in various sectors with Pakistan exporting goods such as sugar, steel, surgical instruments, cement, dry fruits, pink salt, milk products, marble, and coal to Bangladesh. In turn, he said Pakistan could import items such as tea and jute from Bangladesh, creating a complementary trade dynamic between the two countries.\n\nThe ICCI president stressed that the business, industry and trade communities of both countries could achieve significant milestones through economic diplomacy. He expressed his intention to visit Bangladesh with a delegation of potential investors at the earliest opportunity with the goal of inking memoranda of understanding with the Dhaka Chamber of Commerce and Industry and other relevant bodies.\n\nFormer ICCI presidents Zubair Ahmed Shaikh, Mian Akram Farid and Mian Shaukat Masood emphasised that Bangladesh presented a unique opportunity for quickly enhancing bilateral trade, given the complementary nature of the two countries’ economies.\n\nThey noted that sectors such as industrial collaborations, joint ventures, technology transfers, business-to-business engagements and chamber-to-chamber cooperation were key areas for growth.\n\nThe meeting’s participants expressed strong optimism about the future of bilateral trade and said that direct flights would play a role in advancing this partnership.\n\nThey added that the development marked a pivotal step towards enhancing bilateral economic relations with both nations eager to seize the opportunities presented by improved connectivity and closer business ties.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/28195622ec5b6dd.jpg",
  "retrievedAt": "2025-08-26T07:59:33.672Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888256/direct-flights-between-pakistan-bangladesh-to-launch-soon-bangladeshi-envoy",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T16:18:06.000Z"
}
