{
  "title": "Senate’s approval of contentious Peca amendments bill triggers protests across country - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Senate on Tuesday passed controversial amendments to the country’s cybercrime laws — the Prevention of Electronic Crimes Act (Peca) 2016 — triggering countrywide protests by media bodies who fear the changes would be used against journalists.\n\nThe Prevention of Electronic Crimes (Amendment) Bill, 2025 adds Section 26(A) to Peca, which seeks to penalise perpetrators of “fake news” online. It says anyone who intentionally spreads, displays, or transmits false information likely to cause fear, panic, or unrest in society may face up to three years’ imprisonment, a fine of up to Rs2 million, or both. The bill now awaits the president’s assent to become law.\n\nJournalists have assailed the legislation as an “attack on freedom of expression”, while the opposition PTI has accused the PPP, an ally of the ruling coalition, of hypocrisy, slamming its support for the bill.\n\nFollowing the Senate’s greenlight to the widely criticised amendments, journalists across all provinces of Pakistan staged protests, vowing to hold further rallies against the legislation.\n\nWhat has happened so far:\n\nThe Peca bill was moved in the Senate by Minister for Industries and Production Rana Tanveer Hussain on behalf of Interior Minister Mohsin Naqvi.\n\nAs the bill was introduced, journalists present in the Senate’s press gallery staged a walkout in protest, recreating scenes witnessed last week when the amendments were passed by the National Assembly.\n\nPTI’s Shibli Faraz, the leader of the opposition in the Senate, spoke out against it, highlighting that while laws were made to protect people, the Peca amendment aimed to “target a specific political party”.\n\n“When a new law is introduced, its intent is scrutinised. Whether it’s social media or any other medium, it should operate within specific boundaries,” Faraz said. “The purpose of this bill is to target a specific political party.”\n\nHe added: “Laws are made to protect people, not to oppress them. It takes time to craft a law properly.”\n\nFaraz appeared to be referring to the manner in which the NA rushed the contentious amendments to Peca last week, drawing opposition protests and triggering a walkout by journalists. PPP members had voiced their support during the voting.\n\nMeanwhile, replying to Faraz after the bill’s passage, industries minister Hussain said that the bill was neither set in stone nor aimed at journalists.\n\n“This law will not deal with TV newspapers but social media,” he said, adding that the amendment could also “be improved”. “Journalists have nothing to do with this bill,” he insisted.\n\n“I am sure that in the future, the anarchy caused in society through social media will be controlled,” AFP quoted minister Hussain as saying as the bill was approved.\n\nThe Senate also passed the Digital Nation bill, which now awaits the president’s assent as it was already approved by the NA. The Senate session was then adjourned indefinitely.\n\nFacebook, TikTok and WhatsApp are among the most popular social media platforms in Pakistan, where low digital literacy fuels the spread of false information, conspiracy theories and deepfakes.\n\nSome YouTube journalists blur the line between reporting and heavily partisan commentary tailored to their millions of followers. Many lack proper fact-checking skills and contribute to spreading false information, sometimes garnering thousands of views.\n\nHowever, digital rights activists have voiced concerns. Nighat Dad, founder of the Digital Rights Foundation, told AFP that there has been “one restrictive law after another, introduced under the guise of public interest or national security”.\n\nThe real intent is “consolidating power and controlling the narrative”, she said.\n\nAmnesty International has warned that the changes to the “draconian” Peca would “further tighten the government’s grip over Pakistan’s heavily controlled digital landscape”.\n\nThe HRCP has also expressed deep concern, saying it was “likely to become yet another means of targeting political workers, human rights defenders, journalists and dissidents by effectively penalising criticism of state institutions”.\n\nPakistan is ranked 152 out of 180 countries in a press freedom index compiled by Reporters Without Borders.\n\nLater in the day, the PPP hinted at bringing further amendments to the Peca law to alleviate concerns raised by the journalist fraternity.\n\nSpeaking to reporters after the bill’s passage, PPP Senator Sherry Rehman said, “We should hold consultations and bring [further] amendments, which can come in the next session or the one after that.”\n\nShe assured journalists that her party supported media freedoms, asserting that it was “not trying to stifle anyone”. “These are amendments; the Peca law was a poor law anyways in my opinion.”\n\nSenator Rehman acknowledged: “I was told that the entire [legislative] process would be done with consultations, which did not happen.\n\n“It is unfortunate that we could not entertain [the objections] in the committees. […] The air at the moment is that ‘bill has to be passed’.”\n\nRehman further said that her party chairman, Bilawal Bhutto-Zardari, was also of the view that further amendments should be brought to Peca.\n\nFollowing the Senate’s greenlight to the widely criticised Peca amendments, journalists in various major cities across the country staged protests against them.\n\nAccording to DawnNews TV, cities where protests were held included Islamabad, Karachi, Lahore, Quetta, Faisalabad, Bahawalnagar and Sukkur.\n\nProtesters in Faisalabad held a banner reading “Black law unacceptable”, with some wearing handcuffs to demonstrate their fears of freedom of expression being curtailed. Similar banners were seen in Karachi, with one stating “Peca Act not accepted”.\n\nAFP pictures showed Karachi Union of Journalists written on placards held by protesting media workers. “Black law not accepted” read one banner. Those demonstrating in the federal capital expressed their rage by wrapping chains around their hands.\n\nOne of the media bodies participating in those was the Pakistan Federal Union of Journalists (PFUJ), which had called for nationwide protests.\n\nSpeaking at a protest in Islamabad, PFUJ President Afzal Butt called on President Asif Ali Zardari to schedule a meeting with the union’s Joint Action Committee (JAC) so that his organisation could apprise him of what parts of the amendment were against freedom of expression and fundamental rights guaranteed in the Constitution.\n\nThe PFUJ head called on ex-premier Nawaz Sharif, president of the ruling PML-N, to “review his decision”. “If both these gentlemen do not set their parties right, then do not complain to us tomorrow,” he warned, referring to coalition partners PPP and PML-N.\n\nWhile Butt appreciated PTI leaders for visiting the PFUJ at the National Press Club, he also demanded that the party take action against its leader Faisal Saleem Rahman, who heads Senate’s Standing Committee on Interior. Despite his party’s firm stance against the Peca amendment, Rahman voted in its favour in the committee.\n\nThe PFUJ president further said that Naqvi, on whose behalf the bill was moved, should have supported the journalists, recalling that the interior minister’s “own channel had been shut under Peca” and he had been its “victim”.\n\n“There will be no use of your fateha (condolences) after death and burial,” Butt quipped. “If the cricket board and the interior ministry can be run while in America, then you could have also made one call to the stakeholders on this.”\n\nButt stated that the PFUJ would give protest calls on a “daily basis”, asserting that if needed, they were ready to take to streets for “longer than the 2007 lawyers’ movement”.\n\nAt another such demonstration in Lahore, PFUJ Secretary General Arshad Ansari warned the government not to “steal citizen’s rights and strangle journalists”.\n\n“You will have your programmes and your assemblies, but remember, no one will cover you. The media is the one that makes you a politician. It is the might of the media upon which you are standing,” he said.\n\n“When you come at our throats, we’ll come at yours,” Ansari said. “You will fall but we won’t.\n\n“You will have protests in your assemblies. The assemblies of all four provinces will not function. There will be boycotts, the NA will be boycotted, we will shut down the streets, we will come outside your houses. We will not let you live until the Peca ordinance is withdrawn.”\n\nHinting at challenging the Peca amendments on legal forums, Ansari expressed the hope that high courts and the Supreme Court would “serve justice according to the Constitution”.\n\nSenior journalist Asif Bashir Chaudhry, a member of the Pakistan Federal Union of Journalists, told AFP that the government had assured reporters they would be consulted but they were “betrayed and backstabbed”.\n\n“We genuinely wanted a law against misinformation, but if it’s not being done through open discussion but rather through fear and coercion, we will challenge it on every available platform,” Chaudhry said.\n\n“Even under dictatorships, legislation was not forcefully rammed through parliament the way this government is doing now,” AFP quoted him as saying.\n\nAt the protest held outside Karachi Press Club, senior journalist Mazhar Abbas noted that digital media had become a target since Peca’s introduction in 2016.\n\n“This is not a matter of fake news; this is a matter of reporting the news. Those who want to provide the news are picked up. Those who give the news are enforceably disappeared. They are not disappeared through a Peca ordinance,” he said.\n\nCalling the Peca amendments an ordinance, which is enacted by the president rather than the parliament voting on it, Abbas said: “Those who are bringing this Peca ordinance are the same government and the same ideology who brought Peca in 2016.”\n\nStressing that a journalist’s responsibility was to “give the people the right to know”, he asserted that that right was being snatched. “Some elements of the state want to keep that right in their control.”\n\nIn Multan, President Rauf Maan of the Multan Union of Journalists led a demonstration outside the city’s press club, where he demanded that the amendments be repealed immediately.\n\nThe protest was also attended by HRCP’s regional members Faisal Tangwani and Lubna Nadeem.\n\nMore than a dozen media persons took part in the protest, including Ihtishamul Haq, Minute Mirror’s Muhammad Amir Hussaini, Aneela Ashraf, Express Tribune’s Sohail Chaudhry, and Adnan Farooq Qureshi.\n\nSenior journalist Wusatullah Khan said that media workers should have taken notice of the bill earlier since it was being discussed for the past couple of months, adding that “there were leaks about it as well”.\n\nSpeaking to DawnNews TV, he said: “The journalistic organisations or channels that are making noise now, there is a saying for this in English, ‘The punch that one remembers after the fight should be hit on one’s own face.’”\n\nHe added that despite the points of the bill being covered by the media, no one took notice of it yet created a ruckus when the NA passed the bill.\n\n“Yesterday I heard PFUJ President Afzal Butt saying they were called for consultation. Then why did they not tell journalists so they could organise themselves, or think about a protest?” Wusatullah asked.\n\n“This is the same government that said when Peca one came in 2016 that it was for the benefit of the public,” he highlighted, referring to when the original Peca Act was passed by the then-ruling PML-N.\n\n“Now that it is too late they are creating a ruckus. What kind of resistance is this that couldn’t stop Peca in 2016 or any of the following amendments, whether during PTI’s tenure or this government?\n\n“We just reminisce about the past but don’t change our attitude,” he added.\n\nMeanwhile, the Senate also approved the ’Digital Nation Pakistan Bill, 2024, which was moved by Law Minister Azam Nazeer Tarar on behalf of IT minister Shaza Fatima Khawaja.\n\nPresenting the bill, Tarar said the bill was aimed at digitising the whole system to align with the modern-day requirements.\n\nThe bill had already been passed by the NA, where it was introduced by Khawaja, the minister of State for IT and Telecommunication.\n\nThe bill aims to create a digital identity for citizens — to centralise social, economic and governance data — and to provide for the transformation of Pakistan into a digital nation, enabling a digital society, digital economy and digital governance.\n\nHowever, an Amnesty official, in last week’s statement on Peca, had said: “These developments are in step with deployment of intrusive digital surveillance technologies and laws such as the Digital Nation Pakistan Bill, that fail to incorporate any human rights safeguards.”\n\nAccording to state-run Radio Pakistan, another three bills to amend existing laws were introduced in the Senate today. These included the Prevention of Smuggling of Migrants Amendment Bill, 2025, the Prevention of Trafficking in Persons Amendment Bill, 2025 and the Emigration Amendment Bill, 2025.\n\nAll three bills were moved by Tarar on behalf of the interior minister.\n\nThe bill, a copy of which is available with Dawn.com, proposes a new provision, Section 26(A), to Peca, to penalise perpetrators of “fake news” online.\n\nSection 26(A) stated: “Whoever intentionally disseminates, publicly exhibits, or transmits any information through any information system, that he knows or has reason to believe to be false or fake and likely to cause or create a sense of fear, panic or disorder or unrest in general public or society shall be punished with imprisonment which may extend upto three years or with fine which may extend to Rs2m or with both.”\n\nAccording to a report issued by the Senate Standing Committee on Interior, the bill “primarily seeks to modernise … the legislative framework for combating cybercrimes in Pakistan”, while the interior secretary emphasised that the bill was written in good faith and aimed to “protect the general public … and to make the in-field act more effective to protect people’s rights”.\n\nIn Section 26A of the amended law, the term has been explained as any information disseminated by a person that “he knows or has reason to believe to be false or fake and likely to cause or create a sense of fear, panic or disorder or unrest in general public or society”.\n\nThe bill also suggests dissolving the FIA’s Cybercrime Wing and setting up a new National Cyber Crime Investigation Agency (NCCIA) to investigate illegal activities on social med­ia.\n\nIt further proposes the establishment of the Social Media Protection and Regulatory Authority (SMPRA), which would perform a range of functions related to social media such as education, awareness, training, regulation, enlistment, blocking and more.\n\nAccording to the bill, the SMPRA chairman will have the power to order the immediate blocking of any unlawful content on social media, while the authority will have the power to block content that contradicts the ideology of Pakistan or incites citizens to break the law.\n\nIt will also be authorised to block unlawful content targeting members of the judiciary, armed forces, parliament or provincial assemblies. Content deleted during parliamentary proceedings cannot be reuploaded on social media.\n\nThe amendment also proposes the establishment of a Social Media Complaint Council. In cases where social media platforms fail to comply with directives, the authority will have the power to approach the tribunal for enforcement.\n\nThe federal government will also establish a Social Media Protection Tribunal to enforce the provisions of the amended act.\n\nAdditional input from Imran Gabol and Nadir Guramani.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/281755480f02057.jpg",
  "retrievedAt": "2025-08-26T07:59:37.866Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888224/senates-approval-of-contentious-peca-amendments-bill-triggers-protests-across-country",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T06:39:29.000Z"
}
