{
  "title": "Israel fires at Lebanese returning home, kills two - World - DAWN.COM",
  "author": null,
  "content": "BURJ MULUK: Lebanon’s heath ministry said Israeli fire killed two people on Monday and wounded 17 others in the south, in a second day of violence as residents tried again to return to border villages.\n\nThe bloodshed, which one analyst said was unlikely to re-spark war between Israel and Iran-backed Hezbollah, came hours after the extension of a deadline for Israeli forces to withdraw from south Lebanon under a November ceasefire deal. The ministry said Israeli fire killed 24 returnees on Sunday.\n\n“Israeli enemy attacks as citizens attempt to return to their towns that are still occupied have led … to two dead and 17 wounded,” the health ministry said in a statement, updating an earlier toll of one dead.\n\nIt said the wounded included a child and a rescuer from the Risala Scouts association, affiliated with Hezbollah ally the Amal movement.\n\nUnder the ceasefire deal that took effect on November 27, the Lebanese military was to deploy in the south alongside United Nations peacekeepers as the Israeli army withdrew over a 60-day period, which ended on Sunday.\n\nHezbollah was also to pull back its forces north of the Litani River — about 30 kilometres from the border.\n\nCaretaker Prime Minister Najib Mikati said that Lebanon had agreed to an extension of the ceasefire deal between Hezbollah and Israel until Feb 18, after the Israeli military missed Sunday’s deadline to withdraw.\n\nIn south Lebanon, residents accompanied by the army were again trying to return to their villages, official media and correspondents reported.\n\nIn the village of Burj al-Muluk, a photographer saw dozens of men, women and children gathering in the morning behind a dirt barrier, some holding yellow Hezbollah flags, hoping to reach the border town of Kfar Kila, where the Israeli military is still deployed.\n\n‘Bullets don’t scare us’\n\nIn the city of Bint Jbeil, an access point for many border villages, Hezbollah supporters distributed sweets, water and images of former chief Hassan Nasrallah, who an Israeli air strike killed in September.\n\nOthers handed out stickers celebrating the “victory from God” as women held pictures of slain Hezbollah fighters. “They think they are scaring us with their bullets, but we lived under the bombing and bullets don’t scare us,” said Mona Bazzi in Bint Jbeil.\n\nThe official National News Agency (NNA) said that Lebanese “army reinforcements” had arrived near the border town of Mais al-Jabal, where people had started to gather at “the entrance of the town” in preparation for entering alongside the military.\n\nIt said the Israeli army had “opened fire in the direction of the Lebanese army” near the town, without reporting casualties there.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/67983343cf809.gif",
  "retrievedAt": "2025-08-26T07:59:50.015Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888139/israel-fires-at-lebanese-returning-home-kills-two",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:54:25.000Z"
}
