{
  "title": "Chinese firm offers rice, maize cultivation project for Cholistan - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: A leading Chinese company has offered launching a pilot project for cultivation of rice and maize in Cholistan desert in Punjab, besides introducing genetically modified organism (GMO) cotton in the province.\n\nThe offer was made by BGI group chairman Wang Jian during separate meetings with Chief Minister Maryam Nawaz, Agriculture Minister Ashiq Kirmani and Agriculture Secretary Iftikhar Sahoo, here on Monday.\n\nMr Wang also offered introduction of GMO cotton for 15 per cent increase in the yield of white lint.\n\nThe chief minister welcomed the offers and appointed the agriculture minister as the focal person for these initiatives.\n\nThe BGI group also offered its cooperation in cancer treatment and genetic testing, as the CM directed the health secretary to prepare a feasible plan for this purpose by coordinating with the Chinese company.\n\nExpressing her desire to set up a modern genetic testing lab in the province, she hoped that the cooperation between the Punjab government and BGI would be a game-changer in the health sector.\n\nMr Kirmani said that Punjab would like to benefit from Chinese experience in GMO technology and gene editing for promoting cotton cultivation as the province required new hybrid seeds capable of tolerating pest attacks due to climate change.\n\nHe said that the provincial government would cooperate with the foreign investors for promoting organic fertilizers and the latest farm research. It was agreed during the meeting that opportunities would be provided to agriculture scientists from both countries to share their experiences through study visits.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/01/251124536c37d74.jpg?r=112924",
  "retrievedAt": "2025-08-26T07:59:37.623Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888197/chinese-firm-offers-rice-maize-cultivation-project-for-cholistan",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T03:11:40.000Z"
}
