{
  "title": "Law minister refuses to give date for Council of Common Interests meeting - Pakistan - DAWN.COM",
  "author": null,
  "content": "• PPP senators demand moot to discuss proposed canals\n• Opposition, journalists walk out over Peca\n\nISLAMABAD: Minister for Law and Justice Azam Nazeer Tarar has refused to commit to a date for convening the Council of Common Interests (CCI), to discuss the water-sharing dispute among provinces.\n\nThe issue of proposed canals on the Indus River cropped up once again in the Senate on Monday, when PPP members raised the issue and sought a meeting of the CCI, which has all four provincial chief ministers as its members.\n\nMeanwhile, the opposition PTI walked out of the house after staging a noisy protest over the amendments in the Prevention of Electronic Crimes Act, 2016.\n\nJournalists also walked out of the media gallery in protest against the proposed legislation, most likely to be passed by the Upper House today (Tuesday), following approval from a Senate standing committee a day before.\n\nLaw Minister Tarar chided the opposition for disrupting the proceedings and said the protest was meaningless as the bill was not being passed today.\n\nHe said the Senate Standing Committee on Interior, which approved the bill, was headed by a PTI lawmaker.\n\nANP Senator Umar Farooq presented the committee’s report on the bill.\n\nWhile expressing his reservations over the bill, he said it violated freedom of speech.\n\nThe amendments were moved in haste, Mr Farooq said, adding he was against them as per his party’s policy.\n\nCCI meeting\n\nThe controversy over the government’s plan to build canals over the Indus river in Punjab to divert water for corporate farming in Cholistan once again echoed in the Senate.\n\nLaw Minister Nazeer Tarar assured the house that the project had already been discussed by the PPP and PML-N top leaders.\n\nThe issues would be “amicably” settled within the constitutional framework and water distribution formula under the 1991 agreement for resource distribution among provinces.\n\nHe assured PPP legislators that no decision would be made in haste without listening to Sindh and its people.\n\nMr Tarar added that Prime Minister Shehbaz Sharif wants to take along all coalition partners.\n\nPPP’s Senator Zamir Hussain Ghumro said neither a meeting of CCI was being convened on this matter nor was it being referred to the Senate’s standing committee concerned.\n\n“A fire is raging in Sindh, as there is already no water in the system, and there is another canal project upon which we have grave reservations,” he said while referring to the widespread protests in the province.\n\nAnother PPP senator, Shahidat Awan, said the matter has to be taken up in CCI and wondered when the constitutional forum would meet.\n\nLaw Minister Tarar responded that there were logistical issues as the CCI meeting required the availability of all four chief ministers and other members.\n\nThe CCI will meet in due course, the minister said, but refused to commit a date.\n\nMr Ghumro also criticised the government’s claim that the existing water share of provinces would remain intact even if the canals were built.\n\nHe said political parties had opposed the Kalabagh Dam on the same grounds that the provinces’ share would be affected.\n\nHe pointed out that the Punjab Planning and Development Department had also opposed the project.\n\nAnother PPP senator, Bilal Ahmad Mandokhail, also cautioned that the issue was becoming another “Kalabagh dam-like situation”.\n\nThe project, he claimed, would even deprive the farmers in Punjab of water.\n\nEven if the water for corporate farming was diverted out of Punjab’s share, it would mean “economic murder” of the province’s farmers.\n\n“Where would you bring this additional water from?” he asked, adding if Punjab had surplus water, it should be given to Sindh and Balochistan.\n\nSenator Palwasha Khan of PPP said both Sindh and Punjab would suffer if the project was executed.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:02:37.600Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888137/law-minister-refuses-to-give-date-for-council-of-common-interests-meeting",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:53:57.000Z"
}
