{
  "title": "Peca tweaks ‘almost law’ with Senate body’s assent - Newspaper - DAWN.COM",
  "author": null,
  "content": "• Standing Committee on Interior approves amendments after token debate\n• Journalists decry rush to approve the bill\n• Irfan Siddiqui vows to ‘stand with media persons if law weaponised against them’\n• IT and Telecom panel clears Digital Nation Pakistan Bill, 2025\n\nISLAMABAD: The Senate Stand­ing Committee on Interior has approved amendments to the Prevention of Electronic Crimes Act (Peca), essentially clearing the last obstacle for it to become law.\n\nThe committee meeting held in Parliament House on Monday was chaired by Senator Faisal Saleem Rahman of PTI.\n\nThe Prevention of Electronic Crimes (Amendment) Bill, 2025, already passed by the National Assembly, was introduced in the Senate by Law Minister Azam Nazeer Tarar on Jan 24.\n\nIt was later referred to the house’s Standing Committee on Interior for deliberations.\n\nAfter the committee’s approval, now only the senators have to vote for the bill to be sent to the president who would sign it into law.\n\nIn his opening remarks during the committee’s meeting, Senator Rahman stressed that the members were ready to provide constructive suggestions to the government to improve the bill.\n\nHowever, he also claimed that no journalist body had submitted concerns, feedback and recommendations in writing to the committee.\n\nMr Rehman of PTI — which vociferously protested against the bill when it was tabled in the NA and then again when it was presented in the Senate — supported the amendments.\n\nThe only opposition to the amendments came from the JUIF’s Senator Kamran Murtaza.\n\nMr Murtaza, who was not a part of the committee, attended the meeting on special invitation as he had requested to present his point of view on the amendments.\n\nSenator Murtaza expressed concerns over the haste shown by the committee to approve the bill.\n\nHe added that the law cannot even be read in such a short time. “What level of consultation can the committee have in a few minutes?”\n\nHe said the amendment had several flaws, like the lack of definition of ‘fake news’ and how it would be decided which news was fake.\n\nIn Section 26A of the amended law, the term has been explained as any information disseminated by a person that “he knows or has reason to believe to be false or fake and likely to cause or create a sense of fear, panic or disorder or unrest in general public or society”.\n\nMr Murtaza warned that the current government would itself be­­come a victim of this law.\n\nFlawed bill\n\nTwo journalists, Shahzad Iqbal and Amir Abbas, who were present at the meeting, raised their objections to the amendments.\n\nThe two journalists, who also host prime-time news shows, said they were not given sufficient time to submit suggestions over the bill.\n\nThey highlighted several flaws in the bill and added that it would further deteriorate media standards.\n\nMr Abbas said anchors themselves were a target of fake news, but the bill in its current form only extends authorities’ powers to “penalise people at their will”.\n\nSenator Irfan Siddiqui of PML-N downplayed the concerns, adding there was “no need to fear Peca amendments”.\n\n“The general tradition in this country is that there is no need for a law to handcuff anyone,” he said.\n\n“I myself was arrested under a fake case,” Senator Siddiqui said. He added that social media has gone out of control, which is a serious issue.\n\nHe stressed the need to protect journalists and said it would have been better if they were consulted before the bill.\n\nHowever, if the law is used against media, “we will stand with journalists,” Senator Siddiqui assured.\n\nThe other committee members also agreed on the need for laws to prevent electronic crimes and ensure strict compliance.\n\nThey agreed that existing laws to address issues such as pornography, child protection and hate speech lacked clear definitions.\n\nThe members noted that the bill was of “utmost importance”, as trolling and abuse were widespread issues that must be curtailed.\n\nMr Rehman, the committee chairman, said he had been a victim of fake news.\n\nThe Ministry of Interior secretary said the amendments aimed to protect people and were drafted in “good faith”.\n\nAfter the discussion, the bill was put to vote, with present members giving unanimous assent.\n\nThe members who attended the meeting included PPP’s Senator Shahadat Awan, Senator Mir Dostain Khan Domki and Senator Siddiqui of PML-N, Senator Umar Farooq of ANP and Independent Senator Naseema Ehsan.\n\nSenator Palwasha Khan, who was not a member of the committee, also joined the meeting after chairing a meeting of the Senate Standing Committee on IT and Telecommunication.\n\nThe committee on IT and Telecom had earlier approved the Digital Nation Pakistan Bill, 2025 by a majority vote.\n\nThe Bill had already been approved by the National Assembly.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/28091758d44c425.jpg",
  "retrievedAt": "2025-08-26T07:59:34.960Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888159",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:53:52.000Z"
}
