{
  "title": "Bill tabled in PA for appointment of bureaucrats as chairmen of Sindh education boards - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The provincial government on Monday tabled the Sindh Boards of Intermediate and Secondary Education (Amendment) Bill in the Sindh Assembly, finally paving the way for bureaucrats to be appointed as chairmen of the boards.\n\nDeputy Speaker Anthony Naveed referred the amended bill to the relevant standing committee for consideration after it was introduced by Law and Parliamentary Affairs Minister Ziaul Hassan Lanjar.\n\nThe amended bill contained one of the most controversial provisions enabling the provincial government to appoint a senior civil servant as the chairman of any educational board.\n\nThe proposed amendment in the bill said: “Provided that the Chairman shall be appointed by the Controlling Authority either through direct recruitment process or by transfer from amongst the cadre officers of BPS-19/20 on such terms and conditions as may be determined by it.”\n\nInterestingly, the “Statement of objects and reasons” of the bill remained silent for the reasons and need for the appointment of the bureaucrats as chairmen of educational boards.\n\nDeputy speaker refers the document to standing committee concerned for deliberation\n\nIt, however, said the educational boards in the province were working without formalised platform for coordination among their respective chairmen and the absence of such coordination had resulted in significant disparities in examination standards, assessment procedures and other administrative functions in the boards in Sindh.\n\nThe statement of objects and reasons said: “In order to fill the gap of coordination amongst the chairmen of all the educational boards in the province and for the purpose of performing the functions in the educational boards in smooth and transparent manner, it is expedient to amend the Sindh Boards of Intermediate and Secondary Education Ordinance, 1972.”\n\nThe standing committee was asked to examine the amendment bill and present its proposals in a week.\n\nBesides the appointment of boards’ chairmen, the bill also envisaged changes in the procedure for appointing heads, examination directors and secretaries of the education boards in the province.\n\nUnder the amended law, the controlling authority of the education boards will be the chief minister or his nominated minister. The authority of the education boards will be authorised to dismiss the officer from service at any stage.\n\nAs per the amended bill, the chief minister will be authorised to make appointments to the education boards directly or through transfer.\n\nThe authority to appoint members to the education boards and the steering committee will also rest with the chief minister.\n\nThe administrative affairs of the education boards will be supervised by a steering committee and an officer from the provincial services and general administration department will also be included in the committee.\n\nMQM-P protest\n\nThe proceedings took an unpleasant turn when the deputy speaker ruled a privilege motion of Aamir Siddiqui belonging to the Muttahida Qaumi Movement-Pakistan (MQM-P) out of order after the law and parliamentary affairs minister opposed it.\n\nThe MQM-P member in his motion complained against the “unprofessional” conduct of Karachi Water and Sewerage Corporation Managing Director Asadullah who did not take his calls or reply to his messages.\n\nHe said that he knew his privilege motion would be rejected, but at least he must be allowed to take up the issue of acute water shortage in the entire district East.\n\nThe MQM-P members rose and chanted slogans against the government as the speaker ruled the privilege motion out of order.\n\nMeanwhile, journalists covering the assembly proceedings staged a protest against the recent amendment to the Prevention of Electronic Crimes Act (Peca).\n\nLater, the house was adjourned to Wednesday (tomorrow) at 2pm.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:59:49.694Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888086/bill-tabled-in-pa-for-appointment-of-bureaucrats-as-chairmen-of-sindh-education-boards",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:54:32.000Z"
}
