{
  "title": "Govt admits contraction in industrial, agri sectors - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The government on Monday conceded contraction in two of the three major real economic sectors — agriculture and industry — signalling slower than targeted economic growth but said Pakistan was “well-positioned for continued growth momentum in the current year on the back of IMF supported policy reforms, monetary easing and fiscal consolidation”.\n\nIn its half-yearly “State of Economy Report”, the Ministry of Finance (MoF) attributed the slower growth in agriculture due to the high base-effect in the crop sector of the last fiscal year and the decline in the crop production of cotton, rice, sugarcane, and maize.\n\n“The growth in important crops contracted by 11.19 per cent first quarter of the year due to the high base-effect in the crop sector of the last fiscal year and the decline in the crop production of cotton (29.6pc), rice (1.2pc), sugarcane (2.2pc) and maize (15.6pc)”, said the MoF, adding that although important crops comprised wheat, cotton, rice, maize, and sugarcane, however, in first quarter there was no impact from wheat as it was neither sown nor harvested during this quarter.\n\n“In the industrial sector, the growth remained negative,” said the half yearly report but toned down the downfall saying “the rate of contraction slowed down to 1.03pc from 4.43pc last year signalling gradual improvement”.\n\nHopes growth momentum to pick up pace with falling interest rates\n\nIt said the economic recovery achieved in FY24, with GDP growth rate of 2.5pc against a contraction of 0.2pc in FY23, has sustained positive growth of 0.92pc in the first quarter of FY25. “However, growth has slowed compared to the 2.3pc recorded last year, reflecting moderation across key sectors, particularly in agriculture.”\n\nFalling interest rates\n\nInflationary pressures, which peaked during FY23, moderated significantly in FY24, driven by effective policy interventions, declining global commodity prices, and exchange rate stability. This created room for monetary easing, with a 1,000 basis points reduction in the State Bank of Pakistan’s policy rate stimulating economic activity.\n\n“The easing monetary stance, coupled with a more favourable environment for industrial and consumer sectors, is reinforcing economic momentum,” it said.\n\nThe external sector saw a marked improvement in remittance inflows along with resilient export performance, contributing to a substantial improvement in the current account balance. FDI demonstrated about 20pc growth, particularly in the energy and Financial Business. Meanwhile, the rupee exhibited stability against the dollar, supported by strengthened foreign exchange reserves and sound fiscal management.\n\nOn the fiscal front, enhanced revenue mobilisation efforts led to a significant increase in both tax and non-tax revenues, resulting in a significantly lower fiscal deficit.\n\nWithout mentioning almost 5-month long drought like conditions, the MoF claimed that high-frequency indicators, including machinery, investment and water availability, suggest a positive outlook for future growth in the sector.\n\nThe services sector is projected to continue its positive trajectory, driven by the recovery of domestic activity and growth in trade, it said.\n\nThe report noted a $1.21bn current account balance in July-December FY25 on account of record-high remittance inflows and strong export performance that offset the increasing import bill. Foreign exchange reserves are enough to cover over two months of imports, supported by IMF disbursements and international financial assistance.\n\nIt mentioned that the government had been able to reduce the fiscal deficit to 0.04pc of GDP in July-November FY25, a marked improvement from the previous year’s deficit. The improvement was bolstered by robust growth in tax and non-tax revenue (particularly historic SBP profits on account of record 22pc policy rate), reflecting improved fiscal discipline, reduced interest rates, and a stable exchange rate.\n\nWith strengthened economic fundamentals, declining inflation, and growing investors’ confidence, Pakistan is well-positioned for continued growth momentum throughout FY25. Key policy measures, including monetary easing and export facilitation, are creating an environment conducive to private sector-driven growth.\n\nContinued fiscal discipline and improved external account, alongside favorable global trends, are expected to sustain this positive momentum.\n\nCommitted to sustainable growth, the government is focused on overcoming structural challenges and promoting inclusive development, it said.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-26T07:59:56.028Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888152/govt-admits-contraction-in-industrial-agri-sectors",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:54:13.000Z"
}
