{
  "title": "Senate body orders fresh audit of solar imports since 2018 - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A Senate subcommittee on Monday ordered a complete audit of all solar panel imports since 2018 after showing dissatisfaction with a probe into Rs70 billion worth of under- and over-invoicing by two importers through the involvement of commercial banks.\n\nAfter a meeting of its subcommittee, the Senate Standing Committee on Finance and Revenue, led by Senator Mohsin Aziz, announced that fresh revelations had emerged regarding a massive over-invoicing in the import of solar panels involving transactions worth billions.\n\nTherefore, the subcommittee cal­led for a thorough investigation into the actions of the two companies and the two banks involved, which have already been fined by the State Bank of Pakistan for ‘negligence’.\n\n“We are now hearing of fines and penalties, but what concrete action has been taken against the actual perpetrators of the scandal?”, questioned Senator Aziz.\n\nRaises red flags over ‘staggering’ transactions by two companies\n\nThe meeting examined the involv­e­ment of two major companies, nam­e­­ly Bright Star Business and Moon­light Traders, in financial irregularities. During the meeting, it was reve­aled that transactions from these co­­m­panies raised serious red flags, with Bright Star and Moonlight, two major players, at the centre of the issue.\n\nThe two companies were accused of conducting suspicious transactions worth Rs106 billion between 2018 and 2022, with a substantial portion of these dealings made in cash. Mr Aziz raised questions about the freedom with which these dubious im­­p­orts took place at the height of import restrictions amid tight economic conditions to ward off sovereign default. “How is it possible that companies managed to make huge single transactions when ordinarily far less amounts raise red flags?” he asked.\n\nIt was revealed that the companies in question, used accounts opened in branches of Dubai Islamic Bank and Askari Bank in Lahore to carry out transactions to import solar panels. “Bright Star alone made over Rs2.7bn in transactions in 2018 and continued making payments, including Rs5bn in 2019, Rs1.5bn in 2020, and Rs2.5bn in 2022,” the Senate committee quoted officials as saying. Similarly, Moonlight reported Rs7.9bn in turnover, with a significant amount in cash.\n\nThe panel also uncovered multiple instances where solar imports were cleared at highly inflated values, the announcement said adding “some solar containers were cleared at lower than market prices, while others were cleared with inflated values”. The FBR should have been alerted to this discrepancy much earlier,” noted Senator Shahzeb Durrani, a committee member.\n\nThe Financial Monitoring Unit (FMU) and the FBR raised concerns about the nature of these transactions. FBR officials confirmed that around Rs46bn in suspicious transactions were flagged, many involving cash payments, which raised serious concerns of potential money laundering.\n\n“State Bank officials revealed penalties were imposed on Askari Bank and Dubai Islamic Bank for their negligence in the fiasco. Askari Bank was fined Rs40 million, while Dubai Islamic Bank faced a penalty of Rs27m for their failure to report the financial irregularities in a timely manner,” the panel said in its announcement.\n\nAs of now, three individuals have been arrested in connection with the scandal, though they are currently out on bail. “However, many questions remain unanswered, particularly regarding the full extent of such huge over-invoicing in the import of solar panels financial transactions laundering operation,” it said.\n\nTherefore, the committee jointly recommended a full audit of all companies involved in solar imports from 2018 to 2022, enhanced monitoring and regulation of financial transactions involving solar panel imports and immediate investigation into the role negligence of commercial banks.\n\nPublished in Dawn, January 28th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/01/6798348b64092.jpg",
  "retrievedAt": "2025-10-12T01:02:38.237Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1888149/senate-body-orders-fresh-audit-of-solar-imports-since-2018",
  "dateList": "2025-01-28",
  "date_published": "2025-01-28T01:54:13.000Z"
}
