{
  "title": "Punjab govt would implement uniform curriculum in province from Monday: SACM",
  "link": "https://www.app.com.pk/national/punjab-govt-would-implement-uniform-curriculum-in-province-from-monday-sacm-2/",
  "date_published": "2021-08-01T18:28:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Aug 01 (APP): Special Assistant to the Chief Minister Punjab on Information Dr. Firdous Ashiq Awan Sunday said that Punjab government was going to implement uniform curriculum in the province from Monday.\nAddressing a press conference here in Kobbey chak, SACM Dr. Firdous Ashiq Awan said that the dream of “one nation one curriculum” of Prime Minister Imran Khan and Chief Minister Punjab Sardar Usman Buzdar would materialize with the implementation of this decision.\nShe highlighted that a modern uniform curriculum reflective of the national values had a key role in real progress and development of a nation, adding that besides strengthening social cohesion it would weed out class-based and linguistic divisions. “A promise made by Pakistan Tehreek-e-Insaf (PTI) would be fulfilled by implementation of uniform curriculum from tomorrow” ,she said.\nDr Firdous said that PTI government’s opponents from Sindh were raising hue and cry,adding that the Pakistan Peoples Party (PPP) narrative coming from Sindh was only to protect their personal interests. She said that PPP failed to deliver even the most basic rights of people of Sindh.\nShe said that Pakistan Tehreek-e-Insaf (PTI) led government stood committed to its goal to eradicate poverty from Sindh.\nShe highlighted that the Pakistan Tehreek-e-Insaf (PTI) would usher in healthy change in Sindh through the power of vote and its truly democratic style and values. She said the growth and development of Sindh was infact Pakistan’s progress and achievement.\nSACM said that in the by-election of PP-38 constituency of Sialkot, “Pakistan Tehreek-e-Insaf (PTI) workers made the impossible possible”, adding that best strategy and teamwork was shown in that election.\n“Now it should be clear to all that the central Punjab is becoming a strong forte of Pakistan Tehreek-e-Insaf (PTI), and the mood and thinking of Punjab is changing”, she further said.\nShe stated with confidence that Pakistan Tehreek-e-Insaf (PTI) will achieve all its goals with unified and concerted efforts.\nSACM said that a special development package would be announced for “shaheens of Iqbal”, adding that the Chief Minister Punjab Sardar Usman Buzdar would visit Sialkot soon.\nTo a question, SACM said that in the past whenever Nawaz Sharif government had a difficult time Indian troops came to the border aggressively.\nShe said that under Prime Minister Imran Khan’s government so far there is peace on the borders.Dr. Firdous said that August 14, Independence Day of nation, will be celebrated with enthusiasm and zeal.",
  "retrievedAt": "2025-08-11T21:01:34.848Z"
}
