{
  "title": "Dr. Sania opens Pak Korea Nutrition Center under Ehsaas Framework",
  "link": "https://www.app.com.pk/national/dr-sania-opens-pak-korea-nutrition-center-under-ehsaas-framework/",
  "date_published": "2021-08-01T15:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 01 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar Sunday inaugurated the Pak Korea Nutrition Center (PKNC) at the University of Agriculture Faisalabad (UAF).\nDr. Sania was invited as a chief guest to join the launching ceremony of the center, said a news release issued here.\nEstablished under the Ehsaas framework (Policy # 59), the national nutrition center, ‘PKNC’ is the first of its kind, meant to address the malnutrition issue that has hit more than 50 percent of the population.\nDr. Sania also thanked the government of Korea for their collaboration.\nAt the university, Dr. Sania was warmly welcomed by the Vice Chancellor of UAF, Professor Dr. Iqrar Ahmed Khan; Professor Dr. Masood Sadiq Butt, Dean Faculty of Food, Nutrition and Home Sciences; Professor Dr. Tahir Zahoor, DG National Institute of Food Sciences and Technology; and other faculty members.\nPrincipally aimed at improving child and community nutrition, PKNC has been established at the Faculty of Food Nutrition and Home Sciences with the total funding of Rs. 1.5 Billion for a period of over three years. Collective funding comprises Rs. 1.15 Billion from Korea International Cooperation Agency’s (KOICA) and the remaining funds from HEC/PSDP.\nThe project will train government officials, nutrition policy makers and 35 master trainers. The master trainers, in turn, will train over 12,000 nutrition educational experts, lady health workers, nutritionists and primary school teachers etc to improve nutrition and child nutrition.\nPKNC will comprise six research chairs including nutrition and public health; food fortification; food processing; product development and value addition; database and componential analysis; and policy and advocacy.\nAddressing the launching ceremony, Dr. Sania said, “I am particularly keen on exploring the feasibility of developing a school meals programme under the Ehsaas framework in collaboration with University of Agriculture Faisalabad. PKNC will guide the policy direction to address the issue of malnutrition in the country.”\nAdding further, she said, “Tackling malnutrition is embedded in the Ehsaas strategy post- COVID-19. Ehsaas aims to promote equalities, which amongst other things centers on human capital development, of which a healthy diet is a core component.”\nDuring a presentation, Vice Chancellor Professor Dr. Iqrar Ahmed Khan and his colleagues presented the technical modalities of potential school meals programme in detail.\nDr. Sania continued that the government has also institutionalized the inter-ministerial nutrition task force, headed by the Prime Minister and there are eight cabinet ministers sitting on the task force.\nIt is quite unique as this is the first time that inter-ministerial set up has been created to shepherd nutrition, she said.\nThe Ehsaas Nashonuma, she further added, is a conditional cash transfer program aimed at tackling stunting among children under two years of age, along with pregnant and lactating mothers. In the first phase, 50 Ehsaas Nashonuma Centers have been opened across 14 most stunted districts of Pakistan.\nOn the occasion, Professor Dr. Iqrar Ahmad Khan said that the center is established in partnership with Korea that will help bring tangible results in addressing the daunting issues of malnutrition.\nHe said that more than 50 percent of the population was facing the malnutrition deficiency that is a matter of grave concern.\nHe was of the view that we need to change our lifestyle and food habits. He also stated that if we blend the wheat with corn, it will improve the issue.\nHe lauded the steps of the government being taken under Ehsaas to help the oppressed segment of the society.\nFurther, he added that such scholarships of Ehsaas will help the students from low-income backgrounds to fulfil their aspiration of higher education.\nProfessor Jaehan Kim from Chungnam National University, South Korea together with senior representatives of partnering universities—Karakorum International University, Gilgit Baltistan; Bolan Medical University, Balochistan; University of Agriculture, Peshawar;\nUniversity of Agriculture, Tandojam; Faisalabad Medical University; and Children Hospital Faisalabad also joined the meeting.\nDuring the visit, Dr. Sania was also briefed about the disbursement of Ehsaas Undergraduate Scholarships. 1,868 Ehsaas scholarships were given to UAF this year-50% for girls.\nShe also awarded Ehsaas Undergraduate Scholarships among eligible students of UAF. She interacted with awardees to gain insights on Ehsaas Undergraduate Scholarship Policy. “For the academic year 2020/21, total 92,003 scholarships worth Rs. 8.4 Billion are being awarded”, Dr. Sania said.",
  "retrievedAt": "2025-08-11T21:01:35.442Z"
}
