{
  "title": "PM says corrupt junta always ruined societies, countries",
  "link": "https://www.app.com.pk/national/pm-says-corrupt-junta-always-ruined-societies-countries/",
  "date_published": "2021-08-01T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 1 (APP): Prime Minister Imran Khan Sunday said that a corrupt society could not make progress whereas those countries made economic strides that had eliminated this curse from their societies.\nThe prime minister said there was rule of law in the prosperous countries. “Corruption at the low level did not bankrupt a country, it has always been the ruling elite that ruined the countries through their teeming corruption,” he added.\nHe said in order to save their skins, the corrupt junta would first weaken the anti-graft bodies, resulting in the destruction of a country.\nThe UN secretary general formed a fact-finding panel as to why the poor countries were mired in poverty, he said, adding, the panel submitted a report indicating that about 1000 billion dollars were being siphoned off from the poor countries to the rich countries through money laundering tactics by the powerful and corrupt ruling elite.\nThe prime minister was responding to public queries in a live Tv programme, “Aapka Wazir-e- Azam Aap kai sath.”\nLIVE #APPNews : Prime Minister Imran Khan talking with general public & directly responding their questions on telephone. Session-1 @PakPMO @ImranKhanPTI  #آپکا_وزیراعظم_آپکے_ساتھ https://t.co/lwO4SnhAxd\n— APP  (@appcsocialmedia) August 1, 2021\nThe prime minister further termed the government’s efforts against corruption and for the rule of law as ‘the biggest Jihad’.\nHe said there would be no two separate sets of laws for the powerful and for the poor.\nThe prime minister asked the people to fully cooperate with the government in this regard as they wanted to make the people free from the clutches of injustices.\n“We want the country to stand on its feet. It should not seek loans or beg for assistance, and should not take part in the other’s war in return for money,” he added.\nThe prime minister said they wanted the nation to become self-reliant.\n“It is the fight for the future of Pakistan and fight for the rule of law. We are striving for the rule of law for the future of our generations,” he stressed.\nThe prime minister said the powerful corrupt elements wanted NRO and wanted deal as the one extended by Musharraf. Such elements had been blackmailing that otherwise, they would pull down the government.\nThe prime minister referred to chaotic situation in South Africa where authorities took action over Zuma’s corruption, their former ruler.\nHe opined that in the Western democracy, an accused could not resist accountability.\nThe prime minister responding to a question, further referred to British rule of Indo-Pak, as they took away about 24 GDP of Mughal empire with them swelling their coffins.\nThe two families had accumulated pelf through corruption. For the first time in the country’s history, NAB had arrested the powerful people, he added.\nHe said that the first principle in the Riasat-e-Madina was the rule of law where even the Caliphs were answerable to ordinary people.\nThe prime minister said in the initial stages, Muslims faced hardships in Madina, but later they achieved remarkable successes and became the world leaders.\nHe said his government was striving to introduce such a system of public welfare and rule of law in the country.\nIn the provinces of Khyber Pakhtunkhwa, Punjab and Gilgit Baltistan, they had given health cards facility to each family. Each family was entitled to one million rupees free of cost medical treatment.\nThe prime minister termed it a revolution, ‘the biggest step ever taken in the country’s history’.\nMoreover, he said the government was mulling to expand the network of Panahgah (shelter homes). Currently, 22 panahgah were catering to the needs of labourers and daily workers whereas 11 more would be established soon.\nThe prime minister said even in countries like US, homeless people didn’t have such facilities and they were forced to live under open sky.\nBesides, the prime minister said, 12 buses were plying in poor areas and providing free meals to people and hinted that number of such trucks would be increased in the near future.\nAnother biggest step, the prime minister said that Kamyab Pakistan programme would be launched in this month to facilitate about 40 per cent poor families of the society. Each member of the family would be imparted technical education, besides these poor families would get health cards facility, interest-free loans and micro finance for house construction.\nThe prime minister also regretted that the past rulers had ruined government entities like PTV, WAPDA and others through nepotism and political inductions.\nThe result of political inductions added to ballooning of pension bill as the budget allocated for different entities went to payment of pensions. So the institutions could not work for the achievement of the purpose for which they had been created, he observed.\nThe prime minister referred to Pakistan Steel Mills which was closed after running into huge losses due to corruption, mismanagement and political inductions by the previous rulers.\nThe prime minister said that his government would review such scenario.\nTo a question, regarding promotion of sports activities, the prime minister said he had been familiar with the sports as he could have ‘triple PhD’ in this arena but regretted that he could not focus on sports as the government was busy in addressing other burning  economic issues.\nHe said once country’s hockey and cricket teams were among the world’s top teams. In the squash, Pakistan produced two giants, Jehangir Khan and Jan Shair Khan who dominated the arena for long.\nBut the subsequent corrupt rulers shamelessly looted and plundered resources and destroyed the institutions. In sports, they placed their blue eyed in different departments, he opined.\n“On the other hand, different countries make their sports more competitive with innovative training and new techniques and they have professionals at the helms of affairs,” he added.\nHe referred to New Zealand, a country with 4 or 5 million population that defeated one of the most populous country India in the world cup test series.\nThe prime minister expressed the resolve to fully focus on promotion of sports in the country by bringing professionals at the top. However, he added that the rotten system would take some time.\nHe stressed that playgrounds should be constructed at the union council level to nurture the young talent.\nTo a question, the prime minister said that according to the latest global report, Pakistan was ranked as the cheapest country to live in.\nHe said globally, petrol prices were increased by 47 per cent but in Pakistan, these were increased by 11 per cent. The petrol was the cheapest in Pakistan when compared its prices in all the fuel importing countries.\nThe prime minister said that they were trying to bring down prices of commodities.\nHe said the salaried class faced difficulties and realizing their issues, the government had increased their salaries.\nHe assured that with increase in revenues, the government would further support the salaried class and facilitate farmers.\nHe said famers had earned Rs11 billion recently from their yield and such an income had never been experienced by the famers’ community.\nThe prime minister further observed that industries in the country were making profits with boom in the construction industry. He also requested the industrialists to increase wages of their workers.\nReplying to a query, he said that soon they would be providing direct subsidy to the poor segments of society on the basis of data collected through Ehsaas programme.\nThe prime minister, responding to anther telephonic call, urged that every individual should plant at least one sapling in this monsoon season during the government’s massive Ten Billion Tree Tsunami project (10BTTP).\nUnfortunately, he said country’s forests had been destroyed and nobody thought of the future generations.\n“Pakistan is blessed with huge resources and with twelve different climatic zones,” he said, adding, the people did not pay attention to proper usage of water and rivers and planning of cities.\nThe prime minister said the previous rulers had the sole interest of securing the power and lacked long term planning in this regard.\nHe said 10BTTP was launched for the future of coming generations.\nThe prime minister further said that he had ordered for master plans of different mega cities.\nIslamabad was the only planned city in Pakistan, but its master plan had been violated so frequently that resulted in its mushroom growth as witnessed during the period from 2010 to 2020, he added.\nThe prime minister expressed the confidence that master plans for every city would stem their unplanned expansion. Dubai and New York cities had witnessed horizontal growth, he added.\nHe said that new Ravi city was planned as modern city with a water lake forest. In Karachi, development of Bundal island, was another project but the Sindh government was not cooperating though it would bring huge benefits to people in the province and the provincial government, he opined.\nAbout opposition’s allegations over AJK elections, the prime minister said he was the first captain in the cricket world who launched campaign for the introduction of neutral umpires and the latest technology.\nExpressing his wonder, the prime minister said the PML-N government in AJK had all the resources, polling staffs and the election commission of its choice, but its prime minister was levelling allegations of rigging while sitting at his office. Similar, allegations were hurled after result of Sialkot bye-election.\nThe prime minister said his government was the first one in the country’s history that was insisting upon usage of electronic voting machines to ensure transparency and end the ensuing controversies after polling results.\nHe said they were making efforts to set the electoral system right. The use of EVM would end such like controversies.\nFor about one year, the prime minister said, they had been persuading the opposition to sit and get the electoral system reformed but they were neither listening to nor inclined to give positive suggestions.\nHe also suggested that media and bars elections might be conducted with the help of electronic voting machines.\nThe prime minister cited the holding of US presidential elections in which former president Donald Trump contested results, but could not prove his claims due to use of electronic voting machines.\nTo another question, the prime minister said that ample power was generated in the country but due to conditions of old transmission lines, power pressure could not be increased as experienced by authorities in Peshawar.\nThe prime minister said in the past, no new dams were constructed in the country, adding ten dams would be constructed during the ten years including two major ones Dasu and Bhasha dams to overcome the power shortage and meet the requirement of the ever-increasing population.\nHe said China had 5,000 huge dams, out of total 80,000 dams.\nSpeaking on the occasion, Minister for Industries Hamad Azhar, informed that June and July were considered as peak season, but they generated 26000 MW power this year contrary to usual capacity of 24000 MW.\nHe further said that loadshedding in the country was brought to zero and in the next summer season, they would overcome all the issues and would be able to maintain power supply to the industry even in the peak season.\nTo a question, Hamad said that taxes on vehicles had been reduced as the manufacturers also notified the relevant reduction.\nHe said demand for vehicles was very high which accelerated their production. Public demand for new vehicles indicated the economic prosperity in the country, he added.\nAbout voting rights to overseas Pakistanis, the prime minister said that they were the greatest assets of Pakistan who served the country with their remittances.\nHe said the government wanted to further facilitate them as it was in the interest of Pakistan.\nThe prime minister said that the government was determined to give voting rights to about 9 million overseas Pakistanis with E-voting or postal ballots.\nMinister for Industries further supplemented that State Bank of Pakistan would soon launch new schemes for digital money transfers to facilitate the overseas Pakistanis.\nHe said they had launched massive crackdown on illegal means of money transfers.\nThe prime minister also expressed the hope that PIA would soon resume its flight operations to the European countries.\nHe said that he would also take up the issue of opening of banking facilities (like NBP) in the Scandinavian countries to facilitate Pakistani business community there.\nTo another question, the prime minister said those rulers had fears of free media who had done any corruption or any other wrong doing.\nHe said that freedom of expression and independent media were great blessing as a free media played the role of a watchdog.\nBut what concerned him, he said was the propaganda and fake news fed by enemies of the country and spread by local media people. Such fake news were unearthed by the EU DisinfoLab, he added.\nAbout Noor Muqadam’s case, the prime minister said that it was a horrible incident that shocked everyone.\nHe assured the caller that the culprit would be dealt in accordance with law no matter how powerful he might be.\nThe prime minister said that he also personally followed the case of Afghan ambassador’s daughter in the manner as he would have pursued his own daughter’s case, adding Afghans were their brothers.",
  "retrievedAt": "2025-08-11T21:01:36.898Z"
}
