{
  "title": "Around 62 million Pakistanis to be living with diabetes by 2045",
  "link": "https://www.app.com.pk/national/around-62-million-pakistanis-to-be-living-with-diabetes-by-2045/",
  "date_published": "2023-11-13T19:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 13 (APP): Pakistan is currently grappling with a concerning surge in diabetes, with every third of adult Pakistani living with diabetes and the country ranked at the top in diabetes prevalence rate globally.\nEmpirical evidence from Pakistan suggests that unhealthy diets including high consumption of sugar and industrially produced trans-fatty acids (TFA) have become a significant contributor to Pakistan’s diabetes epidemic.\nThe iTFAs are commonly found in banaspati ghee, cooking oils, bakery ware, deserts, fried street foods and many other ultra-processed foods.\nThe collaborators of the TRANSFORM Pakistan campaign issued a press release on World Diabetes Day to highlight the link between diabetes and iTFA intake.\n“An approximate $2640 million was estimated as the cost of diabetes management in Pakistan in 2021 by the International Diabetes Federation. By 2045, if no immediate policy action is taken, it is projected that 62 million Pakistanis will be living with diabetes and suffering from its associated complications.\nThis staggering statistic necessitates immediate action to curb the rising diabetes prevalence,” shared Afshar Iqbal, Director of Communications and Advocacy at Pakistan Youth Change Advocates (PYCA).\nWith the aim to regulate the prevalence of industrially produced TFAs in Pakistani dietary sources, PYCA with the support of the Global Advocacy Incubator for Health (GHAI), Ministry of National Health Services, Regulation and Coordination and in collaboration with other civil society actors such as the Center for Peace and Development Initiatives (CPDI) launched the TRANSFORM Pakistan campaign earlier this year. “Under the TRANSFORM Pakistan campaign, we are demanding from the government to adopt best practice policy and placing a mandatory limit of 2gm of iTFAs in every 100 gm of fat in all food items across Pakistan,” added Afshar.\nMunawar Hussain, the In-Country Coordinator for GHAI, pointed out, “There is compelling evidence from countries that have effectively regulated trans-fats, suggests that reducing iTFA consumption could help reduce diabetes, heart diseases, stroke and other non-communicable diseases.” Following these footprints, Pakistan can cut down significant numbers of deaths and diseases by reducing the consumption of iTFAs in the diet by introducing best practice policy as per WHO guidelines.\nSimilarly, the consumption of sugar and sodium needs to be brought down through evidence-based policy actions like taxing sugary drinks and introducing front-of-pack warning labels on ultra-processed foods to curb the storm of diabetes in the country” he added.\nMukhtar Ahmed, Executive Director of CPDI, highlighted the current progress regarding iTFA regulations in Pakistan, stating, “Earlier this year, the Pakistan Standards and Quality Control Authority (PSQCA) mandated regulation for various food items like Banaspati ghee, cooking oils, and bakery goods such as biscuits and rusks. However, notable food items like chocolates, desserts, noodles, pastas, ice creams, ultra-processed foods, and several commonly consumed street foods have yet not been covered by iTFA limits, posing a considerable threat to the health of Pakistanis.”\nGiven the gravity of this issue, it is imperative for the government to take swift action and safeguard the people of Pakistan from the growing rates of diabetes by regulating iTFA, taxing sugary drinks and enacting front-of-pack warning labels on all ultra-processed foods.",
  "retrievedAt": "2025-08-11T10:30:57.987Z"
}
