{
  "title": "PM for visa ease, improved banking channels to boost Pak-Uzbek trade",
  "link": "https://www.app.com.pk/national/pm-for-visa-ease-improved-banking-channels-to-boost-pak-uzbek-trade/",
  "date_published": "2023-11-14T14:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Tuesday underscored that easy visa procedures, improved banking channels and reciprocal warehousing facilities would further boost trade between Pakistan and Uzbekistan.\nThe prime minister, in a meeting with Deputy Prime Minister of Uzbekistan Dr Jamshid Khodjaev Abdukhakomovich along with a delegation, expressed the hope that the business community of both countries could easily achieve the bilateral trade target of US$ 1 billion in a short time.\nThe Uzbek deputy prime minister, along with a seven-member delegation, is on an official visit to Pakistan.\nPrime Minister Kakar welcomed the Uzbek deputy prime minister and his delegation to Pakistan and recalled his recent meeting with President of Uzbekistan, Shavkat Mirziyovev, on the sidelines of the 16th ECO Summit held in Tashkent from November 8-9.\nHe expressed satisfaction at the pace of bilateral engagements between the two countries, especially in the areas of trade, defence and connectivity.\nHe also appreciated the holding of the First Trilateral Meeting of the Commerce Ministers of Pakistan, Uzbekistan and Afghanistan in Islamabad.\nThe three sides also established a trilateral working group to discuss customs, logistics, trade promotion, tariffs, TIR procedures, etc.\nShowing satisfaction at the outcome of the trilateral meeting, the prime minister hoped that the trilateral mechanism would boost trade relations between the three countries.\nPrime Minister Kakar underlined the need to continue momentum of people-to-people exchanges.\nDeputy Prime Minister Khodjaev thanked the prime minister for the warm hospitality extended to him and his delegation.\nHe briefed the prime minister about fruitful meetings with the business community of Pakistan, including the banking and logistics sectors.\nHe expressed the hope that both sides would continue active engagement for the timely completion of the Uzbekistan-Afghanistan-Pakistan Railway Project.\nThe Uzbekistan delegation included Minister of Transport Ilkhom Makhkamov Rustamovich, Deputy Minister of Investment, Industry and Trade Badriddin Abidov, Deputy Foreign Minister Bobur Usmanov, Deputy Chairman of State Security Service Maj. General Farukh Mukhtarov and Ambassador of Uzbekistan in Islamabad Oybek Arif Usmanov.\nThe Pakistan delegation included Minister of Commerce Gohar Ijaz as well as secretaries of commerce and Board of Investment, and other senior officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:30:51.788Z"
}
