{
  "title": "Constituency delimitation disputes in 88 districts disposed off: ECP",
  "link": "https://www.app.com.pk/national/constituency-delimitation-disputes-in-88-districts-disposed-off-ecp/",
  "date_published": "2023-11-14T17:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 14 (APP): The Election Commission of Pakistan (ECP) has resolved objections regarding the initial constituency boundaries in 88 districts so far, with the aim of finalizing the delimitation of constituencies and publishing it by November 30.\nOfficial sources have stated that the election schedule will be revealed following the release of the final constituencies. The ECP issued a provisional report on constituency delimitation, derived from the recently concluded census, on September 27.\nThe ECP established two benches to address objections related to national and provincial assembly constituencies on a daily basis.\nECP sources have stated that concerns about defining constituencies, including districts such as Islamabad, Shikarpur, Jacobabad, Kashmor, and Sialkot, Khuzdar, Rajanpur, Kurram, Khyber, Nankana Sahib, Attock, Jhelum, Kohat, Korangi, Khushab, Bahawalpur, Sukkur, Kot Addu, Toba Tek Singh, South Karachi, Lower Dir, Hangu, Aurakzai, Multan, Jhang, Mohmand, Mansehra, Torgar, Battagram, Umerkot, Karachi West, Central Karachi, Keamari, Sought Waziristan, North Waziristan, Bajaur, Lakki Marvat, Shangla, Bonair, Zhob, Sherani, Kalla Saifullah, Rahim Yar Khan, Narowal, Rawalpindi, Murree, Liyyah, Tharparkar, Badin, Shahdad Kot, Shaheed Benazirabad, Larkana, Faisalabad, Jamshoro, Swabi, Sargodha, Mianwali, Thatta, Upper Dir, Karak, Muzaffargarh, Bhakar, Khairpur, Okara, Pak Pattan, Bahawalnagar, Taunsa, Vehari, Quetta, Chaman, Kalla Abdullah, Chaghi, Kharan, Vashak, Hafizabad, Gujranwala, Kasur, Dera Ismael Khan, Tank, Peshawar, Malir, Sanghar, Swat, Haripur, Chakwal, Talagang, Pashin, and Ziarat, have been sorted out.\nA total of 1,324 objections were lodged regarding constituency delimitation nationwide, with 672 from Punjab, 228 from Sindh, 293 from Khyber Pakhtunkhwa, 124 from Balochistan, and 7 objections from Islamabad. The ECP has set the elections for February 8, 2024.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:30:26.815Z"
}
