{
  "title": "Governor for adopting healthy life style for defeating diabetes",
  "link": "https://www.app.com.pk/national/governor-for-adopting-healthy-life-style-for-defeating-diabetes/",
  "date_published": "2023-11-14T18:20:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 14 (APP):Governor Punjab Muhammad Balighur Rehman has urged the need of adopting a healthy lifestyle in order to defeat diabetes.\nSpeaking at a ceremony organized by Pakistan Endocrine Society and Pakistan Society of Internal Medicine in connection with World Diabetes Day at the Governor’s House here on Tuesday, he said, as chancellor, he would also direct the vice-chancellors of all universities across the province in writing to organize awareness seminars and workshops to create awareness among the students and prevent this disease.\nThe Governor Punjab also led a diabetes awareness walk from Alhamra Arts Council to Governor’s House. Caretaker Provincial Health Minister Prof. Dr. Javed Akram also accompanied the Governor.\nWhile addressing the ceremony, Punjab Governor Muhammad Balighur Rehman said that diabetes and other diseases can be prevented adopting Islamic lifestyle. He said that it is possible to prevent this disease with timely diagnosis. He said that there is a need to create awareness among the people to prevent diabetes. He said that the number of diabetic patients in Pakistan are increasing to an alarming extent, adding, “We have to change our lifestyle to get rid of this disease.” He said that fasting is a shield for the prevention of diseases, adding that scientific research has also proved that the intermittent fasting makes the body healthy, and prevents diseases like diabetes and blood pressure.\nThe Governor Punjab said that diabetes affects every organ of the body, especially vision, heart, liver and and kidneys . He said that Islam is a complete code of life. He said that Pakistan Endocrine Society and Pakistan Society of Internal Medicine are playing an effective role in spreading awareness about diabetes prevention among the public. He said that free tests and guidance are available for the public in the screening camp set up in Governor House Lahore till 5 pm.\nGovernor Punjab Muhammad Balighur Rehman and Caretaker Provincial Health Minister Dr. Javed Akram also visited the screening camp set up for the general public at the Governor’s House.\nThe Health Minister while addressing the gathering said that the main reason for the increase in diabetes is lifestyle. He said that in Asia, diabetes is spreading more rapidly in countries like China, India and Pakistan. About 33% of the population in Pakistan is suffering from diabetes, he added. He said that before 1921, type 1 diabetes was considered to be fatal, but now insulin is available for these patients. Dr. Javed Akram said that life management is very important for people suffering from diabetes.\nA large number of people including the president of Endocrine Society Dr. Abbas Raza, members of civil society, representatives of local and international pharmaceutical companies, students and Vice Chancellors of universities attended the ceremony.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:30:46.068Z"
}
