{
  "title": "Faisal Kundi terms in-time elections as only way to ensure political stability",
  "link": "https://www.app.com.pk/national/faisal-kundi-terms-in-time-elections-as-only-way-to-ensure-political-stability/",
  "date_published": "2023-07-22T10:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 22 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Safety, Faisal Karim Kundi Saturday termed in-time elections as the only way to ensure political stability in the country.\nAddressing a news conference here, Faisal Kundi said that Pakistan People’s Party had a very clear stance that assemblies should complete their tenure and the caretaker government and Election Commission of Pakistan (ECP) should conduct elections within 60 days.\nThe SAPM said, “60 days are enough for an election campaign, however, if coalition political parties want 90 days for the campaign, PPP is ready for that.”\nCommenting on the reservations of political parties including PPP over conducting elections on the basis of the new census, he said, “It is better to conduct elections on the previous census.”\nAbout the Sindh government’s rehabilitation efforts for the flood-affected people in the province, Faisal Kundi said that the Sindh government had fulfilled its promise of providing houses to those families affected due to floods.\n“The Sindh government has provided land rights to 5,000 flood-affected families in the province. The funds for the construction of 50,000 houses have been released so far.”\nThe SAPM said, “The provincial government will provide a total of 2,00,000 to the women head of family.”\nHe said although the flood had affected many parts of the country, the way the Sindh government had responded to this calamity in terms of providing relief to those affected was exemplary.\n“The PPP government will replicate the same model of providing houses to its people in the other provinces too in the future”, he said.\nAbout the cipher issue, Faisal Kundi said that the former Principal Secretary of the former Prime Minister, Azam Khan had exposed all the false claims related to the cipher.\n“The whole country was handed over to a person who could not retain a piece of paper (cipher)”, he said.\nFaisal Kundi said, “PPP is not against any political party but those involved in the May 09 violence should be taken to task.”\nHe said that the incident of May 09 would not happen if those involved in the attack on PTV in the past were punished.\nFaisal Kundi said, “Foreign minister, Bilawal Bhutto has pursued effective diplomatic policies which helped revive and strengthen relations between Pakistan and other countries.”\nHe said that the coalition government had faced enormous economic challenges but succeeded in steering the country out of the crisis due to its prudent policies.\nAbout the Benazir Income Support Program (BISP), the federal minister highlighted that the first-ever dynamic National Socio-Economic Survey was being carried out successfully across the country.\n“Under the Benazir Kafaalat program, around Rs 72 billion have been disbursed among eight million families,” he informed.\nResponding to a question, Faisal Kundi said, “PPP has always emphasized on ensuring the rule of law and conveyed to all the political parties that elections should be conducted within 60 days.”\nTo another question, he said, “No patriotic citizen can justify what happened on May 09 and those involved in it should be dealt with strictly.”",
  "retrievedAt": "2025-08-11T08:58:27.799Z"
}
