{
  "title": "People to vote those who saved Pakistan from default: Prof. Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/people-to-vote-those-who-saved-pakistan-from-default-prof-ahsan-iqbal/",
  "date_published": "2023-07-22T17:31:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jul 22 (APP):Federal Minister for Planning, Development and Special Initiatives Engr. Prof. Ahsan Iqbal said on Saturday that present coalition government has again turned the country’s economy towards rehabilitation by taking difficult decisions and laid the foundation of economic recovery and those who had jeopardized the economy should scare of the elections.\nTalking to media after addressing as chief guest the Lifetime Achievement National Engineering Excellence Award ceremony organized in his honour by Institution of Engineers Pakistan (IEP) at a local hotel, he said, “We have the pride to save the country from default. I am sure the nation will vote for those who ensured continuation of Pakistan’s economic recovery policies.”\nHe added that coalition government would quit on completion of its constitutional term, and after that a caretaker government would be at the helm of affairs, asserting that Election Commission of Pakistan would conduct the general election in the country so that a new elected government come soon. The country would definitely go towards real democracy as authority rested with the people.\nProf. Ahsan Iqbal said that country’s economy could never be strengthened and development could not be ensured unless the loss making public entities were privatized and the power sector’s circular debt was terminated.\nEarlier addressing the ceremony, he said that government had been focusing on five Es i.e. Environment, Energy, Economy, Equity and Empowerment, adding that Pakistan has a big population of youth and women, and effective steps were being taken for their empowerment.\n“Our youth can play a pivotal role in the IT sector that is in great demand in the world. We are also making the IT sector as a source of women empowerment,” he maintained.\nThe planning minister said that present government has recently established Special Investment Facilitation Council (SIFC) aimed at strengthening trade and economic relations with Gulf States just as the CPEC (China-Pakistan Economic Corridor) had established and improved our economic ties with China. Under the CPEC, the Chinese President during his visit to Pakistan in April 2015 had signed agreements worth US $ 46 billion investment in various sector.\nIn Pakistan’s history, there had never been a record development work in five years as much as in PML-N government during 2013-2018, he said, adding that out of US $ 46 billion CPEC projects, the then N-League government had materialized US $ 25 billion projects thus attracting the world, which had earlier been reluctant to invest in Pakistan, attention and many countries had shown their keen interest to invest in Pakistan under the CPECP.\nProf. Ahsan Iqbal elaborated that under the SIFC, Pakistan would bring investments from Gulf States with major focus on ensuring fast development in the sectors of agriculture, Information Technology, Mining and Energy through modern and innovative technologies.\nHe recalled that Dr. AQ Khan and Dr. Ishfaq had told him in a meeting that Pakistan had successfully achieved its nuclear programme just because of continuation in policies, coordination among all the respective organizations, strict merit policy, consistent leadership and dedicated trained human resource, besides provision of resources and their reasonable autonomy to the relevant authorities of the project. Today, Pakistan is needed to adopt the same pattern on its economic front to achieve fast development and people’s prosperity, he added.\nProf. Ahsan Iqbal cited that Japan, South Korea, China, India, Bangladesh, Turkey, Thailand, Malaysia, Singapore and other developed countries attained economic autonomy by ensuring continuation in the political and economic policies for decades.\nHe said that engineers community was eminent in development of a country as they have great role in almost all sectors of economy including industry, agriculture, education, health, and IT. He mentioned that engineers had made Pakistan a nuclear power and made it invincible.\nAt the end, the IEP office-bearers presented Lifetime Achievement National Engineering Excellence Award to Federal Minister for Planning, Development and Special Initiative Engr. Prof. Ahsan Iqbal.\nIEP Secretary General Engr. Amir Zamir Ahmed Khan, IEP Lahore Centre Chairman Engr. Mian Adbul Haque, IEP Lahore Centre Secretary Engr. Muhammad Afzal Goraya also spoke on the occasion, while a large number of engineers also attended the ceremony.",
  "retrievedAt": "2025-08-11T08:58:22.936Z"
}
