{
  "title": "President upholds dismissal from service penalty upon a woman harasser",
  "link": "https://www.app.com.pk/national/president-upholds-dismissal-from-service-penalty-upon-a-woman-harasser/",
  "date_published": "2024-02-03T11:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP): President Dr Arif Alvi has upheld the penalty of “dismissal from service” imposed upon a bank manager after he was found guilty of the charges of sexually harassing a female colleague at workplace.\nThe president rejected the representation filed by Muhammad Munir Akhtar (the accused), a former employee of the Askari Bank Ltd (ABL), against the decision of the Federal Ombudsman for Protection against Harassment of Women at Workplace (FOSPAH).\nHe said that the incidents narrated in the complaint against the accused, when juxtaposed with the evidence, established the guilt of the accused for the charges of harassment, the President Secretariat Press Wing said in a press release on Saturday.\nThe president, in his decision, observed that the accused had duly admitted the allegations about calls, text messages, and denial to hand over her ATM card to the complainant deliberately.\nHe said that the accused had admitted that he called and sent messages to the complainant and did not give her ATM card due to the reasons best known to him despite the fact that he was required to hand it over to the complainant. “Facts admitted need not be proved”, he added.\nAs per details, a female employee of ABL (the complainant) had filed a harassment complaint under section 8 of the Protection against Harassment of Women at the Workplace Act 2010 against the accused within the departmental hierarchy of ABL stating that she was harassed by the branch staff of the ABL, Hassanabdal.\nAccording to her, the accused Muhammad Munir Akhtar, Bank Manager along with his friend had made it difficult for her to work in the branch by creating an offensive workplace environment.\nShe alleged that the accused had forced her to go with his friend and after she was transferred to another branch, when she went to collect her card from the Hassanabdal branch, she was verbally abused by the accused and he refused to hand over her ATM card.\nThe Departmental Harassment Committee probed into her allegations and, after inquiry, concluded that the accused was involved in harassment and was accordingly dismissed from service.\nThe accused filed an appeal with FOSPAH, which was dismissed, after which, he filed a representation with the president.\nPresident Alvi wrote that workplace harassment could have very serious consequences for the women who experience it as a harassed woman risked losing her job or the chance for a promotion, if she refused to give in to the unethical demands of someone in authority.\n“The unwelcome conduct of co-workers makes the working conditions hostile and unpleasant, putting indirect pressure on her to leave the job”, he added. He remarked that sometimes a woman employee was so traumatized by the harassment that she suffered serious emotional and physical consequences and became unable to perform her job properly. “The workplace harassment has a cumulative and demoralizing effect that discourages women from asserting themselves within the workplace while among men”, he concluded.\nThe president highlighted that the main objective of the Protection against Harassment of Women at Workplace Act 2010 was to create a safe working environment for women, free of harassment, abuse and intimidation with a view toward fulfillment of their right to work with dignity.\n“Harassment is one of the biggest hurdles faced by working women preventing many who want to work to get themselves and their families out of poverty”, he stated.\nHe underscored that the Act was built on the principles of equal opportunity for men and women and their right to earn a livelihood without fear of discrimination as stipulated in the Constitution.\nHe held that the Act also adhered to the principles of Islam and all other religions in our country which assure women’s dignity.\nThe president concluded that there seemed to be no reason for the complainant to file a false complaint against the accused when there existed no previous grudge, ill-will or malice.",
  "retrievedAt": "2025-08-11T00:13:22.489Z"
}
