{
  "title": "Kashmir Solidarity Day: Testament of Pakistan’s unwavering commitment to resolution of Kashmir disputes: Mushaal Malik",
  "link": "https://www.app.com.pk/national/kashmir-solidarity-day-testament-of-pakistans-unwavering-commitment-to-resolution-of-kashmir-disputes-mushaal-malik/",
  "date_published": "2024-02-03T14:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 3 (APP): Principal Information Officer (PIO), Press Information Department, Dr Tariq Mehmood Khan said that United Nations resolutions were very clear that Kashmiris will be given the right to self-determination through a free and transparent plebiscite to decide about their future.\nIn his welcome address at a seminar organized by the Press Information department titled “Kashmir Solidarity Day” to be observed on February 5, Dr Tariq Mehmood Khan said that since August 2019 fascist Modi regime of India had increased atrocities on hapless Kashmiris.\nHe said it was the responsibility of Pakistan and Kashmiris to expose the real face of India at the global level.\nHe said that today’s event was jointly organized by Kashmiri media and the Press Information Department.\nHe thanked Special Assistant to the Prime Minister on Human Rights and Women Empowerment Mushaal Malik for sparing time for this event.\nMushaal Mullick has said that Pakistan will continue to extend its unwavering political, moral and diplomatic support for the just struggle of the people of Jammu and Kashmir in determining their destiny through the right of self-determination.\nPrincipal Information Officer Dr. Tariq Mehmood Khan and members and representatives of All Kashmir Newspapers Association (AKNA) also addressed on the occasion.\nDG Information Service Academy Arshad Munir, DG PID Ambreen Gul, President AKNA Amjad Choudhary and members of civil society and other media associations also attended the seminar.\nAddressing the seminar, the Special Assistant to the Prime Minister said that the Kashmir Solidarity Day serves as a testament to Pakistan’s unwavering commitment to the resolution of the Kashmir issue as per the UN resolutions and provision of justice and peace to the people of Jammu and Kashmir.\nHighlighting the human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK), Mushaal said that India had been involved in genocide, extra-judicial killings, torture in custody, the use of chemical weapons, violence against children and women, enforced disappearances, pellet gun usage, collective punishment, black laws, false flag operations, and fake police encounters in its failing effort to suppress the freedom movement of the people of Jammu and Kashmir.\nSAPM expressed concerns over Modi’s move to establish illegal Hindu settlements in IIOJK to alter the demographic landscape and turn Muslim majority into a minority in the region.\nShe said the issuance of Kashmiri domiciles to non-Kashmiri by India had seen a significant increase after the Indian illegal actions of August 5, 2019.\nMushaal raised alarms over the unjust and illegal persecution of peaceful Kashmiri leadership.\nShe said that Kashmiri leaders are either languishing in jails or kept under house arrest.\nShe further said that the grave of the late Kashmiri leader Syed Ali Gilani had been turned into a sub-jail by India, making it inaccessible to visitors.\nShe urged the world to be watchful as false and fabricated charges might be used by Modi-led regime to impose a death sentence on Yasin Malik through biased legal proceedings.\nSAPM said that Pakistan was a target of Indian terror operations and irrefutable evidence of Indian involvement in targeted killings inside Pakistan was available.\nShe further said that the global reach of the RSS terrorist network was a threat to global peace.\nMushaal urged the international community and the UN to stand in solidarity with the people of Jammu and Kashmir, acknowledge their rights and make efforts to ensure the peaceful resolution of the Kashmir issue as per the aspirations of the Kashmiri people and the relevant UN resolutions.\nSAPM extended her heartfelt commendation to the Press Information Department for organizing a seminar in connection with Kashmir Solidarity Day to raise awareness and understanding about the Kashmir issue.",
  "retrievedAt": "2025-08-11T00:13:08.241Z"
}
