{
  "title": "FDE revokes ministry’s order, stirring debate on hierarchy and rules of business",
  "link": "https://www.app.com.pk/national/fde-revokes-ministrys-order-stirring-debate-on-hierarchy-and-rules-of-business/",
  "date_published": "2024-02-03T12:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 03 (APP): The Federal Directorate of Education (FDE) nullified the Ministry of Federal Education & Professional Training’s (MOFE&PT) order to reinstate Dr. Samia Dogar to her former position as Director, Federal College of Education (FCE).\nMr. Majid Umer, an associate professor at FCE, has been directed to look after the administrative matters of FCE as a principal.\nEarlier, the MOFE&PT had issued the reinstatement order of Dr. Samia Dogar on December 12, 2023, following a directive from the Federal Ombudsman for Protection against Harassment.\nHowever, after 48 days, the FDE, an attached/subordinate department of MOFE&PT, took the unprecedented step of canceling the reinstatement orders, raising eyebrows and concerns among the educational community. Critics argue that such a move challenges the established hierarchy within government offices, as the FDE is an attached department of the MOFE&PT.\nIt is pertinent to mention here that Dr. Samia Dogar, a Professor of BPS-20 position, had previously been removed from the directorship of FCE and the administrative control of FCE was abruptly transferred to the FDE on March 1, 2023.\nDr Samia was attached to Islamabad Model College for Girls, G-10/4, allegedly as a form of punishment, further complicated the situation, leading to a violation of seniority lists and recruitment rules specific to the FCE.\nThe Federal Ombudsman for Protection against Harassment issued a directive to MOFE&PT, directing the immediate reinstatement of Professor Dr. Samia Dogar to her previous position. This decision followed an appeal filed by Dr. Samia against Waseem Ajmal Chaudhary, Secretary of MOFE&PT, under Section 6 of the Protection against Harassment of Women at the Workplace Act, 2010.\nThe ombudsman expressed serious concerns about the proceedings of the inquiry committee of MOFE&PT, highlighting the violation of Dr. Samia’s due process rights leading to the reinstatement of Dr. Samia by MOFE&PT on December 12, 2023.\nAn assistant professor at FCE stated, “Dr. Samia Dogar’s journey has been marked by legal battles and workplace challenges. I expect she will choose to challenge the decision through legal channels instead of obeying the orders of FDE because FDE has no authority to issue the orders to FCE by cancelling the orders of its ministry.”\nAnother teacher of FCE, speaking on the condition of anonymity, expressed concerns about the need for training of FDE officers regarding the rules of business, suggesting a lack of awareness of the proper protocols.\nShe said that cancelling the ministry’s orders by FDE had raised eyebrows and questions about the hierarchical structure within the education sector. FDE’s overturning the orders of its controlling office is both unprecedented and against the established rules of business.\nThis move of the FDE will open a new Pandora’s box of litigation as FCE falls under schedule-2 of the rules of business, while the FDE is under schedule-3. The Ministry, being the higher controlling office, is expected to have authority over both entities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:13:33.548Z"
}
