{
  "title": "Tourism sector to be explored for revenue, employment generation: PM",
  "link": "https://www.app.com.pk/national/tourism-sector-to-be-explored-for-revenue-employment-generation-pm/",
  "date_published": "2021-04-23T12:02:00.000Z",
  "source": "APP",
  "content": "MURREE, April 23 (APP): Prime Minister Imran Khan on Friday said owing to Pakistan’s immense tourism potential, the government was focused on exploring the sector for revenue and employment generation.\n“Pakistan can earn money from tourism alone, both local and international, by revamping the infrastructure and ensuring facilities for tourists,” the prime minister said at the cheque distribution ceremony under Ehsaas scholarships and Kamyab Jawan Programme.\nThe prime minister, who earlier inaugurated the Kohsar University at the hill resort of Murree, said the world-class institution would play a key role in imparting the local student’s necessary skills in hotel management and tourism.\nImran Khan said education was vital in the development of a nation as no nation could progress without attaining higher learning. He said education about tourism would help the new generation learn proper techniques to pursue a career in the booming sector.\nThe Prime Minister said the previous government spent Rs 830 million on the beautification of the Punjab House for their personal use, however, now the facility was being opened for tourists.\nHe mentioned that Pakistan’s northern areas, its deserts and the areas of Balochistan offered a diverse range of tourist destinations.\nHe said Pakistan’s domestic tourism has doubled in recent areas and once the pandemic was over, tourists from across the world would be visiting Pakistan.\nHe said Switzerland, which was half the size of Pakistan’s northern areas and even did not match its breathtaking natural beauty, was earning US 60 to 80 billion dollars annually from tourism alone. Pakistan, he said, has far more scenic areas which can boost our tourism potential.\nImran Khan regretted that the previous governments used the beautiful Murree resort for rest and recreation only, but did not bother to construct even a single good hospital.\nHe said his government was now constructing a hospital spread over 370 kanals in Murree.\nThe prime minister said the uplift of poor and neglected sections of society key to a nation’s progress, adding that he had learned from the life of Holy Prophet Muhammad (Peace be upon Him) that serving the poor and downtrodden people brings blessings of Allah and leads to prosperity.\nHe said the Scandinavian countries had followed the principles of humanity and brought in prosperity for their people.\nImran Khan referred to a UNDP report, which clearly mentioned that Khyber Pakhtunkhwa had progressed significantly after the year 2013, as the PTI government focused on uplifting its poor and neglected sectors of society. Similarly, he said, it was his desire to repeat the example across the country.\nPunjab Chief Minister Usman Buzdar said that the Punjab government would develop Kotli Sattian as a tourist point just like Murree.\nHe said tourism, health and education projects for Murree would cost around Rs 7.8 billion to facilitate the tourists as well as the local residents.\nHe said the inauguration of Kohsar University and introducing tourism as a discipline there was also part of the government’s efforts to promote tourism.\nMoreover, the boys and girls colleges of Kahuta, Kotli Sattian and Kalar Syedan will also be upgraded costing Rs 1.13 billion.\nUsman Buzdar also announced the up-gradation of Muree Municipal Committee to Municipal Corporation, new parking plaza for the city, new building laws for Murree and lifting of ban from new construction.\nHe also committed to the construction of a tourist highway to connect Murree with Kotli Sattian and water supply projects for the city.\nMNA Sadaqat Abbasi said the inauguration of Kohsar University was in the spirit of Prime Minister Imran Khan’s vision to promote tourism in the country.\nHe said the government would carry out joint ventures with private firms to execute tourism projects for creating jobs and economic activity in the area.\nHe said a Mall Road-II has been planned at Murree Expressway where the multinational food chains will open their outlets and the project would be executed without costing any public money.\nAbbasi told the gathering that five colleges in the cities around Murree would be affiliated with Kohsar University.\nHe requested the prime minister to direct for early planning of the tourist corridor to link Murree with Kahuta.\nEarlier, the Prime Minister was informed that Kohsar University would be offering courses in Sciences, Arts, Travel and Tourism, and Hotel Management, and would be affiliated with international universities.\nThe prime minister planted a sapling in Murree as part of his Clean and Green Pakistan campaign and launched the up-gradation project of the Tuberculosis  Sanatorium.\nLIVE #APPNews : Prime Minister @ImranKhanPTI addressing cheques distribution ceremony among the youth under #KamyabJawan and the beneficiaries of #EhsaasKafaalat programme #Murree . @PakPMO  https://t.co/r8Nkc7CLQS\n— APP  (@appcsocialmedia) April 23, 2021",
  "retrievedAt": "2025-08-11T20:39:14.945Z"
}
