{
  "title": "Pakistan not holding any talks with India through back-door channels: FM",
  "link": "https://www.app.com.pk/national/pakistan-not-holding-any-talks-with-india-through-back-door-channels-fm/",
  "date_published": "2021-04-23T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP): Foreign Minister Shah Mahmood Qureshi on Friday categorically rejected the speculations of any secret talks between Pakistan and India through back-door channels or third party involvement, the United Arab Emirates (UAE).\n“We are not having any talks [with India] at the moment. UAE is not facilitating any talks,” Qureshi told TRT, a Turkish Television Network.\nThe Foreign Minister said that UAE had good relations with both Pakistan and India, the two South Asian nuclear states, but there were no such talks.\nHe, however, added that Pakistan never shied away from talks but it was India which had been shying away from the talks.\nThe Foreign Minister referred to the statement of Prime Minister Imran Khan that if Indian would take one step forward, Pakistan would take two.\nHe said Pakistan was willing for talks but Indian will have to create a conducive environment vitiated by its unilateral August 5, 2019 action in the Illegally Occupied Jammu and Kashmir (IIOJK), which deprived the Kashmiris of their fundamental rights.\n“How talks can be held in such an environment,”? the Foreign Minister questioned adding that even some secular segments in India were saying that the policy of Indian government  for Kashmir had failed to achieve the objectives.\nForeign Minister Qureshi in response to a question said that as a peaceful and stabile Afghanistan was in the interest of Pakistan, the government in Pakistan and all state institutions were on the same page on this issue.\nHe said Pakistan has been trying to push the peace process and bring all the parties on table.\nReferring to achievements made so far in the Afghan peace process ncluding Doha agreement, he said it would not have been happened without Pakistan, he remarked.\nTo another question, the Foreign Minister Pakistan’s influence in Afghanistan or over Afghanistan Taliban was exaggerated. Pakistan was playing its past or peace in Afghanistan, but ultimately it were the Afghans who have to decide whether to kill each other and sit together for peace, he remarked.\nThe Foreign Minister said Afghan Taliban, who were smart enough to negotiate, also realize that violence was not option and they have to engage.\nTo a question he said Taliban should not be blamed for all ills in Afghanistan, as there were spoilers from within and outside who did not want peace in Afghanistan as well as in the region.\n“We don’t want any terrorist organization to gain footholds in the region. That is why are have been playing our role and have also started fencing of our border with Afghanistan to regulate the border crossings.” He added.\nThe Foreign Minister said that Pakistan, which had suffered immensely due to war in Afghanistan and terrorism and paid heavy price in human and terms, believed in a peaceful and stable Afghanistan.\nHe further said that Pakistan which was hosting three million Afghan refugees wanted peace and stability in Afghanistan and would continue to play its role to achieve the objective.",
  "retrievedAt": "2025-08-11T20:39:11.795Z"
}
