{
  "title": "Conservation of Saddozai chieftain’s tomb near completion in Multan",
  "link": "https://www.app.com.pk/national/conservation-of-saddozai-chieftains-tomb-near-completion-in-multan/",
  "date_published": "2021-04-23T16:42:00.000Z",
  "source": "APP",
  "content": "MULTAN, Apr 23 (APP):The tomb of Shah Hussain, the chieftain of Saddozai tribe, who and later his scions, left indelible mark on Multan history through their political influence and subsequent over six decades rule, was nearing completion in the city of saints under a Rs 8 million project.\nThe project would hopefully be completed within the ongoing Ramzan ul Mubarak or after Eid ul Fitr, an official of Punjab archaeology department told APP.\nShah Hussain Saddozai was the first from Saddozai clan to have reached and settled in Multan from Afghanistan in the mid seventeenth century after having his relations strained with Safavid kings of persia for whom the tribe used to guard the highways.\nHe was the grandson of Asadul Ain alias Saddo Khan, the progenitor of Saddozai clan. Upon arrival in Multan, Shah Hussain Saddozai was received by Prince Aurangzeb who later became empror.\nHe was given the title of ‘Wafadar Khan’ and was given a ‘Jageer’ making Multan the second home to Saddozai Afghans. Later, his scions ruled Multan, prominently among them were Nawab Zahid Khan, Nawab Shuaja Khan and Nawab Muzaffar Khan.\nSaddozais maintained their political relevance under rule by different powers over Multan. In 1746, Ahmad Shah Abdali confirmed Nawab Zahid Khan Saddozai as the Governopr of Multan and fifteen years later, Ahmad Shah Durrani appointed Shuja Khan, the younger son of Zahid Khan, as the Governor of Multan.\nBy 1772, Durrani ruler died and his heir Timur Shah Durrani retained Haji Shareef Saddozai in the same capacity.\nBhangi Sikhs captured citadel of Multan on Dec 27 in 1772 and they ruled till 1780, the time when they were defeated by Timur Shah Durrani assisted by young Saddozai Nawab Muzaffar Khan. Nawab Muzaffar Khan Saddozai governed Multan for next 36 years but was martyred in 1818 by the army of Ranjit Singh, ending their rule over Multan.\nThe tomb of Shah Hussain Saddozai is located inside Abdali Masjid. The Rs 8 million project was approved in 2018-19 but executed in 2019-20 under Punjab annual development plan.\nOfficials said that the project would complete at a cost of Rs 6 million and the Rs 2 million saving was being utilized for conservation of mausoleum of Hazrat Sakhi Sultan at Suraj Miani in Multan under another ongoing project.\nApplication of Kankar lime plaster on dome and walls of Saddozai’s tomb, both interior and exterior, has been completed,however,work on putting a finer layer of lime plaster on the interior is yet to be completed.\nKashikari work on tiles has been completed. Underpinning of walls, interior and exterior besides brick imitation work, fresco and stucco work has been completed.\nFloor in Persian blue tiles is awaiting completion while brick-on-edge flooring has been done on the historical tomb that is square in shape at the ground level and octagonal at the upper storey supporting a dome.",
  "retrievedAt": "2025-08-11T20:39:10.953Z"
}
