{
  "title": "NAVTTC launches 17000 trained youth in market under ‘Hunar Mand Pakistan Programme’",
  "link": "https://www.app.com.pk/national/navttc-launches-17000-trained-youth-in-market-under-hunar-mand-pakistan-programme/",
  "date_published": "2021-04-23T16:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 23 (APP):As many as 17,000 students have been launched in the market after completing their training in the demand driven high tech trades under the “Hunar Mand Pakistan Programme” initiated by the incumbent government.\nThe officials from National Vocational and Technical Training Commission (NAVTTC) stated this while giving briefing to the Minister for Federal Education and Professional Training Shafqat Mahmood on Friday during a meeting held here to review the development on “Hunar Mand Pakistan Programme”.\nThe officials said that a total of 30,000 students were being given training in the most demanding sectors of high tech trades.\nShafqat Mahmood commended the achievement of NAVTTC for completing the training of 17,000 students despite severe difficulties due to COVID-19.\n“We have not only made these students eligible for respectable employment but they will also play their vital role in the development of country” the minister said.\nMoreover, NAVTTC officials said that 50,000 students had registered themselves in the second badge for training that had been started from April 12, 2021. The project had been launched with total cost of Rs 3500 million.\nOn the directives of Federal Education Minister, NAVTTC had also launched National Employment Exchange Tools (NEXT) under which the institutions searching and offering employment opportunities (Public, Private and Overseas Sectors) TEVTA’s, TVET institutions and international job markets had been emerged at single platform, they added.\nNEXT, NAVTTC Officials said, would also support to all those facilities being provided for employment opportunities across the country. The total cost of this project is Rs150 million.\nShafqat Mehmood termed the initiative a historical for provision of job opportunities to youth.\nThe minister was briefed that 75 smart labs had been established by the NAVTTC, while the work on another 25 was underway. These smart labs would be utilised for provision of distance education. Under this project all TVET institutions across the country has been developed with modern technology.\nThe total cost for the completion of this project is Rs 500 million, while the cost of a single lab was Rs 65 million.\nTo interlink the standard of TVET sector with modern needs, National Accreditation Council (NAC) headquarter was also being established in Islamabad with the cost of Rs 110 million, NAVTTC informed.\nTo ensure TVET sector quality, Shafqat said, the Council would perform as regulatory platform.\nFurthermore, the Council would also play key role to manage the international linkages, he said adding, with the establishment of this council, the trend of showing better performance among TEVT sector institutions would be developed.\nThe minister was also informed about the formal technology courses in the less developed areas including FATA, GB, AJK and rural areas of southern Punjab and Sindh. NAVTTC would complete the training of 50,000 students in these areas till October 31, 2021.\nThe training of first badge had been completed in March, while the training of second badge was ongoing. The total cost of this project was Rs 2000 million.\nHowever, as many as 20,000 students of Islamabad, AJK and GB were being given apprenticeship training in formal and no formal sectors.\nThis six month training course would be completed with cost of Rs 480 million.\nMarriot, Sarena hotels, KFC, Mcdonald, Rahat and Tehzeeb bakeries, Savour Foods, Kia motors, Suzuki, Atlas Honda, DHA, Bahria, Shaheen Chemist were the partner of this apprenticeship.\nThe minister said that this was the historical programme for the skills development of youth in which first time the training of high tech sectors including Artificial intelligence, Robotics, 3-D Animation, Android apps, cloud computing, Graphics Designing, Industry Automation, and Cyber security were on top of the list.\nHe said that under the vision of prime minister, we were providing employment opportunities to youth by giving them training in modern technologies.\nThey were being made a respected citizens who could play important role in the development of country, Shafqat added.",
  "retrievedAt": "2025-08-11T20:39:11.895Z"
}
