{
  "title": "More monsoon rains expected in coming days: PMD",
  "link": "https://www.app.com.pk/national/more-monsoon-rains-expected-in-coming-days-pmd/",
  "date_published": "2022-07-19T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP): Pakistan Meteorological Department (PMD) has forecast more monsoon rains in different parts of the country during this week which could cause flash flooding in the urban areas and trigger landslides in vulnerable areas.\nThe strong monsoon currents are likely to penetrate in upper and central parts of the country from July 20 (Wednesday) and likely to spread to the other parts of the country from July 21 (Thursday).\nUnder the influence of this weather system, more rain-wind/thundershower with scattered heavy falls are expected in Kashmir, Gilgit-Baltistan, Islamabad, Rawalpindi, Murree, Attock, Chakwal, Jhelum, Sialkot, Narowal, Lahore, Gujranwala, Gujrat, Sheikhupura, Faisalabad, Jhang, Mianwali, Khushab, Sargodha, Hafizabad, Mandi Bahauddin, Swat, Mansehra, Kohistan, Abbottabad, Haripur, Peshawar, Mardan, Swabi, Nowshera, Kurram, Kohat from July 20-26 with occasional gaps.\nMore rain-wind/thundershower with isolated heavy falls is expected in Bannu, Lakki Marwat, Dera Ismail Khan, Sahiwal, Okara, Bhakkar, Layyah, Multan, Khanewal, Pakpattan, Vehari, Rajanpur, Dera Ghazi Khan, Bahawalpur, Bahawalnagar, Rahimyar Khan and Khanpur from July 21-26 with occasional gaps.\nMore rain-wind/thundershower with few heavy falls are expected in Zhob, Ziarat, Barkhan, Loralai, Bolan, Kohlu, Kalat, Khuzdar, Lasbella, Naseerabad, Jaffarabad and Sibbi from July 22-26 while in all districts of Sindh from July 24-26.\nAbout the impacts, the met office said that heavy rains may generate urban flooding in Rawalpindi/Islamabad, Peshawar, Nowshera, Mardan, Faisalabad, Lahore and Gujranwala from July 20 to July 23. While in Karachi, Hyderabad, Thatta, Badin, Shaheed Benazirabad, Jamshoro, Mirpurkhas, Dadu, Umer Kot, Jaccobabad, Larkana and Sukkur from July 24-26.\nFlash flooding is also expected in local Nullahs of Islamabad/Rawalpindi, Abbottabad, Mansehra, Dir and Kashmir from July 20-23 while in Loralai, Barkhan, Kohlu, Mosa Khel, Sherani, Sibbi, Bolan and hill torrents of Dera Ghazi Khan from July 22-25.\nRainfall may trigger landslides in Kashmir, Galiyat, Murree, Chillas, Diamir, Gilgit, Hunza, Astore and Skardu during the forecast period.\nTravelers and tourists are advised to remain more cautious during the forecast period. Farmers are advised to arrange the watering of the fields accordingly.\nAll concerned authorities are advised to remain alert and to take necessary precautionary measure during the forecast period.",
  "retrievedAt": "2025-08-11T15:16:00.762Z"
}
