{
  "title": "Pakistan’s population to double in next 30 years burdening its resources: Turner",
  "link": "https://www.app.com.pk/national/pakistans-population-to-double-in-next-30-years-burdening-its-resources-turner/",
  "date_published": "2022-07-19T09:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP):British High Commissioner on Tuesday observed that Pakistan’s population was going to double in the next 30 years putting a huge burden on its resources that demanded proper response to address the pressing issue.\nThe British envoy made these remarks during a ceremony to commemorate the World Population Day, a collaborative event was conducted here in a joint effort of the United Nations Population Fund (UNFPA) Pakistan, British High Commission, Ministry of National Health Services, Regulations & Coordination (NHSRC), and Population Programme Wing (PPW), the event revolved around the theme”A world of 8 billion: Towards a resilient future for all – Harnessing opportunities and ensuring rights and choices for all,” a news release said.\nWhile addressing the event, British High Commissioner, Christian Turner said, “The business-as-usual approach needs to stop.\nIt is important to talk about family planning. The UK is the largest donor on Family Planning in Pakistan and has been supporting the country since 2012. Delivering Accelerated Family Planning in Pakistan (DAFPAK) is a £90 million programme that has so far reached 7 million family planning users mostly from marginalised communities. The UK remains committed to support Pakistan.”  While addressing the World Population Day event via a video testimonial, President Dr Arif Alvi expressed concern over the constant population growth and the meager resources available in Pakistan.\nHe said that the government needs to exercise all options to sensitize the public about negative implications of population growth not only on human health, especially of mother and child, but also on economic as well as social life of people.\nMinister for Health, Abdul Qadir Patel remarked that Pakistan’s population is likely to double in the next 30 years. He stressed that all partners and stakeholders including civil society organizations and NGOs should come together and join hands with the government to address this growing issue.\nDG Population, Population Programme Wing (PPW), Dr. Sabina Durrani commented that parents have the right to freely and responsibly decide the number and spacing of their children to fulfill the fundamental rights of their children and family by maintaining a Balance or Tawazun between their family size and resources.\n“Population is a denominator to every challenge and issue facing Pakistan right now. It is necessary that we dedicate adequate funding for accelerated Family Planning in Pakistan to reap the benefits of demographic dividend” said Dr Shabnam Sarfraz, Member Social Sector & Devolution, Planning Commission, Government of Pakistan.\nShe also remarked that for a progressive and prosperous Pakistan, it is important that we provide equal opportunities for men and women in education, employment, and entrepreneurship.\nCountry Representative UNFPA Pakistan, Dr. Bakhtior Kadirov called for focusing on every person; on ensuring our world can support our needs & those of future generations, on human rights & on leaving no one behind.\nSinger, philanthropist, and brand ambassador for Family Planning in Pakistan, Shehzad Roy encouraged the government to ensure that before a married couple visits the Nikkah registrar to get their marriage certificate, they should be obligated to pass a basic reproductive health course so that they have adequate knowledge about family planning and birth spacing before they begin their married life.\n“This would not only encourage people to adopt family planning measures but also create awareness in women about their basic rights”, Shehzad added.\nThe need for family planning remains staggeringly high in Pakistan.\nThe grassroots challenges are present such as misconceptions, lack of trained health staff, communication gap between the partners, and others but if we don’t make a serious change, Pakistan’s population is likely to double in the next 30 years.",
  "retrievedAt": "2025-08-11T15:16:00.252Z"
}
