{
  "title": "Sherry calls for clear global environmental agenda, equitable resources to implement pledges",
  "link": "https://www.app.com.pk/national/sherry-calls-for-clear-global-environmental-agenda-equitable-resources-to-implement-pledges/",
  "date_published": "2022-07-19T17:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Tuesday called for a clear restructuring of the global environmental agenda, equitable resources, new goals, and ambitions to implement the climate commitments made by the world fraternity to address environmental degradation.\nThe minister, who is in Berlin, Germany to represent Pakistan at the Petersburg Ministerial Climate Dialogue 2022, made the suggestions in an interview with Al Jazeera, a news release here said.\nSenator Sherry Rehman called for bold changes to the global climate agenda.\nShe said, “Pakistan is exposed to many threats due to climate change, which include rising temperatures, forest fires, floods, droughts, floods, rising sea levels and others.”\nAll these climate change impacts, she added, were affecting life at every level as the country’s glaciers were melting too fast. “We have had 17 incidents of glacial lake outburst flood (GLOF) this year.”\nClimate change, she said, had also caused unimaginable damage to agricultural production, livelihoods, human health and economic stability of Pakistan.\n“These losses include large-scale internal displacement as well as GDP (gross domestic product) losses. We lose 9.1% of GDP due to climate change,” Sherry Rehman said.\nThe minister said the temperature in Pakistan had reached 50 degrees instead of 41 degrees due to severe impact of global warming in the region.\nPakistan, she maintained, had laid the foundation of its response on the conference of parties (COP) agenda to deal with the effects of climate change, and was trying hard to fulfill its clear ambitions.\n“The Global South is looking for a strong financial mechanism to achieve its goals where the resource transfers from developed countries are limited to commitments only,” she added.\nShe said Pakistan accounted for only 1% of global greenhouse gas emissions, but it committed to energy transition and other goals.\n“Pakistan stands with the position of developing countries regarding damages caused by climate change impacts,” she said. “Climate financing needs to change globally to address the impacts of climate change.”\nPakistan, she added, expressed deep concern over the inadequate provision of climate finance by developed countries under the United Nations Framework Convention on Climate Change.\n“Pakistan urges the international community to provide additional and sustainable resources to address climate change threats as hope is not a plan”, Sherry Rahman underlined.\n“The world must go beyond commitments to achieve common climate change goals,” she said.",
  "retrievedAt": "2025-08-11T15:15:55.055Z"
}
