{
  "title": "Ali Zaidi inaugurates Online Portal, a website for Ports & Shipping Wing",
  "link": "https://www.app.com.pk/national/ali-zaidi-inaugurates-online-portal-a-website-for-ports-shipping-wing/",
  "date_published": "2020-09-25T05:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 25 (APP): Federal Minister for Maritime Affairs Ali Haider Zaidi has inaugurated online portal for Seafarers and manning agents and Ship owners and a website for ports & shipping wing.\nSecretary, Maritime Affairs Rizwan Ahmed, Director General Ports and Shipping Shakeel Ahmed Mangnejo and Additional Secretary of Ministry Nadir Mumtaz were also present on the occasion, said a press release.\nFederal Minister said that a major milestone has been achieved by the Ministry of Maritime Affairs for digitalization of data, facilitation of seafarers, manning agents and ship owners by inauguration of a one window online portal.\nHe said that the online portal will help the seafarers in the issuance of their Seafarers Identity Card, Seafarer service book, online verification for Visa issuance and resolution of other issues faced by them.\nAli Haider Zaidi said that previously Seafarers had to travel to Karachi and faced issues due to red-tapism. The portal has brought transparency in the system which will help eradicate malpractices that previously prevailed in the shipping office.\nThe website for Ports and Shipping division has also been launched for the very first time in the history.\nIn a bid to bring across the board accountability and transparency, Maritime Affairs has moved to the e-filing system, has ensured the updated website of the organizations to encourage accessibility and transparency.\nHe said that the ministry is making efforts to further improve the services by launching online portal. He said that this initiative would make life of Seafarers easy and will address their problems at the earliest.\nThe minister said that ferry service would be launched after making all the preparations, adding that in this regard Ministry would conduct meeting with all the stakeholders.",
  "retrievedAt": "2025-08-11T19:50:25.289Z"
}
