{
  "title": "Ayaz urges youth to play their role in nation-building",
  "link": "https://www.app.com.pk/national/ayaz-urges-youth-to-play-their-role-in-nation-building/",
  "date_published": "2024-07-19T12:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP):Speaker of the National Assembly Sardar Ayaz Sadiq Friday urged youth to play their role in nation-building rather than indulging in propaganda and political polarization.\n“Acquainting Youth with parliamentary procedures and norms is pivotal for the growth of democracy in Pakistan”, he expressed these views during his keynote address to the orientation session of the Young Citizen Internship Program 2024.\nHe also said that youth need to be acquainted with the committee system of Parliament as the standing committee plays an effective role in legislation.\nThe  speaker also  informed the participants, “Pakistan Parliament is the first regional Parliament which transformed itself into the first-ever Green Parliament of the World through solarization”\nMember National Assembly (MNA) Dr. Nikhat Shakeel Khan, one of the pioneers of the Youth Internship Program initiated by the National Assembly graced the orientation session with her virtual presence and highlighted the importance of connecting the youth with the Parliament, imparting basic principles of democracy to youth, equipping youth with parliamentary etiquettes, processes and most importantly, directing the youth towards nation-building.\nDirector Advocacy, Campaign, Communications and Media – Save the Children, Raza Hussain Qazi warmly greeted the Young Citizens present in the Speaker’s Lounge and apprised them of the goals and objectives of Save the Children Organization along with the synopsis of what is about to follow in the coming four weeks of the Young Citizen Internship Program 2024.\nSpecial Secretary (Special Initiatives), Syed Shamoon Hashmi delivered the opening remarks and conducted an orientation session to acquaint the Youth with the syllabus, hands-on activities, and workshops of the Program aimed at imparting knowledge related to democratic norms, principles, and processes.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:58:50.758Z"
}
