{
  "title": "Pakistan urges Afghan government to take immediate action against perpetrators of Bannu Cant attack",
  "link": "https://www.app.com.pk/national/pakistan-urges-afghan-government-to-take-immediate-action-against-perpetrators-of-bannu-cant-attack/",
  "date_published": "2024-07-19T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP):Pakistan on Friday strongly urged the Interim Afghan Government to take immediate, robust and effective action against the perpetrators of the 15 July attack at Bannu Cantonment and to prevent such attacks in the future as such attacks undermined bilateral relations and regional stability.\n“We conveyed to the Afghan authorities our serious concern on the terrorist attack at Bannu Cantonment on 15 July 2024 and the continued use of Afghan territory by Hafiz Gul Bahadur Group and Tehrik-i-Taliban Pakistan (TTP) to carry out deadly attacks in Pakistan with impunity,” Foreign Office spokesperson Mumtaz Zahra Baloch said in her weekly press briefing.\nShe said the Bannu Cantonment attack underscored the urgent need for Afghanistan to take concrete and effective action against terrorist sanctuaries within its borders.\n“Despite Pakistan’s repeated calls for action, the presence of TTP and other terror groups in Afghanistan continues to pose a serious threat to regional peace and security,” she said adding “We urge Afghanistan to take effective action against these groups and to ensure that the Afghan territory is not used for terrorism against Pakistan. Pakistan remains committed to combating terrorism and ensuring the security of its people”.\nPakistan also strongly condemned the dastardly terror attack of the 9th of Moharram on Imam Bargah Ali bin Abu Talib in Muscat, Oman that resulted in six deaths including four Pakistani nationals.\nThe attack on peaceful civilians in a mosque during the holy month of Moharram in the peaceful city of Muscat is reprehensible and inhumane. Such acts of terrorism and violence against peaceful civilians cannot be condoned on any grounds whatsoever, the FO spokesperson said.\nShe emphasized that Pakistan condemned terrorism in all its forms and manifestations. This attack demonstrates the persistent threat of terrorism posed by terrorist organizations in the region. It is also a reminder of the importance to work together to fight these terrorist entities and to find common solutions to root out this menace from the region.\n“We stand in solidarity with our brothers and sisters in Oman as they contend with this tragedy. Pakistan has offered all possible assistance to Omani authorities in the investigation and in bringing to justice those responsible for this heinous crime in this holy month of Muharram,” she added.\nPakistan also condemns in the strongest terms the continued genocidal barrage by Israeli occupation forces on the schools and shelters in Gaza, she said adding that over the last 10 days, they had attacked eight schools in Gaza being used as shelters by the displaced civilians. The atrocious attack on the tents of displaced persons in the Al Mawasi area of Khan Younis in southern Gaza resulted in deaths of at least 90 Palestinians, including women and children taking refuge in the camp. Targeting a camp that Israel itself designated as a “safe zone” is another violation of international humanitarian law.\nPakistan also condemns measures being taken by Israel against the creation of a viable and independent Palestinian State. Israel has no locus standi to decide about the future of the lands belonging to the people of Palestine.\nShe added Pakistan firmly believed that the only just solution to the Palestinian question is the creation of a viable, secure, contiguous and sovereign State of Palestine on the basis of the pre-1967 borders and with Al-Quds Al-Sharif as its capital.\n“We are also concerned about the arrest of participants of a Muharram procession in Srinagar under the Unlawful Activities (Prevention) Act for raising pro-Palestine slogans. The incident shows how easily and frequently counter-terrorism laws are invoked by the Indian authorities to oppress and intimidate the Kashmiri people. We urge the occupation authorities to immediately drop the fabricated charges against the arrested mourners, and release them immediately.”\nPakistan will continue to extend political, diplomatic and moral support to our Kashmiri brothers and sisters for the just and peaceful settlement of the Jammu and Kashmir dispute in accordance with the UN Security Council Resolutions, she added.\nMumtaz Baloch announced that Foreign Minister of Turkmenistan Rashid Meredov will visit Pakistan from 22-24 July 2024 who would hold extensive talks with the Deputy Prime Minister and Foreign Minister Mohammad Ishaq Dar and call on the Pakistani leadership. “The talks between the two sides will cover all aspects of bilateral relations between Pakistan and Turkmenistan and exchange of views on regional and global developments.”\nReplying to a question with regard to situation in Dhaka, the foreign office spokesperson said Pakistan was following the developments in Bangladesh. “Our High Commission is in close contact with Pakistani students and with the Bangladeshi authorities to ensure safety of Pakistani students.”\nResponding to another query with regard to concerns shown by the US on the government’s announcement of banning PTI, the spokesperson said commentary from abroad was unwarranted and unacceptable interference in Pakistan’s domestic affairs as the recent decisions by Pakistani courts, including the Supreme Court of Pakistan, showed the strengths of Pakistan’s legal and judicial system and the ability of the Pakistani nation to deal with domestic challenges.\nRegarding participation of Pakistan’s representatives in the inauguration ceremony of newly elected Iranian President, the FO spokesperson said “we have received the invitation, and the final decision with regards to our participation will be made soon and an announcement will be made accordingly”.",
  "retrievedAt": "2025-08-11T03:58:39.743Z"
}
