{
  "title": "PTA calls for timely reporting of unlawful content directly to social media platforms",
  "link": "https://www.app.com.pk/national/pta-calls-for-timely-reporting-of-unlawful-content-directly-to-social-media-platforms/",
  "date_published": "2024-07-19T07:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP): Pakistan Telecommunication Authority (PTA) stressed that timely reporting of unlawful content directly to social media platforms is crucial for its prompt removal.\nThe PTA highlighted that social media platforms encourage users to lodge complaints directly, ensuring a faster and more efficient process to address and eliminate inappropriate content.\nPTA Director Muhammad Farooq in his article “The Need to be Responsible Online User” said it is essential for the public to familiarize themselves with these guidelines, as they provide a framework of rules for uploading and sharing content.\nSocial Media companies strive to ensure a safe platform for users through self-regulation, which involves establishing community guidelines and standards.\nHe further said that effective results cannot be achieved without active public participation. To facilitate the instant reporting of unlawful content to the PTA, a state-of-the-art and user-friendly Complaint Management System (CMS) has been developed.\nIt is accessible online at https://complaint.pta.gov.pk/RegisterComplaint.aspx, with a mobile app available for download on both the Playstore and Appstore.\nUsers, he said, can lodge complaints by selecting relevant categories, such as Against the Glory of Islam, Hate Speech, Anti-State, Child Abuse or Indecent/Immoral content.\nThe PTA team thoroughly analyzes each complaint and takes up the matter with the concerned social media platform for its prompt removal. For public guidance on lodging accurate complaints, a video titled “How to Report Unlawful Online Content” (https://www.youtube.com/watch?v=ZggEw2e5Gdw) has been uploaded on PTA’s official YouTube channel (@ptaofficialpk).\nThe PTA has provided a list of URLs(https://www.pta.gov.pk/assets/media/sm_platforms_09032020.pdf) for major social media platforms where complaints can be lodged directly to the platforms.\nAdditionally, WhatsApp, known for its end-to-end encryption, encourages users to report unlawful content within the app by long-pressing the message and selecting the ‘report’ option.\nIn a culturally rich and diverse nation like Pakistan, where individuals embrace various religious beliefs and sects, it is paramount to avoid uploading or sharing content that offends the sentiments of others. Knowledge of local laws is crucial to avoid legal consequences for uploading unlawful content, he said in the article.\nThe Prevention of Electronic Crimes Act (PECA) Section 37 deals with the removal of unlawful online content related to the glory of Islam, particularly in cases of blasphemy, and Section 11 addresses hate speech and criminalizes any online content that promotes or is likely to promote interfaith, sectarian, or racial hatred.\nPTA encourages online users to use digital space responsibly and to report any unlawful content directly to the relevant social media company or PTA for timely removal. This collective effort will help minimize the negative impact of such content on society at large.\nWith the advent of the internet, spreading an agenda, whether positive or negative, has become incredibly easy. Content uploaded or shared online can reach millions of users worldwide within minutes. This rapid dissemination poses significant challenges, particularly in controlling highly sensitive content such as blasphemy, violence, and harmful, and indecent material that can significantly impact society.\nAs an Islamic country, Pakistan is particularly affected by such unlawful content, facing unique challenges due to the spread of blasphemy and indecent material online.\nTo mitigate the uploading and sharing of unlawful content, every citizen needs to be informed about local laws and the reporting mechanisms available with Social Media companies and regulators.\nIn the online world, timely identification and removal of unlawful content is crucial in minimizing its impact.\nAlthough social media companies use Artificial Intelligence (AI) algorithms for this purpose, these systems are still evolving and require time to become fully effective.\nAs a result, companies currently depend on a complaint-based mechanism, where the public reports unlawful content, and content moderators review the reported content to determine whether it should be removed or geofencing.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:58:36.464Z"
}
