{
  "title": "Gilani for exploring new avenues of cooperation between Pakistan-Algeria",
  "link": "https://www.app.com.pk/national/gilani-for-exploring-new-avenues-of-cooperation-between-pakistan-algeria/",
  "date_published": "2024-07-19T12:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP):Chairman Senate Syed Yousaf Raza Gilani Friday underscored the need to further diversify Pakistan-Algeria relations and explore new avenues of cooperation to further add impetus to bilateral relations.\n“Pakistan enjoys excellent relations with Algeria which are rooted in history, religion and similarity of views on various regional and international issues” he expressed these views during a meeting with Algerian Ambassador Brahim Romani.\nHe also acknowledged and appreciated Algeria’s support to Pakistan in the United Nations and at other international fora, in particular, the support for Pakistan’s various candidatures.\nHe called for broadening the political and economic ties. “There is a great need for closer trade and economic relations as the current level of trade is far below its true potential”, the chairman stated.\nHe highlighted the significance of frequent exchange of business delegations to boost trade and explore opportunities for joint ventures and investment.\nHe said that  Pakistan has one of the best quality rice in the world and Algeria may consider importing rice from Pakistan.\nHe underlined that there is huge potential for mutual collaboration in IT, pharmaceutical and other sectors. Collaboration between Pakistan and Algeria in the IT sector particularly freelancing can be beneficial for both countries as there are thousands of companies in Pakistan providing freelancing services, he maintained.\nHe highlighted the need for parliamentary linkages and institutional cooperation to learn from each other’s experiences. He said that parliamentary diplomacy is one such tool which can help bring people of the two sides closer and promote strong people-to-people contacts. Acknowledging the diplomatic relations, the Senate Chairman observed that Pakistan had issued diplomatic passports to the Algerian leadership to facilitate their travel in 1958.\nOn the Kashmir issue, the chairman said that the unresolved Kashmir dispute remains on the agenda of the UN Security Council (UNSC) since 1948 and continues to threaten regional peace.\nHe said that the durable peace in South Asia remains contingent upon the peaceful resolution of the Jammu and Kashmir dispute, in accordance with the relevant United Nations Security Council Resolutions and as per the aspirations of the Kashmiri people. Similarly, he said that Pakistan is also deeply concerned about the immense loss of human lives in the current escalation between Palestinians and Israel.\nHe said that Pakistan consistently, unequivocally and unreservedly supports the Palestinian cause. He said that Pakistan supports resolving the Palestinian dispute in accordance with the relevant UN Security Council and OIC Resolutions.\nRegarding Afghanistan, the chairman said that Afghanistan is a brotherly country and a stable sovereign and independent in the best interest of Pakistan.\nThe Senate Chairman also expressed his well wishes for the political and parliamentary leadership of Algeria. He extended invitation to his Algerian counterpart to visit Pakistan at a convenient time.\nHe said that people-to-people contacts carry huge importance in promoting bilateral and multilateral cooperation.\nHe said that the Senate of Pakistan is in the process of creating a friendship group for Algeria in the Senate to further diversify the relationship between the two sides and augment multi-sectoral cooperation.\nHe also invited the Ambassador to visit Multan and explore opportunities for developing linkages with local trade organizations as Multan is the hub for mango production, ceramics and many other important locally manufactured goods.\nThe Ambassador thanked the chairman senate for his warm sentiments.\nHe also called for further expanding mutual ties and said that Pakistan is an important country for Algeria.  “Pakistan is the first nuclear country of the Muslim World and Algeria takes pride in that”, the Ambassador said while highlighting the importance of bilateral relations between the two countries.\nHe informed that Algeria has been blessed with natural resources, particularly oil and gas reserves.\nThe Ukraine war and evolving regional scenario have attracted many companies towards Algeria making it a new emerging market of oil, gas and LNG, he noted.\nHe informed that Algeria has supported Pakistan at the UNSC level and Pakistan will reciprocate the same.  Both countries can play an active role at the UNSC level to support each other on different issues, he added.\nHe said the Algerian business and trade delegation would visit Pakistan soon to explore new investment opportunities.  The current level of trade and economic relations, the Ambassador said, needs to be expanded more keeping in view the decades-long diplomatic and political relationship, he added.\nHe said that both countries share the same vision for regional development and emphasized creating a conducive and friendly environment for trade and economic activities.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:58:49.889Z"
}
