{
  "title": "USF completes 130 projects: Senate body on IT informed",
  "link": "https://www.app.com.pk/national/usf-completes-130-projects-senate-body-on-it-informed/",
  "date_published": "2024-07-19T16:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 19 (APP): The CEO of the Universal Service Fund (USF) informed the Senate Standing Committee on Information Technology and Telecommunications that since its inception in 2006, the USF has completed 130 projects while 31 projects are currently in progress and are expected to be completed within one and a half years.\nThe meeting was chaired by Senator Palwasha Mohammad Zai Khan.\nThe Chief Executive Officer (CEO) also informed the participants of the meeting about the foundation of USF, mandate and Telecom Act, USF Programs, project categories, and the impact of the projects over the years.\nHe further added that no grant from the government or any agency has been taken by USF.\nThe Minister of State for Information Technology and Telecommunication (MOITT) Shaza Fatima Khawaja informed the committee members that the current government had started the process to return the longstanding USF funds.\nThe finance ministry was also forthcoming, and it was highlighted that the money would be returned to the USF in multiple installments.\nThe CEO also briefed on total PTA sites and USF contracted sites, adding that 9% of the total Telecom Network is USF-funded.\nHe informed about the breakdown and ratio of the USF infrastructure compared to the mobile service providers, in which the share in Balochistan has 54% of the network coverage, whereas 4% is in Punjab, 7% is in Sindh, and 13% is in Khyber Pakhtunkhwa.\nHe stressed that more than 200 networks have been deployed in Kohistan, KPK. Furthermore, the CEO mentioned the challenges faced by USF, such as security concerns, damages to infrastructure, terrorist activities, NOC and Jirga issues.\nHe also added that mitigation steps, such as engagement and coordination with law enforcement agencies (LEAs), have been carried out to tackle these challenges.\nFollowing USF, the CEO of Ignite (National Technology Fund) presented a detailed briefing on its functioning and development projects.\nWhile reporting on Tech Entrepreneurship, he highlighted the National Incubation Centers (NICs), and said that the project, initiated in 2016 in Islamabad, now encompasses eight national divisions and 1,610 startups.\nSome of the successful NIC startups include BYKEA, with an investment of $30 million, and PakVitae, with an investment of $17 million. Ignite has established eight NICs in Islamabad, Lahore, Quetta, Karachi, Peshawar, and Hyderabad, along with two specialized incubators in Faisalabad (for agritech) and Rawalpindi (for aerospace technologies).\nSenator Anusha Rahman Ahmed Khan pointed out that some policies initiated in 2018 have not been implemented.\nShe also raised concerns that the creative labs at the Lahore University of Management Sciences (LUMS), which were inaugurated for students, have been used for commercial purposes.\nAdditionally, she recommended that the Minister of State for Information Technology and Telecommunication chair the Board of Governors, which is currently presided over by different heads.\nIn response to Senator Anusha Rahman’s suggestion, the Minister of MoITT noted that, due to the State-Owned Enterprise (SOE) Act of 2023, there was a development requiring these boards to be headed by private sector representatives. However, she will endorse the recommendations being suggested.\nIt was reported that over 4.5 million trainings have been conducted since 2018 to develop a workforce skilled in digital competencies.\nThe committee members unanimously agreed to revise the curriculum to impart better digital skills to the youth.\nIn addition, The Secretary (MoITT) briefed on the functioning of MOITT and its Digital Pakistan Mandate, human resources, and the current budget, noting that the actual expenditure for 2023-24 was Rs 870,216,582 and the budget for 2024-25 is Rs 993,568,000.\nHe also reported on the telecom wings, the telecom sector landscape, and the approved draft of IT and telecom policies. The chairperson of the committee suggested that the Ministry officials share the draft policies especially the AI policy, with the committee members for future deliberations\nThe meeting featured the presence of Senator Dr. Afnan Ullah Khan, Senator Dr. Mohammad Humayun Mohmand, Senator Saifullah Sarwar Khan Nyazee, Senator Gurdeep Singh, Senator Anusha Rahman Ahmad Khan, Senator Nadeem Ahmed Bhutto, Minister of State for Information Technology and Telecommunication, The CEO of Universal Service Funds (USF), Ignite, National Information Technology Board (NITB), and senior officials from Ministry of Information Technology and Telecommunication and other concerned departments.",
  "retrievedAt": "2025-08-11T03:58:37.982Z"
}
