{
  "title": "Minister directs NHA to make organization profitable, resource increasing",
  "link": "https://www.app.com.pk/national/minister-directs-nha-to-make-organization-profitable-resource-increasing/",
  "date_published": "2024-07-08T16:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP):Federal Minister for Communications, Privatization and Board of Investment Abdul Aleem Khan on Monday directed the National Highway Authority (NHA) to make a profitable and resource increasing organization to ensure the self-sufficient in future.\nPresiding over a high-level meeting, the minister said that NHA should bring change in its reputation and become a good name for the nation and the country by working with self-reliance, hard work and honesty, said a press release.\nHe further said that his first priority in the department is to ensure the construction of a safe and qualitative Motorway from Sukkur to Karachi, followed by the completion of highways from Karachi to Quetta and from Mansehra to Babusar Top, as soon as possible.\nHe said that from the commercial point of view, the main target of all our highways’ and road network should be the countries of Central Asia which will be more beneficial for Pakistan.\nAleem Khan said that he is offering new tasks and departmental plan of action under which Government funds will not be wasted in any way and there will be zero tolerance on corruption through which maximum benefit could be attained from minimum expenditure.\nHe directed that for the new and ongoing projects of NHA there must be third party evaluation from multinational companies. He said the authority has to avoid the old working system and come forward to compete with the private sector.\nThe minister directed that trucks exceeding the allowed weight should not come on any highway of NHA moreover long queues should be eliminated by ensuring “M-Tag” on all motorways including Lahore-Sialkot sector.\nAleem Khan further said that he himself visit to Sindh and Balochistan provinces so that the speed of work on the projects of NHA could be reviewed on the spot.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:47:10.134Z"
}
