{
  "title": "TikTok acts against 20,207,878 videos for breaching community guidelines",
  "link": "https://www.app.com.pk/national/tiktok-acts-against-20207878-videos-for-breaching-community-guidelines/",
  "date_published": "2024-07-08T12:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP):In Pakistan alone, TikTok acted against 20,207,878 videos for breaching its community guidelines during the January-March, underscoring its resolve to combat violations effectively.\nDuring the January-March period of 2024, TikTok’s proactive measures led to the removal of 166,997,307 videos worldwide, representing about 0.9% of all videos uploaded on the platform.\nA substantial portion of these, 129,335,793 videos, were identified and removed through automated detection technologies, while 6,042,287 videos were reinstated upon further review said TikTok Q1 2024 Community Guidelines Enforcement Report.\nIn its continuous effort to foster a secure and positive online environment, TikTok has unveiled its latest Community Guidelines Enforcement Report for the first quarter of 2024.\nThis release highlights TikTok’s unwavering commitment to transparency, safety, and inclusivity, reflecting its dedication to building trust and ensuring a safe platform for its global community.\nIn a bid to enhance transparency, TikTok has now disclosed the number of comments removed and filtered by our comment safety tools for the first time. TikTok has removed and filtered 976,479,946 comments using comment safety tools during this three-month period.\nMoreover, TikTok aggressively pursued spam accounts and related content, implementing robust measures to prevent the proliferation of automated spam accounts.\nNotably, approximately 93.9% of videos that violated the guidelines were removed within 24 hours of posting, and the proactive removal rate for the quarter stood impressively at 99.8% globally. In a global effort to safeguard younger users, TikTok also deleted 21,639,414 accounts suspected of belonging to individuals under the age of 13.\nTikTok’s Community Guidelines are meticulously crafted to cultivate an environment that is safe, inclusive, and authentic for all users, without exceptions. The guidelines are enforced uniformly across all content and users, with TikTok striving for consistency and fairness in its enforcement actions.\nLeveraging advanced technology and human oversight, TikTok efficiently identifies, reviews, and addresses content that contravenes its guidelines. The periodic publication of the Community Guidelines Enforcement Report offers insights into the scale and nature of content and account actions, underscoring TikTok’s commitment to full transparency.\nFor detailed insights into the Q1 2024 report and to learn more about TikTok’s content guidelines, tools, and policies, visit TikTok’s Transparency Centre, available in both Urdu and English.\nAdditionally, TikTok will continue to provide a summary of the Covert Influence Operations (CIO) networks removed, while detailed information on individual operations disrupted is available in a new standalone report.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:45:58.216Z"
}
