{
  "title": "Interior Minister Mohsin Naqvi reviews security plan during Muharram",
  "link": "https://www.app.com.pk/national/interior-minister-mohsin-naqvi-reviews-security-plan-during-muharram/",
  "date_published": "2024-07-08T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 8 (APP):Interior Minister Mohsin Naqvi on Monday reviewed a Security Plan for ensuring peace and order during Muharram across the country. The minister presiding over an important meeting.\nThe meeting reviewed security situation in all provinces including Azad Kashmir, Gilgit-Baltistan and Islamabad. The meeting also decided to ban the use of drones in processions and assemblies from 1st Muharram to 10th Muharram.\nIt was also decided that the decision to shut down the internet and mobile phone will be taken in consultation with the respective provinces in the context of security concerns.\nCitizens face problems due to internet or mobile phone outages, said Mohsin Naqvi adding a decision In this regard needs to be made according to the ground facts and security situation. Federal, Provinces, Azad Kashmir will provide all possible support for peace in Gilgit-Baltistan and Islamabad and the needs of Azad Kashmir and Gilgit-Baltistan and provinces will be met related to public order.\nHe instructed to prepare advance plans for rallies and gatherings in view of rains while ordering of strict checking at entry and exit routes. He said that processions and gatherings should be monitored through cameras and the code of conduct should be enforced.\nHe ordered Security of mosques, imambargahs and other places of worship should be given full attention.Punjab, Khyber Pakhtunkhwa, Sindh, Balochistan, Azad Kashmir Gilgit-Baltistan and Islamabad IGs Police and Interior Secretaries briefed on public peace plan during Muharram.\nFederal Secretary Interior. Federal Secretary Religious Affairs. Chairman CDA. IG Islamabad Police also attended the meeting along with the top officials of the Ministry of Interior and law enforcement agencies.\nAll provinces, Azad Kashmir, Chief Secretaries of Gilgit-Baltistan, IGs Police, homes secretaries, Commandant of the Frontier Constabulary, Frontier Corps Balochistan North, South and top officials of law enforcement agencies participated in the meeting through video link.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:45:58.214Z"
}
