{
  "title": "PNCA conducts ‘Modern Calligraphy Workshop’ on Monday",
  "link": "https://www.app.com.pk/national/pnca-conducts-modern-calligraphy-workshop-on-monday/",
  "date_published": "2024-07-08T15:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 08 (APP):The participants at the ‘Modern Calligraphy Workshop’ conducted by the talented Ms. Rahat Shahid at Pakistan National Council of the Arts (PNCA) on Monday learned the intricacies of modern calligraphic art.\nThis workshop was part of the exhibition “Be a Catalyst; Re-imagining Connection with Gaia,” held in collaboration with PNCA from July 03-10 to explore the profound connections between humanity and the Earth.\nUnder the expert guidance of Ms. Rahat Shahid, attendees embarked on a creative journey, learning the intricate techniques of modern calligraphy using canvas, acrylic colors, and brushes.\nThe participants created beautiful phrases such as “Ya Allah” and “Allahu Akbar,” mastering the art from background creation to final writing. The workshop provided a platform for both beginners and seasoned artists to refine their skills and discover new dimensions of artistic expression.\nMs. Rahat Shahid, a self-taught artist with a post-graduate degree from Punjab University Lahore, shared her vast knowledge and passion for calligraphy with the participants. Her dedication to the transformative power of art was evident in every stroke she demonstrated.\nMs. Shahid’s belief in art’s ability to influence societal norms and deliver powerful messages was a central theme throughout the workshop.\nThe workshop attendees expressed their appreciation for the hands-on approach and personalized guidance provided by Ms. Shahid. Many participants noted the profound impact of the workshop on their understanding of calligraphy and their artistic capabilities.\nThe collaborative environment fostered creativity, inspiration, and a deep appreciation for the art form.\nThe Modern Calligraphy Workshop was conducted in connection with the exhibition “Be a Catalyst; Re-imagining Connection with Gaia.”  The workshop added a unique dimension to the exhibition, highlighting the role of art in fostering a deeper understanding of our relationship with the natural world.\nThe success of this workshop underscores the Pakistan National Council of the Arts’ commitment to promoting artistic expression and providing platforms for artists to share their expertise.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:47:10.995Z"
}
