{
  "title": "PM felicitates nation, Ummah on new Islamic year; prays for an end to oppression in IIOJK, Palestine",
  "link": "https://www.app.com.pk/national/pm-felicitates-nation-ummah-on-new-islamic-year-prays-for-an-end-to-oppression-in-iiojk-palestine/",
  "date_published": "2024-07-07T19:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 07 (APP): Prime Minister Muhammad Shehbaz Sharif on Sunday expressed his good wishes to the nation and the Ummah on the beginning new Islamic year and prayed for the peace, stability, progress and prosperity of both.\nIn a message on the new Islamic year 1446 Hijrah, he also prayed for relief of those Muslims facing atrocities across the globe including oppressed Kashmiri people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) and Palestine, PM Office Media Wing said in a press release.\nThe prime minister prayed that the shadows of oppression and atrocities on these areas might recede and there might be a dawn of peace, progress and prosperity.\nThe new year also reminded them of the unforgettable sacrifices of Hazrat Imam Hussain (RA) and his companions in the battle of virtue and evil while strictly adhering to the principles of truthfulness and justice and they would be always remembered for their supreme sacrifices, he added.\nHe further said that their unwavering courage, sacrifice and passion against oppression had been an unprecedented example in the world.\n“That incident also remind them of those sublime characteristics including sympathy, justice and unity which are ingrained in our faith and encourage us to stand against injustices and oppression by contributing towards a society based upon values of peace, harmony and mutual respect,” he added.\nThe prime minister stressed upon to follow the supreme qualities set by our Holy Prophet (Peace Be Upon Him) and his companions.\nHe also emphasised upon shunning of all differences by promoting tolerance and mutual respect in the society and called for the creation of a society based upon principles of social justice, equality and sympathy.\nHe opined that the new Islamic year provided them an opportunity to lead a life in accordance with the Islamic teachings.\nThe prime minister said that the economic challenges had been reduced and the country’s economy was on the right track but they were cognizance of fact to further strive for making life of the common man easier, provision of equal opportunities to all and taking the country on the path of progress and prosperity.\nHe called upon the nation to set aside their differences and work for the bright future of Pakistan with unity.",
  "retrievedAt": "2025-08-11T03:46:23.682Z"
}
