{
  "title": "AIOU to provide free education facilities to students of Balochistan, GB, FATA",
  "link": "https://www.app.com.pk/national/aiou-to-provide-free-education-facilities-to-students-of-balochistan-gb-fata/",
  "date_published": "2024-07-08T10:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 08 (APP):Vice Chancellor, AIOU Professor Dr. Nasir Mahmood Monday said that the university is extending free education facilities for the students of Gilgit-Baltistan, Balochistan Province, and the merged tribal districts (formerly FATA).\nThe objective behind this initiative is to contribute to the efforts of the present government towards the enrolment of out-of-school children.\nAIOU is setting an exemplary role by playing its role in the national initiative of enrolling out-of-school children through providing free education up to matriculation level for children.\nThe university’s autumn semester for 2024 is commencing from July 15.\nThe Vice-Chancellor has directed the heads of the relevant regional offices to ensure that this message reaches every household in these three regions so that out-of-school children can benefit from this university facility and illuminate their lives through education.\nAdditionally, the university provides fee concessions for those students who are unable to continue their education due to financial constraints, said a news release.\nFor availing of this facility, individuals can contact the nearest regional office of the university.\nAIOU also offers free education to prisoners and transgender individuals so that they can be empowered to become productive and positive members of society.\nThe university provides education to prisoners within jail premises.\nThe aim of providing free education to prisoners is to transform the lives of criminals in such a way that they can start a new life as civilized, useful, and positive citizens of society after completing their sentences.\nMore than 1,200 prisoners have already been connected to the educational network of the university.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:46:21.643Z"
}
