{
  "title": "Tribunal seeks affidavits from winning candidates of capital’s constituencies",
  "link": "https://www.app.com.pk/national/tribunal-seeks-affidavits-from-winning-candidates-of-capitals-constituencies/",
  "date_published": "2024-07-08T17:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 08 (APP):The Election Tribunal of Islamabad on Monday instructed the PML-N’s successful candidates from three constituencies of the capital to again submit their affidavits in cases challenging election results.\nElection Tribunal Islamabad’s Judge Justice Tariq Mehmood Jahangiri heard the petitions about the election results.\nThe court also imposed a fine worth Rs20,000 each on Tariq Fazal Chaudhry and Raja Khurram Nawaz over nonsubmission of their answer in to the matter. Justice Jahangiri remarked on the occasion that if there is a delay, a fine of Rs100,000 will be imposed.\nJustice Tariq Mahmood Jahangiri instructed the petitioner’s lawyer to read Rule 144 of the Election Act, on which the petitioner’s lawyer read the process of the tribunal. The court said that note all these things, we have to proceed. However, if the winning candidate delays the hearing, the tribunal will issue a show-cause notice suspending his membership within 15 days.\nThe trial is to be conducted on a day-to-day basis and the decision is to be taken within 180 days as per the law, he said. The court said that the parties are bound to file the reply within seven days. He asked the lawyer to also read section 147, according to which the reply has to be submitted along with the affidavit.\nThe court said that we are first clarifying the procedure and then will hear all the cases one by one daily. If anyone has any objection can tell me here, it added. The election tribunal asked the successful candidates of Muslim League-N to submit their affidavits before the next hearing.\nThe court adjourned further hearings on petitions regarding the election results of NA-46, NA-47, and NA-48 till July 11, 10, and 9th respectively.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:46:51.099Z"
}
