{
  "title": "Privatization process of PIAC is almost completed: NA Committee informed",
  "link": "https://www.app.com.pk/national/privatization-process-of-piac-is-almost-completed-na-committee-informed/",
  "date_published": "2024-07-08T18:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 08 (APP):National Assembly’s standing committee on Aviation on Monday was informed that the privatization process of Pakistan International Airlines Corporation (PIAC) is almost completed.\nThe Civil Aviation Authority (CAA) currently operates 22 out of 43 airports, including 13 international ones, and has been experiencing budget constraints on the development side for several years, says the press release.\nAs a result, the CAA is using second-generation equipment, whereas developed countries are utilizing the latest third-generation equipments.\nThe Committee also emphasized the need to improve the quality of food service and the behavior of Civil Aviation Authority (CAA) staff towards passengers to enhance the overall travel experience.\nFurthermore, the Committee was briefed that the Pakistan Meteorological Department (PMD) has planned to install five new radars in Quetta, Dera Ismail Khan, Cherat, Gwadar, and Lahore.\nMoreover, 3 mobile radars and 300 automatic weather stations were also installed under the World Bank-funded Hydromet Project.\nThe Committee was also informed that Pakistan Disaster Management (PDM) is developing a Kisan Mobile application that aims to provide farmers and other state departments with early weather forecasts and flood warnings.\nAdditionally, the Committee expressed concerns about the cracks in the aircraft parking area at Allama Iqbal International Airport, Lahore.\nIn response, the CAA acknowledged the issue and reported that the work has been awarded and is currently underway. The Committee also raised concerns about the appointment of aero-medical staff and the licensing of pilots and recommended that the relevant authorities submit a comprehensive report on these matters.\n2nd meeting of the Standing Committee on Aviation was held under the Chairmanship of Nawabzada Iftikhar Ahmed Khan Babar, MNA at Parliament House, Islamabad.\nThe MNAs included Mr. Aqeel Malik, Dr. Darshan, Choudhary Iftikhar Nazir, Mr Ramesh Lal, Mr Abdul Aleem Khan, Ms Munaza Hassan, Mr Saleem Rehman, Haji Imtiaz Ahmed Choudhry, Mr Ihsan Ullah Virk, Mr Muhammad Saad Ullah, Mr Usman Ali besides the officials of the Ministry attended the meeting.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T03:46:46.720Z"
}
