{
  "article_id": "2025-04-16_dda2b7b4cc0fd0d77bfd78efd916b8e7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pnca-hosts-soulful-qawwali-night-to-preserve-pakistans-cultural-legacy/",
    "retrieved_at": "2025-08-27T14:32:31.931Z"
  },
  "metadata": {
    "title": "PNCA hosts soulful Qawwali Night to preserve Pakistan’s cultural legacy",
    "author": null,
    "date_published": "2025-04-16T18:13:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 246,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):The Pakistan National Council of the Arts (PNCA) organized a captivating Qawwali Night, celebrating the rich Sufi musical tradition with a mesmerizing performance by renowned Qawwal Shujat Salamat Ali Khan. The event attracted a large audience of art and culture enthusiasts, who were enthralled by the powerful spiritual expression of this age-old genre. Speaking on the occasion, Director General of PNCA, Muhammad Ayub Jamali, said that Qawwali holds a timeless status in the region's cultural and civilizational heritage. \"Qawwali is not just music; it is a deep-rooted cultural expression that connects us to our spiritual past,\" he remarked. He highlighted that PNCA has emerged as an unparalleled platform for promoting quality Qawwali and artistic expression. \"PNCA has become a hub for those who truly appreciate cultural programs. Regular listeners and viewers eagerly await and attend such events,\" he noted. Jamali further stated that preserving Qawwali in its purest form is a significant challenge in modern times, but PNCA has taken on this responsibility with dedication. \"This art, in its authentic form, is a priceless cultural treasure,\" he added. He emphasized that PNCA is the only national platform where all the prominent Qawwals of Pakistan have performed. \"Our land has produced globally acclaimed Qawwals, and PNCA is committed to continuing this rich legacy through sincere and sustained efforts.\" The event served as a tribute to Pakistan's deep-rooted spiritual and cultural traditions, reinforcing PNCA's mission to keep the country's artistic heritage alive for future generations.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}