{
  "article_id": "2025-04-16_a61e3b19e2276f8b998aee908253ee8d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-directs-integration-of-it-education-from-grade-6-boosts-nationwide-digital-training-initiatives/",
    "retrieved_at": "2025-08-27T14:33:24.368Z"
  },
  "metadata": {
    "title": "PM Shehbaz directs integration of IT education from Grade 6, boosts nationwide digital training initiatives",
    "author": null,
    "date_published": "2025-04-16T15:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 392,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):Prime Minister Muhammad Shehbaz Sharif on Wednesday issued directives for formulating an immediate strategy to make Information Technology a mandatory subject from Grade 6 onwards across the country. The prime minister chaired a high-level review meeting on the matters pertaining to the Ministry of Information Technology and Telecommunication, emphasizing that the promotion of the IT sector and growth in IT-related exports were among the government's top priorities, a Prime Minister's Office news release said. \"The inclusion of IT in school curricula is vital to preparing our future generations for the demands of the digital economy,\" said PM Shehbaz, calling for unified efforts with provincial governments to ensure quality and standardized IT education and training at school, college, and university levels. The prime minister further instructed the Ministry to initiate IT training programs in underdeveloped regions, particularly in Islamabad, Gilgit-Baltistan, Azad Jammu and Kashmir, and Balochistan. He stressed that the standard of these programs should be high enough to enable trainees to secure competitive employment both within Pakistan and internationally. Officials from the Ministry briefed the prime minister in detail about current initiatives and upcoming projects. Under the \"School Broadband Connectivity Project,\" internet infrastructure in Islamabad schools is being upgraded. The meeting was informed that during the fiscal year 2024-2025, the Ministry has already provided high-end IT training to 49,800 individuals and general training to over 600,000 people. In collaboration with Huawei, skills and vocational training centers are being established at the International Islamic University Islamabad, the National University of Sciences and Technology (NUST), and the COMSATS University Lahore campus. Additionally, Huawei's advanced training programs in Artificial Intelligence, Cloud Computing, Big Data, and Cybersecurity have been integrated into the curricula of the Ghulam Ishaq Khan Institute of Engineering Sciences and Technology (Topi), the University of Engineering and Technology (Taxila), and the Mehran University of Engineering and Technology (Jamshoro). The Ministry of Federal Education and Professional Training, in partnership with Huawei, will also provide training to 146,367 students and upgrade 1,300 laboratories across the country. This initiative is expected to benefit students particularly in Islamabad, Gilgit-Baltistan, and Azad Jammu and Kashmir. The meeting was attended by Federal Minister for Economic Affairs Ahad Khan Cheema, Federal Minister for IT and Telecommunication Shaza Fatima Khawaja, Chairman of the PM Youth Program Rana Mashhood Ahmad Khan, senior government officials, and Huawei CEO Ethan Sun.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}