{
  "article_id": "2025-04-16_0a863bec65cf9e3b733c19e718a6e0f0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-aims-to-become-regional-hub-for-used-textile-trade-mussadiq-malik/",
    "retrieved_at": "2025-08-27T14:33:51.001Z"
  },
  "metadata": {
    "title": "Minister calls for global support in textile waste recycling, highlights circular economy success",
    "author": null,
    "date_published": "2025-04-16T12:37:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 411,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):Federal Minister for Climate Change and Environmental Coordination, Senator Musadik Masood Malik, has underscored the critical role of the used textiles trade in combating global fashion waste, stating that millions of tons of clothing end up in landfills each year. Speaking at a high-level dissemination meeting on circularity and the used textiles trade, organized by a non-governmental organization in collaboration with the United Nations Environment Programme (UNEP) and the European Union, Minister Malik emphasized that recycling, reusing, and up cycling textiles can significantly reduce environmental harm. Minister Malik highlighted Pakistan's growing influence in the sector, noting that used textile exports surged to $283 million in 2024, up from $255 million in 2023. Pakistan remains among the top three global re-exporters of second-hand clothing, accounting for nearly 60% of the country's total textile exports. \"This trade is not just commercial-it's about environmental stewardship, social equity, and economic resilience,\" he said. The sector supports millions of low-income families, including 39% of Pakistanis living below the poverty line, by providing affordable clothing, especially in extreme weather. Pakistan has demonstrated exceptional efficiency in textile waste management, with less than 1% of imported used textiles ending up in landfills. Faisalabad's processing over 85% of the country's textile waste. Recyclers handling 1,000 to 3,000 tons annually. \"Despite limited resources, Pakistan has turned waste into resources, making a substantial contribution to global climate action\" Malik stated. However, the minister raised concerns over post-COVID challenges, including an influx of textile waste disguised as second-hand goods. He stressed the need for globally accepted criteria to differentiate between usable textiles and waste, urging international regulatory cooperation. The Ministry of Climate Change is drafting Pakistan's first National Circular Economy Policy, aiming to shift industries toward sustainable practices. The used textiles sector is being recognized as a national success story in this transition. Minister Malik called on the European Union to acknowledge Pakistan's role in managing Global North-generated textile waste-done without recycling fees or financial support. \"While policies like the Carbon Border Adjustment Mechanism (CBAM)and Eco-design for Sustainable Products Regulation (ESPR) are important, incentives must accompany regulation,\" he said. \"Pakistan is providing an **environmental service to the world-this deserves recognition and support.\" In his closing remarks, Malik emphasized that equitable global support is crucial for scaling circular economy efforts. \"Pakistan has proven that circularity is possible even with limited resources-imagine what we could achieve with the right backing,\" he said. \"The world must unite for a fair and sustainable future.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}