{
  "article_id": "2025-04-16_c41f3bc2f214e5fd8860279f36f3e2a1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/aiou-hosts-education-expo-2025-to-introduce-youngsters-to-tech-advancement/",
    "retrieved_at": "2025-08-27T14:33:29.803Z"
  },
  "metadata": {
    "title": "AIOU hosts Education Expo 2025 to introduce youngsters to tech advancement",
    "author": null,
    "date_published": "2025-04-16T13:50:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 416,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):Allama Iqbal Open University(AIOU) on Wednesday successfully hosted the Education Expo 2025, with an aim to introduce the younger generation to educational, professional, and technical advancement opportunities. The expo received overwhelming appreciation from students, teachers, and attendees. Various universities from across the country, along with industrial, commercial, and research organizations, set up informative stalls at the event. These stalls provided students with valuable information regarding career guidance, modern technology, skills development, and educational opportunities. The event was organized by the university's ORIC (Office of Research, Innovation and Commercialization). At the opening of the event, the university's Vice Chancellor, along with Dean of the Faculty of Social Sciences Prof. Dr. Abdul Aziz Sahir, Dean of the Faculty of Sciences Prof. Dr. Sher Muhammad, Registrar Raja Umar Younis, Director Administration and Coordination Prof. Dr. Syed Aamir Shah, Additional Director ORIC Dr. Saima Nasir, and other senior officials, visited all the stalls. Speaking at the event, Vice Chancellor Dr. Nasir Mahmood expressed immense pride in his university team, especially Additional Director ORIC Dr. Saima Nasir, for her tireless dedication and passion. He stated that it was because of her leadership and efforts that they successfully held the Education Expo for the second consecutive year. To enhance student engagement, a lucky draw was also organized during the event, in which the Vice Chancellor himself participated by personally purchasing a ticket for 100 rupees. His gesture was warmly appreciated by the attendees. Later, as part of the \"Green Pakistan Campaign,\" the Vice Chancellor planted a tree in the university grounds, reaffirming the commitment to environmental improvement. Students described the expo as informative, inspiring, and career-enriching. They said events like these not only help define their academic direction but also polish their creative abilities. The chief guest at the closing ceremony was Centaurus CEO Sardar Yasir Ilyas Khan. While appreciating the capabilities of the youth, he stated that our young people have immense potential - they only need proper guidance and suitable opportunities to turn their dreams into reality. He praised students' startups and business ideas and emphasized that the future of Pakistan lies in the hands of its youth. In conclusion, the Vice Chancellor urged the youth to avoid shortcuts and to make innovation, hard work, and self-confidence their guiding principles alongside education. He encouraged them to turn their ideas into reality and contribute to the country's progress. At the end of the event, participating institutions, stall organizers, and partner organizations were presented with honorary certificates and shields.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}