{
  "article_id": "2025-04-16_6bc1e8aca156575ad009469b51cbea40",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cm-balochistan-thanks-federal-government-for-funding-major-development-projects/",
    "retrieved_at": "2025-08-27T14:33:24.419Z"
  },
  "metadata": {
    "title": "CM Balochistan thanks federal government for funding major development projects",
    "author": null,
    "date_published": "2025-04-16T15:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 276,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):Chief Minister Balochistan, Mir Sarfaraz Bugti Wednesday expressed gratitude to the federal government for allocating funds for the dualization of a main highway in Balochistan and the Kachhi Canal Project. He was addressing a news conference in Islamabad alongside Federal Ministers Jam Kamal and Khalid Magsi. The chief minister said that this financial support is a goodwill gesture for the people of Balochistan, as the money comes from the national exchequer and belongs to every Pakistani. He noted that the dualization of the N-25 highway, linking Chaman, Quetta, Kalat, Khuzdar, and Karachi, will significantly improve transportation and provide a safe, international-standard road facility to the public. Highlighting the importance of the Kachhi Canal Project, he said its completion will mark the beginning of an agricultural revolution in the province by ensuring irrigation for vast areas of farmland. Commerce Minister, Jam Kamal Khan lauded the prime minister's decision, stating that such initiatives offer a new vision for the youth of Balochistan, enabling them to contribute to the nation's progress and prosperity. Minister for Science and Technology, Khalid Hussain Magsi also expressed confidence in the quality of the projects being implemented. He thanked the prime minister for announcing an additional 10 percent quota for Baloch students in the agriculture graduates program in China. Responding to a question, Chief Minister Bugti said that improving the security situation in Balochistan remains the top priority. He acknowledged the challenge but affirmed the government's resolve and capacity to tackle it, stating, \"Pakistan's prosperity begins from Balochistan.\" To another question, he said that public sector development expenditure in Balochistan has been enhanced to directly benefit the people of the province.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}