{
  "article_id": "2025-04-16_a085402c6d55d3693aaf12d483d07b79",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-for-transparency-in-construction-of-islamabads-jinnah-medical-complex-project/",
    "retrieved_at": "2025-08-27T14:33:55.730Z"
  },
  "metadata": {
    "title": "PM for transparency in construction of Islamabad’s Jinnah Medical Complex project",
    "author": null,
    "date_published": "2025-04-16T10:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 211,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP): Prime Minister Shehbaz Sharif on Wednesday directed the authorities concerned to ensure transparency in the construction of Jinnah Medical Complex of Islamabad, saying that he would personally monitor all stages of the construction. The prime minister, chairing a review meeting on the construction of Jinnah Medical Complex, said that the hospital would be equipped with modern medical research facilities and healthcare services to benefit the entire region. He instructed that consultants and contractors for design, supervision, and construction should be hired through international tendering. During the meeting, the prime minister was briefed about the progress in the construction of the Jinnah Medical Complex and Research Center. It was informed that the PC-I of the Jinnah Medical Complex will soon be finalized in consultation with stakeholders. An initial capital of Rs. 3.5 billion has already been transferred to the trust fund established for the project. It was told that the international-standard hospital, spanning over 600 kanals, will have more than 1,000 beds and nine Centers of Excellence. The meeting was attended by federal ministers Ahsan Iqbal, Azam Nazeer Tarar, Ahad Khan Cheema, and Syed Mustafa Kamal, Advisor to Prime Minister Syed Tauqeer Shah, MNA from Islamabad Anjum Aqeel, Professor Dr. Saeed Akhtar, and senior officials from relevant institutions.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}