{
  "article_id": "2025-04-16_500307d5cab230fe07b4c65504715b49",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pacc-chief-applauds-pm-shehbaz-sharifs-overseas-incentives-package/",
    "retrieved_at": "2025-08-27T14:33:00.019Z"
  },
  "metadata": {
    "title": "PACC chief applauds PM Shehbaz Sharif’s overseas incentives package",
    "author": null,
    "date_published": "2025-04-16T16:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 247,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):President Pakistani-American Chamber of Commerce (PACC) Naveed Anwar Wednesday welcomed government's special package for overseas Pakistanis terming it a step in right direction. He said \"We welcome Prime Minister Shehbaz Sharif's announcement of a special facilities package for overseas Pakistanis which is a positive step forward.\" He also extended gratitude to the PM and Army Chief General Syed Asim Munir for their efforts to address the concerns of expatriates and their families. Key measures in the package include the revival of the Green Channel for expatriates, reserved quotas in medical and professional education, and the establishment of dedicated courts for overseas Pakistanis. Anwar praised the decision to grant tax relaxations and classify overseas Pakistanis as filers, terming these moves \"directionally correct.\" He emphasized the need for swift implementation of these initiatives to ensure tangible benefits for Pakistanis visiting or returning to the country. Anwar also recalled former Prime Minister Nawaz Sharif's introduction of the Green Channel, which was widely appreciated by expatriates, and expressed hope that the revived system would maintain the same efficiency and standards. The prime minister and Army Chief's recent engagement with the diaspora, he added, has \"renewed hope and confidence\" among overseas Pakistanis. The announcement of the incentives package coincided with record-high remittances sent by expatriates, a move expected to further boost their morale and trust in the government. Anwar also urged authorities to ensure transparency in executing these measures to strengthen the bond between Pakistan and its global diaspora.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}