{
  "article_id": "2025-04-16_d86a724e657e584cb4965678be0cb5e7",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/food-ministry-sends-over-50-agri-scientists-abroad-for-capacity-building-training/",
    "retrieved_at": "2025-08-27T14:34:20.531Z"
  },
  "metadata": {
    "title": "Food Ministry sends over 50 agri scientists abroad for capacity-building training",
    "author": null,
    "date_published": "2025-04-16T10:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 409,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 16 (APP):The Ministry of National Food Security & Research (MNFSR) has sent over fifty officers and scientists for capacity-building training in emerging agricultural and livestock fields to various countries during last year for transforming Pakistan's agriculture sector, addressing food security challenges and promoting economic development. Meanwhile, several Memorandum of Understandings (MoUs) were also signed with the Chinese Academy of Agricultural Sciences on mechanization, agro-product quality, safety and processing during last one year, said a senior official at Ministry of National Food Security and Research. The ministry is also coordinating agricultural research through organizations like the Pakistan Agricultural Research Council and collaborates with international bodies such as the Food and Agriculture Organization of the United Nations to enhance the output of agriculture and livestock sectors, he told APP here on Wednesday. He said that the ministry also oversees plant protection, seed certification, fertilizer standardization and livestock development to ensure quality and sustainability, besides it manages the procurement, import, and export of essential food grains, including rice and sugar, aiming to achieve price stabilization. Through strengthening agricultural policies, improving infrastructure and fostering international partnerships, the ministry is committed to transforming Pakistan's agriculture sector, addressing food security challenges and promoting economic development, he added. During the period under review, the ministry had also developed corporate business models for farming, dairy and feedlot fattening, besides expanding agricultural trade with China and facilitated Chinese companies in chili production, buffalo embryo and dairy development, he added. In order to further strengthen the bilateral cooperation in the filed of agriculture and cement, the efforts of the incumbent government to mechanize local agriculture sector, China had provided agricultural machinery including tractors, harvesters and irrigation systems. He further informed that the government had established protocols with China's General Administration of Customs for donkey meat export regulations, adding that it also held 7th Session of the Pakistan-Belarus Joint Ministerial Commission and the Joint Working Group on Agriculture Cooperation. He said that steps were taken to enhance international cooperation in agriculture, food safety and expand access to Pakistani agricultural and livestock products in global markets, adding that the government had implemented electronic issuance of E-Phyto Certificates through Pakistan Single Window (PSW). The government had also established a Food System Dashboard to provide policymakers with insights into food and nutritional security, facilitating food system transformation, he said adding that it also increased minimum indicative prices of tobacco by 63% and boosted tobacco cess collection revenue to Rs. 323.6 million.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}