{
  "title": "Senate passes resolution stressing constitutional mandate for timely elections",
  "link": "https://www.app.com.pk/national/senate-passes-resolution-stressing-constitutional-mandate-for-timely-elections/",
  "date_published": "2023-08-09T17:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 09 (APP): The Senate on Wednesday passed a unanimous resolution, presented by Senator Mushtaq Ahmed of Jamaat-e-Islami stressing the constitutional mandate for timely elections in the country.\nAccording to the resolution, the Supreme Court of Pakistan reiterated the foundational principles of the state’s Constitution and stressed the paramount authority of Allah Almighty over the entire universe.\nIn a landmark decision, the Court emphasized that the governance of Pakistan operates within the confines of Allah’s prescribed limits, with elected representatives serving as custodians of this sacred trust.\nThe ruling highlighted the meticulous procedural framework outlined in the Constitution for the selection of elected officials, underscoring the necessity for adherence to these guidelines across all government bodies.\nThe resolution said the Constitution mandates a detailed and mandatory procedure for the election of representatives, which applies to all institutions within Pakistan’s administrative structure.\nFurther reinforcing the democratic values enshrined in the Constitution, the Supreme Court reaffirmed that the tenure of national and provincial assemblies, as outlined in Article 224 of the Constitution, necessitates the timely conduct of elections upon completion of their term. This provision safeguards the integrity of the electoral process and ensures the continuity of representative governance.\nThe Court’s ruling clarified that individuals or entities possess only the authority granted to them by the Constitution or the law, as per Article 4. The supervisory role of the caretaker government established after the dissolution of assemblies, as defined in Article 230 of the Elections Act of 2018, is limited to routine decisions during the interregnum and does not extend to major policy decisions.\nThe resolution said the Supreme Court underscored that the responsibility for organizing elections within the prescribed timeframe, as stipulated in Article 224, lies squarely with the Election Commission of Pakistan.\nThe Court urged the esteemed Election Commission to take immediate and comprehensive measures to ensure the timely conduct of elections, thereby fulfilling its constitutional duty.\nIn light of these directives, the Supreme Court called upon all state institutions to provide full support to the Election Commission, ensuring that the electoral process is carried out diligently and in accordance with constitutional mandates. The Court emphasized the importance of upholding the rule of law and preserving the democratic fabric of Pakistan.\nThe Supreme Court’s resolute commitment to upholding the constitutional framework underscored the significance of timely and transparent elections as a cornerstone of Pakistan’s democratic progress. The Court’s clarifications provided a clear roadmap for the seamless continuation of democratic governance and serve as a testament to Pakistan’s unwavering dedication to its constitutional ideals, the resolution maintained.",
  "retrievedAt": "2025-08-11T09:07:49.050Z"
}
