{
  "title": "Mango festival held in The Hague to celebrate 75 years of Pakistan-Netherlands ties",
  "link": "https://www.app.com.pk/national/mango-festival-held-the-hague-to-celebrate-75-years-of-pakistan-netherlands-ties/",
  "date_published": "2023-08-09T10:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): The Embassy of Pakistan in the Netherlands organized the Pakistani Mango Festival in The Hague to celebrate 75 years of diplomatic relations between Pakistan and the Netherlands.\nThe event was widely attended by ambassadors, members of diplomatic community, Dutch officials, and members of the Dutch and Pakistani business communities.\nAmbassador Karin Mossenlechener, Director of Asia and Oceania Department at the Netherlands Ministry of Foreign Affairs was a special guest from the Dutch side.\nPakistan’s Ambassador Suljuk Mustansar Tarar welcomed the guests and highlighted 75 years of dynamic Pakistan-the Netherlands bilateral relations which cover political, trade, education, water management, capacity development and many other facets.\nHe elaborated the economic and trade content of the relations saying that bilateral trade between the two countries increased in the last few years to more than US$ 2 billion. The Dutch companies are among the key investors in Pakistan.\nHe said that in the recently held Textile Exhibition (Texpo-23) in Karachi, more than 40 Dutch companies participated. In the forthcoming First International FoodAg to be held from August 10-12 in Karachi more than 30 Dutch companies have expressed interest to attend.\nHighlighting the uniqueness of Pakistani mangoes, Ambassador Tarar said that Pakistan was the 6th largest producer and the 4th largest exporter of mangoes in the world which are exported across the world and the Netherlands was an important growing market.\nHe informed that Pakistani experts through extensive Research & Development (R&D) had succeeded in making many improvements in the traditional Chaunsa and developed its commercial sub types including Safaid chaunsa, Azeem chaunsa, black chaunsa and late chaunsa etc.\nAs the guests were also served Pakistani Biryani made from Pakistani Basmati rice, the ambassador informed the audience that Pakistan was the top supplier of Basmati rice to EU and the Netherlands as well.\nAmbassador Karin Mossenlechener, in her remarks, mentioned that bilateral relations have been consistently progressing in all areas.\nShe remarked that different activities have been organized by both sides to celebrate the landmark year. She elaborated through history of bilateral relations how the two countries stood with each other in times of natural disasters. She said when Pakistan was faced with floods, the Dutch extended help including last year floods in Pakistan where the Dutch are helping in planning for better water management in Pakistan.\nAmbassador Suljuk Mustansar Tarar presented a shield with a logo of 75 years of diplomatic relations between the two countries to Ambassador Karin Mossenlechner.\nAmong others, ambassadors of China, Japan, South Africa, Nigeria, Thailand, Greece, Romania, Malaysia, Kuwait, Uruguay, Dominica, Oman, New Zeeland, Surinam, Bosnia, Costa Rica, Cameroon, Panama, Bangladesh, Dutch Special Envoy on Agriculture, and the retired diplomats participated in the event.\nThe guests were served with fresh Chaunsa mangoes, delicacies made of Pakistani mangos and Pakistani Basmati Rice biryani. The participants were effusive in their appreciation of taste, aroma and the quality of Pakistani mangoes and cuisine.\nThe event was held with the collaboration of Trade Development Authority of Pakistan, which had provided mangoes, and support of the Netherlands-based leading Diplomat magazine.",
  "retrievedAt": "2025-08-11T09:08:12.496Z"
}
