{
  "title": "Farewell meeting: Federal cabinet made 1295 decisions in 53 sessions with 99% implementation rate",
  "link": "https://www.app.com.pk/national/farewell-meeting-federal-cabinet-made-1295-decisions-in-53-sessions-with-99-implementation-rate/",
  "date_published": "2023-08-09T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): Prime Minister Shehbaz Sharif on Wednesday chaired the farewell meeting of the federal cabinet wherein it was told that the federal body made 1295 decisions in 53 sessions across the last 15 months.\nIn the meeting, Secretary Cabinet presented a detailed report on the performance of the federal cabinet from April 20, 2022 to August 8, 2023.\nIt was told that of 1295 decisions, around 99% were implemented.\nThe prime minister thanked the cabinet members for their untiring efforts for the country’s development.\nThe cabinet offered Fateha for those who lost their lives in an accident of Hazara Express that took place near Nawabshah.\nThe body approved the draft of the National Music Policy as well as the National Aviation Policy 2023. Under the National Music Policy, the application of legal frameworks and modern technological resources would be used to protect the musical heritage of Pakistan, promote contemporary music, and prevent the plagiarism of musicians’ works.\nOn the prime minister’s instructions, the federal cabinet approved the auction of all the valuable gifts received by him during the last 15 months in a transparent manner. He directed that the proceeds should be donated to organizations working for the welfare of orphans and destitute children in Pakistan.\nThe cabinet also decided that the public would be able to participate in the auction process.\nOn the commerce ministry’s recommendation, the meeting approved the appointment of Abdul Rasheed Sheikh, Naeem Anwar, Iqbal Tabish and Ahmed Sheraz as the technical members of the National Tariff Commission. The appointment of Salman S. Mehdi as Chairman of Board of Directors of State Life Insurance and Saleemullah as Deputy State Bank Governor was also approved.\nAfter detailed consultation on the summary of the appointment of Managing Director / Chief Executive Officer of Oil and Gas Development Company Limited (OGDCL), the body decided that the vacancy would be re-advertised.\nThe cabinet approved the inclusion of cabinet members in various committees of the Special Investment Council. Under these amendments, the Federal Minister of Law and Justice would be the members of the Apex Committee, the Federal Minister of Information and Broadcasting would be the members of the Apex Committee and the Executive Committee and the Foreign Secretary would be the members of the Executive Committee and the Implementation Committee. In addition, the cabinet approved the appointment of Dr. Muhammad Jahanzeb Khan as the Secretary Apex Committee of SIFC.\nThe meeting approved the establishment of the SIFC Secretariat and the appointment of Jameel Ahmed Qureshi as Secretary/Principal Accounting Officer. The appointment of Arshad Saleem Khattak as Chief Executive Office of Railways Estate Development and Marketing Company was also okayed.\nThe federal cabinet nodded at doubling the remissions in the sentences of prisoners held in various jails across Pakistan on August 14th. The remission will be applicable to all prisoners in accordance with the law.\nThe meeting approved amendments to the solar policy to expedite the solarization of official buildings and move swiftly on the plan for the nationwide 10,000 megawatts solarization project.\nIn the meeting, the Ministry of Information presented to the prime minister two books featuring the performance of the coalition government and his 488 days of premiership.\nThe cabinet endorsed the decisions made in the Cabinet Committee on Energy meeting held on August 7, 2023, as well as those of Economic Coordination Committee in its sessions of July 26, August 7, and August 8, 2023.\nIt also endorsed the decisions made in the Cabinet Committee on Inter-Governmental Trade meeting held on August 3, 2023 and Cabinet Committee on Privatization in its meeting on August 7, 2023.",
  "retrievedAt": "2025-08-11T09:07:46.660Z"
}
