{
  "title": "ASEAN values Pakistan’s partnership,  support for community-building efforts: Malaysian Ambassador",
  "link": "https://www.app.com.pk/national/asean-values-pakistans-partnership-support-for-community-building-efforts-malaysian-ambassador/",
  "date_published": "2023-08-09T11:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 9 (APP): The Chairman of the ASEAN Committee in Islamabad (ACI) and the High Commissioner of Malaysia to Pakistan Ambassador Mohammad Azhar Mazlan has commended Pakistan’s pivotal role within the Association of Southeast Asian Nations (ASEAN), emphasizing that member countries greatly value Pakistan’s partnership and its support in ASEAN’s efforts towards community building.\n“I am confident that this partnership would spur deeper engagements and interactions between ASEAN and Pakistan in meaningful cooperation across three pillars of ASEAN namely the ASEAN Political-Security Community; the ASEAN Economic Community and the ASEAN Socio-Cultural Community,” he said while addressing the occasion of the 56th anniversary of the Association of Southeast Asian Nations (ASEAN) in Islamabad.\nThe gathering was also attended by the Foreign Secretary of Pakistan, Dr. Asad Majeed, Dean of the Diplomatic Corps and Ambassador of Turkmenistan to Pakistan and ASEAN Heads of Mission.\nHe said ASEAN-Pakistan cooperation has extended in various sectors, among others, in trade and investment, agriculture, education, culture and tourism, capacity building, and technical cooperation.\n“I would like to cite the ASEAN-Pakistan Free Trade Agreement, which took effect in 2013, as a testament to the strengthened economic ties between ASEAN and Pakistan” he added.\nThe HC said, in 2022, the total trade between ASEAN and Pakistan approached a significant milestone of USD 11 billion.\nAmb. Mazlan extended his heartfelt appreciation to all those who have contributed to the remarkable success of the ASEAN-Pakistan partnership. With an optimistic outlook, he emphasized the potential for a brighter and more promising shared future.\nReflecting on the genesis of ASEAN 56 years ago, Amb. Mazlan emphasized the organization’s pivotal role in maintaining regional peace, security, and stability. He recalled the historic meeting of Foreign Ministers from Malaysia, Indonesia, the Philippines, Singapore, and Thailand on August 8, 1967, in Bangkok, where they signed the ASEAN Declaration, laying the foundation for ASEAN’s subsequent development into a highly effective intergovernmental body.\nHe stressed that ASEAN, with an aggregate GDP exceeding USD 3 trillion, is poised to become the fourth-largest economy globally by 2050.\nHe also noted ASEAN’s attractiveness as a magnet for foreign direct investment, a testament to its successful regional economic integration.\nMr. Mazlan highlighted the significance of the signing of the Regional Comprehensive Economic Partnership (RCEP) in November 2020 with five trading partners, which further solidified ASEAN’s status as a model of “open regionalism.”\nAcknowledging the positive impact of cultural and people-to-people exchanges, including initiatives like the ASEAN Cultural Festival and educational scholarships, Mr. Mazlan emphasized how these endeavors enriched understanding and nurtured enduring friendships.\nMr. Mazlan called upon stakeholders to continually strengthen bonds of friendship and collaboration, advocating for innovative strategies to address shared challenges including climate change, terrorism, and public health crises.\nOn the occasion, the Foreign Secretary of Pakistan, His Excellency Dr. Asad Majeed Khan remarked that ASEAN has undergone a remarkable transformation since its inception. What initially started as a modest group of nations has evolved into one of the most influential regional cooperation organizations, boasting an impressive GDP exceeding USD 3 trillion, he added.\nHighlighting ASEAN’s economic prowess, he noted that it stands as the fifth-largest global economy and is on a trajectory to claim the fourth spot by 2050. He specifically pointed out Pakistan’s significant engagement with ASEAN, having achieved the status of sectoral dialogue partner in 1993.\nDr. Khan emphasized Pakistan’s unique position as the oldest sectoral dialogue partner, maintaining this status for nearly three decades.\nHe expressed Pakistan’s commitment to deepening its partnership with ASEAN, recognizing its immense value in enhancing relations not only with ASEAN as an entity but also with its individual member countries.\nThe foreign secretary reiterated Pakistan’s amicable ties with all ASEAN nations and voiced optimism for their continued growth, as a united Asia promises a more prosperous and promising future. Addressing maritime cooperation, he highlighted Pakistan’s eagerness to bolster ties with ASEAN member states in this important area.\nHe stressed the importance of a robust and prosperous Southeast Asia for the broader stability and prosperity of the entire Asia Pacific region and beyond.\nDr. Khan affirmed that stronger regional connectivity leads to collective growth.\nExpressing Pakistan’s aspirations, he conveyed the hope that Pakistan swiftly attains the status of a full dialogue partner of ASEAN. This, he emphasized, would further contribute to the peace and prosperity of the region.\nIn the meantime, he underlined Pakistan’s focus on fostering concrete and substantial cooperation within existing partnerships with ASEAN.\nPakistan aims to leverage its strengths in key areas like trade, economy, culture, and tourism, aiming to engage with ASEAN across multiple sectors and at various levels, he added.",
  "retrievedAt": "2025-08-11T09:08:09.092Z"
}
