{
  "title": "Martial arts training receives spotlight in twin cities",
  "link": "https://www.app.com.pk/national/martial-arts-training-receives-spotlight-in-twin-cities/",
  "date_published": "2023-01-22T08:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): An elevated interest to learn martial arts has been witnessed among the youngsters of twin cities, for gaining physical and mental health along with an added skill of self-defense.\nTalking to APP here on Sunday, Martial Arts Trainer Irfan Bhatti said that people were choosing to learn martial arts due to four reasons, including fitness, sports, career opportunities and personal safety.\nHe said fitness is one of the primary reasons due to which many people choose to learn martial arts. He said martial arts involve a lot of physical activity, such as striking, grappling, and cardio training which helps in improving overall fitness level and gain strength, endurance, and flexibility.\nHe said that sport is another popular reason for learning martial arts. Individuals learn martial arts, such as Ninjitsu, Karate, Mix Martial Arts (MMA), and Taekwondo to participate in different national and international sports competitions.\nIrfan said that training in martial arts can also help individuals to develop discipline, focus, and mental toughness, all of which are important in other sports as well. Career opportunities are another draw for martial arts, he said adding that many professions, such as law enforcement, security, and military, require training in martial arts.\nHe said that self-defense was an important tool in developing an individual’s response upon encountering a threatening situation. It conditions the mind to defend oneself rather than cowering and fleeing, he maintained.\nHe highlighted that Islamabad Capital Police has also started Self Defense course that is offering combat skills and weapon handling. He said that private schools are also arranging martial arts classes for their students, which is enabling them to learn self-defense and remain physically fit.\nIrfan argued to the parents and teachers to motivate the children towards positive sports activities as full sports grounds would lead to empty hospitals.",
  "retrievedAt": "2025-08-11T05:47:38.799Z"
}
