{
  "title": "Chairman BoDs PESCO asked to take action against incidents of illegal grid stations takeover in KPK",
  "link": "https://www.app.com.pk/national/chairman-bods-pesco-asked-to-take-action-against-incidents-of-illegal-grid-stations-takeover-in-kpk/",
  "date_published": "2024-09-05T18:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 05 (APP):Ministry of Power Division has asked Chairman Board of Directors (BoDs) Peshawar Electric Supply Company (PESCO) to take action against incidents of illegal grid stations takeover in Khyber-Pakhtunkhwa (KPK).\n“Takeover of grid stations may be strictly discouraged and FIRs shall be registered against the perpetrators, without fear or favor. In case the local police is hesitant in lodging FIRs or taking further actions, the concerned officials at PESCO shall move a case to the respective Sessions Judges for registration of FIR under Section 22 B of Criminal Procedure Code,” said in a letter written to the Chairman BoDs PESCO .\nIn case if still, FIR could not be registered, Peshawar High Court shall be approached and remedy be sought through an experienced legal counsel. As a test case, the incident of grid takeover by an MPA in Peshawar and a Tehsil Nazim at Dargai, District Malakand on 2nd September 2024, may be responded to immediately, in such manner, it was further asked.\nIt was further asked that requirement of deployment of Frontier Constabulary for protection of inner parameters of the grid stations and other PESCO assets may be sent to Power Division, so that a case is taken up with Ministry of Interior.\n“PESCO may appoint a senior officer from its public relations wing as its spokesperson to highlight all incidents of power theft and patronage of illegal activities including grid station takeover by people,” said the letter.\nIt further asked that names of perpetrators may be done by floating videos and pictures of people taking over grid stations on the social and print media.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:46:34.718Z"
}
