{
  "title": "Opposition leader pleads for discouraging indefinite extensions on legislative bills’ reports in Senate",
  "link": "https://www.app.com.pk/national/opposition-leader-pleads-for-discouraging-indefinite-extensions-on-legislative-bills-reports-in-senate/",
  "date_published": "2024-09-05T12:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 05 (APP): Leader of the Opposition Shibli Faraz on Thursday pleaded with the Chairman Senate to discourage the indefinite and perpetual extensions that had been hampering timely and effective approval of multiple pending bills.\nAddressing the fourth meeting of the 342nd session of the Senate, the Opposition Leader flagged the matter a dozen motions seeking extension in presentation of reports of the Committees on various bills were approved.\nHe said there were many important bills like the Media Professionals Protection Bill that were pending due to extension in presentation of reports. “There should be cogent reasons furnished for extensions in the Bills to discourage unnecessary delaying practices,” he said.\nIn response, Minister for Law and Justice, Senator Azam Nazeer Tarar supported the Opposition Leader’s concerns. “This is a valid reason and if presentation of reports is being done vigilantly, then the bills could be approved rapidly. But in case of unavoidable circumstances, it should be allowed,” he said.\nChairman Standing Committee on Information and Broadcasting, Senator Ali Zafar informed that the Media Professional Protection Bill had been approved by the Committee which was pending for three years. He thanked Senator Saleem Mandviwalla and other committee members for their support.\n“A threadbare discussion has been done by the members and stakeholders including journalists and the committee report is pending for two days and that’s why extension has been sought as it demands meticulous review of the bills due to its broader implications,” he said.\nSenator Saleem Mandviwalla underlined that there used to be aging of Bills to be presented before the Chairman. However, the Chairman needed to address the issue of pending bills in the committees that were not concluded by the Committee as the Bills aging needed to be put up.\nChairman Senate, Syed Yousaf Raza Gillani directed to convene the Council of Chairmen of Senate Committees on the matter.",
  "retrievedAt": "2025-08-10T20:47:47.702Z"
}
