{
  "title": "Google decides to increase its investment, support Government’s initiative of youth’s skills training",
  "link": "https://www.app.com.pk/national/google-decides-to-increase-its-investment-support-governments-initiative-of-youths-skills-training/",
  "date_published": "2024-09-05T16:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP): A 4-member delegation of Google led by President of APAC region Scott Beaumont Thursday called on Prime Minister Muhammad Shehbaz Sharif here.\nWelcoming the delegation, the Prime Minister said Pakistan stands on the threshold of a transformative leap in its digital economy.\nSharing the government’s plans to achieve the target of US$ 25 billion exports in the next five years, the prime minister said funds are allocated for training of youth, improvement of IT infrastructure, and improvement of the regulatory environment.\nHe said efforts are underway to completely digitize Pakistan’s economy. He emphasized collaboration with a tech giant like Google in these endeavours.\nCommending Google for its role in driving Pakistan’s digital economy forward, the prime minister appreciated Google for undertaking initiatives that have significantly improved the lives of thousands of Pakistanis over the last few years.\nNoting with satisfaction that google has enabled Pakistani youth to get close to 1 million jobs in 2023 alone, the prime minister underlined that it is reflective of Pakistan’s potential in the digital world and Google’s commitment to upskilling and uplifting the youth of Pakistan.\nApprising the prime minister of its plans of future engagement, Mr. Scott said Google has decided to further increase its investment footprint in Pakistan and support the Government’s initiatives of Youth’s skills training.\nIn order to maximize the economic benefits of technology, the large youth population and expanding economy are important factors for a value-driven tech giant like Google, he added.\nHe reiterated that by 2026 , 5 lacs Chromebooks will be manufactured in Pakistan which will revolutionise the IT Industry of Pakistan.",
  "retrievedAt": "2025-08-10T20:46:38.242Z"
}
