{
  "title": "Minister Tarar chairs review meeting on Pakistan’s 2nd periodic report",
  "link": "https://www.app.com.pk/national/minister-tarar-chairs-review-meeting-on-pakistans-2nd-periodic-report/",
  "date_published": "2024-09-05T13:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 05 (APP):The Ministry of Human Rights held an inter-ministerial, inter-provincial meeting Thursday to review Pakistan’s Second Periodic Report on the International Covenant on Civil and Political Rights (ICCPR).\nThe meeting was chaired by the Honorable Federal Minister for Law, Justice & Human Rights, Senator Azam Nazeer Tarar. The aim was to assess progress and ensure comprehensive preparations for Pakistan’s upcoming review by the UN Human Rights Committee in October 2024.\nThe ICCPR, ratified by Pakistan in June 2010, is a key international treaty that promotes and protects civil and political rights globally.\nRepresentatives from various ministries, departments, and provincial governments actively participated to ensure a comprehensive approach to the human rights obligations outlined under the ICCPR.\nDuring the session, participants discussed the adoption and enforcement of human rights legislation in Pakistan, challenges faced in implementing ICCPR obligations, and the steps required to ensure Pakistan’s full compliance with international human rights standards.\nSenator Azam Nazeer Tarar emphasized Pakistan’s commitment to upholding human rights as a state obligation. He reiterated that the government is dedicated to ensuring civil and political rights are respected and promoted throughout the country. He stressed the need for close cooperation between federal and provincial entities to present a united and accurate representation of Pakistan’s progress on civil and political rights.\nThe meeting concluded with a consensus on the increased inter agency cooperation to prepare a comprehensive response to list of issues of the 2nd periodic report for presentation before human rights committee.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:47:49.854Z"
}
