{
  "title": "ICT Police bust notorious dacoit gang, Recover looted valuables",
  "link": "https://www.app.com.pk/national/ict-police-bust-notorious-dacoit-gang-recover-looted-valuables/",
  "date_published": "2024-09-05T07:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 5 (APP):Islamabad Capital Territory (ICT) Police Anti-Robbery and Dacoity Unit (ARDU) on Thursday dismantled a notorious dacoit gang involved in robberies, snatching, and street crime.\nThe police recovered looted valuables, including mobile phones, motorbikes, and arms with ammunition from their possession, said Police Spokesperson.\nThe Police public relations officer stated on special directives of ICT Police Inspector General (IG) Syed Ali Nasir Rizvi, that a massive operation was conducted against organized and dynamic gangs across the district to ensure the safety and security of Islamabad’s citizens.\nHe said in line with these directives, the crackdown targeted various areas in Islamabad.\nThe ARDU police team arrested two wanted members of the notorious gang, including their gang leader, involved in numerous criminal activities, he said.\nHe said the accused were identified as Atiq ur Rehman and Yasir Zaman. He said the team recovered motorbikes, mobile phones, and arms with ammunition from their possession.\nCases have been registered against the nabbed suspects, and further investigation is underway, he added.\nDIG Dr. Syed Mustafa Tanveer commended the police team for their successful operation. “Well done to the police team of DIG Dr. Syed Mustafa Tanveer,” he said.\n“All legal requirements will be fulfilled to punish the accused. Massive operations are being carried out against organized and dynamic gangs,” he added.\nSenior police officers have directed officials to maintain an effective crackdown against those involved in criminal activities and to ensure the safety of lives and property as a top priority.\nCitizens are advised to cooperate with the police and report any suspicious individuals or activities through the emergency helpline “Pucar-15” or “ICT-15”.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:48:37.529Z"
}
