{
  "title": "PM orders inquiry into mishandling of widow sisters’ complaint at Citizen Portal",
  "link": "https://www.app.com.pk/national/pm-orders-inquiry-into-mishandling-of-widow-sisters-complaint-at-citizen-portal/",
  "date_published": "2021-05-24T09:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): Prime Minister Imran Khan on Monday taking serious note of mishandling of two widow sisters’ complaint registered with the Pakistan Citizen Portal ordered inquiry against Additional Deputy Commissioner (Revenue), Rawalpindi.\nThe prime minister directed the Chief Secretary’s Office to order a fact-finding inquiry into the matter by nominating a senior-level officer, initiate action thereafter under the rules and submit the report by May 31.\nHe directed Prime Minister’s Delivery Unit (PMDU) to carry out a performance evaluation of the dashboards of all revenue officers in the Rawalpindi Division.\nA joint application of two widow sisters along with its attachment bearing ID No. PU230221-88030156 was lodged on February 23, 2021, through Pakistan Citizen’s Portal.\nAs per the complaint’s processing history, it was initiated to the Deputy Commissioner Rawalpindi who timely forwarded it to ADC Rawalpindi. However, the ADC Office, in violation of the User’s Guidelines Manual dropped the application the same day by considering it sub judice with the court.\nThe applicants thus approached the Prime Minister’s Office to re-open the case while denying it being sub judice. The PMDU brought the matter to the notice of the focal person of the Chief Secretary’s Office and DC Rawalpindi.\nSubsequent to the intervention of the two offices, the complaint was re-opened after being considered appropriate and not sub judice. The case was thereafter fixed for the next hearing on April 7, 2021, by the ADC concerned.\nIn the meantime, another complaint bearing ID. No. PU190421-88260398 dated April 19, 2021, was received directly to the PM’s Dashboard wherein the applicant complained that the ADC had asked them to first withdraw the complaint from the Portal and action will be taken thereafter.",
  "retrievedAt": "2025-08-11T20:45:26.901Z"
}
