{
  "title": "106 fresh COVID-19 cases reported in capital: NCOC",
  "link": "https://www.app.com.pk/national/106-fresh-covid-19-cases-reported-in-capital-ncoc/",
  "date_published": "2021-05-24T17:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 24 (APP): National Command and Operation Center (NCOC) on Monday said that 106 new cases of Coronavirus were reported from the federal capital during the last 24 hours.\nAccording to an official of NCOC, as many as 156 cases were reported on Sunday while 146 cases were reported on Saturday.\nHe said so far 80,418 cases were reported from the federal capital while 745 deaths were reported from Islamabad Capital Territory (ICT). He added 72, 1422 patients had been recovered completely.\nCommenting on the present Corona situation across the country, an official of the Ministry of National Health Services said that the government had taken appropriate measures and tightened restrictions to curb the COVID-19 disease as the virus was continuing to spread fast in the country.\nHe said the government was closely monitoring the third wave and it may lock down more areas if other interventions did not work in the next few days.\nHe said the prime minister had also engaged the armed forces to ensure that standard operating procedures (SOPs) were being followed in locked down areas which had a high positivity ratio.\nHe said the NCOC had access to data from all districts and reviewed it on a daily basis. Its decisions are based on the spread of the virus, the success of SOPs enforcement, and the capacity of the health care system, he added.\nThe official said, “Our engineers are actively working on making more plants functional for the production of oxygen. The diversion of non-essential industries was also being planned while avenues for import from other countries were also being explored.”\nHe said logistics for the transport, including the availability of trucks and drivers, were also being monitored while guidelines for using oxygen efficiently were being issued to ensure that there was no wastage.",
  "retrievedAt": "2025-08-11T20:45:32.530Z"
}
