{
  "title": "Projects with ‘sizable’ investment under SIFC to be signed before elections: PM",
  "link": "https://www.app.com.pk/national/projects-with-sizable-investment-under-sifc-to-be-signed-before-elections-pm/",
  "date_published": "2023-11-25T16:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Saturday said that projects with ‘sizable figure’ of investment under Special Investment Facilitation Council (SIFC) would be signed before end of the current caretaker setup.\n“In the coming weeks, the nation will hear good news as we are soon going to Kuwait, UAE, Saudi Arabia and to other countries to sign Memorandum of Understandings (MoUs) of the projects worth billions of dollars,” the prime minister said in an interview with a private news channel.\nPakistan and Kuwait will sign seven Memorandums of Understanding (MoUs) for investment worth $10 billion in Pakistan through seven projects in multiple fields including environment, mining and food security during the upcoming visit of Prime Minister Anwaar-ul-Haq Kakar to Kuwait.\nPM Kakar said SIFC was a fully professional initiative that was being run under best international practices. “I see a natural and organic growth in it.”\nTo a question, the prime minister explained that the investment never come so early. He said first the government had to pass through negotiation process on bankable projects, then there come the feasibility stage, then MoUs are signed and then it transformed to tangible projects.\nHe said the SIFC had got the institutional support, and changes of governments would not affect the progress of the projects under the Council.\nPM Kakar said some segments were misleading the people that all the estimated investment amount worth $70 billion would at once be deposited in the Pakistani banks by the friendly countries.\nTo a query, the prime minister pointed out that the caretaker setup with support of the state, had successfully halted the cross border smuggling of dollars and other goods that would continue in future as well.\nAs regards upcoming general elections in the country, he said the Election Commission of Pakistan (ECP) was fully prepared to hold general elections on the given date. He said the caretaker government was also well aware of its role to assist the ECP in ensuring transparent and secure election process.\nTo a question about security situation in the country, the prime minister maintained that there were serious security threats especially in Balochistan which were expected to increase in the days to come. However, he said he did not want to relate these security concerns with elections.\nTo a question about complaints by the Pakistan Peoples Party (PPP) and Pakistan Tehreek-e-Insaf (PTI) for not being given level playing fields for election campaign, PM Kakar clarified that the government was not denying the field to any political party. “Normally, the political parties use multiple tactics to attract sympathies of their voters, and the victim card is quite common among those tactics,” he said.\nThe prime minister said the the government was neither discriminating any of the party nor it is giving undue favor to any other.\nHe said the caretaker government was not imposing restrictions to hold political rallies or gatherings in Islamabad or any other part of the country.\nHowever, he said the caretakers were bound to restrict those involved in the 9th May incidents as per the law as their matter was under trial in the counts.\nHe said the basic role of ECP is to give equal opportunities to all the political parties in general election.\nAs regards, missing person in Balochistan, the prime minister made it clear that no institution was involved in enforced disappearance in the country. He said the people involved in terrorism should be presented in the courts.\n“Our view is that this is a campaign by some activists to malign the state institutions,” he added.\nAs regards trial of PTI Chairman Imran Khan and PTI leader Shah Mehmood Qureshi in the Judicial Complex, the prime minister said the government would follow the court order in this regard.",
  "retrievedAt": "2025-08-11T10:41:11.473Z"
}
