{
  "title": "Imperative to use Modern technology in Gender Inclusivity & Women Empowerment: Mushaal",
  "link": "https://www.app.com.pk/national/imperative-to-use-modern-technology-in-gender-inclusivity-women-empowerment-mushaal/",
  "date_published": "2023-11-25T12:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP):Special Assistant to Prime Minister on Human Rights and Women Empowerment, Mushaal Hussein Mulick has said that it is important to use modern technology for the promotion of Gender Inclusivity and Women Empowerment.\nMushaal said this in a meeting with the delegation of a renowned IT company, Infocomm Technology Pvt. Ltd. The company works on the use of Cloud-based technology for Women Protect IoT Bands, Women’s Health Monitoring via centralized application to address multi-purpose one-window solution.\nMs Sabien Hussein Mullick (Focal Person to SAPM), Sam Dada (Advisor to SAPM on Gender Inclusion), Sam Anza Akhund Consultant Education Parliamentarians Caucus Senate of Pakistan (EPC), Salma Ashraf (EPC), Ashraf Ghaus (EPC), Saad Arshad Chief Operating Office Infocomm Technology, Minhal Suleman and Mustafa Ali, (a special athlete) were in attendance.\nMushaal discussed in length with the delegates topics of mutual interest such as the Elimination of Violence Against Women, Diversity and Inclusion, Financial Literacy, the introduction of an e-commerce platform to support women-led businesses, one-window solution for payment collections and disbursements, healthcare & traveling.\nSAPM was apprised about the work done on the planned summit under the leadership of the SAPM Mushaal Mullick on Gender Inclusivity and women Empowerment via Technology enablement.\nThe Special Assistant to the Prime Minister appreciated the good work of the Infocomm in the fields concerning Women’s rights and Women empowerment.\nThe special Assistant to the Prime Minister also lauded the efforts of Mustafa Ali, a special athlete, who is going on a motorbike journey across borders carrying the message of Soft Image of Pakistan, Women Empowerment across the Globe, and a Polio awareness campaign.\nFocal person to SAPM, Sabien Hussein Mullick also appreciated the efforts of the infocomm for women’s empowerment and for building a positive image of Pakistan across the globe through various initiatives and events.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:41:48.656Z"
}
