{
  "title": "Germany shows Pakistan way to combat smoking",
  "link": "https://www.app.com.pk/national/germany-shows-pakistan-way-to-combat-smoking/",
  "date_published": "2023-11-25T12:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Pakistan can learn from Germany to bring down smoking trends in society.\nIt was one of the takeaways from a talk on this subject by Dr John Njenga Karugia, from the Institute of Asian and African Studies, Humboldt Universität zu Berlin.\nHe was speaking to a proactive session titled “Breaking Myths about Smoking: Quest for Facts” was held at the Department of Media and Communication Studies at International Islamic University Islamabad.\nHe cited data to show that the trend of smoking in German society has been gradually coming down as the government has created awareness about the hazards of smoking in innovative ways.\nHe said cosmopolitan cities need to adopt a proactive approach to protect their citizens from smoking. He said second-hand smoking is a big threat to public health. It cannot be countered without putting in place some laws and creating awareness in society.\nHe said smoking in public places was banned in Germany in 2007.\nExtending his argument, Dr Inamur Rehman, Chairman of the Department of Media and Communication Studies at International Islamic University said that there is a need to keep a watch on the movements of cigarette manufacturers in media.\nThough advertisement of tobacco products has been banned, the multinational companies penetrate in society through media using false arguments and pushing around false data.\nHe cited a report by Capital Calling, a network of academic researchers and professionals, that states that an increase in taxes on cigarettes has resulted in a decline in their consumption in the market.\nThe report says that “In 2017, the FED on cigarettes was effectively cut by a whopping 50 percent with the introduction of a three-tier excise duty framework for cigarettes, incorporating a new tier specifically designed for low-priced brands. The tax rate applicable to this newly introduced tier underwent a reduction of 48 percent, decreasing from Rs 1.5 per stick to Rs 0.8 per stick.”\nIt says that “Multinationals brands started manipulating the decision by lowering prices of its most sellable products which were in Tier-II prior to The Finance Act 2017 to fit them, technically, in Tier-III and instead of paying tax at the rate of 33.4 per pack of 20 they were paying only Rupees 16 per pack of 20 cigarettes.”\nIt mentions that “In its report submitted to the committee, the Auditor General of Pakistan (AGP) contradicted FBR’s view pint of regarding benefits accrued from bringing in the third tier of FED on cigarettes because after the introduction of third tier the sales turnover of Pakistan Tobacco Company and Philip Morris International showed upward trend reflecting an increase of 31% in case of PTC and 33% in case of Phillip Morris International during the year 2017-18.\nDespite the massive increase in sales turnover 32 % of both companies of Rs 143.7 billion in 2017-18 as compared to Rs 109.2 billion in 2016-17, the collection of FED in the same period remained at Rs 65.4 billion was 13 % less as compared to the previous year.”\nThere is a need to keep on collecting facts on smoking in society as at present society is flush with unauthentic facts about the matter.\n“The situation calls for research on the topic. Only in the light of authentic facts, the government can form a comprehensive strategy to save our young generation from smoking,” said Dr Rehman.",
  "retrievedAt": "2025-08-11T10:41:15.067Z"
}
