{
  "title": "Aniq advocates global interfaith dialogue for lasting peace",
  "link": "https://www.app.com.pk/national/aniq-advocates-global-interfaith-dialogue-for-lasting-peace/",
  "date_published": "2023-11-25T12:35:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 25 (APP):Federal Minister for Religious Affairs and Interfaith Harmony Aniq Ahmed stressed the crucial need for dialogue among religions and cultures globally to establish lasting peace.\nIn his address at the Interfaith Harmony Conference held at the Badshahi Masjid here on Saturday, he highlighted the government’s commitment to promoting interfaith harmony in Pakistan, emphasizing the prevailing unity among different religious denominations.\nHe underscored the importance of tolerance and respect, integral to Islamic teachings, and assured that minorities in Pakistan enjoy complete religious freedom. He called for collective efforts to foster interfaith harmony, citing Islam’s principles and Prophet Hazrat Muhammad’s (PBUH) legacy of dialogue with Christians and Jews.\nThe minister detailed concrete measures taken by the government to promote interfaith harmony, with a focus on understanding differences and finding commonalities among religions. He urged both the Muslim majority and minorities in Pakistan to contribute positively to the nation’s progress and dispel false rumors.\nHighlighting Pakistan’s diverse society, he announced his visit to Karachi during the Hindu festival of Diwali and issued directives for guidelines to resolve issues facing minorities. Bishop of Lahore Nadim Kamran and Pastor Asher Nazir praised the government’s initiatives for minorities, expressing commitment to contributing positively to the country’s peace.\nThe conference, attended by prominent figures including Prime Minister’s Special Representative Hafiz Muhammad Tahir Mahmood Ashrafi and Provincial Minister for Religious Affairs Syed Azfar Ali Nasir, aimed to strengthen religious harmony, mutual brotherhood, and collaborative roles for the progress of the nation. Participants praised the government’s efforts and expressed dedication to fostering a harmonious society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:41:55.959Z"
}
