{
  "title": "World Science Day for Peace and Development to focus climate change issues",
  "link": "https://www.app.com.pk/national/world-science-day-for-peace-and-development-to-focus-climate-change-issues/",
  "date_published": "2021-11-09T11:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 9 (APP):The World Science Day for Peace and Development will be celebrated on November 10 across the country with a number of activities highlighting this year’s theme “building climate-ready communities”.\nThis theme of World Science Day for Peace and Development will focus on climate change which is becoming a serious threat to the lives of billions of people and the planet and needs to be addressed immediately.\nDifferent public and private organizations, educational institutions, science and research based departments will arrange webinars, discussion programmes, competitions and seminars.\nPakistan Science Foundation (PSF) has planned to arrange a function to highlight the importance of the day, like every year and acknowledge the contributions of scientists and researchers in the lives of people.\nFederal Minister for Science and Technology, Syed Shibli Faraz will be the chief guest on the occasion while a number of students, scholars, scientists and experts will participate in the event.\nThe Organization of Islamic Cooperation (OIC) Standing Committee on Scientific and Technological Cooperation (COMSTECH) has planned to arrange an event to celebrate the day.\nAccording to an official of COMSTECH, the event is open to students, researchers, scientists, academicians, policy makers, government officials, think tanks and anyone relevant to the field of environmental sciences.\nExperts and speakers will present speak on key areas including impacts of climate change and extreme weather; building climate resilience and reducing disaster risk; Climate change adaptation and mitigation; the role of science for society and the future of science; improving dialogue among scientists, government, and citizens; enhancing national capacities for evidence-based policy making and strengthening international scientific cooperation.\nAs per the tentative programme schedule, Coordinator General, COMSTECH, Professor Dr M Iqbal Choudhary will present the welcome address while Adviser Climate Change, Planning Commission of Pakistan, Ali Tauqeer Sheikh will deliver the keynote speech.\nEminent Scientist, Professor Dr Atta ur Rahman will be chief guest on the occasion, while Director General, The Islamic Organization for Food Security, Yerlan Baidaulet will be guest of honour, the official said.\nThe World Science Day for Peace and Development, celebrated every year on November 10, was established by UNESCO in 2001 to highlight the important role of science in society and the need to engage the wider public in debates on emerging and important contemporary issues relevant to science.\nBy linking science more closely with society, World Science Day for Peace and Development aims to ensure that citizens are kept informed of developments in science. It also underscores the role scientists play in broadening our understanding of the remarkable, fragile planet we call home and in making our societies more sustainable.",
  "retrievedAt": "2025-08-11T21:35:04.643Z"
}
