{
  "title": "Ehsaas Rashan Portal opens to enroll low-income families and small Kiryana merchants",
  "link": "https://www.app.com.pk/national/ehsaas-rashan-portal-opens-to-enroll-low-income-families-and-small-kiryana-merchants/",
  "date_published": "2021-11-09T10:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 8 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Senator Dr. Sania Nishtar Tuesday announced the opening of Ehsaas Rashan Riayat portal to register deserving families as well as Kiryana merchants.\nDr. Sania visited a local Kiryana store in Sitara market Islamabad along with senior officials of the National Bank of Pakistan (NBP) to enroll the first Kiryana merchant on the portal.\nThe registration can be carried out through the online Ehsaas Rashan portal: ehsaasrashan.pass.gov.pk. Dr. Sania has also released an instructional video to guide deserving families and Kiryana merchants, step by step, about the program rollout.  Describing the modalities of the programme during a media briefing, Dr. Sania said, “Low-income families who want to benefit from the Ehsaas Ration programme will register on the portal with their Computerized National Identity Card Number (CNIC) and a mobile number issued on that CNIC.\nOnly one such person from each household will be eligible to get registered in the Rashan Riayat program.” Continuing, she said, “The Ehsaas Socioeconomic Registry Survey which has just been completed will be used to identify deserving families for the program.\nFamily eligibility will be determined within four weeks, after registration on the portal. Applicant families will be sent eligibility messages from 8171; this program is being executed by NBP”. Ehsaas Rashan Riayat’s program aims to reduce the impact of inflation on the marginalized segments of society.\nA subsidy of Rs. 1,000 per month will be given to each of the eligible 20 million families on the purchase of flour, cooking oil, and pulses.  All eligible families will be able to purchase Rashan from the designated Karyana stores of NBP on a 30% subsidy. Ehsaas Rashan portal, she said will also register Kiryana merchants from all over the country.\nThe Karyana enterprises would also be physically verified after registration. Once they pass the authentication process, the Kiryana merchants will be able to pass the subsidy benefit on to the deserving households.\nIt is mandatory for the Karyana merchants to have a valid bank account. Those without bank accounts will be facilitated to open their bank accounts in the nearest branches of the National Bank of Pakistan.&nbsp; The authorized Kiryana merchants having bank accounts will download the ‘mobile Point of Sale’ (mPOS) app on their mobile phones through which they will ascertain the eligibility of the eligible buyers, click on the icons of essential commodities and pass on the subsidy.\n“These technology measures have been developed to avoid manipulation and to checkmate abuse”, reiterated Dr. Sania. “The government will also incentivize Kiryana merchants by giving them attractive commission on Ehsaas’ subsidy amount to encourage them to benefit more and more people.\nThere will also be a lucky draw giving away cars, motorcycles, mobile phones, and various other prizes every quarter to create healthy competition among the merchants”, Dr. Sania added. Prime Minister Imran Khan had announced the Ehsaas Rashan Riayat program on Nov 3, 2021, in his address to the nation.\nThe Rs. 120 billion targeted subsidies program would benefit 20 million families; overall 130 million people nationwide.",
  "retrievedAt": "2025-08-11T21:35:06.991Z"
}
