{
  "title": "Lot of questions still unanswerable in SC reserved seats judgement: Azam Tarar",
  "link": "https://www.app.com.pk/national/lot-of-questions-still-unanswerable-in-sc-reserved-seats-judgement-azam-tarar/",
  "date_published": "2024-09-23T17:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): Federal Minister for Law and Justice Azam Nazeer Tarar on Monday said that a lot of questions were still answerable in the detailed judgement announced by the Supreme Court in the reserved seats case.\nThe Pakistan Tehreek-e-Insaf (PTI), he said, had not been a party in the reserved seats case at any forum, including the Election Commission of Pakistan (ECP), Peshawar High Court (PHC) or the SC.\nHe said courts were used to give decisions on principles that who had filed the case and what relief was prayed by the petitioner.\nSuch questions were not answered in the reserved seats case as the apex court seemed to have not examined those aspects, the law minister said while addressing a press conference.\nAzam Tarar said that independent candidates had joined the Sunni Ittehad Council (SIC) willfully and that their move was irreversible as per the law.\nHe said that the ECP was an independent institution working under constitutional oath and it had to render its responsibility under the law.\nSimilarly, he said, that the legislation was the sole prerogative of the Parliament. The judgment had not commented on the amendments in the election law, he added.\nThe minister said that the review petition had not become ineffective after the announcement of detailed judgment in the reserved seats case. The question that the instant decision had not been taken as per the petitioner’s prayer, was required to be addressed, he added.\nThe minister said that the Peshawar High Court had given judgment as per the law.\nHe said that strict words had been used against two judges who had given dissenting notes, but it would not dilute their opinion. The difference of opinion was grace of any verdict, he adding citing that a number of dissenting notes had been written in various cases in the past.\nAzam Tarar said that the question that how the relevant sections of the law would be overruled to allocate the reserved seats to the PTI, was also not answered.\nThe independent candidates, he said, had themselves closed their case after joining the SIC. There had never been a debate on the allocation of reserved seats to the PTI during the whole proceedings of the case, he added.\nHe said that only one question was to be adjudged in the case that whether the SIC was entitled to the reserved seats or not. Independent candidates also never claimed that they belonged to the PTI, he added.\nThe law minister said that the full court of the SC had viewed the Practice and Procedure Act, and accepted that legislation was the sole prerogative of the Parliament. The full court also did not declare that the Parliament could not amend laws, he added.",
  "retrievedAt": "2025-08-10T21:17:35.784Z"
}
