{
  "title": "SC issues detailed written judgment in reserved seats case",
  "link": "https://www.app.com.pk/national/sc-issues-detailed-written-judgment-in-reserved-seats-case/",
  "date_published": "2024-09-23T13:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): The Supreme Court of Pakistan on Monday issued detailed written judgment on the appeal of Sunni Ittehad Council (SIC) regarding reserved seats in assemblies.\nA 70-page detailed written verdict was authored by Justice Syed Mansoor Ali Shah.\nThe judgment said: “The order of the Election Commission of Pakistan (“Commission”) dated 01.03.2024 (“Impugned Order”) is declared to be ultra vires the Constitution, without lawful authority and of no legal effect. The impugned judgment dated 25.03.2024 of the learned Full Bench of the High Court is set aside.”\nIt said: “It is declared that the lack or denial of an election symbol does not in any manner affect the constitutional and legal rights of a political party to participate in an election (whether general or bye) and to field candidates and the Commission is under a constitutional duty to act, and construe and apply all statutory provisions, accordingly.”\nThe judgment said: “The Pakistan Tehreek e Insaf (“PTI”) was and is a political party, which secured or won (the two terms being interchangeable) general seats in the National and Provincial Assemblies in the General Elections of 2024 as herein after provided.”\n“In the peculiar facts and circumstances of the General Election of 2024, it is declared that out of the aforesaid 80 returned candidates (now MNAs) those (being 39 in all and whose particulars are set out in Annex A to this Order) in respect of whom the Commission has shown “PTI” in any one of the aforesaid columns in the List, were and are the returned candidates whose seats were and have been secured by the PTI within the meaning.”\n“In the peculiar facts and circumstances of the General Election of 2024, it is further ordered that any of the remaining 41 returned candidates out of the aforesaid 80 (whose particulars are set out in Annex B to this Order) may, within 15 working days of this Order file a statement duly signed and notarized stating that he or she contested the General Election as a candidate of the political party specified therein.”\nThe detailed judgment read: “The PTI shall be entitled to reserved seats for women and minorities in the National Assembly accordingly. PTI shall, within 15 working days of this Order file its lists of candidates for the said reserved seats.”\n“The Commission shall, out of the reserved seats for women and minorities in the National Assembly to which para 3 of this Order applies, notify as elected in terms of the Article 51 Provisions, that number of candidates from the lists filed (or, as the case may be, to be filed) by the PTI as is proportionate to the general seats secured by it in terms of paras 7 and 8 of this Order.”\nThe court verdict said: “Election authorities, as “electoral management bodies”, are the “guarantor institutions” of democratic processes and are critical to democratic governance, akin to a “fourth branch of government”. Their constitutional role is to ensure the conduct of elections by providing an equal and fair competitive field for all political entities and protect citizens’ rights to vote. As an impartial steward of the electoral process, the Election Commission of Pakistan is not only an administrative body but also a guardian of electoral integrity and democracy’s legitimacy. When election authorities engage in actions that undermine these principles, such as unlawfully denying the recognition of a major political party and treating its nominated candidates as independents, they not only compromise the rights of these candidates but also significantly infringe upon the rights of the electorate and corrode their own institutional legitimacy.”\n“When the Election Commission errs or makes significant mistakes impacting the electoral process, judicial intervention becomes necessary to rectify them and ensure electoral justice. The judiciary, tasked with ensuring electoral justice, must foremost preserve the will of the people. Election disputes are viewed through this lens, emphasizing electoral integrity and democracy’s legitimacy to maintain public confidence in governance. Electoral justice is vital to protecting political and electoral rights and is intertwined with electoral integrity. The role of the Supreme Court of Pakistan in overseeing electoral integrity is crucial for sustaining public trust in the democratic process, and the Court’s power to do “complete justice” is a critical tool in the constitutional arsenal of this Court, enabling it to prevent democratic backsliding, and protect democracy effectively with a focus on the electorate’s rights. Denying electoral justice and compromising electoral integrity would undermine the very legitimacy of democracy.”\nThe detailed order said: “In handling election disputes, the primary obligation of courts is to protect the electorate’s right to fair representation, ensuring that only candidates who have legitimately won the support of the electorate through fair processes assume office. Courts must rise above political biases and interests, focusing solely on legal and evidential matters to safeguard the electorate’s interests.”\n“Unfortunately, the legal position regarding the nature of election disputes and the responsibility of courts was not brought to the notice of the Bench by the learned counsel for the parties while making their arguments. However, eleven members of the Bench, being themselves aware of the above legal position, proceeded to inquire into the facts and points of law that were not presented before the court below, that is, the Peshawar High Court. Although these eleven members of the Bench disagreed to some extent on granting the eventual relief, their awareness of the true legal position as to the nature of election disputes and the responsibility of courts led them to a broader and more comprehensive judicial inquiry into all the relevant facts and law points concerning the election dispute involved in the present case, as set out next.”\nIt stated: “Before parting with the judgment, we feel constrained to observe, with a heavy heart, that our two learned colleagues in the minority (Justice Amin-ud-Din Khan and Justice Naeem Akhtar Afghan) have made certain observations in their dissenting judgment dated 3 August 2024, which do not behove Judges of the Supreme Court of Pakistan.”\nThe court also ordered to translate the judgment in Urdu language and upload on its website.",
  "retrievedAt": "2025-08-10T21:17:57.783Z"
}
