{
  "title": "OGDCL achieves highest ever quarterly dividend in company’s history",
  "link": "https://www.app.com.pk/national/ogdcl-achieves-highest-ever-quarterly-dividend-in-companys-history/",
  "date_published": "2024-09-23T17:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP):The Board of Directors of Oil & Gas Development Company Limited (OGDCL) Monday announced the financial results for the fiscal year ended June 30, 2024.\nAccording to news release the OGDCL achieved net sales revenue of Rs. 463.698 billion, with a profit after tax of Rs. 208.976 billion, translating to earnings per share (EPS) of Rs. 48.59.\nThis strong financial performance reflects OGDCL’s commitment to operational excellence amidst a challenging economic and energy environment.\nThe Board of Directors announced a final cash dividend of Rs. 4.00 per share (40%) for the year ended June 30, 2024.\nThis is in addition to the interim dividends of Rs. 6.10 per share (61%) already paid to shareholders during the year.\nNotably, the final quarterly dividend of Rs. 4.00 per share is the highest quarterly dividend in the Company’s history, bringing the total cumulative dividend payout to 101%.\nDuring the fiscal year, OGDCL contributed Rs. 218 billion to the national exchequer through taxes, dividends, and royalties.\nThe Company made five significant hydrocarbon discoveries during the year, further enhancing its portfolio. These discoveries were made in key areas across Punjab, Sindh, and Khyber Pakhtunkhwa, continuing OGDCL’s focus on expanding its resource base to support the country’s energy needs.\nIn terms of production, OGDCL achieved an average daily output of 33,117 barrels per day (BPD) of crude oil, 717 million standard cubic feet per day (MMSCFD) of gas, and 717 metric tons per day (MTD) of liquefied petroleum gas (LPG).\nWithout the production curtailments by SNGPL and UPL, crude oil production could have reached 33,495 BPD, gas production 771 MMSCFD, and LPG production 736 MTD, reflecting potential increases of 1,107 BPD (3.1%), 7 MMSCFD (0.9%), and 16 MTD (2.2%), respectively, over last year’s figures. These efforts have played a key role in reversing the declining production trend seen over the past five years, during which crude oil and gas output had dropped by 20% and 24.6%, respectively.\nIn addition to its operational successes, OGDCL made considerable progress in production optimization, achieving annual savings of approximately Rs. 34 billion in the form of import substitution.\nThe Board of Directors commended the management’s efforts in driving the Company’s overall performance, which has contributed significantly to ensuring sustainable growth and energy security for the country. Key projects such as compression installations at KPD-TAY, Dakhni, and Uch continue to progress, securing uninterrupted supply as per contractual obligations and maintaining the company’s operational integrity.\nMoreover, OGDCL has embarked on a diversification project to assess the geothermal potential of its fields. The ongoing R&D project in collaboration with Schlumberger is expected to be completed by December 2024, marking a significant step toward diversifying the Company’s energy portfolio.\nThe Company remains committed to maintaining operational excellence while pursuing new growth opportunities to maximize shareholder value and support Pakistan’s energy needs.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:17:57.460Z"
}
