{
  "title": "Excise deptt continues crackdown against illegal vehicles, recovers over Rs 17 mln",
  "link": "https://www.app.com.pk/national/excise-deptt-continues-crackdown-against-illegal-vehicles-recovers-over-rs-17-mln-2/",
  "date_published": "2024-09-23T13:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): The Excise and Taxation (E&T) Department has intensified its efforts to enforce traffic laws, with a focus on recovering taxes and regulating vehicles that violate excise regulations.\nTalking to APP, Director E&T department, Bilal Azam, said the department, in a significant move has launched a daily operation targeting vehicles that fail to meet legal requirements, resulting in a monthly revenue collection of over Rs 17.2 million.\nIn its recent monthly report, the E&T department announced that the road checking staff collected Rs 17,204,676 in fines and taxes from various operations across the city. This effort is part of an ongoing campaign to address issues such as unregistered vehicles, improper number plates, tinted glasses, and vehicles not paying token tax.\nExcise officers have been conducting these operations daily on highways, busy markets, and key locations in Islamabad. The department’s campaign aimed to ensure compliance with traffic laws and to recover unpaid taxes from defaulters, Bilal Azam said.\nDuring the past month, actions were taken against 385 vehicles using black-tinted windows, resulting in the collection of Rs 4,335,000 in fines. In addition, 461 vehicles without proper registration plates were penalized, leading to a recovery of Rs 10,540,416.\nThe crackdown also focused on vehicles that failed to pay their token tax, with Rs 2,199,260 recovered from defaulters. Furthermore, nine vehicles were found using unauthorized police revolving lights. These lights were confiscated, and fines amounting to Rs. 130,000 were imposed.\nDirector of Excise and Taxation, Bilal Azam, urged citizens to comply with excise laws to avoid penalties. He emphasized the need for vehicle owners to remove non-standard number plates, black-tinted windows, and unauthorized lights from their vehicles. He also reminded the public to pay any outstanding token taxes and register unregistered vehicles promptly.\nThe department continued its operations across Islamabad, taking strict action against vehicles that fail to adhere to excise regulations. The department has made it clear that these efforts would continue to ensure compliance and improve road safety in the city.",
  "retrievedAt": "2025-08-10T21:17:59.548Z"
}
