{
  "title": "Health minister calls for enhanced awareness among youth on HIV",
  "link": "https://www.app.com.pk/national/health-minister-calls-for-enhanced-awareness-among-youth-on-hiv/",
  "date_published": "2020-12-01T14:01:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 01 (APP): Punjab Health Minister Dr Yasmin Rashid Tuesday called for enhanced awareness among youth on HIV/AIDS stigma reduction and its modes of transmission.\nWhile addressing a seminar in connection with World AIDS Day at a local hotel here, she said that creating awareness among university students about communicable diseases, especially HIV/AIDS, was of paramount importance as the disease was spreading at a fast pace. She emphasized that removing stigma attached with HIV/AIDS must be the prime focus of the campaign.\nThe minister said, “I am grateful to the vice chancellors for coming forward for a great cause. The role of Academia is integral in generating awareness among youth on prevention and control of communicable diseases.\nWe must discourage the trend of using injections for treatment by healthcare providers and the public. Injection must be used only when it becomes extremely necessary. Use of infected syringes, surgical/piercing instruments and unsafe blood transfusion are major causes of HIV spread in Punjab.”\nShe said that Punjab had been running one of the world’s largest Thalassemia Programs and some years back, it was discovered that some patients had caught HIV/AIDS through unsafe blood transfusion.\nShe said that awareness in universities was key to educating the society. Giving an example of COVID-19 spread, she said that just use of mask could reduce the risk of Corona spread by up to 70 per cent, Similarly, we can reduce the risk of spread of other communicable diseases considerably, she added.\nDr Yasmin Rashid further said, “It is important to reduce negative perceptions attached with the disease. This MoU with leading Universities is a milestone in spreading awareness on HIV/AIDS. We want to see a healthy Pakistan as per vision of Prime Minister Imran Khan. The awareness campaign in educational institutions has already started.\nLater, responding to questions of journalists she said Nawaz Sharif must come back to the country as per his promise. She said the political processions and meetings were risking lives of people and were a potential cause of the spread of COVID-19. She said she had appealed to the Opposition to stop political gatherings due to the Pandemic.\nIn his address, Secretary Primary and Secondary Healthcare Department Captain (Retd) Usman Younis expressed gratitude to the Minister and said it was a great moment as Academic Institutions and key stakeholders had joined hands for a great cause.\nHe said the government had adequate resources to control HIV/AIDS and it was for the first time that medicine cards were started to facilitate patients of these and other infections.\nThe Secretary PSH Department further said that screening camps would be organized at educational institutions.\nPresent on the occasion were UNAIDS Country Director for Pakistan & Afghanistan Dr. Maria Elena Fillia Borromeo, Director General Health Services Punjab Dr. Haroon Jehangir, Vice Chancellor of Punjab’s leading Universities, Project Director Punjab AIDS Control Program Dr. Munir Ahmed, Managers of all Vertical Programs, representatives of WHO, UNICEF and a large number of media representatives.",
  "retrievedAt": "2025-08-11T20:05:02.871Z"
}
