{
  "title": "Former Speaker of AJK-LA Sardar Ghulam Sadiq passes away",
  "link": "https://www.app.com.pk/national/former-speaker-of-ajk-la-sardar-ghulam-sadiq-passes-away/",
  "date_published": "2020-12-01T13:27:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Dec 01 (APP): Former Speaker of Azad Jammu and Kashmir Legislative Assembly (AJK-LA) and leader of Pakistan People’s Party Sardar Ghulam Sadiq Khan passed away on Tuesday due to COVID-19. He was 70.\nSardar Ghulam Sadiq already suffering from renal failure and on dialysis for the last one year contracted the virus few days back and was under treatment at Shifa international Hospital Islamabad where he breath last on Tuesday morning, family sources said.\nHis funeral will be held on Wednesday 2:00 p.m. at college ground Hajeera, a town in district Poonch and will be laid to rest at his family graveyard in ancestral village near the Town.\nSadiq was a senior parliamentarian and twice elected as member legislative Assembly. He also served as advisor to Prime Minister of Pakistan and speaker legislative Assembly as well.\nHe was known as a principled politician who earned wide respect in the political circles of AJK irrespective of political affiliations.\nAJK Senior Minister Chaudhary Tariq Farooq while paying rich tribute to the former speaker, said he was humble man and a respected politician.\n“AJK is deprived of an experienced parliamentarian and devoted politician. No doubt it is a great lose to the region,” Farooq said.\nAJK-LA Speaker Shah Ghulam Qadir announced one-day mourning on his demise and adjourned the legislative Assembly sitting till Thursday.\nLate Ghulam Sadiq started his carrier as a teacher and joined PPP in 70s after resigning from teaching job.\nAJK President Sardar Masood Khan, Prime Minister Raja Farooq Haider Khan, Speaker Shah Ghulam Qadar, Ministers and all the political parties’ heads have expressed sorrow over the sad demise of Sadiq and prayed the Almighty to grant his soul the highest place in Jannah and courage to bereaved family to bear this loss with fortitude.",
  "retrievedAt": "2025-08-11T20:05:03.100Z"
}
