{
  "title": "Qadri lauds minority’s role in country’s progress",
  "link": "https://www.app.com.pk/national/qadri-lauds-minoritys-role-in-countrys-progress/",
  "date_published": "2020-12-01T15:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP): Minister for Religious Affairs and Interfaith Harmony Sahibzada Noor-ul-Haq Qadri on Tuesday lauded the role and contribution of patriot Christian community in country’s progress and stability.\nAddressing a function in connection with Christmas organized by Minority Wing of Minority Wing of Pakistan Tehreek-e-Insaf (PTI), he felicitated Christian community on the eve of the birth anniversary of Jesus Christ (AS) to be celebrated on December 25th 2020.\nPakistan Christians have always played the role of responsible citizens, he said adding that the patriot Christians always played constructive role in strengthening the country. Jesus Christ disseminated the message of peace, love and fraternity among the humanity.\nAll prophets worked for the welfare of the mankind and all religions spread the message of unity and love and intolerance. The message of Christianity was love and friendship.\nHe said the Christian world has also denounced French President Emmanuel Macron’s Islamophobic remarks apart from Pakistan,Turkey and Iran.\nChancellor has also sent a clear dissenting message.\nHe said the Constitution of Islamic Republic of Pakistan guarantees complete freedom to minority communities of the country. Quaid-e-Azam Muhammad Ali Jinnah was also a strong supporter of minority rights.\nA high powered Parliamentary committee has already been constituted to examine the reported forced conversion of minority community members.\nThe forced conversion would be eradicated as Islam and Quran vividly says there is no concept of forced conversion in Islam.\nPresident Insaf Minority Wing, Islamabad and Parliamentary Secretary Ms Shunila Ruth said the government working hard for the welfare of minorities. Organising such programmes were the example of interfaith harmony.",
  "retrievedAt": "2025-08-11T20:05:02.680Z"
}
