{
  "title": "Shehbaz Sharif not to be allowed to do politics on death of his mother: Dr Firdous",
  "link": "https://www.app.com.pk/national/shehbaz-sharif-not-to-be-allowed-to-do-politics-on-death-of-his-mother-dr-firdous/",
  "date_published": "2020-12-01T17:07:00.000Z",
  "source": "APP",
  "content": "LAHORE, Dec 01 (APP): Special Assistant to Punjab Chief Minister on Information Dr Firdous Ashiq Awan on Tuesday said that Shehbaz Sharif would not be allowed to do politics on the death of his mother.\nShe expressed these views while talking to media at the Governor House, here.\nShe said that extending release on parole was not a part of government’s policy. She said that Punjab Chief Minister Usman Buzdar already gave a five-day release on parole to Shehbaz Sharif and his son Hamza Shehbaz instead of 12 hours on humanitarian grounds.\nShe said that Shehbaz Sharif should not have asked for extension in release on parole.\nShe said that Shehbaz Sharif was released on parole to attend his mother’s funeral and last rites, therefore, he would not be allowed any extension for political gossips and business affairs.\nLater, addressing the press conference at DGPR office, she said that the opposition should realize that public had rejected their treacherous stance.\nDr Firdous said those who looted public wealth for 40 years were now grieving for the common man just to save their looted money, adding that the alliance of opposition parties was only to safeguard their personal interests and looted money and they had nothing to do with people’s problem.\nShe said the Pakistan Democratic Movement (PDM) violated the court order and the coronavirus SOPs. She added that the PDM may continue its political rhetoric but refrain from playing with lives of the people. The PDM rallies were resulting in increasing corona cases, she claimed.\nShe said that during the speech of Maryam Safdar at the Multan rally, a fire broke out in the cardboard warehouse due to the fireworks and the warehouse owner registered a case against former PML-N MPA Shahid who was responsible for it.\nThe SACM said that Maulana Fazlur Rehman distributed sticks among his workers to attack the police, adding that the government was aware of the conspiracy and hence directed the police to stay away from any kind of clash.\nShe said that an FIR would be registered against the organizers of the Multan rally for violating the Punjab Infectious Diseases Control Act. Apart from 22 persons from PML-N, 16 from PPP, 13 from JUI-F, and some unknown persons had been nominated in the FIR as well, she added.",
  "retrievedAt": "2025-08-11T20:05:00.393Z"
}
