{
  "title": "6 million people of Hazara division would get the benefits of SCP: Mushtaq Ghani",
  "link": "https://www.app.com.pk/national/267859/",
  "date_published": "2020-12-01T13:02:00.000Z",
  "source": "APP",
  "content": "ABBOTTABAD, Dec 01 (APP): Speaker KP Assembly Mushtaq Ahmed Ghani Tuesday said that the government of KPK has extended the area for Sehat Card Plus (SCP) worth one million rupees each for Zone II including Shangla, Boneer, Kohistan, Mansehra, Abbottabad, Battagram and Torghar districts.\nHe said this during the inauguration of SCP for Zone II along with Advisor to CM KPK on Information Kamran Bangash and provincial Minister for Health Taimour Saleem Jhagra in Abbottabad.\nMushtaq Ahmed Ghani said that through SCP 6 million population of the region would get the health facilities from the best hospitals of the country moreover the middle class and lower middle class would be the main beneficiary of the health card.\nHe further said that we don’t care that opposition would propagate against us using the SCP scheme as we were targeted when we launched Billion Tree Tsunami (BTT) tree plantation and Bus Rapid Transport (BRT) Peshawar.\nMushtaq Ahmed Ghani said that we have planted one billion trees and also materialize BRT which is providing a quality local transport service at a cheap expense, Imran Khan has started Panah Gahas program for people without houses, Langar Khana and also took the responsibility for the treatment of the masses, adding he said.\nTalking about the facilities of the HCP speaker KP assembly said that every person who has a permanent address on his/her Computerized National Identity Card (CNIC) of KPK would be eligible to utilize this card and get the benefit of one million rupees from more than 450 hospitals in all over Pakistan.\nWhile criticizing the opposition political parties he said that the Grand Democratic Alliance (GDA) is rather than serving the masses creating COVID-19 patients in over the country through their public gathering.\nAdvisor to CM on Information Kamran Bangash while addressing at the occasion said that Health Plus Card is s step towards the completion of election promises those we have committed with the masses during the last general election, our journey towards prosperity would continue.\nHe further said that we are facing the corrupts of this country, in KPK through reforms we have vanished all other political parties in the assembly.\nKP Health Minister Taimour Saleem Jhagra while speaking said that today’s launching ceremony was held under strict COVID-19 SOPs, he said that during 90 days we have provided health insurance to 40 million people of the province.\nHe said that we have allocated 20 billion rupees for the SCP and selected private hospital those would provide treatment facility to the masses purely on merit.\nThe Minister said that today we have inaugurated the health card programe for the Hazara division and it’s indeed an hounour for us while the credit of all these reforms goes to PM Imran Khan’s leadership.\nTaimour Saleem Jhagra disclosed that opposition members also appreciated the health card system while from the next year we would increase the health insurance amount.\nHe said that besides the provision of financial benefits to the masses to tackle health issues through SCP we would also gather the data of diseases of every person in the province, registration of the children is a must to avail the benefits of the health card, adding the Minister said.\nBesides, the masses pharma and insurance industries would also be flourished through the health card scheme and people those are get rid of the expenses on their health would be free by using health card, adding the Minister said.",
  "retrievedAt": "2025-08-11T20:05:06.764Z"
}
