{
  "title": "Comprehensive policies must for promoting inclusiveness of PWDs: Samina Alvi",
  "link": "https://www.app.com.pk/national/comprehensive-policies-must-for-promoting-inclusiveness-of-pwds-samina-alvi/",
  "date_published": "2022-12-07T10:52:00.000Z",
  "source": "APP",
  "content": "KARACHI, Dec 07 (APP): First Lady Samina Arif Alvi, on Wednesday, stressed on comprehensive measures at every level for promoting inclusiveness of Persons With Disabilities (PWDs) in all spheres of the society.\nShe was addressing opening ceremony of Special Children’s Sports Gala and Scouting event organised by Institute of Holistic Rehabilitation and Inclusion (IHRI) in collaboration with World Memon Organisation at a local school.\nSamina Arif Alvi said that it was vital for sustainable development of the country that inclusiveness must be promoted and participation of differently abled persons be ensured in all social, economic and political activities as over 10 percent of the population of Pakistan was facing disability in different forms or manifestations.\nThe first and foremost challenge that needed to be addressed was public mindset and common behaviour of society towards persons with disabilities that obstructed their growth and prospects of career building, she noted and urged people to not disrespect or ridicule such persons but encourage and support their participation in educational, social and economic activities.\nPakistan had already rectified UN convention on differently abled persons, there were certain laws and policies in place and special job quota was reserved in public sector while government and non governmental organizations were working for their facilitation and protection of their rights, she observed.\nHowever, all the stakeholder need to focus on ensuring implementation on laws and policies in letter and spirit, further improving relevant policies, enhancing accessibility and a paradigm shift in overall social behaviour to bring the real change so that no one left behind, Samina Alvi maintained.\n“We need to focus on equipping the special children with market oriented technical and vocational skills and professional training so that they instead of relying on others could be able to earn their livelihood and become productive part of society and play due role in development and prosperity of the country,” she maintained.\nThe parents and healthcare providers should also ensure proper check up of a newly born child to diagnose any potential signs or symptoms of disability as timely treatment could save a child from lifelong disability, she advised.\nThe first lady also called for an inclusive education system that support learning of differently abled children along with other children in general schools so that they could learn coping with difficulties of life.\nShe also urged all higher education institutions of public and private sector to facilitate enrollment of special persons in regular courses at discounted fees as per HEC policy.\nSamina Arif Alvi highlighted the need of ramps in buildings, public places and transport facilities to promote mobility of differently abled persons. She further said that visually impaired children should be taught use of white cane from the early age.\nShe appreciated IHRI and WMO for providing education and training opportunities to special children and assured her all out support in their future endeavours.\nThe first lady also lauded role of media for spreading awareness and promoting idea of inclusion of differently abled persons and said that awareness made a significant difference in campaign on breast cancer.\nRegional President MWO H.M Shahzad, Neurologist Ramal Kumar, Adur Razaq Pardaisi and Rahim Janu also addressed the ceremony and said that persons with disabilities were essential part of the society and their organization was taking multiple measures to bring them into mainstream so that they could play active role in development of the country.\nThey said that their organization would provide jobs to differently abled children in their business and industrial enterprises while a health card would also be issued to special children.\nEarlier, Samina Arif Alvi visited different sections of the schools, and reviewed arrangements for special children’s sport gala and scouting event.\nAt the occasion, the event organisers also presented souvenir shield to Samina Arif Alvi.",
  "retrievedAt": "2025-08-11T15:58:42.887Z"
}
