{
  "title": "Digital transformation to help improve common man’s living standards: Amin",
  "link": "https://www.app.com.pk/national/digital-transformation-to-help-improve-common-mans-living-standards-amin/",
  "date_published": "2022-12-07T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 7 (APP): Federal Minister for Information Technology and Telecom, Syed Amin-Ul-Haque here on Wednesday said the government was committed to the digital transformation of Pakistan as it would help improve the quality of life and economic well-being of the masses by ensuring the availability of modern, affordable, and reliable digital services.\n“Digital Pakistan is one of the flagship programs of the government of Pakistan initiated by the Ministry of IT and Telecom aimed at enhancing the pace of economic development of the country,” he expressed these views while inaugurating Public Key Infrastructure (PKI) for National Root Certification Authority.\nThe minister recalled that in order to establish trust in cyberspace and safeguard the public interest legally, Electronic Transactions Ordinance (ETO) was promulgated in 2002 in Pakistan. “Under section 18 of ETO 2002, Electronic Certification Accreditation Council (ECAC) has been established under the Ministry of IT and Telecom” he added.\nThe minister said, “Electronic Certification Accreditation Council (ECAC) has established Public Key Infrastructure (PKI) for National Root Certification Authority for the government, public and private sector entities. It will be the first National Root Certification Authority to establish trust and security in electronic transactions, and communications in the country. It will be globally recognized through WebTrust audit and highly secured PKI setup for accreditation of Certification Service Providers (CSPs).”\nAmin-Ul-Haque also said, “Establishment of National Root Certification Authority is a step towards the achievement of “Accelerated Digitization”. It’s a historic occasion for the ECAC and the government of Pakistan for achieving this milestone which was committed by the Government.”\nThe Minister further said that Pakistan had witnessed a dynamic revolution in the sphere of e-commerce and e-governance. “The use of Digital Signatures in Pakistan is unpredictable as it was unregulated due to the non-existence of the National Root Certification Authority, the monopolistic existence of the Certification Authority in the private sector, and the lack of enforceability and implementation in the public sector by the appropriate authorities.”\nHowever, he said, there was enormous use of digital signatures in Public and Private Sectors in digital contract signing, Webhosting, E-mails, E-voting of intermediaries, E-filing, and E-office services, etc.Syed Amin-Ul-Haque said; “Internationally, PKI and overall Information Security is a multi-billion-dollar industry. Pakistan has the potential in the form of its youth to participate in this market and prove its mettle. It will improve Pakistan’s economy; presently the rights of digital certificate consumers are not sufficiently protected.”\nIt is worth noting that currently, all the certificates used to secure these services within Pakistan are imported certificates either from Foreign Certification Service Providers like VeriSign, DigiCert, Entrust or Go Daddy etc. or through their partners/resellers in Pakistan which is a burden on foreign reserves of the Country besides security issues e.g. about 116 thousand websites and 1280 email servers registered with PKNIC making the import of only SSL certificates for these websites and mail servers worth hundreds of millions Rupees. He emphasized the role of ECAC’s PKI will address all these issues.\nThe minister said the PKI was the foundation of modern information security that incorporates technology and personal identity in a way that it becomes capable to fulfil security needs all around the world, in all types of industries and organizations, governments, and in homes.ECAC with the support of MoITT, has deployed Pakistan’s National Root Certification Authority based on PKI that will act as the backbone for the digital economy of the Country.\n“Ministry believes this is an extremely positive development and would indeed result in economic prosperity for the nation through the promotion of e-businesses, the creation of jobs for the youth and numerous opportunities for the IT industry and e-commerce of Pakistan” he added.Amin said, “We pledge full support to Electronic Certification Accreditation Council (ECAC) as an arm of the Ministry of IT to fully implement the mandate under the Electronic Transactions Ordinance 2002 (ETO).\nThe minister noted that rapid growth and Adoption of digital technologies in all sectors of the economy is inevitable for the development of the Country.Amin ul Haqu said nowadays, it is very difficult to imagine any sector without digital technology. “During the last two years of the pandemic, we have seen our dependence on digital technologies has increased manifold” he added.\nHe said that while technology has the advantages of ease of doing things and managing various functions, it also brings a number of vulnerabilities and cyber threats. “These threats are increasing day by day with the development of cyberspace damaging the Public trust in the digital environment,” the minister said.Amin said, “As Pakistan embarks on its journey towards becoming a truly Digital Economy, the establishment of regulatory frameworks for ensuring data protection, establishing trust, and maintaining the security of all digital transactions, documents, and systems are thus essential.”\nThe minister appreciated National Telecom Corporation for providing technical and administrative assistance making it happen on a fast track.While addressing the participants of the inaugural ceremony Additional Secretary (Incharge) Ministry of IT Mohsin Mushtaque Chandna “Congratulated and appreciated the continuous efforts of the Certification Council and its officers in establishing Pakistan’s first WebTrust Audited National Root Certification Authority.\nHe said Pakistan was in the process of Socio-Economic digitization in all sectors including e-Health, e-Commerce, e-Justice, e-Agriculture, e-Energy, e-Education and FinTech. Digitalization of e-Commerce and FinTech is most prominent, its size has grown significantly in Pakistan over the last few years, transforming the way consumers interact with and especially pay business. Online transactions require a strong trust anchor to be trusted by all the relying parties. This trust anchor has been built by the ECAC, to enable trust in all the electronic transactions using Digital Certificates issued by Accredited Certification Service Provider.”\nSpeaking at the occasion, Chairman ECAC Engr. Mairaj Gul apprised the audience that under the dynamic leadership of Federal Minister Syed Amin Ul Haq and Federal Secretary, ECAC has accomplished this task to provide an anchor for trust and security in the digital environment of Pakistan.Chairman ECAC also highlighted the initiatives taken by Minister Syed Amin ul Haque in IT & Telecom sector during his period.\nDuring the ceremony, to encourage coordination between the public and private domain and accreditation from the National Root Certification Authority, two MoUs also signed between ECAC and NTC as a Government domain Certification Service Provider and second between M/s Khazana and M/s NiFT as a Commercial Certification Service Provider for supporting each other to work together in the domain of Certification Services.",
  "retrievedAt": "2025-08-11T15:58:40.143Z"
}
