{
  "title": "Coalition parties’ meeting expressed no confidence in SC bench hearing polls delay case: PM",
  "link": "https://www.app.com.pk/national/coalition-parties-meeting-expressed-no-confidence-in-sc-bench-hearing-polls-delay-case-pm/",
  "date_published": "2023-04-03T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 3 (APP):Prime Minister Muhammad Shehbaz Sharif on Monday maintained that all the leaders of coalition parties in the Federal Government, during a meeting chaired by him in Lahore last week, had expressed their no confidence in the Supreme Court bench hearing the suo motu case of polls delay.\nTaking part in the National Assembly session, the prime minister endorsed the views of Minister for Law Azam Nazeer Tarrar regarding the expression of no confidence in the constitution of the bench seized of the matter.\nHe said Justice Ijazul Ahsan, another member of the bench, had recused himself from the bench.\nHe requested the Chief Justice of Pakistan to constitute a full court sans two judges as it would be acceptable to the nation.\nSuch a contentious decision, he said, would be against the norms of justice.\nThe prime minister referred to the CJP’s remarks in which he stated that certain people speaking in the National Assembly had undergone jail terms and said it was a matter of pride that he had been released by the high court on merit in the false and fabricated cases.\nImran Niazi and his collaborators had framed false cases against him and tried to implicate him in those fabricated cases, he added.\nIt was their right under the Constitution to express their views in the Parliament, he said, adding whether the CJP had referred to the witch-hunting of the opposition leaders during the PTI’s tenure.\nThe prime minister said there were serious allegations of corruption against certain members of the bench and by including them in the bench what message was given to the whole country.\nHe stressed that the law of equality was applicable to all. Double standards would not work.\nIn London’s case, Imran’s lackey Shehzad Akbar, had got published a false story in the Daily Mail, London, but later the author tendered an apology, he added.\nThe prime minister said Imran Niazi during his rule had no other engagement but to spend his energies on devising nefarious schemes to send opposition leaders to jails.\nHe mentioned that Imran had sent him twice to jail and was trying to send him for the third time.\nEven his bail which was granted on merit by the high court during the PTI’s government was challenged in the Supreme Court, he added.\nHe said he was released on merit and now standing in the Parliament. “My fault was that as leader of the opposition, they were countering the ill-devised policies of the PTI’s government and Niazi considered them as hurdles and acted like ‘Nero plays the flute when the Rome was on fire’.\nEarlier, the law minister briefed the House about the proceedings in the apex court and reiterated that the coalition parties had already conveyed to the court to constitute a full court to hear the instant case.",
  "retrievedAt": "2025-08-11T08:11:54.128Z"
}
