{
  "title": "No Pak-Israel ties until Palestinians get separate homeland: PM",
  "link": "https://www.app.com.pk/national/no-pak-israel-ties-until-palestinians-get-separate-homeland-pm/",
  "date_published": "2023-04-03T11:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 3 (APP):Prime Minister Shehbaz Sharif on Monday, rubbishing the social media propaganda, categorically ruled out any possibility of the relationship between Pakistan and Israel until the people of Palestine get their due right of a separate homeland.\nAddressing the parliamentary party meeting of the Pakistan Muslim League-Nawaz (PML-N), he resolved that Pakistan would not deviate from its principled position of having no ties with Israel until the Palestinians get their legitimate right.\nHe was referring to the social media posts mentioning any trade activity by a Pakistani Jew with Israel.\n“There is not even mention of that. This is just baseless. An individual Jew has traded some goods. The government has nothing to do with that,” he commented.\nBehind such propaganda were the people who opposed a Muslim candidate of London Mayorship and instead supported the Jewish candidate, he added.\nThe prime minister told the PML-N parliamentarians that before assuming the government, he had not imagined the severity of the situation in form of a destroyed economy and strained foreign relations with brotherly countries, including China and Saudi Arabia.\nHe said under PML-N Quaid Muhammad Nawaz Sharif and with the cooperation of the allied parties, the government was making all-out efforts to cope with the challenges.\nHe said the government had fulfilled all the conditions imposed by the International Monetary Fund (IMF) as the previous regime had violated the commitments with the global financial institution.\nHe said recently Pakistan was hit by the worst flood and the Federal Government alone had spent Rs100 billion to support the suffering people.\nThe prime minister recalled that during the tenure of Nawaz Sharif till 2017, the country was progressing with the sugar price at Rs 52 and the dollar rate at Rs 100.\nHe said during its four-year tenure, the Pakistan Tehreek-e-Insaf (PTI) government took loans even more than those taken during the 70-year history.\nThe previous government not only violated the IMF agreement but also questioned the transparency in the CPEC (China-Pakistan Economic Corridor) projects which impacted the Pak-China bilateral relations.\nIt was alleged that the CPEC projects involved 45 percent corruption and such allegations were repeated not only in the cabinet but also in the Parliament and private meetings, he added.\nPrime Minister Shehbaz said the leadership of the PML-N and other allied parties rendered immense sacrifices and also put their politics at stake to protect the state which was in no way a bad deal.\n“Though the situation is tough now, the time will come when it will change… Pakistan is genuinely at a crossroads. Today we have to live within the ambit of the Constitution and law,” he remarked.\nThe prime minister told the meeting that during the PTI government, there was no shortage of wheat in the country rather it was a scandal. However, the incumbent government timely imported the commodity to avert any shortage.\nHe said the government had launched the history’s biggest project of distributing three wheat flour bags to needy families during Holy Ramazan which would benefit around 100 million people.\nHe said the government was striving to improve the situation but political stability was a must to achieve the desired goal.\nDrawing a stark comparison, the prime minister said Nawaz Sharif’s daughter was implicated in corruption cases but contrary to that the PTI wanted to save Imran Khan’s wife claiming that she was not a public office-holder.",
  "retrievedAt": "2025-08-11T08:11:55.316Z"
}
