{
  "title": "Shazia Marri for extending maximum relief to deserving beneficiaries",
  "link": "https://www.app.com.pk/national/shazia-marri-for-extending-maximum-relief-to-deserving-beneficiaries/",
  "date_published": "2023-04-03T09:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP):Federal Minister and Chairperson Benazir Income Support Programme (BISP) Shazia Marri on Monday directed the officials concerned for vigilance and concrete efforts to ensure the disbursement of Benazir Kafaalat and other initiatives in a more transparent manner.\nShe was presiding over a high-level meeting to review the various initiatives of the Benazir Income Support Programme.\nThe meeting was held on zoom and was attended by the Secretary Benazir Income Support Programme Yusuf Khan, Additional Secretary Dr Tahir Noor, and all director generals including heads of provinces and regions.\nThe Secretary BISP briefed the minister regarding the ongoing quarterly disbursement of Benazir Kafaalat which has been enhanced from Rs 7,000 to 8,500 by the federal government.\nThe details of other initiatives including the disbursement of Benazir Taleemi Wazaif, Sindh Government’s payments of wheat seed subsidy to farmers of flood-affected areas of Sindh, and atta (flour) subsidy payments, were also discussed.\nThe ongoing survey of the National Socio-Economic Registry ‘Dynamic Registry’ was also discussed under which the status of already registered beneficiaries is being reassessed.\nDynamic Registry also gives the new deserving beneficiaries the opportunity to take benefit from the initiative on qualifying the criteria/ poverty benchmark.\nThe Regional DGs for Punjab, Sindh, Balochistan, Khyber Pakhtunkhwa, Gilgit-Baltistan and Azad Jammu Kashmir briefed the minister with regard to complaints of illegal deductions received, recovery made and the POS agents blocked under the complaints of deductions. The provincial DGs discussed about the shortage of manpower in the meeting.\nShazia Marri said that we needed to educate beneficiaries that the government of Pakistan had increased the amount of Benazir Kafaalat for quarter of Jan- March and April- Jun from Rs 7000 to Rs 8500 and RS 9000 respectively.\nShe urged the beneficiaries to lodge their complaints in case of unlawful deductions in the nearest BISP office.\nThe minister directed the field staff to enhance vigilance at the grassroots level to control the complaints of illegal deductions received from some areas against the POS (Point of Sale) agents of partner banks.\nShe further urged the partner banks, i.e. Habib Bank in Punjab, Sindh and Balochistan and Bank Al-Falah in the rest of the country to simplify the payment mechanism through their ATMs so that the beneficiaries of Benazir Income Support Programme could withdraw their funds easily.\nThe minister asked the Secretary BISP to work out a plan to address the issue of shortage of manpower in the provinces, Gilgit-Baltistan and Azad Kashmir.",
  "retrievedAt": "2025-08-11T08:12:00.880Z"
}
