{
  "title": "Senate adopts unanimous resolution to chalk out roadmap against Riba",
  "link": "https://www.app.com.pk/national/senate-adopts-unanimous-resolution-to-chalk-out-roadmap-against-riba/",
  "date_published": "2023-04-03T10:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 03 (APP): The Senate on Monday adopted a unanimous resolution to chalk out a practical roadmap for eliminating Riba and establishing an interest-free financial and economic system in the country.\nPresenting a couple of proposals for eliminating the interest-based system from the country, the mover of resolution Jamaat-e-Islami’s Senator Mushtaq Ahmed urged the government to establish a permanent division and its subordinate task force under the administrative control of the Ministry of Finance.\nHe said the government should enact laws for prohibiting individual and collective interest-based business in the country.\nHe said the government should eliminate Riba from various financial institutions, including National Investment Trust Unit, House Building Finance Corporation, Pension and Savings Fund, Consumer Finance and others.\nHe further said a task force may be established with the responsibility of implementing recommendations of reports of all previous committees, commissions, and task forces established regarding the elimination of Riba.\nAccording to the resolution, the Senate recalls Article 38 (f) of the Constitution which stipulates the elimination of ‘Riba’ as early as possible expressing concerns that for the last 75 years the curse of ‘interest’ was not eliminated from the country.\nIt acknowledged the decision of the Federal Shariat Court for the elimination of Riba from the country and also appreciated and supported the decision of the government, State Bank of Pakistan and National Bank of Pakistan for withdrawal of appeals against the decision which was encouraging for establishing an interest-free financial and banking system in Pakistan.\nSeconding the resolution, Minister of State for Finance and Revenue Senator Aisha Ghaus Pasha said the Riba-free economy was the topmost priority of the incumbent government.\nShe said the government had already constituted a task force and for the establishment of a division in the Ministry of Finance, a summary had been moved for its approval.\nShe made it clear that it was a bit difficult to transfer the financial system towards an interest-free economy as it needs a proper roadmap to get rid of this social nuisance.",
  "retrievedAt": "2025-08-11T08:11:59.617Z"
}
