{
  "title": "Indonesia fully supports Pakistan to obtain Full Dialogue Partner status with ASEAN; Envoy",
  "link": "https://www.app.com.pk/national/indonesia-fully-supports-pakistan-to-obtain-full-dialogue-partner-status-with-asean-envoy/",
  "date_published": "2022-04-02T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP):Ambassador of Indonesia to Pakistan, Adam Mulawarman Tugio, on Saturday said that Indonesia fully supports Pakistan to obtain Full Dialogue Partner status with the Association of Southeast Asian Nations (ASEAN), which will provide huge economic opportunities for Pakistan with 623 million of potential trade market of the region.\nIn an exclusive interview with APP, the Ambassador said that there were two approaches for achieving this goal; first is through an institutional process while the second was that the existing bilateral policy between Pakistan and individual ASEAN member countries need to be addressed through bilateral approach.\nOn the institutional approach he said, ASEAN and Pakistan have already adopted the action plan, adding that there were 11 areas of importance in which Pakistan and ASEAN countries could work together and one of the areas was trade and investment.\nThe second, he said is related to using the bilateral approach such as Pakistan can build bilateral relations with Indonesia and with other ASEAN member countries and added that by doing this, Pakistan would be able to be accepted as a full dialogue partner status and it would increase political, commercial and economic links with ASEAN member states.\nThe Ambassador further stated that Pakistan had vast potential to increase its exports to Indonesia, mainly textile, garments, leather products, surgical instruments, and fruits.It is pertinent to mention here that the current bilateral trade between Indonesia and Pakistan is around $ 2.6 billion; with balance of trade heavily in favor of Indonesia.\nAnswering the question related to trade imbalance between both the countries, the Ambassador said the Preferential Trade Agreement (PTA) between the two countries has enhanced Pakistan’s exports to Indonesia while in future, by signing the Free Trade Agreement (FTA), trade on both sides can be further enhanced.\nAnswering a question on Indonesian investment in China Pakistan Economic Corridor (CPEC), the Ambassador said that two Indonesian companies are already investing in the Special Economic Zones (SEZs) of Faisalabad (Allama Iqbal Industrial City) and Thatta, Sindh Dhabeji Special Economic Zone.\nHe said that CPEC project would emerge as a game-changer for the entire region through connectivity to Central Asia and Western China. Moreover, Indonesia could also provide coal to power projects being established under the China-Pakistan Economic Corridor (CPEC) project and the domestic large-scale real estate and manufacturing sector.\nHe further said that Pakistan and Indonesia had ample opportunities for cooperation in tourism as both sides could introduce new dimensions in promoting mutual tourism. The Ambassador said that Indonesia had provided 500 scholarships for Pakistani students to study in top Indonesian universities.\nTalking about culture, he said that there was considerable similarity between the food and culture of both countries. Indonesia and Pakistan already have a suitable mechanism for political coordination, economic and defense cooperation, and events on social and cultural affairs, he added.\nIn reply to the question about the role of the Organization of Islamic Cooperation (OIC), the Ambassador said the OIC’s role is significant, adding that the United Nations General Assembly (UNGA) had declared March 15 as International Day to Combat Islamophobia on a resolution introduced by Pakistan on behalf of the Organization of Islamic Cooperation (OIC).The Ambassador also lauded the role of Pakistan government in organizing an extraordinary session of the OIC on Afghanistan and then raising a voice against Islamophobia in UNGA.\nOn Kashmir issue, he observed that there were no military solution and both Pakistan and India should resolve this issue through dialogue to find out an acceptable solution for both the countries.\nHe further stated that OIC was a vibrant forum to resolve various issues the Muslim countries were facing. It is making a tremendous effort to reform and improve the economic and social conditions of the member states. He said that Halal food had enormous potential from a financial perspective, but if the member states do not focus on it, the OIC market could be exploited by non-OIC countries.\nCommenting about the economic and humanitarian crisis in Afghanistan, he said that Indonesia, with the collaboration of OIC members, provided humanitarian assistance to help out our brothers and sisters in Afghanistan. Moreover, Indonesia offers scholarships to Afghan students for higher studies in Indonesian universities, he expressed.\nThe Ambassador also said that now Indonesia had opened itself for tourism and there was no quarantine time for fully vaccinated visitors. Moreover, the Indonesian government has already received agreements from the relevant authorities in Pakistan to start direct flights from Pakistan to Indonesia which would further promote people to people contacts, tourism and business opportunities in the two countries.",
  "retrievedAt": "2025-08-11T14:38:51.512Z"
}
