{
  "title": "Arrangements finalized to offer homelike ‘Sehar’, ‘Iftar’ at ‘Panahgahs’: Naseem",
  "link": "https://www.app.com.pk/national/arrangements-finalized-to-offer-homelike-sehar-iftar-at-panahgahs-naseem/",
  "date_published": "2022-04-02T13:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP):All is set for offering a homelike “Sehar” and “Iftar” to daily wage earners and destitute at the Shelter Homes during the holy month of Ramazan, Prime Minister’s Focal Person on “Panahgah” Naseem ur Rehman told on Saturday.\n“Over 100 ‘Panahgahs across the country are ready to observe the Ramdan Karim festivities with a renewed sense of religious and social fervor. The essential supplies including dates, sugar and sweet beverages have already been provided to all the Panahgahs,” Naseem ur Rehman told the media persons here after reviewing the arrangements at Peshawar Morr facility located in Sector G-9 of Islamabad.\nThe shelter homes “Panahgahs”, set up by the government under the umbrella of its flagship social welfare programme “Ehsaas”, have been providing ideal food and shelter to thousands of poor and needy across the country.According to the PM’s Focal Person, “Panahgahs” had come a long way in fulfilling its mission of serving low income labourers and daily wagers with dignity and respect.\nAs regards the Ramazan preparations, he said the field teams and friends of ‘Panahgahs’ were enthusiastically busy in giving finishing touches to arrangements for creating a home like environment for Sehar and Iftar at the “Panahgahs”.Naseem said he had held consultations over the week with the services providers, local boards and loyal supporters of “Panahgahs” to provide fresh and nutritious “Sehar” and “Iftar” package, in addition to regular meals.\nThe Programme titled “Individual Responsibility: Collective Iftari” to greet Ramzan Karim and create conducive environment for compassion and sharing the blessings of the holy month had also been launched, he added.He said the traditional foods and customary cuisines had been added to the menu supplemented with dates, sweet drinks, fritters and snacks.\nThe network of community supporters and field staff was working as a team to demonstrate a sense of ownership, participation and sustainability for the much needed services provided by the “Panahgah” programme dedicated to offer safe and secure food and shelter to poor workers, he remarked.\nHe appreciated the spontaneous, generous and consistent support extended by the philanthropic members of the society for the weal and welfare of the poor dwellers of “Panahgahs”. All the staff of “Panahgahs” have been especially instructed and trained to pay extra care to the residents and guests at the shelter homes, he added.\nTo a query, he said the Pakistan Tehreek-e-Insaf government would continue to serve the marginalized communities in line with its mission and vision with a deep sense of commitment and responsibility.“Fasting in Ramazan is a much awaited religious and social obligation which is enthusiastically observed by the Muslims across the world in much esteemed way,” he remarked.",
  "retrievedAt": "2025-08-11T14:38:56.162Z"
}
