{
  "title": "PM asks youth to hold peaceful protest against foreign conspiracy to oust him",
  "link": "https://www.app.com.pk/national/pm-asks-youth-to-hold-peaceful-protest-against-foreign-conspiracy-to-oust-him/",
  "date_published": "2022-04-02T14:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 2 (APP): Prime Minister Imran Khan Saturday asked the youth to hold a peaceful protest against the conspiracy hatched by a foreign power in collusion with the opposition to oust him from power.\nSpeaking in a television programme, he said, “Youth should not sit silent, but take a decision and raise voice against the conspiracy that was hatched against the prime minister of Pakistan.\nHe stated that a foreign country was trying to topple the government in Pakistan by spending Rs 15-20 billion on traitors in the opposition.\n“I am telling youth there will be no future for them if they will not stand against the evil.”\nHe said peaceful protest was the right of people and cited the two million march of people on the streets of London when the allied forces attacked Iraq by falsely claiming the presence of weapons of mass destruction.\nHe reiterated that conspiracy against him had been unearthed and Pakistan was at a critical stage so the youth should take to the streets and prove that Pakistanis were an alive nation and would stand up for their better future.\nThe conspiracy was proven as an official document about the role of the foreign power, was presented in the National Security Committee and Parliamentary Security Committee, he asserted.\nThe traitors were afraid of the protest as they had sold their conscience and acted like Mir Jaffar and Mir Sadiq who colluded with the British and overthrew Sirajud Doula, he recalled.\nThe nation would have to decide whether it wanted to go on a path of destruction or the path of glory, he added.\nHe said the model of Riyasat e Madina was the path of well-being and 1400 years back this state changed the course of the human history and caused an ideological revolution.\nThe prime minister said the opposition was using looted money to stay in power for the last thirty years.\nThe prime minister said overseas Pakistanis were passionate about Pakistan and wanted to serve their country.\nThey were concerned about the corrupt leadership in Pakistan about which documentaries had been made and articles had been written, he added.\nHe said Pakistan could not make progress by following a foreign policy which was not independent.\nChange would not come if the conspirators were not held accountable, he added.The prime minister said Pakistan had changed because of its youth which was using social media and was part of the information technology revolution.\nOpposition used money to buy media and was spreading fake news, he said adding opposition leaders were accusing each other for corruption but now got together through a foreign conspiracy to overthrow his government.\nHe said in the past, Pakistan had moral standards but since 1985 politics of the country was degraded due to use of money.\nNow members of the National Assembly were bought and kept in the Sindh House and Marriott Hotel in Islamabad and they changed their loyalties, he noted.\nThe prime minister expressed confidence that he would win during the vote of no confidence against him in the National Assembly.",
  "retrievedAt": "2025-08-11T14:38:55.699Z"
}
