{
  "title": "Early general elections sole solution to take country forward: Rasheed",
  "link": "https://www.app.com.pk/national/early-general-elections-sole-solution-to-take-country-forward-rasheed/",
  "date_published": "2022-04-02T09:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 02 (APP):Terming next 24 hours crucial for final round of politics, Minister for Interior Sheikh Rasheed Ahmed on Saturday said only early general elections was sole solution to take this country forward.\nTalking to the media here, that Minister said the politics in the country was changing every second and situation could be changed after every hour.\nReiterating his support to Prime Minister Imran Khan, he said the opposition’s no-confidence motion has increased the popularity of Imran Khan amongst the masses.\nThose who have sold out their conscience and became dissident would not be able to face people in their constituencies.\nThe minister said the PM exposed the corrupt elements before the nation but unfortunately, the courts could not indict them on February 18.\nHe said the no confidence motion against the PM was a foreign conspiracy and accused the opposition of being a part of it. “They should be charged for treason and their parties should also be banned”, he said.\nRasheed suggested three options to counter the motion. “First and foremost, the establishment should intervene and call for early elections immediately either after Ramazan or Haj.\nThe next option, the minister said, was that the three main parties including PML-N, PPP, and JUI-F should be banned and an inquiry should be initiated against them as they brought foreign funded no confidence motion. As a third option, he advised PTI 155 members to resign from all the assemblies.Referring Article 94 of the Constitution, the minister said even if the no-confidence motion against Prime Minister succeeded, the premier would continue to hold office until a new leader was sworn in.“Under the Article 94, the President may ask the Prime Minister to continue to hold office until his successor enters upon the office of Prime Minister,” he disclosed.He said the Constitution was silent on how long the process of electing a new leader of the lower house should take after a no-trust vote succeeds.Announcing to launch a political battle against the opposition, the Minister said it was his political responsibility to bury the opposition’s politics.To a question he said GHQ was in his constituency and Army Chief was his college fellow and he had voted to him in the last general elections.He said notification to upgrade Waqar un Nisha college into a university has been issued and Rawalpindi was unique city which has five universities.",
  "retrievedAt": "2025-08-11T14:38:56.933Z"
}
