{
  "title": "NAB EBM authorises conducting 3 investigations, 5 inquiries against various accused",
  "link": "https://www.app.com.pk/national/nab-ebm-authorises-conducting-3-investigations-5-inquiries-against-various-accused/",
  "date_published": "2020-06-22T23:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):National Accountability Bureau (NAB) Executing Board Meeting (EBM) Tuesday authorised conducting three investigations, five inquiries and constituting joint investigation team (JIT) for conducting inquiry against various personalities.\nPresided over the (NAB-EBM) NAB Chairman Justice (Retd) Javed Iqbal authorised conducting three investigations against different personalities including Khizar Hayat, former sessions judge and others, Ahmed Khan Baloch, former member Punjab Assembly and others and Sher Ali Gorchani, former deputy speaker, Punjab Assembly and others, said NAB spokesman.\nThe EBM accorded approval of conducting five separate inquiries against different personalities including Muhammad Naeem Anwar, former member provincial assembly Punjab, Muhammad Saleem Khalid Mehmood and others, directors, chief executive officers (CEOs) of Massers Fatima Group of Companies, attached departments and others, Tahir Basharat Cheema, former managing director of PEPCO and others, Federal Land Commission, officers/ officials and others of Revenue Department Haroonabad, Bahawalnagar, Dr Fazal Karim, former EDO, Health Khanewal and others.\nThe EBM referred five ongoing inquiries to relevant departments with the condition to share the logical conclusion of inquiries with the NAB.\nThe ongoing inquiry against member national assembly Ehsan ul Haq Bajwa, officers/ officials of Public Health Engineering has been referred to Public Health Engineering, Punjab Highway Department; another inquiry against Muhammad Yasin, former Tehsil Nazim Haroonabad, has been transferred to deputy commissioner, Tehsil Haroonabad with the condition to share the logical conclusion with the NAB.\nThe EBM authorised constituting JIT to investigate against Muhammad Yasin, former Tehsil Nazim, Haroonabad, Ghazala Shaheen, former member Punjab Assembly, Ghulam Murtaza, former member provincial assembly, Azam Sohail son of Fateh Muhammad and others. The JIT comprising the representatives of NAB, Security and Exchange Commission of Pakistan (SECP), Federal Board of Revenue (FBR), Federal Investigation Agency (FIA) and State Bank of Pakistan has been mandated to complete the inquiry within the next 90 days. The EBM would analyse the JIT report.\nThe EBM okayed referring the ongoing inquiry against Sardar Umer Khan Gopang, Chairman of District Council Muzaffargarh, Aamir Saleem Bhatti, former chief officer, District Council Muzaffargarh and others to anti corruption establishment, Punjab; another inquiry against Dr Athar Mehboob, vice chancellor Khawaja Farid University, Rahim Yar Khan, and others to Higher Education Department, Punjab; yet another inquiry against officers/officials of Revenue Department Tehsil Chobara, district Layyah and others to senior member Board of Revenue, Punjab with the condition to inform about the logical conclusion of inquiries to NAB.\nThe NAB chairman said the bureau was making earnest efforts to make the country corruption free by ensuring logical conclusion of mega corruption cases. The bureau has no affiliation with any political party, individual or group. The only affiliation was with state of Pakistan. NAB is utilising all available resources to recover the looted money from corrupt elements. Proclaimed offenders will be apprehended and confine in jail. Corrupt will be pushed in the dock to take law its course.\nThe chairman directed the department concerned to complete complaint verifications, inquiries and investigations within the stipulated time frame.\nThe deputy chairman , prosecutor general accountability, director general operations and other senior officers attended the EBM.",
  "retrievedAt": "2025-08-11T19:22:55.265Z"
}
