{
  "title": "Treasury members’ all praise for budget, opposition criticises cut in development spending",
  "link": "https://www.app.com.pk/national/treasury-members-all-praise-for-budget-opposition-criticises-cut-in-development-spending/",
  "date_published": "2020-06-23T01:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):The lawmakers from the treasury benches on Tuesday termed the budget tax free, pro-people and business friendly,\nduring the debate in the ongoing budget session in the National Assembly.\nWhile the opposition voiced concerns over ignoring health, education and agriculture sectors in the annual financial plan.\nParticipating in the budget debate, leader, Muttahida Qaumi Movement-Pakistan (MQM-P) Usama Qadri, said enough funds were not allocated for the development of Karachi city.\nHe said Karachi was business hub, but no funds were allocated for the uplift of the people of Karachi for the next fiscal year.\nHe said that no allocation was made for the green bus service project and asked the government to increase pension and salaries of the government employees by atleast 20 percent.\nThe MQM leader criticized Sindh government for ignoring Karachi city saying leadership of Pakistan Peolples Party (PPP) was involved in corruption.\nMember National Assembly (MNA) from Pakistan Tehreek-e-Insaf (PTI), Junaid Akbar asked the government to take immediate steps for return of stranded Pakistanis abroad giving them air tickets who were facing hardships due to lack of financial resources.\nHe also urged the government to expand Ehsaas Emergency Cash programme to his area.\nHe said that it was unprecedented that the government gave a stimulus package of Rs 1200 billion to support different segments of the society during these difficult times.\nHe also requested the government to arrange rehabilitation programmes for overseas Pakistanis and create job opportunities for them, and also urged to include them in Ehsaas Emergency Cash programme.\nMNA Pakistan Muslim League Nawaz (PML-N), Chaudhry Armaghan Subhani said interest free loans should be given to the farmers to strengthen agriculture sector. He said work on the development schemes initiated by previous government should be completed on priority.\nMNA PPP, Shagufta Jumani said no funds were allocated in the budget for the construction of five million houses announced by the PTI leadership during election campaign which the government had failed to fulfill its promise and creating 10 million jobs for people.\n“You have taken away jobs and made thousands of people jobless, ” she added.\nPPP leader was of the view that attitude of the federal government with the Sindh government was not admirable. She also criticized government strategy to control coronavirus and locust attack on crops.\nMNA PTI, Salim Rehman appreciated the government for presenting tax\nfree budget.\n“I appreciate Imran Khan and his economic team for presenting tax free and people friendly budget in this difficult time,” he commented.\nHe also lauded Speaker National Assembly Asad Qaiser for focusing on steps to initiate work on construction of Swat expressway.\nHe alleged that the previous governments had ignored uplift of Swat and for tourism in the area.\nThe MNA said COVID-19 had badly affected tourism and asked the government to compensate the people linked with tourism industry.\nLeader Balochistan National Party (BNP), Dr. Shahnaz Naseer Baloch said COVID-19 had badly affected the province of Balochistan and asked the government to allocate more funds for the development of province.\nShe also asked the federal government to assist Balochistan government in preventing coronavirus circumstances.\nShe stressed for enhancing testing capacity of coronavirus, adding, short and long term strategies needed to cope with the pandemic.\nMNA Ramesh Kumar Vankwani said keeping in view the present situation in the country due to COVID-19, the government had announced best budget.\nHe also appreciated Imran Khan for constituting commission on sugar crisis and said PTI government must be appreciated for this step.\nLeader PPP Shazia Marri, said it was unfortunate that Syed Khursheed Shah was not allowed to attend the important budget session. “We will continue to raise voice for him, ” she added.\nShe also paid tribute to the doctors, nurses and paramedical staff for performing duties at hospitals and for rendering services on front line putting their own lives in danger.\nThe PPP leader suggested to the government to increase the salary of the government employees.\nPTI legislator Sardar Riaz Mehmood Khan Mazari asked the government to allocate more funds for the development of remote areas and asked the government to take steps for the creation of job opportunities for youth. He urged the government to end loadshedding in his area.\nHe also called on the government to announce special funds for the education sector.\nThe PTI leader asked the federal government to announce scholarships for the students of his area.",
  "retrievedAt": "2025-08-11T19:22:53.622Z"
}
