{
  "title": "Kashmir’s over 20,000 widows suffer amid India’s unabated genocide",
  "link": "https://www.app.com.pk/national/kashmirs-over-20000-widows-suffer-amid-indias-unabated-genocide/",
  "date_published": "2020-06-23T08:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):The genocide in Indian Occupied Jammu and Kashmir (IOJ&K) continues unabated leaving a blotch on India’s face of a ‘so-called champion of human rights’. It is not about just killing the men freedom fighters, but to pass on a trail of pain and plight to their widows and orphans.\nAs world marks United Nations’ International Day of Widows’ today( Tuesday) , thousands of Kashmiri widows mourn brutal killing of their husbands.\nAn independent summary of brutalities in Indian Occupied Jammu and Kashmir reveals a data of over 95,000 killings of Kashmiris, 20,000 plus each widows and orphans, 6,000 mass graves and over 8,000 enforced disappearances.\nAmid the days and nights of abuse and torture, the life of widows in IOJ&K is marked with agony whose husbands have been killed in raising voice for their right to self-determination. Hundreds of widows live in isolation with little or no social or financial support.\nTo suppress the justified demand of Kashmiri people, India has turned Kashmir into the world’s most elevated militarized zone.\nThe conflict has affected women and children more than any group or class, especially widows and orphans, writes sociologist Professor Bashir Ahmad Dabla in his book, Social Impact of Militancy in Kashmir.\nThese survivors, Dabla argues, are the most hard-hit sufferers of the conflict living under grim conditions of economic destruction, educational backwardness, mass psychological depression, mental and physical health deterioration and dehumanization of families.\nThe United Nations Security Council has stressed the need to survey and compensate women in Jammu and Kashmir whose husbands have been killed or maimed. It also emphasizes on making the targeting of women a war crime.\nHowever, to-date, the IOJ&K has become a constant failure for the world peace bodies for not being able to implement the resolutions passed several times in favour of the self-determination right of Kashmiris.\nUnder India’s Armed Forces Special Powers Act (AFSPA), the military and police forces have unlimited and unquestionable powers to carry out operations. The army is authorized to raid homes and arrest Kashmiris without warrant, destroy homes and villages, and shoot and kill unarmed civilians.\nApart of widows in Kashmir, the decades of conflict have also produced many ‘half-widows’ whose husbands have been made ‘disappeared’ but are not declared deceased, hence the term half-widows.\nThe untold and unheard story of Kashmir’s half-widows – the brave women carrying on despite all odds, exposes before the world their undeterred struggle and contribution towards a better future for the generations to come.\nThe resilience of these torchbearers women of Kashmir’s freedom struggle is unmatched despite their stories of pain of disappearance of their husbands by Indian security forces.\nUnaware of their husbands’ whereabouts, these women not only endure the grief that comes from being separated from their spouses, but are also constantly struggling to survive.\nLeft on their own, these Kashmiri women have to make ends meet besides suffering from trauma and constant fear of being mistreated by the occupying forces that may hunt, torture, and rape women.\nThe situation of widows and half-widows is an eye-opener for the world if it realizes that more needs to be done rather than mere observing an international day for them.",
  "retrievedAt": "2025-08-11T19:22:44.242Z"
}
