{
  "title": "Rs183.077 m allocated for 7 Communications Division projects under PSDP released",
  "link": "https://www.app.com.pk/national/rs183-077-m-allocated-for-7-communications-division-projects-under-psdp-released/",
  "date_published": "2020-06-22T22:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 23 (APP):The government had allocated Rs183.077 million for seven Communications Division projects other than those related to National Highway Authority under the Public Sector Development Programme (PSDP) for the fiscal year 2019-20 which had been issued.\nOut of these seven schemes, one belonged to National Highways and Motorway Police (NH&MP) whereas the remaining six were related to National Transport Research Centre (NTRC).\nIn the PSDP 2019-20, Rs88.704 million were allocated for the construction of Senior Superintendent of Police Office, Lines Headquarters and Beat for NH&MP at Gwadar which had been released.\nEstimated cost of the project was Rs289.5 million. Expenditure occurred till June 30, last year was Rs105.1 million and Rs184.4 million amount was throw forward amount.\nFor NTRC Origin-Destination Survey and Transport Demand project, Rs25 million had been allocated which had been released. Estimated cost of the project was Rs57 million and till June 30 last year Rs9.4 million had been spent on the project whereas Rs47.6 million was throw forward amount.\nRs17.541 million had been specified for the NTRC Operational Research Programme which had been released. Estimated cost of the project was Rs43.4 million and till the end of last fiscal year, Rs21.4 million had been spent on the project, and Rs21.9 million was throw forward amount.\nFor the NTRC Axle Load Survey Programme, an amount of Rs14.142 million had been allocated which had been released. Estimated cost of the project was Rs53 million out of which Rs26.7 million had been spent by the end of last fiscal year whereas Rs26.3 million was the throw forward figure.\nRs14.690 million were allocated for the NTRC Permanent Traffic Count Programme and the amount had been released.\nEstimated cost of the scheme was Rs 57.7 million and Rs12.8 million expenditure had occurred by the end of last fiscal year while Rs44.9 million remained throw forward amount.\nFor the Study of Freight Transport (Trucking) in Pakistan, Rs13 million had been earmarked which had been released. Estimated cast of the project was Rs 56 million which was throw forward amount.",
  "retrievedAt": "2025-08-11T19:22:59.386Z"
}
