{
  "title": "Pakistan making transition from geopolitics to geoeconomics: Senator Mushahid Hussain",
  "link": "https://www.app.com.pk/national/pakistan-making-transition-from-geopolitics-to-geoeconomics-senator-mushahid-hussain/",
  "date_published": "2022-06-20T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Senator Mushahid Hussain said Pakistan was in a strategic location where huge transformations and transitions were taking place, the peaceful rise of China, and Pakistan endeavoring to be the hub of regional connectivity through CPEC, by making a transition from geopolitics to geo-economics.\nHe said this in a key note address at an International webinar on Monday comprising experts from three continents, who called for greater cooperation and connectivity to combat common challenges like Climate Change, hunger, poverty, and the Pandemic, rejecting any notion of confrontation or a new Cold War.\nThe webinar was organized by the Pakistan-China Institute (PCI) under its flagship ‘Friends of Silk Road’ series, titled “Big Power competition in the post-pandemic World Order and the Belt and Road Initiative”, with speakers from Pakistan, China, Cambodia, Sri Lanka, UK, and the US, said a news release.\nMoreover, the Senator Mushahid Hussain said after 42 years of war in Afghanistan, which affected Pakistan directly, the country cannot be a party to any new conflict, confrontation, or a Cold War, as connectivity and cooperation are the need of the hour.\nSimilarly, he called for an end to the war in Ukraine, adding it is raising new tensions and has had unexpected consequences like food and fuel shortages.\nSenator Mushahid Hussain underlined the need for proactively promoting CPEC, which is the flagship of the Belt and Road Initiative (BRI), which he termed the most significant diplomatic and developmental initiative in the 21st Century.\nHe hoped all Asian countries would stay away from any Cold War. He said while the US was still clinging to a military-centric approach, as evident through the QUAD, AUKUS, and seeking a global NATO, conversely, China sought an economic-driven vision through connectivity and regional cooperation, particularly BRI which now has 145 countries and 32 international organisations in its fold.\nFormer Foreign Secretary, Ambassador (R) Tehmina Janjua, chaired the webinar while Senator Mushahid Hussain Sayed, Chairman of the Senate Defence Committee and the Pakistan-China Institute, made a keynote speech.\nIn her opening remarks, Ambassador Tehmina Janjua, former Pakistani Foreign Secretary, remarked that China had done miracles by uplifting 800 million people out of poverty.\nShe described the Belt and Road Initiative (BRI) as an opportunity to leverage the economic potential of the global South in the post-pandemic period.\nThe belief in western policy circles that the Belt and Road Initiative (BRI) has strategic rather than economic grounds has harmed China’s aspirations to build a prosperous community.\nShe described the US and its allies’ efforts to limit China on all fronts as ‘unfortunate,’ because they will have major ramifications not just for the global South, but also for the US and its allies, because such development impacts everyone, not just the one being targeted.\nFormer Sri Lankan naval commander, Jayanath Colombage debunked the debt-trap theory surrounding China’s Belt and Road Initiative. Sri Lanka owes less than 10% of its foreign debt to China, according to him, and that 10% is actually highly advantageous to Sri Lanka because it has produced enormous economic prospects for the country’s citizens.\nFurthermore, he urged aligning the Belt and Road Initiative with China’s domestic economic conditions so that both nations can secure high-quality BRI project development.\nMustafa Hyder Sayed, Executive Director of the Pakistan-China Institute said that the implications of big-power competition, whether intended or unintended, affect us all.\nThe growing uncertainty on the world stage has had an impact on Pakistan’s middle class. He stated that we must learn to balance our relationships and reprioritize economic and food security as the most important factors. According to him, CPEC cooperation has become a hallmark of the Belt and Road Initiative.\nDuring the COVID-19 epidemic, it proved to be a tenacious initiative. He explained that the economic alliance between Pakistan and China is “simply the icing on the cake” of their “unique connection,” which includes cultural and educational exchanges, with 20,000 Pakistani students studying in China.\nSuos Yara, Chairman of the National Assembly of Cambodia’s Commission on Foreign Affairs, International Cooperation, Media, and Information said that the foundations of economies have been shaken amid so much uncertainty on the global arena.\nSmaller countries, such as Cambodia, are facing numerous obstacles in attaining economic prosperity. Cambodia, he pointed out, is uninterested in picking sides since it considers itself a friend to all and an enemy to none.\nHe stated that the new world order must be inclusive, sustainable, and resilient. BRI, he said, is a platform for collaboration since it offers so many prospects, such as infrastructure upgrades and breathing room for partner countries’ economies.\nProf Wang Wen, Executive Dean of Chongyang Institute for Financial Studies at Renmin University of China, said that China will become the largest consumer market of the world by 2023. This provides opportunities for enhanced economic growth in developing countries.\nMr. Keith Bennett, co-editor of Friends of Socialist China, stated that with the fall of the Berlin Wall over 31 years ago, people in the west voiced hope that modern democratic values would triumph in the global South, resulting in economic success for the region, but this did not occur.\nThis webinar lasted for 90 minutes. The speeches were followed by comments and a question/answer session. A diverse audience of students, scholars, and the media took an active part in this webinar.",
  "retrievedAt": "2025-08-11T15:07:00.584Z"
}
