{
  "title": "PMC takes stringent measures on medical negligence cases",
  "link": "https://www.app.com.pk/national/pmc-takes-stringent-measures-on-medical-negligence-cases/",
  "date_published": "2022-06-20T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Pakistan Medical Commission (PMC) has taken stringent measures against healthcare practitioners, medical and dental educational institutes, and associated organizations to protect the public from medical negligence and harm.\nAccording to the spokesperson of PMC, disciplinary actions have been taken against healthcare practitioners which include revoking of licenses, suspension of practice, and monetary fines to not only safeguard the public but instill a sense of accountability in all clinical practitioners in Pakistan\nHe said that the commission was working diligently to implement benchmarks set to ensure standardized quality medical and dental education in Pakistan. Still, in its nascent state, PMC has taken strides in the improvement of medical and dental education in Pakistan.\nThe Pakistan Medical Commission, since its inception, has achieved landmark targets that have positively impacted the quality of educational institutions as well as licensed practitioners and have been highly appreciated by all stakeholders.\nHe added, out of landmark targets that were the top priority of the PMC were quick online service, online application form, Issuance of official documents like license, good standing certificates, etc. within two days of application, rapid response to online registered complaints, no person to person contact so minimal chances of corruption, implementation of equal stipend to private graduates, implementation of house job policy, grading of medical colleges, issuance of a number of house job seats in different teaching and nonteaching hospitals, give and implement policy related to new medical college registration and upgrading of previously opened private medical colleges, national computer-based MDCAT, blacklisting of colleges not maintaining the Criteria of PMC, give licensing pathways to foreign graduates.\nHe said that PMC with its tireless efforts and determination to further enhance its repute of medical and dental programs in Pakistan and to facilitate all its stakeholders nationally and internationally successfully converted the old licensing system to a digital platform which has enabled doctors the absolute ease to apply online and receive their licenses at their home within a fortnight as against what used to take over six months in the past.\nFor the first time, national-level medical entrance (MDCAT) and licensing exams (NLE) have been converted to computer-based exams, ensuring the quality of the result and transparent-based admission to medical colleges.\nThis further ensures that only safe doctors are granted a license and are permitted to treat patients. In addition to this PMC also implemented Paid House Job policy for graduates to secure their basic right for a house job stipend.\nThe spokesperson said that PMC has offered scholarships to over 570 students admitted to medical and dental colleges while it has Implemented a transparent digital system, including, online digital portals for students’ admissions, registrations, exams, online digital portals for doctors’ licenses, good standing certificates, verifications, faculty registrations, online digital portals for colleges, universities and teaching hospitals’ admissions, data for inspections, inspection software for automated inspections to ensure transparency and Bio-metric verification of doctors.\nThe medical commission made an interactive, accessible, and user-friendly website for all so that any relevant information, policies, notifications, and regulations can be accessible and user-friendly ensuring its updated availability.\nFollowed by this, PMC also successfully implemented an Internal operational cloud management system, an online payment facility for ease for all stakeholders, an ERP System, Complaint Management System, or portal for swift redressal of complaints and queries.\nHe said that PMC is comprised of highly qualified doctors and professionals from all provinces having professional excellence in their respective fields who have been working vigorously to improve the quality of medical education in Pakistan and to strengthen the commission as a national regulator.",
  "retrievedAt": "2025-08-11T15:07:01.644Z"
}
