{
  "title": "Pakistan needs to brace for heavy monsoons, Sherry warns",
  "link": "https://www.app.com.pk/national/pakistan-needs-to-brace-for-heavy-monsoons-sherry-warns/",
  "date_published": "2022-06-20T14:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Federal Minister for Climate Change, Senator Sherry Rehman on Monday sent out a warning for the upcoming monsoon season and urged the national and provincial disaster management authorities and relevant local authorities to take all-out precautionary measures to cope with possible disastrous impacts of the expected monsoon rains.\n“Pakistan will experience monsoon rains until at least August 2022, during which the rainfall is expected to be above normal in Punjab and Sindh,” the minister said in a statement issued here.\nShe warned, “the country will be a part of a global La Niña weather pattern which refers to the large-scale cooling of the ocean surface temperatures in the equatorial Pacific Ocean. The early onset of monsoons after a debilitating heat wave across South Asia has already wreaked havoc in parts of India and Bangladesh. All forecasts predict that there will be an overall tendency for above-normal rains over the country during the forecast period.”\n“Geographically, above-normal rainfall is most likely along the foothills of the Himalayas, Azad Jammu & Kashmir, Gilgit Baltistan, and central parts of the Punjab region,” she added.\nAt the same time there is a high possibility of riverine floods in the major rivers so all precautions need to be taken. Urban areas will also likely face a cascade of threats from torrential rains. There is a clear risk of urban flooding across major cities including Karachi, Lahore, Multan, Peshawar, and Islamabad.\nOver the last two years in fact, there has been a rising pattern of urban flooding in these cities and therefore provinces should be on high alert for serious damage to lives and livelihoods of the people as well as public infrastructure.”\nUrging upon the provincial governments, management authorities, and individuals to take caution during the rainy season, she said “provinces must exercise vigilance and preparedness for the upcoming monsoon to brace for low to high-intensity floods.\nThere is also some prediction that Pakistan could even experience a similar scale of floods that occurred in 2010 when one-fifth of the country was inundated. Timely advisories have been issued to provincial governments on waste collection, cleaning, and management of storm drains amid early warnings for flash floods across vulnerable locations”.\nShe recommended the district-wise contingency plane with mobilization of staff and resources for immediate flood response.\nThe Federal Minister said, at the citizen safety level, individuals can take personal safety measures like, driving slowly to react better to road conditions, avoiding flooded areas and remaining abreast with the weather situation, staying away from accumulated water around electrical installations. It is advised that people stay away from wet electrical switches, and avoid standing under or near billboards, poles, and trees. We will continue to deal with such “unprecedented” events due to changes in precipitation, heat, and glacier melt runoffs in the coming years due to climate change, so timely measures will ensure everyone’s safety.\nThe Climate Change Ministry also has issued a GLOF sensitivity alert to the authorities in Gilgit Baltistan and KP owing to the prevailing weather conditions triggered by global warming. The Upper Chitral GLOF event that occurred over the weekend is being watched by all authorities and no loss of lives was reported due to timely warnings.",
  "retrievedAt": "2025-08-11T15:07:03.313Z"
}
