{
  "title": "Tarar challenges PTI to hold open debate over NAB Act",
  "link": "https://www.app.com.pk/national/tarar-challenges-pti-to-hold-open-debate-over-nab-act/",
  "date_published": "2022-06-20T15:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Minister for Law and Justice Azam Nazir Tarar on Monday challenged the PTI leaders to hold an open debate with him over the National Accountability (Second Amendment) Act as only anomalies and flaws in the NAB law had been removed.\nResponding to a point of order in the Senate, Azam Tarar said the Pakistan Tehreek-e-Insaf (PTI) leadership was criticising the act without even reading it. Over 85 percent amendments in the act were same, which were incorporated in the two ordinances promulgated during the PTI led government.\nHe said the National Accountability Bureau (NAB) law had been used by rulers for political engineering and arm twisting of opponents for over 20 years.\nCiting an example in that regard, he said a government having only one vote majority was installed after arm twisting and political engineering through NAB. The Pakistan Peoples Party-Patriot and the Pakistan Muslim League-Quaid were created through coercing and arm twisting by the then NAB authorities, he added.\nThe minister said an expatriate Pakistani, who wanted to serve Pakistan, was inducted in the Saad Pani Project. But unfortunately the government was changed soon after his induction and he was imprisoned and remained in jail for one and a half years, and he was given bail by the court as NAB failed to prove his corruption.\nWho was responsible for the ordeal he suffered from though he was innocent, he asked.\nTarar said the NAB Act was passed by the National Assembly after a thorough discussion of over five hours on its each clause.\nHe said the NAB Act was indeed an NRO (National Reconciliation Ordinance) like concession for Shahzad Akbar, who had illegally benefitted a property tycoon for Rs 54 billion. The new NAB law was also an NRO for Usman Buzdar and Farah Gogi, who committed corruption of billions of rupees, he added.\nAbout the erstwhile Federally Administered Tribal Areas (FATA), the minister said the government was taking all possible steps to uplift the living standard of the people of merged districts of Khyber Pakhtunkhwa, and assured that the budget for the districts would not be curtailed.",
  "retrievedAt": "2025-08-11T15:07:00.761Z"
}
