{
  "title": "Strong economic discipline, management required for economic growth: Ahsan",
  "link": "https://www.app.com.pk/national/strong-economic-discipline-management-required-for-economic-growth-ahsan/",
  "date_published": "2022-06-20T12:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 20 (APP): Federal Minister for Planning, Development, Reforms and Special Initiatives Ahsan Iqbal on Monday said that economic growth in Pakistan requires strong fiscal discipline and economic management.\n“We have to move towards export led growth and bring the tax to Gross Domestic Product (GDP) ratio closer to the countries of the region,” he said.\nHe expressed these views while addressing the seminar on ‘Unblock Pakistan’s Economic Potential’ organized by Islamabad Policy Research Institute (IPRI).\nHe said that Pakistan was lagging behind the other countries of the region as our tax to GDP ratio had never been above 12%.\nHe lamented that Pakistan was also lagging behind in exports as compared to other regional countries including India and Bangladesh.\nAhsan said that at present Foreign Direct investment (FDI) in Pakistan was only $ 1.5 billion while in Vietnam it was $ 30 billion.\nHe pointed out that Pakistan’s savings and investment ratio was very low which needs improvement.\nHe said we have not paid attention to human resource development, the dream of economic development cannot be fulfilled on 50% education.\n“We have to make our youth skilled and educated. Because of the CPEC project, we got the attention of the world. The world wanted to invest here,” he said.\nWe took $29 billion from China and we spent Rs. 2,300 billion on CPEC projects from our development program.\nHe said that we have given a lasting infrastructure to Pakistan.\nAhsan Iqbal said that the government is budgeting the deficit at the moment and the current deficit is forcing us to take new loans.\nHe said we have set a revenue target of Rs. 7000 billion and in addition there will be 2000 billion non-tax revenue.\nAhsan Iqbal said that this year we have to repay 4000 billion loans, in addition, Rs 1,500 billion is our defense expenditure and Rs 500 billion is our government expenditure.\nHe said that our annual pension expenditure is Rs. 530 billion of which our defense pension defense annual expenditure is Rs. 400 billion and civilian Rs.130 billion.\nIn addition, there is an annual development program of Rs. 700 billion while Rs. 1200 billion goes to our provinces.\nHe said that the government is giving subsidies of Rs. 700 billion this year.\nHe said that in order to balance our annual budget, we have to move towards export led growth so that the country’s economy is sustainable and inclusive.",
  "retrievedAt": "2025-08-11T15:07:06.682Z"
}
