{
  "title": "PM vows economic turnaround through reforms, meritocracy - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says govt removed ‘corrupt FBR officials’ without yielding to pressure or favouritism\n• Notes investment in youth essential for Pakistan’s future success\n\nISLAMABAD: Prime Minister Shehbaz Sharif on Saturday reaffirmed the government’s commitment to achieving a complete economic turnaround through long-overdue reforms, structural changes and prioritising meritocracy.\n\nAddressing a group of Pakistani students enrolled in leading global educational institutions and selected for the government’s internship initiative ‘Uraan Pakistan’, the prime minister said that when the current government took office in 2023, Pakistan was facing a serious threat of default and its future was hanging in the balance.\n\n“The majority believed Pakistan would default, while only a few were optimistic we would avoid disaster,” he said, adding that he held marathon discussions with the IMF managing director and gave firm assurances that Pakistan would not default and would stay committed to the Fund’s programme.\n\nHe said that the economy was in a bad shape at that time, with inflation reaching 38 per cent while the policy rate was hovering at 22pc. The PM, in his remarks broadcast on national TV channels, further said that they had a huge responsibility to work together with unity and sincerity to steer the country out of the crisis.\n\n“The joint efforts have paid off as now the policy rate has dropped to below 11pc. The Uraan Pakistan programme has also taken off,” he added.\n\nHe also referred to reforms and digitisation of the Federal Board of Revenue (FBR), saying the government had removed corrupt officials without yielding to pressure or favouritism.\n\n“To root out corruption from the FBR, I had a clear vision and took unprecedented decisions, ignoring the culture of favouritism,” he said.\n\nThe prime minister noted that earlier, the digitisation process in FBR had only existed on paper, as no practical steps were taken, blaming corrupt and shrewd elements for misleading the system.\n\nNow, he said, digitisation was the hallmark of FBR, where work had been converted from paper-based to digital, with multiple initiatives including AI and faceless interaction.\n\nAs a result of the measures, revenue collection in one sector had jumped from Rs12bn to more than Rs50bn in one year, highlighting the extent of previous tax evasion, he maintained.\n\n“We face a long and thorny journey, with mountain-like obstacles, but I assure the nation we will not shy away from fulfilling our responsibilities.”\n\nUnderscoring the importance of the country’s youth, he said their role is key to Pakistan’s success, and any investment in them is an investment in the nation.\n\nResponding to students’ queries, the prime minister said that due to climate change, Pakistan had suffered significantly during the 2022 floods, with the economy facing $30 billion in losses, despite the country’s minimal contribution to the global greenhouse effect.\n\nTo another question, he said that Pakistan faced India’s uncalled aggression against the backdrop of the Pahalgam incident in May. “I proposed an impartial international investigation, but India never responded,” he said.\n\nHe claimed that as a result of Indian aggression, 55 Pakistanis were killed. In self-defence, Pakistan shot down six Indian aircraft. “On May 9 and 10, following India’s attack, Pakistan responded with full might and taught the enemy a lesson,” he said.\n\nThe prime minister praised the armed forces for their professionalism and bravery, stating that Pakistan had won the conventional war. He reiterated that Pakistan’s nuclear programme is solely for peaceful purposes and self-defence.\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/130846490fbd455.png",
  "retrievedAt": "2025-08-17T20:22:25.049Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923847/pm-vows-economic-turnaround-through-reforms-meritocracy",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T00:29:35.000Z"
}
