{
  "title": "Enrollment in non-formal education sector increases by 20pc: report - Pakistan - DAWN.COM",
  "author": null,
  "content": "Enrollment in the non-formal education (NFE) sector increased by 20 per cent, according to the “National Non-Formal Education Statistical Report” for 2023-24 released on Sunday.\n\nPakistan faces a significant education crisis, with an estimated 25.37 million out-of-school children (OOSC) aged 5–16. NFE serves as a vital alternative, providing flexible and accessible learning opportunities for these children.\n\nAccording to the Economic Survey of Pakistan 2024-25, the segregated data showed that the literacy rate was 60.6pc — with men at 68pc compared to 52.8pc among women. During the first three quarters of the ongoing financial year, the education-related spending decreased 29.4pc, dropping to Rs899.6 billion from Rs1,251.06bn.\n\nAccording to the report by the Pakistan Institute of Education (PIE), “The number of NFE centres across the country has reached 35,427, where more than 1.29 million students are studying, which shows a 20pc increase compared to the previous year.”\n\nA total of 57pc of the students are girls, a development which the report termed as “encouraging progress towards gender balance”, adding that 82pc of teachers are women, reflecting their inclusion in the education system.\n\nThe report describes NFE as a “second chance education” model that is cost-effective, flexible, and socially inclusive. The monthly cost per child is Rs1,000 to Rs1,500, which is many times less than that of formal education, it adds.\n\nThe report highlights the significant disparity in enrollment rates by region and gender, saying, “According to the economic survey, the literacy rate of women is much lower than that of men, especially in rural Balochistan, where only 31pc of women are literate.”\n\nEarlier in the week, “Pakistan’s Non-Formal Education Report 2023–24,” was launched at Allama Iqbal Open University (AIOU).\n\n“This number [of OOSC] has risen alarmingly, influenced by the impacts of COVID-19 and recent floods. Recent years have witnessed significant developments in the NFE sector,” said the report.\n\nThe report recommended the expansion of accelerated learning programmes (ALP), prioritising the expansion of ALP (Middle-Tech) programmes due to their high retention rates (70pc) and their ability to provide both academic and vocational skills.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/111032306d4824d.jpg?r=103242",
  "retrievedAt": "2025-08-17T20:20:01.358Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923955/enrollment-in-non-formal-education-sector-increases-by-20pc-report",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T17:04:16.000Z"
}
