{
  "title": "KP Assembly’s speaker questions move to disqualify Punjab lawmakers - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Speaker of the Khyber Pakhtunkhwa Assembly Babar Saleem Swati has insisted that invoking Article 63(2) of the Constitution to disqualify opposition members of the Punjab Assembly has serious constitutional implications and could undermine the autonomy of elected assemblies.\n\n“The use of Article 63(2) [of the Constitution] will not only constitute a misapplication of Constitutional provisions but will also set an unrestrained and troubling precedent, potentially affecting the sanctity of legislative forums across the country,” Mr Swati noted in a letter to Speaker of the Punjab Assembly Malik Ahmad Khan.\n\nOn June 27, the Punjab Assembly’s speaker ordered the suspension of 26 opposition MPAs for 15 sessions after their protests disrupted the speech of Chief Minister Maryam Nawaz and caused chaos in the house.\n\nDays later, he filed a disqualification reference against them with the Election Commission of Pakistan. Of those MPAs, 17 were listed as members to the Sunni Ittehad Council, which the PTI-affiliated election candidates joined last year after their party was deprived of its election symbol of cricket bat. However, at least eight others were declared PTI lawmakers.\n\nInsists invoking Article 63(2) of Constitution can undermine legislative autonomy\n\nIn the letter, a copy of which is available with Dawn, Mr Swati said that he had come to know that in exercise of powers conferred upon the speaker under Rule 210(3) of the Rules of Procedure of the Provincial Assembly of the Punjab, 1997, read with Rule 223 of the ibid Rules, an order was issued on June 27 to suspend 26 members of the Punjab Assembly from the opposition benches for 15 sittings of the assembly.\n\n“It has also been reported in print and electronic media that the treasury benches have filed a disqualification reference under Article 63(2), read with Article 113, of the Constitution before your good office against the said 26 members, and proceedings to that effect may be initiated subsequently,” Mr Swati formally told his counterpart in Punjab.\n\nHe insisted that Rule 210(3) of the rules served the vital purpose of maintaining order and decorum within the house, and compliance with rules of procedure was essential for upholding constitutional governance.\n\n“However, to invoke Article 63(2) in this context raises serious constitutional concerns. The disqualification clause should not be used as a punitive measure for conduct within the legislative chamber, particularly when such conduct has already been addressed through suspension under the Assembly’s Rules of Procedure,” he said.\n\nMr Swati said that invoking Article 63(2) against the opposition lawmakers risked undermining the autonomy and dignity of elected assemblies.\n\n“Proceedings within the house and the privileges of its members are protected under Articles 66 and 69, read with Article 127 of the Constitution. These provisions affirm the inviolability of legislative proceedings and guard against external interference in the conduct of business within the House,” he noted in the letter.\n\nThe KP Assembly’s speaker said the moment called for the promotion of democratic norms and culture at all levels of governance.\n\nHe said that it was imperative that all elected representatives, along with political leadership across party lines, adopted a constructive and statesmanlike approach.\n\n“We must work to reduce political polarisation, foster reconciliation and reinforce the credibility of our democratic institutions, such action, vis-a-vis the constitutional mandate and disciplinary authority of the provincial assembly, would set an unprecedented and unconstitutional precedent, with far-reaching implications for the future functioning of legislative assemblies across the country, to be reconsidered hopefully,” he noted in the letter to the Punjab Assembly’s speaker.\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/281530079017bd5.png?r=165214",
  "retrievedAt": "2025-08-17T20:21:18.954Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923782/kp-assemblys-speaker-questions-move-to-disqualify-punjab-lawmakers",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T00:30:08.000Z"
}
