{
  "title": "Emergency vaccines slash deaths by 60pc: study - World - DAWN.COM",
  "author": null,
  "content": "GENEVA: Emergency vaccination during outbreaks of diseases like cholera, Ebola and measles have over the past quarter-century reduced deaths from such illnesses by nearly 60 per cent, according to a new study.\n\nA similar number of infections are also believed to have been prevented, while billions of euros have been generated in estimated economic benefit.\n\nThe Gavi vaccine alliance, which backed the study, said it collaborated with researchers at Burnet Institute in Australia to provide the world’s first look at the historical impact of emergency immunisation efforts on public health and global health security.\n\n“For the first time, we are able to comprehensively quantify the benefit, in human and economic terms, of deploying vaccines against outbreaks of some of the deadliest infectious diseases,” Gavi chief Sania Nishtar said in a statement. “This study demonstrates clearly the power of vaccines as a cost-effective countermeasure to the increasing risk the world faces from outbreaks.”\n\nThe study, published this week in the British Medical Journal (BMJ) Global Health, examined 210 outbreaks of five infectious diseases — cholera, Ebola, measles, meningitis and yellow fever — in 49 lower-income countries between 2000 and 2023.\n\nVaccine roll-outs in these settings had a dramatic impact, with the study showing they reduced both the number of infections and deaths by almost 60pc across the five diseases. For some of the diseases the effect was far more dramatic.\n\nVaccination was shown to decrease deaths during yellow fever outbreaks by a full 99pc, and 76pc for Ebola.\n\nAt the same time, emergency vaccination significantly reduced the threat of outbreaks expanding.\n\nIt also estimated that the immunisation efforts carried out during the 210 outbreaks generated nearly $32bn in economic benefits just from averting deaths and years of life lost to disability.\n\nThat amount was however likely to be a significant underestimate of overall savings, it said, pointing out that it did not take into account outbreak response costs or the social and macro-economic impacts of disruptions created by large outbreaks.\n\nThe massive Ebola outbreak that hit West Africa in 2014, before the existence of approved vaccines, for instance saw cases pop up worldwide and is estimated to have cost the West African countries alone more than $53bn.\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/25143059d9163fc.jpg?r=143207",
  "retrievedAt": "2025-08-17T20:22:23.822Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923848/emergency-vaccines-slash-deaths-by-60pc-study",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T00:29:30.000Z"
}
