{
  "title": "PTI brass gathers in Lahore to kick-start Aug 5 movement - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Gandapur leads KP lawmakers to Punjab’s capital\n• Gohar says leadership will also take up suspension of 26 MPAs\n\nLAHORE: The PTI top leadership arrived in Lahore on Saturday to devise a strategy for its nationwide protest, which will reach its crescendo on Aug 5 to seek the release of party founder Imran Khan, with Khyber Pakhtunkhwa Chief Minister Ali Amin Gandapur describing the Lahore visit as the formal launch of the movement.\n\nBefore their departure, the party leaders held a meeting in Islamabad to discuss several issues, including the potential disqualification of the party’s Punjab Assembly lawmakers who had been suspended by the speaker.\n\nIn the evening, a caravan of KP lawmakers led by CM Gandapur, as well as Opposition Leader in Punjab Assembly Malik Ahmad Khan Bhachar reached Lahore via G.T. Road. During a layover in Jhelum, the KP CM said that the protest had been launched, and the parliamentary meeting in Lahore would mull the final protest strategy to step up the campaign ahead of the two-year anniversary of Imran Khan’s imprisonment on Aug 5.\n\nPTI interim chairman Barrister Gohar Ali Khan said the party’s parliamentarians were going to Lahore for a meeting and added they would discuss the issue of 26 MPAs, suspended by the Punjab Assembly speaker. “The Punjab government has been unleashing fascism for the past two years, and now it is time that common sense should prevail,” he stressed.\n\nThough there were reports that the Punjab police could block PTI parliamentarians’ entry into Lahore, the leaders had said they would stage a sit-in at the blocked point. However, the parliamentarians, led by CM Gandapur, made a smooth entry and camped at a farmhouse in Raiwind, Lahore.\n\nThe police, however, did raid party leaders and workers’ homes throughout the day and even went to the Shahdra Morr – Lahore’s entry point on G.T. Road – and took into custody five leaders, including Yasir Gillani from among those gathered to welcome the PTI caravan.\n\nAt a late-night party meeting in Raiwand, CM Gandapur told parliamentarians that they had reached the ‘political hub of the country’ to launch their protest campaign. “Any campaign launched from Lahore earns success and this too will be successful across the country,” he asserted.\n\nAsserting that party leader Imran Khan is in jail for no valid reason, CM Gandapur advised party leaders to move forward through consultations and plans in respective jurisdictions to step up the protest campaign. “All the provinces should prepare their protest plans and implement them in line with their local issues and take the protest campaign to its peak by Aug 5,” he asserted.\n\nHe said the establishment had been ruling the country for decades and imposed multiple martial laws as part of different experiments, destroying the country. “The establishment this time has imposed a new kind of martial law, which is not official, but wielding every kind of power and pressure,” he observed and added that it destroyed the country but the perpetrators were not even showing any remorse.\n\nAt the meeting, Mr Bhachar said Punjab could not warmly welcome CM Gandapur because a “fascist government” was ruling Punjab that even lacked parliamentary as well as social norms. Mr Bhachar said the party’s 11 MPAs were suspended after Punjab Chief Minister Maryam Nawaz came to the assembly and her second visit led to the suspension of 26 members. “This clearly shows the level of fear the Punjab government is facing from PTI’s 107 tigers in the Punjab Assembly,” he asserted.\n\n“Though the PTI leaders and workers are facing thousands of FIRs, the party is all set to launch a massive protest campaign aimed at the release of Imran Khan, his wife and all political leaders,” he added.\n\nWhile the PTI parliamentarians have camped in Lahore, the party’s Punjab chapter, led by Aliya Hamza Malik, had already mobilised party workers across the province and assigned duties to step up the protest campaign and take to its pinnacle on August 5.\n\nBefore leaving for Lahore, the party’s interim chairman Barrister Gohar Khan, while talking to media persons, said that the party had already sent a letter to the provincial government stating that it would hold a meeting in Lahore. However, he made it clear that the party was not planning to hold any rally or public meeting in the provincial capital.\n\nIkram Junaidi in Islamabad also contributed to this report\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T20:22:29.451Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923856/pti-brass-gathers-in-lahore-to-kick-start-aug-5-movement",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T00:29:25.000Z"
}
