{
  "title": "Several locations cleared of clutter across Lahore - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: In a move to transform Lahore into a cleaner and encroachment-free city, the district administration has intensified its anti-encroachment campaign across key locations.\n\nOver the past 24 hours, 27 trucks loaded with confiscated goods were removed from various areas, including Hajji Camp, Nolakha, Shanghai Road and Nabha Road. Both permanent and temporary illegal structures were dismantled during the operation.\n\nThe administration also launched a campaign to to eliminate visual pollution, with banners and obstructive displays targeted for removal.\n\nDeputy Commissioner Syed Musa Raza said that these targeted actions were already having a visible impact, contributing to improved urban accessibility, reduced visual clutter and a healthier environment for residents.\n\nDrive against profiteering, corruption, dengue also initiated\n\nA statement said the district administration had earlier initiated a crackdown against profiteering and strict enforcement of official price lists across local markets would be ensured. Under the drive, assistant commissioners and price control magistrates had been deployed in the field to monitor pricing and guarantee compliance. Essential commodity prices saw marked stability in rates owing to consistent enforcement efforts, it added.\n\nThe DC reiterated that profiteers and hoarders would face severe consequences, with no leniency permitted.\n\nMeanwhile, the statement said the district administration had terminated volunteers from the Civil Defence unit embroiled in graft allegations.\n\nIt said that Civil Defence member were barred from conducting inspections in a personal capacity and urged citizens not to cooperate with unauthorised checks. Assistant commissioners were tasked with monitoring field activities to uphold strict compliance with anti-corruption protocols, it added.\n\nThe statement said the administration was rolling out reforms aimed at streamlining operations, improving accountability and fostering a corruption-free environment.\n\nThe Lahore administration also conducted a citywide dengue prevention campaign aimed at conducting comprehensive inspections, swift larva disposal, and enhanced public protection measures.\n\nThe statement said assistant commissioners remain deployed across field locations alongside dedicated teams for checking dengue larvae at residential and high-risk sites, including graveyards. Spraying was mandated not only at infected households but also in ten surrounding homes to ensure containment, it added.\n\nThe statement said that all departments had been instructed to coordinate their efforts to eliminate potential breeding grounds and improve health safety across Lahore.\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/1311362089b3aa7.png",
  "retrievedAt": "2025-08-17T20:20:49.811Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923886/several-locations-cleared-of-clutter-across-lahore",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T03:54:06.000Z"
}
