{
  "title": "Iranian president lightly injured in Israeli strike during war last month: report - World - DAWN.COM",
  "author": null,
  "content": "Iranian President Masoud Pezeshkian sustained minor leg injuries during an Israeli strike that targeted a meeting of Iran’s Supreme National Security Council during the war between both countries last month, the Fars News Agency reported.\n\nAccording to the report on Saturday, the missile attack occurred on June 17 as top Iranian leaders, including the heads of the three branches of government, were meeting in a secure lower level of a building in western Tehran.\n\nThe strike involved six projectiles that hit the entrances and exits of the building, an approach similar to an assassination operation on Hezbollah leader Hassan Nasrallah, Fars said.\n\nOfficials managed to evacuate using a pre-planned emergency hatch, the agency reported, noting that Pezeshkian was “injured during the evacuation but was able to exit safely”.\n\nThe report also said Iranian authorities suspect a possible internal leak, citing the accuracy of the strike.\n\nFars criticised Western and Israeli-affiliated media outlets for ignoring a “blatant act of state terrorism” while condemning Iranian leaders’ religious rulings against figures like US President Donald Trump and Israeli Prime Minister Benjamin Netanyahu.\n\nA 12‑day armed conflict between Israel and Iran erupted on June 13 after Tel Aviv launched airstrikes on Iranian military, nuclear and civilian sites, killing at least 606 people and injuring 5,332, according to Iran’s Health Ministry.\n\nTehran launched retaliatory missile and drone strikes on Israel, killing at least 29 people and wounding more than 3,400, according to figures released by the Hebrew University of Jerusalem.\n\nThe conflict came to a halt under a US-sponsored ceasefire that took effect on June 24.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/082234547cc77ec.jpg?r=230001",
  "retrievedAt": "2025-08-17T20:20:31.919Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923928/iranian-president-lightly-injured-in-israeli-strike-during-war-last-month-report",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T11:19:23.000Z"
}
