{
  "title": "Islamabad High Court delivers verdict nearly three years after reserving it - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Decision in a vehicle tampering case violates SC’s 90-day guideline\n• Judgement was first reserved in May 2022 while re-hearing ordered in Dec 2022\n\nISLAMABAD: The Islamabad High Court (IHC) has set a unique precedent by delivering a judgement nearly three years after reserving it in a vehicle tampering case, contravening the Supreme Court’s binding rulings on timely dispensation of justice.\n\nIn a writ petition No 1311/2021, petitioner Marya Fiaz challenged the Excise and Taxation Department’s seizure of her vehicle Toyota Corolla Model 1990 over alleged chassis number tampering.\n\nThe petitioner, a schoolteacher, bought the old vehicle, which was previously sold out multiple times over the years.\n\nWhen her husband visited the Excise and Taxation Department for the registration of the vehicle, authorities claimed the chassis number appeared to be tampered with.\n\nInterestingly, IHC Justice Sardar Ejaz Ishaq Khan reserved the judgement on May 12, 2022 after a testimony from the Police Chemical Examiner, Khalid Iqbal, who stated that forensic tests involving hydrochloric acid, copper sulfate and water revealed cut-and-weld marks on the chassis. Crucially, he admitted: “Aging analysis cannot be carried out… It could not be ruled out that the tampering was done by previous owners.”\n\nHe clarified that while forensic science could prove tampering occurred but it could not determine its exact time. Arguments concluded on the same day, and the bench reserved its judgement.\n\nHowever, Justice Khan ordered a re-hearing and reserved the judgement again on December 2, 2022, as per details available on the IHC’s official website.\n\nThe judgement was finally announced on July 11, 2025, almost three years after the matter was first reserved. The delay directly contradicts the Supreme Court’s landmark guidelines that bind the high courts to pronounce judgements within 90 days of the conclusion of hearings. If delayed, judges must record reasons and order a re-hearing.\n\nThe apex court ruled that in certain circumstances, the time may be extended to a month, however judgements delivered beyond 120 days are “weakened in quality and efficiency” and risk being declared invalid.\n\nSC highlighted Order XX, Rule 1(2) of the Civil Procedure Code, according to which judgments of trial courts must be given within 30 days of hearing closure.\n\nThe Supreme Court has unequivocally stated that “justice delayed is justice denied”, adding: “Judgements rendered after inordinate delays may be questioned as meaningless and illusionary… They violate the rule of audi alteram partem [hear both sides].”\n\nThe three-year delay undermines the court’s ability to “recall legal and factual arguments precisely”.\n\nThe Supreme Court warns that tardy judgements “frustrate the purpose of the judicial branch” and erode the state’s equilibrium.\n\nLegal experts said that IHC’s inaction sets a dangerous precedent despite the apex court’s directive that judgments beyond 120 days should be “set aside”.\n\nThey urged the IHC to either deliver the verdict immediately or order a re-hearing as per the Supreme Court guidelines.\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/04/200802460629768.jpg?r=080254",
  "retrievedAt": "2025-08-17T20:21:27.574Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923796/islamabad-high-court-delivers-verdict-nearly-three-years-after-reserving-it",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T00:30:01.000Z"
}
