{
  "title": "Sinner downs Alcaraz to win first Wimbledon - Sport - DAWN.COM",
  "author": null,
  "content": "Jannik Sinner downed defending champion Carlos Alcaraz 4-6, 6-4, 6-4, 6-4 on Sunday to win his first Wimbledon title, gaining sweet revenge for his painful defeat in the French Open final.\n\nThe world number one is the first Italian to win at the All England Club and now has four Grand Slams to his name at the age of 23.\n\nThe tennis world has been captivated by the emergence of the new rivalry to follow the storied “Big Three” era of Roger Federer, Rafael Nadal and Novak Djokovic.\n\nSinner and two-time defending Wimbledon champion Alcaraz have now shared the past seven Grand Slam titles between them, with the Italian winning four of those.\n\nDefeat in Paris last month was a bitter blow for Sinner, who led by two sets and squandered three match points in the final.\n\nPrior to Sunday’s victory, he had lost five consecutive times against Alcaraz, including the final of the Italian Open in the first tournament he played after returning from a three-month doping ban.\n\nBut this time, he turned the tables in impressive fashion.\n\nBoth players were solid on serve until the fifth game, when Alcaraz sprayed a forehand long to hand Sinner the first break of the match.\n\nBut the Spaniard levelled at 4-4 to the delight of the Centre Court crowd, which included Prince William and his wife Catherine, Princess of Wales.\n\nSinner double-faulted to hand Alcaraz a second set point.\n\nThe Italian laced a searing forehand down the line, but Alcaraz produced a magical backhand winner, pointing his finger to his ear as the crowd rose to their feet.\n\nSinner, still wearing a protective white sleeve after his nasty fall in his fourth-round match against Grigor Dimitrov, broke in the first game of the second set and led 3-1 after play was briefly halted by a flying cork.\n\nSinner shook his racket after winning the first point as he served for the set and was rewarded with cheers before levelling the match with a whipped forehand.\n\nThe third set was a tense affair that went with serve until the ninth game when Sinner broke as Alcaraz slipped over on the baseline, and he went 2-1 up.\n\nThe momentum was now all with Sinner and he broke again in the third game of the fourth set to take the match by the scruff of the neck.\n\nThe chance was always there that Alcaraz would produce the magic he found at Roland Garros, but Sinner stayed ice-cool.\n\nThe Spaniard had two break points to hit back in the eighth game, but Sinner shut the door impressively.\n\nSinner stepped up to serve for the championship amid a cacophony of noise, staying focused to seal the deal on his second championship point.\n\nThe Italian cruised through the first three rounds at Wimbledon, losing just 17 games — equalling an Open era record set in 1972. But he got lucky in the fourth round against inspired Bulgarian 19th seed Dimitrov, who was leading by two sets when he suffered an injury that forced him to quit.\n\nSinner got back into the groove against 10th seed Ben Shelton in the quarter-finals before demolishing seven-time champion Djokovic in the last four.\n\nAlcaraz had been aiming to become just the fifth man in the Open era to win three consecutive Wimbledons after Bjorn Borg, Pete Sampras, Federer and Djokovic.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/132350415da85c9.jpg",
  "retrievedAt": "2025-08-17T20:19:53.306Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923961/sinner-downs-alcaraz-to-win-first-wimbledon",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T18:47:15.000Z"
}
