{
  "title": "Travel well, my friend Zubeida - Pakistan - DAWN.COM",
  "author": null,
  "content": "SINCE the news of Zubeida Mustafa’s passing, a flood of tributes has poured in, in which those whose lives she touched have spoken eloquently about the iconic, towering figure of the incredible journalist and rights advocate.\n\nTo me, Zubeida was my senior, my colleague and my friend, and an incredible woman and human being. She brushed aside daunting personal and professional challenges to power ahead with everything that mattered to her and nothing mattered to her more than the education of Pakistanis. She was Dawn‘s first woman op-ed editor. She’d worked at the newspaper for over 30 years before being named to the position.\n\nThat was less a reflection of her ability and intellect and more on the patriarchal, male-dominated work culture we have had in the best of times and the best of places. Zubeida was very mindful of that and, on her elevation, bluntly said: this would not have happened in the past.\n\nShe inspired and contributed to the growth of dozens of journalists, women and men alike, and so many have written/talked about what she meant to them. One of her most remarkable achievements at the newspaper, where I was privileged enough to work alongside her, was the transformation of the op-ed pages which, despite her fast deteriorating eyesight and health, she single-mindedly pulled into the present from a distant past where they seemed trapped.\n\nZubeida was long associated with and espoused the causes of the marginalised, whether women or the poor or minorities.\n\nZubeida Mustafa had the guts to politely yet firmly inform a stable of former senior civil servants and ex-military officers who had weekly op-ed slots that their submissions would be assessed on merit alongside other contributors. The new op-ed editor introduced hugely talented writers, both men and women, with the latter being somewhat under-represented in the newspaper till then, and her pages acquired a new look, life, vibrancy and relevance. She also insisted on not waiting for days to write leaders and began, for the first time in the paper’s life, editorials on the day.\n\nHer generation is often blamed, sometimes rightly, for discouraging youth in the name of favouring ‘experience’ but Zubeida placed her faith in young writers and editors on her team.\n\nIt was in the tenure of Mrs Mustafa, as she was addressed by all Dawn editorial staff, that young Cyril Almeida was recruited on the team and was also given the Wednesday column slot vacated by the well-established and widely-read Ayaz Amir when he decided to run for parliament on a political party’s ticket. Those were huge shoes to fill for Cyril but Zubeida’s instinct stood her in good stead and the young columnist was soon to carve a niche for himself and developed his own large following.\n\nThis was a summary, albeit so brief that I worry if it does her justice at all, of her work as a team leader and editor. As a columnist, unlike so many of us who write more or less exclusively on politics pointlessly, she chose more substantial issues to address such as education. Like one of her correspondents who calls her a ‘literary friend’, Nasser Yousaf remarked in an email to me: Although no one could write English like her, she was a relentless advocate for education in the mother tongue.\n\nHer volume of work on education, her passion, must be unprecedented in the country in terms of its quality too. She would talk with excitement and exuberance about a school in Karachi started by a woman in her garage for poor children and would talk long about how that was transforming lives. I know she supported every initiative for the provision of quality education in rural areas and, into her eighties, remained an intrepid traveller to interior Sindh to support and chronicle what Sadiqa Salahuddin and Naween Mangi (to name just two) are doing for girls’ education and development there.\n\nAfter I left Pakistan, we continued to communicate via email. When I had the audacity to express positive thoughts about education in Pakistan, she shot back an email: “I felt puzzled when you wrote about education being taken up in earnest in Pakistan. Abbas, that is an impossible dream now. Who will teach? The teachers are as uneducated as the children they have to teach. What should we do then?” But despite her directness she also had a very big heart, as she added: “I continue to enjoy your columns nevertheless.” With nearly 26 million children out of school in her country, I can’t even begin to imagine her heartbreak.\n\nZubeida was long associated with and espoused the causes of the marginalised, whether women in a patriarchal society or the poor or the minorities. I can’t even begin to imagine how she must have suffered seeing a spate of ‘honour’ killings every year, particularly of young women exercising choice in marriage or hearing of a father killing a daughter for having a TikTok account or a father and family reportedly disowning a daughter for choosing a career in acting, so much so that her forlorn death nine months ago in her Karachi flat was discovered just this week. Nobody cared enough to inquire after her when she went incommunicado all those months ago. Only because she was a woman with her own will and mind.\n\nBut what more can a writer do but write? Zubeida Mustafa was a true legend and a fighter who battled impossible odds. It is beyond my intellect and ability to write a befitting tribute to her. She was a believer in the public healthcare system and breathed her last at SIUT, an institution she supported with unparalleled zeal. Her own last act, the gift of sight, a donation to two individuals, is the most eloquent tribute to her. Travel well, Zubeida. Thoughts are with your daughters Seemi and Huma you often told me about with such pride and your sister Dr Fatema Jawad who was by your side to the end.\n\nThe writer is a former editor of Dawn.\n\nabbas.nasir@hotmail.com\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6873286cd059d.jpg",
  "retrievedAt": "2025-08-17T20:21:13.133Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923866/travel-well-my-friend-zubeida",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T03:32:11.000Z"
}
