{
  "title": "Hybrid worries - Newspaper - DAWN.COM",
  "author": null,
  "content": "THE government seems to have gone out of its way to make a mountain out of what would otherwise have been a molehill. After all, only the very credulous would have believed reports about the president resigning and being replaced by the army chief.\n\nWith things going the establishment’s way, what good reason could it have to suddenly tear down the civilian façade that it has built up so carefully? There seems to be no doubt in anyone’s mind about where the real power resides; even the country’s defence minister recently spoke glowingly about how well the hybrid system has been working. Why, then, would the establishment risk alienating one of its main partners by displacing its figurehead from the top constitutional office?\n\nThe answer is quite simple if one looks at the question from a different perspective. The government has panicked because there are good reasons for players in hybrid set-ups to fear conspiracies. Political scheming and machinations are, after all, a central feature of coalition governments and hybrid power-sharing arrangements, and when the balance of power between civilians and the military goes off kilter, things can unravel rather quickly.\n\nThe ‘reports’ may have been based on rumours, but they were backed up with just enough ‘facts’ to sow seeds of doubt in the minds of various stakeholders. So much so that they prompted PML-N Senator Irfan Siddiqui, a key advisor to the Sharifs, to come forth with an endorsement of President Asif Zardari. “He is performing excellently in his role as the constitutional head of state,” he said.\n\nThen came Interior Minister Mohsin Naqvi. “For the first time, politicians, the government and the military establishment are on the same page, and that bothers certain individuals.”\n\nThis was followed by Syed Nayyar Hussain Bukhari, the PPP-P secretary general, who noted that “Zardari is the duly elected president of this country and this system cannot function without him.”\n\nThis was followed by yet another round of assurances from the interior minister and even PM Shehbaz Sharif. The former accused “those involved in this narrative” of “collaboration with hostile agencies”, while the latter reportedly stated that “Field Marshal Asim Munir has never expressed any desire to become the president, nor is there any such plan in the offing.”\n\nIt is painful to see civilian leaders scrambling to assert their relevancy: not because the rumour carried real weight, but because it touched a nerve. Once elected office is reduced to theatre, useful only for maintaining appearances, it becomes a stage for managing perceptions rather than exercising power. Politicians quickly find that they have little left to offer but words. Mutual suspicion becomes a default setting, and the system grows increasingly brittle. And this, perhaps, is the real cost of ceding civilian supremacy.\n\nPublished in Dawn, July 13th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/684d9e007ba33.jpg?r=125409",
  "retrievedAt": "2025-08-17T20:20:51.741Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923863",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T03:24:23.000Z"
}
