{
  "title": "Pakistan’s Hockey U-18 Asia Cup dream comes to an end as Japan wins final 3-0 - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan’s Men’s Hockey U-18 Asia Cup dream came to an end as Japan won the final 3-0 on Sunday in Dazhou, China.\n\nThe final score of the match was 3-0, with Japan’s Yuma Fujiwara scoring goals in the 22nd and 38th minutes of the game and Tatsuaki Yasui converting a penalty corner to score in the 49th minute.\n\nPakistan had secured their place in the finals of the U-18 Asia Cup with a penalty shootout victory over Malaysia, maintaining an unbeaten streak in the tournament till the final.\n\nBoth teams drew 3-3 in regular time, forcing the game to a penalty shootout, which Pakistan clinched 4-3.\n\nBefore beating Malaysia, Pakistan had beaten hosts China 2-1 to qualify for the semi-final. They also defeated Bangladesh (6-3), Sri Lanka (9-0) and Hong Kong (8-0) during their campaign.\n\nLast month, New Zealand beat Pakistan 6-2 in the final of the FIH Nations Cup in Kuala Lumpur, Malaysia, retaining their title.\n\nPakistan is also reviewing the security situation in India before taking a call on sending its hockey teams to the neighbouring country for the Asia Cup and Junior World Cup to be held later this year, the Press Trust of India (PTI) reported on Saturday.\n\nAccording to the PTI, a top official of the government has said that the national team will not be sent to India if there are security threats to them.\n\nPakistan are scheduled to participate in the Asia Cup being held in Rajgir, Bihar, from August 27 to September 7, for which the Pakistan Hockey Federation (PHF) has sought clearance from the government. Pakistan are also due to feature in the FIH Junior World Cup, to be staged in Chennai in Nov-Dec this year.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/13182402e608c8b.jpg",
  "retrievedAt": "2025-08-17T20:20:15.704Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1923940/pakistans-hockey-u-18-asia-cup-dream-comes-to-an-end-as-japan-wins-final-3-0",
  "dateList": "2025-07-13",
  "date_published": "2025-07-13T13:11:07.000Z"
}
