{
  "title": "PIA to resume special flights to UK from April 19: Spokesman",
  "link": "https://www.app.com.pk/national/pia-to-resume-special-flights-to-uk-from-april-19-spokesman/",
  "date_published": "2020-04-18T03:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):The Pakistan International Airlines (PIA) is all set to resume its special relief flights to United Kingdom (UK) from Sunday (April 19), a spokesman for the national flag-carrier said on Saturday.\nThe flights are being operated, based on popular demand of expats intending to travel to and from Pakistan aimed at reuniting them with their loved ones amid the coronavirus (COVID-19) pandemic, the spokesman said in a press release.\nDaily flights would be operated from Islamabad and Lahore for three network points in UK including London, Manchester and Birmingham, for which the PIA management had sought necessary permission from the government while fulfilling all health and safety requirements set by respective agencies of both the countries.\nThis decision was taken after rounds of discussions held between PIA CEO and UK High Commissioner to Pakistan in line with the directives of Minister for Aviation Ghulam Sarwar Khan.\nThe minister had directed the PIA management to plan and execute these operations on priority to address concerns of both stranded Pakistanis in UK and stranded British Citizens in Pakistan.\nThe spokesman urged the passengers intending to travel to or from UK to immediately contact PIA Offices, Centers and Websites to secure their bookings, whether fresh or old ones to be re-adjusted.\nA large number of people were affected due to the COVID-19 consequential flight cancellations and are eagerly awaiting the resumption of operations. “With limited number of capacity available, seats will be sold or allocated on first come first served basis, so do not delay,” he said.\nThe PIA Contact Centers would be contacting the people who have already submitted re-confirmation requests, only after which customers are requested to approach PIA offices if required. For fresh bookings, passengers can visit PIA offices or PIA website.\nThe spokesman said on demand of all the stranded passengers to reduce the fares on humanitarian ground, “The PIA being the national flag bearer of Pakistan, and despite not meeting operational costs, have offered special discounted fare of PKR 110,000 or GBP 525 (One Way Fare) enabling large number of citizens to avail the travel opportunities.”\nWith direct flight operations between Pakistan and UK in shortest possible travel time, there would be least exposure to the pandemic, he said.",
  "retrievedAt": "2025-08-11T19:07:13.492Z"
}
