{
  "title": "AJK govt, Ulemas working together against COVID-19: Masood",
  "link": "https://www.app.com.pk/national/ajk-govt-ulemas-working-together-against-covid-19-masood/",
  "date_published": "2020-04-18T06:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 18 (APP):In response to the appeal made by Azad Jammu and Kashmir (AJK) President Sardar Masood Khan, Ulemas and Mashaikh from all over the country, have expressed their determination to frustrate the sinister designs of the Indian rulers against the Muslims of Indian Occupied Jammu and Kashmir.\nThe Ulemas fully agreed to educate and guide the people about curbing novel coronavirus in the light of Quran and Sunnah.\nThey would also pray for the safety of Kashmiri Muslims and early success of Kashmir’s liberation from Indian rule.\nAddressing through video link a consultative meeting of Ulemas  and  Mashaikh convened by President of Pakistan Dr Arif Alvi to adopt a strategy for congregational prayers and Namaz-e-Taraweeh during the holy month of Ramazan, the AJK president said that he and AJK Prime Minister Raja Farooq Haider Khan have already held several consultative meetings with the Ulemas in this regard.\nChief Secretary Mathar Niaz Rana, Member of state Council of Islamic Ideology Mufti Kifayat Hussain Naqvi, Maulana Mufti Ibrahim Aziz, Allama Hameeduddin Barkati, Maulana Danyal Shahab Asri and Secretary religious affairs Sardar Javed Ayub were also attended video conference from AJK side.\nThey explained their views about Ramazan, five times prayers, Traveeh and Jumma congregations in the wake of coronavirus.\nSardar Masood Khan and Ulemas from Azad Kashmir told the participants of the video conference that complete religious harmony seemed among Ulemas of all schools of thoughts and they were also playing a leading role to prevent the spread of the virus in the light of Islamic teachings.\nBesides creating awareness among the people about the significance of cleanliness and purity, Ulemas were motivating the masses to support the poor and vulnerable communities through Zakat, Sadqat and donations.\nThe AJK president said that the state Ulemas were fully determined to follow all guidelines of the health ministry regarding prayers in the mosques and to avoid any act which may pose dangers to human lives.\nThe Ulemas were playing their role to remove fear, frustration and depression developed among the people about coronavirus.\nSardar Masood Khan stressed that the people in Indian Ocupied Jammu and Kashmir were not being provided health facilities to save them from the pandemic. He also quoted data of COVID-19 patients in the liberated territory, and the efforts being made by the state government to prevent the spread of the pandemic.\nChief Secretary Mathar Niaz Rana, Mufti Kafayat Hussain Naqvi, Mufti Mohammad Ibrahim Aziz and Danyal Shahab said that the Ulemas and religious figures of Azad Kashmir would follow in letter and spirit whatever decision was made by the government, Ulema and Mushaikh in Pakistan.",
  "retrievedAt": "2025-08-11T19:07:10.936Z"
}
