{
  "title": "Dr. Sania reviews Ehsaas Kafalat payments of Rs.14,000",
  "link": "https://www.app.com.pk/national/dr-sania-reviews-ehsaas-kafaalat-payments-of-rs-14000/",
  "date_published": "2022-03-14T13:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Special Assistant to the Prime Minister on Poverty Alleviation and Social Protection, Dr. Sania Nishtar on Monday reviewed Ehsaas Kafalat payments recently increased upto Rs. 14,000.\nThe Prime Minister has raised the six-monthly stipend amount of Kafaalat from Rs.12,000 to Rs.14,000.\nFollowing the Prime Minister’s announcement, Ehsaas Kafaalat payments from January to June 2022 commenced on March 7, 2022.\nCurrently, a tranche of Rs. 71 billion is being disbursed in all Tehsils of the country to benefit millions of poorest women.\nTo review disbursement operations under Kafaalat, Dr. Sania Nishtar convened several meetings today with the leadership of Habib Bank Limited, Chief Secretaries of provinces and IGs of Police.\nSecretary Ismat Tahira and all Director Generals of Ehsaas were also present in the meeting together with the Focal Persons of provinces.\nThe pace of payments and issues emerging from the field were discussed in detail.\nThe meeting also discussed the zero-tolerance policy for those involved in illegal deductions.\n“Beneficiaries of the Kafaalat programme are the disadvantaged women with meagre or no means of income generation. We are fully striving to ensure that Kafaalat payments are made in the field with utmost ease and transparency”, Dr. Sania said.\n“We are taking stringent measures to ensure that the full amount of Rs. 14,000 goes in the hands of beneficiaries and fraudsters are dealt with zero tolerance. All officers and teams are constantly in the field to monitor payments”, she added.\nDr. Sania also urged provinces to ensure better logistics and security arrangements at the campsites.\nAll provinces assured full cooperation in this regard. Dr. Sania also asked partnering banks to address the issues of internet connectivity, point of sale machines and cash liquidity. Regional and field teams of Ehsaas were also advised to manage queues of women at the campsites and reduce their waiting time.\nA committee was also constituted with representation from Director Generals of Ehsaas, Officers of partnering Banks and focal persons of provinces to review Ehsaas Cash disbursements.\nThe committee members will meet every day to review the pace of payments and tackle issues emerging from the field.\nSince the payments began last week, 41% beneficiaries have withdrawn their cash stipend of Rs. 14,000 from campsites, designated retail outlets and biometric ATMs of Habib Bank and Bank Alfalah.\nEach beneficiary is being paid Rs.14,000 covering the period January-June 2022. Combined payment for six months is being made to beneficiaries identified through Ehsaas survey and registration desks. Ehsaas Kafalat aims to serve 8 million families.",
  "retrievedAt": "2025-08-11T14:32:02.618Z"
}
