{
  "title": "Financially empowered women vital for economic development, family support: Samina",
  "link": "https://www.app.com.pk/national/financially-empowered-women-vital-for-economic-development-family-support-samina/",
  "date_published": "2022-03-14T10:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 14 (APP): Begum Smina Alvi, the wife of President Dr Arif Alvi Monday said the financial empowerment of the women were inevitable not only to make them contribute to the national economic development but also support their own families.\nShe, while addressing the launching ceremony of a book titled “101 Incredible Women CEOs of Pakistan”, said the financial empowerment of the women would also help address their sense of deprivation besides enabling them to play their role for country’s progress.\nShe said what to talk of leaving their homes, even it was considered an offence for the women to talk to anyone in the dark ages as they used to face immense discrimination.\nHowever, she said the women in current age were aware of their rights as well as the responsibilities besides being rich with huge capabilities.\nMentioning the historic role played by the women in the Pakistan Movement, Begum Samina Alvi said Quaid-e-Azam Muhammad Ali Jinnah had linked the national development with the women playing their role alongside the men.\nShe said besides fulfilling their responsibilities, the women were also standing shoulder to shoulder with men in the fields of education, health and sports to contribute to the country’s prosperity.\nShe advised the women to get education besides following the national values as they were also a primary learning source for a child.\nShe said the women consisted of 50% of country’s population of Pakistan and had been playing a responsible role for country’s development.\nSamina Alvi also urged the successful women to guide those from backward areas regarding their rights particularly the physically challenged ones. She also called for efforts for deliverance of the women suffering from exploitation in name of social traditions.\nShe told the gathering that a lot of measures had been taken by the government for women’s empowerment including legislation and awareness on their property rights and providing easy loans.\nShe also stressed the need for awareness among the women regarding the facilities available for their empowerment as well as remedies available for protection of their rights.",
  "retrievedAt": "2025-08-11T14:32:08.371Z"
}
