{
  "title": "Pakistan to further deepen collaboration with Germany: FM",
  "link": "https://www.app.com.pk/national/pakistan-to-further-deepen-collaboration-with-germany-fm/",
  "date_published": "2022-03-14T15:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, March 14 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Monday while underscoring the high value Pakistan attached to its relations with Germany, said Pakistan was determined to further deepen its collaboration with Germany across all areas of mutual benefit.\nThe foreign minister spoke on telephone with Germany’s Foreign Minister Annalena Baerbock.\nDiscussing the situation in Ukraine, foreign minister said that it was a grave moment in Europe’s history. He apprised his German counterpart of the Prime Minister’s phone conversation with Charles Michel, President of the European Council, as well as his own phone calls with the Foreign Ministers of Ukraine, Poland, Romania, Hungary and Russia and with Josep Borrell, High Representative of the European Union.\nQureshi said in all these contacts, Pakistan had stressed the importance of cessation of hostilities, establishment and maintenance of humanitarian corridors, provision of humanitarian assistance and continuous efforts for a solution through dialogue and diplomacy.\nThe foreign minister briefed Baerbock over violation of Pakistan’s airspace by an Indian missile on March 9.\nHe said that India had regretted what it called “accidental” firing of the missile, however, such a serious matter could not be addressed with the simplistic explanation proffered by the Indian authorities.\nForeign minister Qureshi further said that Pakistan had called for a joint probe in the incident and was also calling upon the international community to take serious notice of this incident of grave nature in a nuclearized environment and play its due role in upholding and promoting strategic stability in the region.\nThe foreign minister said he looked forward to receiving the German counterpart in Islamabad in April to continue discussions.\nForeign minister Annalena appreciated the foreign minister for sharing perspective on bilateral and regional issues and said that she looked forward to continue these discussions.\nThis was the second phone conversation between the two foreign ministers in a month. The two sides agreed to remain in contact.",
  "retrievedAt": "2025-08-11T14:31:57.210Z"
}
