{
  "title": "India dropped missiles in Amritsir to fuel anti-Pakistan sentiments among Sikhs: Ishaq Dar",
  "author": null,
  "content": "ISLAMABAD, May 8 (APP): Deputy Prime Minister and Foreign Minister Ishaq Dar on Thursday said that India deliberately targeted Amritsar with projectiles/missiles in a calculated move to incite anti-Pakistan sentiments within the Sikh community.\nSpeaking at a press conference along with Director General Inter-Services Public Relations (ISPR) Lt General Ahmed Sharif Chaudhry, Ishaq Dar said India on the early hours of May 8 launched a highly proactive attack, firing four projectiles most probably missiles targeting Pakistani territory.\n“In a deeply sinister act, three projectiles were deliberately dropped at Amritsar, the capital of Indian Punjab while the fourth projectile which entered in Pakistan’s airspace was neutralized by Pakistan air defence and its debris fell in Denga which is inside Pakistan,” the deputy PM said.\nHe added that this malicious act of Hindutva regime falsely implicated Pakistan for targeting Indian civilians and inciting anti-Pakistani sentiments among the Punjabi Sikh population to externalize the rising communal tensions within India.\n“Pakistan categorically denies any intention or action that endangered civilian populations in Indian Punjab. Unlike the divisive policies of Indian leadership, Pakistan remains firmly committed to safeguarding innocent lives and regional harmony,” he added.\nIshaq Dar pointed out that besides firing projectiles, most probably missiles, several armed Indian drones also violated Pakistan’s airspace by crossing over the international border at multiple places, targeting civilian martyring one and injuring four, and made attempts to attack military installation, injuring four Army personnel.\n“One of these drones also struck the Rawalpindi cricket stadium, a venue for the ongoing Pakistan Super League (PSL) in deliberate attempt to target domestic and foreign cricket players,” he added. However, he informed that these drones had been neutralized.\nThe deputy PM said that despite repeated provocations, Pakistan being a responsible state had so far exercised strategic restraint, acted with maturity and limited its response strictly to self defence in accordance with International law and the UN charter.\n“Nonetheless in view of this grave and unlawful aggression and firing projectiles most probably missiles inside its territory and violating its airspace, Pakistan reserves the right to respond to India at a time place and manner of its choosing,” he added.\nCalling upon the general public to remain calm in the wake of Indian aggression, Ishaq Dar said that the country’s armed forces were fully alert and vigilant to thwart any aggression from India.\nHe said India was resorting to such “shameful” acts out of embarrassment following the downing of five Indian jets by Pakistan’s Air Force a day earlier.\nToday, he said India also issued a politically motivated statement, saying that Pakistan attacked multiple Indian sites, calling it a “big lie”.\n“The act India has done today, across the country, is shameful and condemnable.”\nHe said India, in a bid to conceal its embarrassment, narrated a concocted story that it attacked with drones in retaliation of Pakistani attack on India.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T15:14:35.636Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/india-dropped-missiles-in-amritsir-to-fuel-anti-pakistan-sentiments-among-sikhs-ishaq-dar/",
  "dateList": "2025-05-08",
  "date_published": "2025-05-08T16:20:00.000Z"
}
