{
  "article_id": "2025-03-16_fcbb3b61ded80a2f48c91ffce9bc521f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ict-admin-conducts-over-1650-raids-arrests-1000-fines-exceed-rs-1-5-mln/",
    "retrieved_at": "2025-08-27T13:44:57.235Z"
  },
  "metadata": {
    "title": "ICT admin conducts over 1,650 raids, arrests 1000, fines exceed Rs 1.5 mln",
    "author": null,
    "date_published": "2025-03-16T10:14:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 224,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 16 (APP):The Islamabad's district administration has intensified market inspections during Ramazan, conducting over 1,200 operations against retailers accused of overpricing essential goods. Meanwhile, the officials report that fines totaling more than Rs 1.5 million, hundreds of arrests, and temporary shop closures in a bid to stabilize prices and protect consumers. In this regard, Deputy Commissioner (DC) Islamabad, Irfan Nawaz Memon has chaired a assessed enforcement efforts since the start of Ramazan. All assistant commissioners and price control magistrates presented reports on inspections, penalties, and detentions. Assistant commissioners carried out 1,289 market inspections across the district, leading to the arrest of 290 retailers accused of overcharging customers. Fines totaling Rs 1.112 million were imposed during these raids, according to official data. Separately, price control magistrates conducted 4,568 inspections, resulting in 711 arrests and fines of Rs 448,500. Authorities temporarily sealed 11 shops found repeatedly violating government-mandated price lists. On the occasion, the DC instructed officials to prioritize public grievances and ensure immediate action on complaints filed via the district helpline. He emphasized a zero-tolerance policy toward overpricing, urging \"strict, indiscriminate enforcement\" against violators. Officials were directed to monitor markets daily, particularly for staples like flour, sugar, and cooking oil. The DC reiterated that providing affordable essentials during Ramadan was a \"top administrative priority,\" with teams ordered to submit hourly updates on price trends.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}