{
  "article_id": "2025-03-16_00b19ea22a1e84d44c5e877b29ca9247",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/punjab-govt-launches-rs4-5-bln-murree-development-project-on-cms-instructions-dg-lashari/",
    "retrieved_at": "2025-08-27T13:45:19.518Z"
  },
  "metadata": {
    "title": "Punjab govt launches Rs4.5 bln Murree development project on CM’s instructions: DG Lashari",
    "author": null,
    "date_published": "2025-03-16T09:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 414,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 16 (APP):Director General of the Walled City of Lahore Authority Kamran Lashari Sunday disclosed that the Punjab government has initiated a Rs4.5 billion project in Murree aimed at revamping the hill station's infrastructure to attract tourists, which will be completed within a year and a half under the direct supervision of the chief minister. Talking to PTV news channel, Kamran Lashari shared the plan for restoring shops and buildings around the General Post Office (GPO) to Mall Road which will revive their original glory and tradition. \"The Rs4.5 billion Murree project will transform the hill station into a world-class tourist destination, showcasing Pakistan's natural beauty and rich cultural heritage,\" said Kamran Lashari. \"The project will focus on sustainable development, ensuring that Murree's natural environment is preserved while providing modern amenities and infrastructure to tourists.\" \"By revitalizing Murree's infrastructure, we aim to boost tourism, create jobs and stimulate economic growth in the region, making it a premier destination for domestic and international tourists.\" \"Present government is also starting the glass train in Murree soon, providing tourists with a unique and unforgettable experience, he said, adding, by revitalizing Murree's infrastructure, we aim to boost tourism, create jobs, and stimulate economic growth in the region.\" Responding to a query, he stated that this initiative aims to preserve the historical charm of the area while promoting tourism, he added. The Walled City of Lahore Authority has been working tirelessly to restore and beautify various landmarks and areas within the city, including heritage sites associated with Sufi poets, shrines, gurdwaras and churches in various cities of Punjab, he added. He also announced plans to facilitate visits to Sufi shrines for school and college students in \"To promote cultural awareness and spiritual education among the youth, we will arrange visits to Sufi shrines, including Data Darbar and others, with affordable ticket prices and guided tours,\" said DG Lashari. This initiative aims to provide students with a deeper understanding of Pakistan's rich cultural heritage and the significance of Sufism in the country's history, he added. He added the growing interest of Sikh tourists in visiting Pakistan, particularly Punjab and appreciating the country's hospitality, adding, this trend is expected to continue, with more opportunities emerging for international tourists to explore Punjab's rich cultural heritage. The growth of tourism in Pakistan is not limited to Sikh tourists, as visitors from around the world are drawn to the country's diverse attractions, including its natural beauty, historical sites, and cultural events, he mentioned.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}