{
  "article_id": "2025-03-16_9a8959d895872e4b5427bb3a6a641566",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/youth-sports-empowerment-in-full-swing-thysl-continues-to-captivate-pakistans-youth/",
    "retrieved_at": "2025-08-27T13:45:26.656Z"
  },
  "metadata": {
    "title": "Youth Sports Empowerment in full swing: THYSL continues to captivate Pakistan’s youth",
    "author": null,
    "date_published": "2025-03-16T07:10:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 281,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 16 (APP):The Prime Minister's Youth Programme's flagship initiative, the Talent Hunt Youth Sports League (THYSL), achieved remarkable success, captivating the hearts of Pakistan's youth and inspiring widespread participation in a diverse range of sports. The initiative aimed to foster a culture of physical fitness, teamwork, and sportsmanship among young Pakistanis, transforming them into a confident, organized, and capable workforce. According to an official, with these objectives at its core, the Talent Hunt Youth Sports League was successfully launched in strategic partnership with the Higher Education Commission (HEC), leveraging collective expertise to promote youth development, education, and sports excellence in Pakistan. He said the comprehensive programme encompasses a diverse range of 12 sports disciplines, including Badminton, Boxing, Cricket, Football, Handball, Hockey, Judo, Squash, Table Tennis, and Volleyball, which are open to both male and female participants. Additionally, Weightlifting and Wrestling competitions were exclusively offered for male athletes, ensuring a robust and inclusive sporting experience. The initiative was built on collaborative efforts with key sports stakeholders to ensure equal opportunities, access, and resources for both male and female players, empowering them to reach their full potential and excel in their chosen sports disciplines,he told. He said the programme provided international-standard training for athletes, as well as local sports staff, encompassing coaches and trainers, under the guidance of esteemed officials and experts. The Talent Hunt Youth Sports League project has successfully concluded trials including Weightlifting (Men),Wrestling (Men),Hockey,(Men's & Women's), Football (Men's & Women's),Volleyball (Men's & Women's),Badminton (Men's & Women's),Table Tennis (Men's & Women's), Squash (Men's & Women's),Handball (Men's & Women's) andJudo (Men's & Women's). He further told that registrations are now Open for Boxing (Men's & Women's) and Cricket (Men's & Women's).",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}