{
  "title": "KP CM, Chinese envoy inaugurate schools’ reconstruction project",
  "link": "https://www.app.com.pk/national/kp-cm-chinese-envoy-inaugurate-schools-reconstruction-project/",
  "date_published": "2021-04-19T13:36:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 19 (APP): Chief Minister Khyber Pakhtunkhwa Mahmood Khan and Chinese Ambassador to Pakistan, Nong Rong Monday inaugurated the project of reconstruction of damaged schools in the newly merged tribal areas.\nA ceremony in this regard was held here at Chief Minister’s House Peshawar which was attended by provincial cabinet members Shahram Khan Tarakai, Abdul Kareem, Chairman CPEC Authority, Asim Saleem Bajwa, Additional Chief Secretary Shakeel Qadir, administrative secretaries of concerned departments and other high-ups.\nOn this occasion, Secretary Elementary and Secondary Education Department and concerned Chinese Authorities signed a document regarding implementation of the reconstruction project.\nEarlier, the Chief Minister and Chinese Ambassador were briefed in detail about the different aspects of reconstruction projects.\nIn the first phase of the project, a total of 50 schools fully damaged during militancy in Bara Tehsil of Khyber district will be reconstructed. These schools include 24 schools for boys and 26 for girls. The total estimated cost of the reconstruction project is Rs 2323 million, out of which Rs 868 million will be provided by the Government of Pakistan while 10.29 million US dollars will be provided by the Chinese Government.\nThe Chief Minister expressed his gratitude to the Chinese government for its support extended to the provincial government in the reconstruction of damaged schools in the newly merged areas.\nSpeaking on the occasion, the chief minister said that China is a time tested friend of Pakistan, and China Pakistan Economic Corridor Project is a great example of Pak-China friendship.\nHe added that, his government highly appreciated the assistance being provided by Chinese Government for the reconstruction of damaged schools in tribal districts.\nHe termed the provision of quality educational facilities to the public as an integral part of his government’s agenda and said that the incumbent government was taking result oriented steps under a well devised education strategy to provide conducive learning environment to students.\nHe stated that pragmatic steps were being taken to provide missing facilities in schools besides hiring of thousands of teachers.\nMahmood Khan said that a flagship project of the incumbent government under CPEC portfolio, Rashakai Special Economic Zone would be inaugurated soon which would boost industrial activities in the province and create employment opportunities.\nChinese Ambassador Nong Rong, on the occasion, said that Pakistan-China friendship is deeper than sea and higher than mountains, adding that Chinese Government is desirous to further strengthen mutual ties.\nThe Chinese Ambassador further said that Peoples’ Republic of China also wanted to work with Pakistan for poverty alleviation and economic development in the country.",
  "retrievedAt": "2025-08-11T20:38:24.180Z"
}
