{
  "title": "Buddhist monks reach Pakistan on religious pilgrimage",
  "link": "https://www.app.com.pk/national/sri-lankan-monks-appreciate-pms-vision-of-religious-tourism/",
  "date_published": "2021-04-19T11:26:00.000Z",
  "source": "APP",
  "content": "LAHORE, Apr 19 (APP):  A 14-member delegation comprising senior Buddhist monks from Sri Lanka arrived in the provincial metropolis on Monday to undertake a week-long religious pilgrimage to various Buddhist heritage sites in the country.\nThe Buddhist monks started their journey with a visit TO the Lahore Museum which houses some of the finest remains of the Gandhra civilization and rare Buddhist relics including the ‘Fasting Buddha’ and ‘Sikri Stupa’ dating back to the 2 A.D.\nThe visit has been arranged by the High Commission of Pakistan Colombo, Sri Lanka with a view to promote religious tourism in Pakistan by showcasing historicity and warm hospitality of the host nation. Pakistan is home to the ancient Buddhist civilization which has remained hidden from the eyes of the world over the years.\nThe senior Buddhist delegation, led by Dr Walpole Piyananda (Abbot and President, Dharmavijaya Buddhist Vihara, USA), will visit Islamabad, Taxila, Shahbaz Garhi, Takht-e-Bhai and Jehanabad (Swat) besides two-day visit to Lahore. The Buddhist delegation will also hold meetings with the officials of the Ministry of Religious Affairs and Interfaith Harmony and meet President Dr Arif Alvi, Prime Minister Imran Khan and Foreign Minister Shah Mehmood Qureshi during their federal capital visit.\nThe Second Secretary, High Commission of Pakistan Colombo Ms Ayesha Abu Bakr Fahad, told APP that a lot of people dis not know that Pakistan is home to the glorious Gandhara civilization and the Gandhara Buddhist civilization.\n“In line with the Prime Minister Imran Khan’s vision to promote religious tourism to earn valuable foreign exchange, we planned to make Buddhist clergy visit Pakistan and see the historical treasures that the country has,” she added.\nThe diplomat said the visitors would be taken along the holy Bhuddist trail so that they may see most sacred Buddhist sites and pay homage to the ‘Tooth relics of Lord Buddha’, the ‘Bone relics of Lord Buddha’ and the ‘Body Ashes of Lord Buddha’.\nMs Ayesha Abu Bakr Fahad, to a question, expressed the hope that the embassies in the Buddhist majority countries would follow the suit and arrange similar visits to highlight soft image of the country and contribute to promotion of religious tourism in the country.\nThe Buddhist monks will visit different historical sites including the Lahore Fort and Badshahi Masjid before departing for Islamabad on Tuesday.",
  "retrievedAt": "2025-08-11T20:38:30.203Z"
}
