{
  "title": "Rawalpindi residents hold rallies to observe ‘Thanksgiving Day’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: Like other parts of the country, a ‘thanksgiving day’ was observed in the garrison city in the wake of the ceasefire between Pakistan and India, and citizens gathered to express solidarity with the country’s armed forces.\n\nA huge rally was brought out by the PML-N led by Minister for Railways Hanif Abbasi and Parliamentary Secretary for Information and Broadcasting Danyal Chaudhry. The rally was participated by a large number of people from all walks of life along with PML-N members of national and provincial assemblies.\n\nThe rally started from the metro station at Saddar and ended at Faizabad. Reception camps were set up on both sides of Murree Road with large banners displayed to express solidarity with the armed forces.\n\nThe participants were carrying Pakistan’s flags and chanting slogans in support of the armed forces.\n\nSpeaking on the occasion, Minister Abbasi said people of Rawalpindi paid tribute to their armed forces. “The enthusiasm and passion that the people of Rawalpindi have always shown is commendable,” he said.\n\nParticipants pay tribute to armed forces for their brave response to continuous aggression by India\n\nHe said he would salute the courage and capability of the Pakistan Army as it was one of the best armies in the world. “We appreciate their sacrifices who forced the enemy to bow down by destroying the Indian posts,” he said.\n\nHe said the presence of the Pakistani Army was enough to protect our borders, and we are united to face every challenge.\n\nDuring the rally, Mr Abbasi also raised slogans of Pakistan Zindabad and said the rally proved that the people of Pakistan will always remain united for the integrity of their country.\n\nOther speakers said this was a battle in which an unparalleled history of courage was created. They said the whole world was acknowledging that the people and armed forces of Pakistan had become a strong wall in front of the enemy’s intentions and destroyed its nefarious designs.\n\nAll-Pakistan Private School Association President Abrar Ahmed said that armed forces of Pakistan defended the homeland by responding bravely to the continuous aggression by India.\n\n“We are the people of a peaceful country, but if someone thinks of destroying peace here, we also know how to defend ourselves,” he said.\n\nIn the end, prayers were also offered for the armed forces of Pakistan and the country’s security and development.\n\nMeanwhile, a separate rally was also organized by Wasa Rawalpindi to express solidarity with the armed forces. The rally was led by Wasa Managing Director Mohammad Saleem Ashraf.\n\nA large number of public representatives, officers and employees of Wasa and citizens participated in the rally. The rally reached Faizabad via Murree Road where the participants raised slogans in support of Pakistan and its armed forces and against Indian aggression.\n\nAddressing the rally, the Wasa chief paid tribute to the armed forces for their effective and aggressive response to the Indian aggression. He said India will now think a hundred times before committing any further aggression.\n\nMeanwhile, doctors also lauded the role of armed forces. In a statement, Dr Mansoor Ahmed, Dr Ashoke Kumar, Dr Mohammad Hanif and others said the air force’s role was critical in getting the initial advantage against India and proved that it was much ahead of the enemy.They said the medical fraternity will always stand by the armed forces.\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:10:23.451Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910411/rawalpindi-residents-hold-rallies-to-observe-thanksgiving-day",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:46:10.000Z"
}
