{
  "title": "AJK villagers torn between fear and hope - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Emergency declared in LoC districts\n• Educational institutions across AJK to remain closed until further notice as civil defence seeks thorough safety sweeps\n• Thousands evacuated from LoC need humanitarian assistance\n• Affectees lack adequate privacy and safety\n\nMUZAFFARABAD: A day after Pakistan and India agreed to de-escalate tensions, internally displaced persons (IDPs) from vulnerable areas along the Line of Control (LoC) in Azad Jammu and Kashmir (AJK) found themselves caught in a dilemma — torn between the longing to return home and lingering doubts about the durability of the ceasefire.\n\nAccording to Sardar Waheed Khan, Director General of the State Disaster Management Authority (SDMA), calm had largely prevailed along the LoC following the ceasefire agreement — except in Barnala sector of Bhimber district, where Indian shelling continued until 10:30 pm on Saturday before finally subsiding.\n\nHe said intense shelling had officially displaced around 1,186 families across AJK. However, he acknowledged that several other families had quietly fled their homes without notifying the authorities, meaning the actual number of displaced persons could be higher.\n\nOn Sunday, some displaced families began pre­paring to return, but many remained hesitant.\n\n“We are not ready to take the risk just yet,” said Zahida Parveen, a housewife from Bugna Ban Chattar village in Neelum Valley, cradling her infant in a high school building in Lower Plate neighbourhood of Muzaffarabad.\n\n“It’s our children we’re most worried about. We fled in panic and don’t want to go back unless we’re sure it’s safe.”\n\nParveen said she and her two sisters-in-law had rushed to Muzaffar­abad with their infants after a brief pause in Indian shelling on Friday.\n\n“We stayed with some relatives for two nights, but they had limited space. So, we’ve moved to this school building and will wait to see what happens on Monday.”\n\nTheir fear was compounded by a recent tragedy: a teenage boy in their village was killed by shell fragments just a day earlier.\n\n“We’ll reassess tomorrow after­noon,” said Mahreen Gillani, one of the sisters-in-law, seated beside her.\n\nOutside in the school veranda, Syed Mureed Hussain, 56, from Sandok village, expressed a similar view: “My heart wants to go back, but the children are terrified. The sound of artillery still echoes in their minds.”\n\nHe said he planned to stay with relatives on the outskirts of Muzaffarabad for another day or two.\n\nNazarat Ali Kazmi, 39, another villager, said his trust in the ceasefire was low.\n\n“There was a time when the Indian army raised white flags — a truce signal — and still resumed firing,” he alleged.\n\nHowever, in Kotli’s Khuiratta Tehsil, many displaced people were more optimistic.\n\n“I’m hopeful this agreement holds. We want to go back to our land,” said Chaudhry Azam, a 55-year-old farmer from Jamairi Kas village, just 200 metres from the LoC.\n\nHis home was damaged and livestock killed in Friday’s shelling, forcing him to seek shelter at a friend’s house in Manjwar, four kilometres away.\n\n“People here have been kind, but there’s no place like home — even if it’s damaged,” he said.\n\n“We’ve been told by local officials to wait until Monday noon. One more day won’t hurt.”\n\nNeelum Deputy Commissioner Nadeem Ahmed Janjua confirmed that return was being encouraged, but with caution.\n\n“These people left voluntarily and are returning voluntarily. All we have advised them is to remain alert until the situation stabilises,” he said.\n\nHe added that despite the shelling, life had not come to a complete halt. “Even in the worst days, passenger vans and grocery-laden vehicles continued to operate on the main Neelum road, and we made sure to facilitate them.”\n\nSchools to stay shut\n\nMeanwhile, SDMA Director General Sardar Waheed Khan announced on Sunday that all educational institutions across AJK would remain closed until further notice, pending a decision by a cabinet committee.\n\n“The decision regarding the reopening of schools and colleges will be announced through the SDMA platform,” he said in a post on his social media accounts.\n\nSeparately, in light of recent Indian aggression and unprovoked shelling, Civil Defence Department Director General Abrar Azam urged immediate precautionary measures ahead of any plans to resume academic activities.\n\nIn a letter addressed to the divisional commissioners of Muzaffarabad, Mirpur, and Poonch, Mr Azam cited credible reports of suspicious objects, including unexploded ordnance (UXOs), allegedly dropped by Indian forces in civilian areas near the LoC.\n\n“Given the danger posed by unexploded bombs and toy-like explosive devices, it is essential to carry out thorough search-and-sweep operations in all educational institutions before classes resume,” he stressed, urging timely safety measures on part of district administration concerned to ensure the protection of students and staff.\n\nHumanitarian assistance\n\nThousands of people relocated from villages and their local communities near the Line of Control (LoC) due to drone strikes, indiscriminate cross-border firing, shelling and artillery exchanges, are facing the most severe impacts, needing humanitarian assistance.\n\nBased on the findings of the Rapid Needs Assessment carried out by Islamic Relief Pakistan (IRF), immediate and comprehensive intervention is required to address the multifaceted needs of the affected people.\n\nA significant limitation was the security risk posed by ongoing cross-border shelling and firing. Access to certain high-risk villages was restricted due to safety concerns, and some visits had to be delayed or rerouted. This limited access to the most affected areas, potentially leading to gaps in data from frontline communities, IRF report says.\n\nThe IRF teams collected data across three districts: Muzaffarabad, Bagh and Haveli. The 58pc people residing near the border are also facing protection concerns due to damaged shelters, as many are currently living in public schools and even with relatives, lacking adequate privacy and safety.\n\nThe SDMA said a state of emergency has been declared in districts of LOC: Muzaffarabad, Neelum, Haveli, Jhelum Valley, and Kotli. There are mobility restrictions, road closures, and civilians are advised to evacuate from high-risk zones.\n\nDisplaced families are relocating to safer areas with relatives. Schools and essential services remain suspended, exacerbating vulnerabilities, particularly for women and children.\n\nAssessment results show 58pc of the population lacks access to clean water, hygiene and dignity kits, primarily due to damaged infrastructure and widespread displacement across AJ&K. Many water sources at community level have been destroyed by heavy mortar fire and shelling, further compounding the crisis. Sanitation conditions have also deteriorated considerably, particularly in displacement settings.\n\nAs lack of adequate shelter and displacement led to psychological distress, immediate and comprehensive intervention is needed to provide temporary shelters, non-food items, and protection services to address the urgent needs of displaced families.\n\nDue to the lack of proper shelter, many children have been unable to sleep properly, and are increasingly exposed to insect and mosquito bites, significantly raising health and protection risks.\n\nTemporary camp conditions, lack of privacy, and inadequate facilities increase the risk of gender-based violence and sexual exploitation.\n\nAmin Ahmed in Islamabad also contributed to this report\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/68213edbdc4e7.jpg",
  "retrievedAt": "2025-10-12T03:01:54.947Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910378/ajk-villagers-torn-between-fear-and-hope",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:45:22.000Z"
}
