{
  "title": "Kashmir takes centre stage as fragile ceasefire holds - World - DAWN.COM",
  "author": null,
  "content": "• Trump offers to work with Pakistan, India to find solution to Kashmir dispute\n• Pakistan welcomes US offer, says settlement must be under UNSC resolutions\n• FO says committed to regional peace, security, interested in boosting trade ties with US\n\nWASHINGTON: As hostilities between Pakistan and India come to an end with the help of the US, Pakistan on Sunday welcomed a proposal by President Donald Trump expressing willingness to play an active role for the resolution of the Kashmir dispute by working with both South Asian countries with an aim to put an end to this perennial conflict.\n\nDiplomacy and pressure from the United States helped secure the ceasefire deal on Saturday evening, but within hours of its coming into force, both sides started blaming each other for violations. The reported shelling died down by Sunday dawn.\n\nPresident Trump, in a statement posted on his Truth Social platform on Sunday, praised the leadership in New Delhi and Islamabad for agreeing to a ceasefire and credited the US efforts for facilitating this “historic and heroic decision”. “I will work with both of you to see if, after a ‘thousand years’, a solution can be arrived at concerning Kashmir,” the US president said in his message.\n\nIn a swift response to the remarks made by President Trump, Pakistan’s Foreign Office acknowledged with “appreciation the constructive role played by the United States, alongside other friendly states, in supporting the recent ceasefire understanding between Pakistan and India”.\n\nThe FO in a statement said that Islamabad appreciated President Trump’s expressed “willingness to support efforts aimed at the resolution of the Jammu and Kashmir dispute — a longstanding issue that has serious implications for peace and security in South Asia and beyond”.\n\n“Pakistan reaffirms that any just and lasting settlement of the Jammu and Kashmir dispute must be in accordance with the relevant United Nations Security Council resolutions and must ensure the realisation of the fundamental rights of the Kashmiri people, including their inalienable right to self-determination,” said the statement, adding that Pakistan was committed to engaging with the US and the international community to promote peace, security, and prosperity in the region.\n\n“We also look forward to deepening our multifaceted partnership with the United States, particularly in the areas of trade, investment, and economic cooperation,” it added.\n\nMr Trump’s Kashmir statement came a day after India and Pakistan agreed to a “full and immediate” ceasefire along the Line of Control and International Border, following what the US president described as a “long night” of negotiations facilitated by Washington.\n\nThe ceasefire, which came into effect on Saturday, was endorsed by Indian and Pakistani officials shortly after the initial declaration by Mr Trump. Tensions had spiked after Indian forces struck targets in nuclear-armed Pakistan and Azad Jammu and Kashmir last week. The flare-up raised fears of a wider regional conflict.\n\nReferring to the role his administration played in defusing the crisis, Mr Trump said, “I am very proud of the strong and unwavering leadership of India and Pakistan for having the strength, wisdom, and fortitude to understand that it was time to stop the aggression that could have led to the death and destruction of so many.”\n\nHe warned that “millions of good and innocent people could have died” if both sides had failed to seize the moment. “Your legacy is greatly enhanced by your brave actions. I am proud that the USA was able to help you arrive at this historic and heroic decision,” he added.\n\nWhile the Kashmir issue was not explicitly mentioned in the ceasefire announcement, Mr Trump emphasised his intention to stay engaged on the broader dispute. “I will work with you both to see if, after a thousand years, a solution can be found regarding Kashmir,” he wrote, adding that he also intended to “increase trade substantially with both of these great nations”.\n\nHe also previously referred to Kashmir as a “thousand-year” dispute, a term initially seen as a mistake but later “interpreted” as a way of stressing the deep-rooted and complex nature of the conflict.\n\n“I am very close to India and I’m very close to Pakistan, as you know. And they’ve had that fight for a thousand years in Kashmir. Kashmir has been going on for a thousand years, probably longer than that…” he told reporters last month.\n\nSeveral senior US officials and Republican lawmakers celebrated the ceasefire and credited President Trump for what they described as a landmark moment in regional diplomacy.\n\n“I am incredibly proud to serve alongside Vice President Vance and Secretary Rubio. This historic administration is working every day to achieve peace. The golden age is coming, and it starts with peace throughout the world,” said Commerce Secretary Howard Lutnick.\n\nFormer National Security Advisor Mike Waltz, who is expected to be nominated as US ambassador to the UN, said this was “progress toward stability in a historically volatile region. It won’t be easy, there will be violations, and much work remains to be done, but it is another step in President Trump’s commitment to peace.”\n\nAlthough India has long resisted third-party involvement in Kashmir, Trump’s repeated references to the conflict — and his offer to work toward a resolution — mark a notable shift in US engagement with South Asia’s most enduring flashpoint.\n\nWith input from agencies\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/11092307bacb05e.png",
  "retrievedAt": "2025-08-23T14:10:41.074Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910382/kashmir-takes-centre-stage-as-fragile-ceasefire-holds",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:45:22.000Z"
}
