{
  "title": "COMPANY NEWS - Newspaper - DAWN.COM",
  "author": null,
  "content": "Faysal Funds wins Best Digital ESG Project\n\nFaysal Funds is awarded the Best Digital ESG Project at The Asset Triple A Digital Awards 2025 for their Faysal Funds Mini App initiative, as per a press release. The Faysal Funds Mini App is an integration developed in collaboration with Easypaisa, Pakistan’s leading digital wallet platform, aimed at empowering millions of unbanked individuals across the country.\n\nThis venture merges the expertise of Faysal Funds with the expansive reach of Easypaisa, fostering a culture of savings and investment among the underserved population.\n\nWith over 13 million active users, easypaisa provides an exceptional platform for the Faysal Funds Mini App, enabling individuals to easily open accounts, perform transactions, and monitor their investments — all from the palm of their hand.\n\nThis innovation not only enhances accessibility but also simplifies the investment process, breaking down barriers that have long hindered financial growth for many in Pakistan. Faysal Funds is proud to play a vital role in driving financial inclusion through its Mini App, which has successfully enabled over 265,000 unbanked individuals to access essential financial services, generated significant investment inflows of Rs260m and empowered women across rural and suburban areas with a female user base of over 11pc.\n\nHyundai launches Tucson Hybrid\n\nHyundai Nishat Motor (Private) Limited successfully hosted the nationwide launch of the all-new Hyundai Tucson Hybrid on May 7th, 2025, as per a press release. It marks a significant milestone in Pakistan’s automotive industry while building on the legacy of the Tucson 2020, which redefined the sports utility vehicle (SUV) landscape in Pakistan. The all-new Tucson Hybrid arrives as the first all-wheel drive (AWD) hybrid SUV in its segment, integrating advanced hybrid technology, latest-generation facelift design, and all-terrain capabilities to meet the evolving demands of modern drivers.\n\nThe Hyundai Tucson Hybrid 2025, introduces segment-first technologies including memory seats, a fingerprint sensor, head-up display, and heated and ventilated seats. Designed with the Pakistani consumer in mind, it also features multi-terrain drive modes (snow, mud, sand) for greater control across challenging road conditions. Equally important is its fuel-efficient hybrid system, delivering enhanced mileage without sacrificing performance. As the nation faces increasing energy costs and fuel dependency, the Tucson Hybrid 2025 provides a smarter, more economical solution, offering long-term value to consumers while contributing to national energy sustainability plan.\n\nDaraz partners with UnionPay\n\nDaraz Pakistan has announced a strategic partnership with UnionPay International to accelerate the adoption of seamless and secure online transactions in Pakistan, as per a press release. As part of this collaboration, customers shopping on Daraz can now enjoy an exclusive 11 per cent discount when making payments with their UnionPay debit and credit cards. This discount will be applicable all days of the week, to enhance the shopping experience on Daraz by incentivising cashless transactions, reinforcing the shift towards digital payments solutions.n\n\nBank Alfalah launches Worklee\n\nBank Alfalah has launched Worklee, a human resources hiring and remote working app, as per a press release. The application is designed to create diversified, inclusive and accessible employment opportunities for all segments of society. The initiative is particularly aimed at women who want to work remotely, persons with disabilities, and freelancers, removing barriers to accessing professional opportunities in a conventional work environment and thus enriching mutual experiences of both the resource as well as the bank.\n\nEmirates Group shares annual report\n\nThe Emirates Group released its 2024-25 Annual Report, achieving a new record profit of AED 21.2 billion ($5.8bn) as per a press release.\n\nThis is the first financial year that the United Arab Emirates’ corporate tax, enacted in 2023, is applied to the Emirates Group. After accounting for the nine per cent tax charge, the Group’s profit after tax is AED 20.5bn ($5.6bn).\n\nMeanwhile, the group’s revenue of AED 127.9bn ($34.9bn) saw a 6pc increase over the preceeding year and its level of cash assets at AED 49.7bn ($13.5bn) were 16pc higher compared to 31 March 2024.\n\nPublished in Dawn, The Business and Finance Weekly, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:10:17.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910492",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T03:18:41.000Z"
}
