{
  "title": "Barcelona edge closer to title with thrilling win over Real - Sport - DAWN.COM",
  "author": null,
  "content": "BARCELONA: Raphinha scored twice as Barcelona overcame a two-goal deficit to secure a crucial 4-3 home victory against rivals Real Madrid in a pulsating Clasico on Sunday, edging them closer to the La Liga title.\n\nThe victory extends Barcelona’s lead at the top of the standings to seven points over second-placed Real Madrid and with three matc­hes remaining, one more victory will clinch a 28th Spanish league title for the Catalans.\n\nBarca earned a fourth consecutive victory over Real in all competitions this season, and their second in less than a month, in a chaotic match in which both sides showed their usual defensive weaknesses.\n\nHowever, Barca seemed a much stronger and well organised team overall, dominating possession and creating several chances that were denied by an inspired keeper Thibaut Courtois who prevented Real’s loss from being by a larger margin.\n\nBarcelona can secure the La Liga title as early as Wednesday, should Real fail to win at Mallorca. However, regardless of Real’s result, a Barcelona victory in their city derby against Espanyol on Thursday would guarantee the championship for the Catalans.\n\nReal made a blistering start at the Montjuic Olympic Stadium, with a brace from Kylian Mbappe giving them a two-goal advantage.\n\nHe opened the scoring from the penalty spot after he was fouled inside the box by keeper Wojciech Szczesny in the fifth minute and extended their lead with a quick counter nine minutes later from an assist by Vinicius Jr.\n\nHowever, Barcelona responded swiftly with Eric Garcia, Lamine Yamal and Raphinha all finding the net within 15 minutes to overturn the deficit.\n\nGarcia headed home from a corner in the 19th minute, while Yamal scored the equaliser in the 32nd with another brilliant display of technique as he curled a superb shot from the right corner of the box just outside Courtois reach and inside the far post.\n\nTwo minutes later, a bad mistake by Mbappe in the midfield gifted Barca the ball, with Raphinha launching a quick counter and giving his side the lead with a tidy finish past a helpless Courtois.\n\nReal thought they had earned a second penalty in the 43rd minute but it was overturned due to an offside in the build-up and, one minute later, a costly error by captain Lucas Vazquez gifted Raphinha the goal that extended Barca’s lead.\n\nBarcelona came back strongly in the second half and had several chances denied by a string of stunning saves by Courtois.\n\nThey were shocked, however, when Mbappe reduced the deficit in the 70th minute after a quick counter attack by Vinicius, who ran up the right and put it on a plate for the France forward to complete his hat-trick.\n\nYet last year’s champions could not recover, leaving them on the brink of a season without silverware.\n\n“It was obviously very important to win today. It’s great to have this game after the Champions League, I think it’s already forgotten,” Yamal told Movistar Plus after they were knocked out of Europe in the semi-finals in a heartbreaking midweek loss to Inter Milan.\n\n“Suffering is what makes you strong and what teaches you to correct the mistakes you make. They didn’t create any clear-cut chances other than the goals.\n\n“It was very important to win today to get closer to the league title. We are delighted.”\n\nIn Saturday’s late match, Alexander Sorloth hit four goals in the first half-an-hour to power Atletico Madrid to a 4-0 win over Real Sociedad.\n\nThe Norwegian hitman’s quadruple helped Atletico tighten their grip on third place, while La Real slump to 12th.\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/6821438394c47.gif",
  "retrievedAt": "2025-08-23T14:10:27.705Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910407/barcelona-edge-closer-to-title-with-thrilling-win-over-real",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:45:49.000Z"
}
