{
  "title": "Young elephant crossing Malaysia highway with mother dies in accident - World - DAWN.COM",
  "author": null,
  "content": "A YOUNG elephant in the Malaysian state of Perak was killed in an accident with a lorry on Sunday while it was crossing a highway with its mother, drawing widespread sympathy after a video showed the mother elephant staying by her dead juvenile’s side.\n\nThe video circulating online, recorded from the view of a passing vehicle, shows the mother elephant with her head pressed against the side of the lorry, as if to free her juvenile which lay unmoving beneath the vehicle.\n\nAccording to local media outlet Sinar Harian, the accident occurred at around 2am on the East-West Highway and involved a lorry used for transporting chickens. Mr Yusoff Shariff, the director of the Perak Wildlife Protection and National Parks Department, said the agency was informed about the accident at around 3.30am.\n\nHe was quoted by Sinar Harian as saying that “a male elephant estimated to be five years old died after it was believed to have been hit by a lorry while trying to cross the road”. “Our staff were deployed to the location to carry out an operation to monitor and capture the mother elephant in order to move her to a safer area,” he said.\n\n“We had no choice but to use a sedative and pull her back into the forest with a four-wheel drive vehicle at around 9am,” Mr Yusoff was quoted as saying by local media outlet Harian Metro. Based on estimates, Mr Yusoff said the mother elephant is around 25 to 27 years old and weighs about 2.2 tonnes. He said the carcass of the dead elephant has been removed and will be buried.\n\nAccording to the International Union for Conservation of Nature, the Asian elephant is classified as endangered. Reasons for its decline include poaching, habitat loss and human-elephant conflict.\n\nMalaysian daily The Star reported that the Gerik district police chief, Superintendent Zulkifli Mahmood, said initial investigations revealed that the 28-year-old lorry driver noticed a large elephant on the right shoulder of the road. As the animal appeared to be grazing, the driver “continued driving when he saw that the situation was safe”, Supt Zulkifli said. “However, moments later, a baby elephant suddenly emerged from the forest on the left side and attempted to cross the road.\n\n“The short distance made it impossible for the driver to stop in time, resulting in a fatal collision. The baby elephant died at the scene.” Supt Zulkifli added that the mother elephant later became agitated and damaged the front of the lorry in a fit of rage. The lorry driver was unhurt.\n\nThe video of the incident drew sympathy from netizens for the mother elephant’s plight. “How sad it is for the mother – waiting for her child, but it’s not coming out (from under the lorry). She has a mother’s heart even though she is an animal,” said a netizen. “It’s as though the mother elephant is hoping her child is still alive,” said another.\n\nOthers pointed out that the incident had tragically occurred on Mother’s Day. The East-West Highway has seen several encounters between humans and elephants as the animals cope with a dwindling habitat. Perak Perhilitan has advised motorists to use the highway from 11am to 4pm to avoid elephants, reported local media.\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/682154ec30c44.gif",
  "retrievedAt": "2025-08-23T14:10:22.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910459/young-elephant-crossing-malaysia-highway-with-mother-dies-in-accident",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:55:16.000Z"
}
