{
  "title": "Outlawed Kurdish PKK says will disband, end armed struggle - World - DAWN.COM",
  "author": null,
  "content": "The Kurdistan Workers’ Party (PKK) announced on Monday its dissolution and the end of more than four decades of armed struggle against the Turkish state, the pro-Kurd ANF news agency reported.\n\n“The 12th PKK Congress has decided to dissolve the PKK’s organisational structure and end its method of armed struggle,” the group announced in a statement after holding its congress last week.\n\nThe PKK’s announcement to dissolve itself heeds a call by its founder Abdullah Ocalan, jailed on an island off Istanbul since 1999, who urged his fighters in February to disarm and disband.\n\nIn a letter, Ocalan urged the PKK to hold a congress to formalise the decision.\n\nDays later, the PKK’s leadership accepted Ocalan’s call, declaring a ceasefire.\n\nIn a speech on Saturday, President Recep Tayyip Erdogan hinted that news about a dissolution could come at any moment, adding that his government was determined to “save our country from the scourge of terrorism”.\n\n“We are advancing with firm steps on the path to the goal of a terror-free Turkiye,” he said.\n\nSeparately, Prime Minister Shehbaz Sharif welcomed the dissolution, calling it a significant step toward lasting peace and a terror-free Turkiye.\n\n“This historic development reflects the unflinching resolve of the Turkish leadership, under my dear brother President Recep Tayyip Erdogan and the Turkish nation, to continue their march forward towards reconciliation, unity and stability,” the premier said in a post on X.\n\n“Together, Pakistan and Turkiye remain committed to root out terrorism in all its forms and manifestations,” he added.\n\nThe PKK, designated a terrorist group by Turkiye, the United States and the European Union, has waged an insurgency since 1984.\n\nIts original aim was to carve out a homeland for Kurds, who make up about 20 per cent of Turkiye’s 85 million people.\n\nSince Ocalan was jailed, there have been various attempts to end the bloodshed, which has cost more than 40,000 lives.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/121300024369062.jpg",
  "retrievedAt": "2025-08-23T14:10:15.568Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910519/outlawed-kurdish-pkk-says-will-disband-end-armed-struggle",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T07:53:20.000Z"
}
