{
  "title": "Ordeal of PIA driver facing court hearings since May 9 - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says he was arrested after being spotted near Lahore corps commander’s house\n• Claims he was on duty with a pilot from Mian Mir area\n\nLAHORE: A driver serving in the Pakistan International Airlines’ (PIA) Limousine service continues to face arrest and court hearings, ever since he was picked up after being “spotted near the Lahore corps commander’s house” on May 9, 2023.\n\nShah Din, claims he was on official assignment, to pick up a PIA pilot from his residence in the Mian Mir locality.\n\nHe drove from The Mall towards the cantonment area and, on the suggestion of traffic police, proceeded towards Rahat Bakery and then turned towards CMH Hospital to reach the airport.\n\nThere, he was caught up in the crowd as PTI workers and supporters launched their violent protest at the intersection outside the corps commander’s residence.\n\nBut in the meanwhile, he was spotted in the vicinity on CCTV footage and through geo-fencing, and eventually booked and arrested.\n\nThe PIA Lahore Airport scheduling officer had written a letter to the SHO Sanda Police station soon after the arrest that the driver was on an official duty to pick up cockpit crew for the Jeddah flight on May 9, 2023 from his residence in Mian Mir. He requested the police officer that the driver be released as he was not involved in any illegal activities\n\nThe Airport Limousine Services (Pvt) Ltd also issued a certificate in September, 2023 explaining that he was on official duty on May 9. They requested that the driver be released. However, the requests went in vain and the elderly driver is still facing the unending ordeal.\n\nPenning down the nightmare he is facing, Mr Din has written a statement that he is working as a driver at the Lahore Airport and in possession of a service record, official ID card and official letter.\n\nOn May 9, 2023, he claimed to be on an official duty and picked up PIA Pilot Captain Salahuddin Yousaf from his residence in Mian Mir Colony and left for the airport.\n\nNear Rahat Bakery, he said, he saw a massive traffic jam and he changed the route.\n\n“I received calls from my home and told family members that he had safely reached the airport and dropped the pilot for his Lahore-Jeddah flight PK-759,” he stated and added that he reached home after completing his duty. “All the information is available on the PIA record.”\n\nAfter four days, he said, police raided his residence on May 14, desecrated the sanctity of four walls and arrested him for riots on May 9. He was taken to Burki and investigated for three days.\n\nHowever, Mr Din stated that he was booked under FIR 1570/23 (Mughalpura police station), produced before an anti-terrorism court and eventually sent to the Camp Jail.\n\nIn a two-page statement, Mr Din stated that he was granted bail on May 27 on an application filed by his children. However, he lame­nted that he was re-arrested as soon as he came out of the jail. He said that he had developed serious heart ailment due to mental and physical torture while in detention.\n\nMr Din said he was later released but his ordeal did not end as he was arrested for the third time on Oct 16 after being booked in an FIR 96/23 at Sarwar Road police station and was kept in jail for over six months before he was released on bail.\n\nHe said that he has so far attended 42 court hearings.\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:01:39.676Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910446/ordeal-of-pia-driver-facing-court-hearings-since-may-9",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:45:36.000Z"
}
