{
  "title": "Woman shot dead over monetary dispute in Attock - Pakistan - DAWN.COM",
  "author": null,
  "content": "TAXILA: Police on Sunday arrested a suspect who shot dead a woman trader over a monetary dispute in Mehmoodabad area, within the limits of Attock police station.\n\nAmna Nawaz reported to police that her mother worked as a clothes merchandiser. On Sunday, she went to Shahnaz Bibi’s house to recover an outstanding amount; however, Shahnaz refused to pay her the money. During heated arguments, Shahnaz’s son, identified as Arsalan, pulled out a pistol and shot her mother, killing her on the spot.\n\nLater, the police arrested the nominated accused and recovered a pistol used in the cold-blooded murder of the woman.\n\nMeanwhile, Attock police claimed on Saturday to have arrested two proclaimed offenders (POs) wanted in different crimes by various police stations in the district.\n\nThe police spokesman stated that the suspects were declared proclaimed offenders (POs) in several cases and had been at large for a long time.\n\nThe police spokesman added that the Fatehjang police arrested a PO, Waqas Shabbir, while the city police apprehended another PO, Aurangzeb.\n\nOn the other hand, Wah Cantonment police arrested two suspects who shot dead a man during a botched robbery incident.\n\nThe police spokesman reported that the suspects, identified as Usama Khan and Nadeem, shot dead Khurram Mukhtar in Mohra Nasiro on May 5.\n\nPolice, through human intelligence, arrested the suspects and recovered the weapons used in the murder.\n\nPublished in Dawn, May 12th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-23T14:10:24.470Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910415/woman-shot-dead-over-monetary-dispute-in-attock",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T01:46:10.000Z"
}
