{
  "title": "Prosecutor says Sean ‘Diddy’ Combs forced women to participate in sex parties, blackmailed them with videos - World - DAWN.COM",
  "author": null,
  "content": "Hip-hop mogul Sean “Diddy” Combs went on trial on sex trafficking charges on Monday, with prosecutors saying the Bad Boy Records founder lured women into romantic relationships, forced them to take part in days of drug-fuelled sex parties and then blackmailed them with videos he recorded of the encounters.\n\nCombs “viciously attacked” women when they resisted taking part in the parties, known as ‘freak offs’ or otherwise upset him, prosecutor Emily Johnson said during her opening statement in Manhattan federal court.\n\nShe told jurors they would hear testimony from victims who said Combs, 55, routinely beat them and exploded with rage at the smallest slights. The case has drawn intense media coverage because of Combs’ fame.\n\n“They will tell you about some of the most painful experiences of their lives. The days they spent in hotel rooms, high on drugs, dressed in costumes to perform the defendant’s sexual fantasies,” Johnson said.\n\nDefence lawyer Teny Geragos countered that prosecutors were trying to twist Combs’ romantic relationships into a racketeering and sex trafficking case.\n\n“Sean Combs is a complicated man, but this is not a complicated case. This case is about voluntary choices made by capable adults in consensual relationships,” Geragos said in her opening statement.\n\nCombs has pleaded not guilty to five felony counts of racketeering conspiracy, sex trafficking and transportation to engage in prostitution. If convicted on all counts, he faces a mandatory minimum sentence of 15 years and could face life in prison.\n\nCombs’ mother, Janice Combs, sat in the front row of the courtroom along with six of her son’s children. Combs wore a beige sweater over a white collared shirt and khakis. He smiled at his family and blew them a kiss before taking his seat with his lawyers.\n\nProsecutors have accused Combs of using his fame and fortune to abuse women. The defence is expected to counter that the activity described by prosecutors was consensual, and say there was nothing illegal about a “swingers” lifestyle in which Combs and his girlfriends occasionally brought a third person into their relationships.\n\nOver the course of a two-month trial, jurors are expected to hear testimony from three and possibly four of the rapper’s female accusers, as well as his former employees who prosecutors say helped arrange and cover up his actions.\n\nAllegations of sexual abuse in the criminal charges brought against Combs by the Manhattan US Attorney’s office last year made him the latest powerful man in the entertainment industry to be accused of sexual misconduct in the wake of the #MeToo movement, which encouraged women to speak up about abuse.\n\nCombs is known for turning rap and rhythm and blues artists like Notorious BIG. and Mary J Blige into stars, and in the process elevating the mainstream appeal of hip-hop in American culture in the 1990s and early 2000s.\n\nBorn in Manhattan’s Harlem neighbourhood and raised by a single mother, Combs went on to live in mansions in Miami and Los Angeles and host lavish parties for the cultural elite in destinations like the Hamptons and Saint-Tropez.\n\nProsecutors say his success concealed a dark side. Over two decades, Combs used violence and threats to force women to take part in the ‘freak offs’, according to the indictment.\n\nCombs would often watch the performances, masturbate and film them, sometimes using the recordings as blackmail to ensure his alleged victims did not report his abuse, prosecutors say.\n\nIn one 2016 incident that was captured on hotel surveillance footage that prosecutors plan to show the jury, Combs was seen kicking and dragging a woman as she was trying to leave a ‘freak off’, prosecutors say.\n\nCNN last year broadcast footage that appeared to show Combs attacking his former girlfriend, the rhythm and blues singer Casandra Ventura, in 2016 in a Los Angeles hotel hallway. Combs apologised after the video aired.\n\nVentura, known professionally as Cassie, is among the first witnesses expected to testify against Combs.\n\nCombs’ defence strategy at trial will hinge on undermining the credibility of the women who testify against Combs, including by arguing they were motivated by money to accuse him of wrongdoing and have unreliable memories.\n\nMarc Agnifilo, Combs’ lead lawyer, has said the 2016 hotel incident depicted the aftermath of a dispute over infidelity and was not evidence of sex trafficking. In a court hearing on Friday, Agnifilo said Ventura had a history of domestic violence, undercutting prosecutors’ argument that she was a victim.\n\nVentura’s lawyer declined to comment.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/12221031058614a.jpg",
  "retrievedAt": "2025-08-23T14:10:11.560Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1910584/prosecutor-says-sean-diddy-combs-forced-women-to-participate-in-sex-parties-blackmailed-them-with-videos",
  "dateList": "2025-05-12",
  "date_published": "2025-05-12T17:14:04.000Z"
}
