{
  "title": "583 new Coronavirus cases reported; nine deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/583-new-coronavirus-cases-reported-nine-deaths-in-past-24-hours/",
  "date_published": "2020-10-08T06:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 08 (APP): The total active COVID-19 cases in Pakistan on Thursday were recorded 8,015 as 583 more people tested positive for the deadly virus during the last 24 hours.\nNine corona patients, who were under treatment in hospital died on Wednesday, according to the latest update issued by the National command and Operation Centre (NCOC).\nNo COVID affected person was on ventilator in Azad Jammu and Kashmir (AJK) and Balochistan, while 76 ventilators elsewhere in Pakistan, out of 1,912 allocated for COVID-19 patients, were occupied.\nSome 31,168 tests were conducted across the country on Wednesday, including 9,094 in Sindh, 10,712 in Punjab, 3,797 in Khyber Pakhtunkhwa (KP), 5,398 in Islamabad Capital Territory (ICT), 1,274 in Balochistan, 444 in Gilgit Baltistan (GB), and 449 in Azad Jammu and Kashmir (AJK).\nAround 302,375 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 316,934 cases were detected so far, including AJK 2,937, Balochistan 15,460, GB 3,886, ICT 17,009, KP 38175, Punjab 100,272 and Sindh 139,195.\nAbout 6,544 deaths were recorded in country since the eruption of the contagion, including 2,535 Sindh among 4 died in hospital on Wednesday, 2,247 in Punjab two of them died in hospital on Wednesday, 1,263 in KP, 187 in ICT three of them in hospital on Wednesday, 146 in Balochistan, 89 in GB and 77 in AJK.\nA total of 3,761,389 corona tests have been conducted so far, while 735 hospitals are equipped with COVID facilities. Some 744 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T19:52:46.098Z"
}
