{
  "title": "Big difference stands between situations in AJK and IIOJK : AJK President.",
  "link": "https://www.app.com.pk/national/big-difference-stands-between-situations-in-ajk-and-iiojk-ajk-president/",
  "date_published": "2020-10-08T15:41:00.000Z",
  "source": "APP",
  "content": "MIRPUR  (AJK): Oct 08 (APP): Azad Jammu and Kashmir (AJK), President Sardar Masood Khan has said “there is a huge difference between the situations in Indian Illegally Occupied Jammu and Kashmir (IIOJK) and the liberated part of the Kashmir that also draws a clear distinction between freedom and subjugation”.\n“The people of Azad JAMMU Kashmir (Free Kashmir) have all the basic rights and civil liberties, the army does not patrol in the streets of cities and towns, the citizens are not arrested, detained or abducted against their will and made enforcably disappeared”, the AJK President underlined.\nHe expressed these views while talking to a delegation led by Amanda Davis, Acting High Commissioner of Australia to Pakistan that called on him at Awan-i-Sadron Thursday.\nPresident Masood said that the inhuman and barbaric atrocities of the Indian occupation forces in occupied territory were the gross violations of human rights.\nIndiscriminate firing from across the LoC on the citizens of Azad Kashmir was cause of the biggest concern for both the government and the people of the liberated territory, he said.\nAJK President told Australian diplomats that the Indian Army had violated the ceasefire 2400 times since the beginning of this year, inflicting casualties on the civilian population of Azad Kashmir and causing heavy damage to civilian property.\nThe majority of those killed and injured by Indian firing are women and children, the President said and asserted that targeting non combatant civilian without any provocation is crime and a clear violation of international law.\nKhan said that the second major challenge facing the government of Azad Jammu and Kashmir was to take care of the refugees who have been forced to take shelter in AJK due to the atrocities of the Indian army.\nAJK government, he said, provided these refugees residential facilities, food and catering their need of education and health in collaboration with Pakistan government.\nApprising the delegation about AJK government and its priorities, President said that the AJK government was focusing very diligently on good governance and economic development, especially in the areas of road infrastructure, hydropower generation, quality education, wider access to health facilities, promotion of tourism, and development of industrial, agricultural and telecommunications sectors.\nCommenting on China-Pakistan Economic Corridor (CPEC), Sardar Masood Khan said that it would bring immense benefits to the people of AJK and Gilgit-Baltistan.\nThe establishment of a Special Economic Zone (SEZ) and construction of Mansehra, Muzaffarabad, Mirpur, and Mangla expressway will connect most of areas of Azad Kashmir with the CPEC route that will bring about a major and significant change in the lives of the people here.",
  "retrievedAt": "2025-08-11T19:52:47.225Z"
}
