{
  "title": "PM for also providing manual complaint lodging facility to people for redressal of complaints by PCP",
  "link": "https://www.app.com.pk/national/pm-for-also-providing-manual-complaint-lodging-facility-to-people-for-redressal-of-complaints-by-pcp/",
  "date_published": "2020-10-08T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP): With 2.8 million people approaching Pakistan Citizen’s Portal (PCP) through smart phones or internet for redressal of their complaints, Prime Minister Imran Khan has directed for the provision of manual complaint lodging facility to people belonging to remote rural areas having no smart phones or internet access.\nThe facility of complaint lodging manually would be provided to those who have neither smart phones nor internet access; unable to read/write; physically challenged; women/widows and elderly/ senior citizens; whose destination of service delivery or issue dealing office far away etc.\nIn that respect, Prime Minister’s Delivery Unit (PMDU) has also been directed to convene briefing session for all focal persons and also launch public awareness campaign through PTV, Radio Pakistan and other private media channels and social media platforms, a press release issued by PMDU here on Thursday said.\nPCP was being used as a tool to promote citizen centric participatory governance.\nOn one side, it provides a nation-wide window to connect people with government organizations for raising their issues while on the other side, it helps promote the culture of quantified performance management and make the various government entities accountable for their mandated roles and responsibilities.\nIt also helps the policy makers to identity policy gaps and grey areas in the service delivery regime for timely intervention and improvement\nSince October 2018, PCP has been successfully providing remote connectivity with government authorities to a large number of people in the country.\nIt has proved as a vibrant tool for raising issues pertaining to governance and service delivery.\nInitially, complaint lodging was possible through smart phones while web-based version of PCP and holding of Khuli Kachehris by 24 Federal Organizations have recently been added to enhance users access.\nDespite limited number of smart phone users in the country, still 2.8 million have registered on the system in the last two years.\nPrior to launching of the system, the prime minister had desired during a briefing held on 16-10-2018 that all available options shall be explored whereby access to all segments of the society could be ensured.\nIt was desired that besides smart phones and web-based accessibility to PCP, people who were either illiterate or belonging to remote rural areas or have no smart phones or internet access should also be catered for.\nIn view of the above, the prime minister has directed that all officers having PCP-dashboards shall, besides processing their own complaints, provide manually complaint lodging facility from their respective dashboards to the people of respective localities.",
  "retrievedAt": "2025-08-11T19:52:50.299Z"
}
