{
  "title": "Razak supports “Make in Pakistan” initiative led economic growth",
  "link": "https://www.app.com.pk/national/razak-supports-make-in-pakistan-initiative-led-economic-growth/",
  "date_published": "2020-10-08T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 8 (APP): The Advisor to the Prime Minister on Commerce and Investment, Abdul Razak Dawood on Thursday reiterated the government’s commitment to support the “Make in Pakistan” initiative led economic growth.\nThe 16h meeting of the Tariff Policy Board (TPB) was held here, in the Committee Room of the Ministry of Commerce, under the Chairmanship of the Advisor to the Prime Minister on Commerce and Investment, Abdul Razak Dawood, said a press release issued by Ministry of Commerce.\nThe meeting was attended by the Secretary, Ministry of Commerce, the Chairperson, National Tariff Commission (NTC), Member Customs Operations, Federal Board of Revenue (FBR), Additional Secretary, Ministry of Industries and Production, Director, Board of Investment, and other senior officials of the concerned ministries.\nIn order to achieve this objective, import duties on 1623 Tariff Lines, pertaining to basic raw material and intermediate goods had been reduced to zero through the Finance Act, 2020.\nIn continuation of this Policy, Additional Customs Duties and Regulatory Duties on 164 items related to Textile sector, not manufactured in Pakistan, had been recently removed by the Federal Cabinet.\nIn order to move forward and to remove Additional Customs Duties on remaining raw materials, not manufactured in Pakistan, different proposals were discussed by the members of TPB.\nThe members of TPB opined that there is an urgent need to remove anomalies in the tariff structure so that cost of doing business could be reduced by providing cheap raw materials to the Industrial Sector.\nThis would also help to improve competitiveness of our exports vis-a vis trading partners of Pakistan.\nThe TPB approved further working on 152 tariff Lines for removal of Additional Customs Duty.\nThe Chairperson, NTC briefed the members of TPB on progress, made so far, in conducting study of Plastics Sector.\nThe Advisor stressed that sectoral studies ought to be completed within the given time line so that tariffs rationalizations could be done in those sectors by taking into account the recommendations of the studies.\nAt the end of the meeting, the Advisor remarked that in pursuance of the objectives of National Tariff Policy 2019-24, meetings of the TPB are being held on regular basis. Prior to this Policy, proposals regarding tariff rationalizations were mostly discussed at the time of budget exercise.\nHe further stated that as per vision of the Prime Minister, the tariffs are being used as instrument of trade policy so that manufacturing sector in Pakistan could be strengthened.",
  "retrievedAt": "2025-08-11T19:52:45.970Z"
}
