{
  "title": "SSDO to organise dialogue: “Empowering Minority Vioces”",
  "link": "https://www.app.com.pk/national/ssdo-to-organise-dialogue-empowering-minority-vioces/",
  "date_published": "2024-08-13T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP):Sustainable Social Development Organization (SSDO) and the National Commission for the Rights of the Child (NCRC) organized a dialogue titled “Empowering Minority Voices: Advancing Social Inclusion, Legal Protection, and Social Harmony with a Focus on Minority Children” on Tuesday.\nThis event was organized in connection with “National Minority Day,” and brought together key stakeholders to discuss and address the critical issues facing religious minorities in Pakistan, particularly minority children.\nThe event commenced with a welcome address by Executive Director of SSDO, Syed Kausar Abbas who set the tone for the day by emphasizing the importance of inclusion and legal protection for minority communities. He reiterated that Jinnah envisioned Pakistan as a democratic state founded on the principles of equality, justice, and religious freedom.\nHe emphasized the importance of unity and a nation where all citizens, regardless of faith or ethnicity, could live with dignity and equal rights. He informed that SSDO has launched the Azm-i-Masawat program to empower the youth of religious minorities, aligning with Jinnah’s vision of Pakistan.\nHe said that the program offers fellowships where youth of religious minorities receive training in functional English, leadership skills, advocacy, and entrepreneurship. This initiative promotes inclusivity, ensuring that minority youth are equipped to contribute meaningfully to the nation’s development, he maintained.\nThe guests of honor, Member of the National Assembly (MNA), Sehar Kamran highlighted the government’s commitment to promoting social harmony and ensuring the rights of all minority communities, particularly focusing on the challenges faced by minority children. She said, “Pakistan People’s Party (PPP) has made history by appointing the first Hindu judge and electing Senator Anwar Lal Deann, the first Christian Senator, and Keshoo Bai, the first Hindu woman Senator”.\n“Currently Deputy Speaker Provincial Assembly of Sindh belongs to the Christian community and two parliamentarians, Mahesh Kumar Malani and Anthony Naveed, who are non-Muslims but elected on General Seats on the part ticket. These milestones reflect our commitment to ensuring that minorities are not just seen, but heard and play a significant role in shaping policy and legislation”, he continued.\nTwo comprehensive panel discussions were the cornerstone of the event, providing in-depth analysis and diverse perspectives on the multifaceted challenges confronting minority communities.\nThe first panel discussion, titled, “Promoting Inclusion and Addressing Challenges Faced by Minority Children,” focused on key issues such as access to education and employability, access to justice in cases of violence against children and trafficking, and the impact of climate change on these vulnerable communities.\nPanellists included Pirbhu Satyani, Member Sindh/Minorities NCRC; Shahid Khan, Senior Director at SSDO; Sehar Taimoor from Save the Children; Dr. Mirza Mehsood from Ministry of Religious Affairs; and Dr. Sono Khangrani from TRDP. Moderated by Habiba Salman from NCRC, the session underscored the urgent need for inclusive policies and the removal of barriers that hinder the educational and professional growth of minority children.\nPirbhu Lal Satayani highlighted the challenges faced by children from religious minority communities in Pakistan, focusing on the limitations of the 5% job quota. He expressed deep concern over the alarming rates of school dropouts and the high number of out-of-school children in these communities.\nAdditionally, he raised critical issues regarding the recruitment of children into hazardous and banned occupations, such as brick kilns, as outlined in the 1919 Act of Prohibition of Hazardous Occupations, calling for immediate action to protect these vulnerable children.\nDr. Sono Khangarani of TRDP highlighted the severe challenges faced by religious minorities in Sindh, noting that over 88% of the land they inhabit is submerged by floodwaters annually, yet these communities have consistently been neglected in government emergency response efforts.\nHe emphasized that the lack of land ownership forces these minorities to live as nomads, constantly moving from place to place, which not only deprives their children of access to education but also excludes them from participating in the national polio eradication program.\nDr. Khangarani further pointed out the critical lack of research and evidence on the conditions of religious minorities, leading to poor planning, inadequate budget allocation, and under-representation in key forums that shape the rights and protections of these vulnerable communities.\nEducation Advisor, Sehar Taimoor at Save the Children, urged the Government of Pakistan to significantly increase its education budget from the current 1.7% to over 4% of the GDP. She emphasized that this substantial investment is crucial to ensuring the well-being and future of marginalized children, who are often left behind due to insufficient educational resources and support.\nDirector of SSDO, Shahid Khan Jatoi emphasized the heightened vulnerability of children from religious minority communities, who face an increased risk of falling victim to human trafficking, forced conversions, and child marriages. He underscored the urgent need for effective measures to raise awareness of the Trafficking in Persons Act 2018, not only among law enforcement agencies but also across the broader population.\nJatoi called for comprehensive training and outreach efforts to ensure that these children are protected from exploitation and that their rights are upheld in accordance with national and international legal standards.\nThe second panel discussion, titled “Interfaith Harmony & Coexistence,” explored the challenges to interfaith coexistence and the role of religious leaders and communities in promoting harmony. The panel also discussed best practices for fostering religious harmony from a child’s perspective and future directions for improving interfaith relations.\nThe panel featured insights from Muhammad Kashif Irshad, Advisor on National Heritage to the Government of Pakistan; Romana Bashir, a representative of the Christian community; Dr. Inam Ullah, Director General of Research at the Council of Islamic Ideology (CII); Peer Syed Mudassir Shah, Chairman of the Sufi Council of Pakistan; Shagufa Jamal, a representative of the Bahai community; and Haroon Sarab Diyal, a representative of the Hindu community. Maham Afridi served as the moderator for this session.\nDuring the discussion, Haroon Sarab Diyal called for the inclusion of information on all religions in school curriculum to help all children understand the true essence of religious harmony.\nRomana Bashir stated that the law and justice system need to work effectively to end religious extremism and violent acts against religious minorities.\nMuhammad Kashif Irshad remarked that the people of Pakistan have coexisted on this land for centuries, fostering a history of peaceful living. He emphasized the need to revive and strengthen the traditions of harmony and brotherhood that have long been the foundation of this region’s diverse communities.\nDr. Inam Ullah advocated for the establishment of special courts dedicated to investigating atrocities against religious minorities.\nHe emphasized that in a country where 2.6 million children are out of school, the root of many societal issues lies in the lack of education. He stressed that addressing this educational deficit is crucial to tackling the broader challenges facing the nation.\nShagufa Jamal suggested that the draft bill for the National Commission on Religious Minorities be renamed to, “The National Commission on the Rights of Religious Minorities.” She emphasized that this commission should operate independently rather than being integrated within the Ministry of Minority Affairs, to ensure a more impartial and effective advocacy for the rights of religious minorities.\nThe event concluded with a Q&A session, allowing participants to engage directly with the panellists, fostering an interactive dialogue on the strategies discussed. SSDO and NCRC reiterated their commitment to continuing these dialogues and working collaboratively with all stakeholders to advance the rights and welfare of minority children in Pakistan.",
  "retrievedAt": "2025-08-11T04:35:57.473Z"
}
