{
  "title": "Federal govt paying special attention on development of Balochistan: Ishaq Dar",
  "link": "https://www.app.com.pk/national/federal-govt-paying-special-attention-on-development-of-balochistan-ishaq-dar/",
  "date_published": "2024-08-13T16:47:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 13 (APP): Deputy Prime Minister Muhammad Ishaq Dar on Tuesday said that federal government under the leadership of Prime Minister Shahbaz Sharif, was paying special attention on durable development of Balochistan.\nHe expressed these views while chairing a meeting regarding improvement of law and order situation and development projects in Balochistan at the Chief Minister’s Secretariat Quetta during his visit.\nThe meeting was attended by Speaker National Assembly Sardar Ayaz Sadiq, Federal Minister for Commerce Jam Kamal Khan, Member National Assembly Mir Ijaz Jakrani, provincial ministers of Balochistan and senior officers.\nAddressing the meeting, Ishaq Dar said that Balochistan was close to the heart of the Prime Minister and the federal government had assured that steps would be taken to solve the problems of the province. Balochistan must get all its legitimate rights, he said.\nThe deputy prime minister said that the economic situation was difficult, but it was not hopeless, the future of Pakistan was bright.\nIshaq Dar said that there were temporary economic difficulties, but with continuous hard work and firm determination, Pakistan would be led on a sustainable path of development.\nFormulating a comprehensive roadmap for long-term planning, we will take all the stakeholders together to solve the problems of Balochistan, he said.\nThe deputy prime minister said that Balochistan Chief Minister Mir Sarfaraz Bugti and his team were the guarantors of the development of Balochistan and the federal government would provide all possible support for the solution and progress of the problems of Balochistan.\nEarlier, highlighting the ongoing development projects and law and order situation in the province during the meeting, Balochistan Chief Minister Mir Sarfraz Bugti said that the improvement of education and health in Balochistan was the top priority of the provincial government.\nHe said that reforms were being carried out in various sectors to improve governance, we believed that a strong relationship of trust between the state and the people could be established only by correcting the governance.\nThe CM said that a scholarship program has been started for PhD science students of Balochistan in 200 top universities of the world and introduced special scholarship programs for the deprived sections including minorities and transgender community.\nMir Sarfraz Bugti said that the problems of the province related to backwardness could be solved through uniform development. He said that the release of funds from the center for federally approved development projects was at a very limited level, if this ratio continues, it would not be possible to complete federally funded development projects for decades to come.\nHe said that firm determination and practical steps of the federal government were indispensable to bring Balochistan at par with other provinces.\nThe chief minister presented a comprehensive comparison of law and order in the meeting and also mentioned the problems and challenges faced in detail.\nAt the end of the meeting, Speaker National Assembly Sardar Ayaz Sadiq said that Prime Minister Muhammad Shahbaz Sharif would soon visit Balochistan and would consult with stakeholders to resolve the issues. Steps will be taken repeatedly for the development of Balochistan and to raise the living standard of its people, he said.",
  "retrievedAt": "2025-08-11T04:35:34.923Z"
}
