{
  "title": "Ahsan, Mashhood emphasize significance of Independence Day at the “Istehkam-e-Pakistan” seminar",
  "link": "https://www.app.com.pk/national/ahsan-mashhood-emphasize-significance-of-independence-day-at-the-istehkam-e-pakistan-seminar/",
  "date_published": "2024-08-13T11:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP): The Islamic Research Institute of the International Islamic University (IIU) organized a flag-hoisting ceremony and a national seminar titled “Istehkam-e-Pakistan” on Tuesday at the Faisal Masjid campus as part of the Independence Day celebrations.\nThe event was graced by Federal Minister for Planning Ahsan Iqbal, Chairman of the Prime Minister Youth Program Rana Mashood Ahmed Khan, Rector IIU Professor Dr. Samina Malik, along with Vice Presidents, the Director General of the Islamic Research Institute, and a large gathering of teachers and staff members.\nIn his address, Federal Minister Ahsan Iqbal emphasized the significance of Independence Day as a moment to honour the immense sacrifices made by Muslims.\nHe highlighted that Quaid-e-Azam Muhammad Ali Jinnah’s leadership was instrumental in securing the rights of the oppressed in British India.\nThe minister underscored that the creation of Pakistan on August 14 was not just a historical event but a triumph of ideology—an ideology championed by Quaid-e-Azam and Allama Iqbal that became a beacon of hope in the struggle for freedom.\nHe noted that the founding fathers envisioned Pakistan as a thriving state. Despite initial skepticism about Pakistan’s viability, the nation has emerged as a nuclear power, he added.\nAddressing the contemporary challenges, Ahsan Iqbal expressed confidence in the resilience and intelligence of the Pakistani people, asserting that pessimists will not succeed in their negative agendas.\nHe elaborated on the importance of peace, political stability, continuity in policies, and reforms as essential ingredients for development, lamenting the disruption of the Vision 2010 and Vision 2025 development plans.\nThe minister reaffirmed his commitment to overcoming unemployment and inflation and fighting against corruption and anarchy, which he described as major obstacles to national progress.\nPaying tribute to national hero Arshad Nadeem, Ahsan Iqbal praised him as a symbol of hard work and determination, urging the youth to follow his example.\nChairman of the Prime Minister Youth Programme (PMYP) Rana Mashhood Ahmed Khan, in his remarks, stated that thriving nations learn from their mistakes.\nHe reflected on the vision of Pakistan’s founders, who established the country to uphold minority rights and serve as a bastion of Islamic values.\nHe highlighted the achievements of Arshad Nadeem, noting that his success demonstrates that determination can overcome resource constraints.\nRana Mashhood affirmed that the PM Youth Program is designed to empower the nation’s youth, emphasizing that the current government is committed to realizing the dreams of Allama Iqbal and Quaid-e-Azam while safeguarding the fundamental principles of Pakistan.\nHe also stressed the crucial role of sincerity and dedication in the development of nations.\nIn her presidential address, Rector Dr. Samina Malik spoke about the invaluable gift of freedom, urging the audience to appreciate its worth by considering the plight of those who lack it.\nShe emphasized that unity is the cornerstone of national development and lauded the International Islamic University for its consistent contributions to the country’s progress.\nDr. Malik called for prioritizing education and addressing the financial challenges faced by educational institutions, as these are vital to the nation’s growth. She encouraged the youth, reminding them that the entire nation looks to them with hope and expectation.\nDr. Zia-ul-Haq, Director General of the Islamic Research Institute, discussed the objectives of the flag-hoisting ceremony and the seminar.\nHe expressed the joy and pride felt by every Pakistani during the Independence Day celebrations and mentioned that an exhibition showcasing Pakistan’s rich history and traditions was organized in conjunction with the Pakistan Day observance.\nEarlier in the day, Professor Ahsan Iqbal and Rana Mashhood Hussain participated in the plantation drive by planting saplings on the Faisal Masjid campus, following the flag-hoisting ceremony.\nAfter the ceremony, Rana Mashhood inaugurated an exhibition highlighting Pakistan’s rich history and heritage, coinciding with Pakistan Day, and also toured the Dr. Hameedullah Library.\nIn a related event, a cake-cutting ceremony was held at the university’s new campus to celebrate Independence Day.\nRector IIU Dr Samina Malik and Acting President IIU Dr Muhammad Sarwar Joined the ceremony. Student advisors, female campus in-charge, provosts and senior faculty members were also present on the occasion.\nOn this occasion, the Rector of IIU and the Acting President of IIUI planted saplings while Vice President Dr. Abdul Rahman was also present.",
  "retrievedAt": "2025-08-11T04:36:43.820Z"
}
