{
  "title": "Social Media platforms depicting enthusiasm as Pakistan turns 77",
  "link": "https://www.app.com.pk/national/social-media-platforms-depicting-enthusiasm-as-pakistan-turns-77/",
  "date_published": "2024-08-13T07:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP):The social/digital media is full with patriotic enthusiasm that is uniting the youth under the national banner where national songs are being shared, honoring the country’s epic freedom struggle.\nAs Pakistan celebrates its 77th Independence Day, social media platforms are overflowing with national pride, said a report aired by a private news channel. “Young Pakistanis are expressing on social media their patriotism and creativity, making and sharing videos that showcase their love for the country. It is inspiring to see”, said a citizen.\n“From short clips to full-length documentaries, young Pakistanis are using video content to showcase their patriotism and creativity. It is a wonderful way to celebrate 14 August,” said a female user on Facebook.\n“Youth are using social media platforms to share their own stories, experiences, and hopes for Pakistan’s future. It is a beautiful way to connect with others and celebrate our independence,” said another social media user.\n“The energy and enthusiasm of young Pakistanis making videos about 14th August is wonderful! It’s inspiring to see them take ownership of their heritage and share it with the world,” said an IT expert.\n“Pakistan is not just a country, it is a feeling of pride and honor. Happy 77th birthday to my beloved nation” wrote a youngster on Twitter.\nFrom the mountains to the sea, Pakistan is a land of beauty and diversity. Proud to be Pakistani”, said another young girl on Whats app group. “May our country continue to prosper and grow. Happy Independence Day to all Pakistanis” a elderly citizen of Lahore shared post on Instagram.\n“Social media has made it so easy to connect with fellow Pakistanis on days like 14th August. Feeling proud to see so many young people sharing patriotic posts and spreading love for our country”, said a famous TIk Toker.\n“It is amazing to see how social media can unite us all on days like 14th August. Let us keep sharing our patriotic spirit and making our country proud”, said a working women while sharing post on facebook.\n“Special days like 14th August remind us of the importance of social media in spreading love, unity, and patriotism. Keep sharing, Pakistan”, said a Teacher while sharing post and motivating youth to celebrate day with patriotic spirit.\n“I have seen groups of friends making videos together, singing patriotic songs, and sharing them on social media. It is a great way to bond over shared love for our country,” said a patriotic 10 years old child.",
  "retrievedAt": "2025-08-11T04:37:01.260Z"
}
