{
  "title": "Chairman PEC terms allegations of financial mismanagement as baseless, misleading",
  "link": "https://www.app.com.pk/national/chairman-pec-terms-allegations-of-financial-mismanagement-as-baseless-misleading/",
  "date_published": "2024-08-13T09:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP):Chairman Pakistan Engineering Council (PEC), Engr. Muhammad Najeeb Haroon Tuesday categorically refuted the allegations of financial mismanagement in PEC raised through some sections of media, terming these baseless and misleading.\n“PEC is a statuary regulatory body to regulate the engineering profession in totality has recently been subjected to baseless allegations and defamatory statements made by an individual in several press conferences and on TV Channels”, the chairman said while addressing a press conference here.\nThe chairman said, “These claims not only undermine the integrity of the Council but also attempt to tarnish the reputation of the other members and the engineering profession as a whole”.\nIt has also attracted an unwarranted threat to the functional autonomy of the Council as provided by PEC Act, 1976, which has been upheld by this Council for many years.\nPresenting the overview of PEC achievements, functions and commitment to its valued members and stakeholders, the chairman said that the PEC prides itself on operating with the highest standards of integrity, governance, and transparency, adherence to best practices.\nPEC’s processes are transparent and robust, with decision-making aligned with the directions of the Governing Body and other relevant forums as per provisions of the PEC Act, 1976 and Byelaws made there under.\nPEC operates through a committee-based structure, with both statutory and expert committees fulfilling various functions under the PEC mandate.\nHe said that every action taken by the Council is meticulously deliberated by the relevant expert committee, reviewed by the Management Committee and approved by Governing Body. All documentation is well maintained and has been made accessible to its members and stakeholders.\nThe Council, Najeeb Haroon said, is dedicated to promote excellence, ethical practices and enhance the professional growth of engineers.\nContrary to the claims and allegations of financial mismanagement, the Council’s financial records are well maintained and audited regularly by an external auditor appointed by the Council as per section 24(3) of PEC Act & Byelaws 64(3), through independent international QCR Chartered Accountant firms.\nThe audited accounts and the report are presented in the Governing BoD and Annual General Meetings and public to the engineers as per provision of section 5(d) of PEC Act 1976.\nHe explained that the Council has an internal audit mechanism spearheaded by a certified Chartered Accountant, ensuring transparency and accountability while PEC’s funds are judiciously managed to support the function of the Council.\nAbout the TA/DA policy of the Council, the chairman said that the policy is aligned with the federal government principles for its officials and with the decisions of relevant committee/fora for its members and duly approved by the competent forum  i.e. the Governing Body.\nTo ensure austerity, Najeeb Haroon said that online meetings are encouraged over physical ones by implementing specialized policy for online meetings and strict criteria has been tailored for holding such meetings.\nIt is worth mentioning that, in compliance with the directive of the Public Accounts Committee (PAC), the Council’s accounts were audited by the Auditor General of Pakistan (AGP), and the report was shared with the PAC.\nNo Governing Body members other than the Management Committee are provided vehicle.\nThe Management Committee are provided one vehicle with fuel of 300 L/month. GB members are provided pick and drop facilities for attending PEC official meetings.\nRegarding the registration and renewal fees for constructors, operators, and consultants, the chairman said that PEC has not increased the fees for the past six years and has provided various forms of relief.\nFees of constructor/operators ranging from CA/OA to C6/O6 are also as per provisions of Byelaws. The fees of construction firm (23450 Nos.) ranging from C6 to C3 categories which is 88% of total construction firms, are Rs.15000, Rs. 30000, Rs.45000, and Rs.75000, respectively, he explained.\nFor firms in the higher categories from C2 to CA (no-limit category), the fees range up to a maximum of Rs. 400,000 for no limit category.\nTo ensure transparency and authenticity, PEC, in collaboration with NADRA having 7000 e-Sahulat centers across the country, has introduced a biometric verification system to confirm engineers’ employment with their respective companies, preventing fraudulent practices and exploitation. Over the years, the Council has steadfastly upheld and advanced the engineering profession in Pakistan.\nDuring the current Governing Body’s tenure (2021-24), the chairman said,  numerous initiatives and reforms have led to significant milestones including extension of PEC’s full signatory status of Washington Accord for another six years, established the first ADR center for dispute  resolution of construction sector, Service Structures, updated the Pakistan Standard Bidding Documents as per international standards and revised the Price Adjustment Formula to address inflation.\nThe PEC established the Construction Industry Development Board , declared 2024 as IT Year, implemented e-office initiatives, established the Engineer Parliamentarians Caucus, partnered with the Pakistan Academy of Engineering (PAE) for research and policy studies, developed various codes including Building Code of Pakistan (BCP) 2021, Green Building Code of Pakistan 2023 and Rainwater harvesting provision for BCP led to global recognition by ICC during COP-28.\nPEC signed MoUs with China and Kuwait for job prospects, supported HEIs nationwide, financing Final Year Design Projects to fostering a culture of innovation and problem solving, organized Capstone Expos and implemented the Graduate Internship Training Program, showcasing the Council’s commitment to innovation, excellence, and a sustainable economy.\nNajeeb Haroon said that this Council has also urged its members and stakeholders to review the facts and reject these unfounded allegations. PEC commitment to transparency, accountability, and the betterment of the engineering profession remains unwavering.\nHe said that this Council will pursue appropriate legal action against any defamatory statements and continue to defend the integrity and independence of the engineering profession and the Council.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:37:07.899Z"
}
