{
  "title": "PTCL Group to provide managed WAN, All-In-One desktop project for ZTBL sites nationwide",
  "link": "https://www.app.com.pk/national/ptcl-group-to-provide-managed-wan-all-in-one-desktop-project-for-ztbl-sites-nationwide/",
  "date_published": "2024-08-13T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 13 (APP):Pakistan’s largest telecommunications and integrated ICT services provider, PTCL Group (PTCL & Ufone 4G), and the largest agriculture bank of Pakistan, Zarai Taraqiati Bank Limited (ZTBL) have signed an agreement for Managed WAN and All-In-One Desktop project for ZTBL sites nationwide.\nGroup Chief Financial Officer, PTCL & Ufone 4G, Nadeem Khan, and President & CEO ZTBL, Tahir Yaqoob Bhatti signed the agreement at PTCL office in Islamabad, in the presence of senior officials from both organizations, said a news release issued on Tuesday.\nUnder this agreement, PTCL Group will provide a Managed WAN solution for 500+ ZTBL Nationwide sites along with All-In-One desktop computers.\nSpeaking at the signing ceremony, Nadeem Khan, Group Chief Financial Officer, PTCL & Ufone 4G, said “PTCL Group is proud to be a major proponent of technological enablement and transformation in Pakistan. Our connectivity and ICT services provide a great deal of ease, robust security and enablement to our individual as well as enterprise customers, like ZTBL, serving more than 7.20 million consumers in Pakistan. We are steadfast in our commitment to further enhancing conduciveness for tech-based innovation and transformation in Pakistan.”\nPresident & CEO ZTBL, Tahir Yaqoob Bhatti said, “We are pleased to join hands with PTCL Group to provide greater connectivity to our clients, including farmers. ZTBL is on a path of transformation, and we are near to equipping our farmers with the latest scientific agriculture technology. PTCL Group and ZTBL will excel in leveraging technology to enable and empower their respective customers, besides contributing immensely to the growth and development in Pakistan. The mutual collaboration enhances the impact on a larger scale to help enrich and strengthen Pakistan’s economic landscape.\nPTCL Group’s B2B portfolio has exponentially grown over the years, which is a testament to the growing trust in the company’s innovative and reliable services. These services have not only fostered unparalleled efficiency and agility across various sectors but led a broad-based digitalization in the country, creating shared value in equal parts for the industry and national economy.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:36:20.620Z"
}
