{
  "title": "Future of Pakistan very bright: PM Junagarh State",
  "link": "https://www.app.com.pk/national/future-of-pakistan-very-bright-pm-junagarh-state/",
  "date_published": "2021-11-25T13:32:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 25 (APP): Future of Pakistan was very bright said Prime Minister of Junagarh State, Sultan Ahmed Ali said while attending Silver Jubilee celebrations here on Thursday at Pir Mehr Ali Shah-Arid Agriculture University (PMAS-AAUR).\nOn the occasion, Vice-Chancellor of PMAS-AAUR, Prof. Dr. Qamar-uz-Zaman, University Registrar, Muhammad Aqeel Sultan, the faculty members, notables, civil society members and a large number of students were present.\nDescribing the activities planned to celebrate the Silver Jubilee as the best, Sultan Ahmed Ali said that he was very happy to hear the speeches of the youth and had a firm belief that the future of Pakistan was very bright.\nHe said that Pakistan came into existence on the basis of the two-nation theory and now, Muslims of India were experiencing its importance and the Quaid’s vision so we had to respect that vision and not leave any stone unturned for its protection and honour in the world.\nDescribing the session as the best and unique to build the moral values of the students, the VC said, “Every person in Pakistan is running towards worldly education due to which we are moving away from Islam and its teachings which covers and guides every aspect of our life.”\nHe also asked the university administration to organize more seminars in this manner which would provide opportunities to the students to learn about Islam.\nMeanwhile, to spread awareness about the food insecurity issue, the ongoing situation in the country and the method to overcome this severe situation, a seminar was organized at PMAS- AAUR where the VC, Prof. Dr Qamar-uz-Zaman participated as a chief guest along with other keynote speakers, faculty and students.\nIn his address, Prof. Dr Qamar-uz-Zaman said that the problem of food security had taken over the world and the situation in Pakistan was getting worse day by day.\nIf, immediate solid steps were not taken to address this issue, in future, hostile elements could take advantage of it and damage the country’s integrity, he added.\nThe guest speakers Dr. Khalid Masood and Rizwan Khan suggested that all-out efforts should be made to alter bio-physical relationships for crops, livestock, fisheries, forests such as shortening of the growing periods, changing the species patterns, increasing thermal and moisture stresses, changing water requirements, altering soil characteristics for food security.\nLater, the VC of the HITECH University Taxila, Prof. Dr S. Kamran Afaq also visited PMAS-AAUR and inaugurated the IT stalls set up by the students and industry.\nDr. Kamran appreciated the university’s efforts towards quality education and the students’ active involvement in educational activities. He said that this type of enthusiasm and passion among the students would play an important role in future development of the country.\nOn fourth day of the Silver Jubilee Celebrations, a flower exhibition arranged by the university horticulture department was inaugurated by Chairman, Parks & Horticulture Authority, Rawalpindi and Special Assistant to CM Punjab Asif Mehmood. Vice-Chancellor, PMAS-AAUR Prof. Dr. Qamar-uz-Zaman along with all faculty & administrative staff members were present.\nIn the ceremony, Asif Mehmood appreciated efforts of the department and informed that PHA Rawalpindi was working hard to beautify the city.\nHe said, the efforts and inputs of the university students were needed to make the city clean and green which was assured by the VC.",
  "retrievedAt": "2025-08-11T21:39:33.498Z"
}
