{
  "title": "President upholds Mohtasib’s decision ordering credit of lost amount to bank fraud victim",
  "link": "https://www.app.com.pk/national/president-upholds-mohtasibs-decision-ordering-recredit-of-lost-amount-to-bank-fraud-victim/",
  "date_published": "2021-11-25T11:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): President Dr Arif Alvi on Thursday upheld the decision of the Banking Mohtasib directing a private bank to credit the lost amount of Rs 800,000 to the victim of bank fraud.\nRejecting the representation of the bank against the decision of the Mohtasib, the president observed that the bank was at fault for having incorporated the wrong contact numbers of the account holder in the bank system, which prevented any remedial step on receiving SMS alerts.\nComplainant Naveera, who maintained an account with Muslim Commercial Bank’s Gulshan-e-Ravi Branch, Lahore, suffered the loss after her account was debited by using an ATM Card at four different terminals.\nShe said the transactions were unauthorized as not been made by her and the ATM Card was throughout in her possession.\nShe also reported that no SMS alerts about the withdrawal of funds were conveyed to her except one received on 24-01-2019 intimating the withdrawal of Rs 200,000 from her account.\nOn receiving the SMS, she lodged a complaint with the bank, however, she was not provided with any relief. Subsequently, she approached the Banking Mohtasib to get a refund of Rs 800,000 withdrawn from her account fraudulently.\nThe Banking Mohtasib in its decision observed that additional contact numbers of the complainant had been added in the bank’s record without any authorization from the account holder, therefore, SMS regarding cash withdrawal transactions could not be received by the complainant. Moreover, the bank had changed her PIN Code on 21.01.2019, just three days before the transactions, after receiving a phone call from an imposter as the Phone Banking Officer did not probe the caller.\nThe bank admitted during the hearing that the voice of the caller was different from the voice of the lady complainant.\nAdditionally, the legible CCTV footage and snapshots of disputed transactions with date and time were not visible as the bank was found negligent to implement the State Bank of Pakistan’s guidelines regarding the installation of cameras in ATM cabins to have secondary evidence and to monitor all activities in the ATM vicinity.\nThe Mohtasib in its decision stated that the bank was under obligation to prove with cogent reasonable evidence that transactions were conducted by the complainant or were conducted by any person under her mandate.\nThe Ombudsman, therefore, ordered the bank to make good the loss by crediting the account of the complainant with a sum of Rs 800,000.\nLater, the bank filed a representation with the President, which he rejected observing that the bank miserably failed to fulfil its statutory liability and rebut the claim of the complainant by failing to provide any justification to set aside the orders of the Banking Ombudsman.\nHe noted that as per the law, the Banking Mohtasib was required to inquire into the complaints about banking malpractices, maladministration, wrongdoings, fraudulent transactions, the corrupt and mala fide practices by the bank officials and pass appropriate orders on conclusion of the inquiry.\nThe President rejected the representation of the private bank as no fault could be found with the Banking Mohtasib’s approach to the matter.",
  "retrievedAt": "2025-08-11T21:39:36.659Z"
}
