{
  "title": "Pakistan, South Africa sign agreement for establishment of joint commission",
  "link": "https://www.app.com.pk/national/pakistan-south-africa-sign-agreement-for-establishment-of-joint-commission/",
  "date_published": "2021-11-25T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Pakistan and South Africa Thursday signed an agreement for the establishment of the Pakistan-South Africa Joint Commission providing for an institutional mechanism for bilateral cooperation in all agreed areas of cooperation.\nThe document was signed by Pakistan High Commissioner to South Africa Mazhar Javed and South Africa’s Minister for International Relations and Cooperation Dr. GNM Pandor, in Pretoria.\nThe signing of the agreement will provide an effective mechanism to review, monitor and expand cooperation in diverse areas.\nAddressing on the occasion, Minister for International Relations and Cooperation, Dr. Pandor called the signing of the document a milestone in Pakistan-South Africa relations.\nShe stressed the need to add further substance to bilateral cooperation especially in the fields of renewable energy, agriculture, health and higher education.\nHigh Commissioner Javed expressed the confidence that the agreement would catalyze bilateral cooperative process, especially in terms of economic relations.\nHe also expressed the hope for an early visit by the Minister to Pakistan, to which the minister responded affirmatively.\nIn that context, he elaborated Government of Pakistan’s “Engage Africa” initiative and the country’s vision to tap the economic potential of its geographical location straddling different geographical regions.\nAfter the signing ceremony, High Commissioner Javed made a brief call on the minister in which issues of bilateral interest were discussed.\nThe Joint Commission shall meet every second year alternately in South Africa and Pakistan to review the implementation of programs and action of cooperation undertaken in terms of the agreement and to adopt a programme for future work.",
  "retrievedAt": "2025-08-11T21:39:41.805Z"
}
