{
  "title": "Railways to transport over 20 percent of freight business after completion of ML-I",
  "link": "https://www.app.com.pk/national/railways-to-transport-over-20-percent-of-freight-business-after-completion-of-ml-i-2/",
  "date_published": "2021-11-25T14:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 25 (APP): Pakistan Railways is expecting to transport over 20 percent of the country’s freight business after the completion of Main Line-I (ML-I) under China Pakistan Economic Corridor (CPEC).\nCurrently, Pakistan Railways was transporting four percent of freight traffic in the country which was not sufficient for the department, an official in the Ministry of Railways told APP.\nHe said the ML-I had been planned to be executed in three packages, adding, preliminary design of the project had been completed and a formal request for the loan for Package-I had been conveyed to the Chinese side. ML-I is 1872-kilometer long track from Peshawar to Karachi and expected to create around 24,000 jobs and would jump up train speed to 160 kilometers per hour, he added.\nHe said railway line would be upgraded from Karachi to Peshawar and Taxila to Havelian while a new track would be laid with improved sub grade for 160km per hour. Bridges would also be rehabilitated and constructed.\nMoreover, he said, provision of modern signaling and telecom systems, conversion of level-crossing into underpasses or flyovers, fencing of track, establishment of dry port near Havelian and up-gradation of Walton Training Academy (Lahore) were also the components of this gigantic project.\nHe said completion of the project would not only create direct (20,000 local labour/technical experts and 4,000 Chinese experts) jobs but also reduce travel time between Karachi to Lahore from 18 to 10 hours.\nThe official said the capacity of the line would also be increased from 34 trains to 170 trains per day and speed of the freight trains would be increased at 120 km/h. After its completion,\nhe said, the project would generate economic opportunities for daily wagers in main train stations of major cities and would also attract the foreign investment.",
  "retrievedAt": "2025-08-11T21:39:31.443Z"
}
