{
  "title": "WHO, health ministry join hands to upgrade 464 hospitals for Universal Health Coverage",
  "link": "https://www.app.com.pk/national/who-health-ministry-join-hands-to-upgrade-464-hospitals-for-universal-health-coverage/",
  "date_published": "2023-11-06T09:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): The Ministry of National Health Services Regulations and Coordination and the World Health Organisation on Monday joined hands to refurbish 464 health facilities across the country as a step forward to achieving the government’s “top agenda” of Universal Health Coverage.\nIn this connection, a ceremony for the signing of Letter of Understanding between the health ministry and the world health body was held at the PM House which also marked the handing over of health equipment worth over Rs 2 billion including mobile health clinics, ambulances, and mobile vaccination vans.\nCaretaker Prime Minister Anwaar-ul-Haq Kakar and Caretaker Health Minister Dr Nadeem Jan witnessed the ceremony as Secretary Health Iftikhar Ali Shallwani and WHO Representative in Pakistan Dr Palitha Mahipala signed the document.\nBeing executed with the WHO’s support, the project will have zero financial implication for the Government of Pakistan.\nUnder the project, the WHO would support Pakistan in renovation of 464 health facilities across the country including 41 in AJK and Gilgit Baltistan, 131 in Balochistan, 64 in Khyber Pakhtunkhwa, 26 in Punjab and 202 in Sindh.\nThe WHO would support the upgradation of 21 health facilities, 14 labour rooms and six EPI training centers in AJK and GB; 99 health facilities, 26 labour rooms, and six EPI training centers in Balochistan; and 36 health facilities 21 labour rooms and seven EPI training centers in KP.\nThe project also consists of refurbishing 15 labour rooms, nine EPI training centers and two nutrition stabilisation centers in Punjab; and 150 health facilities, 46 labour rooms and six EPI training centers in Sindh.\nThe WHO support for upgradation of the health facilities throughout the country will contribute to meeting the objective of Universal Health Coverage besides creating a better image of the government in the public for provision of decent health care services to them.\nThis support will also contribute to the SDG 3 for good health and also SDG8 which is decent work environment and economic growth.\nThe project will help strengthening the primary healthcare system and promote the referral system mechanism besides reducing the burden on major hospitals.\nUnder the plan, the primary health care facilities would be computerised and equipped with around 70 modern facilities.\nThe upgdaration of such a huge number of health facilities is a first in the country’s history that would ensure the provision of healthcare facilities to the masses at their doorstep.",
  "retrievedAt": "2025-08-11T10:23:51.711Z"
}
