{
  "title": "Solangi assures all possible coop to Chinese enterprises in developing greater understanding in areas of common interests",
  "link": "https://www.app.com.pk/national/solangi-assures-all-possible-coop-to-chinese-enterprises-in-developing-greater-understanding-in-areas-of-common-interests/",
  "date_published": "2023-11-06T08:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 6 (APP): Caretaker Minister for Information and Broadcasting Murtaza Solangi here on Monday said that as China-Pakistan cooperation was proceeding to greater depths, the Ministry of Information and Broadcasting shall play a greater role in extending all possible cooperation to Chinese enterprises in developing greater understanding and cooperation on the areas of common interests.\nDelivering his speech at the launching ceremony of the report on ten years of China Pakistan Economic Corridor by All Pakistan China Enterprises Association and Pakistan China Institute, he said that the Ministry of Information and its associated organizations like Pakistan Television, Pakistan Broadcasting Corporation and Associated Press of Pakistan were already engaged with their counterparts in a structured framework to enhance the media cooperation.\nAppreciating the Pakistan-China Institute for hosting such a timely and important event, he said, “This event is important in the sense that it will highlight the significance and outstanding work being done by Chinese enterprises in Pakistan to the world”. He said that the PCI’s commitment to promotion of the sustainable endeavors of Chinese enterprises had been pivotal in enhancing the understanding of the public regarding the work of the Chinese enterprises.\n“Not even a day passes when we don’t hear about development by Chinese enterprises on CPEC projects in the media”, he said. The minister said that the professionalism and consistency through which Chinese enterprises continued work on CPEC despite a global pandemic when almost every project in the world had hit the snag, had been lauded by the governments of Pakistan and China as well as international media, which was flooded with stories regarding the\nresilience of a project of such magnitude.\nThe minister noted that over 201-member companies of APCEA have so far, invested $ 25 billion in Pakistan and employed over 85000 locals, which affirmed the notion of CPEC being a game-changer and demonstration project of the Belt and Road Initiative. He said in the report, he had also noted that Chinese enterprises had devised sustainable development strategies and have not only remained confined to brick and mortar projects like motorways and power plants, but have also contributed significantly to the empowerment of local communities in previously neglected areas like Thar in Sindh and Gwadar in Balochistan.\nHe said in one of the documentaries produced by the Pakistan-China Institute, he observed that women were driving dumper trucks on the Port Qasim Coal Power Plant. This was the change, the minister said that the world should be told about.\nSimilarly, Faqeer Primary School and Pak-China Technical and Vocational Institute in Gwadar, he believed, were the seeds of change being brought by Chinese enterprises. Solangi also appreciated increasing cooperation between Pakistan and China in green development, special economic zones, textile sector, agriculture, and digital economy.\nOn the special invitation of President Xi Jinping, he added, Prime Minister of Pakistan Anwaar-ul-Haq Kakar attended the Belt and Road Forum meeting. During the visit, Solangi said, both the countries reaffirmed their commitment to the China-Pakistan all-weather strategic cooperative partnership and deepened their cooperation across various sectors.\nThey underlined their support for each other on key issues and emphasized the importance of the Belt and Road Initiative (BRI) in promoting global economic growth, said the minister for information.\nIn the BRI forum, the China-Pakistan Economic Corridor (CPEC) was recognized as a pioneering project under the BRI, and the two sides agreed to further enhance its development. Additionally, they signed numerous agreements, MoUs and protocols covering various areas of cooperation, including infrastructure, mining, industry, green development, health, space cooperation, digital economy, and many more. The two countries, he said also expressed their joint commitment\nto regional peace, stability, and the resolution of long-standing disputes. The minister said that Prime Minister Anwaar ul Haq Kakar invited President Xi Jinping to visit Pakistan, underscoring the strength of their bilateral relations.\nSolangi said that the continuity of friendly consultations and high-level contacts over the past 70 years had consolidated political consensus between the two countries and deepened mutual trust between the two iron brothers.",
  "retrievedAt": "2025-08-11T10:23:51.746Z"
}
