{
  "title": "Women urged to practice 5-min self-examination every month to detect breast cancer",
  "link": "https://www.app.com.pk/national/women-urged-to-practice-5-min-self-examination-every-month-to-detect-breast-cancer/",
  "date_published": "2023-11-06T09:45:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 6 (APP): Begum Samina Alvi, wife of the president of Pakistan on Monday said a five-minute self-examination every month could help detect breast cancer at an early stage, thus saving thousands of the lives of women in the country.\nShe said 44,000 deaths due to breast cancer in Pakistan was an alarming situation that needed raising constant awareness about early diagnosis of the disease.\nSpeaking at an awareness seminar on breast cancer here at Behbud Association of Pakistan, Rawalpindi, she stressed the need to sensitize the general public about shunning the taboo about breast cancer.\nSamina Alvi mentioned that the world overall had a 98 percent recovery rate from breast cancer, however, pointed out that in Pakistan, insufficient mammographic facilities led to a high mortality rate due to the detection of malignancy at a late stage.\nShe said women of all ages including teenage girls of 12-14 years were also being diagnosed with breast cancer.\nShe urged the women and girls to learn the five-minute routine of self-examination and spread the word among at least 20 other women folks in their circle.\nFor the Behbud Mother and Child Hospital, Samina Alvi announced a donation of Rs 500,000 on behalf of her family.\nSamina ALvi also emphasized the need to focus on the inclusiveness of persons with disabilities, and mental health and ensuring a harassment-free environment for women.\nShe called for accommodating the differently-abled persons with facilities of education and employment and mainstreaming them in society.\nLt Gen (retd) Nigar Johar, the country’s first three-star woman general in the Pakistan Army who belonged to the Army Medical Corps, said one in eight women died of breast cancer in the world, which was a scary figure.\nShe said the health services of Pakistan were focused on reducing breast cancer mortality by 25 percent as per the global health goal of the World Health Organization (WHO).\nShe highlighted that at the government level, there was an improvement in diagnostic modalities including radiography, mammography, and gene mutation testing. However, she stressed the involvement of Lady Health Workers in the effective dissemination of the message among women residing in every nook and corner of the country.\nPresident Behbud Association of Pakistan Abida Malik said the non-profit organization had been supporting the generations of the country for over five decades through projects of economic empowerment through skill development, education, and health.\nShe said the association was already providing outdoor medical services while a 100-bed hospital for the underprivileged was in the making.\nA panel discussion of doctors, psychologists, and a survivor of breast cancer highlighted the significance of early diagnosis, and dealing with the challenges of mental trauma faced by the patients and their families.",
  "retrievedAt": "2025-08-11T10:23:48.351Z"
}
