{
  "title": "SAPM Mushaal concludes visit after highlighting Kashmir issue at Norwegian parliament",
  "link": "https://www.app.com.pk/national/sapm-mushaal-concludes-visit-after-highlighting-kashmir-issue-at-norwegian-parliament/",
  "date_published": "2023-11-06T06:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 06 (APP): ISLAMABAD, Nov 6 (APP): Special Assistant to Prime Minister on Human Rights and Women on Monday concluded her visit to Norway where she effectively highlighted the human rights abuses in Indian Illegally Occupied Jammu and Kashmir at the Norwegian parliament and brought along “beautiful memories” of love and support.\nThe SAPM, in a video message, expressed her gratitude to the Norwegian people and the Norwegian community, especially the Pakistani diaspora and Norwegian Parliament’s Foreign Affairs and Defence Standing Committee Member Dag-Inge Ulestein for organizing a “powerful” seminar on the Kashmir issue at the Norwegian Parliament.\n“It was a historical event. I presented my case there on human rights, on the case of Kashmiris, the plight of Kashmiris and interfaith harmony,” she remarked.\nAt the seminar, her daughter also appealed to the world through the Norwegian Parliament that her father Yaseen Malik should be saved.\n“I’m taking with me a lot of beautiful memories of unconditional love, support and prayers from the Norwegian people, the politicians, the civil society, the human rights activists… And yes, I enjoyed moving around to the museums, to the Church of Oslo. I met the bishop. I went to the Islamic Cultural Center,” she said\nMushaal, who also visited a mosque there, said she felt at home there and the world should follow the footsteps of Norwegians and respect humanity regardless of caste, color, or creed.\nShe called for campaigning for her husband’s release who was locked up in a death cell in India.\n“Unfortunately, India plans to hang him. Please save him. Please campaign for my husband and for humanity. I have a lot of hope in the Norwegian people,” she appealed.",
  "retrievedAt": "2025-08-11T10:23:52.530Z"
}
