{
  "article_id": "2025-06-16_e7005ef52758aa722273e7ccc8164d14",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/court-grants-4-day-physical-remand-to-accused-involved-in-murder-of-tiktoker-sana-yousuf/",
    "retrieved_at": "2025-08-27T11:11:24.398Z"
  },
  "metadata": {
    "title": "Court grants 4-day physical remand to accused involved in murder of TikToker Sana Yousuf",
    "author": null,
    "date_published": "2025-06-16T15:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 222,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 16 (APP): The District & Sessions Court on Monday granted police a four-day physical remand of the main suspect in the murder case of TikToker Sana Yousuf. The accused, Umar Hayat, was presented before the court after being identified by the victimas mother and aunt. Judicial Magistrate Muhammad Hafeez ordered that the suspect be handed over to police custody for four days. The magistrate also directed that the suspect undergo a medical examination and asked police to submit the report at the next hearing. Earlier, police produced Umar Hayat in court after completing the identification process. According to the prosecution, the suspect was identified by the victimas mother and paternal aunt during the identification parade. The police requested a seven-day remand from the court, arguing that they needed time to recover the mobile phone and vehicle allegedly used by the suspect. However, the court approved only a four-day remand. During the hearing, the suspect told the court that he had already handed over his mobile phone to the police. He also requested a medical examination and informed the court that he had no contact with his family, so he was unsure whether to hire a lawyer. The court ordered that the medical report be submitted before the next hearing and directed that the suspect be presented again on June 20.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}