{
  "article_id": "2025-06-16_ce43f0d834ae7ae8ac10eec08488af8e",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/parliamentarians-hails-govts-stance-over-iran-israel-war/",
    "retrieved_at": "2025-08-27T11:12:35.291Z"
  },
  "metadata": {
    "title": "Parliamentarians hails govt’s stance over Iran-Israel war",
    "author": null,
    "date_published": "2025-06-16T09:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 352,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 16 (APP):Minister of State for Religious Affairs and Interfaith Harmony Khel Das Kohistani here on Monday said that Pakistan always played a major role for the peace, prosperity and development in the region. Talking to the mediapersons outside of the Parliament House, he said that Pakiatan will keep continue its fully support to Iran. Commenting over the new increase on petroleum products, he said that the government has increased the prices of petroleum products due to the increase at international market. He said that the government has taken various steps to make this budget low income friendly budget. MNA JUI-F Shahda Akhtar said that it is the need of hours all Muslims countries should unite against Israel and full support to Iran as western countries openly supporting to illegal state Israel. She said that his party will talk to the government to bring some changes in the budget . Senior leader of PMLN MNA Tahira Aurangzeb said that no doubt Pakistan is fully supporting to Iran against Israel in this current war. She urged that all Islamic countries should show the unity and play effective role against Israel. She said that Israel is a terrorist country who is killing innocent powerless people of Gaza and now Israel has attack on Iran. Day by day Israel is enhancing it's aggression against Muslims states which is very alarming situation for all Muslim states. She has suggested that Organization of Islamic Countries (OIC) to play all Muslims their role and stop this war. MNA PTI Fouzia Arshad suggested that the Government should increase the budget of Education, health and welfare sector for prosperity and development of the state. She said that general public facing the price hike in daily commodities and number of unemployment increasing day by day the incumbent regime should focus on these issues to give the relief to them. Fouzia said that no country could not developed without the promotion and development of the Health and education sector. Unfortunately the population of the country uncontrolled while the ratio of resourced development is very slow to the ration of increasing population.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}