{
  "title": "Rich tributes paid to Hazrat Imam Hussain (RA), his companions",
  "link": "https://www.app.com.pk/national/rich-tributes-paid-to-hazrat-imam-hussain-ra-his-companions/",
  "date_published": "2023-07-29T08:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 29 (APP): Senior leader of All Parties Hurriyat Conference (APHC), Agha Syed Hassan Al-Moosvi Al-Safvi, paying glowing tributes to the martyrs of Karbala has said that the sacrifice of Hazrat Imam Hussain (RA) showed that truth was always victorious, adding that people should learn from his example.\nAccording to kashmir media service report on Saturday, Agha Syed Hassan Al-Moosvi Al-Safvi, in his message on the occasion of Ashura said the day of martyrdom of Hazrat Imam Hussain (RA) is an event that is reminiscent of the immense sacrifices rendered by the martyrs of Karbala in order to uphold the spirit of Islam.\n“The great epic of Ashura has a lot of messages and lessons that affect various dimensions of our political, social, and individual life. It played a major role in terms of making sacrifices and promoting altruism,” he said.\nTehreek Wahdat-e-Islami (TWI), a constituent of the APHC, said the incident of Karbala is a beacon light not only for Kashmiris but for all the oppressed people of the world. The TWI spokesman in a statement in Srinagar said the exemplary sacrifice offered by Hazrat Imam Hussain (RA) in Karbala for the protection of the true spirit, teachings and basic beliefs of Islam will continue to guide the humanity until the day of resurrection.\nThe spokesman said that the Indian tyranny has made life difficult for the Muslims in occupied Jammu and Kashmir. He said that the only fault of the Kashmiri Muslims was that they were challenging the Yazid of the time and demanding the right to live with freedom. He said that despite of facing the worst Indian state terrorism, the Kashmiri Muslims were determined to continue their freedom struggle until the completion of the mission of their martyrs. The Indian tyranny will face defeat one day and Kashmiris will surely see the dawn of freedom soon, he added.\nMeanwhile, the Chairman of Kashmir Council Europe (KCEU), Ali Raza Syed, in a statement issued in Brussels said Karbala is a message of freedom for whole humanity particularly all of the freedom lovers. He said that the sacrifices offered by Hazrat Imam Hussain (RA) in Karbala would remain as an example for the all freedom’s believers.\nThe KCEU Chairman said, all the pro-freedom leaders and activists of Kashmir engaged in a just struggle to liberate their land from Indian occupation have profoundly learned the lesson from the message of Karbala. The Kashmir freedom movement which has been backed by the unprecedented sacrifices of the Kashmiri people will never be stopped by the Indian authorities and one day it will reach its logical conclusion, he added.",
  "retrievedAt": "2025-08-11T09:01:26.819Z"
}
