{
  "title": "Pakistan, Russia share common goals for global peace, security: Gilani",
  "author": null,
  "content": "ISLAMABAD, Apr 06 (APP):Chairman Senate Syed Yousuf Raza Gilani has said that Pakistan and Russia share common goals for global peace, security and multipolarity in global affairs.\nHe made these remarks during a meeting with Valentina Matviyenko, Chairwoman of the Federation Council of Russia, held on the sidelines of the 150th Inter-Parliamentary Union (IPU) Assembly in Tashkent.\nHe said that Pakistan’s and Russia’s evolving relationship is rooted in mutual respect and increasingly broad-based cooperation across defense, trade, energy, and multilateral platforms such as the SCO.\nThe two sides agreed to enhance institutional linkages between their respective parliaments, including exchange visits, the revival of Parliamentary Friendship Groups, and consistent dialogue to address shared challenges.\nGilani acknowledged the significance of ongoing defense collaboration and suggested greater focus on security dialogue, military training exchanges, and counterterrorism coordination.\nWith bilateral trade showing positive momentum, both sides discussed diversifying economic ties in areas such as energy, agriculture, pharmaceuticals, and IT.\nThe Chairman advocated for establishing banking channels and improved connectivity under regional frameworks.\nPakistan expressed strong support for Russia’s role in promoting regional stability and multipolar global governance. Both sides emphasized the importance of coordinated efforts in forums like the SCO and UN, particularly regarding climate action, food security, and counter-narcotics.\nThe Chairman reiterated Pakistan’s commitment to regional peace, highlighting the need for inclusive political solutions and humanitarian support in Afghanistan.\nHe acknowledged Russia’s role in promoting dialogue and stability in the region.\nGilani concluded by reaffirming Pakistan’s readiness to work with Russia toward a comprehensive, forward-looking partnership and extended an invitation for future parliamentary exchanges in Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:14:46.993Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-russia-share-common-goals-for-global-peace-security-gilani/",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T14:07:00.000Z"
}
