{
  "title": "AJK PM announces induction of Rangers, launch of CTD amid security, economic reforms",
  "author": null,
  "content": "ISLAMABAD, Apr 06 (APP): Prime Minister of Azad Jammu and Kashmir (AJK), Chaudhry Anwar-ul-Haq has announced that the proposed induction of Rangers personnel into AJK has received formal approval from the cabinet as 1,000 troops and 300 officers will be recruited in accordance with existing rules and regulations.\nIn an exclusive interview with APP, he informed that the command of the Rangers Force will rest solely with officials from Azad Kashmir, and no non-state individuals will be inducted into the force.\nCondemning the negative and misleading propaganda by certain elements, the AJK prime minister said, “Dissemination of toxic and baseless narratives against state institutions is deeply regrettable. Those responsible will be brought to justice.”\nHe also revealed that the government is in the final stages of launching a Counterterrorism Department (CTD) to safeguard AJK citizens from the threats of terrorism. “This initiative is vital in the current security scenario, especially considering the sacrifices of Pakistan’s armed forces to ensure the safety of the people,” he emphasized.\nSpeaking about governance and economic challenges, Anwar-ul-Haq said despite a deficit of Rs. 71 billion, the government has successfully paid salaries before Eid, released funds to local bodies, revived dead projects, and provided grants to universities. “Three quarters have passed under financial constraints, but the government has delivered,” he said.\nHe also mentioned progress on key infrastructure and education projects. “The ‘Out-of-School Children’ project is going to be launched, and the Prime Minister of Pakistan has approved a Rs. 3 billion Danish Schools project. The Shounter Tunnel in Muzaffarabad will also begin with federal support,” he added.\nTo further improve the financial sector, the AJK prime minister confirmed that AJK Bank will meet the necessary requirements to become a scheduled bank before June 30. “All tasks under the government’s mandate have been completed for digitalization and scheduling. The remaining steps are being handled by the bank’s administration,” he explained.\nHighlighting administrative progress, he said that negotiations with local government representatives have been successfully concluded. “Local bodies are an integral part of the government under the AJK Constitution, and we will take them along in the governance process,” he asserted.\nHe further mentioned that the issue of development funds for MLAs will be addressed through a constitutional mechanism, either via court appeal or legislation in the Assembly.\nThe Prime Minister refuted allegations of political bias in hiring, stating, “Recruitments have always been made on merit and after proper advertisement. In rare cases, especially to meet medical needs in remote areas, the condition of ‘state subject’ was relaxed. However, for forces like Rangers and Police, the recruitment criteria strictly exclude non-state residents.”\nCommenting on the regional security situation, Anwar-ul-Haq said, “The recent wave of terrorism is being fueled by our traditional enemy, India. The Indian intelligence agency RAW, in collaboration with hostile elements, is actively working to destabilize Pakistan. If not dealt with in time, the consequences could be disastrous.”\nHe strongly criticized attempts to malign the role of Pakistan’s armed forces. “For the past 77 years, the Pakistan Army has made countless sacrifices to defend the Line of Control (LoC) and support the people of Azad Kashmir, especially during natural disasters and times of crisis. Unfounded criticism of such institutions is unacceptable,” he stated.\nConcluding the interview, Prime Minister Anwar-ul-Haq reiterated that “there is no politics without the state, and if we fail to honour the sacrifices of our martyrs, future generations will bear the consequences.”",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:14:30.853Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ajk-pm-announces-induction-of-rangers-launch-of-ctd-amid-security-economic-reforms/",
  "dateList": "2025-04-06",
  "date_published": "2025-04-06T10:51:00.000Z"
}
