{
  "article_id": "2025-09-03_b8c9b7349da757591b35102dc9b09c13",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/act-alliance-lauds-pm-shehbazs-economic-diplomacy-at-sco/",
    "retrieved_at": "2025-09-06T10:52:01.898Z"
  },
  "metadata": {
    "title": "ACT Alliance lauds PM Shehbaz’s economic diplomacy at SCO",
    "author": null,
    "date_published": "2025-09-03T10:52:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 428,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Sep 3 (APP): ACT Alliance Pakistan on Wednesday lauded Prime Minister Shehbaz Sharif's participation in the recent Shanghai Cooperation Organization (SCO) Summit held in Tianjin, China, that had sent a strong message that Pakistan is serious about repositioning itself within the region's emerging economic and strategic framework. The PM's engagements with global and regional leaders highlights that economic diplomacy has become a central pillar of the government's strategy, one that could unlock new trade routes, investment partnerships, and growth opportunities, said Mubashir Akram, said National Convenor of ACT Alliance Pakistan in a news release. \"We warmly welcome the Prime Minister's global outreach and his effort to place Pakistan at the heart of regional economic cooperation. But no matter how strong our diplomacy, it cannot bear fruit unless we clean up our domestic economic environment.\" Meanwhile, Akram highlighted the serious and long-standing challenge of illegal trade and tax evasion across multiple sectors, particularly petroleum and lubricants (POL), cigarettes, tea, beverages, and pharmaceuticals. Citing credible estimates, he pointed out that these illegal business activities collectively inflict nearly Rs. 8,000 billion in economic losses every year. \"This is not a minor policy issue; it is a full-blown economic emergency,\" he said. \"We are hemorrhaging revenue, discouraging honest businesses, and damaging investor confidence.\" He went on to say that illegal trade in POL and tobacco has reached alarming levels, with entire supply chains operating outside the tax net. \"These mafias not only evade taxes, they also destabilize entire industries by creating an uneven playing field. Legal businesses cannot compete,\" Akram said. He emphasized that global investors and local entrepreneurs alike need protection from these illegal networks. \"If we want to bring in foreign investment, if we want to create jobs and grow our exports, then we must confront the internal threats posed by smuggling, under-invoicing, and counterfeit production,\" he said. \"Otherwise, the message we are sending abroad is that Pakistan welcomes investment, but cannot protect it.\" Akram expressed hope that under Prime Minister Shehbaz Sharif's leadership, the government will back its diplomatic commitments with stronger enforcement and domestic policy action. \"The world is watching and willing to engage. But we must show that we are serious about reform, not just at summits, but also in markets, factories, and supply chains across the country.\" He commended the Federal Board of Revenue and its IREN for their consistent operations against illegal businesses. \"Their work in exposing tax evasion, particularly in tobacco and POL, deserves appreciation. This is the kind of institutional vigilance that can make our economic diplomacy credible and our independence meaningful.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}