{
  "title": "Extension of SIC facility to start form next week: CM",
  "link": "https://www.app.com.pk/national/extension-of-sic-facility-to-start-form-next-week-cm/",
  "date_published": "2020-10-28T13:31:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Oct 28 (APP): Provincial health department here Wednesday completed all arrangements to extend Sehat Insaf Cards (SICs) facility to 100 percent population from next week in Khyber Pakthunkhwa.\nThis was told during a high-level meeting with Chief Minister Khyber Pakthunkhwa Mahmood Khan in the chair and important decisions regarding improving healthcare facilities besides implementation of health reforms in KP were taken.\nThe meeting took principal decision regarding handing over ambulances of hospitals to Rescue-1122 and this key issue would be taken up in the upcoming cabinet meeting for final approval.\nThe chief minister directed finalization of all arrangements regarding handing over of ambulances of relief and health departments to Rescue-1122.\nThe meeting decided to expedite ad-hoc recruitment process of medical staff and doctors in health department and convening meeting of all concerned departments for finalization of an inclusive strategy from next week in this regard.\nTo improve health services in secondary care hospitals, the meeting decided to outsource diagnostic and non clinical services and shifting of transfers and posting on administrative posts except top management posts at grassroot level.\nAppointment of management and general cadres also came under discussion and it was decided to give powers of monitoring of health centres and district headquarters hospitals to Institutional Monitoring Unit (IMU) of health department. The IMU would also monitor referral cases of these hospitals.\nDecision regarding implementation of E-transfer policy for doctors and others staff came under discussion.\nChief Minister Mahmood Khan has reiterated that no compromise would be made on quality of health services and directed health department to ensure medicines to emergency departments of all the government hospitals in the province.\nThe CM also directed immediate transfers of clerical staff and section officers who have served for over two years in their posts in the health department.\nThe meeting was told that significant improvement has been brought in vaccination services and availability of medicines in basic and rural health units.",
  "retrievedAt": "2025-08-11T19:57:04.811Z"
}
