{
  "title": "Omar Ayub hold opposition parties responsible of energy crisis",
  "link": "https://www.app.com.pk/national/omar-ayub-hold-opposition-parties-responsible-of-energy-crisis/",
  "date_published": "2020-10-28T16:17:00.000Z",
  "source": "APP",
  "content": "HYDERABAD, Oct 28 (APP):Federal Minister for Energy, Omar Ayub Khan Wednesday said the incumbent government put the country on the right track, while holding previous governments responsible for the electricity and gas crisis in the country.\nAddressing a press conference here at circuit house, Omar Ayub Khan said past governments of Pakistan People’s Party and PML-N had plunged the country into economic crisis due to their failed policies for which debts had reached to the 30,000 billion rupees.\nFlanked by Sindh Governor Imran Ismail, former CM Sindh Arbab Ghulam Rahim and MQM-P’s MNA Sabir Qaimkhani, the Federal Minister said previous government had totally failed in taking steps for power generation and they had neither taken steps for exploring gas reserves nor had generated electricity from alternate resources.\nHe said PPP and PML-N had signed accords with Independent Power Producers (IPPs) and purchased expensive electricity due to which people were facing electricity as well as gas shortages in the country.\nThere were two week’s foreign reserves available in the exchequer when PTI government had taken over the country after 2018 general elections, Omar Ayub Khan said and added that PPP and PML-N governments brought the country on the verge of bankruptcy but with the dynamic leadership of Prime Minister Imran Khan and the prudent policies of the present government Pakistan came out of the economic crisis.\nOmar Ayub said before the PTI government, agreements were signed with IPPs with the cost of rupees 24 per unit of electricity while the present government had signed an agreement for purchasing solar energy at the cost of rupees 6.5 per unit.\nReplying to a question regarding shortage of gas in the country, Omar Ayub Khan\nsaid gas reserves were rapidly depleting in the country as no exploration had been made during the last 10 years that’s why the government had decided to import LNG to avert such kind of gas crisis.\nGas reserves in Sindh had decreased 7 percent which would create a gas shortage in the province but the government had taken steps to import LNG to face the crisis, the minister said.\nOn another question, he said millions of people had given mandate to Pakistan Tahreek-e-Insaaf which would complete its constitutional tenure therefore opposition had to wait for next three years to go into election.\nRegarding Hyderabad Electric Supply Company, the Energy Minister said elected representatives of allied parties and the representatives of the business community had been given two weeks to present their recommendations so that issues relating to electricity transformers, detection billing and power theft would be resolved.\nThe decision for setting up of four workshops for power transformers and new grid stations and feeders would be taken within two weeks after receiving their suggestions, he added.\nHe said Neelum-Jhelum power project had started its operation therefore a decision regarding recovery of Neelum-Jhelum surcharge from consumers would be taken soon.\nThe parliamentary leader of PTI in Sindh Assembly Haleem Adil Shaikh, MPA Khurum Sher Zaman, Jamal Siddiqui and others were also present on the occasion.",
  "retrievedAt": "2025-08-11T19:57:04.562Z"
}
