{
  "title": "Omar Ayub dissolves HESCO BoD on complaints of business community, elected representatives",
  "link": "https://www.app.com.pk/national/omar-ayub-dissolves-hesco-bod-on-complaints-of-business-community-elected-representatives/",
  "date_published": "2020-10-28T14:27:00.000Z",
  "source": "APP",
  "content": "HYDERABAD, Oct 28 (APP): Federal Minister for Energy Omar Ayub Khan Wednesday, after receiving complaints from business community and the elected representatives of coalition parties, dissolved Hyderabad Electric Supply Company’s (HESCO) board of directors (BoD) and announced for its reconstitution.\nAddressing the workers of Pakistan Tahreek-e-Insaaf belonging to Hyderabad and Mirpurkhas regions here at Circuit House, Omar Ayub Khan said doors of HESCO Chief and other relevant officers of the company will ever remain opened for resolution of the genuine issues of electricity consumers.\nAbout four workshops for electricity transformers and new feeders as well as grid stations would soon be set up in Hyderabad to provide uninterrupted power supply to the people of the region, he added.\nDescribing opposition alliance as a bunch of corrupt people, Omar Ayub said all thieves and corrupt elements had gathered to give cover to their corruption as they had looted national exchequer during their tenures in federal as well provincial governments.\nHe accused the previous governments of PPP and PML-N of being responsible of economic crisis but incumbent government had tried it’s best to get country out of that meltdown.\nThe objective of the public meetings of Pakistan Democratic Movement is to weaken Prime Minister Imran Khan because he (PM) had refused to bow down to their pressure, he said and vowed that all corrupt elements would be brought to justice.\nPakistan Tahreek-e-Insaaf has won 2018 general election on the basis of 22 years struggle of Prime Minister Imran Khan, Omar Ayub said and added that PTI along with all coalition partners will resolve all issues of the people.\nOmar Ayub said the government would defend every inch of the mother land and no one would be allowed to speak against Pakistan, adding that anti-state elements wearing political attire had started campaign against Pakistan but they would be dealt with iron hand.\nHe said PTI workers were the asset of the party therefore all their problems would be resolved. He told the gathering that PTI would win next elections on the basis of its performance as it had won consecutive elections in Khyber Pakhtoonkhwa.\nHe said KP government had provided health card to every citizen of the province and they could receive treatment up to Rs one million from health card.\nParliamentary leader of PTI in Sindh Assembly Haleem Adil Shaikh, former Chief Minister Sindh and GDA leader Arbab Ghulam Rahim, Sadaqat Jatoi and others also addressed the public meeting.\nEarlier, the energy minister also held meetings with members of coalition partners, business community representatives and party leaders and discussed matters related to their interests.\nOmar Ayub assured them for early resolution of their problems.",
  "retrievedAt": "2025-08-11T19:57:03.836Z"
}
