{
  "title": "1,792 new coronavirus cases reported; 62 deaths in past 24 hours",
  "link": "https://www.app.com.pk/national/1792-new-coronavirus-cases-reported-62-deaths-in-past-24-hours/",
  "date_published": "2020-12-21T11:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP): The national tally of total active COVID-19 cases in Pakistan on Monday reached 40,491 with 1,792 more people tested positive for the deadly virus and 1,680 people recovered from the Coronavirus during the last 24 hours.\nSixty Two corona patients, 50 of whom were under treatment in hospital and 12 in their respective homes or quarantines died on Sunday, according to the latest update issued by the National command and Operation Centre (NCOC).\nDuring the last 24 hours most of the deaths had occurred in Punjab followed by the Sindh.\nIt added that out of the total 62 deaths during last 24 hours 31 patients died on ventilators.\nNo COVID affected person was on ventilator in Balochistan and Gilgit Baltistan (GB) while 296 ventilators were occupied elsewhere in Pakistan.\nThe maximum ventilators were occupied in four major areas including Multan 46 percent, ICT 44 percent, Peshawar 27 percent and Lahore 31 percent.\nThe Oxygen beds (oxygen providing facility other than ventilator as per patient’s medical requirement) were also occupied in four major areas as in Rawalpindi 41 percent, Abbottabad 39 percent, Peshawar58 percent and Multan 39 percent.\nSome 34,772 tests were conducted across the country on Sunday, including 9,322 in Sindh, 14,857 in Punjab, 5,415 in Khyber Pakhtunkhwa (KP), 3,916 in Islamabad Capital Territory (ICT), 356 in Balochistan, 409 in GB, and 497 in AJK.\nAround 409,085 people have recovered from the disease so far across Pakistan making it a significant count with over 86 percent recovery ratio of the affected patients.\nSince the pandemic outbreak, a total of 458,968 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 8,002, Balochistan 17,926, GB 4,827, ICT 36,257, KP 55,183, Punjab 131,933 and Sindh 204,840.\nAbout 9,392 deaths were recorded in country since the eruption of the contagion, including 3,333 Sindh among Eight of them died in hospital and Six out of hospital on Sunday, 3,638 in Punjab 31 of them died in hospital and Three out of hospital on Sunday, 1,546 in KP Seven of them died in hospital and Three out of hospital on Sunday, 391 in ICT Two of them died in hospital on Sunday, 179 in Balochistan, 99 in GB and 206 in AJK where Two of them died in hospital on Sunday.\nA total of 6,336,113 corona tests have been conducted so far, while 615 hospitals are equipped with COVID facilities. Some 2,925 corona patients were admitted in hospitals across the country.",
  "retrievedAt": "2025-08-11T20:10:09.928Z"
}
