{
  "title": "Christians community playing role in country’s development: Governor",
  "link": "https://www.app.com.pk/national/christians-community-playing-role-in-countrys-development-governor/",
  "date_published": "2020-12-21T13:51:00.000Z",
  "source": "APP",
  "content": "CHICHAWATNI, Dec 21 (APP):Punjab Governor Chaudhry Mohammad Sarwar said on Monday the Christian community had been playing a significant role in the development of the country which should be appreciated at every level.\nAddressing a cake cutting ceremony to mark the Christmas in Chak No 190/9-L near here, he said that doors of Governor’s House were open for christian community all the time.\nGreeting the Christians community ahead of Christmas, the Governor assured to resolve their problems on priority basis.\nHe announced to install a water filtration plant in Chak 190/9-L to provide clean drinking water to its residents.\nCh Sarwar also distributed jackets among the children of four nearby villages.\nEarlier, the Governor inaugurated a private school in Ghaziabad.\nSpeaking on the occasion, he said the success in the world and hereafter lied in the service of humanity.\nHe urged the philanthropists to service the masses by taking part in health and education sectors.\nThe governor said that Sarwar Foundation would extend help for the expansion of school, adding the Foundation would also establish a health centre and handicraft school for girls and install a filtration plant in the village.\nHe said the Sarwar Foundation had started to serve the masses by establishing a hospital in Rajana in 2005, where better healthcare facilities were being provided to the poor people.\nHe said the Sarwar Foundation was providing health facilities to the people of Chichawatni by entering into a joint venture with Rai Ali Nawaz hospital.\nThe governor eulogized the services of late Shabbir Kiyani for providing the opportunity of quality education to the people of area by setting up Trust in Ghaziabad.\nHe said that Sarwar Foundation was the biggest apolitical institution which was providing clean drinking water facility to 2 million people of the province.\nOn the demand of people, the Governor promised to make Chachawatni-Burewala road dual carriageway in the limits of Sahiwal district.\nLocal PTI leader Rai Hassan Nawaz, Deputy Commissioner Babar Bashir and notables from christian community were also present on the occasion.",
  "retrievedAt": "2025-08-11T20:10:07.722Z"
}
