{
  "title": "Mazari demands Pakistani hindus killings probe under UN",
  "link": "https://www.app.com.pk/national/mazari-demands-pakistani-hindus-killings-probe-under-un/",
  "date_published": "2020-12-21T15:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 21 (APP):Minister for Human Rights Dr Shrieen M Mazari on Monday demanded United Nations (UN) to probe the extrajudicial killings of 11 Pakistani Hindus by India and ensure payment of reparations to families of the deceased.\nIn a letter written to UN High Commissioner, she wrote, “The extrajudicial executions by Indian security forces in Manipur, a clear breach to the Vienna Convention, have still not been fully investigated, in violation of the State of India’s responsibility and obligation to carry out a prompt, thorough and effective investigation.”\nIn 2019, she noted the UNHCR (UN Refugee Agency) had called for “urgent progress” of investigations into these encounters.\nShe demanded the constitution of an investigation team, under the auspices of the UN\nand urged India to allow the team for conducting a free, fair and impartial investigation into the matter of extrajudicial executions of Pakistani hindus.\nIn the letter, she demanded handing over of the dead bodies of deceased to family members, in line with international human rights standards.\nIndia should respect international human rights law by ending impunity for the conduct of officials involved in gross human rights violations, he said.\nIndia should be influenced to ensure payment of reparations to the family of the deceased, she further said.\nAs this incident fell within the broader pattern of human rights violations, being carried out on a state level, it was imperative that accountability be ensured, the minister said.\n“I write to you in the hope that the extrajudicial executions will not meet the same fate of denial of justice. I am cognisant of the need to ensure the collective involvement of all human rights organizations in this quest for justice, accountability and bringing an end to the culture of impunity for extrajudicial executions perpetrated by Indian security forces ‘ personnel”, she noted\nAccordingly, copies of this letter were being shared with human rights organizations and special procedures that have repeatedly raised concerns over the State of India’s practice of extrajudicial executions, she further said.\n“I am writing to your office owing to the State of Pakistan’s serious concerns vis-à-vis repeated human rights violations in India”, she said adding, just a few months prior, in August 2020, reports surfaced regarding the extrajudicial execution of 11 Pakistani Hindus in Jodhpur District, Rajastan, India.\nTill date, she added, there has been no information shared with the Pakistani High Commission in New Delhi on the circumstances of these deaths. No inquiry has been conducted into the alarming incident, nor have the Pakistani High Commission or relatives of the deceased been granted access to the bodies, in violation of international human rights law, Mazari said.\nThere was also appeared to be a breach by India with respect to the Vienna Convention on Consular Relations (VCCR) – the object and purpose of this Convention being inter alia respect for the principle of sovereign equality of States, the\nmaintenance of international peace and security and the promotion of friendly\nrelations among nations, the minister said.\nReportedly, the deceased included Budhu Ram (80 years), Raivya (35 years),\nShamoon (25 years), Antari (75 years), Shrimati Lakshmi (39 years), Shrimati Devi (28 years) and five children, namely Mukadas (16 years), Zain (12 years),Dayaal (12 years), Danish (10 years) and Diya (5 years).\nShrimati Mukhi, a surviving member of the family, registered a First Information Report (FIR) No. 219/2020 over the murder of her family members. She has alleged that the Indian intelligence agency, RAW, was behind the murder.",
  "retrievedAt": "2025-08-11T20:10:07.017Z"
}
