{
  "title": "Met Office alert authorities to raise guards amid Monsoon active spell",
  "link": "https://www.app.com.pk/national/met-office-alert-authorities-to-raise-guards-amid-monsoon-active-spell/",
  "date_published": "2021-07-25T10:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):Pakistan Meteorological Department (PMD) on Sunday advised all provincial and federal authorities to remain on “Alert” as the active phase of Monsoon season has been predicted to prevail in the next week.\nThe Met Office in its Monsoon Alert issued here informed that monsoon onset would likely to remain in active phase during next week.\nThe Forecast alert mentioned that rain-wind and thundershowers were predicted in upper and central parts from weekend. The Met Office informed that strong monsoon currents were likely to penetrate northeastern parts of the country from weekend perpetrating the monsoon active phase.\nRain-wind-thundershower (with few heavy falls at time) was expected in Kashmir, Islamabad, Rawalpindi, Attock, Chakwal, Jhelum, Gujrat, Mandi Bahauddin, Sialkot, Narowal, Gujranwala, Hafizabad, Lahore, Sheikhupura, Kasur, Okara, Faisalabad, Jhang, Toba Tek Singh, Sargodha, Mianwali, Khushab, Bhakkar and Layyah.\nRain-wind-thundershowers (with few heavy falls at time) was expected in Dir, Swat, Buner, Kohistan, Shangla, Mansehra, Abbottabad, Haripur, Mardan, Swabi, Charsadda, Nowshera, Peshawar, Waziristan, Kurrum, Bannu, Kohat, Lakki Marwat, Tank, Karak and Dera Ismail Khan, Gilgit-Baltistan (Ghizer, Astore, Diamer, Skardu, Gilgit, Hunza Nagar, Ghanche and Kharmang) .\nRain/wind-thundershower (with isolated heavy falls) was also expected in Dera Ghazi Khan, Rajanpur, Multan, Khanewal, Sahiwal, Bahawalnagar, Bahawalpur and Rahim Yar Khan, Sibbi, Kohlu, Loralai, Barkhan, Sukkar, Jaccobabad, Tharparker, Sanghar and Mirpurkhas from Monday (evening/night) till Wednesday.\nIt warned that heavy rains might generate flash flooding and also trigger landslides in the vulnerable areas of Kashmir, Gilgit-Baltistan, Punjab and Khyber Pakhtunkhuwa from Monday to Wednesday (next week).\nThe Met Office has also indicated possibility of damaging effects due to wind-storm during the forecast period.\nMoreover, the PMD also predicted that the prevailing water stress in rain-fed areas was\nlikely to subside and improvement in water reservoirs would be observed during the period. However, the prevailing hot and humid weather conditions likely to subside during the wet spell, it added.",
  "retrievedAt": "2025-08-11T21:00:11.153Z"
}
