{
  "title": "COVID-19 national tally reports over 6% positivity ratio",
  "link": "https://www.app.com.pk/national/covid-19-national-tally-reports-over-6-positivity-ratio/",
  "date_published": "2021-07-25T09:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP):The national tally on Sunday of total active COVID-19 cases was recorded 55,720 with 2,819 more people testing positive for the deadly virus and 1,176 people recovering from the disease during the last 24 hours.\nForty-five corona patients have died during past 24 hours, 41 of whom were under treatment in the hospitals and four of them perished in their respective quarantines or homes, according to the latest update issued by the National command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Punjab.\nOut of the total 45 deaths occurred, 22 of them died were under treatment on ventilators.\nThere were 2,573 Covid infected patients under treatment in critical condition with 22 of them admitted during past 24 hours in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded 6.32 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Islamabad 38%, Lahore 20%, Peshawar 15% and Karachi 15%.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Gilgit 50%, Karachi 46%, Rawalpindi 24% and Muzaffarabad 28%.\nAround 278 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan, and Gilgit Baltistan (GB).\nSome 44,579 tests were conducted across the country on Saturday, including 16,156 in Sindh, 17,525 in Punjab, 6,117 in Khyber Pakhtunkhwa (KP), 2,043 in Islamabad Capital Territory (ICT), 814 in Balochistan, 729 in GB, and 1,195 in AJK.\nAround 925,958 people have recovered from the disease so far across Pakistan making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,004,694 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 22,886, Balochistan 29,494, GB 7,702, ICT 85,519, KP 141,627, Punjab 352,682 and Sindh 364,784.\nAbout 23,016 deaths were recorded in country since the eruption of the contagion. Around 5,814 people perished in Sindh, 19 of them died in the hospitals and two out of the hospitals on Saturday.\n10,939 people died in Punjab died with 15 deaths occurred in past 24 hours. Some 13 individuals died in the hospitals and two out of the hospitals.\nAs many as 4,417 people expired in KP, six of them died in hospitals on Saturday, 792 individuals died in ICT, two of them died in the hospitals in past 24 hours, 322 people died in Balochistan, 122 infected people perished in GB and 610 people died in AJK, one of them succumbed to the deadly virus in the hospital on Saturday.\nA total of 15,667,114 corona tests have been conducted so far, while 639 hospitals are equipped with COVID facilities across the country.\nSome 2,944 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:00:10.497Z"
}
