{
  "title": "Over 3.22 mln voters to poll for AJK elections being held amid tight security arrangements",
  "link": "https://www.app.com.pk/national/over-3-22-mln-voters-to-poll-for-ajk-elections-being-held-amid-tight-security-arrangements/",
  "date_published": "2021-07-25T06:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 25 (APP): Over 3.22 million Kashmiri voters would exercise their right to vote as polling was kicked off on Sunday for 11th AJK general elections in all 45 constituencies amid tight security arrangements at 8 AM and would continue till 5 PM.\nAccording to details, 3,220,793 including 1,752,788 male and 1,468,005 females voters would cast their votes to elect 45 members of AJK Legislative Assembly.\nThe polling process for AJK elections began at 8 AM in all four provinces of Pakistan for 12 seats and 33 seats in AJK.\nOver 40,000 security personnel including Pak Army, FC, Rangers and police were deployed in all constituencies of AJK to ensure a peaceful atmosphere for the polling process.\nOut of total, 2,817,090 voters are registered in 33 constituencies of the AJK assembly.\nOf the remaining voters, 373,652 are registered in the six constituencies representing the refugees from occupied Jammu and 29,804 are registered in the six constituencies representing the refugees from occupied Kashmir Valley.\nThese 12 constituencies representing refugees from occupied Jammu and Kashmir Valley have a total of 403,456 registered voters in four provinces of Pakistan.\nThe registered voters shall have to produce an original computerized national identity card at the polling station at the time of exercising the right to vote.\nAJK Election Commission had finalized all arrangements to hold free, fair, and transparent elections. All out security arrangements had also been made so that the voters could cast their vote in a peaceful manner without any fear and pressure.\nThe Kashmiris living in different areas of Pakistan would exercise their vote to choose their candidates on 12 constituencies meant of Jammu and Kashmir refugees settled in various parts of Pakistan.\nA total of 587 candidates are contesting the elections in 33 constituencies of Azad Kashmir districts and 121 candidates on 12 constituencies of Jammu and Kashmir refugees settled in Pakistan.\nNearly 5118 polling stations have been set up in all three divisions of AJK, Muzaffarabad, Poonch, and Mirpur.",
  "retrievedAt": "2025-08-11T21:00:13.002Z"
}
