{
  "title": "Solo exhibition by Rakhshanda Atawar ‘In Search of the Miraculous’ attracting people",
  "link": "https://www.app.com.pk/national/solo-exhibition-by-rakhshanda-atawar-in-search-of-the-miraculous-attracting-people/",
  "date_published": "2022-05-15T09:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): A solo exhibition titled “In Search of the Miraculous,” by Rakhshanda Atawar at satrang gallery attracting a large number of people showcasing artistic work of talented artists.\nIn Search of the Miraculous has been curated by the esteemed curator Aasim Akhtar.\nThe press release while describing Rakhshanda Atawar pays tribute to her work through following words: “The longer we look at Rakhshanda Atawar’s work, the more clearly, we see before our eyes, its special power of regeneration – a power that extends to elements located far back, to previously unremarked features that re-emerge under the guise of new findings.”\nAtawar’s work is replete with moments of covert and overt anticipation. A complex web of diversity is not only evident within individual paintings but also stretches retrospectively hbetween works that might otherwise appear to be temporal and poles apart, aesthetically.\nAtawar sets traps that some interpretations would appear to walk straight into her work, particularly those operating within their own set limits, even though the work in question may, in fact, breathe limitlessness.\nIn the current body of work on show, Atawar spells out to us the alphabet of modern art: curlicues, splash, line, over-painting to emphasise a corner, lilac as a subtle hint (or is it the proverbially heavy variety) of her latest extensive preference for violet.\nIn this work, there is unmistakable early evidence of her delight in intersecting, cutting up, revealing and uncovering motifs that are both elemental and willfully whimsical, and which, later on, abetted by unbridled curiosity, will lead her painting to artistic terra nova and realms of great complexity and potential for renewal” says Aasim Akhtar.\nRakhshanda Atawar was born and raised in Sialkot. She graduated in Fine Arts from Government College, Lahore, in 1981 and earned a Masters degree in Fine Arts from the Punjab University, Lahore, in 1984.\nWith a portfolio spanning more than three decades, Atawar has shown with both national and international galleries, and has been part of the Taj Mahal Project 2004 in Agra, India. Atawar has served as Head of the Department at the NCBA & E, Lahore.\nShe has been the Co-Founder & Curator of 39K, Lahore. Currently she lives and works in Lahore.",
  "retrievedAt": "2025-08-11T14:54:26.633Z"
}
