{
  "title": "Palestinians fear another ‘Nakba’ amid Israel’s unbridled illegal colonial policies: Embassy",
  "link": "https://www.app.com.pk/national/palestinians-fear-another-nakba-amid-israels-unbridled-illegal-colonial-policies-embassy/",
  "date_published": "2022-05-15T12:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): After seventy four years of illegal creation of Israel on the occupied land of Palestine, the Palestinians are facing the threat of another Nakba (destruction) that will completely destroy Palestine, if Israel is allowed to continue with it’s illegal colonial policies against Palestinian people.\nOn 15th of May, Palestinians all over the globe commemorate Nakba Day in\nmemory of the almost total destruction of their presence in their homeland of Palestine, said a statement issued here by the Embassy of the State of Palestine.\nIt said the creation of Israel on Palestinian land in 1948 constitutes a grave historical injustice to the Palestinian people that persists until now.\nAs Seventy four years have passed since the Nakba of 1948, the year that\nmarked the expulsion and exodus of the Palestinian people. “The Nakba of\nyesterday is the ongoing reality of today. Palestinians are denied all basic\nhuman rights as Israel continues to adopt the policies of forcible transfer, oppression and humiliation to pave the way for the construction of more Israeli settlements and settlers in occupied Palestine”.\nThe continuous vicious colonial attempts to erase the Palestinian identity, to ethnically\ncleanse the people of Palestine and to humiliate their dignity at the hands of Israel was not only one dark chapter in history, but a daily life under\nhumiliation, oppression and occupation for each and every Palestinian, it added.\n“It’s time for this dark chapter to end and for a new promising one to begin. It’s time for justice in Palestine”.\nDuring the Nakba (“catastrophe”), Israel destroyed 531 Palestinian towns\nand villages and committed at least 33 massacres, and more than 800,000 Palestinians were uprooted and expelled to live as refugees at the mercy of others in refugee camps and in diaspora.\nSince 1948, Israel has employed deliberate and systematic acts of violence, colonialism and destruction at the expense of the Palestinian people, their rights, lands, and resources. “Fundamentalist Zionism is bent on pursuing\nthese policies unilaterally to superimpose ‘Greater Israel’ on historical Palestine”.\nMore than seven million Palestinian refugees reside in the Occupied Palestinian Territory and in exile. Palestinian refugees have suffered for\nfar too long, and it is time that their plight is recognized by the international community and resolved in accordance with international law\nand conventions, including the United Nations General Assembly Resolution 194 (1948), the 1951 Geneva Convention Relating to the Status\nof Refugees, the International Covenant on Civil and Political Rights (1966), and the Universal Declaration of Human Rights (1948).",
  "retrievedAt": "2025-08-11T14:54:24.839Z"
}
