{
  "title": "Environmental degradation emerging as security threat for Pakistan: Sherry",
  "link": "https://www.app.com.pk/national/environmental-degradation-emerging-as-security-threat-for-pakistan-sherry/",
  "date_published": "2022-05-15T10:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP): Federal Minister for Climate Change Senator Sherry Rehman has said that environmental degradation was emerging as a national security threat for Pakistan as it was paying a disproportionate price for climate change impacts derived by the developed world.\nFederal Minister for Climate Change in her exclusive talk with APP said the glacial lakes outburst floods and heatwave were certain incidents that were predicted through advisories released in February by the relevant departments where the last alert was issued by the Ministry of Climate Change.\nSherry said the World Bank has mentioned that climate induced disasters were causing 4-6% of the country’s GDP which was a huge sum that needed to be preserved through timely interventions.\nShe said the developed world has done injustice and ignored the third world particularly Pakistan that as bearing the burden of their environment damaging development.\nShe said plantation was necessary but not the only solution to cope with the whooping impacts of global warming, adding, “Adaptation is also necessary to be spearheaded at the individual and community levels and create awareness among the masses to deal with global warming”.\nSenator Rehman said the country also needed to focus on energy transition to clean energy mix. “The Ministry of Climate Change will recommend adaptation measures at the national level and start mass awareness campaign\non it”.\nShe added that there was need to bring lifestyle change as the elite of the country was responsible for wasting water graciously which was a matter of serious concern.\n“Climate mitigation is done by developed countries but the Southern region of the world was focusing on adaptation which is equally important”.\nShe informed that the Ministry was engaging with the corporate sector to shun the use of plastic bags and shift over renewable eco-friendly alternatives.",
  "retrievedAt": "2025-08-11T14:54:25.819Z"
}
