{
  "title": "Gill rubbishes PML-N’s claim of Shehbaz Sharif’s clearance by London court",
  "link": "https://www.app.com.pk/national/gill-rubbishes-pml-ns-claim-of-shehbaz-sharifs-clearance-by-london-court/",
  "date_published": "2022-02-11T15:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 11 (APP): Special Assistant to the Prime Minister (SAPM) on Political Communication Dr Shahbaz Gill Friday said Leader of Opposition in the National Assembly Shehbaz Sharif was neither granted bail nor cleared by a London court.\n“Today Marriyum Aurangzeb (the Pakistan Muslim League-Nawaz (PML-N) information secretary) has stated that Shehbaz Sharif has been given a respectful clearance by the London court. This is totally wrong. This is Marriyum’s fresh lie in front of the national media,” he told a press conference here at the PTV Headquarters.\n“The London court proceedings has nothing to do with Shehbaz Sharif. The reality is that the transactions in the bank account of his son Suleman Shehbaz being investigated in London pertained to the sale / purchase of a flat by him and the amount which he has been receiving as pocket money from an individual, Zulfiqar Ahmed. The court has only ordered to unfreeze the frozen $677,000 in that account,” he added.\nDr Gill said if Marriyum Aurangzeb was true in her claims then she should produce the court’s acquittal order. “If you have the court’s clearance orders or case’s closure orders then please do tweet it so that the masses can know the truth,” he asked Marriyum.\nHe said around 17,000 transactions were made in the account of a peon Malik Maqsood. “Around Rs 4 billion was transferred in his (Maqsood’s) account fraudulently.”\n“There are 15 to 16 such persons in whose accounts the total amount of Rs 16 billion was transferred. The PML-N leader should answer as who had transferred that money in their accounts.\n“You people also failed to provide proof of money which you claimed were provided by the Qataris,” he added.\nDr Gill said Marriyum was constantly lying. She also put some respectful journalists in trouble as they believed in her and released false news.\nThe SAPM said around 24 PML-N lawmakers were annoyed with their party’s policies. “And two of them have even said that in a last party (PML-N) meeting that they were ready to tender resignations but first Nawaz Sharif should come in the country and lead the party.”\nHe said Prime Minister Imran Khan’s stance against the corrupt leaders was very clear and he would not spare them.",
  "retrievedAt": "2025-08-11T14:18:49.743Z"
}
