{
  "title": "Provision of cheaper energy in environmental friendly manner termed as biggest challenge of 21st century",
  "link": "https://www.app.com.pk/national/provision-of-cheaper-energy-in-environmental-friendly-manner-termed-as-biggest-challenge-of-21st-century/",
  "date_published": "2023-08-18T13:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Chairperson of Punjab Higher Education Commission, Prof. Dr. Shahid Munir Friday said that the biggest challenge of the 21st century is to provide cheaper energy to everyone in an environmentally friendly manner.\nHe was speaking at a webinar on “Co-combustion of Coal and Biomass for Clean Electricity Generation” held at COMSTECH.\nSpeaking on the occasion, Prof. Munir said that the biggestbchallenge in the 21st century is to provide cheaper energy to everyone in an environmentally friendly manner.\nHe said that the energy needs will increase by 300 percent by the end of the 21st century.\nHe said that the electricity generation is linked with environmental pollution.\nProf. Munir mentioned that the global average surface temperature has increased by about 0.6 centigrade and this is projected to increase by 1.4 to 5.8 centigrade by 2100.\nProf. Munir said that Pakistan generates 61% electricity from thermal (oil, gas and coal), 24 % from hydel, 12% from nuclear, and 3% from renewable sources.\nHe said that Pakistan is in the serious crisis of oil and gas shortages.\nHe said that coal is a game changer for Pakistan. Pakistan has coal reserves worth about USD 30 trillion, and this reserve can provide 100,000 MW of electricity for more than 500 years.\nProf. Munir said that co-combustion of coal with biomass is gaining popularity with the electric utilities producers because it is a relatively cheaper, low risk, sustainable, and renewable way of generating green power in utility plants.\nProf. Dr. Shahid Munir has a PhD degree from University of Leeds, UK.\nHis area of research is biomass-coal co-combustion, and his research work has been published in international and national journals of high impact factor.\nMore than 100 participants joined the webinar online from Pakistan and other different OIC member states.\nEarlier, Coordinator General, COMSTECH Prof. Dr. M. Iqbal Choudhary welcomed the participants.\nHe appreciated the contribution of Prof. Munir toward his field of expertise, academic excellence, and research productivity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:12:41.498Z"
}
