{
  "title": "Caretaker govt to assist ECP in holding free & fair elections: Solangi",
  "link": "https://www.app.com.pk/national/caretaker-govt-to-assist-ecp-in-holding-free-fair-elections-solangi/",
  "date_published": "2023-08-18T14:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Caretaker Federal Minister for Information and Broadcasting Murtaza Solangi said on Friday that holding general elections was the responsibility of the Election Commission of Pakistan (ECP) and the Federal Government would fulfill its duty to assist the watchdog in that regard.\nAddressing his maiden press conference as information minister, he said the entire caretaker cabinet would try hard to fulfill responsibilities under the oath and in accordance with the law and Constitution.\nThe minister spoke with the media to inform them about the first meeting of the Federal Cabinet chaired by Caretaker Prime Minister Anwaar-ul-Haq Kakar.\nMurtaza Solangi said he had held a meeting with Chief Election Commissioner Raja Sikandar Sultan and apprised him about the commitment of the Federal Cabinet regarding assistance in holding free elections in the country and implementing the ECP recommendations for necessary transfer and posting of officials in that regard.\nHe said the cabinet decided that on the election day, the first vote would be cast by the caretaker prime minister and then by the ministers.\nThe minister said the country would be ultimately run by the elected representatives of the people as was envisaged in the Constitution of Pakistan and the caretaker government would look after the affairs only till the elections.\nHe said that the cabinet decided to reduce the government’s spending in view of the prevailing economic conditions, and it was also the government’s responsibility not to waste taxpayers’ money.\n“We cannot afford to buy petroleum products at high prices and sell them at low prices,” he said, adding as per the agreement with International Monetary Fund, the government could not subsidze commodities.\nSolangi said the state with its power stood with the minorities and no one would be allowed to victimize them in the name of religion, colour or caste. Islam granted special rights to the minorities and those responsible for the Jaranwala incident would be brought to justice, he vowed.\nPakistan, he said, was a country of 250 million people, who all had equal human rights.\nThe cabinet stressed on promoting Sufism in the country to counter extremism, narrow-mindedness and intolerance prevailing in the society, he added.\nHe said everyone expressed grief and sorrow over the Jaranwala incident and steps were being taken to ensure protection of the minorities.\nThe minister said Prime Minister Kakr emphasized on building infrastructure in the country.\nReplying to media persons’ questions, Solangi said poverty and inflation were a reality and nobody could deny that fact. It was also a fact that hike in the petroleum products’ prices also caused inflation but the government’s hands were tied due to the IMF’s standby arrangement.\nHe assured the media that the government would cut its expenditure to reduce burden on the national exchequer.\nAnswering a question about the ongoing legal cases against the Pakistan Tehreek-e-Insaf leadership, he said the matter was sub judice. The government was not a party to those cases and the relevant institutions were performing their duties as per law.\nTo another question, he said the media and educational institutions had to play an important role in promoting tolerance and harmony in the society to avert Jaranwala like incidents in the future.\nHe said it was the responsibility of every government, including the caretaker setup, to take steps for strengthening the economy, and improving law and order situation.\nReplying to a query, he said the caretaker cabinet comprised only 16 members, besides a half dozen advisers and special assistants. Most of the cabinet members represented their respective fields and hopefully they would prove their worth with their performance, he added.\nMurtaza Solangi reiterated that the caretaker government did not believe in any gag on the media and would take steps to ensure freedom of expression in the country.\nPrincipal Information Officer and APP Managing Director Muhammad Asim Khichi was also present during the press conference.",
  "retrievedAt": "2025-08-11T09:12:15.541Z"
}
