{
  "title": "Parliament to continue it’s role in making Pakistan disaster resilient: Raja Pervaiz",
  "link": "https://www.app.com.pk/national/parliament-to-continue-its-role-in-making-pakistan-disaster-resilient-raja-pervaiz/",
  "date_published": "2023-08-18T14:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP):Speaker National Assembly, Raja Pervaiz Ashraf on Friday said the Parliament of Pakistan would continue its role in making the country disaster resilient and climate adaptive for a sustainable and healthy future for the coming generations.\nThe Speaker National Assembly was addressing to the concluding ceremony of the third-day first ever Pakistan Expo on Disaster Risk Reduction 2023 (PEDRR-23).\nRaja Pervaiz Ashraf in his keynote address congratulated the National Disaster Management Authority (NDMA) and National Disaster Risk Management Fund (NDRMF) for organising the important forum of PEDRR-23. He also appreciated the experts, speakers and others for their valuable contributions shared at different seminars, and dialogues held during the Expo.\nHe said the NDMA had rightly placed global focus on putting capacity building of vulnerable countries like Pakistan. “The country being among the top ten countries most vulnerable to climate change despite less than one percent of carbon emissions was similar to face the outcome of what that it had not done,” he added.\nThe Speaker underscored that the monster monsoon floods of 2022  badly disrupted life in Pakistan whereas the international community was forthcoming in supporting the country. He added that the already ailing economy of Pakistan could not sustain another disaster with inadequate capacity.\nThe National Assembly Speaker said the country realised that national preparedness was more economic than financing post-disaster initiatives.\nHe said, “We must improve technical archiving and knowledge-based decision making for effective disaster management.”\nRaja Ashraf mentioned that he was briefed on the NDMA efforts alongwith other partners in shaping locally made national plans for disaster management and risk reduction.\nThe Speaker mentioned that cloud bursts, glacial lake outburst floods (GLOFs), torrential rains and heatwaves were beyond human control but to respond to it was in its capacity. “National Assembly, SDGs taskforce and standing committees are always at the forefront of government’s climate decisions’ scrutiny,” he added.\n“I have personally raised the issue of Pakistan’s vulnerability and food security due to climate change at various regional and international forums. Let’s join hands and act as climate activists to mitigate climate change risks effectively,” he said.\nEarlier, the highlights of the three-day engagements of PEDRR-23 were showcased before the participants.\nChairman, NDMA, Lieutenant General Inam Haider Malik welcomed the chief guest, members of the diplomatic corps and academia heads. He informed the chief guest and the gathering that the forum had been through joint connectivity with all partners working on disaster management at PEDRR-23.\n“We have representatives from Pakistan Army, Navy, Air Force, law enforcement agencies (LEAs), Civil agencies and rescue responders who have actively participated in the expo. During the forum, we have tried to bring consensus on new disaster management approach and a way forward for the country,” he said.\nThe NDMA Chairman mentioned that the only decision made throughout the discussions was to come out of responsive or reactive approach and opt a proactive approach which can be done after risk assessment.\nHe added that the Authority could convene national exercises and practices to identify risks and devise plans to cope with increasing vulnerability due to natural disasters.\n“We are also approaching places of worships to further pass on the message of community resilience against disasters, and media at all levels would be engaged in the process for community awareness,” he said.\nThe NDMA chair also informed about various competitions held by the Authority under the theme of disaster management and climate change.\nThe display of stalls by different local and international non-governmental organisations (INGOs), UN agencies and partner organisations at the expo gathered people from different areas. It was a connectivity for all partners and UN forums whereas students from universities and NGOs and social sectors participated and saw the capacity of Pakistan to hold such events on its own, he remarked.\nLater, Speaker National Assembly Raja Pervaiz Ashraf conferred the awards to the winners of painting, photography, and research papers contests held by the NDMA.\nIn Painting, Zala Gul from ZABIST Peshawar secured the third prize, Hajra Zafar from Fatima Jinnah Women University (FJWU) got second prize and Eman Khan of National College of Arts won the first prize.\nIn Photography, Muhammad Ibrahim Khan of Abdul Wali Khan University, Mardan got the third prize, Muhammad Haseeb from University of Engineering and Technology (UET) Lahore secured the second prize and Usman Hussain of University of Peshawar achieved the first prize.\nIn Short Films, Sana Nawaz of National University of Medical Sciences (NUMS) got the third prize, Abdullah Arjumand of Foreman Christian College Lahore got the second prize and Saud Afridi from Abdul Wali Khan University got the first prize.\nIn the Call for Research Papers category, Dr. Haris Khurram from the Foundation for Advancement of Science and Technology (FAST) University got the second prize and Zain Ahmed Bin Amir from NUST got the first prize.\nDirector implementation NDMA Raza Iqbal was also awarded on the occasion.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T09:12:32.726Z"
}
