{
  "title": "Caretaker Health Minister visits Polio Emergency Centre",
  "link": "https://www.app.com.pk/national/caretaker-health-minister-visits-polio-emergency-centre/",
  "date_published": "2023-08-18T16:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 18 (APP): Caretaker Federal Health Minister, Dr Nadeem Jan on Friday visited the National Emergency Operations Centre (NEOC) and assured that the government will continue its efforts to eliminate polio from Pakistan.\nSpeaking at the NEOC, Dr Jan affirmed that polio eradication will feature prominently among his priorities during his tenure.\nHe said,“This visit holds great significance for me. I will ensure that every conceivable measure is undertaken to elevate Pakistan to the ranks of polio-free countries. Treat me as a worker of the programme and I will do anything that needs to be done to interrupt transmission by the global deadline.”\nFederal Secretary of Health, Iftikhar Shallwani, said, “The Health Ministry has been actively involved in the Polio Programme in the past few months and we will ensure that the focus on polio remains unwavering. We are very lucky to have a seasoned public health specialist as a leader with in-depth knowledge and experience of polio eradication efforts.”\nDr Jan met the entire team at the NEOC, visited the Polio Control Room and discussed the current priorities for the Polio Programme.\nDr Shahzad Baig, the Coordinator at the NEOC, said, “The presence of the Minister of Health at NEOC shows immense significance for our programme. Your direct involvement and oversight underscores your commitment. We are very grateful for your visit and support.”\nDr Jan is a recipient of the Tamgha-i-Imtiaz and Sitara-i-Imtiaz and has worked with the UN, USAID, World Bank, EU, DFID and international non-government organisations for the past two decades.\nHe has managed complex emergencies in challenging environments like Somalia, South Sudan, Ethiopia, the Philippines, Kenya, Afghanistan, and the districts part of the former Federally Administered Tribal Areas.\nDr Jan also played a key role in the development and implementation of the Lady Health Workers Programme and has closely worked with the Pakistan Polio Programme in the past.\nPakistan has reported two polio cases this year. Both children belong to Bannu, one of the seven endemic districts in southern Khyber Pakhtunkhwa.",
  "retrievedAt": "2025-08-11T09:12:12.321Z"
}
