{
  "title": "President for enhanced bilateral trade with Hungary",
  "link": "https://www.app.com.pk/national/president-for-enhanced-bilateral-trade-with-hungary/",
  "date_published": "2022-10-12T11:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):  President Dr Arif Alvi on Wednesday underlined the need to substantially increase the volume of bilateral trade with Hungary from its existing level of $50 million to $150 million to help realize the full potential of bilateral trade, business and investment.\nThe president said this while talking to Pakistan’s Ambassador-designate to Hungary, Asif Hussain Memon, who called on him in Aiwan-e-Sadr.\nHe highlighted the need to create linkages between the private sectors of Hungary and Pakistan for forging possible joint ventures in the fields of agriculture, vertical farming, robotics, information technology, water management, flood water management, crop insurance and development of high-yielding seeds.\nPresident Alvi expressed the hope that the economic experts of the two countries need to collectively find practical ways to implement planned initiatives in the next session of the Joint Commission on Economic Cooperation (JCEC).\nThe president advised the envoy designate to engage the Hungarian Oil and Gas Company (MOL), which had a sizable investment in Pakistan, and encourage it to extend its operations to renewable energy as well.\nUnderlining the areas of furthering bilateral cooperation between the two countries, the president said that there was great potential for cooperation with Hungary in water resources management, agriculture, food, education, information technology sector and higher education sector.\nHe also emphasized the need for the full utilization of scholarships offered by the government of Hungary to Pakistani students and asked the ambassador-designate to coordinate with the Higher Education Commission to finalize the MoU for the scholarship program on a top priority basis.\nHe appreciated that the government of Hungary was likely to increase the award of the current 200 scholarships to 400 in the near future, which, he said, should be fully utilized.\nHe said that a mechanism should be established to attract Pakistani human resources educated and trained in Hungary back to Pakistan and to ensure the utilization of their acquired knowledge and training in critical fields for bringing improvement to Pakistan’s economy.\nThe president also appreciated the support of the government of Hungary for GSP+ status to Pakistan and stated that there was a need to ensure Hungary’s continuous support for the renewal of GSP+ status to Pakistan.\nHe advised the envoy to highlight the true image of Pakistan and the sacrifices rendered by the Pakistani nation to counter terrorism and extremism in the country, at the same time he should also highlight the discrimination, intimidation and violence being perpetrated against the minorities in India.\nHe said there was a need to talk about Hindutva philosophy as well as the increasing trend of Islamophobia in India, which was putting the lives and properties of Muslims under threat.",
  "retrievedAt": "2025-08-11T15:43:05.290Z"
}
