{
  "title": "Electricity consumers given relief up to Rs 65 bln during last two months: Dastgir",
  "link": "https://www.app.com.pk/national/electricity-consumers-given-relief-up-to-rs-65-bln-during-last-two-months-dastgir/",
  "date_published": "2022-10-12T13:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Federal Minister for Energy Khurram Dastgir Khan on Wednesday said that the electricity consumers were given up to Rs 65 billion relief in fuel price adjustment (FPA) during the last two months.\nResponding to a calling attention notice in the National Assembly, he said that the FPA amounting Rs 9.89 was charged on a unit during June as electricity was produced using expensive fuel, including Furnace oil, High Speed Diesel and Coal.\n“The adjustment for June was Rs 9.88 per unit while now it has been now reduced to 22 paisa per unit,” he said.\nThe electricity consumers, he said, using up to 300 units during the month of June had been provided relief and its overall impact was Rs 35 billion. Similarly, the tube wells were also exempted from FPA during June, he added.\nHe said that as per instructions of Prime Minister Shehbaz Sharif, the government had fully passed on the relief to the consumers. “The electricity consumers would see the relief in the electricity bill in the next month as FPA has been reduced from Rs 9.89 to 22 paisa” he maintained.\nThe minister said that total electricity generation from local Thar coal would jump to 1,320 MW in December with the addition of 330 MW by ThalNova Power, a plant of Thar Ltd.\nThe prime minister, the other day, formally inaugurated 330 MW HUBCO Thar Coal Power Plant which increased the electricity generation to 990 MW from local Thar coal.\nDastgir said that another 1,320 MW Shanghi Electric Thar Coal Power Project under China-Pakistan Economic Corridor (CPEC) would become operational before the next summer which would help double the electricity generation to 2,640 MW.",
  "retrievedAt": "2025-08-11T15:43:02.484Z"
}
