{
  "title": "SAPM Tarar praises God over PM Shehbaz, Hamza’s acquittal in fake money-laundering case",
  "link": "https://www.app.com.pk/national/sapm-tarar-praises-god-over-pm-shehbaz-hamzas-acquittal-in-fake-money-laundering-case/",
  "date_published": "2022-10-12T16:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Special Assistant to the Prime Minister (SAPM) Attaullah Tarar on Wednesday expressed gratitude to the Allah Almighty for granting victory to Prime Minister Shehbaz Sharif and his son Hamza Shehbaz in the “false, baseless, and a revenge based political case of money laundering framed by the former government of PTI.”\nAddressing a press conference, here, he said: “We thank Allah Almighty that the court acquitted Prime Minister Shehbaz Sharif and his son Hamza Shehbaz in a Rs16 billion money laundering fake case framed by the Pakistan Tehreek-e-Insaf’s government mere for the political victimization.”\nThe Special Court, Central, in Lahore, on Wednesday had acquitted Prime Minister Shehbaz Sharif and former Chief Minister of Punjab Hamza Shehbaz Sharif in the FIA’s money laundering case.\nAccepting pleas of acquittal from both the accused, the court announced the reserved verdict.\nThe FIA registered this case in November 2020, under Pakistan Penal Code, Anti Corruption Act and Anti Money Laundering Act.\nThe SAPM said that the “nation had seen the truth behind the fake cases made by the PTI government.”\nTarar expressed the hope that the remaining fake cases would also meet the same fate. “No money laundering, corruption and kickback were proved against the PML-N leadership,” he added.\nHe said that leadership of PML-N had faced such fake cases in the past with courage and in a dignified way.\nHe said the “so-called” accountability advisor Shahzad Akbar, who was the mastermind behind creating these fake cases, disappeared from the scene.\nHe reminded that Shehbaz Sharif and Hamza Shehbaz were in jail when the fake case was framed by the then PTI government.\nInitially, he said, the case was sent to the banking court, but at that time, the then government failed to produce any evidence.\nLater, the SAPM said, on the objection of Imran Khan and Shahzad Akbar over the banking court’s jurisdiction, the case was sent to the special court after four months.\nHe said despite the court order, the “FIA had failed to produce any evidence of money laundering.”\nHe alleged that Shahzad Akbar used to sit in the FIA building and issued instructions regarding the case.\nTarar questioned whether would Imran answer why he spent millions of rupees in framing fake cases against his political rivals.  With this verdict of the special court, he said “today Imran Khan’s fake narrative was buried once and for all.”\nHe said Imran Khan and Shahzad Akbar would have to answer to the nation about the fake cases they registered against Shehbaz Sharif and his son.",
  "retrievedAt": "2025-08-11T15:42:54.835Z"
}
