{
  "title": "India replicating Israeli model of settler colonialism in IIOJK: Speakers",
  "link": "https://www.app.com.pk/national/india-replicating-israeli-model-of-settler-colonialism-in-iiojk-speakers/",
  "date_published": "2022-10-12T12:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): All Parties Hurriyat Conference (APHC) AJK chapter and Legal Forum for Kashmir (LFK) jointly organized a report launch and press-briefing on the imminent situation in the Indian Illegally Occupied Jammu and Kashmir (IIOJK) in the wake of India’s settler colonial program.\nColonial Diary, a repository of settler colonial diktats in IIOJK was launched on Wednesday to apprise the international community of Indian machinations political, legal, and economic subjugation of Kashmiris which amounts to war crimes under International Law.\nThe report has been compiled by the team of Legal Forum for Kashmir (LFK). It includes the around 220 legislation, administrative changes, orders, notifications, and press releases by the Indian State in the last three years (August 2019 – August 2022) after the abrogation of Article 370.\nColonial Diary is the repository of settler colonial diktats by the Indian administration in IIOJK. The documents included in the repository are the various legislation, administrative changes, orders, notifications, and press releases by the Indian State after the abrogation of Article 370.\nThe repository includes various laws, articles, and bills on different issues and with diverse themes including Land acquirement for military purposes, the Roshini Act, Termination of government employees under 311 (2) (c), Waqf properties, Pandit Migration, Jammu Kashmir Reorganization Act (2019), Domicile Certificate, Delimitation Commission, etc.\nOn August 05, 2019, the Parliament of India unilaterally passed the Jammu and Kashmir Reorganisation Act, 2019 containing provisions to reconstitute the Indian Illegally Occupied Jammu and Kashmir into two union territories (UTs) called Jammu and Kashmir, and Ladakh, and became effective on 31 October 2019. The Reorganization act consists of 103 clauses, extends 106 central laws to the UTs, repeals 153 state laws, and abolishes the Jammu and Kashmir Legislative Council.\nAccording to Al-Jazeera’s October 28, 2020 report, “Kashmiris fear the new laws are aimed at a land grab to dilute the Muslim-majority character of the region, whose partial autonomy was scrapped in August 2019, bringing it under New Delhi’s direct control.”\nKashmiri Lawmakers believe that it is a pathway paved for replicating the Israeli model of occupation and colonization of the West Bank in Kashmir towards dis-empowerment and dispossession of the locals, particularly Kashmiri Muslims, to exercise hegemonic control through new settlers.\nThe Narendra Modi-led BJP government is adamant to engineer the demography of Kashmir Valley which has around 97 percent Muslim population. The long-term objectives include abolishing the Muslim identity of the state; manipulating the results of the plebiscite in favor of India. Short-term objectives include inflicting damages to the local economy; and to deprive the Kashmiris of all basic human rights and crush the indigenous voice for freedom from Indian occupation.\nThe RSS-backed BJP government delimited the Legislative Assembly electoral constituencies on the basis of geography instead of the population in order to allocate more seats to Hindu-dominant areas of Jammu, further oppressing Kashmiri Muslims by minimizing their political representation. Accordingly, 43 seats were reserved for Jammu and 47 for Kashmir, whereas, population-wise there should be 51 constituencies for Kashmir (6.8 million population) and 39 for Jammu (5.3 million population). This delimitation will pave the way for a Hindu CM in a Muslim-majority region.\nPost-August 5, 2019, the Indian government introduced many new laws and amended several others to facilitate the issuance of domicile and land-owning rights to non-Kashmiris, mostly Hindus. Until June 2022, 4 million such certificates have been issued, making it very clear how India is wantonly altering the demography of Kashmir.\nThe new laws also allow the lands acquired by the government for industrial or commercial purposes to be disposed of or sold to any Indian. These also authorize the Indian Occupying Forces to declare any area as “strategic” for operational and training purposes. This is a form of land-grabbing as the Indian Occupying Forces are already occupying thousands of hectares of land in the occupied region.\nLegal experts assert that India violates Article 2 of the Genocide Convention and Article 49 of the Fourth Geneva Convention which prohibits occupying forces to “transfer parts of its own civilian population into the territory it occupies.”\nIt also violates 85(4) (a) Additional Protocol I, ICC Statutes Article 8(2) (b) (viii) and 22 (3) (b) of the International Law Commission’s Draft Code of Crimes against the Peace and Security of Mankind. Above all, Indian actions in IIOJK violate the multiple United Nations Security Council resolutions.\nThe speakers at the press briefing and report launch included Qamar Zaman Kaira, Adviser Prime Minister on Kashmir Affairs and Gilgit Baltistan, as chief guest besides guests of honor Mehmood Ahmad Saghar, Convener All Parties Hurriyat Conference, Sheikh Abdul Mateen, General Secretary APHC, Advocate Nasir Qadri, Executive Director LFK, as host and organizer.The press-briefing was also attended by APHC leadership including Imtiaz Ahmed Wani Secretary Information Sheikh Yaqoob, Mushtaq Ahmad Bhat; Mian Muzaffar; Sheikh Abdul Majid, Zahid Ashraf,Manzoor Ahmad Dar, Bashir Ahmad Usmani; Mukhtar Ahmad Baba, Spokesperson Masarat Alam Bhat, Chairperson Muslim League JK and Altaf Ahmad Wani, Director KIIR.",
  "retrievedAt": "2025-08-11T15:43:05.005Z"
}
