{
  "title": "Ericsson Pakistan launches Graduate Program to nurture technology leaders",
  "link": "https://www.app.com.pk/national/ericsson-pakistan-launches-graduate-program-to-nurture-technology-leaders/",
  "date_published": "2022-10-12T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP):Ericsson has announced the launch of its graduate program in Pakistan to offer young talents world-class learning and career development opportunities.\nThe Ericsson Pakistan Graduate Program is focused on nurturing Pakistan’s technology leaders of tomorrow, said a press release issued on Wednesday.\nWith experts from Ericsson training and supporting young Pakistani talent, the Ericsson Pakistan Graduate Program provides on-the-job, project-based, classroom training, and online learning in Information and Communications Technology (ICT) and advanced technologies within the advanced connectivity era and as a contribution to the Digital Pakistan Policy.\nThe graduates are gaining valuable work experience, skills and knowledge that enable graduates to gain professional project-based knowledge, in a fast-changing ICT sector.\nAamir Ahsan Khan, President and Country Manager of Ericsson Pakistan says: “Ericsson has been in Pakistan for 60 years and giving back to society is one of our strong pillars. The Ericsson Pakistan Graduate Program enhances the skills and knowledge of the young and bright graduates while empowering them as technology experts. The youth are the catalysts to the realization of the Digital Pakistan Policy and will lead Pakistan’s digital future in different areas like FinTech, Internet of Things, Cloud Computing, Artificial Intelligence, and more. The graduates have great potential, and we are looking forward to their success.”\nThe young, curious, and innovative graduates are working alongside world-class industry expertise at Ericsson and are supporting the development of projects that are changing the world of communication in Pakistan and the region.\nGraduates interested in the program can visit https://www.ericsson.com/en/careers/student-young-professionals to know more about future opportunities that Ericsson offers young professionals, the press release added.",
  "retrievedAt": "2025-08-11T15:43:07.849Z"
}
