{
  "title": "Inundation still persists in Sindh, Balochistan; more humanitarian assistance needed: Sherry Rehman",
  "link": "https://www.app.com.pk/national/inundation-still-persists-in-sindh-balochistan-more-humanitarian-assistance-needed-sherry-rehman/",
  "date_published": "2022-10-12T13:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said the worst affected areas of Sindh and Balochistan due to torrential rains were still inundated whereas the country needed more humanitarian assistance to accommodate 33 million affected population.\nAddressing a news conference here convened at a short notice, the Minister said there was less discussion in the media on flood devastation as the situation in Sindh and Balochistan was still worst where water was stagnant in the areas.\nSenator Sherry Rehman said it had emerged as the largest natural catastrophe in the world as there was no match to mega climate event occurred in the history.\nThe World Bank had estimates $40 billion loss and damages in the country due to massive monsoon torrential rains, he said, adding, “33 million affected people — is a huge figure which is seven million more than the entire population of Australia. The super floods of 2010 only affected 20 million people. The damage in my view will rise further.”\nShe added that 20.6 million population was still in urgent need which was larger than the combined population of Portugal and Switzerland. “It has been the 18th week since the calamity hit the region and the relief operations are underway. However, no further deaths reported so far. There is no example of such protracted relief operations in the entire world.”\nThe Minister mentioned that some 1,717 people had died whereas 12,867 got injured, over 13,000 kilometers (km) roads and 436 bridges got damaged. It was a mammoth task to rebuild such massive connectivity infrastructure washed away by floods, she added.\nSherry Rehman noted that resilient rebuilding planning was underway in two departments whereas many buildings like dispensaries were underwater particularly in Sindh.\n“70 percent of the 33 million affected are women and children. 3.4 million Children are predicted to go hungry. 8.2 million people require urgent medical services, while 4 percent of the disaster affected population is actually pregnant,” she said.\nSome 11 districts of Sindh were underwater that were below sea level and water drainage in such areas was an uphill task, she said. There were six lac shelters created so far whereas 7.9 million still needed assistance, the Minister briefed.\nThe Geneva flash appeal received a welcoming reception.\nHighlighting the crop damages due to floods, she said 9.4 million acres of standing crops were inundated and damaged, that would be directly putting at risk 14.6 million people, in the line of a food sector and agriculture crisis. “Livelihoods will continue to face aftershocks and 15.4 million more people will be pushed below the poverty line.”\nDuring Rabi crop season, the farmers would bear more impacts, she added.\n“3.9 million out of the 15.4 million was targeted by UN affected that will face serious malnutrition as 70% of the total impacted are women and children.”\nShe mentioned that some Rs 65 billion ($298 million) were delivered to the flood impacted families through BISP emergency cash relief.\nThe Minister further underlined that the crops particularly rice, cotton, and sugarcane would bear direct losses with cotton sustaining the most of the losses, adding, “There will be a direct long term impact due to it.”\nSherry Rehman informed that the Sindh province had sustained maximum damage in all indicators whereas there were 53% crops loss was recorded in Balochistan, 15% in Punjab, 14% Khyber Pakhtunkhwa (KP) and 25% Azad Jammu and Kashmir (AJK).\n“Over 80% above tomatoes, 20% rice, 50% grapes and other crop losses are recorded in Sindh. Some 2.1 million houses have been damaged across the country with 89% of them in Sindh alone.”\nThe Minister told the media that humanitarian aid was being received but due to large impacted population it was becoming insufficient. “UN agencies are also involved in relief and rehabilitation efforts and they all claim it an unprecedented crisis. It has been a record breaking climate event of the century.”\nThe Minister also grilled the Pakistan Tehreek-e-Insaf (PTI) leadership for not supporting disaster relief efforts rather paying lip service on the issue.\n“A party ruling in two provinces is doing the politics of serious extremism instead of helping or supporting masses affected due to floods.”\nAfter 1971, it was the highest trauma and the most testing time faced by the country whereas the PTI chief was convincing youth for long marches and taking Nazi oaths as it was done in Wiemar Germany, she said.\nShe added that it used to be the Nazi salute and this was the same style and narrative as perpetrated by Hitler to establish that they were the most powerful and famous.\n“Imran Khan’s narrative is only to get him back into power. Cypher is the base of his so-called narrative. He is the biggest deep fake and liar who shifts his narrative every day.”\nWhile referring to President Dr Arif Alvi’s interview, she said, “His party’s own designated President Dr Alvi said he was not convinced on cypher.”\nShe explained that the secret cyphers were sent on six locations and no one in the executive command could take it as his property.\nResponding to APP’s query, she said the US spokesman said they were monitoring their aid and were satisfied with its disbursement in the flood affected areas. “There are over 20 million people still in need and in this case there will be issues of snatching relief goods during distribution of items. People have lost their families and livestock and are in desperate need. We are requesting people at home and abroad to support affected people of Sindh and Balochistan.”\nThe Prime Minister and Foreign Minister were very active to manage the crisis, she said, adding, “The threat is still looming and no country in the world has 33 million tents and there was no such disaster recorded in the world except the world wars.”",
  "retrievedAt": "2025-08-11T15:43:03.536Z"
}
