{
  "title": "NA Speaker praises Japan for assisting aid to flood affectees",
  "link": "https://www.app.com.pk/national/na-speaker-praises-japan-for-assisting-aid-to-flood-affectees/",
  "date_published": "2022-10-12T14:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 12 (APP): The National Assembly Speaker Raja Pervez Ashraf Wednesday expressed his gratitude to Japan for assisting aid to flood affectees in Pakistan.\nThe NA Speaker in a meeting with Ambassador of Japan to Pakistan Mitsuhiro Wada appreciated Japan’s emergency aid and grant for flood affectees of Pakistan and Japan’s overall support for the socio-economic development of Pakistan.\nHe also expressed a desire to learn from Japan to efficiently tackle climate-induced disasters.\nMatters pertaining to further Pakistan-Japan bilateral ties and worldwide climate change were discussed in the meeting.\nThe Speaker extended profound condolences over the sad demise of former Japanese Prime Minister Shinzo Abe.\nHe said that the late Japanese Prime Minister made invaluable contributions to improving the Pakistan-Japan relationship.\nHe also remarked that Pakistan attaches great importance to its relations with Japan and acknowledge the valuable contributions made by Japan in supporting Pakistan’s development efforts over the years. Pak-Japan bilateral relations have strengthened over the time and would be further strengthened in the future through enhanced Parliamentary cooperation between the legislatures of both countries, he added.\nRaja Pervez Ashraf said members of the vibrant Pakistan-Japan Parliamentary Friendship Group established in the National Assembly of Pakistan were playing a pivotal role by building bridges of friendship and bringing Japan closer to Pakistan. He extended an invitation to the Speaker of the House of Representatives of Japan to visit Pakistan.\nSpeaker while talking about the destruction caused by floods in Pakistan said Pakistan was one of the most vulnerable countries to the effects of climate change despite being responsible for only less than one percent of global greenhouse gas emissions.\nThe Japanese Ambassador expressed gratitude to the Speaker for the hospitality & condolences. He also expressed solidarity with flood affectees and highlighted certain activities undertaken by Japan in Pakistan for the promotion of bilateral cooperation over the course of 70 years since 1954.\nHe shared that the Parliament of Japan considers supplementary grants for flood-hit Pakistanis as a token of brotherhood and aiding each other in times of calamity. He also shared the letter by Speaker of the House of Representatives of Japan to the Speaker of National Assembly of Pakistan to express solidarity with people devastated by the flood.",
  "retrievedAt": "2025-08-11T15:42:58.399Z"
}
