{
  "title": "Remove all restriction, withdraw occupation forces from IOJK instead of entertaining more delusions on AJK: Pakistan tells India",
  "link": "https://www.app.com.pk/national/remove-all-restriction-withdraw-occupation-forces-from-iojk-instead-of-entertaining-more-delusions-on-ajk-pakistan-tells-india/",
  "date_published": "2020-06-14T05:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):Pakistan on Sunday asked the Indian government to immediately remove all restrictions in Indian Occupied Jammu and Kashmir (IOJK), withdraw occupation forces and abolish draconian laws there instead of entertaining further delusions about Azad Jammu and Kashmir (AJK).\nWhile strongly rejecting Indian defence minister’s “delusional remarks” through a video address to “Jammu Jan Samvad rally” about AJK and situation in IOJK, Foreign Office spokesperson said the statement was another manifestation of the BJP government’s delusions about AJK and incurable obsession with Pakistan.\n“Rather than entertain any further delusions about AJK, the Indian government must immediately remove all restrictions in IOJ&K, restore all means of communications including 4G internet, withdraw occupation forces from the region, remove draconian PSA, AFSPA and UAPA laws, and allow unfettered access to international observers and independent media to the occupied territory,” the spokesperson remarked.\nShe said it had been clear to the people of IOJK, Pakistan and the international community that the motive behind the RSS-inspired BJP government’s illegal and unilateral actions of August 5,2019 was to inter alia bring about demographic changes in the IOJK so that the Muslim majority in the region could be changed by “deceit, fraud and brute force.”\nShe said the promulgation of new domicile law and amendments in various laws, especially regarding acquisition of properties in IOJK, clearly manifested the primary motivation of disempowerment and disenfranchisement of the Kashmiri people and further usurpation of their rights.\nShe said the BJP government had been seeking to force its decisions upon the IOJK people through the muzzle of the gun by deploying more than 900,000 security forces in the region; a lockdown that continues for over 10 months; arbitrary detentions of thousands including political activists, civil society members, and common men, women and even disabled and snapping all means of communications.\nThe India government was also forcing its decisions through imposing curfew-like strict measures restricting movement, assembly, peaceful political activities even religious congregations. Since August 2019, hundreds of innocent Kashmiris have been martyred in extrajudicial and custodial killings.\nThe spokesperson said the egregious human rights violations by the BJP government in IOJK and collective punishment of entire communities including destruction of homes and means of livelihood were well-documented by international human rights and humanitarian organisations.\n“The Indian Defence Minister’s statement is another desperate attempt to divert attention from India’s state-terrorism and unacceptable human rights violations in IOJ&K. It is also designed to ramp up flailing support for the BJP through unabashed political opportunism and reckless disregard for the peace, stability and security of the region,” she remarked.\nThe spokesperson said the assertion about “international recognition” of the BJP government’s measures in IOJK could best be termed as “obdurate and wilful amnesia.”\nTo assist the Indian Defence Minister’s memory, she said the international opprobrium over the BJP government’s human rights violations in IOJK has been unequivocal, including inter alia three UNSC consultations for the first time in about five decades, U.S. Congressional hearings, discussions in Parliaments around the world especially the EU, condemnation by international human rights and humanitarian organisations, scores of Parliamentarians, hundreds of editorials and op-eds in reputed international newspapers and magazines, and offers of mediation by different world leaders.\n“While the world is pre-occupied with the COVID-19 pandemic, Indian forces have intensified fake “encounters” and “cordon-and-search” operations and increased their repressive actions, including extra-judicial killings of Kashmiri youth. Even the remains of the martyred Kashmiris are not returned to families for funerals.\nThere is stringent censorship of local media and suppression of dissenting voices by excessive use of force in place. All Hurriyat leaders remain under incarceration,” she recounted.\nPakistan reiterated to continue raising the plight of the innocent Kashmiris and support their inalienable right to self-determination as enshrined in the UN Security Council resolutions through a free, fair and impartial plebiscite under the auspices of the United Nations.",
  "retrievedAt": "2025-08-11T19:20:19.601Z"
}
