{
  "title": "Asad fears coronavirus cases can surge to 1.2 million next month, if SOPs violations continue",
  "link": "https://www.app.com.pk/national/asad-fears-coronavirus-cases-can-surge-up-to-1-2-million-by-next-month-if-sops-violations-continue/",
  "date_published": "2020-06-14T05:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):Minister for Planning, Development and Special Initiatives Asad Umar on Sunday expressed fear that the coronavirus cases could surge to 1.2 million by the end of July if strict action were not taken against the violators of standard operating procedures (SOPs), issued by the government to prevent the spread of COVID-19.\n“By the middle of June, we have around 150,000 cases and if such situation prevails and no change is made then according to the experts, the number can increase by two folds to 300,000 by the end of current month and further surge to around one million to 1.2 million by the next month mend,” Asad Umar said in a media briefing after chairing here a meeting of the National Command and Operation Center (NCOC) on COVID-19.\n“This is of course a matter of worry but the good thing is that we have the capability to avoid such situation by taking administrative actions.”\nHe said the administrative measures were already being taken against the violators of SOPs, however, the NCOC had decided to take stricter action against such people.\nThe government did not want to hurt the people, but it was its constitutional as well as moral responsibility to prevent them from spreading the disease, he added.\nThe minister said the capacity of health system was also being improved. The NCOC had taken the decision to increase the COVID-19 testing capacity from current 40,000-50,000 daily to around 150,000 tests within four to six weeks, meaning that around 100,000 people would be tested on daily basis by mid-July.\nAbout the availability of beds with oxygen for the coronavirus patients, Umar said at present around 2,000 patients were on oxygen beds across the country. Keeping in view the growing numbers of patients, the Federal Government would provide 1000 more beds by the end of current month and 1,000 beds next month.\n“We will provide 500 beds each to the Sindh and Punjab provinces, 450 to Islamabad, 400 bed to Khyber Pakhtunkhwa, 200 bed to Balochistan, 60 to Azad Jammu and Kashmir, and 40 to Gilgit Baltistan.”\nAsad Umar said according to the experts, wearing masks was the most effective way to control the pandemic as it could even help decrease the spread rate by 50 percent.\nHe said social distancing was the second most important requirement the people should follow.\nIt had repeatedly been advised that the people should avoid going out of home unnecessarily, and if it were unavoidable, then they should observe social distancing whether they were in a market, at an office or anywhere else.\nHe said the government wanted to save the majority of people of from the disease, warning that more strict actions would be taken against those who did not follow the SOPs, particularly shops and even markets would be locked in such cases.\nHe said in Islamabad, the government had sealed some areas and similar actions would also be taken in Lahore and other cities of Punjab.\nAsad Umar said according to the vision of Prime Minister Imran Khan, the government was also concerned about the economic situation of common man. Pakistan managed to do something for the poor due to timely actions by the prime minister, however, the situation in other countries like India was the worst. India imposed a strict lockdown on a short notice causing the worst situation where people were dying of hunger and pandemic which continued spreading.",
  "retrievedAt": "2025-08-11T19:20:23.665Z"
}
