{
  "title": "NHA converted into self-sustainable institution through austerity, transparency, good governance: Murad Saeed",
  "link": "https://www.app.com.pk/national/nha-converted-into-self-sustainable-institution-through-austerity-transparency-good-governance-murad-saeed/",
  "date_published": "2020-06-14T04:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):Minister for Communications and Postal Services Murad Saeed said Sunday that Pakistan Tehrik-e-Insaf government has turned the National Highway Authority(NHA) , into self-sustainable organization through austerity, transparency, good governance, better service delivery and introduction of the latest technology.\nAddressing the media, Murad Saeed said the Prime Minister himself started the process of austerity through which the expenses of Prime Minister Office were cut down to the significant extent.\nHe said that as per vision of the PM, austerity measures were taken in NHA, and in 20 months, over one billion were saved through austerity.\nHe said NHA revenue has registered significant increase during past 20-month rule of the PTI. He said the NHA also made recoveries worth Rs 11.90 billion and after audit of various projects and saved Rs 3 billion in ongoing projects completion. Its revenue also considerably increased with the help of Geographic Information System mapping, process launching.\nHe said that for ensuring transparency, e-tendering and e-billing and -e-procurement process had been launched in NHA and automation of the departments under the Ministry of Communications was being done.\nThe Minster said China Pakistan Economic Corridor project was a great precedent of Pak-China friendship.\nHe said CPEC was successfully heading towards its destination and new projects are also being launched under the umbrella of CPEC.\nMurad Saeed has said that work has begun on various sections of western route of China-Pakistan Economic Corridor (CPEC), which was the shortest link between Gawadar and Khunjerab. Murad Saeed said that pace of work on CPEC has increased and new projects are also being launched and government has approved DI Khan-Zhob road under CPEC’s\nwestern route.\nHe said road infrastructure projects are being launched in the less developed areas of the country along which was demand of smaller provinces. He said network of roads is being laid down across the country through public and private partnership and under a new vision.\nHe further said that roads of 1813 kilometers will be constructed without any burden on national exchequer with the help of private sector. He said that NHA was initiating mega projects in the country’s history with public, private partnership model to reduce burden on the national exchequer.\nThe minister informed that tender for Hyderabad -Sukkur Motorway will be held this year which would be built on public private partnership. He said that areas near the GT road would be connected to motorway network through Sialkot-Kharian and Kharian Rawalpindi Motorways , to be built on BOT basis. Similarly Balkasar-Mianwali road and Mianwali-Muzafargarh Road would be dualised under the PPP model. Projects in less developed areas of Sindh, South Punjab and Khyber Pakhtunkhwa (KP) and Balochistan were government’s priority, he added.\nThe federal minister further said that 57 projects have been included in this year’s Public Sector Development Programme (PSDP). He added that work on Havelian-Manshea section of Hazara Motorway was completed\nand while it would become operational upto Thakot soon. Multan -Sukkur Motorway was open for traffic.\nHe now a motorway was being planned from Peshawar to DI Khan, under the CPEC.\nHe said the government has given the biggest relief package worth over Rs 1200 billion to the nation in the hour of trial.\nMoreover, he said that 1,2000,000 vulnerable families were given Rs 12000 in wake of the lockdown after outbreak of coronavirus.\nHe urged the masses to strictly follow the precautionary measures to fight coronavirus.",
  "retrievedAt": "2025-08-11T19:20:26.848Z"
}
