{
  "title": "NA Speaker raises voice for Pakistani expatriates stranded in Kuwait",
  "link": "https://www.app.com.pk/national/na-speaker-raises-voice-for-pakistani-expatriates-stranded-in-kuwait/",
  "date_published": "2020-06-14T04:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):National Assembly Speaker Asad Qaiser took up the matter of the Pakistani expatriates stranded in Kuwait with the ministers concerned for their smooth repatriation to Pakistan due to the outbreak of the COVID-19 pandemic.\nThe speaker took up the matter with the Ministers for Aviation and Interior as well as the Special Assistant to Prime Minister for Overseas Pakistanis and Human Resource Development for opening up special flight operations from and to Kuwait on weekly basis.\nIn wake of the ongoing wave of the novel coronavirus pandemic, a significant size of Pakistani expatriates stranded in Kuwait intended to return to their home country and were constantly demanding for regular operation of special flights from and to Kuwait for smooth repatriation of stranded Pakistani expatriates in that country.\nFurthermore, there was also sizeable number of expatriates who were stranded in Pakistan and desired to return to the country of their residence. In the absence of Regional Passport Offices in their zones, they travelled long journeys for renewal of their travel documents.\nIn order to alleviate the sufferings of the expatriates, the NA speaker took the matter of the Regional Passport Offices with the Minister of Interior for expanding the network of Regional Passport Offices so that the genuine grievances of the poor expatriates could be appropriately addressed.\nLikewise, the matter of regular special flights’ operation from and to Kuwait had been taken up with the Ministries for Aviation and Overseas Pakistanis and Human Resource Development so that the smooth repatriation of the expatriates could be ensured.\nThe NA speaker took the matter of the Regional Passport Offices with the Minister of Interior for expanding their network so that the genuine grievances of the poor expatriates could be appropriately addressed.",
  "retrievedAt": "2025-08-11T19:20:25.951Z"
}
