{
  "title": "Combating Coronavirus: Twin cities’ ‘Panahgahs’ get 1,000 face masks from NDMA",
  "link": "https://www.app.com.pk/national/combating-coronavirus-twin-cities-panahgahs-get-1000-face-masks-from-ndma/",
  "date_published": "2020-06-14T04:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 14 (APP):Prime Minister’s Focal Person on ‘Panahgahs’ Naseem ur Rehman Sunday said the National Disaster Management Authority (NDMA) had provided 1,000 face masks to six shelter homes of the twin cities of Rawalpindi and Islamabad to help its dwellers in the fight against COVID-19.\n‘With the number of returning daily wage earners are increasing gradually, our prime focus is to ensure regular medical supplies for twin cities’ shelter homes,” Naseem ur Rehman told the media here during his routine visit to the ‘Panahgah’, located at Sector G-9 of Islamabad.\nHe said ‘Panahgah’ management had been striving to improve the basic services beyond bed and breakfast to include water, sanitation and hygiene for promoting healthy lives. ” We are committed to do everything to support the low income families bread earners who are forced to work in field despite the cases of coronavirus are rising with each passing day.”\nThe focal person said significant attention was being given to keep ‘Panahgahs’ clean. “Pandemic presents us with the greatest responsibility and our team is doing their best to rise up to the challenge,” Naseem ur Rehman remarked.\n“Panagahs in Islamabd and Rawalpindi are leading the way in the observance of COVID-19 standard operating procedures, with provision of effective health care and essential services such as masks, soaps, sanitisers, hand-washing stations and strict adherence to social distancing.”\nHe informed the media that 10 Hand-washing booths had been installed at different ‘Panahgahs’ to help stem the spread of infection with clear cut instructions to the service providers and meal servers to act as role models by regularly wash their hands to promote the hand-hygiene among its residents.\n“It is not easy to reinforce the social distancing, especially at the overcrowded places, such as Panahgahs so we have accelerated awareness campaign on the ground by mobilizing service providers and meal servers through a hands on training program to practice the key precautionary steps,” he noted.\nThe focal person said over 20 key staff at ‘Panagahs’ had been benefitted from the hands on training.\nRecent steps by the government to reopen the construction and selected business activities had given an impetus to the return of daily wage earners in the post Eid scenario, he noted.\nThe six ‘Panagahs’ served over 20,000 needy and poor during the week with food and lodging to around 3,000 persons.\nTalking to APP, Hamza Khan, a labourer from Mardan said: ” The signboard of ‘Panahgah’ has emerged as the beacon of hope for the poor migrant workers who in the past did not know where they will spend the night as they make it to the city in search of livelihood.”",
  "retrievedAt": "2025-08-11T19:20:27.912Z"
}
