{
  "title": "PM for mechanism to encourage financial self-reliance in society",
  "link": "https://www.app.com.pk/national/pm-for-mechanism-to-encourage-financial-self-reliance-in-society/",
  "date_published": "2023-11-01T14:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Wednesday, while appreciating outcomes of the Benazir Income Support Programme (BISP), directed the relevant authorities to chalk out a mechanism for promoting economic self-sufficiency in the society.\nHe said that BISP was yielding good results but Pakistan’s durable future was linked with the financially self-reliant citizens.\nThe prime minister chaired a meeting regarding BISP. The meeting was given a briefing over the performance of BISP and the future strategy.\nThe meeting was attended by BISP Chairperson Amjad Saqib, Secretary Ministry of Poverty Alleviation Yusuf Khan and other senior officials, the PM Office Media Wing said in a press release.\nAbout 60 million members of 10 million families were being benefitted from BISP whose total annual budget this year was Rs 471 billion, it was told.\nThe prime minister praised the financial assistance extended to the deserving families and observed that with the provision of technical training to the BISP beneficiaries, in accordance with the requirements of the market, would enable them to become financially self-sufficient.\nHe said that BISP was a good programme whose database could be used for providing targeted subsidies, and urged the big business entities and well-to-do elements in the society to become partners in BISP under corporate social responsibility.\nPrime Minister Kakar reiterated that the state of Pakistan would provide all possible assistance to the weaker segments of the society so that they could live a life full of hope, and further opined that BISP should enter into partnership with the local welfare and charity organizations.\nHe also asked the authorities to devise a collective mechanism between the government and the local humanitarian organizations.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:20:25.128Z"
}
