{
  "title": "SC dismisses review petitions about Faizabad sit-in case verdict",
  "link": "https://www.app.com.pk/national/sc-dismisses-review-petitions-about-faizabad-sit-in-case-verdict/",
  "date_published": "2023-11-01T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): The Supreme Court (SC) on Wednesday dismissed the review petitions of Pakistan Tehreek-e-Insaf (PTI), Intelligence Bureau (IB) and Defence Ministry about the 2017 Faizabad sit-in case after they were withdrawn by the petitioners.\nThe court said that the Federal Government, Election Commission of Pakistan (ECP), and Pakistan Electronic Media and Regulatory Authority (PEMRA) also requested to withdraw their review petitions.\nThe three-member bench headed by Chief Justice of Pakistan Qazi Faez Isa and comprising Justice Amin-Ud-Din Khan and Justice Athar Minallah, which heard the case, also declared the fact-finding committee as illegal in Faizabad sit-in matter and directed the attorney general to form a new inquiry commission.\nDuring the course of proceedings, Attorney General for Pakistan (AGP) Mansoor Usman Awan informed the court that the government had constituted a fact finding committee on October 19, and its first meeting had already held on October 26. He said that the committee would also prepare its recommendations after inquiring into the matter.\nThe CJP asked the attorney general that under which rules of business the fact-finding committee was formed. Everyone considered the Faizabad sit-in case verdict as a right one and the committee formed by the government was just a trick, he added.\nHe said that the entire country was held hostage by a party. A person was imported, who after taking the country hostage returned abroad, he added.\nHe questioned that whether the government had contacted the Canadian authorities. No one would question whether the people came from Canada and held a sit-in here, he asked.\nThe CJP further questioned that whether Pakistanis could go to Canada for staging sit-ins there. The other countries protected their every citizen, he said.\nCJP Isa remarked that it was the government’s responsibility to implement the verdict in the said case. The country had faced a loss of billions of rupees but nobody bothered about that, he added.\nThe chief justice observed that the court wanted to know that who was the mastermind of Faizabad sit-in. The court’s decision of February 6, 2019 had not been implemented as yet, he said.\nHe said the government should learn a lesson from the past and take such measures so that such incidents should not take place in the future.\nThe court said that the fact-finding committee formed by the government was not acceptable as it was illegal and issued instructions to from a new inquiry commission.",
  "retrievedAt": "2025-08-11T10:20:04.329Z"
}
