{
  "title": "Wafaqi Mohtasib constitutes inspection team for addressing complaints regarding CDA",
  "link": "https://www.app.com.pk/national/wafaqi-mohtasib-constitutes-inspection-team-for-addressing-complaints-regarding-cda/",
  "date_published": "2023-11-01T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP):Taking cognizance of the large number of persistent complaints against the Capital Development Authority (CDA), Wafaqi Mohtasib, Ejaz Ahmad Qureshi constituted an inspection team to visit the Central Directorate of CDA to ascertain the status of its service delivery arrangements and suggest remedial measures.\nThe inspection team is comprised of Senior Advisor Ahmad Farooq, Deputy Advisor Pervez Haleem and Senior Investigation Officer, Adnan Ahmad.\nThe complaints were mostly about the traffic mess caused by the expansion work being carried out by CDA on the Park Road and Islamabad Expressway, depleted condition of roads and streets, defective sewerage system, delayed payments to contractors, substandard construction of infrastructure and delay in payment of pension and retirement benefits to its workers.\nThe Inspection Team met with the Chairman CDA Capt (Rtd) Anwar Ul Haq and other executives of the civic body to get first-hand knowledge about these complaints and discussed with them various measures for timely resolution of the public complaints.\nThe team went around different sections of the CDA Directorate including One Window Facilitation Desk and interacted with the residents who had come there to get redressal of their complaints.\nThe team observed that the public at large was facing problems due to an inordinate delay in the completion of the construction work.\nThe team advised CDA authorities to come up with a time frame for the completion of its ongoing projects.\nThe team also advised the concerned authorities to complete the process for issuing completion and transfer letters within 45 days and objections, if any, must be raised and settled within 30 days.\nThe Team directed the CDA administration not to depute an officer below the rank of BS-19 to represent CDA in the investigation process of the Wafaqi Mohtasib.\nEarlier, the CDA Member (IT) briefed the Inspection Team about the CDA Management Information System (MIS) which was fully functional and was providing online services to the customers.\nAll matters pertaining to sale and purchase of CDA Land have been digitalised and the same is being carried in the attached departments of CDA as well. The team was informed that auto parking facility is being introduced in the limits of CDA to resolve the chronic issue of parking and 160 electric buses are also being included in the fleet of Metro Buses to facilitate commuters.\nThe Inspection Team was also appraised by the CDA Administration on the status of short- and long-term recommendations for institutional reforms which were made in its previous visit.\nThe Team Members lauded the services of the CDA being extended to customers through One Window Facilitation Desk. The Team will submit its report to Wafaqi Mohtasib within seven days.",
  "retrievedAt": "2025-08-11T10:20:10.890Z"
}
