{
  "title": "Extracurricular activities held for exposure, mainstreaming of Baloch youth",
  "link": "https://www.app.com.pk/national/extracurricular-activities-held-for-exposure-mainstreaming-of-baloch-youth/",
  "date_published": "2023-11-01T14:21:00.000Z",
  "source": "APP",
  "content": "QUETTA, Nov 01 (APP): A score of extracurricular activities were held across multiple districts of Balochistan to provide recreational and brainstorming opportunities to the people of the province particularly the youth.\nThe activities including sports, debate and Naat contests, educational rallies and seminars drew thousands of the people who also applauded the idea of holding such activities in the province to enable the youth utilise their energies productively.\nAround 36 cricket matches were held in Hub, Sorab, Chagai, Ziarat, Panjgur, Barkhan, Musakhel, Kech, Khuzdar and Loralai districts in which over 3700 people participated.\nDifferent football matches were held in Kalat, Kech, Harnai, Chagai, Gwadar, Sibbi and Sorab districts which drew an overwhelming participation of around 11,000 people.\nThe Sports Gala held in Hub and Kech was attended by around 1700 people.\nFive debate contests were held in Lasbella and Bolan in which a total of 830 people took part.\nA football match in Naseerabad and a volleyball match in Hub was enjoyed a huge number of locals and actively participated by the sportsmen.\nAround 200 people turned up in Gwadar to take part in an educational rally in World Space Day, besides as many people also attending a Naat competition in Zhob.\nSimilarly, special sessions including debate, Naat and national songs contests were held in Loralai and Sorab, besides a cultural festival held in Hub.\nA seminar on “Corruption and its Impacts” was held in Loralai and apart from a free medical camp organised in Hub providing free medical treatment to hundreds of the people.\nThe people of Balochistan believed that such productive and healthy activities were helping address the sense of deprivation in the province.\nDue to this, the Baloch youths are being mainstreamed and making them play an active role for country’s development.",
  "retrievedAt": "2025-08-11T10:20:05.386Z"
}
