{
  "title": "Pakistan to continue to support Palestinians people: Jalil Abbas",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-to-support-palestinians-people-jalil-abbas/",
  "date_published": "2023-11-01T09:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): Caretaker Foreign Minister Jalil Abbas Jilani while reaffirming Pakistan’s unwavering support for Palestine, on Wednesday said Pakistan always supported the people of Palestinians and would continue to stand by them in future as well.\nWinding up debate on the motion regarding Israeli aggressive actions and atrocities against innocent Palestinians, he demanded immediate withdrawal of Israeli troops from Palestinian territory and cease violation of human rights.\nThe minister also demanded to recognize Palestine as an independent state with Al-Quds Al-Sharif as its capital.\nHe said that it was our religious and national duty to support the Palestinians people against the brutal Israeli occupation.\n“We should all show solidarity towards the oppressed people of Palestinians,” he said.\nThe minister said Gaza had been under the occupation of Israel for the last 17 years and the Palestinians people had been facing unprecedented terror wave since October 7.\nThousands of children and women had been martyred in Gaza during Israeli attacks so far, he added.\nQuoting UN’s statistic, he said that about 8500 Palestinians including 3500 children embraced martyrdoms besides injuries to over 25,000 in the Israeli attacks so far.\nSimilarly, he said 180,000 houses and 222 schools had been destroyed, he added.\nThe minister said 35 health clinics and hospitals had also been attacked by Israel.\nHe said that the UN had compared Gaza to a “graveyard” due to the substantial loss of life.\n“Now, Israel has also expanded its attacks beyond Gaza to West Bank,” he said, adding that Israel’s actions had not only disregard international principles but also openly breaching all international and human rights laws.\nThe minister expressed hope that the House’s voice would resonate as a symbols of peace and optimism for the Palestinian people.\nHe said like Kashmir issue, Palestine was a longstanding unresolved issue on the UN agenda just and there were UN resolutions on both the issues but not yet implemented.",
  "retrievedAt": "2025-08-11T10:19:54.414Z"
}
