{
  "title": "Envoy draws parallel of Indian demographic shifts in Kashmir to Israel: Envoy",
  "link": "https://www.app.com.pk/national/envoy-draws-parallel-of-indian-demographic-shifts-in-kashmir-to-israel-envoy/",
  "date_published": "2023-11-01T14:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 1 (APP): Ambassador of Pakistan in Turkiye Dr Yousaf Junaid on Wednesday calling the Kashmir Black Day the most tragic day in the history of IIOJK, said India was resorting to the same playbook of demographic change similar to Israel, by settling non-Kashmiris in the occupied territory.\nThe ambassador, addressing a ceremony to mark Kashmir Black Day held at the embassy in Ankara, highlighted the atrocities committed by Indian occupation forces against Kashmiris.\nHe said the Kashmiris were living in a situation where they were humans without human rights.\nThe ambassador highlighted that Palestine and Kashmir represented unceasing situations of foreign occupation in the modern world, where brutal military occupations had not only denied the people their fundamental right of self-determination but also unleashed a reign of terror on innocent civilians.\nChairperson Human Rights Investigation Commission of Turkish Parliament Derya Yanik, Member of Parliament Burhan Kayaturk, President SDE Guray Alpar and representatives of media, think tanks and civil society attended the event.\nIn her speech, Chairperson Human Rights Investigation Commission of Turkish Parliament Derya Yanik stated that supporting Kashmir was the requirement of international law and conscience. Turkiye has always supported a peaceful resolution of Kashmir dispute as per the desire of the Kashmiri people and would continue to do so.\nWhile expressing concerns over the worst human rights situation in IIOJK Illegally Indian Occupied Jammu and Kashmir (IIOJK), she urged the international community to play its role in putting an end to human rights atrocities in IIOJK and implementation of UN resolutions to ensure peace and stability in the region.\nReiterating Turkish support for Kashmiri legitimate cause of self-determination, Member of Parliament Burhan Kayaturk stated that when United Nations resolutions were not implemented, it put not only international peace but also human rights at stake.\nPresident SDE Gen. Guray Alper stated that human rights were universal and Kashmiris deserved the basic human right of self-determination like any other.\nAmbassador Junaid also highlighted the deep-rooted Pakistan-Turkiye relationship, founded on common religious, cultural and linguistic affinities and a shared history.\nHe thanked the people and government of Turkiye for their principled stance on Kashmir, especially President Recep Tayyip Erdogan for highlighting the Kashmir cause at UNGA.\nHe reiterated Pakistan’s political, diplomatic and moral support for the legitimate Kashmiri demand for free and fair plebiscite under the auspices of the United Nations.",
  "retrievedAt": "2025-08-11T10:20:03.772Z"
}
