{
  "title": "Senate of Pakistan urges Muslim Ummah to take lead in resolving Gaza-Israel conflict",
  "link": "https://www.app.com.pk/national/senate-of-pakistan-urges-muslim-ummah-to-take-lead-in-resolving-gaza-israel-conflict/",
  "date_published": "2023-11-01T07:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 01 (APP): In a fervent plea to the Muslim Ummah, the Senate of Pakistan on Wednesday called for active involvement in resolving the ongoing Gaza-Israel conflict and for providing urgent assistance to the innocent Muslims suffering under Israeli aggression.\nSenator Irfan Siddiqui, during a passionate debate on the motion, expressed deep concern over the collective silence of the Muslim world in the face of the Gaza crisis, highlighting the dire need for immediate action.\nHe lamented the lack of proactive measures from influential organizations like the Arab League and the Organization of Islamic Cooperation (OIC) in effectively addressing the issue and standing up to Israel.\n“The silence of the Muslim world is deafening,”Senator Siddiqui emphasized, underscoring the urgency of the situation where thousands, including children, are falling victim to daily violence without any meaningful intervention.\nHe drew attention to the stark contrast between the vast geographic expanse of Muslim-populated lands, spanning over 350,000,00 square miles, and the Israeli state, covering a mere twenty thousand square miles, yet the disparity in action remains staggering.\nThe Senator expressed dismay over the recent statement issued by the Arab League, which failed to distinguish between the perpetrators and the victims, equating innocent civilians with Israelis inciting violence.\nSenator Irfan Siddique lamented the spiritual void within our hearts and the hollowness of our words, serving only to console ourselves.\nHe proposed a resolution condemning the assault on the innocent people of Gaza, urging the Chairman of the Senate to preserve it in the Senate records, given that the leader of the house had also presented a unanimous resolution.\nMeanwhile, Senator Saadia Abbasi denounced the establishment of the state of Israel as illegal, affirming that it holds no legitimate claim to the territories it currently occupies.\nAdding historical context to the discussion, Senator Nisar Khuhro recalled the Lahore gathering of March 23, 1940, where crucial resolutions advocating self-determination for Muslims in the subcontinent and the rights of the Palestinian people were passed.\nHe emphasized Pakistan’s unwavering solidarity with Palestine, recalling the pivotal moment when the Palestine Liberation Organization (PLO) was formally invited to the 1974 OIC conference held in Pakistan during the tenure of Zulfiqar Ali Bhutto, attended by Yasir Arafat.\nAmidst the heartfelt solidarity, Senator Hafiz Abdul Kareem delivered a speech in Arabic, strongly condemning the atrocities committed by Israel in Gaza.\nEchoing the sentiment, Senator Behramad Tangi urged fellow senators and philanthropists to extend generous support to the embattled people of Palestine.\nIn the wake of relentless Israeli aggression, Senators Umer Farooq, Saleem Mandviwala, Muhammad Qasim, and Rukhsana Zuberi all joined in condemning the ongoing violence, denouncing it as nothing short of the systematic genocide of the Palestinian people.\nTheir unified voices emphasized the critical need for immediate global action and humanitarian aid to address the harrowing situation in Gaza.\nSenator Keshoo Bai expressed deep concern over the killing of innocent civilians particularly children and women in Israeli aggression.\nShe questioned the UN and international human rights organizations silence over massacre of children, women and old people in Gaza by the Israeli.\nShe said that there was dire need to fully support the Palestine cause. Pakistan Peoples Party (PPP) leadership including Zulfikar Ali Bhutto and Benazir Bhutto always supported the Palestine people, she said.\nKhalida Sikander Mandhro strongly condemned naked aggression of Israeli against the innocent Palestinians and urged the UN and other International organizations to take notice of Israeli brutalities.\nSpeaking on the motion, Shaheed Khalid Butt said that the entire Muslims should expressed solidarity with Palestinians besides fully supporting them.\nSenator Atta ur Rehman called for forging unity among all the Muslim countries. Israel could be wiped out from the world map, if all the muslim got united, he said. He urged the Muslim Ummah to join hands and devised an effective strategy to support the innocent Palestinians people, he said.\nPir Sabir Shah called for disconnecting diplomatic relations with Israel by Muslim countries besides total\nboycotting of Israeli and Jewish companies products.\nHe said that Zulfikar Ali Bhutto launched nuclear programme of Pakistan despite severe foreign pressure\nand Nawaz Sharif conducted nuclear tests by rejecting all offers given by the world powers.\nWe needed a national leader like Zulfikar Ali Bhutto who unite the Mulsim Ummah and convened a\nmeeting of heads of all Islamic countries in 1974 .\nFawzia Arshad termed Israel a terrorist state and called for clear action plan to force Israel to stop aggression against Palestinians people. There was dire need to come on a same page on the issue and stop the genocide of Palestinians people, she said.\nSana Jamali stressed the need of peaceful and amicable solution to the Palestinian issue.\nMuhammad Abdul Qadir deplored that the Muslims were only condemning Israeli aggression and no practical step taken so far to stop genocide of Palestinians. He said even Israeli did not spare hospitals, ambulance and universities during airstrike. Around 64 staff members of UN have lost their lives in Israeli bombardment on Gaza, he said.\nHe said practical steps should be taken rather condemning the Israeli aggression.",
  "retrievedAt": "2025-08-11T10:19:55.698Z"
}
