{
  "title": "Dr Shahzad Waseem for sending fact-finding mission to assess worsening HR situation in IIOJK",
  "link": "https://www.app.com.pk/national/dr-shahzad-waseem-for-sending-fact-finding-mission-to-assess-worsening-hr-situation-in-iiojk/",
  "date_published": "2022-02-04T07:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP): Leader of the House in Senate Dr Shahzad Waseem on Friday underlined the need for sending an international fact-finding mission to the Indian Illegally Occupied Jammu and Kashmir (IIOJ) to assess and compile a comprehensive report on the ever-worsening human rights situation there.\nParticipating in a debate during a special session of the Senate on Kashmir, he said there were two reports of United Nations Commissioner on Human Rights about massive human rights violations in IIOJK and now “We demand to send a fact-finding mission there to compile the third report.”\nRecently, he said the Russell Tribunal on War Crimes had submitted a report, holding India responsible for committing genocide in occupied Kashmir and making illegal settlements.\nHe said the whole Pakistani nation was standing with the people of Kashmir for their right to the plebiscite and would express complete solidarity with them on February 5.\nDr Shahzad urged the international community to play their due role in giving the people of IIOJK their legitimate right to self-determination.\nHe asked the world powers to pressurize India to withdraw the illegal actions of August 5, 2019, and cancel all 4.2 million illegal domiciles issued in Kashmir to change its demographic apartheid immediately.\nHe also demanded to bring all those, who had been identified by Pakistan in its dossier, for committing heinous and inhuman acts.\nHe said Indian PM Narendra Modi should be tried for committing war crimes.\nHe paid tribute to the people of IIOJK for standing firmly against all kinds of oppression and continuing their indigenous struggle to get the right to self-determination.\nLeader of the House said today IIOJK had turned into the biggest prison of the world where innocent and unarmed Kashmiris were facing the worst-ever oppression at the hands of brutal Indian forces.\nHe said the people of Kashmir did not take a sigh of relief since the first Indian army man landed there, regretting that Kashmiris were still waiting for their right to self-determination despite several resolutions passed by the United Nations Security Council in favor of Kashmiris.\nDr Shahzad said Prime Minister Imran Khan internationalized the Kashmir issue by effectively highlighting it at all forums.\nAfter the illegal action of August 5 by India, he said PM Imran became ‘ambassador of Kashmir’ and presented the Kashmir issue in the United Nations General Assembly, met the world leaders and apprised them about the plight of people of IIOJK and massive human rights violations being committed by Indian forces.\nHe said in the recent special session of the Organization of Islamic Cooperation, the Kashmir issue was highlighted.\nAs the result of Pakistan’s efforts, he said, “the Kashmir issue was internationalized and India faced isolation among the comity of the nations.”\nHe said Pakistan exposed the ugly face of India who claimed to be the so-called champions of democracy, secularism, and human rights.\nHe said the UN held a debate on Kashmir three times, which meant that Kashmir was not an internal matter of India.\nHe said the UN Secretary-General also endorsed the stance of Pakistan and the people of Kashmir, adding the UN General Assembly President also supported the Kashmiris’ right to self-determination.\nHe said world leaders including Turkey, Azerbaijan, Germany, Malaysia, and Sweden also agreed with the stance of Pakistan on Kashmir.\nHe said the voice of Kashmir echoed in parliaments of the world democracies including the European Union and the United Kingdom due to the effective diplomacy of Pakistan.\nNow, he said, international media was also highlighting human rights violations and sufferings of IIOJK people at the hands of occupant forces there.",
  "retrievedAt": "2025-08-11T14:15:16.909Z"
}
