{
  "title": "Imprisonment of human rights defenders in IIOJK unjustifiable: Claire Bidwell",
  "link": "https://www.app.com.pk/national/imprisonment-of-human-rights-defenders-in-iiojk-unjustifiable-claire-bidwell/",
  "date_published": "2022-02-04T09:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP): A Scottish Human Rights activist and Co-founder of a group on social media called “Let Kashmir Decide” Claire Bidwell on Friday said the silencing and imprisonment of the Kashmiri leaders and Human Rights defenders in Indian Illegally Occupied Jammu and Kashmir (IIOJK) is unjustifiable.\nIn an online interview with APP, she said that it was up to the Kashmiris to decide and their voice needs to be heard at all levels.\n“Illegal occupation by India is completely unacceptable, the human rights abuses occurring are intolerable and need to be stopped immediately to protect innocent youth, women, children and elderly facing the longest human siege since August 5, 2019,” Claire said.\nShe said the blackout of Kashmiri Media outlets was concerning, adding, “The closure of amnesty International office in India has stopped international efforts to gauge the level of human rights abuses and massacre carried out of unarmed innocent people in the occupied valley. They are unable to stop killings of Innocent Kashmiri men in fake encounters.”\n“The rapes of women and girls and the blinding of children with pellet guns are used as a weapon of war. We are unable to tell the full extent of the genocide occurring, the grouse affect on the environment in terms of mass deforestation and melting of glaciers due to mass military activity in IIOJK.”\nTo a question she expressed, “Our aim is to raise international awareness of the Kashmir conflict and human rights violations occurring in Indian occupied Kashmir”.\nMs Bidwell mentioned that she was standing in complete solidarity with the Kashmiri people and was shocked and alarmed by the Human Rights abuses and illegal occupation that was allowed to happen under the patronage of Indian occupant state.\n“Whilst this is at the hands of the Modi BJP government and the RSS army the international community have a lot to answer for for their silence in the face of such atrocities in IIOJK,” she regretted.\nThe United Nations resolutions and human rights articles and charters were established to ensure that such suffering, abuse, death and destruction did not occur like that which was witnessed during the World War II, she added.\n“We believe in unity and try to build bridges with all voices for Kashmir and all organizations for Kashmir regardless of ideologies and wishes for the future.”\nWhile paying tribute to the Kashmiris’ decades long freedom striggle, she said Kashmiris have worked hard to keep their struggle alive for years and that was an amazing testament to their strengths and their resilience and their determination to survive against all odds.\n“Our aims as an organisation is to bring the voice to the people to bring the Kashmiris’ voices out lending them ours as support and solidarity so they know they’re not alone,” Claire added.\nShe added that each month this was growing in strength and reaching countries such as the US, Russia, South Africa, Canada, Australia, France, Italy, the Philippines, Thailand, the UK and many more.\n“India is proving to be a danger not just to Kashmir rather to the entire region of Asia and also the world. The world must remove their blinkers to control India’s hegemonic designs and violence against Kashmiris.”\nShe underlined that the killings in IIOJK were enormous and there was evidence collected along with various people and human rights reports were keeping us up to date with what was happening in IIOJK. “We have seen innocent bystanders get caught up in Crossfire.”\nClaire underscored that Indian Prime Minister Narendra Modi was moving faster acting against international laws and the Geneva Convention. He intended obviously to change the demography so that when it came for Kashmiris to decide they have a majority of Hindus who would vote to annexe with India.\n“This should be more than religion and more than politics. We have to make a stand against it. We do need an international human rights envoy going into IIOJK to investigate human rights abuses and state-sponsored terrorism against Kashmiris.”\nShe informed that the Amnesty UK would shortly launch a campaign to highlight Kashmir issue and get human rights abuses assessed into IIOJK.",
  "retrievedAt": "2025-08-11T14:15:15.687Z"
}
