{
  "title": "NUST to support establishment of Kamyab Jawan Markaz in Public Sector’s Universities",
  "link": "https://www.app.com.pk/national/nust-to-support-establishment-of-kamyab-jawan-markaz-in-public-sectors-universities/",
  "date_published": "2022-02-04T14:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP): Federal Minister for Science and Technology Shibli Faraz, alongwith Special Assistant to Prime Minister on Youth Affairs Usman Dar held a meeting to discuss matters pertaining to collaboration between the Ministry of Science & Technology and PM’s Kamyab Jawan Programme.\nShibli Faraz highly appreciated the initiatives launched for youth employment under the umbrella of Kamyab Jawan Programme. The Federal Minister expressed keen interest and support of his Ministry in support of Kamyab Jawan’s initiatives, said a press release.\nWhile briefing the Minister, Dar said that under the dynamic leadership of Prime Minister Imran Khan, the government is ensuring institutional arrangements for youth development alongside their engagement at all levels.\n“Kamyab Jawan’s business loans scheme has so far disbursed Rs. 32 billions among young entrepreneurs and has skilled up more than 100000 youth, especially in hi-tech fields under Rs. 10 Billion Kamyab Jawan’s Skills for All project. We have also launched various youth engagement projects with a total cost of Rs. 4 billion”, said Usman Dar.\nDar further said that under the project titled “Kamyab Jawan Markaz” more than 100 youth development centres will be established in all public sector’s universities across the country. These centres will provide multiple services to students including career counselling and access to various opportunities in both public and private sectors.\nShibli Faraz assured his support for establishment of a model Kamyab Jawan Markaz at the National University of Science and Technology(NUST). He said”NUST will provide all possible support and technical assistance for the benefits of Pakistani youth.”\nIt was agreed during the meeting that an MoU between the Ministry of Science & Technology and Kamyab Jawan Programme would be inked soon to formalize cooperation between the two government bodies. The meeting was also attended by government officials from both sides.",
  "retrievedAt": "2025-08-11T14:15:11.289Z"
}
