{
  "title": "Interior Ministry to brief Senate body in-camera on law & order: Rashid",
  "link": "https://www.app.com.pk/national/interior-ministry-to-brief-senate-body-in-camera-on-law-order-rashid/",
  "date_published": "2022-02-04T17:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 04 (APP):Interior Minister Sheikh Rashid Ahmed on Friday said the ministry would give an in-camera briefing to the Senate’s Standing Committee on Interior on the current law and order situation in the country.\nThe minister told the committee, which met with Senator Mohsin Aziz in the chair,\nthat it would be appropriate to brief the committee members in-camera as it was sensitive information.The committee chairman said the in-camera meeting of the body would be convened for the purpose.The committee offered Fateha for the departed souls of armed forces personnel, who embraced martyrdom in the terrorist attacks in Balochistan.\nThe chairman said the brave armed forces had repulsed the terrorist attacks at their camps in Panjgur and Naushki, while killing 15 terrorists. The committee, he said, would present commendation certificates to the FC Jawans, who had valiantly responded to the terrorists.\nThe committee would also give commendation certificates to cousins of Senator Sarfaraz Bugti for their bravery, he added.\nThe committee also reviewed Islamabad Capital Territory Prohibition of Interests on Private Loans Bill, 2021, Criminal Laws (Amendment) Bill, 2021 (Amendments of Section 325 of PPC and Schedule II of Cr.P.C, the Registration (Amendment) Bill, 2021, Code of Crominal Procedure (Amendment) Bill, 2021ng, Children (Pledging of Labour) (Amendment) Bill, 2021, and the performance of CDA with respect to repair and maintenance of government accommodations.\nDiscussing the bills, Leader of the Opposition in Senate Yusuf Raza Gillani said the parliament should frame such laws which were suitable for the entire country.\nThe committee while passing in principle the Code of Criminal Procedure (Amendment) Bill, 2021 introduced by Irfan ul Haque Siddiqui, directed the Interior Ministry to further improve its nitty gritty.It also unanimously passed the Children (Pledging of Labour) (Amendment) Bill, 2021 introduced by Shahadat Awan.\nThe meeting was attended by senators Syed Yusaf Raza Gillani, Azam Nazeer Tarar, Rana Maqbool, Saifullah Abro, Shahadat Awan, Talha Mehmood, Fauzia Arshad, Seemi Ezdi, Sarfaraz Ahmed Bugti, Kamran Murtaza and Dilawar Khan, besides senior officials of departments and ministry concerned.",
  "retrievedAt": "2025-08-11T14:15:03.349Z"
}
