{
  "title": "CM expresses solidarity with Kashmiris, assures support in struggle for freedom",
  "link": "https://www.app.com.pk/national/cm-expresses-solidarity-with-kashmiris-assures-support-in-struggle-for-freedom/",
  "date_published": "2022-02-04T14:46:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 04 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan has expressed solidarity with the people of Indian Illegally Occupied Jammu and Kashmir (IIOJK) in their struggle to get right of self-determination and said that independence is the fundamental right of the Kashmiris.\nIn a message issued on the occasion of Youm-e-Yekjehti Kashmir (Kashmir Solidarity Day) here on Friday, the KP Chief Minister said that we are standing beside people of Kashmir in their struggle of independence. The chief minister urged international human rights organizations to play their due role in ensuring the implementation of the resolutions of United Nations.\nHe said that peace in the region is linked with the resolution of Kashmir issue and no durable peace would be ensured without its settlement. Reiterating the resolve to extend moral, diplomatic and political support to the people of Kashmir, he said that the over seven-decade long struggle of independence by the oppressed Kashmiris is unprecedented.  He said that struggle of Kashmiris for independence would succeed ultimately and they will soon start journey towards peace and progress.\nMahmood Khan said that India, which called herself as biggest democracy of the world, has unleashed a reign of cruelties and barbarism on innocent Kashmiris since last seven decades that are highly condemnable and cruel.\nHe said that the adopting of new tactics by India with each passing day to suppress the struggle of independence by the people of Kashmir and besieging  them since last one year through one sided and illegal steps is a matter of grave concern for the comity of nations particularly United Nations and other human rights organizations.\nHe said the peaceful movement of Kashmiris for freedom is matchless precedent of struggle that could not be suppressed. He said that the present government is not only supporting the peaceful struggle for the right of self-determination by the unarmed and oppressed people of the Indian Occupied Kashmir rather is also on the forefront at all available forums.\nThe chief minister said that in the manner through which Prime Minister Imran Khan taken up the case of Kashmir on the floor of the General Assembly of the United Nations has no precedent in the history.\nHe said that under the leadership of Prime Minister Imran Khan, the people of Pakistan and its government will continue their full political, moral and diplomatic support to the struggle of independence of Kashmiris.",
  "retrievedAt": "2025-08-11T14:15:01.737Z"
}
