{
  "title": "Senators see no durable peace in SA sans Kashmir issue’s resolution",
  "link": "https://www.app.com.pk/national/senators-see-no-durable-peace-in-sa-sans-kashmir-issues-resolution/",
  "date_published": "2022-02-04T12:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 4 (APP): The lawmakers from the treasury and opposition benches in Senate on Friday viewed unanimously that durable peace in the South Asian region could not be guaranteed without resolving the Kashmir issue as per wishes of its people.\nThe Senate of Pakistan had dedicated Friday to discuss the Kashmir issue to express solidarity with the people of Kashmir people, who are struggling for their birth right of freedom from the occupation forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).Earlier, the house suspended the rule of business to discuss the issue of Kashmir.\nInitiating the debate, Leader of Opposition in the Senate Syed Yousf Raza Gillani said “There can be no peace in South Asia unless Kashmir issue is resolved in accordance with the wishes of Kashmiri people.”\nHe said for the normalization of relations between Pakistan and India, it was imperative for India to reverse illegal actions of August, 5 2019, lift the prolonged curfew in IIOJK and release all the detained Kashmiri leaders.\nHe said there were numerous crimes against humanity being committed by the Indian occupation forces, asking the world powers to fulfill their commitment they made with the people of Kashmiri about right to self-determination through the platform of the United Nations.\nHe said more than 73 years had passed and the people of IIOJK were still struggling to get their legitimate right of self-determination as promised by the world powers at their top forum, the United Nations (UN).\nHe said when the Kashmir dispute was intentionally crafted in 1947-1948, the United States, Britain, China, France, Canada, Argentina, Belgium, and Columbia championed the stand that the future status of Kashmir must be ascertained in accordance with the wishes and aspirations of the people of the territory.\nHe said India had undertaken a series of illegal and unilateral measures in the Occupied Jammu and Kashmir since August 5, 2019.\nHe said the abduction of 13,000 young Kashmiris, extra-judicial killing of hundreds of innocent Kashmiris in fake encounters and collective punishments by destroying entire neighborhoods and villages was a norm. Yousaf Raza Gillani said that the people of Pakistan were with the people of Kashmir in their freedom struggle.\nHe recalled that a day of February 5 had been selected by the Shaheed Benazir Bhutto to express solitary with people of Kashmir.\nLeader of the House in Senate, Dr Shahzad Waseem underlined the need for sending an international fact-finding mission in the Indian Illegally Occupied Jammu and Kashmir (IIOJ) to assess and compile a comprehensive report on the ever-worsening human rights situation there.\nHe said there were two reports of United Nations Commissioner on Human Rights about massive human rights violations in IIOJK and now “we demand to send a fact-finding mission there to compile the third report.”\nRecently, he said the Russell Tribunal on War Crimes had submitted a report, holding India responsible for committing genocide in occupied Kashmir and making illegal settlements.\nHe said the whole Pakistani nation was standing with the people of Kashmir for their right to the plebiscite and would express complete solidarity with them on February 5.\nDr Shahzad urged the international community to play their due role in giving the people of IIOJK their legitimate right to self-determination.\nHe asked the world powers to pressurize India to withdraw the illegal actions of August 5, 2019, and cancel all 4.2 million illegal domiciles issued in Kashmir to change its demographic apartheid immediately.\nHe also demanded to bring all those, who had been identified by Pakistan in its dossier, for committing heinous and inhuman acts.He said Indian PM Narendra Modi should be tried for committing war crimes.\nHe paid tribute to the people of IIOJK for standing firmly against all kinds of oppression and continuing their indigenous struggle to get the right to self-determination.\nLeader of the House said today IIOJK had turned into the biggest prison of the world where innocent and unarmed Kashmiri were facing the worst-ever oppression at the hands of brutal Indian forces.\nHe said the people of Kashmir did not take a sigh of relief since the first Indian army man landed there, regretting that Kashmiris were still waiting for their right to self-determination despite several resolutions passed by the United Nations Security Council in favor of Kashmiris.\nDr Shahzad said Prime Minister Imran Khan internationalized the Kashmir issue by effectively highlighting it at all forums.\nAfter the illegal action of August 5 by India, he said PM Imran became ‘ambassador of Kashmir’ and presented the Kashmir issue in the United Nations General Assembly, met the world leaders and apprised them about the plight of people of IIOJK and massive human rights violations being committed by Indian forces.\nHe said in the recent special session of the Organization of Islamic Cooperation, the Kashmir issue was highlighted.\nAs the result of Pakistan’s efforts, he said, “the Kashmir issue was internationalized and India faced isolation among the comity of the nations.”\nHe said Pakistan exposed the ugly face of India who claimed to be the so-called champions of democracy, secularism, and human rights.\nHe said the UN held a debate on Kashmir three times, which meant that Kashmir was not an internal matter of India.He said the UN Secretary-General also endorsed the stance of Pakistan and the people of Kashmir, adding the UN General Assembly President also supported the Kashmiris’ right to self-determination.\nHe said world leaders including Turkey, Azerbaijan, Germany, Malaysia, and Sweden also agreed with the stance of Pakistan on Kashmir.\nHe said the voice of Kashmir echoed in parliaments of the world democracies including the European Union and the United Kingdom due to the effective diplomacy of Pakistan.\nNow, he said, international media was also highlighting human rights violations and sufferings of IIOJK people at the hands of occupant forces there.\nPakistan Muslim League Nawaz (PML-N) MNA Azam Nazeer Tarar said Kashmir was the only international dispute where the solution of the conflict ‘right to self-determination’ was suggested by the parties themselves, India and Pakistan.\nAfter going through the decades-long physical and mental agony, he said now the people of IIOJK were facing the worst type of repression at the hands of the Modi-led fascist government which had stripped the held territory of its special status, on August 5, 2019, by revoking Articles 370 and 35-A to change its demographic apartheid.\nHe said “Now, it is the prime responsibility of the international community, especially the influential countries, to come forward and play their due role in giving the people of IIOJK their legitimate right of self-determination, which had been denied since 1947.\nHe asked the government to nominate parliamentarians from the government and opposition parties for highlighting the Kashmir issue at international forums.\nFaisal Subzwari of Muttahida Qaumi Movement-Pakistan said people of Kashmir were struggling against the Indian occupied forces since their intervention and would continue fighting against the illegal occupation till they achieved of a dream of independence from the clutches of Indian forces.\nHe termed 2019’s move of scrapping the special status of IIKJK was aimed at suppressing Kashmiri’s struggle for independence that continued for the last 74 years and reached the turning point now however the people of Kashmir strongly rejected the annexation or division of the region.\nHe said that his party always supported the Kashmir freedom struggle and would continue doing the same in the future too.\nMaulana Abdul Ghafoor Haideri of Jamiat Ulema-s-Islam (JUI-F) said that the whole nation was united on Kashmir issue.\nHowever, he questioned government’s efforts to highlight the Kashmir issue after August 5 at the diplomatic front.\nShafiq Tareen of Pakhtunkhwa Milli Awami Party while taking part in the debate said a resolution of Kashmir is a must for peace and stability in the region. He said his party strongly condemned human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nTaking part in the debate, Senator PTI Ejaz Ahmad Chaudhry strongly condemned Indian atrocities in IIOJK. He paid a glowing tribute to All Parties Hurriyat Conference Leader (Late) Syed Ali Geelani and other leaders and youth for their struggles against the Indian forces.\nHe said appreciated the freedom struggle of the people of Kashmir for the last 74 years said that Syed Ali Geelani always repeated three words till his last breath “Hum Pakistani hain Pakistan Hamara hai”.\nHe said that delegation comprised of Senate members from government and opposition should be sent abroad for highlighting the Kashmir dispute.\nAdvisor to the Prime Minister on Parliamentary Affairs Dr. Babar Awan said that it looks that international human rights laws and ammunition were was made for Muslim lands only.\nBabar Awan said the world community has failed to fulfill the commitments made to the Kashmiri people. He said we should stand united to take forward the country and effectively highlight the Kashmir dispute.It was unfortunate forces entered Iraq, Afghanistan, Libya, and Syria on fake claims.\nHe paid appreciated the government and opposition benches for holding a special session to express solidarity with Kashmir brethren on Kashmir Solidarity Day. He said that Pakistan had not fought any war with India, while wars had also been imposed on Pakistan.He said that government will welcome the formation of any Parliamentary Committee.\nParliamentary Leader Awami National Party (ANP) Senator Haji Hidayatullah said that the legal status of Kashmir was changed, adding that ANP has a very clear stance that war is not the solution of any dispute. He said that the atrocities in IIOJK were condemnable while the International organization was silent over it.\nSenator Mushtaq Ahmad Khan thanked the leader of the House and Leader of the Opposition for holding an exclusive session on Kashmir.\nHe strongly condemned Indian atrocities and human rights violations in IIOJK and said that the whole nation was on one page on the Kashmir issue.\nSenator Waleed Iqbal said that the people of Kashmir are facing the worst kinds of atrocities in the (IIOJK) for the last 73 years.\nHe asked the international community to take notice of the atrocities being committed by the Indian forces against the innocent people in the (IIOJK).\nSenator Faisal Javed said that a Hidnue woman senator has presided over the special session called to express solidarity with the people of Kashmir had given a message to the international community that minorities are enjoying equal rights in Pakistan.He said that in India, the minorities are tortured and killed by Hindu extremists.\nTahir Bizenjo of the National Party said a resolution of the Kashmir dispute lies only in meaningful and constructive dialogue between Pakistan and India.\nSenatorRaza Rabbani said that women are rapped and children are being killed in the Indian Illegal Occupied Jammu Kashmir.\nHe said that Indian forces are committing war crimes in IIOJK. He said that it was unfortunate that all the international human rights organizations including United Nations are silent. He also questioned the role of OIC on the Kashmir issue.\nSenator Mushahid Hussain Syed has said despite political differences, all parties stood together on issues like Kashmir, Palestine, nuclear program, and the China-Pakistan Economic Corridor (CPEC).\nHe also drew the world’s attention to the grave threat to peace and security posed by Indian actions and called for the international community, particularly the US, to ask India to end its human rights violations in Kashmir and take measures to reduce tensions in the region.\nMinister of State for Parliamentary Affairs Ali Muhammad Khan said that Pakistan would continue to struggle at all political and diplomatic fronts for the independence of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nHe said that the Kashmir issue had been pending for a long time and it was not just a land dispute. He said that the world community should realize and take notice of the violations of human rights in IIOJK.\nThe minister said that this was a commitment of the whole world with Kashmiris through the UN Forum that they will decide their fate themselves. He said that so-called secular India made this assurance at the UN and committed to giving the right of self-determination to the people of Kashmir.\nHe said that the founder of the nation Quaid-e- Azam Muhammad Ali Jinnah had said that Pakistan was incomplete without Kashmir.\nHe said that the people of Kashmir are facing brutality and the Indian army was shamefully killing innocent people.\n“We would continue the struggle for the people of Kashmir at all diplomatic and political fronts,” he said, added.",
  "retrievedAt": "2025-08-11T14:15:12.784Z"
}
