{
  "title": "Cadastral mapping detects encroachment of Rs 5.59 trillion state land: PM",
  "link": "https://www.app.com.pk/national/cadastral-mapping-detects-encroachment-of-rs-5-59-trillion-state-land-pm/",
  "date_published": "2021-11-21T12:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 21 (APP): Prime Minister Imran Khan Sunday said that the first phase of the digitalized cadastral mapping of Pakistan had detected a massive encroachment of state land worth Rs 5,595 billion.\nOn Twitter, the prime minister shared the “shocking facts” coming out of the digitalized land record revealing that the encroached properties also included forest land valuing Rs 1,869 billion.\n“The most shocking facts to come out are: 1. The huge total value of all encroached state & 3 major cities land – approximately Rs 5595 billion; 2. The approximate value of encroached forest land – Rs 1869 billion,” he wrote on Twitter.\nHe said the encroachment had also aggravated Pakistan’s existing lack of sufficient forest cover.\nHe said like the Electronic Voting Machines, the government also faced “massive resistance” while beginning the cadastral mapping of Pakistan to digitalize land records.\n“Results of Phase 1 survey of state lands shows why the resistance: phenomenal state land encroachment including of forest land through land mafia-political elite connivance,” he commented.\nWith this accurate digital record, he said the government would now take action against these land mafias and their facilitators.\nEarlier, in a press conference SAPM Malik Amin Aslam said in Punjab and KP, around 160,000 acres of state land was encroached.\nThe forest land mapping of 30,000 square km was also completed and 700,000 acres of forest land was found to have been intruded by the land mafia.\nTakhtpari Forest in Rawalpindi had a total of 2,210 acres area out of which 755 acres encroached. The Lohi Bher Forest had over 57 percent (629 acres) of its total area encroached by land mafia.",
  "retrievedAt": "2025-08-11T21:38:29.145Z"
}
