{
  "title": "IHC for one more chance to India to hire lawyer for Kulbhushan",
  "link": "https://www.app.com.pk/national/ihc-for-one-more-chance-to-india-to-hire-lawyer-for-kulbhushan/",
  "date_published": "2022-03-03T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):The Islamabad High Court (IHC) on Thursday instructed the government to grant one more opportunity to India for its response in a case seeking appointment of a lawyer to contest the appeal of its spy Kulbhushan Jadhav against his death penalty in line with the International Court of Justice’s (ICJ) decision.\nAttorney General for Pakistan (AGP) Khalid Jawed Khan informed the IHC’s larger bench that according to an act passed by the Parliament, the Law Ministry could file a petition requesting the court to appoint a lawyer for Kulbhushan as India seemed to be not interested in that regard.\nIndia, in fact, wanted to get the judicial proceedings stopped so that it could again approach the ICJ, he added. Pakistan had given consular access to Kulbhushan many times, the AGP said.\nChief Justice Athar Minallah observed that the court would ensure a fair trial in the case. If the court reached a conclusion that the spy was not handed out the capital penalty in accordance with law then it would set aside the decision, he added.\nThe chief justice asked that how the proceedings could now be proceeded as Pakistan had already given multiple chances to India to hire a counsel. India could approach the IHC, he said.\nThe attorney general said the court’s decision was also shared with Kulbhushan Jadhav. If India was not interested then the court on its own should appoint a lawyer.\nIndia was not even satisfied with the act passed by the Parliament in that regard, he added.\nThe court observed that India might have misunderstood the matter and thus it should be given one more chance to hire a lawyer.\nThe AGP said India had adopted a stance in the ICJ that its citizen (spy) was not being given the right of appeal, but now it was not availing that right. India had been wrongly interpreting the ICJ verdict, he added.\nJustice Miangul Hassan Aurangzeb remarked that the Law Ministry could itself appoint a counsel for Kulbhushan Jadhav.\nThe court noted that ICJ had given references of the Peshawar High Court’s decisions , which reflected its trust in the judicial system of Pakistan.\nThe attorney general said the ICJ, in its judgment, had instructed to file an appeal against the death penalty of Jadhav in Pakistani courts.\nThe case was adjourned till April 13.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T14:27:32.110Z"
}
