{
  "title": "Pakistan accords high importance to its long-standing ties with Kenya: CJCSC",
  "link": "https://www.app.com.pk/national/pakistan-accords-high-importance-to-its-long-standing-ties-with-kenya-cjcsc/",
  "date_published": "2022-03-03T18:03:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Mar 3 (APP): Chairman Joint Chiefs of Staff Committee (CJCSC), General Nadeem Raza Thursday said Pakistan accords high importance to its long-standing relations with Kenya and believes that both countries would develop meaningful and long-term strategic relationship through enhanced bilateral engagements especially relations in the field of defence and security.\nThe CJCSC, who is on an official visit to Kenya, made these remarks during his wide-ranging talks held on bilateral defence cooperation with dignitaries from Kenya Defence Forces, which included Cabinet Secretary, Ministry of Defence, Eugene Ludovic Wamalwa, Chief of Defence Forces, General Robert Kariuki Kibochi, Commander Kenya Army, Lieutenant General Walter R. Koipaton, Commander Kenya Air Force Major General John Mugaravai and Commander Kenyan Navy Major General Jimson Longiro Mutai, said an Inter Services Public Relations (ISPR) news release here received.\nBesides security and defence cooperation, matters related to enhancing the level and scope of bilateral military engagements in various fields were discussed during separately held meetings, it added.Both sides reaffirmed their commitment for strengthening and enhancing existing defence and security relationship between the friendly countries.\nKenyan dignitaries remained appreciative of the high professional standards of Pakistan Armed Forces, their achievements in fight against terrorism and continued efforts for regional peace and stability specially for peace in Afghanistan.Earlier upon arrival at Kenya Defence Headquarters, a smartly turned out contingent presented Guard of Honour to CJCSC General Nadeem Raza",
  "retrievedAt": "2025-08-11T14:27:41.494Z"
}
