{
  "title": "British Council launches “Pakistan-UK New Perspectives” program to mark Pak’s 75th anniversary",
  "link": "https://www.app.com.pk/national/british-council-launches-pakistan-uk-new-perspectives-program-to-mark-paks-75th-anniversary/",
  "date_published": "2022-03-03T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 3 (APP):British Council Chief Executive Officer, Scott McDonald hosted a launch event for the Pakistan-UK: New Perspectives program here on Thursday to mark the 75th anniversary of Pakistan.\nThis program recognizes the deep cultural ties between Pakistan and UK bridging relationships between the emerging generation of artists and young leaders of both countries and exploring contemporary cultural identities and artistic expressions, said a press release.\nRunning from March to August, the program has diverse activities and initiatives planned in Pakistan and the UK, in close collaboration with artists and institutions from both countries.  This includes initiatives like the ‘Infinity: what is seen, what is not’ by Osman Yousefzada, which is creating a symbolic bridge between both countries; and the New Perspectives Open Call earlier this year which awarded grants to artists and organisations working together on creative projects.\nAlso announced under the program, is the Scholarship for English Language Teacher in Pakistan, which offers the six scholarships for English language teachers from government schools to attend face-to-face and distance learning programs from select universities in the UK. All these initiatives aim to showcase both countries’ cultural wealth and contemporary identity and creativity, facilitate professional collaboration and engagement for arts and education sectors, and inspire conversations that build a shared future for younger generations.\nAt the launching ceremony Scott McDonald, CEO of the British Council said, “I’m very pleased to be here to launch Pakistan/UK New Perspectives and I look forward to the exciting program line-up over the next few months. British Council has always aimed to reinforce strong people-to-people connections, and I am delighted to be here in Pakistan to see the incredible work we’re doing with people and institutions in Pakistan in education, arts and culture, English and more.\nMany congratulations Pakistan on its 75th anniversary – with so much talent and potential the future of Pakistan looks very bright.” Speaking at the event, Mariya Afzal, Director Pakistan-UK: New Perspectives said, “Through collaborations, the PK-UK Season will be delivering 14 large scale program which includes over 20 sub-projects and several activities engaging 27 PK partners and 28 UK partners, spread across all 4 Pakistan provinces and 4 nations of the UK, reaching millions across both countries.\nPrograming includes innovative interventions that address key global challenges such as climate, and women’s empowerment and inclusivity through the arts, culture and education sectors. Season will be a platform for both Pakistan and UK creative sectors, and inventiveness that our partners will apply in a wide variety of sectors.” Artists, cultural, education related personalities and business leaders were among those who attended the event.",
  "retrievedAt": "2025-08-11T14:27:30.705Z"
}
