{
  "title": "Federal govt in contact with provinces to deal major security issues: Atta Tarar",
  "link": "https://www.app.com.pk/national/federal-govt-in-contact-with-provinces-to-deal-major-security-issues-atta-tarar/",
  "date_published": "2024-10-18T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): Federal Minister for Information and Broadcasting, National Heritage Attaullah Tarar on Friday informed the Senate that although after the 18th Constitutional Amendment, the maintenance of law and order situation was the responsibility of respective provincial governments but the Centre was also in contact with the provinces in major security issues especially at border areas to control drugs smuggling, and terrorism.\nResponding to a point of order, the minister said the National Action Plan (NAP) was devised after Army Public School (APS) incident in Peshawar. Innocent children were martyred in APS attack which resulted forging unity among the entire nation to purge the terrorism from the country’s soil, he added.\nThe federation at that time said that it would play the role of the elder brother, said the information minister. He said NAP was launched to deal with border smuggling, terrorism and gangs etc.\nHe said that despite of the18th Amendment, there was a meeting to discuss the national policy on the grave issues of law and order.\nIn the National Action Plan meetings, the Prime Minister himself went to Karachi several times, he said and added, in 2013, there were terrorist attacks every second day.\n“National Action Plan brought Ulema and media together and banned hate speeches. The Muslim League played its role in this regard. The Ulama had assured full cooperation to bring peace in the country. The National Action Plan had been successfully implemented and terrorism was eradicated” he mentioned.\nThe federal minister said that some people started the debate of good Taliban and bad Taliban and they were brought back and settled unfortunately, today we are picking up dead bodies. In order to maintain law and order, Pakistan Army is sacrificing each day, he added.\nThe then prime minister brought back the terrorists and settled them. He did not see that there is a National Action Plan and under the NAP, the Federation and the provinces had made sacrifices and eradicated terrorism, said the Information Minister. “Today these terrorists attack in Balochistan and Khyber Pakhtunkhwa”.\nAli Amin Gandapur spends 16 hours out of 24 hours on political activities, he said and informed who should establish CTD in Khyber Pakhtunkhwa.\nWhy Safe City project was successful in Lahore and Islamabad, CTD and Forensic Lab were working successfully here, why no one paid attention to CTD and Safe City in Quetta and Peshawar, said the information minister.\n“Our senior officer Captain Mubeen was martyred in Lahore. He did a lot of service in Quetta, because of the Safe City cameras we tracked down the Afghans who planned to kill him and punished them”, the minister lamented.\nZainab’s case is in Kasur, the accused involved in Zainab’s case was hanged, he said.\n“While talking about the Donki incident, the minister said it is very sad that innocent workers were martyred in the incident. Sarfraz Bugti is a capable Chief Minister, I have full confidence in him, and together with the security agencies, they are making great efforts to solve problems like terrorism”.\nWe had brought peace before, we will do it again, he ensured. He hailed that the credit of NFC award goes to President Asif Ali Zardari. Resources are provided to provinces under the NFC Award.\nIt should be noted that no meeting was held on the National Action Plan from 2018 to 2022, he lamented.\n“We were taught that a political opponent is not a political enemy. We were taught that when an opponent falls from a crane, he goes to the hospital and gets treated,” the information minister said.\nIn 2013, Nawaz Sharif himself went to the hospital and took care of PTI’s founding chairman after he fell from a crane. After the 2013 election, he went to Bani Gala himself and talked about working together, said the information minister.\nThis is the flow of time, yesterday you were sitting here, today we are sitting, tomorrow someone else will be sitting, he added.\nFounder and Chairman PTI has poisoned our political traditions, he criticized and said Faryal Talpur was sent to jail from hospital on moon night, while Maryam Nawaz was also arrested in front of her father on false charges, said the minister.\nHe said that the tradition of violating the sanctity of the veil was laid by the founder chairman of PTI. Nawaz Sharif’s mother had died and he had an order to complete the cross-examination. Jahangir Tareen and Aleem Khan’s families were given false papers. The homes of Shahbaz Sharif’s daughters were surrounded.\nAttaullah Tarar said that founder of PTI had polluted the politics and spreads hatred. He had sworn the seed of discord and today he is reaping it.\nHe said that law and order is a provincial matter but the federation is ready for full cooperation.\nThe problem of Katch areas is not only a problem of Sindh, it is also in Punjab. The police were sent in this area for operation.\n“We are in contact with the four provincial governments regarding law and order”, the information minister added.\nThere were 70,000 minority voters in my constituency, he said and added, when it comes to the rights of minorities, we are ready to sit together and talk.",
  "retrievedAt": "2025-08-10T20:09:09.861Z"
}
