{
  "title": "Education key to country’s future: Dr. Musadik",
  "link": "https://www.app.com.pk/national/education-key-to-countrys-future-dr-musadik-2/",
  "date_published": "2024-10-18T11:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): Federal Minister for Petroleum, Dr. Musadik Malik, on Friday said that education was essential for securing the country’s bright future.\nIn his closing remarks at a seminar on sustainable tobacco control policies, Dr. Malik stressed the importance of efforts to prevent children from dropping out of school.\nHe said that children should be encouraged to attend school to secure their own and the country’s future.\nThe minister said that protecting children from social evils is essential to ensuring a better future for Pakistan.\nHighlighting the dangers of smoking, Dr. Musadik Malik called it a major cause of cancer and responsible for countless deaths, urging the public to avoid smoking for the sake of their health.\nHe said that while the number of smokers is decreasing in most parts of the world, South Asia is experiencing an alarming rise in smoking rates, particularly among women and children.\nThe minister expressed concern over how poverty has been turned into a business, allowing some to profit at the expense of public health.\nHe said that when discussing smoking, the argument is often made that the tobacco industry contributes significant tax revenues that help improve the economy. However, a large portion of these tax revenues, he said, is spent on treating smoking-related illnesses in hospitals.\nDr. Musadik Malik raised concerns about the cost to human lives, highlighting that although the cigarette industry contributes taxes, it also causes countless deaths and places a significant burden on the government’s healthcare budget.\nHe stressed the need to prioritize public health, remarking that a healthy society forms the foundation for national development. “We cannot put a price on the lives of our loved ones,” he said, calling for action to curb drug use, especially smoking.\nHe said that the taxes generated by the tobacco industry are not worth more than the public’s well-being and urged everyone to play their part in building a healthier society.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:09:36.437Z"
}
