{
  "title": "Railways employees receiving late salaries due to grant in aid: Awaisi",
  "link": "https://www.app.com.pk/national/railways-employees-receiving-late-salaries-due-to-grant-in-aid-awaisi/",
  "date_published": "2024-10-18T14:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): Parliamentary Secretary for Railways, Muhammad Usman Awaisi on Friday submitted before the lower house of the Parliament that the lower cadre staff of Pakistan Railways was receiving late salaries due to grant in aid provided by the Ministry of Finance.\nThe Parliamentary Secretary was responding to a calling attention notice of Member National Assembly (MNA) Aliya Kamran regarding failure of Pakistan Railways to pay monthly salaries to its employees on the due date, causing grave concern amongst the public.\nMuhammad Usman Awaisi apprised the House that basically the Railways payment of salaries awaits grant in aid to ensure disbursement of its salaries. However, the Finance Ministry needs to resolve the matter by disbursing grant in aid at the end of the previous month instead of start of the month to ensure swift transfer of salaries, he added.\nHe expressed his support for the employees receiving late salaries and assured the move to take up the matter with the Ministry of Finance and Revenue citing the calling attention notice to resolve the matter.\nThe mover, MNA Aliya Kamran said the issue is persisting for the past three years and the former Minister for Railways Khawaja Saad Rafique had vowed to address the matter.\nShe underlined that almost 85% of this staff belonged to the lower cadres who were given salaries on the 17th, 18th, and 19th day of every month that made it impossible to manage their household expenditures.\nThe pensions, gratuity, leave encashment payments were delayed, leaving the retired employees unable to get their post retirement benefits, she added.\nThe Minister should be directed to ensure timely disbursement of salaries to the Railways employees, she urged.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:09:33.196Z"
}
