{
  "title": "SC abolishes policies of recruitment of govt employees’ children",
  "link": "https://www.app.com.pk/national/sc-abolishes-policies-of-recruitment-of-govt-employees-children/",
  "date_published": "2024-10-18T14:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP): The Supreme Court of Pakistan on Friday nullified all the policies and packages related to job quotas of children of government employees.\nA three-member bench of the top court heard the appeal of GPO against the verdict of Peshawar High Court (PHC) and announced its verdict.\nIn a 11-page order authored by Justice Naeem Akhtar Afghan, the court said, “The impugned order passed by the Peshawar High Court in favour of the respondent is set aside. Policies, office memorandums, employment under the Package of the Prime Minister, the Financial Assistance Package, Rule 11-A of the Sindh Civil Servants (Appointment, Promotion and Transfer) Rules, 1974, Rule 10 (4) of the Khyber Pakhtunkhwa Civil servants (Appointment, Promotion and Transfer) Rules, 1989, Rule 12 of the Balochistan Civil Servants (Appointment, Promotion and Transfer) Rules, 2009 or any other rule, policy, memorandum, etc. whereunder appointments without open advertisement, competition and merit, of the widow/widower, wife/husband or child of civil servants in different grades, who die during service or become permanently disabled/invalidated/incapacitated for further service and take retirement from service, are declared to be discriminatory and ultra vires Articles 3, 4, 5(2), 18, 25(1) and 27 of the Constitution. The prescribed Federal and Provincial authorities are directed to withdraw the same.”\nThe order said, “However, it is clarified that the instant judgment shall not affect the appointments already made of the widow/widower, wife/husband or child of deceased or retired civil servants. It is further clarified that this judgment shall not affect the policies, rules or compensation packages of the Federal and Provincial Governments for the benefit of the legal heirs of martyred personnel of the law enforcement agencies and of civil servants who die on account of terrorist activities.”\nThe court said, “Under Article 3 of the Constitution, it is obligatory for the State to ensure elimination of all forms of exploitation and the gradual fulfillment of the fundamental principles, from each according to his ability to each according to his work. To achieve the object of good governance and to fulfill the obligation under Article 3 of the Constitution, transparency and CP No.3390 of 2021 10 merit in appointments in the service of Pakistan that includes government jobs must be adopted.”\nIt said, “The appointment of a widow/widower, wife/husband or child of a civil servant in different grades on contract or regular basis, without open advertisement, competition and merit is also violative of Article 18 of the Constitution which provides that subject to such qualification, if any, as may be prescribed by law, every citizen shall have the right to enter upon any lawful profession or occupation and to conduct any lawful trade or business. Appointments obstructing ordinary qualified citizens to compete for entering into the profession of the service of Pakistan in accordance with their ability and eligibility also violate this fundamental right, and if such appointments are made they negate equality of opportunity, competition, merit and also defeat the object of good governance.”\nThe judgment said, “Good governance cannot be achieved by exercising discretionary powers unreasonably or arbitrarily. This objective can be achieved by following the Constitution and the rules of justness, fairness and openness as enshrined in the above referred Articles of the Constitution.”\nIt may be mentioned here that a citizen Muhammad Jilal filed a Writ Petition in the Peshawar High Court for issuing directions to the GPO to consider him for appointment after the retirement of his father. The PHC had ordered petitioner’s appointment on two year contract. The GPO has filed the appeal to the SC against the verdict.",
  "retrievedAt": "2025-08-10T20:09:33.166Z"
}
