{
  "title": "Pakistan presents Second Periodic Report on ICCPR",
  "link": "https://www.app.com.pk/national/pakistan-presents-second-periodic-report-on-iccpr/",
  "date_published": "2024-10-18T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP):The Pakistan has presented its Second Periodic Report on the International Covenant on Civil and Political Rights (ICCPR) to the United Nations Human Rights Committee during its 142nd session in Geneva on October 17-18.\nThe review process, which was broadcast live on UN Web TV, was accessible to the public, member states, and civil society organizations, allowing global audiences to observe the proceedings.\nThe Pakistani delegation, led by Malik Muhammad Ahmad Khan, Speaker of the Punjab Assembly, included key officials such as Malik Ahmed Bherth, Minister for Law & Parliamentary Affairs, Punjab; Allah Dino Khowaja, Secretary of Human Rights; and Muhammad Arshad, Director General (IC).\nThe Human Rights Committee, composed of 18 independent experts, had earlier issued a “List of Issues” that highlighted specific issues including gender equality, access to justice, and refugee repatriation among others.\nThe dialogue focused on these specific issues, with Pakistan’s delegation presenting a comprehensive overview of the country’s legislative, administrative, and institutional measures aimed at safeguarding and promoting civil and political rights in line with the ICCPR. These initiatives reflect Pakistan’s ongoing commitment to the rights enshrined in the Covenant.\nThe Committee acknowledged Pakistan’s significant efforts and noted that the country’s engagement with the UN Human Rights system is a testament to its dedication to advancing human rights. The Committee commended the multiple steps taken by Pakistan to enhance the protection of civil and political rights.\nThis session underscores Pakistan’s active participation in the international human rights dialogue and its commitment in this regard.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:09:56.490Z"
}
