{
  "title": "Romina urges climate authority to coordinate with stakeholders for unified climate action",
  "link": "https://www.app.com.pk/national/romina-urges-climate-authority-to-coordinate-with-stakeholders-for-unified-climate-action/",
  "date_published": "2024-10-18T10:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 18 (APP):Coordinator to Prime Minister on Climate Change, Romina Khurshid Alam has urged the Pakistan Climate Change Authority (PCCA) to play its role to ratchet up collaboration and cooperation among various federal and provincial governmental orgnisations for achieving climate resilience, environmental sustainability and low-carbon development goals.\nPresiding over the 2nd meeting of PCCA held here, the PM’s climate aide said, “Driving the Pakistan’s long-term sustainability and climate resilience actions is inevitable for ensuring that the country is better prepared to cope with the present and the future exacerbating impacts of climate change in various socio-economic sectors, particularly agriculture, water and energy.”\nRomina Khurshid Alam said further that the Authority, which has been established at the federal level, has been entrusted with an crucial responsibility of achieving the climate resilience, environmental sustainability and low-carbon development goals by spearheading the country’s response to the growing threats of climate change, coordinating efforts across sectors and implementing policies that promote climate resilience through various evidence-based policy measures.\nShe noted that lack of collaboration and cooperation among federal and provincial government organisations for implementing long-term and short-term national climate change policy measures for coping with the adverse fallouts of climate change has only increased the climate vulnerability of not only various socio-economic sectors but also infrastructure, lives and livelihoods of the people.\nHowever, she called upon the PCCA to strengthen its role and pace up efforts to bring together all federal and provincial organisations and national and international non-governmental organisations together through enhanced collaboration and cooperation for implementation of the national climate change policy for protecting the country and its people from aggravating climate risks, particularly floods, heatwaves, sea-level rise, shifting rainfall patterns and paced glacial melting.\nThe PM’s climate aide also urged the authority to develop national programmes for climate adaptation for reducing the impacts of floods, droughts, and rising temperatures and mitigation programmes for cutting down greenhouse gas emissions through sustainable practices and renewable energy projects and actionable low-carbon development plans.\nRomina Khurshid Alam also put emphasis on unprecedented significance of raising public awareness about the effects of climate change and engaging communities in climate action.\n“Raising public awareness about impacts of the climate change and possible adaptation and mitigation measures vital for equipping them with the skills and knowledge to combat climate challenges. And, role of media, educational institutions is key to enhanced the public awareness,” Romina remarked.\nDuring her welcome remarks, Aisha Humera Chaudhry, Secretary Ministry of Climate Change & Environmental Coordination, stressed upon need for the unified approach at the national level to tackle climate challenges.\nShe said that recent devastating floods, heatwaves glacial melting due to rising temperatures in Pakistan’s north indicate that the country is grappling with increasingly adverse socio-economic consequences of climate change, positioning it among the most vulnerable countries globally.\n“With a rising frequency of extreme weather events, particularly devastating floods, extended droughts, paced glacial melt, and rising temperatures, Pakistan’s socio-economic stability and environmental sustainability are under mounting threat,” the climate change and environmental coordination ministry’s secretary highlighted.\nThe Global Climate Risk Index consistently ranks Pakistan among the top ten most affected countries by climate-related disasters. This urgent situation requires a coordinated, robust response at both the national and international levels.\nAs an agrarian economy, the country’s farming sector is highly sensitive to rapidly changing weather patterns. Unpredictable changes in rainfall patterns and the increasing intensity of droughts and floods are devouring crop yields, threatening the livelihoods of millions of farmers and exacerbating food insecurity and rural poverty in the country.\nEarlier, the PCCA members engaged in stock-taking of the status of the implementation of the national climate change policy measures and reviewed the progress of the policy mitigation and adaptation actions.\nThey also deliberated upon possible measures to boost coordination and cooperation across various federal and provincial government organisations, institutions and sectors, ensuring a unified approach to tackling climate challenges being faced by the country.\nThe meeting participants also agreed upon the need to pace up coordination and cooperation for enhanced implementation of the national climate change policy and aligning other climate change adaptation and mitigation measures proposed in policies, plans, and strategies of other federal and provincial government organisations for unified coping response to growing climate change impacts.\nMeanwhile, the PM’s climate aide Romina Khurshid Alam assured her all-out support to PCCA for unified and effective coping response to climate risks, achieving climate resilience and environmental sustainability goals.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T20:10:00.516Z"
}
