{
  "title": "AJK seeks digital census report for delimitation - Pakistan - DAWN.COM",
  "author": null,
  "content": "MUZAFFARABAD: The Azad Jammu and Kashmir (AJK) Legislative Assembly on Thursday unanimously urged the federal government to provide the 2023 digital census report to AJK to facilitate new constituency delimitations and sectoral planning ahead of next year’s general elections.\n\nThe demand was made through a resolution moved by former prime minister and PML-N leader Raja Farooq Haider. The assembly also passed two other resolutions tabled by Mr Haider, calling for a comprehensive strategy to mitigate climate change effects and an increase in the subsistence allowance for post-1989 refugees from occupied Jammu and Kashmir, alongside their permanent settlement.\n\nMr Haider pointed out that for the first time, a nationwide digital census was conducted in May 2023, covering all four provinces, AJK, and Gilgit-Baltistan. The census recorded a significant increase in population compared to the 2017 census. However, the AJK government has yet to receive its official census report.\n\nWith elections approaching next year, new constituency delimitations are necessary based on population growth. Additionally, planning is required for expanding education, healthcare, transportation, and employment sectors, he said, adding that this warranted urgent provision of census data.\n\nAssembly calls for comprehensive strategy to mitigate climate change effects\n\nThrough another resolution, Mr Haider highlighted that Pakistan ranked among the 10 countries most affected by climate change, with AJK facing similar challenges due to its geographical connection.\n\nHe cited the prolonged drought as an example of climate-induced issues affecting the region and urged collaboration between AJK and Pakistan to implement protective measures.\n\nPower Development Minister Chaudhry Rasheed acknowledged the severe impact of climate change in AJK, including worsening water shortages due to insufficient rainfall. He informed the house that a special task force had been established to assess potential climate threats and devise countermeasures.\n\n“We need a comprehensive policy, and all members should contribute their suggestions to the task force,” he said.\n\nThrough a third resolution, Mr Haider termed the existing monthly subsistence allowance for post-1989 refugees inadequate and demanded a reasonable increase. He also urged the government to take steps for their permanent settlement to ensure they lead dignified lives.\n\n“Since the government of Pakistan is serious about resolving refugee issues, the AJK government should coordinate with Islamabad on this matter,” he said.\n\nMinister Rasheed supported the call for a fresh census of Kashmiri refugees in Pakistan and proposed allocating a separate assembly seat for post-1989 migrants.\n\nFood Minister Akbar Ibrahim informed the house that the AJK government was preparing a PC-1 to conduct a census of refugees in Pakistan through the AJK Rehabilitation Department.\n\nPML-N’s Chaudhry Ismail also backed the demand, noting that voter numbers in his constituency [in Punjab] were decreasing rather than increasing. He suggested that the AJK government should work with Nadra to register refugees and ensure their identity cards reflect their status as “Jammu and Kashmir refugees”.\n\nPTI’s Hafiz Hamid Raza supported Mr Haider’s resolution on increasing the allowance and ensuring the permanent settlement of refugees. He also called for a fresh census, arguing that refugee registration was crucial for any potential future referendum.\n\nSumming up the debate, AJK Prime Minister Chaudhry Anwarul Haq affirmed that forest conservation had been prioritised to address climate change and drought.\n\nHowever, he acknowledged that the challenges required urgent action, and the newly formed task force would submit its recommendations within two weeks.\n\nHe also endorsed Mr Haider’s demand for the release of census data.Later, the chair prorogued the house sine die.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:25:20.061Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890257/ajk-seeks-digital-census-report-for-delimitation",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:18:19.000Z"
}
