{
  "title": "Sexual harassment: LHC upholds dismissal of district judiciary employee - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Lahore High Court has upheld the dismissal from service of a district judiciary employee accused of causing sexual harassment to his female colleagues through social media messages.\n\nA special bench comprising Justice Abid Hussain Chattha and Justice Anwaar Hussain passed the verdict on the departmental appeal filed by Rana Nadeem Akhtar, who was a staff officer of the Kasur district & sessions judge.\n\nSeveral complaints were filed by female staff at the district courts against the appellant of harassing them via WhatsApp messages.\n\nA departmental inquiry was launched against the appellant, which led to his dismissal from service.\n\nIn his appeal, the former staff officer questioned the disciplinary action, claiming that it was taken against him after he requested official accommodation.\n\nHe argued that the action was unjustified as the harassment incidents allegedly occurred one-and-half-year ago.\n\nIn its decision, the bench observed that filing a harassment complaint requires immense courage and bravery from a woman.\n\nIt noted that many victims refrain from reporting crimes like rape due to fear of social stigma, let alone workplace harassment.\n\nThe bench said delays in reporting harassment cases should not undermine the credibility of a complaint rather authorities should encourage victims for their bravery.\n\nThe judges maintained that the harassment of women in the workplace is a serious issue, and failing to address it can have devastating consequences for society and the national economy.\n\nThey said women play a significant role, both directly and indirectly, in the country’s economy and society.\n\n“Ensuring a safe work environment will boost women’s confidence and participation,” the judgement said.\n\nIt ruled that the appellant was not only guilty of harassment but had also attempted to influence a judicial magistrate in a bail case, which is now part of his service record.\n\nNine female employees of the Kasur district judiciary testified against the accused, confirming that he sent them inappropriate messages.\n\nThe appellant also attempted to interfere in the recruitment process of his female colleagues without any authority, which was deemed an act of manipulation.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:24:51.691Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890329/sexual-harassment-lhc-upholds-dismissal-of-district-judiciary-employee",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T03:11:28.000Z"
}
