{
  "title": "Trump imposes sanctions on International Criminal Court - World - DAWN.COM",
  "author": null,
  "content": "US President Donald Trump on Thursday authorised economic and travel sanctions targeting people who work on International Criminal Court investigations of US citizens or US allies such as Israel, repeating action he took during his first term.\n\nThe move coincides with a visit to Washington by Israel’s Prime Minister Benajmin Netanyahu, who — along with his former defense minister and a leader of group Hamas — is wanted by the ICC over the conflict in the Gaza Strip.\n\nIt was unclear how quickly the US would announce names of people sanctioned. During the first Trump administration in 2020, Washington imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the ICC’s investigation into alleged war crimes by American troops in Afghanistan.\n\nThe ICC did not immediately respond to a request for comment. The sanctions include freezing any US assets of those designated and barring them and their families from visiting the United States.\n\nThe 125-member ICC is a permanent court that can prosecute individuals for war crimes, crimes against humanity, genocide and the crime of aggression against the territory of member states or by their nationals. The United States, China, Russia and Israel are not members.\n\nTrump signed the executive order after US Senate Democrats last week blocked a Republican-led effort to pass legislation setting up a sanctions regime targeting the war crimes court.\n\nThe court has taken measures to shield staff from possible US sanctions, paying salaries three months in advance, as it braced for financial restrictions that could cripple the war crimes tribunal, sources told Reuters last month.\n\nIn December, the court’s president, judge Tomoko Akane, warned that sanctions would “rapidly undermine the Court’s operations in all situations and cases, and jeopardise its very existence.”\n\nRussia has also taken aim at the court. In 2023, the ICC issued an arrest warrant for President Vladimir Putin, accusing him of the war crime of illegally deporting hundreds of children from Ukraine.\n\nRussia has banned entry to ICC chief prosecutor Karim Khan and placed him and two ICC judges on its wanted list.\n\nUS Secretary of State Marco Rubio will visit Israel and Arab states in mid-February, a State Department official said, making his first trip to the Middle East after a widely condemned proposal by President Donald Trump to displace Palestinians in Gaza.\n\nRubio will travel to the Munich Security Conference and to Israel, the United Arab Emirates, Qatar and Saudi Arabia from February 13-18, the senior State Department official said late on Thursday.\n\nRights groups have condemned Trump’s suggestion that Palestinians in Gaza should be permanently displaced as part of a US takeover of the enclave.\n\nRubio said on Wednesday that Palestinians in the enclave will have to relocate in the “interim” while it is rebuilt following the Israel-Gaza conflict.\n\nThe US official said Rubio would discuss Gaza and the aftermath of the Oct 7, 2023, attacks by Hamas on Israel during the trip, and would pursue Trump’s approach of trying to disrupt the status quo in the region.\n\n“The status quo can’t continue. It’s like wash, rinse and repeat. It becomes familiar and you begin to think this is just what life is and what we have to expect. President Trump and Marco Rubio believe that that’s not the case, that things can change,” the official said.\n\nSince January 25, Trump has repeatedly suggested that Palestinians in Gaza should be taken in by regional Arab nations such as Egypt and Jordan, an idea rejected by Arab states and by Palestinians. Trump’s suggestion echoed long-standing Palestinian fears of being permanently driven from their homes.\n\nUS ally Israel’s military assault on Gaza, now paused by a fragile ceasefire, has killed more than 47,000 Palestinians in the last 16 months, the Gaza health ministry says, and provoked accusations of genocide and war crimes that Israel denies.\n\nThe assault internally displaced nearly all of Gaza’s population and caused a hunger crisis.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/071140134ea2e3a.jpg",
  "retrievedAt": "2025-08-25T19:24:49.320Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890359/trump-imposes-sanctions-on-international-criminal-court",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T07:22:55.000Z"
}
