{
  "title": "South Asian solidarity needed for clean growth: experts - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: An expert panel on development and decarbonisation in South Asia to mitigate the impacts of climate change on Thursday advocated regional cooperation in a spirit of climate solidarity to reduce dependence on fossil fuels and encourage renewables.\n\nIn a discussion titled ‘Beyond Fossil Fuels: Balancing Development and Decarbonisation in South Asia’ at the Breathe Pakistan conference, the speakers underlined regional cooperation as the key to addressing this crisis.\n\nThe two-day moot aims to make Pakistan climate-resilient by 2047 while fostering regional cooperation across South Asia, where countries face shared challenges of rising temperatures, water scarcity and increasing natural disasters.\n\nHarjeet Singh, strategic adviser for the Fossil Fuel Non-Proliferation Treaty Initiative, said the development should not come at the cost of the environment. “While fossil fuel has been polluting the air, dependence on renewable energy should be increased. We need to devise a strategy to address the issue gradually,” he said.\n\nUnicef official says region produces 70-80 per cent energy using fossil fuels\n\nHarjeet Singh said that although the region was not very responsive, it did not mean that the issue should not be taken up. “We should inspire governments to talk to each other as a spirit of solidarity is the necessity of the moment. We cannot let developing countries off the hook,” he said.\n\nSustainable Development Policy Institute Executive Director Dr Abid Suleri, who moderated the session, underlined the impact of the US’s exit from the Paris Agreement earlier this year. He said that as the United States has decided to withdraw funding, to tackle climate change issues, a case should be filed that the US was the major polluter or otherwise the world would have to wait for four years. He suggested other countries come forward and bridge the gap.\n\nUN Resident and Humanitarian Coordinator Afghanistan Indrika Ratwatte suggested that steps should be taken to shift to solar and wind energy. He suggested a cross-border collaboration to address the issue and phase out the fossil fuel gradually. He also suggested thinking globally while acting globally.\n\nSouth Asia Climate Change and Energy Advisor and Carbon Finance Specialist in Unicef Rakshya R. Thapa said that in South Asia, around 70 to 80 per cent of energy was generated through fossil fuels. “We are still far away from achieving the target of achieving renewable energy by 2030. The community-led actions are required to address the issue of fossil fuel-related issues,” she said.\n\nMs Thapa said that Unicef has started clean energy projects in 85 countries. She was optimistic that things would improve as most of the countries were positively responding to the issue. She suggested a meaningful engagement in the region and allocation of funds for the welfare of children. She also suggested a public-private partnership to address the issue.\n\nIt may be noted that Pakistan in December joined a coalition spearheaded by small island Pacific states to push for a new treaty focused on managing an equitable phase-out of fossil fuels and financing a global just transition away from the threat of coal, oil and gas production.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a54bab650d1.gif",
  "retrievedAt": "2025-10-12T01:18:51.891Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890218/south-asian-solidarity-needed-for-clean-growth-experts",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:19:03.000Z"
}
