{
  "title": "Bangladesh asks India to stop former PM Hasina from making ‘false statements’ - World - DAWN.COM",
  "author": null,
  "content": "Bangladesh has asked India to stop ousted former Prime Minister Sheikh Hasina from making “false and fabricated” comments while she is in the country, its foreign ministry said.\n\nHasina fled to India last year following violent protests that killed more than 1,000 people.\n\nIn an online address on Wednesday, she called on her supporters to stand against the interim government in Bangladesh, accusing it of seizing power in an unconstitutional manner.\n\nThousands of protesters gathered in Dhaka before Hasina’s address and, an in effort to disrupt it, demolished and set fire to the home of Mujibur Rahman, her father and Bangladesh’s founding leader. The violence continued after Hasina spoke.\n\nBangladesh’s foreign ministry handed over a protest note to India’s acting high commissioner in Dhaka, conveying “deep concern, disappointment and serious reservation” over her comments, it said in a statement on its Facebook page.\n\n“The ministry … requested … India to immediately take appropriate measures, in the spirit of mutual respect and understanding, to stop her from making such false, fabricated and incendiary statements … while she is in India,” it said.\n\nHasina could not be contacted for comment.\n\nAlthough India did not comment on the communication received from Bangladesh, Foreign Ministry Spokesperson Randhir Jaiswal condemned the destruction of Rahman’s home as an “act of vandalism”.\n\n“It is regrettable … All those who value the freedom struggle that nurtured Bangla identity and pride are aware of the importance of this residence for the national consciousness of Bangladesh,” he said.\n\nIt was in the same house that Rahman declared Bangladesh’s independence from Pakistan in 1971, and he and most of his family were assassinated within its walls in 1975.\n\nHasina had transformed the building into a museum dedicated to her father’s legacy.\n\nThe press office of the chief adviser of Bangladesh’s interim government, Muhammad Yunus, had said on Thursday that the attack on Rahman’s residence was a response to Hasina’s “violent behaviour”.\n\n“The government hopes that India will not allow its territory to be used for destabilising purposes in Bangladesh and will not allow Sheikh Hasina to speak,” it said.\n\nBangladesh has been grappling with political strife since Hasina fled to India in August, with its interim government struggling to maintain law and order amid continuing protests and unrest.\n\nIndia and Bangladesh, which share a 4,000 kilometre border and maritime boundaries in the Bay of Bengal, have longstanding cultural and business ties.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:24:49.245Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890384/bangladesh-asks-india-to-stop-former-pm-hasina-from-making-false-statements",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T09:40:41.000Z"
}
