{
  "title": "PTI concerned over Imran’s health, seeks ‘urgent’ medical care - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The PTI has expressed concern over reports of Imran Khan’s rising sugar levels and irregular heartbeat, urging the government to provide him with access to medical facilities and allow doctors of his choice to examine him.\n\nIn a statement released on Thursday, the party’s information secretary, Sheikh Waqas Akram, criticised the government for denying the PTI chief his “constitutionally mandated rights and facilities”, as outlined in jail manuals.\n\n“The PTI founder is being denied all facilities as part of a scheme to break him, both physically and mentally. Imran Khan’s health and well-being are of utmost importance to us and any negligence in providing medical care could have serious consequences,” Mr Akram observed.\n\nHe called upon the government to ensure Imran Khan’s regular medical checkup by “physicians of his choice”.\n\nMr Khan should be allowed to communicate with his sons as it is his “fundamental, legal and constitutional right”.\n\nHe called for the immediate release of Mr Khan, his wife, former foreign minister Shah Mehmood Qureshi and other PTI leaders.\n\n“Imran Khan is being persecuted for an unrelenting dedication to reshaping Pakistan into a welfare state, where the government truly represents the people, rather than serving the interests of power-hungry elite.”\n\nHe criticised Prime Minister Shehbaz Sharif for extending an olive branch to India despite its policy of genocide and ethnic cleansing in held Kashmir.\n\n“Pakistan should not engage in talks with India until the latter softens its stance and reinstates Kashmir’s special status — before the unilateral constitutional amendment of Aug 5, 2019,” the PTI leader said.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:25:16.913Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890271/pti-concerned-over-imrans-health-seeks-urgent-medical-care",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:18:26.000Z"
}
