{
  "title": "PSX tumbles 1.4pc as downturn enters fifth day - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: Despite continued downward interest rate trajectory and relative political calm, the Pakistan Stock Exchange (PSX) witnessed a ruthless bloodbath on Thursday, extending the losing streak to a fifth straight session due to an unabated institutional selling spree, pulling the benchmark KSE 100 index below the psychological barrier of 110,000 intraday.\n\nTopline Securities Ltd said such was the selling pressure that the index sank to an intraday low by 2,529 points at 109,405.54 before closing at 110,301.16, reflecting a sharp decline of 1,634.22 points or 1.46pc day-on-day.\n\nThe persistent negative sentiment can be attributed to continuous institutional selling over the past week, which severely dented investor confidence.\n\nThe drop was primarily driven by Engro Holdings, Fauji Fertiliser, Mari Energies, Systems Ltd and Pakistan Petroleum, which cumulatively wiped out 675 points from the index.\n\nAhsan Mehanti of Arif Habib Corporation said stocks closed sharply lower amid worries over prospects of foreign debt repayments and EU review on GSP+ status.\n\nHe added that dismal data on fertiliser sales in January, the outcome of the suspension of USAID and prospects of CPEC projects played a catalyst role in bearish activity.\n\nAli Najib, Head of Sales at Insight Securities, said value hunters rescued the market as the index managed 896 points recovery from the day’s low.\n\n“Likely profit-taking by institutional investors, dom­estic and global uncertainty on the political landscape post tariff war, concern regarding IMF meeting on revenue shortfalls, fund flows from equity market to real estate market as many localities in the city witnessing an upward trend in plot prices since CY25TD are the key depressants,” he observed.\n\nThe overall market activity remained strong as the trading volume rose 37.26pc to 598.93 million shares while the traded value rose 10.35pc to Rs25.62bn day-on-day.\n\nStocks contributing significantly to the traded volume included Silkbank Ltd (119.52m shares), World­Call Telecom (80.38m shares), Bank Makramah (64.93m shares), The Bank of Punjab (17.19m shares) and TRG Pakistan (13.12m shares).\n\nGainers led by Nestle Pakistan was up Rs51.11, followed by Haleon Pak­istan Rs30.39, Pakistan Toba­cco Rs27.14, Al-­Abbas Sugar Rs16.34 and Ferozsons Lab Rs15.43.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67a56d24ca1e9.jpg",
  "retrievedAt": "2025-08-25T19:24:57.940Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890306/psx-tumbles-14pc-as-downturn-enters-fifth-day",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T02:16:10.000Z"
}
