{
  "title": "Peca changes challenged in Islamabad High Court - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A faction of the Pakistan Federal Union of Journalists (PFUJ) on Thursday filed a petition before the Islamabad High Court (IHC) challenging the Preven­tion of Electronic Crimes (Amendment) Act (Peca), 2025.\n\nThe petition, filed by Advocate Imran Shafique, argued that the legislation violated fundamental constitutional rights, particularly freedom of expression, press freedom and due process.\n\nThe petitioner contended that several provisions of the amended law were overly broad, vague and prone to arbitrary enforcement, posing a threat to civil liberties.\n\nKey objections include the ambiguous definition of “social media platforms”, which could be applied to various online services, and provisions regulating “unlawful and offensive” content, which are considered subjective and open to misuse.\n\nThe petition also raised concerns about restrictions on criticism and dissent under the guise of preventing “aspersion”.\n\nPFUJ petition argues legislation violates fundamental constitutional rights, particularly freedom of expression\n\nFurthermore, the petition highlighted the extensive powers granted to the regulatory authority under Chapter 1-A, particularly Sections 2C and 2B, which allowed for the removal and blocking of online content without sufficient oversight. The establishment of the council and tribunal under Sections 2(T) and 2(V) has been criticised for lacking independence and impartiality.\n\nAdditionally, the petition argued that the amendment act contradicted fundamental rights enshrined in Articles 2-4, 8, 10A, 14, 18-19A, 25, 33 and 37-38 of the Constitution. It asserted that the law disproportionately impacted journalists and media professionals, potentially stifling press freedom and investigative reporting.\n\nThe petitioner requested the court to declare Peca 2025 unconstitutional and void, while seeking an immediate injunction to prevent its enforcement, particularly against journalists.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:18:36.461Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890270/peca-changes-challenged-in-islamabad-high-court",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:18:26.000Z"
}
