{
  "title": "Justice Sattar calls on IHC CJ to ‘correct errors of judgement’ that led to new seniority list - Pakistan - DAWN.COM",
  "author": null,
  "content": "Justice Babar Sattar has written a letter to Islamabad High Court (IHC) Chief Justice Aamer Farooq to “correct the errors of judgement” that led to the issuance of a new seniority list in the high court, it emerged on Friday.\n\nThe IHC was recently subject to the transfer of three judges from other high courts to its ranks. Subsequently, Justice Mohsin Akhtar Kayani, who was senior puisne jud­ge at the IHC before Justice Sarf­a­raz Dogar’s transfer, was removed from the top decision-making committee days, along with a number of other notifications and measures that reshuffled the high court’s seniority list.\n\nBefore these transfers, five out of 10 IHC judges had penned a strongly worded letter to the president and the chief justice of Pakistan besi­des other high courts’ chief justices, opposing the new inclusions. On Tues­day, these judges sent a representation to Justice Farooq and CJP Yahya Afridi against placing them down on the seniority list.\n\nThe development sparked discussions within the legal community regarding judicial appointments and seniority criteria. Four Supreme Court justices also referred to the issues affecting the IHC in a letter today to CJP Afridi.\n\nIn a letter, dated January 4 and seen by Dawn.com, to Justice Farooq, Justice Sattar said: “It would be unfortunate if the manner of exercise of your functions as chief justice were to sow discord within IHC, which, as a smaller court, boasts a tradition of congeniality valued by the judges that comprise this court.\n\n“It is in this spirit that I invite you to correct the errors of judgment that have influenced your decisions in issuing the seniority list and the aforementioned notifications.”\n\nHe said he was making the above request and detailing the issues in his letter because “there was never a need for greater comity amongst judges than there is now.”\n\nJustice Sattar said the seniority list and notifications were “issued in breach of the Constitution and the law” and he felt dutybound to bring the matter to the IHC chief justice’s attention.\n\nHe pointed out that he had already raised the illegalities that filled the list in a separate representation and was only mentioning the matter here as constitutional provisions that rendered the ranking unconstitutional also rendered the notifications illegal to the extent that they included judges from the Lahore High Court (LHC) and Sindh High Court (SHC) as members of IHC committees without them having made an oath as IHC judges as required under Article 194.\n\n“I apologise if this note reads as a tutorial on Constitutional Law 101. But unfortunately, the circumstances that have unfolded leading to the issuance of the seniority list and the notifications mentioned above are so absurd that pointing out the basic requirements of our Constitution in relation to the assumption of the office of a judge has become necessary,” Justice Sattar said before proceeding to list and explain the various legal and technical issues in the recent transfers and developments.\n\nHe said that Justice Farooq was obligated to administer oaths to the new judges.\n\n“Every passing day that the transferred judges exercise judicial and/or administrative powers and functions of the office of a judge of the IHC, the illegality will continue to be perpetuated.\n\n“Apart from the question of constitutionality of their orders and actions, allowing and/or facilitating the transferred judges to continue to discharge the duties and functions as judges of the IHC, could also cause them embarrassment, in the event that those affected by their orders and/or action challenge the same for being devoid of legal authority,” the judge explained.\n\nHe further elaborated that thus, until such time the transferred judges took their oaths and assumed office, they could not be conferred with any administrative duties and functions as IHC justices.\n\nThus, any IHC judicial committee reconstituted in a manner that comprised any of the transferred judges would not be duly constituted in accordance with the Constitution and the law, and any decisions or actions taken by such committees, apart from embarrassing the IHC, would also be devoid of legal authority, the letter reads.\n\nJustice Sattar said the manner of the Administration Committee’s reconstitution was “absurd, to put it politely, even if one were to disregard the constitutional and legal infirmities that it suffers from”.\n\nHe added that the LHC and SHC judges that were included in the committee had “no knowledge or experience of dealing” with the IHC’s administrative and executive tasks.\n\n“To confer on such transferred judges the responsibility of discharging the administrative and executive work of IHC, that affects all judges of IHC as well as the individuals within Islamabad Capital Territory to whom IHC renders services, is mind-boggling.\n\n“As judges, we pronounce almost every day while exercising judicial review powers against executive actions that public functionaries can only exercise such authority as delegated to them by law, and that while exercising discretionary authority, public functionaries must act in a just, fair and reasonable manner while taking into account relevant considerations.\n\n“You will agree that while exercising discretionary authority, judges are equally bound by the principles regulating the exercise of discretionary powers that we enforce in relation to executive action,” Justice Sattar concluded.\n\nAccording to a notification on Monday, the IHC administration reconstituted the Administrative Committee and Depart­mental Promotion Commi­ttee. Justice Farooq remains the chairman, with Justice Dogar and Jus­tice Khadim Hussain Soo­mro inducted as members. Previously, Justice Kayani and Justice Miangul Hassan Aurangzeb were part of this committee.\n\nFurthermore, the Depa­r­tmental Promotion Com­mittee (DPC) was also modified; it now comprises Justice Dogar and Justice Azam Khan. Earlier, the DPC comprised Justice Kayani and Justice Aurangzeb. The changes were formalised through a notification issued by Additional Registrar Ijaz Ahmed following Justice Farooq’s approval.\n\nThe IHC administration also formally notified Jus­t­ice Dogar as the high court’s senior puisne judge. The administration also revi­sed its seniority list and the changes were impleme­nted after receiving appro­val from Chief Jus­tice Aamir Farooq, with separate notifications issued by the registrar’s office.\n\nThe updated seniority list is as follows: Justice Dogar, Justice Kayani, Justice Aurangzeb, Justice Tariq Mehmood Jahangiri, Jus­tice Sattar, Justice Sardar Ejaz Ishaq Khan, Justice Arbab Muhammad Tahir, Justice Saman Rif­fat Imtiaz, Justice Soomro, Justice Mohammad Azam, Justice Mohammad Asif and Justice Inaam Ameen Minhas.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:24:43.577Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890454/justice-sattar-calls-on-ihc-cj-to-correct-errors-of-judgement-that-led-to-new-seniority-list",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T18:08:07.000Z"
}
