{
  "title": "Trump’s Gaza plan ‘deeply troubling, unjust’: FO - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Rejects proposal to displace Palestinians\n• Says two-state solution only viable and just option\n• Calls for return of displaced Palestinians, end to Israeli occupation\n• Insists COAS remarks on Kashmir not escalation in rhetoric\n\nISLAMABAD: Pakistan on Thursday finally broke its silence about the proposal to forcibly displace Palestinians from Gaza, rejecting the plan which it deemed unjust and a violation of international law.\n\n“The proposal to displace the people of Gaza is deeply troubling and unjust,” the Foreign Office said in a statement.\n\nFO spokesman Shafqat Ali Khan also touched upon the issue at the weekly media briefing.\n\n“The Palestinian land belongs to the Palestinian people, and the only viable and just option is the two-state solution, in accordance with the UN Security Council resolutions,” it added.\n\nPresident Trump had suggested the US “take over” Gaza and develop it economically into the “Riviera of the Middle East” after relocating its population elsewhere, raising alarms about forced displacement.\n\nHis comments triggered swift rejection from the Palestinian leadership, Middle Eastern allies and the United Nations.\n\nDespite the global outcry, Pakistan’s response came later than that of key regional players like Saudi Arabia, Jordan and Egypt. The FO statement also carefully framed its rejection of the proposal without explicitly referencing President Trump’s remarks in a reflection of its cautious diplomatic balancing act, maintaining relations with Washington while supporting the Palestinian cause.\n\nThe delay in giving its response raised questions about Islamabad’s reluctance to confront Washington directly on the issue, even though some US allies, including France and the UK, were quick to condemn the proposal.\n\n“Any attempts to displace the Palestinians from their land as well as to continue illegal settlements would be a blatant violation of international law and undermine the peace and security of the entire region,” the Foreign Office noted.\n\nIt reiterated Pakistan’s long-standing position on Palestinian statehood, calling for the return of all displaced Palestinians, an end to Israeli occupation and immediate humanitarian assistance for Gaza.\n\nFollowing sharp international backlash, the Trump administration appeared to downplay the scope of the controversial plan, with the White House offering clarifications to ease concerns. Press Secretary Karoline Leavitt clarified that President Trump had not committed to deploying US troops in Gaza and made it clear that the US would not provide any funding for the relocation or transfer of Palestinians.\n\nCOAS statement\n\nThe FO spokesman clarified that Army Chief Gen Asim Munir’s recent remarks about Kashmir and potential conflicts were a reaffirmation of the country’s defensive preparedness rather than an escalation in rhetoric.\n\nHe emphasised Pakistan’s long-standing stance on Kashmir and its commitment to a peaceful resolution of the dispute while maintaining a robust defence posture.\n\n“What I can comment is to reiterate our position on Kashmir. You are very well aware of that,” the spokesman said. “On the army chief’s statement, what I can say is that we maintain a very robust defence posture to protect the territorial integrity and sovereignty of Pakistan.”\n\nMr Khan stressed that Pakistan has always sought a peaceful resolution to the Kashmir issue, which remains the central dispute affecting security in South Asia. He described the army chief’s remarks as part of the country’s declaratory defence policy, underscoring its preparedness against any potential aggression.\n\n“About the question of defence policy, declaratory policy is a very important component of that. More than anything, it’s a restatement of Pakistan’s readiness, the defence preparedness, to deal with any eventuality,” Mr Khan maintained.\n\nGen Munir, while addressing a gathering in Muzaffarabad on Wednesday, had stated that Pakistan would not be deterred by India’s military capabilities and was prepared to fight “10 wars” if necessary for Kashmir.\n\nHis remarks came in response to recent statements from Indian defence minister and army chief who while hurling baseless accusations on Pakistan had reiterated India’s false claims over Azad Kashmir.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/0707342294e8e5c.png",
  "retrievedAt": "2025-10-12T01:18:20.530Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890259/trumps-gaza-plan-deeply-troubling-unjust-fo",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:18:14.000Z"
}
