{
  "title": "FIRs registered against lawyers for storming IHC CJ office quashed - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Islamabad High Court (IHC) on Thursday quashed FIR registered against four dozen lawyers under terrorism charges for storming the office of the Chief Justice on Feb 8, 2021, following the demolition of illegal chambers at F-8 Football Ground.\n\nIHC division bench comprising Chief Justice Aamer Farooq and Justice Inaam Ameen Minhas ordered the police to quash the FIR.\n\nFollowing the incident of Feb 8, the high court ordered shutting down the courts and the lawyers’ bodies issued a strike call against the razing of the ‘illegal’ chambers.\n\nPolice registered the FIR under various sections of the Pakistan Penal Code (PPC) and Anti-Terrorism Act (ATA).\n\nThe district administration, Capital Development Authority (CDA) as well as the local police had launched an anti-encroachment operation in the surroundings of the district courts in F-8 and dozens of illegally-constructed offices of the lawyers were demolished and around 10 lawyers were taken into custody for putting up resistance against the drive.\n\nIn response to the operation, some 400 lawyers gathered in the district courts the next morning and stormed the chamber of the IHC chief justice and damaged the property. A few of them broke windows with flower pots and also hurled abuses at the judges.\n\nHowever, the police booked a number of lawyers in the FIR on the basis of CCTV footage. The police arrested every lawyer who was seen around the Chief Justice Block on the footage. The lawyers remained behind bars as they were denied bail for weeks. The petitions seeking to quash the FIR were pending in the IHC for about four years.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:25:00.774Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890226/firs-registered-against-lawyers-for-storming-ihc-cj-office-quashed",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:19:03.000Z"
}
