{
  "title": "Lawyer wants KP govt to withdraw appeal in internment centres case - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: A senior lawyer has requested the leadership of Pakistan Tehreek-i-Insaf, including its founder Imran Khan, to withdraw its provincial government’s appeal from Supreme Court against a Peshawar High Court judgement, declaring Action (in aid of civil power) Regulation, an identical ordinance and internment centres functioning under it as unconstitutional.\n\nAdvocate Shabbir Hussain Gigyani, on whose petitions the high court had delivered the important judgement on Oct 17, 2019, has sent a letter to Imran Khan, central and provincial presidents and general secretaries of PTI and its lawmakers, saying that they can easily withdraw the appeal through Khyber Pakhtunkhwa advocate general, which will be a great favour to the people of this region.\n\nThe high court in its judgement had ruled that Action (in aid of civil power) Ordinance, 2019, violated all fundamental rights of the people enshrined in the Constitution and had directed the KP home secretary to notify all internment centres in the province as sub-jails within 24 hours.\n\nA bench of the then PHC chief justice Waqar Ahmad Seth and Justice Mussarat Hilali (now a Supreme Court judge), which had declared the ordinance and two identical regulations of 2011 unconstitutional, had also ordered production of the lists of people kept in internment centres within seven days.\n\nAppeal against PHC judgement pending in apex court since 2019\n\nHowever, on Oct 24, 2019, the apex court suspended the judgement of high court and since then the matter has been lingering on there.\n\nIn his letter, Mr Gigyani stated that in 2011 the then federal government of Pakistan Peoples Party promulgated the ‘black law’ of Action (in aid of civil power) Regulation for Fata and Pata through which sweeping and unbridled powers were assigned to armed forces.\n\nHe said that internment centres were set up under the said law wherein detainees were kept for years with no access to lawyers etc and even they were denied meetings with families and no charge was communicated to them.\n\nHe said that under that black law security forces were empowered to raid any premises\n\nincluding residences, mosques, hujras and educational institutions and could pick any person without the permission of relevant court.\n\nMr Gigyani stated that with the merger of Fata and Pata in KP in 2018, the said regulation ceased to exist, but in 2019 the then government of PTI passed a law for continuation of the regulation and an ordinance was also promulgated by the then governor Shah Farman for applicability of the law to the entire province.\n\nHe said that on his petitions, the high court declared null and void the said infamous laws as well as the internment centres and declared those centres as sub-jails, which had to be given in the supervision of KP inspector general of prisons.\n\nHe regretted that the then PTI government took an anti-people step by challenging the PHC’s judgement in the apex court and getting a stay order through which the judgement was suspended.\n\nThe lawyer stated that the affairs of those centres were shrouded in complete secrecy and hundreds of inmates were living in inhuman conditions.\n\nHe said that now when after the May 9, 2023 events, the members and leaders of PTI were also facing the same oppression, they should have realised their past mistake.\n\nHe added that if they considered themselves real representatives of Pashtun nation, they should play their role in withdrawing the said appeal from the apex court.\n\nPublished in Dawn, February 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:24:59.157Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1890240/lawyer-wants-kp-govt-to-withdraw-appeal-in-internment-centres-case",
  "dateList": "2025-02-07",
  "date_published": "2025-02-07T01:19:09.000Z"
}
