{
  "title": "Bilawal Bhutto demands govt to hold tripartite dialogue to curb terrorism",
  "link": "https://www.app.com.pk/national/bilawal-bhutto-demands-govt-to-hold-tripartite-dialogue-to-curb-terrorism/",
  "date_published": "2024-04-19T17:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): Chairman, Pakistan People’s Party (PPP), Bilawal Bhutto Zardari on Friday demanded the government to initiate tripartite dialogue with the neighbouring countries to curb the menace of re-surging terrorism.\nWhile talking to media outside the Parliament House, the Chairman Bilawal appreciated Sindh police for thwarting a terror attack in Landhi, Karachi yesterday morning.\nBilawal said, “This is also a reminder that the menace of terrorism is once again rising in Pakistan. The federal and provincial governments will have to take action against the terrorists and ensure to engage the neighboring country to take action against them.”\nThe Chairman PPP said that as a foreign minister he had held a tripartite dialogue at the foreign ministry among the foreign ministers of China, Afghanistan and Pakistan, adding, “We should have similar efforts to eliminate terrorists.”\nThe Chairman PPP said Imran Khan’s government policy regarding the Tehreek-e-Taliban Pakistan, terrorism and about the neighboring country, the way that government let free the terrorists from prisons and invited the terrorists who were in Afghan prisons before the fall of Kabul to enter Pakistan were all wrong.\nThe parliament was not taken on board and the President of the time was giving the terrorists clemency, he added. “That was the policy of Imran Khan’s government. We had criticized that policy then and now we should have a clear stance to see the issue as political but as an issue of national security. You cannot have the policy of running with the hare and hunting with the hounds. This dual policy will not work and the Army, police, common people rendered great sacrifices to eliminate these terrorists in the past,” he said.\nSpeaking about the destruction by the floods in the modern country like United Arab Emirates, Chairman Bilawal said that the climate change is increasing in its intensity with time. Pakistan is an under-developed nation and we are trying to give relief to the people with our limited resources. “The floods in 2022 caused huge destruction. We are constructing two million houses for the flood-hit people. We have to change our development strategy for the federal and provincial governments and make the infrastructure climate resilient and climate friendly so that we can protect the coming generations and President Zardari has also given a message in this regard in his address yesterday.”\nRegarding recent visit of the Saudi foreign minister, Chairman Bilawal said that he thinks that it was the most successful visit. “Saudi Arabia will play a major role in the investment opportunities in Pakistan. This will provide employment opportunities to people all over the country. It is the responsibility of the government and its allies and the opposition to welcome the foreign delegation,” he added.",
  "retrievedAt": "2025-08-11T01:56:49.336Z"
}
