{
  "title": "British army chief lauds Pakistan Army’s professionalism, expertise",
  "link": "https://www.app.com.pk/national/british-army-chief-lauds-pakistan-armys-professionalism-expertise/",
  "date_published": "2024-04-19T11:01:00.000Z",
  "source": "APP",
  "content": "LONDON, Apr 19 (APP): Several decorated British military officers paid glowing tributes to the allure of Pakistan while referring to the hospitality of Pakistanis as being unparalleled.\nThey appreciated the professionalism and versatility of the Pakistan Army, calling it one of the best and most disciplined military organisations in the world, according to a press release received here.\nAround 50 senior British military men of the Quetta Association who studied and served in Pakistan Army’s elite Command and Staff College in the last 50 years shared their views after attending a luncheon in their honour hosted at the Army and Navy Club in London. UK Army Chief General Patrick Sanders was the chief guest on the occasion.\nThe event was organised to cherish the indelible imprints of the British officer’s stay at Quetta.\nThe veteran British officers paid rich tributes, unbounded homage and reverence to the great institution at Quetta.\nNotable British military officers who attended the event included Lieutenant General Sir Alistar Irwin (1980 graduate), Lieutenant General Anthony Palmer (1981 graduate), Brigadier Nick Thompson (1971 graduate), Brigadier Tony Berry (1970 graduate) and Major General Seumas Kerr (1985 graduate).\nThey were accompanied by their wives who were equally delighted in reminiscing the good old memories of the past.\nThe event was conducted by Colonel Taimur Rahat, Army and Air Adviser at Pakistan High Commission London.\nHe spoke on the achievements of the Staff College and informed the audience of the value that Staff College beholds for the training and grooming of officers from 1905 onwards. Col Taimur gave various examples of how command and staff echelons in all major battles fought by the British Army from 1900s to 1950s were groomed at Quetta.\nHe stated that students who studied from this prestigious institution have gone on to become Viceroys, Governor Generals, Presidents and Field Marshals.\nSome are even credited with being founding fathers of various Arms / Services in their country’s armed forces. Countless have laid the supreme sacrifices of their lives in almost every theatre and battlefield of the world.\nThe message of Commandant Command and Staff College Major General Nassem Anwer was also read out in the gathering to the applause of everyone.\nSouvenirs were presented on the occasion to the chief guest and other notables by spouse of the High Commissioner, Pakistan High Commission.\nCommenting about the professionalism of the Pakistan Armed Forces, the British\nArmy Chief said there was no comparison to the Pakistan military’s professional finesse and expertise.\nGeneral Patrick Sanders termed Pakistan as UK Army’s foremost priority in various avenues of Defence Association and Defence Collaboration during his tenure.\nHe fondly recalled the glimpses of his visits to Pakistan over the years and lamented about his forthcoming trip to Pakistan as his last in uniform.\nHe spoke at length on the significance of Pakistan as an extremely vital country situated exactly at the centre of the East and the West. General Patrick Sanders referred to the enriched association and tapestry between the Pakistani and British militaries and highlighted the potential of collaborating in the Defence Industry.\nHe praised the leadership of COAS Pakistan Army General Asim Munir and fondly narrated his personal connection and affinity with him.\nGeneral Patrick also lauded the efforts of Defence Wings of Pakistan and British High Commission for their fervent pursuit of military diplomacy in taking the long- standing ties to another level.\nGeneral Patrick Sanders affirmed the role Pakistan Military plays in defence and nation building.\nHe said that Pakistan army was battle-hardened and known for its ability to defend the country as well as providing vital help to the partner countries.\nHe also recognised the honesty and integrity of the Pakistani Armed Forces officers and recalled unique generosity of the Pakistani nation.",
  "retrievedAt": "2025-08-11T01:57:20.689Z"
}
