{
  "title": "President confers Nishan-i-Imtiaz (M) award on Chief of Turkish General Staff",
  "link": "https://www.app.com.pk/national/president-confers-nishan-i-imtiaz-m-award-on-chief-of-turkish-general-staff/",
  "date_published": "2024-04-19T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): President Asif Ali Zardari on Friday conferred the Nishan-i-Imtiaz (Military) award on Chief of Turkish General Staff, General Metin Gurak in recognition of his illustrious services and contribution to strengthening Pakistan-Turkiye defence relations.\nThe award was conferred at a special investiture ceremony held at the Aiwan-e-Sadr and attended by services chiefs and parliamentarians.\nAs per the citation read out at the ceremony, General Metin Gurak is an officer of high intellect and his excellent administrative qualities earned him the reputation of being a courageous and professionally competent officer. General Metin Gurak has played a vital role for implementing peace and stability around Turkiye.\nGeneral Gurak, during his outstanding military career served on different staff and command appointments which prominently include Commander of 2nd Armored Brigade, Chief of Communication Department of TGS, Commander of Military Academy, Commander of Army Aviation School, Commander of 4th Corps, Commander of Land Forces TRADOC, Communications Services Support Training, Chief of Staff of Land Forces Command and Deputy Chief of Turkish General Staff.\nHe was promoted to the rank of Lieutenant General in 2015. In recognition of his excellent services and outstanding achievements, he was promoted to the rank of General in 2020 and served as 2nd Army Commander before being appointed as Chief of Turkish General Staff in August 2023.\nGeneral is sincere and close friend of Pakistan. He has played a prominent role in promoting and strengthening defence relations between both brotherly countries.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:57:35.946Z"
}
