{
  "title": "12th death anniversary of activist poet Abeda Iqbal Azad on Saturday",
  "link": "https://www.app.com.pk/national/12th-death-anniversary-of-activist-poet-abeda-iqbal-azad-on-saturday/",
  "date_published": "2024-04-18T22:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP):As Pakistan’s literary landscape commemorates another year without Abeda Iqbal Azad, her memory remains as fresh as ever.\nEven 12 years after her passing on April 20, 2012, Abeda stands tall by virtue of her metaphoric presence in modern-day literature whose impact continues to reverberate across generations, her works serving as a source of inspiration for aspiring writers and seasoned wordsmiths alike.\nHer poetry, like a symphony of words, resonated deeply with readers. Equally powerful was her narrative in story stories.\nThrough her stories, she painted detailed portraits of life in all its shades, from the bustling streets of Karachi to the quiet corners of rural villages, each tale presenting a masterpiece of character and conflict.\nAzad was widely known for her historic literature of 1971 Pak-India war and political uprising in the then East Pakistan such as “Dateline Dhaka” and Aag ka darya hai aor doob ker jana hai.”\nBut perhaps it was in her role as a columnist that Abeda truly cemented her legacy as a literary luminary. Fearless and unapologetic, she used her platform to shine a light on the pressing issues facing the country, from social injustices to political corruption.\nHer words were a cry for change, a call to arms for a society grappling with its own demons.\nShe started her journalistic career from a very early age as a feature reporter and was contributing to Bangladesh Observer and Bangladesh Times with her maiden name, Abeda Yasmin Rabbani. After doing MBBS, she got married and moved to Karachi.\nAbeda Iqbal Azad, instantly recognised as an activist poet, is seen expressing her thoughts and emotions through her impactful writings, dealing with social and political issues while campaigning of societal and political for human as well as woman’s rights.\nAbeda Iqbal remained associated with different news organisations as columnist till her last. Her works included Urdu adaptation of the works of Saadat Hussain Manto, Kahlil Jibran and Rabindra Nath Tagore.\nThe late activist was a keen social campaigner and was associated with a good number of non-profit organisations. Abeda Iqbal was a life member of Arts Council of Pakistan (ACP).\nChairperson Department of Urdu, University of Karachi, and the editor IMTEZAAJ, the KU’s Urdu research journal, Professor Dr Uzma Farman Farooqui said, “On the anniversary of Abeda Iqbal Azad’s passing, let’s take a moment to honour her incredible talent as a poet and her understanding of our country’s history and politics, as reflected in her writings.\nFarooqui remembered her as an ardent advocate for feminism, contributing to society in meaningful ways and said that it was heartening to see her being honoured each year as a reminder of her lasting impact and her contributions.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:58:25.271Z"
}
