{
  "title": "PM directs to accelerate countrywide anti-smuggling drive; reiterates zero leniency",
  "link": "https://www.app.com.pk/national/pm-directs-to-accelerate-countrywide-anti-smuggling-drive-reiterates-zero-leniency/",
  "date_published": "2024-04-19T12:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP): Prime Minister Muhammad Shehbaz Sharif on Friday reiterating the resolve to purge the country of smuggling directed the authorities concerned to accelerate the countrywide drive against the menace.\nThe prime minister, chairing a high-level meeting to curb smuggling, paid tribute to Army Chief General Syed Asim Munir for his full cooperation with the government in its endeavor against smuggling.\nA report of the investigation committee headed by AD Khawaja was also presented in the meeting.\nThe prime minister lauded the committee for identifying the elements involved in misuse of Afghan Transit Trade for smuggling and the officers facilitating them.\nThe prime minister was told that a list of smugglers, hoarders, and their facilitating officers have been forwarded to the law enforcement agencies and provincial governments.\nThe prime minister directed for removing the identified officers from their respective posts and initiate disciplinary proceedings against them.\nPrime Minister Shehbaz also asked the LEAs and intelligence agencies to cooperate with each other to curb the smuggling.\nCalling for punishing the smugglers and drug dealers, the prime minister asked the law ministry to carry out immediate necessary legislation for the purpose.\nAffirming no leniency for looters of public money and their facilitators, Prime Minister Shehbaz directed for the measures to provide alternative earning opportunities and conducive atmosphere to the youths living in the frontier regions.\nHe emphasized more swift and effective monitoring of sale and smuggling of Afghan Transit Trade goods in the country, and called for third party audit of the monitoring system.\nPrime Minister Shehbaz ordered to ensure complete elimination of sugar smuggling and immediate release of funds to examine the prevalence of drugs consumption at the national level.\nThe meeting was apprised of the smuggling, misuse of Afghan Transit Trade, drugs, besides sugar, wheat, fertilizer, petroleum products and illegal weapons.\nIt was told that, after consultation with the stakeholders, a national anti-smuggling strategy was in final stage which would be presented for approval.\nThe meeting was told that the law enforcement agencies raided a godown of smuggling goods a couple of days ago in Mastung and confiscated goods worth over Rs10 billion. The prime minister appreciated the law enforcement agencies for their accelerated efforts to curb smuggling.\nFederal ministers Syed Mohsin Raza Naqvi, Jam Kamal Khan, Ahad Khan Cheema, Rana Tanweer Hussain, Dr Musaddik Malik, Azam Nazeer Tarar, Chairman of Federal Board of Revenue, attorney general, personnel of law enforcement agencies and senior officers attended the meeting.",
  "retrievedAt": "2025-08-11T01:57:17.841Z"
}
