{
  "title": "PM Youth Talent Hunt Boys, Girls Table Tennis Championship begins",
  "link": "https://www.app.com.pk/national/pm-youth-talent-hunt-boys-girls-table-tennis-championship-begins/",
  "date_published": "2024-04-19T12:04:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Apr 19 (APP): Special Assistant on Youth and Chairman Prime Minister Youth Talent Hunt Program Rana Mashood Ahmad Khan Friday inaugurated the Youth Talent Hunt Table Tennis Provincial League, which got under way here under the aegis of the Directorate of Sports Islamia College University Peshawar at Lala Rafique Sports Arena.\nVice Chancellor (VC) of Islamia College University Peshawar, Professor Dr. Ali Muhammad, squash legend Qamar Zaman, Director of Operations Azizullah, Organizing Secretary Ali Hoti, and other personalities were present.\nIn the first phase, trials were held in all five regions, including Swat, Hazara, Mardan, Bannu, and Peshawar, wherein five boys and as many girls were selected to compete in the Provincial League. The second phase started here.\nSpeaking at the opening ceremony, chief guest Rana Mashood said, “The PM Youth Program is committed to highlighting the talents of youth and enabling them to face future challenges.”\nHe said, “It is the government’s effort to provide equal opportunities to the youth in sports competitions so that both boys and girls can shine the name of the country at national and international levels.”\nTo provide opportunities to find more talent, such a program is key in playing a role as a suitable platform for the youth to excel their hidden talent in 12 male and 10 female games as part of the Prime Minister Youth Talent Hunt Program.\nHe said, “Sports have been given the status of an industry in civilized and developed countries, and this is the reason why they have done outstanding work in the field of sports.”\nRana Mashood lauded the players for their active participation in games, which leads to their physical and mental health.\nHe said, “Table tennis is a sport that promotes mental and physical agility.”\n“Games teach the lesson of competition, and I believe that providing equal opportunity to the youth across the country to participate in sports events will lead to a healthy society,” he added.\n“I advise the youth to actively participate in positive and extracurricular activities so that they can play an important role in creating a peaceful and healthy society,” he said.\nHe said Prime Minister Mian Muhammad Shehbaz Sharif initiated sports projects as well as the Youth Loan Scheme, along with the Prime Minister’s Laptop Scheme, and gave top priority to working for the welfare of the youth of Pakistan.\nHe said the Talent Hunt Program under the Higher Education Commission would give ample opportunities to the youth to come and show their hidden talent. He said through this program, provincial and national leagues would be conducted, in which boys could take part in 12 different games while girls would participate in 10 different games.\nHe said such a step was taken to bring the youth back to the sports fields by restricting them from negative activities and flourishing in the field of sports. To provide opportunities to blossom, the youth could also reach the international level.\nHe said, after the Provincial and National Leagues, proper training and coaching camps would be organized under qualified coaches.\nThe important thing about this league is that all the players have equal opportunities to qualify for the National League, and the players would be selected for the National League in the third phase, and in the fourth place, they would be sent to international competitions.\nHe said, “Such talented players would be part of the training and coaching camps of various games for the Safe Games to be hosted by Pakistan and other international events.”\n“Remember that one of the objectives of the Talent Hunt Youth Sports League is to create an atmosphere of competition among the youth, to develop a spirit of tolerance, and to promote the practice of sports in the country,” Rana Mashood said.\nHe said, “Pakistan is facing many challenges at home and abroad, but we are determined to provide a good future to our youth by providing them equal opportunities at the grassroots level.”\n“Let’s take a pledge that no matter what sector we belong to, our goal will be to work for the development and prosperity of Pakistan,” he added.\nEarlier, the VC of Islamia College University, Peshawar Ali Muhammad, welcomed him and said, “Such activities are very important for the physical and mental development of children, and sports can reduce depression and increase the tendency towards positive activities.”",
  "retrievedAt": "2025-08-11T01:57:19.033Z"
}
