{
  "title": "Intermittent rain not letting cold season fade away; to continue for another day",
  "link": "https://www.app.com.pk/national/intermittent-rain-not-letting-cold-season-fade-away-to-continue-for-another-day/",
  "date_published": "2024-04-18T22:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 19 (APP):Intermittent rain continued in parts of the federal capital on Friday, as per forecast of Pakistan Meteorological Department (PMD), is not letting the cold season fade away through decreasing the temperatures once again.\nThe rain of light to moderate intensity along with windstorm and lightening started on Thursday afternoon and continued on Friday with occasional gaps, turning into heavy falls at times.\nThe weather usually changes from cold to hot during the month of April with an increase in the day temperatures however this year, the continuous two rain spells with little gap has hindered the transition of weather from cold to hot.\nThe rainy weather along with dipping mercury has again compelled the citizens to unpack the warm clothes which most of them have packed and stored in the almirahs and trunks assuming the onset of hot weather conditions. The elderly and children are the ones who remain at the risk of catching diseases during the extreme weather conditions.\nHowever due to climate change, as per weather experts, the weather patterns have been changed and causing intense rain-producing systems, bringing inundations in the low-lying areas, landslides and damaging loose structures and electric poles.\nAccording to the Pakistan Meteorological Department (PMD) forecast, rain-wind/thunderstorm is expected in most places of upper Khyber Pakhtunkhwa, Gilgit-Baltistan, Kashmir and Pothohar region on Saturday while snowfall is also likely in mountains in northern areas.\nAs per the synoptic situation, a strong westerly wave was affecting most upper parts of the country and will continue during the next 24 hours.\nThe PMD has warned that heavy rainfall may generate flash flooding in local nullahs or streams of Dir, Swat, Chitral, Kohistan, Manshera, Gilgit-Baltistan, Kashmir and Tributaries of Kabul River on April 19.\nThe PMD has indicated the possibility of landslides in upper Khyber Pakhtunkhwa, Murree, Galiyat, Kashmir and Gilgit Baltistan and may affect the vulnerable locations during the period.\nWindstorm/hailstorm and lightning may damage standing crops, loose structures like electric poles, vehicles and solar panels etc during the period.\nKeeping in view the rain emergency declared in few parts of the country, the citizens have been advised to minimize the unnecessary travel and remain indoors during rainfall unless absolutely necessary.\nAs per PMD’s weather report of 10:30 am, rain-wind/thunderstorm occurred in Punjab, Khyber Pakhtunkhwa, Kashmir, northern/central Balochistan and Gilgit-Baltistan during the last 24 hours.\nThe rainfall recorded was in Punjab: Karoor (Layyah) 43mm, Bhakkar 35, Attock 33, Noorpur Thal 22, Islamabad (Airport 22, Golra 20, Zero Point 14, Saidpur 13, Bokra 12), Chakwal 19, Kot Addu 18, Rawalpindi (Chaklala 15, Shamsabad, Kacheri 10), Murree 13, Jhelum 12, Multan (Airport 11, City 04), Mandi Bahauddin 08, Gujarat 07, Sialkot (City 04, Airport 02), Gujranwala, Joharabad 04, Dera Ghazi Khan 03, Sargodha, Mangala 02, Hafizabad 01, Kashmir: Garhi Dupatta 31, Rawalakot 20, Kotli 13, Muzaffarabad (Airport 12, City 09), Khyber Pakhtunkhwa: Kakul 28, Dera Ismail Khan (Airport 24, City 23), Dir (Upper 20, Lower 12), Peshawar (Airport 20, City 16), Malam Jabba 18, Cherat, Mardan 15, Saidu Sharif 13, Bacha Khan (Airport) 12, Parachinar 09, Kalam 08, Pattan 04, Balakot, Chitral, Drosh, Mirkhani 02, Balochistan: Quetta (Samungli 25, City 05), Qalat 23, Dalbandin 21, Barkhan 16, Zhob 13, Panjgur 05, Gilgit-Baltistan: Astore 05, Gupis 02, Chilas, Gilgit and Skardu 01mm.\nThe highest maximum temperatures recorded were Bahawalnagar 40 C, Jacobabad, Khanpur, Mithi and Dera Ghazi Khan 38C.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:58:24.408Z"
}
