{
  "article_id": "2025-02-20_b3c92a315f24aebb7b72735b47f5da05",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/anti-polio-drive-in-karachis-high-risk-ucs-from-feb-22/",
    "retrieved_at": "2025-08-27T12:55:17.915Z"
  },
  "metadata": {
    "title": "Anti-polio drive in Karachi’s high-risk UCs from Feb 22",
    "author": null,
    "date_published": "2025-02-20T17:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 360,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 20 (APP): The Government of Sindh, in collaboration with its partners will launch polio immunization drive in 27 high-risk union councils (UCs) of Karachi from February 22. The campaign will strengthen children's immunity and curb the transmission of the poliovirus. This first phase of the campaign aims to vaccinate 562,163 children under the age of five with Oral Polio Vaccine (OPV) and administer Fractional Inactivated Polio Vaccine (fIPV) to 521,953 children aged four months to under five years using painless jet injector technology. As Pakistan's largest and most densely populated city, Karachi remains a crucial battleground in the fight against polio. The city's frequent population movement contributes to the persistent presence of poliovirus in environmental samples. Despite repeated vaccination efforts, transmission risks remain high, making targeted campaigns essential to closing immunity gaps and protecting children from lifelong paralysis. The use of painless jet injector technology for fIPV administration ensures a needle-free, stress-free experience for children. The combination of OPV and fIPV further strengthens immunity, offering additional protection in areas where the virus continues to circulate. Recently, in August 2024, an f-IPV campaign was successfully conducted in Karachi. Speaking about the urgency of this campaign, Irshad Ali Sodhar, Provincial Coordinator of the Emergency Operations Centre (EOC) Sindh, said, \"Karachi remains one of the most critical areas for polio eradication due to continuous virus detection in environmental samples.\" This campaign is a crucial step in boosting children's immunity and ensuring no child is left vulnerable. \"We urge all parents to cooperate with vaccinators and ensure their children receive both OPV and fIPV doses.\" He said \"Every vaccination brings us closer to a polio-free future.\" He said that the Government of Sindh remains committed to protecting every child from polio. He added parents and caregivers should cooperate with polio teams and ensure their children receive the vaccine during this lifesaving campaign. He said that the role of the media is vital in disseminating accurate information, raising awareness, and encouraging public participation. \"We call on journalists, media houses, religious influencers and community leaders to amplify this message-polio eradication is a national cause, and every child vaccinated brings Pakistan closer to being polio-free.\"",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}