{
  "article_id": "2025-02-20_a6643eb1fb67ccfc3b8ed5e7a6e54ca9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/scp-upholds-judgement-of-lhc-in-harassment-case/",
    "retrieved_at": "2025-08-27T12:56:08.355Z"
  },
  "metadata": {
    "title": "SCP upholds judgement of LHC in harassment case",
    "author": null,
    "date_published": "2025-02-20T13:28:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 238,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 20 (APP):Giving a significant support to working women and expressing Pakistan commitment to eliminating workplace harassment, the Supreme Court has maintained the judgement of the Lahore High Court dismissing a convict of sexual harassment from service. A two member bench of the Supreme Court of Pakistan, headed by Justice Syed Mansoor Ali Shah and comprising Justice Aqeel Ahmad Abbasi, was hearing an appeal against a judgement of the Lahore High Court in sexual harassment case. The Petitioner, Muhammad Din, was dismissed from service by the Ombudsman Punjab office for sexual harassment of a lady physician Dr. Sidra Zafar. In her petition under the Protection against Harassment of Women at Workplace Act 2010, she alleged harassment and misconduct of her driver Muhammad Din before the Ombudsman, Punjab. The Ombudsman issued a show-cause notice to the accused but he denied the allegations. However, the Ombudsman found the allegations true after thorough investigation and sent the accused on compulsory retirement. The Petitioner preferred representation before the Governor Punjab that was dismissed. Subsequently, the petitioner invoked the constitutional jurisdiction of the Lahore High Court by filing a writ petition that was dismissed too. The Supreme Court, in its order, says that it is imperative to recognize that workplace harassment remains a pressing global issue, affecting millions of workers across various sectors. More than one in five workers (22.8% or 743 million people) worldwide have experienced some form of workplace violence.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}