{
  "title": "ANF arrests 13 suspects with 37 kg drugs",
  "link": "https://www.app.com.pk/national/anf-arrests-13-suspects-with-37-kg-drugs/",
  "date_published": "2024-11-18T07:57:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Nov 18 (APP):Anti-Narcotics Force (ANF) while conducting 11 operations across the country managed to arrest 13 suspects and recovered 37 kg drugs worth Rs 4.2 million, said an ANF Headquarters spokesman on Monday.\nHe informed that in an operation, 90 grams hashish was recovered from an accused arrested near a university in Islamabad.\nThe arrested accused confessed to selling drugs to the students of educational institutions.\nIn another operation, 8 kg hashish was recovered from the secret cavities of a car intercepted on GT Road in Mansehra and an accused was also arrested.\nA total of 4.4 kg hashish was recovered from 2 suspects rounded up near Burhan Interchange, Attock.\nAnother operation near a hotel in Mansehra was conducted and 7 kg hashish was recovered from a vehicle besides netting an accused.\n5 kg hashish was recovered from two suspects held near University Road in Sargodha.\n3.6 kg hashish and 1 kg ice concealed in a truck near Shaheen Chowk, Gujarat were recovered and an accused was arrested during the operation.4.1 kg hashish and 1 kg opium were recovered from two suspects travelling in a passenger bus near M-1 Toll Plaza, Islamabad.\nIn 8th operation, 1 kg opium and 100 grams ice were recovered from the possession of an accused rounded up on Wazirabad Road, Sialkot.1 kg ice was recovered from an accused held near Sakhi Sarwar Road in DG Khan and 1 kg ice was recovered from an abandoned car near Hayatabad in Peshawar.\nIn 11th operation, 465 grams ice was recovered from an accused arrested near Muzaffargarh Road, Multan.\nCases under the Anti-Narcotics Act have been registered against the arrested accused and further investigations are under process.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:25:31.284Z"
}
