{
  "title": "Pakistan to continue unwavering cooperation to Syria in education, trade: Ayaz",
  "link": "https://www.app.com.pk/national/pakistan-to-continue-unwavering-cooperation-to-syria-in-education-trade-ayaz/",
  "date_published": "2024-11-18T14:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP):Speaker National Assembly Sardar Ayaz has said that Pakistan would continue its unwavering cooperation and support to Syria in education, trade, tourism, especially religious tourism.\nDuring a meeting with the Ambassador of Syrian Republic in Pakistan Dr. Ramez Alraee, he said that Pakistan and Syria enjoy historic and brotherly relations, both countries are tied in the bond of shared religion, fraternity, history and culture.\nThe matters pertaining to bilateral relations and important regional and international issues were discussed in the meeting.\nThe Speaker stressed the need for unity among the Muslim countries to cope with the challenges confronting to Muslim ummah.\nHe said that the peace in the Middle East is linked with peace in Palestine. He noted that Pakistan fully supports the sovereignty and territorial integrity of Syria and a desire durable peace in Syria.\nAyaz Sadiq emphasized the importance of Pak-Syria Parliamentary Friendship Group (PFG) and highlighted the role of PFG in the National Assembly as a significant platform for fostering mutual understanding and collaboration. He lauded the commencement of commercial flight operations of Syrian Airlines between Damascus and Lahore.\nThe Speaker was confident that flight operations of Syrian Airlines would promote people-to-people contact, trade and tourism between both brotherly nations.\nHe also appreciated the hospitality extended by Syria to Pakistani Zaireen visiting Syria for Zyaraat of Shrines.\nThe envoy said that Syria values its historic relations with Pakistan and the Syrian Government wants to further strengthen the existing ties through enhanced cooperation in diverse fields.\nWhile apprising the NA Speaker regarding the newly started flight operation, the ambassador said that this initiative would not only facilitate the Pakistani Zaireen & business community but will also strengthen the socio-economic cooperation between both countries.\nHe praised Pakistan’s efforts for promotion of peace in the region. He expressed his gratitude to People and Government of Pakistan for supporting Syria in the field of education & religious tourism.\nLater on, the Ambassador of the People’s Democratic Republic of Algeria Brahim Romani met with NA Speaker Sardar Ayaz Sadiq at the Parliament House. Both sides discussed matters of mutual interest regarding enhanced cooperation in trade & energy sector and parliamentary diplomacy.\nAyaz Sadiq said that Pakistan and Algeria have deep-rooted historical ties and Pakistan appreciates the unwavering support extended by Algeria to Pakistan on international forums.\nHe further emphasized the need to increase people-to-people contacts along with parliamentary cooperation through the Pak-Algeria Friendship Group (PFG) and increase interactions among business communities of both brotherly nations as both countries can benefit through mutually beneficial opportunities in the field of agriculture and trade.\nWhile expressing the Pakistan Government’s desire to strengthen relations with Algeria in various fields, Ayaz Sadiq highlighted the need to increase bilateral cooperation in the trade and other socio-economic sectors, especially the energy sector.\nWhile noting Pakistan’s commitment towards its “Look Africa” policy, he said that Algeria is an important country of North Africa and considers Algeria as an important partner of the policy.\nThe Speaker deplored the severe human rights violations in Palestine and Indian Illegally Occupied Jammu & Kashmir (IIOJK) and stressed the international community to play its due role to end the aggression in Palestine and IIOJK.\nHe also urged the international community to play its role for a peaceful resolution of the Kashmir dispute as per the resolutions of the United Nations Security Council and to take immediate measures to stop the Israeli aggression in Palestine.\nAyaz Sadiq expressed good wishes for the Speaker of the National People’s Assembly of Algeria and extended him an invitation to visit Pakistan along with the Algerian Parliamentary Delegation. The formal invitation letter will be sent soon.\nThe ambassador thanked NA Speaker for his kind remarks for Algeria and said that Algeria attaches great importance to its brotherly relations with Pakistan.\nHe said that his government wanted to further solidify the existing bilateral relations through enhanced parliamentary and economic cooperation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:24:20.652Z"
}
