{
  "title": "Pakistan’s ports significantly improved: Qaiser Ahmed Sheikh",
  "link": "https://www.app.com.pk/national/pakistans-ports-significantly-improved-qaiser-ahmed-sheikh/",
  "date_published": "2024-11-18T08:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP):Federal Minister for Maritime Affairs, Qaiser Ahmed Sheikh, has said that Pakistan’s ports have been significantly improved, and many companies have signed Memorandums of Understanding (MoUs) to invest in Pakistan’s industry.\nThe Minister, who participated in the Global Maritime Trade Summit organized by the International Chamber of Shipping, expressed his gratitude for the invitation.\nHe thanked the Chairman of the International Chamber of Shipping, Emmanuel Grimaldi, and the Hong Kong Transport and Shipping Department.\nIn his speech, the Minister stated, “About 90% of global trade depends on the shipping industry. He emphasized that Pakistan’s ports have been significantly improved.”\n“Due to these improvements, Maersk Line, Mediterranean Shipping Company, Hutchison, and Abu Dhabi Ports Company have signed memoranda of understanding and agreements to invest in Pakistan’s maritime sector and shipping industry,” he said.\nSheikh also invited other international shipping companies to invest in Pakistan.\nHe said, “Pakistan’s geographical location is of great strategic importance, as it provides easy access for transporting goods to China, Central Asian countries, and the Middle East.”\nThe minister said, “Our deep ports at Port Qasim and Gwadar have significant handling capacity, but the current transportation is less than half of their potential. This is in contrast to nearby ports like Dubai, Jebel Ali, and Salalah, which are quite busy.”\nQaiser Ahmed Sheikh also highlighted, “The ongoing rapid development at Gwadar Port, with hopes that it will soon be fully operational. Recently, the federal cabinet directed that 50% of trade will be routed through this port.”\n“This port is of immense importance for trade with China, Russia, Hong Kong, and other countries,” he emphasized.\nHe said, “Pakistan is making its maritime sector environmentally friendly in line with the standards set by the International Maritime Organization.”\n“Pakistan is among the countries with less than 1% carbon emissions globally, yet it is one of the top ten countries most affected by climate change. Despite this, Pakistan is striving to transition to carbon-free ships and is actively implementing a decarbonization policy,” Sheikh mentioned.\n“Pakistan has recently signed the Hong Kong Convention and will make every effort to transition the shipping industry to green energy under this agreement to minimize pollution,” he noted.\n“A new maritime policy will be introduced either later this year or at the beginning of next year. Under this policy, foreign investors will be provided with tax incentives and other facilities, Sheikh reiterated.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:25:11.299Z"
}
