{
  "title": "PM satisfies with economic stability, investment boom",
  "link": "https://www.app.com.pk/national/pm-satisfies-with-economic-stability-investment-boom/",
  "date_published": "2024-11-18T11:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday said that country’s economy was on path to stability and due to steps taken in this regard, stock market was showing brisk business.\nHe said that foreign investment was a reflection of confidence in the government’s policies.\nThe prime minister received a briefing from the Ministry of Finance regarding the country’s economy and the meeting with the IMF delegation, PM Office Media Wing said in a press release.\nThe prime minister was briefed on the economic indicators and the current situation of inflation. The meeting was also briefed on the steps taken against tax evasion and those facilitating such theft.\nThe prime minister stressed that public relief should be accorded priority on all other steps and they were taking all possible measures to fulfill public promises.\nHe also expressed satisfaction over the sliding down of the inflation rate to 7 percent from 38 percent and said the interest rate was lowered from 22 percent to 15 percent which would spur business activities and create jobs opportunities in the country.\nThe meeting was attended by ministers including Muhammad Aurangzeb, Ahad Khan Cheema, Attaullah Tarar, Dr Mussadik Malik, Ali Pervaiz Malik, PM’s coordinator Rana Ahsan Afzal and relevant senior officials.\nPrime Minister Sharif further observed that due to surge in exports and record remittances, the country’s foreign reserves had increased.\nHe also praised Punjab chief minister and the provincial government for reforms in the agriculture sector.\nThe prime minister directed for accelerating actions against tax defaulters, and reiterated to bring the tax evaders and their facilitators to book.\n“The country’s economy can progress well when all the stakeholders meet their responsibilities. All sectors should pay taxes to play their role in the national progress,” a press release quoted the prime minister as saying.",
  "retrievedAt": "2025-08-10T15:24:33.977Z"
}
