{
  "title": "SCP Rejects 50% Vote Threshold Petition",
  "link": "https://www.app.com.pk/national/scp-rejects-50-vote-threshold-petition/",
  "date_published": "2024-11-18T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 18 (APP):The Supreme Court of Pakistan has rejected a constitutional petition seeking to declare elections null and void if a candidate scores less than 50% of the total votes for any house of parliament. The petition was heard by the Constitutional Bench headed by Justice Amin Ud Din Khan, and was ultimately dismissed with a fine of Rs.20,000 on the petitioner.\nOther members of the bench included Justice Jamal Khan Mandokhail, Justice Muhammad Ali Mazhar, Justice Ayesha A Malik, Justice Syed Hasan Azhar Rizvi, Justice Musarrat Hilali and Justice Naeem Akhtar Afghan.\nThe court questioned the petitioner, Mr. Muhammad Akram, on the constitutional basis for such a declaration, pointing out that the current system declares a candidate victorious based on the maximum number of votes received, regardless of whether they reach 50% or not.\nJustice Muhammad Ali Mazhar asked under which article of the Constitution the Supreme Court could declare a candidate unsuccessful for receiving less than 50% of the total vote. Justice Ayesha Malik also inquired about which articles of the Constitution would be violated if a candidate with the maximum votes, but less than 50%, was declared successful.\nThe Court emphasized that the current system is lawful, and if the petitioner desires a change in the law, he should approach the parliament for new legislation. Justice Musarrat Hilali noted that every citizen has the right to vote, but the Supreme Court cannot compel eligible voters to participate in polling.\nIn a surprising turn, the petitioner admitted not casting his vote in the previous general elections when questioned by Justice Jamal Mandokhail.\nThe court imposed a fine of Rs20,000 on the petitioner for wasting the court’s time with unnecessary litigation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T15:24:43.766Z"
}
