{
  "title": "NCRC concerned over sugar beverages for children",
  "link": "https://www.app.com.pk/national/ncrc-concerned-over-sugar-beverages-for-children/",
  "date_published": "2021-04-14T11:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP): National Commission on the Rights of Child (NCRC ) has organized the meeting with parliamentarians on health harms of Sugar Sweetened Beverages (SSBs) among adolescents and children in the country.\nAccording to a press release issued here on Wednesday, the advocacy meeting was attended by the Honourable Maj Gen (Rtd) Masud ur Rehman Kiani, President of Pakistan National Heart Association (PANAH), Chairperson NCA Afshan Tehseen, National Commission on the Rights of Child, Ch. Sanaullah Ghumman, General Secretary PANAH, Munawar Hussain, Consultant Food Policy Program, Dr. Nousheen Hamid, Parliamentary Secretary Health, Ministry of NHSR, Uzma Riaz, Member of National Assembly and Secretary General Young Parliamentarians Forum, Munawwara Baloch, MNA and Naveed Cheema, MNA and Munawar Hussain, Food Policy Program GHAI.\nSugar sweetened beverages (SSB) – which include drinks with added sugar such as soda, fruit drinks and energy drinks – are frequently consumed by children and adolescents in Pakistan.\nAn increase in the consumption of Sugar sweetened beverages (SSB) among children and adolescents is impacting the health resulting in obesity and dental caries.\nChairperson National Commission on the Rights of Child, Afshan Tehseen calls upon all stakeholders particularly legislators to support inclusion of health levy as a part of the finance bill 2021-22 and raise voice in the parliament to prevent any further delay in the amendment of bill on an extremely important issue destroying the health and future of our children.\nThe excessive consumption of added sugars, especially from sugary drinks is contributing to the high prevalence of childhood and adolescent obesity, who are highly vulnerable.\nUzma Riaz, Member National Assembly shared her views on the dangers of SSBs among adolescents and children.\nShe also expressed her gratitude over the findings of the PANAH survey that the majority of Pakistanis understand the negative impact of sugar sweetened beverages on health.\nShe further stressed on having a healthy and balanced diet while highlighting the use of natural nutritious food including milk and fruits.\nParliamentary Secretary for Health and Member National Assembly, Dr. Noshin Hamid said that Improving public health is among the top priorities of the current Government. I assure you that our Ministry is working with the National Assembly on the Health Levy Bill.\nMunawwar Hussain presented the facts collected by PANAH wherein he stated that 17 per cent of youth in Pakistan consumes SSBs on daily basis.\nIt was also suggested by PANAH that passing the Health Levy Bill and Federal Excise Duty on SSBs could have the desired impact of discouraging the demand of SSBs.\nNisar Cheema, Member National Assembly stressed upon the fact that the nation should get back to the natural ways of life on this occasion.",
  "retrievedAt": "2025-08-11T20:37:37.060Z"
}
