{
  "title": "Palitha applauds government’s decision to National Quit Day on first of Ramazan",
  "link": "https://www.app.com.pk/national/palitha-applauds-governments-decision-to-national-quit-day-on-first-of-ramazan/",
  "date_published": "2021-04-14T15:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP):World Health Organization (WHO) Representative in Pakistan, Dr Palitha Mahipala Wednesday expressed deepest appreciation and gratitude on the eve of the government’s decision to commemorate the first of Ramazan as the National Quit Day.\nIn a statement , Dr Palitha congratulated Dr. Faisal Sultan, Special Assistant to Prime Minister on National Health Services, for declaring the first of Ramazan as the National Quit Day. He said it is high time for people of this great nation to encourage smokers in their homes, workplaces and communities to quit smoking. “The holy month Ramazan is a real opportunity quit,” he remarked.\nDr Palitha said tobacco is deadly in any form. Smoked tobacco products, including water pipes, contain over 7000 chemicals, including at least 250 chemicals known to be toxic or cause cancer. Tobacco use harms nearly every organ of the body, he added.\nHe said that globally, tobacco kills eight million people every year. Over 1 million deaths attributed to tobacco are due to second-hand smoke exposure and someone is dying of tobacco-related diseases every four seconds.\nDr Palitha said tobacco is the most common risk of non-communicable diseases which is causing around 58 % mortality in Pakistan. He said, Pakistan has taken a number of steps like the ban on the sale of loose cigarettes, ban on point of sale, large-sized pictorial health warning and raised tobacco taxation and now the National Quit Day.\nThis, he said, is a sheer display of government commitment to reduce tobacco use by 30% by 2025. “I am very happy that if the current momentum continues, Pakistan is the only country in our region that would achieve the target of reducing tobacco use by 30 % by 2025.\n“However, we cannot be complacent, we need to do more and continue our joint endeavours to counter tobacco industry tactics to promote tobacco and tobacco novel products,” Mahipala commented.\nDr Palitha warned that smokers are more vulnerable to Covid-19, therefore they should really commit to quit in line with the theme of the upcoming World No Tobacco Day that is being commemorated all over the world under the theme “Commit to Quit” on May 31st.",
  "retrievedAt": "2025-08-11T20:37:32.797Z"
}
