{
  "title": "Panahgahs offer ‘festive’ Iftar to daily wagers",
  "link": "https://www.app.com.pk/national/panahgahs-offer-festive-iftar-to-daily-wagers/",
  "date_published": "2021-04-14T15:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP):Over 100 Panahgahs, across the country, wore a festive look on the first day of holy month of Ramazan as hundreds of thousands fasting labourers and daily wage earners broke their fast irst Roza in an environment of compassion and sharing.\nThe festive spirit was witnessed at half a dozen Panahgahs (Shelter Homes) in the twin cities of Rawalpindi and Islamabad, where poor workers, homeless and migrant labourers enjoyed nutritious food during Sehar and Iftar.\nIn a modest serving, fresh fruits, snacks, fritters and beverages are a regular feature of Iftar at all the Panahgahs.\nIftar and Sehar are being served with great enthusiasm, yet strict adherence to the anti-coronavirus standard operating procedures (SOPs) to ward off the looming threat of its outbreak at such crowded places.\nThe anti-COVID-19 SOPs such as mask-wearing, hand-washing and physical distancing are strictly being followed at all the Panahgahs.\n“We are delighted by the cooperation of the Panahgah’s dwellers, who are helpful in the implementation of the best practices,” said Prime Minister’s Focal Person Naseem ur Rehamn, who broke his fast among the G-9 Panahgah’s residents.\nSharing the feelings of almost every dweller at the Panahgah, Ahsan Hameed form Upper Dir told APP that they wholeheartedly welcomed the government’s leadership role in making proper arrangements for Sehar and Iftar at such places.\n“Before the start of Panahgahs, we were always anxious for not knowing that where from the Iftar will come, but now were have a great feeling to know that someone is preparing Sehar and Iftar for us and we know where to get it from,” he remarked.\nPrime Minister Imran Khan’s poor-friendly initiatives are literally paying dividends as thousands of poor people are not only getting food from Panahgahs, but also from the mobile kitchens distributing nutritious food boxes at special routes of major cities.\nThe PM’s focal person told APP that the mobile kitchens, launched as a pilot project under the prime minister’s ‘Koi Bhuka Na Soye’ programme, were serving meals to the poor in major cities like Faisalabad, Islamabad, Lahore, Peshawar, and Rawalpindi.\nPlans were underway to replicate the programme across the country to reach a larger number of poor people with nutritious food, he added.\n“The government feels that it is its obligation and responsibility to rise up the challenge and relive hunger particularly in the holy month of Ramazan.\nIt inspires us to strive harder and also build partnership between public and private organizations to ensure that the programme is reaching to every nook and cranny of the country,” the focal person maintained.\nHe also appreciated the Silani Welfare Trust, which was the principal partner in the initiative to feed the fasting with dignity in harmony with the prime minister’s vision.",
  "retrievedAt": "2025-08-11T20:37:34.298Z"
}
