{
  "title": "Society cannot survive without rule of law: PM",
  "link": "https://www.app.com.pk/national/society-cannot-survive-without-rule-of-law-pm/",
  "date_published": "2021-04-14T12:11:00.000Z",
  "source": "APP",
  "content": "SARGODHA April 13 (APP): Prime Minister Imran Khan Wednesday said that a society could not survive without rule of law and when the powerful and corrupt elite was held accountable for its misdeeds.\nIn a media talk here after laying foundation stone of low-cost housing units under Naya Pakistan Housing Programme, the prime minister linked prosperity and progress of a country and nation to rule of law and application of law to all.\nResponding to a question regarding release of Mian Shahbaz Sharif on bail, the prime minister said the corrupt rulers had siphoned off billions of rupees from the national exchequer. There were irrefutable evidences about their corruption.\nUnless a society decided to hold the corrupt accountable, no change could take place, the prime minister said, posing a question ‘Tell me a nation in the world where there is rule of law and it is still reeling back in poverty!”\nHe said today, the issues of poverty and price hike in the country were the symptoms of their corruption.\nTo another question, he said sugar price had been increased by Rs26 in one year and the mill owners extracted Rs 126 to Rs140 billion from pockets of people. “The government’s job is to protect its people”, he added.\nThe government conducted inquiry through FIA which submitted a startling report showing how these mills and powerful people had minted money by increasing price and tax evasion etc, he added.\nThe prime minister reiterated that there could be no two different sets of laws for the powerful and the poor as the destruction in a society had always been caused by the powerful elite.\nAbout the affordable housing project, the prime minister said it was being made possible because in the past, no one in Pakistan ever thought of the poor people.\nThe government could provide subsidy on housing with the cooperation of banks, he said, adding that in the past, banks were reluctant to extend loaning facilities due to foreclosure laws.\nThe government was providing Rs300,000 subsidy on each housing unit besides, it had brought down the interests rates with the cooperation of banks, enabling the aspirants to pay minimum monthly installment, he observed.",
  "retrievedAt": "2025-08-11T20:37:36.362Z"
}
