{
  "title": "India involved in systematic economic strangulation of Kashmiris: Shehryar Afridi",
  "link": "https://www.app.com.pk/national/india-involved-in-systematic-economic-strangulation-of-kashmiris-shehryar-afridi/",
  "date_published": "2021-04-14T10:55:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 14 (APP): Chairman Parliamentary Committee on Kashmir Shehryar Khan Afridi on Wednesday accused the Indian occupational regime for implementing a vicious plan of systematic economic strangulation of Kashmiris in Indian Illegally Occupied Jammu and Kashmir (IIOJ&K).\nAddressing launching ceremony of a book titled ‘Kashmir: Demographic Shift, Historical Developments and Hindutva’ at Kashmir Council, he said the book reflected the fact that the academia of Pakistan was alive to the developments taking place in and around Kashmir region and as to how the Hindutva rule was involved in genocide of Kashmiris.\nThe book, authored by Dr Kashif Zaheer, Dr Rashid Aftab and others, covers the Indian war crimes being committed in IIOJ&K with a specific reference to demographic changes, historical developments taking place in Kashmir and invasion of Kashmir by Hindutva rule.\nHe said after sidelining the Kashmiris and putting the political leadership of Kashmiris behind bars, the Hindutva regime was involved in systematic economic strangulation of Kashmiris.\nHe said India was committing genocide of Kashmiris and information terrorism, demographic terrorism and cultural terrorism were being employed as major tool of genocide in IIOJ&K.\nHe urged the youth to become ambassadors of Kashmiris and share the atrocities being committed against the Kashmiris by the Illegally Occupied regime of India.\nThe chairman underlined the need for extensive projection of the living conditions of half widows in IIOJK and massive use of pallet guns, which were barred to be used on animals, against Kashmiris.\nHe said mysterious silence of the world was a big question mark for the humanity and the prosperous world should not compromise humanity for commercial and market interest.\nShehryar Khan Afridi said India was misusing draconian and black laws of UAPA and youth were being picked, jailed and killed without any trial.\nHe said Prime Minister Imran Khan had proved his worth by effectively raising Kashmir dispute at all the available international forums.\nHe said Hindutva regime was making all out efforts to strip the Kashmiris of their identity, while cultural heritage of Kashmir was being destroyed by introducing a new hybrid culture of Hinduism in Illegally Occupied Jammu and Kashmir.\nHe exhorted the writers, artists, vocalists, actors and bloggers to create content and other material to promote and project Kashmiri culture and identity.\nHe said Pakistan, under the leadership of Prime Minister Imran Khan, would continue fighting the cause of Kashmir at all fora and no dialogue can be held at the cost of Kashmir cause.\nHe said entire political, military and bureaucratic leadership of the country were unanimous that no compromise could be made at the cost of Kashmir.\nHe said it was Prime Minister Imran Khan who decorated senior Kashmiri Hurriyat leader Syed Ali Geelani with Nishan-e-Pakistan and no one could imagine to question the integrity of Syed Ali Geelani.",
  "retrievedAt": "2025-08-11T20:37:38.317Z"
}
