{
  "title": "PM constitutes CCLC over legislative matters",
  "link": "https://www.app.com.pk/national/pm-constitutes-cclc-over-legislative-matters/",
  "date_published": "2020-09-26T13:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 26 (APP): Prime Minister Imran Khan has constituted a Cabinet Committee for the disposal of Legislative Cases (CCLC).\nThe committee would comprise, Minister for Law and Justice (chairman) Farogh Naseem, Minister for Human Rights Dr Shireen M. Mazari, Minister for Narcotics Control Muhammad Azam Swati, Minister for Science and Technology Chaudhry Fawad Hussain, federal minister concerned (by special invitation), PM’s Advisor on Parliamentary Affaris Dr Zaheer ud Din Babar Awan, PM’s Advisor on Accountability and Interior Mirza Shahzad Akbar, Attorney General for Pakistan, secretary law and justice division, joint secretary PM’s office and cabinet secretary (members), a notification of the Cabinet Division, on Saturday said.\nThe cabinet in its meeting held on September 8, in case No: 611/35/2020 dated 8-9-2020 approved the proposal regarding enhancing the mandate of Cabinet committee for disposal of legislative cases. The committee would work under the following Terms of References (ToRs):- The committee would examine whether a fresh legislation or amendments in the existing laws were in line with the constitutional scheme, not in violation of any existing law, and falls within the mandate of parliament.\nIt would have the mandate to examine the contents of fresh legislation/rules as well as amendments to the existing laws/rules and give its recommendations as to whether the same were in line with the policy of the government and constitutional/legislative scheme.\nIn case of CCLC decided to amend the proposal of the sponsoring division, from a policy perspective, and the same was agreed to by the sponsoring division in the CCLC meeting, the amended proposal would be placed before the cabinet for ratification.\nIn case of disagreement between the sponsoring division and CCLC on policy matter, the points of view of both would be placed before the cabinet for a decision. The secretarial support to the committee would be provided by the cabinet division.",
  "retrievedAt": "2025-08-11T19:50:29.788Z"
}
