{
  "title": "LOC violations by India pose serious consequences, AJK Prime Minister.",
  "link": "https://www.app.com.pk/national/loc-violations-by-india-pose-serious-consequences-ajk-prime-minister/",
  "date_published": "2020-09-26T03:17:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Sep 26 (APP):Prime Minister AJK Raja Muhammad Farooq Haider Khan has said that Indian firing on civil population across Line of control (LOC) had put the peace of entire region on stake and if the same situation prevailed, it might trigger serious consequences. Addressing a big public meeting at Jora near LOC in Neelum Valley on Saturday, he said over 2500 persons had embraced martyrdom and thousand were injured due to Indian firing on the line of control.\nHe said public was determined to support the people of occupied Jammu and Kashmir to achieve their fundamental right to self determination and added that if India imposes war, Pakistan’s Armed Forces as well as civilian population of AJK will give a befitting response to the aggressor. He said despite imposing war of terror and use of brute military force India has failed to crush the indigenous freedom struggle launched by the people of occupied Kashmir to secure their agreed right to self determination.\nHe said all the resources are meant for the well-being of the people and the government will continue to serve the people with dedication and devotion. He paid rich tributes to the people of Neelum Valley for facing Indian firing with determination and in this context government has earmarked more funds as compared to the other districts to remove the ignorance and sense of deprivation from this area. The Prime Minister on this occasion announced to create Jora subdivision in Neelum Valley district.\nSpeaking on the occasion, speaker AJK assembly Shah Ghulam Qadir thanked the Prime Minister for extending generous financial assistance for the development of Neelum Valley and added that it was due to personal interest shown by the Prime Minister that new projects costing over Billions of rupees were completed in the area.\nHe said the Prime Minister had restored merit and the state government was empowered and made self-sufficient in financial matters. The Minister for Forest Sardar Mir Akbar Khan also addressed the gathering. The Prime Minister also inspected the pace of progress on Jagran power project Phase 11.",
  "retrievedAt": "2025-08-11T19:50:32.179Z"
}
