{
  "title": "AIOU inks MoU with Islamic Azad University Iran",
  "link": "https://www.app.com.pk/national/aiou-inks-mou-with-islamic-azad-university-iran/",
  "date_published": "2023-03-10T13:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 10 (APP): Ambassador of Islamic Republic of Iran to Pakistan Seyed Mohammad Ali Hosseini on Friday said that Pakistan and Iran are enjoying strong brotherly relations for long and all government in Pakistan, irrespective of its political affiliation and ideology has worked for the improvement of relations between the two brother Islamic countries.\nAddressing the signing ceremony of Memorandum of Understanding (MoU) between Allama Iqbal Open University (AIOU) and Islamic Azad University Iran, the ambassador said that both universities have very strong capabilities and infrastructure that can promote educational cooperation in a good way.\nSpeaking ot the occasion the Vice Chancellor, AIOU, Prof. Dr. Nasir Mehmood said that both countries are not only geographically connected but we also have deep rooted cultural, civilizational and religious ties since long and AIOU will play an active role to strengthen these relationships between the countries through education.\nDr. Nasir said that there are vast learning opportunities for the faculty members of AIOU in Islamic Azad University.Vice Chancellor for International Affairs and Foreign Students, Islamic Azad University, Dr. Jalal Dorakhshah said that that there are relations between the people and governments of the two countries and now these relations will continue at the university level as well.\nAt the outset, Dr. Zahid Majeed, Director, International Collaboration and Exchange Program gave a detailed briefing on the profile of AIOU and said that our relationship with Iran’s universities is as strong as PAK-IRAN friendship.\nHe said that we are already collaborating with Iran’s Payame Noor University, University of Tehran and the University of Religions and Denominations.\nAccording to MoU, art, culture, language, and literature of both countries will be promoted through number of activities including seminars, conferences, exchange of publications and academic research work, exchange of faculty members, and joint workshops.\nRegistrar, AIOU, Raja Umar Younis from AIOU and Vice-Chancellor for International Affairs and Foreign Students, Dr. Jalal Dorakhshah from Islamic Azad University signed the MoU.",
  "retrievedAt": "2025-08-11T06:20:08.928Z"
}
