{
  "title": "PMLN fully prepared for polls but level playing field imperative to ensure credibility of elections: Maryam Nawaz",
  "link": "https://www.app.com.pk/national/pmln-fully-prepared-for-polls-but-level-playing-field-imperative-to-ensure-credibility-of-elections-maryam-nawaz/",
  "date_published": "2023-03-10T16:19:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Mar 10 (APP): Pakistan Muslim League-Nawaz (PML-N) Senior Vice President and Chief Organiser Maryam Nawaz on Friday said the PMLN was fully prepared to go to the polls but level playing field was imperative for all political players to ensure the credibility of elections.\nAddressing a workers’ convention in al-Fateh Sports Complex here, she said that election was just knocking at the doors but workers should not afraid of it. They should be ready to face it as a brave political workers.\nIf elections were conducted without impartial accountability, no one would accept its results, she added.\nShe said that Nawaz Sharif and development of Pakistan were interlinked with each other. In 2013, Pakistan was facing acute shortage of electricity but Nawaz Sharif strived hard and provided electricity to not only the houses but also to the factories.\nShe said that everything was sailing smoothly but a deep rooted conspiracy was hatched and Nawaz Sharif was removed from the political scene.\nShe said that the perpetrators of conspiracy were now themselves confessing to their guilt and one after another was exposing the elements who were involved in this conspiracy.\nShe also quoted a common joke that when three thieves were caught red handed, each was naming others who also acted as facilitator.\nShe further said that the establishment had also realized the impact of this conspiracy and had disassociated itself from the conspirators.\nShe further said that the facilitators of Imran Khan were now skipping from the country one after another.She appreciated the political vision of people of Faisalabad and termed it as a “cash cow of the country”.\nShe said that in Nawaz Sharif era the political meetings of Faisalabad were considered as the trend setter and decision maker in the political affairs of the country.\nMaryam Nawaz said that this workers’ convention would also play a decisive role in the national politics.She said that in 2013 when Nawaz Sharif came into power, the country was in acute shortage of electricity but he worked hard and the nation witnessed zero load-shedding in this mega industrial city.\nIt also gave a quick start to the industrial production but this process of growth was derailed through a conspiracy hatched by Imran Khan, she added.\nThe PML-N Senior Vice President said that nation also witnessed that development of Pakistan and Nawaz Sharif were interlinked but he was disqualified on a frivolous allegation of not receiving salary from his son.\nShe said that it was for the first time in the history of Pakistan that Prime Minister Shehbaz Sharif had announced to provide free wheat flour to the people during the holy month of Ramazan.\nShe said that such people-friendly decision could be taken by the patriotic politician and not by watch-thief.She said that Hamza Shehbaz announced to provide free electricity to the people.\nIt was Imran Khan who went to the court and on his plea this facility was withdrawn, she added.She asked the people to recognize their enemy who himself was neither working for the welfare, nor allowed others to do so.\nShe said that Imran was a true “Fitna” and she was rightly dubbing him exploiter for his anti-democracy and anti-people stance.\nThe Chief Organiser said that developing Pakistan faced a deep decline when Nawaz Sharif was deseated.\nShe said that development process was totally wrapped up with this decision as it was not anti Nawaz Sharif decision but it was anti poor and anti Pakistan step which deprived the country from speedy progress and prosperity.\nShe said that Imran Khan was responsible of the current economic scenario as he was the person who inked agreement with the IMF.\nShe said that the conspirators of this drama had committed a crime and nation would never forgive their generations.\nShe said that Imran Khan was clamped on the nation whose vision was just only eggs, hens, cars and calves.She said that a jackal could not be a leader. She termed Imran as coward and said that he had deputed women for his protection.\nShe said that Nawaz Sharif was a true leader. He proudly faced the prison along with his daughter but he never used his workers as a shield.\nShe said that Imran used his plastered leg as a tool to avoid from appearing in court but he was never hesitating in attending the public meeting. She termed him as a hypocrite and said that 7:20, he declared that he was not afraid of death but after just one minute he took refuge under a bed to avoid arrest.\nShe said that it was Nawaz Sharif who faced the international pressure at the time of atomic explosions. If there was a leader like Imran Khan, Pakistan may not be an atomic power, she added.\nShe expressed condolence over the death of PTI worker and said that it was very strange that Imran Khan invited his father to visit his palace so that he could condole with him.\nShe said that he was treating the worker as his personal slaves. His sons were enjoying luxurious life in London but he was directing the workers to come on the roads only to protect him.\nShe said that PTI workers should rethink their attitude that why they should be used to conceal the theft of Imran Khan.\nMaryam Nawaz said that Nawaz Sharif had entrusted his case to the court of Allah Almighty and now one after another conspirators were themselves confessing about their role in the conspiracy.\nShe said that Imran Khan was the first prime minister who was involved in stealing wrist watch.\nShe asked from the workers that if a person was not ready to spare the wrist watch, how he could behave in other such matters.\nShe said that he was dubbing others thieves but now his theft had been exposed publically. He was not only himself involved in theft but his wife was also involved in malpractices who was demanding a ring of 5 karat diamond for signing of any file.\nShe said that Imran Khan had concealed foreign funding and his daughter whereas Nawaz Sharif had experience of 14-month prison on frivolous allegations.\nShe assured the workers that “In Sha Allah”, Nawaz Sharif would come and the days of progress and prosperity would also return back to the country.\nFederal Minister for Information & Broadcasting Marriyum Aurangzeb, Federal Interior Minister Rana Sana Ullah Khan, PMLN central leaders Talal Chaudhry, Abid Sher Ali, Uzma Bukhari, Hajji Akram Ansari, MNA Shehbaz Babar, MNA Rajab Ali Baloch and others were also present in convention.",
  "retrievedAt": "2025-08-11T06:19:58.167Z"
}
