{
  "title": "ADC-G visits cattle markets, AC shuts down 15 illegal sale points, holds 20 traders",
  "author": null,
  "content": "ISLAMABAD, Jun 4 (APP):Additional Deputy Commissioner General (ADC-G) Sahibzada Yousaf made a surprise late-night visit to several approved cattle markets across the Federal Capital to review arrangements while the Islamabad Capital Territory (ICT) administration operation to close illegal cattle markets ahead of Eid has continued.\nIn an operation against illegal cattle markets, Assistant Commissioner City led a crackdown and shut down 15 unauthorized cattle sale points. During the operation, 20 traders were arrested for violating rules, said the spokesman\nAccording to officials, the crackdown is part of efforts to ensure cattle trading remains confined to approved areas and to avoid traffic issues, public inconvenience, and sanitation problems caused by illegal markets popping up across the city.\nMeanwhile, in a separate development, Additional Deputy Commissioner General (ADC-G) Sahibzada Yousaf made a surprise late-night visit to several approved cattle markets across the city to review arrangements. He was accompanied by Assistant Commissioner Rural Fahad Cheema and SDPO Shehzad Town Inzamam Khan.\nThe inspection covered various major cattle markets, including the ones near Zia Masjid and Sultana Foundation. Officials checked facilities for both buyers and sellers and spoke directly to them during the visit.\nADC-G Yousaf expressed satisfaction over the overall arrangements in these markets. He stated that measures have been taken to facilitate traders who bring livestock to the city, as well as people arriving to buy animals for sacrifice.\nTalking to media persons, ADC-G said that clean drinking water, proper lighting, and cleanliness were ensured in the markets. Parking areas have also been organized to avoid congestion and maintain the smooth flow of traffic on nearby roads.\n“The traffic situation near markets is under control. Teams are working round the clock to manage crowds and ensure smooth movement,” said ADC-G Yousaf.\nHe further stated that magistrates are present at the cattle markets at all times to handle any complaints on the spot. These officials are assigned to provide assistance and resolve issues related to pricing, overcharging, hygiene, or any form of mismanagement.\nBuyers and traders present during the visit appreciated the arrangements made by the district administration. Many traders said that this year’s setup is helping them conduct their business with fewer difficulties.\nOne cattle trader, while speaking to the ADC-G during the inspection, said that timely setup of water points and lights had made things easier for those bringing livestock from far-flung areas.\nAnother buyer said that unlike previous years, parking was easier and the market environment more organized.\nOfficials from the administration said their goal is to ensure smooth trading activity in legal cattle markets during the Eid season and discourage makeshift and unauthorized sale points that often lead to chaos and mismanagement.\nThe administration is also asking citizens to report any illegal markets or overcharging by traders. “We are monitoring the situation across the city and taking prompt action on public complaints,” an official from the district control room said.\nTo ease the burden on city roads, traffic police have been directed to deploy personnel around cattle markets during peak hours. Coordination is also being maintained with health and sanitation departments to prevent any health issues in the markets due to animal waste.\nDistrict administration have confirmed that they will continue operations against illegal markets throughout the Eid season and will keep monitoring approved markets daily. Any lapses in arrangements or issues raised by the public will be addressed immediately.\nIn addition to facility checks, senior officials are also holding regular meetings with market organizers to keep track of daily progress. Waste management teams are working in shifts, and water tankers have been stationed near each market to maintain hygiene.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T10:47:54.501Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/adc-g-visits-cattle-markets-ac-shuts-down-15-illegal-sale-points-holds-20-traders/",
  "dateList": "2025-06-04",
  "date_published": "2025-06-04T09:10:00.000Z"
}
