{
  "title": "PAC main aim to ensure ‘accountability across the board’: Chairman",
  "link": "https://www.app.com.pk/national/pac-main-aim-to-ensure-accountability-across-the-board-chairman/",
  "date_published": "2022-10-04T15:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP): Chairman Public Accounts Committee (PAC) Noor Alam Khan on Tuesday said the aim of the committee was to ensure accountability across the board which also authorizes it to review the cabinet’s wrong decisions if any.\nHe was chairing a meeting of Public Accounts Committee, here, in the Parliament House to review audit report pertaining to M/o Industries & Production.\nThe committee took notice of fake degree holder employees and directed the Secretary Ministry of Industries & Production to lodge FIRs against them and initiate a drive to make recoveries from them as well.\nAction may also be taken against the officers who appointed them and did not verify their educational degrees before and after their appointments and asked the Secretary to submit a Report to PAC within 7 days.\nThe committee directed the Auditor General of Pakistan to conduct performance audit of all the public sector companies within one month.\nOn a question raised in the meeting, the committee issued directions to NAB to use polite and civilized words while seeking help of other departments in the proceedings and relevant inquiries.\nMeanwhile, the committee also directed that one of the representative of audit department (AGP) to be also included in the inquiries been conducted by FIA & NAB.\nDiscussing the distribution of food items at Utility Stores, the Chairman said that subsidized items were the right of only poor and under privileged segment of society and its distribution should be quite transparent through computerized mechanism.\nThe committee was astonished when it was revealed to them that subsidized flour bags were issued in the name of the Chairman PAC, in Peshawar, which, according to the committee reflects that the distributing mechanism of Utility Store Corporation (USC) was flawed and directed the Secretary to probe the matter as to why subsidized atta/flour bags were fraudulently issued in the name of Chairman PAC.\nThe committee directed the Managing Director, Utility Store Corporation to visit utility stores especially in the far flung areas of Sindh and Baluchistan, like Rojanmazari, Dera Ghazi Khan, etc to see whether the utility stores were fulfilling the needs of people, besides, to check whether only the approved food items were being sold out over there or not.\nThe committee expressed displeasure over non presence of Presidents and CEOs of auto mobile companies.\nThe chairman directed the Secretary Ministry of Industries & Production to make sure presence of Heads of automobile companies in next meeting of the committee.\nThe Chairman FBR, Member Custom and Inland Revenue (FBR), Secretary Ministry of Commerce, Governor State Bank of Pakistan and Chairman SECP were also directed to attend the next meeting.\nSince the prices of vehicles/cars are going beyond the control of Ministry of Industries & Production, the committee requested the Prime Minster of Pakistan Shehbaz Sharif to open the import of vehicles/cars to overcome the monopoly of automobile companies in the country.",
  "retrievedAt": "2025-08-11T15:40:31.764Z"
}
