{
  "title": "Vibrant Parliamentary diplomacy can harness challenges of global climate change:  NA Speaker",
  "link": "https://www.app.com.pk/national/vibrant-parliamentary-diplomacy-can-harness-challenges-of-global-climate-change-na-speaker/",
  "date_published": "2022-10-04T10:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 4 (APP):Speaker National Assembly Raja Pervaiz Ashraf on Tuesday said that vibrant parliamentary diplomacy can harness the challenges of global climate change.\nPakistan-Australia Parliamentary Friendship Group established in the National Assembly of Pakistan played a pivotal role in promoting parliamentary diplomacy and enhancing parliamentary relations through parliamentary exchanges, the NA speaker said this during a meeting with Australian High Commissioner to Pakistan Neil Hawkins who called on him, said a news release.\nDuring the meeting, both sides also discussed means to enhance bilateral relations and devised a joint action plan for the prevailing climate crisis in Pakistan.\nWhile expressing satisfaction over the cordial relations between Pakistan and Australia, the speaker remarked that both countries need to deepen the existing relations by increasing parliamentary interactions and economic cooperation that could benefit both countries in the fields of mutual interest.\nHe expressed his desire to develop contact between business communities of both countries to tap the massive economic potential in Pakistan.\nSpeaker while talking about the unprecedented calamity caused by recent deadly floods in Pakistan said that National Assembly would move an emergency resolution in the 145th Inter-Parliamentary Union (IPU) meeting in Rwanda on Oct. 11-15.\nHe said the resolution aimed to present a forceful demand before developed countries to compensate for irreversible losses due to climate change in developing countries like Pakistan. He appreciated the Australian government’s immense support for the relief and rehabilitation efforts for the flood affectees in Pakistan.\nAustralian High Commissioner said that Australia considered Pakistan one of its trusted friends and an important economic partner.He said that Australian investors were keen to invest in Pakistan’s markets for the benefit of the people on both sides.\nHe assured to extend his country’s leadership support to National Assembly’s call for the global fund through IPU to address the ongoing climate crisis in Pakistan.",
  "retrievedAt": "2025-08-11T15:40:40.583Z"
}
