{
  "title": "President seeks support of ministers, MPs & media in breast cancer awareness campaign",
  "link": "https://www.app.com.pk/national/president-seeks-support-of-ministers-mps-media-in-breast-cancer-awareness-campaign/",
  "date_published": "2022-10-04T06:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 4 (APP): President Dr Arif Alvi, through letters addressed to the the Prime Minister, ministers, parliamentarians, governors and the media, has solicited their support to raise awareness about breast cancer and the importance of self-examination and early diagnosis.\nThe president invited the key office-holders to become active and willing partners in this year’s breast cancer awareness campaign wherein women of underprivileged classes and women of flood-hit areas would be especially focused in the wake of recent devastating floods where women were worst hit.\nThe president expressed his concern that out of 100,000 new cases of breast cancer reported every year in Pakistan, half of them succumbed to death due to late diagnosis. He added that 98 percent of these precious lives could be saved by creating awareness amongst women for self-examination and early diagnosis.\nPresident Alvi highlighted that the Breast Cancer Awareness Campaign of the last four years, led by First Lady Begum Samina Arif Alvi, had resulted in a significant increase in the early reporting of breast cancer cases in the hospitals.\nIn his letters addressed to the eminent media persons, he thanked them for their continuous support during the last four years and said that without their valued support and passionate partnership the success of the campaigns could have not been possible.\nHe called upon the media persons to play their active role this year as well to create awareness among the target women on the paramount importance of self-examination and early diagnosis through their media products, such as news bulletins, special reports, dramas, morning shows, articles, columns and editorials.\nThe president enlisted a number of activities which have been planned this year to educate women and highlight the importance of self-diagnosis and early detection.\nHe added that this year’s awareness campaign would also underline the importance of meeting the nutritional needs of women of underprivileged classes and flood-hit areas.\nThe president underlined the importance of media to promote these events and called upon it to launch a comprehensive and well-thought-out awareness campaign to educate and motivate women for self-examination and to voluntarily seek early diagnosis of breast cancer, besides educating them about the importance of a healthy diet to minimize health-related issues, including breast cancer.\nOctober is Breast Cancer Awareness Month, and an annual campaign is launched to raise awareness about the impact of breast cancer and raise voices together to help spread the word about the importance of breast cancer screening and support.",
  "retrievedAt": "2025-08-11T15:40:44.279Z"
}
