{
  "title": "Sindh govt’s plea to once again postpone LG polls rejected by ECP",
  "link": "https://www.app.com.pk/national/sindh-govts-plea-to-once-again-postpone-lg-polls-rejected-by-ecp/",
  "date_published": "2022-10-04T18:53:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 04 (APP): The Election Commission of Pakistan (ECP) on Tuesday rejected Sindh government’s request to postpone second phase of local government polls and directed provincial authorities to ensure the deployment of police force for smooth conduct of elections in Karachi division.\nThe provincial government’s request was reviewed in an ECP meeting held here to review preparations regarding holding of LG polls in Karachi and forthcoming by-elections on National and Provincial Assembly seats.\nThe Commission was briefed regarding the local body elections in Sindh, which are scheduled to be held on October 23.\nThe ECP said that maintaining law and order during the elections was the responsibility of the provincial government and the law enforcement agencies.\nIn the letter to the ECP, the Sindh government highlighted the shortage of force due to rescue and relief work in the flood-hit districts of the province.\nChief Election Commissioner (CEC) Sikandar Sultan Raja directed the concerned to contact the federal interior and defence ministry to ensure the deployment of rangers and army personnel in sensitive constituencies of Karachi.\nThe meeting was informed that the Election Commission has written to the Federal Government for an amount of Rs 600 million to hold by-polls, but these funds have not been received yet.\nThe Election Commission expressed its concern and feared that if funds were not provided to the Commission on time, it will not be possible to hold the election.\nIn addition, only 25 percent of the money required for holding local body elections has been provided to the Election Commission, while the remaining amount has not been provided yet.  Due to which the Election Commission was also facing difficulties in conducting local body elections.\nThe meeting was told that the arrangements for holding by elections in nine constituencies of the National Assembly and three constituencies of the Provincial Assembly of Punjab on Oct 16 has been completed.\nIt may be mentioned that the second phase of the local body polls was originally scheduled to take place in July, and then on August 28 but unprecedented rains and floods — that killed hundreds — hampered the commission’s plans to hold the election.",
  "retrievedAt": "2025-08-11T15:40:27.373Z"
}
