{
  "article_id": "2025-02-12_24ada72640295765b5d611d940884546",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/china-pakistan-sports-carnival-held-at-numl/",
    "retrieved_at": "2025-08-27T12:39:44.460Z"
  },
  "metadata": {
    "title": "China-Pakistan Sports Carnival held at NUML",
    "author": null,
    "date_published": "2025-02-12T14:19:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 384,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 12 (APP):China Media Group (CMG) in collaboration with National University of Modern Languages (NUML) and the Embassy of China, successfully organized the China-Pakistan Sports Carnival to commemorate the ongoing Asian Winter Games 2025 in Harbin, China. The event aimed to promote people-to-people ties through sports, aligning with the vision of fostering bilateral cooperation, youth engagement and sustainable sports infrastructure. The objectives of the event were to strengthen China-Pakistan cooperation in sports and encourage youth participation in athletic activities. The carnival featured competitive games between Chinese students and embassy staff against NUML students in Kabaddi, Ping Pong, Badminton, Tug of War, and Sack Race. NUML students secured victories in Ping Pong and Badminton, while Team China triumphed in Tug of War. A thrilling Kabaddi match was played between NUML and Iqra University, with Iqra clinching the win after a close contest. Speaking at the event, Rector NUML, Major General (R) Shahid Mahmood Kayani HI(M), emphasized the importance of sports in fostering a healthy mind and body alongside academics. He underscored the role of sports in strengthening international ties, stating that NUML has been instrumental in cementing people-to-people ties between China and Pakistan. He praised the Chinese students learning Urdu at NUML, calling them ambassadors of Pakistan. Highlighting Pakistan-China friendship as \"deeper than the sea and sweeter than honey,\" he urged Pakistani youth to learn from China's development model. The Cultural Attache of the Chinese Embassy, Mr Chen Peng, welcomed President Asif Ali Zardari's participation in the opening ceremony of Asian Winter Games 2025 in Harbin. He commended the record number of athletes competing in the games, including those from Pakistan, and expressed best wishes for all participants. He noted that beyond language, sports serve as a universal connector, bringing nations and people closer together. He reaffirmed that China-Pakistan friendship continues to grow stronger with each passing day. Director CMG, Ms Musarrat, an alumna of NUML, highlighted the significance of the Asian Winter Games and the organization of the China-Pakistan Sports Carnival at NUML. She described President Zardari's participation in the inauguration ceremony of Winter Games as a symbol of enduring friendship between the two countries. The event concluded with the distribution of certificates and prizes to the winners and runner-ups, marking a successful celebration of sportsmanship, friendship, and collaboration between China and Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}