{
  "article_id": "2025-02-12_a48c13ca81c62f839125a4ab5274c6f9",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/shift-in-strategic-culture-emphasizes-pakistans-security-concerns-kidwai/",
    "retrieved_at": "2025-08-27T12:39:09.992Z"
  },
  "metadata": {
    "title": "Shift in strategic culture emphasizes Pakistan’s security concerns: Kidwai",
    "author": null,
    "date_published": "2025-02-12T15:41:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 253,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 12 (APP):Adviser to National Command Authority (NCA), Lt. Gen (Retd) Khalid Ahmed Kidwai on Wednesday highlighted that a shift in strategic culture emphasizes Pakistan's security concerns and economic interests in the Arabian Sea and Indian Ocean Region. Addressing at the seminar organized by the Institute of Regional Studies (IRS), he urged a reevaluation of 'Continental Pakistan' within a broader strategic framework, viewing the land mass (75 percent) and Oceanic Pakistan (25 percent) as a cohesive whole rather than two separate entities. \"We cannot afford to continue to ignore 25 percent of Pakistan especially when there are mounting security and economic challenges in the Indian Ocean Region,\" he remarked. He noted the rising global demand for Pakistani troops in peacekeeping roles as a testament to Pakistan's role as a peace-loving and promoting nation. Former Defence Minister Khurram Dastagir Khan acknowledged Pakistan's effective management of eastern border security but urged the integration of western border security into the national strategy. President of IRS Jauhar Saleem warned that 'India's pursuit of advanced weaponry is instigating an arms race and undermining strategic stability in South Asia, while its ultra-nationalism breeds mistrust among nuclear states, further destabilizing the region'. Executive Director of the Sanober Institute, Dr. Qamar Cheema expressed concern over India's establishment of Integrated Battle Groups (IBGs) along the Line of Actual Control (LAC), suggesting that similar formations could emerge along the Line of Control (LoC), necessitating vigilance and preparedness from Pakistan. The event was well attended by diplomats, researchers, students, journalists, and governmental officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}