{
  "article_id": "2025-02-12_7eab130e1d8599a043d7de067a8234cc",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-reaffirms-pakistans-dedication-to-further-strengthening-collaboration-with-iaea/",
    "retrieved_at": "2025-08-27T12:40:08.115Z"
  },
  "metadata": {
    "title": "PM reaffirms Pakistan’s dedication to further strengthening collaboration with IAEA",
    "author": null,
    "date_published": "2025-02-12T10:35:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 224,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 12 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday reaffirmed Pakistan's dedication to further strengthening its collaboration with the International Atomic Energy Agency (IAEA) to harness the full potential of nuclear technology for peaceful purposes, ensuring continued benefits for the people of Pakistan and the global community. Director General of the International Atomic Energy Agency (IAEA) Rafael Mariano Grossi paid a courtesy call on the prime minister at the PM House. During the meeting, they discussed the peaceful applications of nuclear technology in various sectors, including cancer diagnostics and treatment, agriculture, food preservation, water management, and industry, PM Office Media Wing said in a press release. The prime minister commended the IAEA's initiatives in promoting nuclear energy as a key solution for mitigating climate change and emphasized Pakistan's commitment to leveraging nuclear technology for sustainable development. During the meeting, the prime minister noted that, as one of the founding members of the IAEA, Pakistan has maintained a productive and mutually beneficial partnership with the Agency spanning over several decades. With the IAEA's support, Pakistan had made significant progress in nuclear power generation, industrial development, healthcare, and agricultural advancements, contributing to the country's socio-economic growth, he added. The DG IAEA appreciated Pakistan's constructive and longstanding engagement with IAEA and said that the organization would continue to work with Pakistan in the same spirit.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}