{
  "article_id": "2025-02-12_e8e6670f832df1f7d6643f584ee2d4a8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/national-womens-convention-highlights-achievements-calls-for-enhanced-womens-participation/",
    "retrieved_at": "2025-08-27T12:40:00.624Z"
  },
  "metadata": {
    "title": "National Women’s Convention highlights achievements, calls for enhanced Women’s participation",
    "author": null,
    "date_published": "2025-02-12T14:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 771,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Feb 12 (APP):The Women's Parliamentary Caucus (WPC) on Wednesday hosted a Convention on National Women's Day, 2025\" at the Parliament House here, bringing together lawmakers, stakeholders, and international representatives to discuss strategies for empowering women. The event marked a key step in strengthening efforts to empower women across Pakistan. The convention was chaired by National Assembly Speaker Sardar Ayaz Sadiq and attended by WPC Secretary Dr Shahida Rehmani, along with WPC members from all four provinces, Gilgit-Baltistan, and representatives from UN Women and the European Union. The session began with the recitation of the Holy Quran and the National Anthem, followed by opening remarks from Secretary WPC and MNA Dr Shahida Rehmani. Speaker Sardar Ayaz Sadiq on the occasion acknowledged the contributions of Pakistani women in various sectors, noting that given equal opportunities, women can excel in any field. He emphasized that parliamentary forums, comprising representatives from all political parties are fundamentally established to advance public welfare and formulate legislation for the betterment of marginalized segments of society including children, women, and youth. The event featured a national roundtable titled \"Strengthening Women's Caucuses for a Shared Vision,\" where Women Caucuses from across Pakistan shared their unique challenges and successes. Discussions focused on issues such as budgetary allocations, operational frameworks, and region-specific challenges faced by women. Secretary WPC and MNA Dr Shahida Rehmani highlighted the legislative achievements spearheaded by women parliamentarians, notably the \"Protection Against Harassment at the Workplace Act,\" which showcased exemplary cross-party collaboration. She also advocated for mandatory measures during general elections to ensure a minimum 10% participation of women voters. Deputy Speaker of Khyber Pakhtunkhwa (KP), Suriya Bibi, emphasized the importance of cross-party collaborations and the effective utilization of Women Parliamentary Caucuses. She detailed the legislative accomplishments of WPC KP, including the passage of the Child Protection Bill, the Protection Against Harassment of Women Bill, and the Protection Against Domestic Violence Bill. She also underscored the province's initiatives to empower youth, such as the establishment of KP's first-ever Children's Parliament and the formation of the Young Parliamentarians Forum, aimed at empowering young members of the KP Assembly. Deputy Speaker of Balochistan Assembly, Ghazala Gola, showcased the achievements of women members in the Balochistan Assembly, including the establishment of Anti-Harassment Cells, the formation of the Provincial Commission on the Status of Women, and the passage of the Balochistan Protection of Women Against Harassment at the Workplace Act. She emphasized the importance of sharing experiences and collaboratively addressing challenges faced by women at federal, provincial, regional, and local levels to ensure a comprehensive trickle-down effect of women's empowerment. Member of the Gilgit-Baltistan Assembly, Ms. Kalsoom Farman, highlighted the legislative contributions of women in the GB Assembly, such as the formation of the Commission on the Status of Women, promotion of child rights, enforcement of inheritance laws to prevent exploitation, and initiatives to curb suicide rates in the region. She also informed the convention about plans for comprehensive stakeholder meetings aimed at enhancing the socio-economic and political status of women in Gilgit-Baltistan. MPA and Special Assistant to the Chief Minister of Sindh, Ms. Tanzila Ume Habiba, shared details of two unanimous resolutions passed by members of all political parties in the Sindh Assembly. These resolutions recognized and honored the socio-political struggles of women leaders in Pakistan, including Former Prime Minister Mohtarma Benazir Bhutto and First Lady of Pakistan Ms Aseefa Bhutto Zardari, among others, irrespective of political affiliations. MPA Punjab, Ms. Ishrat Ashraf, emphasized the urgent need to collectively dismantle social stigmas and barriers that hinder women's access to justice through law enforcement agencies and the judiciary. She advocated for societal reforms to enable women to seek justice without fear of judgment from family or society. Additionally, she highlighted the necessity of ensuring the social and physical security of women, enabling them to engage in employment opportunities with confidence and peace of mind. MNA/Treasurer WPC Ms Shahida Begum expressed her gratitude to the provincial caucuses for fulfilling their commitment to establishing and operationalizing women's parliamentary caucuses in the provincial and legislative assemblies. National Women's Convention concluded with active participation from Parliamentarians, Members of the Provincial Assemblies and Gilgit-Baltistan Assembly, who spoke passionately about the critical issues impacting women. The parliamentarians also focused on the economic emancipation of women, calling for measures to close the gender pay gap and expanding opportunities for women in leadership roles across various sectors. The need for increasing the party ticket quota of women from 5% and provision of financial support for women leaders during general elections by their respective parties were prominent topics. The session concluded with remarks from UN Women Country Representative Mr Jamshed Kazi.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}