{
  "title": "All out - Newspaper - DAWN.COM",
  "author": null,
  "content": "PAKISTAN cricket captain Mohammad Rizwan’s assessment was brutal — it could not have been any other way. At their very own long-awaited home tournament, Pakistan were left lining up for the exit door.\n\nA humbling loss to India on Sunday meant the Champions Trophy hosts were pointless after two matches, having also fallen in the tournament opener against New Zealand. Yet again, Pakistan were left without control of their destiny, relying on other results for survival.\n\nRizwan was clear that it was not the position he had envisaged his team would be in but that it was the harsh reality: Pakistan have become also-rans in a sport that enjoys the greatest patronage and support in the country. Their unceremonious exit was confirmed when New Zealand beat Bangladesh on Monday, and this will rankle. In their final group game against Bangladesh, Pakistan will be playing for nothing but pride.\n\nIn a tournament that was meant to be a celebration of Pakistani cricket and the team — not too long ago, Pakistan had won the One-day International series against Australia and South Africa — the side could not go far enough. The euphoria of hosting an international tournament for the first time in almost three decades has died. In sports, the celebration of any tournament lasts longer when the home team goes far. Understandably, fans here are left wondering whether the next tournament at home will give them reason to hope.\n\nPakistan had gone in as defending champions but went out with a whimper. Their selections were questionable; their approach was mediaeval. Pakistan seemed to be left behind in the evolutionary race of modern-day cricket.\n\nHead coach and chief selector Aqib Javed, the man entrusted with turning around Pakistan’s fortunes, has been found wanting. Given the top roles after helping the national team mount a remarkable comeback in their Test series against England last year, his magic has faded. Unfortunate injuries also played their part. Pakistan went into the tournament without Saim Ayub and then lost Fakhar Zaman, but that is no excuse.\n\nThe India game had become a must-win but there seemed to be no urgency, no desire, and no inspiration. Pakistan’s big names were missing. Babar Azam departed just when he got going. Rizwan went just when Pakistan were getting a foothold into the game. The bowlers were treated with utter disdain by India’s batters. India were completely dominant — Rohit Sharma’s men made the fabled India-Pakistan cricketing rivalry lopsided.\n\nPakistan need to turn things around to become contenders once again. The onus falls on the Pakistan Cricket Board to ensure this. It invested huge sums of money in renovating the stadiums for the Champions Trophy. It should now invest some time and effort into rebuilding the national team.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:37:57.733Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894203",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T03:26:36.000Z"
}
