{
  "title": "Retired hens revitalise olive groves in Cyprus - World - DAWN.COM",
  "author": null,
  "content": "AKAKI: Organic farmers in Cyprus have recruited hundreds of retired hens to fertilise olive groves in a pilot project they say boosts yields, counters disease, and helps to manage food waste.\n\nSaved from slaughter after their egg-laying years, hens peck and poop to their hearts’ content among olive trees at the organically certified Akaki Grove, on the green foothills of the Troodos mountains west of Nicosia.\n\nIn a back-to-basics approach, farmer and grove owner Elena Christoforos and soil engineer Nicolas Netien have launched the Kot-Kot project. They collect food waste donations to feed hens, which in turn provide natural fertiliser for olive trees producing oil high in inflammation-busting polyphenols.\n\n“We provide them with an old hens’ home, they come here and retire,” said Christoforos, surrounded by clucking chickens while emptying bins of food waste donated by schoolchildren.\n\nHens reduce the presence of pests such as olive fly, a scourge for olive farmers in the Mediterranean, by pecking at larvae while simultaneously clearing surface weed cover. Their droppings enrich the soil, and feeding them with food waste reduces the amount of methane-producing organic matter going into landfill.\n\nThe hens can enjoy a long retirement among the olive trees, living for 8-10 years despite only laying eggs until the age of 2. “The goal here is to create a biodiverse, self-sustained ecosystem that can sustain really high temperatures and long droughts. So when I bring animals into the system by eating ground cover and pooping, it speeds up the cycle,” Netien said. Netien, who holds the world record for producing olive oil with the highest polyphenol content, said olive tree growth and yields had improved markedly since the hens arrived.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67bcfb3ba0a6e.gif",
  "retrievedAt": "2025-08-25T20:00:37.681Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894170/retired-hens-revitalise-olive-groves-in-cyprus",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T01:52:47.000Z"
}
