{
  "title": "Rain washes out Australia-South Africa Champions Trophy match in Rawalpindi - Sport - DAWN.COM",
  "author": null,
  "content": "The Champions Trophy Group B fixture between Australia and South Africa in Rawalpindi was abandoned without a ball being bowled on Tuesday after persistent rain kept the players from the field.\n\nAccording to the International Cricket Council, the points were shared between the two sides as the exciting contest was called off, incessant weather ensuring the game was abandoned without a ball being bowled.\n\nThe cut-off time for the start of a 20-overs-a-side contest is 7:02pm local time, ESPNCricInfo said, however, the continuous rain dashed any chance of the match happening.\n\nEarlier, Umpires Chris Gaffaney and Richard Kettleborough inspected the conditions under light drizzle before deciding to delay the toss, which had been scheduled for 1:30pm.\n\nWith the rain not stopping and the ground staff unable to remove pools of water from covers protecting the playing surface, the umpires decided to abandon the Group B match.\n\nA handful of spectators with South African and Australian flags waited anxiously for the start of the match but had to leave without watching any action.\n\nSouth Africa top the pool on net run rate from Australia with both teams on three points after winning their opening fixtures against Afghanistan and England respectively.\n\nThe latter two meet in Lahore on Wednesday, with the top two teams in each group advancing to the semi-finals.\n\nLight rain through the day left pools of water on the covers and the outfield, making the prospect of play impossible when the game was called off just after 5pm.\n\nThe last time these sides met was in the semi-final of the World Cup in 2023, where the Aussies overcame South Africa by a close margin.\n\nAustralia beat England while South Africa defeated Afghanistan in their opening matches of the 50-over tournament.\n\nIndia and New Zealand have qualified for the semi-finals from Group A while title-holders Pakistan and Bangladesh crashed out of the tournament.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/25174347c4e9f9a.jpg",
  "retrievedAt": "2025-08-25T20:00:08.247Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894247/rain-washes-out-australia-south-africa-champions-trophy-match-in-rawalpindi",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T09:16:22.000Z"
}
