{
  "title": "Gambler loses bet, gets wife raped by winner in Punjab’s Vehari - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAHAWALPUR: A gambler after losing the stake got his wife raped by the winner in Sahooka police precincts, Vehari district.\n\nThe alleged rapist, it was learnt, also shot the video of the act with a threat of uploading it on social media if she disclosed it to anybody.\n\nReports said suspect ‘A’ lost the bet to his friends ‘Q’ and ‘I’ and brought them to his home where ‘Q’ allegedly raped the woman and filmed the incident.\n\nOn the complaint of the woman’s father, Sahooka police registered a case against the three, including her husband, who are yet to be arrested.\n\nThe FIR (139/25) did not have any mention of gambling but the woman and her father told media it was gambling which had destroyed their life.\n\nMeanwhile, Vehari police claimed to have arrested a man Yasir, who exhibited arms on social media and resorted to aerial firing. The police recovered the pistol from him.\n\nPFA: A Punjab Food Authority (PFA) team claimed to have unearthed a fake milk factory and arrested its owner Ghulam Hussain while his son Iftikhar Hussain managed to flee from the scene at Habib Colony of Burewala on Monday.\n\nThe PFA team alleged that 55 kg skimmed milk, with 90 kg vanaspati ghee and other ingredients and instruments, including mixing machines, were discarded and a first information report was registered.\n\nARRESTED: Sammsatta police claimed to have arrested a couple — Qadeer Ahmed and Nasreen — and recovered 14kg charas worth hundreds of thousands of rupees from their possession. They were lodged in the police station lock-up.\n\nACE: An Anti-Corruption Establishment team in a raid arrested Riaz Sattar, a naib qasid of local agriculture centre, for allegedly receiving a bribe of Rs100,000 from a nurse for her transfer.\n\nThe complainant had informed the ACE that the suspect after receiving money from her did not get her transferred.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:38:43.497Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894128/gambler-loses-bet-gets-wife-raped-by-winner-in-punjabs-vehari",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T01:53:41.000Z"
}
