{
  "title": "Stuck in eternal drought, UAE turns to AI to make it rain - World - DAWN.COM",
  "author": null,
  "content": "In the marbled halls of a luxury hotel, leading experts are discussing a new approach to an age-old problem: how to make it rain in the UAE, the wealthy Gulf state that lies in one of the world’s biggest deserts.\n\nDecades of work and millions of dollars have been ploughed into easing endless drought in the oil-rich UAE, whose mainly expatriate population is soaring undeterred by a dry, hostile climate and hairdryer summer heat.\n\nDespite the United Arab Emirates’ best efforts, rainfall remains rare.\n\nBut at last month’s International Rain Enhancement Forum in Abu Dhabi, officials held out a new hope: harnessing artificial intelligence to wring more moisture out of often cloudless skies.\n\nAmong the initiatives is an AI system to improve cloud seeding, the practice of using planes to fire salt or other chemicals into clouds to increase rain.\n\n“It’s pretty much finished,” said Luca Delle Monache, deputy director of the Centre for Western Weather and Water Extremes at the University of California San Diego’s Scripps Institution of Oceanography.\n\n“We’re doing the final touches.”\n\nHowever, Delle Monache conceded that AI was not a “silver bullet” for the UAE, which like other countries has pursued cloud seeding for decades.\n\nCloud seeding works by increasing the size of droplets, which then fall as rain. It’s estimated to increase rainfall by 10-15 per cent, Delle Monache said.\n\nBut it only works with certain types of puffy, cumulus clouds, and can even suppress rainfall if not done properly.\n\n“You’ve got to do it in the right place at the right time. That’s why we use artificial intelligence,” he added.\n\nThe three-year project, funded with $1.5 million from the UAE’s rain enhancement programme, feeds satellite, radar and weather data into an algorithm that predicts where seedable clouds will form in the next six hours.\n\nIt promises to advance the current method where cloud-seeding flights are directed by experts studying satellite images.\n\nHundreds of such flights occur annually in the UAE.\n\nWith only about 100 millimetres (3.9 inches) of annual rainfall, the UAE’s nearly 10 million people mainly rely on desalinated water, piped from plants that produce about 14pc of the world’s total, according to official figures.\n\nThe population is 90pc foreign and has increased nearly 30-fold since the UAE’s founding in 1971.\n\nPeople are concentrated in the big cities of Dubai, Abu Dhabi and Sharjah, coast-hugging refuges from the vast Arabian Desert hinterland.\n\nHowever, the country still needs groundwater, replenished by rain and encouraged by a series of dams, for agriculture and industry.\n\nAlthough UAE officials say rain has increased, downpours remain so unusual that school children are known to burst into applause and rush to classroom windows for a better view.\n\nRain, even the artificial variety, is exotic enough to be a leisure attraction: at Dubai’s Raining Street, visitors pay 300 dirhams ($81) to walk in the fake drizzle.\n\nOrdering prayers for rain is a long-standing practice by the Gulf’s ruling families.\n\nThe memorable exception was last April, when the heaviest rains on record shuttered Dubai’s major international air hub and flooded roads, paralysing the city for days.\n\nSearching for solutions, the UAE in 2017 began holding the rainfall forum, which has now seen seven editions. Its Rain Enhancement Programme has handed out $22.5m in grants over a decade.\n\n“When it comes to cloud-seeding, this programme here is the best in the world,” Delle Monache said at the forum, held near the presidential palace and next to the headquarters of ADNOC, the state oil firm.\n\n“It’s a very niche area in atmospheric science. There are few experts in the world and they’re pretty much all here now.”\n\nHis team’s algorithm was not the only use of AI in discussion.\n\nMarouane Temimi, associate professor at Stevens Institute of Technology in New Jersey, outlined a US-developed system that uses machine learning to track the path and impact of storms in real-time.\n\nHowever Temimi, like Delle Monache, was also cautious about AI solutions, warning there were clear limits.\n\nA lack of detailed data about cloud composition — a common problem, as monitoring equipment is expensive — hampers accurate predictions even with AI, Temimi said.\n\n“I would say we still have some work to do just because we have data, but not enough data to train models correctly,” he told AFP.\n\nEnthusiasm for AI was also tempered by Loic Fauchon, president of the World Water Council of government, commercial, UN and other groups.\n\n“Be careful. Try to find the right balance between artificial intelligence and human intelligence,” he told the conference.\n\n“Do not go too fast to artificial intelligence. Humankind is probably the best [option].”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/25214419f31d0e9.jpg",
  "retrievedAt": "2025-08-25T20:00:05.277Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894270/stuck-in-eternal-drought-uae-turns-to-ai-to-make-it-rain",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T16:42:19.000Z"
}
