{
  "title": "NEOC issues advisory for rain, snow in northern areas - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: The National Emergencies Operation Centre (NEOC) has issued an advisory for rain, wind, thunderstorms, and snowfall in northern and western parts of the country.\n\nIt said that a westerly wave was expected to impact various regions of Pakistan from February 25 to March 1.\n\nAccording to the NEOC advisory, Islamabad, upper Punjab, Potohar region, central, southern and northeastern Punjab are likely to experience rain, wind, and thunderstorms with snowfall or hailstorms.\n\nHeavy rainfall may trigger flash floods in vulnerable areas, the advisory cautioned.\n\nIn Balochistan, rain, wind, and thunderstorms with snowfall over hills are anticipated in the western, northwestern, and northern parts of the province, with the possibility of flash flooding in susceptible regions.\n\nSimilarly, upper and western regions of Khyber Pakhtunkhwa, including Malakand and Hazara divisions, are likely to witness rain, wind, thunderstorms, and hailstorms, along with snowfall over the hills in KP.\n\nThe advisory warned that heavy rainfall in north­­ern KP may lead to flash flooding and landslides.\n\nIn Gilgit-Baltistan and Azad Jammu and Kashmir, rain, wind, thunderstorms, and hailstorms with snowfall over the hills are expected, which may disrupt travel and routine activities.\n\nMeanwhile, Sindh is forecasted to experience mostly cold and dry weather throughout the period.\n\nThe National Disaster Monitoring Authority (NDMA) said it was monitoring the situation and coordinating with relevant authorities to ensure timely response and mitigation efforts.\n\nAuthorities have issued warnings regarding the potential hazards associated with this weather system, particularly the risk of heavy snowfall in Murree, Galliyat, and other northern regions, which may impact travellers and tourists.\n\nThe NDMA has urged the public to use its ‘Pak NDMA Alert App’ to receive regular weather updates.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:00:50.098Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894181/neoc-issues-advisory-for-rain-snow-in-northern-areas",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T01:51:06.000Z"
}
