{
  "title": "Lawyers, journalists call on govt to repeal Peca tweaks - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Say amendments violate Article 19, demand end to censorship in digital spaces\n• SHC wants challenges to cybercrime law changes heard by Constitutional Bench\n\nISLAMABAD/KARACHI: As the Sindh High Court observed that petitions challenging recent amendments to the Prevention of Electronic Crimes Act (Peca) should be heard and decided by the court’s Constitutional Bench, a consultative meeting of lawyers and journalists called on the federal government to immediately repeal the recent changes to cybercrime laws.\n\nConvened by the Supreme Court Bar Association (SCBA) on Monday, the consultative gathering also demanded an immediate end to restrictions on independent journalism.\n\nAfter detailed discussions, a unanimous resolution adopted by the journalists and lawyers present emphasised that freedom of expression was the cornerstone of democracy and it must be safeguarded against all forms of coercion.\n\nThe consultative meeting also condemned and disapproved Peca (Amendment) Act, 2025, being defective legislation, considering it a violation of Article 19 of the Constitution, which guarantees the right to freedom of speech and expression.\n\nThe consultation noted that Peca (Amendment) Act, 2025, infringed upon the rights of media personnel as protected under Article 19 of the International Covenant on Civil and Political Rights (ICCPR) adopted by the United Nations, to which Pakistan is a signatory.\n\nIt was also seen as being in contravention of fundamental rights guaranteed under the Constitution and violate the principles of natural justice, including due process and the right to a fair trial under Articles 4, 9, and 10-A of the Constitution.\n\nThe meeting found the definition of certain clauses ambiguous and not expressly defined by the legislature. Words and phrases such as ‘false’ and ‘fake’, the meeting noted, lack clear definitions. Similarly, the term ‘any person/individual’ has a broad interpretation and it should be limited to the aggrieved person or victim.\n\nAdditionally, the definition of the place of occurrence is unclear which could lead to registration of numerous FIRs on different places against single occurrence. Furthermore, tribunals should be entirely free from executive influence.\n\nThe meeting also acknowledged the media as the fourth pillar of the state and reaffirmed its strong support for independent journalism and the protection of media personnel. It stressed that any attempt to curtail media freedom threatened democratic values and transparency.\n\nThe consultative meeting noted that laws governing cybercrime and media regulation must be in line with constitutional protections and democratic norms and international covenants to which Pakistan is a signatory.\n\nThe meeting expressed its concern over increasing censorship in digital spaces, including social media crackdowns and content regulation policies that limit free speech, deformation laws and civil rights.\n\nFrom SCBA, the meeting was attended by its President Mian Muhammad Rauf Atta, Senior Vice President, Muhammad Ishaq Notezai, Vice President of Balochistan, Muhammad Aurangzeb Khan, Acting Secretary, Chaudhry Tanveer Akhtar, Finance Secretary, Mr Muneer Ahmed Malik, Ms Ayesha Malik, Mr. Hamood Ur Rehman Awan, Mr Khalil Panezai Member of Balochistan Bar Council and Mr Hafiz Ahsan Khokhar.\n\nFrom the media side, the meeting was attended by Munizae Jehangir, Arshad Ansari, Afzal Butt, Zahid Hassan, Hamid Mir, Mazhar Abbas, Arifa Noor and others.\n\nSHC observation\n\nMeanwhile, when a two-judge bench of SHC headed by acting Chief Justice Mohammad Junaid Ghaffar took up petitions challenging recent amendments to Peca on Monday, the bench observed that the petitions came under the domain of the constitutional benches of SHC.\n\nThe respondents have now sought more time to file comments on two identical petitions filed by various journalists and vloggers, asking the court set aside the impugned amendment for being ultra vires of the Constitution.\n\nThe petitioners asserted that the impugned amendments were an attack on freedom of speech and expression as well as freedom of press and the same was enacted in violation Article 19 of the Constitution.\n\nThe counsel for petitioners asserted that a regular bench of SHC can hear such matters as in December, the court had passed an order ruling that its constitutional benches did not have the same powers and jurisdictions as enjoyed by its parent constitutional high court or regular benches.\n\nHowever, the bench noted that the order in question was not applicable in these matters and the same were to be heard and decided by a constitutional bench.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T20:00:11.574Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894193/lawyers-journalists-call-on-govt-to-repeal-peca-tweaks",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T03:07:44.000Z"
}
