{
  "title": "Afghan govt says British couple in its custody - World - DAWN.COM",
  "author": null,
  "content": "KABUL: Taliban authorities have detained two Britons, a Chinese-Ame­rican and their Afghan translator, the interior ministry confirmed late Monday, after the daughter of the British couple called on London to secure their release.\n\n“Based on certain considerations, the authorities have detained four people: two British citizens holding Afghan papers, one person with Chinese and American nationality and their translator,” Abdul Mateen Qani, spokesman for the Afghan Interior Ministry, said. “Efforts are underway to resolve this issue,” he added.\n\nQani spoke shortly after Sarah Entwistle, in an interview with British media, called for her government to do “everything in their power” to secure the release of her parents, Peter and Barbie Reynolds, who had been running training programmes in Afghanistan for years.\n\nBritish media had reported their arrest, along with a Chinese-American woman and their Afghan translator, on Feb 1 in the province of Bamiyan, a major tourist attraction west of Kabul known for its giant Buddhas — destroyed in 2001 by the Taliban.\n\nQani refused to confirm the identities of the detainees, or give further details on their condition or the reasons for their arrests. “Details will be released shortly,” he said. Entwistle and her three brothers had initially chosen not to involve the UK authorities “hoping to hear directly from the Taliban about why they’d arrested our parents”, she told TimesRadio on Monday.\n\n“Our parents have alw­ays sought to honour the Taliban, so we wanted to give them the opportunity to explain their reasons for this detention,” she said. “However, after more than three weeks of silence, we can no longer wait.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/2121053847c42dc.jpg?r=211607",
  "retrievedAt": "2025-08-25T20:00:35.085Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894164/afghan-govt-says-british-couple-in-its-custody",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T01:52:47.000Z"
}
