{
  "title": "British politician jailed for attacking man in the street - World - DAWN.COM",
  "author": null,
  "content": "LONDON: A lawmaker suspended from Britain’s ruling Labour party was jailed for 10 weeks on Monday after pleading guilty to punching a man, potentially triggering an election test for Prime Minister Keir Starmer.\n\nMP Mike Amesbury got into a late-night street altercation with a man who complained to him about a bridge closure, which ended with the man being knocked to the ground.\n\nLabour suspended Amesbury, 55, after the Mail Online published a video that apparently showed the assault and he now sits in parliament as an independent. Starmer described the footage as “shocking” and said his party had moved “very swiftly” to suspend the lawmaker.\n\nAmesbury last month admitted assaulting 45-year-old Paul Fellows in the town of Frodsham, southeast of Liverpool, shortly before 3am on Oct 26.\n\nOn sentencing, judge Tan Ikram said: “In this case an immediate custodial sentence is, in my judgment, necessary as a punishment and a deterrent.” Amesbury was immediately taken down to holding cells, and will later be taken to Altcourse prison in Liverpool.\n\nBecause the sentence is less than 12 months, Amesbury will not automatically lose his Runcorn and Helsby seat in northwest England. However, if Amesbury does not appeal the verdict, a so-called recall petition will be triggered and a by-election called if 10 per cent of the electorate in his constituency sign it.\n\nIt would be the first major electoral test for Starmer’s Labour Party, which swept to power in July but has since slumped in the polls. Amesbury would still be able to run as an independent candidate, assuming he is not reinstated by Labour.\n\nPublished in Dawn, February 25th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/251019042cd356a.jpg",
  "retrievedAt": "2025-08-25T20:00:36.110Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894165/british-politician-jailed-for-attacking-man-in-the-street",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T01:52:47.000Z"
}
