{
  "title": "‘Complete overhaul’: What went wrong for Pakistan in Champions Trophy - Pakistan - DAWN.COM",
  "author": null,
  "content": "Title-holders and hosts Pakistan crashed out in the group phase of the Champions Trophy after losing to New Zealand and arch-rivals India.\n\nThey still have a match to play, against Bangladesh on Thursday, but their tournament is over — a disappointing end to their first hosting of a major international cricket event in three decades.\n\nAFP Sport looks at where it all went wrong for Mohammad Rizwan’s men in the 50-over tournament:\n\nRizwan was appointed white-ball skipper in October last year and led Pakistan to an impressive 2-1 ODI win over world champions Australia — their first series victory in 22 years in the country.\n\nThey also won in Zimbabwe and inflicted on South Africa their first home whitewash, with a 3-0 scoreline.\n\nBut fast-rising opener Saim Ayub injured his ankle during a subsequent Test in South Africa.\n\nPakistan delayed the announcement of their Champions Trophy squad until the deadline to wait on Ayub’s fitness but the left-hander failed to recover.\n\nTo add to the home team’s woes, fellow opener Fakhar Zaman was ruled out of the rest of the tournament after the first match — a 60-run defeat to New Zealand — with a muscle injury.\n\nPakistan’s much-vaunted pace attack of Shaheen Afridi, Naseem Shah and Haris Rauf — rested from the Test series to keep them fresh — looked rusty and failed to control the death overs.\n\nPakistan selectors resisted calls from former players and pundits to include a second spinner in the 15-man squad and instead chose only one in Abrar Ahmed.\n\nThey relied on part-time spinners Salman Agha and Khushdil Shah, who have managed just one wicket between them in two matches.\n\nPakistan also erred by not selecting a regular opener and took the risky step of promoting out-of-form Babar Azam to partner Zaman.\n\nWhen Zaman was ruled out they brought in Imam-ul-Haq as a replacement. He made just 10 as Pakistan were crushed by title favourites India by six wickets.\n\nIn a surprise move they included in the squad all-rounders Khushdil and Faheem Ashraf on the basis of their performances in Bangladesh’s Twenty20 league.\n\nAshraf had not played an ODI for two years and Khushdil for three.\n\nFormer Pakistan captain and television pundit Rashid Latif called it a “political selection”, blaming outside influence.\n\nFormer Pakistan captain and popular all-rounder Shahid Afridi accused Pakistan of playing outdated cricket.\n\n“In 2025 Pakistan was playing the cricket style of the 1980s and 1990s while other teams had progressed well to adopt an aggressive and modern style,” he told AFP.\n\n“The ailment of playing too many dot balls also hurt our game.” Pakistan played 152 dot balls against India in scoring 241 in 49.4 overs, including a record 28 balls with no scores in the first six overs.\n\nTheir total of 260 in 47.2 overs in the defeat to New Zealand had 162 dot balls.\n\n“The mindset of Pakistan players does not match with modern-day cricket,” said Afridi.\n\n“We need a complete overhaul of the system so that we can produce players with an aggressive mindset. “",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/251143519778da2.jpg",
  "retrievedAt": "2025-08-25T20:00:08.794Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1894231/complete-overhaul-what-went-wrong-for-pakistan-in-champions-trophy",
  "dateList": "2025-02-25",
  "date_published": "2025-02-25T06:45:41.000Z"
}
