{
  "title": "Junaid Anwar Chaudhry visits PNSC’s performance",
  "author": null,
  "content": "ISLAMABAD, Mar 25 (APP): Federal Minister for Maritime Affairs, Junaid Anwar Chaudhry visited the Pakistan National Shipping Corporation (PNSC) Head Office in Karachi Tuesday to review the corporation’s ongoing initiatives and performance, as well as to discuss future plans for the maritime sector.\nUpon his arrival at the PNSC headquarters, the Federal Minister was warmly welcomed by the Chief Executive Officer, Syed Jarrar Haider, and senior management of the corporation, said a press release.\nA detailed briefing on PNSC’s activities, operations, and strategic objectives was presented to the Minister, providing insight into the corporation’s key initiatives and its role in Pakistan’s shipping and maritime sector.\nDuring the visit, Federal Minister Junaid Anwar Chaudhry took the opportunity to plant a tree within the PNSC premises, symbolizing his commitment to environmental sustainability and green initiatives.\nThe Minister’s gesture highlights the government’s dedication to promoting eco-friendly practices within national industries, including the maritime sector.\nThe Federal Minister expressed his satisfaction with the corporation’s overall performance and its contributions to the national economy.\nHe emphasized the importance of continued innovation and efficiency within the organization, commending the efforts of the PNSC team in maintaining a strong position in the global shipping industry.\nMinister Chaudhry also took a keen interest in the ongoing and upcoming projects under the PNSC portfolio.\nHe reviewed the progress of various development initiatives and urged the management to accelerate the pace of these projects. His visit underscored the government’s focus on enhancing the operational capacity and infrastructure of Pakistan’s maritime sector.\nFederal Minister was particularly enthusiastic about PNSC’s modern initiatives, which aim to introduce cutting-edge technologies and improve operational efficiency. He highlighted the importance of staying ahead of global maritime trends to ensure that Pakistan remains competitive in the international shipping market.\nMinister Chaudhry reiteratrd the government’s commitment to supporting the growth of the maritime industry and enhancing the performance of organizations like PNSC. He assured the management of the government’s full support in facilitating the timely completion of development projects, as well as addressing any challenges faced by the corporation.\nThe minister also visited the KPT Head Office, where he was welcomed by Chairman KPT Rear Admiral Habib-ur-Rehman and senior management officials of KPT. During his tour of the port area, he visited the KGTL and SAPTL terminals, where terminal operators briefed him on port operations. The minister also paid a visit to the Mausoleum of Quaid-e-Azam, laying a wreath in honour. He was accompanied by KPT’s top management officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:02:53.749Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/junaid-anwar-chaudhry-visits-pnscs-performance/",
  "dateList": "2025-03-26",
  "date_published": "2025-03-25T19:09:00.000Z"
}
