{
  "title": "CII discusses human milk bank, organ transplantation and key Islamic rulings",
  "author": null,
  "content": "ISLAMABAD, Mar 26 (APP): The Council of Islamic Ideology (CII) on Wednesday convened a meeting in which members deliberated on a total of 19 agenda items.\nThe session was chaired by Dr. Muhammad Raghib Hussain Naeemi, Chairman of the Council.\nIn the meeting, four experts from the Sindh Institute of Child and Neonatology were invited to present a briefing on the establishment of a human milk bank. They provided detailed responses to 33 queries raised by the council members. Additional questions from the members were also addressed. The council decided to conduct an in-depth study on the matter and will present its final decision in the next meeting.\nMedia error: Format(s) not supported or source(s) not found\nThe council ruled that organ transplantation, particularly of the kidney and liver, is permissible as long as the donor’s life is not endangered.\nIt was decided that Islamic terms such as Salah (prayer), Ayah (verse), and Masjid (mosque) should be retained in their original Arabic form instead of being translated into English.\nThe council emphasized that scholars and intellectuals should raise awareness at their respective levels regarding the issue of electricity theft.\nThe council ruled that newly hired employees can be required to participate in the contributory pension system, but existing employees cannot be compelled to join it. Additionally, it stressed that pension funds must be entirely free from interest-based financial systems.\nIt was decided that premarital testing for thalassemia or other contagious diseases can be included in the Nikahnama (marriage contract) as an optional provision. However, the decision to marry will remain solely at the discretion of both parties under Islamic law.\nThe council ruled that granting a first wife the right to annul her marriage if her husband remarries without her permission is un-Islamic. Any judicial ruling that permits such annulment contradicts Islamic teachings.\nThe council stressed that Zakat funds should be distributed to deserving individuals without unnecessary delays. However, if administrative procedures cause delays, these funds can be placed in profit-generating Islamic bank accounts. In the event of any financial losses, the government will be responsible for compensating them.\nThe council reaffirmed its previous stance that the Khyber Pakhtunkhwa (KP) Transgender Bill contains the same un-Islamic elements as the Transgender Act of 2018, which had been declared inconsistent with Islamic principles by the council and the Federal Shariat Court. Additionally, the council expressed concerns over the bill’s inclusion of the Guru-Chela (mentor-disciple) concept, deeming it un-Islamic.\nAt the conclusion of the meeting, prayers were offered for the late mother of Chief of Army Staff General Syed Asim Munir.\nThe following members participated in the meeting: Dr. Muhammad Raghib Hussain Naeemi, Zafar Iqbal Chaudhry, Dr. Abdul Ghafoor Rashid, Pir Khalid Sultan Qadri, Muhammad Jalaluddin, Farida Rahim, Justice (R) Altaf Ibrahim Husain Qureshi, Dr. Uzair Mahmood Al-Azhari, Pir Shams-ur-Rehman Mashhadi, Allama Muhammad Yousuf Awan, Mufti Muhammad Zubair, Syed Iftikhar Hussain Naqvi, Professor Dr. Mufti Intikhab Ahmad, Hassan Hasib-ur-Rehman, Muhammad Shafiq Khan (Shafiq Pasrori), Hafiz Muhammad Amjad, Syed Saeed-ul-Hasan, Syed Atiq-ur-Rehman\nThe meeting concluded with a commitment to further research and deliberation on the discussed matters in future sessions.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:01:44.824Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cii-discusses-human-milk-bank-organ-transplantation-and-key-islamic-rulings/",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T11:05:00.000Z"
}
