{
  "title": "CDA Chairman pledges support to business community, highlights development initiatives",
  "author": null,
  "content": "ISLAMABAD, Mar 26 (APP): Muhammad Ali Randhawa, Chairman of the Capital Development Authority (CDA) and Chief Commissioner Islamabad, emphasized the vital role of the business community in national development and economic growth during a ceremony organized by the Islamabad Chamber of Commerce and Industry (ICCI) on Wednesday.\nSpeaking as the chief guest, Randhawa reiterated CDA’s commitment to addressing the genuine concerns of traders and industrialists. He announced that representatives from ICCI and the Federation of Pakistan Chambers of Commerce & Industry (FPCCI) would be invited to CDA board meetings to present their issues directly.\nThe chairman also highlighted key initiatives undertaken by CDA, including efforts to improve water supply, road infrastructure, and a large-scale tree plantation campaign aimed at enhancing the city’s environment. He urged the business community to collaborate with CDA to maintain a clean, green, and encroachment-free Islamabad.\nICCI President Nasir Mansoor Qureshi welcome Randhawa’s proactive approach and raised several concerns, including the need for a dedicated graveyard in Sector H-13 to accommodate the growing population.\nHe also announced ICCI’s plan to plant 100,000 saplings to boost the capital’s greenery. During the event, Dr Raashid Aftab delivered a presentation on water conservation, stressing its importance for sustainable development.\nThe ceremony concluded with Randhawa and Qureshi jointly planting a sapling at the ICCI premises, symbolizing their shared commitment to environmental preservation.\nProminent business leaders, including former ICCI presidents and senior CDA officials, attended the event.  Both sides agreed to strengthen cooperation to resolve issues and foster a business-friendly environment in Islamabad.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:02:02.691Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cda-chairman-pledges-support-to-business-community-highlights-development-initiatives/",
  "dateList": "2025-03-26",
  "date_published": "2025-03-26T15:25:00.000Z"
}
