{
  "title": "Boards to conduct SSC, HSSC exams twice a year: Shafqat",
  "link": "https://www.app.com.pk/national/boards-to-conduct-ssc-hssc-exams-twice-a-year-shafqat/",
  "date_published": "2021-09-14T11:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP):Minister for Federal Education and Professional Training Shafqat Mehmood announced that the examination of matriculation and intermediate level would be conducted twice a year keeping in view the current Covid-19 situation.\nFederal Minister for Education while talking about the important decisions taken in 32nd Inter Provincial Education Ministers Conference (IPEMC) held yesterday, stated that the exams of both level would be held in May/June and in October/November respectively, said a statement issued here on Tuesday.\nSimilarly, he said, the universities across the country had also been directed to open admission twice a year to accommodate the students during the pandemic.\nThe board exams, Shafqat said, would be held in May-June and next academic year would start from August 22. However, O and A level exams would be taken as per schedule. Hence, the universities would make own timetable for exams, he added.\nIn the IPEMC it was also decided that to calculate numbers in compulsory subjects the average of elective subjects would be taken.\nHowever, to facilitate students due to the pandemic, all those who fail in any subject would be given 33 percent marks for the purpose of computing averages.  While, in compulsory subjects, five percent additional marks would also be given. The IPEMC had also unanimously made decision that all provinces would award 50 percent grace marks in practical, while remaining 50 percent marks would be given on the base of theory.\nThe board of technical education would also adopt the same promotion policy, he added.\nThe education ministers decided that every effort would be made to ensure that the entire syllabus for all classes was completed by April/May.  Thus, there would be no smart syllabus. The exams would be taken from the entire syllabus, he informed.",
  "retrievedAt": "2025-08-11T21:14:06.167Z"
}
