{
  "title": "Cabinet makes landmark decision to introduce reforms in criminal justice system",
  "link": "https://www.app.com.pk/national/cabinet-makes-landmark-decision-to-introduce-reforms-in-criminal-justice-system-2/",
  "date_published": "2021-09-14T11:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP):The federal cabinet on Tuesday made a landmark decision to introduce comprehensive reforms in the obsolete and outdated criminal justice system in the country in line with Prime Minister Imran Khan’s vision for provision of timely and inexpensive justice.\nBriefing the media about decisions of the Federal Cabinet meeting chaired by Prime Minister Imran Khan, Minister for Information and Broadcasting Chaudhry Fawad Hussain said Minister for Law and Justice Farough Naseem gave the cabinet a detailed briefing on the proposed law, adding, these reforms would entirely change the criminal justice system.\nFawad said the reforms would fulfil Prime Minister Imran Khan’s agenda of improvement in the criminal justice system to ensure timely justice.\nHe said the focus of reforms would be inexpensive and timely provision of justice besides ending delay in trial and hurdles in registration of First Information Report (FIR).\nHe said now the matter would be discussed in the Cabinet Committee on Law and Justice and after that it would be implemented.\nHe said the cabinet rejected the proposal of giving 10 percent adhoc relief to Chairman and Deputy chairman Senate, Speaker and Deputy speaker National Assembly and members of Senate and National Assembly in their salaries.\nHe said the cabinet had also rejected an allowance traditionally given to members of the federal cabinet.\nThe minister said the decision was part of the austerity measures taken by the incumbent government from day one to reduce burden on the national exchequer.\nHe said the decision was meant to show the nation that people in corridors of power were setting an example for other people to save national kitty.\nHe said the Prime Minister House has made big saving in its expenditure as part of the PM’s authority drive and the National Assembly secretariat has returned Rs 1.54 billion to the government.\nThe cabinet, he said, was informed that the cabinet allowed the Federal Board of Revenue to hire services for making its data more secure following a cyber attack on August 14 this year.\nFawad said hackers attacked the website of Federal Board of Revenue, however most of its data remained safe and an operational emergency was declared to secure its data.\nHe said the cabinet was informed that this year about a million cyber-attacks were made on Pakistani websites which were thwarted by National Telecom Company. It was informed that a comprehensive framework of cyber security was in place which was being further strengthened.\nChaudhry Fawad Hussain said the Ministry of Science and Technology briefed the cabinet on process of electronic voting machines and overseas Pakistanis voting right.\nThe minister said the Ministry of Information Technology would launch 5G technology in the country from next year in which multiple companies had already shown interest.\nHe said Prime Minister Imran Khan directed the Pakistan Telecom Authority to ensure good telecommunication services in all parts of the country so that everyone could benefit from revolution in the sector.\nThe minister said the cabinet gave approval for the establishment of Quaid-e-Azam Foundation.\nHe said the Prime Minister expressed disappointment over delay in procurement of wheat despite his clear instructions for early procurement. He said Punjab province was issued directives for immediate release of wheat which, he said, would help in gradual reduction of wheat and flour price in the market.\nOn the proposal of the tariff policy board, the cabinet approved reduction in additional customs duty on auto parts from seven to two percent to promote indigenous production of vehicles.\nHe said additional customs duty on heavy commercial vehicles had also been reduced from seven to two percent. Moreover, he said that prices of 1000 cc and below cars would fall after abolishment of additional duty on their equipment.",
  "retrievedAt": "2025-08-11T21:14:05.473Z"
}
