{
  "title": "Govt lifts lockdown in majority districts from Sep 16",
  "link": "https://www.app.com.pk/national/govt-lifts-lockdown-in-majority-districts-from-sep-16/",
  "date_published": "2021-09-14T08:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP):Minister for Planning, Development and Special Initiatives Asad Umar on Tuesday announced to lift lockdown in 18 out of 24 districts with high risk of delta variant of COVID-19 until September 30.\nHowever enhanced restrictions would still continue in the six districts- Lahore, Faisalabad, Multan, Sargodha, Gujrat and Bannu till September 22.\nAddressing a press conference here after chairing the meeting of National Command and Operation Center (NCOC), the minister said the lockdown that were imposed in the selected districts would now be lifted from September 16.\nDue to very high risk of COVID in 24 districts, the government had put more restrictions from September 04 to 15 to avoid further spread of delta variant of the pandemic.\nHe said in the six districts, some relaxation were being given as schools would open from September 16 with 50% attendance. Similarly the intercity transport would also start running with 50% passenger capacity.\nThe timing for outdoor restaurants has been extended from 10 pm to 12 am, however indoor dining would be banned, the minister added.\nThe outdoor gathering with maximum 400 people has been allowed, however indoor gathering would still be banned in the six districts.\nAsad Umar said pressure of COVID patients in the hospitals was still high as over 5300 intensive care patients were admitted in the hospitals who were either on oxygen or ventilator.\nHe said during last few weeks, the demand of oxygen for medical purposes increased by 100% due to rising number of covid patients but he was confident over sufficient supply of oxygen in the country.\nThe minister maintained that although the situation was comparatively better now but the danger had not subsided therefore he stressed the need for accelerating vaccination process in the country.\nHe warned that the areas with low percentage of vaccination would again be put under lockdown.\n“We want to completely lift all lockdown as soon as possible so that the situation get normalize in the country,” he added.He said the government was spending Rs 200 billion on COVID vaccine and stressed that people should get vaccinated as soon as possible.\nThe minister informed that after September 30, the unvaccinated people would not be allowed to travel or to enter the shopping malls.\nSimilarly, he said the unvaccinated people would also not be allowed to enter marriage halls, indoor dining, restaurants or other similar gatherings.\nIn education institutions, all the staff who had not completely vaccinated would also not allowed to continue their work after September 30.\n“Our target is to completely vaccinate at least 40% of the eligible population in across the country,” he said adding that Islamabad had already met the target as 52% people of the eligible population had received both doses of the vaccine.\nAsad Umar said the way Pakistan received praises from across the world due to its best strategy for tackling the COVID-19 situation should continue unabated and the people should show their responsibility by getting them vaccinated.",
  "retrievedAt": "2025-08-11T21:14:09.262Z"
}
