{
  "title": "Focus of former rulers remained fake accounts, money laundering: Farrukh",
  "link": "https://www.app.com.pk/national/focus-of-former-rulers-remained-fake-accounts-money-laundering-farrukh/",
  "date_published": "2021-09-14T09:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 14 (APP):Minister of State for Information and Broadcasting Farrukh Habib said on Tuesday that, when in power, the focus of PML-N, PPP remained on  money laundering, fake accounts and corruption instead of taking steps to increase production of the country and improve economy.\nAddressing a press conference along with Minister for Finance Shaukat Tarin and SAPM on Food Security Jamshwd Iqbal Cheema he said that global commodity prices did not rise from 2008 to 2018 when PPP and PML-N ruled the country.\nHe said since the outbreak of Covid 19, reduction in production was registered and logistics costs shot up which resulted in increase of prices of daily use commodities.\nHe said according to the UNFAO report, from February 2020 to August 2021, food items prices have increased globally by 127 per cent. He said that Pakistan imported 70 cent of pulses and edible oil.\nThe minister said due to prudent government policies, the full impact of global inflation has not been shifted to the consumers.\nHe said the present government was working on food security as it was vital for Pakistan as an agricultural country.\nHe lamented that PML-N had set up sugar mills in cotton growing areas in the past and sugarcane cultivation had been started there which badly affected cotton production.\nThe minister said that Rs 1,000 billion housing and commercial projects have been approved for low income and middle class with an economic impact of Rs 5,000 billion.\nThe income of the working class has also increased during past couple of years, he said adding the labourers earning Rs. 500 to 600 a day in the past were now earning Rs 1000 per day and masons earning about Rs 1200 in the past were now earning Rs 2000 to 2500 per day.\nToday all power looms were active in Faisalabad, and more textile Mills were being built which was manifestation of good policies of the government.\nThe world, he said has been appreciating the policy of Prime Minister Imran Khan to fight Covid 19, and The Economist lauded Pakistan’s handling of coronavirus.\nThe opposition parties leaders he said, including Maryam Safdar and Bilawal Bhutto Zardari were demanding a complete lockdown from the beginning as they had no feelings for labour class and daily wage earners.\nMechanism against profiteering and hoarding has been developed and data was being reviewed every week in collaboration with the provinces, he said.\nFarrukh Habib said that Kamyab Jawan Programme, Low Income Housing Scheme and Sehat Insaf Card schemes were meant for low income groups.\nHe revealed that banks received Rs 154 billion loan applications for construction of low-income houses, out of which Rs 60 billion loans have been approved.\nHe said that State Bank of Pakistan was now providing capital of up to Rs 10 million to small and medium enterprises (SMEs) which will create innumerable employment opportunities in the country.",
  "retrievedAt": "2025-08-11T21:14:07.853Z"
}
