{
  "title": "Science Diplomacy to support S&T landscape, engage diaspora: Qureshi",
  "link": "https://www.app.com.pk/global/pakistans-science-diplomacy-to-support-st-landscape-engage-diaspora-qureshi/",
  "date_published": "2021-04-08T17:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 8 (APP): Foreign Minister Shah Mahmood Qureshi Thursday said that Pakistan’s Science Diplomacy strategy was aimed at supporting its science and technology landscape, and engage the diaspora to create necessary linkages for international collaboration.\nThe foreign minister, in his inaugural address at Virtual Start-up Summit held by foreign ministry and Pakistan Embassy in Washington, said the success of science and innovation was not merely restricted to intellectual prowess, but also to the ability of public institutions. It also helps the governments to provide an enabling environment for innovation, commercialization and effective absorption of research and development products and services.\n“Our Science Diplomacy (SD) strategy looks both inwards in supporting our S&T landscape, and outwards with the objective of engaging our diaspora to create necessary linkages for international collaboration,” Qureshi said.\nThe #Covid19 pandemic is an ideal case study on how science and technology can be leveraged to address some of the most pressing challenges of the 21st century.\nThe role of science & technology in international relations is even more resonant today.\nhttps://t.co/S3haRMbMML pic.twitter.com/IYPzem00cM\n— Foreign Minister’s Public Diplomacy  (@FMPublicDiploPK) April 8, 2021\nHe said in order to effectively engage with Pakistanis residing abroad, the foreign ministry had initiated a Diaspora Outreach Research and Innovation Network (DORIN).\nForeign Minister Qureshi said this databasing and networking effort would allow the government to create research and innovation linkages, and drive value from the experience of its diaspora across the world.\nHe said the government intended to add a new dimension to the ways Pakistan’s embassies and consulates across the world could engage and create synergies for Science, Technology, and Innovation (STI) collaborations.\n1/ Our @Invest2Innovate Q1 Data roundup on Pakistani startup deals is out! Startup in just this quarter 2021 raised $19.26M, dramatically more than this time last year.  Here’s more  pic.twitter.com/K1OtKa3USk\n— Kalsoom Lakhani (@kalsoom82) April 8, 2021\nThe foreign minister thanked the participants both from the US and Pakistan for their interest in the summit which was a testament to their commitment to the betterment and progress of Pakistan.\nHe hoped that the Start-up Summit would provide a multi-stakeholder engagement for a better understanding of the start-up landscape and opportunities in Pakistan.\nThe foreign minister also lauded the high-level representation from Higher Education Commission (HEC), Securities and Exchange Commission of Pakistan (SECP), State Bank of Pakistan, National Science & Technology Park, National Technology Fund, as well as some successful local entrepreneurs from the start-up world.\nHe said the ongoing pandemic was an ideal case study of how science and technology could be leveraged in addressing some of the most pressing challenges of the 21st century.\nThe pandemic has shown that despite forces of fragmentation, human capacity to innovate has prevailed.\nLIVE #APPNews : Foreign Minister Shah Mahmood Qureshi addresses in the Start up summit in USA via video link. @SMQureshiPTI @TeamSMQ @ForeignOfficePk https://t.co/rNgWF2UwUl\n— APP  (@appcsocialmedia) April 8, 2021\n“Several challenges faced by humanity today, such as climate change, food security, poverty reduction, and economic disparities have scientific dimensions. This warrants a coordinated scientific response,” Qureshi believed and said the role of science and technology in international relations was getting more pronounced.\nQureshi said the development of socio-economic development and sustainability were among the government’s priorities. The government is giving special attention on addressing the issues like poverty, food security, malnutrition and climate change, he added.\nHe said it was in the best interest of the country to support innovation and lead the global effort in tackling resource security.\nForeign Minister Qureshi said Pakistani diaspora in the US had been doing a commendable job in contributing to US’ knowledge economy, as well as achieving highest level of excellence in different professions.\nHe also appreciated the efforts that the Pakistani community in the US was connecting with the knowledge economy of Pakistan. We want enhancement of this connectivity for sustainable linkages, he added.\nlaunched Diaspora Outreach Research and Innovation Network (DORIN) to ensure gainful engagement of our S&T diaspora. Utilizing this forum, the 1st Start-Up Summit focuses on  diaspora in  which is well established in the S&T entrepreneurial ecosystem. pic.twitter.com/0Q9UiSBSwh\n— Science Diplomacy Pakistan (@SciDipPak) April 8, 2021\nThe foreign minister believed that Pakistan could untap the potential its youth by offering them sufficient opportunities and platforms to grow. He said the start-up ecosystem in Pakistan was one such avenue which was featuring more and more success stories.\nQureshi told the participants that the event was the first in a series of region-specific summits which would enable Pakistan to benefit from the expertise of its innovators and enable its Missions abroad to effectively execute science diplomacy related initiatives.",
  "retrievedAt": "2025-08-11T20:36:13.693Z"
}
