{
  "title": "Ehsaas pioneers orphanage living standards, the first in the Muslim World",
  "link": "https://www.app.com.pk/national/ehsaas-pioneers-orphanage-living-standards-the-first-in-the-muslim-world/",
  "date_published": "2021-04-08T11:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 8 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Thursday unveiled the new Ehsaas’ standards for private sector orphanages in a special launching event.\nThis is the first time not just in Pakistan but also across the Muslim World that such a historic initiative has been taken by the government for the welfare of orphans and deserving children, aimed at minimizing variation in the orphan care and to support private sector orphanages in raising their service standards nationwide.\nPredicated under the policy no. 37 of Ehsaas strategy, the 25-point living standards have been tailored to needs of orphan care centers. For the first time ever, a stakeholder committee had been put in place under the umbrella of Ehsaas by Dr. Nishtar in 2019 to stipulate “Living Standards for Orphanages and Child Care Centers” in the country.\nDr. Nishtar richly lauded the expert committee for their stellar work on the formulation of Ehsaas’ orphanage standards and emphasized on the widespread implementation in the country.\n“These standards have been laid out by a diverse group of orphanage organizations across Pakistan, all committed to delivering the best possible care to children who live in orphanages”, Dr. Sania Nishtar remarked.\nShe added, “With the formal launch of Ehsaas’ standards, the expert committee will now transit to an observatory role to track the implementation of these quality care guidelines.\nThe committee will also oversee continuous improvement by providing private sector orphanages to add value and build on the care their institutions already provide. I am hopeful all orphanages in public as well as private sector will be able to use these resources to improve the quality of boarding.”\nThe philanthropic landscape of Pakistan has a number of orphanages in the private sector which have been established all over the country. Nevertheless, the care and service provided is of varying quality.\nMany of orphanages are managed by the private sector. Ehsaas’ standards for orphan care not just look at processes in place but it also looks at whether these deliver what orphans need.\nChaired by Nadeem Ahmed Khan Chairperson Khubaib Foundation, the Ehsaas’ Orphan Care expert committee had brought together all major NGOs hosting orphanages along with Parliamentarians.\nFormally, UNICEF was also part of the committee. The standards that are developed had several iterations and UNICEF and other technical stakeholders have endorsed these standards.\nThe committee formally met 17 times last year, and after taking stock of the on-ground situation, finalized these standards which will now be notified and shared with provinces for endorsement.\nOverall, the document provides guidance and direction to orphanage management for quality service and control, catering to the minimum possible requirement of an orphanage from eligibility, accommodation, safety and security, infrastructure, diet, education, counselling, staff performance and facilities.",
  "retrievedAt": "2025-08-11T20:36:11.360Z"
}
