{
  "title": "Foreign services academies of Pakistan, Iraq sign MoU for diplomats’ training",
  "link": "https://www.app.com.pk/national/foreign-services-academies-of-pakistan-iraq-sign-mou-for-diplomats-training/",
  "date_published": "2021-04-08T15:33:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 8 (APP): The foreign services academies of Pakistan and Iraq Thursday signed a Memorandum of Understanding here under which the diplomats from Iraq would get professional training in Pakistan.\nThe agreement was signed by Director General Foreign Services Academy Imran Mirza and Dean of Iraqi Institute of Foreign Services Dr Saleh Hussain Ali Al Tamimi.\nForeign Minister Shah Mahmood Qureshi, Foreign Secretary Sohail Mahmood and Iraqi Ambassador in Islamabad Hamid Abbas Lafta witnessed the signing ceremony.\nhttp://https://youtu.be/Yk0p5oMo1FQ\nIn his remarks, Foreign Minister Qureshi said that it was pleasing that 63 Iraqi diplomats had so far been trained at the Foreign Services Academy.\nHe said the MoU for diplomats’ training would help strengthen the linkage between the institutions of the two countries.\nMeanwhile, Under Secretary of Iraq’s Ministry of Political Planning Dr Saleh Hussain Ali Al Tamimi met Foreign Minister Qureshi and discussed the bilateral ties, multiple cooperation and other matters of mutual interests.\nThe foreign minister welcomed the under secretary at the foreign ministry and said Pakistan greatly valued its ties with Iraq. Every year, thousands of Pakistanis visited holy sites in Iraq, he added.\nQureshi said Pakistan fully supported Iraq’s sovereignty, political harmony and security.\nThe unanimity of views on international forums including the United Nations between the two countries was appeasing, he stated.\nhttp://https://youtu.be/0MlcyqzWpQU\nMoreover, the foreign minister said both the countries could benefit from each other’s experiences of tackling the challenge of COVID-19.\nHe said Pakistan was looked forward to host the 9th meeting of Pakistan-Iraq Joint Ministerial Commission this year.\nOn behalf of his government, the Iraqi Under Secretary thanked the Government of Pakistan and the foreign minister for sending three planes lead of equipment for protection against COVID-19.",
  "retrievedAt": "2025-08-11T20:36:15.431Z"
}
