{
  "title": "Visit of Speaker NA to Afghanistan postponed due to security reasons",
  "link": "https://www.app.com.pk/national/visit-of-speaker-na-to-afghanistan-postponed-3/",
  "date_published": "2021-04-08T08:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD April 8 (APP): The visit of Speaker National Assembly Asad Qaiser to Afghanistan was postponed due to the closure of the Kabul airport at the last moment, citing security reasons, the media wing of the Parliament House announced on Thursday.\nThe aircraft of the Speaker, who was heading a nine-member parliamentary delegation to Kabul, had to return to Islamabad, after being denied permission to land at the Hamid Karzai international. The Parliamentary delegation was going to Afghanistan on the special invitation of his counterpart Chairman Wolsi Jirga Mir Rehman Rahmani.\nMohammad Sadiq, Pakistan’s Special Representative for Afghanistan in a tweet said “Speaker’s visit to Kabul postponed as the airport was closed due to security threat.”\nHe said “the plane was about to descent when the control tower informed of the closure of the airport. New dates for the visit will be decided after mutual consultations.”\nSpeaker's visit to Kabul postponed as airport was closed due to security threat. The plane was about to descent when the control tower informed of the closure of airport. New dates for the visit will be decided after mutual consultations.\n— Mohammad Sadiq (@AmbassadorSadiq) April 8, 2021\nAccording to the data available from the flight tracker Flightradar 24 and shared by a PIA enthusiast said the aircraft circled for some time near Kabul’s Hamid Karzai airport, before heading back home.\nThe information available from the Kabul Airport’s online arrivals and departures showed regular flight movement and little disruptions.\nToday, PIA Airbus A320 (aircraft registration AP-BLA) flight PK249 from Islamabad to Kabul returned to Islamabad due to closure of Kabul Airport for security reason.\nDetails: https://t.co/nFZXFiB489 pic.twitter.com/X59mQUz1a9\n— History of PIA – Pakistan International Airlines (@historyofpia1) April 8, 2021\nAccording to the Afghan Tolo News Riaz Arian, the commander of Hamid Karzai International Airport (HKIR) said that the PIA flight was diverted because of the relocation of an unexploded ordinance from under a building near the airport.\nIt quoted an official from NATO’s Resolute Support Mission and said that a digging crew uncovered an unexploded ordinance that appears to have been buried “for quite some time” in the area.\nPakistan’s Ambassador to Afghanistan Mansoor Ahmad Khan quoted a Resolute Support Official who said: “During construction at HKIA international airport, a digging crew uncovered unexploded ordinance that appears to have been buried for some time. The explosives were uncovered in an unoccupied area far from any active runway. Turkish military explosives experts conducted a controlled detonation to render the device safe. Flight operations resumed shortly thereafter.”\nThe Parliamentary delegation comprised Prime Minister’s Special Representative for Afghanistan Sadiq Khan, MNAs Shandan Gulzaar, Muhammad Yaqoob Sheikh, Sajid Khan, Maulana Salauddin Ayubi, Gul Dad Khan, Ghulam Mustafa Shah and Secretary National Assembly. The delegation was on a four-day visit to Kabul.\nPrior to his visit the Speaker in a brief message said he looked forward to closer ties with the people of Afghanistan. He said the delegation planned to hold wide-ranging discussions, including deliberations on the Afghan peace and cross-border trade.\nOfficial sources said Chairman Wolsi Jirga Afghanistan Mir Rehman Rahmani and  Chairman of the Afghan Senate Fazal Hadi Muslimyar telephoned Speaker National Assembly Asad Qaiser and regretted the postponement of the visit. They said they were looking forward to the visit of the delegation from Pakistan at an earlier date. Speaker Asad Qaiser said he would be visiting Kabul as soon as the security situation improves.",
  "retrievedAt": "2025-08-11T20:36:11.664Z"
}
