{
  "title": "Pakistan, Iran agree for early arrangements to facilitate legal trade in border region",
  "link": "https://www.app.com.pk/national/pakistan-iran-agree-for-early-arrangements-to-facilitate-legal-trade-in-border-region/",
  "date_published": "2021-03-30T15:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 30 (APP):Pakistan and Iran Tuesday agreed on the need for expeditious finalization of arrangement to facilitate legal trade and improve livelihood in border region, in light of Prime Minister Imran Khan’s initiative of joint border markets.\nThe matter was discussed in a meeting between Foreign Minister Makhdoom Shah Mahmood Qureshi and his Iranian counterpart Dr Javad Zarif, on the sidelines of the 9th Ministerial Conference of the Heart of Asia–Istanbul Process in Dushanbe, Tajikistan, a Foreign Office press release said.\nDuring the meeting, the two foreign ministers reviewed bilateral relations and exchanged views on regional issues, particularly the Afghan peace process.\nQureshi emphasized the importance of enhanced bilateral economic cooperation.\nThe two foreign ministers also reviewed progress on the opening of new border crossing point.\nForeign Minister Qureshi expressed the hope that the Afghan parties would seize the historic opportunity to work out an Afghan-led and Afghan-owned political settlement.\nHe underlined the need to consolidate progress achieved in Doha process and take the process forward. Expressing concern on high level of violence, he underscored the importance of reduction in violence leading to ceasefire.\nQureshi also underlined the need to be cognisant of “spoilers”, who did not wish to see return of peace and stability in the region.\nHe added that a peaceful and stable Afghanistan would help in improving connectivity and promote infrastructure development in the region.\nThe foreign minister expressed thanks for Iran’s steadfast support on the Jammu and Kashmir dispute and Prime Minister Imran Khan’s efforts to counter Islamophobia and promote inter-faith harmony.\nThe two foreign ministers agreed to remain in close contact and maintain bilateral political exchanges.",
  "retrievedAt": "2025-08-11T20:33:39.455Z"
}
