{
  "title": "Pakistan considers Afghan peace vital for regional stability, Qureshi tells Afghan president",
  "link": "https://www.app.com.pk/national/pakistan-considers-afghan-peace-vital-for-regional-stability-qureshi-tells-afghan-president/",
  "date_published": "2021-03-30T07:36:00.000Z",
  "source": "APP",
  "content": "DUSHANBE (Tajikistan), March 30 (APP): Foreign Minister Shah Mehmood Qureshi met Afghan President Ashraf Ghani in Dushanbe on Tuesday and discussed matters of bilateral interest including Afghan peace process.\nForeign Minister Qureshi, in the meeting that took place on the sidelines of Ninth Heart of Asia-Istanbul Process Conference in the Tajik capital, expressed Pakistan’s desire for a peaceful and stable Afghanistan.\nQureshi said Pakistan considered peace in Afghanistan vital for sustainable stability in the region.\nHe expressed concern over the rising incidents of violence in Afghanistan and said that Pakistan’s position remained the same that the Afghan problem could not be solved through military option.\nFM @SMQureshiPTI met President of #Afghanistan @ashrafghani on the sidelines of 9th #HeartofAsia Ministerial Conference. Both leaders discussed a range of issues including - bilateral ties, #AfghanPeaceProcess and other issues of mutual interest. @mfa_afghanistan pic.twitter.com/cDmLK22JE7\n— Spokesperson  MoFA (@ForeignOfficePk) March 30, 2021\nThe Foreign Minister said Pakistan supported a political solution to the Afghan problem through comprehensive dialogue, adding that positive developments as a result of intra-Afghan talks could help bring Afghan peace process to a logical conclusion.\nHe said Pakistan was a partner for peace in Afghanistan and towards that end, Pakistan was constructively engaged with the international community to reinforce the efforts for peace.\nThe Foreign Minister further underlined that Intra-Afghan Negotiations in Doha achieved progress which should lay the foundation to take the process forward.\nHe expressed the hope that as the peace efforts moved forward, the Afghans would make important decisions for reaching the negotiated political settlement.\nHighlighting the importance of the regional connectivity, the Foreign Minister said that durable process in Afghanistan would enhance opportunities for working together on infrastructure and energy connectivity between Central Asia and West Asia through Afghanistan.\nForeign Minister Qureshi also held a separate meeting with Afghan Foreign Minister Haneef Atmar to discuss bilateral relations and the Afghan peace process.\nThe two sides discussed ways to ensure peace in Afghanistan.\nQureshi arrived in Dushanbe on Monday where he participated in the Conference and highlighted the country’s role in Afghan peace and the future strategy to contribute to sustainable stability of the country.",
  "retrievedAt": "2025-08-11T20:33:43.675Z"
}
