{
  "title": "Previous governments pushed Punjab under Rs 1200b debt: Dr Firdous",
  "link": "https://www.app.com.pk/national/past-rules-pushed-punjab-under-rs-1200b-debt-dr-firdous/",
  "date_published": "2021-07-04T15:26:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Jul 04 (APP): Special Assistant to Chief Minister (SACM) on Information Dr Firdous Ashiq Awan has said that the previous “rulers” pushed the Punjab province under Rs 1200 billion debt, but Punjab Chief Minister Sardar Usman Buzdar was working hard to put the province on the road to prosperity.\nTalking to the media here on Sunday, she said that each penny of the development fund was being spent on public welfare projects according to Prime Minister Imran Khan’s vision.\nShe said that Punjab CM Usman Buzdar retrieved government lands from the land mafia and he was firmly standing against all other mafias.\nThe SACM said that negative and baseless propaganda was being spread by the opposition about the chief minister’s assets and vehicles. She said that the past rulers looted the national wealth ruthlessly and had ever done the politics of their personal gains.\nShe said the CM Punjab was given a car by his father, saying that all assets of the chief minister were declared in the Federal Board of Revenue (FBR) record.\nDr Firdous said that it was time to fulfill the promises made by the Pakistan Tehreek-e-Insaf (PTI) and this year all projects for welfare of people would be completed on time.\nShe said that the budget had been designed according to the needs of the public.\nShe said that prosperous Punjab was destination of the people of Punjab. She said that the certified thieves were out of country with their families, instead of responding to the the courts. She said that the government believed in the rule of law and no one was above the law.\nThe SACM said that all the corrupt elements would have to face accountability and the government would never spare the corrupt. She said that the Pakistan Tehreek-e-Insaf (PTI) government’s vision from day one had been to eliminate corruption from institutions and provide real relief to people.\nThe SACM said that allocation of Rs 370 billion for the health sector was a gift for the nation from Prime Minister Imran Khan and CM Punjab Sardar Usman Buzdar. She said that the Punjab government had given a relief package of Rs 106 billion during COVID-19 pandemic. The development budget of the health sector had been increased by 182%, she said.\nDr Firdous said that funds of Rs 80 billion had been allocated for the Universal Health Insurance Programme. Under the programme, 100% of the population of Punjab would be provided free and quality medical treatment during the current fiscal year.\nBy December 31, 2021, 12 crore population of Punjab would be covered by health insurance, she added.\nShe said that with the establishment of 22 biosafety laboratories in Punjab, the daily testing capacity had been increased from 2,000 to 20,000. She said corona testing facilities were being provided in 51 laboratories in the government and private sectors.",
  "retrievedAt": "2025-08-11T20:56:00.033Z"
}
