{
  "title": "Baffled India still unable to validate anti-Pakistan claim on drone attack",
  "link": "https://www.app.com.pk/national/baffled-india-still-unable-to-validate-anti-pakistan-claim-on-drone-attack/",
  "date_published": "2021-07-04T12:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, July 4 (APP): India blamed Pakistan for, what it called was a drone attack, at the Jammu airbase, but days have passed and it still has not been able to substantiate claims by providing any solid evidence, prompting even local media to raise questions.\nPakistan has consistently pointed out that the BJP government stages Pulwama-like “false flag” operations to malign Pakistan with terrorism-related allegations for narrow political gains.\nEven without knowing the type of the device and its location, the Indian government opted to blame Pakistan but failed to respond when asked called for any shred of evidence.\nContrarily, Pakistan came up with solid evidence of Indian involvement in a bomb blast that took place in Lahore on June 23. Informing media about the arrest of the main accused, National Security Advisor Moeed Yousuf said Sunday that the mastermind of the attack belonged to India and the funding came through a third country.\nThe Indian media is also doubtful as to why the Modi government ignored repeated recommendations by the country’s own departments for developing drone technology and taking measures to counter such devices.\nTo substantiate Pakistan’s claims of it being an inhouse job, the Indian media also questioned the government why the anti-drone systems were installed after the alleged attack and not before it despite earlier recommendations.\nFrom the former air chiefs and security experts to senior media men, all are questioning the BJP-led fascist government as to why they slept over the repeated recommendations to achieve counter-drone measures.\n“Once again, India has failed to be proactive where it should have. Steps should have been taken much earlier to tackle this menace,” senior journalist Snehesh Alex Philip wrote in The Print.\nHe said after the attack has happened, anti-drone systems and more lights had been installed.\n“Were we waiting for an attack to happen for things to start moving?” he questioned.\nAn analyst Sushant Sareen said it showed as how unprepared India was in combating the modern-day challenges.\n“Investigators are still not sure whether the drone was a crude, commercially available version that had been rigged to drop an explosive charge, or it was a more sophisticated drone that could fly longer distances and attack with greater accuracy,” he commented.\nFormer Indian Air Chief S Krishnaswamy also said that regrettably, India’s own capabilities to detect drones/UAVs have not yet developed.\n“We have not looked seriously at procuring detection systems and weapons against drones. Scurrying after an attack will not help us. The government must review the status of development of drones, the means of detection and the methods of engagement.”\nJournalist-author Rahul Pandita said the New Delhi slept over the concerns by the authorities and chose to do nothing about it for months.\nPakistan categorically rejected the “irresponsible and misleading” statement by Indian Minister of State for Home Affairs G Kishan Reddy on the subject.\nThe Foreign Office spokesperson said while conveniently choosing not to share any evidence, the Indian government had once again leveled serious allegations against Pakistan.\n“This is yet another manifestation of the unsubstantiated propaganda and smear campaign against Pakistan that is characteristic of the Indian government and an obliging Indian media… The latest allegations further confirm what Pakistan has consistently pointed out that the BJP government stages “false flag” operations to malign Pakistan with terrorism-related allegations for narrow political gains,” he said.",
  "retrievedAt": "2025-08-11T20:56:02.860Z"
}
