{
  "title": "PTI to emerge victorious in next general elections: Farrukh Habib",
  "link": "https://www.app.com.pk/national/pti-to-emerge-victorious-in-next-general-elections-farrukh-habib/",
  "date_published": "2021-07-04T11:33:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Jul 04 (APP): State Minister for Information and Broadcasting Farrukh Habib said on Sunday that Pakistan Tehrik-e-Insaaf (PTI) would again emerge victorious in next general elections on the basis of its excellent performance.\nTalking to the media here at Circuit House, he said the PTI government had stabilized the\nnational economy and provided relief to the masses. He said all economic indicators were\npositive despite the corona spectra which had wasted our precious 18 months.\nHe said that various economies in the world were threatened with bankruptcy, due to corona related impacts, adding that India’s economic growth nose dived to minus 7.7 percent, even economic growth of United Kingdom (UK) was registered negative while global debt also recorded a huge increase of 13 to 14 percent.\nHe said the opposition had been demanding lockdown but visionary leader Imran Khan\nrejected the proposal and introduced a new strategy of smart lockdown to run economy\nand save precious human lives side by side. This step yielded positive results and\nPakistan’s economy recorded a prompt phenomenal growth, instead of squeezing, he\nadded.\nHe said, “Our exports were recorded all time high at 25.3 billion dollar, while during 2017-18, our exports were dwindling on 24 billion dollars. If the exports of services included, our\nexports have jumped to 31 billion dollars in 2021.\nHe proudly claimed that foreign remittances also recorded increase during the last 11 months as it stood at 27 billion dollars which are expected to jump to 29 billion dollars as oversees Pakistanis are sending more than 2 billion dollars per month. If we compare present remittances with the remittances of previous government, it is 10 billion dollars in excess to the PML-N government, he observed.\nThe increase was due to the trust of expats in the visionary and honest leadership of Prime\nMinister Imran Khan as they were confident that now their money would be spent in Pakistan and no one could pilfer it and again send it back to the western countries through black-marketing or money laundering, he added.\nAbout IT exports in 2013, he said that it was only 800 million dollars which jumped to 1000 million (1 billion) dollars in 2018 and now it is 2.1 billion dollars as the PTI government realized its importance and provided conducive atmosphere through supportive measures to this important sector, he said.\nContinuing, Farrukh Habib said that in 2018 dollar inflow was only 50 billion which now stood at 60 billion.\n“It is non-debt inflow and foreign loans are not included in it. In 2018, outflow of dollar was 68 billion while our income from this head was only 50 billion dollars. Now the inflow of dollar is 60.1 billion and its outflow is 60 billion dollars”, he added.\n“Our economy is now stable and we are managing our maximum expenditures from our own resources, he said and added that we are forced to borrow to payback installments of the loans acquired by the previous rulers”.\nAbout the development agenda of PTI, the state minister said that Prime Minister Imran Khan intended to introduce electronic reforms but the opposition was opposing it as it would expose their poor performance.\nResponding to a question about recovery of 33 billion dollars from the account of Asif Ali Zardari, he said that it indicated the volume of corruption of previous rulers.\nHe said the opposition intended that all regulatory institutions should be closed down and they may be allowed to continue their loot and plunder unabated.\nAbout the recent speech of PM Imran Khan in the National Assembly regarding the return of American army from Afghanistan, he said that Prime Minister was representing the popular sentiments of public, took a bold stance that Pakistan would become a partner in constructive pursuits but would not be a part of war.\nResponding to a query about food security, the state minister said the PTI government was encouraging the agriculture sector.",
  "retrievedAt": "2025-08-11T20:56:03.746Z"
}
