{
  "title": "AJK Elections: 701 candidates in run for 45 general seats",
  "link": "https://www.app.com.pk/national/ajk-elections-701-candidates-in-run-for-45-general-seats/",
  "date_published": "2021-07-04T14:21:00.000Z",
  "source": "APP",
  "content": "MUZAFFARABAD, Jul 04 (APP):Azad Jammu and Kashmir (AJK) Election Commission on Sunday issued a final list of contesting candidates for the upcoming general elections of 45 legislative Assembly general seats which was going to be held on July 25 after the last date fixed for withdrawal of nomination papers here.\nAccording to final list, a total of 701 candidates were in run for 45 general seats including 579 for 33 constituencies within the territorial limits of AJK and 122 for 12 refugee constituencies comprising on four provinces of Pakistan.\nIn four constituencies of district Mirpur, a total of 95 candidates filed nomination papers out of which 88 were declared correct after the scrutiny and now 80 were in the contest as eight withdrew their nomination before the last date.\nIn three constituencies of Bhimber district, 63 candidates filed nomination papers, 61 were accepted after scrutiny and 53 were in run after withdrawal.\nLikewise, 153 nomination papers were filed in 6 constituencies of Kotli district out of which 147 accepted and 104 were in contest after withdrawal of rest of the candidates.\nThe final list showed that 112 candidates filed nomination papers in 4 constituencies of Bagh District out of which 110 were accepted and 76 left in the contest after withdrawal.\nOn seven constituencies of district Poonch cum Sudhanoti, 151 candidates filed nomination papers,148 accepted and 114 remained in the contest of last date of withdrawal.\nA total of 70 candidates filed nomination papers on 2 constituencies of Neelum District out of which 67 declared correct and 39 were in run after withdrawal of the rest, the list added.\nIn Muzaffarabad and Hatian districts, 158 candidates filed nomination papers on 7 constituencies out of which 153 were accepted and 113 were in contest after passing the date for withdrawal.\nOn six constituencies reserved for refugees from Jammu residing in different areas of Pakistan, 94 candidates filed nomination papers, 86 were declared correct and 72 were in run while on six seats reserved for refugees from Kashmir Valley, 78 nomination papers were filed, 74 were accepted and 50 candidates were in run after withdrawal.",
  "retrievedAt": "2025-08-11T20:56:02.026Z"
}
