{
  "title": "Mahmood Khan terms PDM’s public gathering as flopped show",
  "link": "https://www.app.com.pk/national/mahmood-khan-terms-pdms-public-gathering-as-flopped-show/",
  "date_published": "2021-07-04T16:34:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Jul 04 (APP):Chief Minister Khyber Pakhtunkhwa Mahmood Khan has termed the public gathering of Pakistan Democratic Movement (PDM) in Swat as a complete flopped show and said that deaf ear to PDM call clearly reflects their confidence in the policies of the incumbent government.\nIn a statement issued here on Sunday, the Chief Minister said that worst political opponents of the past who always blamed each other for plundering the resources of the country, have now united just to save themselves from ruthless accountability being carried by the incumbent government.\nHe added that lack of public participation in the public meeting was clear message for PDM that not only Swat, rather the people across the province have out-rightly rejected unjustified movement against the government.\nMahmood Khan stated that like first phase, the people of Khyber Pakhtunkhwa once again rejected the anti-government movement of PDM. He said that the opposition alliance has already met its fate much earlier when two of its major component parties parted their ways from it.\nThe Chief Minister said that PDM was an alliance of failed, rejected and corrupt politicians, who were trying to malign the government to avoid ruthless accountability.\nHowever, he made it clear that the across the board accountability would continue as it was on top of the agenda of Pakistan Tehrik-e Insaf government and the vision of Prime Minister Imran Khan. He said anyone who had plundered national resources would be taken to task.\nMahmood Khan further said that people of the province as well as the whole country had rejected the opposition parties as they had ruled the country turn by turn for about seven decades, but did nothing for the well being of the masses.\nTherefore, the people reposed full confidence in Pakistan Tehrik-e Insaf in the last general election and will do the same in the next general elections too, he added.\nHe said that Pakistan Tehrik-e Insaf and Prime Minister Imran Khan was the only ray of hope for the nation for having fully capability to steer the country out of crisis and make it a great nation.\nThe Chief Minister condemned the organizers of the PDM’s public meeting for using the minor students of Mardassas for their political show after lack of participation by public and termed it as a shameful act on their part.",
  "retrievedAt": "2025-08-11T20:55:59.994Z"
}
