{
  "title": "Pakistan gets license to make medicine for coronavirus patients: Dr Zafar",
  "link": "https://www.app.com.pk/national/mirza-announces-local-manufacturing-of-new-covid-19-drug/",
  "date_published": "2020-05-15T02:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP):Pakistan has got license to make newly developed medicine for treating the coronavirus patients, Dr Zafar Mirza, Special Assistant to the Prime Minister on National Health Services announced on Friday.\nThe drug named Remdesivir will soon be manufactured locally under license from Gilead Sciences Inc, an American research based pharmaceutical company, he said addressing a press conference at the National Command and Operation Centre (NCOC).\n“This is a major success on public health and diplomatic front, as under the agreement Pakistan will supply this medicine to 127 developing countries hit by the coronavirus pandemic.”\nRemdesivir will be registered on fast track basis by Drug Regulatory Authority of Pakistan (DRAP) after fulfilling legal requirements. Remdesivir was granted emergency use authorization by the United States Food and Drug Administration (USFDA) on May 1, and approved by the Japanese authorities on May 8, Dr Zafar said.\n“The production could commence as early as eight weeks, after necessary regulatory approvals are obtained, and the manufacturer is confident that it will produce sufficient quantities over time to serve the needs of the patients in Pakistan and abroad.”\nDr Mirza said globally only two countries, including Pakistan, have been allowed to manufacture this medicine.\nHe said that on May 12, Pakistani manufacturer BF Biosciences Limited, a subsidiary of Ferozsons Laboratories Limited, successfully concluded its voluntary licensing agreement with Gilead Sciences, Inc. for the manufacture and sale of ‘Remdesivir’ under Gilead’s Global Patient Solutions Program to supply the product to affected developing countries.\nThe Gilead has signed non-exclusive voluntary license agreements with five South Asian manufacturers including BF Biosciences Limited from Pakistan. Under the agreements, the companies have a right to receive a technology transfer of the Gilead manufacturing process for Remdesivir to enable them to ensure product quality and to scale up production quickly.\nDr Mirza pointed out it was for the first time that a manufacturer from Pakistan had been included in a global supply solution of this nature.\nThe development represents an important step forward for Pakistan on the health, economic and diplomacy fronts. It would help provide citizens and frontline healthcare workers access to the latest treatment for the pandemic.\nIt also represented an important export opportunity for the country’s pharmaceutical sector at a critically important period. Export of the drug to the developing world at this time of need would also position Pakistan to play its rightful role on the global stage of public health, he added.\nThe government appreciates this important licensing step by Gilead Sciences, and pledged to support the urgent availability of Remdesivir, he assured.\nAdvisor to Prime Minister on Commerce Abdul Razaq Dawood said that the local manufacture of Remdisivir by BF Biosciences Limited represents an important export opportunity for the country’s pharmaceutical sector at a critical period.\nHe said that export of the drug to the developing world at this time of need would also position Pakistan to play its rightful role on the global stage of public health.",
  "retrievedAt": "2025-08-11T19:13:16.847Z"
}
