{
  "title": "COVID-19 SOPs compliance going down in Pakistan significantly, reveals survey",
  "link": "https://www.app.com.pk/national/covid-19-sops-compliance-going-down-in-pakistan-significantly-reveals-a-survey/",
  "date_published": "2020-05-15T01:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 15 (APP):A latest nationwide survey conducted by Ipsos Pakistan has revealed that Pakistanis despite attaining awareness about COVID-19 last month, were now not adhering to the required Standard Operating Procedures, which may worsen the situation in days ahead.\n“Quite worryingly, after attaining universal awareness of COVID-19 in April, Pakistanis seem to start forgetting it. Similarly, perceived level of threat and preventive measures’ compliance is going down significantly,” the findings of the survey disclosed.\nAccording to the survey, despite high awareness, only 50 per cent of Pakistanis feel concerned about the spread of virus. Khyber Pakhtunkhwa emerged as a province whose population was most nervous about the pandemic.\nA decline was also witnessed in the people’s perception of a ‘complete lockdown’ across all provinces while more drop was witnessed in Sindh and Balochistan, it added.\nThe survey also revealed that amid coronavirus, majority of Pakistanis did not intend to buy new stuff on Eid ul Fitr. This included people mainly belonging to lower income groups and rural areas.\nSome 80 per cent of the Pakistanis think that economic activity and businesses should reopen even if the virus was not fully contained which was the highest among all 15 surveyed countries.\nSimilarly, 80 per cent Pakistanis expect things would return back to normalcy by June and were quite optimistic that the economy would recover quickly once the lockdown was over.\nHowever, interestingly, like other countries, majority of Pakistanis feel nervous about leaving homes when businesses re-open and travels resume.\nAbout 80 per cent Pakistanis think COVID-19 will negatively affect their jobs or businesses but majority of Pakistanis were unlikely to learn any new skill during the lockdown period.\nAbout 70 per cent Pakistanis believe they will be closer to family, friends and relatives as a result of COVID-19 crisis. The survey noted that 50 per cent Pakistanis were offering Taraveeh prayers at homes, and 30 per cent going to mosques.\nDespite limited knowledge of precise Standard Operating Procedures for mosques, 80 per cent Pakistanis believe that the SOPs were being followed in mosques, the survey noted.\nFor Pakistanis local news channels and the religious places were the most reliable source of information regarding COVID-19 while 33.3 per cent Pakistanis show lack of confidence in social media platforms.\nOver the past month, there is decline in confidence in social media amid fewer discussions of the topic.\nSample size of the snap poll was over 1,000 with 58 per cent from Punjab, 22 per cent from Sindh, 14 per cent from KPK, 4 per cent from Balochistan and three per cent from Azad Kashmir. Seventy per cent of the participants were male while remaining 30 per cent were female.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:13:18.837Z"
}
