{
  "title": "AI to reshape governance in country: Ahsan Iqbal",
  "author": null,
  "content": "LAHORE, Aug 25 (APP):Federal Minister for Planning, Development and Special Initiatives Ahsan Iqbal has said that as industrial revolution reshapes societies similarly artifical intelligence (AI) will reshape governance in the country.\nHe said this while addressing the third National School of Public Policy Conference on ‘Artifical Intelligence in Public Policy and Governance’ organized by the National Institute of Public Policy (NIPP) in collaboration with the National School of Public Policy (NSPP) at the NSPP on Monday.\nHe said: “We can use artificial intelligence to win various ‘Markas’ which includes\n‘Marka-i-Education’, ‘Marka-i-Health’, ‘Marka-i-Trade’, ‘Marka-i-Research and Technology’.”\n“If we combine wisdom of our civil service through power of AI, we can build Pakistan that is prosperous, inclusive and globally competitive by 2035 to realize dream of turning Pakistan into 1 trillion dollar economy, ” he added.\nThe minister said there was a need to immediately establish AI training centre for officers at the NSPP and other training centres to improve their capability.\nThe minister emphasized on working with startups, universities and industry to\nco-create AI governance solutions because it requires a collaborative efforts.\nThe officers must be AI literate, he said and added that the NSPP must launch an AI centre for civil servants training and to study how we could adopt AI fast in governance and civil service.\nHe said, “We must not overlook the ethics part of AI.”\nThe federal minister said, “We must ensure that AI is transparent, fair and respects privacy of data. AI is based on algorithms and quality of algorithms would define what is utility of AI. Because if your algorithms are not fair, if they contain biases, so AI will also give those biases.”\nHe said: “It is extremely important that, you know, we also look at the fairness dimension of AI and see that the algorithms are fair and do not have discrimination or biases.”\nAhsan Iqbal said, “In a country like Pakistan, which is very diverse, it has to be ensured that it is right. Similarly, the authenticity of data, the fuel of AI is data. And if your data is not accurate, it is not timely, it is not updated, AI will not do much.”\nHe said: “We are a generation which is passing through some of the most spectacular times in human history and I often say that in our lifetime, we have seen the journey from ‘Takhti’ to 5G  and in coming years, probably this change will happen even in less than six years. So that is the speed of change with which we have to grapple in future.”\n“When the environment changes and so do the species, their existence also comes under threat, those species which are able to cope with the new environments survive and the ones which cannot cope with the new environment extinct.”, he added.\nThe minister said it was the fundamental challenge of our times that technology, a new revolution in technology and particularly digital technologies, biotechnology, automation, robotics, now in future quantum computing, all these technologies were going to bring about a change on a scale that had not been seen ever in our history.\nHe said: “In change management, there are three approaches first is either you proactively embrace change, the second response is reactive change and the third is you keep yourself in denial of change.” AI was no longer science fiction, it was not consideration for the future, it was already here and it was already transforming communities and societies worldwide, he said and added that for Pakistan, AI was not a luxury, it was a necessity for survival and success in a fiercely competitive world.\nHe said that in 2016-17, we were able to visualise establishment of National Centre for Artificial Intelligence, National Centre for Cyber Security, National Centre for Big Data and Cloud Computing, National Centre for Automation and Robotics, National Centre for Genomics, National Centre for Satellite Technology and GIS and National Centre for Applied Mathematics because algorithms were the basis of the whole AI revolution. So all these national centres were set up in 2017 as a foundation for the new industrial revolution 4.0 and each of these centres was networked with 8 to 10 engineering universities, he maintained.\nHe said that this was not just one place but it was a network of all capabilities we had nationwide and as a result today with the grace of the Allah, The Almighty, we do have an ecosystem that had enabled us to produce human resource and knowledge in these areas.\nThe federal minister said: “Policies and plans whether ‘Vision 2010’ or ‘Vision 2025’ or even ‘Uraan-Pakistan’ today, you may have the best policies but if we fail to develop the ecosystem, nothing will happen. You study from Japan to Korea to Malaysia to Singapore to Vietnam to Bangladesh to China to Turkey to Gulf, all these success stories of last 40 years have an ecosystem based on four pillars which are critical in their success.”\nHe said that peace and political stability were essential for ensuring development along with commitment to reform and modernization.\nHe said, “We have established national centres of artificial intelligence, big data, cyber security, robotics, genomics and automation, and recently also announced a national AI policy.”\nHe said that under ‘Uraan Pakistan’, we are scaling up this vision, launching Quantum Valley, the National Innovation Fund, and building AI-driven digital infrastructure for governance.\n“Our first ever digital economic census mapping 7.1 million establishments showed how digital tools could transform evidence-based planning.”\nAhsan Iqbal also shed light on how AI directly strengthens our five E’s framework of ‘Uraan Pakistan’.\nAhsan Iqbal said that it was very important that we look on the equity side, data privacy, transparency in AI.\nHe suggested  that each ministry must adopt AI in at least one core function by 2027 to champion one function in each ministry, in each department based on AI so that then we could go for broader adoption.\nFederal Minister for Climate Change and Environmental Coordination Musadik Masood Malik said he would start by emphasising that since we were talking about Artificial Intelligence, right now, in terms of its evolution, we are more at the stage of imaginary.\nHe said, “Most important thing is to get out of the trap of what it is and get into something that it is going to be.”\nMusadik Malik said the true jazz was in the application of AI in every aspect of life and not just climate change and environment.\nHe said in terms of climate, he could get into a lot of details, but he just wanted to make sure that he lays out the foundations, the platforms.\nThose days where AIs were used as chat GPT to summarise stuff, they were gone, he said.\nThe minister said he would like to share  four major platforms or four major agents, AI agents or AI systems.\nHe said, “The first is the Earth intelligence, the second is bioresilience, third is climate safe infrastructure and fourth is community and governance.”\nHe said, “All you need to do is take that data that is coming from the earth intelligent agent and designed to defend, or designed to flow, or designed for excellence. It’s up to you.”\nEarlier, NSPP Rector Dr Muhammad Jamil Afaqi in his welcome address said, “Artificial intelligence today evokes a mix of emotions. There is excitement, there is awesomeness, there is apprehension.”\nNone of these perspectives helps towards a realistic evaluation of what was going to happen, he added.\nHe said, “AI is a different character altogether.”\nHe said that let us view this conference not merely as an event, but as a milestone in the chronicles of knowledge.\nMuhammad Jamil Afaqi said, “May it inspires us to harness AI not only as a technological force, merely a technological force, but as a partner in building institutions, policies and practises that are efficient and humane.”\nNational Institute of Public Policy Dean Dr Naveed Elahi also spoke on the ocassion.\nA souvenir was also given to Federal Minister Ahsan Iqbal.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-25T13:53:35.019Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ai-to-reshape-governance-in-country-ahsan-iqbal/",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T11:20:00.000Z"
}
