{
  "title": "UAE ambassador pays farewell call on PM",
  "author": null,
  "content": "ISLAMABAD, Aug 25 (APP): The outgoing Ambassador of the United Arab Emirates to Pakistan Hamad Obaid Ibrahim Al-Zaabi paid a farewell call on Prime Minister Muhammad Shehbaz Sharif at the Prime Minister House Monday evening.\nDefence Minister Khawaja Mohammad Asif, Minister of State Bilal Azhar Kiyani, SAPM Tariq Fatemi and Foreign Secretary Amna Baloch were also present during the meeting.\nThe Prime Minister congratulated the Ambassador on the successful completion of his tenure in Pakistan and thanked him for his contribution towards the strengthening of Pakistan-UAE relations.\nThe Prime Minister lauded the leadership of His Highness Sheikh Mohamed bin Zayed Al Nahyan, President of the United Arab Emirates and Ruler of Abu Dhabi, in forging closer Pakistan-UAE ties that were reflective of the longstanding, deep-rooted, fraternal bonds between both countries.\nHe also expressed his satisfaction that in recent months, the two sides had taken important steps to further strengthen these ties, including the visits of Foreign Minister His Highness Sheikh Abdullah bin Zayed Al Nahyan, Crown Prince of Abu Dhabi His Highness Sheikh Khalid bin Mohamed bin Zayed Al Nahyan, the convening of the Pakistan-UAE Joint Ministerial Commission, and the recently operationalized agreement on visa abolition for diplomatic and official passport holders.\nThe Prime Minister said that he looked forward to the official visit of His Highness Sheikh Mohamed bin Zayed Al Nahyan to Pakistan at an early date, that would lend further impetus to the relationship between the two sides.\nAmbassador Al Zaabi thanked the Prime Minister for receiving him for a farewell call and said he was deeply appreciative of the support and friendship that he had received throughout his nine-year stay in Pakistan, from the Government as well as the people of the country.\nWhile acknowledging the special bonds of friendship between the leadership and the people of both countries, he said that he would continue to work for stronger Pakistan-UAE ties in the future.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-26T11:16:45.754Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/uae-ambassador-pays-farewell-call-on-pm/",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T17:52:00.000Z"
}
