{
  "title": "1500th birth anniversary of Prophet Muhammad to be observed with ‘Ashra Rehmat-ul-Lil-Alameen’",
  "author": null,
  "content": "ISLAMABAD, August 25 (APP):The Ministry of Religious Affairs and Interfaith Harmony has announced a comprehensive program to mark the year 1447 Hijri as the 1500th birth anniversary of Prophet Muhammad (Peace Be Upon Him), declaring it a moment of great spiritual, historical, and national significance.\nAddressing a press briefing on Monday, Federal Minister for Religious Affairs and Interfaith Harmony Sardar Muhammad Yousaf said the observance would be commemorated through the Ashra Rehmat-ul-Lil-Alameen (Peace Be Upon Him) from 1st to 12th Rabi-ul-Awwal across the country.\nHighlighting the significance of the occasion, he said, “This is not only a great spiritual honor but also an opportunity to foster national unity and religious harmony.”\nThe centerpiece of the commemorations will be the 50th International Seerat-un-Nabi (Peace Be Upon Him) Conference, to be held in Islamabad, where government leaders, renowned scholars, diplomats, and distinguished guests from Pakistan and abroad will participate. This year’s central theme is; “State Responsibilities in Educating and Training Society on the Constructive Use of Social Media in the Light of Seerat-un-Nabi (Peace Be Upon Him).”\nIn addition to the conference, a national Quran and Seerat exhibition will also be organized, alongside a grand national Naat gathering on the night of 11th Rabi-ul-Awwal. A national-level Seerat, Naat, and research competition will also be held, with top contributors to be awarded.\nThe minister said provincial governments, Azad Jammu and Kashmir, and Gilgit-Baltistan had been asked to organize Seerat-related events, including Seerat conferences, Naat gatherings, seminars, competitions, and special youth programs at schools, colleges, and universities. “These initiatives will acquaint the young generation with the teachings of the Holy Prophet (Peace Be Upon Him) and guide them to use modern communication tools, especially social media, for positive and constructive purposes,” he added.\nSardar Yousaf also emphasized the spirit of charity during the celebrations, urging the nation to extend support to the poor, needy, and particularly those affected by recent floods in different parts of the country.\nReferring to resolutions passed by the OIC, National Assembly, and Senate, he said the celebrations had been endorsed at both national and international levels, ensuring their significance as a milestone in Islamic and national history.\nCalling on media houses to actively cover the activities, the minister said, “This occasion is not merely about events, but a national commitment to shape the character of our new generation in line with the teachings of the Holy Prophet (Peace Be Upon Him), promoting peace, tolerance, and harmony.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-25T13:53:35.018Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/1500th-birth-anniversary-of-prophet-muhammad-to-be-observed-with-ashra-rehmat-ul-lil-alameen/",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T12:52:00.000Z"
}
