{
  "title": "Interior Minister Mohsin Naqvi visits railway headquarters, reviews security & anti-encroachment measures",
  "author": null,
  "content": "ISLAMABAD, Aug 25 (APP):Federal Interior Minister Mohsin Naqvi visited the Pakistan Railways Headquarters where he attended a special meeting chaired by Federal Minister for Railways Hanif Abbasi.\nDuring the meeting, the overall security of Pakistan Railways, particularly railway tracks and trains across the country — with a special focus on Balochistan — was reviewed. Officials briefed the ministers on measures being taken to ensure foolproof security.\nA joint crackdown against encroachments on railway land was also decided in the meeting. It was agreed that the National Constabulary and Railways Police would jointly participate in anti-encroachment operations, with full support from the Frontier Constabulary (FC).\nThe meeting also approved the decision to operate a new train service between Islamabad and Rawalpindi.\nMinister Naqvi stressed that all possible measures would be taken to guarantee foolproof security for railway tracks and trains, pledging full support to the Railways Police. “The safety of passengers is our top priority,” he said.\nThe Interior Minister also praised Hanif Abbasi for taking unique initiatives to improve the performance of Pakistan Railways. In turn, Minister for Railways Hanif Abbasi thanked Naqvi for extending the cooperation of the Federal Reserve Police in anti-encroachment efforts.\nThe meeting was attended by Chief Executive Officer of Pakistan Railways Aamir Ali Baloch, IG Railways Police Rai Tahir, and other senior officials.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-25T13:53:59.365Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-minister-mohsin-naqvi-visits-railway-headquarters-reviews-security-anti-encroachment-measures/",
  "dateList": "2025-08-25",
  "date_published": "2025-08-25T10:45:00.000Z"
}
