{
  "title": "CJP chairs meeting regarding preventive measures for COVID-19",
  "link": "https://www.app.com.pk/national/cjp-chairs-meeting-regarding-preventive-measures-for-covid-19/",
  "date_published": "2020-04-08T02:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 08 (APP):A meeting on Wednesday was held under the Chairmanship of Justice Gulzar Ahmed Chief Justice of Pakistan regarding preventive measures for coronavirus (COVID-19).\nThe meeting was attended by other four Judges including Justice Umar Ata Bandial, Justice Mazhar Alam Khan Miankhel, Justice Sajjad Ali Shah and Justice Qazi Muhammad Amin Ahmed, Khalid Jawed Khan Attorney General for Pakistan, Dr. Zafar Mirza Advisor to PM for Health, Dr. Sania Nishtar Advisor to PM on Ehsas Programme, Lt. Gen. Muhammad Afzal Chairman NDMA, Dr. Tanvir Ahmed Qureshi Secretary Health, Ali Raza Bhutta Secretary Poverty Elevation and Social Safety Division, Yousaf Khan Secretary BISP, DG Health and Hazma Shafqat Deputy Commissioner Islamabad. Khawaja Daud Ahmad Registrar Supreme Court also attended the meeting.\nAt the very outset of the meeting, the Chief Justice raised the issues regarding closure of OPDs, testing capacity of corona virus, safety of doctors, paramedical staff, vision of quarantine and steps taken so far by the government functionaries.\nDr. Zafar Mirza Advisor to PM on Health briefed the participants about the current statistics and response of the government at Federal and Provincial levels and WHO protocols. He also informed about the preventive and precautionary measures taken so far by the government at all levels to fight this pandemic. He also shared the future roadmap to tackle the issue. He informed that emergencies in all hospitals are open round the clock. Private hospitals have not been restricted to operate during lockdown. They can operate after fulfilling health protocols as suggested by WHO. Passengers coming from foreign countries are being quarantined as per WHO protocols. Moreover, health staff is being trained on daily basis to enhance capabilities.\nLt. Gen Muhammad Afzal Chairman NDMA briefed about the procurement, availability of PPEs, ventilators, masks and other essential items, process of disbursement to all hospitals marked for preventing COVID-19 with the help of armed personnel. He also informed that more laboratories are being made to enhance testing capacity.\nDr. Sania Nishtar briefed the meeting that due to outbreak of deadly virus, the economic activities were at halts, people were jobless. The government has initiated programme to help the 12 million families under Ehsas Programme through which Rs.12000 to each family (one time payment) are being disbursed to the poor, deserving and jobless people earmarked through NADRA software and already available record of BISP. The amount will be disbursed after biometric verification. Health protocols and preventive measures to control outbreak of COVID-19 at the places of disbursement will also be taken care of.\nThe Chief Justice thanked the government functionaries for detailed briefing on the important issues and wish them good luck. He said that he is sanguine that the government functionaries should work hard to achieve the success in this pandemic situation.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:03:59.887Z"
}
