{
  "title": "Rs 144 billion to be distributed among 12 million poor families during next two and half weeks: PM",
  "link": "https://www.app.com.pk/national/rs-144-billion-to-be-distributed-among-12-million-poor-families-during-next-two-and-half-weeks-pm/",
  "date_published": "2020-04-08T10:03:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 8 (APP):Prime Minister Imran Khan Wednesday said the government would distribute a total of Rs 144 billion among 12 million poor families, affected by the ongoing lock-down in the wake of Coronavirus pandemic across the country, during the next two and half weeks.\nThe distribution of Rs 12000 per family, being started from Thursday under the unprecedented Ehsaas Emergency Cash Program, was aimed at reaching out to the poor and catering to their essential financial needs in this critical situation faced by the country and nation in the wake of COVID-19 outbreak, he added.\nThe prime minister expressed these views while talking to media persons here after presiding over the meeting of National Coordination Committee (NCC).\nMinister for Planning Asad Umar, Special Assistant to PM on Information and Broadcasting Dr. Firdous Ashiq Awan, Special Assistant to PM on Poverty Alleviation and Social Safety Dr. Sania Nishter, Special Assistant to PM on Youth Affairs Usman Dar and Chairman National Disaster Management Authority (NDMA) Lt. Gen. Muhammad Afzal were also present.\nThe prime minister assured that the whole process of distribution of money under the Ehsaas Emergency Cash Program was fully automated and transparent, and every effort had been to made to make it apolitical and merit-based.\nHe further said that a total of around 750,000 volunteers had so far got themselves registered with the Corona Relief Tiger Force, which would assist the government functionaries in reaching out to the poor in rural and urban areas and help identify the poor and needy families, affected by the Coronavirus situation.\nThe prime minister said as Pakistan, when compared with rich counties in the world, lacked resources to tackle the big challenge of COVID-19, the youth and charity giving people of country would fill the gap of resources.\nHe also urged the political workers including the members of national and provincial assemblies to participate in the Corona Relief Tiger Force.\nReiterating his appeal to the masses to understand the gravity of situation caused by the Coronavirus, the prime minister urged them to take preventive healthcare measures such as staying at homes, maintaining social distancing and avoid gatherings to check the spread of the deadly contagion.\nHe expressed his concern over the recent incident of a clash between police and young doctors in Quetta and said the government was taking every measure including the import of protection materials to ensure the provision of Personal Protection Equipments (PPEs) to doctors and health workers across the country.\nPrime Minister Imran Khan said with a database of 80 to 90 million poor and deserving already developed by Dr Sania Nishtar, 35 million more people had applied for cash assistance through SMS (8171) service.\nHe said the cash assistance to poor families under the programme was non-political as it was being given purely on merit and through an automated data verification system with no human interface.\nHe said 17,000 points were being established across the country to facilitate the distribution of Rs 12,000 per family.\nThe prime minister said it was totally a wrong impression that the slow rate of COVID-19 spread with less mortality in Pakistan was due to strong immunity of the people and the attitude of carelessness in that regard could spread the epidemic on enhanced rate.\nHe said the carelessness of young and healthy people could threaten the lives of elderly and ailing, considered as vulnerable.\nImran Khan said as the country’s hospitals and healthcare facilities were not capable of catering to the large number of patients, the best option to tackle the challenge was prevention through various measures.\nHe, however, added that the government was working hard to strengthen the healthcare system by importing medical equipment and other materials, including the ventilators.\nThe prime minister said keeping in view the hardships faced by the people, especially the poor and daily-wagers due to the lockdown, which otherwise was important to check the spread of coronavirus, the government had decided to open the construction industry from April 14.\nHe further said there was no lockdown in villages and the agriculture sector was already open to ensure the availability of food commodities in the country.\nThe prime minister reiterated that with a mere $8 billion relief package announced by his government as against $2,000 billion by the United States, $1,000 billion each by Germany and Japan etc. to tackle the situation arising out of the coronavirus pandemic, Pakistan could only fight and win the war against COVID-19 through courage and unity as a nation.",
  "retrievedAt": "2025-08-11T19:03:58.070Z"
}
