{
  "title": "Specialist stresses parents to teach children importance of washing hands amid Coronavirus outbreak",
  "link": "https://www.app.com.pk/national/specialist-stresses-parents-to-teach-children-importance-of-washing-hands-amid-coronavirus-outbreak/",
  "date_published": "2020-04-07T23:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 08 (APP):Child Specialist Wednesday stressed to parents to teach their children importance of washing hands and restrict their movement for outdoor activities amid to control Coronavirus spread in country as precaution is better than cure.\nTalking to PTV news Channel, Child Specialist Dr Zeeshan Ghani said that it is responsibility of parents to protect and teach young children for the importance of washing hands thoroughly and regularly to prevent the spread of the virus.\nThe virus is spread via droplets, and hands may touch surfaces contaminated with the virus. If you touch your eyes, nose or mouth with your contaminated hands, you can transfer the virus to yourself, he explained, adding, Washing your hands with soap and water will get rid of the virus if it is on your hands.\nHe suggested that my personal and professional experience has been that hand-washing is generally better than hand sanitizer, especially when you apply moisturizer right after.\nApplying moisturizer after each hand-washing can offset much of the drying effects of hand-washing.\nI typically recommend my patients carry a pocket tube of moisturizer that would allow them to apply it anywhere, he added. Keeping children focused and motivated to continue studying, while also providing them with enough productive activities to keep them occupied in down-time is no easy task, he added.\nHe further advised that Parents have to model a sense of hope and positivity, explaining that teaching children this emotional resilience can help them to learn the areas of life they can control in uncertain times.\nHe also underlined the importance of teaching children about gratitude, explaining that this helps them to “reframe” challenges.\nSpecialist said parents could view this time to provide children with the “ultimate training ground,” giving them an early start to learning life skills for when they no longer live at home.\nRestrictions are now in place around the world, limiting how often people can leave the house to visit shops, for example, as part of efforts to reduce outside human contact and curb the further spread of COVID-19, he added.\nAt home, however, he said this offers the opportunity to teach children about rationing, cooking and budgeting for food.\nEqually, Dr suggested sewing, knitting and gardening, as some other skills that can help children to become more self-sufficient.\nThis is a time when children will be online a lot, and it’s very important in terms of practical skills that we start teaching them how to navigate that digital world safely,” he said.\nHe further advised mothers of new born babies that these moms should adopt all precautionary measures while handling little infants at home.\nHe said according to recent studies the Coronavirus is not much affected for kids but care is important .",
  "retrievedAt": "2025-08-11T19:04:11.257Z"
}
