{
  "title": "Self-monitoring by tobacco industry to facilitate tax evasion, illicit trade, warn experts",
  "author": null,
  "content": "ISLAMABAD, Mar 15 (APP):Experts at a seminar underscored the need for data-driven policy-making in tobacco control and taxation, especially when the next fiscal year’s budget is under preparation.\nThe seminar organized by Sustainable Development Policy Institute (SDPI) on Tobacco Taxation was followed by the soft launch of Pakistan’s first-ever “Tobacco Control Knowledge Hub”, said a press release issued here on Saturday.\nDr. Abid Qaiyum Suleri, the Executive Director of SDPI, said that the Hub will serve as a centralized platform for collaboration, coordination, advocacy, and evidence-based discussion. “This hub will fill the existing information gap by providing research-backed analysis, data projection, and trend monitoring under one platform,” he added.\nHe highlighted that every recommendation presented to the Ministry of Finance increases the chances of policy reforms at the highest decision-making levels. SDPI and its partner organizations should continue to work extensively on tobacco control, and the Hub is a significant milestone in this endeavor.\nDr. Jadambaa Narantuya, Cluster Lead Disease Control, WHO Country Office said over 800,000 deaths annually occurred due to non-communicable diseases (NCDs). She reaffirmed WHO’s commitment to tobacco control policies and announced an investment case study to advocate for reduced tobacco consumption.\nDr Narantuya, reiterated that the Tobacco Knowledge Hub will serve as a comprehensive database and collaborative platform to advance policy discussions, train stakeholders on best practices in tobacco taxation, and monitor advocacy efforts. By documenting the impact of tobacco taxation on health and economic costs, the hub will strengthen efforts to reduce the burden of tobacco-related diseases in Pakistan and globally, she added.\nAsif Iqbal, Managing Director of SPDC, provided insights into Pakistan’s highly concentrated tobacco market, where the top 15 brands account for 80% of sales, and five major companies control 72% of the market share. Illicit trade remains a significant challenge, with 21.3% of the market comprising locally produced untaxed cigarettes, while smuggled cigarettes account for an additional 11.9%, totaling 33% illicit trade, he added.\nDr. Waseem Iftikhar Janjua, Senior Researcher at SDPI, highlighted that Pakistan is joining a global network of nine knowledge hubs operating in India, Australia, South Africa, and other countries. He stressed the urgent need for a policy discussion platform to generate, collect, and share evidence on tobacco control, particularly in Pakistan and the broader Mediterranean region, including the Middle East and North Africa.\nPresenting the analysis of Pakistan’s track and trace system, he emphasized that Pakistan, as a signatory to FCTC must ensure that the system remains under government control, preventing any industry-led manipulation. He warned that allowing tobacco industry to implement self-monitored systems would facilitate tax evasion and illicit trade.\nDr Sajid Amin Javed, Deputy Executive Director, SDPI, highlighted that while the Federal Board of Revenue (FBR) is considering reducing taxes on tobacco, health experts and think tanks advocate for increased taxation. He stressed that tobacco taxation should be seen as a public health policy, not a revenue-generation tool.\nHe called upon the FBR to formally document tobacco taxation as a tobacco control strategy, implement unified taxation across all tobacco products, and recognize that higher taxation effectively encourages people to quit smoking.\nAn a expert reiterated that tobacco taxation, like sugar-sweetened beverage taxes, is a public health initiative. He highlighted that the country has to bear Rs 770 billion annual economic burden due to smoking-related diseases, which is 1.2% of the GDP. With a threefold increase in the Federal Excise Duty on cigarettes in one year, there has been 19.2% decline in aggregate cigarette consumption, proving that higher taxes effectively reduce smoking rates, he said.\nDr Matiur Rehman, Head of Tobacco Control at the National Health Services Academy, pointed out that Pakistan, as a tobacco-producing country, needs a comprehensive strategy to support farmers in reducing tobacco cultivation. He emphasized the lack of coordination among ministries, with one ministry promoting tobacco production while others tax it.\nSyed Ali Wasif Naqvi, Head of the Centre for Health Policy and Innovation, made a demonstration as how this Tobacco Knowledge Hub would function, showcasing its capabilities as a repository of research, policy recommendations, and capacity-building resources for policymakers, researchers\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:43:41.650Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/self-monitoring-by-tobacco-industry-to-facilitate-tax-evasion-illicit-trade-warn-experts/",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T09:49:00.000Z"
}
