{
  "title": "Pakistan and Bangladesh call for increasing bilateral cooperation",
  "author": null,
  "content": "ISLAMABAD, March 15 (APP):  Pakistan and Bangladesh on Saturday called for increasing cooperation in the areas of trade, economy, culture, health, education, and people-to-people linkages for the mutual benefit of the two countries.\nThis was discussed during a meeting between President Syed Yousaf Raza Gilani and High Commissioner of Bangladesh to Pakistan Md. Iqbal Hussain Khan, who called on him, at Aiwan-e-Sadr, President Secretariat Press Wing said in a press release.\nDuring the meeting, it was emphasised to improve air linkages and shipping connections between Pakistan and Bangladesh to enhance bilateral trade as well as increase people-to-people linkages.\nPresident Gilani said that there was great potential to enhance education, health, agriculture and cultural cooperation between the two brotherly countries.\nHe called for making efforts to further increase people-to-people and cultural exchanges to bring the two countries closer.\nHe expressed satisfaction that an MoU on the supply of white rice from Pakistan to Bangladesh had been signed, which would help increase bilateral trade.\nThe president said that Pakistan greatly valued its relations with Bangladesh, which were based on common faith, shared history, and cultural similarities.\nHe said that the Chief Adviser of the Government of Bangladesh, Professor Muhammad Yunus, was widely respected in Pakistan for his path-breaking work in the field of micro-finance and social development.\nThe High Commissioner highlighted the potential of increasing relations in the area of health tourism.\nHe informed that Bangladeshi students were also interested in getting higher education from Pakistani universities.\nThe president assured the High Commissioner of his support and cooperation in further improving bilateral ties in all areas of mutual interest between the two brotherly countries.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:43:03.777Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-and-bangladesh-call-for-increasing-bilateral-cooperation/",
  "dateList": "2025-03-15",
  "date_published": "2025-03-15T11:47:00.000Z"
}
