{
  "title": "PM announces massive relief of upto Rs7.69 per unit for electricity consumers",
  "author": null,
  "content": "ISLAMABAD, Apr 3 (APP): Prime Minister Shehbaz Sharif on Thursday announced a significant reduction in the electricity prices of up to Rs 7.69 per unit for the consumers, pledging to provide further relief in near future through structural reforms in the power sector.\nThe prime minister, addressing a ceremony to unveil the package, said that the average per unit price for the domestic consumers had been brought down by Rs 7.41 and Rs 7.69 industrial sector.\n“In June 2024, the per unit price for industrial sector was Rs 58.5 which was first reduced by Rs 10.3 and further by Rs 7.69,” he added.\nThe prime minister pointed out that the government was taking structural reforms especially in power sector to ensure further relief for the consumers and overall development of the country.\n“This reduction will help industrialists to produce cheaper and more competitive products,” he added.\nHe noted that the common people had to suffer a lot in yhe the past due to high inflation rate and electricity bills. However, he assured that the government was taking further steps to provide maximum relief to them.\nHighlighting the structural reforms to be taken in power sector, the prime minister said the government will ensure halting power theft which was around Rs 600 billion per year. Similarly, he said by establishing open market, the electricity tariffs will be further decreased.\nHe said there was no option but to privatize or commercialize Power Distribution Companies (DISCOs) to reduce the burden of line losses and power theft on the national exchequer.\n“I have directed the team concerned to work diligently to implement reforms in the sector as soon as possible,” he added.\nAppreciating the task force formed to finalize power reforms, the prime minister said the force worked really hard and through their innovative thoughts, they brought different options and managed to convince the IMF to reduce the power tariffs.\n“We did not pass on the low international petroleum prices and retained the prices to ensure that the government will reduce the power tariffs to which IMF agreed in principle,” he added.\nHe said the trust with the IMF that was breached in 2020, was now being restored.\nSimilarly, he said the government successfully negotiated with the Independent Power Producers (IPPs), and praised the government team, led by Sardar Awais Ahmad Khan Leghari, for their commendable efforts.\n“After negotiation with the IPPs, our team managed to save Rs 3,696 billion that were to be paid to the IPPs,” he added.\nLikewise, he added that the government was also facing an immense challenge of circular debts of Rs 2,393 billion.\nHowever, he informed that the government had also made arrangements to gradually but permanently solve this problem within five years.\nHe also extended his gratitude to his leader and PML-N President Muhammad Nawaz Sharif and the allied political party leadership for their support and guidance in this regard.\nRecalling the time when he took over the charge of Prime Minister, Shehbaz Sharif said Pakistan was on the verge of being default at that time and the nation, especially business community was afraid about the future of the country.\nHe said the government even had to face difficulties to open LCs for importing petroleum products and other essential items. “We did not have resources to even run the power sectors as well.”\nThe elements who were responsible for all these wrongs, were exited to see Pakistan going to default and were claiming that no one could save Pakistan from being default now, he added.\nHe said such elements crossed all limits, and it was the same group that breached its own agreement with the International Monetary Fund (IMF).\nLater on, he said the same party also created hurdles in the way of the government’s negotiations with the IMF. “By doing this, they tried to save their own politics at the cost of the country’s interests,” he added.\n“This is the Almighty’s blessing Who accepted the government’s hard work and saved the country from default”.\nPM Shehbaz Sharif said Pakistan’s economy had now become stabilized and was moving towards sustainable growth and development.\nHe said during the process of macroeconomic stability, the Army Chief played key role whose support was worth appreciation.\nHe also acknowledged the sacrifices of the people who suffered a lot due to high inflation.\n“The country’s economy badly needed a surgical operation to get rid of all the issues responsible for the crisis in economic sector,” he added.\nHe said that Muhammad Nawaz Sharif, during election campaign had committed to bring the inflation rate that peaked at 38% down to single digit by 2026. “By the grace of Allah Almighty and due to the government team efforts, the inflation had now eased to as low as to around 1.5% even a year ahead.\nHe said that in one year, the government had also reduced the petroleum prices by Rs 38 to the lowest in the region.\nThe policy rate, he said that was 22.5%, had been lowered to 12% due to which the business community got immense relief.\nHe emphasized that right sizing and privatization of the government owned entities was the part of difficult decisions which had to be made now. “The government have to face a huge loss of Rs 800 billion due to the loss making SOEs.”\nHe said all the government efforts will go in vain if it did not take action to get rid of these huge losses.\nThe prime minister informed that this year, the government was going to collect taxes 35% more than the last year.\nEarlier, Minister for Power Division Sardar Awais Ahmad Khan Leghari said the prime minister was very enthusiastic to finalize the power package as soon as possible. “The prime minister kept issuing guidelines all the time and worked really hard in this regard,” he added.\nThe prime minister also gave away shields to Deputy Prime Minister Senator Ishaq Dar, Finance Minister Muhammad Aurangzeb, Power Minister Awais Leghari, Petroleum Minister Ali Pervaiz Malik, SAPM Muhammad Ali, Finance Secretary Imdadullah Bosal, Power Secretary Dr Fakhr e Alam Irfan, National Coordinator on Task Force on Energy Lt General Muhammad Zafar Iqbal and FBR Chairman Rashid Langrial.\nMembers of the federal cabinet, parliamentarians, business community members, and senior government officers also attended the ceremony.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:11:22.542Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-announces-massive-relief-of-upto-rs7-69-per-unit-for-electricity-consumers/",
  "dateList": "2025-04-03",
  "date_published": "2025-04-03T13:03:00.000Z"
}
