{
  "title": "FMs of Pakistan, Uzbekistan, Azerbaijan agree on enhancing ties",
  "link": "https://www.app.com.pk/national/fms-of-pakistan-uzbekistan-azerbaijan-agree-on-enhancing-ties/",
  "date_published": "2021-12-18T20:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 19 (APP): Minister for Foreign Affairs Shah Mahmood Qureshi Saturday held a meeting with Uzbekistan’s Minister for Transport Makhkamov Ilkhom and discussed bilateral relations, regional situation and matters of mutual interest.\nQureshi said the brotherly ties of Pakistan and Uzbekistan were based on similarities of history, religion and cultural affinities.\nHe said Pakistan wanted longstanding strategic ties with Uzbekistan.\nThe early implementation of the interim trade agreement between Pakistan and Uzbekistan will increase commerce between the two countries, he noted.\nHe underlined the need for the promotion of communication links between the two countries.\nThey agreed that direct flights between the capitals of the two countries would strengthen the existing ties.Pakistani Foreign Minister said Pakistan was looking forward to hosting the 48th meeting of the OIC Council of Foreign Ministers to be held in Pakistan in March, 2022.\nHe said it was the source of satisfaction that peace in Afghanistan was a reality after wars of 40 years in the country.\nHe said if the emerging humanitarian crisis was not averted in Afghanistan, it would have harmful consequences for the neighbouring countries, region and the world.\nHe thanked the OIC for its unwavering support of Pakistan on the issue of Kashmir.\nHe said OIC comprising 57 countries could play an effective role in the resolution of the Kashmir dispute according to the UN Security Council resolutions.\nThe minister said OIC was a strong voice of the Muslim Ummah and should play a vibrant role in tackling the challenge of Islamophobia, for maintaining peace and security and for resolution of longstanding disputes.\nMeanwhile Foreign Minister Qureshi also met with Azerbaijan’s Foreign Minister Jeyhun Bayramov and held talks on matters of bilateral and regional interest.\nQureshi said Pakistan and Azerbaijan enjoyed close fraternal ties and their relations were based on shared history, culture and civilization.\nHe said Pakistan was desirous of meaningful interaction with the countries of Central Asia.Pakistan was focused on enhancing political, trade, economic and defence ties with the Central Asian countries.\nHe said Pakistan always supported Azerbaijan on its principled position on the issue of Nagorno Karabakh.\nHe welcomed the formation of a joint chamber of commerce of the two countries.\nThe two leaders agreed on early negotiations for a bilateral preferential trade agreement.",
  "retrievedAt": "2025-08-11T21:44:08.674Z"
}
