{
  "article_id": "2025-06-27_f10d30170b9021afb6395b9c9bfda1e8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ethiopia-italy-discuss-cooperation-to-engage-pakistan-in-un-food-system-summit/",
    "retrieved_at": "2025-08-27T16:33:28.426Z"
  },
  "metadata": {
    "title": "Ethiopia, Italy discuss cooperation to engage Pakistan in UN food system summit",
    "author": null,
    "date_published": "2025-06-27T11:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 210,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 27 (APP):The Federal Democratic Republic of Ethiopia and the Republic of Italy have discussed cooperation to engage the leadership of Pakistan for the 2nd United Nations Food Systems Summit Stocktake (UNFSS+4), scheduled to take place in Addis Ababa, Ethiopia, from July 27-29. The discussion was held during a meeting between Dr. Jemal Beker Abdula, Special Envoy and Ambassador Extraordinary of Ethiopia, and Marilina Armellin, Ambassador of Italy in Pakistan, at the Italian Embassy Islamabad. Both Ambassadors emphasized their shared commitment to transforming food systems for enhanced food security worldwide and in their respective countries. Ambassador Dr. Jemal briefed the Italian Ambassador on the Ethiopian Embassy's efforts to engage the Government of Pakistan for participation of its leadership in UNFSS+4. The meeting highlighted the importance of international cooperation in addressing global food security challenges and promoting sustainable development. Ethiopia and Italy reaffirmed their commitment to strengthening bilateral and multilateral cooperation in areas such as trade, investment, food security, energy, and connectivity. The Italian Ambassador assured the Ethiopian Ambassador of her full support in contributing to the success of UNFSS+4. The meeting follows a similar discussion between Ambassador Dr. Jemal and the Resident Coordinator of the United Nations in Pakistan, Mohamed Yahya, on cooperation to engage Pakistan in the summit.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}