{
  "article_id": "2025-06-27_86e7667515fda02638074ec014501fb0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/sherry-expresses-profound-sorrow-over-tragic-incident-in-swat/",
    "retrieved_at": "2025-08-27T16:33:04.865Z"
  },
  "metadata": {
    "title": "Sherry expresses profound sorrow over tragic incident in Swat",
    "author": null,
    "date_published": "2025-06-27T13:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 503,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 27 (APP): Senator Sherry Rehman, Chairperson of Senate Standing Committee on Climate Change and Environmental Coordination, has expressed deep sorrow at the tragic loss of lives in the Swat River floods, where several people drowned after being swept away by surging waters. In a statement on Friday, she extended heartfelt condolences to the bereaved families and prayers for those still missing, while reminding the country that these events are no longer random or \"natural\" in origin. \"The tragic drowning of several people in the River Swat is not the result of a random 'natural disaster'. This is the deadly impact of super heavy monsoons in Swat, all triggered by climate stress. It is not just one area-Gilgit-Baltistan is struggling with snow melt blockages and GLOF events, and the rest of Pakistan, including Sindh, is grappling with sub-human temperatures like 50C,\" she stated. Senator Rehman noted that more than 70 people were trapped at seven different locations. So far, six dead bodies have been recovered and 52 people have been rescued. \"Many such hazards will occur for which we will not be prepared because we don't pay attention to climate stress as a systemic challenge that demands a collective and sustainable response. The sleepwalk continues,\" she warned. Referring to recent warnings, she pointed out: \"For Swat and the North, NDMA had issued a general warning just two days ago for the area, including high-risk weather alerts. While the district and provincial administrations did alert tourists, it also means that early warning systems are being ignored by the general public in KP. Because imposing Section 144 is no longer enough for the 21st century and its polycritical hazards.\" Senator Rehman called for a shift in both mindset and policy, \"We need to understand that such hazards are triggered by global warming and climate change, which directly impact the melting of glaciers in our northern areas as well as the changing weather systems and high heat that trigger intense flash monsoons. Our seas are warmer now, and they impact weather systems.\" She stressed that the language used to describe such tragedies must evolve, \"Please stop calling it a natural disaster or a random flash flood that is disconnected from human actions or responsibility.\" \"To sum it up,\" Senator Rehman said, \"everybody in the impacted district had prior warnings of extreme weather events and super monsoon flash floods. Several districts in the North remain on alert even now.\" She added everyone now should understand the human catastrophe associated with Pakistan being number ONE on the global Climate Risk Index for 2025. Yet climate stress is always an add-on issue in development policies, jargoned in to signal climate sensitivity. She also called on the media to play a stronger role, \"Media must question the root causes of such disasters. These are not just unfortunate accidents-they are connected to climate change, and we need to call them what they are.\" Senator Rehman concluded by calling for immediate, integrated, and inclusive climate action across all tiers of government.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}