{
  "article_id": "2025-06-27_a7fd90586ec64a624b7b9fb81dd9c34c",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-committee-for-full-refund-of-rs-36-bln-to-67000-hajj-pilgrims-by-aug-15-no-deductions-permitted/",
    "retrieved_at": "2025-08-27T16:32:15.313Z"
  },
  "metadata": {
    "title": "Senate committee for full refund of Rs 36 bln to 67,000 Hajj pilgrims by Aug 15; no deductions permitted",
    "author": null,
    "date_published": "2025-06-27T17:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 765,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, June 27 (APP): The Senate Sub-Committee on Religious Affairs and Interfaith Harmony, chaired by Senator Aon Abbas Buppi, on Friday directed the Ministry of Religious Affairs to ensure the full refund of over Rs 36 billion to more than 67,000 Pakistani pilgrims who were unable to perform Hajj this year due to administrative failures. The deadline for reimbursement has been set for August 15, 2025, with a clear directive that no deductions, whether for currency exchange, service charges, or administrative costs, will be allowed. The committee meeting, held at PIPS Hall in the Parliament Lodges, was attended by Senators Bushra Anjum Butt and Danesh Kumar, Federal Secretary for Religious Affairs Dr. Atta-ur-Rehman, Director General Hajj Abdul Wahab Soomro (joined from Saudi Arabia), and senior ministry officials. The session primarily addressed the grievances of thousands of pilgrims and scrutinized the mismanagement related to Mashaheer services. Senator Buppi expressed serious concern over the circumstances that prevented such a large number of Pakistani citizens from fulfilling their religious obligation. He sought detailed clarifications about the current status of funds held in Saudi Arabia and the mechanism for refunds from private Hajj operators. Secretary Dr Atta-ur-Rehman explained that Pakistan was allotted a Hajj quota of 179,210 for the 2024-25 season, including 90,830 slots designated for private operators. However, due to a revised Saudi policy requiring operators to field groups of 500-2,000 pilgrims, none of the 903 registered Pakistani operators individually met the criteria. Despite several communications, the Hajj Operators Association of Pakistan (HOAP) obtained a stay order from the Sindh High Court, later withdrawn on January 7, 2025, following Senate intervention. By that time, critical deadlines for payments had nearly passed. HOAP initially deposited 50 million Riyals with Pakistan's Hajj Mission. After the legal stay was lifted, the Ministry authorized daily remittances of up to $300,000 through the State Bank of Pakistan. HOAP then formed clusters, and 41 eligible operators were allowed to proceed with pilgrim services. However, by the February 14 cut-off, only 187 million Riyals had been deposited, well short of the required amount. Consequently, just 26,986 pilgrims out of over 90,000 registered had fully paid by the deadline, making them eligible. DG Hajj Abdul Wahab Soomro revealed that 667 million Riyals had been sent to Saudi Arabia, but 489 million Riyals (approximately Rs 36.43 billion) remain unutilized and held in Saudi accounts. He confirmed that Saudi authorities granted two extensions, on February 14 and February 20, but HOAP failed to meet both. Senator Danesh Kumar criticized the administrative lapses that led to the disenfranchisement of 67,000 pilgrims. Senator Bushra Anjum Butt condemned the absence of HOAP representatives, saying that their non-participation in such a critical meeting was unacceptable. She further highlighted the plight of overseas Pakistanis who traveled home based on false assurances of confirmed Hajj quotas. \"They faced immense financial and emotional hardship. This level of mismanagement has shaken public confidence in both private operators and official channels,\" she said. In response, Chairman Buppi directed the ministry to ensure full reimbursement of the Rs 36.43 billion by August 15 without deductions. He also instructed the ministry to submit a detailed list of all affected individuals and the amounts deposited, broken down by the 41 authorized operators. Additionally, he called for an aggressive awareness campaign regarding Saudi Hajj policies for the 2025-26 season, enabling prospective pilgrims to plan through legitimate and informed channels. The committee also reviewed issues surrounding Mashaheer services. DG Hajj informed the senators that companies are selected based on comparative bidding. However, Senator Buppi raised concerns regarding the evaluation criteria after reviewing a letter by former Federal Minister Chaudhry Salik Hussain. The letter questioned the transparency in awarding contracts for hotels, transport, catering, and Mashaheer services. DG Hajj explained that 14 companies were shortlisted, with the winning firm quoting a rate of 2,870 Riyals. However, Senator Buppi expressed alarm over how this company received a perfect score of 100/100, while the next contender received 98 points, with vague justifications such as \"weak presentation\" cited as cause for deductions, despite the winning firm having previously been flagged for concerns. As a result, Senator Buppi directed that the current DG Hajj and members of the Procurement Committee be barred from all future financial and contractual dealings. He emphasized the need for a technology-driven, transparent procurement mechanism with sealed bids and automated evaluation to eliminate human interference. The committee concluded by recommending the establishment of a high-level federal commission to audit and regulate private Hajj operators. The objective is to prevent such failures in future Hajj seasons and restore public trust in the pilgrimage system.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}