{
  "article_id": "2025-06-27_22443100700506f610a1e2a983b52c8b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-charts-a-digital-future-for-civil-registration-at-asia-pacific-crvs-summit/",
    "retrieved_at": "2025-08-27T16:33:04.925Z"
  },
  "metadata": {
    "title": "Pakistan Charts a Digital Future for Civil Registration at Asia-Pacific CRVS Summit",
    "author": null,
    "date_published": "2025-06-27T13:08:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 543,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 27 (APP): At the third Ministerial Conference on Civil Registration and Vital Statistics (CRVS) in Asia and the Pacific, held in Bangkok, Pakistan showcased its transformative journey toward building a comprehensive and digitized civil registration system. Represented by a high-level delegation led by Chairman NADRA and Registrar General Lt General Muhammad Munir Afsar, Pakistan presented its progress, innovations, and forward-looking vision for achieving universal civil registration by 2030 under the United Nations' \"Getting Everyone in the Picture\" initiative. The event, hosted by UNESCAP and supported by UNFPA along with other partners, brought together countries to review progress and set goals for achieving universal civil registration by 2030 under the \"Getting Everyone in the Picture\" initiative. The Pakistani delegation was led by the Chairman NADRA and Registrar General, Lt General Muhammad Munir Afsar, with coordination by the Ministry of Planning, Development and Special Initiatives. The team included senior officials from NADRA, the Ministry of Planning Development and Special Initiatives, the Ministry of Interior and Narcotics Control, and the Health Department of Sindh. During the conference, Pakistan shared its key achievements over the past decade. These included registration of more than 97 percent of the adult population through NADRA's biometric ID system. The delegation also explained how registration of birth, death, marriage, and divorce has been digitized in over 165 districts. Mobile teams are now actively reaching remote areas across Balochistan, Sindh, AJK, and Gilgit-Baltistan. Speakers emphasized that civil registration should not be viewed as mere paperwork. It plays a critical role in good governance, achieving development targets, and safeguarding citizens' rights. While Pakistan has made meaningful progress in updating systems and policies, the delegation highlighted the need for stronger coordination between federal and provincial institutions. Pakistan presented its CRVS Inception Plan along with a draft set of reforms. The plan includes implementation of model districts, digital registration systems, and improved links between hospitals, local councils, and NADRA. New tools for birth and death notification are already being used, backed by a national policy supporting biometric identification and registration systems. NADRA also highlighted its recent technology-driven initiatives. These include the introduction of a Digital ID and the Pak ID mobile app, which allows citizens to complete registration processes through their smartphones. This has made the system more user-friendly and accessible across Pakistan. Several challenges were acknowledged, including incomplete death registration and the lack of accurate cause-of-death data. In response to these ongoing hurdles, Pakistan welcomed the extension of the CRVS Decade to 2030, providing more time and support for continued improvement. The delegation also expressed appreciation for the technical and strategic support offered by UNFPA, UNICEF, and UNESCAP, which has played a key role in updating laws, training personnel, piloting digital tools, and strengthening data systems. Looking forward, Pakistan stressed the importance of creating a fully digital registration system. Such a system will also help support the country's move to a modern, register-based census. These efforts are tied to the broader 5Es Framework and the URAAN Pakistan program, both of which aim to improve the quality, accessibility, and efficiency of digital public services. Pakistan reaffirmed its commitment to ensuring that every citizen is counted and every life event is recorded. Civil registration is central to data accuracy, public dignity, and inclusive national development.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}