{
  "title": "Dr. Nishtar convenes consultation on upcoming One Window Ehsaas service",
  "link": "https://www.app.com.pk/national/dr-nishtar-convenes-consultation-on-upcoming-one-window-ehsaas-service/",
  "date_published": "2021-01-16T14:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 16 (APP): Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation, Dr. Sania Nishtar Saturday convened a consultative meeting at the Poverty Alleviation and Social Safety Division (PASSD) with all four executing agencies under the stewardship of Ehsaas to develop a collaborative perspective on standardized beneficiary targeting that is one of the components of One Window Ehsaas.\nAlong with Secretary PASSD, Mohammad Ali Shahzada, MD Pakistan Bait ul Mal, Aon Abbas Buppi, and CEO of PPAF, Qazi Azmat Isa attended the meeting.\nUnder the Ehsaas framework, social protection programmes are delivered through respective executing agencies and Ehsaas strategy stipulates that their impact can be maximized through integrated beneficiary service delivery.\nTo serve the purpose, the creation of the One Window Ehsaas for all social protection operations has been commenced that aims to assist beneficiaries of Ehsaas and reduce duplication and abuse.\nOverall, One Window Ehsaas envisages actions in five areas including creation of physical one-stop-shop centers, Ehsaas e-portal linking all Ehsaas services, Ehsaas Android app, Cognitive API Architecture approach and standardized beneficiary targeting.\n“In order to better identify and characterize Ehsaas beneficiaries, standardized beneficiary targeting is a point of convergence for all Ehsaas implementing agencies executing several social protection and poverty alleviation programmes”, said Dr. Nishtar.\nShe added, “Principally, standardized beneficiary targeting is critical for the implementation of Ehsaas One Window Policy and it will ensure policy coherence, while reducing fragmentation and duplication. It will also be linked with all social protection initiatives so that benefits accruing to a specific household through multiple programmes can be tracked.”\nThe meeting discussed that in order to ensure integrated beneficiary delivery service, a shift needs to be made for all socio-economic targeting to use Proxy Means Test.\nEhsaas is developing a new National Socioeconomic Registry (NSER) for improved beneficiary targeting. Once developed, it will underpin Ehsaas One Window operations with ease which will enable Ehsaas implementing agencies to access data from the survey database in real time and will enable them to ascertain eligibility of potential beneficiaries. Ehsaas NSER survey is currently in the field with the status of 63% completion and is expected to be digitally accomplished by June 2021.\nHouseholds in the end-to-end digital NSER are classified into five socioeconomic status welfare categories (SES 1-5) corresponding to the quintiles.\nWith the SES bands, different programs will be able to use the classification that best match their objectives as well as combine it with additional eligibility criteria.",
  "retrievedAt": "2025-08-11T20:14:48.973Z"
}
