{
  "title": "Govt taking measures to control inflation: Qureshi",
  "link": "https://www.app.com.pk/national/govt-taking-measures-to-control-inflation-qureshi/",
  "date_published": "2021-01-16T14:22:00.000Z",
  "source": "APP",
  "content": "MULTAN, Jan 16 (APP): Foreign Minister Makhdoom Shah Mahmood Hussain Qureshi Saturday said the government was taking different measures to control inflation.\nWhile talking to media persons here on Saturday, the foreign minister observed that some people wanted to become rich overnight and they resorted to hoarding and profiteering which caused inflation. He, however, added that the incumbent government was very much active against the hoarders and profiteers.\nResponding to a question about party funds, Qureshi remarked that Pakistan Tehreek-e-Insaf (PTI) had provided complete details of funding to Election Commission. PTI collected funds within ambit of law, he categorically stated.  Similarly, he said, PTI also managed audit of its accounts, on annual basis.\nQureshi said before holding protest, both Pakistan Peoples Party (PPP) and Pakistan Muslim League Nawaz (PML-N) should also provide details of their party funds to Election Commission by January 18.\nHe remarked that protest demonstration of PDM should be in democratic manner and the law should not be taken into hand.\nTo another question about Machh mishap, the foreign minister stated that some powers were working to weaken Pakistan, adding, India was trying to create unrest in Pakistan by fanning sectarianism. Pakistan exposed nefarious designs of India.\nQureshi said Prime Minister Imran Khan and Chief of Army Staff General Qamar Javed Bajwa met the heirs of the martyrs of Machh incident. Qureshi expressed the commitment that the government would bring the culprits to justice. Some people tried to play politics on this unfortunate incident, he regretted.\nThe foreign minister also expressed satisfaction on improvement of national economy. To a question, Qureshi stated that it was prime responsibility of the government to protect religious places of the minorities. He also stressed upon India to provide complete protection to Masajid.\nBritish parliamentarians made it clear that Jammu and Kashmir was not internal matter of India but a global dispute. India always tried to give impression that circumstances in Indian Illegally Occupied Jammu and Kashmir (IIOJK) were normal. The recent viewpoint of British Parliamentarians was success of Pakistan’s diplomatic approach, Qureshi stated.\nThousands of innocent Kashmiris were in jails, in IIOJK while Kashmiri youngsters were being martyred by the occupied forces.\nNow, the European Union Parliament was also raising voices on human rights violations in IIOJK, Qureshi said and added that similarly, Joe Biden administration was also concerned over the human rights violations.\nAbout PIA plane seized in Malaysia, he observed that the plane was on lease and there was a dispute between the national carrier and and the owner of Plane. However the diplomats in Malaysia assisted the stranded passengers, he maintained.",
  "retrievedAt": "2025-08-11T20:14:48.869Z"
}
