{
  "title": "Goswami’s chats expose fake Indian claims about Pulwama incident",
  "link": "https://www.app.com.pk/national/goswamis-chats-expose-fake-indian-claims-about-pulwama-incident/",
  "date_published": "2021-01-16T14:37:00.000Z",
  "source": "APP",
  "content": "The leaked WhatsApp chats of Arnab Goswami, an anchorperson of Indian Republic Tv, exposed the sinister designs hatched by Modi’s government to blame Pakistan for the false Pulwama attack, followed by a botched air strike on Balakot during 2019.\nAccording to Indian media, a 500-page document regarding chats of Arnab Goswami with Partho Dasgupta, the former chief executive officer (CEO) of Broadcast Audience Research Council (BARC), revealed damning information related to Goswami’s closer ties with Prime Minister Narendra Modi’s office and members of the ruling government.\nThese chats showed that Goswami had prior information about some of the sensitive events and details including the Balakot attack, three days before it happened.\nAlso Read: Indian media goes haywire with false claims on Balakot casualties\nAccording to Indian social media, these chats clearly indicated that Indian Prime Minister Narendra Modi plotted over deaths of Indian soldiers to get sympathy and public votes, for the 2019 elections.\nIn one of the chats of February 14, 2019, Goswami commented on the Pulwama attack, “This attack we have won like crazy.”\nHe bragged about the impacts of this attack raising the image of his supreme leader (Modi).\nThe message was sent on the same day when 40 CRPF personnel were killed after a convoy of security personnel on the Jammu Srinagar National Highway was attacked at Lethpora, Pulwama district in Illegally Indian Occupied Jammu and Kashmir.\nArnab Goswami, in his chats, also claimed that Modi’s government was about to take a big step against Pakistan, and it would be much bigger than any such attack before.\nGoswami had information about the Indian designs on February 23, 2019, and the infiltration attempt took place on February 26, in which Pakistan Air Force shot down the intruding Indian plane in a dog fight.\nThe leaked chats created a storm in India where many journalists, Tv anchorpersons, bloggers, and noted personalities bitterly criticized Modi’s government for staging false attacks on Indian soldiers and blaming Pakistan, merely for the sake of winning elections.\nIn their Twitter posts, they called it the level of nationalism of the Indian rulers and the inhuman acts of bigots.\nRahul Mukherji, an Indian researcher, on his Twitter handle posted, “There was never any doubt that Pulwama was an insider job. And now it’s proven.”\nHe said forty lives were lost ‘just to win an election’.\nAnother Indian Twitterati said, “It’s like our government is using our soldiers as their pawns to wing elections.”",
  "retrievedAt": "2025-08-11T20:14:48.905Z"
}
