{
  "title": "PML-N beneficiary of foreign funding, not PTI : Shehbaz Gill",
  "link": "https://www.app.com.pk/national/pml-n-beneficiary-of-foreign-funding-not-pti-shehbaz-gill/",
  "date_published": "2021-01-16T08:46:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jan 16 (APP): Special Assistant to Prime Minister (SAPM) on Political Communication Dr. Shehbaz Gill said that Pakistan Muslim League-Nawaz (PML-N) was beneficiary of foreign funding and it must account for the funds it received from abroad.\nAddressing a press conference at the Governor’s House here on Saturday, he said the opposition parties were recipients and distributors of unexplained amounts and the opposition leadership was morally and legally bound to explain this to the nation.\nSAPM Dr. Gill said Pakistan Tehreek e Insaaf (PTI) received some funding from expatriate Pakistanis in small amounts of 10, 20 and 100 dollars but the real beneficiaries of actual foreign funding were the opposition parties.\nHe said Maryam Nawaz and other corrupt politicians cannot dupe the public anymore, adding that they must account for the money transacted through fake accounts of “almost 15000 of their employees”.\nHe said since the Broadsheet verdict was written in English, PML-N leadership planned to “declare victory” to hoodwink public, forgetting the verdict could be translated into Urdu as well.\nShehbaz Gill said the government will officially write to U.K. based law-firm Broadsheet to collect all information about Nawaz Sharif’s assets from the company so that the looters in the garb of so-called leaders could be exposed before the masses fully.\nHe said he was amazed at the impudence and shamelessness of the convicted opposition leaders like Shehbaz Sharif and Maryam Nawaz who made victory signs while appearing in courts, adding that he personally felt embarrassed on being merely summoned by the honorable court in a case.\nShehbaz Gill said he had lodged forgery cases against the culprits because the company’s power of attorney holders were not authorized to transact any legal business, besides one of the complainants was abroad and his signatures were forged to lodge an FIR against him.\nTo a question, the SAPM said he was facing a trial for pointing out theft of public money in the Metro Bus project ,adding it was not something he did in his personal capacity. He said he would face the trial and vowed to expose those corrupt leaders who caused huge financial loss to the national exchequer.",
  "retrievedAt": "2025-08-11T20:14:51.134Z"
}
