{
  "article_id": "2025-07-16_26bb88e8916a321ce60a2634154ab992",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/fgrf-delivers-lifesaving-aid-to-gaza-palestinian-refugees-in-egypt/",
    "retrieved_at": "2025-08-27T09:40:54.136Z"
  },
  "metadata": {
    "title": "FGRF delivers lifesaving aid to Gaza, Palestinian refugees in Egypt",
    "author": null,
    "date_published": "2025-07-16T16:32:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 288,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, July 16 (APP): The Member of Dawate-e-Islami's Central Core Committee and Spokesperson, Maulana Abdul Habib Attari held a meeting with Ambassador of the State of Palestine to Pakistan, Dr. Zuhair Mohammad Hamdallah Zaid and briefed on the humanitarian relief operations carried out for the people of Gaza under the banner of Faizan Global Relief Foundation (FGRF). He informed the ambassador that FGRF - a welfare wing of Dawat-e-Islami - is actively involved in relief efforts on a daily basis to support the victims of the ongoing crisis in Gaza. Abdul Habib said FGRF has provided 6 million litres of clean drinking water, cooked meals for over 400,000 individuals, 100,000 kilograms of flour, monthly ration packs to over 75,000 people, tents for 400 displaced families, infant milk and diapers for 5,000 families, 1,000 mattresses and 5,000 hygiene kits, vegetable baskets and cash assistance to 5,000 families, and essential medicines and basic life necessities to 1,000 families. He said in addition to current relief work inside Gaza, FGRF is also providing assistance to Palestinian refugees who have fled to Egypt. Notably, FGRF has established a medical centre in Egypt to serve displaced Palestinians, particularly those who have lost family members during the war in Gaza. In collaboration with the Palestinian Embassy, FGRF recently distributed cash assistance among 500 families of war victims now residing in Egypt, he maintained. Ambassador Dr. Zuhair expressed deep gratitude to Dawat-e-Islami and FGRF for their unwavering commitment to humanitarian service, particularly for the oppressed people of Gaza. He also presented a shield of appreciation to Abdul Habib in recognition of their efforts. The meeting concluded with a prayer for the martyrs of Gaza and the planting of a commemorative tree for their eternal reward.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}