{
  "article_id": "2025-07-16_260ca82600e2be5a07cc09dc50c6c9e8",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/telenors-gaming-sim-celebrates-team-hotshot/",
    "retrieved_at": "2025-08-27T09:42:19.136Z"
  },
  "metadata": {
    "title": "Telenor’s gaming SIM celebrates team HOTSHOT",
    "author": null,
    "date_published": "2025-07-16T13:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 272,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 16 (APP):Telenor Pakistan celebrated the remarkable achievement of team HOTSHOT, winners of the Esports World Cup Pakistan Qualifiers, who are now representing the country at the prestigious Esports World Cup 2025 in Riyadh, Saudi Arabia. According to a news release, this milestone reflects a significant advancement for Pakistan's growing esports ecosystem and a proud moment for the nation's digital future. With a record-breaking prize pool of over USD 70 million, the Esports World Cup is one of the most prominent global competitive gaming events. Team HOTSHOT's qualification places Pakistan firmly on the international esports map and highlights the potential of the country's emerging gaming talent. In line with its mission to support evolving digital lifestyles, Telenor Pakistan previously partnered with Garena Free Fire to co-create the innovative 'Gaming Sim'-a first-of-its-kind solution designed to deliver a smooth and uninterrupted gaming experience for millions of Free Fire players across the country. This initiative reflects Telenor Pakistan's continued investment in youth-driven digital innovation and its commitment to empowering Pakistan's vibrant gaming community. \"The qualification of Team HOTSHOT eSports is a testament to the incredible potential within Pakistan's gaming community,\" said Waqas Aman Ullah, Chief Consumer Business Officer, Telenor Pakistan. \"Our focus remains on empowering the youth by giving them access to opportunities that were once out of reach. We believe this is just the beginning of Pakistan's rise in the global esports arena.\" As Team HOTSHOT prepares to compete on the world stage in Riyadh, Telenor Pakistan stands proudly behind their journey, reaffirming its role as a digital enabler committed to unlocking new opportunities at the intersection of technology, innovation, and youth empowerment",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}