{
  "title": "Mohsin Naqvi pays tribute to PAF hero Rashid Minhas",
  "author": null,
  "content": "ISLAMABAD, Aug 20 (APP):Federal Interior Minister Mohsin Naqvi on Wednesday paid rich tribute to Pakistan Air Force’s national hero and Nishan-e-Haider recipient Pilot Officer Rashid Minhas, calling him an eternal symbol of courage, patriotism, and sacrifice.\n“Pilot Officer Rashid Minhas is a timeless example of bravery, fearlessness, and love for Pakistan. By rendering an unforgettable sacrifice, he thwarted the nefarious designs of the enemy,” Naqvi said in his message.\nHe recalled how Minhas foiled a hijacking attempt by a traitor without caring for his own life, proving to the world that Pakistan’s skies would never fall prey to hostile plots. “The light of his patriotism continues to illuminate our hearts even today,” the minister remarked.\nNaqvi added that Rashid Minhas’s sacrifice proved that true heroism lies in putting one’s life at risk to safeguard the honor of the motherland. “He is a living example of that spirit,” he said.\nThe minister also praised the Pakistan Air Force for its continued professionalism and valor, noting that in the recent conflict, PAF falcons inflicted a humiliating defeat on the enemy by shooting down six of their fighter jets. “Through brilliant strategy and unmatched skill, the Air Force maintained its aerial supremacy — something the world has also recognized,” he observed.\nNaqvi stressed that every PAF officer is inspired by the extraordinary courage of Shaheed Rashid Minhas. “We are proud of our fearless falcons who, like Rashid Minhas, remain ever ready to defend Pakistan,” he said, adding that Minhas’s sacrifice was a “shining lamp” and a “beacon of inspiration for generations to come.”\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:36:33.690Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/mohsin-naqvi-pays-tribute-to-paf-hero-rashid-minhas/",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T08:30:00.000Z"
}
