{
  "title": "SC adjourns PTI founder’s bail petitions till tomorrow",
  "author": null,
  "content": "ISLAMABAD, Aug 20 (APP): The Supreme Court of Pakistan on Wednesday adjourned hearing till tomorrow on bail petitions of PTI founder.\nA three-member bench of the Supreme Court headed by the Chief Justice of Pakistan Justice Yahya Afridi and comprising Justice Muhammad Shafi Siddiqui and Justice Mian Gul Hassan Aurangzeb heard the case.\nDuring the hearing, the Chief Justice said that the court will not grant a long adjournment, but first the arguments of the prosecution will be heard. He said that the prosecution will have to explain how the Lahore High Court’s decision to deny bail can be upheld. They will have to cross this threshold.\nLawyer Salman Safdar requested the court to allow the family of the PTI founder to speak, who are present in the courtroom, but the Chief Justice rejected this request, saying that the court will only hear the lawyer, family members cannot be allowed to speak.\nThe assistant lawyer on the occasion informed the court that the special prosecutor of the case, Zulfiqar Naqvi, has suffered from food poisoning, due to which he is undergoing treatment in the hospital and could not appear in court today.\nThe assistant lawyer requested that the hearing of the case be postponed until next week, however, the Chief Justice remarked that the hearing is being held tomorrow and the situation will be viewed.\nPTI founder’s lawyer Salman Safdar, while giving arguments, said that the LHC  had rejected his client’s bail in November last year. The case remained pending in the High Court for 6 months where 16 hearings were held and during this time 8 different prosecutors were changed. The prosecution has been delaying the proceedings by repeatedly requesting adjournments.\nThe court later adjourned the case till tomorrow.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:35:23.255Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/sc-adjourns-pti-founders-bail-petitions-till-tomorrow/",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T15:09:00.000Z"
}
