{
  "title": "Rotary Int’l hails Pakistan’s progress in fight against Polio",
  "author": null,
  "content": "ISLAMABAD, Aug 20 (APP): Rotary International has praised Pakistan’s progress against polio and vowed to support the country until the disease is eradicated.\nA senior leadership delegation from Rotary International during a high-level visit to Pakistan, on Wednesday underscored the country’s central role in the global fight to eradicate polio.\nThe delegation members included Rotary International President Francesco Arezzo, Rotary Foundation Trustee Chair Holger Knaack, International PolioPlus Committee Chair Mike McGovern, and Aide to the President John de Giorgio. They were hosted by Pakistan’s National PolioPlus Committee Chair Aziz Memon.\nDuring their stay, the leaders held meetings with senior officials including Senator Ayesha Raza at the National Emergency Operations Centre (NEOC), and a session with the Federal Minister for Health Syed Mustafa Kamal.\nThe delegation also visited the Pakistan Polio Laboratory at the National Institute of Health and took part in child immunization activities.\nHighlighting Rotary’s role in the decades-long eradication campaign, officials noted that the organization has contributed US$2.9 billion globally and more than US$473 million to WHO and UNICEF for work in Pakistan.\nRotary is working alongside the Government of Pakistan and partners in the Global Polio Eradication Initiative — including WHO, UNICEF, CDC, the Bill & Melinda Gates Foundation, and Gavi, the Vaccine Alliance — to achieve a polio-free world.\nRotary International President Francesco Arezzo praised Pakistan’s progress, saying the country’s efforts were “a testament to the dedication of health workers and communities,” adding that Rotary would “stand alongside Pakistan until every child is protected.”\nTrustee Chair Holger Knaack emphasized the link between health and infrastructure, noting that Rotary’s investments in safe water and sanitation projects across Pakistan strengthened disease prevention efforts.\nInternational PolioPlus Committee Chair Mike McGovern commended the commitment of Pakistan’s vaccination teams, saying: “We are closer than ever to finishing the job, but we must keep up the momentum until we reach zero cases.”\nNational PolioPlus Committee Chair Aziz Memon said Pakistan had made “remarkable strides in reducing polio cases” and welcomed the support of Rotary’s global leadership and partner organizations.\nRotary International, a network of 1.2 million members in more than 45,000 clubs worldwide, continues to lead global polio eradication efforts while advancing humanitarian projects in health, education, and community development.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:35:01.372Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/rotary-intl-hails-pakistans-progress-in-fight-against-polio/",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T14:16:00.000Z"
}
