{
  "title": "NPC, IBCC hold career counseling session for journalists",
  "author": null,
  "content": "ISLAMABAD, Aug 20 (APP): The National Press Club (NPC), in collaboration with the Inter Board Coordination Commission (IBCC) Wednesday organized a career counseling session for journalists and their children, aimed at guiding them toward better educational and professional choices.\nThe event was attended by IBCC Executive Director Dr. Ghulam Ali Mallah as chief guest, along with educationists Dr. Ibrar Hussain Malik,  Chief Executive Officer (CEO) Edufocus Azam Habib, senior faculty member, International Islamic University Islamabad (IIUI), Dr Bashir and others.\nAmong the journalist community, the President of Pakistan Federal Union of Journalists  (PFUJ), Afzal Butt, NPC Secretary Nayyer Ali, Finance Secretary Waqar Abbasi and other governing body members were present, said a press release.\nDr. Mallah highlighted the importance of education for children who never went to schools.\n“There is a dire need to bring those children in schools, who are out of school for country’s bright future,” he said.\nHe focused the need for early career counseling, promotion of technical and vocational education and preparation for emerging fields such as Artificial Intelligence.\nHe also called for extra-curriculum activities for students, including sports activities and participation in volunteering work.\nEducation experts speaking at the session regretted that career counseling was largely neglected in Pakistan, emphasizing the students to adopt career of their interest, instead of choose under social or parental pressure.\nThey urged that parents should respect children’s interests and help them pursue careers that promise a brighter future.\nOther speakers focused on reforms in skill-based education and curriculum on urgent basis.\nThey also called for universities to introduce foreign exchange programs to expose students to international learning opportunities.\nThe session concluded with an interactive discussion between experts, journalists, and their children.\nNPC leaders thanked participants and announced that similar sessions would be held regularly.\nPFUJ President Afzal Butt also proposed a joint tree plantation campaign with Islamabad’s educational institutions to address environmental challenges, a proposal welcomed by education leaders.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-22T00:36:59.399Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/npc-ibcc-hold-career-counseling-session-for-journalists/",
  "dateList": "2025-08-20",
  "date_published": "2025-08-20T17:24:00.000Z"
}
