{
  "title": "Police constable shot dead in Karachi’s Manghopir - Pakistan - DAWN.COM",
  "author": null,
  "content": "A police constable was gunned down by unidentified assailants in Karachi’s Manghopir area, according to a statement issued by the police on Saturday.\n\n“Police Constable No- 28977 Imran (posted at PS Manghopir) was martyred by the firing of an unknown accused at Khairabad, Manghopir, shifted to hospital and further investigation is underway,” the statement said.\n\nThe police officer was killed near the Khairabad Aman roundabout, located in Orangi town in Manghopir West.\n\nSeven spent bullet casings were recovered from the scene of the crime.\n\nAccording to a separate statement issued by the District Police West, the slain officer was in uniform and was on duty at the Manghopir police station area. According to initial information, three unidentified suspects shot and killed the police officer after chasing him.\n\nThe superintendent of police Manghopir Division along with the station house officer had reached the spot, where further investigation is being conducted, the statement said.\n\nWest Deputy Inspector General of Police (DIG) Irfan Ali Baloch told Dawn.com that it appeared to be a targeted killing incident but the exact motive was being ascertained. He said the police had conducted raids against the criminals in the area and the killing might have been a reaction by local criminals.\n\nThe DIG ruled out the possibility of the involvement of banned outfits in the incident. He said the policeman met with his real estate agent and was leaving the latter’s office when he was targeted.\n\nLater, a militant group claimed responsibility through social media for the killing but DIG Baloch told Dawn.com that he did not think so. “I think it’s fake,” he said.\n\nCounter Terrorism Department official Raja Umer Khattab also said that it appeared to be fake as the proscribed Tehreen-i-Taliban Pakistan group had not issued any such claim from its social media platform. He also said that it looked to be a targeted killing incident.\n\nThe incident occurred during an enhanced police security situation in the vicinity due to the annual religious gathering of the Tableeghi Jamaat. Manghopir police Station House Officer Imran Ahmed Khan said the victim was posted to ensure the security of the gathering.\n\nOn February 1, a police inspector was shot at and wounded in the Site area. The 47-year-old officer was shot near Naurus Chowrangi.\n\nIn a separate incident in Steel Town on Feb 9, a policeman was shot dead while his wife was injured over some personal enmity, police had claimed.\n\nIn June last year, a policeman was shot dead and three others were wounded in what investigators described as a targeted attack near Patel Para.\n\nJamshed Quarters SHO Imtiaz Husain Shah had said that Head Constable Qamar Zaman, 45, along with three others, was sitting at an eatery in Patel Para when assailants astride a motorcycle came up, fired shots and rode away.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:38:25.663Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892136/police-constable-shot-dead-in-karachis-manghopir",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T09:38:16.000Z"
}
