{
  "title": "Nearly 10,000 fired as Trump, Musk step up assault on US agencies - World - DAWN.COM",
  "author": null,
  "content": "The campaign by President Donald Trump and his adviser Elon Musk to radically cut back the US bureaucracy spread on Friday, firing more than 9,500 workers who handled everything from managing federal lands to caring for military veterans.\n\nWorkers at the departments of Interior, Energy, Veterans Affairs, Agriculture and Health and Human Services had their employment terminated in a drive that so far has largely — but not exclusively — targeted probationary employees in their first year on the job who have fewer employment protections.\n\nThe firings, reported by Reuters and other major US media outlets, are in addition to the roughly 75,000 workers who have taken a buyout that Trump and Musk have offered to get them to leave voluntarily, according to the White House. That equals about 3 per cent of the 2.3 million person civilian workforce.\n\nTrump says the federal government is too bloated and too much money is lost to waste and fraud. The government has some $36 trillion in debt and ran a $1.8 trillion deficit last year, and there is bipartisan agreement on the need for reform.\n\nBut congressional Democrats say Trump is encroaching on the legislature’s constitutional authority over federal spending, even as his fellow Republicans who control majorities in both chambers of Congress have largely supported the moves.\n\nThe speed and breadth of Musk’s effort has produced growing frustration among some of Trump’s aides over a lack of coordination, including White House Chief of Staff Susie Wiles, sources told Reuters.\n\nIn addition to the job reductions, Trump and Musk have tried to gut civil-service protections for career employees, frozen most US foreign aid and attempted to shutter some government agencies such as the US Agency for International Development and the Consumer Financial Protection Bureau CFPB almost entirely.\n\nAlmost half of the probationary workers at the US Centers for Disease Control and Prevention and others at the National Institutes of Health are being forced out, sources familiar with the job cuts told Reuters.\n\nThe US Forest Service is firing around 3,400 recent hires, while the National Park Service is terminating about 1,000, people familiar with the plans said on Friday.\n\nThe tax-collecting Internal Revenue Service is preparing to fire thousands of workers next week, two people familiar with the matter said, a move that could squeeze resources ahead of Americans’ April 15 deadline to file income taxes.\n\nOther spending cuts have raised concerns that vital services were in danger. A month after wildfires devastated Los Angeles, federal programs have stopped hiring seasonal firefighters and halted removal of fire hazards such as dead wood from forests, according to organisations impacted by the reductions.\n\nCritics have questioned the blunt force approach of Musk, the world’s richest person, who has amassed extraordinary influence in Trump’s presidency.\n\nTreasury Secretary Scott Bessent on Friday shrugged off those concerns, comparing Musk’s so-called Department of Government Efficiency to a financial audit.\n\n“These are serious people, and they’re going from agency to agency, doing an audit, looking for best practices,” he told Fox Business Network.\n\nMusk is relying on a coterie of young engineers with little government experience to manage his DOGE campaign, and their early cuts appear to be driven more by ideology than driving down costs, budget experts say.\n\nFired federal workers expressed shock.\n\n“I’ve done a lot for my country and as a veteran who served his country, I feel like I’ve been betrayed by my country,” said Nick Gioia, who served in the army and worked for the Department of Defense for a total of 17 years before joining the USDA’s Economic Research Service in December only to be fired late Thursday.\n\n“I don’t feel like this has anything to do with federal workers, I feel like this is just a game,” said Gioia, who lives in Elizabethtown, Kentucky, and has a child with epilepsy. “To sit here and watch people like Mr. Musk tweet out how he feels like he’s doing a great job, he doesn’t realise what he’s doing to people’s lives.”\n\nSteve Lenkart, executive director of the National Federation of Federal Employees union, which represents more than 100,000 workers, said he expects Musk, whose SpaceX businesses has major contracts with the US federal government, and the Trump administration to concentrate on agencies that regulate industry and finance.\n\n“That’s really what this whole thing is really all about,” Lenkart said. “It’s getting government out of the way of industry and incredibly rich people, which is why Elon Musk is so excited about this.”\n\nSome attempts to fire government employees have been impeded by federal judges or second thoughts.\n\nAbout 1,200 to 2,000 workers at the Department of Energy were laid off, including 325 from the National Nuclear Security Administration, which oversees the nuclear stockpile, sources familiar with the matter told Reuters on Friday.\n\nBut those layoffs at have been “partly rescinded” to retain essential nuclear security workers, one of the sources said. It was unclear how many of the 325 firings were pulled back.\n\nThe administration has temporarily agreed not to fire any more staff at the US Consumer Financial Protection Bureau, according to a court order issued on Friday, offering workers there an 11th-hour reprieve ahead of feared mass layoffs.\n\nUnions representing federal workers have sued to block the buyout plan.\n\nThree federal judges overseeing privacy cases against DOGE heard cases on Friday whether Musk’s team should have access to Treasury Department payment systems and potentially sensitive data at US health, consumer protection and labor agencies.\n\nIn one of those, a federal judge in New York extended a temporary restraining order blocking DOGE from accessing Treasury Department systems. That order had been in place since Saturday.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/151138256338b4f.jpg",
  "retrievedAt": "2025-08-25T19:38:27.123Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892119/nearly-10000-fired-as-trump-musk-step-up-assault-on-us-agencies",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T06:43:08.000Z"
}
