{
  "title": "Imran’s letter an ‘extreme supplication’: Punjab Assembly speaker - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: Punjab Assembly Speaker Malik Muhammad Ahmed Khan has said the letter written by PTI founder Imran Khan to the army chief represents the height of supplication, emphasising that, in local terms, it conveys an extreme plea for reconciliation.\n\nReferring to the army chief’s response to a query about the letter, the Punjab Assembly speaker said a detailed reply had come from the intended recipient. Speaking to journalists at the assembly premises on Friday, he said the COAS made it clear that he would not read the letter even if received and would instead forward it to the prime minister.\n\n“If the recipient does not read the letter, then the prime minister will not read it either,” said Malik Muhammad, who had served as Shehbaz Sharif’s adviser in his previous 16-month term as prime minister.\n\nReferring to the letter sent to the IMF by PTI secretary general Omar Ayub Khan, he said it was linked to earlier communiqués from when the PTI was in power in the provinces, rec­­a­lling that former finance minister Shaukat Tareen had actively sought to push the country tow­ards default by urging the global lending agency not to grant Pakistan a loan.\n\nOpposition leader calls letter to army chief ‘true reflection of society’\n\n“The PTI’s only agenda seems to be driving the country into default on its foreign payment commitments. It aims to create political and economic instability and sow division within the judiciary.”\n\nThe speaker regretted that the judiciary had removed a former prime minister using Article 184(3), likening it to the repealed Article 58-2(b), which had previously plunged the country into political and economic instability. Praising the current parliament for objecting to certain remarks made by a judge against it, he said that whenever a dictator distorts the Constitution, the Supreme Court provides it with legal cover.\n\n‘True representation of society’\n\nMeanwhile, terming Imran Khan’s third letter to the army chief a true representation of society, Leader of the Opposition in the Pun­jab Assembly Malik Ahmad Khan Bhachar said that the establishment’s wrong policies have ruptured the harmony between Pakistan Army and the masses.\n\nRefuting the propaganda that Imran Khan was attempting to meet the army chief through letters, he said the incarcerated former prime minister was trying to awaken the nation and address the misalignment of the country’s priorities.\n\nMr Bhachar said the establishment imposed the ‘rejected figures’ to rule the nation through rigged election results, damaging the country’s interests. He emphasised that a non-representative government cannot bring about reforms in the state structure for the well-being of the people.\n\nHe added that the PTI founder had exposed the ‘dons’ of the country, chosen by the establishment to rule the nation, and that the NAB amendments forced the country to bear a loss of Rs1100 billion.\n\n“Democracy has been eroded from the country as it flourishes on fair play and civility,” he said, adding that the PATTAN report identified 64 additional tactics used to rig the Feb 8, 2023 elections.\n\nThe opposition leader also accused the establishment of snatching PTI’s election symbol through former Supreme Court chief justice Qazi Faez Isa and using the Punjab police to harass party leaders, candidates and workers.\n\nHe said Imran Khan was rightly concerned that this “non-representative government” had unleashed torture on unarmed, innocent workers on May 9, 2023, and Nov 26 last year.\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:38:57.064Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892075/imrans-letter-an-extreme-supplication-punjab-assembly-speaker",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:27.000Z"
}
