{
  "title": "Domestic debt up by Rs2.5tr in six months - Business - DAWN.COM",
  "author": null,
  "content": "KARACHI: The federal government’s domestic debt surged by Rs2.5 trillion in the first half of the current fiscal year despite significant support from the State Bank of Pakistan (SBP) in substantial profits.\n\nThe data issued by the SBP on Friday showed that the government’s domestic debt rose to Rs50.193tr at the end of Dec 2024 from Rs47.724tr on June 30, 2024.\n\nWhat is more concerning is that the debt increased despite Rs2.7tr provided by the State Bank as profit, and the government started turning down bids for treasury bills in subsequent auctions as the inflow was enough to avoid borrowing bank money.\n\nHowever, the data showed that government borrowing had increased much more than estimated earlier to meet its growing spending requirements. Still, the supply of enormous liquidity had created space to trim borrowing. The data shows the government spent more than the targets, and the revenue collection remained short of the projections.\n\nGovt continues borrowing despite supply of Rs2.7tr by SBP\n\nAt the same time, it was also noted that the government raised long-term debt during 1HFY25. The borrowing through the auctions of Pakistan Investment Bonds increased by Rs3.2tr to Rs31.216tr at the end of Dec 2024 from Rs28.025tr in June 2024.\n\nThe government likes to increase long-term debt to avoid frequent payments, while the banks are investing for longer tenors due to falling interest rates.\n\nDue to the sharp deceleration in inflation, the SBP slashed its policy rate by 900bps to 13pc during the first half of 2024-25. It further reduced the rate by another 100bps to 12pc in January.\n\nThe situation was more visible when borrowing through short-term treasury bills was explored. The T-bills debt in June 2024 was Rs10.167tr, which fell to Rs8.602tr, a decline of Rs1.565tr or 18pc during the 6 months.\n\nThe debt raised through bonds collectively increased by Rs4.2tr as the government also raised about Rs1tr through Islamic Bonds, Ijara Sukuk. The amount raised through Sukuk increased to Rs5.7tr by the end of December from Rs4.7tr in June 2024.\n\nThe central government’s total debt increased to Rs71.647tr during 1HFY25 from Rs68.914tr on June 30, 2024. It included external debt, which slightly rose to Rs21.764tr from Rs21.754tr.\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:27:30.531Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892064/domestic-debt-up-by-rs25tr-in-six-months",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:34.000Z"
}
