{
  "title": "Call for ending graft to attract investment - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A visiting IMF mission on Friday called on the president of the Supreme Court Bar Association (SCBA) and chairman of the Pakistan Bar Council’s (PBC) special committee on judicial reforms, and discussed with them a wide range of topics with primary focus on eradicating corrupt practices to create an inclusive environment for attracting foreign investment to Pakistan.\n\nThe meeting between the IMF’s Governance and Corruption Diagnostic Assessment team and SCBA President Mian Muhammad Rauf Atta and PBC committee’s chairman Hassan Raza Pasha lasted over an hour.\n\nAccording to an SCBA announcement, Mr Atta spoke about shortcomings in the judicial system such as the backlog of cases in lower and district courts, the insufficient number of judges, inefficiencies within departments, and potential measures like Altern­ative Dispute Resolution (ADR) system to alleviate the burden on courts and enhance public access to justice.\n\nVarious strategies were discussed to combat corruption in government departments, promote good governance, and implement legal reforms that would benefit the judicial hierarchy, it said, terming the proposed strategies essential for fostering a stronger and more vibrant economy as well as an efficient judicial system.\n\nSCBA, PBC panel’s heads discuss host of issues with IMF team\n\nThe SCBA president emphasised the need for measures to eradicating financial crimes to boost the economy. He noted that a system of punishment and reward was alre­ady in place within the judiciary, where the Supreme Judicial Cou­ncil (SJC)addresses complaints against the judges of higher judiciary while respective high courts handle issues related to district judges.\n\nMr Atta cited the example of a Supreme Court judge who was removed over a complaint filed with the SJC last year.\n\nHe described the rule of law as the cornerstone of a democratic soc­i­ety and reaffirmed his commitment to uphold it, along with the SCBA’s dedication to the Constitution, the supremacy of institutions, and the independence of judiciary.\n\nThe meeting concluded with both sides expressing gratitude and a desire for more such meetings in the future.\n\nSCBA’s Additional Secretary Mohammad Aurangzeb Khan and Balochistan High Court Bar Assoc­i­ation President Mir Attaullah Lan­gove also attended the meeting.\n\nThe discussion also revolved around legal matters and backlog of cases in superior courts and the implementation of legal reforms for an efficient working of the judicial system.\n\nThe IMF mission expressed its concerns that business matters, particularly relating to investments, remain pending for a long time as decisions are not made timely, which ultimately affects the country’s economy.\n\nMr Pasha informed the visiting team that cases, including the business matters, would be resolved thr­o­ugh mediation and ADR, under which the parties may resolve their matters without delay.\n\nBoth the government and superior courts had supported it, he said and expressed the hope that it would improve the efficiency of courts, reduce the backlog of cases and help the economy to grow.\n\nThe PBC committee’s president suggested that the strength of judges at the lower judiciary should be enhanced to finish the backlog of cases.\n\nMr Pasha urged the IMF officials to soften the conditions imposed upon Pakistan under which the government has imposed heavy taxes so that the latter could reduce the taxes for the ultimate benefit of people. Due to heavy taxes, he added, the common man is facing difficulties in the shape of price hike.\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:38:27.406Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892076",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:27.000Z"
}
