{
  "title": "New Zealand make Pakistan pay for missed chances to claim tri-series title - Sport - DAWN.COM",
  "author": null,
  "content": "KARACHI: Naseem Shah’s return to bounce out Devon Conway halfway through the New Zealand innings had charged the atmosphere. The crowd had erupted into a deafening roar and Babar Azam, positioned at mid-off, was signaling towards the stands for more.\n\nOn a breezy Friday evening at the National Bank Stadium, Naseem was steaming in on each delivery and extending his follow through nearer to the batter each time with the tri-nations series final between Pakistan and New Zealand firmly in the balance.\n\nThe hosts, who had come into the match on the back of their highest-ever chase in history, had batted first this time but had only 242 runs to defend, albeit on a less batting friendly wicket. After Conway’s dismissal for a 74-ball 48, New Zealand needed 130 runs to win in 25 overs.\n\nPakistan had hope. But a range of blunders — two dropped catches and a missed review — turned the game completely in New Zealand’s favour, before they sealed the tri-nation series title with a comprehensive five-wicket win.\n\nWhile the result reinforced New Zealand as favourites for the upcoming ICC Champions Trophy, it raised questions over Pakistan’s preparedness for the eight-team tournament that starts with the fixture between the very two sides at the same venue in five days’ time.\n\nTo start with Pakistan captain Mohammad Rizwan turned down Abrar Ahmed’s request to go for a review after he had hit Tom Latham on his pads in the 31s over, with replays later showing it would have been out.\n\nLatham was let off the hook once again when Shaheen Shah Afridi dropped a straightforward catch in his follow-through. The left-hander was handed yet another reprieve when he was dropped by Saud Shakeel off Abrar as Pakistan’s hopes as well as the crowd’s cheers faded.\n\nWhile luck favoured Latham, it wasn’t the same for his partner Daryl Mitchell, who had scored 57 off 58, as the right-hander fell prey to Abrar’s one-handed catch off his own bowling in the 39th over.\n\nBut by that point, with 48 needed off 66, all New Zealand needed was a finishing job. Although Latham (56 off 64) didn’t stay until the end, and it was executed with ease, thanks to Glenn Phillips’ unbeaten 20 off 17.\n\nPakistan elected to bat on a sunny afternoon and once again had to rely on Rizwan and Salman Ali Agha as the top-order and lower middle-order struggled against a disciplined New Zealand bowling attack.\n\nPacer Will O’Rourke was the standout bowler for his side with 4-43 while New Zealand captain Mitchell Santner’s cast a web of spin around the Pakistan batters to finish with figures of 2-20 in his 10 overs.\n\nPakistan suffered an early setback when O’Rourke dismissed Fakhar Zaman in the fourth over, caught by Will Young at square leg.\n\nIn the next over, Jacob Duffy’s no-ball gave Babar a chance to break the shackles, and he responded with a pulled six over midwicket.\n\nTwo overs later, a signature cover drive off Duffy took Babar to 6000 ODI runs, making him the joint-fastest to the milestone (123 innings) alongside Hashim Amla.\n\nJust as Babar seemed to be settling in, he gave his wicket away, driving straight to Nathan Smith in the 12th over. Saud fell when a quicker off-break from Michael Bracewell skidded low and crashed into his stumps.\n\nRizwan and Salman steadied the inn­ings, reaching 78-3 by the 20th over. Rizwan got going with a pull shot off Smith, while Salman took 15 balls to get his first boundary, lofting Phillips over covers.\n\nThe pair accelerated three overs later, with Rizwan driving Phillips for four before Salman launched him for six over long-off. Another boundary from Rizwan brought up the 50-run partnership as Pakistan crossed 100.\n\nThe stand ended in the 32nd over when Rizwan dragged O’Rourke onto his stumps for 46 off 76 (four fours, one six). Salman followed soon after, caught at short third-man off Bracewell for 45 off 65 (one four, one six).\n\nWith Pakistan 161-5 at Salman’s dismissal in the 37th over, Tayyab Tahir injected urgency, hitting Duffy for a straight six and a scoop for four in the 40th over.\n\nHe continued the attack against Bracewell but perished for 38 off 33, pulling Duffy to Kane Williamson at short midwicket in the 42nd.\n\nKhushdil Shah and Shaheen fell cheaply, leaving Pakistan at 202-8, with a 39-run stand between Faheem Ashraf (22 off 21) and Naseem (19 off 17) giving them some hope.\n\nDespite losing Will Young early to Naseem, New Zealand got to 45-1 by the end of the first 10 overs, with first drop Kane Williamson ensuring the innings stayed stable.\n\nAfter announcing his arrival with a pull for six off medium pacer Faheem, Williamson brought up his fifty partnership with opener Conway as he charged down to hit off-spinner Salman Ali Agha over mid-off for four in the 14th over.\n\nConway followed that up with two more boundaries, but when the pair had started looking dangerous, Salman struck.\n\nThe spinner lured Williamson (34 off 39, three fours and a six) with his flight to charge again, but this time only to be bowled through the gate in the 18th over.\n\nNaseem then got Conway and Pakistan looked to have gained a foothold in the game, only to let it slip away.\n\nSCOREBOARD\n\nPAKISTAN:\n\nFakhar Zaman c Young b O’Rourke 10\n\nBabar Azam c&b Smith 29\n\nSaud Shakeel b Bracewell 8\n\nMohammad Rizwan b O’Rourke 46\n\nSalman Ali Agha c Duffy b Bracewell 45\n\nTayyab Tahir c Williamson b Duffy 38\n\nKhushdil Shah c Phillips b Santner 7\n\nFaheem Ashraf c Santner b O’Rourke 22\n\nShaheen Shah Afridi c Young b Santner 1\n\nNaseem Shah c Bracewell b O’Rourke 19\n\nAbrar Ahmed not out 1\n\nEXTRAS (B-1, LB-5, NB-1, W-9) 16\n\nTOTAL (all out, 49.3 overs) 242\n\nFALL OF WICKETS: 1-16 (Fakhar), 2-46 (Saud), 3-54 (Babar), 4-142 (Rizwan), 5-161 (Salman), 6-195 (Tayyab), 7-200 (Naseem), 8-202 (Shaheen), 9-241 (Faheem)\n\nBOWLING: Duffy 7-0-48-1 (1w, 1nb), O’Rourke 9.3-0-43-4 (4w), Bracewell 10-1-38-2 (2w), Smith 7-0-46-1, Santner 10-1-20-2, Phillips 6-0-41-0 (2w)\n\nNEW ZEALAND:\n\nW. Young lbw Naseem 5\n\nD. Conway c Abrar b Naseem 48\n\nK. Williamson b Salman 34\n\nD. Mitchell c&b Abrar 57\n\nT. Latham c Abrar b Shaheen 56\n\nG. Phillips not out 20\n\nM. Bracewell not out 2\n\nEXTRAS (B-1, LB-4, W-16) 21\n\nTOTAL (for five wickets, 45.2 overs) 243\n\nFALL OF WICKETS: 1-5 (Young), 2-76 (Williamson), 3-108 (Conway), 4-195 (Mitchell), 5-232 (Latham)\n\nDID NOT BAT: M. Santner, N. Smith, J. Duffy, W. O’Rourke\n\nBOWLING: Shaheen 9-0-45-1 (1w), Naseem 8-0-43-2 (4w), Faheem 2.2-0-16-0 (1w), Abrar 10-0-67-1 (2w), Salman 10-0-45-1 (3w), Khushdil 6-0-22-0 (1w)\n\nRESULT: New Zealand won by five wickets.\n\nPLAYER-OF-THE-MATCH: Will O’Rourke\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67afc56db2768.gif",
  "retrievedAt": "2025-08-25T19:38:42.803Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892036/new-zealand-make-pakistan-pay-for-missed-chances-to-claim-tri-series-title",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:40.000Z"
}
