{
  "title": "Govt blocks Peca resolution amid nationwide protests by journalists - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Law minister uses quorum tactic to stall PTI-proposed resolution\n• Aon Buppi says govt panicked due to opposition’s numerical advantage\n• PFUJ protests against Peca tweaks, threatens indefinite sit-in outside parliament, forms committee to conduct clause-by-clause review of amended law\n\nISLAMABAD: The government successfully blocked a resolution against the Prevention of Electronic Crimes Act (Peca) 2025 amendments in the Senate on Friday by pointing out the quorum at the last moment.\n\nSenator Aon Abbas Buppi had tabled the resolution opposing Peca amendments, urging the government to review the law and remove provisions that contradict fundamental human rights. However, just before the resolution could be debated, Law Minister Azam Nazeer Tarar drew the attention of the chair to the lack of quorum in the House.\n\nResponding to the minister’s request, Acting Chairperson Senator Sherry Rehman ordered a headcount and later adjourned the session upon confirming that the quorum was incomplete.\n\nThe resolution called for the government to engage journalists’ unions, media organisations and relevant stakeholders in the amendment process to ensure a balanced, fair and democratic legal framework.\n\n“The House calls upon the government to immediately amend Peca 2025 to align it with constitutional rights and international standards, ensuring a balanced approach between digital governance and press freedom in Pakistan,” the resolution stated.\n\nFollowing the adjournment, a delegation of opposition senators, led by Leader of the Opposition Shibli Faraz, visited the Media Press Gallery in Parliament. Other members included Senators Barrister Ali Zafar, Aon Abbas Buppi, Alama Raja Nasir Abbas, Falak Naz Chitrali, Saifullah Niazi, Gurdeep Singh and Humayun Mohmand.\n\nThe delegation met representatives of the Parliamentary Reporters Association and expressed solidarity with the media, assuring them that Pakistan Tehreek-i-Insaf would play an active role in every parliamentary forum to restore democracy, the rule of law and freedom of expression.\n\nDuring the visit, Senator Ali Zafar read out the full text of the resolution, while Senator Aon Abbas Buppi insisted that the opposition had a numerical advantage in the House, which led the government “to panic” and raise the quorum issue.\n\nMr Buppi stressed that if the resolution had been tabled, it would have been passed by a majority. He announced that the resolution would be presented again in the next Senate session scheduled for Monday.\n\nJournalists’ rallies\n\nMeanwhile, the Pakistan Federal Union of Journalists (PFUJ) staged rallies across the country on Friday, protesting against the Peca amendments.\n\nIn Islamabad, a rally marched from the National Press Club to the entrance of the Red Zone, where PFUJ leaders addressed demonstrators.\n\nSpeaking at the protest, PFUJ and Rawalpindi-Islamabad Union of Journalists (RIUJ) leaders warned authorities that journalists would breach all barriers and march to parliament if a sit-in was announced.\n\nThe rallies marked the conclusion of the third phase of PFUJ’s protest campaign against the Peca amendments. Addressing the gathering, PFUJ President Afzal Butt declared that the three-day token hunger strike was a final warning to the government.\n\n“Our next step is an indefinite sit-in outside parliament. But I warn the government — do not force us into this because when we come, your rule might end,” he said.\n\nAs announced earlier, the PFUJ started a mass contact drive by inviting civil society and trade unions to the sit-in being held opposite parliament.\n\nAt the hunger strike camp, veteran journalist Nasir Zaidi, who was among those flogged during Gen Zia’s martial law, denounced the government’s attempts to curtail media freedom.\n\nHe recalled that the previous PTI-led government tried to suppress the press through Pakistan Media Development Authority, but they failed. “This government is (also) trying to please the establishment — but I tell you that they will fall victim to this draconian law,” Mr Zaidi added.\n\nPFUJ forms committee\n\nLater, the PFUJ constituted a seven-member committee to conduct a clause-by-clause review of Peca 2025 and draft proposed amendments.\n\nThe committee members include Mubarak Zeb Khan, Matiullah Jan, Nayer Ali, Myra Imran, Shehryar Khan, Sehrish Qureshi, and M.B. Somroo.\n\nThe committee will also engage with civil society representatives, legal experts, press freedom advocates and human rights organisations to ensure a comprehensive and inclusive review process.\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67afe166591b0.gif",
  "retrievedAt": "2025-08-25T19:38:57.048Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892078/govt-blocks-peca-resolution-amid-nationwide-protests-by-journalists",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:27.000Z"
}
