{
  "title": "Four army personnel martyred, 15 terrorists killed in KP operations: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Four soldiers were martyred while 15 terrorists were killed in two separate intelligence-based operations (IBOs) carried out in Khyber Pakhtunkhwa on Saturday, according to the military’s media wing.\n\nPakistan has recently witnessed an uptick in terror activities, especially in KP and Balochistan. Terror attacks have increased since the banned Tehreek-i-Taliban Pakistan (TTP) broke a fragile ceasefire agreement with the government in 2022.\n\nA statement from the the Inter-Services Public Relations (ISPR) said the first IBO took place in Dera Ismail Khan district’s general area of Hathala on the reported presence of terrorists in the area.\n\nIt said security forces effectively engaged the terrorists at their location and resultantly, nine of them, including high-value target ringleaders Farman alias Saqib, Kharji Amanullah alias Toori, Kharji Saeed alias Liaqat and Kharji Bilal, “were sent to hell”.\n\nThe ISPR said the slain were involved in numerous terrorist activities in the area and were highly wanted by law enforcement agencies.\n\nIt said the second IBO was conducted in the general area of Miranshah in North Waziristan district where six more terrorists were “effectively neutralised by the security forces”.\n\n“However, during an intense fire exchange, Lieutenant Muhammad Hassaan Arshaf, 21, resident of Lahore district, leading his troops from the front, fought gallantly and embraced martyrdom along with his three men,” the ISPR said.\n\n“The three soldiers who paid the ultimate sacrifice include Naib Subedar Muhammad Bilal, 39, resident of Dera Ismail Khan district, Sepoy Farhat Ullah, 27, resident of Lakki Marwat district and Sepoy Himat Khan, 29, resident of Momand district,” it continued.\n\nThe ISPR added that sanitisation operations were being conducted to eliminate any other terrorists found in the area.\n\n“Security forces of Pakistan are determined to wipe out the menace of terrorism and such sacrifices of our brave men further strengthen our resolve,” the statement concluded.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif praised security forces for their successful operation against terrorists in KP, paying tribute to the four martyred security personnel in separate statements.\n\nIn a statement released by the Presidency, President Zardari said that the nation would always remember the sacrifices of its valiant martyrs, and praised their patriotism and bravery. He also reiterated the “unflinching national resolve” to continue operations until the complete elimination of terrorism, The Associated Press of Pakistan reported.\n\nThe PM paid tribute to the martyred personnel who sacrificed themselves during the operation, according to a statement on X.\n\n“The entire nation, including me, is proud of our martyrs and their families,” PM Shehbaz was quoted as saying. “We will continue the fight against terrorism until it is completely eradicated from the country. We will never allow the terrorists’ nefarious intentions to disrupt the peace of the country to succeed.”\n\nThe PM said that the nation salutes “its brave forces” for their unwavering commitment to national security. “The officers and men of the Pakistani Armed Forces are working day and night to protect the homeland, risking their lives,” he stated.\n\nEarlier in the week, security forces killed 13 terrorists in five separate operations carried out across KP on Thursday night.\n\nWith at least 685 members of security forces losing their lives amid a total of 444 terror attacks, 2024 turned out to be the deadliest year for the civil and military security forces of Pakistan in a decade, according to a 2024 report issued by the Centre for Research and Security Studies think-tank.\n\nAccording to the ISPR Director General, security forces conducted a total of 59,775 operations last year during which 925 terrorists were killed and 383 officers and soldiers were martyred.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/151700335ce73a3.png",
  "retrievedAt": "2025-08-25T19:38:24.098Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892147/four-army-personnel-martyred-15-terrorists-killed-in-kp-operations-ispr",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T12:36:18.000Z"
}
