{
  "title": "Senate recognises parties’ right to peaceful assembly - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A day after the Punjab government denied permission to the Awami National Party (ANP) to hold a rally at Rawalpindi’s Liaquat Bagh, the Senate, in a rare show of unity, unanimously passed a resolution recognising the right of political parties to hold peaceful gatherings and rallies across the country.\n\nThe resolution was initially moved by Leader of the Opposition Shibli Faraz, who had already secured the suspension of rules to table it. However, Law Minister Azam Nazeer Tarar objected to its wording and proposed a revised version, omitting the specific mention of Pakistan Tehreek-i-Insaf (PTI).\n\nThe original draft read, “It is the democratic right of all political parties, including PTI, to hold peaceful political gatherings, jalsas and rallies in the territory of Pak­istan as enshrined in the constitution. However, this right … is being denied by provincial administrations selectively across the country. This House unanimously dem­ands that the provincial abide by the constitutional right and allow peaceful gatherings and rallies across Pakistan without any restrictions.”\n\nThree key bills passed to combat human smuggling\n\nHowever, Mr Tarar arg­ued that provincial governments could not be dictated to and insisted on modifying the language. “Yes, we can urge provincial administrations to act within constitutional and legal bounds, but we cannot ignore legal provisions,” he said, noting that Section 144 had long been part of the legal framework governing public gatherings.\n\nThe law minister also insisted that the wording of the resolution should be general and not specific to a party.\n\nShibli Faraz pushed for a vote on the original resolution. The parliamentary lea­der of PTI, Barrister Syed Ali Zafar, also insis­ted on the passage of the original resolution, saying that it was a well-thought-out draft. He said that under the current situation, the parties within the ruling coalition were free to hold rallies, but there were restrictions on PTI.\n\nHowever, PPP Senator Sherry Rehman suggested that a joint resolution would enhance the dignity of the House and asked the two sides to prepare a mutually agreeable draft.\n\nMr Tarar then proposed a draft excluding the mention of PTI and replacing the words “without any restriction” with “as per law and Constitution”.\n\nAnti-human smuggling bills\n\nThe Senate also passed three bills aimed at curbing human trafficking and organised beggary, particularly in Gulf countries.\n\nThe Prevention of Traffi­cking in Persons (Amend­ment) Bill, the Prevention of Smug­gling of Migrants (Amend­ment) Bill, and the Emigration (Amendment) Bill were introduced by Law Minister Tarar on behalf of Interior Minister Mohsin Naqvi.\n\nThe law minister informed the house that recent boat tragedies, leading to the deaths of several illegal immigrant Pakis­tanis, have served as a wake-up call to stop this menace. He said the Ministry of Interior, in consultation with stakeholders, has proposed certain ame­nd­ments to the laws to stop human trafficking and smuggling of girls and beggars from Pakistan abroad.\n\nThe statement of objects and reasons of the bill pointed out that the diplomatic missions of Pak­i­stan in Gulf countries, Iraq and Malaysia have hig­h­l­i­ghted that some Pak­is­tanis who come to these countries for Haj, Umrah, Ziarat and personal visits were involved in beggary. They have urged Pakistani authorities to take stern action against those involved in begging and the gangs behind them.\n\n“The agents and gangs who are involved in this practice easily dodge prosecution as beggary is not a crime in any law entrusted to the Federal Investi­ga­tion Agency (FIA). The sen­sitivity of the issue demands the urgent need of making beggary a crime,” the statement said.\n\nMarwat’s query\n\nMeanwhile, Friday’s National Assembly session was also hit by quorum syndrome.\n\nThe lack of quorum in the lower house was pointed out just after Question Hour, leading to the house being adjourned until Monday.\n\nA light-hearted moment came when Sher Afzal Marwat, the erstwhile PTI lawmaker who has fallen on hard times within his party of late, posed a pointed question.\n\nDuring Question Hour, instead of posing a supplementary question on an IT-related matter, he said he wanted to ask his friends, “Mujhe kyun nikala?” (Why was I expelled?). The reference to the slogan formerly used by Nawaz Sharif prompted peals of laughter among those in attendance.\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:38:57.669Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892077/senate-recognises-parties-right-to-peaceful-assembly",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:27.000Z"
}
