{
  "title": "Firm’s claim over land meant for K-IV rejected - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Sindh High Court (SHC) on Friday dismissed a lawsuit filed against acquisition of land for the Greater Karachi Bulk Water Supply Scheme, better known as K-IV.\n\nThe SHC observed that the suit was turned down as being impliedly barred by the provisions of the Land Acquisition Act, 1894 while the plaintiff might still approach the collector for making a reference by invoking the Land Limitation Act, 1908 (LLA).\n\nA construction firm had filed a suit in 2018 and submitted that it owned private land in Gadap Town and had announced to build a housing scheme there. However, a part of the land was marked by the then Karachi Water & Sewerage Board in the route plan for laying of the K-IV project in 2015.\n\nA single-judge bench headed by Justice Adnan Iqbal Chaudhry in its order noted that the plaintiff had failed to draw an exception to the ouster of a civil suit to challenge acquisition proceedings under the LAA and all grounds urged in the suit could have been taken under Section 18 of the LAA.\n\nHowever, it said that there was some force in the plaintiff submission that it was not made aware of the award, which could be impugned before a civil court, and an application to challenge the same under Section 18 of LAA would be time barred.\n\nThe bench also noted that the suit had been filed in 2018, but none of defendants disclosed about the award, including the water utility, until it was brought on record last month.\n\nPublished in Dawn, February 15th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:26:19.278Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1892027/firms-claim-over-land-meant-for-k-iv-rejected",
  "dateList": "2025-02-15",
  "date_published": "2025-02-15T00:55:53.000Z"
}
