{
  "title": "Pakistan, Russia agree on enhancing educational ties",
  "link": "https://www.app.com.pk/national/pakistan-russia-agree-on-enhancing-educational-ties/",
  "date_published": "2024-09-19T14:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Pakistan and Russia on Thursday agreed on enhancing collaboration to strengthen educational ties, building on the positive momentum of their relationship over the past two decades.\nThe initiative was taken during the visit of a high level delegation of Russian Federation led by Andrey Korneev, State Secretary – Deputy Minister of Education of Russian Federation, and Konstantin Mogilevsky, Deputy Minister of Science and Higher Education of Russian Federation, to the Ministry of Federal Education and Professional Training (MoFEPT).\nThe delegation included the Consultant of the Ministry of Science and Higher Education of Russia, Associate Professor of Ural State Pedagogical University, and officials of the Russian Embassy in Pakistan.\nSecretary FEPT Mohyuddin Ahmad Wani briefed the delegation about the achievements and challenges faced by Pakistan in the field of education.\nDuring the discussions, the two sides reviewed the full spectrum of bilateral educational cooperation and explored ways to enhance it.\nThey affirmed their commitment to promoting cultural and educational exchanges.\nThe Pakistani side expressed a strong desire to increase collaboration between Pakistani and Russian universities, particularly in the fields of emerging technologies.\nThe Russian deputy minister emphasized initiatives to promote the Russian language in Pakistan and enhance educational links.\nAn agreement was reached to open a Russian Facilitation Center in Islamabad to assist students seeking admissions to Russian educational institutes.\nThe delegation also expressed their willingness to organize a Russian Educational Expo in Pakistan to strengthen cooperation in education and promote technology-based industrial linkages between the two countries.\nBoth sides agreed to prepare plans for finalization at the forthcoming Joint Working Group Meeting, expected in October 2024. The year 2025 is anticipated to be a year of action, embodying the essence of collaboration between Pakistan and Russia.\nThe Russian delegation also visited Islamabad College for Girls (ICG), Sector F-6/2, Islamabad. They appreciated the efforts of the Ministry of Federal Education and Professional Training in advancing pedagogical initiatives, with a special focus on girls’ education.",
  "retrievedAt": "2025-08-10T21:13:35.318Z"
}
