{
  "title": "Pakistan, Russia for enhanced trade, economic cooperation, regional connectivity",
  "link": "https://www.app.com.pk/national/pakistan-russia-for-enhanced-trade-economic-cooperation-regional-connectivity/",
  "date_published": "2024-09-19T13:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Pakistan and Russia on Thursday reiterated their commitment to expanding trade and economic ties, besides enhancing regional connectivity to strengthen bilateral relations.\nIn a meeting between President Asif Ali Zardari and the visiting Russian Deputy Prime Minister Alexei Overchuk, who along with members of his delegation called on the president, at Aiwan-e-Sadr, both sides underscored the importance of fostering mutually beneficial cooperation in key sectors such as agriculture, food security, business, education, railways, science and technology, and promoting stronger people-to-people connections.\nWelcoming the Russian deputy prime minister, the president stressed the importance of exploring possibilities for barter trade, in addition to improving connectivity to strengthen economic relations between the two nations.\nHe called for easing visa regulations and increasing connectivity through railways and direct flights to facilitate and enhance people-to-people and business-to-business contacts.\nDuring the meeting, it was highlighted that there was great scope to increase bilateral cooperation in the agriculture sector. It was emphasised that there was enormous potential to undertake joint ventures in the agricultural sector for the mutual benefit of the two countries. It was also informed that a 75-member business delegation from Pakistan would visit Russia in October to explore avenues for business and economic cooperation.\nAlexei Overchuk said that Russia was looking forward to improving cooperation with Pakistan in food security, science and technology, education, connectivity and railways.\nHe stated that the upcoming visit of the Russian Prime Minister to Pakistan, in October, would provide another opportunity to further strengthen bilateral relations. He further said that Russia held tremendous respect for all religions and Muslim culture, and had condemned the desecration of the Holy Quran.\nDeputy Prime Minister and Foreign Minister, Ishaq Dar, Pakistan People’s Party CHairman Bilawal Bhutto Zardari, Minister of Planning, Development, and Special Initiatives Ahsan Iqbal Chaudhary, Minister of Energy (Power and Petroleum Divisions) Sardar Awais Ahmad Khan Leghari, Minister of Communications Abdul Aleem Khan, Minister of Commerce Jam Kamal Khan, Senator Sherry Rehman, and senior government officials were also present during the meeting.",
  "retrievedAt": "2025-08-10T21:13:36.931Z"
}
