{
  "title": "Anti-drug awareness campaign “Nasha Ab Nahi”on full swing in Islamabad",
  "link": "https://www.app.com.pk/national/anti-drug-awareness-campaign-nasha-ab-nahion-full-swing-in-islamabad/",
  "date_published": "2024-09-19T10:25:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP):Islamabad Capital Territory (ICT) Police have initiated a special awareness campaign to eradicate the use of narcotics from the federal capital and ensure the safety of the youth from the curse of drugs.\nAccording to police spokesperson ICT police led by Inspector General (IG) police Syed Ali Nasir Rizvi, has launched the “Nasha Ab Nahi” campaign to combat narcotics and protect youth from drug abuse.\nIn this regard, police officers have conducted special lectures in various educational institutions to educate students about the harms of drugs and preventive measures.\nHe said during this campaign, DIG Syed Ali Raza has delivered lectures on the FAST University Islamabad campus about the harms of narcotics and preventive measures, emphasizing that drug abuse is detrimental to the health and future of students.\nStudents are urged to protect themselves and contribute to saving their surroundings from the curse of drugs, he said.\nParents and teachers are encouraged to collaborate in preventing youngsters from falling victim to drugs. He added.\nSyed Ali Raza has appealed to the public to immediately inform the police about any drug-related activities in their vicinity, he said.\nThe cooperation of the public is deemed crucial for the successful eradication of this menace, he added.\nDIG further said that, Islamabad Police and Anti-Narcotics Force are jointly working to combat drug trafficking, while special teams have been formed to apprehend drug peddlers in educational institutions, he added.\nSyed Ali Raza emphasized that individuals involved in businesses related to narcotics and liquor will be brought to justice, he said.\nDIG said the ICT Police is actively engaging with the community to make the city safe and secure, he added.\nCitizens are urged to report any suspicious persons or activities to the relevant police station, or at the emergency helpline “Pucar-15,” or via the “ICT Police” app.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:14:24.953Z"
}
