{
  "title": "Consultation underway for judicial, constitutional reforms: Barrister Aqeel",
  "link": "https://www.app.com.pk/national/consultation-underway-for-judicial-constitutional-reforms-barrister-aqeel/",
  "date_published": "2024-09-19T17:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Prime Minister’s Advisor on Law and Justice Barrister Aqeel Malik on Thursday said that consultation with the leadership of coalition and opposition parties along with lawyers, was underway for judicial and constitutional reforms.\nAddressing a press conference, he said that the government wanted to adopt the amendments in the Constitution unanimously.\nHe claimed that many decisions had been announced in the past under judicial activism which affected the country’s economy and public interest.\nThe purpose of the proposed amendments was to remove the legal flaws and weaknesses, and ensure provision of fast and fair justice to litigants, he added.\nThe advisor said that it was prerogative of the Parliament to enact the Constitution and laws, and also introduce amendments.\nHe said that there a wrong impression was being given that the lawyers were going towards protest. All the stakeholders, including the representatives of Supreme Court Bar Association, and provincial and Federal Capital’s bars, he added, attended the last day’s consultative session.\nIt was stated in the joint declaration after the meeting that it was the sole mandate of the Parliament to carry out legislation and amend the laws, while it was the responsibility of the judiciary to interpret the Constitution it, he said.\nBarrister Aqeel said that efforts were continuing to bring reforms in the judicial system, which should be appreciated.\nHe said that all the coalition parties had been taken into confidence and now the efforts were being made to build consensus of all the political parties.\nAqeel Malik said that Pakistan’s judicial system ranked 139 internationally. They were trying to bring improvement in the judicial system so that the common people could get fast and fair justice.\nHe said that consultation was also underway on the procedure of appointment of judges, and the formation of constitutional courts.",
  "retrievedAt": "2025-08-10T21:13:08.609Z"
}
