{
  "title": "Speaker’s letter to CEC denotes supremacy of Parliament: Atta Tarar",
  "link": "https://www.app.com.pk/national/speakers-letter-to-cec-denotes-supremacy-of-parliament-atta-tarar/",
  "date_published": "2024-09-19T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP): Federal Minister for Information, Broadcasting, National Heritage and Culture Attaullah Tarar on Thursday said that National Assembly Speaker Ayaz Sadiq had eventually upheld the supremacy of the Parliament by writing a letter to the Chief Election Commissioner (CEC) on the issue of reserved seats.\nHe paid tributes to the Speaker on the initiative and said that it must not be misconstrued.\n“There are specific questions over the Supreme Court’s verdict about the reserved seats, which need to be duly considered and redressed,” the minister said while talking to the media.\nTerming the Speaker’s letter a ‘milestone in the parliamentary history’, he said it was articulated unequivocally in the Constitution that “the Parliament is supreme and has the sole jurisdiction to enact and amend laws”.\nIt were the people who elected their representatives to the Parliament with an exclusive right to legislate or amend the Constitution, he added.\nThe minister said there should not be a trespass in terms of institutional domains in order to invigorate the parliamentary system in the country.\nHe reiterated that the Parliament had the exclusive mandate to carry out the legislative business, by amending or rewriting the Constitution.\nThe minister endorsed the Speaker’s stance that there was already a law in the amended Election Act 2017 that clearly indicated that independent candidates would have to join a political party within 48 hours of the election.\nHow the clock could be turned back allowing those independent Members of the National Assembly who had already joined the Sunni Ittehad Council (SIC), to join another political party, he questioned.\nTarar highlighted the flaw in the verdict that the independent members had joined a political party (PTI) which did not any presence in the House.\nQuestioning the interpretation of Article 63-A in the current ruling, he recalled that the previous interpretation had led to the removal of Hamza Shehbaz led government in Punjab.\nHe said the Pakistan Muslim League-Nawaz would continue to play its role for the Parliament’s sovereignty.\n“Speaker Ayaz Sadiq has taken a remarkable step. He has always upheld his integrity by treating all parties in the Assembly with fairness and respect. He always ensures that no member faces injustice,” the minister said.",
  "retrievedAt": "2025-08-10T21:13:34.686Z"
}
