{
  "title": "IESSI celebrates World Patient Safety Day 2024 in collaboration with ILO, HSA",
  "link": "https://www.app.com.pk/national/iessi-celebrates-world-patient-safety-day-2024-in-collaboration-with-ilo-hsa/",
  "date_published": "2024-09-19T12:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 19 (APP):The ICT Employees Social Security Institution (IESSI) hosted an event to mark World Patient Safety Day 2024, in collaboration with the International Labour Organization (ILO) and the Health Services Academy (HSA) here on Thursday.\nThe event highlighted the critical issue of patient safety, aligning with this year’s theme: “Improving Diagnosis for Patient Safety”.\nOn the occasion, Commissioner, IESSI, Rabia Aurangzaib reiterated the importance of World Patient Safety Day and emphasized that the patient safety must be recognized as a priority in all healthcare settings, stating, “Improving patient safety can prevent half of the harm in healthcare settings, potentially saving over 3 million lives annually.” She highlighted the pressing need for stronger health care safety measures.\nMeanwhile, she thanked to Dr. Shehzad, Vice Chancellor of Health Services Academy (HSA) for his collaboration in organizing the event, and Gier Tonstol, Country Director of ILO, for supporting IESSI in this important initiative. The Commissioner, IESSI, also expressed her gratitude to Muhammad Ali, Commissioner of the Punjab Employees Social Security Institution (PESSI) and Dr. Matiur Rehman, a leading expert in the field of patient safety.\nThe event concluded with a call to action, reinforcing the World Patient Safety Day 2024 slogan, “Get it Right, Make it Safe!”. The Commissioner reiterated IESSI’s commitment to adopting international best practices and complying with standards set by regulatory authorities to enhance patient safety across healthcare facilities.\nThe event provided a platform for healthcare professionals and stakeholders to discuss the urgent need for improving diagnostic accuracy and reducing errors, contributing to safer healthcare systems for all.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T21:13:58.791Z"
}
