{
  "article_id": "2025-03-15_8f3705c9f53326463946372ab2be5573",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-navy-launches-second-hangor-class-submarine-in-china/",
    "retrieved_at": "2025-08-27T13:42:36.865Z"
  },
  "metadata": {
    "title": "Pakistan Navy launches second Hangor-class Submarine in China",
    "author": null,
    "date_published": "2025-03-15T15:42:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 274,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 15 (APP): The launching ceremony of the second Hangor Class submarine, PNS/M SHUSHUK (Desig), was held at Wuchang Shipbuilding Industry Group Company Ltd, Shuangliu Base, Wuhan, China. Vice Chief of the Naval Staff, Vice Admiral Ovais Ahmed Bilgrami, was the Chief Guest on the occasion, said a news release issued by Directorate General Public Relations (PAKISTAN NAVY). While addressing the ceremony, Vice Chief of the Naval Staff highlighted the importance of maritime security in prevailing geo-strategic environment of the region, as well as Pakistan Navy's commitment to safeguarding national interests and ensuring a safe and conducive maritime environment for all. He emphasized that Hangor Class submarines, equipped with state-of-the-art weapons and sensors, will play a pivotal role in maintaining the balance of power and maritime order in the region. Acknowledging the tireless efforts of China Shipbuilding & Offshore International Company Ltd (CSOC), he expressed satisfaction with the project's progress and underscored that the Hangor Class Submarine Project will add a new dimension to time-tested Pakistan-China friendship. The Government of Pakistan signed an agreement with CSOC to acquire eight Hangor Class submarines during the visit of Chinese President Xi Jinping to Pakistan. Under this contract, four submarines will be built in China, while the remaining four will be constructed in Pakistan at Karachi Shipyard & Engineering Works Ltd (KS&EW) under the Transfer of Technology (ToT) program. These submarines will be fitted with cutting-edge weapons and sensors, enabling them to engage targets at standoff ranges. The launching ceremony was attended by high-ranking officials from Pakistan and China, including representatives from Wuchang Shipbuilding Industry Group Company Ltd and China Shipbuilding & Offshore International Company Ltd.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}