{
  "article_id": "2025-03-15_b0e9eb0dda4bc1e7e2977dcec55fa2fb",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/security-forces-kill-nine-khwarij-in-two-separate-engagements/",
    "retrieved_at": "2025-08-27T13:43:06.791Z"
  },
  "metadata": {
    "title": "Security Forces kill nine Khwarij in two separate engagements",
    "author": null,
    "date_published": "2025-03-15T15:23:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 197,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "RAWALPINDI, Mar 15 (APP): Security Forces killed nine Khwarij in two separate engagements in Khyber Pakhtunkhwa Province. \"On 14-15 March 2025, Nine Khwarij were killed in two separate engagements in Khyber Pakhtunkhwa Province. On reported presence of Khwarij, an intelligence-based operation was conducted by the Security Forces in Mohmand District\" said an ISPR news release. During the conduct of operation, own troops effectively engaged the khwarijs' location, resultantly, seven khwarij were sent to hell. However, during intense fire exchange, two brave sons of soil, Havildar Muhammad Zahid (age: 37 years, resident of District Malakand) and Sepoy Aftab Ali Shah (age: 26 years, resident of District Chitral) having fought gallantly, rendered the ultimate sacrifice and embraced shahadat. In another encounter that took place in the general area Maddi, Dera Ismail Khan District, a fire exchange took place between own troops and khwarij. Resultantly, two khwarij were effectively neutralized. Weapons and ammunition were also recovered from the killed khwarij, who remained actively involved in numerous terrorist activities. Sanitization operations are being conducted to eliminate any other Kharji found in the area as the security forces of Pakistan are determined to wipe out the menace of terrorism from the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}