{
  "article_id": "2025-03-15_a38d2583a677afb29fb5d28a6e7fbc20",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/poliovirus-detected-in-12-environmental-samples/",
    "retrieved_at": "2025-08-27T13:42:56.227Z"
  },
  "metadata": {
    "title": "Poliovirus detected in 12 environmental samples",
    "author": null,
    "date_published": "2025-03-15T16:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 315,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Mar 15 (APP): The Regional Reference Laboratory for Polio Eradication at the National Institute of Health (NIH) has confirmed detection of wild poliovirus type 1 (WPV1) in sewage samples of 12 cities. According to official sources, 15 environmental (sewage) samples were collected from 14 districts between February 17 and February 26 and were tested at the NIH lab during the past week. The samples from Multan, Bahawalpur, Lahore, D.G.Khan, Kasur, Dera Bugti, Lasbela, Quetta, Sibi, South Waziristan Lower, Charsadda and Swabi were tested positive while samples from D.I.Khan, South Waziristan Lower and North Waziristan tested negative for poliovirus. They said that Pakistan's polio surveillance is among the world's best, with the largest and most sensitive detection system. They said that the program has expanded its environmental surveillance sites from 65 in 2021 to 127 in 2025. Its efficiency in detecting poliovirus in sewage and cases ensures no transmission goes unnoticed, even in remote areas. The Programme is implementing a rigorous vaccination schedule to protect children from paralytic polio and interrupt virus transmission. Due to high-quality campaigns since September 2024, polio cases nationwide have declined. In February, a nationwide polio campaign vaccinated over 45 million children, alongside fIPV-OPV campaigns held in Karachi and Quetta blocks. The second phase of the fIPV-OPV campaign is currently underway in Karachi and will continue until March 16 across 59 union councils. Additionally, a targeted vaccination drive in 104 union councils bordering Afghanistan or having Afghan refugee populations was conducted in the last week of February, reaching over 0.67 million children to reduce the risk of cross-border and internal virus transmission. The next nationwide campaign is scheduled from April 21 to 27, aiming to vaccinate 45.4 million children under the age of five across the country. The Polio Programme urged all parents to get their children vaccinated against polio at every opportunity to keep them protected from this devastating disease.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}