{
  "article_id": "2025-03-15_59bc890a722aa7f0dd7e430c985109cf",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tbh-screens-groundbreaking-documentary-order-and-disorder/",
    "retrieved_at": "2025-08-27T13:42:35.086Z"
  },
  "metadata": {
    "title": "TBH screens groundbreaking documentary “Order and Disorder”",
    "author": null,
    "date_published": "2025-03-15T16:16:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 266,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Talking about his documentary, Jim Al-Khalili revealed, \"The documentary unpacks how humanity has deciphered the laws governing the universe and mastered two of the most transformative concepts of the modern age-energy and information.\" He added that the information was not just for human communication but was deeply embedded in the very fabric of reality. ISLAMABAD, Mar 15 (APP): The Black Hole (TBH), a prestigious non-profit organization, recently hosted an exclusive screening of the critically acclaimed documentary \"Order and Disorder (The Story of Information)\" by the distinguished British physicist and science communicator, Prof Jim Al-Khalili, on Saturday. The esteemed panel included Muhammad Siddiqui-tech entrepreneur, Dr Amjad Sohail-Assistant Prof of philosophy at NUMS, and Dr Naqeeb ur Rehman-mathematician with a doctorate from Germany. Talking about his documentary, Jim Al-Khalili revealed, \"The documentary unpacks how humanity has deciphered the laws governing the universe and mastered two of the most transformative concepts of the modern age-energy and information.\"He added that the information was not just for human communication but was deeply embedded in the very fabric of reality. As a sequel to Everything and Nothing: The Science of Empty Space, this award-winning science documentary discussed the interconnected principles of Einstein's General Relativity and quantum mechanics, unveiling the hidden order that underpins our cosmos. Following the screening, the panelists shared their insights on the significance of information theory in modern science and its philosophical and mathematical implications. An engaging and interactive Q&A session with the audience was also held at the end of the session. The discussion was live-streamed on TBH's official Facebook page, enabling a wider audience to participate virtually.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}