{
  "title": "“15 EU MEPs call for Kashmiris’ rights is a welcome development”: Masood Khan",
  "link": "https://www.app.com.pk/national/15-eu-meps-call-for-kashmiris-rights-is-a-welcome-development-masood-khan/",
  "date_published": "2020-06-02T03:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP):Azad Jammu Kashmir President, Sardar Masood Khan while welcoming the move of 15 EU MEPs has described it an important development on the international level and observed that in spite of the most difficult circumstances, the voices in support of the Kashmiri people are constantly rising around the globe.\nFifteen active members of the European Parliament from all major political parties have written a letter to the President of European Commission, Ursula Von der Leyen and the European Unions’ High Representative for Foreign Affairs and the Security Policy Josef Borrell and called for raising with the Indian government the issue of the worst human rights violations in occupied Jammu and Kashmir.\nThe Members of European Parliament (MEPs) stressed to ensure protection of all fundamental rights of the Kashmiri people including their right to self-determination. Those who wrote to European high officials are Fabio Massimo MEP, Bettina Vollath MEP, Helmut Scholz MEP, Maria Arena MEP, Daniela MEP, Javier Nart MEP, Carles Puigdemont MEP, Antoni C omin I Oliveres, Clara Ponsati Oblos, Alvina MEP, Ernest Urasun MEP, Klaus Buchner MEP, Mick Wallace MEP, Rosa D’amato MEP and Manuel Bompard MEP\nThe MEPs while describing the Kashmir conflict a long outstanding unresolved issue as the source of continued tensions have stated that the people of Indian Occupied Jammu and Kashmir have been subject to intolerable suppression of their freedom and fundamental rights over the past seven decades, as it is documented by many human rights organisations and the 2018 and 2019 reports of the Office of the UN High Commissioner for Human Rights.\n“We should look at this region with great concern and defuse at all cost an escalation of the conflict by strengthening our dialogue with India, Pakistan and the representatives of Kashmir in order to recover the dimension of dialogue, negotiation and diplomacy in the resolution of the conflict,” the letter stated.\nThe president in a statement said, “The concern of the fifteen Members of European Parliament (MEPs) over the serious human rights situation in the Indian Occupied Jammu and Kashmir is appreciable and we welcome their letter to European Commission’s President and Vice President”.\nHe said that the Kashmiri people had achieved success on two of three important fronts recently and observed that these two fronts are parliamentary diplomacy and media.\nSardar Masood Khan said that the international community has now started constantly speaking in support of the rights of the Kashmiri people including their right to self-determination, and they are also condemning India’s actions in occupied Jammu and Kashmir, and the discriminatory treatment being extended to minorities in India.\nHowever, he regretted that some influential countries still have based their relations with India on their economic and political interest. He said that the day is not far off when media and the parliamentary forces will be compelled to alter their policy on Kashmir.\nThe AJK President appreciated the Pakistani and Kashmiri leadership and diaspora communities for projecting the Kashmir issue in the UK, Europe and North America in its real perspective. Rejecting the assertion of some global leaders that India- Pakistan should sit around the table to resolve Kashmir conflict.\nHe said that the UN Security Council has an obligation to implement its own resolutions to hold a plebiscite in Kashmir adding that UN Charter and obligations of members of UNSC overrides any bilateral accord between the UN member states.\nThe AJK President also strongly reacted over the killing of 13 Kashmiri youth at the hands of Indian troops in occupied Poonch and Rajouri districts said that the Indian barbaric and repressive tactics cannot deter the Kashmiri people from their freedom struggle.\n“In Occupied Jammu and Kashmir, it is open season for the killing of Kashmiri youth by occupation forces. No check, no accountability, no condemnation by the UN or powerful governments- An outrage in our times,” he went on to say.\nThe President said that on martyrdom of 13 young Kashmiris, we condole with the bereaved families and assure them that the precious blood of these martyrs will not go waste, and we also vow to win freedom for ourselves from the tyrant India.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:17:04.194Z"
}
