{
  "title": "Achieving food autarky top priority of present government: NA Speaker",
  "link": "https://www.app.com.pk/national/achieving-food-autarky-top-priority-of-present-government-na-speaker/",
  "date_published": "2020-06-02T05:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 02 (APP):National Assembly Speaker Asad Qaiser Tuesday chaired a meeting to discuss the prospective shortage of wheat in Khyber Pakhtunkhwa and attack of locust in different parts of the country.\nThe meeting was attended by Provincial Food Ministers of Punjab and Khyber Pakhtunkhwa Aleem Khan and Qalander Lodhi, respectively besides Provincial Secretaries food departments and senior member Board of Revenue Khyber Pakhtunkhwa.\nThe Speaker said that agriculture was the backbone of our economy thus steps should be taken to develop agriculture and solve the problems facing farmers. He said that present government was committed to achieve food autarky in the country. He stressed on the provincial governments to take steps to modernize agriculture sector.\nHe informed that a special parliamentary committee on agricultural products for agricultural development had been formed.\nHe said that provincial governments were welcome to suggest parliamentary committee to formulate integrated policy for agriculture sector development.\nLodhi apprised that Khyber Pakhtunkhwa’s wheat production was less than its needs.\nHe informed that farmers in the province were being encouraged to cultivate the wheat crop to achieve self sufficiency. He said that till this achievement, KPK was left with the only option but to buy required wheat from Punjab to meet its food requirements.\nSpeaker Asad Qaiser said that steps should be taken to ensure adequate supply of wheat to Khyber Pakhtunkhwa. He directed for completing wheat procurement targets in the province in time.\nMinister for Food Punjab assured that Punjab province will fully cooperate in meeting the wheat requirement in KPK. He said that Punjab was ready to supply its extra wheat to small provinces.\nHe informed that Punjab had abundant reserves of wheat and there was no danger of shortage of wheat.\nHe assured that wheat supply to all provinces will be ensured as per requirement.\nThe Speaker said that in present coronavirus pandemic situation uninterrupted supply of food items across the country was joint responsibility of the federal and provincial governments.\nWhile discussing the attack of locust on crops, the Speaker said that locust was a major threat to the food basket of the country.\nHe stressed that federal and provincial governments needed to work together to eradicate locust.\nThe provincial ministers appreciated the efforts of Speaker Asad Qaiser for the development of agriculture.\nThey said that legislation was under consideration in their respective provinces to ensure quality food supply to people and develop agriculture sector. They informed about the measures taken for addressing the locust attack.discuss the prospective shortage of wheat in Khyber Pakhtunkhwa and attack of locust in different parts of the country.\nThe Speaker said that agriculture was the backbone of the economy thus steps should be taken to develop agriculture and solve the problems facing farmers. He said that present government was committed to achieve food autarky in the country. He stressed on the provincial governments to take steps to modernize agriculture sector.\nHe informed that a special parliamentary committee on agricultural products for agricultural development had been formed.\nHe said that provincial governments were welcomed to suggest parliamentary committee to formulate integrated policy for agriculture sector development.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:17:06.950Z"
}
