{
  "title": "Lawyers protesting canals project end Khairpur sit-in - Pakistan - DAWN.COM",
  "author": null,
  "content": "SUKKUR: Lawyers protesting the proposed construction of six canals on the Indus River called off their main sit-in on the National Highway at Bab­arloi Bypass in Khairpur on Tuesday, after successful negotiations with a government delegation.\n\nAddressing a press conference at the bypass, Ka­­rachi Bar Association Pre­sident Amir Nawaz Wara­ich and Sindh High Court Bar Association President Sarfraz Ali Metlo said the decision to end the sit-in was made after receiving assurances from the government and the issuance of an official notification addressing their concerns.\n\nThey confirmed that the notification issued by the government incorporated all points raised by the lawyers’ community. Based on this, the lawyers’ committee decided to end the protest, they said, adding that further meetings regarding the canals issue will continue.\n\nThe lawyers’ leaders said the government had pledged to provide the ne­­cessary legal documentation by May 7.\n\nTraffic restored on National Highway after protest camps removed\n\nThese documents will detail all matters related to the legal and professional rig­hts of lawyers. Following this as­­surance, the lawyers’ committee expressed satisfaction with the outcome.\n\nThe lawyers reiterated their commitment to def­ending national interests and pledged that the legal community would maintain an active role in monitoring the government’s implementation of its pro­mises.\n\nThey expres­sed hope that similar issues would not arise in the future and that lawyers’ rights would be fully safeguarded. They descri­bed their movement as a successful struggle ag­­­­a­­i­nst injustices done to Sindh.\n\nThe lawyers’ leaders appealed to their colleagues to return to their professional responsibilities, highlighting the importance of unity in resolving national issues through dialogue.\n\nMeanwhile, the process of dismantling protest camps began, and two-way traffic was restored on the National Highway.\n\nEarlier, the Sindh government delegation held talks with the lawyers’ co­­mmittee at the High Court Bar Association office in Sukkur. The delegation was led by Law Minister Zia Lanjar and included District Council Chairman Kumail Haidar Shah, Suk­kur Commissio­ner Fayyaz Abbasi and Deputy Com­missioner M.B. Dharejo.\n\nThe lawyers were represented by Amir Nawaz Waraich, Sarfraz Ali Metlo, Qurban Ali Malano and others.\n\nAfter the meeting, Zia Lanjar and Kumail Shah held a joint press conference. “We came here for negotiations with the lawyers’ committee and appe­aled to our friends to end the sit-in at Babarloi Bypass,” Mr Lanjar said.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:43:59.171Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907493/lawyers-protesting-canals-project-end-khairpur-sit-in",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:57:32.000Z"
}
