{
  "title": "White House slams Amazon over display of tariff effect on prices - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: The White House on Tuesday slammed Amazon over reports it would soon tell consumers how much US President Donald Trump’s tariffs have contributed to the price tag on its goods.\n\nAt a press conference marking the president’s 100 days in office, Press Secretary Karoline Leavitt told reporters she had discussed Amazon’s reported move with the president and claimed it represented “another reason why Americans should buy American”. “This is a hostile and political act by Amazon”. “Why didn’t Amazon do this when the Biden administration hiked inflation to the highest level in 40 years?” she added.\n\nEarlier Tuesday, Punchbowl News reported that the e-commerce site will soon start showing “how much Trump’s tariffs are adding to the price of each product,” citing a person familiar with the matter. US President Donald Trump also called Amazon Executive Chairman Jeff Bezos to complain about the report of Amazon’s plan to detail the tariff impact for customers, according to multiple media outlets.\n\nHowever, Amazon insisted on Tuesday it has not approved any such proposal and said it never considered listing tariffs on its main retail site and nothing was implemented on any company site. “The team that runs our ultra-low cost Amazon Haul store considered the idea of listing import charges on certain products. This was never approved and is not going to happen,” said Amazon spokesperson Tim Doyle.\n\nTrump calls Bezos to complain about report\n\nLeavitt cited a 2021 report by Reuters that the tech company had partnered with a “Chinese propaganda arm.” Amazon in 2021 said it “complies with all applicable laws and regulations, wherever we operate, and China is no exception”. Amazon shares were down 2.2 per cent in premarket trading but later rebounded and were trading nearly flat.\n\nAmazon set up Amazon Haul in November for products which could be impacted by tariff changes. This allows shoppers to purchase $5 handbags and $10 sweaters from China-based sellers, although they face longer shipping times.\n\nThe uncertainty kicked up by the on-again, off-again tariff rollout has shaken financial markets, briefly pushing volatility up to levels not seen since the Covid-19 pandemic. While the endpoint of Trump’s tariffs is currently unknown, they are already starting to have an impact on businesses in the United States.\n\nTrump this month signed an executive order that closes a trade loophole known as “de minimis” that has allowed low-value packages from China and Hong Kong to enter the United States free of duties. The order takes effect on May 2. Reuters reported on Monday some third-party merchants who previously sold China-made goods during Amazon’s premier July Prime Day shopping event are sitting it out this year or reducing the amount of discounted merchandise they offer.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:43:46.464Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907484/white-house-slams-amazon-over-display-of-tariff-effect-on-prices",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:57:51.000Z"
}
