{
  "title": "PCB confirms two additional men’s T20Is against Bangladesh - Sport - DAWN.COM",
  "author": null,
  "content": "The Pakistan Cricket Board (PCB) on Wednesday said that the Bangladesh men’s team will tour Pakistan in May for a five-match T20I series.\n\nPakistan last played international cricket against New Zealand earlier this month, where the Green Shirts lost both the One-day International series (3-0) and the Twenty20 International series (4-1).\n\nThe Pakistan Super League is currently ongoing in the country with the final set to take place on May 18.\n\nThe PCB said in a press release: “The series, which is part of the Future Tour Programme (FTP), originally consisted of three ODIs and three Twenty20 internationals (T20Is).\n\n“However, with the ICC Men’s T20 World Cup scheduled for next year, both the boards have mutually agreed to replace the ODIs with two additional T20Is.”\n\nThe five-match T20I series will be played in Faisalabad and Lahore from May 25 to June 3, the PCB added.\n\nIqbal Stadium in Faisalabad, which successfully hosted the inaugural Champions One-Day Cup in September last year and National T20 Cup last month, will stage the first and second T20Is of the series, scheduled on May 25 and 27.\n\nIqbal Stadium, which has previously hosted 24 Tests and 16 ODIs between 1978 and 2008, will welcome back international cricket after a 17-year hiatus, the press release noted.\n\nThe historic venue’s last international fixture was an ODI between Bangladesh and Pakistan in April 2008.\n\nLahore’s Gaddafi Stadium will host the remaining three T20Is, scheduled on May 30, June 1 and 3 with all five matches set to begin at 8pm.\n\nThe Bangladesh team will arrive on 21 May and will undergo training sessions at the Iqbal Stadium from 22 to 24 May, the press release concluded.\n\nBangladesh last toured Pakistan in September of last year for two tests, where they beat the hosts 2-0 to complete their maiden whitewash over Pakistan in that format of the game.\n\nMay 21 Bangladesh men’s team arrival\n\nMay 25: First T20I at Iqbal Stadium, Faisalabad (8pm)\n\nMay 27: Second T20I at Iqbal Stadium, Faisalabad (8pm)\n\nMay 30: Third T20I at Gaddafi Stadium, Lahore (8pm)\n\nJune 1: Fourth T20I at Gaddafi Stadium, Lahore (8pm)\n\nJune 3: Fifth T20I at Gaddafi Stadium, Lahore (8pm)",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/30140140f0597a0.jpg",
  "retrievedAt": "2025-08-25T14:43:23.179Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907559/pcb-confirms-two-additional-mens-t20is-against-bangladesh",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T09:23:42.000Z"
}
