{
  "title": "Nat Sciver-Brunt named England women’s captain - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: All-rounder Nat Sciver-Brunt has succeeded Heather Knight as England captain, the England and Wales Cricket Board said on Tuesday.\n\nSciver-Brunt was the favourite to take over after the long-serving Knight was dismissed last month following a humiliating 16-0 Ashes whitewash in Australia.\n\nHead coach Jon Lewis was also sacked and has been replaced by former captain Charlotte Edwards.\n\nSciver-Brunt made her international debut in 2023 and has been vice-captain for the last three years. She is ranked number three in the ICC world batting rankings in one-day International (ODI) cricket.\n\nThe 32-year-old, who was part of England’s ODI World Cup-winning team in 2017, was also named the ICC women’s cricketer of the year in 2022 and 2023.\n\nSciver-Brunt has represented England in 259 matches across all formats, scored 11 centuries — averaging around 46 in both Tests and ODIs and 28 in international T20s — and taken 181 wickets.\n\n“I’m really proud to take on the role of captain of the England women’s team and it’s an honour to have been asked by Charlotte, someone I’ve always looked up to,” Sciver-Brunt said in a statement.\n\n“Ever since I made my England debut back in 2013, all I have wanted to do is help the team in every way that I can. I will try my best to lead this team to success, whilst empowering them to be the best version of themselves.\n\n“We have a really talented group, and we have a group that’s united. It’s a team I believe in and a team that can have a lot of success together.”\n\nClare Connor, managing director of England women’s cricket, said: “Everyone knows what a fantastic cricketer Nat is, but her qualities extend far beyond her skills on the pitch. She’s thoughtful, resilient and driven by getting the best out of herself and everyone around her.”\n\nEngland Women face the West Indies in three T20 matches and three ODIs starting on May 21 before hosting India for five T20s and three ODIs.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:48:13.341Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907426/nat-sciver-brunt-named-england-womens-captain",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:57:45.000Z"
}
