{
  "title": "Young doctors shut down operation theatres of various hospitals in Punjab - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The young doctors on Tuesday shut down operation theatres of many government hospitals across Punjab after the police uprooted the protest camp of employees of the state-run health facilities on Monday night and lodged an FIR against 200-300 protesters, allegedly for attacking police and injuring some of the personnel.\n\nThe FIR registered with the Civil Lines police station on the complaint of a sub-inspector against the protesters contains serious charges.\n\nThe Young Doctors Association (YDA) Punjab’s senior leaders, including its president, were nominated in the FIR, which stated that the protesters, including women, were allegedly carrying dangerous weapons when they attacked the police on Monday.\n\nThe FIR alleged that the police stopped the protesters from entering the ‘red zone’ where international cricketers were staying in a hotel, but they not only posed a threat to the players’ security, but also injured some policemen.\n\nThey reacted to police action, FIR against protesting health employees\n\nIt said the suspects raised slogans, threatened the government of dire consequences, besides attacking and damaging official properties.\n\nOn the other hand, the young medics vent their anguish over the patients and closed down the operation theatres (OTs) of many teaching hospitals across the province on Tuesday on the call of the YDA Punjab leaders.\n\nSources said the YDA members visited the OTs of different hospitals in groups, forced the on-duty doctors and nurses to leave the facilities and then locked the surgical facilities.\n\nAs a result, they said, the elective and other surgeries were postponed at these hospitals. However, the operations of critical patients brought to the emergency wards were performed as per routine.\n\nTalking to the media on Tuesday, YDA Pakistan president Dr Atif Majeed condemned the registration of the FIR against the employees of the government hospitals, saying they were protesting peacefully for their “legitimate demands”.\n\nHe rejected the allegations of attack on the police and that the protesters were armed with knives or other sharp surgical tools.\n\nDr Atif announced that the employees would not be responsible for any harm to the patients during the strike in the government hospitals.\n\nHe also lashed out at senior doctors, including professors, who provided treatment to the patients at the OPDs of the public hospitals during the employees’ agitation.\n\nHe urged the PML-N president and former premier Nawaz Sharif to intervene to defuse the tension and resolve the issue.\n\nDr Majeed said the ruling elite in Punjab were not ready to give a sympathetic hearing to the protesting employees.\n\nThere were reports that the employees continued to protest at the Charing Cross where they had been staging a sit-in, blocking the traffic on both sides of The Mall, for the last three weeks or so.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:43:43.728Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907472/young-doctors-shut-down-operation-theatres-of-various-hospitals-in-punjab",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:58:04.000Z"
}
