{
  "title": "Balochistan CM slams Indian aggression - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA: Balochistan Chief Minister Sarfaraz Bugti on Tuesday reaffirmed the solidarity of the nation with the armed forces, declaring that any attempt to impose war would be met with national solidarity and unwavering defence of the homeland.\n\n“The people of Balochistan have always stood firmly with the country’s armed forces and state institutions,” Mr Bugti said during a provincial cabinet meeting that he chaired in Quetta.\n\nThe meeting opened with a strong condemnation of the Indian aggression and “baseless allegations” against Pakistan following a recent incident in Pahalgam, an area in Indian-held Kashmir.\n\nThe cabinet expressed regret that India had escalated tensions despite Pakistan’s offer for a transparent investigation — a move the cabinet described as a “grave threat to regional peace”.\n\nExpressing sorrow for the recent Noshki tragedy, the cabinet conveyed condolences to the victims’ families. Mr Bugti informed cabinet members that helicopters and ambulances were promptly dispatched to transport the injured to Quetta, with critically injured patients later airlifted to Karachi. He also praised the “timely and commendable” response of the whole health sector.\n\nAmid concerns raised by the Noshki incident, the cabinet voiced serious alarm over illegal smuggling in the province, particularly of fuel and commodities, terming it a critical issue. A thorough investigation was ordered to determine responsibility.\n\nSeveral legislative and administrative decisions were made during the meeting. These included the approval of the Balochistan Establishment of Special Court for Overseas Pakis­tanis’ Property Act, 2025, to protect the property rights of overseas citizens and resolving related disputes.\n\nTo address terrorism and missing persons issue, the cabinet approved the establishment of a Centre of Excellence on Countering Violent Extremism. It also passed the Balochistan Anti-Terrorism (Amendment) Bill 2025 to strengthen counter-terrorism efforts.\n\nOther approvals included amendments to the Balochistan Civil Servants and Employees Benefit and Death Policy 2020, and the formation of the National Food Safety, Animal and Plant Health Regulatory Authority.\n\nIn support of labour rights, the Balochistan Labour Rules were ratified to eliminate forced labour and protect home-based workers. The cabinet also approved rules for persons with disabilities (Rules 2024) and amendments to the Motor Vehicles Rules 1969 under the Excise and Taxation Department.\n\nA four-tier service structure for pharmacists and drug inspectors was introduced to enhance career progression. The cabinet also approved the Balochistan Local Councils Street Rules 2025 and decided to advertise all vacant posts from grades 1 to 15 to ensure merit-based recruitment.\n\nTo protect the environment, the cabinet passed the Balochistan Safe and Envi­ronmentally Sound Recycling of Ships Bill 2025. The cabinet also instructed the Food Department to sell existing wheat stock in the open market to prevent spoilage, with pricing determined by a bid acceptance committee.\n\nAdditionally, Rs140 million was released for the Quetta Safe City Project, with a completion deadline set for June 2025. The appointment of the chairman of the Balochistan Board of Intermediate and Secondary Education was also endorsed.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:43:54.646Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907491/balochistan-cm-slams-indian-aggression",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:57:32.000Z"
}
