{
  "title": "SC irked by judges’ transfer debate under garb of public interest - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Justice Shahid Bilal Hassan, a member of Supreme Court’s constitutional bench, on Tuesday questioned how the concept of public interest could be tied to the transfer of a judge from one high court to another, given that every judge is bound to administer justice in accordance with the law and the Constitution.\n\nHe noted that it was also important to define “public interest” when a judge’s reputation is frequently debated within legal circles and at different bars, labelling such discussions as being in the public interest.\n\nJustice Hassan made these remarks while pointing toward senior counsel Muneer A. Malik, who commenced formal arguments on behalf of five judges of the Islamabad High Court (IHC) before the constitutional bench.\n\nThe five-judge bench, headed by Justice Muhammad Ali Mazhar, was hearing a set of petitions against inter-se seniority of five sitting judges of the IHC namely Justice Mohsin Akhtar Kayani, Justice Tariq Mehmood Jahangiri, Justice Babar Sattar, Justice Sardar Ejaz Ishaq Khan and Justice Saman Rafat Imtiaz.\n\nIn their joint petition, the IHC judges urged the SC to not treat the three recently transferred judges as IHC judges until they take a fresh oath under Article 194, read in conjunction with Schedule III of the Constitution.\n\nMunir A. Malik says temporary transfers are in the very spirit of federalism\n\nThe observation by Justice Hassan came when the senior counsel, Mr Malik, contended what constituted the best public interest behind judges’ transfer from one high court to another had to be established. Any transfer done under Article 200 is a temporary in nature in the spirit of federalism, the counsel argued.\n\nJustice Hassan, however, asked the senior counsel to define what exactly should be the period for a judge to serve after his transfer to a high court from another on a temporary basis. The counsel replied that based on the constitutional history of the country, the upper limit of transfer of the judge should be two years.\n\nJustice Mazhar intervened to say that the other way round could be transfer for an unlimited period if a judge concedes to be transferred since the constitution does not provide any limit or period for the transferred judges to serve.\n\nThe counsel said that in case a high court has a backlog of cases of a particular nature, such as criminal cases, due to a dearth of judges having expertise in that subject, the transfer period of a judge should commensurate with the backlog of the cases.\n\nAbout the term “public interest” in the judicial context, the lawyer said that the public interest should mean better administration of justice, with the underlying purpose of ensuring access to justice. Also, he said, any consideration of the public interest should be taken into account before initiating the process of transferring a judge from one high court to another.\n\nAt this, Justice Salahuddin Pan­whar commented that the counsel see­med not disputing the transfer but the seniority of judges due to the transfer.\n\nJustice Mazhar highlighted that even the temporary transfer could affect the seniority of judges. He elaborated that if a judge opted for transfer, he would lose his seniority and become junior to his juniors. The key question of judges’ seniority would remain intact, he noted.\n\n‘JCP power can’t be usurped’\n\nThe counsel argued that Article 200 must be read with Article 2A that enshrines the independence of the judiciary and could not be interpreted in a way to collide with Article 175(A), which relates to the Judicial Commission of Pakistan (JCP) on judges’ appointment.\n\nUnder the garb of exercising Article 200, the counsel emphasised, the president could not usurp the JCP powers on judges’ appointment. All the members of the 17-body JCP were at a par with each other and enjoy the constitutional backing to nominate candidates for their appointment as judges of the superior courts.\n\nThis power to nominate “for the appointment of judges” had not been conferred to the Chief Justice of Pakistan (CJP) and chief justice of the two relevant high courts, according to the counsel. He argued “such transfers” were in fact for a temporary period and were in the very spirit of the federalism.\n\nThe constitution contemplates five different high courts and the JCP composition varies for each high court while the CJP become only a paterfamilias (head of the institution), he said, adding that the autonomous and independent character of the high court would be compromised otherwise.\n\nJustice Mazhar, however, reminded him that the CJP was no more “paterfamilias” in the appointment procedure as judges were elevated with a majority vote where every member has a vote of his own.\n\nThe counsel argued that a lawyer practising in a particular province would always be considered for the appointment in the particular high court, otherwise the provincial bar would have no say in the meetings of such JCPs.\n\nHe was of the opinion the permanent vacancies in the Sindh High Court could not be filled by judges of the Islamabad High Court, he said. The counsel would continue his arguments on Wednesday.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/30075906457eccc.jpg",
  "retrievedAt": "2025-08-25T14:44:09.294Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907461/sc-irked-by-judges-transfer-debate-under-garb-of-public-interest",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:57:21.000Z"
}
