{
  "title": "Four children injured in Bajaur mortar shell attack - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR/KHYBER: Four children were wounded when a mortar shell, fired from an undisclosed location, hit a house in the Bara Laghari area of Lowi Mamund tehsil in Bajaur tribal district on Tuesday.\n\nAlso, one person was killed and two injured in a landmine explosion in a hilly area of Tirah Valley in Khyber tribal district.\n\nPeople and Rescue 1122 in Bara Laghari area told Dawn that the mortar shell struck the house of resident Iqbal Khan at around 10am, critically injuring four children.\n\nThe children included Nisa, 6, Raisa, 8, Riyan, 3, and Mehnaz, 9, who were immediately shifted to the district headquarters hospital, Khar, according to Rescue 1122 in a statement.\n\nResidents stage protest in Bara Laghari area; Tirah landmine blast claims life\n\nOfficials at the hospital said a child was referred to a Peshawar hospital due to critical injuries. The incident caused panic among the residents.\n\nAn official of the Lowi Mamund police station, who, along with a team, visited the house, said that an investigation had begun to ascertain the location from where the mortar shell fired.\n\nScores of people, including traders, youth and political and social activists, later demonstrated in Laghari Bazaar. They expressed concerns over the incident.\n\nThe speakers, including the Nawagai tehsil council chairman, PTI senior local leader Najib Khan Mamund and JI Mamund tehsil emir Hafiz Ghulam Rehman, demanded a thorough investigation into the incident and strict punishment for culprits.\n\nLocal political leaders and social activists, including ANP MPA Mohammad Nisar Khan, former PTI MNA Gul Zafar Khan and JI district chief Sahibzada Haroon Rasheed, expressed concerns over the incident and urged authorities to investigate it without delay.\n\nAlso, Khar subdivision assistant commissioner Dr Sadiq Ali visited the DHQ Hospital Khar to inquire after the injured children, according to an official statement. He directed the hospital management to ensure the best treatment of the children.\n\nMeanwhile, Sher Mohammad, 33, his younger brother, Khalid, and relative Usman mistakenly stepped on an underground landmine in the hilly Sandapal area of Tirah valley on Tuesday, causing it to explode.\n\nSources said the explosion occurred near an abandoned security checkpost. They said that the blast killed Sher Mohammad and injured Khalid and Usman.\n\nSources said that the security forces had planted landmines around their posts in order to prevent terrorist attacks. The Sandapal post was abandoned by the personnel lately but the landmine remained there.\n\nThey said that the deceased belonged to a poor family, comprising his widow and six children, and was its lone breadwinner.\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/681154011fdab.jpg",
  "retrievedAt": "2025-08-25T14:43:42.695Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907424/four-children-injured-in-bajaur-mortar-shell-attack",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:58:18.000Z"
}
