{
  "title": "NCRC launches first-ever national report on situation of children - Pakistan - DAWN.COM",
  "author": null,
  "content": "The National Commission on the Rights of the Child (NCRC) on Wednesday launched its inaugural State of Children in Pakistan Report 2024, the first report of its kind that highlights the situation children face in Pakistan.\n\nIn January, Prime Minister Shehbaz Sharif said over 22 million children are out of school in Pakistan, emphasising that out of the total figure, a disproportionate number were girls.\n\nThe report was launched at a ceremony in Islamabad, attended by Federal Minister for Human Rights Azam Nazeer Tarar, as well as ambassadors, UN representatives, parliamentarians, civil society representatives and child rights advocates.\n\nThis first-of-its-kind national report offers a comprehensive, evidence-based overview of the situation of children in Pakistan, covering key areas such as health, education, child protection, participation, and overall welfare.\n\nDeveloped to address the persistent gap in consolidated child-focused data, the report draws from a wide range of credible sources to present a clear picture of both progress and challenges.\n\nKey findings from the report highlight persistent issues such as “high numbers of children out of school, malnutrition, child labour, child marriage and the vulnerability of children with disabilities and those from minority communities”. The report also documents progress in immunisation, legal reform and awareness campaigns.\n\n“While there are initiatives to expand access to education and accelerate learning, over 26 million children aged 5 to 16 are still out of school, and less than half of fifth-grade students can read or perform basic arithmetic, the report read.\n\nThe report concludes with practical, actionable recommendations to improve outcomes for children, including “investing in early childhood development, strengthening child protection systems and ensuring inclusive education and healthcare services”.\n\nIn her welcome remarks at the launch ceremony, NCRC Chairperson Ayesha Raza Farooq stated, “While segregated and fragmented data has always existed, there has never been a comprehensive national report built exclusively on a child rights-based framework that integrates data across sectors — education, health, child protection, justice, inclusion, and participation.”\n\nShe added that the report is designed to address the data gap and serve as a foundational resource for policymakers, researchers, development partners, and advocates.\n\n“Importantly, this report is also timely in view of Pakistan’s upcoming review by the UN Committee on the Rights of the Child (UNCRC), scheduled for May 2025,” she noted. “We hope the Committee will view this report as a serious and constructive step towards accountability and transparency in fulfilling our obligations under the UNCRC.”\n\nAs part of the launch event, a panel discussion titled ‘Realising the Convention on the Rights of [the] Child in Pakistan’ was held, featuring prominent experts and practitioners.\n\nModerated by NCRC technical adviser Valerie Khan Yousafza, the panel included FIA Additional Director Amna Baig, Sahil executive director Dr Manizeh Bano, Unicef data and analytics manager Achraf Mohamed Mrabet, Justice Project Pakistan Executive Director Sarah Belal and Ministry of Human Rights Director General Muhammad Arshad.\n\nThe discussion highlighted critical intersections between policy, data, and action required to fulfil the rights of children in line with the UNCRC.\n\nBaig emphasised the importance of forging strong partnerships with social media platforms to address cybercrime, noting, “Global policies often fail to reflect local realities, particularly in the context of transnational crimes, calling for greater contextualisation of international best practices.”\n\nBelal, meanwhile, called for reworking the juvenile justice framework in the country, stressing that child victims “should not be criminalised and instead should be supported through diversion programs, rehabilitation centres, and an increased number of probation officers”.\n\nDr Bano spoke of the difficulties faced by civil society organisations in raising awareness around child rights and urged for stronger grassroots engagement, while Mrabet underscored the role of robust data in informing targeted interventions and understanding emerging trends in child welfare.\n\nMeanwhile, Arshad reaffirmed the government’s commitment to using the study’s findings to “shape evidence-based policies and ensure the implementation of the UNCRC across all levels of governance”.\n\nJo Moir, Development Director at the British High Commission, said,“We are delighted to have supported Pakistan’s first Status of the Children Report supported by the UK’s ‘Aawaz II’ programme.\n\n“The report provides robust evidence that will enable the Government of Pakistan to align its policies and services to respond to the needs of Pakistan’s children and youth more effectively,” she said, adding that the UK remains committed to building a better future for the children of Pakistan.\n\nSpeaking at the event, Tarar praised the NCRC’s initiative.\n\n“With over 40% of our population under the age of 18, the wellbeing of our children is not just a moral imperative — it is a national priority,” he stated. “This report will serve as a critical tool in informing policy and guiding reforms.\n\n“I want to reaffirm that the Government of Pakistan is actively working to strengthen child protection systems through enhanced coordination between federal and provincial departments,” Tarar added. “The Ministry of Human Rights is leading the efforts, from the policy level down to the grassroots.\n\n“This report hopes to serve as an all-encompassing guide on the current situation and framework with regards to the future generations of Pakistan and how we can do better by them,” he said.\n\nLast year, Sahil’s Six Months Cruel Numbers data revealed that a total of 1,630 cases of child abuse were reported from across the country.\n\nIn the first six months of 2024, 862 cases of child sexual abuse, 668 cases of abduction, 82 cases of missing children and 18 cases of child marriages were reported. Additionally, 48 cases of pornography after sexual abuse were also recorded.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:43:19.171Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907585/ncrc-launches-first-ever-national-report-on-situation-of-children",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T18:40:25.000Z"
}
