{
  "title": "US economy shrinks, Trump blames Biden - World - DAWN.COM",
  "author": null,
  "content": "The US economy unexpectedly contracted in the first three months of the year on an import surge triggered by President Donald Trump’s tariff plans, although he pinned the blame squarely on his predecessor.\n\nThe sharp increase in imports was a reflection of businesses and consumers stockpiling foreign goods to get ahead of Trump’s sweeping trade levies, which went into effect earlier this month.\n\nAll three major Wall Street indices fell on the economic news, with the Nasdaq sliding more than 2 per cent before paring some losses, while oil prices extended their losses.\n\nAt a cabinet meeting in Washington, Trump insisted the growth downturn was the legacy of former president Joe Biden’s policies.\n\n“That’s Biden, that’s not Trump,” he said.\n\nStriking a more positive tone, he highlighted the “whopping” 22pc rise in gross domestic investment during the first quarter.\n\nAnnual economic growth stayed above 2pc in every year of Biden’s presidency, reaching 2.8pc in 2024.\n\nThe gross domestic product (GDP) of the world’s largest economy decreased at an annual rate of 0.3pc in the first quarter, after growing 2.4pc in the final months of 2024, according to Wednesday’s first estimate from the US Commerce Department.\n\nThis was sharply below the market consensus estimate of 0.4pc growth, according to Briefing.com, and marked the first quarterly contraction since 2022.\n\nThe Commerce Department said in a statement that the contraction was in large part down to an “upturn in imports,” aided by a decline in consumer and government spending.\n\nIn a statement, the White House called GDP a “backward-looking indicator.”\n\n“It’s no surprise the leftovers of Biden’s economic disaster have been a drag on economic growth,” White House Press Secretary Karoline Leavitt said. “But the underlying numbers tell the real story of the strong momentum President Trump is delivering.”\n\nThe GDP figures were published on the 101st day since Trump returned to the White House, along with fresh data showing a slowdown in the US Federal Reserve’s favoured inflation gauge last month.\n\nTrump’s introduction of sweeping tariffs against most countries sparked a selloff in financial markets, sending volatility to levels not seen since the Covid pandemic.\n\n“This decline in GDP is a blaring warning to everyone that Donald Trump and Congressional Republicans’ failed MAGA experiment is killing our economy,” top Senate Democrat Chuck Schumer said in a statement.\n\nFollowing the dramatic market movements in early April, the Trump administration announced a 90-day pause to the higher tariffs for dozens of countries to allow for trade talks, while maintaining a baseline 10pc rate for most countries.\n\nBut the administration has also added to the tariffs on China, with the level of duties introduced since January now totalling 145pc — with some sector-specific measures pushing levies even higher.\n\nBeijing has responded with its own steep, targeted measures against US goods.\n\nAt the cabinet meeting on Wednesday, Trump said China was getting “hammered” by the tariffs, and said he still hoped to make a deal with Beijing, whom he referred to as “the leading candidate for the chief ripper-offer” of America.\n\n“Maybe the children will have two dolls instead of 30 dolls,” Trump said, arguing that the United States did not need many of the things China produced.\n\n“And maybe the two dolls will cost a couple of bucks more than they would normally,” he said.\n\nEconomists at Wells Fargo wrote in an investor note that the US economy is at a greater risk of recession now than a month ago, “but this 0.3pc contraction in Q1 GDP is not the start of one.”\n\n“It reflects instead the sudden change in trade policy that culminated in the biggest drag from net exports in data going back more than a half-century.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/010101391f1b99f.jpg",
  "retrievedAt": "2025-08-25T14:43:27.827Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907578/us-economy-shrinks-trump-blames-biden",
  "dateList": "2025-04-30",
  "date_published": "2025-04-30T13:07:47.000Z"
}
