{
  "title": "India greats welcome ‘rise of a phenom’ in teen sensation Suryavanshi - Sport - DAWN.COM",
  "author": null,
  "content": "BENGALURU: India batting great Sachin Tendulkar led the plaudits for 14-year-old Vaibhav Suryavanshi after the Rajasthan Royals batter became the youngest centurion in men’s Twenty20 cricket with a knock for the ages in the Indian Premier League.\n\nLeft-handed opener Suryavanshi had shown glimpses of his ability with a first-ball six on his IPL debut earlier this month, and on Monday his explosive talent was on full display as he tore apart Gujarat Titans with a 38-ball 101 in the Royals’ eight-wicket win.\n\nRajasthan coach Rahul Dravid forgot about his leg injury and leapt from his wheelchair when Suryavanshi completed his ton in only 35 balls — the fastest by an Indian player in the league and second only to Chris Gayle’s 30-ball century in 2013\n\n“It is like a dream,” the teenager said.\n\nNicknamed “Boss Baby”, Suryavanshi has drawn instant comparisons with West Indies great Gayle, who styled himself as the “Universe Boss”.\n\nSuryavanshi, who made headlines when bought by Rajasthan for $130,500 after a bidding war at the November auction when aged 13, has been fearless in the face of seasoned opponents.\n\nHe announced himself on debut earlier this month by launching his first ball in the IPL for six off experienced India pace bowler Shardul Thakur on his way to a quickfire 34 off 20 balls.\n\nNine days later in Jaipur, Suryavanshi destroyed a bowling attack comprising India’s Mohammed Siraj, Ishant Sharma and Washington Sundar, shredding reputations as he hit 94 of his 101 runs in boundaries — 11 sixes and seven fours.\n\n“Vaibhav’s fearless approach, bat speed, picking the length early and transferring the energy behind the ball was the recipe behind a fabulous innings,” Tendulkar posted on social media. “End result: 101 runs off 38 balls. Well played!!”\n\nSuryavanshi took 28 in one over off veteran quick Sharma on his way to a 17-ball fifty. He then gave Afghanistan pace bowler Karim Janat a debut to forget, blasting 30 runs — three sixes and three fours — off his first IPL over.\n\n“What were you doing at 14?!!” wrote former India all-rounder Yuvraj Singh. “This kid is taking on the best bowlers in the world without blinking an eyelid … Playing with a fearless attitude. Proud to see the next generation shine.”\n\nSuryavanshi hit a six off Afghanistan spin wizard Rashid Khan to bring up his century.\n\n“Have you ever seen anything like this?” former Australia white-ball captain Aaron Finch posted on social media. “What a talent!”\n\nFormer India skipper Krishnamachari Srikkanth, renowned as a big hitter during his era, said the nation had found its newest superstar.\n\n“At 14, most kids dream and eat ice cream,” he wrote. “Vaibhav Suryavanshi delivers a fabulous 100 against one of the contenders for the IPL. Composure, class, and courage beyond his years. We’re witnessing the rise of a phenom.”\n\nCommentator Harsha Bhogle agreed with the 1983 World Cup winner’s assessment.\n\n“He [Suryavanshi] is only a child, but how would you ever know once he puts that helmet on,” he added. “This is a staggering performance and a grand announcement.”\n\nIndia’s T20 skipper and Mumbai Indians batsman Suryakumar Yadav said it had been “carnage of an innings” and “absolutely insane!” Suryavanshi, who can also bowl spin, comes from India’s poorest state, Bihar.\n\nOn Tuesday, Bihar chief minister Nitish Kumar announced a cash prize of one million rupees ($11,700) for the budding batsman.\n\n“I wish that Vaibhav creates new records for the Indian team in the future and brings glory to the country,” Kumar said in a social media post.\n\nSuryavanshi made his domestic debut aged only 12 in the Ranji Trophy in January 2024, then was selected for India’s under-19 squad against a touring Australia team.\n\nHe promptly hit a 58-ball century — the second fastest ton in youth Tests after England’s Moeen Ali in 2005.\n\nRajasthan batting coach Vikram Rathore knew what Suryavanshi was capable of doing at top level cricket after watching him practice a few months ago, and quickly figured it was important to nurture him.\n\n“To do it in front of this kind of crowd and in a situation like this against a really, really good bowling attack, I think it was really special and a lot of credit to him,” Rathore said. “He has a solid head on his shoulders. Today was an extraordinary innings.”\n\nRathore was careful, though, not to pile too much pressure on his young star by comparing him with the great Tendulkar.\n\n“It’s too early to say that and it’s unfair I think on the kid to compare him to Sachin Tendulkar,” he told the post-game news conference. “As I said he’s a new Vaibhav Suryavanshi. He’s a special kid and he’s a special talent. If he keeps working hard he’ll have a special place in Indian cricket I’m sure.”\n\nWith the likes of Dravid and Rathore around him at Rajasthan, Suryavanshi could easily be fast tracked into international cricket.\n\nIPL commentator and ex-West Indies international cricket Ian Bishop said Suryavanshi needs to be surrounded by the right people so that he doesn’t fade out.\n\n“It’s unprecedented, 14 years old. This is new territory,” Bishop said. “The scrutiny on him when he plays the next game, and if he doesn’t score any runs, you know, there are going to be detractors out there … this kid is going to be tested.\n\n“His parents are going to have to be so close to him, and hopefully — I’m sure they are great parents — you’ve got to surround this kid with proper people for the next five years to ensure this high that he’s got so early in his career, there isn’t a drop.”\n\nAfter the game on Monday night, Suryavanshi, who comes from a modest family, credited his success to his parents.\n\nWhatever I am today, I owe it to my parents,“ he said in a video posted on the official IPL handle on X. “My mother used to wake up early because I had to go to practise, and she used to prepare food for me. She would sleep for only three hours. My father left his work for me.”\n\nPublished in Dawn, April 30th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/68115589377bf.gif",
  "retrievedAt": "2025-10-12T02:48:52.329Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907432/india-greats-welcome-rise-of-a-phenom-in-teen-sensation-suryavanshi",
  "dateList": "2025-04-30",
  "date_published": "2025-04-29T23:57:45.000Z"
}
