{
  "title": "Pakistan to organize donors’ conference after completion of flood damage survey: Ahsan Iqbal",
  "link": "https://www.app.com.pk/national/pakistan-to-organize-donors-conference-after-completion-of-flood-damage-survey-ahsan-iqbal/",
  "date_published": "2022-10-17T15:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP):Planning Minister Ahsan Iqbal Monday informed the National Assembly that Pakistan would organize donors’ conference soon after the completion of estimate damage caused by the flood across the country.\nWinding up debate on a motion under Rule 259 regarding situation arising out of the country after flood, the Minister for Planning and Development Ahsan Iqbal said that development partners would complete the estimate flood damage survey on October 24,\nHe asked the citizens across the country to generously donate blankets and quilts for the flood-hit people to save them from cold as the winter season was fast approaching.\nAhsan Iqbal said the international community generously supported relief and rescue operations in Pakistan and now the government seeks further support in the reconstruction and rehabilitation of the flood-affectees.\nHe said at present the top priority of the government was to provide relief and rehabilitation to the flood-affected people.\nThe minister vowed to revive the situation through national unity and support of civil society and national institutions.\nHe said the government would introduce a proactive strategy soon to foster the rehabilitation process adding that stakeholders’ input would be of great significance in this regard.\nAhsan Iqbal said the government was making concerted efforts to provide relief to flood-affectees, “We do not want to waste our time in by-elections as the challenge of rehabilitation is front of us.”\nThe minister said initially the government had distributed Rs. 70 billion under the BISP program to support the flood-affected community and under this program each family received Rs. 25,000.\nHe said the government had approved the distribution of wheat seed worth Rs 9 billion to support the farmers in flood-affected areas which will run with the support of provincial governments.\nAppreciating the efforts of all ministries, departments and security forces in rescue and relief operations, the minister said restoration of connectivity at vital links was not possible without their support.\nAhsan Iqbal said Prime Minister Shehbaz Sharif will soon announce a package for farmers at the Farmer’s Convention.\nHe said the climate change brought this disaster to the country but the spirit of the Pakistani nation was indomitable to overcome this disaster with unity and solidarity.\nHe said even a developed country could not cope with such huge destruction, but the people of Pakistan, the federal and provincial governments, civil society and the friendly countries were all working together to get the country out of this calamity.\nThe minister said the government had also decided to revise the National Flood Protection Plan prepared in 2013 with close consultation with all stakeholders at the federal and provincial governments level.",
  "retrievedAt": "2025-08-11T15:44:42.729Z"
}
