{
  "title": "With low turnout & scattered irregularities, by-elections remained peaceful: FAFEN",
  "link": "https://www.app.com.pk/national/with-low-turnout-scattered-irregularities-by-elections-remained-peaceful-fafen/",
  "date_published": "2022-10-17T17:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): The Free and Fair Election Network (FAFEN) has observed that with only 35 per cent of the registered voters turning out on the polling day, the by-elections (BE-2022) in eight National Assembly and three Punjab Assembly constituencies remained peaceful with scattered instances of irregularities primarily concerning unchecked campaigning inside and around polling stations.\nFAFEN, in its report issued on Monday on the October 16, 2022 by-elections, said the voter turnout in the by-polls remained low as compared to the 2018 general election. The male turnout declined from 57.3 percent in GE-2018 to 39.5 percent in BE-2022, while the female turnout dropped from 45.0 percent to 29.7 percent.\nIn absolute numbers, 470,890 less voters turned out to vote as compared to 1,962,800 voters in GE-2018. The highest voter turnout (53.3 percent) was recorded in PP-209 Khanewal-VII and the lowest (14.8 percent) in NA-239 Korangi Karachi-I.\nThe lowest female turnout remained at 10.4 percent, recorded in NA-31 Peshawar-V, raising the need for the Election Commission of Pakistan (ECP) to look into the reasons in the spirit of section 9 of the Elections Act, 2017.\nAs many as four constituencies had less than 20 percent female turnout as compared to one with a male turnout below 20 percent.\nThe voters’ turnout remained especially abysmal in two Karachi constituencies (NA-239 Korangi Karachi-I and NA-237 Malir-II), where cumulatively 17.6 percent of the registered voters exercised their right to vote as compared to 27.4 percent turnout in three Khyber Pakhtunkhwa (KP) constituencies and 44.8 percent in six Punjab constituencies\nAccording to the Provisional Consolidated Statement of Results of the Count (Form-47), Pakistan Tehreek-e-Insaf (PTI) candidates won six National Assembly, and two Punjab Assembly (PA) constituencies, Pakistan Peoples’ Party Parliamentarians (PPPP) won two National Assembly constituencies, and Pakistan Muslim League – Nawaz (PML-N) one Punjab Assembly constituency.\nFAFEN observed that only three of the total 118 contesting candidates of the by-elections were women, reinforcing the need for political parties to reach out to women and other marginalized segments of the population for their political education and emancipation.\nScattered irregularities were observed during the BE-2022, including the presence of unauthorized persons inside polling stations, potentially compromising the efficacy of the electoral process; unchecked campaigning and canvassing inside and outside polling stations – an irregularity that has persisted during the recent by-elections; and oversized polling stations that could have potentially led to overcrowding and disorderly polling.",
  "retrievedAt": "2025-08-11T15:44:40.566Z"
}
