{
  "title": "Coalition govt rejects demand for early elections",
  "link": "https://www.app.com.pk/national/coalition-govt-rejects-demand-for-early-elections/",
  "date_published": "2022-10-17T16:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP):The coalition government Monday categorically rejected the demand of Chairman Pakistan Tehreek I Insaf (PTI) Imran Khan for early elections and said the allies would decide about the timing of elections in the country.\nIn a joint statement, the government allies said no group on the basis of its power would be allowed to impose its will.Those who would take law into their hands would be dealt with according to the constitution and law.\nIn the statement, the allied parties in the government strongly condemned the statements and allegations against former president Asif Ali Zardari and Quaid Pakistan Muslim League (N) and former prime minister Muhammad Nawaz Sharif.\nIn the statement, the coalition partners said prime minister of Pakistan would decide about the appointment of army chief and it would not be done because of pressure of the foreign funded anarchist and threats and dictation.\nThe targeting of the army chief, leadership of the intelligence agencies, officers, Chief Election Commissioner and others was blackmailing and was not a political attitude but part of a conspiracy which would not be not allowed to succeed.The constitution and law were clear that the prime minister had the constitutional authority to make appointments, of army chief and on other posts.\nAccording to the statement, a person deprived of power was targeting national institutions according to a well thought out agenda.The dirty campaign against the martyrs of Pakistan army, statements about mutiny in the army and instigation, were the steps akin to animosity against the country and would be dealt with according to the constitution and law.\nThe hooliganism and pressure tactics would not be allowed to make the constitution, democracy and system hostage.It was clarified in the statement that the economy of the country and rehabilitation of the flood affectees at this time was a national priority and no compromise would be made on it.The government, institutions and the system were unanimous that political instability would not be allowed, rather the process of putting the economy back on track and provision of assistance to the flood affectees would not be allowed to be affected.\nIn the statement, it was further said that after the bye elections of October 16, 2022, seats of the coalition government in the National Assembly had increased from 174 to 176 and due to arrogance of a lunatic the PTI had eight seats less in the National Assembly.",
  "retrievedAt": "2025-08-11T15:44:40.568Z"
}
