{
  "title": "PM for immediate removal of all hurdles in way of SDF’s projects in Pakistan",
  "link": "https://www.app.com.pk/national/pm-for-immediate-removal-of-all-hurdles-in-way-of-sdfs-projects-in-pakistan/",
  "date_published": "2022-10-17T17:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP): Prime Minister Muhammad Shehbaz Sharif on Monday directed the concerned authorities to immediately remove all hurdles in way of pending projects related to Saudi Fund for Development (SDF).\nHe gave this direction during the meeting here with a delegation of Saudi Development Fund, which was led by the Fund’s Director General of Asia Operations Dr. Saud A Alshammari.\nThe Prime Minister also directed the Special Task Force for Saudi Arabia to get the solution of all issues in coordination with all stakeholders during the stay of Saudi delegation in Pakistan.\nThe Special Task Force comprised Federal Minister for the Board of Investment (BOI) Chaudhry Salik Hussain, Advisor to PM Ahad Cheema, Special Assistants to PM Tariq Fatemi and Jahanzeb Khan.\nThe Prime Minister welcoming the delegation highlighted the fact that Pakistan was like a second home for the people of Saudi Arabia and Pakistanis also considered Saudi Arabia as their second home.\nEncouraging the Saudi delegation to invest in Pakistan’s solar energy sector, he said that the present government was paying special attention to the promotion of this cheaper and green source of energy so that foreign exchange could be saved and people be provided cheaper electricity.\nThe Prime Minister said that Saudi Arabia always stood with Pakistan on domestic and external fronts, adding, the Saudi leadership had always extended unconditional support and help to Pakistan.\nHe said that Saudi Arabia extended all out support to Pakistan in tackling the devastation caused by recent floods. In that respect, he offered special thanks for King Salman bin Abdulaziz Al-Saud and Prime Minister and Crown Prince of Saudi Arabia Muhammad Bin Salman.\nThe Prime Minister further said that Saudi Arabia had played an important role in the development of Pakistan through the provision of grants, loans and in the form of investment.\nFederal Minister for the Board of Investment Chaudhry Salik Hussain, Advisor to PM Ahad Cheema, Special Assistants to PM Tariq Fatemi and Jahanzeb Khan, Saudi Ambassador in Pakistan Nawaf bin Said Al-Malki and senior officers concerned attended the meeting.",
  "retrievedAt": "2025-08-11T15:44:41.244Z"
}
