{
  "title": "PTI should respect opponent parties’ mandate instead of maligning them: Rana Sanaullah",
  "link": "https://www.app.com.pk/national/pti-to-respect-mandate-of-other-parties-given-by-voters-in-by-election-rana-sanaullah/",
  "date_published": "2022-10-17T11:35:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 17 (APP):Minister for Interior Rana Sanaullah on Monday said that Election Commission of Pakistan (ECP) had conducted the by-elections on October 16 responsibly and impartially, and the Pakistan Tehreek-e-Insaf should accept the mandate given to its opponent political parties by the voters instead of maligning them.\nAddressing a press conference, the minister said the PTI had got overall 547,652 votes against all the seats vice 475,037 by its opponent political parties. “If Imran Khan wants us to accept the decision of 547,000 voters then he himself will have to accept the mandate of 475,000 voters given to us.”\nThose who had voted against the PTI were also patriotic and it was unfair to use derogatory language against them, he added.\n“The results of free and fair elections should be accepted as per democratic norms. The vote should be respected while the decisions of voters should be honoured,” the minister said. No one would be allowed to disrespect the voters, who had cast their vote against the PTI.\n“If the PTI leadership wants us to accept the decision of their voters then they will also have to accept the decision of those who have voted in favour of the PDM (Pakistan Democratic Movement) candidates,” he said. Democratic norms and traditions demanded that the results of free and fair elections should be accepted.\nHe said all the institutions fulfilled their responsibilities within their constitutional ambit, especially the Election Commission of Pakistan for holding the by-polls in a responsible and impartial manner.\nRana Sanaullah said, “We have made a long political struggle and even faced imprisonment but Imran Khan has come to the Parliament from the cricket ground”.\nHe said the PML-N emerged stronger in the by-election as compared to the 2018 general election as its candidates secured more votes from Sharaqpur and Khanewal. “We will be more stronger in the next general election when the PTI will have no more support from the provincial governments”, he added.\nThe minister said Imran Khan was removed constitutionally through a no-confidence motion, however the PML-N had to face the loss politically.\nRana Sanaullah said the people in the by elections might have voted against the PML-N because of inflation and price hike as the coalition government had to take tough decisions after coming into power. The PTI government had pushed the country to the verge of bankruptcy.\nThe minister said during the PTI regime the by-elections were won by its opponent parties. “The PTI’s win in the recent by-elections does not mean that it has got the licence to take illegal steps. The government will take stern action if its leadership would go for long march or any other adventure,” he said and added that for early election the PTI would have to come to the table or the parliament.\n“We have sacrificed for democracy, and will ensure rule of law, supremacy of Constitution and protection to parliament and democratic norms at all costs,” he maintained.\nThe minister said the government along with the nation would take action with full force against those who wanted to create any unrest or chaos in the country. “Giving permission to pressure groups would not be allowed at any cost because permission to them means challenging writ of the State,” he added.\nTo a question, the minister said he appeared before the Rawalpindi High Court Bench today but Director General Anti-Corruption did not come in this baseless case against him.\nTo another query, he said PML-N believes resolving issues through negotiations and at the very initial stage of the Charter of Economy, Muhammad Shehbaz Sharif offered Imran Khan for the cooperation to improve economy.\nResponding to a question, Rana Sanaullah said PML-N supermo Muhammad Nawaz Sharif would lead the next general election’s campaign and PML-N would emerge victorious.",
  "retrievedAt": "2025-08-11T15:44:48.020Z"
}
