{
  "title": "Deputy PM inaugurates Solid Waste Management Project in Quetta",
  "link": "https://www.app.com.pk/national/deputy-pm-inaugurates-solid-waste-management-project-in-quetta/",
  "date_published": "2024-08-14T08:19:00.000Z",
  "source": "APP",
  "content": "QUETTA, Aug 14 (APP): Deputy Prime Minister Mohammad Ishaq Dar and Chief Minister Balochistan Mir Sarfaraz Bugti performed inaugural ceremony of the Solid Waste Management Project launched in Quetta here on Wednesday.\nDeputy Prime Minister Ishaq Dar expressed happiness over the launch of the modern Solid Waste Management project in Quetta.\nHe praised the provincial government’s active role under the leadership of Chief Minister Mir Sarfraz Bugti in addressing public issues. Deputy Prime Minister Ishaq Dar stated that the Quetta Waste Management project will provide better sanitation facilities to the public.\nChief Minister Mir Sarfraz Bugti, on the occasion, noted that a short period of three months was given for the project’s planning and implementation. The Chief Minister congratulated the Commissioner of Quetta and his team for starting such an important public project in a very short time.\nHe emphasized that the provincial government is focused on providing basic facilities to alleviate the difficulties faced by the public in Balochistan.\nIn a briefing, Commissioner Quetta Division Hamza Shafqaat said the project initiated in Quetta is the first of its kind in Pakistan.\nHe noted that work on the project commenced within a record time of three months under the directives of Chief Minister Mir Sarfraz Bugti. Starting today, he said, a private company will collect garbage from homes in Quetta.\nCommissioner Hamza Shafqaat added that 1,600 tons of waste will be collected daily from Quetta, with no additional costs to the government. The Municipal Corporation and the private company will work together through multifaceted measures to keep the provincial capital clean, he added.\nThe inauguration ceremony was attended by National Assembly Speaker Sardar Ayaz Sadiq, Federal Minister for Commerce Jam Kamal Khan, Speaker of the Balochistan Assembly Abdul Khaliq Achakzai, provincial ministers, assembly members, advisors, and Chief Secretary of Balochistan Shakeel Qadir Khan.",
  "retrievedAt": "2025-08-11T04:38:11.619Z"
}
