{
  "title": "Pakistan created as result of commitment, sacrifices: Ishaq Dar",
  "link": "https://www.app.com.pk/national/pakistan-created-as-result-of-commitment-sacrifices-ishaq-dar/",
  "date_published": "2024-08-13T20:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP): Deputy Prime Minister and Foreign Minister Senator Mohammad Ishaq Dar has felicitated the nation on the occasion of 77th Independence Day of Pakistan and said the creation of Pakistan was a result of the commitment and sacrifices of their founding fathers who dreamt of an independent and sovereign state free from colonial domination.\n“Today, we pay homage to their contributions and celebrate their vision, resolve and fortitude. Every successive generation has drawn inspiration from them. Every year, we renew our faith in the idea of Pakistan and recommit ourselves to serve Pakistan to the best of our abilities. This year, we are celebrating the Independence Day around the theme “Azm-e-Istehkam: Resolve for Growth and Stability. It is a reflection of our national commitment to grow and prosper as a progressive and modern state”, he said.\nThe deputy prime minister said despite facing multiple odds and challenges, Pakistanis have proven themselves as a strong and resilient nation. They stood firm against the forces of terror, extremism and division, said a press statement on Tuesday quoting the deputy prime minister as saying.\nIshaq Dar stressed that they must unite and work together with a singular focus for a peaceful, tolerant and progressive society.\nOn this Independence Day, Dar also extended special greetings to overseas Pakistanis who have always stood for Pakistan’s progress and development. “Wherever they are, their hearts beat for Pakistan. The Government of Pakistan and all our Missions abroad will always endeavor to serve them and their families,” he added.\nThe deputy prime minister and foreign minister said as they celebrate their independence, they should not forget the people of Palestine and Indian Illegally Occupied Jammu and Kashmir (IIOJK) who remained under colonial occupation.\n“Their sufferings remind us how blessed are we to enjoy the gift of freedom. Today we reiterate our steadfast political, diplomatic and moral support to our Kashmiri brothers and sisters in their just struggle for the right to self-determination,” he added.\nAt the international stage, Dar said that Pakistan would continue to be a voice for the defenceless people facing oppression and foreign occupation.\n“Our foreign policy will always be guided by the values and principles espoused by Quaid-i-Azam Muhammad Ali Jinnah. Let us pledge to work together for a promising future for our country and move forward on a path of peace, democracy and Constitutional supremacy,” he added.",
  "retrievedAt": "2025-08-11T04:38:42.182Z"
}
