{
  "title": "Mohsin congratulates nation on Independence Day",
  "link": "https://www.app.com.pk/national/mohsin-congratulates-nation-on-independence-day/",
  "date_published": "2024-08-14T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 14 (APP):Federal Minister for Interior Mohsin Naqvi has extended heartiest congratulations to the nation on the eve of Independence Day.\nHe said,”we are grateful to Allah Almighty that we are living in a free homeland. He said that we must learn the value of freedom from the enslaved nations.”\nHe emphasized that we must appreciate the true value and dignity of our free homeland. He also highlighted that millions of Muslims sacrificed their blood to light the flames of freedom.\nHe paid rich tribute to the unparalleled sacrifices of those who were martyred in the Pakistan Movement. He also honoured the great sacrifices of the martyrs who sacrificed their lives for the peace of the homeland.\nInterior Minister stated that there is no country as beautiful and resource-rich as Pakistan in the world, but unfortunately, as a nation, we have wasted 77 years in mutual dicords, parochial, linguistic and sectarian biases.\nHe stressed that now is the time for the entire nation to unite and think about Pakistan collectively, because if Pakistan exists, so do we all.\nHe underscored that we must set aside egos, differences, and divisions forever and contribute towards making Pakistan a great country. He said, “Independence Day demands  that we must learn from past mistakes and move towards a bright future. We must all play our part in national development by following the principles of faith, unity, and discipline.”\nHe expressed confidence that with the grace of Allah Almighty, the nation will overcome every challenge. He called for the resolve to put aside personal interests and work together for the progress and development of Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T04:37:47.402Z"
}
