{
  "title": "Youm-e-Ashura to be commemorated across country on Tuesday",
  "link": "https://www.app.com.pk/national/youm-e-ashura-to-be-commemorated-across-country-on-tuesday/",
  "date_published": "2022-08-08T13:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 8 (APP):’Youm-e-Ashura’, the martyrdom day of Hazrat Imam Hussain, (Razi Allah ho Ta’ala Anho) his family and devoted companions will be commemorated across the country including Rawalpindi and Islamabad on Tuesday with the pledge to pay homage to the supreme sacrifice rendered by the grandson of the last Prophet Hazrat Muhammad (SAW) at Karbala (Iraq).\nMuharram was the month of mourning for the seventh-century martyrdom of Hazrat Imam Hussain (R.A).\nThe mourning processions would be taken out in all the cities and towns of the country. Muslims would perform mourning rituals to mark the ashura, the holiest festival in their calendar in many places across the country.Strict security measures have been ensured by the local managements of different cities and some road closures were also in place to avoid any untoward incident.\nLaw enforcers, including police, Rangers, FC and others have been deployed along the procession routes.\nThe azadars (mourners) would pay glowing tributes to sacrifices offered by Hussain (R.A.) and his companions for the supremacy of Islam. Ulema and Zakireen would highlight the bright and candid teachings of Hazrat Imam Hussain (R.A) and various aspects of Karbala tragedy.\nMedical camps, Sabeels and stalls were also being arranged to provide assistance to the participants.\nMobile phone services have partially been suspended as a security measure in different cities as precautionary measure.\nIn Islamabad, over 613 policemen including one SP, 04 DSPs, and 22 Inspectors would be deployed at various routes of processions to avoid inconvenience to road users.\nNearly, 965 Majalis and 181 mourning processions would be taken out from Islamabad Capital Territory (ICT).\nAs part of the security arrangements, the administration has blocked the routes by erecting containers and other obstacles including barbed wire in the procession routes and the central areas have been sealed from all sides, visitors were being allowed to enter after passing through the walk-through gate.Arrangements have been finalized in Rawalpindi to provide security cover to mourners.\nThree layer security cover would be provided to the main procession besides deploying Quick Response Force (QRF).\nOver 6,000 cops, 2,000 volunteers would guard 447 mourning processions, to guard 1925 Majalis from 6th to 10th Muharram. Six main processions of Zuljinnah, Alam and Tazia would be taken out on Ashura from different areas of the garrison city.\nAll the processions would be culminated at Imambargah Qadimi at 10:00 pm. Nearly 1,000 traffic police personnel would be deployed at various points of the routes of the processions on the ashura day.\nOver 2,500 security personnel would be deployed to guard the main procession while 3,500 cops would provide security cover to other processions and Majalis across the district.",
  "retrievedAt": "2025-08-11T15:21:30.872Z"
}
