{
  "title": "9th Muharram procession concludes peacefully in federal capital",
  "link": "https://www.app.com.pk/national/9th-muharram-procession-concludes-peacefully-in-federal-capital/",
  "date_published": "2022-08-08T18:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP): The 9th Muharram’s main procession was concluded peacefully in the federal capital on Monday after passing through traditional routes amid tight security.\nThe main procession started from Markazi Imambargah Asna Ashri Sector G-6/2 and culminated peacefully after passing through traditional routes.\nThe routes of procession in Sector G-6 was completely closed with major roads blocked and many streets cut off with concrete blocks and barbed wire.\nNinth Muharram-ul-Haram was observed with due solemnity and reverence across the country including federal capital to pay homage to the martyrs of Karbala.\nMuharram was the month of mourning for the seventh-century martyrdom of Hazrat Imam Hussain (RA), the son of Hazrat Ali and the grandson of the Holy Prophet Muhammad (PBUH) during the battle of Karbala (in present day Iraq), by the soldiers of the Caliph Yazid in 680 AD.\nUlema and Zakireen highlighted the teachings of Hazrat Imam Hussain (R.A.) and various aspects of philosophy of Karbala tragedy. There were recitation of Marsiyas (elegies) and noha-khwani (poems which express sorrow).\nOver 2,200 police officials of Islamabad capital police were deployed for providing security to mourners and maintaining peace and tranquility in the city.\nDIG (Safe City), Police officials maintained high vigilance of processions through safe city cameras, surveillance, and drone cameras. The police Commandos along with vehicles performed the security duties at Imambargahs arranging religious gatherings.\nElaborate security arrangements were made by Islamabad capital territory police (ICTP) to avoid any untoward incident during the mourning processions. Heavy contingents of police were deployed along the procession routes. Sharpshooters were deployed at high rise buildings along the route of the procession.\nSome eight walk-through gates were installed at the entry and exit points of the procession. CCTV cameras were also installed to check the entry and exit of people at various points.\nBomb Disposal Squad personnel checked all the routes of the procession. The approach roads leading to Imam Bargahs were sealed off by effective picketing and placing containers.\nSabeels of water, milk and tea were set up along the routes of the processions in remembrance of famine like situation faced by Hazrat Imam Hussain (RA) and his companions.",
  "retrievedAt": "2025-08-11T15:21:30.896Z"
}
