{
  "title": "IG Islamabad visits G-6 Imam Bargah to check security arrangements",
  "link": "https://www.app.com.pk/national/ig-islamabad-visits-g-6-imam-bargah-to-check-security-arrangements/",
  "date_published": "2022-08-08T11:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP):Inspector General of Police (IGP) Islamabad Dr. Akbar Nasir Khan has visited the Central Imam Bargah Asna-e-Ashra G-6 in the federal capital on 9th Muharram-ul-Haram to check the security measures for the central Imam Bargah and the procession.\nAccording to the details, during the visit, SSP Operations and SSP Traffic briefed him about the security arrangements.\nOn this occasion, IG Islamabad said that Islamabad Capital Police has made strict security arrangements throughout the district during the holy month of Muharram.\nIn this regard, 2200 officers and personnel of Islamabad Capital Police had been deployed to ensure the security of Majaalis and processions on the 9th of Muharram.\nWith the help of safe city cameras and drones, the strict monitoring of the main Imam Bargah and the procession was being observed, whose central control room is established in Safe City.\nOut of total 2066 cameras of Safe City Islamabad, with the support of 2050 cameras, the monitoring and surveillance was being ensured.\nPolice 4G network had completely been restored for the first time in five years for the best telecommunication system.\nAll technical resources were being used to ensure the safety of the mourners involved in the procession.\nSecurity was on high alert throughout the district in view of the main procession on the day of 9th Muharram, while the emergency had also been imposed in all the hospitals of the federal capital.\nThe Quick Response Force was ready to deal with any untoward incident.\nTo ensure the security of the procession, the bomb disposal squad was clearing the procession routes with the help of modern technology.\nSpecific points had been allocated for citizens to enter the procession, for which, a heavy contingent of police was deployed for supervision.\nLady police personnel were also deployed for checking of women and there are separate entry points for them to enter the procession.\nDIG Operations Sohail Zafar Chattha was supervising all security arrangements for the procession.\nIG Islamabad said that Islamabad Capital Police is all time ready to ensure peace in Islamabad.\nNo element will be allowed to disturb the law and order situation im capital, he added.",
  "retrievedAt": "2025-08-11T15:21:30.872Z"
}
