{
  "title": "NLPD holds one-day seminar  in connection with Pakistan Resolution Day",
  "author": null,
  "content": "ISLAMABAD, Mar 21 (APP):National Language Promotion Department (NLPD) Friday held a one-day seminar titled ‘Pakistan and Urdu’ in connection with Pakistan Resolution Day.\nThe event was presided over by Director General of NLPD, Professor Dr Muhammad Saleem Mazhar.\nThe distinguished guests included Professor Dr Muhammad Naeem Khan from Punjab University and Professor Dr. Tahir Jamil from Quaid-e-Azam University, Islamabad.\nIn his address, NLPD Executive Director Dr Rashid Hameed highlighted the significance of the Pakistan Resolution.\nHe remarked, “Our leaders established a new country in just seven years under colonial rule. If they could achieve such a remarkable feat, why can’t we play our role in making Pakistan an exemplary nation today?”\nIn his presidential address, Professor Dr Muhammad Saleem Mazhar emphasized the sacrifices made by the nation’s forefathers to secure independence.\n“There may be shortcomings in any human system, but we remain hopeful for a bright future. By taking inspiration from our elders, we will continue to serve both Urdu and the country,” he stated.\nProfessor Dr Muhammad Naeem Khan underscored Urdu’s role as a unifying language across Pakistan and its historical significance in the Pakistan Movement.\n“Urdu is a sweet, soft, and gentle language that will continue to contribute positively to national progress,” he noted.\nProfessor Dr Tahir Jamil reflected on the complexities of the subcontinent’s political landscape and how the Pakistan Resolution stood as a testament to the exceptional leadership that led to the creation of a Muslim state.\n“Our leaders skillfully safeguarded Muslim identity amidst Hindu-dominated politics, ultimately paving the way for Pakistan’s establishment,” he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:54:43.643Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/nlpd-holds-one-day-seminar-in-connection-with-pakistan-resolution-day/",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T15:23:00.000Z"
}
