{
  "title": "CDNS resumes its Islamic Window Operations in Nov 2024: NA told",
  "author": null,
  "content": "ISLAMABAD, Mar 21 (APP):Minister of State for Railways, Bilal Azhar Kayani, addressing a Calling Attention Notice, confirmed that the Central Directorate of National Savings (CDNS) had resumed its Islamic Window Operations in November 2024.\nThe notice was raised by Ms. Aliya Kamran to draw the attention of the Finance and Revenue Department to an urgent public concern regarding the non-implementation of National Savings schemes in compliance with Islamic Shariah, which has caused significant distress among the public.\nKayani explained that CDNS had initially launched its Islamic investment schemes in July 2023, offering four different products with varying tenures, including options for running accounts as well as one-year, three-year, and five-year deposit plans. These schemes were designed in accordance with Islamic financial principles.\nHowever, due to the exhaustion of underlying assets that back these instruments, the operations were temporarily suspended in February 2024. Once additional assets were secured, the operations resumed in November 2024. So far, investments in these Islamic financial products have reached Rs. 64 billion, with availability across physical branches and digital platforms.\nThe Minister assured that existing investors who had invested before the February 2024 suspension faced no disruptions in their returns. The temporary halt only affected new customers, who were able to invest again starting in November 2024.\nHe further noted that, apart from Islamic financial products, CDNS continues to offer other national savings schemes for the general public. The government remains committed to improving these offerings to better serve the people, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:55:03.996Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/cdns-resumes-its-islamic-window-operations-in-nov-2024-na-told/",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T13:11:00.000Z"
}
