{
  "title": "WAPDA Chairman calls for global action to combat climate change",
  "author": null,
  "content": "ISLAMABAD, Mar 21 (APP):Chairman Water and Power Development Authority (WAPDA) Engr Lt Gen Sajjad Ghani (R) has emphasized the urgent need for global efforts to combat climate change and protect the environment.\nIn his message in connection with International Water Day and Earth Hour to be observed on Saturday, he said World Water Day will focus on the theme ‘Save Our Glaciers’, highlighting the importance of preserving these natural water reservoirs. Glaciers, the lifelines of our rivers and a critical source of freshwater, are rapidly retreating due to global warming.\nThis not only threatens water security, but also affects agriculture, energy, and the livelihoods of millions. At WAPDA, we recognize the importance of safeguarding these vital natural reserves and promoting sustainable water management for the stability and prosperity of our country.\nThe Chairman said as the world switches off lights to observe Earth Hour, we join the global movement with the theme ‘Give Earth an Hour’. This symbolic gesture reminds us of our collective responsibility to reduce our carbon footprint and mitigate the impacts of climate change.\nHe said that with a current installed capacity of 9,500 MW of clean, renewable hydel energy, WAPDA is at the forefront of Pakistan’s transition towards low-carbon growth. Through our ongoing mega projects – including Diamer Basha Dam, Mohmand Dam, and Dasu Hydropower Project – we are not only enhancing water storage and energy generation, but also contributing to climate resilience by reducing dependence on fossil fuels. By 2029-30, WAPDA aims to add 9.7 MAF to the water storage and double its hydel capacity, adding another 10,000 MW of green electricity to the National Grid. These efforts are aligned with Pakistan’s broader climate commitments and our vision for a secure, sustainable, and greener future.\nAs we celebrate World Water Day and Earth Hour, let us reaffirm our dedication to protecting the planet and its precious resources. At WAPDA, we will continue to work tirelessly towards a sustainable future, where energy and water needs are met without compromising the ecosystems of our planet. “We urge everyone to join us in this endeavor, as we strive to create a better tomorrow for generations to come,” he concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:55:56.348Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/wapda-chairman-calls-for-global-action-to-combat-climate-change/",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T09:35:00.000Z"
}
