{
  "title": "Motorway police booked 112 drivers for overspeeding",
  "author": null,
  "content": "ISLAMABAD, Mar 21 (APP):The National Highways and Motorway Police (NH&MP) have intensified its campaign against overspeeding, registering 112 FIRs against drivers caught exceeding the speed limit of 150 km/h on major motorways.\nAccording to the NH&MP spokesperson, 112 FIRs have been registered in the different zones of the motorways so far.\nThe crackdown has been enforced on key motorways, including the Lahore-Sialkot Motorway (M2), Lahore-Multan Motorway (M3), and Motorways M4 and M5. As part of the operation, the Motorway Police have taken drivers into custody along with their vehicles and handed them over to the local police. The registered FIRs include charges of negligence and reckless driving.\nLahore-Sialkot Motorway: 8 cases were registered, Lahore-Islamabad Motorway (M-2): 43 FIRs were filed, Lahore-Abdul Hakeem Motorway (M-3): 8 cases were registered, Multan-Pindi Bhattian Motorway (M-4): 12 FIRs were filed and Sukkur-Multan Motorway (M-5): 41 drivers were arrested.\nThe NH&MP reiterated that the speed limit for three-lane motorways is 120 km/h for private vehicles and 110 km/h for public transport. Violations of these limits pose a severe risk to public safety.\nThe department’s spokesperson stressed that ensuring the safety of travelers remains their top priority, with a firm commitment to enforcing traffic laws. Inspector General of Motorway Police, Riffat Mukhtar Raja, has instructed officials to intensify efforts against over-speeding.\nThe Motorway Police reaffirmed their commitment to ensuring safe travel on national highways, urging motorists to abide by speed limits to prevent accidents.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:55:07.059Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/motorway-police-booked-112-drivers-for-overspeeding-2/",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T13:02:00.000Z"
}
