{
  "title": "PM’s economic reforms add Rs 34.5 bln to exchequer",
  "author": null,
  "content": "ISLAMABAD, Mar 21 (APP):The vacation of stay order by the Lahore High Court in the case regarding tax on windfall income of banks resulted in a benefit of Rs 11.5 billion to the national exchequer.\nWhile on this account, overall in a month the national exchequer accrued financial benefit of Rs 34.5 billion.\nThis success was gained due to the vision of economic reforms of Prime Minister Muhammad Shehbaz Sharif and improvement in the performance of the Federal Board of Revenue (FBR).\nThe prime minister had taken notice of the stay order on cases related to tax on windfall income of banks under the Finance Act 2023 and asked the Minister for Law, Minister for Finance, Attorney General and Chairman FBR to constitute the best team to argue these cases.\nIn the last month, due to the efforts of the team, firstly Rs 23 billion were recovered after the verdicts of Sindh High Court and now Rs 11.5 billion were gained from the decision of the Lahore High Court.\nThe prime minister appreciated the efforts of Minister for Law and Justice Azam Nazeer Tarar, Minister for Finance Muhammad Aurangzeb, Attorney General Mansoor Awan, Chairman FBR Arshad Mehmood Langrial, Secretary Finance Imdad Bosal and their team.\nThe prime minister said the ministers of law and finance and the team of attorney general made the historic achievement possible with their hard work.\nHe said due to these creative and strong steps, tax collection could be increased and there would be hope for a better economy.\nA substantial amount of Rs 34.5 billion was deposited in the national exchequer and this money now could be spent on projects of health, education and public welfare, he added.\nHe said with the grace of Allah Almighty Pakistan would soon become self-sufficient with these kinds of steps.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:54:21.667Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pms-economic-reforms-add-rs-34-5-bln-to-exchequer/",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T15:03:00.000Z"
}
