{
  "title": "Pakistan to host first Digital FDI event in April: Shaza",
  "author": null,
  "content": "ISLAMABAD, Mar 21 (APP):Federal Minister for Information Technology and Telecommunication, Shaza Fatima Khawaja Friday said that Pakistan will host its first-ever Digital Foreign Direct Investment (FDI) event on April 29 and 30.\nWhile speaking to ambassadors and officials from Digital Cooperation Organization (DCO) countries, she said the Digital FDI Initiative aims to help countries make policies that attract investment in the digital economy.\nShe invited global investors, ambassadors, and international stakeholders to participate in the event, calling it a big opportunity for Pakistan’s digital sector. “This is a chance for the world to see Pakistan as a new destination for technology and innovation,” she added.\nThe event will include high-level meetings, policy discussions, and networking sessions. It will encourage cooperation between countries in technology and digital investments.\nThe minister said this event marks an important step toward making Pakistan a regional center for technology and innovation. “It’s more than just an event; it shows Pakistan’s readiness to join the global digital economy,” she said.\nShaza Fatima explained that Pakistan is organizing this forum in partnership with the DCO, which is led by Saudi Arabia. The aim is to attract international investment by highlighting Pakistan’s opportunities in the digital and IT sectors. Member states of the DCO and other countries are expected to attend, making it a global platform for digital investment discussions.\n“The main goal is to show Pakistan as a strong option for digital foreign direct investment,” she said. She highlighted that Pakistan has a young and skilled population, with over 150 million people under the age of 35. This makes the country an ideal place for global digital businesses.\n“Our talent in cybersecurity, fintech, and new technologies is growing fast. Many of our startups are close to becoming unicorns,” she said.\nThe minister emphasized the government’s support for entrepreneurship and innovation. She mentioned initiatives like National Incubation Centers and Special Technology Zones, where investors can enjoy benefits such as 10-year tax exemptions and easy repatriation of profits.\nShe also spoke about the new IT Park in Islamabad, which is almost complete and will offer modern infrastructure for businesses wanting to set up in Pakistan.\nFatima Khawaja pointed out some challenges, such as the need for better international payment systems.\nShe said Pakistan is the third-largest freelancing economy but still lacks smooth international payment gateways. This, she said, is a great opportunity for foreign fintech companies.\nShe further announced plans to train over 3 million people in digital skills over the next three years. This initiative is supported by the Ministry of Finance and the Prime Minister and is aimed at preparing Pakistan’s youth for global tech jobs.\nShaza Fatima also shared positive news about Pakistan’s IT exports, which have grown by 27% in the past seven months. Internet usage has increased by 25%, and Pakistan is now recognized as one of the top countries in cybersecurity.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T13:55:58.943Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-to-host-first-digital-fdi-event-in-april-shaza/",
  "dateList": "2025-03-21",
  "date_published": "2025-03-21T09:19:00.000Z"
}
