{
  "title": "Jammu martyrs day commemorated with renewed pledge",
  "link": "https://www.app.com.pk/national/jammu-martyrs-day-commemorated-with-renewed-pledge/",
  "date_published": "2021-11-06T12:41:00.000Z",
  "source": "APP",
  "content": "MIRPUR  (AJK); Nov 06 (APP):Kashmiris on both sides of the line of control observed the Jammu Martyrs anniversary on Saturday to commemorate the supreme sacrifices of the lives given  by over 2.5 lacs Muslim residents of Jammu city in 1947 while migrating to Pakistan.\nThe day is observed every year by the Kashmiris to remember the  supreme sacrifices of lives who were mercilessly slaughtered by the armed Hindu gangsters including the Indian occupying and the dogra military troops with the connivance of the dogra hindu fanatics, under a nefarious pre-planned conspiracy while they were proceeding for migrating to Pakistan near Jammu – Sialkot working boundary.\nAccording to the independent historians and observers,  least 6 lacs muslims in Jammu region were assassinated in first week of November 1947 by the armed extremist Hindus and Sikhs with the backing of the despotic dogra ruler under a pr-planned conspiracy to exercise the genocide of innocent Muslims population of Jammu.\nThe day was observed by every Kashmiri with the renewal pledge to continue the successfully-going struggle for freedom of occupied Jammu Kashmir from the Indian clutches.\nIn Azad Jammu Kashmir special ceremonies including seminars and symposiums were held in various parts of AJK including the capital city of Muzaffarabad to pay glorious tributes  to the Jammu martyrs. Jammu Martyrs Day was marked in Azad Jammu & Kashmir with a mammoth ceremony hosted at the town hall in Mirpur Azad Jammu & Kashmir under the auspices of Jammu & Kashmir Freedom Movement and Jammu & Kashmir Milli Forum with the AJK Prime Minister Sardar Abdul Qayyum Khan Niazi as Chief guest.\nPaying rich tributes to the martyrs of Jammu and Kashmir, speakers including the AJK Prime Minister Sardar Qayyum Niazi and others said that the best way to pay tributes to the martyrs of Jammu is to follow their foot steps with the renewal of the pledge to continue the struggle for freedom.\nLauding  complete unity and solidarity among all the political parties of Azad Jammu & Kashmir on one point agenda of the freedom, speakers underlined that the Kashmiris can perform an affective and result-oriented role for the settlement of the much-delayed Kashmir issue and they should be granted an opportunity to perform the national responsibility to this direction.\nSpeakers called upon the international community to sincerely move for performing  due global obligations  to ensure the early peaceful settlement of Kashmir issue which involves the right to self determination  of about  20 million people of Jammu & Kashmir.\nSpeakers  urged upon the world community and the international organizations to take immediate notice of the  continued Indian state terrorism unleashed against the innocent freedom-loving people in occupied Jammu & Kashmir for their “offense” of raising voice for liberation of the motherland from the Indian yoke and for the achievement of their birth right of self determination.\nThe participants offered fateha for raising the status of the departed souls of the martyrs and the early success of the freedom struggle of Jammu and Kashmir  for the freedom of motherland from the Indian subjugation.\nEarlier, the day  dawned with special prayers,  at Fajr,   in all  the prominent mosques for the early liberation of occupied Jammu Kashmir from Indian yoke through success of Kashmir freedom movement, progress, prosperity and stability of  Pakistan  and Azad Jammu & Kashmir.\nFateh Khawani was offered at various places for the rest of the departed souls of  Jammu and Kashmir  martyrs – under the auspices of various social, political and public representative organizations.",
  "retrievedAt": "2025-08-11T21:34:03.434Z"
}
