{
  "article_id": "2025-01-31_54032161f6ccf8e7166de13861c10e42",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/minister-for-human-rights-chairs-meeting-of-administrative-committee-for-diyat-arsh-and-daman-fund/",
    "retrieved_at": "2025-08-27T12:15:44.069Z"
  },
  "metadata": {
    "title": "Minister for Human Rights chairs meeting of Administrative Committee for Diyat, Arsh and Daman Fund",
    "author": null,
    "date_published": "2025-01-31T12:21:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 339,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 31 (APP): Federal Minister for Law, Justice and Human Rights, Senator Azam Nazeer Tarar, presided over the 10th meeting of the Administrative Committee for the Diyat, Arsh and Daman Fund at the Ministry of Parliamentary Affairs here Friday. The meeting was attended by members of the committee, including Federal Secretary for Human Rights Allah Dino Khowaja, representatives from the Ministry of Interior and officials from the Home and Prison Departments of Punjab, Sindh, Khyber Pakhtunkhwa and Balochistan. The meeting focused on addressing the cases of prisoners who remain incarcerated in jails due to their inability to pay Diyat, Arsh, and Daman amount. The Committee reviewed and approved nine cases forwarded by the Provincial Sub-Committees. These cases involved prisoners eligible under the Diyat, Arsh, and Daman Fund Rules, 2007, including individuals suffering from physical or mental illnesses, women with children, juveniles, orphans, and those who have completed a significant portion of their sentences but lack the financial means to pay their Diyat, Arsh and Daman amount. During the meeting, the Committee members were directed to finalize and submit eligible cases after thorough review, accompanied by legal heirship certificates and certified copies of judgments. They were also instructed to provide detailed case analyzes along with complete documentation for further verification and processing. The federal minister commended the Committee members for their efforts and emphasized the importance of a coordinated approach to ensure that cases are processed efficiently and transparently. He directed all relevant stakeholders, including the Home Departments, Prison Departments and the Ministry of Interior to actively facilitate the process, eliminate procedural delays and ensure that justice is served to deserving individuals. The Federal Secretary for Human Rights emphasized the importance of strong coordination between provincial and federal authorities to safeguard the rights of vulnerable prisoners. He further assured the committee of his support in ensuring that the fund is utilized effectively. The meeting concluded with a shared commitment to uphold the principles of justice, fairness, and human rights while continuing efforts to provide critical support to eligible prisoners.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}