{
  "article_id": "2025-01-31_d6c2264edba24d6d4f9c46f303eddf4a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ihc-suspends-sentences-of-10-accused-in-may-9-cases/",
    "retrieved_at": "2025-08-27T12:15:03.517Z"
  },
  "metadata": {
    "title": "IHC suspends sentences of 10 accused in May 9 cases",
    "author": null,
    "date_published": "2025-01-31T14:18:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 243,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 31 (APP): The Islamabad High Court (IHC) on Friday suspended the imprisonment sentence of ten accused in cases registered against them on protest after the arrest of PTI founder Imran Khan on May 9, 2023. A division bench comprising Justice Mohsin Akhtar Kayani and Justice Sardar Ijaz Ishaq Khan suspended the sentences and approved the bails against surety bonds worth Rs 25,000 each. It may be mentioned here that an Anti-Terrorism Court has announced collectively five years and ten month jail term to the accused in November 2024. The accused were alleged to attack the police and setting fire a police check point near Faizabad. The IHC stated that as per the case record, not even a single accused was arrested from the crime scene. The lawyers told the court that the accused were acquitted from terrorism sections and awarded minor sentences. The order said that the trial court announced sentences on the basis of CCTV footage and other evidences. He prayed the court to reject the request of defense lawyer to suspend the sentences. As per the charge sheet, five accused among the ten were Afghan nationals. The court also directed the accused to submit their original identity cards to Registrar office for verification of their nationality. In case of having Afghan nationality, the deputy registrar would keep the identity document with him, it added. The court also directed all appellants to ensure their attendances before court on every hearing.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}