{
  "article_id": "2025-01-31_0455e530efae9f8289d5ac3b70979e90",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/imran-khans-lawyer-expresses-satisfaction-over-jail-facilities/",
    "retrieved_at": "2025-08-27T12:15:03.582Z"
  },
  "metadata": {
    "title": "Imran Khan’s lawyer expresses satisfaction over jail facilities",
    "author": null,
    "date_published": "2025-01-31T13:47:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 253,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 31 (APP): The Islamabad High Court (IHC) on Friday disposed off the petition of PTI founder Imran Khan and instructed the Adiala Jail administration to provide him facilities as per jail rules. The court stated that PTI founder's lawyer has expressed satisfaction with the facilities being provided to his client in jail. Chief Justice Aamer Farooq issues the written order in plea regarding jail facilities to Imran Khan including meetings, telephonic talk with his sons and others. The court said that the superintendent Adiala Jail has told that the medical examination of PTI founder is being conducted on regular basis and in case of any complaint his medical check up could be done by a private doctor. The officials said thar as per the jail manual there were no phone international call facilities in prison. However, this facility is only provided when there is a court order in this regard. The jail officials said that the meetings of lawyers and family members with PTI founder are arranged on Tuesday and Thursday every week. The prisoner is also being provided two newspapers as per rules. The stated that the jail administration always execute the orders of court regarding the provision of facilities to PTI founder in jail. The court said that the lawyer of PTI founder is satisfy with the facilities to his client so there is no need of interference. The court ordered the jail administration to ensure provision of facilties to Imran Khan in jail and disposed of the case.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}