{
  "title": "DDC polls not an alternative to Kashmiris independence: Mushaal",
  "link": "https://www.app.com.pk/national/ddc-polls-not-an-alternative-to-kashmiris-independence-mushaal/",
  "date_published": "2020-11-28T15:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 28 (APP): Mushaal Hussein Mallick, the wife of detained Hurriyat leader Yasin Malik Saturday urged the people to boycott the forthcoming District Development Council (DDC) elections in Indian Illegally Occupied Jammu and Kashmir (IIOJK) which could not be an alternative to the Kashmir’s right to self determination.\nPeople should stay away from the polls to convey a strong message to international community that they do not want elections but freedom from India’s illegal occupation, she said in her reaction to the so-called local bodies’ elections being held on Saturday in the valley at a time when the brutal authorities put the valley under military siege.\nNarendra Modi-led fascist Indian government is staging drama to hold so-called elections in IIOJK under the shadow of guns, which could not be acceptable to Kashmiris at any cost, she said.\nMushaal, who is also Chairperson Peace and Culture Organisation said the people of IIOJK have given huge sacrifices for the attainment of their birthright to self-determination and not for the elections.\n“Whosoever is contesting the DDC elections betrays the Kashmir cause and casting vote under the Indian illegal occupation and its Constitution is treason with the blood of Kashmiri martyrs and huge sacrifices of the people,” she said and added that Kashmir will not accept the so-called polls come what may.\nShe said that all Hurriyat leadership boycotted the polls; hence the brave Kashmiris should resist all tactics of pressure and duress to foil the brutal regime attempt to hold polls in the valley, adding that Kashmiri people are being forced to cast votes or else ready to face the consequences.\n“As the worst demonstration of political vendetta, India is brazenly using draconian Public Safety Act (PSA), a lawless law, to stifle dissent in IIOJK and deliberately prolonged unlawful detention of Kashmiri prisoners for their political beliefs,” she added.\nMushaal disclosed that Indian troops have intensified cordon and search operations across the territory and arrested hundreds of people ahead of so-called DDCs and Panchayat elections to build pressure to force people to cast votes.\nThe chairperson said that Indian brutal authorities turned the occupied valley into a torture cell; where Indian troops and police personnel unleashed a new wave of brutalities and barbarism. Indian forces martyred two Kashmiri youth in the so-called search operation in Pulwama, she added.\nIndian government suspended mobile and internet services in the valley and there has been a complete blackout in the valley since August 5, 2019, she said, adding that India deployed 25,000 additional troops in the valley.\nShe said that India was inflicting all kinds of oppression on Kashmiris to force them to surrender their freedom movement.\nMushaal said the international community including the United Nations should take notice of India’s atrocities on unarmed Kashmiris and put pressure on India to resolve the Kashmir dispute through the UN resolutions so that a permanent peace could be established in the region.",
  "retrievedAt": "2025-08-11T20:04:23.868Z"
}
