{
  "title": "Senator Shibli visits Kohat, reviews development projects",
  "link": "https://www.app.com.pk/national/senator-shibli-visits-kohat-reviews-development-projects/",
  "date_published": "2020-11-28T12:26:00.000Z",
  "source": "APP",
  "content": "KOHAT, Nov 28 (APP): Minister for Information and Broadcasting Senator Shibli Faraz here Saturday said development projects worth billions of rupees in the merged border districts of Khyber Pakhtunkhwa will be completed.\nDuring a visit to Radio Pakistan Kohat, he said Prime Minister Imran Khan had a special relationship with the people of merged districts and under his leadership, Rs100 billion every year will be spent on the development projects in the merged districts.\nThis will bring the far-flung and backward areas at par with developed areas, he added.\nRadio Pakistan was a national institution and an asset and a voice of the nation, he said.\nThe minister said the achievements of heroes of Kohat who excelled in different fields should be projected before the people and at the national and international level.\nHe said Prime Minister Imran Khan wanted to build institutions to take the country forward.\nHe said, “We have to build the institutions destroyed in the past.”\nShibli Faraz said Radio Pakistan was an important tool and asset and would be modernised, equipped with latest equipment and will be made a self sustainable institution.\nShibli Faraz said the people will be informed about the development projects carried out by the democratic government of Pakistan Tehreek i Insaf.\nHe said the past governments burdened the country with massive debts and high current account deficit.\nThe minister visited different sections of the radio station.\nThe Station Director Radio Pakistan Kohat briefed the minister about the programmes transmitted from the station.\nEarlier, the minister visited the under construction 80 kilometer long Hakla Kohat road, took a briefing from the officials of National Highway Authority and reviewed the pace of work. Chairman Parliamentary Committee on Kashmir Shehryar Afridi also accompanied the minister.\nAfter completion of the project, the travel time between Islamabad and Kohat will be reduced from more than three hours to less than two hours.\nThe road project is expected to be completed by June next year.\nAccording to an official of the National Highway Authority, the government had released the funds for the project.\nThe minister directed that the road project should be completed on time.",
  "retrievedAt": "2025-08-11T20:04:26.243Z"
}
