{
  "title": "Tarar warns of strict action against those inciting violence, threatening  lawmakers",
  "link": "https://www.app.com.pk/national/tarar-warns-of-strict-action-against-those-inciting-violence-threatening-lawmakers/",
  "date_published": "2024-10-16T16:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Federal Minister for Information, Broadcasting, National Heritage, and Culture Attaullah Tarar on Wednesday warned that the state would respond firmly to those responsible for inciting violence and threatening the lawmakers.\nSpeaking to the media here, the minister expressed concern over the threats hurled by the leadership of the Pakistan Tehreek-e-Insaf (PTI) to the for supporting constitutional amendments.\n“No one will be allowed to take the law into their own hands. The writ of the state will be established, and those issuing threats will be dealt with iron hands,” the minister said.\nHe warned that strict action would be taken against anyone attempting to harm others’ lives or property, condemning PTI’s habitual use of threats against the opponents.\nHe said that if anyone tried to harm another person, the state will set an example by holding the perpetrators accountable.\nHe also accused the PTI of writing letters to the International Monetary Fund to push Pakistan towards default, orchestrating the May 9 attacks, vandalizing memorials of martyrs, and calling for protests during the Shanghai\nCooperation Organization (SCO) Summit.\n“This is a non-serious threat,” he remarked, pointing to the internal conflicts and divisions within PTI.\nHe added that those responsible for committing treachery against the country were well-known, and the nation was fully aware of PTI’s actions during its tenure. “Pakistan comes first; no political party is bigger than the country,” he asserted.\nThe minister expressed the opinion that peace and stability will move the nation forward, highlighting that the economy was progressing and Pakistan’s foreign policy was advancing.\nHighlighting the successful conclusion of the SCO Summit, the minister said that the event helped restore Pakistan’s image on the global stage.\nHe said that visiting dignitaries praised Pakistan’s key role in the region and commended the excellent arrangements for the summit.\nHe also acknowledged the contributions of the Ministry of Foreign Affairs, the Ministry of Information, and other institutions in making the SCO Summit a success.\nHe thanked the public for their cooperation during the summit.\nHe said it was an honour for Pakistan to host its first major international event in 27 years, describing the summit as a milestone in the context of international relations.\nThe minister said that the country’s economic indicators were showing improvement due to government policies and expressed optimism that the summit would bring long-term benefits to Pakistan.\nHe also hinted at more positive news in the coming days, with several important bilateral meetings having taken place during the summit to enhance trade and investment, which would prove fruitful for the country’s economy and its people.\nHe also highlighted Prime Minister Shehbaz Sharif’s productive meeting with the Russian Prime Minister on the sidelines of the SCO Summit. He said that all credit for the successful hosting of the SCO summit goes to the Prime Minister’s vision.\nNews regarding the Chancellor election at Oxford University, he said, that in civilized societies, the rule of law and the constitution reign supreme. He said that individuals involved in legal cases were not permitted to participate in such activities, adding that Oxford University had excluded Imran Khan from the list of candidates, as he was convicted and facing various legal proceedings.\nHe also said that the 190 million pounds corruption case against PTI’s founder was in the court of law.",
  "retrievedAt": "2025-08-10T20:06:09.116Z"
}
