{
  "title": "PM hopeful of “wonderful outcomes” of 23rd SCO CHG meeting",
  "link": "https://www.app.com.pk/national/pm-hopeful-of-wonderful-outcomes-of-23rd-sco-chg-meeting/",
  "date_published": "2024-10-16T06:14:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Prime Minister Shehbaz Sharif on Wednesday expressed the hope that the 23rd meeting of the Council of the Heads of Government (CHG) of the member states of the Shanghai Cooperation Organization (SCO) will bring in the wonderful outcomes for the benefit of regional economies and uplifting its people.\nThe prime minister, who chaired the meeting as current chair of the Council, in his opening remarks, welcomed the guests to Islamabad and said the summit manifested the collective voice and wishes of over 40 percent of world population.\nHe said that the presence of the SCO leaders also evidenced their collective spirit of promoting cooperation, sustainable development and regional prosperity.\nHe said the 23rd SCO CHG was the testament to the strength of ties among the SCO member states and the collaboration among the diverse nations.\nThe prime minister said that the SCO countries had immense potential to ensure development, regional peace and stability as well as improving the lives of their people.\nHe also called for using the summit to exchange ideas and share best practices to promote economic cooperation for the betterment of their societies.\nEarlier, the prime minister received the participating leaders at the venue before a group photo with them.\nThe leaders from the SCO member states attending the summit include China’s Premier of the State Council Li Qiang, Prime Minister of Belarus Roman Golovchenko, Prime Minister of Kazakhstan Olzhas Bektenov, Russian Prime Minister Mikhail Mishustin, Tajik Prime Minister Kohir Rasulzoda, Uzbek Prime Minister Abdulla Aripov, Kyrgyzstan’s Chairman of Ministers’ Cabinet Zhaparov Akylbek, Trade Minister of Iran Seyyed Mohammad Atabek, and Indian External Affairs Minister Subrahmanyam Jaishankar.\nBesides, Mongolia is participating in the summit as an Observer State being represented by Prime Minister Oyun-Erdene Luvsannamsrai and Turkmenistan as a Special Guest represented by Deputy Chairman of the Cabinet of Ministers Rashid Meredov.",
  "retrievedAt": "2025-08-10T20:07:10.309Z"
}
