{
  "title": "PM Sharif, PM Mishustin agree to pursue robust dialogue, cooperation between Pakistan, Russian Federation",
  "link": "https://www.app.com.pk/global/pm-sharif-pm-mishustin-agree-to-pursue-robust-dialogue-cooperation-between-pakistan-russian-federation/",
  "date_published": "2024-10-16T13:19:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Prime Minister Muhammad Shehbaz Sharif and Prime Minister of Russian Federation Mikhail Mishustin on Wednesday agreed to pursue robust dialogue and cooperation in the areas of trade, industry, energy, connectivity, science, technology and education.\nDuring a cordial and substantive meeting at the Prime Minister’s House on the margins of the 23rd SCO CHG meeting, both prime ministers discussed the entire spectrum of bilateral cooperation and noted the positive momentum in Pakistan-Russia relations over the last two decades, PM Office Media Wing said in a press release.\nPrime Minister Shehbaz Sharif fondly recalled his first foreign visit to Moscow, expressing a desire to transform these warm memories into a lasting friendship with Russia.\nHe reaffirmed Pakistan’s commitment to strengthening political, economic, and defense ties with the Russian Federation.\nBoth sides agreed to enhance cooperation at multilateral forums, including the United Nations and the Shanghai Cooperation Organization.\nHe also thanked Russia for supporting Pakistan’s BRICS membership bid, marking a step toward deeper collaboration on the global stage.\nhttps://x.com/CMShehbaz/status/1846567337564230095\nThe prime minister recalled his productive meeting with President Vladimir Putin in July this year in Astana during the course of which they had agreed to meaningful enhancement of relations between the two countries.\nHe also emphasized on the need of direct flights between Russia and Pakistan for enhanced connectivity between the two countries.\nThe Russian prime minister appreciated the remarkable arrangements done by Pakistan for the 23rd SCO Council of Heads of Government meeting.\nFurthermore, he thanked the Government and the people of Pakistan for warm welcome and exemplary hospitality extended to him and the Russian delegation.\nHe expressed his desire to further bolster the existing cooperation between Russia and Pakistan to next level.\nThe two prime ministers agreed to maintain close cooperation on all areas of mutual interest.\nBoth leaders also agreed on lingual exchanges among the two countries to enhance people to people relations and an increased cooperation among the banking sectors of the two countries to facilitate trade and investment.",
  "retrievedAt": "2025-08-10T20:06:31.544Z"
}
