{
  "title": "SCO Heads of Delegation reaffirm commitment to peaceful cooperation and economic growth",
  "link": "https://www.app.com.pk/national/sco-heads-of-delegation-reaffirm-commitment-to-peaceful-cooperation-and-economic-growth/",
  "date_published": "2024-10-16T10:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): The heads of delegation from Shanghai Cooperation Organization (SCO) member states on Wednesday reaffirmed their commitment to peacefully resolving disputes through dialogue and consultations besides emphasizing the importance of strengthening cooperation across various sectors, including politics, security, trade, finance, and cultural ties, to build a prosperous, peaceful, safe, and ecologically sustainable planet.\nIn a joint declaration issued at the conclusion of the two-day SCO Council of Heads of Government (CHG) meeting held here, the heads of delegations called for sustainable and inclusive economic growth of member states by optimizing the region’s potential in areas such as green development, digital economy, trade, e-commerce, finance and banking, investment, high technology, start-ups and innovation, poverty alleviation, health care, including traditional and folk medicine, agriculture, industry, transport, logistics connectivity, energy, including renewable energy, communications, science and technology, environment and climate change.\nThe heads of delegations, reaffirming their desire to ensure stable economic and social development in the SCO region, noted the importance of implementing the SCO Economic Development Strategy for the period up to 2030 and the Program of Multilateral Trade and Economic Cooperation of the SCO member states.\nThey stressed the need for coordinated efforts through the mechanisms of relevant cooperation in order to implement the respective action plans.\nThe event was chaired by Prime Minister Muhammad Shehbaz Sharif and was attended by the leaders from the SCO member states including China’s Premier of the State Council Li Qiang, Prime Minister of Belarus Roman Golovchenko, Prime Minister of Kazakhstan Olzhas Bektenov, Russian Prime Minister Mikhail Mishustin, Tajik Prime Minister Kohir Rasulzoda, Uzbek Prime Minister Abdulla Aripov, Kyrgyzstan’s Chairman of Ministers’ Cabinet Zhaparov Akylbek, Trade Minister of Iran Seyyed Mohammad Atabek, and Indian External Affairs Minister Subrahmanyam Jaishankar.\nBesides, Mongolia is participating in the summit as an Observer State being represented by Prime Minister Oyun-Erdene Luvsannamsrai and Turkmenistan as a Special Guest represented by Deputy Chairman of the Cabinet of Ministers Rashid Meredov.\nAmong other dignitaries attending the moot include SCO Secretary-General Zhang Ming, Director of Executive Committee SCO Regional Anti-Terrorist Structure (RATS) Ruslan Mirzayev, Chairman of the Board of SCO Business Council Atif Ikram Shaikh and Chairman of the Council of SCO Interbank Union Marat Yelibayev.\nThe heads of delegation noted significant shifts in the global economy due to advancements in technology and e-commerce, expressing concern over reduced investment and disrupted supply chains caused by protectionist measures and trade barriers.\nOpposing unilateral sanctions and trade restrictions, the delegations emphasized the need for a multilateral trading system to support global sustainable development.\nBelarus, Iran, Kazakhstan, Kyrgyzstan, Pakistan, Russia, Tajikistan, and Uzbekistan reiterated their support for China’s One Belt, One Road initiative, highlighting ongoing collaborative efforts to integrate this project with the Eurasian Economic Union.\nThe heads of delegation underscored the importance of leveraging regional potential and international cooperation to facilitate equitable interactions within the SCO. They called for sustainable and inclusive economic growth, advocating for optimization in green development, digital economy, health care, agriculture, energy, and environmental initiatives.\nHeads of delegation also praised Kazakhstan’s chairmanship of the SCO for 2023-2024 and emphasized the importance of implementing decisions from the July 4, 2024, CHS meeting, while expressing support for China’s chairmanship for 2024-2025.\nThey noted that the member states advocate respect for the right of peoples to independently and democratically choose their political, social and economic development, emphasising that the principles of mutual respect for the sovereignty, independence, and territorial integrity of states, equality, mutual benefit, non-interference in internal affairs, non-use of force or threat of use of force are the basis for the sustainable development of international relations.\nThey reaffirm the commitment to the peaceful settlement of differences and disputes between countries through dialogue and consultations.\nThey emphasized the importance of leveraging regional potential and international cooperation to foster broad, equitable interactions in the SCO region based on international law and mutual respect.\nThey highlighted the need to enhance trade and economic ties through the “New Economic Dialogue” concept among SCO member states.\nThey also stressed the importance of leveraging the digital economy and technological innovations to boost regional competitiveness and ensure that technology benefits all.\nThe Heads of delegations stressed the importance of deepening cooperation in the field of information security, the relevance of the “digital divide” issue and advocated for exploring the creation of a mechanism for cross-border data exchange.\nThey noted the role of standardization tools in trade facilitation and called for the promotion of mutually beneficial and equal interaction between the SCO member states, as well as the exchange of experience in these areas.\nThey acknowledged the significance of the SCO Industry Ministers’ Meeting and proposed its next session in 2025, emphasizing that support for creative industries will enhance competitiveness, reduce unemployment, and foster sustainable growth in the region.\nThey supported establishing an exchange of experiences on national industrial policies and IT standardization. They emphasized the importance of developing micro, small, and medium-sized enterprises to drive economic growth and job creation, advocating continued cooperation under the 2018 Memorandum of Understanding.\nHeads of delegation emphasized the importance of a unified energy vision, calling for continued cooperation in energy infrastructure, security, and investment in renewable energy.\nThey reaffirmed the importance of implementing the road map for increasing the use of national currencies in mutual settlements and supported proposals for an independent settlement mechanism and converging payment systems.\nThey also recognized the SCO Business Council’s role in fostering business cooperation and noted the Interbank Association’s efforts in ESG financing and financial innovations, along with Iran’s intention to join the IBA.\nHeads of delegation emphasized enhancing railway transport cooperation and welcomed the upcoming meeting of Railway Administrations in Moscow. They advocated for innovative technologies in multi-model transport and called for developing infrastructure, logistics, and safety measures, aligning with the SCO’s Concept of Cooperation on ports and logistics centers.\nThey also advocated for enhanced cooperation in environmental protection, biodiversity conservation, and waste management. They reaffirmed commitment to addressing climate change through experience sharing and established a Special Working Group to accelerate related initiatives.\nThey supported deepening collaboration among emergency agencies to monitor natural disaster risks and improve response strategies.\nHeads of delegation supported enhanced cooperation in preventing and treating diseases, improving healthcare digitalization, and developing medical tourism in the SCO region.\nThe heads of delegations noted the importance of developing further cooperation in overcoming poverty and increasing the well-being of the population within the framework of the activities of the Special Working Group (SWG) of the SCO Member States on poverty reduction issues.\nThey called for further strengthening cooperation in order to increase mutual trade in agricultural products and expand the areas of interaction between the Member States on the basis of previously adopted documents and solutions in the field of agriculture and food security.\nThe heads of delegation reaffirmed the need for action to strengthen global food security and improve nutrition and encourage efforts to develop cooperation in research on climate-resilient and nutritious cereal crops, including millet, rice, wheat, maize and other traditional crops.\nThey said they attached great importance to holding sports events and competitions with the participation of SCO Member States, SCO Observer States and SCO Dialogue Partners in order to strengthen sports ties between the countries, as well as the development of Olympic, non-Olympic, and Paralympic and national sports.\nThey welcomed the adoption of a roadmap for the implementation of the Cooperation Programme of the SCO Member States for the Development of Artificial Intelligence.\nThe heads of delegations emphasized that people-to-people diplomacy contributes to strengthening mutual understanding and cultural and humanitarian ties within the SCO.\nThe SCO CHG also approved the Report of the SCO Secretariat on the Events and Meetings held within the framework of the Implementation of the Programme of Multilateral Trade and Economic Cooperation of the SCO Member States and the SCO budget for 2025.\nDuring the meeting, decisions were made on a number of issues related to the financial and organizational activities of the SCO permanent bodies, taking into account the accession of the Republic of Belarus to the Shanghai Cooperation Organization.\nThe heads of delegation expressed their gratitude to Pakistan for the successful organization of the 23rd meeting of the SCO CHG, which was held in a constructive and friendly atmosphere.\nThe next meeting of the Council of Heads of Government (Prime Ministers) of the SCO Member States will be held in 2025 in the Russian Federation.",
  "retrievedAt": "2025-08-10T20:06:53.502Z"
}
