{
  "title": "Belarusian ambassador expresses gratitude on SCO-CHG in Pakistan",
  "link": "https://www.app.com.pk/national/belarusian-ambassador-expresses-gratitude-on-sco-chg-in-pakistan/",
  "date_published": "2024-10-16T17:20:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): Ambassador of Belarus to Pakistan, Andrei N. Metelitsa on Wednesday expressed gratitude to the Shanghai Cooperation Organisation (SCO) Council of Heads of Government meeting in Pakistan, calling it a significant development between SCO member states.\nTalking to APP, the ambassador said Pakistan and Belarus have a long-standing relationship within the Shanghai Cooperation Organization (SCO), with economic and trade relations spanning several decades. As key players in the SCO, both countries are driving economic integration among member states.\nHe said that a delegation led by the Prime Minister of Belarus, Roman Golovchenko participated in the SCO in Pakistan and on the sideline of the SCO a discussion was held to enhancing bilateral economic relations between the two sides.\nThe Belarusian envoy said Belarus and Pakistan will continue to encourage such forums in the future due to their strong role for bilateral economic and trade relations and connectivity between the SCO member states.\nHe said the SCO member states should take advantage of connectivity potential and overcome the difficulties and challenges in trade and investment.\nThe ambassador said that Prime Minister of Belarus, Roman Golovchenko, held a bilateral meeting with his Pakistani counterpart Muhammad Shehbaz Sharif on the sidelines of the SCO Council of Heads of Government (CHG).\nHe said that both leaders agreed on bilateral cooperation, particularly in the areas of trade, investment, agricultural machinery and joint production of tractors and connectivity.\nHe said that PM Golovchenko warmly congratulated Pakistan on the successful conduct of the SCO CHG meeting and its positive outcomes.\nHe thanked Pakistan for the warm welcome and hospitality extended to him and his delegation.",
  "retrievedAt": "2025-08-10T20:06:06.927Z"
}
