{
  "title": "President for boosting economic cooperation with Turkmenistan",
  "link": "https://www.app.com.pk/national/president-for-boosting-economic-cooperation-with-turkmenistan/",
  "date_published": "2024-10-16T14:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 16 (APP): President Asif Ali Zardari on Wednesday underlined the importance of increasing economic cooperation and business-to-business relations between Pakistan and Turkmenistan for the mutual benefit of the two countries.\nHe also called for greater linkages between the stock exchanges of the two brotherly countries to improve economic cooperation.\nThe president expressed these views while talking to Deputy Chairman of the Cabinet of Ministers/Minister of Foreign Affairs of Turkmenistan, Rashid Meredov, who along with Ambassador of Turkmenistan to Pakistan Atadjan Movlamov, called on him, at Aiwan-e-Sadr, President Secretariat Press Wing said in a press release.\nWelcoming the delegation, the president said that Pakistan attached great importance to its ties with Turkmenistan, which were based on common values, religion and culture.\nHe called for working together for the shared prosperity and stability in the region and the betterment of the people of Pakistan and Turkmenistan.\nThe president also affirmed Pakistan’s commitment to the early completion of the TAPI Gas pipeline project, adding that the project would greatly help in the economic development of the two countries.\nRashid Meredov thanked the president for participation in the International Forum on the 300th birth anniversary celebrations of Magtymguli Faragi in Ashgabat, saying that it was a great gesture of respect for the Turkmen people.\nHe also conveyed the special greetings of President of Turkmenistan, Serdar Berdimuhamedov, and National Leader of the Turkmen People and Chairman of the People’s Council of Turkmenistan, Gurbanguly Berdimuhamedov, to President Asif Ali Zardari.\nThe President thanked the Deputy Chairman of the Cabinet of Ministers/Minister of Foreign Affairs Rashid Meredov for his participation in the 23rd meeting of the Council of Heads of Governments of the member states of the Shanghai Cooperation Organization being held in Islamabad.\nThe president also thanked Turkmenistan government for its warm hospitality extended to him during his visit to Ashgabat.",
  "retrievedAt": "2025-08-10T20:06:11.573Z"
}
