{
  "title": "Steps taken under SIFC yielding positive results: PM Kakar",
  "link": "https://www.app.com.pk/national/steps-taken-under-sifc-yielding-positive-results-pm-kakar/",
  "date_published": "2024-02-15T12:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Prime Minister Anwaar-ul-Haq Kakar on Thursday said the measures taken under the Special Investment Facilitation Council (SIF) were yielding the positive results as the caretaker government made all-out efforts to revive the national economy.\n“The caretaker government took steps to create a conducive environment for business, facilitate the role of the private sector in the country’s development and increase tax revenue,” he said while talking to a delegation of Pakistan Association of Large Steel Producers (PALSP) and industrialists of Khyber Pakhtunkhwa, led by Senator Nauman Wazir, at the Prime Minister Office.\nState Bank of Pakistan (SBP) Governor Jameel Ahmed, Federal Bureau of Revenue Chairman and secretaries of the ministries concerned were also present in the meeting, a PM Office news release said.\nThrough its policies, the PM said, the government was facilitating the private sector to increase exports and employment opportunities.\nHe hoped that the next elected government would continue the journey of providing employment opportunities to the people, and overall economic progress by further increasing industrial development and investment in the country with the continuation of policies.\nPM Kakar commended the efforts of the caretaker finance minister, FBR chairman and all the concerned for reforms in the Federal Board of Revenue (FBR) for the prudent economic policies.\nHe also appreciated the business community and investors for extending support in difficult times, saying it were the industrialists who had restored investors’ confidence in the government polices and played their role in the development of national economy.\nReferring to the FBR reforms and the SIFC’s establishment, PM Kakar said it was the best time to invest in diverse fields. The companies associated with the steel industry should prioritize investment for the development of new iron ore deposits in the country.\nIn the meeting, the participants paid tribute to the caretaker government for its efforts for facilitating investment in the country, resolving the problems of industrialists, reforming the FBR and taking measures to restore the economy.\nThe meeting was informed in detail about the large scale industry of steel and copper in Pakistan, the fourth largest export sector, of which copper exports volume alone was $1.35 billion in the last financial year.\nThe meeting was further apprised that the annual per capita consumption of steel in Pakistan was 40 kilograms, which showed a vast potential for development in the sector.\nIt was told that the annual volume of tax from the steel industry was Rs 400 billion, which was also providing thousands of employment opportunities.\nThe meeting participants appreciated the steps taken by the caretaker government to prevent the smuggling of steel, due to which the country’s industry benefited greatly, while taking up problems of the steel industry and suggesting their solution.\nUpon which, the prime minister issued instructions to the FBR and the ministries concerned to consider the proposals and compile them in proper form.",
  "retrievedAt": "2025-08-11T00:41:52.895Z"
}
