{
  "title": "Gohar Ejaz for effective system to provide quality water supply, sanitation services to twin cities",
  "link": "https://www.app.com.pk/national/gohar-ejaz-for-effective-system-to-provide-quality-water-supply-sanitation-services-to-twin-cities/",
  "date_published": "2024-02-15T10:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): Federal Interior Minister Dr Gohar Ejaz said on Thursday that water supply and sanitation were basic needs and an integrated, comprehensive and effective system must be devised so that quality facilities could be provided to the people of twin cities.\nHe said this while presiding over a meeting held regarding water supply and sanitation in Islamabad and Rawalpindi.\nFederal Minister for Information, Broadcasting and Parliamentary Affairs Murtaza Solangi also participated in the meeting.\nRepresentatives of Chief Commissioner Islamabad, the Local Government Department, Rawalpindi Development Authority and the Cantonment Board also attended the meeting.\nThe existing system of water supply, sanitation and waste disposal in the twin cities was reviewed in the meeting.\nThe meeting was informed that 8,000 sanitation workers disposed of 2,300 tons of waste daily with an annual budget of Rs 7 billion but still, the sanitation situation in both cities could not be described as satisfactory.\nThe meeting was informed that currently, the twin cities were facing 47 per cent water scarcity.\n“We want the capital to be an example for other cities,” the interior minister said adding decisions will have to be made today to meet the needs of tomorrow.\nHe said in this regard, the implementation of all necessary actions should be ensured as soon as possible.\nEnsuring good sanitation is essential for improving water supply systems, he maintained.\nMinister for Information Murtaza Solangi said that improvement of groundwater level was very important for better water supply and attention had to be paid to this issue.\nHe directed that the natural nullahs and of Islamabad should be cleaned on a priority basis.",
  "retrievedAt": "2025-08-11T00:42:18.449Z"
}
