{
  "title": "Yakishime: Earth Metamorphosis” exhibition inaugurated at PNCA",
  "link": "https://www.app.com.pk/national/yakishime-earth-metamorphosis-exhibition-inaugurated-at-pnca/",
  "date_published": "2024-02-15T12:49:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP): The Japan Foundation’s traveling pottery exhibition “Yakishime: Earth Metamorphosis,” one of the most basic or primitive means of producing ceramics, opened at the National Art Gallery of the Pakistan National Council of the Arts (PNCA).\nThe exhibition aims to acquaint visitors with the unique and centuries-old cultural facet of Japan.\nThe exhibition, which runs until February 29, is jointly organized by the Japan Foundation and the Embassy of Japan in Islamabad in collaboration with the Pakistan National Council of the Arts (PNCA).\nCaretaker Federal Minister for National Heritage & Culture, Jamal Shah, and the Ambassador of Japan to Pakistan WADA Mitsuhiro jointly inaugurated the exhibition on Thursday, said a news release.\nThe event would provide an opportunity for the visitors to witness the evolution of yakishime from its ancient roots to contemporary expressions.\nThis captivating showcase focuses on a traditional Japanese ceramics technique yakishime (firing unglazed wares at extremely high temperatures) and introduces its history and evolution that has developed in distinctive directions in Japan from the 4th and 5th centuries through the present day.\nIt features over 80 exquisite pieces from the earliest examples to the present through yakishime wares, tea vessels, food vessels, jars, containers, and more that have become an essential part of everyday life in Japan.\nIt also presents a wide range of non-utilitarian objects created by contemporary ceramic artists working in yakishime styles aiming to provide an opportunity to communicate this distinctively Japanese sensibility and aesthetic to people abroad.\nAmbassador WADA, while speaking at the inaugural ceremony, expressed his deep admiration for this time-honored traditional Japanese art of producing ceramic art and crafts, and said that “one of the unique characteristics of Japanese culture is the fusion and coexistence of tradition and innovation. We are good at adding new interpretations to tradition while respecting old methods and tastes.”\nAmbassador WADA mentioned that Pakistan is also known as a production center of traditional pottery with Blue Pottery from Multan which has common attractions with Yakishime. “I feel a sense of warmth and simplicity from both of them”, he further added.\nThe Ambassador said both Japan and Pakistan have rich and diverse cultural heritage and the cultural linkages between the two friendly nations, which can be traced back in history such as the Gandhara civilization. “In terms of the fusion of tradition and innovation, I am looking forward to seeing the new phase of Pakistan’s traditional arts in the next generation as well”, the Ambassador further added.\nThe Ambassador expressed his appreciation to the Pakistan National Council of the Arts for extending their collaboration in arranging this exhibition at the National Art Gallery.",
  "retrievedAt": "2025-08-11T00:41:50.768Z"
}
