{
  "title": "SSP Operations commended officials for effective measures during elections",
  "link": "https://www.app.com.pk/national/ssp-operations-commended-officials-for-effective-measures-during-elections/",
  "date_published": "2024-02-15T12:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):Under the special directions of Islamabad Capital City Police Officer (ICCPO) Dr. Akbar Nasir Khan, the Senior Superintendent of Police (Operations) on Thursday presided over a crime meeting, which was attended by all Zonal DPOs, SDPOs and all incharge police stations.\nSSP Operations commended all the officers for good duties during the elections. He reviewed the performance of all police stations in detail.\nDuring the meeting, the SSP Operations reviewed the crime situation in the federal capital and commended the performance of the police officials for effective measures in crime combating.\nSSP Operations also emphasized the need for continued vigilance and proactive measures.\nHe directed all Zone DPOs to boost the campaign against drug peddlers in different areas of the city adding that a special crackdown against proclaimed offenders and absconders should be started immediately.\nHe further directed the officials to ensure the arrest of the suspects involved in dacoity, vehicle and motorcycle theft, especially against those involved in murder cases adding that the ratio of challan of the cases and recoveries should be increased.\nHe also asked the officers to evolve a comprehensive strategy for prevention of crimes. He further said that patrolling of dolphin and police stations should be made more effective and purposeful.\nThe campaign against beggars should be accelerated, especially their facilitators should be identified and arrested, he added.\nHe also directed the officers to prioritize the security and protection of citizens’ lives and properties.\nAt the end, he called upon all officers to fulfill their duties with utmost diligence and courage, emphasizing that they are part of an esteemed police force, and the dignity and honor of this force are their responsibility.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:41:57.642Z"
}
