{
  "title": "Naval Chief oversees conduct of Exercise Seaspark 2024",
  "link": "https://www.app.com.pk/national/naval-chief-oversees-conduct-of-exercise-seaspark-2024/",
  "date_published": "2024-02-15T14:06:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Feb 15 (APP): Chief of the Naval Staff Admiral Naveed Ashraf on Thursday visited naval ships at sea, creeks areas on the coastal belt of Sindh and coastal areas of Balochistan to oversee the conduct of Exercise Seaspark 2024 and meet the deployed troops in the exercise.\nExercise Seaspark 2024 is a major maritime exercise of Pakistan Navy (PN) which is regularly conducted after every two years on two force concept i.e. Blue Force (own force) and Orange Force (enemy force). The purpose of the exercise is to plan and conduct naval operations as per wartime procedures to check operational readiness, major mobilisation of personnel and practice coordination between various elements of PN to undertake complex operations, an Inter Services Public Relations (ISPR) news release said.\nDuring the operations at sea, the PN warships and aircraft also detected Indian Navy ships, submarines and aircraft, attempting to covertly observe the exercise and interpret PN war plans. Accordingly, necessary safeguards were taken by the PN.\nDuring the visit of Maritime Headquarters at Karachi, the Chief of the Naval Staff was given a briefing by the Orange and Blue Naval Force Commanders on the conduct of operations by the respective forces.\nThereafter, the Naval Chief visited Keti Bandar Post and Battalion Headquarters of Pak Marines at Shah Bandar where he was briefed on combat readiness for defence of Creeks areas which constitutes the South Eastern maritime boundary with India.\nDuring the visit, the Naval Chief interacted with the troops deployed in difficult marshy areas and appreciated their devotion and high morale.\nLater on, the Naval Chief also visited Jinnah Naval Base at Ormara and naval ships operating at sea. During the visits, the CNS expressed his satisfaction on the professional excellence, high morale and perpetual readiness of the Pakistan Navy to ensure impregnable maritime defence of motherland and reaffirmed its resolve to safeguard national maritime interests.",
  "retrievedAt": "2025-08-11T00:41:27.824Z"
}
