{
  "title": "Trail-5 & 6 visitors’ info centres “illegally sealed” by CDA: Rina",
  "link": "https://www.app.com.pk/national/trail-5-6-visitors-info-centres-illegally-sealed-by-cda-rina/",
  "date_published": "2024-02-15T14:22:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 15 (APP):Chairperson, Islamabad Wildlife Management Board (IWMB) Rina Saeed Khan on Thursday said the Capital Development Authority (CDA) illegally sealed the visitors’ information centers at the Trail-5 and 6 of the Margalla Hills National Park (MHNP) being managed by the Board.\nThe Chairperson took to her official handle on X (formerly Twitter) to apprise the masses of the rogue behaviour of the civic agency that took many aback as the visitors information center were the only source of guidance for local and foreign tourists visiting the national park’s nature and biodiversity-rich hiking trails.\nIn her X post, she wrote: “URGENT: CDA thugs have come this morning and taken over our Visitor Info Center on Trail 5 throwing out IWMB furniture. This building was made by Himalayan Wildlife Foundation not CDA and we have handing over documents. We are going to police and courts now! @WildlifeBoard.”\nShe also shared the official order of CDA allocating the land of existing information centres to the Board for establishing its offices whereas any handing or taking over of the building would be carried out through the Environment Directorate of the CDA through intimation to the Authority’s Administrative Directorate.\nThe Board also issued a news a release stating that the Federal Development Agency illegally sealed the Visitor Information Center located on Trail-5 and Trail-6. “CDA officials broke the locks of the office including the conference room and took out the belongings. However, the concerned building was handed over to IWMB by the Administration Directorate of CDA after formal paperwork. The CDA officials acted without notice and ignored all legal aspects,” the IWMB alleged.\nWhen contacted the CDA spokesperson Kamran Qureshi, he hanged up and gave a silent treatment to the queries on the matter. Director General, the CDA’s Environment Directorate, Irfan Niazi was also contacted for his official version who also hung up the call and did not turn up to provide his version on the matter.\nIt may be mentioned here that the civic agency and the Board have recently locked their horns over the possession and control on the erstwhile Islamabad Zoo which was currently operating as the only wildlife rescue and rehabilitation center awaiting funds by the government to develop it into a most-modern public information center and a virtual zoo and the a wildlife preservation center.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T00:41:26.485Z"
}
