{
  "title": "Photography, painting exhibition held at ISA on Kashmir Black Day",
  "link": "https://www.app.com.pk/national/photography-painting-exhibition-held-at-isa-on-kashmir-black-day/",
  "date_published": "2022-10-27T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Directorate of Electronic Media and Publications on Thursday organized a digital photography and painting exhibition in connection with Kashmir Black Day to raise awareness about the plight of Kashmiris and condemn Indian unilateral action of forcibly occupying Kashmir.\nSecretary Ministry of Information and Broadcasting Shahera Shahid was the chief guest. The exhibition was held at Information Service Academy (ISA). The images depicted human rights violations in Indian Illegally Occupied Jammu and Kashmir (IIoJK) and highlighted the brutalities of the occupation forces against innocent Kashmiris.\nThe Secretary took a round of the exhibition which was showcasing the history of Kashmir. The Directorate also presented a documentary on Kashmir highlighting the background and history of Kashmir.\nThe Information Secretary also distributed certificates among the winners of the painting and photography competition. First prize was conferred to Rabia Zafar of Pakistan National Council of the Arts (PNCA), second went to Afaq Ahmed of Institute of Space Technology, while Muhammad Fahim of Quaid-e-Azam University won the third prize and fourth prize was given to Hamna, a student of Islamabad College for Girls.\nSpeaking on the occasion, she said that Kashmiris across the world were observing Black Day on Thursday, which was observed every year to commemorate the illegal occupation of the occupied Valley by India. The main purpose of the exhibition was to highlight the significance of the day besides enhancing awareness among the students about the long standing issue of Kashmir.\nShe said that she was happy to note the sentiments expressed by the students in their paintings about Kashmir. The student artists depicted sufferings of Kashmiris through their paintings.\nShe stressed on highlighting Indian brutalities before the world in a forceful way to counter Indian propaganda effectively.\n“We need to show brotherly feelings to Kashmiris and always standby by its Kashmiri brethren in their struggle for legitimate freedom movement,” she concluded.",
  "retrievedAt": "2025-08-11T15:48:15.405Z"
}
