{
  "title": "Imran offered extension to Army Chief against No Confidence Motion: Khawaja Asif",
  "link": "https://www.app.com.pk/national/imran-offered-extension-to-army-chief-against-no-confidence-motion-khawaja-asif/",
  "date_published": "2022-10-27T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Federal Minster for Defense Khawaja Muhammad Asif on Thursday said that at one time, Imran Khan was offering extension to the Army Chief but when he declined to take illegal and unconstitutional steps he (Imran) started to cast aspersions on his integrity.\nWhen Imran Khan was in power, he crossed all limits to praise the military leadership to remain in power but after no confidence motion, he started maligning the institution.\nAddressing a press conference, he said, for Imran khan his personal character was important over Pakistan’s sovereignty and country’s institutions.\n“He uses one language in front of media against the institution while behind the closed doors, he uses apologetic language in secret meetings” said the defense minister.\nHe said earlier the opposition was exposing his real face to the nation but now it has been disclosed directly from the institution.\nImran had been offering deal of extension in service for the indefinite period to the Army Chief against no confidence motion and to protect his government, said the defense minister adding this information has come straight from the horse’s mouth.\nThe institute, after this, decided to remain neutral but Imran Khan instead of appreciating, made the word ‘neutral’ an abuse, he added.\nWe respect the decision of the institution and will protect it, said the minster adding that the other institutions should also follow the same and remain within their Constitutional role.\nKhawaja Asif said Imran Khan was stopped from making the cipher public in his rally but he created an issue of national security for the country for his personal vested interest.\nHe blamed Imran Khan for destroying the credibility of Pakistan and its relations with the international community.\n“They made fun of our martyred 3 star general on social media” said the minster and warned that the blood of martyrs is red-line for the state and nation so don’t try to cross the red-line.\nHe said Imran khan violated the red-line of Pakistan and made deliberate attempts to create division within an institution.\nHe asked PTI chief Imran Khan whether he will appear before the commission constituted to probe the murder of veteran journalist Arshad Sharif because he admitted to advise him to go out of the country.\nThe minister said the government of KP did not share threat alert to Arshad Sharif with the federal government and this will be probed in the commission.\nKhawaja Asif said the institute showed extreme restraint for the protection of their new assumed role but when Imran Khan crossed all limits, they were left with no choice but to go public in their defense.",
  "retrievedAt": "2025-08-11T15:48:12.409Z"
}
