{
  "title": "Collective efforts needed for strengthening democratic system: Kaira",
  "link": "https://www.app.com.pk/national/collective-efforts-needed-for-strengthening-democratic-system-kaira/",
  "date_published": "2022-10-27T14:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Adviser to Prime Minister on Kashmir Affairs and Gilgit Baltistan Qamar Zaman Kaira said on Thursday collective efforts were needed for the strengthening of democratic system in the country.\nAddressing a press conference, he said it was the need of time that all stakeholders should come forward on same page for the sake of country as already the state was facing serious challenges.\nKaira said no single party could resolve the longstanding issue of the country, so the incumbent regime was taking various steps for the betterment of the state and expressed the hope that all problems would be addressed with unity among the ranks of political powers.\nHe underlined that Bhutto family had sacrificed their lives for the sake of the nation and supremacy of the democratic system in the country.\nReferring to the press talk of DG ISPR, he said that the armed forces had draw the line today that the parliament, judiciary, law enforcement agencies and media should work in their domain to strengthen the country and national economy.\nHe blamed that some elements wanted to weaken the national economy as country’s political environment was very tense. The institutions of the country were functioning within the domain of the Constitution.\nKaira said that Imran Khan had misguided and launched the drama of cipher and added that the political parties had learned from their mistakes in the past and appreciated that forces had declared that they had stepped out from the politics.\n“We will not give the permission to Chairman PTI to play with the fate of country as he has tried to divide the institutions of the country,” he said.\nKaira strongly criticized the narrative of Chairman PTI about the Election Commission of Pakistan. “PTI top brass is using derogatory language against the opponents and head of institutions which is very condemnable, and it does not depict political maturity.”\nHe was of the view that the foreign policy of the incumbent regime was going very smooth and in a productive way.\nChairman PTI Imran Khan should follow the given guideline from the court, law and Constitution to stage the protest otherwise in any violation the sate have right to take action against them, he said.\nThe PPP leader blamed that now ex-Prime minister was seeking for National Reconciliation Ordinance (NRO) but the incumbent regime would not give him any relief because all his corruption narrative against opponent had reverted to him.",
  "retrievedAt": "2025-08-11T15:48:12.367Z"
}
