{
  "title": "ISPR DG, ISI chief brush aside fake, orchestrated narrative on Arshad Sharif’s killing; seek full-fledged probe to reveal facts",
  "link": "https://www.app.com.pk/national/ispr-dg-isi-chief-brush-aside-fake-orchestrated-narrative-on-arshad-sharifs-killing-seek-full-fledged-probe-to-reveal-facts/",
  "date_published": "2022-10-27T09:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 27 (APP): Director General (DG), Inter-Services Public Relations (ISPR), Lt. General Babar Iftikhar and Director General (DG), Inter-Services Intelligence (ISI), Lt. General Nadeem Ahmed Anjum on Thursday brushed aside fake and orchestrated narrative on Arshad Sharif’s killing while seeking a full-fledged probe to bring out facts before the nation.\nTaking the lead during the joint presser flanked by DG ISI, Lt Gen Babar said rather Pakistan Army and Arshad Sharif had cordial relations. Arshad used to cover ISPR media-related activities and he even conducted numerous programmes on Shuhada (martyrs) and the institution.\nGeneral Babar said his institution held no grudge against senior journalist Arshad Sharif despite the fact that he carried an extreme narrative on cipher controversy. Arshad Sharif made strong comments regarding the army during this time, but “We did not have any negative sentiments about him and we don’t have such feelings now.”\nDG ISPR while shedding light on the killing of journalist Arshad Sharif in Kenya and the circumstances surrounding it, said this press conference is being held in the context of presenting facts so that “facts, fiction and opinion can be differentiated.”\nPrime Minister Shehbaz Sharif had been “specially informed” about the sensitivity of the press conference as well, he said, adding, it is quite imperative to determine the factors due to which a particular narrative is being built and people are being misled.\nTerming the death of Arshad Sharif as a “very tragic incident,” Lt Gen Iftikhar said Sharif was an icon of Pakistani journalism, a martyr’s son and a martyr’s brother. His programmes will be seen as a role model for other journalists, he added.\nGeneral Iftikhar went on to say that Sharif s popularity was based on being an investigative journalist and when the cipher surfaced, he conducted several programmes on the issue.\nTalking about the cipher, Gen Iftikhar said that the army chief had discussed it with Imran on March 11 when the latter had termed it to be “not a big thing”. “It was surprising for us when on March 27 a piece of paper was waved and an attempt was made to build a narrative that was far from reality.”\nHe said that several facts had come to light regarding the cipher revealing the “baseless and unfounded” narrative surrounding it. The DG ISPR informed the National Security Committee that no proof was found regarding the conspiracy against the PTI government, he said, adding that the Inter-Services Intelligence (ISI) also did not find any evidence\nregarding the conspiracy.\n“This is all part of the record. We wanted to bring this to the public. And we left the decision to the-then government.” However, this did not happen and more rumours were spread to gain political mileage, he said, adding that the Pakistan Army was also targeted.\nGen Babar Iftikhar said that the army was expected to intervene in domestic politics. “The word neutral and apolitical was turned into abuse. To all this baseless narrative, the army chief and the institution showed restraint and we tried our level best that politicians should sit together and resolve their issues through dialogues.”\nThe DG ISPR clarified that today’s presser was to inform the media about facts related to killing of senior journalist Arshad Sharif.\nHe said the access to facts linked to cipher controversy and Arshad Sharif’s killing was necessary to avoid ambiguity and hearsay so that the nation could know the truth.\n“All these findings of the ISI related to cipher were presented before the NSC and we wanted it to be made public for the nation’s knowledge. But we left this decision on the previous government to make the ISI findings public. But on the contrary, fake news and rumours were perpetrated to gain political benefits and to propogate that the no-confidence motion was part of the regime change operation.”\nSimilarly, the alleged US regime change conspiracies’ against countries from over the world were linked to the change of government in Pakistan, he added. The state institutions particularly Army leadership were targeted and everything was linked to sedition and regime change operation, he added.\nHe noted that this was the time “when Arshad Sharif, other journalists and social media activists were fed with a particular narrative whose veracity had been exposed to a greater level.” Moreover, through opinion-making (spin doctor) a nefarious attempt was made to create hate among the masses towards the army and its leadership.”\n“All-out attempts were made to defame Pakistan and its institutions all across the world. In this media trial, ARY channel played the role of a spin doctor to promote fake and conspiring narratives especially against the Pakistan Army and its leadership and through agenda setting a special narrative was promoted against the Army,” he added.\nHe underlined that the NSC meeting and press release were misinterpreted whereas concocted news was circulated pertaining to [Former} Ambassador Asad Majeed during the second NSC meeting by the previous regime.\nThe ISPR DG informed that it was hoped by the then ruling elite to have a political intervention from Pakistan Army which was against the constitution.\n“The words neutral and apolitical were made as an abusive words. It was also blamed that the cipher was hidden then the question was who hid the cipher, was it the Foreign Office who was processing it? Was there any action taken against them and if not then why their names were not taken publicly?”\nArshad Sharif was criticising the state institutions since November 11, 2021 and many others were also following his suit but they did not leave the country, he said, adding that they[Armed Forces} “approached other journalists and requested them to avoid criticising the armed forces without evidence.”\nGeneral Babar Iftikhar told the media that the KP government issued a threat alert on August 5, 2022 related to Arshad Sharif, adding, “according to our information, this threat alert was issued on the special directions of CM KP that highlighted the doubt that TTP in Spinboldak held a meeting to target Arshad Sharif in Rawalpindi and its adjoining areas. In this regard, no further information was shared with the federal government and other departments that who gave this information to the KP government.”\nHe said it highlighted that it was issued under a specific mindset to convince Arshad to leave the country whereas there was an update that he did not want to leave the country. “But he was repeatedly convinced to leave the country as he was on high risk.\nOn August 8, Shahbaz Gill’s statement on ARY aimed at provoking rebellion in the armed forces was widely condemned by all schools of thought and declared equal to transcending the red line, whereas Gill on August 9 was arrested.”\nAfter this controversial special episode, the ISPR DG mentioned that when the authorities interrogated the senior Executive Vice President ARY Ammad Yusuf on this, it was revealed that ARY CEO Salman Iqbal directed Ammad Yusuf to make Arshad Sharif flee abroad as soon as possible.\n“In reponse, Yusuf told that Arshad flew from Peshwar to Dubai and in this regard a persistent narrative was made that he would be killed. On August 9 at 4:40pm an air ticket was booked from Karachi to Dubai for Arshad Sharif by the Assistant Manager Planning and Administration ARY Imran by a travel agent Fazl-e-Rabi after receiving Rs0.55 million.”\nAs per this travel plan, Sharif had to return to the country on September 9, 2022 whereas on August 10 he left from Baacha Khan International Airport for Dubai on Emirates Flight PK-637 6:10am, he said.\nThe DG ISPR informed that Sharif was given full protocol by the KP government during this time and CM Secretariat officer Afridi transported him to the airport in a double cabin official vehicle, whereas the CM Secretariat staff assisted him on all counters of the airport till his flight.\n“The institutions did not try to stop Arshad Sharif and if the government wanted to do so then it could have been done through the FIA. Sharif stayed in Dubai till he had a valid visa and left for Kenya after it had expired. As per our information, no one forced him to leave at the government level. It needs to be probed that who forced Arshad Sharif to leave Dubai and who managed his official documentation and accommodation abroad. Who convinced him that his life was safe abroad, especially in Kenya otherwise he would be killed?”\nA narrative was also being made that after Sharif’s ouster from Dubai; Kenya was the only country that had visa-free entry access for him. However, there were almost 34 countries that offer Pakistanis Visa-free entry, he noted.\nRaising numerous queries, the ISPR DG said, “why Arshad Sharif went to Kenya, who was hosting him, who were in contact with him in Pakistan, what link he had with Waqar Ahmed and Khurram Ahmed, who are linked to his death and what relationship they had with him? Were their acquaintance or their relationship with Sharif facilitated by someone? Sharif died in a far-flung area and Kenya’s Police did not identify him, who and to whom first gave this news first?”\nHe added that the Kenyan government and Police had accepted their mistake but it was necessary to investigate that either it was a “mistaken identity” or a direct killing issue. “There are many questions that need to be probed. A clear and transparent and impartial investigation was a must of this tragic incident and we have asked the highest level commission from the government to investigate the issue. This commission if the government thinks can be joined by international experts, forensics experts, IT experts and even from the organisations under UN umbrella, it should be added.”\nThe DG ISPR said, that in all this scenario, CEO ARY Salman Iqbal’s name was repeatedly noted, adding that the latter should be brought back and made part of the investigation.\nAfter Arshad Sharif’s sudden death some particular people on social media hurled accusations against the Army. “After this merciless incident who is benefitting from it as this needs to be looked into as Arshad Sharif’s death turned the entire nation in grief. I have presented details of the matter so far received and it is the duty of the media to do in-depth analysis of the details and represent facts before the nation.”\nHe requested that all of the concerned should wait for the inquiry commission’s report and unless a final report was received any accusation against someone was highly irresponsible.\n“Pakistan is a free and sovereign nation and all of us had to play our part for its development, peace and prosperity. You must trust your institutions and if we have made any mistakes in the past then we are improving it through our blood being spilled for the past two decades for its protection.”\nHe concluded that this was the nation’s army and these officers wearing uniforms, serving for the past 35 years did not want to end their service with the blot of sedition. “We may be weak and may have made mistakes but we cannot be conspirators and all have to believe in it because the Army is nothing without the nation. A famous scholar few years back said if you have to break Pakistan then first weaken its Army. Our identity is first of all Pakistan and we will not disappoint our nation as an institution. We have never done and would never do it and promise you. It is time for unity, discipline and faith and together we have to take the country out of these challenges.”\nSpeaking on the occasion. DG ISI Lt Gen Nadeem Anjum said he was not here for himself but rather to defend his officers and men serving the nation round the clock and rendering numerous sacrifices in the protection of their motherland as the first defence line of the country.\nHe noted that the ISI officers and spies were being targeted on the basis of lies and as the DG, of the intelligence agency, he could not restrain or remain silent on a one-sided fake narrative.\n“I also believe that when a lie is told so easily, frequently and repeatedly creating unrest and chaos in the country then long silence of truth is also not good for the country. I will try to avoid speaking unnecessary truth as the nation has laid the burden of responsibility on my position to keep these truths as a trust and keep them in my heart till I go in my grave.”\n“Recently Corps Commander Quetta in Lasbella and officers laid their lives for this motherland but their sacrifices were mocked at social media. There is no second thought that it is highly condemnable to call someone a traitor or make his effigy with traitors without any evidence. All this narrative was built completely on lies.”\nLieutenant General Nadeem Anjum said the nation should know why this narrative was built to call the leadership of Army “Mir Jafar, Mir Sadiq, traitor, neutrals, animal” was not for the purpose that my institution, agency, and the Army Chief did disloyalty, or if he had committed any illegal act, rather their institution had refused to do any unconstitutional act.\nHe noted that it was decided last year by the establishment that it would restrict itself to its constitutional role, which was not an individual or COAS’ decision, rather the said decision was made following a huge debate within the institution to ensure state and institution’s interest to keep itself within the defined constitutional role and come out of politics.\n“It is my faith and that of my agency or institution that any individual having his political thinking should have equal rights and should not be linked to that of an institution. For the past year and this year in March there was huge pressure on our agency but COAS had decided that it would restrict itself to its constitutional role.”\nHe noted that the Army Chief might have spent his last 6 months in peace but he took the decision that was good for the institution while facing filthy criticism made on his family and himself.\n“I realised that the COAS took the decision that his legacy should be the institution that has a constitutional role\nand could not be made controversial. I would like to tell you that COAS was offered an extension in his tenure, in March, till an indefinite period before me but he declined it which was a very attractive option as he had decided to shift the institution’s role from controversial to a constitutional one.”\nHe emphasised that there was a right to opinion to anyone which he respect as a right and as a soldier was ready to protect it to the extent possible. “But if you are satisfied that COAS is a traitor then in the recent past why you used to shower praise on him? Why you offered an extension to COAS for a lifetime? Why do you hold meetings with COAS behind the scenes? I have no objection to it but you are not allowed to blame the same person in the daylight with such contradictions in your words and act.”\nResponding to media queries, the DG ISPR said the Army was also a public institution under the government and had recourse to law. “If someone criticises the army and makes accusations as constitution of Pakistan allows freedom of speech but mudslinging and character assassination is not allowed by the same constitution. The government of the day has to implement that law if a state institution is targeted. We have always approached the government and its the prerogative of the government.”\nHe said Pakistan was a country of consequence and was facing challenges that would persist due to its strategic location, whereas every challenge brought opportunity and there was nothing to worry about it.\nThe DG ISPR clarified that no one would be allowed to destabilise the country whereas a long march or protest was a democratic right of every political party.\nReplying to the queries, the DG ISI said Arshad Sharif was a capable and hardworking journalist and he had respect for him personally. “There are some objections by some quarters for his political ideas but he had a status and dedication to his profession which cannot be denied.”\nHe informed that as per his information he had no threats to his life in Pakistan, adding, “as an heir to martyrs and ghazis he had contacts with the officers of my institution and establishment. He also had contacts with the same in abroad. During this month he had interaction with the DGC ISI and shared his intention to return to the country.”\nHe mentioned that an Inquiry was underway in Kenya and he was in contact with his Kenyan counterpart who claimed that it was an incident of ‘mistaken identity’ as per the initial reports. “The government and state institutions are not completely satisfied with the Kenyan’s government stance on this matter and that’s why an investigation team is formed by Pakistan’s government, also sending a team to Kenya for further probe .”\nThe DG ISI informed that he had deliberately dropped the names of ISI official from the formed investigation team to ensure 100% transparent and impartial probe.\n“The media must criticise and hold us accountable but not for pleasing the personal whims of an individual or group but rather to our services to the nation (If there is any flaw in that regard).”\nHe refuted any hostile threats made by ISI officials to Arshad Sharif and said he had old ties and was in contact with the deceased.\n“There are communication apps that enable fake calls without any contact number and if there are doubts that an unknown number is calling then FIA can help in tracking them as per the law,” he said.",
  "retrievedAt": "2025-08-11T15:48:05.313Z"
}
