{
  "title": "President reiterates Pakistan’s call for Indian accountability, reversal of unilateral actions in IIOJK",
  "link": "https://www.app.com.pk/national/president-reiterates-pakistans-call-for-indian-accountability-reversal-of-unilateral-actions-in-iiojk-2/",
  "date_published": "2022-10-27T05:05:00.000Z",
  "source": "APP",
  "content": "The president, in his message on Kashmir Black Day annually observed on October 27, also called upon the world community to play its part in facilitating a peaceful and just resolution of the long-standing dispute of Jammu and Kashmir in accordance with the relevant Security Council Resolutions and the wishes of the Kashmiri people.\nHe said this year, October 27 marked the completion of seventy-five years of illegal occupation of Indian Illegally Occupied Jammu and Kashmir (IIOJK).\n“We observe Kashmir Black Day to remember the sacrifices of our Kashmiri brothers and sisters in their just struggle for their right to self-determination by condemning the ongoing atrocities of Indian occupation forces over the last seven and a half decades,” he remarked.\nThe president said on the Kashmir Black Day, ; the entire Pakistani nation reaffirmed unwavering support to their Kashmiri brothers and sisters in their just struggle for freedom.\nHe said many generations of innocent Kashmiri men, women and children had known nothing but Indian brutality, bloodshed and torture.\nThe IIOJK remains under Indian military siege, exacerbated by draconian curbs on fundamental freedoms of the people of the occupied territory, he added.\nPresident Alvi said the situation had worsened considerably over the last three years with India’s illegal and unilateral actions of August 5, 2019 which stripped Jammu and Kashmir of its special status under the Indian constitution.\n“These actions violate the United Nations Security Council (UNSC) resolutions which stipulate that the final disposition of the State of Jammu and Kashmir would be made in accordance with the will of the people of Kashmir through a free and impartial plebiscite to be conducted under the auspices of the United Nations,” he commented.\nHe said currently, Jammu and Kashmir had been subjected to unprecedented restrictions on freedom of speech, fake encounters, ‘cordon-and-search’ operations, custodial torture and deaths.\nHe said the Kashmiris have also been facing, enforced disappearances, incarceration of senior Kashmiri leadership and young boys, use of pellet guns especially targeting the Kashmiri youth, destruction, and burning of houses to inflict ‘collective punishment’ on the Kashmiris, and other methods of subjugation.\nHe said over 690 innocent Kashmiris have died in extra-judicial killings at the hands of Indian occupation forces since 5th August 2019.\nThe president said for the last seven decades, the Jammu and Kashmir dispute had been a battle of hope against overwhelming odds, courage against fear, and sacrifice against tyranny.\n“Our Kashmiri brothers and sisters have displayed exemplary courage and endurance braving the worst forms of persecution. We value the blood of thousands of Kashmiris who have sacrificed their lives for decades in the pursuit of freedom from India’s illegal occupation. Kashmiri brothers and sisters will always find Pakistan voicing the cause of the Kashmir dispute at every available world forum,” the president remarked.",
  "retrievedAt": "2025-08-11T15:48:08.006Z"
}
