{
  "title": "Parliament to take a decision on election funding: PM",
  "link": "https://www.app.com.pk/national/parliament-to-take-a-decision-on-elections-pm/",
  "date_published": "2023-04-26T11:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP):Prime Minister Shehbaz Sharif on Wednesday said the Parliament would take a decision regarding the funding for elections as the forum had already taken legal and constitutional steps to address the pervading challenges.\nThe prime minister, addressing a meeting with the heads of the coalition parties, said in the recent past, the meetings were held to discuss the challenges and the remedial measures, and the National Assembly and a joint session of the parliament also took legal and constitutional steps in that regard.\nHe said as the apex court had sought a reply on the funding for elections, the government would again put the matter before the parliament.\nIt was the government’s political and moral obligation to respect the Parliament’s decision, he added.\nAs far as the talks for evolving consensus on a single election date were concerned, he said there was an “overwhelming” opinion among the coalition parties that the doors to dialogue should remain open.\nAnd there was also an opinion that a parliamentary committee might play a role in that regard as the government desired to evolve a consensus on the election date and did not want to impede the process just to satisfy its ego, he added.\nPM Shehbaz said despite the Parliament’s decision not to accept the three-member bench, the Supreme Court wanted to move forward with the same bench. However, the coalition parties were unanimous that they would accept the 4-3 verdict of the apex court bench and not 2-3.\nThe Supreme Court, he said, should not be given the right to arbitrate as it was there to only give verdicts as per law and the Constitution.\nHe said the coalition parties were unanimous that the elections would be held in October or November after the incumbent government completed its term on August 13.\n“The parliament completes its term on August 13 and if 90 days are added to that then the date should be in November or October,” he said\nThe prime minister said instead of suggesting solutions, the Pakistan Tehreek-e-Insaf leadership tried to exploit the country’s challenging situation and also asked its provincial finance ministers to turn down the International Monetary Fund’s conditions to impede the agreement.\nMoreover, the party also tried to create chaos and division within the society, he added. Even the armed forces and their leadership were not spared as some PTI agents from abroad were playing a negative role in that regard.\nHe said alleging a US conspiracy behind his ouster, the PTI leadership undermined Pakistan’s foreign relations. But he later took a U-turn saying that the plot was not finalized in the US, but rather designed in Pakistan, the prime minister added.",
  "retrievedAt": "2025-08-11T08:22:46.748Z"
}
