{
  "title": "Provision of Rs21 bn to ECP; Cabinet approves referring of finance ministry’s summary to parliament",
  "link": "https://www.app.com.pk/national/provision-of-rs21-bn-to-ecp-cabinet-approves-referring-of-finance-ministrys-summary-to-parliament/",
  "date_published": "2023-04-26T13:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP):The Federal Cabinet chaired by Prime Minister Muhammad Shehbaz Sharif on Wednesday approved referring of the Finance Ministry’s summary to the Parliament for provision of Rs 21 billion to the Election Commission of Pakistan (ECP) for holding of general elections in Punjab and Khyber Pakhtunkhwa provinces.\nThe cabinet also approved financing facility for electric bikes and rickshaws for increasing their common use. A loan of Rs 500,000 would be available under the Prime Minister’s Youth Business and Agriculture Loan Scheme at zero mark-up, which would help in saving significantly the country’s spending made on the import of costly fuel.\nThe meeting expressed its deep grief and sorrow over loss of precious lives in a blast in the Counter Terrorism Department Police Station, Kabal, Swat, and offered Fateha for the martyrs and prayed for the early recovery of the injured, the PM Office Media Wing said in a press release.\nThe prime minister directed the Ministry of Interior for inclusion of a Federal Government representative in the investigation process of the CTD Swat blast.\nHe also directed for grant of similar Shuhada package to the deceased in the blast as had been given to those of the Peshawar Police Lines.\nThe cabinet gave a nod to the legislation over Invest Pakistan initiative on the recommendation of the Board of Investment.\nUnder the legislation, an ‘Investment Pakistan’ office would be established under the BOI that would function under public-private partnership.\nThe proposed legislation would help ensure provision of investment-friendly services, it was added.\nThe meeting also sanctioned appointment of Syedain Raza Zaidi, a Grade 21 officer of Inland Revenue, on deputation as Karachi Port Trust chairman on the recommendation of the Ministry of Maritime Affairs.\nThe cabinet approved guidelines for carrying out amendments under its earlier decision of 08-11-2017. Under the decision, it was made mandatory for all the ministries and divisions to carry out amendments in their relevant acts and rules by replacing the words ‘Federal Government’ with ‘appropriate authorities’ for usage.\nThe meeting ratified the decisions of the Economic Coordination Committee (ECC) on April 13. These decisions included declaration of Angor Adda Custom Station in South Waziristan as ‘Export Land Route’ for Afghanistan and the Central Asian States.",
  "retrievedAt": "2025-08-11T08:22:52.960Z"
}
