{
  "title": "Simultaneous elections in country, a constitutional obligation: Ishaq Dar",
  "link": "https://www.app.com.pk/national/simultaneous-elections-in-country-a-constitutional-obligation-ishaq-dar/",
  "date_published": "2023-04-26T16:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Minister for Finance and Revenue Mohammad Ishaq Dar on Wednesday categorically said that holding of elections simultaneously in all provinces and centre was a constitutional obligation adding the country could not afford elections in parts.\nSpeaking at the floor of the National Assembly, the minister said it was not for the first time that election was not being held within 90 days. In past, the election was delayed due to martyrdom of Benazir Bhutto in 2007 and due to natural calamity in 1988, he said.\nHe said the National Assembly has already rejected Rs 21 billion elections fund bill twice besides passing a resolution to reject a bill seeking election expenditure for Election Commission of Pakistan (ECP).\nHe sought the guidance of the members of the House, as the government could not release funds without approval of the National Assembly.\nThe minister said an amount of Rs 35 billion was being spent on the population census despite limited resources. Despite spending a hefty amount on the population census in 2017, two provinces expressed severe reservation and the then government had to convene a meeting of Council of Common Interests (CCI), he added.\nHe said the general elections of 2018 were held on the basis of old census due to reservations of two provinces after bringing necessary legislation.\nHe said the government had allocated Rs 5 billion for ECP in the fiscal budget for the year 2022-23. The ECP had raised a demand of Rs 54 billion in the next fiscal year 2023-24 for holding general elections, he added.\nHowever, he said the Finance Division decided to allocate Rs 47.4 billion to ECP for elections during next fiscal year 2023-24. Today, we would not face such a situation if Article 63 A was not rewritten, he said.\nHe said new interpretation of Article 63-A caused anomalies and it was an attempt to create anarchy in the country.  The ECP sought Rs 21 billion for holding elections in Punjab and Khyber-Pakhtunkwa, he added.\nHe said Rs 14.4 billion additional would incur on holding separate elections in the provinces. The Finance Ministry could allocate fund for elections in the budget and without budget, allocation could only be done through supplementary grants.\nThe Finance Ministry mostly discouraged practice of supplementary grants in order to ensure financial discipline, he added.\nHe went on to say that the Finance Ministry always followed constitution and law for payment of funds. The State Bank of Pakistan (SPB) could only allocate fund but it could not released it, he added.\nThe Finance Division could not release funds without approval of the parliament, he added.\nIshaq Dar said this august house has passed a resolution with regard to payment of funds to ECP for elections adding the Finance Ministry was bound not to pay the amount.\nThe NA Standing Committee on Finance and Revenue has also directed the Finance Ministry to place the issue before the National Assembly for releasing funds in this regard.\nHowever, he said the National Assembly rejected the supplementary grant resolution worth Rs 21 billion moved under 64-A.\nThe minister said our country’s Stock Exchange value stood at Rs 126 billion which was destroyed due to ‘Panama drama’ and selected government. Had his suggestions were accepted five years ago, today the country’s reserve would have jump to $ 24 billion, he said.\nHe said those elements should be exposed who wrongly disqualified the then premier Nawaz Sharif and implicated me in false cases of tax returns.\nHe said not a single payment was delayed during the current government rule.",
  "retrievedAt": "2025-08-11T08:22:49.062Z"
}
