{
  "title": "Lawmakers affirm Parliament’s absolute constitutional authority",
  "link": "https://www.app.com.pk/national/lawmakers-affirm-parliaments-absolute-constitutional-authority/",
  "date_published": "2023-04-26T15:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Lawmakers at the Lower House of the Parliament have unanimously said that the authority of Parliament should not be undermined by any individual or entity by giving the Parliament its exclusive constitutional power to manage state affairs, including enacting crucial legislation.\nSpeaking in the House, Shahida Akhtar Ali expressed her opinion that an individual’s ego had been satisfied through the dissolution of the assemblies of Punjab and Khyber Pukhtunkhwa. She emphasized that Parliament was the supreme forum for making crucial decisions and should be empowered to do so.\nSyed Agha Rafiullah called on the government to reveal the agenda of PTI chief Imran Khan and accused the PTI government of harming the country’s economy. He emphasized for the supremacy of Parliament as the ultimate legislative authority, stating that no other institution should be permitted to obstruct its ability to pass laws for the benefit of the nation.\nAmir Haider Khan Hoti, emphasized the supremacy of the 1973 Constitution, uniting all federating units. He expressed his commitment to the advancement of democracy by prioritizing the supremacy of Parliament, independence and impartiality of the judiciary. Additionally, he voiced support for simultaneous elections throughout the country. He also made it clear that the the Parliament must remain free from interference by any other institution.\nCh Muhammad Barjees Tahir announced that the National Assembly Standing Committee on Finance had issued a unanimous recommendation to withhold funds for the election of two assemblies. He further emphasized the extensive authority of the Standing Committee, which includes the power to summon any government official.\nAgha Hassan Baloch urged the political parties in government to resolve the Balochistan issue through peaceful negotiations. He also advocated for dialogue with other political forces to address the challenges currently facing the nation. Baloch reaffirmed that the supremacy of the Parliament would remain un-compromised under all circumstances.",
  "retrievedAt": "2025-08-11T08:22:55.478Z"
}
