{
  "title": "Pakistani community feels like home in Mohalla Al-Shumaisi, Riyadh",
  "link": "https://www.app.com.pk/national/pakistani-community-feels-like-home-in-mohalla-al-shumaisi-riyadh/",
  "date_published": "2023-04-26T09:37:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): Mohalla Al-Shumaisi, an area in the capital of Saudi Arabia, Riyadh, is home to a significant population of Pakistani diaspora who despite living far from their homeland, have made it their second home, feeling comfortable and settled.\nA short video shared by the Saudi Ambassador to Pakistan, Nawaf bin Said Al-Malki on his Twitter handle, gave a glimpse into the lives of Pakistani nationals residing in the area. The video revealed that their lifestyle has remained unchanged over the course of several years, and they feel right at home in the Kingdom.\nThe clip showcased their daily routine, such as their mealtime where they gather around the table and engage in friendly talk without teasing each other. Additionally, the video highlighted their leisure activities, which include playing traditional Pakistani games like ‘Snakes and ladders’ and Cricket.\nIt was also noted that there is a growing population of young Pakistanis who were born and raised in Saudi Arabia.\nDespite growing up in the Kingdom, their lifestyle remains similar to that of their fellow Pakistani nationals.\nOne of the remarkable things observed in the video was the cultural cohesion between the Pakistani community and Saudi nationals. The Pakistanis easily mix and interact with their Saudi counterparts, indicating a strong cultural bond.\nThe video also showcased the joy of celebrating Eid-ul-Fitr, a significant festival for the Pakistani community. On this day, they sew their cultural dresses and exchange Eid greetings with their loved ones in Pakistan through telephone contact.\nThe day is marked by visiting the barbershop for a haircut and purchasing sweets to share the happiness of the festival.\nThe Pakistani community in Mohalla Al-Shumaisi, Riyadh, is an example of cultural diversity and the ability of people to adapt and thrive in different parts of the world. Their unwavering connection to their roots while embracing the culture of the Kingdom is truly commendable.\nفرحة الأشقاء الباكستانيين بين أهلهم في السعودية في #عيد_الفطر\nعید الفطر میں پاکستانی بھائیوں کی اپنے اہل وعیال میں خوشی۔\npic.twitter.com/prax2XcrkD\n— نواف بن سعيد المالكي (@AmbassadorNawaf) April 24, 2023",
  "retrievedAt": "2025-08-11T08:22:48.643Z"
}
