{
  "title": "Mpox advisory issued to enhance screening at airports",
  "link": "https://www.app.com.pk/national/mpox-advisory-issued-to-enhance-screening-at-airports/",
  "date_published": "2023-04-26T16:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 26 (APP): The Border Health Services on Wednesday issued Monkeypox (Mpox) advisory to the health authorities to enhance screening of inbound passengers at all international airports on the recent case detection in the country.\nAccording to an official of the Ministry of National Health Services, Regulations, and Coordination, the ministry and National Command and Operation Center (NCOC) at the National Institute of Health (NIH) are vigilantly monitoring the situation.\nHe added they are monitoring the situation both at the national and global levels while keeping all the relevant stakeholders on board for ensuring preparedness, timely response, and containment of Mpox cases in Pakistan.\nHe said that the NIH, provincial health departments and Border Health Services at all Airports, District Health authorities at Islamabad and provinces have been advised to ensure surveillance through laboratory diagnostics, contact tracing, rapid identification of suspected cases and clusters of infections as well as the source of infection in order to provide optimal clinical care, isolate cases to prevent further transmission, identify, manage and follow-up contacts to recognize early signs of infection, identify risk groups for infection and for severe disease, protect frontline health workers, and tailor effective control and prevention measures.\nHe said as there is no evidence of localized transmission of Mpox as of now in Pakistan, the risk of the international spread of disease from Pakistan remains low. The World Health Organization (WHO) does not recommend any restrictions on trade on the currently available information regarding Mpox outbreaks.\nIn Pakistan, since May 2022, a total of 22 samples from suspected cases were referred from different parts of the country, and PCR tests were carried out at NIH for the Mpox virus. The first case has been confirmed by NIH from travellers who arrived recently in Pakistan and have been isolated at the Pakistan Institute of Medical Sciences (PIMS) hospital along with others who are being investigated.\nMonkeypox has been declared a Public Health Emergency of International concern on July 22 by WHO and reportable to WHO under IHR 2005. Mpox is a viral zoonotic disease caused by the pox virus (MPXV) and is a contagious disease.\nIt can be transmitted from infected animals to humans or from infected humans to other humans via close contact and droplets. As of now a total of around 87,000 laboratory-confirmed cases and 119 deaths have been reported from 111 countries globally.\nThe number of cases reported weekly at the global level peaked in August 2022, and since then, the cases have been steadily declining.",
  "retrievedAt": "2025-08-11T08:22:49.793Z"
}
