{
  "title": "Six Daanish schools for Balochistan, AJK okayed - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A special meeting of the Central Develo­pment Working Party (CDWP) on Thursday approved six Daanish school projects — in regions of Balochistan and one in Azad Jammu and Kashmir (AJK) — with a total estimated cost of Rs19.25 billion.\n\nThe meeting, chaired by Planning Minister Ahsan Iqbal, was convened at the prime minister’s directives.\n\nThe approved projects include the establishment of Daanish schools in the Qilla Saifullah district of Balochistan at an estimated cost of Rs2.93bn, while another school would be set up in the Sibi district at an estimated cost of Rs3.35bn.\n\nThe establishment of a Daanish school at Baiker in Dera Bugti district of Balochistan would cost Rs2.67bn, while the one in the Musakhel district would be set up for Rs3.63bn. Another such school in the Zhob district would cost Rs3.63bn.\n\nA similar project in AJK’s Bagh district is also planned, with an estimated cost of Rs 3.04bn.\n\nAll six school projects are based on a fifty-fifty cost-sharing formula between the federal government and the respective provincial and regional governments.\n\nThe federal government has also planned to establish new Daanish schools in underserved districts.\n\nFor this purpose, land has been proposed and detailed visits will be conducted during the feasibility stage.\n\nThe core objective of the project is to establish fully functional boarding schools with staff residential facilities, equipped with modern educational systems. These institutions will serve both boys and girls from Grade 6 to 12. Each school is envisioned as a model institution that combines advanced learning technologies with traditional values, focusing on innovation, entrepreneurship and digital literacy, all within a safe and inspiring learning environment.\n\nWhile reviewing the proposals, the planning minister stated that more than 25 million children in Pakistan were currently out of school, which is a serious national concern. He stressed that raising the literacy rate to 90 per cent is essential for the country’s development.\n\nHe reaffirmed the federal government’s commitment to investing in education and supporting the provinces in building modern, quality institutions, such as Daanish Schools, under the Public Sector Development Programme.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:41:28.830Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921933/six-daanish-schools-for-balochistan-ajk-okayed",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:17:56.000Z"
}
