{
  "title": "CM Maryam orders arrest of 2 Pakpattan hospital officials, suspends 3 doctors following infant deaths - Pakistan - DAWN.COM",
  "author": null,
  "content": "Punjab Chief Minister Maryam Nawaz on Friday ordered the arrest of two officials and suspended three doctors at Pakpattan’s District Headquarters (DHQ) Hospital, following the deaths of 20 infants.\n\nAn internal inquiry committee — formed to probe the deaths of only five children on June 19 — reported the deaths of 20 children, raising many serious questions. The findings confirmed that 15 of the 20 deceased were neonates and newborn babies, while all 20 deaths occurred between June 16 and June 22.\n\nA three-member external inquiry committee was formed to investigate the incident, particularly the reported oxygen failure, links between the fatalities and systemic shortcomings and the hospital’s emergency response.\n\nA statement issued today said that during a five-hour visit to the hospital, CM Maryam ordered the arrest of the chief executive officer and medical superintendent. She also suspended and launched inquiries against three pediatric doctors for alleged negligence.\n\nThree laboratory technicians were also arrested for referring patients to their privately run labs operating outside hospital premises.\n\nShe directed Deputy Commissioner (DC) Maria Tariq to relinquish her charge and report to the Services and General Administration Department.\n\nUpon arrival, CM Maryam was briefed on the preliminary findings of the two external inquiry committee reports.\n\nA representative from the provincial health department and Sahiwal Commissioner Asif Tufail presented the final report. Commissioner Tufail revealed that many infant deaths were linked to the referral of critical newborns from an unregistered private maternity hospital run by traditional midwives and quacks.\n\nHe confirmed that oxygen shortage was not a factor, citing the availability of 45 oxygen cylinders at the facility.\n\nHe further said that the hospital had failed to follow the protocols of the Punjab Healthcare Commission in running as a major facility in the district.\n\nSubsequently, the health department sealed the operating theatres of four unauthorised private hospitals: Al-Farid Hospital, Doctor Hospital, Shahid Hospital and Ali Hospital.\n\nDuring the briefing, PML-N MPA Choudhry Javed advocated for upgrading the local nursing college, constructing a multipurpose hall and developing the Western Loop Bypass in Pakpattan City. The chief minister assured that development funds would be allocated as needed.\n\nCM Maryam also ordered action against the owner and the in-charge of the hospital’s parking contractor for overcharging Rs50-100 in excess parking fees.\n\nA comprehensive audit of all medical equipment in the DHQ hospital was initiated. She mandated the implementation of emergency response systems, “Code Red” and “Code Blue”, across all public hospitals in Punjab.\n\nCM Maryam visited multiple wards, laboratories, and the medical store, engaging directly with staff, patients and technicians. Some citizens complained that even basic medicines such as aspirin were unavailable in the emergency ward.\n\nShe expressed anger and questioned how patients were forced to purchase medicines externally despite a provincial allocation of Rs100 billion for medicines.\n\nThe chief minister said that essential drugs were reportedly available in hospital stores but were not reaching patients.\n\nA letter by Senior Head Nurse Salma Tufail had recently surfaced online in which she had warned the hospital medical superintendent of impending oxygen shortage and the urgent need to maintain supply records.\n\nThe letter — written in the first week of June — was circulated on social media. It contradicted the statements of the Pakpattan district health authority chief executive officer who had categorically stated that there was no shortage of oxygen in the pediatric ward during the first three weeks of June.\n\nDC Tariq had questioned the letter’s authenticity, stating, “She (Salma Tufail) submitted that oxygen was available and her letter only requested better documentation.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/041942367c923e1.jpg",
  "retrievedAt": "2025-08-17T19:39:23.133Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922095/cm-maryam-orders-arrest-of-2-pakpattan-hospital-officials-suspends-3-doctors-following-infant-deaths",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T17:27:59.000Z"
}
