{
  "title": "US healthcare groups blast passage of Trump’s tax bill, warn it will harm millions - World - DAWN.COM",
  "author": null,
  "content": "Healthcare groups slammed the passage of US President Donald Trump’s tax-cut and spending bill on Thursday, warning that its sweeping healthcare provisions would inflict widespread harm on millions of Americans.\n\nThe bill, when enacted, will overhaul the government’s Medicaid healthcare programme that covers around 71 million low-income Americans, introducing changes including mandatory work requirements that are expected to leave nearly 12 million people uninsured, according to the Congressional Budget Office (CBO).\n\nRepublicans have said the legislation will lower taxes for Americans across the income spectrum and spur economic growth. According to the CBO, the bill would lower tax revenue by $4.5 trillion over 10 years and cut spending by $1.1tr. Much of those spending cuts come from Medicaid.\n\nBobby Mukkamala, president of the American Medical Association, an influential US doctors’ group, warned that the Medicaid cuts would limit access to care by leaving millions without health insurance and make it harder for them to see doctors.\n\n“It will make it more likely that acute, treatable illnesses will turn into life-threatening or costly chronic conditions. That is disappointing, maddening, and unacceptable,” he said.\n\nThe Alliance of Community Health Plans, which represents local, nonprofit health plans, also rebuked the bill’s passage, saying it would drive up consumer costs while slashing federal health spending to historic levels.\n\nThe group pledged to work with policymakers to minimise disruption for communities.\n\nGreg Kelley, president of the Service Employees International Union’s healthcare branch, representing Illinois, Indiana, Missouri, and Kansas, called the bill a “moral failure” that threatened healthcare access, jobs, and the stability of the healthcare system.\n\nCraig Garthwaite, director of the healthcare programme at Northwestern University’s Kellogg School of Management, said their research showed such cuts would hurt patient health. He said expanding Medicaid had saved lives and cutting it back was likely to have the opposite impact.\n\nGe Bai, a Johns Hopkins health policy professor and adviser to the conservative Paragon Health Institute, said she expected the private market would step in as able-bodied adults lose Medicaid and subsidies.\n\n“These people will come back to the private market,” she said. “The financial burden to purchase insurance will be shifted away from US taxpayers to these people’s shoulders.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/031755126df5654.jpg?r=175555",
  "retrievedAt": "2025-08-17T19:40:32.702Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921986/us-healthcare-groups-blast-passage-of-trumps-tax-bill-warn-it-will-harm-millions",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T02:46:49.000Z"
}
