{
  "title": "NA panel calls for federal backing to cope with climate threats - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A parliamentary panel on Thursday called for urgent federal backing for national and provincial disaster management authorities to cope with worsening climate threats.\n\nThe observation came during a meeting of the National Assembly Standing Commit­tee on Climate Change, held at the National Disaster Manag­ement Authority (NDMA) He­­ad­quarters, where lawmakers received a briefing on the cou­ntry’s evolving disaster landscape and climate-induced chal­lenges.\n\nChaired by MNA Munaza Hassan, the sitting underscored that the country was ranked among the most climate vulnerable and water-scarce nations in the world.\n\nMembers of the committee expressed concern that provincial and district authorities remained under-resourced to act on the NDMA’s warnings.\n\nStanding Committee on Climate Change stresses need for better coordination\n\n“Empowering provincial and district authorities with better federal support is non-negotiable,” said Ms Hassan.\n\nShe proposed mobilising overseas Pakistanis for both funding and volunteer response. The committee also recommended stronger coordination between NDMA and elected representatives on disaster warnings and relief.\n\nNDMA Chairman Lt Gen Inam Haider Malik presented the Authority’s Disaster Cale­ndar 2025 and plans which integrated forecasts of floods, heat waves, glacial lake outburst floods (GLOFs), and sea level rise.\n\nDrawing on 300 satellite feeds and an in-house Global Glacier Monitoring Portal, NDMA highlighted its early warning systems, the Integ­rated National Search and Rescue (INSaR) platform, and training initiatives of over twomillion responders.\n\nYet, the committee lamen­ted that provincial and district authorities often lacked capacity. “We need a federal response framework to back up the PDMAs’ actions on the ground,” Ms Hassan stressed.\n\nThe committee was infor­med that NDMA had identified prime sites for rainwater reservoirs but provincial land acquisition delays were stalling progress. Members also raised concerns over sea water intrusion in Sindh and flood and erosion damage in district of Layyah calling for a national strategy beyond provincial jurisdictions.\n\nThe meeting was attended by MNAs Musarrat Asif Kha­waja, Syeda Shehla Raza, Sha­gufta Jumani, Rana Ansar, Ghu­lam Muhammad, Mus­sa­rat, Rafique Mahesar, Sahib­zada Sibghatullah, Shahzada Muhammad Gushtasap Khan, Awais Haider Jakhar and Ayesha Nazir along with Ministers of Water Resources, Science and Technology, Energy and National Food.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68671c8043dc2.gif",
  "retrievedAt": "2025-08-17T19:41:43.189Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921938/na-panel-calls-for-federal-backing-to-cope-with-climate-threats",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:17:56.000Z"
}
