{
  "title": "Over 20 arrested as two trader groups clash in Murree - Pakistan - DAWN.COM",
  "author": null,
  "content": "RAWALPINDI: As many as 23 people were arrested, while more than 50 others were booked under six sub-sections of Anti-terrorism Act 1997-7 and other relevant sections of the law after two groups of traders clashed in Murree creating panic and fear among the tourists and causing damage to the public property.\n\nThe exchange of gunfire, stone pelting and baton charging between the two groups continued for more than one hour until the reinforcement of police reached the spot. The clash between the two groups –Saleem Akabar and Abdul Hameed– started at about 7pm.\n\nPeople from both the groups fired gunshots, pelted stones and used batons against each other which caused blockade of roads, damage to several cars and window panes of nearby hotels’.\n\nPanic and fear sparked among the tourists as the exchange of gunfire started between the two groups. A large number of tourists who were strolling on the Mall and GPO Chowk started running in panic. Police said that nobody was reported injured during the exchange of gunfire between the two groups.\n\nFollowing the armed clash between the two groups, the police registered an FIR on the complaint of Nafees Sarwer, a sub-inspector, under terrorism and other relevant sections of the law and rounded up 23 people while raids were underway to arrest the others as they are being identified with the help of CCTV cameras.\n\nPolice said in the FIR that they were on patrol duty at GPO chowk when they received information that two groups were fighting. The police party rushed to the scene and found a large number of people were gathering near a hotel and they were clashing with each other.\n\nHe said the members of both groups were carrying batons, iron rods, and firearms.\n\nHe further said that as the police tried to control them, members of both the groups started firing, shouting slogans and using abusive language against each other. Due to this, the window glasses of many cars parked in the hotel and window panes of the hotel building smashed, the FIR said.\n\nAs the situation turned more violent, the reinforcement of police, elite commandos was called on the scene. He further said that the police also fired gunshots in the air for self-defense after that the protesters dispersed in different directions.\n\nHowever, the police rounded up about 23 of them and put them behind the bars.\n\nPerhaps, this is for the first time that the police have registered a case under section 7ATA 1997, including six sub-sections of the 7ATA.\n\nThe term “ATC 1997-6-2b” likely refers to the Anti-Terrorism Act, 1997, specifically Section 6, subsection 2(b). This section defines certain acts as terrorism, particularly those involving the use of explosives or firearms, or acts that create a sense of fear and insecurity among the public.\n\nThe ATC-1997-6-c section defines acts that can be classified as terrorism, and paragraph (c) likely outlines specific actions related to damage or destruction of property with the intent to create fear or insecurity.\n\nSimilarly, sub-section G defines involvement of stoning, brick-batting or any other form of mischief to spread panic and fear. Murree had been declared as a separate district of Rawalpindi Division in 2022 by the then government.\n\nMurree was given the status of a district in order to ensure an effective administrative system. A deputy commissioner (DC) and a district police officer was appointed by the Punjab government.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:40:18.177Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922014/over-20-arrested-as-two-trader-groups-clash-in-murree",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T03:23:31.000Z"
}
