{
  "title": "Djokovic crushes Evans as seeds hit back at Wimbledon - Sport - DAWN.COM",
  "author": null,
  "content": "LONDON: Novak Djokovic showed signs that he is easing into the old routine at Wimbledon as the seven-times champion sauntered into the third round on Thursday and Barbora Krejcikova also made it through as her title defence continued.\n\nThis year’s Championships have been littered with seeds biting the dust early but day four offered some big statements from those fancied for deep runs on the lawns.\n\nFormer women’s champion Elena Rybakina may have arrived very much under the radar but has reached the third round for the loss of a mere seven games, the 11th seed destroying Greece’s Maria Sakkari 6-3, 6-1 in 62 minutes.\n\nFive-times Grand Slam champion Iga Swiatek, surprisingly yet to go past the quarter-finals at Wimbledon, is another who will quietly fancy her chances and the Pole looked impressive as she hit back from a set down to beat Caty McNally 5-7, 6-2, 6-1.\n\nDjokovic struggled past Alexandre Muller on Tuesday when he struggled with stomach issues. Two days later, however, he was at his ruthlessly efficient best in a 6-3, 6-2, 6-0 thrashing of popular Briton Dan Evans on Centre Court.\n\nThe 38-year-old is bidding to equal Roger Federer’s men’s record eight titles and claim an unprecedented 25th Grand Slam crown and, while the talk is of top seed Jannik Sinner and defending champion Carlos Alcaraz disputing the final, the Serb should be dismissed at your peril.\n\nHe has reached the last six Wimbledon finals and clearly believes he will still be around on July 13.\n\n“Technically, tactically I knew exactly what I needed to do and I executed perfectly,” Djokovic said after his 99th match win at Wimbledon since making his debut in 2005.\n\n“Sometimes you have these kind of days, where everything goes your way, everything flows and it’s good to be in the shoes and holding a racket on a day like this.”\n\nBUSINESSLIKE DISPLAY\n\nCzech Krejcikova, a surprise winner last year, found herself out on Court 2 where the 17th seed produced a typically businesslike display as she battled past American Caroline Dolehide, winning 6-4, 3-6, 6-2.\n\nShe will face a much more dangerous American next in the form of Emma Navarro after the 10th seed crushed Veronika Kudermetova 6-1, 6-2.\n\nWith four of the top five women’s seeds already gone, the draw looks wide open for the likes of seventh seed Mirra Andreeva who beat Italian Lucia Bronzetti 6-1, 7-6(4).\n\nNearly half of the 32 men’s seeds have perished before the third round with 13 failing to clear the first hurdle.\n\nBut they reasserted themselves on Thursday.\n\nAustralia’s 11th seed Alex de Minaur beat Arthur Cazaux 4-6, 6-2, 6-4, 6-0, while powerful Czech teenager Jakub Mensik, seeded 15, beat American Marcos Giron 6-4, 3-6, 6-4, 7-6(7/4) to underline his credentials as a dangerous floater.\n\nBulgarian Grigor Dimitrov, playing in his 59th successive Grand Slam, may no longer be considered a genuine title threat but more than a decade since reaching his sole Wimbledon semi-final showed he is still a class act as the 19th seed beat tricky Frenchman Corentin Moutet 7-5, 4-6, 7-5, 7-5.\n\nArthur Rinderknech, who defeated world number three Alexander Zverev in round one, backed up that fine win with another victory against 2022 quarter-finalist Cristian Garin. The Frenchman won 3-6, 6-3, 7-6, 4-6, 6-3.\n\nPAOLINI EXITS\n\nOn Wednesday, last year’s runner-up Jasmine Paolini joined the exit of stars as she crashed out 4-6, 6-4, 6-4 against Russian Kamilla Rakhimova.\n\nMeanwhile, unseeded four-time Grand Slam champion Naomi Osaka eased past Czech doubles specialist Katerina Siniakova 6-3 6-2.\n\nAshlyn Krueger, the American 31st seed, was beaten 7-6(4), 6-4 by Russian Anastasia Pavlyuchenkova, ensuring 15 of the 32 women’s seeds also went out of the tournament.\n\nSonay Kartal led the home charge by defeating Bulgaria’s Viktoriya Tomova 6-2, 6-2 to book her place in the last 32 for the second year in succession while the nation’s big hope Emma Raducanu got past 2023 champion Marketa Vondrousova 6-3, 6-3.\n\nOn the men’s side, 23rd seed Jiri Lehecka, last month’s Queen’s Club Championships runner-up, fell 7-6(7/4), 6-1, 7-5 to Italian Mattia Bellucci.\n\nTaylor Fritz closed out Wednesday’s proceedings with a 3-6, 6-3, 7-6(7/0), 4-6, 6-3 win over Gabriel Diallo.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/6867307704bcd.gif",
  "retrievedAt": "2025-08-17T19:40:31.889Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921975/djokovic-crushes-evans-as-seeds-hit-back-at-wimbledon",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:42:50.000Z"
}
