{
  "title": "6 dead as car plunges into AJK’s Neelum Valley: officials - Pakistan - DAWN.COM",
  "author": null,
  "content": "Six members of a family were killed in Azad Jammu and Kashmir (AJK) on Friday when their car veered off the road and plummeted hundreds of feet, crashing onto the right bank of the Neelum River, officials said.\n\nThe accident occurred at a sharp bend on the Neelum Valley road near Chilyana village, approximately 50 kilometres northeast of Muzaffarabad.\n\nChilyana is located across from the Indian-occupied village of Titwal on the opposite bank of the Neelum River, a point that once served as a foot-crossing under the cross-Line of Control (LoC) travel arrangement before activity came to a halt in 2019.\n\n“Shortly after Friday prayers, a vehicle … went out of the driver’s control while negotiating a dangerous curve near Chilyana,” Akhtar Ayoub, the Neelum Valley District Disaster Management Officer (DDMO), told Dawn.com.\n\n“It rolled down the mountain slope but stopped just short of entering the river; otherwise, it would have been swept away by the violent current,” he added.\n\nAyoub said that upon receiving reports about the incident, a Rescue 1122 emergency unit was immediately dispatched from the district headquarters in Athmuqam.\n\n“Police personnel, army troops, and a large number of local residents also reached the scene and took part in the recovery operation,” he said.\n\nDuring the operation, the bodies of five women and one man were recovered and transported by Rescue 1122 to a nearby army unit in Nauseri, where they were identified and handed over to the bereaved family, Ayoub outlined.\n\nAccording to Ayoub, the deceased hailed from Botha Tanda, a village on the outskirts of Muzaffarabad, and were on their way to Jura town in the valley to visit relatives.\n\nThey were identified as Ameer Khan, 65; his wife, Gulshan Bibi, 50; his daughters, Naima Bibi, 23, and Mishal Bibi, 21; and his relatives, Sundas, 27, and Halima Basheer, 27.\n\nMeanwhile, AJK Prime Minister Chaudhry Anwarul Haq, Legislative Assembly Speaker Chaudhry Latif Akbar, Minister for Law Mian Abdul Waheed, and PML-N regional president Shah Ghulam Qadir expressed deep sorrow over the tragic loss of lives.\n\nIn their condolence messages, they extended sympathies to the bereaved family and urged motorists to exercise extra caution while driving on the region’s mountainous roads.\n\nFatal accidents are common on roads in the mountainous regions of the country due to traffic rule violations, treacherous terrain, and poor infrastructure.\n\nIn May, an assistant director, three inspectors and a constable of the AJK police lost their lives when their vehicle plunged into a deep ravine in the Poonch division.\n\nAccording to a statement from the central control room, a police pickup truck was travelling along the Toli Pir–Lasdanna Road when the tragic accident occurred around 6:30pm near a place known as Chatti Dhok.\n\n“The vehicle skidded off the road and tumbled hundreds of feet down the mountainside, crashing into trees and rocks before being reduced to the wreckage,” said Khalid Kiani, an official at the police control room in Rawalakot.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/04190241f024c13.png",
  "retrievedAt": "2025-08-17T19:39:28.609Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922093/6-dead-as-car-plunges-into-ajks-neelum-valley-officials",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T14:23:42.000Z"
}
