{
  "title": "NDMA issues monsoon alert from July 6th - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Flash flood risk in northern areas from July 7-12\n• Heavy rain forecast across all provinces, GB and AJK\n• Second monsoon spell expected to affect most Punjab districts\n• PDMA Balochistan warns of flash floods in 20 districts\n• Tourists advised to avoid high-risk areas; citizens urged to stay indoors\n\nRAWALPINDI / LAHORE / QUETTA: The National Emer­gencies Operation Centre (NEOC) of the National Disa­ster Management Authority (NDMA) has issued impact-based weather alerts ahead of predicted monsoon activity and a strong westerly wave expected to affect multiple regions of the country from July 6 to 10. Flash flood risks are also anticipated in northern areas from July 7 to 12.\n\nIsolated rain and thunderstorms are expected in Islamabad and across Punjab, including Rawalpindi, Attock, Jhelum, Chakwal, Mianwali, Sargodha, Khushab, Gujran­wala, Gujrat, Faisalabad, Lahore, Kasur and Okara from July 6 to 10.\n\nWidespread moderate to heavy rainfall is forecast across northern and central Punjab, while southern districts such as Multan, Khanewal, Bahawalpur, Bahawalnagar, Rahim Yar Khan, and Dera Ghazi Khan may receive low to moderate showers.\n\nIn Khyber Pakhtunkhwa, heavy rain and thunderstorms are expected in Dir, Swat, Chitral, Kohistan, Shangla, Buner, Battagram, Swabi, Nowshera, Charsadda, Mala­kand, Mansehra, Abbottabad, Peshawar, Mardan, Haripur, Bannu and Kohat.\n\nGilgit-Baltistan and Azad Jammu and Kashmir will likely experience moderate to heavy rainfall, particularly during evening and night hours. Flash flood threats persist in Gilgit, Skardu, Hunza, Astore, Diamer, Ghanche, Shigar, Muzaffarabad, Neelum Valley, Rawalakot, Haveli and Bagh.\n\nThe expected weather conditions could result in flash flooding in streams and nullahs, landslides, road closures and disruptions to power and communication lines.\n\nIn Sindh, isolated to moderate rainfall is expected in Sukkur, Nawabshah, Kash­more, Hyderabad, Karachi, Thar­parkar, Mirpurkhas, Umerkot, Sanghar, Jamshoro, Tando Allahyar, Thatta, Badin and Mithi. Heavier rainfall is likely in Ghotki, Khairpur, Shikarpur, Larkana, Jacob­abad and Dadu, potentially leading to urban flooding, traffic congestion and infrastructure damage.\n\nScattered to heavy rainfall is also forecast in Balochistan, including Quetta, Zhob, Ziarat, Kalat, Khuzdar, Awaran, Bar­khan, Jaffarabad, Kohlu, Sibi, Dera Bugti, Loralai, Lasbela and Naseerabad. Risks include waterlogging, traffic disruption and structural damage from strong winds and lightning.\n\nThe NDMA has urged the public to adopt precautionary measures, including avoiding unnecessary travel, staying indoors during severe weather and securing loose items and vehicles. Tourists are strongly advised against visiting high-altitude or flood-prone areas during the forecast period.\n\nLocal authorities have been directed to ensure the readiness of response teams, drainage clearance and public awa­re­ness campaigns. Motorists have been warned to avoid driving through flooded roads and underpasses. Emergency services remain on high alert for potential rescue and evacuation operations.\n\nThe NDMA asked citizens to monitor its advisories and use the ‘Pak NDMA Disaster Alert’ app for real-time weather updates and safety information.\n\nPunjab on high alert\n\nThe Provincial Disaster Management Authority (PDMA) Punjab has issued its own alert ahead of expected monsoon rains from July 5 to 10, warning of urban flooding and rising river levels.\n\nIt said the second monsoon spell is expected to affect most districts, including Rawalpindi, Murree, Galiyat, Attock, Chakwal, Jhelum, Mandi Bahauddin, Gujranwala, Hafizabad, Wazirabad, Lahore, Sheikhupura, Sialkot, Narowal, Sahiwal and Faisalabad. Thunderstorms with heavy downpours are predicted in Okara, Kasur, Khushab, Sargodha, Bhakkar, Mianwali and southern districts such as Bahawalpur, Multan and Dera Ghazi Khan.\n\nPDMA Director General Irfan Ali Kathia warned of potential flooding in hill torrents and rain drains from July 7 onwards. Urban flooding may also impact northern and central Punjab.\n\nDepartments including the Water and Sanitation Agency, Rescue 1122, health, irrigation and local government have been directed to remain on high alert. Citizens have been advised to stay indoors during storms, avoid travel and keep children away from waterlogged areas and electrical hazards.\n\nPDMA’s recent rainfall data shows Jhelum recorded the highest precipitation at 31 millimetres in the past 24 hours, followed by Mangla (29mm) and Attock (14mm), with minimal rainfall in Rawalpindi, Chakwal, Sialkot and Multan.\n\nNew monsoon spell in Balochistan\n\nThe PDMA Balochistan has also issued a weather alert for a fresh monsoon spell expected to hit 20 districts from July 4 to 8 July.\n\nHeavy downpours are forecast in Sherani, Zhob, Ziarat, Musakhail, Duki, Loralai, Harnai, Sibi, Barkhan, Nasirabad, Usta Muhammad, Kalat, Lasbela, Surab, Khuzdar, Awaran, Sohbatpur, Jaffarabad, Dera Bugti and Kohlu, with flash floods likely in seasonal streams and rivers.\n\nTourists have been advised to avoid unnecessary travel, and residents are urged to stay away from dams and picnic spots. Deputy commissioners have been instructed to monitor the situation closely and deploy heavy machinery on key roads to maintain access.\n\nPDMA district teams have been ordered to prepare for rescue and relief operations in the event of any damage caused by the rains.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:41:49.654Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921952/ndma-issues-monsoon-alert-from-july-6th",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:17:44.000Z"
}
