{
  "title": "30 terrorists killed in North Waziristan as bid to infiltrate via Pak-Afghan border thwarted: ISPR - Pakistan - DAWN.COM",
  "author": null,
  "content": "Thirty terrorists of an “Indian proxy” outfit were killed as they attempted to infiltrate through the Pak-Afghan border in Hassan Khel tehsil of Khyber Pakhtunkhwa’s North Waziristan district, the military’s media wing said on Friday.\n\nPakistan has witnessed an uptick in terror activities, especially in KP and Balochistan, after the banned Tehreek-i-Taliban Pakistan (TTP) ended its ceasefire with the government in November 2022. The country ranked second in the Global Terrorism Index 2025.\n\nA statement from the Inter-Services Public Relations (ISPR) read that on the nights of July 2 and July 3, “movement of a large group of khwarij, belonging to Indian proxy Fitna al Khawarij, who were trying to infiltrate through Pakistan-Afghanistan border, was detected by the security forces in general area Hassan Khel, North Waziristan district”.\n\nFitna al Khawarij is a term used by the government for the TTP, while those associated with the terrorist group are referred to as khaarji.\n\nAs per the ISPR, “all 30 Indian-sponsored khawarij were sent to hell” as a result of the military’s “prices and skilful engagement” after the security forces foiled their attempt to infiltrate the border.\n\n“A large number of weapons, explosives and ammunition have been recovered from the slain terrorists,” the statement added.\n\nThe ISPR appreciated the “exceptional professionalism, vigilance and preparedness” displayed by the security forces in preventing a “potential catastrophe”.\n\nThe military’s media wing urged the Afghan government to “check and prevent the use of Afghan soil by ‘foreign proxies’ for orchestrating terrorist activities against Pakistan”.\n\n“The security forces of Pakistan remain resolute and unwavering in their commitment to defend the nation’s frontiers and to eradicate the menace of Indian sponsored terrorism from the country,” the statement added.\n\nPresident Asif Ali Zardari lauded the security forces for their bravery and reaffirmed the country’s “unwavering” resolve to curb terrorism.\n\n“Security operations will continue until the terrorists are eliminated completely,” he said, according to a statement issued by the president’s office.\n\nPrime Minister Shehbaz Sharif commended the operation, saying the “entire nation salutes the security forces”, in a statement reported by Radio Pakistan.\n\n“The brave armed forces of Pakistan are standing like a solid wall to protect the country,” he asserted.\n\n“Pakistan’s courageous security forces served as an unyielding shield to protect the nation,” the premier was quoted as saying by the Associated Press of Pakistan.\n\n“We are determined to eliminate all forms of terrorism from the country completely,” PM Shehbaz reaffirmed.\n\nThe engagement comes only days after security forces killed two terrorists during an operation in Balochistan’s Duki district.\n\nIn June, Pakistan witnessed a slight overall decline in militant violence during June 2025 despite several high-profile attacks, according to data released by an Islamabad-based think tank, Pakistan Institute for Conflict and Security Studies (Picss).\n\nThe monthly security assessment recorded 78 militant attacks in June, compared to 85 in May.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/041042421e3e042.jpg",
  "retrievedAt": "2025-08-17T19:40:04.524Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922039/30-terrorists-killed-in-north-waziristan-as-bid-to-infiltrate-via-pak-afghan-border-thwarted-ispr",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T05:52:20.000Z"
}
