{
  "title": "Three shot dead over ‘monetary dispute’ in Karachi’s Orangi Town - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A man and his two friends were shot dead in Orangi Town on Thursday morning, police said.\n\nThe Mominabad police identified the victims as Ghausuddin, 40, Gul Khan, 45, and Mohammed Ameen, 25, and said that they were killed at Zia Colony.\n\nThey said the incident occurred when Ghaus and his two friends visited his daughter’s house, where a scuffle broke out between them and family members of his son-in-law Abdul Hameed, which ultimately resulted in the triple murder.\n\nWest SSP Tariq Illahi Mastoi told Dawn that the primary target was Ghausuddin, alias Imran while the other two victims were his friends. The bodies were shifted to the Abbasi Shaheed Hospital for medico-legal formalities.\n\nPolice Surgeon Dr Summaiya Syed told Dawn that all three victims were shot in the head.\n\nThe SSP said that Ghaus was targeted by his son-in-law, along with his other relatives, over a monetary dispute.\n\nHe said that the police arrested two suspects, identified as Shahjehan and Rehmat, and efforts were ongoing to apprehend Hameed and other suspects. A 9mm pistol recovered from the scene had been seized for investigation.\n\nThe officer said that held suspect Shahjehan was the father-in-law of Ghaus’s daughter.\n\nA case was registered on the complaint of Ghausuddin’s brother, Bahauddin, who told the police that his niece, Ayesha, had married Hameed about six months ago. Ghausuddin, along with his two friends, had gone to resolve “some domestic issues” with Hameed around 1:30am on Thursday. The victims were standing outside the house when the suspects “misbehaved” with them, which led to a heated exchange, after which the suspects opened fire, killing all three of them.\n\nThe complainant added that he was informed over a phone call at 6am by a relative that TV channels were reporting the deaths. He and other family members rushed to the hospital, where they were told the bodies had been moved to a morgue near the FTC flyover. They went there and identified the victims.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/05/201032492b7bc75.jpg?r=103304",
  "retrievedAt": "2025-08-17T19:40:45.609Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921910/three-shot-dead-over-monetary-dispute-in-karachis-orangi-town",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:18:16.000Z"
}
