{
  "title": "Business leaders warn of strike over ‘draconian’ tax law - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Karachi Cham­ber of Commerce and Industry (KCCI) on Thursday expressed full support for a complete nationwide strike if all chambers unanimously oppose Sections 37A and 37B of the Sales Tax Act, terming them “draconian” and detrimental to the business environment.\n\nSpeaking at a press conference at KCCI, President Jawed Bilwani said the chamber, along with all seven industrial associations, would back any unified strike call against these provisions. “Posting banners and holding press conferences are just the beginning — protests will intensify until the government repeals Sections 37A and 37B entirely,” he warned.\n\nBilwani revealed that officials from the Federal Board of Revenue (FBR) had contacted him to discuss the formulation of Standard Operating Procedures (SOPs) for implementing Section 37A. However, he categorically rejected any such proposals, stating, “In line with the unanimous demand of the business community, we reject SOPs and reiterate our sole demand: complete repeal of Section 37A.”\n\nOn the timeline for a potential strike, Bilwani said a final decision would be made following meetings with other chambers, trade bodies, and relevant stakeholders.\n\nDemand repeal of Sections 37A and 37B; caution against investor exodus and rising protests\n\nCriticising the sweeping arrest powers granted to FBR officials under the contentious provisions, he said these laws undermine Pakistan’s reputation as a business-friendly destination and risk scaring off both local and foreign investors.\n\n“Section 37A is incompatible with doing business in Pakistan,” he said, adding that KCCI continues to receive complaints from business owners concerned about the psychological pressure and constant threat posed by these sections.\n\nBilwani stressed that the law unfairly targets already compliant taxpayers rather than addressing root causes of tax evasion. “Only 40pc of Pakistan’s economy is documented, of which barely 2pc may be involved in malpractice — yet 98pc of tax-compliant businesses are now subject to harassment,” he said. He added that the focus should be on those issuing fake or flying invoices, not those already in the tax net.\n\nHighlighting the FBR’s poor enforcement record, he said most court verdicts in such cases have favoured taxpayers, with only a small fraction decided in favour of tax authorities.\n\nKCCI has identified 30 anomalies in the tax framework, with five or six deemed critical enough to make return filing practically impossible. These, Bilwani stressed, need immediate rectification through urgent legislative amendments.\n\nBusinessmen Group Chairman Zubair Motiwala echoed Bilwani’s concerns, warning that unchecked arrest powers would lead to widespread harassment and open the door to corruption. “Officials vested with arrest powers may misuse them for personal gain, forcing law-abiding taxpayers to comply with unlawful demands just to safeguard their dignity,” he said.\n\nHe urged the government to target those outside the tax net rather than burdening the already documented segment.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68671d77c10ea.gif",
  "retrievedAt": "2025-08-17T19:41:06.235Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921941/business-leaders-warn-of-strike-over-draconian-tax-law",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:18:05.000Z"
}
