{
  "title": "Missile attack by Ukraine kills Russian navy’s deputy head - World - DAWN.COM",
  "author": null,
  "content": "MOSCOW: Major General Mikhail Gudkov, deputy head of the Russian Navy and a former commander of a marine brigade fighting against Ukraine, has been killed in action, depriving Moscow of one of its most senior officers, the Russian military said on Thursday.\n\nGudkov, who was handed a top military honour in the Kremlin by Russian President Vladimir Putin in February, was killed on Wednesday “during combat work in one of the border districts of Kursk region,” the Defence Ministry said in a statement.\n\nUnofficial Russian and Ukrainian military Telegram channels had earlier reported that Gudkov had been killed, along with other servicemen and officers, in a Ukrainian missile attack on a command post in Russia’s Kursk region, which borders Ukraine, with a US-made HIMARS missile.\n\nSome Russian war bloggers said he had been in overall command of marines advancing in Ukraine’s neighbouring Sumy region. In charge of the navy’s coastal and land forces, including marine units, he is one of the most senior Russian military officers to have been killed since Moscow launched its full-scale war against Ukraine in 2022.\n\nAt least 10 other senior Russian commanders have been killed in action or assassinated by Kyiv since the start of the war. There was no immediate comment from Ukraine, which accused Gudkov and his subordinates of committing various war crimes, something Moscow denied.\n\nIn the far eastern port city of Vladivostok, the home base of Russia’s Pacific Fleet, mourners left flowers near an outdoor portrait of Gudkov, part of a photo exhibition celebrating officers Russia regards as military heroes.\n\nOleg Kozhemyako, governor of the Primorsky region, which includes the port, said in a statement that Gudkov, whom Putin appointed deputy commander-in-chief of the navy in March, had been killed “carrying out his duty as an officer” along with others, and expressed his condolences to the dead men’s relatives.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68671957d7f76.gif",
  "retrievedAt": "2025-08-17T19:41:01.143Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921926/missile-attack-by-ukraine-kills-russian-navys-deputy-head",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:18:11.000Z"
}
