{
  "title": "Russia first country to recognise Afghan Taliban - World - DAWN.COM",
  "author": null,
  "content": "MOSCOW: Russia on Thursday became the first country to formally recognise the Taliban government in Afghanistan.\n\nMoscow’s special representative for Afghanistan, Zamir Kabulov, told the state news agency Ria Novosti that the government had “recognised” the Taliban.\n\nIn a statement issued after it accepted the credentials of a new ambassador from Kabul, the foreign ministry said the move would give impetus to the development of productive bilateral cooperation between our countries in various fields.\n\nNo other country has formally recognised the Taliban government that seized power in August 2021 after US-led forces staged a chaotic withdrawal from Afghanistan after 20 years of war.\n\nHowever, China, the United Arab Emirates, Uzbekistan and Pakistan have all designated ambassadors to Kabul, in a step towards recognition.\n\nThe Russian move represents a major milestone for the Taliban administration as it seeks to ease its international isolation.\n\nIt is likely to be closely watched by Washington, which has frozen billions in Afghanistan’s central bank assets and enforced sanctions on some senior leaders in the Taliban that contributed to Afgha­nis­tan’s banking sector being largely cut off from the international financial system.\n\nIn April of this year, Russia’s top court had suspended the ban on the Afghan Taliban and removed its designation as a terrorist organisation.\n\nAt the time, the move was seen as a step towards Moscow normalising ties with the de facto rulers of Afghanistan.\n\nRecently, shared security interests — including the fight against the so-called Islamic State-Khorasan (IS-K) have drawn Russia and the Taliban closer.\n\nReacting to the development, Afghanistan’s foreign minister said on Thursday that Russia’s decision to become the first country to recognise their government was a “brave decision”.\n\n“This brave decision will be an example for others… Now that the process of recognition has started, Russia was ahead of everyone,” Amir Khan Muttaqi said in a video of a meeting with Dmitry Zhirnov, the Russian ambassador to Kabul, posted on X.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/04074551b30e5a8.jpg",
  "retrievedAt": "2025-08-17T19:41:57.874Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921955/russia-first-country-to-recognise-afghan-taliban",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:17:44.000Z"
}
