{
  "title": "Proposed Gaza truce to begin with prisoner swap, troop withdrawal - World - DAWN.COM",
  "author": null,
  "content": "CAIRO: The US-backed proposal for a 60-day ceasefire in Gaza envisages a phased release of prisoners, Israeli troop withdrawals from the besieged territory, and discussions on ending the conflict, an official familiar with the negotiations said on Thursday.\n\nThe plan is subject to approval by both parties involved in the conflict. US, Qatari and Egyptian mediators have been working to secure agreement.\n\nAccording to an official, who spoke to Reuters on condition of anonymity, the plan includes provisions for negotiation on a permanent end to hostilities in the Palestinian territory.\n\nUnder the current draft, 10 Israeli prisoners would be returned along with the bodies of 18 others, according to the following schedule: Day 1: 8 prisoners — Day 7: 5 bodies — Day 30: 5 bodies — Day 50: 2 prisoners — Day 60: 8 bodies. The swaps will take place without any ceremonies or parades.\n\nOn Day 10, Hamas would be expected to provide information and evidence that confirm which remaining prisoners are alive or dead, plus medical reports.\n\nIn turn, Israel will provide full information about Palestinian prisoners from Gaza detained since October 7, 2023.\n\nAs per practice, Hamas will release prisoners in exchange for Israel releasing detained Palestinians.\n\nIsrael says that of the 50 prisoners held by Hamas and its allies, about 20 are believed to be alive.\n\nIn addition, aid will immediately enter Gaza in sufficient amounts with the involvement of the United Nations and the International Committee of the Red Cross, in accordance with a January 19 agreement.\n\nAfter the first eight Israeli prisoners are released, the Israeli army will withdraw from parts of northern Gaza as per maps that will be agreed upon.\n\nOn the seventh day, Israelis will withdraw from parts of the south.\n\nA technical team will work on drawing boundaries for withdrawals during rapid negotiations that will take place after agreement on the framework of the proposal.\n\nNegotiations will also start on a permanent ceasefire with key points that include: Remaining prisoner exchanges, long-term security arrangements for Gaza, and the declaration of a permanent ceasefire. If an agreement is reached, all remaining Palestinian prisoners detained from Gaza since October 7, 2023, will be released.\n\nThe proposal guarantees US President Donald Trump’s commitment to the agreement. If negotiations during the 60-day ceasefire are successful, they will lead to a permanent end to the conflict. The mediators will guarantee serious negotiations take place during the pause.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:41:56.389Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921956/proposed-gaza-truce-to-begin-with-prisoner-swap-troop-withdrawal",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:17:44.000Z"
}
