{
  "title": "Digitalisation key to transparent economy: PM - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Prime Minister Shehbaz Sharif on Thursday stressed the need for implementing the digital transaction system across the country, insisting that it is vital to bring transparency to the economy.\n\nChairing a weekly meeting on cashless and digital economy at the Prime Minister’s House, he emphasised the need to facilitate payments between citizens and businesses and raise awareness about the use of digital systems.\n\nThe premier instructed the committees formed for the cashless economy to work closely with all stakeholders to present doable recommendations.\n\nThe prime minister was informed that following the previous meeting, the Digital Payments Innovation and Adoption Committee, Digital Public Infrastructure Committee and the Government Payments Committee had been established.\n\nInstructs committees to work with stakeholders to present doable recommendations\n\nA detailed briefing was given with respect to the committees’ proposals and strategies regarding the digitisation of the economy. The meeting was informed that the State Bank of Pakistan was developing a strategy to simplify and ease digital payment methods for merchants.\n\nA simplified package will be introduced to encourage and include small businesses in digital payments. The target is to increase the number of mobile app users for digital payments from 95 million to 120m, and the number of merchants using QR codes will be increased from 0.9m to 2m. The total volume of digital payments is targeted to increase from Rs7.5 billion to Rs12bn.\n\nThe prime minister directed that all these targets be doubled.\n\nThe meeting was further informed that a “Digital National Pakistan” project had been initiated. The Islamabad City mobile application has so far recorded 1.3m downloads, offering 15 services.\n\nThrough the Islamabad City app, an amount of Rs15.5bn has been collected under ICT excise and taxation, the meeting was informed. Work is progressing rapidly on the completion of the Digital Pakistan ID project, while e-stamping facilities will also be launched in Islamabad soon.\n\nThe meeting was informed that efforts were underway to provide Wi-Fi internet services across Islamabad, particularly in hospitals, educational institutions, government offices, parks, and metro bus lines.\n\nThe prime minister instructed that all these facilities be also introduced in all federal areas, Azad Jammu and Kashmir and Gilgit-Baltistan.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/040925052b98439.jpg",
  "retrievedAt": "2025-08-17T19:41:08.306Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921939/digitalisation-key-to-transparent-economy-pm",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:18:05.000Z"
}
