{
  "title": "India monsoon season death toll hits 69 after floods, landslides - World - DAWN.COM",
  "author": null,
  "content": "Flash floods and landslides after torrential rain over the last two weeks killed at least 69 people and injured 110 others in India’s northern Himalayan regions, officials said on Friday.\n\nScores of people die each year during the rainy season due to flash floods and landslides across India, a country of 1.4 billion people.\n\nRivers swollen by lashing rain, including the mighty Beas, which starts from the region’s glacial peaks, disrupted several routes in the state of Himachal Pradesh.\n\nThe “cumulative damage” includes 69 people dead, and 110 others injured in different incidents over the past two weeks, the state’s revenue department said in a statement.\n\nIndia’s meteorological department on Thursday issued a fresh alert for “heavy to very heavy rainfall” in Himachal Pradesh and neighbouring Uttarakhand, another picturesque Himalayan state popular with Indian tourists.\n\nIndia’s annual monsoon season from June to September offers respite from the intense summer heat and is crucial for replenishing water supplies, but also brings widespread death and destruction.\n\nHeavy monsoon rains claimed at least 30 lives and injured dozens in India’s remote northeast region in June.\n\nIt led to the Brahmaputra, another major river that originates in the Himalayas, overflowing into nearby towns and villages in India’s state of Assam.\n\nOther instances of landslides and flash floods were also reported in the states of Arunachal Pradesh, Mizoram and Manipur, with authorities pressing the Indian military to aid in relief and rescue operations.\n\nSouth Asia is getting hotter and in recent years has seen shifting weather patterns, but scientists are unclear on how exactly a warming planet is affecting monsoons.\n\nLast month, India’s financial capital Mumbai was swamped by monsoon rain that began two weeks earlier than usual, the earliest for nearly a quarter of a century, according to weather forecasters.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/0417074259d9dae.jpg",
  "retrievedAt": "2025-08-17T19:39:43.748Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922084/india-monsoon-season-death-toll-hits-69-after-floods-landslides",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T12:19:19.000Z"
}
