{
  "title": "At least 10 dead, 9 injured as five-storey building collapses in Karachi’s Lyari - Pakistan - DAWN.COM",
  "author": null,
  "content": "At least 10 people died and nine were injured after a five-storey building collapsed in Karachi’s Lyari area on Friday, according to the Shaheed Mohtarma Benazir Bhutto Institute Of Trauma (SMBBIT).\n\nAccording to data from the institute at Civil Hospital Karachi, seen by Dawn.com, nine bodies were brought to the hospital while one person died during treatment. Police surgeon Dr Summaiya Syed also confirmed the same number of deaths.\n\nSMBBIT Executive Director Dr Sabir Memon told Dawn.com that among the injured people, six were discharged after being provided treatment.\n\nToday’s incident comes days after a portion of a building collapsed in the city’s Kharadar area. However, no casualties or injuries were reported. The Public Account Committee of the Sindh Assembly had directed the provincial government in December to take urgent steps to evacuate over 570 buildings declared “dangerous” by authorities across Karachi.\n\nRescue efforts were underway at the building situated on Fida Hussain Shaikha Road in Lyari’s Baghdadi neighbourhood, according to a statement from the Baghdadi police.\n\nPakistan Rangers, in a statement, said its personnel were also assisting in the rescue operations and “engaged in rescuing individuals trapped under the rubble”.\n\nThe heavy rescue machinery struggled to access the narrow alleys, and police baton-charged residents to clear the way, AFP reported.\n\nSpeaking to reporters at the site of the incident, Karachi Mayor Murtaza Wahab said the government needed to “take action”, noting that there were around 434 buildings in the Old City area that had been declared “dangerous” by the Sindh Building Control Authority (SBCA). A statement by the authority put the number of such buildings across Karachi at 588.\n\n“We have two options: to convince people to move out or force them to evacuate,” Wahab said, adding that any government tries not to take any forced action but to convince people.\n\n“This loss of lives today shows that when the state or the government tells you anything, you should follow it.”\n\nThe mayor requested the inhabitants of such dilapidated buildings to evacuate as soon as possible to prevent any unpleasant incident and loss of life or property.\n\nSaad Edhi of the Edhi Foundation described the structure to AFP as a “worn-out building”. Police official Arif Aziz told AFP that up to 100 people had been living in the building.\n\nRescue 1122 spokesperson Hassaan Ul Haseeb Khan told Dawn.com that the incident reportedly occurred between 9-9:30am but due to disruption of the communication network, the department received the information late.\n\nHe said that as per the residents and relatives, there were still 20-25 people stuck in the rubble and the rescue operation was still under way. He said some families had already realised the gravity of the situation and begun leaving with a few of them having already left the building as its structure had started to deteriorate after the recent rains.\n\nMeanwhile, the SBCA said it had declared the plot as dangerous through its Technical Committee for Dangerous Buildings after a thorough inspection conducted in October 2022.\n\nIt said it had received a complaint from the Sindh Human Rights Commission on July 22, 2022, and the authority had thereafter promptly issued the first ejectment notice on June 2, 2023, directing the residents and occupants to vacate the premises.\n\nIt said a second notice was issued on February 28, 2024, followed by a third with a three-day final warning and lastly a fourth notice addressed to the managing director of K-Electric, Sui Southern Gas Company (SSGC) and Karachi Water and Sewerage Board (KWSB) on June 25, 2024, instructing them to disconnect utility services.\n\nThe SBCA added that an urgent reminder for ejectment was issued on June 2 with copies sent to the South deputy and assistant commissioners and the Kalari station house officer, requesting their intervention to evacuate the premises and prevent any potential incident.\n\n“On June 29, 2025, the SBCA director also reported that residents were warned via megaphones to evacuate the building immediately.\n\n“Regrettably, the residents were reluctant to vacate the building unless alternate accommodation was provided. Furthermore, the utility agencies, K-Electric, SSGC, and KWSB, did not respond or disconnect services in a timely manner, nor did the district administration paid attention and responded by our issued ejectment notices.\n\n“It is important to note that the monsoon season is ongoing, increasing the risk associated with dangerous structures. According to SBCA records, 588 buildings have been declared dangerous throughout Karachi with 107 such buildings in Lyari alone. The SBCA has repeatedly advertised these threats through print and electronic media.”\n\nIt also pointed out that during his tenure, former Sindh chief secretary Sohail Rajput had instructed then-Karachi commissioner Saleem Rajput to take efforts to vacate the buildings declared dangerous by the SBCA Technical Committee. It added that the matter was still pending.\n\nAll six family members of 70-year-old Jumho Maheshwari were at his flat on the first floor when he left for work early in the morning.\n\n“Nothing is left for me now — my family is all trapped and all I can do is pray for their safe recovery,” he told AFP.\n\nAnother resident, Maya Sham Jee, said her brother’s family was also trapped under the rubble.\n\n“It’s a tragedy for us. The world has been changed for our family,” she told AFP.\n\n“We are helpless and just looking at the rescue workers to bring our loved ones back safely.”\n\nShankar Kamho, aged 30, a resident of the building who was out at the time, said around 20 families were living inside.\n\n“I got a call from my wife saying the building was cracking and I told her to get out immediately,” he told AFP at the scene.\n\n“She went to warn the neighbours, but one woman told her ‘this building will stand for at least 10 more years’. Still, my wife took our daughter and left. About 20 minutes later, the building collapsed.”\n\nSindh Local Government Minister Saeed Ghani said a high-level committee has been formed that will submit a report on the incident within three days.\n\nHis spokesperson Zubair Memon said the committee has been directed to submit a report identifying the responsible officers and their negligence. The minister also ordered the suspension of the related officials at the SBCA.\n\nSpeaking to reporters at the site of the incident, Ghani lamented that residents did not evacuate the building despite being served notices previously due to the unsafe conditions of the run-down structure.\n\n“Not one but many notices were given to them (residents) to evacuate the building in the past four to six years. But I can also understand the citizens’ struggle.\n\n“[…] On the one hand is your home in which you are residing, [but] on the other hand is your life,” Ghani added, urging residents of other dilapidated structures to evacuate to avoid any disaster.\n\n“If we forcibly make them evacuate, then also a humanitarian aspect comes forward, and we have to become a target of criticism for it,” the minister stressed.\n\nGhani said he had been told that the building was built in 1974. “There is an entire mafia that constructs these illegal buildings in the city; we have taken strict action against them and filed FIRs,” he said, urging citizens not to buy or rent such buildings to “end the demand”.\n\nTaking notice of the incident in a statement, Ghani ordered the top officials of the relevant authorities, including the SBCA, to reach the site of the incident to monitor the rescue efforts.\n\n“A report on the causes of the building collapse and all its reasons should be submitted immediately,” he said in the statement issued by Memon.\n\n“All obstacles around the building should be removed to speed up the rescue operation,” Ghani added.\n\nRoof and building collapses are common across Pakistan, mainly because of poor safety standards and the use of shoddy construction materials.\n\nBut Karachi, home to more than 20m, is especially notorious for poor construction, illegal extensions, ageing infrastructure, overcrowding and lax enforcement of building regulations.\n\nIn April, a 10-year-old girl died when a three-storey building in Bhains Colony suddenly collapsed, while a man and a woman were pulled alive from the debris.\n\nIn October 2023, five people were killed and four others injured when an under-construction building collapsed in Shah Faisal Colony.\n\nThe city witnessed two such incidents within 72 hours in September 2020, claiming the lives of at least three people and injuring over a dozen.\n\nLyari also faced a similar incident in June 2020, when 22 people were killed after a five-storey residential building housing about 40 apartments collapsed.\n\nA building collapse in Karachi’s Gulbahar area in March 2020 killed 27 people. A similar 2011 incident in Lyari’s Musa Lane neighbourhood took 33 lives.\n\nSindh Rescue 1122 Director General (DG) Abid Jalaluddin Shaikh, in a statement, said the service’s Central Command and Control Centre received an alert of the incident at 10:53am.\n\n“As soon as the alert was received, the Urban Search and Rescue team, along with a disaster-response vehicle (DRV), immediately reached the site of the incident,” the Rescue 1122 DG asserted.\n\nHe detailed that over 100 rescue personnel, five DRVs, two snorkels and multiple ambulances were present at the building’s location. Cranes and lifters have also been dispatched to the site, DG Shaikh added.\n\nHe explained that there were hindrances during the rescue operation due to the “unruly crowd, various road blockades and mobile network [issues]”.\n\nMobile services are usually suspended in certain areas due to security concerns during Muharram.\n\nThe Rescue 1122 head affirmed that the operation would continue till the site was “cleared”.\n\nTaking notice of the incident, Sindh Chief Minister Murad Ali Shah directed that rescue teams immediately rescue those trapped under the rubble, while immediate medical assistance be provided to the injured.\n\n“This is an unfortunate incident; concerned authorities should submit an immediate report,” CM Murad was quoted as saying in a statement by his spokesperson Abdul Rashid Channa.\n\nCM Murad also sought details of dilapidated buildings in Karachi from the SBCA.\n\n“Dangerous buildings should be identified immediately and practical steps should be taken to protect citizens,” CM Murad said. “Negligence will not be tolerated; protection of human lives is the top priority.”\n\nSindh Governor Kamran Tessori expressed his grief over the incident and ordered rescue authorities to conduct “immediate, effective, and coordinated relief operations”.\n\nIn a statement, he directed that all available resources be employed to safely rescue those trapped under the rubble, and that “every possible facility” be provided to the affected families.\n\n“Any kind of neglect or carelessness will be intolerable,” Tessori warned.\n\nPresident Asif Ali Zardari and Prime Minister Shehbaz Sharif expressed deep grief and sorrow over the incident, the Associated Press of Pakistan reported.\n\nIn separate statements, the president and the premier offered their “heartfelt condolences and sympathies” to the family members of those who lost their lives.\n\nPraying for the speedy recovery of those injured, President Zardari directed the Sindh government to expedite the relief efforts and immediately rescue those trapped under the debris.\n\nThe president also ordered that the causes of the incident be determined immediately and that effective measures be implemented to prevent such incidents in the future.\n\nPM Shehbaz also issued directives that all possible medical facilities be provided to the injured.\n\n“Such incidents must be prevented in the future by formulating a strategy on a priority basis,” the prime minister stressed.\n\nBilawal Bhutto-Zardari, chairman of the PPP that governs Sindh, conveyed his condolences to the aggrieved families and wished the injured a quick recovery.\n\n“I assure [the public] that the Sindh government will provide all assistance [needed],” Bilawal said in a statement shared by his party.\n\nInterior Minister Mohsin Naqvi, National Assembly Speaker Sardar Ayaz Sadiq, and Deputy Speaker Ghulam Mustafa Shah also expressed their condolences.\n\nSindh Assembly Syed Awais Qadir Shah, in a statement, highlighted that immediate action must be taken to identify dilapidated buildings and ensure public safety.\n\nSardar Abdulrahim, information secretary of the Grand Democratic Alliance (GDA), said that further loss of lives could have been avoided if the rescue machinery had reached the site on time.\n\n“A fair of illegal buildings has been set up in the city due to the [Sindh] government’s incompetence,” the GDA leader said.\n\nHe demanded that the families of the injured and wounded be provided with financial assistance, that alternate accommodation be arranged for the affected people, and that a case be filed against those responsible for the loss of precious lives.\n\nAdditional input from AFP",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/04175442e2a9ee5.jpg",
  "retrievedAt": "2025-08-17T19:39:57.494Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922050/at-least-10-dead-9-injured-as-five-storey-building-collapses-in-karachis-lyari",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T07:10:28.000Z"
}
