{
  "title": "Pakistan claim stunning victory over Maldives to win Asian Youth Netball Championship - Sport - DAWN.COM",
  "author": null,
  "content": "Pakistan thrashed the Maldives 60-35 in the final to win the Asian Youth Netball Championship on Friday and maintain its winning streak throughout the tournament being held in South Korea.\n\nPakistan had a strong start with 17-5 in the first quarter before ending halftime at 34-17.\n\nThe Green Shirts surged to 45-23 in the third quarter and ended at 60-35 to lift the championship trophy.\n\nStandout performances were delivered by Leya Raza Shah, Alisha Naveed, Sumayya Kouser, Haleema, Jasmine Farooq, Alina, Amani, Parisa and Farah Rasheed, who collectively maintained Pakistan’s stronghold on the game from start to finish.\n\nChairman of the Pakistan Netball Federation Mudassir Arian, along with President Sameen Malik and Secretary General Muhammad Riaz, extended their congratulations to the team.\n\nPrime Minister Shehbaz Sharif lauded the team for their victory.\n\n“Special appreciation for staying undefeated throughout the tournament!” he said in a post on X. “Very well played!”\n\nThe Pakistan Embassy in Seoul congratulated the team on their win, calling it “a proud moment for the nation and a great milestone for [Pakistani] women in sports.”\n\nA day earlier, the Green Shirts clinched their spot in the final after defeating Japan 64-39. In the quarter-finals, Pakistan defeated the Maldives 49-39 to advance to the semi-finals.\n\nThe tournament was taking place from June 27 to July 4 at the Jeonju Hwasan Gymnasium in South Korea.\n\nEleven teams were participating in the championship and had been divided into two groups. Group A: Malaysia, Singapore, Sri Lanka, Hong Kong and India. Group-B: Chinese Taipei, Japan, Korea, Pakistan, Maldives and Saudi Arabia .",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/041123571a9b18a.png",
  "retrievedAt": "2025-08-17T19:40:05.454Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922044/pakistan-claim-stunning-victory-over-maldives-to-win-asian-youth-netball-championship",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T06:28:02.000Z"
}
