{
  "title": "Ecocide & class war - Pakistan - DAWN.COM",
  "author": null,
  "content": "THE monsoon season has barely started, and the spectre of flash floods is already haunting us. The images that circulated last week of an entire family being stranded for hours in Swat waiting for a rescue operation that never came were both tragic and farcical.\n\nDespite how much our rulers and the ‘experts’ alike now deploy rhetoric about climate change, the Pakistani state is not interested in changing very much. In both of the mountainous highlands of KP and Gilgit-Baltistan (GB), we have been warned to expect intensification of glacial lake outburst floods, the flash flooding caused by permanent glacier melt. This process has been underway for decades, and every year it becomes more acute.\n\nThe rising temperatures that trigger glacier melt are explained largely by the excesses of industrial capitalism in the Western world, including the colonisation of much of Asia, Africa and Latin America. We cannot reverse this history, but some measure of justice can be done by demanding, as most non-Western countries are doing, that the emitters end their addiction to fossil fuels whilst also paying reparations.\n\nBut Pakistani capitalism is also contributing to warming temperatures. The fact that our rulers continue to largely externalise the climate crisis is duplicitous; there is no political will to keep large parts of this country habitable for future generations.\n\nThere’s no political will to keep the country habitable.\n\nThe developmental regime that has been championed in KP and GB for too long, and which is becoming even more entrenched, prioritises big infrastructure, including road-building, the felling of forests, and, increasingly, the mining of so-called critical minerals. Marx would call many of these processes primitive accumulation. They dispossess local people of their livelihoods, whilst also exacerbating warming temperatures and eliminating natural protections like forest cover against floods.\n\nThen there is the political economy of tourism, widely promoted by the state only to be selectively vilified when flood-related disasters take place. There is nothing wrong with ordinary people from mainland Pakistan going up north; the problem is when the authorities facilitate ecocide in the name of tourism. It is often the case that the least well-to-do hoteliers are blamed when floods ravage popular tourist locations like Swat, Naran and Hunza. But what about luxury hotels like the Luxus Resort in Attabad (Hunza) which was caught red-handed dumping sewage water into a fresh lake?\n\nA bigger class story is hidden behind the veil of tourism. Why are there no other meaningful livelihood options beyond tourism in the highlands? By promoting primitive accumulation and dispossessing working people of their traditional livelihoods — including grazing lands, pastures and smallholding agriculture — the mafias that masquerade as our rulers are not only devastating vulnerable ecosystems but also waging class war.\n\nEven those state departments that offered a modicum of public service under the guise of tourism, without ravaging the natural landscape like the Pakistan Tourism Development Corporation have been taken over by bodies like the SIFC that operate without any oversight in terms of class and ecological impact. It is also noteworthy that activists in KP and GB challenging ecocide and class war are being criminalised. Meanwhile, drone strikes and targeted killings are proliferating in districts like Waziristan, indicating where the state’s priorities lie.\n\nThe situation south of KP and GB is a little different. The war on nature and working masses carr­ies on under the guise of development. If there is flooding in the mountainous highlands, the Indus plains are unlikely to be spared. This year’s monsoon has been preceded by protracted heatwaves — these too, are becoming more intense and last longer with each passing year.\n\nEvery once in a while, like during the smog season in Lahore, there are proclamations that things will change. Ham-fisted closures of brick kilns and rickshaws end up forcing the burden of ecocide onto the working class. If we want farmers to stop engaging in slash-and-burn agriculture, we need to consider how to generate meaningful livelihood alternatives. Meanwhile, sales of SUVs continue to rise, newer roads continue to be built, and behemoths like the Ravi Riverfront Urban Development Project continue to be championed.\n\nThe 2022 monsoon was said to be a watershed moment. The floods which displaced almost 40 million working people and inundated much of Sindh, eastern Balochistan and the Seraiki belt are now a global case study. That man-made disaster too was at least partially caused by our own militarised ruling class, and three years later, there is no evidence that things are shifting. The status quo is, in fact, becoming even more entrenched.\n\nThe writer teaches at Quaid-i-Azam University, Islamabad.\n\nPublished in Dawn, July 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/68672a26d5ff7.jpg",
  "retrievedAt": "2025-08-17T19:40:37.904Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1921966/ecocide-class-war",
  "dateList": "2025-07-04",
  "date_published": "2025-07-04T01:18:24.000Z"
}
