{
  "title": "PM directs commencement of joint survey over flood losses from Balochistan",
  "link": "https://www.app.com.pk/national/pm-directs-commencement-of-joint-survey-over-flood-losses-from-balochistan/",
  "date_published": "2022-08-17T16:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Prime Minister Muhammad Shehbaz Sharif on Wednesday directed that a joint survey to ascertain losses caused by the recent floods should commence from Balochistan province as the provision of immediate relief and rehabilitation of the flood affectees were the top priorities of the government.\nThe prime minister was chairing an important follow-up meeting about the relief and rehabilitation operations in the flood-affected areas.\nThe meeting was apprised in detail that the objective of the joint survey was to collect data about the loss of lives, damaged homes, shops, crops and animals which would help ensure transparency, improvement and the pace in the rehabilitation efforts.\nThe meeting was chaired by federal ministers Ahsan Iqbal, Maulana Asad Mahmood, Miftah Ismail, Special Assistant to PM Ahad Cheema, Chairman NDMA Lt. Gen. Akhtar Nawaz and the relevant authorities. Special Assistant to PM on Kashmir Qamar Zaman Kaira attended the meeting via video link.\nSpeaking on the occasion, the prime minister said the government would ensure transparency in the support and rehabilitation mechanism of the affectees and resolved that he would not rest till the last deserving person got his due right.\nHe also directed that affected people should be immediately provided with financial support through a digital system and under the supervision of NDMA.\nIt was informed that the survey would first commence in the flood-affected areas of Balochistan province.\nThe survey would commence from August 20 and it would be ensured to complete it by September 22 this year. Moreover, the financial support under Benazir Income Support Programme would be distributed through the biometric system which would be supervised by the National Disaster Management Authority (NDMA).\nThe prime minister directed the implementation of these measures immediately.",
  "retrievedAt": "2025-08-11T15:25:01.685Z"
}
