{
  "title": "Businesses need to build ‘green technology’: Sherry Rehman",
  "link": "https://www.app.com.pk/national/businesses-need-to-build-green-technology-sherry-rehman/",
  "date_published": "2022-08-17T15:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said the business across the country needed to build green technology and green goals to ensure Eco-friendly and sustainable growth.\nThe Minister during her keynote speech at the “Leaders in Islamabad Business Summit 2022” on the topic ‘Climate Change and Way Forward for Pakistan,’ highlighted, “Climate change is a cross-cutting national issue that needs immediate action. We need to work towards building green technology and green goals for a thriving business landscape in Pakistan.”\nTaking the floor at the Summit, the minister stressed, “Seeing the country ravaged with climate catastrophes in the form of long, disastrous monsoon spells, unbearable heat waves, and apocalyptic flash floods, etc. make it all the more relevant for us to talk about how climate change and its environmental impact will directly affect businesses, society, and ecosystems. Balochistan alone faced 605% of rain this year on a 30-year average, leading to damages to life and property.All these changes have made Pakistan the ground zero of climate catastrophe. Damage to agricultural productivity, livelihoods, human health, and economic stability has led to irreversible impacts, including GDP losses of 9.1% (UNESCAP). Until recently, a large number of companies, unfortunately, have freely emitted carbon, dumped effluent in our water bodies, and increased single-use plastic production. We will face disastrous consequences if we keep up with these practices.”\nHighlighting the lack of global climate action, Sherry also added, “Pakistan will now have to look at its own climate solutions since the Global leadership is well behind the curve on climate targets.\nThe North has gotten rich from exploiting natural resources, which is why the GHGs have gone through the roof. The pledges are not matched by processes, and the ambitions are not matched by actions. The pace of climate change and its impacts are far more accelerated than the benchmark of 2050 set by world leaders at COPs.\nNotwithstanding mitigation, which is not a goal to be lost sight of, we are shifting our focus to building a National Adaptation Plan to face climate disasters and create resilience.”\nAddressing the business community, the minister said, “Countries are enhancing their climate literacy and seeking to ‘decarbonize’ their production cycle. Everybody is looking at the nature to go back to default, which is not happening, it will not, not on its own. We have to reset priorities to level up our resources and face climate disasters head-on. The provinces, too, will need to scale up. Our ambit is to provide them with policy guidelines. We need to build green technology and goals, and we would appreciate initiatives from the Tech companies. Many companies are merely greenwashing their pollution by funding projects to merely tick boxes with a dash of CSR. This needs to stop. Companies with innovations and technology to help deal with this climate crisis are welcomed and should come forward. A company’s climate plan should not stop at decarbonization; rather, it should start there. Transparent & ethical sourcing of materials, environmentally conscious manufacturing practices, waste-conscious packaging, shipping choices negating carbon footprint are just a few ideas of sustainable practices.”",
  "retrievedAt": "2025-08-11T15:25:01.384Z"
}
