{
  "title": "Sanjrani stresses increasing trade volume between Pakistan-Iraq",
  "link": "https://www.app.com.pk/national/sanjrani-stresses-increasing-trade-volume-between-pakistan-iraq/",
  "date_published": "2022-08-17T15:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Senate chairman Muhammad Sadiq Sanjrani on Wednesday stressed the need to increase trade volume between Pakistan and Iraq by establishing contacts between the chambers of commerce of both the countries.\nIn a meeting with Iraqi Ambassador Hamid Abbas Lufta, he said the current volume of mutual trade does not commensurate with the potential of both countries which can be further enhanced by mutual cooperation.\nBoth the dignitaries discussed issues of mutual interest including bilateral relations and the current political situation in Iraq.\nChairman Senate was of the view that Iraq can import rice, surgical instruments, sports equipment, furniture and other products from Pakistan.\nSanjrani said there was a need to increase direct air links between Pakistan and Iraq.\nHe also stressed the need to promote unity among Muslim countries to effectively overcome the challenge of Islamophobia.\nChairman Senate said the relations between Pakistan and Iraq were based on religion, brotherhood, Islamic culture, mutual respect and common values.\nPakistan attaches great importance to long-standing fraternal ties with Iraq, he said and emphasized the need to increase parliamentary exchanges.\nHe said parliamentarians of both the countries can play an important role in making bilateral relations more stable and bringing the two countries closer.\nIraqi Ambassador Hamid Abbas Lufta said that Iraq values its friendly relations with Pakistan and wanted to further expand the existing relations by establishing strong economic and trade ties.\nHe appreciated the Pakistani diaspora in Iraq for their services and assured of all possible facilitation to religious pilgrims from Pakistan.",
  "retrievedAt": "2025-08-11T15:25:02.735Z"
}
