{
  "title": "NUMS, GSM sign MOU for creating awareness on gender-based violence, premarital counselling",
  "link": "https://www.app.com.pk/national/nums-gsm-sign-mou-for-creating-awareness-on-gender-based-violence-premarital-counselling/",
  "date_published": "2022-08-17T09:56:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Aug 17 (APP):National University of Medical Sciences(NUMS) and Green Social Marketing, Pakistan (GSM) signed here on Wednesday a Memorandum of Understanding (MoU) to train 600 Master Trainers for creating social awareness on Sexual and Reproductive Health and Rights (SRHR), gender-based violence, Premarital counselling, benefits of birth spacing and authentic information about modern contraceptives.\nThe MoU on “Khud Ko Pechaano Program” (recognize yourself) was inked by Maj Gen Syed Ammar Reza Hamdani, HI (M), (Retd) Pro Vice Chancellor (Administration) NUMS and Dr Syed Aziz ur Rab Chief Executive Officer Greenstar Social Marketing Pakistan (G) Limited, Karachi. Those present on the occasion were NUMS Registrar Brig Muhammad Azhar Shams, (Retd), Dean Multidisciplinary Studies Dr Aisha Mohyuddin, Prof Azam Chaudhary, Dean Department of Social Sciences and Humanities and Muhammad Ismail Cdre, (Retd) Director Quality Assurance.\nPro Vice Chancellor (Administration), Maj Gen Syed Ammar Reza Hamdani, (Retd) presented NUMS souvenir to GSM Executive officer on the occasion.In his brief comments after the signing ceremony, CEO GSM while highlighting importance of the MOU said, “NUMS comes to the top of the organizations wherein there is a disciplined approach” and added “We think NUMS is emerging as a model university in Pakistan by engaging younger people in family planning programme”.\nExplaining the objectives, the MOU, said that it would empower beneficiaries about their SRHR and sensitize them “on the difference between sex and gender, gender expression, sexuality, gender-sensitive definitions, social and gender norms”. It will train them with skills to contribute towards the achievement of Sustainable Development Goals(SDGs) for eliminating “maternal mortality, gender-based violence, and informed choices for birth spacing.”\nBesides the MOU will increase awareness about “contraception (at least three modern methods), Family Planning, and Birth Spacing in the target population.” It will also help the trainers to develop their skillset to identify gender-based violence and its mitigation strategies and will empower youngsters to break gender-based stereotypes, myths, and misconceptions.\nAccording to the MOU the Partners “acknowledge that no contractual relationship is created between them by this memorandum but agree to work together to impart Adolescent & Youth Sexual & Reproductive Health (AYSRH) and Family Planning awareness and improve their understanding via informed choices and decisions through collaboration in the areas above.”\nGreenstar Social Marketing Pakistan is continuously striving for the last 32 years to deliver voluntary and informed family planning services for all women, men and their families, in all the four provinces.",
  "retrievedAt": "2025-08-11T15:25:07.854Z"
}
