{
  "title": "Marriyum lauds Radio Pakistan’s role in developing moderate attitudes in society",
  "link": "https://www.app.com.pk/national/marriyum-lauds-radio-pakistans-role-in-developing-moderate-attitudes-in-society/",
  "date_published": "2022-08-17T07:47:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): Minister for Information and Broadcasting Marriyum Aurangzeb said on Wednesday that Radio Pakistan had played an important role in development of moderate attitudes in the society.\nوفاقی وزیر اطلاعات @Marriyum_A کی @RadioPakistan کے زیر اہتمام قیام پاکستان اور ریڈیو پاکستان کی ڈائمنڈ جوبلی کے موقع پر منعقدہ تقریب میں شرکت۔ریڈیو پاکستان کے سینئر فنکاروں،صداکاروں، لکھاریوں، موسیقاروں اور دیگر شعبہ جات سے تعلق والے افراد کو خاص طور پر مدعو کیا گیا.#APPNews pic.twitter.com/fJT6jYKQZ7\nSpeaking in an event organized by Radio Pakistan on the occasion of the establishment of Pakistan and Radio Pakistan’s Diamond Jubilee, she stressed for an extended role of radio to counter extremism in society.\nSenior artists, singers, writers, poets, musicians and other people from Radio Pakistan were specially invited on the occasion.\nThe minister said that Radio Pakistan and Pakistan were born simultaneously, and Radio was the voice of beloved Pakistan and symbol of ‘Pakistaniat’.\n“Senior artists of Radio Pakistan are our asset, we should utilize their skills and abilities”, she said adding that the Diamond Jubilee celebrations were not complete without senior artists.\nShe also gave away awards to the artistes selected from various categories.\nThe minister cut the cake of Pakistan’s Diamond Jubilee celebrations along with the senior artists and paid tribute to them. Highlights of the national anthem, national songs played on Radio Pakistan since the establishment of Pakistan and special performances were also presented in the event.\nOn this occasion, the minister congratulated Radio Pakistan’s management and senior artists.\nDirector General Radio Pakistan Sohail Ali Khan, Principal Information Officer Mubashar Hassan and other senior officials of the Ministry of Information and Broadcasting also attended the ceremony.",
  "retrievedAt": "2025-08-11T15:25:07.779Z"
}
