{
  "title": "President holds NBP responsible for maladministration; orders refund of defrauded money to complainant",
  "link": "https://www.app.com.pk/national/president-holds-nbp-responsible-for-maladministration-orders-refund-of-defrauded-money-to-complainant/",
  "date_published": "2022-08-17T11:15:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Aug 17 (APP): President Dr Arif Alvi has held the National Bank of Pakistan (NBP) responsible for wrongdoing and maladministration in a case where an innocent and illiterate customer was swindled out of Rs 1 million by a branch manager while depositing the amount in the bank.\nHe directed the NBP to refund the defrauded amount along with any interest to the customer.\nHe held that the senior Mlmanagement of the NBP had failed to fulfil its responsibility of appointing vigilant, honest and professional bank officials at the branch.\nPresident Alvi gave these orders while accepting a representation of an Abbottabad-based complainant Ashiq Hussain against the decision of Wafaqi Mohtasib (WM).\nHe held that the customer had also committed lapses while depositing his money with the manager, who later fraudulently withdrew the amount from customer’s account.\nThe Mohtasib refused to provide relief to the complainant on the ground that he had handed over the cash to the Bank Manager instead of the cashier and the receipts were signed by only the bank manager instead of being signed by both the manager and the cashier as per the required procedure.\nAshiq Hussain felt aggrieved with the decision of Mohtasib and filed a representation with the president.\nThe president accepted the representation and held that it was the responsibility of the bank manager to complete the formalities as per banking practice and not of the complainant.\nPresident Alvi said that the bank was the custodian and trustee of the hard-earned money of the accountholders and it had breached that trust by failing to perform its fiduciary duty of appointing professional and honest officials.\nHe highlighted that the manager had a very important role to be performed and its basis was the creation of a relationship of trust and confidence, which resulted in fiduciary duty.\nHe said that the breach of such duty undoubtedly reflected upon the very credibility of the said bank and also put the customers in a disadvantageous and risky position.\n“The officials were in service of the bank and there was unimpeachable evidence of the commission of fraud by the bank officials within the bank branch as was indicated by the stamp and signatures on receipts”, he observed.\nThe president held that the bank could not escape the liability in a case of that kind when the commission of fraud with the accountholder by its management had been established and admitted and further directed NBP to implement his orders and report compliance to WM Secretariat within 60 days.",
  "retrievedAt": "2025-08-11T15:25:05.564Z"
}
