{
  "title": "Turkish Red Crescent gives a helping hand to flood-hit Pakistan",
  "link": "https://www.app.com.pk/national/turkish-red-crescent-gives-a-helping-hand-to-flood-hit-pakistan/",
  "date_published": "2022-09-23T16:56:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP):The Turkish Red Crescent has been active in Pakistan since floods claimed hundreds of lives, with its teams trying to reach as many affectees as possible, Turkish newspaper Daily Sabah reported.\n“Either by trucks or by boats, teams seek to address the basic needs of the displaced, including accommodation, food and hygiene and also expanding its humanitarian assistance to health care centers,” the newspaper said.\nTurkish Red Crescent President Kerem Kinik said they had never left Pakistan after a deadly earthquake in 2005. “We set up a permanent humanitarian aid delegation here after the 2005 disaster. Our delegation was among the responders to this new catastrophe as well. By the time our teams from Turkiye arrived here, our colleagues, in cooperation with Pakistan Red Crescent, were healing the wounds,” he added.\nKinik also said the Red Crescent first supplied food aid and later organized accommodation efforts. “With the tents we sent from Turkiye and tents we obtained here in Pakistan, we tried to protect flood victims. There is still work to do to address accommodation needs, as well as public health.”\nHe pointed out that the biggest threat to flood victims was now infectious diseases. “Clean drinking water is a major necessity here. Swamps that the floods created may cause millions to fall ill. People are in need of hygiene materials. So, we will concentrate on supplying hygiene and health care aid in the next stage of our efforts.”\nAnil Kocabal, head of the Turkish charity’s delegation in Pakistan, said waterborne diseases were increasing in the flood-hit areas. “We are planning to set up mobile health units in three regions and they will serve about 30,000 people. We will assign mobile health care teams consisting of doctors and nurses for first response before the transfer of patients to hospitals. We plan to realize these efforts within a week, he added.\nKocabal also said that they were working on public access to clean water resources and planned to deliver water filtration systems to some 5,000 families in Pakistan, .\nTukiye continuously sends help to Pakistan and on Thursday, sent two more “Kindness Trains” loaded with humanitarian aid. They were the eighth and ninth trains and carry 1,040 tons of disaster relief goods, including food and hygiene products.",
  "retrievedAt": "2025-08-11T15:37:21.145Z"
}
