{
  "title": "OIC expresses full support to Kashmiris’ right to self determination",
  "link": "https://www.app.com.pk/national/oic-expresses-full-support-to-kashmiris-right-to-self-determination/",
  "date_published": "2022-09-22T22:24:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 23 (APP):Member states of Organization of Islamic Cooperation (OIC) Thursday renewed unwavering solidarity with the people of Jammu and Kashmir and expressed full support for their inalienable right to self- determination in accordance with the relevant resolutions of the United Nations Security Council and the OIC, and the wishes of the Kashmiri people.Foreign Minister Bilawal Bhutto Zardari chaired the Annual Coordination Meeting (ACM) of the Organization of Islamic Cooperation Foreign Ministers at the United Nations Headquarters here on the sidelines of the 77th Session of the UN General Assembly.OIC member states commended Pakistan for its active and forceful advocacy of all matters of interest to the Islamic Ummah and its prominent role within the OIC. The meeting also expressed full solidarity and sympathy with the government and people of Pakistan affected by the recent climate-induced devastating floods.In his address, the Foreign Minister emphasized that Pakistan, as a founding member of the OIC, attached utmost importance to the Organization as the sole and most prominent voice of the Muslim Ummah. He reviewed the wide range of issues confronting the Muslim Ummah, including rising Islamophobia, the situation in Palestine, Indian Illegally Occupied Jammu & Kashmir, Afghanistan, COVID-19 pandemic, the food, fuel and finance crises and the existential threat posed by climate change. The Foreign Minister expressed special appreciation for the OIC’s consistent and historic support for the Kashmir cause.OIC Secretary-General Hissein Brahim Taha, and Saudi Foreign Minister Prince Faisal bin Farhan Al Saud in capacity as chair of the OIC Summit also addressed the meeting.\nDuring the coordination meeting, the OIC Member states exchanged views on a range of issues on the agenda of the 77th UNGA session. They also reviewed follow-up action on the resolutions and decisions of the OIC.The meeting reaffirmed the centrality of the question of Palestine and Al-Quds Al-Sharif for the Muslim Ummah, reaffirming its principled and continued all- level support to the Palestinian people to regain their inalienable legitimate national rights, including their right to self-determination, and the independence of the State of Palestine along the 1967 borders, with Al-Quds Al-Sharif as its capital.The meeting also reaffirmed the importance of sustained engagement of the international community with Afghanistan, especially in supporting the humanitarian and development needs of the Afghan people.\nKeeping in view the global challenges and noting that a vast majority of international conflicts and disputes involve OIC member states, the Foreign Minister underlined the importance of establishing an effective peace and security architecture within the OIC in accordance with the authority conferred by Article 10 (e) of the Charter. He encouraged his counterparts to share their perspective on strengthening and fully activating the OIC Peace and Security architecture to enable the OIC to contribute to and promote durable solutions to the problems faced by the Muslim world.The meeting welcomed the adoption of the landmark UN General Assembly resolution proclaiming 15 March as the International Day to Combat Islamophobia and agreed to urge, as a follow-up of the resolution, the UN Secretary-General to formulate an action plan, in coordination with the OIC countries, to halt and reverse Islamophobia.\nThe ministers also exchanged views on a series of global shocks: the Covid-19 pandemic, rising commodity prices, climate change and a contracting world economy compounded by the ongoing conflict in Europe. The Ministers expressed concern that these shocks have decelerated progress towards Sustainable Development Goals (SDGs) in the developing world and, as a result intensified inequality within and among States, including in the Islamic countries.The ministers underscored the need for the OIC to work towards evolving collective and concerted responses to the political, economic, climate and other challenges confronting the world today.",
  "retrievedAt": "2025-08-11T15:37:30.490Z"
}
