{
  "title": "Security situation under control in Swat, Senate body told",
  "link": "https://www.app.com.pk/national/security-situation-under-control-in-swat-senate-body-told/",
  "date_published": "2022-09-23T13:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 23 (APP): The Senate’s Defence Committee on Friday was assured that the writ of the state was paramount and the law and order situation was under control in Swat after law enforcement agencies launched strict action against hostile elements.\nThe committee, which met under the chairmanship of Senator Mushahid Hussain Sayed, received a comprehensive briefing on the security situation in Swat in the backdrop of reported activities of the Tehreek-e-Taliban Pakistan (TTP), a Senate Secretariat news release said.\nIt was told that some violent incidents were reported in the area but the culprits behind them were traced and caught.\nThe committee members appreciated the Counter Terrorism Department (CTD), and other law enforcement forces, including police, Levies and paramilitary forces, who had played a heroic role to protect and promote peace as well as the lives of the people of Malakand.\nThey, however, had the consensus that there should not be any appeasement and no compromise on upholding the rule of law, and all those committing crimes against the people and the state must be caught, tried in the court and given due punishment as per the law.\nA motion moved by Senator Dost Mohammad Khan was also discussed and disposed off by the committee.\nAt the outset of meeting, Senator Mushahid welcomed the new Secretary Defence Lieutenant General (R) Hamood uz Zaman and appreciated his services as head of the National Command and Operation Centre (NCOC) which was primarily responsible for containing coronavirus pandemic.\nHe said the defence committee represented all the political parties, both the government and the opposition, and all the provinces, and had always worked as a bridge between the armed forces and the parliament.\n“On national security issues, the committee speaks above party lines in a unified manner. The Senate’s Defence Committee will continue to play its role with unity,vigor and determination on the issues of national security,” he added.\nThe committee also received a briefing from the Director General of Federal Government Educational Institutions (FDEI) on the functioning of the department which had 386 schools in over 66 cities in all the provinces.\nThe committee appreciated that the FDEI playing a positive role to promote national integration through education, and noted that its meager budget needs should be raised and it should also be treated at par with the Federal Directorate of Education.\nThe committee also supported the proposal of establishment of National University of Pakistan and an Institute of Inclusive Education.",
  "retrievedAt": "2025-08-11T15:37:23.372Z"
}
