{
  "title": "Bilawal seeks climate justice for Pakistan",
  "link": "https://www.app.com.pk/national/bilawal-seeks-climate-justice-for-pakistan/",
  "date_published": "2022-09-22T20:40:00.000Z",
  "source": "APP",
  "content": "NEW YORK, Sep 23 (APP):Minister for Foreign Affairs Bilawal Bhutto Zardari Thursday said he wanted climate justice for people of Pakistan as carbon footprint of his country was only 0.8 percent of the total carbon emissions of the world.While speaking about massive floods in Pakistan, during an event organized by the Council on Foreign Relations here, he said, “All of a sudden we are among the 10 most climate stressed countries on the planet. Pakistan is on number 8th.”He said the catastrophe of floods in Pakistan was apocalyptic and of epic and biblical proportions.The rains went on for months till the end of August, and one-third of Pakistan was submerged in flood waters, he added.He said thirty-three million people were affected during the floods and they became homeless and now their problems were compounded due to the water borne diseases including malaria.“We need the assistance of the international community including the World Health Organization to tackle the water borne diseases.”The minister pointed that Pakistan was facing the issue of economic and food insecurity and during the flood four million acres of its standing crops were destroyed.“We fear that planting of the wheat crops after two months will not be possible.”Talking about economic difficulties of Pakistan, Bilawal said, “We were in a very difficult negotiations with the IMF and just reached an agreement with the financial institution.”Pakistan was hoping to enjoy a short space of economic relief but all the economic figures and estimates which were shared with the IMF were also washed away in the floods, he remarked.He said the guesstimate of the economic cost of the flood damages was close to $ 30 billion.This catastrophe was not the fault of the people of Dadu in Sindh, Naseerabad in Balochistan, Dera Ghazi Khan in South Punjab and of Dera Ismail Khan in Khyber Pakhtunkhwa but it was due to effects of climate change.He expressed gratitude to the United Nations Secretary General, the UN agencies and United States for extending support to Pakistan in the aftermath of the natural disaster.“I am encouraged by the sympathy, solidarity and support offered by the United Nations, United States and others.”“We want to be able to rebuild lives and livelihoods of people of Pakistan in a just manner. Every crisis does indeed also offer an opportunity. We will have to construct our lives, our irrigation and communication infrastructure, and we want to do so in a better way, in a greener and climate resilient way.”“I believe that this is the moment when Pakistan can plan, going forward to adapt ourselves to the increasingly frequent climate catastrophes that we now face,” he observed.“I must say that Pakistan Peoples Party is the leading voice on climate and environment in Pakistan and is putting this agenda forward. We are focused on wind and solar energy and now climate adaptation will be our main focus,” Bilawal added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T15:37:31.473Z"
}
