{
  "title": "PM directs measures to curb wheat smuggling, theft",
  "link": "https://www.app.com.pk/national/pm-directs-measures-to-curb-wheat-smuggling-theft/",
  "date_published": "2022-05-06T13:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 6 (APP): Prime Minister Shehbaz Sharif Friday directed the authorities concerned to formulate an urgent strategy against the corruption and theft of wheat and for the construction of the silos for storage.\nThe prime minister, chairing a high-level meeting to examine the wheat production, available stock and expected consumption, said the construction of the silos would help curb theft and corruption.\nHe told the meeting that despite being an agricultural country, Pakistan had been compelled to import wheat instead of meeting its own needs, just due to the wrong decisions and delayed strategies.\nThe meeting was told that wheat production of 26.173 million metric tons was expected this year against the target of 28.89 million metric tons while the estimated consumption would be around 30.79 million metric tons.\nIt was told that reduced wheat cultivation, water shortage, fertilizer crisis due to the mismanagement by the previous government, and delayed announcement of wheat support price led to the reduced production of wheat by two percent.\nThe oil price hike and early rise in temperature due to climate change were also among the factors impeding the achievement of the wheat production target.\nThe prime minister was also apprised of relief measures taken by the incumbent government including subsidy on wheat supply to flour mills, availability of 10kg flour bag at Rs 400 and provision of 200,000 metric tons wheat to KP.\nThe prime minister directed the authorities concerned to assess the wheat consumption of KP and ensure the provision of the required supply of the commodity in coordination with the provincial government.\nThe meeting was told that Punjab had achieved 91.66 percent of the wheat procurement target, Sindh 49.68, Balochistan 15.29 while PASSCO had achieved 100% of the target.\nThe prime minister said that the delayed announcement of wheat support price had not only led to reduced wheat production but it was also an attempt to directly oblige the hoarders.\nHe also asked the Punjab province to enhance its procurement target and directed the Food Security Division to import the wheat in order to bridge the shortfall.\nThe prime minister also expressed his resolve to make Pakistan a wheat self-sufficient country through effective strategy.\nMinister for Food Security Tariq Basheer Cheema, senior officers of PASSCO and Punjab Chief Secretary and provincial government officers attended the meeting.",
  "retrievedAt": "2025-08-11T14:49:35.335Z"
}
