{
  "article_id": "2025-06-13_38f99b7f29cb161a7ad31ba892a91b2a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ayaz-sadiq-condemns-israeli-attack-on-iran-calls-for-un-action/",
    "retrieved_at": "2025-08-27T11:07:12.937Z"
  },
  "metadata": {
    "title": "Ayaz Sadiq condemns Israeli attack on Iran, calls for UN action",
    "author": null,
    "date_published": "2025-06-13T09:26:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 198,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 13 (APP): Speaker National Assembly of Pakistan, Sardar Ayaz Sadiq Friday strongly condemned Israel's attack on Iran, terming it a blatant violation of international law. In a statement issued here, he said \"Israel's aggression is an attack on Iran's sovereignty. The United Nations must take immediate notice of this unprovoked assault.\" He emphasized that Iran has the full right to self-defense under Article 51 of the United Nations Charter and expressed Pakistan's unwavering solidarity with the Iranian people. \"The Parliament and people of Pakistan stand in full solidarity with the people of Iran,\" he added. Calling the Israeli actions a grave threat to regional peace and security, the Speaker urged the international community to recognize the violation of international law and take appropriate measures. \"The Israeli strikes are a serious threat to regional peace and stability,\" he added. \"The international community must take notice of these violations.\" Ayaz Sadiq stressed the need to halt Israeli provocations in the interest of regional stability and international peace. \"Israeli attacks are a clear breach of international law and the UN Charter,\" the Speaker said, urging a collective global effort to uphold peace and prevent further escalation in the region.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}