{
  "article_id": "2025-06-13_83fae18020e133b76ee10b3ed66d7754",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senate-condemns-israeli-aggression-voices-support-for-irans-right-to-self-defense/",
    "retrieved_at": "2025-08-27T11:07:10.077Z"
  },
  "metadata": {
    "title": "Senate condemns Israeli aggression, voices support for Iran’s right to self-defense",
    "author": null,
    "date_published": "2025-06-13T10:15:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 258,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 13 (APP): The Senate on Friday strongly condemned the Israeli aggression against Iran, reaffirmed its unwavering solidarity with the Iranian people, and fully supported their right to self-defense in the face of the ongoing hostilities. In a unanimously adopted joint resolution, the House took a strong and united stance, unequivocally condemning Israel for its heinous crimes against the Muslim Ummah, particularly targeting the brotherly nations of Palestine and Iran. The resolution reaffirmed unwavering solidarity with the Iranian people and fully supported their right to self-defense amid the ongoing aggression. In a joint resolution, the House declared that Israel's attack was a blatant violation of the fundamental principles of the United Nations and all established international norms, endangering peace and security in the region and beyond. The resolution noted that Israel has long been responsible for the deaths of countless Muslims worldwide, particularly in Occupied Palestine. It further stated that, in the early hours of the day, Israel once again violated the UN Charter and international law by committing a war crime through its attack on Pakistan's neighboring and brotherly country, the Islamic Republic of Iran. The resolution stated that the world, particularly the Muslim Ummah, has been witnessing the relentless slaughter of children and civilians in Gaza over the past two years on an unimaginable scale. It expressed deep concern over the inaction of the Muslim world in the face of this ongoing genocide, warning that such silence has emboldened Israel to now launch an attack on another sovereign Muslim state, the Islamic Republic of Iran.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}