{
  "article_id": "2025-06-13_1b622aaf79bad192d697a4b77f2cb8f4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-shahadat-awan-criticizes-federal-budget-calls-for-relief-measures-for-poor-farmers/",
    "retrieved_at": "2025-08-27T11:07:33.363Z"
  },
  "metadata": {
    "title": "Senator Shahadat Awan criticizes Federal Budget, calls for relief measures for poor, farmers",
    "author": null,
    "date_published": "2025-06-13T10:11:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 663,
    "reading_time_minutes": 4
  },
  "content": {
    "article_body": "ISLAMABAD, Jun 13 (APP):Pakistan Peoples Party's Senator Shahadat Awan on Friday strongly criticized the Federal Budget for 2024-25, saying it lacks effective relief for the poor, farmers, and working-class segments of society, and failed to address the country's pressing economic challenges. Participating in Budget debate in the Senate, he said the Rs 17,573 billion budget might temporarily stabilize the economy but would ultimately prove inadequate in providing long-term solutions to the country's socio-economic issues. He said that out of the total outlay, Rs 827 billion would go towards debt servicing alone, questioning how such a budget could be considered development-oriented or welfare-based. He said the World Bank has reported that 44.7 percent of Pakistan's population-around 107 million people-live below the poverty line. He regretted that no concrete roadmap had been introduced in the budget to tackle this rising poverty. He said the minimum wage of Rs37,000 was insufficient in the face of soaring inflation, adding that the Pakistan People's Party (PPP) had consistently demanded this amount be raised to Rs 50,000. He urged the federal government to ensure this wage is enforced both in the public and private sectors. He said the salaries of government employees should have been raised by at least 50 percent to reflect the rising cost of living, but the increase remained inadequate. He also emphasized the need to improve pension schemes under the EOBI system, particularly for those outside the regular civil service. He said the agriculture sector was once a source of pride for Pakistan, but now it is in crisis. This year alone, agricultural output has declined by 13.5 percent, with a 30.7 percent drop in cotton production and a 9 percent fall in wheat. He claimed the farming community had suffered a loss of Rs2,200 billion between May 2024 and May 2025. He said that while imported cotton has been made tax-free, seeds for local production are still subject to 18 percent GST, calling such policies unjust and counterproductive. He demanded more subsidies for seeds and fertilizers to revive the sector. He said approximately 40,000 jobs have been eliminated in the new budget, while new departments and agencies have been formed, increasing the burden on taxpayers without structural reforms. He said changes to pension rules were unfair, particularly the new condition of a 10-year limit for family pensions after a spouse's death. He also criticized the withdrawal of the 25 percent tax rebate for teachers and researchers and called for its reinstatement. He said the imposition of an 18 percent sales tax on e-commerce and solar panels would hurt innovation and the environment. He opposed the imposition of Rs2.5/kWh electricity levy, saying it would further burden households. He said despite promises made after the 2022 Murree tragedy that claimed 23 lives, no meaningful development plan had been presented to improve facilities in the area. He said that Karachi, Pakistan's largest city, had been neglected, with only Rs3.8 billion allocated out of the Rs202 billion it needs. He emphasized the city's severe water crisis and called for increased allocations. He said that motorways should be built from underdeveloped areas outward, but the government had focused funding on Hyderabad-Sukkur projects, neglecting rural development. He said the allocation for Main Line-1 (ML-1) railway development had been reduced to just Rs125 million, and the budget for technology development cut by Rs1.85 billion, which he called a setback for national progress. He said a clause under Section 378 of the Finance Bill empowers FBR officers to arrest directors of companies without due process if discrepancies are suspected. He warned this could discourage investment and force businesses to leave Pakistan. He concluded by urging the government to adopt a people-friendly budget that ensures no child is out of school, no farmer is deprived of fair compensation, and no citizen is disillusioned. He appreciated the role of the Pakistan Armed Forces during recent border incidents and supported increasing their budget, noting the nation was ready to make sacrifices for defense and sovereignty.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}