{
  "title": "Youth to be assisted in getting overseas jobs: Usman Dar",
  "link": "https://www.app.com.pk/national/youth-to-be-assisted-in-getting-overseas-jobs-usman-dar/",
  "date_published": "2020-07-15T03:50:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP):Special Assistant to the Prime Minister (SAPM) on Youth Affairs Muhammad Usman Dar Wednesday said the government was striving to set up facilitation centers across the country to assist youth in obtaining overseas jobs.\n“We are working on establishing facilitation centres across Pakistan to prepare and assist our youth in getting employment opportunities abroad. This will help a great deal in helping Pakistani youth to get jobs in international markets and earn precious foreign exchange reserves for the country,” he said in video message released in connection with World Youth Skills Day (WYSD).\nHighlighting the government’s youth development initiatives, he said historic and unique skills programme- Hunarmand Pakistan (Skills for All)- had been launched to impart skills to the young people on modern lines.\n“For the first time in the country’s history, this comprehensive programme contains skills training to more than 100,000 youth in highly demanded courses including machine learning, artificial intelligence, internet of things, web portal designing and developing digital applications,” the SAPM noted.\nUnder the programme, he said all the courses were being offered without any charge. The initiative was meant to enable the youth in getting better employment opportunities within the country and abroad.\nUsman Dar said a comprehensive strategy had been put in place for imparting skills to all in general and to the youth in particular.\nThe inclusive strategy included provision of modern training tools to training institutes, redesigning of professional training courses with the help of relevant industry, training of teachers/ instructors in internationally acclaimed institutes, certification of training institutes by international bodies and technical and vocational trainings for students of Madaris (seminaries) alongside religious education, he added.\n“Youth is our most precious national asset and they undoubtedly hold a significantly important role to play in the country’s development,” he remarked.\nOn this day, Usman said he would like to inform the youth that skilled human resource was a prerequisite for attaining proper industrial development in Pakistan.\nHe urged the youth to come forward and take benefit from the skills programme, launched by Prime Minister Imran Khan under the umbrella of PM’s Kamyab Jawan Programme by equipping themselves with modern skills.\n“Skilled youth will play a decisive role in the progress, development and financial stability of Pakistan,” the SAPM hoped.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:30:02.691Z"
}
