{
  "title": "Minister for leaving no stone unturned to resolve issues of internet, online learning",
  "link": "https://www.app.com.pk/national/minister-for-leaving-no-stone-unturned-to-resolve-issues-of-internet-online-learning/",
  "date_published": "2020-07-14T23:09:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 15 (APP):Minister for Federal Education and Professional Training on Wednesday said that education was the top priority of incumbent government and there will be left no stone unturned to resolve current issues being faced by students regarding internet connectivity and online learning.\nHe stated this while chairing a high level meeting on the direction of prime minister to review the issues of online learning and to improve the internet connectivity being faced by students.\nShafqat further told that education and internet are connected with each other in this modern period, specially their importance and need has been enhanced in wake of COVID-19.\nThe meeting was also attended by the officials from Pakistan Telecommunication Authority(PTA), Ministry of Information Technology(IT), Universal Service Fund(USF), Higher Education Commission, and Ministry of Federal Education and Professional Training.\nDuring the meeting the different aspects of the issues regarding online education being faced by students were reviewed.\nThe issues like internet’s poor connectivity and unavailability in the areas of Azad Jammu and Kashmir, Gilgit-Baltistan, South Balochistan, and tribal areas were alsodiscussed came under discussion in details in the meeting.\nDuring the meeting the improvement of quality in the current internet service was also discussed.\nOn the occasion,Ministry of IT, PTA, and USF highlighted the issues in the telecom sector and also presented options for their resolution.\nSpeaking on the occasion, Education Minister Shafqat Mahmood directed the authorities concerned to complete the consultation process with provinces and other stakeholders on online learning issues and their resolution and prepare a report which will be presented to the prime minister and cabinet.\nHe said that education was the top priority of incumbent government and there will be left no stone unturned to resolve current issues being faced by education sector.",
  "retrievedAt": "2025-08-11T19:30:05.400Z"
}
