{
  "title": "Religious scholars, leaders denounce Islamophobia as a threat to global peace, harmony",
  "link": "https://www.app.com.pk/national/religious-scholars-leaders-denounce-islamophobia-as-a-threat-to-global-peace-harmony/",
  "date_published": "2024-03-15T14:54:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP): The Pakistan Ulema Council (PUC) observed the ‘International Day to Combat Against Islamophobia’ across the nation, with religious scholars and leaders delivering poignant messages during Friday prayers.\nThey unequivocally denounced Islamophobia as a manifestation of fear, prejudice, and hatred against Muslims, stressing the urgent need for its swift and complete eradication.\nThe escalating tide of Islamophobia in the Western world, they warned, not only precipitates a clash between civilizations but also poses a grave threat to global peace.\nEmphasizing Islam’s core message of security and peace for all humanity, they lamented that Islamophobia fosters interfaith animosity and erodes understanding between civilizations.\nFurthermore, they underscored Islam’s teachings of promoting interfaith harmony, categorically stating that Islam is neither an extremist religion nor does it endorse terrorism.\nPUC Chairman, Hafiz Muhammad Tahir Mehmood Ashrafi, along with esteemed scholars including Allama Abdul Haq Mujahid, Maulana Muhammad Rafiq Jami, Maulana Nauman Hashir, Maulana Asad Zakaria Qasmi, Maulana Muhammad Shafi Qasmi, Maulana Asadullah Farooq, Allama Zubair Abid, Maulana Muhammad Ashfaq Pittafi, Maulana Abu Bakr Hameed Sabri, Maulana Tahir Aqeel Awan, Maulana Aziz Akbar Qasmi, Maulana Haq Nawaz Khalid, Maulana Obaidullah Gormani, Allama Tahir-ul-Hasan, Maulana Hanif Osmani, Maulana Muhammad Asghar Khosa, Maulana Anwar-ul-Haq Mujahid, Maulana Abdul Malik Asif, Maulana Aslam Siddiqui, Maulana Abdul Hakeem Athar, Maulana Abdullah Haqqani, Maulana Abdul Waheed Farooqui, Maulana Abu Bakr Hamza, Maulana Habib Rehman Abid, Maulana Aminul Haque Ashrafi, Maulana Izharul Haque Khalid, Sahibzada Hamza Tahirul Hasan, Maulana Saadullah Ludhianwi, Maulana Anisur Rahman Baloch, Maulana Abdul Rasheed, Mufti Muhammad Umar Farooq, Maulana Abdul Ghaffar Shah Hijazi, Maulana Muhammad Ahmad Makki, Maulana Azizur Rahman Muawiya, Mufti Imran Muawiya, Maulana Saadullah Shafiq, Maulana Yasir Alvi, Qari Abdul Rauf, Maulana Matloob Mahar, Maulana Zubair Khatana, Maulana Aqeel Zubiri, Qari Azizur Rahman, Maulana Shabbir Khatana, Maulana Zubair Khatana, Qari Abdul Majid Lahori, Maulana Farooq Khanpuri, Maulana Qasim Sangi, Maulana Ashraf Malik, Maulana Ijaz Malik, Qari Abdul Wahab Muawiya, Maulana Muhammad Bilal Saqib, Qari Ibrahim, Qari Riaz, Maulana Ameer Muawiya, Maher Abdul Khaliq Murali, Maulana Muneebur Rehman Haidari, Qari Mohabbat Ali Qasmi, Qari Zul Qarnain, Maulana Tayyab Qureshi, Qari Mahmood Al Hasan, Qari Abdul Majid Malik, and Maulana Waqas Iqbal among many others, delivered impassioned sermons.\nThey collectively condemned Islamophobia as a grave threat to global harmony, urging world powers to intensify efforts towards its elimination.\nThey called upon international bodies such as the United Nations and the Organization of Islamic Cooperation to spearhead initiatives aimed at eradicating all forms of discrimination and fostering a culture of love, tolerance, and coexistence. They reiterated that Islam embodies principles of peace, love, respect, humanity, and tolerance.\nThe scholars lamented the misrepresentation of Islam as a religion of terror, emphasizing that the teachings of Islam, as imparted by Allah and His Messenger (peace be upon him), espouse mercy and compassion for all.\nIn conclusion, they emphasized that discrimination poses a significant threat to world peace and called upon individuals worldwide to stand united against it.\nThey said the observance of this day serves as a solemn reminder of the collective responsibility to eradicate the poison of anti-Muslim hatred and foster a world of inclusivity, tolerance, and understanding.",
  "retrievedAt": "2025-08-11T01:19:57.647Z"
}
