{
  "title": "QAU invites application for PEEF Master level scholarships",
  "link": "https://www.app.com.pk/national/qau-invites-application-for-peef-master-level-scholarships/",
  "date_published": "2024-03-15T10:10:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 15 (APP):Quaid-i-Azam University (QAU) has invited applications for the Punjab Educational Endowment Fund (PEEF) Master’s Level Scholarship from M.Phil/MS students admitted in Fall-2023 & Spring-2024.\nAccording to the documents from QAU Student’s Financial Assistance Office, the deadline for scholarship application is 29th March 2024.\nAs per the PEEF Master’s Level Scholarship policy 2023-24, the minimum eligibility criteria includes that the student must have Punjab domicile, secured at least 60% marks or a minimum CGPA 2.5 in the graduation level examination held in 2021-22, 2022-23, 2023-24 (spring and fall sessions) from Punjab (minimum sixteen years of schooling or 4-year education after HSSC/F.A/F.Sc./Grade 12 examination). The students who were awarded a BS degree from Quaid-i-Azam University are also eligible.\nHowever, those who secured admission as a full-time student in the current academic year (2023-24) in the university/degree awarding institution and the students enrolled in and 2nd semester (fall/spring) session and morning/evening/afternoon sessions are also eligible.\nSimilarly, the declared monthly income of parents (from all sources) is equal to or less than sixty thousand (Rs. 60,000, while, the children of Govt. employees in BPS 1-4 are exempted from the condition of monthly income if salary is the only source of income. The children of civilians martyred in terrorist attacks are exempted from the condition of monthly income.\nThe students who are not availing of any other educational scholarship during the current academic year and students who have already passed/possessed MA/MSc/MS/M.Phil degrees are ineligible to apply for the PEEF Master Level Scholarship.\nBesides fulfilling PEEF eligibility criteria, the prospective student must qualify for merit and need criteria of the respective university/degree awarding institution.\nStudents have been informed that application forms are available in the department/photocopier shops of the university. The attested copies of the following documents must be attached to the application form including Domicile, CMC, BSDMC and Degree.\nStudents have been informed to attach an income affidavit worth Rs50 as per specimen with the application form.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T01:20:33.786Z"
}
