{
  "title": "Pakistan rejects India’s remarks on Bilawal’s press stakeout in Germany",
  "link": "https://www.app.com.pk/national/pakistan-rejects-indias-remarks-on-bilawals-press-stakeout-in-germany-2/",
  "date_published": "2022-10-09T14:38:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 9 (APP): Pakistan on Sunday rejected the unwarranted remarks made by the official spokesperson of the Indian Ministry of External Affairs (MEA) on the recent joint press stakeout of the Foreign Ministers of Pakistan and Germany, during the official visit of Foreign Minister Bilawal Bhutto Zardari to Berlin.\nThe Foreign Office in a statement here said, while highlighting the centrality of the Jammu and Kashmir dispute, both the Foreign Ministers agreed that there was a role and responsibility of the international community as well as a need for intensified efforts from the United Nations, with regards to a peaceful and just resolution of the Jammu and Kashmir dispute. While the views expressed by the Foreign Ministers elucidated the growing urgency and concern in the international community on the Kashmir dispute, the MEA’s gratuitous remarks have exposed the desperation of a country that finds itself increasingly isolated on the issue of its illegal occupation of Jammu and Kashmir and the reprehensible human rights violations being perpetrated by its ruthless occupation force in the occupied territory.\nIndia’s proclivity to hoist the bogey of cross-border terrorism whenever there is a call for increased scrutiny of its unlawful occupation and brutality in Jammu and Kashmir, is well known. “It must, however, realize that no amount of obfuscation will change the reality of its repression in the Indian Illegally Occupied Jammu and Kashmir (IIOJK). India’s credentials as a purveyor of state-terrorism in the IIOJK and as an instigator of cross-border terrorism in Pakistan need no reiteration. Hollow denials and evasion of responsibility will no longer cover-up India’s mischievous strategy of posing as a ‘victim’ of terrorism while shifting blame elsewhere.”\nThe Foreign Office stated that Pakistan’s achievements and contribution to the cause of counter-terrorism are globally acknowledged. On the contrary, India’s allusion to FATF, displaying its characteristic bias, hostility and partiality towards Pakistan, corroborates Pakistan’s long-standing view that India has been politicizing FATF and trying to misuse its membership of FATF to target Pakistan. FATF needs to take note of the irresponsible statement by India.Rather than making preposterous remarks about statements made by Foreign Ministers, India would do well to introspect, address the international community’s valid concerns and mend its conduct in the IIOJK.The Foreign Office said, “Pakistan urges the international community, particularly human rights and humanitarian organizations to condemn India’s barbaric state-terrorism in Jammu and Kashmir and ensure that Kashmiris are given their right to self-determination as enshrined in the relevant UNSC resolutions and as per their own wishes.”",
  "retrievedAt": "2025-08-11T15:42:07.134Z"
}
