{
  "title": "Nawaz blames Imran for ‘destroying country’ in his quest for vengeance",
  "link": "https://www.app.com.pk/national/nawaz-blames-imran-for-destroying-country-in-his-quest-for-vengeance/",
  "date_published": "2022-10-09T13:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP): Pakistan Muslim League-Nawaz (PML-N) supremo Nawaz Sharif Sharif on Sunday lamented that the country has been destroyed by Pakistan Tehreek-e-Insaf (PTI) chief Imran Khan in his quest to revenge against him (Nawaz).\nIn an exclusive interview, the former prime minister, flanked by his daughter and the Party Vice President Maryam Nawaz, shared his personal thoughts with the nation.\nNawaz said “If you [Imran] wanted to take revenge against me, that’s fine, by all means”. The former premier asked who allowed them to take revenge on Pakistan?\nNawaz said in the process of taking revenge against me, you [Imran] have destroyed Pakistan,” adding that how “everything became more expensive during Imran Khan’s tenure.”\nLashing out at previous PTI govt for unleashing extreme inflation, he said “In the last four to five years, everything has been reversed.”\nNawaz Sharif said that inflation in the country sky rocketed during Imran Khan’s tenure. While “During my government, people were happy and content,” blaming Imran Khan’s government for the country’s economic woes.\nHe said that Pakistan was a dignified country and he never compromised on its honour as he refused to accept $5 billion for not conducting nuclear tests.\nLashing out at Pakistan Tehreek-e-Insaf (PTI) chief Imran, Nawaz Sharif said that everything Imran has done, was now being revealed before the masses. Imran has proved a conspirator.\nHe has been exposed badly, he said that now, those who carried out the cruelty were being “exposed and coming to light.\n“U-turns on everything, the nation is seeing it,” he added, referring to Imran.\nSpeaking about his wife, Begum Kulsoom Nawaz, the PML-N supremo said that fun was being made on Kulsoom Nawaz’s illness. “I remember all those scenes, how my wife was on her deathbed and how cruelly we were treated — and those people who were making fun,” he said.\n“I appeared before the court when I got the news that Kulsoom Nawaz was ill again.\nSo I asked the superintendent to let me talk with Kulsoom Nawaz. But the superintendent said that he had no permission. So I was not allowed to get an opportunity to talk with Kulsoom and three hours later, I was informed that my wife had passed away.” He added, “So you can imagine what my condition was when I hear news of my wife’s death [while I was] in jail.”\n“I went to Maryam’s cell and informed them that Kulsoom had passed away. Soon after getting that news, Maryam started to cry.” He said that when Kulsoom was ill, nobody allowed him [Nawaz] to go and take care of his wife [Kulsoom Nawaz]. “I also remember, when I got to know that the sentence [in the Avenfield reference] was being announced on the July, 6, 2018, I said ‘my wife was very ill and was in a coma’. I don’t know what issue they had, but they didn’t listen to my plea.\n”These are events that are never forgotten. This loss can never be repaired or forgotten. He thanked to Almighty Allah Who reunited him with his daughter Maryam. Today, Maryam came after proving that the case and punishment were false.\nHe asked, “Why did we suffer these 200-250 [court] appearances and why were precious five years of our lives wasted. Someone must be accountable, do I not have the right to ask this? ‘Thanks to Allah that Maryam was sitting with me.\nHe added that this was the first time in a long time that Maryam had met her brothers. “From the day, Maryam came to London, she has been talking to me and her brothers about Kulsoom Nawaz”, the former prime minister added.\nHe praised Maryam for being a brave daughter and supporting him all these testing times. “I was in jail and got the news that the National Accountability Court (NAB) wanted to arrest Maryam Nawaz. I don’t think that at time the people concerned with NAB had a feeling of sympathy for Maryam”, the PML-N supremo expressed his thoughts.\nWhile deeming the cases and sentences against him and Maryam as ‘fake’, the PML-N supremo [Nawaz] posed the question that if he [Nawaz] was wrong then why he faced everything and appeared before the court?\nHe said the purpose (of rushing the ruling) was that “Nawaz Sharif’s decision should be pronounced before the elections”, he said, adding: “I told Maryam they have announced the decision and we will go [back].”\nSharing memories of his late mother, he revealed that when he was incarcerated the circumstances weighed particularly heavily on his mother as his mother had special affection with him.\nHe reminisced whenever she came to visit him in Adiyala jail, she stressed not leaving the premises without taking him out from there. I used to console her and tell her that it could not happen, then she insisted to let her stay in the jail with me, the PML-N supremo added.\nHe recalled how his brother Prime Minister Shehbaz Sharif used to complain about mother’s greater affection for him. He also recalled how he was sitting beside his mother as she breathed her last.\nWhen his mother breathed her last, he was holding her in his arms as he was sitting on her bed.\nNawaz was also asked if he would run for prime minister a fourth time in response to which, he can be heard laughing.",
  "retrievedAt": "2025-08-11T15:42:09.480Z"
}
