{
  "title": "President underlines need to instill teachings of Holy Prophet’s (PBUH) Seerah in society",
  "link": "https://www.app.com.pk/national/president-underlines-need-to-instill-teachings-of-holy-prophets-pbuh-seerah-in-society/",
  "date_published": "2022-10-09T09:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 9 (APP): President Dr Arif Alvi on Sunday said that Pakistan could emerge as a strong and prosperous nation by following and promoting the Seerah of the Holy Prophet (PBUH) as it was the best solution to overcome the socio-economic evils and challenges faced by the society.\nAddressing the inaugural session of the two-day International Seerat-un-Nabi (PBUH) Conference, the president further called upon the Muslims and Muslim states to strive for establishing societies and governments based upon cherished Islamic principles of justice and equality to become living examples of good governance and high moral values for other countries to follow and benefit from it.\nThe two-day International Seerat-un-Nabi (Peace Be Upon Him) conference titled “Morality of Society, Reformation and Development: In the Light of Seerat-un-Nabi (PBUH)”  was organized by the Ministry of Religious Affairs and Inter-Faith Harmony.\nAddressing the conference, the president said that in the light of the teachings of the Holy Prophet (PBUH), the society needed to grant women their due rights, be respectful and compassionate towards their fellow countrymen, uphold the rule of law, avoid back-biting, adopt cleanliness and purity, overcome corruption, be honest and trustworthy, and work for the uplift of poorer and weaker sections of society.\nHe said that Islam envisioned a society based upon humanity, ethical values of truth, trust, tolerance, equality, caring for the less fortunate, providing justice without fear or favour, respecting the privacy, shunning unverified and fake news, and fulfilling the oaths.\nThe president said that Islam had termed corruption as one of the biggest evils and our society needed to develop a spirit to fight and curb corruption in all its form and manifestations.\nHe said that corruption could be eliminated by creating resistance against corruption and corrupt practices at the societal level, clearly distinguishing between the right and the wrong, enacting new laws in addition to strengthening existing ones, and ensuring their implementation in letter and spirt.\nHe highlighted that inculcating piety and fear of Allah, enacting laws, implementing laws in their letter and spirit, and discouraging corruption and violations of law at the societal level were essential elements for a fair, just and rule-based society.\nSecretary General of the Muslim World League, Dr Muhammad bin Abdul Karim Al-Issa, Federal Minister for Religious Affairs and Inter-Faith Harmony, Mufti Abdul Shakoor, international and national Islamic religious scholars, members of the diplomatic community, and people belonging to different walks of life attended the Conference.\nWhile talking about back-biting and impacts of the social media, the president said that social media, especially mass messaging applications, had created many opportunities of producing and disseminating useful education, knowledge and information in almost all facets of life while also making it easier to spread unverified, fake and biased news and information.\nHe urged the relevant stakeholders to educate and train the society to forgo, disregard and avoid giving weight to fake news and information which was not in line with our socio-religious norms and using social media for education, business and gaining authentic knowledge.\nHe said that innovation and progress on the technological front should not be resisted and its positive aspects should be adopted to ensure the growth and development of the country.\nThe president said that Islam had provided women with equal status, fixed their share in the inheritance and allowed them to adopt gainful professions.\nHe said that it was the duty of an Islamic society to provide a harassment-free environment to women to increase their participation in society.\nHe highlighted that until the late 19th and early 20th century, women were considered a property of men in the west, whereas Islam granted them the right to inheritance and own property 14 centuries ago.\nHe said that Islam enjoined uplifting the weaker and vulnerable sections of society, adding that Pakistan too needed to work for the development and uplift of its weaker and neglected sections of the population to become an ideal Islamic welfare state.\nTalking about curbing the spread of communicable diseases, the president emphasised that Islam had declared cleanliness and purity as half the faith.\nHe said that most of communicable diseases could be contained by adopting better hygiene and cleanliness, adding that the importance of washing hands, keeping oneself clean and pure, and adopting better hygienic practices became evident during the COVID-19 pandemic.\nEmphasizing the need to spread love and inter-faith harmony, the president said that Islam accorded great value to love and affection among the people.\nHe said that renowned Islamic Poet, Maulana Jalalludin Rumi, had highlighted eight stages of spiritual attainment which were: loving one’s self by following the virtues of piety; loving his family, neighbourhood, the nation and the country, the entirety of humanity, living and non-living things, the Holy Prophet Mohammad (PBUH) and after these conditions were met, led to the ultimate spiritual attainment of love with Allah Almighty.\nThe president said that Islam emphasized treating all living beings equal, caring for the poor, respecting the privacy of others, inculcating humility and politeness, being kind and forgiving, adopting the virtues of truth and trustworthiness in our dealing and in trade and business, adding that without adopting these teaching of the Holy Prophet (PBUH), the establishment of a true Islamic society would remain a distant dream.\nSecretary General of the Muslim World League, Dr Muhammad bin Abdul Karim Al-Issa, also addressed the conference.\nHe said that the Holy Prophet (PBUH) united the warring tribes of Arab and made them one nation. He termed the Treaty of Hudaibia as a lesson in peace-making and diplomacy.\nHe also appreciated the role of Pakistani Ulema in the promotion of education regarding the life of the Holy Prophet (PBUH).\nHe informed that a museum highlighting the different aspects of Seerat-un-Nabi (PBUH) and the different phases of his life would be established in Pakistan.\nHe also expressed his deepest condolences over the loss of life and property in the devastating floods in Pakistan and assured Pakistan of his full support in this regard.\nFederal Minister for Religious Affairs and Inter-Faith Harmony, Mufti Abdul Shakoor, while addressing the occasion, emphasized the need to make the Seerah of the Holy Prophet (PBUH) as the guiding light in order to overcome the problems being faced by the Ummah.\nHe said that Holy Prophet (PBUH) possessed high moral character and even his enemies and opponents termed him as “the truthful” and “the trustworthy”.\nHe said that etiquettes and high moral standards established by the Holy Prophet (PBUH) were eternal and the Pakistani nation also needed to take guidance from his Seerah and try to follow in his footsteps.\nSenator Professor Sajid Mir and Allama Arif Wahidi also addressed the conference and highlighted different aspects of the life of the Holy Prophet (PBUH), besides emphasizing the unity of Ummah, upholding justice and truth, respect for humanity, being compassionate and merciful, discouraging partisanship, sectarianism and hatred based on language or national identity.\nEarlier, the president distributed cash prizes and certificates among the top position holders of the Seerah book competition.",
  "retrievedAt": "2025-08-11T15:42:10.123Z"
}
