{
  "title": "Seerat-un-Nabi, way out of all issues: Abdul Shakoor",
  "link": "https://www.app.com.pk/national/seerat-un-nabi-way-out-of-all-issues-abdul-shakoor/",
  "date_published": "2022-10-09T16:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 09 (APP):Minister for Religious Affairs and Interfaith Harmony Mufti Abdul Shakoor on Sunday said Seerat-un-Nabi was a way out of all issues being faced by the country.\nAddressing the 2nd Day of International Seerat-un-Nabi Peace Be Upon Him Conference here at a local hotel, he said we must implement Sunnah and divine commands in our lives to bring social, political and economic reforms in the society.\nShedding light on the Uswa-e-Husna of the Holy Prophet Muhammad Peace Be Upon Him, the minister said the most favorable act in the court of Allah Almighty was to behave humanely with their fellow beings.\n“Those who have good moral ethics are highly ranked by Allah Almighty both here and hereafter,” he added.\nHe said it was our religious as well as moral obligation to respect each other’s rights.Mufti lamented that the corruption had been penetrated in our society which is a big factor of our decline in the comity of nations.\nHe proposed to implement the Islamic laws on all state institutions in a bid to make Pakistan a role model country for rest of the Islamic world.\nOn this occasion, he also termed the Muslim World League Secretary General Dr Mohammad bin Abdul Karim Al-Issa ‘Khateeb-e-Alam’ as he had delivered the Hajj sermon in Nimra mosque this year which is an act of highly significance in the Muslim Ummah on the globe.\nEarlier in his welcome address, Secretary for Religious Affairs and Interfaith Harmony Aftab Akbar Durrani said life of the Holy Prophet Muhammad Peace Be Upon Him was the best example for all.\nHe said we should educate the people about Seerat-un-Nabi Peace Be Upon Him in letter and spirit so that they could be transformed as civilized citizen of the society.\nThe international moot was attended by President Dr Arif Alvi, Muslim World League Secretary General Dr Mohammad bin Abdul Karim Al-Issa, Prime Minister’s Special Representative for Interfaith Harmony and Middle East Hafiz Muhammad Tahir Mehmood Ashrafi, Jamiat Ulema-e-Islam Chief Maulana Fazl-ur-Rehman, Federal Minister for Finance Ishaq Dar and Parliamentary Secretary for Religious Affairs and Interfaith Harmony Afreen Khan besides renowned Ulema and Mashaykh and people from various walks of life.",
  "retrievedAt": "2025-08-11T15:42:07.146Z"
}
