{
  "title": "Empowered women in Pakistan have become ‘agents of change’ : Pakistani diplomat",
  "link": "https://www.app.com.pk/national/empowered-women-in-pakistan-have-become-agents-of-change-pakistani-diplomat/",
  "date_published": "2022-10-09T08:24:00.000Z",
  "source": "APP",
  "content": "UNITED NATIONS, Oct 9 (APP):: A Pakistani diplomat has, in a United Nations panel, reaffirmed Pakistan’s commitment to empower women in all walks of life, saying they have become agents of change.\n“We are proud that today Pakistani women participate in every facet of public life,” Saima Saleem, a counselor at the Pakistan Mission to the UN, said in a debate on ‘Advancement of Women’ in the the General Assembly’s Third Committee, which deals with social, humanitarian and cultures matters.\nIn this regard, she said that Pakistani women have held and are holding some of the country’s top positions.\n“Despite challenges,” Ms. Saleem added, “Pakistan is a strong country and a resilient nation because of the power of empowered women, who break glass ceiling in all fields and have become agents of change.”\nAt the same time, the Pakistani delegate expressed concern over the series of shocks the world has suffered in recent years — the COVID‑19 pandemic, commodity inflation, food and fuel crises and climate change — that have disproportionately affected women and girls.\nPakistan has been affected by the worst disaster in its history, she said, pointing to recent floods of epic proportions that have affected more than 33 million people, of which almost six million need immediate humanitarian assistance.\nWhile the damage to infrastructure is evolving, it is currently estimated at $30 billion, Ms Saleem said. Among those affected, more than 1.6 million are women of reproductive age, with nearly 130,000 pregnant women in need of urgent health services.\nIn Pakistan, she said, between 50 to 80 per cent of women are food producers, she noted, adding that due to these traditional roles in the agriculture sector, women are the first to be affected by climate change.\nTo this end, she drew attention to the national climate change policy that is gender sensitive and caters to the needs of women and girls in the wake of climate-induced disasters.\nThe fight against the threat of climate change shall not be won without the empowerment of all women and girls, and integrating their perspective and role in disaster risk reduction policies, Ms. Saleem said.\n“We must mobilize the political will and necessary resources to take critical decisions and to empower all women and girls to prevent humanity from moving towards the path of destroying the hospitality of our planet.”",
  "retrievedAt": "2025-08-11T15:42:11.903Z"
}
