{
  "title": "Pakistan maintaining poppy-free status since 2001: Senate told",
  "link": "https://www.app.com.pk/national/pakistan-maintaining-poppy-free-status-since-2001-senate-told/",
  "date_published": "2023-01-20T14:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): Minister of State for Interior Abdul Rehman Khan Kanju on Friday informed the Senate that Pakistan was maintaining a poppy free status since 2001, as recognized by the United Nations Office on Drugs and Crime (UNODC).\nResponding to the Pakistan Peoples Party’s Senator Bahramand Khan Tangi, he said the last drug survey was conducted in 2013 and in this regard, the Bureau of Statistics had been approached to conduct fresh drug use survey in the country.\nThe minister said they were being partnered by National Institute of Population Studies and funded by UNODC. True picture of increase or decrease in the use of drug or prevalence of a particular drug among a particular stratum of society, would be developed based on the concrete figures collected after fresh survey, he added.\nHe said the government was making all out efforts to control the menace of drugs and presently, there were four rehabilitation centers working in the country.\nHe said that on supply side control, Anti-Narcotics Force (ANF) had made 459.5 tons seizures which were recognized in the World Drug Report 2022 of UNODC. “Pakistan’s efforts are continuing to keep the country and the world safe,” he maintained.\nHe said the ANF consisted of 3,600 employees out of which only 2,200 were operational and maintaining the law enforcement activity across the country including international borders including Iran, Afghanistan and India.\nThe minister said the ANF actively performed duties at seaports, dry ports and airports to control drug trafficking. With the inadequate Human Resources, efforts were being made at grass roots level to snub the local drug traffickers/handlers and users, he added.\nHe said narcotics and psychotropic substances were being used for the manufacturing of medicine and there was a possibility that due to pilferage the same may be used for recreational activities as a drug. There was no mechanism that could monitor and collect data of those people who used such type of drugs, he added.\nHe said the Ministry of Narcotics Control in coordination with Drug Regulatory Authority of Pakistan had allocated quota of substance used for manufacturing narcotics and psychotropic drugs.",
  "retrievedAt": "2025-08-11T05:46:47.074Z"
}
