{
  "title": "One-day ‘Gandhara Citrus Festival 2023’ to be held on Jan 22",
  "link": "https://www.app.com.pk/national/one-day-gandhara-citrus-festival-2023-to-be-held-on-jan-22/",
  "date_published": "2023-01-20T13:43:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): The first annual one-day ‘Gandhara Citrus Festival 2023’ to be held on January 22 (Sunday) will help mobilize the community to explore Pakistan as best citrus-growing country in the world and develop linkages between the stakeholders of the industry.\nThe event is being organized by the Agri Tourism Development Corporation of Pakistan (ATDC) along with the Pakistan Tourism Development Corporation (PTDC), Gandhara Resource Center and local farmers community at Pind Gakhra Khanpur to celebrate the National Orange Day 2023, which is declared on the third Sunday of January every year.The event which is being arranged under the theme “Explore the Gandhara Civilization and it’s agriculture field products” aimed to provide a platform for citrus growers, exporters, importers and its value addition companies to share ideas for increasing and improving the production of citrus as well as for promoting value additions of citrus fruit.It will also be aimed at making a way forward to improve the production of crops and encourage the growers to adopt the latest technologies to improve the production of the crop.\nThe event will provide a tourism activity which will include an Orange show, Gandhara art display, lecture on successful citrus growing on a domestic and commercial scale and suggestions on value-added products of orange fruit. Orange products will also be available on-site farm.\nThe event will also be a fun activity for the families as they can pick the fruits of their choice with an opportunity to pay for how much you will pick.\nThe stalls of local village food, art and craft displays and camping facility will also be available during the event for the visitors.\nPakistan is considered as one of the top citrus producers of the globe and the demand for Pakistani oranges is on the rise worldwide.",
  "retrievedAt": "2025-08-11T05:46:49.371Z"
}
