{
  "title": "Govt taking measures for solarization of tubewells, implementation of farmers package: PM",
  "link": "https://www.app.com.pk/national/govt-taking-measures-for-solarization-of-tubewells-pm/",
  "date_published": "2023-01-20T16:11:00.000Z",
  "source": "APP",
  "content": "LAHORE Jan 20, (APP): Prime Minister Shehbaz Sharif Friday said the government was taking measures for converting agriculture tubewells on solar energy and for implementation of farmers package.\nHe was chairing a review meeting regarding solarization of tubewells and for implementation of the farmers package.\nHe said the conversion of tubewells on solar energy would reduce the per acre cost of farmers and would also reduce dependence on diesel and imported fuel, saving precious foreign exchange.\nThe PM praised the suggestions of the Minister of Power, Secretary Power and their team for converting tubewells to solar energy.\nHe said the implementation of farmers package was the top priority of the government.\nThe government was taking steps for the progress of agriculture and prosperity of farmers, he stressed.\nHe said the farmers package included facilities for extending loans to small farmers, timely provision of seeds, encouragement for introduction of modern machinery in agriculture and conversion of tubewells to solar energy.\nHe directed that all organizations of farmers from across the country should be included in the consultation process regarding the farmers package.\nHe also said consultation and cooperation of provinces should also be ensured for the implementation of the package.\nA committee of experts should be formed for devising a strategy for increasing the production of edible oil, he ordered.\nHe said a plan should be finalized for introducing a new and climate-resilient seed for increasing the production of cotton.\nThe Power Division told that the plan to convert diesel and electricity-run tubewells to solar-powered tubewells was in final stages and with this measure the country would save $ 3.61 billion every year by reducing the use of diesel and imported fuel.\nThe prime minister was informed about the details of farmers package, cultivation and production of wheat, introduction of new cotton seeds and about the steps taken for increasing the production of edible oil.\nIt was told that the government’s measures to facilitate small farmers in getting loans resulted in provision of loans amounting to Rs 816.5 billion. The government was also taking steps to reduce prices of fertilizer and for increased use of modern machinery in agriculture.\nThe participants were apprised that due to decisions of the government in the current year the seed of edible oil was planted on 632,000 hectares of land and the crop area would increase further next year.\nIt was told that Ministry of National Food Security was in contact with international companies for introducing new and climate-resilient seeds and a positive development was expected in this matter.\nThe PM directed that the implementation of all these measures should be ensured in a stipulated timeframe.\nFormer prime minister Shahid Khaqan Abbasi, Special Assistant to PM Jehanzeb Khan and officials concerned attended the meeting.\nFederal ministers Ishaq Dar, Marriyum Aurangzeb, Khurram Dastgir Khan, Tariq Bashir Cheema, Advisor to Prime Minister Ahad Cheema and chief secretaries of the four provinces attended the meeting through video link.",
  "retrievedAt": "2025-08-11T05:46:46.029Z"
}
