{
  "title": "PCRWR organized 4-day technical training program on Integrated Rainwater Harvesting Techniques",
  "link": "https://www.app.com.pk/national/pcrwr-organized-4-day-technical-training-program-on-integrated-rainwater-harvesting-techniques/",
  "date_published": "2023-01-20T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP): Pakistan Council of Research in Water Resources (PCRWR) successfully organized 4th batch of four-day technical training programs “Integrated Rainwater Harvesting Techniques to Mitigate Urban Flooding” from Tuesday-Friday.\nPCRWR has provided technical training to 107 staff members of different public sector Authorities Having Jurisdiction under the project, said a press release issued here Friday.\nSenior level technical staff from Water and Sanitation Agency (WASA) Rawalpindi, Tehsil Municipal Administration (TMA), Nowshera, Karak, Tank, Saria Norang, Buner, Irrigation, Agriculture and Public Health Engineering Departments, Khyber Pukhtunkhwa, Peshawar Development Authority, Water and Sanitation Services, Kohat & Mardan, NDMA, Shersaaz, UN-Habitat-Pakistan and allied organizations actively participated.\nPakistan Council of Research in Water Resources (PCRWR) is implementing a UNHABITAT-sponsored project titled “Enhance Community, Local and National-Level Urban Climate Change Resilience to Water Scarcity, caused by Floods and Droughts in Rawalpindi and Nowshera, Pakistan” in partnership with National Disaster Management Authority (NDMA) and Ministry of Climate Change.\nClosing and certificate distribution ceremony was organized on Friday. Country Head UNHABITAT, Mr. Jawed Ali Khan appreciated the key role of PCRWR on successful conduct of 4th batch of the training of 36 participants including senior level staff member of TMA, WASA and Building Control Authorities.\nHe concluded that it would create a real change in our society for adoption of rainwater harvesting techniques to overcome shortage of water.\nDr Muhammad Ashraf, Chairman, PCRWR appreciated UNHBITAT for sponsoring the training program for capacity building of public sector organizations, interactive participation of trainees and their group presentations on major social issues associated to urban flooding.\nMr. Kamran Naeem, WASH Specialist, UNICEF applauded the harmonized efforts of PCRWR and UNHABITAT for sensitizing our community for adoption of climate-resilient rainwater harvesting technologies to conserve water in every sphere of life.",
  "retrievedAt": "2025-08-11T05:46:48.992Z"
}
