{
  "title": "42 journalists murdered in last 4 years: Senate told",
  "link": "https://www.app.com.pk/national/42-journalists-murdered-in-last-4-years-senate-told/",
  "date_published": "2023-01-20T10:11:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 20 (APP):Minister for Parliamentary Affairs Murtaza Javed Abbasi on Friday informed the Senate that 42 journalists were murdered in the last four years across the country.\nResponding to the question of Jamaat-e-Islami’s Senator Mushtaq Ahmed, he said that it was a critical situation and the government should take prompt action against the culprits and journalists should be provided special security.\nAbbasi directed the Ministry of Interior to prepare a consolidated report on the matter and present it to the House within the period of two months.\nBalochistan Awami Party’s Senator Danesh Kumar pointed out that there were more than 10 journalists who were murdered in Balochistan instead of three shown in this report.\nTo this, the minister said that this report was compiled after a thorough consultation with all the quarters concerned of the provinces and if someone had given a wrong figure, he must be accountable as it was a sensitive matter.\nJamiat Ulema-e-Islam-Fazl’s Senator Kamran Murtaza proposed the minister that the journalists who had lost their lives in line of their duty, should be properly probed on which subject they were working before their murder.\nTo this, the minister assured the House that the report would be a comprehensive one.According to the statistics, 15 journalists were murdered in Punjab while 11 in Sindh, 13 in Khyber Pakhtunkhwa and 3 in Balochistan.\nMuhammad Saad, Safdar Ali, Muhammad Wajid, Zeeshan Ashraf Butt, Mirza Waseem Baig, Saeed Butt, Zia -ur-Rehman Farooqi, Rao Matloob, Husnain Shah, Mian Razzaq, Zahid Ali, Muhammad Nizam, Kashif Hussain, Lala Fazal Jan, Zia Kamboh, Aziz Memon, Ajay Lalwani, Ali Sher Rajpar, Mureed Abbas, Ilyas Warsi, Zulfiqar Ali Mandrani, Noor Lanjwani, Nazim Jokhio, Murtaza Shar, Athar Mateen, Ishtiaq Sodharo, Wahab, Zaman Mehsood, Haroon Khan, Javidullah Khan, Noonul Hassan, Iftikhar Ahmad, Tahir Hussain, Ihsan Ullah Sherpao, Waseem Alam, Abdul Wahab, Muhammad Sohail Khan, Aman Ullah, Qais Javed Maseeh, Abdul Wahid Raisani, Anwar Khetran and Shahid Zehri were the journalists murdered during the last four years across the country, he added.",
  "retrievedAt": "2025-08-11T05:46:56.150Z"
}
