{
  "title": "Parliamentary Secretary I&B calls for unity to foil enemies designs",
  "link": "https://www.app.com.pk/national/parliamentary-secretary-ib-calls-for-unity-to-foil-enemies-designs/",
  "date_published": "2023-03-22T10:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Federal Parliamentary Secretary for Information and Broadcasting Chaudhry Muhammad Shahbaz Babar said on Wednesday that unity was the greatest strength of a nation and there was a great need of showing unity to foil enemies’ nefarious designs against Pakistan.\nHe was speaking at the opening ceremony of the Digital Photographic Exhibition on the eve of Pakistan Day organized by the Directorate of Electronic Media and Publications (DEMP), an attached department of the Ministry of Information and Broadcasting, at the Information Services Academy.\n” Protection of Pakistan should be our life goal, March 23 is the day of renewal of pledge, today we should make a commitment that we will give any sacrifice for development and defense of our beloved country”, he said.\nExecutive Director General of DEMP Tariq Mehmood, Director Film DEMP Asifur Rehman, Deputy Director Exhibition DEMP Farina Mughal, senior officers of the Ministry of Information and Broadcasting and a large number of students from the twin cities were present.\nBriefing the chief guest and participants about the exhibition, Executive Director General DEMP Tariq Mehmood said that the directorate has organised a competition of digital pictures and paintings related to the freedom struggle of Pakistan, Kashmiris movement for independence for the students of educational institutions of the twin cities. More than 200 pictures and paintings have been selected and put on display in the exhibition.\nShahbaz Babar while addressing the participants after the opening of the exhibition said that the day of March 1940 resolution was a milestone in our national history and an important turning point in the freedom struggle.\nHe said on Pakistan Day that everyone should renew the pledge to serve the country with honesty and sincerity.\nChaudhry Muhammad Shahbaz Babar said that the government was striving to transform Pakistan into a Pakistan a peaceful and moderate Islamic welfare state as envisaged by the Quaid-e-Azam Muhammad Ali Jinnah and Allama Muhammad Iqbal.\nHe said it was the responsibility of the people of Pakistan to shun mutual differences and play a positive role for the prosperity of Pakistan.\nEarlier, Federal Parliamentary Secretary for Information and Broadcasting Chaudhry Muhammad Shahbaz Babar visited the stalls of books set up by DEMP containing historical documents on the lives of Tehreek-e-Pakistan, the establishment of Pakistan, Quaid-e-Azam and Allama Iqbal.\nHe also observed the photographs, and paintings on display and also watched a documentary film based on the progress and achievements of Pakistan in 75 years produced by DEMP.",
  "retrievedAt": "2025-08-11T06:29:26.025Z"
}
