{
  "title": "Govt making petrol expensive for rich, cheaper for poor: Musadik Malik",
  "link": "https://www.app.com.pk/national/govt-making-petrol-expensive-for-rich-cheaper-for-poor-musadik-malik/",
  "date_published": "2023-03-22T15:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Minister of State for Petroleum Dr Musadik Malik on Wednesday said the government was working on providing relief to the poor, not by imposing a subsidy or new tax, but by making petrol expensive for the rich.\nExplaining the recently announced petrol relief package to journalists during an informal media talk, he said the International Monetary Fund (IMF) believed subsidies were being given for the relief package for low-income people.\nHowever, he added, neither a subsidy nor any new tax was being given or imposed, rather, petrol prices were being increased for rich people to benefit the poor.\nIt should be added that Prime Minister Shehbaz Sharif announced a petroleum relief of Rs 50 per litre for low-income consumers on Sunday, who have motorcycles, rickshaws, and other small cars.\nThe minister said petroleum should not be confused with a subsidy. “It’s a relief, not a subsidy” that would be extended to more than 2.6 million motorcycles and 2.14 million small cars in the country.\nThe minister said motorcycle owners would get 100 per cent relief. Under the cheap petrol relief package, he added, the monthly limit for motorcycles and small cars would be 21 and 30 liters, respectively. He said a foolproof gateway for consumers would be set up to ensure no one could steal or sell petrol in black.\nFor the time being, he said, low-income people could purchase a liter of petrol for 100 rupees cheaper than the market rate. If the petroleum prices in the international market plunged, the government would decide whether the relief package should continue or end, he added.\nDr Musadik said 50 percent of poor people would benefit from the relief package, as owners of more than 2.6 million motorcycles and 1.6 million registered rickshaws and small cars would get low-priced petrol.\nTo explain the relief, he said, let’s suppose the per-litre price of petrol is Rs 300; rich people would have to pay Rs 350 for one liter of petrol, while the same amount of petrol would be sold at Rs 250 to motorcycles and small car owners.\nHe said the daily fuel cap for motorcycles and small cars would be two and five litres, respectively, and a total of 461 million litres of petrol would be given monthly to their owners under the petroleum relief package while the auditor general or a third party would conduct the audit of the petrol distribution.\nHe said the government would announce the difference between prices for rich and low-income people fortnightly. He said the income limit for small car owners has not been defined yet.\nHe stated that three options are under consideration for giving the petrol relief, including payment through password or card or through BIS; however, a one-time password (OTP) is preferred.\nHe said a similar relief package on gas with no subsidy was already working, through which the poor were given relief by giving expensive gas to the rich and sharing the burden of 60 percent of gas consumers.\nDr Musadik said the relief package has also been seen from a legal point of view. Apparently, no legal barriers are crossing our way, and no ministry has raised any objection because we are not taking money from anyone.\nHe said that an escrow account would be established in the National Bank to which the extra money taken from the rich would be deposited, and the account would be regularly audited.",
  "retrievedAt": "2025-08-11T06:28:42.122Z"
}
