{
  "title": "Speakers for tech-based agriculture revival to support national economy",
  "link": "https://www.app.com.pk/national/speakers-for-tech-based-agriculture-revival-to-support-national-economy/",
  "date_published": "2023-03-22T10:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): The speakers at a one-day seminar Wednesday demanded of the government to ensure the modern technology-based revival of the agriculture sector on modern lines to boost the national economy facing decline.\nThe Pakistan Environmental Protection Agency (Pak-EPA) and Pakistan Academy of Environmental Sciences (PAES) jointly organized the seminar titled “Challenges, Opportunities and Trends in Biotechnology in Pakistan”.\nThe use of the latest Biotechnology has a significant impact on agriculture, crop yields and food sources that played a critical role in agriculture, enabling farmers not only to produce more crops but to meet the challenges of climate change in the present situation that impacts yield.\nBiotechnology has the potential to address the country’s food challenges and ensure a sustainable food supply for future generations.\nThe challenges facing in adoption and implementation of biotechnology in agriculture in Pakistan included a lack of awareness and understanding, less research and development capabilities, limited regulatory framework, lack of access to financing, infrastructure limitations, and socioeconomic factors.\nThe Pak-EPA and PAES through the participation of all stakeholders had joined hands in Pakistan under one roof to completely understand the situation and find out challenges, opportunities, and trends in this regard.\nDirector General, Pak-EPA Farzana Altaf Shah in her welcome note set out the contours of the dialogue and idea behind the theme of the seminar. She also underlined the importance of emerging technologies and solutions making farmland cultivation a more manageable and profitable business.\nDuring the panel discussion, Chairman Four Brothers Group, Engineer Jawed Salim Qureshi highlighted the role of the private sector in introducing biotech. He noted that it was high time to take ambitious and bold decisions to improve the national economy and agricultural production.\nQureshi said the agriculture sector alone had the power to boost the national economy through in-time interventions.\nHe proposed a five-member committee of experts to guide and advise the transformation of land farming on modern technology and practices.\nChairman, Tara Group, Dr Khalid Hameed said there was an urgent need to start the use of modern technology, early warning, and best scientific practices. He said agriculture in Pakistan was impacted due to climate change, erratic rain patterns, and pests were also among the threats to the sector.\nDr Hameed mentioned that the government should declare a clear stance on genetically modified organisms (GMOs) seeds for induction in the agricultural cultivation.\nForman Christian College, Lahore, Expert, Dr Samin Mehnaz briefed the gathering on the use of microbes for climate-resilient agriculture.\nShe informed that the countries like India and European Union states were emphasizing on the use of microbe-based biofertilizers.\nShe said the microbes have helped in yielding high-quality products of different varieties and had proved its efficacy in the sector.\nThe Pakistani companies had an opportunity to tap the unexplored international market of biofertilizers through better production to earn billions of dollars foreign exchange, she added.",
  "retrievedAt": "2025-08-11T06:29:26.090Z"
}
