{
  "title": "Chairman WAPDA for completing Swat River diversion within current year",
  "link": "https://www.app.com.pk/national/chairman-wapda-for-completing-swat-river-diversion-within-current-year/",
  "date_published": "2023-03-22T13:23:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Chairman Water and Power Development Authority (WAPDA) Lt General (Retd) Sajjad Ghani on Wednesday has urged the project management to complete the Swat River diversion within the current year as it is essential to commence construction work on the main dam.\nHe directed the WAPDA project team, consultants and contractors to execute the construction plan within the given timeline, said a press release.\nThe Chairman WAPDA expressed these views during his visit to Mohmand Dam Hydropower Project, being constructed by WAPDA on River Swat upstream of Munda Headworks in District Mohmand of Khyber Pakhtunkhwa.\nThe Chairman visited a number of sites to witness construction activities going on there. He also had a detailed round of diversion tunnels outlet and inlets to monitor concrete lining and excavation works.\nGM/PD Mohmand Dam, Project Managers of the Consultants and the Contractors and other senior officers of WAPDA were also present during the visit.\nLater, Mohmand Dam project management made a presentation to the Chairman about the progress achieved so far on the project.\nIt was briefed that construction activities on 14 key sites of the various components are being carried out simultaneously, including diversion system, dam, spillway, re-regulation pond, switch yard etc.\nPermanent works of concrete lining in diversion tunnels are progressing at a faster pace to achieve target of river diversion. Excavation on left and right abutments of the dam is complete, while concreting of the foundations of the two abutments is in progress.\nExcavation work on the spillway is 80% complete and concreting is being done on the portions, that have been excavated.Earthwork of the switchyard has also been completed, it was further briefed.\nThe 213-meter high Mohmand Dam is a concrete-face-rock-fill (CFR) dam, which is the 5th highest dam of its type in the world. It is a multi- purpose project and is scheduled for completion in 2026-27.\nOn completion, it will store 1.2 MAF of water and help mitigate floods in Peshawar, Charsadda and Nowshera. Besides supplementing 160,000 acres of existing land, it will also irrigate 18,237 acres of new land in Mohmand and Charsadda.Installed generation capacity of Mohmand Dam is 800 MW. It will contribute 2.86 billion units of low-cost and environment friendly hydel electricity per annum to the National Grid.\nThe project will also provide 300 million gallons water per day to Peshawar for drinking purpose. Estimated annual benefits of the Project stands at Rs. 51.6 billion. A sum of Rs. 4.5 billion has been earmarked for Confidence Building Measures (CBM) in the project area for socio-economic development of the locals.",
  "retrievedAt": "2025-08-11T06:28:50.902Z"
}
