{
  "title": "First-ever braille version of 1973 Constitution inaugurated",
  "link": "https://www.app.com.pk/national/first-ever-braille-version-of-1973-constitution-inaugurated/",
  "date_published": "2023-03-22T16:12:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP):First-ever transcript of the fundamental rights in the Constitution of Pakistan in braille was inaugurated at the National Institution of Special Education, Islamabad on Wednesday in the presence of visually impaired children and persons with disabilities (PWDs).\nMember National Assembly Asiya Azeem inaugurated the braille transcription during the golden jubilee celebrations of the 1973 Constitution organized by the Ministry of Human Rights, Directorate General of Special Education.\nBraille is a system of touch reading and writing for blind persons in which raised dots represent the letters of the alphabet. It also contains equivalents for punctuation marks and provides symbols to show letter groupings. People read braille by moving the hand or hands from left to right along each line.\nA declamation contest, under the theme “My Constitution – Guarantee of my Freedom”, was also held amongst students with different disabilities to sensitize the public in general and PWDs in specific about their fundamental rights.\nVisually impaired children and students with other disabilities from eight special education institutes of the twin cities participated in the contest and enlightened the audience about the importance of the Constitution and its role in safeguarding the fundamental rights of citizens.\nSpeaking on the occasion after cutting the ribbon to inaugurate the braille version of the first two chapters of the Constitution, MNA Asiya Azeem said, “We can protect our rights only when we have complete knowledge about the fundamental rights guaranteed in the constitution.”\nShe appreciated students with disabilities for raising important points in their speeches about the liberty and responsibility of individuals. “Rights of and duties are interlinked and duties of one are the rights of others.”\nShe said this day of march marked a historical moment in the constitutional history of Pakistan as the first-ever braille version of the first two chapters of the Constitution was published.\nShe informed the participants that the Parliamentary Advisory Committee to oversee the preparations for the Golden Jubilee celebrations of the 1973 Constitution had proposed to include the first two chapters of the Constitution in the syllabus of secondary education.\nThe MNA said persons with disabilities deserve a huge round of applause and appreciation for fighting multi-faceted challenges in their personal and professional lives. “It filled me with utmost happiness to learn that these special children are so talented and fully capable of holding the reigns of the country in the future.”\nIn the end, Asiya Azeem awarded shields, medals, and certificates to the position holders of the declamation contest.\nIn the contest amongst students with physical impairments, Muzammil and Navaira Naeem from National Special Education Centre, Islamabad bagged first and second positions, respectively while the third position was clinched by Allah Maafi from National Training Centre for Special Persons, Islamabad.\nSimilarly, Shah Fahad and Abdul Samad from the National Special Education Centre, Islamabad got first and second position in the contest among visually impaired students while Sumaira Akbar from Govt High School for Blind Girls, Shamsabad, Rawalpindi stood third.\nDirector General of Directorate General of Special Education (DGSE) Sheikh Azhar Sajjad, Tasnim Waheed Director National Institute of Special Education, and a larger number of teachers and students participated in the event.",
  "retrievedAt": "2025-08-11T06:28:52.024Z"
}
