{
  "title": "Islamabad police nab 316 protestors for vandalism, attacking police",
  "link": "https://www.app.com.pk/national/islamabad-police-nab-316-protestors-for-vandalism-attacking-police/",
  "date_published": "2023-03-22T09:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 22 (APP): Islamabad Police on Wednesday said that a total of 316 protestors have been arrested for allegedly attacking police officers and causing chaos outside the Islamabad Judicial Complex on March 18 during the hearing of Imran Khan in the Toshakhana case.\nIn various tweets, Islamabad police said that protestors were involved in incitement, arson, vandalism and attacks on police.\nPolice teams were conducting raids to arrest more protestors while the identification process of all suspects was being carried out with the help of cameras.\nThe police said that other districts are being alerted about the suspects arrested for being involved in violent incidents so that these suspects could be handed over to them.\nCapital police elaborated its strategy against various individuals including government officials, company employees and immigrants if found to have been involved on March 18 chaotic events.\nOn the matter of the suspected involvement of any government officials in the violent actions, police said alerts of their involvement were being sent to the relevant departments so that departmental action could be taken.\nIt said that civil servants, active on social media and involved in the inciting actions, were also being identified sothat departmental action could be taken against them.\nPolice said that alerts about the involvement of employees from private organisations and companies in terrorist activities would be forwarded to their respective organisations.\nCorrespondence is being made with respective foreign embassies of the immigrants found involved in these actions, police said adding that legal action is also being taken against the facilitators financially assisting these violent protests.\nPolice informed that 58 police officials were injured during the violent vandalism while 12 cars, 20 bikes and a police checkpost were set on fire.",
  "retrievedAt": "2025-08-11T06:29:13.832Z"
}
