{
  "article_id": "2025-07-18_9bf84f0d951c14d5dc8a707356aa022d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/information-minister-assures-ihc-for-revival-of-srbc/",
    "retrieved_at": "2025-08-27T09:52:10.213Z"
  },
  "metadata": {
    "title": "Information Minister assures IHC for revival of SRBC",
    "author": null,
    "date_published": "2025-07-18T18:33:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 395,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 18 (APP):Minister for Information and Broadcasting Attaullah Tarar on Friday assured the Islamabad High Court (IHC) that Shalimar Recording and Broadcasting Company (SRBC) would be reactivated, and its employees would be paid two months salary. In the case related to the affairs of Shalimar Justice Sardar Ijaz Ishaq Khan heard the case regarding the matter. During the hearing , Ali Nawaz Kharal, Saad Khan Mayar and others appeared in court on behalf of the company employees, while Federal Minister Atta Tarar and others also appeared on behalf of the federation. Federal Minister Attaullah Tarar, while submitting a business plan for the revival of SRBC, said that instead of closing down the company, it can be made a functioning institution through an effective business strategy. This company continued to operate from 2005 to 2018. He said that after 2018, the company fell into financial crisis. The only way to revive the company is through public-private partnership. The government is serious about reviving the Shalimar Recording Company, he said. He told the court thst SRBC has liabilities of Rs 2 billion, adding that the government wanted to protect the jobs of its 300 employees. The minister said that there is need of court's permission for the revival of SRBC. Justice Sardar Ijaz Ishaq Khan said that the shareholders of SRBC must submit resolutions and collateral documents. The complete revival package should be submitted to the liquidator. Due to the liquidation of the company, the board cannot sign the documents, he said. The court said that the case will be reviewed under Section 313 of the Companies Act 2017. If the legal requirements are met, the revival can be approved. The federal minister said that the business plan will make the company financially independent. The court is requested to allow the implementation of the business plan. The previous court orders regarding the liquidation of SRBC should be withdrawn. Shalimar will be reactivated and all possible assistance will be provided for this. A regulator has already been appointed for the company's arrangements. Some funds have also been transferred to the company. If the court issues instructions to the regulator, two months' salary to the employees will be released from these funds, he said. The court adjourned the hearing of the case, directing the employees to pay two months' salary and submit the plan documents to the court.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}