{
  "article_id": "2025-07-18_03c7fdc9b467900ccd11e0e2ce692dd1",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-shehbaz-pays-tribute-to-constable-haider-ali-lauds-heroic-flood-rescue-efforts/",
    "retrieved_at": "2025-08-27T09:50:23.824Z"
  },
  "metadata": {
    "title": "PM Shehbaz pays tribute to Constable Haider Ali, lauds heroic flood rescue efforts",
    "author": null,
    "date_published": "2025-07-18T13:29:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 199,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Jul 18 (APP):Prime Minister Muhammad Shehbaz Sharif on Friday paid tribute to Constable Haider Ali of Punjab Police who embraced martyrdom while saving lives during a rescue operation in the flood-affected areas of District Jhelum. In his message from the Prime Minister's Office, the prime minister prayed for the elevation of the martyred constable's ranks in the hereafter and expressed his deepest condolences to the bereaved family. \"Haider Ali laid down his life while rescuing several people from the floodwaters without regard for his own safety. The entire nation is proud of Shaheed Haider Ali. His sacrifice will never be forgotten,\"said the Prime Minister. Prime Minister Shehbaz Sharif directed that every possible measure be taken for the welfare and support of the martyr's family, affirming the government's unwavering commitment to honouring national heroes. He also lauded the commendable performance of personnel from Pakistan's police, security forces, the National Disaster Management Authority (NDMA), and Provincial Disaster Management Authorities (PDMAs) for conducting effective and brave rescue operations during the ongoing flood emergency. The Prime Minister reaffirmed the government's dedication to supporting all institutions and individuals involved in protecting lives during natural calamities, calling them the true strength of the nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}