{
  "title": "Syedaal extends birthday greetings to Nawaz Sharif",
  "link": "https://www.app.com.pk/national/syedaal-extends-birthday-greetings-to-nawaz-sharif/",
  "date_published": "2024-12-25T13:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):Deputy Chairman Senate Syedaal Khan on Wednesday extended heartfelt birthday greetings to Pakistan Muslim League-Nawaz (PML-N) President Mian Muhammad Nawaz Sharif, lauding him as a seasoned politician with a vision for the nation’s progress.\nIn his message, Syedaal Khan acknowledged Nawaz Sharif’s pivotal role in strengthening democracy, stating, “Nawaz Sharif has rendered invaluable services for the promotion of democracy and has faced numerous challenges to uphold democratic values.”\nHighlighting Sharif’s special connection with Balochistan, he said , “The people of Balochistan hold immense respect and affection for Nawaz Sharif, who has always prioritized the province’s development.”\nThe Deputy Chairman Senate also recognized Nawaz Sharif’s contributions to national infrastructure, including the initiation of Gwadar Port and the China-Pakistan Economic Corridor (CPEC), during his tenure.\nHe commended Nawaz Sharif’s role in making Pakistan an economic and military powerhouse, adding, “The country’s economic successes and its status as a nuclear power are owed to Nawaz Sharif’s visionary leadership. In 1998, he made Pakistan a nuclear power, strengthening national defense and earning global recognition as the only nuclear-armed state in the Islamic world.”\nSyedaal Khan further emphasized Sharif’s efforts to uplift marginalized communities, ensuring their inclusion in the national mainstream, and noted that his policies have had a lasting impact on Pakistan’s development.\nSyedaal Khan prayed for Nawaz Sharif’s long life, health, and continued success. “On behalf of the people of Balochistan, I extend heartfelt birthday wishes to Mian Muhammad Nawaz Sharif and express our gratitude for his unwavering commitment to the province’s progress,” he said.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:02:43.070Z"
}
