{
  "title": "Nation marks 148th birth anniversary of Quaid-e-Azam with patriotic zeal",
  "link": "https://www.app.com.pk/national/nation-marks-148th-birth-anniversary-of-quaid-e-azam-with-patriotic-zeal/",
  "date_published": "2024-12-25T13:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):The nation commemorated the 148th birth anniversary of the founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah on Wednesday showing great patriotic zeal and reverence.\nThe celebrations began with special prayers at mosques across the country for the progress, prosperity, and unity of Pakistan.\nThe day observed with a 21-gun salute in provincial capitals and national flag hoisting at major government and private buildings, symbolizing the deep respect and gratitude for the visionary leader.\nAn elegant change of guards’ ceremony was held at the Quaid’s mausoleum in Karachi to pay tribute to the Founder of Pakistan.\nSpecial ceremonies and activities were organized nationwide, including seminars, conferences, debates, cultural events, and exhibitions.\nThese events highlighted the struggles and achievements of Quaid-e-Azam while also promoting his vision for Pakistan as a progressive, inclusive, and democratic state.\nSchools and colleges arranged debates, art competitions, and essay writing contests focusing on Quaid’s leadership and principles of unity, faith, and discipline.\nThe television and radio channels aired special programs and documentaries throughout the day, highlighting Quaid-e-Azam’s pivotal role in the creation of Pakistan.\nThe newspapers also published special supplements, recounting his enduring legacy and unparalleled contribution to the nation.\nAs a part of activities to mark Quaid Day, Pakistan National Council of the Arts (PNCA) organized an on-the-spot Painting and Drawing Competition on Wednesday to mark Quaid-e-Azam Day, providing a platform for young artists to pay tribute to the Father of the Nation through their creativity.\nLok Virsa hosted a series of events to celebrate the 148th birth anniversary of the founder of Pakistan, Quaid-e-Azam Muhammad Ali Jinnah on Wednesday.\nThe celebrations included an exhibition of artisans-at-work, showcasing traditional craftsmanship while a cake-cutting ceremony was held to mark the occasion, followed by a tribute to Quaid and a Milli Naghmas Show at the same time, featuring patriotic songs. Additionally, documentaries on Quaid-e-Azam ‘s contributions were also screened throughout the day, offering insights into his life and vision.\nQuaid Day Safari Cycling Rally was also be a part of the activities which was held from Safari Club to Mini Gold Club on Wednesday with participation of youth.\nEarlier, an exhibition was held at the Information Service Academy (ISA) on Tuesday, featuring rare photographs and portraits of the founder of Pakistan, aiming to educate the younger generation about his monumental struggle and sacrifices for a separate homeland.\nA documentary showcasing Quaid-e-Azam’s life and achievements was also screened during the exhibition.\nThe Benazir Income Support Programme (BISP) has also organized a ceremony to celebrate Christmas and the birthday of Quaid-e-Azam Muhammad Ali Jinnah at its headquarters on Friday.\nOn this momentous occasion, citizens from all walks of life are urged to reflect on Quaid-e-Azam’s timeless message and work collectively to overcome challenges, ensuring that Pakistan stays on the path envisioned by its great leader.\nThe younger generation, in particular, is encouraged to make Jinnah their role model and embody his ideals of hard work, integrity, and patriotism to build a brighter future for the nation.\nThis day serves as a powerful reminder of the sacrifices made during the struggle for independence and reinforces the need to uphold Quaid-e-Azam’s principles to steer Pakistan toward progress, harmony, and peace.\nQuaid-e-Azam Muhammad Ali Jinnah, a distinguished barrister and politician, led the All-India Muslim League from 1913 until Pakistan’s independence on August 14, 1947. Known for his unwavering determination, integrity, and commitment to justice, Jinnah became Pakistan’s first governor-general, serving until his death on September 11, 1948.\nJinnah’s leadership not only secured a homeland for the Muslims of the subcontinent but also laid the foundation for a nation built on equality, freedom, and tolerance. His vision of a united and prosperous Pakistan continues to serve as a guiding light for the country.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:03:04.229Z"
}
