{
  "title": "Tarar accuses PTI of fueling controversy over military courts",
  "link": "https://www.app.com.pk/national/tarar-accuses-pti-of-fueling-controversy-over-military-courts/",
  "date_published": "2024-12-25T14:02:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):Federal Minister for Information, Broadcasting, National Heritage, and Culture, Attaullah Tarar, on Wednesday accused Pakistan Tehreek-e-Insaf (PTI) of making the military court issue controversial for political gain and fabricating baseless claims to obtain concessions.\nTalking to the media, he clarified that military court sentences do not infringe upon the right to a fair trial, as individuals are granted access to a lawyer, family, and still have the opportunity to appeal twice, both within the military and the relevant high court.\nTarar stated that international laws were followed in the trial of those involved in the May 9 tragedy, there were no human rights violations, and all the accused will be punished in accordance with the law.\nHe stated that PTI is falsely creating an anti-country narrative about the military courts, which operate legally under an Act of Parliament and in accordance with the orders of the Supreme Court of Pakistan.\nTarar emphasized that military court trials are held when there is an attack on defense installations, such as the incidents at Corps Commander House, Mardan, and Bala Hisar fort.\nHe stressed that when such a building is attacked and burned, it is the responsibility of the defense establishment to arrest the accused, much like the railway police would file an FIR for crimes committed on the railways.\nThe Federal Information Minister stated that just as drug-related cases are tried in Anti-Narcotics Force (ANF) courts, terrorism cases in Anti-Terrorism Courts (ATCs), and attacks on railway facilities are handled by the Railway Police, similarly, cases involving attacks on military installations are prosecuted in military courts.\nThese cases are prosecuted under the military Act, ensuring a fair trial, and there is irrefutable evidence against the culprits. The right to appeal the military court’s decision is upheld, and PTI should utilize the legal remedies available to them.\nHe also reminded that PTI’s founding chairman had previously praised the virtues of military courts, underscoring the undeniable evidence against those tried and the importance of upholding the rule of law. He pointed out that clips of these statements are still circulating on social media.\nTarar reaffirmed that Quaid-e-Azam’s principle of the rule of law guides Pakistan’s actions, with those responsible for the May 9 incidents to be held accountable in accordance with the law, ensuring the right to a fair trial.\nEarlier, Tarar shared that Prime Minister Shehbaz Sharif extended his greetings on the birth anniversary of Quaid-e-Azam and Christmas to the Christian community, reaffirming his commitment to working together for a prosperous future for Pakistan.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:02:42.016Z"
}
