{
  "title": "Protection of minorities’ rights focus of Pakistan’s fundamental agenda: PM",
  "link": "https://www.app.com.pk/national/protection-of-minorities-rights-focus-of-pakistans-fundamental-agenda-pm/",
  "date_published": "2024-12-25T09:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 25 (APP):Prime Minister Muhammad Shehbaz Sharif on Wednesday said the country’s fundamental agenda of development and prosperity hinges upon the protection of the rights of Christian community and other minorities.\nAddressing an event held in connection with Christmas celebrations here at the PM House, he extended cordial felicitations to the Christian community in the country and the world.\nPM Shehbaz Sharif underscored that the day demanded the nation to join its forces for the betterment of mankind. “The Holy Quran has a revered mention of Prophet Jesus Christ (PBUH) and Hazrat Maryam (PBUH). Today, the birthplace of Prophet Jesus Christ is tainted in bloodbath and thousands of Palestinians including children, youth, elderly and women have been killed. All Christians and Muslims should unite and join forces to stop this bloodshed and uphold the mission of peace of Jesus Christ in Palestine’s holy land,” the PM urged.\nHe acknowledged that the Christian community rendered indelible contributions in the independence, betterment of the nation’s education, defence, and protection of the motherland in different wars that would be remembered in golden words, adding, “Cecil Chaudhary and Justice Cornelius are known to everyone.”\nPM Shehbaz noted that he and his elder brother Mian Muhammad Nawaz Sharif had also graduated from missionary schools whose teachers played a critical role in grooming their personalities.\n“We should promote unity, interfaith harmony and tolerance in the society to ensure protection of the rights of the minorities and ensure that they consider themselves as a respected member of the society. Pakistan belongs to all and we should celebrate this day as a more revered occasion as it is the birthday of Jesus Christ, and Quaid e Azam Muhammad Ali Jinnah as well,” Shehbaz Sharif said.\nThe prime minister quoted Quaid-e-Azam’s statement saying, “Protection and promotion of minorities rights has been our top priority. You all are the proud citizens of Pakistan. Your equal development and progress is the basic point of our fundamental agenda. I extend you the felicitations of Christmas and ensure that your protection, security and prosperity is not only dear to us but our responsibility.”\nHe reiterated that he as prime minister ensured the Christian community to uphold that right with greater responsibility.\nEarlier, Minister for Information and Broadcasting, Attaullah Tarar said he was representing 70,000 Christian constituents who supported him with great love and respect in his electoral effort including bishops of various churches.\n“Christians have great role in independence, nation building, and sacrifices for the motherland. PM Shehbaz Sharif during his tenure as chief minister Punjab awarded scholarships and laptops and endowment stipends to Christian students on merit without any discrimination,” he said.\nChristian athletes, the Sohail sisters had won 22 medals in different games whereas Brigadier Helen Merry Roberts the first female christian army officer were the recognition of their services for the motherland, he said.\nMembers of Christian Community along with federal ministers and members of the National Assembly joined the prime minister to cut Christmas cake to commence the celebrations which was followed by a group photo with chorus singers who rendered a colorful performance at the start of the event.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-10T14:03:30.993Z"
}
