{
  "article_id": "2025-01-16_30d7fce1bb92dfe2441f6f8d2077a90d",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/mumtaz-zahra-takes-over-responsibilities-as-ambassador-to-france/",
    "retrieved_at": "2025-08-27T11:42:05.414Z"
  },
  "metadata": {
    "title": "Mumtaz Zahra takes over responsibilities as ambassador to France",
    "author": null,
    "date_published": "2025-01-16T17:54:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 204,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 16 (APP):A career diplomat, Mumtaz Zahra Baloch took over responsibilities as Ambassador of Pakistan to France and Permanent Delegate to UNESCO in January 2025. Earlier, she was serving as Spokesperson and Additional Foreign Secretary (Strategic Communications Division & Public Diplomacy), Ministry of Foreign Affairs of Pakistan. Ms. Baloch had previously served as Ambassador of Pakistan to the Republic of Korea (2020- 2021) and as Minister/Deputy Head of Mission at the Embassy of Pakistan in China (2015-2020). She has also worked as Counselor for Political Affairs at the Embassy of Pakistan, Washington DC (2006-2011) and as Second Secretary at the Permanent Mission of Pakistan to the United Nations, Geneva (1999-2002). At the Ministry of Foreign Affairs, Islamabad she served as Additional Foreign Secretary, Asia & Pacific (2022-2023), Director, Americas (2013-2014), Director, Security Council and Human Rights (2012-2013) and Director, Strategic Planning (2011-2012). During 2014-2015, Ms. Baloch served as Director (Academic Programme) and later as Acting Director General of the Foreign Service Academy Islamabad. Ms. Mumtaz Zahra Baloch holds Masters degree in Physics from the Punjab University, Lahore; a Masters in International Relations from the Fletcher School of Law and Diplomacy, USA; and a degree in Public Administration from the Ecole Nationale d'Administration, France.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}