{
  "article_id": "2025-01-16_6567624346a0f09260c15a0b1ade3e76",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/nlpd-organises-seventh-session-of-muqalma-series-with-renowned-poet-translator-saleem-sethi/",
    "retrieved_at": "2025-08-27T11:42:27.018Z"
  },
  "metadata": {
    "title": "NLPD organises seventh session of ‘Muqalma’ series with renowned poet, translator Saleem Sethi",
    "author": null,
    "date_published": "2025-01-16T18:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 308,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 16 (APP):National Language Promotion Department (NLPD) here on Thursday organised the seventh session of the 'Muqalma' series with renowned poet, intellectual and translator Saleem Sethi. The event was graced by Federal Secretary for National Heritage and Culture Division Hasan Nasir Jamy as a chief guest. Commending Saleem Sethi's exceptional work, Hassan Nasir Jamy emphasised the importance of converting such unique literary contributions into digital formats to make them accessible to the younger generation. He also lauded the department's efforts in organising the 'Dialogue' series. Director General (DG) of the NLPD, Prof. Dr Muhammad Saleem Mazhar, expressed his gratitude to the distinguished guests and highlighted the immense dedication and effort required to translate poetry in the same meter as the original. He praised Saleem Sethi for accomplishing this challenging task with great skill and artistry. Speaking at the event, Saleem Sethi, the author and translator of the book 'Museebat Nama' (The Tale of Troubles), described it as a journey of enlightenment that offered valuable insights to readers of all levels. He shed a light on the complexities of poetic translation, noting that while the initial stages were challenging, the process eventually guided the translator. The session was moderated by Dr Rashid Hameed, Executive Director (ED) of the NLPD. In his remarks, Dr Hameed emphasised, \"Translation is the first step toward the progress of any nation.\" He acknowledged that while translation was once undervalued in the West, it has always been a means of spreading knowledge in our society. The audience engaged enthusiastically with the author during the Q&A session, with notable participants including Qaisera Alvi, celebrated writer and critic Muhammad Hameed Shahid, Prof. Maqsooda Mufti, Dr Ali Kamil Qazilbash, Mahboob Zafar, Dr Humaira Shahbaz, Dr Safir from NUML University and Dr Ghazi Mohiuddin. The event also featured a mesmerising poetic recitation by Sibghatullah, which delighted the attendees.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}