{
  "article_id": "2025-01-16_d4b15041106a3131d466d6dfdaa28d35",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pti-founder-involves-in-190m-pound-corruption-case-tarar/",
    "retrieved_at": "2025-08-27T11:43:23.743Z"
  },
  "metadata": {
    "title": "PTI founder involves in 190m pound corruption case; Tarar",
    "author": null,
    "date_published": "2025-01-16T11:43:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 221,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 16 (APP): Federal Minister for Information and Broadcasting Attaullah Tarar on Thursday said that the founder of Pakistan Tehreek-i-Insaf (PTI), his wife and Farah Gogi were involved in a 190 million pound corruption case. Answering a question during the Question Hour session of the Lower House of the Parliament, he said the National Crime Agency had not returned the money to the government of Pakistan but the then cabinet reimbursed the amount in a sealed envelope to the person from whom the money was taken. Tarar said that the amount of Rs 80 billion was deposited in the Supreme Court in exchange for another fine. The information minister replying to another question told the National Assembly that the construction of one of the largest dams in the world Diamer-Bhasha Dam would be completed in time which would help reduce the risk of floods. He informed that the land acquisition of the dam was completed in 2013 and in the first phase, the work of diversion of the Indus River for Diamer Bhasha Dam was completed by May 2024. Tarar added that the permanent bridge was built on the dam in June 2024. The information minister said that electricity generation was in surplus while the energy ministry was considering various proposals to meet the required electricity demand in the country.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}