{
  "article_id": "2025-01-16_7f3f5a25b86f9d1975d770589f42dcb0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pm-for-ensuring-early-conclusion-of-fbrs-legal-cases/",
    "retrieved_at": "2025-08-27T11:43:21.131Z"
  },
  "metadata": {
    "title": "PM for ensuring early conclusion of FBR’s legal cases",
    "author": null,
    "date_published": "2025-01-16T12:05:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Jan 16 (APP): Prime Minister Muhammad Shehbaz Sharif on Thursday directed the relevant authorities to expedite the Federal Board of Revenues' (FBR) legal steps being taken to ensure early conclusion of the under trial cases of tax revenues. Chairing a review meeting on expediting FBR's legal cases, the prime minister instructed to hire services of the reputed lawyers to represent FBR in the cases of tax revenues. He said the government was speedily implementing reforms in FBR system. \"By the grace of Allah Almighty, the positive results of reforms in FBR continue,\" he said. He also directed the forensic audit of cases related to tax matters. PM Shehbaz committed that the officers who were found to be involved in making cases on weak or false grounds will be given punishment. On the other hand, he said the officers who had constituted cases on merit with honesty and hard work will be rewarded with special incentives. The meeting was told that, after the prime minister's instructions, reputable lawyers were brought onto the panel, and as a result, from July to December 2024, 586 cases were resolved in the High Court, and 637 pending cases were resolved in the Supreme Court. The meeting was also informed that currently, 33,522 cases involving Rs 4.7 trillion were pending in various courts and tribunals across the country. It was told in the meeting that, as per the prime minister's directions, a litigation management dashboard for higher courts had been developed in the FBR, whereas the preparation of a tax tribunals management system at the Ministry of Law and Justice was in its final stages, which will be launched soon. The meeting was attended by Minister for Economic Affairs, Ahad Khan Cheema, Attorney General Mansoor Awan, Chairman FBR, and other senior officials.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}