{
  "article_id": "2025-01-16_908d7dc9acd2bdb446f8584d06be19f2",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/over-208000-children-to-receive-polio-drops-in-khyber/",
    "retrieved_at": "2025-08-27T11:44:10.661Z"
  },
  "metadata": {
    "title": "Over 208,000 children to receive polio drops in Khyber",
    "author": null,
    "date_published": "2025-01-16T09:53:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 297,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "PESHAWAR, Jan 16 (APP):Under the supervision of the District Administration Khyber and led by the , a seven-day anti-polio campaign is set to begin on February 3. Deputy Commissioner Khyber, Captain (R) Bilal Shahid Rao, is personally overseeing the arrangements to ensure the campaign's success. To finalize preparations, a meeting of the District Polio Eradication Committee (DPEC) was held at the Deputy Commissioner's office. The meeting, chaired by Deputy Commissioner Captain (R) Bilal Shahid Rao, was attended by District Police Chief Rai Mazhar Iqbal, Additional Deputy Commissioner Ehsanullah, District Health Chief Dr. Faisal, Khyber Police DSP Muhammad Nawaz, and representatives from the Health Department, World Health Organization (WHO), Polio Program, Education Department, and other key stakeholders. During the meeting, a detailed plan was presented, highlighting security arrangements, awareness campaigns, challenges, and strategies to address vaccine refusal cases. The comprehensive approach aims to ensure every eligible child in the district receives the polio vaccine. The campaign, running from February 3 to February 9, will deploy 1,043 health department teams to administer polio drops to over 208,000 children at their doorsteps. Strict security measures will be in place to safeguard health workers and ensure smooth operations. Speaking on the occasion, Deputy Commissioner Bilal Shahid Rao urged all stakeholders to actively participate in the campaign. \"We are committed to eradicating polio and protecting our children from this crippling disease. The cooperation of every individual, especially parents, is crucial,\" he said. The District Administration has also appealed to parents to ensure their children are vaccinated. \"This is a collective responsibility, and we urge parents to support health teams in their mission to protect children from lifelong disability,\" the statement read. The administration remains hopeful that with coordinated efforts and public support, the campaign will achieve its target of a polio-free Khyber.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}