{
  "title": "APC pleads for practical steps by Muslim Ummah to mitigate Gaza people’s miseries",
  "link": "https://www.app.com.pk/national/apc-pleads-for-practical-steps-by-muslim-ummah-to-mitigate-gaza-peoples-miseries/",
  "date_published": "2023-10-19T14:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 19 (APP): The All Parties Conference (APC) on Thursday called for practical steps and measures by the Muslim Ummah to ensure full support and assistance to the war-affected Palestinian people, who are undergoing unprecedented agony and turbulence in the wake of Israeli aggression on the Gaza Strip.\nThe APC participants stressed upon the Government of Pakistan to play a proactive role in order to champion the Palestinian cause and clearly convey the anger and anguish of the entire Muslim Ummah over the injustice and Israeli brutalities with the Gaza people.\nThey called for a leading role of Pakistan at the Organisation of Islamic Cooperation (OIC) to bring the Israeli reign on terror on the Gaza area to an end. They also condemned the international human rights organizations for keeping silence instead of playing their due role to uphold the rights of Palestinian people.\nThe All Parties Conference, hosted by Ms Uzma Gul at the Palestinian Embassy, was addressed, besides Palestinian Ambassador Ahmed Jawad Rabei, by Pakistan Muslim League-Nawaz leaders Shahid Khaqan Abbasi, Hafiz Masood Kamaluddin and Chaudhry Shafique-ur-Rehman Warraich, Head of Ansar Ummah Maulana Fazlur Rahman Khalil, MQM’s Haider Abbas Rizvi and others.\nMs Uzam Gul, in her address, expressed gratitude to the participants for expressing their collective dedication to the Palestinian cause.\nShe emphasized the significance of the resolution of Palestine issue with the active role of the Pakistani community across the globe. The hearts of Muslims all over the world beat in unison with their Palestinian brethren, she added.\nShe cautioned the Muslim countries against dereliction towards the current crisis as it might spill over to across the region\nPalestinian Ambassador Ahmed Jawad Rabei, in his remarks, expressed his heartfelt gratitude to the Pakistani people for showing solidarity with the Palestinians as evident from the protests against the Israeli aggression held all across the country.\n“I am grateful to my Pakistani brothers and sisters, especially the honourable Ms Uzma Gul, General Hamid Gul’s daughter, who has consistently expressed solidarity with the Palestinian brothers and sisters, and stands with Palestine.”\nAmbassador Rabei highlighted the Israeli aggression and ensuing grave humanitarian crisis in Palestine, saying over 30,000 people had been killed, 74% of them were women and children.\nHe said Pakistan was one of the first four countries to extend aid to Palestine, and expressed the Palestinian people’s unwavering resolve to withstand Israeli aggression.",
  "retrievedAt": "2025-08-11T10:08:27.673Z"
}
