{
  "title": "SAPM launches web-based application for recovery of dues of Overseas Pakistani workers",
  "link": "https://www.app.com.pk/national/sapm-launches-web-based-application-for-recovery-of-dues-of-overseas-pakistani-workers/",
  "date_published": "2023-10-19T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 19 (APP): Special Assistant to the Prime Minister (SAPM) for overseas Pakistanis Jawad Sohrab launched the OPF web portal for the recovery of dues of overseas Pakistani workers to facilitate the Pakistani diaspora.\nThis service expedites the disbursement of dues such as salary, death & disability compensation and other allowances of the workers, according to a press release here on Thursday.\nAddressing the formal launch of the web-based application for Outstanding Dues Management of overseas Pakistani\nworkers at Overseas Pakistan Foundation (OPF) which was completely developed in-house, the Special Assistant to the Prime Minister for Overseas Pakistanis, Jawad Sohrab Malik emphasized upon maximum utilization of technology to improve service delivery to Overseas Pakistanis.\nHe said the Internet has revolutionized the service delivery paradigm as it has transformed the way businesses operate worldwide. Moreover, it has also led to the development of new technologies, thus, providing an opportunity to better manage business processes using state-of-the-art technology.\nThe implementation of a web-based system has significantly enhanced the efficiency of OPF officials in processing outstanding dues cases of overseas Pakistanis.\nNow, all applications are directly entered into the system at their point of origin, which are the offices of the CWAs in Pakistan missions abroad. This eliminates the previous need to send hard-copy applications to OPF for manual data entry, a process that used to take approximately 30 days. With the new system in place, this cumbersome transfer of applications in physical form has been reduced to a few minutes only.\nFurthermore, the entire application workflow has been streamlined through automation. The new system provides real-time access to applications, allowing for seamless movement within different departments.\nThe web-based online system also allows all stakeholders to access up-to-date information on pending dues cases, worker details, payment disbursement status, document verification, etc. Additionally, it empowers senior management to track applications online and monitor the progress of incoming applications.\nThe SAPM stated that in line with the vision of the Prime Minister of Pakistan, the Ministry of Overseas Pakistanis and Human Resource Development is striving hard to extend maximum facilities and assistance to overseas Pakistanis who have a strong bond with their homeland and the present government is on its threshold to explore all avenues to facilitate them.\nWhile highlighting the significance of web-based software applications, the Special Assistant to the Prime Minister for Overseas Pakistanis said; “In today’s internet-driven society, web-based applications provide immediate access to services on a 24/7 basis. He appreciated the management of OPF for developing a web-based application for expediting the disbursement of dues to families of Overseas Pakistanis.”",
  "retrievedAt": "2025-08-11T10:08:14.206Z"
}
