{
  "title": "Murad Saeed express heartfelt condolences on sad demise of Adeel Shah",
  "link": "https://www.app.com.pk/national/murad-saeed-express-heartfelt-condolences-on-sad-demise-of-adeel-shah/",
  "date_published": "2021-05-12T17:52:00.000Z",
  "source": "APP",
  "content": "Attock, May 12 (APP):The Federal Minister for Communications Murad Saeed shared his message “I am sad and grieved on sad demise of Adeel Shah. The martyr sacrificed in line of duty in Ramzan. It shall be ever remembered.\nMay Allah bless his soul. May Allah grant fortitude to the bereaved family to bear this irreparable loss. We stand with the grieving family and I have directed the IG NHMP to process his case for compensation package at earliest”.\nThe IG NHMP Dr. Syed Kaleem Imam has also expressed his grief and heartfelt condolences to the bereaved family on sad demise of Adeel Shah. The IG NHMP expressed, despite our best efforts our officer Adeel shah finally after struggling for life has left for heavenly abode. He was a hard working & people friendly official who zealously performed his duty.\nIt is great loss. We are grief stricken at untimely and accidental demise. I assure the family that shaheed shall be duly honoured and the case against the erring driver will be taken to lawful conclusion. A medical helper, Adeel Ali Shah who was severely injured by a suspected speeding car rider at M-1 Peshawar toll plaza on 06-05-21 has passed away on 11-05-21.\nDIG Motorway Police Ashfaq Ahmed on the same visited Lady Reading Hospital Peshawar to enquire about the health/ condition of Adeel Ali Shah who was in critical situation has directed to NHMP staff no efforts should be spared in the treatment of injured official who was serious due to severe head injuries.\nThe accused car rider Juniad s/o Ateeq was arrested by NHMP prompt action during his attempt to escape and was handed over to PS Chamkani for further legal action.\nThe relatives of accused approached to bail him out but NHMP officers resisted it and argued it in the court and showed the video where the judge was convinced, NHMP succeeded and the bail was refused by the court, accused person was sent to jail. On 11-05-21, with deep sorrow and grief, the NHMP has informed that the injured official Adeel Shah passed away. Adeel Shah’s funeral prayers were offered at 00:30 at Dalazak Road Peshawar.\nA very large number of people attended the Janaza, He was very popular official in the community. The whole community was also grieved on this tragic demise of Adeel Shah. Adeel Shah has left a widow and a child among his mourners.",
  "retrievedAt": "2025-08-11T20:43:22.432Z"
}
