{
  "title": "Govt introduces strong mechanism for real estate sector: Dr Firdous",
  "link": "https://www.app.com.pk/national/govt-introduces-strong-mechanism-for-real-estate-sector-dr-firdous/",
  "date_published": "2020-02-08T12:16:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 8 (APP):Special Assistant to the Prime Minister on Information and Broadcasting Dr Firdous Ashiq Awan Saturday said the government had introduced a strong regulatory mechanism for real state sector to purge the small investors from the mafia’s fraud and deception under a proper legal cover.\n“The reforms, introduced by the government in this sector on the instruction of Prime Minister Imran Khan, reflect that the government is guardian of each penny of those investors who belong to salary and poor classes and make investments to get their own shelters in housing projects,” she told media person here at Pakistan China Friendship Center, where she inaugurated a property expo.\n“Now, nobody can hoodwink the authorities and whisk away by luring innocent people in their trap as the government is closely monitoring the mechanism of every project in real estate sector from its launch to completion,” she remarked.\nShe said the government had also initiated ‘Digital Pakistan’ to introduce use of latest technologies in public and private sectors which was also providing help in regulating the state sector.\nThe special assistant pointed out that the some developers at the expo had requested her to soften the reforms in the sector so that it could attract more investments.No country can progress without ‘tax’ as it works as oxygen for the economy of any state,” Dr Firdous said, responding to the grievances of some developers about the reforms in housing sector.\nShe said people had witnessed in the past that billionaires got richer and millionaires went bankrupt due to plundering of the mafias in this sector, but now it was impossible for them to escape accountability as the Pakistan Tehreek-e-Insaf government had launched ‘Digital Pakistan’ to ensure transparency in all sectors.\nEarlier, this sector was treated indifferently but the present government was giving special focus to revamp the housing industry which would eventually bring economic stability in the country through job creation, she added.\nThe special assistant said every country’s progress and development hinged on the growth of real estate sector as it was directly connected with other industries and helped alleviate unemployment in the country.\nDr Firdous urged Pakistani expatriates to invest in real estate sector without any fear as their investments were fully protected in ‘Naya Pakistan’.\nShe asked the entrepreneurs associated with the industry to focus on producing low-cost and affordable housing units for the salary class people under the vision of Prime Minister Imran Khan, who had been a strong proponent of providing shelter to the homeless and needy.\nTo a query, she termed her government as people friendly, and said no one could escape the accountability now.\nThe government had turned the Pakistan Muslim League-Nawaz leader Ishaq Dar’s home into a shelter home which was the manifestation of the fact that the public money was being spent on people’s welfare in ‘Naya Pakistan’, she added.\nTo another query, she said Rana Sanaullah should give his clarification before the court during his trial instead of giving statements in media for his personal satisfaction.\nThe government would soon table a bill before the Parliament for social protection of journalist community, she said while responding to another query.",
  "retrievedAt": "2025-08-11T18:45:48.608Z"
}
