{
  "title": "Singapore detains teen who ‘aspired’ to kill Muslims - World - DAWN.COM",
  "author": null,
  "content": "SINGAPORE: A teenager who allegedly used a violent online game to train for a mission to kill Muslims, similar to the 2019 massacre in New Zealand, has been detained in Singapore, security authorities said on Monday.\n\nIdentified as Nick Lee, 18, he allegedly planned an attack mirroring the one carried out by white supremacist Brenton Tarrant in New Zealand six years ago.\n\nTarrant went on a rampage, killing 51 worshippers at mosques around Christchurch in March 2019 in the country’s deadliest modern-day mass shooting.\n\n“Lee aspired to carry out attacks against Muslims in Singapore with like-minded far-right individuals that he conversed with online,” Singapore’s Internal Security Department (ISD) said.\n\nThe department said “his attack aspirations included conducting a Tarrant-style attack on Muslims at a mosque in Singapore, using homemade guns, knives, and Molotov cocktails”, and livestreaming the event, similar to the Tarrant attack.\n\nThe ISD said it issued a detention order for Lee in December under the Internal Security Act, which allows for a person to be held without trial.\n\nLee “started forming an antipathy towards Muslims in 2023” after coming across far-right propaganda against Muslims on social media, according to the ISD.\n\nHe searched for Tarrant’s livestreamed video of the New Zealand attacks and watched it repeatedly, the law agency added.\n\n“He idolised Tarrant, started role-playing as Tarrant in a violent online simulation game,” it said.\n\nLee downloaded “video game modifications so he could pretend to be Tarrant killing Muslims at the Al-Noor Mosque in Christchurch”.\n\nThe ISD said that Lee “identified as an ‘East Asian supremacist’, believing in the superiority of Chinese, Korean and Japanese ethnicities”, after coming across these ideas online. Lee’s “attack ideations were aspirational and he had no timeline to carry them out”, the ISD said, adding that investigations into his online contacts “have not surfaced any imminent threat to Singapore”.\n\nWealthy Singapore, a largely ethnic Chinese society with substantial Malay Muslim and Indian minorities, has taken a tough stance against extremist ideas.\n\nA government report on terrorism threats released in July said “youth radicalisation is a particular concern”, with 13 of the 52 cases of “self-radicalised” individuals identified by the security agency were aged 20 or younger.\n\nThe youngest was a 14-year-old detained last year. The ISD also arrested a 17-year-old in 2024, saying he was “weeks away” from planning an attack on non-Muslims, using scissors. In 2023 an 18-year-old student was detained for planning a similar attack.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:22:57.543Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891153/singapore-detains-teen-who-aspired-to-kill-muslims",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:52:25.000Z"
}
