{
  "title": "Global experts demand release of Idris Khattak - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A group of independent human rights experts have made public their letter, penned to the government, calling for the immediate and unconditional release of human rights defender Idris Khattak.\n\nThe letter was sent to the government on Dec 10, 2024, and informed that the communication and any response received from Pakistan will be made public within sixty days, and was subsequently be made available in the usual report to be presented to the Human Rights Council.\n\nThe letter was jointly written by Gina Romero, Special Rapporteur on the rights to freedom of peaceful assembly and of association; Ganna Yudkivska Vice-Chair on Commu­ni­c­ations of the Working Gro­up on Arbitrary Detention; Gabriella Citroni Chair-Rapporteur of the Work­ing Group on Enforced or Involuntary Disappear­ances; Irene Khan Special Rapporteur on the promotion and protection of the right to freedom of opinion and expression; Mary Lawlor Special Rappor­teur on the situation of human rights defenders; Margaret Satterthwaite Special Rapporteur on the independence of judges and lawyers; and Nicolas Levrat Special Rappor­teur on minority issues.\n\n“We are dismayed by the continued apparent arbitrary deprivation of liberty of Mr. Khattak, which clearly appears to be a direct retaliation for his human rights work, including documenting and reporting on enforced disappearances and repression against ethnic minorities in the Pakistan north-west region,” the experts said.\n\nMr Khattak, who has been in detention for five years, has allegedly been subject to a series of egregious abuses and human rights violations in the past five years, since he was taken into military custody in November 2019, the experts said.\n\nOn numerous occasions, UN experts have raised concerns regarding Khattak being subjected to enforced disappearance, prolonged incommunicado detention, torture and ill-treatment, and lack of access to a fair trial and due process rights.\n\nKhattak was convicted and sentenced to 14 years imprisonment in Decem­ber 2021, following a secret trial by a military court.\n\nThe experts called on Pakistan to ensure an independent, impartial, effective and thorough investigation into the enforced disappearance and other violations Khattak has suffered, identify those responsible and bring them to justice, especially those at command level.\n\nMr Khattak and his family should be provided with adequate reparation for the harm suffered, the experts said.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:31:06.134Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891175/global-experts-demand-release-of-idris-khattak",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:51:24.000Z"
}
