{
  "title": "Novelist Rushdie takes stand in trial of his accused stabber - World - DAWN.COM",
  "author": null,
  "content": "The novelist Salman Rushdie showed a jury his blinded right eye on Tuesday as he testified against the man charged with trying to murder him during a talk in rural New York in 2022.\n\nHadi Matar, 26, has pleaded not guilty to charges of second-degree attempted murder and second-degree assault brought by the Chautauqua County district attorney.\n\nRushdie walked into the courtroom dressed in a dark suit, white shirt and grey tie.\n\nThe right lens of his spectacles was blacked out, masking the eye, which his attacker’s knife had pierced through to the optic nerve.\n\n“I was aware of this person rushing at me from my right-hand side,” Rushdie testified at the courtroom in Mayville, a few miles north of the Chautauqua Institution, the site of his attack on August 12, 2022.\n\n“He hit me very hard,” Rushdie said. “Initially, I thought he had punched me. I thought he was hitting me with his fist. But very soon afterwards I saw really quite a very large quantity of blood pouring out onto my clothes, and by that time he was hitting me repeatedly. Stabbing, slashing.”\n\nMatar, dressed in a baggy light blue shirt, sat with his defence lawyers nearby. In his memoir about the attack, Rushdie imagined questioning Matar about the attack and wrote that he was looking forward to facing him in a courtroom.\n\nRushdie, who spent most of the 1990s in hiding in the UK after receiving death threats over his 1988 novel “The Satanic Verses,” was stabbed about 15 times: in the head, neck, torso and left hand, blinding his right eye and damaging his liver and intestines. The trauma doctors who treated him after he was airlifted to a hospital in Erie, Pennsylvania, said he lost so much blood he came close to death.\n\nRushdie said the stabbing in his right eye was the most dangerous.\n\n“You can see that’s what’s left of it,” Rushdie said, removing his spectacles and turning to the jury.\n\n“There’s no vision in the eye at all.”\n\nThe assault charge is for the wounding of Henry Reese, the co-founder of Pittsburgh’s City of Asylum, a non-profit group that helps exiled writers, who were conducting the talk with Rushdie that morning. Reese is also due to testify.\n\nRushdie described his attacker as dressed in very dark clothes with a dark Covid face mask.\n\n“I was very struck by his eyes which were dark and seemed very ferocious to me,” Rushdie testified.\n\nA defence lawyer for Matar objected to the characterisation, and Judge David Foley struck the answer from the very record.\n\n“Okay, not ferocious,” Rushdie said.\n\nChautauqua District Attorney Jason Schmidt rephrased his question, asking the writer how he came to make conclusions about his attacker’s ferocity.\n\n“He struck me a number of times, another half a dozen times,” Rushdie replied.\n\n“At some point, I thought I was dying. That was my immediate thought.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/1122055552713ba.jpg",
  "retrievedAt": "2025-08-25T19:30:22.314Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891307/novelist-rushdie-takes-stand-in-trial-of-his-accused-stabber",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T17:13:21.000Z"
}
