{
  "title": "Man in Karachi sentenced to life in prison for smuggling 1.9 tonnes of drugs - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: A special court for the Control of Narcotic Substances (CNS) has sentenced an “international smuggler” to life in prison for attempting to traffic over 1,900 kilograms, or 1.9 tonnes, of charas to Belgium.\n\nSpecial CNS Court Judge Rajesh Chander Rajput found international smuggler Shahzad Akram, alias Mubashir and his accomplice Hasnain Hanif guilty of attempting to smuggle 1,960kg of charas in a container exporting bed sheets to Belgium.\n\n“[The] prosecution has been successful in proving the charge upon Shahzad Akram of trying to export seized charas and facilitating role upon accused Hasnain Hanif beyond any shadow of doubt,” the court noted.\n\nThe court also sentenced Hanif — who appeared in court on bail — to five years in prison for providing his export licence (Form E) for the shipment.\n\nCo-accused jailed for five years for providing his export licence for consignment\n\nAccording to state prosecutor Abdul Hanan, in August 2018, an Anti-Narcotics Force (ANF) team received information regarding international smugglers Hamid Shakeel, Adeel Hussain and Akram, who were using Hanif’s export license to traffic a large quantity of narcotics to Belgium in a container which was held off at South Asian Port Terminal.\n\nActing on a tip-off, the ANF team raided the terminal and apprehended the accused Akram and Hanif. They disclosed that the drugs were concealed in a secret compartment within a shipping container containing cartons of multi-coloured bed covers.\n\nThe ANF team recovered 98 white sacks, each containing 20 packets of charas, with each packet weighing one kg, bringing the total to 1,960kg.\n\nDuring interrogation, Akram allegedly disclosed that he was previously involved in the garment business, where he met Shakeel and Hussain. They suggested that concealing narcotics in consignments could yield huge profits.\n\nHe further stated that Shakeel informed him that Hussain would transport the narcotics from Peshawar to Faisalabad.\n\nIn June 2018, Shakeel travelled from Peshawar to Karachi and placed an order for bed covers. On his next trip to Karachi, he went to Faisalabad with Akram to a warehouse, where they brought the narcotics.\n\nThe court also imposed a fine of Rs800,000 on Akram and directed Hanif to pay Rs300,000.\n\nRegarding the co-accused, the court declared Shakeel, Hussain and importer M/S Grabriele Hoferg Rustrasse from Germany as proclaimed offenders. It further ruled that the case file would remain dormant until their arrest.\n\nA case was registered by ANF-Clifton under Sections 6/9-C, 14 and 15 of the Control of Narcotic Substances Act, 1997.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:30:36.496Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891105/man-in-karachi-sentenced-to-life-in-prison-for-smuggling-19-tonnes-of-drugs",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:53:31.000Z"
}
