{
  "title": "Over 700 polio vaccine refusals reported in Islamabad - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Parents of over 700 children initially refused to vaccinate their kids against polio in the latest anti-polio campaign which lasted from Feb 3 to Feb 9 in the federal capital. However, the capital administration managed to convince the parents after the intervention of Deputy Commissioner Irfan Nawaz Memon.\n\nAn official of the health ministry said those who refused inoculation also included educated parents, with some saying that their children should not be treated as “guinea pigs” and others claiming that polio vaccines would make their children “impotent”.\n\n“There were many who believed that the vaccination was against Islam and if their child contracted the virus it would be by the will of Allah,” the official told Dawn on the condition of anonymity.\n\n“We were constantly in contact with the district administration and requested that the parents be given awareness that the vaccine is not only beneficial for their children but also other children in the nearby areas. If one child is not vaccinated, he/she can spread the virus to other children of a locality,” the official said. He, however, added that if a majority of the children were vaccinated, they could develop herd immunity which prevents the virus from spreading.\n\nInitially, parents were reluctant but after Islamabad DC’s intervention, all children were vaccinated\n\nThe results of the polio campaign, however, were satisfactory. A spokesperson for the Islamabad Capital Territory (ICT) Administration claimed that the target was to vaccinate 461,125 children in the federal capital but they exceeded the target by 11 percentage points as they also vaccinated a number of children visiting the capital.\n\nAlmost 510,659 children were vaccinated in the city, he said. “There were 706 children whose parents stopped polio teams from vaccinating them. However, all parents were convinced (by the administration) and they allowed the polio teams to vaccinate their children,” he claimed.\n\nDC Irfan Nawaz Memon has appreciated the efforts of the polio teams who visited houses, educational institutions and public places to vaccinate children.\n\nIt is worth mentioning that polio is a highly infectious disease mainly affecting children under the age of five years. It invades the nervous system and can cause paralysis or even death. While there is no cure for polio, vaccination is the most effective way to protect children from this crippling disease. Each time a child under the age of five is vaccinated, their protection against the virus is increased.\n\nRepeated immunisations have protected millions of children from polio, allowing almost all countries in the world to become polio-free, except for the two endemic countries of Pakistan and Afghanistan.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:30:27.095Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891233/over-700-polio-vaccine-refusals-reported-in-islamabad",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T03:22:16.000Z"
}
