{
  "title": "Trump meets Jordan’s king, repeats Gaza takeover plan - World - DAWN.COM",
  "author": null,
  "content": "Donald Trump on Tuesday restated his plan for the US to take over Gaza and permanently resettle its residents, as he met Jordan’s King Abdullah amid widespread opposition to his plan among Washington’s Arab allies, including Jordan.\n\nShortly after the king and his son arrived at the White House, reporters were ushered into the Oval Office where the US president signalled he would not budge on his plan for the US to take over Gaza, move its shell-shocked residents and transform the war-ravaged territory.\n\n“We’re going to take it. We’re going to hold it, we’re going to cherish it. We’re going to get it going eventually, where a lot of jobs are going to be created for the people in the Middle East,” Trump said of Gaza, saying his plan would “bring peace” to the region.\n\nTrump has said he would consider withholding aid from Jordan if it refuses to resettle Palestinians.\n\nKing Abdullah has previously said he rejects any moves to annex land and displace Palestinians.\n\nJordan’s Abdullah was repeatedly pressed by reporters on whether he supported the plan but said only that Egypt was coming up with a response and that Arab nations would then discuss it at talks in Riyadh.\n\n“The president is looking at Egypt coming to present that plan […] (then) we will be in Saudi Arabia to discuss how we should work with the president and with the United States,” Abdullah said.\n\n“The point is, how do we make this work in a way that is good for everybody.”\n\nHe was expected to tell Trump such a move could spur radicalism, spread chaos in the region, jeopardise peace with Israel and threaten the country’s very survival.\n\nThree out of four Americans — 74 per cent — in a Reuters/Ipsos poll conducted February 7-9 said they opposed the idea of the US taking control of Gaza and displacing the Palestinians who live there.\n\nThe poll showed that Republicans were divided on the issue, with 55ppc opposed and 43pc supportive.\n\nTrump’s proposal has introduced new complexity into a sensitive regional dynamic, including a fragile ceasefire between Israel and the Palestinian fighter group Hamas.\n\nHamas on Monday said it would stop releasing Israeli hostages from Gaza until further notice, saying Israel was violating the agreement to end strikes that have pummeled Gaza.\n\nTrump later proposed cancelling the ceasefire if Hamas doesn’t release all remaining hostages it took on October 7, 2023, by Saturday.\n\nTrump said on Tuesday that “all bets are off” if Hamas does not meet the deadline, adding that he does not think the Palestinian fighter group will do so.\n\nSandwiched between Saudi Arabia, Syria, Israel and the occupied West Bank, Jordan is already home to more than 2 million Palestinian refugees in its population of 11m, their status and number long providing a source of anxiety for the country’s leadership.\n\nAmman, which depends heavily on Washington for military and economic assistance, is also reeling from Trump’s 90-day aid pause. Israel and Egypt have been granted waivers, but the $1.45 billion Jordan gets each year remains frozen pending a Trump administration review of all foreign aid.\n\nKing Abdullah “is in a very, very vulnerable position where the US has a lot of leverage”, said Ghaith Al-Omari, senior fellow at the Washington Institute for Near East Policy think tank.\n\nBut US assistance to Amman “is not charity”, Al-Omari said, explaining that Jordan hosts US troops and air assets, is an important intelligence-sharing partner for Washington, and its peace treaty with Israel, signed in 1994, is key to regional stability.\n\n“The king would be hoping that these would be a counter to the leverage that the president has,” Al-Omari said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/11232702609a420.jpg",
  "retrievedAt": "2025-08-25T19:30:22.370Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891313/trump-meets-jordans-king-repeats-gaza-takeover-plan",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T18:28:30.000Z"
}
