{
  "title": "KP governor rejects bill about removal of employees - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Khyber Pakhtunkhwa Governor Faisal Karim Kundi on Monday rejected the controversial “KP Employee Service Removal Bill 2025” recently passed by the provincial assembly regarding the employees appointed by caretaker government, citing concerns about the violation of fundamental rights and legal principles.\n\nIn his objection to the bill, the governor referenced decisions from Supreme Court and Sindh High Court. He called for amendments to the bill, asserting that it contravened the constitutional right to a fair appeal, as outlined in Article 10A of the Constitution.\n\nHe emphasised that the law’s provisions, which denied employees the right to appeal, were a violation of basic human rights. He also expressed concerns over the retroactive nature of the bill, which sought to annul legal appointments made in the past.\n\nThe governor said that such actions would be unconstitutional. He advised the provincial government to reconsider the bill to avoid potential judicial challenges. He said that not only employees but also the officials responsible for illegal appointments must be held accountable.\n\nHe recommended taking action against those, who made unauthorised recruitments, to ensure that the employees recruited with the permission of Election Commission of Pakistan were excluded from the laws scope.\n\nMr Kundi urged the provincial government to amend the bill to ensure transparency and justice for avoiding potential legal hurdles in future.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:22:11.581Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891141/kp-governor-rejects-bill-about-removal-of-employees",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:53:03.000Z"
}
