{
  "title": "9 terrorists killed in Karak, North Waziristan - Pakistan - DAWN.COM",
  "author": null,
  "content": "NORTH WAZIRISTAN/LAKKI MARWAT: Four terrorists, including three Afghans, were killed and three others injured in a strike by security forces in North Waziristan, while police said five terrorists ass­ociated with the ban­ned Tehreek-i-Taliban Pak­is­tan (TTP) were killed in an encounter in Karak district on Monday.\n\nThere was no official word from the Inter-Serv­ices Public Relations, the military’s media wing, reg­arding the operation till late on Monday evening.\n\nSources said security forces received intelligence reports that about seven to 10 terrorists, some among them Afghans, were present at a specific location in the Tappi village of Miram­shah tehsil, after which the hideout was targeted.\n\nSources said the strike on the terrorists’ hideout left dead four militants, who were later identified as Riaz alias Muhajir, Zarar Afghan, Naqeeb­ul­lah Afghan, and Sar­kash Afghan. Three others were said to be injured.\n\nThe dead and injured terrorists were shifted to an unknown location after the operation, sources said.\n\nLocal sources reported that after the strike, a fire broke out at the hideout and some bodies were so mutilated that they were rendered unrecognisable. Security forces have cordoned off the area and initiated a search operation.\n\nKarak operation\n\nSeparately, police and security forces killed five militants during a joint operation in Karak district.\n\nA police official said the counterterrorism department (CTD) commandos, assisted by security forces and police, launched the late-night operation in Mir Kakam Banda area of Banda Daud Shah town, following credible information about the presence of terrorists there.\n\nHe said the terrorists affiliated with Commander Kalimullah group of the banned TTP opened fire on law enforcers when they reached near the hideouts, leading to a fierce gun battle which continued for one hour.\n\nDuring a search after the exchange of fire, the law enforcement personnel found the bodies of five terrorists along with arms and ammunition, the official maintained.\n\nHe identified the dead terrorists as Muhammad Shoaib, brother of TTP commander; Sabeel Khan alias Usman alias Haqyar, residents of Bannu; Wajid alias Sangri and Shah Qiaz alias Sanari alias Parak, residents of Karak; and Badil Jan, a resident of Kohat.\n\n“The slain terrorists were involved in bank robberies, attacks on polio teams and police and FC installation and Lachi toll plaza,” the official said, adding that their 10 accomplices armed with rocket launchers, hand grenades, assault rifles and ammunition escaped the scene taking advantage of darkness.\n\nThe official said the dead terrorists and their fleeing accomplices had attacked a police post in Bahadarkhel area last week wherein three policemen embraced martyrdom and six others were injured.\n\n“The CTD commandos and police are tracking down the fleeing terrorists in the area,” he added.\n\nBomb attack\n\nIn Lakki Marwat, police personnel narrowly escaped a bomb attack on the Lakki-Darra Tang section of busy Bannu-Mianwali Road.\n\nA police official said that the cops on patrol duty in an armoured personnel carrier vehicle were targeted with an improvised explosive device planted along the roadside near Peerwala Mor.\n\n“The bomb went off with a bang but luckily all policemen remained safe,” he maintained. He said the blast damaged the APC vehicle, shattering its front screen.\n\nAfter the explosion, a large police contingent reached the place and launched a search for the perpetrators in the surrounding area.\n\nOn the other hand, Regional Police Officer, Bannu, Imran Shahid paid a surprise insp­ection visit to the Bannu’s city police station to check security arrangements.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T01:22:12.070Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891203/9-terrorists-killed-in-karak-north-waziristan",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:50:03.000Z"
}
