{
  "title": "Committee formed to probe national kitty losses after ex-minister’s 2020 pilot licence remarks - Pakistan - DAWN.COM",
  "author": null,
  "content": "The federal cabinet has set up a committee to investigate financial losses to the national exchequer following former aviation minister Ghulam Sarwar Khan’s 2020 statement in Parliament about pilots with dubious licences, it emerged on Tuesday.\n\nSpeaking in the National Assembly in 2020, while talking about a PIA plane crash in May of that year, the then federal minister said that the government had observed that major airlines in other countries did not have such a history of crashes and therefore, started to investigate pilots.\n\nHe claimed that almost 40 per cent of pilots had “fake licenses”, adding that of the 860 active pilots, 262 pilots did not even take their exams themselves.\n\nAccording to a cabinet secretariat notification seen by Dawn.com today, the newly formed committee will “assess the financial losses incurred by the national exchequer due to the irresponsible statement” by Khan in 2020.\n\nThe committee will also “evaluate the reputational damage caused to the country and [the Pakistan International Airlines] due to this irresponsible statement.”\n\nThe seven-member committee will be chaired by Defence Minister Khawaja Asif as the convener. It will also comprise the minister for law and justice, the minister for finance and revenue, the secretaries of the defence ministry and ministry of law and justice, the CEO of PIA, and the director general of the Civil Aviation Authority (CAA).\n\nThe committee is expected to submit its reports to the cabinet within four weeks, according to the notification.\n\nIn January, a cabinet meeting was briefed regarding the comments by Khan, and how they were “irresponsible and exaggerated”.\n\nConsequently, according to a press briefing from the Prime Minister’s office, the federal cabinet had approved the formation of a fact-finding committee to review the statement and its financial consequences.\n\nAccording to Khan’s statement in 2020, the pilots included 141 from Pakistan PIA, nine from Air Blue and 10 from Serene Air, while the rest were affiliated with flying clubs, chartered plane services or foreign airlines.\n\nShortly after his revelation, he announced that the pilots whose credentials may have been falsified would be immediately grounded, pending investigations.\n\nFollowing that, the federal government assured that an inquiry into the matter was in progress. In November that year, Khan said he stood by his initial statement.\n\n“All of the 262 pilots were given the right of personal hearing and action was taken against only 82 pilots,” the ex-aviation minister had said, adding nothing was done wrongfully.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:30:22.679Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891296/committee-formed-to-probe-national-kitty-losses-after-ex-ministers-2020-pilot-licence-remarks",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T14:19:18.000Z"
}
