{
  "title": "Controversy over corporate farming echoes in NA, again - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The controversy over a plan to divert water to Cholistan for corporate farming once again echoed in the National Assembly on Monday with a PPP lawmaker warning that thrusting the Cholistan canal project would lead to a war between the federation and federating units.\n\nSpeaking on a point of order, Sharmila Farooqui of PPP said that moving ahead with the Cholistan canal project without addressing concerns of Sindh and Balochistan would be a great injustice with two smaller provinces.\n\nShe said that Sindh was already facing water shortage and taking away water would mean economic strangulation of poor farmers of Sindh.\n\nRejecting the argument that Punjab would provide more than 4000 cusec of water for the controversial project out of its share, she asked as to where would Punjab meet the shortfall.\n\nShe said the country received 40 per cent less rains during July-December, adding that Punjab would get water from Chashma-Jhelum link canal linking Indus River with Jhelum River, which would affect Sindh. She said that Sindh was already getting less water than its share.\n\nPPP lawmaker demands immediate CCI meeting to discuss the issue\n\nShe demanded the immediate convening of the Council of Common Interests (CCI) to discuss this vital issue and provide an opportunity to Sindh to voice its concerns at the constitutional forum. “You need to debate and discuss the issue,” she remarked.\n\nMs Farooqui also noted that the CCI has not met for the last 11 months in violation of Article 154 of the Constitution, adding that strong federating units guaranteed a strong federation.\n\nShe also said that Irsa member of Sindh was forced to give water availability report on behalf of the province to start the controversial water project.\n\nMs Farooqui said that following imposition of agriculture tax, the Cholistan canal project would further add to problems of growers in Sindh.\n\n“There is already a shortage of water in Sindh, particularly during non-flood season.’’ She also referred to the wheat scam which caused a huge loss to farmers.\n\nShe said that unlike PTI lawmakers who have been staging protest to secure release of an individual, the PPP wanted to raise concern of people on floor of the House.\n\nMian Khan Bugti of PML-N, speaking on a point of order, praised members of security forces for recovering two women who were abducted in Khazdar district of Balochistan.\n\n“We have complete confidence in our establishment, security forces who have been working for peace and development in the province,” the PML-N leader said.\n\nAasia Ishaque Siddiqui of MQM alleged manipulation in issuance of Sindh Urban domicile in order to give admissions to students of interior of Sindh.\n\nShe demanded an inquiry into issuance of Sindh Urban domiciles to students of interior of Sindh, which she said was a big injustice to urban population of the province.\n\nShe said that 100 students having double domiciles were admitted to medical colleges of Karachi, depriving urban students of their rights.\n\n“Previously our children were deprived of government jobs because of fake Sindh Urban domiciles issued to the youth of interior of Sindh,” she said.\n\nThe first session of the National Assembly after the first anniversary of general elections saw a noisy protest by PTI lawmakers who kept on chanting slogans demanding release of PTI founder Imran Khan.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/110934348d2d723.jpg",
  "retrievedAt": "2025-08-25T19:31:06.923Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891176/controversy-over-corporate-farming-echoes-in-na-again",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:51:24.000Z"
}
