{
  "title": "Past to the present - Newspaper - DAWN.COM",
  "author": null,
  "content": "IT’S been a year since the election, an election which sprung a surprise. And then those who yield power sprung an even bigger surprise.\n\nFrom the changing of results to the defanging of the judiciary to the laws to rein in social media, with internet disruptions and a semi-permanent ban on X thrown in, it would seem the events of Feb 8 have been addressed, resolved or countered — whichever word one wants to use. But those on the other side of the divide, particularly the PTI, would disagree; in their view the war is far from won and as they continue to push back, they believe victory is just around the corner.\n\nPerhaps it would be more accurate to say we face a stalemate, for there appears to be no end in sight to the tussle that broke out in 2022 or so. Those of us (this includes people on both ends of the divide) who expected the elections to provide closure have now been rid of their delusions. The results were ‘managed’ but the noise over this has not ended, adding to the nervousness of those in government.\n\nAs the one-year anniversary hit, more than a few took a trip down memory lane, beginning with Pattan’s election report and also news programmes that reminisced about last year’s transmissions. That this caused some concern is evident to those who got a rap on their knuckles — or more — for not having succumbed to amnesia.\n\nIndeed, the pressure on the media simply emphasises the ambiguity of the phrase that ‘power is power’. In reality, much power has to be exercised to prove that power is power. And hence, the arm-twisting continues — of the judiciary, the journalists, the politicians and ordinary people.\n\nIt has now been a year and a half that the state continues to use force — raids, kidnappings, arrests, excesses by law-enforcement personnel — to keep the opposition from mobilising. And for others who insist on being pesky, there is rapid rule-making — which is done by breaking all rules — such as passing the 26th Amendment or making changes to Peca. While this indicates strength to many, others interpret it as a sign of weakness.\n\nFor, none of these moves has been able to ensure capitulation and silence. Take the 26th Amendment — the judges continue to push back by writing letters, for instance. Then there are the lawyers’ associations, which continue to protest against interference in the judiciary. Whether or not, they are united enough to mobilise countrywide, their meetings and statements, like the letters by the judges, add to the perception that matters aren’t settled.\n\nIn reality, much power has to be exercised to prove that power is power.\n\nThe latest changes to Peca are no different. While initially the move was seen to have mobilised the media industry as a whole, the mainstream now simply wants the new restrictions and punitive measures to be used to ‘regulate’ social and digital media, as print and electronic platforms already have editorial controls. Even if the older media gets its way, the new laws will not be able to curb the noise on social media entirely. It’s far too big and far too diverse to now be put back into the box. Here too, the game will continue. Neither will the PTI stop agitating it seems.\n\nNone of this may change the balance of power but neither will it allow for any semblance of stability, which perhaps is key. Islamabad on Monday was a case in point, where an announced protest by lawyers had led to partial closure of roads and traffic jams.\n\nBut if history is any guide, the factors that will push the current set-up will be other than what has been described — the security situation, the economy and growing concerns about public opinion in Punjab.\n\nTake the first, security. Its worsening during the Musharraf years was a major reason for pressure on him to not just cede control but also allow the PPP space. In fact, Western officials who were closely involved in the deal between the PPP and Musharraf, were not averse to expressing the view that with the dictator’s ‘retirement’ from the military, Pakistan would get a full-time chief of army staff who would be able to focus on the terrorist threat.\n\nAccording to them, Musharraf was far too entangled in political affairs to make time to address the growing violence and that an alliance between him and the PPP would provide a progressive face to the government. In fact, much has been said by American officials in public about the transition that set in, in 2007. (However, it is worth pointing out that no outside power is interested in playing a role in ensuring any kind of a transition at the moment.)\n\nSimilarly, economics has also played a role historically in Pakistan’s politics. The country’s previous authoritarian stints have lasted as long as they have because they coincided with generous aid and other flows from the West. As the flows began to dry up or economic indicators grew weaker, the dictatorships gave way to civilian rule, however flawed. What we are witnessing at the moment is an anomaly in the sense that so far there is little sign of any financial flows that can shore up the economy. And this will to a large extent determine the duration of the authoritarianism being experienced.\n\nAnd third, which again historically has been of concern in allowing political players space is the growing anger of the populace of Punjab in particular. That this issue is already obvious; whether or not it will force a change is what remains unclear.\n\nIndeed, those who think the current state of affairs in unsustainable do so on the basis of how these three factors have played out historically in Pakistani political affairs. That they are factors at present is undeniable but whether they can and will have the same impact as in the past is what no one can be certain about. Not only is Pakistan a different country in many ways but so is the world in which it exists.\n\nThe writer is a journalist.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/02/67aabcba4bb88.jpg",
  "retrievedAt": "2025-08-25T19:30:26.007Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891213",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T02:58:59.000Z"
}
