{
  "title": "Five human traffickers arrested by FIA in Gujrat - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRAT: Five human traffickers, including two proclaimed offenders, have been arrested during an ongoing crackdown on human trafficking by the Federal Investigation Agency (FIA).\n\nMoreover, a deportee also arrived at Sialkot airport from Libya after his agents failed to send him to Italy.\n\nA spokesman for the FIA said Arshad Sulehria of Gogian, a resident of district Sialkot, was arrested for taking Rs450,000 for sending the complainant illegally to Italy.\n\nSimilarly, another Asif Javed, son of Muhammad Ismail, a resident of Kot Radha Kishan, Kasur, was arrested for taking Rs1.5m from the complainant to send him to Germany on an employment visa.\n\nYet another human trafficker, Tayyab Sohail Butt of Ferozewala Pul, Gujranwala, was arrested for taking an amount of Rs4.5m from a man to send him to the UK.\n\nMeanwhile, at the Sialkot airport, a passenger, namely Haroon Jameel, son of Muhammad Jamil of Wazirabad, arrived from Libya and he had a passport with the name Rehman Ali.\n\nIt transpired during interrogation that he was travelling on another person’s passport arranged by a Libyan agent. Jamil’s uncle dealt with agent Mian Rehman, son of Allah Rakha, a resident of Tajpura, Lahore, for sending him illegally to Italy after taking Rs2.5m. However, the agent sent Jamil to Libya and failed to send him to Italy.\n\nJamil contacted another agent, Raja Muhammad Zafar, a resident of Dumeli, Jhelum, to reach back to Pakistan and Zafar took another amount of Rs2.3m from him but did not help him reach Pakistan.\n\nOn arrival from Libya, the immigration authorities sent him to the anti-human trafficking cell of FIA Gujranwala.\n\nAnother agent, Muhammad Faizan, son of Muhammad Farooq of Walton Road Lahore, was arrested for taking Rs 600,000 from a complainant for sending his son to Malaysia for employment.\n\nPublished in Dawn, February 11th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T19:30:37.455Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1891121/five-human-traffickers-arrested-by-fia-in-gujrat",
  "dateList": "2025-02-11",
  "date_published": "2025-02-11T01:53:13.000Z"
}
