{
  "title": "PHC bans glacial ice harvesting, seeks reports from DCs - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: Peshawar High Court on Tuesday temporarily banned illegal harvesting and commercial exploitation of glacial ice in Hazara and Malakand regions and sought reports from relevant deputy commissioners on the matter.\n\nA bench consisting of Justice Ijaz Anwar and Justice Wiqar Ahmad directed the provincial government and deputy commissioners of the relevant districts to ensure that the said practice did not take place.\n\nThe bench issued the order in a petition seeking an immediate crackdown on illegal harvesting and commercial exploitation of glacial ice in Hazara and Malakand regions of the province.\n\nThe petition is field by a lawyer, Tariq Afghan, who is also an environmentalist. He has sought court’s orders for KP Environmental Protection Agency to conduct a thorough investigation into the matter to identify culprits for legal action.\n\nPetitioner claims commercial exploitation of glaciers posing threat to environment\n\nHe also prayed the court to direct the respondents including EPA, provincial government, and deputy commissioners to strictly enforce laws and regulations on environmental protection to prevent illegal glacier cutting for commercial purposes.\n\nThe petitioner sought court’s orders for federal and provincial governments to enact special laws to conserve glaciers. Advocate Sajeed Khan Afridi appeared before the court along with the petitioner and insisted that it was a petition of public interest.\n\nHe said that his client learned about the illegal harvesting of glacial ice for commercial purposes, an activity that posed a serious threat to environment, biodiversity and lives of people, who got water from it.\n\nThe lawyer said that on June 14, 2024, the petitioner submitted a detailed complaint to the EPA director-general about that illegal activity and sought immediate action.\n\nHe, however, complained that despite a lapse of considerable time, EPA neither took any substantial action to address the issue nor did it inform the petitioner about progress on his complaint.\n\nThe additional advocate general, Syed Sikander Hayat Shah, said that he had submitted a report on behalf of the department of climate change, environment and wildlife according to which glacier harvesting couldn’t be carried out by people.\n\nHe stated that as glaciers were located thousands of feet above sea level, accessing the same for harvesting was almost impossible.\n\nHowever, Tariq Afghan contended that he belonged to one of the affected areas. He said that people involved in the illegal business had been extracting ice from glaciers at lower level.\n\nHe said that people cut glaciers from the bottom and with rise in temperature it also caused floods, devastating downstream areas.\n\nDuring course of hearing Justice Ijaz Anwar expressed dismay over the situation observing that relevant officials had failed to save agriculture land from floods.\n\nThe bench observed that the government must act now as those glaciers offered natural beauty and if left untouched people would enjoy them more.\n\nMoreover, Justice Wiqar Ahmad also observed that the government should have imposed ban on the illegal practice. The bench wondered as to why the government didn’t monitor glaciers removal the way it controlled tree cutting.\n\nSajeed Afridi contended that glacier cutting was a violation of Pakistan Environmental Protection Act, 1997, KP Environmental Protection Act, 2014, and national and provincial climate change policies.\n\n“KP is home to around 3,050 glaciers, primarily located in its northern regions. Certain groups are involved in unauthorised extraction of glacial ice for commercial purposes and its transportation in large blocks,” he said.\n\nThe counsel said that Pakistan was a signatory to Paris Agreement and Convention on Biological Diversity and several other international agreements for the protection of ecosystem, which made it binding on the country to protect its reserves of glaciers.\n\nPublished in Dawn, May 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:55:42.376Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908903/phc-bans-glacial-ice-harvesting-seeks-reports-from-dcs",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T00:38:38.000Z"
}
