{
  "title": "Livestream curbs persist as NA holds ‘sensitive debate’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Official says livestream stopped due to prevailing India-Pakistan tensions\n• Omar Ayub complains to speaker about his speeches being censored\n• Ayaz Sadiq asserts his right to expunge remarks ‘in the House and in chambers’\n\nISLAMABAD: National Assembly pro­­ceedings were not broadcast live on its official social media platforms for a second consecutive day, on Tuesday, as the House continued a discussion on tensions with India following the Pahalgam attack.\n\nBut when Leader of the Opposition Omar Ayub Khan raised the issue of his speech being censored, Speaker Ayaz Sadiq asserted his authority, saying he had the right to expunge anything deemed “against national interest”.\n\nThe proceedings were not live-stre­amed on the NA’s official YouTube and Facebook channels, while PTV aired speeches from the treasury benches only.\n\nWhen contacted for comment, a senior National Assembly Secretariat official said that live-streaming of parliamentary proceedings had been stopped on social media in view of the sensitivity of the prevailing situation between Pakistan and India, adding that the live-stream would resume soon.\n\nOn Monday, the opening speech of the opposition leader on the state of India-Pakistan relations, a walkout staged by JUI-F chief Maulana Fazlur Rehman, as well as speeches by other opposition lawmakers, were not televised on PTV.\n\nThough censorship of “objectionable parts” of opposition lawmakers’ spee­ches has become something of a norm, a complete blackout of proceedings during debate on an important issue is quite unprecedented.\n\nThe NA’s media wing usually shares the link of the live broadcast, via social media channels, with reporters through a WhatsApp group. However, this practice has not been witnessed for the past two days.\n\nOmar Ayub also raised the issue of censorship in the National Assembly on Tuesday, but only to the extent of his own speech.\n\nAt the outset of proceedings on Tuesday, he regretted that his speech was not live-streamed. He said that his entire speech was based on facts, adding “We pointed out again and again — you can check your record — that there was no live feed…”.\n\n“Let us know if somebody does not like our voice,” he remarked. He said he also sought a copy of his speech from the NA staff, which was not provided. He also talked about pressure on his staff and said that he has to type all his correspondence himself.\n\nIn response, NA Speaker Ayaz Sadiq said his speech was shown on closed-circuit TVs in the entire NA Secretariat.\n\nHowever, the speaker asserted his authority to expunge anything he deemed to be against the national interest. In view of the responsibility of the chair, he said, he would rather delete anything that was inappropriate in his opinion. “You will get a copy of the rest of your speech”, the speaker told the opposition leader.\n\nMr Sadiq also said that he would review all the speeches and then decide which parts should be deleted. “I can expunge remarks during the proceedings, as well as in the chamber,” he said.\n\nTalking about the concerns raised by Mr Ayub over his staff, the speaker said: “Rest assured, if they do your work and somebody tries to harass or stop them, I will take the responsibility.”\n\nIn a separate letter to the NA speaker, Omar Ayub complained, “Despite your ruling and personal commitment made on the floor of the House, my speech was, in fact, blocked, censored, and the continuity of parliamentary proceedings and debate was deliberately interrupted by the Media and Photography Wing of the NA”.\n\nHe complained his request for access to the official audio and video recordings of his speech from the NA general media and photography wing were denied without any lawful justification, “even though no portion of the speech was ordered to be expunged by the Chair”.\n\nPublished in Dawn, May 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:55:47.171Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908955/livestream-curbs-persist-as-na-holds-sensitive-debate",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T00:37:43.000Z"
}
