{
  "title": "Automakers’ help sought for balanced tariffs - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Ministry of Industries and Production has requested assistance from the auto sector to develop a tariff structure that balances the needs of the auto industry with the conditions set by the International Monetary Fund.\n\nA high-level meeting took place on Tuesday between Haroon Akhtar Khan, the Special Assistant to the Prime Minister, and representatives from the Pakistan Automotive Manufacturers Association (PAMA).\n\nMr Akhtar assured the automotive manufacturers that the government was fully aware of their difficulties and would continue to stand by them.\n\nHe reaffirmed the government’s commitment to supporting local manufacturers and emphasised the importance of boosting the automotive sector.\n\nHe further highlighted that the prime minister’s vision focuses on providing incentives for the promotion of electric vehicles and assured the manufacturers that every possible step would be taken to promote the sector and ensure its gro­wth. He also stressed that the vision aims at long-term sustainability and development, ensuring that all the challenges faced by automotive manufacturers wou­ld eventually be addressed and resolved.\n\nAs the automotive industry advocates for implementing a cascading tariff structure to protect local manufacturers and promote sustainable growth, the association will present its proposals within two weeks.\n\nPAMA members raised several issues regarding the upcoming New Energy Vehicle (NEV) policy, highlighting that the draft policy allowed the import of Completely Built Units (CBUs) at a reduced duty structure compared to the Completely Knocked Down (CKD) kits.\n\nThere was a consensus that a balanced approach to imposing higher duties on fully built imported vehicles while maintaining lower tariffs on raw materials and components was needed to encourage local assembly and production.\n\nKey automotive manufacturers, inclu­ding Honda, Toyota, Suzuki, Kia, Hyun­dai, Yutong, and Sazgar attended the meeting.\n\nIssues related to the automotive sector were discussed, including tariff rates, the upcoming budget, regulatory duties, and long-term policies related to EVs, HEVs, and the NEV policy.\n\nPublished in Dawn, May 7th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/07115023b798dfd.jpg",
  "retrievedAt": "2025-08-23T08:18:46.026Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1908993/automakers-help-sought-for-balanced-tariffs",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T00:37:50.000Z"
}
