{
  "title": "PSX bleeds as fears of Indian military action come true - World - DAWN.COM",
  "author": null,
  "content": "The Pakistan Stock Exchange (PSX) on Wednesday witnessed yet another bloodbath this year — tumbling by over 3,500 points — as investors’ fears of a military action by India against Pakistan came true last night.\n\nThe Pakistani military brought down five Indian jets in retaliation for late-night strikes launched by its neighbouring country at six sites in Punjab and Azad Jammu and Kashmir.\n\nThe benchmark KSE-100 index decreased by 6,560.82 points (5.78pc) to stand at 107,007.68 from the last close of 113,568.50 when the market opened at 9:30am.\n\nDue to the massive dip, the market was immediately suspended briefly.\n\nThis marked the second-largest intra-day plunge (points-wise), ranking next to the nearly 8,700-point loss that followed the United States’ tariff announcement last month.\n\nHowever, the market started recovering slightly, reaching 112,457.37 points at around 10:34am, before closing at 110,009.02 points — 3,559.48 points (3.13pc) below yesterday’s close.\n\n“The market opened under pressure today following Indian strikes on unarmed civilians in Pakistan,” said Yousuf M. Farooq, research director at Chase Securities.\n\n“Some selling has been observed, though volumes remain low as investors assess the evolving situation,” Farooq said, adding that recovery was expected once tensions begin to de-escalate.\n\nShahbaz Ashraf, chief investment officer at Frim Ventures, also attributed the sell-off to “heightened geopolitical tensions following reports of Indian strikes on multiple Pakistani locations”.\n\n“The flare-up has rattled investor sentiment, with fears of further escalation weighing on the market,” he said. However, Shahbaz added, analysts remained “cautiously optimistic, hoping the conflict will remain short-lived with likely mediation from global powers”.\n\n“Importantly, with macroeconomic indicators showing signs of recovery, market watchers believe this correction could be temporary. Many view the pullback as a potential buying opportunity, especially for long-term investors looking to accumulate quality stocks at lower valuations,” he noted, explaining the gains witnessed later.\n\nSamiullah Tariq, head of research at Pak Kuwait Investment Company Ltd, said the impact of today’s selling pressure would be short-term and the market would “recover once this ends”.\n\nAwais Ashraf, research director at AKD Securities, also observed that the PSX was “feeling the impact” of last night’s developments.\n\nEchoing Shahbaz’s opinion, Awais said the plunge “may present a buying opportunity, as we do not expect the situation to escalate further”.\n\n“The conflict between India and Pakistan has escalated dangerously,” said Sakib Sherani, economist and head of Macro Economic Insights, adding that India’s request to the International Monetary Fund earlier this week to review loans disbursed to Pakistan was adding to Islamabad’s woes.\n\n“All these actions will hurt Pakistan’s fragile economic recovery.”\n\n“Reports of the IMF programme being affected purely because of representations by one country on the board of the IMF are overblown,” said former State Bank of Pakistan chief, Reza Baqir.\n\n“A longer-term conflict is in neither country’s interest,” he stressed.\n\nIn the past few days, panicky investors have continued to reduce their holdings as Pakistan had expressed a heightened possibility of a military action by India in the wake of the latter’s allegations regarding a deadly attack in occupied Kashmir.\n\nThe April 22 attack in Pahalgam killed 26 people, mostly tourists, in one of the deadliest assaults since 2000. India, without investigation or evidence, implied “cross-border linkages” of the att­a­­­c­kers. Pakistan has firmly rejected the claim and called for a neutral probe.\n\nInternational rating agency Moody’s has warned that sustained India-Pakistan tensions could negatively affect Pakistan’s growth.\n\nIt also said that escalating tensions could cause a setback to nascent macroeconomic stability and also disrupt Pakistan’s access to foreign funding flows.\n\nOn the other hand, Moody’s noted that macroeconomic conditions in India would remain stable. However, it did stress that higher defence spending could impact India’s “fiscal strength and slow its fiscal consolidation”.\n\n“The reliance of Pakistan on external capital inflow — in recovery from an external account crisis, in the midst of an IMF programme, and with under three months of import cover compared to over nine months in India — makes its asset prices much more sensitive to any conflict than those in India,” said Hasnain Malik at Tellimer in Dubai, Reuters reported.\n\nPakistan’s finance ministry said it had held an emergency meeting to review market resilience and national financial security, adding that robust measures to safeguard economic infrastructure and provide clarity and confidence to markets are being implemented.\n\nMeanwhile, India’s equity benchmarks ended with little change, coming off early losses, as rising geopolitical tension between India and Pakistan offset expectations of easing global trade tensions.\n\nThe benchmark Nifty 50 and Sensex closed 0.1pc higher each at 24,414.4 and 80,746.78, respectively. The 50-stock index had opened 0.6pc lower, while the Sensex had slipped 0.9pc at open.\n\nEleven of the 13 major sectors logged gains.\n\nVolatility in Indian shares .NIFVIX, which has risen in eight out of the 10 trading sessions since the Pahalgam attack, was hovering near a three-week high.\n\nIndia’s top two stock exchanges, the National Stock Exchange and the Bombay Stock Exchange temporarily restricted access to their websites for overseas users, Reuters reported, citing sources.\n\nHowever, the ability of overseas investors to trade on Indian markets remained unaffected.\n\n“Investors were taking short positions in the market in anticipation of an Indian retaliation. Now that the news is out, they are covering those positions,” said Dharmesh Kant, head of equity research at Cholamandalam Securities.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/05/07120119b1e7724.png",
  "retrievedAt": "2025-08-23T08:18:32.965Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1909071/psx-bleeds-as-fears-of-indian-military-action-come-true",
  "dateList": "2025-05-07",
  "date_published": "2025-05-07T07:33:15.000Z"
}
