{
  "title": "Qadir directs to step up surveillance to check monkeypox suspected cases",
  "link": "https://www.app.com.pk/national/qadir-directs-to-step-up-surveillance-to-check-monkeypox-suspected-cases/",
  "date_published": "2022-07-24T15:31:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 24 (APP): Minister for Health Abdul Qadir Patel on Sunday said that the government decided to increase surveillance in the country in view of the WHO’s statement, declaring the monkeypox outbreak a global health emergency.\n“All the national and provincial health authorities have been advised to remain on high alert for any suspected case of monkeypox as the government has started taking effective measures to prevent the disease,” the minister said in a statement.\nHe said that the recommendations on the basis of international health regulations will be fully implemented in the country. The government would continue its work as per the guidelines of WHO, the added.\nThe minister said that instructions had been issued to stakeholders, especially border health services of the Central Health Establishment for strict monitoring at all points of entry in the country.\nHe said that an effective monitoring mechanism had been developed on a scientific basis at all points of entry. The screening of all incoming passengers will be ensured particularly passengers coming from African countries, he added.\nPatel said that instructions had also been issued for strong coordination among concerned organizations while steps were being taken for awareness of the public. The role of health workers was important in this regard, he added.\nAccording to the spokesperson of the Ministry of National Health Services, the situation is being closely monitored by the health authorities and as per the report, no case of monkeypox has yet been diagnosed in Pakistan.\nHe said that the minister for Health had also directed the National Command and Operation Centre (NCOC) to ensure regular monitoring of the monkeypox situation in the country alongwith the Covid-19.\nMonkeypox is a rare viral zoonotic disease that is caused by infection with the monkeypox virus. Although the natural reservoir of monkeypox remains unknown, African rodents and non-human primates like monkeys may harbor the virus and infect people.\nThe patient develops a rash within one to three days after the appearance of fever, often beginning on the face and then spreading to other parts of the body. Other symptoms include headache, muscle aches, exhaustion, and lymphadenopathy.\nThe incubation period is usually seven to 14 days but can range from five to 21 days. The illness typically lasts for two to four weeks.\nThe transmission occurs via contact with an infected animal, human, or materials contaminated with the virus. The virus enters the body through broken skin, respiratory track, or mucous membranes like eyes, nose, or mouth.\nOther human-to-human methods of transmission include direct or indirect contact with body fluids, lesion materials, or through contaminated clothing or lines.",
  "retrievedAt": "2025-08-11T15:17:14.618Z"
}
