{
  "title": "Kashmir Council -EU’s Chief Ali Raza Syed expresses solidarity with Yasin Malik",
  "link": "https://www.app.com.pk/national/kashmir-council-eus-chief-ali-raza-syed-expresses-solidarity-with-yasin-malik/",
  "date_published": "2022-07-24T12:31:00.000Z",
  "source": "APP",
  "content": "MIRPUR ( AJK) : Jul 24 (APP): Chairman Kashmir Council Europe (KC-EU) Ali Raza Syed has expressed solidarity with Chairman Jammu and Kashmir Liberation Front (JKLF) Yasin Malik who is on an hunger strike in the India’s notorious Tihar jail.\nYasin Malik was sentenced to life imprisonment by an Indian court on May 25 this year on the fake charges against him.\nIn a statement issued on Sunday Ali Raza Syed said that Yasin Malik who is deprived of all legal, constitutional and fundamental rights and even denied of the fair judicial trial by the Indian government, is currently battling for life in the Indian prison, says a message released to the media here Sunday evening.\nYasin Malik started his hunger strike on Friday morning against the denial of justice and fair trial to him by the Indian kangaroo courts.\nAs per a JKLF statement, Yasin Malik had written to the Indian government for a physical appearance before the court in order to response to the false cases registered against him. He also requested for cross examination of witnesses himself and said that he would sit on hunger strike if his request was not accepted by the Indian government.\nChair of KC-EU Ali Raza Syed urged the International community including United Nations and international human rights organizations to pressurize India to accept legal demands of Yasin Malik sitting on the hunger strike.\nAli Raza Syed asked the international community including European Authorities to use their good office to pressurize India for early and unconditioned release of Yasin Maliik.Chair of KC-RU also called for unconditional release of rights activists including Khurram Parvez and Mohammad Ahsan Unto, Kashmiri Journalists and as well as the Kashmiri political activists detained in the Indian prison.\nThese Kashmiri figures remain in detention under the Unlawful Activities Prevention Act (UAPA) in Tihar, the one of the most overcrowded and unsanitary prisons in the country for raising rights violations in Indian-administered Kashmir.\nKC-EU has already launched a campaign in Europe for release of the Kashmiri prisoners a few months ago.\nAli Raza Syed said, these Kashmiri figures are detained because they always helped the people of Kashmir in raising their voices against the Indian brutalism in occupied Kashmir particularly they highlighted the terrible incidents of Indian state terrorism in the occupied Jammu and Kashmir.\nChair of KC-EU said, India can not achieve its evil objectives including concealing war crimes and inhuman acts in occupied land of Jammu and Kashmir.\nHe added, people of Kashmir offered their sacrifices for the right to self determination and would not compromise on this basic political right.\nAli Raza Syed further said, day of 5th August is also upcoming soon as the Modi government revoked special status of Jammu and Kashmir on 5th of August 2019. And 15th of August is also falling very soon as it is independence day of India but the people of Kashmir are deprived of the independence. The day would be celebrated by the people of Kashmir as the black day.\nHe said, we shall continue to expose the nasty and immoral appearance of the Modi- regime involved in the crimes against humanity in Jammu and Kashmir, the message said.",
  "retrievedAt": "2025-08-11T15:17:17.283Z"
}
