{
  "title": "PCHR holds dialogue on journalist protection, UNHR framework",
  "link": "https://www.app.com.pk/national/pchr-holds-dialogue-on-journalist-protection-unhr-framework/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): Parliamentarians Commission for Human Rights (PCHR), in collaboration with the Initiative for Digital and Media Freedoms (IMDF) and with support from the European Union (EU), hosted a consultation session titled “UN Human Rights Instruments and Processes: Strengthening Advocacy for Media Freedom and Journalists’ Safety” here on Thursday.\n\nThe aim was to build capacity for effective engagement with UN human rights mechanisms, foster collaboration among stakeholders, and strengthen advocacy for press freedom and journalist safety in Pakistan.\n\nProminent dignitaries included Shafique Chaudhry, Executive Director, PCHR, Sehar Kamran, Member of the National Assembly of Pakistan; Kamal Uddin Tippu (Retd. IG), Chairperson of the Journalist Protection Commission; Arif, Director, Ministry of Human Rights (MOHR); Zaffarullah Khan, former Executive Director of PIPS; Afzal Butt, President of PFUJ; Nayyar Ali, Secretary of NPC; Iqbal Khattak, Executive Director of Freedom Network; Aftab Alam, Executive Director of IRADA; Tariq Virk, President of RIUJ; along with journalists and representatives of civil society organizations.\n\nED of PCHR Shafeeq Chaudhary welcomed the esteemed guests and gave the opening remarks. He remarked that there was a deep connection between Journalist Safety and Freedom of Expression and both correlate with each other.\n\n“UN human rights instruments and processes can be useful in navigating media freedom and safety of journalists,” he added.\n\nProject Cordinator Huma Kashif gave the detailed introduction of UN Treaty Bodies, Universal Periodic Reveiw (UPR) and Special Procedures and its importance in addressing the humanitarian issues.\n\nIn her address, MNA Sehar Kamran expressed gratitute to the collaborators for holding a session on this very important topic.\n\nShe urged that journalists safety should be ensured at the government level. They should be given liberty to report genuine issues without any fear. She emphasized the need for cross-sectoral collaboration to uphold press freedom and civil liberties.\n\nIn his address, President of PFUJ Afzal Butt appreciated the collaborators efforts for organizing the session on this very crucial topic. He expressed concern that media was facing so many challenges including job insecurity among others. He said that job protection of journalists should be prioritized and this issues should be raised at every important forum, civil societies too should involve in the process.\n\nThe event brought together Journalists, Parliamentarians, Human rights Activists, Civil Society, advocates among others.\n\nOpen discussion and way forward was also discussed at the conclusion of the session.",
  "retrievedAt": "2025-08-10T10:23:00.939Z"
}
