{
  "title": "Govt adopts multi-dimensional strategy to curb inflation: NA told",
  "link": "https://www.app.com.pk/national/govt-adopts-multi-dimensional-strategy-to-curb-inflation-na-told/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP):Minister of State for Finance and Revenue Bilal Azhar Kayani on Thursday told the National Assembly that the government has adopted a multi-dimensional strategy to curb inflation, restore real wages to 2017 levels, and ease the financial burden on low-income citizens through targeted relief measures.\n\nResponding to a question raised by Dr Mahreen Razzaq Bhutto, he acknowledged that inflation had significantly eroded the purchasing power of the average Pakistani. “We understand that this is one of the most pressing issues for citizens and a fundamental benchmark for assessing our economic policies,” Kayani said.\n\nAccording to the written reply submitted to the House, the government stated that  inflation had dropped substantially from 23.4% in FY2024 to 4.5% in FY2025. Inflation for July FY2026 stood at 4.1%, compared to 11.1% during the same month last year. The reply outlined key budgetary measures taken at the federal level, including a 10% ad-hoc salary increase for civil servants, a 7% pension rise, no new income taxes, and targeted subsidies for utility bills and the Benazir Income Support Programme (BISP), which has been expanded to Rs716 billion.\n\nThe government also highlighted its efforts to improve labor productivity through skill development, vocational training, digitization, entrepreneurship promotion, investment in capital goods, and formalization of labor. “Formal firms tend to pay higher and more regular wages,” the reply noted, adding that stronger employment elasticity tied to GDP growth would also support wage recovery.\n\nIn her remarks, Dr Bhutto appreciated the remedial measures but questioned their practical impact on the ground. “Despite these steps, I see no meaningful improvement in real incomes. If the government claims real wages are improving, in which sectors is that visible? Eleven crore Pakistanis still live below the poverty line,” she stated. She also criticized the reliance on consumption-based taxes like fuel levies, arguing that such measures disproportionately affect the poorest citizens.\n\nKayani, in his response, emphasized that inflation control is only one part of the broader strategy. “Real purchasing power improves when both inflation is contained and employment opportunities expand. With a stable macroeconomic environment, we’ve regained international confidence—rating agencies like Fitch, S&P, and Moody’s have upgraded our outlook,” he said.\n\nHe further noted that the policy rate has declined from 22% as inflation came under control, enabling a revival in business activity. He pointed out that one crore families benefit from BISP and that those earning up to Rs 600,000 annually are exempt from income tax, easing the burden on low-income groups.\n\nOther members, including Mirza Ikhtiar Baig and Sahibzada Sibqhatullah, also questioned the government’s plans regarding industrial competitiveness, utility store layoffs, and the long-standing issue of implementing minimum wage laws. Mirza Ikhtiar Baig urged the government to fulfill its promise of reducing electricity rates by 8 to 9 cents per unit to support textile exporters and revive industrial operations in Faisalabad and other hubs.\n\nIn reply, Kayani reiterated that while economic conditions remain challenging, there has been significant progress. “We are not claiming everything is perfect, but prices are stabilizing, business sentiment is improving, and our policies are targeted toward the most vulnerable,” he stated.\n\nThe National Assembly told that a chart of real wages since 2016, showing that despite increases in nominal pay, real wages for painters, masons, and laborers have declined over time due to high inflation—underscoring the need for continued policy reforms.\n\nParliamentarians further raised concerns about the lack of representation in planning development schemes under PSDP. In response, the government clarified that allocations are made through an established framework under the Public Investment Management Act 2019 and reviewed by standing committees, which include representatives from all parties.",
  "retrievedAt": "2025-08-10T10:24:03.846Z"
}
