{
  "title": "Islamabad lawmakers join hands with CDA to fast-track citywide development",
  "link": "https://www.app.com.pk/national/islamabad-lawmakers-join-hands-with-cda-to-fast-track-citywide-development/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 07 (APP): A high-level delegation of the city’s parliamentarians met with CDA Chairman and Chief Commissioner Muhammad Ali Randhawa on Thursday to address Islamabad’s urban and rural challenges.\n\nThe meeting focused on accelerating infrastructure projects, improving civic services, and strengthening collaboration to enhance the quality of life for residents across the capital.\n\nThe delegation included Federal Minister for Parliamentary Affairs Dr. Tariq Fazal Chaudhry, Chairman of the National Assembly Standing Committee on Interior and Narcotics Raja Khurram Shahzad Nawaz, and MNA Anjum Aqeel Khan.\n\nSenior officials and board members of the Capital Development Authority (CDA) were also present.\n\nVideo Player\n\nMedia error: Format(s) not supported or source(s) not found\n\nDownload File: https://www.app.com.pk/wp-content/uploads/2025/08/WhatsApp-Video-2025-08-07-at-9.24.33-PM.mp4?_=1\n00:00\n00:00\n00:00\nUse Up/Down Arrow keys to increase or decrease volume.\n\nChairman Randhawa welcomed the lawmakers and underscored the importance of working in sync with elected representatives to resolve civic issues more effectively.\n\n“The role of Islamabad’s parliamentarians is vital in guiding ongoing development projects and ensuring balanced progress in both urban and rural areas,” Randhawa said.\n\nLawmakers praised the CDA’s development initiatives under Randhawa’s leadership and pledged full support for efforts aimed at improving infrastructure, beautification, and welfare services. They also offered suggestions to tackle persistent civic problems.\n\nThe meeting covered a broad agenda, including the beautification of the Islamabad Expressway, where officials discussed enhancing green belts through focused horticultural efforts.\n\nDevelopment of sports and recreational facilities under Corporate Social Responsibility (CSR) was also highlighted, with the Director General Environment appointed as the focal person to oversee the better use of parks, green areas, and open spaces.\n\nInfrastructure upgrades featured prominently in the talks. These included the construction and renovation of major highways, the installation of permanent and decorative lighting in various sectors, and the creation of new parks alongside the improvement of existing ones.\n\nPublic transport improvements were also discussed, particularly the expansion of electric bus services.\n\nParliamentarians emphasized the success of the existing fleet and recommended expanding the routes.\n\nRandhawa assured them that a comprehensive review would be undertaken to align services with commuter needs.\n\nThe meeting also addressed critical issues related to water and sewage.\n\nThe CDA briefed lawmakers on the recent establishment of the Islamabad Water Authority, a step aimed at managing the city’s water resources more effectively.\n\nThe delegation was also informed of plans to identify and allocate land for new graveyards in response to the capital’s growing population.\n\nParticipants received updates on the CDA’s ongoing crackdown against illegal constructions and encroachments, which are being jointly undertaken with the Islamabad Capital Territory (ICT) administration.\n\nRandhawa highlighted that these operations are being carried out without discrimination, with a focus on restoring public spaces and enhancing the city’s green cover through tree planting.\n\nAnother key highlight of the session was the CDA’s transition toward a cashless and paperless administrative system.\n\nChairman Randhawa said that efforts are underway to fully digitize internal processes to promote transparency, accountability, and efficiency in public service delivery.\n\n“All possible efforts will be made to ensure timely completion of ongoing projects, with strict adherence to legal requirements,” Randhawa assured the delegation.\n\nThe meeting concluded with a unanimous decision to establish a formal follow-up mechanism, which will enable regular monitoring of development progress and ensure the timely resolution of issues faced by Islamabad’s residents.",
  "retrievedAt": "2025-08-10T10:22:21.905Z"
}
