{
  "title": "WB Mission reviews progress on SRP, SFERP",
  "link": "https://www.app.com.pk/national/wb-mission-reviews-progress-on-srp-sferp/",
  "date_published": "2024-05-29T12:23:00.000Z",
  "source": "APP",
  "content": "KARACHI, May 29 (APP): A World Bank Mission has noted with satisfaction that the possibility of flood from Manchhar Lake has been substantially reduced by 70% due to the increased number of discharge gates from 5 to 12 at the Aral Wah head regulator which would help in enhancing the discharge from 12,000 cusecs to 52,000 and would help to bring the level of lake down from two inches to one foot in twenty-four hours.\nAccording to a spokesman of the Sindh Flood Emergency Rehabilitation Project (SFERP), the WB team was informed on Wednesday that the level of embankment has also been raised by another two feet throughout its stretch of 30 kms which is also widened from twenty feet to thirty feet.\nThe World Bank mission is here in Karachi on three days visit to review the progress on two ongoing projects, the Sindh Resilience Project and Sindh Flood Emergency Rehabilitation Project, funded by the Bank and this first meeting was held with PIU irrigation component officials to review the activities undertaken so far.\nThe mission comprises Ahsen Tehsin, Rehan Hyder and Nihan Rafique of the World Bank while Project Director Javed Memon and Zahid Sheikh attended the meeting from SFERP.\nSindh Flood Emergency Rehabilitation Project is dealing with the damages caused by the floods of 2022 and has undertaken rehabilitation activities to normalize daily life in flood-hit areas. The meeting was informed that 11 small dams have been built in areas surrounding Karachi to control the urban flooding in Karachi under this project.\nThree pumping stations have been rehabilitated in the Khairpur district for disposal of stagnant water causing an unhealthy environment. Another stormwater drain is constructed at Shaheed Benazirabad town to avoid flooding of the area due to rains.\nThe meeting was also informed that the Sindh Resilience Project (SRP) has so far been able to build 70 small dams in the drought-hit areas of Sindh for the provision of drinking water as well as for irrigation purposes leading to the harvest of bumper agricultural produce in areas like Thar where it has helped the local population to have two crops in a year bringing an overall change in the socio-economic fabric by raising their living standards.\nThe impact assessment study of building these small dams is being done by Mehran University which will be completed by August 31, 2024. The SRP is scheduled for official closing on 30th June 2024.\nThe meeting also reviewed the utilization of funds under both projects and found out that funds allocated for the activities have been fully utilized transparently.",
  "retrievedAt": "2025-08-11T02:48:35.990Z"
}
