{
  "title": "SPA triumphs at Arab Media Excellence Awards 2024 in digital media category",
  "link": "https://www.app.com.pk/national/spa-triumphs-at-arab-media-excellence-awards-2024-in-digital-media-category/",
  "date_published": "2024-05-29T18:21:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP): The Saudi Press Agency (SPA) was awarded the 2024 Arab Media Excellence Award in the “Crisis, Disaster, and Risk Media” category during its eighth edition on Wednesday.\nPresident of SPA Dr. Fahd bin Hassan Al Aqran received the award on the sidelines of the 54th session of the Council of Arab Information Ministers in Manama. The session was attended by Information Ministers of Arab countries and heads of federations and organizations affiliated with the Arab League.\nSPA clinched the prestigious Arab Media Excellence Award 2024 in the digital media category with its winning entry, an investigative report titled “King Salman Humanitarian Aid and Relief Center works to deliver aid to Gaza Strip within three priorities: food, shelter, and health,” recognized within the “Crisis, Disaster, and Risk Media” field.\nThe award’s General Secretariat received over 100 entries spanning television, radio, newspaper, and digital media works. There were 48 entries in the television category, 24 in radio, 7 in written journalism, and 9 in digital media. Additionally, 3 individuals and institutions were nominated for honours.\nLaunched in 2015 by the Council of Arab Information Ministers, the award aims to foster creativity, innovation, and media excellence. It targets government and accredited media institutions, Arab organizations, federations with observer status within the Arab League, and leading media personalities.\nThe award seeks to spotlight distinguished media models in the Arab world and provide quality media content that benefits Arab society and serves its causes.\nSPA’s triumph at the 2024 Arab Media Excellence Awards serves as a testament to its exceptional performance across various aspects, including editing, photography, and digital media contributions. This recognition extends to its network of offices and correspondents within the Kingdom and abroad.",
  "retrievedAt": "2025-08-11T02:48:06.493Z"
}
