{
  "title": "Edu ministry shows serious concerns over schools destruction in merged districts of KP",
  "link": "https://www.app.com.pk/national/edu-ministry-shows-serious-concerns-over-schools-destruction-in-merged-districts-of-kp/",
  "date_published": "2024-05-29T09:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP):Ministry of Federal Education and Professional Training has drawn the urgent attention of Chief Secretary Khyber Pakhtunkhwa (KP) Peshawar regarding the destruction of schools by terrorists in newly merged districts and demanded prompt action against the menace of terrorism.\nIn a letter written to the Chief Secretary KP, the Federal Secretary Ministry of Federal Education and Professional Training has expressed grave concern over the recent incidents of destruction of schools in the newly merged districts of Khyber Pakhtunkhwa.\n“It is particularly disheartening to note that these heinous acts of terrorism are disproportionately targeting institutions dedicated to girls’ education,” the letter said.\nThe federal government is deeply alarmed by these developments, which not only endanger the lives of our children but also threaten the progress we have made in promoting education and gender equality in these regions, it said adding that the education of girls is a cornerstone of our national development strategy, and any attack on this front is an attack on the future of our nation.\n“I want to reassure you that the federal government stands in solidarity with the provincial administration of Khyber Pakhtunkhwa during this challenging time. We are fully committed to supporting all necessary measures to ensure the security of educational institutions and to swiftly rebuild the schools that have been destroyed. It is imperative that we work together to counter this menace of extremism and restore a sense of safety and normalcy for our students and educators” the letter added.\nTo this end, the letter said, I propose the establishment of a joint task force comprising federal and provincial representatives to develop a comprehensive plan for the reconstruction of damaged schools and the enhancement of security measures across the region.\nThe letter also added that this task force should focus on community engagement and resilience-building to prevent further extremist activities and to foster an environment where education can thrive without fear.\n“Please be assured of our unwavering support and cooperation. Together, we can and must ensure that the right to education, particularly for our girls, is protected and promoted, despite the challenges posed by extremist elements. I look forward to your prompt response and to working closely with your office to address this critical issue” it concluded.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:48:59.402Z"
}
