{
  "title": "ISSI concludes MoU with Turkiye’s Yunus Emre Enstitusu",
  "link": "https://www.app.com.pk/national/issi-concludes-mou-with-turkiyes-yunus-emre-enstitusu/",
  "date_published": "2024-05-29T14:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP): The Institute of Strategic Studies Islamabad (ISSI) concluded a Memorandum of Understanding (MoU) with the Yunus Emre Enstitusu, Turkiye for further strengthening its international collaboration here on Wednesday.\nThe MoU signing ceremony included the participation of the Turkish Ambassador, Mehmet Pacaci; Coordinator of Yunus Emre Enstitusu; Turkiye, Dr Halil Toker, Ambassador of Pakistan in Ankara; Dr Yousaf Junaid, Director General ISSI,  Ambassador Sohail Mahmood; Director CAMEA, Amina Khan; and Team CAMEA, a news release said.\nWhile giving her introductory remarks, Amina Khan said that this MoU is a testament to the long-standing relationship between Pakistan and Turkiye which is built on mutual respect and shared history. Collaboration between ISSI and the Yunus Emre Enstitusu is a step towards further enhancing as well as opening new avenues for cultural and academic cooperation between the two countries.\nAmbassador Sohail Mahmood, in his remarks, welcomed the conclusion of the MoU stating that it will lead to further fortifying the relationship which goes back centuries and is underpinned by cultural and religious affinities as well as shared history.\nHe added that Pakistan and Turkiye are two indispensable partners and that initiatives such as these further reinforce the efforts of the two governments to further deepen their multifaceted partnership. He concluded by saying that effective implementation of this MoU will provide a range of opportunities for collaboration in the research and academic fields and people-to-people exchanges.\nAmbassador Mehmet Pacaci, while expressing his views, said that the relationship between Turkiye and Pakistan is very special.  He added that more academic collaborations are needed to strengthen and further expand the relationship in various dimensions.\nHe also said that there is a need for further studies on the present opportunities and future horizons of Pakistan-Turkish relations.\nDr Yousaf Junaid, while speaking on the occasion, said that the signing of the MoU between ISSI and Yunus Emre Enstitusu will pave the way for a closer understanding in the already very sound relationship.\nSharing a historical perspective on the ties between Pakistan and Turkiye, he stressed the need for taking the message of this special relationship to the youth in both countries.\nHe assured of the Embassy’s full support in implementation of the MoU.\nDr Halil Toker, in his remarks, said that the Yunus Emre Enstitusu has a significant presence in Pakistan and that the signing of this MoU is of unique significance as it will pave way for further collaboration in various spheres. He concluded by saying that such initiatives will take Pakistan-Turkiye relations to further heights.\nThe ceremony ended with the signing of the MoU by Ambassador Sohail Mahmood and Dr Halil Toker.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:48:53.375Z"
}
