{
  "title": "CPEC second phase to be successful with best dividends ahead: Sen Mushahid",
  "link": "https://www.app.com.pk/national/cpec-second-phase-to-be-successful-with-best-dividends-ahead-sen-mushahid/",
  "date_published": "2024-05-29T14:57:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP): Former Chairman Senate Defence Committee, Senator Mushahid Hussain Sayed on Wednesday said the China Pakistan Economic Corridor (CPEC) project’s second phase would be successful as its best dividends would be received in the coming years.\nHe was addressing the Sustainable Development Policy Institute (SDPI) and the PCI jointly organised high-level policy dialogue on “Reforms Agenda for CPEC 2.0: Opportunities and the Way Forward” under its Green CPEC Alliance.\nMushahid Hussain said CPEC is the pillar of the Belt and Road Initiative (BRI) launched by President Xi Jinping which is undoubtedly the diplomatic and development initiative of the century encompassing Asia, Africa and beyond.\nThe BRI, he said has brought nations of the world together, whereas CPEC is the manifestation of Chinese confidence in Pakistan as China came to help Pakistan at a critical stage when the country barely had any other nation’s support.\n“Pakistan and China want to be the regional hub of connectivity from North to South and East to West that has contrasting visions of connectivity and cooperation that includes all and conversely there is a negative vision of new cold war and curtailment, and we reject that vision as 21st century cannot support zero minus sum vision. It’s connectivity and CPEC is the way forward. The next decade will be more successful as the best part of the CPEC is yet to come,” he said.\nOn this occasion, Executive Director, Sustainable Development Policy Institute (SDPI), Dr Abid Qaiyum Suleri said Pakistan and China can collaborate for exploring the untapped potential of “Green Minerals” under the CPEC’s second phase as it is the future fuel of the world.\nDr Suleri said that the country needs to consider challenges along with the opportunities as both have a common denominator of extreme weather and climate change across the region and the world. The revised trade regime is another challenge after the implementation of Carbon Border Adjustment Mechanism (CBAM) by the European Union (EU) to report carbon emissions in the supply chain of its exports whereas US and China are working on it, he said.\nDr Suleri noted that there is a lack of indigenous infrastructure and capacity to document and gauge carbon emissions at every sector level. Green metals, he said are another important component including nickel, cobalt, lithium and other that will help in EV batteries’ development that can be explored under CPEC 2.0. “Green diplomacy is another important tool that needs to be scaled up for border less promotion of green technologies and transfer of technology,” Dr Suleri said.\nExecutive Director, Pakistan China Institute (PCI), Mustafa Hyder Sayed said Pakistan needs policy coordination with clear reforms along with relevant bankable feasibility studies to succeed the second phase of China Pakistan Economic Corridor (CPEC).\nMustafa Hyder said Pakistan needs to take stock of its journey under CPEC as a lot has changed in the previous decade.\nCPEC was the pilot and flagship project of BRI under the commitment of Pakistan-China leadership, whereas after successful early harvest projects, the BRI has evolved and a lot of countries wanted to become part of it, he added.\nMustafa Hyder said the country would have to realise and materialise fool proof security for the Chinese and it also needs to develop a joint working on green energy transition under the CPEC.\nDr Khalid Waleed, Energy Expert SDPI briefed on CPEC and the energy projects. He said that the energy projects under CPEC are facing critical discourse due to the climate change debate, economic turmoil and financial crisis in energy projects demanding review of existing schemes.\n“Pakistan’s carbon emissions in energy sector are seven times more than EU that will create serious challenge for Pakistan under CBAM, whereas reforms are required for greening the investment of CPEC along with establishment of renewable energy diplomatic task force, B2B Green Alliance, and Sino-Pak Clean Energy Partnership,” Dr Khalid Waleed said.\nDuring the panel discussion, Managing Director, Private Power and Infrastructure Board (PPIB), Ministry of Energy (Power Division), Shah Jahan Mirza said during the first of CPEC, the country got $17 billion funding alone in energy sector that was invested in coal, renewable and hydropower projects.\nHe said the second phase of CPEC demanded the Pakistan government to come up with prudent and effective planning to avoid any failure in the power sector. Shah Jahan Mirza underlined that the government’s focus was on business-to-business engagement after completion of the government-to-government initiatives under the first phase of CPEC.\nWang Shengjie, Head of Political and Press Section, Embassy of People’s Republic of China said that it is necessary for the stakeholders to understand the upgraded version of the CPEC, the guidance of the leadership of the two counties and synergizing policies to achieve its successful completion.\nHe mentioned that the Chinese government has proposed 5C or Five Corridors framework highlighting corridors of growth, livelihood enhancement, innovation, green corridor and the open corridor. Dr Shengjie said it is a more strategic phase with many technical parts, whereas the Chinese government is mulling over to unite the 5C framework of China and 5E of Pakistan.\n“We are also planning to get Chinese experts in Pakistan to develop special economic zones (SEZs) who would study the current situation and figure out suitable road map for developing Pakistan’s SEZs,” he said.\nN.A. Zuberi, Senior Advisor, China Three Gorges South Asia Investment Limited highlighted the key concerns of the Chinese firms working under CPEC and the way forward to achieve successful completion of the second phase of CPEC.\nZuberi said frequent policy changes, cumbersome administrative procedures, bureaucratic hurdles, no framework for land acquisition, and security were the key challenges.\nIn his concluding remarks, CEO, Policy Research Institute for Equitable Development (PRIED) Badar Alam said Pakistan has been facing serious economic, environmental and financial crisis, whereas CPEC should address these concerns through its environment friendly and sustainable initiatives.\nCPEC 2.0 demands all to be realistic and practical so that it could be a holistic project that should resolve the country’s pressing issues, he added.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T02:48:51.434Z"
}
