{
  "title": "Dr Jah approaches President against closure of AJ&K Ombudsman institution",
  "link": "https://www.app.com.pk/national/dr-jah-approaches-president-against-closure-of-ajk-ombudsman-institution/",
  "date_published": "2024-05-29T17:58:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 29 (APP): Federal Ombudsman Dr Asif Mahmood Jah has written a letter to the President of Pakistan, expressing deep concern over the proposed closure of the Azad Jammu and Kashmir (AJ&K) Ombudsman institution.\nDr jah, in his appeal, highlighted the pivotal role the Ombudsman played in upholding justice and accountability within the region.\nHe emphasized the significant achievements of the AJK Ombudsman in maintaining high standards of accountability and transparency. “The closure of such a vital institution could undermine the progress made in establishing trust and accountability in public administration,” he said, according to a press release.\nHe said the Forum of Pakistan Ombudsman (FPO) was greatly alarmed by the news that was received from the AJK (Mohtasib) Secretariat and former AJK ombudsman regarding the intended closure of the Office of Ombudsman of AJ&K by the AJK Government.\n“As a dedicated platform for strenghtening ombudsman institutions across Pakistan, we at FPO are staunch advocates of the view that shutting down this vital institution would be a detrimental move with highly unfavourable consequences. It would reverse years of advancements in safeguarding citizens’ rights and maintaining the accountability of public officials.”\nAdding weight to the appeal, Almas Jovindah, FPO Executive Secretary praised the performance of the AJ&K Ombudsman, noting it as “excelling beyond other accountability institutions in the region.”\n“Ms Jovindah’s remarks underscore the exceptional contributions of the AJ&K Ombudsman in enhancing governmental accountability and protecting citizen rights,” Dr Jah said.\nAlmas Jovindah said “I firmly hold the belief that the closure of Office of Ombudsman of AJK would mean the loss of a crucial institution that provides hope and justice to thousands of citizens and holds public officials accountable for their actions in the region of Azad Jammu & Kashmir. If the dissolution of this Office is undergone, it will eliminate a significant pillar of good governance that ensures transparency and accountability of public functionaries.\n“Additionally, the specialized role of an ombudsman and its ability to take action under ‘own-motion’ renders it a far more effective complement to existing accountability structures in place like the National Accountability Bureau”.\nThe PFO leadership urged the government to reconsider the proposed closure, considering the substantial positive impact the AJ&K Ombudsman has had on the governance and oversight mechanisms in place.\n“The cessation of this office could pose a significant setback to the administrative justice system in AJ&K, potentially depriving citizens of a crucial avenue for justice,” they added.",
  "retrievedAt": "2025-08-11T02:48:06.492Z"
}
