{
  "title": "US extends further $20 mln humanitarian assistance for Pakistan’s flood victims",
  "link": "https://www.app.com.pk/national/us-extends-further-20-mln-humanitarian-assistance-for-pakistans-flood-victims/",
  "date_published": "2022-09-09T14:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 9 (APP): US Agency for International Development (USAID) Administrator Samantha Power on Friday announced that the United States, through the USAID, extended an additional US$20 million in humanitarian assistance to support the people affected by severe flooding in Pakistan.\nPakistan was ravaged by heavy monsoon rains, as well as landslides and glacial lake outburst floods that have been ongoing since June, the USAID Administrator said.\n“The impact of these floods has been felt widely across Pakistan. An estimated 33 million people have been affected, nearly 1,400 have died, and more than 12,700 have been injured. Infrastructure in the flooding’s path has been decimated, with more than 1.7 million homes, an estimated 13.8 million acres of cropland, thousands of miles of road and hundreds of bridges damaged or destroyed,” she said here in a press briefing.\nPower said this support was built on an announcement last week of US$30 million in humanitarian assistance to help the people of Pakistan affected by these devastating floods. Since August 12, the United States has provided over US$50.1 million in disaster assistance to help the people of Pakistan.\n“With these additional funds, USAID partners will continue to provide emergency relief supplies, multi-purpose cash and shelter assistance, support for livelihoods, logistics, and humanitarian response coordination systems. USAID will also prioritize water, sanitation, and hygiene (WASH) assistance as a preventative measure to mitigate the anticipated spread of waterborne diseases.”\nUSAID has also deployed a Disaster Assistance Response Team (DART) to lead the US government’s humanitarian response efforts in Pakistan. This elite team, composed of disaster experts from USAID, is assessing the damage, identifying priority needs, and coordinating with the Government of Pakistan and humanitarian partners. The United States is the single largest humanitarian donor to Pakistan.\nUS Ambassador Donald Blome on the occasion said the worst flood has occurred in Pakistan “Our sympathies are with the people of Pakistan”, he added\n“The United States is deeply saddened for the flood victims and the loss of loved ones, livelihoods, and homes throughout Pakistan. We stand with communities in Pakistan during this difficult time and will continue to help them in this time of need.”\nHe said the US stood with Pakistan in this difficult time adding that American companies had sent millions of dollars in aid.\nBlome said total of US$30 million in aid was being given to Pakistan, food and other essential items were being provided to flood affected people.",
  "retrievedAt": "2025-08-11T15:32:59.398Z"
}
