{
  "title": "PM stresses ‘climate justice’ for Pakistan amid flood calamity",
  "link": "https://www.app.com.pk/national/pm-stresses-climate-justice-for-pakistan-amid-flood-calamity/",
  "date_published": "2022-09-09T11:44:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 09 (APP): Prime Minister Shehbaz Sharif on Friday stressing the spirit of ‘climate justice’ said Pakistan merited support from the world, especially the industrialized countries, to respond to the current climate calamity.\nIn a meeting with United Nations Secretary-General Antonio Guterres, he said Pakistan needed support from international community to help Pakistan recover and rebuild with enhanced resilience.\nThe prime minister highlighted that Pakistan was facing floods of epic proportions, which were a dreadful manifestation of climate-induced natural disaster.\nHe outlined the extensive rescue and relief efforts being undertaken by the government, in collaboration with UN agencies, international community and humanitarian organizations, to reach out to the deeply affected over 33 million people across the country.\nThe prime minister highlighted that Secretary-General Guterres’s visit to Pakistan demonstrated strong solidarity with the people of Pakistan at this critical time.\nThe prime minister appreciated the Secretary-General’s strong support and advocacy for mobilizing international assistance, including for the $ 160 million UN Flash Appeal to fund Pakistan’s Flood Response Plan.\nHe also lauded the Secretary- General’s forceful messaging highlighting the linkage of these floods with the impacts of climate change.\nThe prime minister added that the Secretary-General’s leadership and timely intervention had helped put the global spotlight on the serious challenges posed by the catastrophic floods.\nHe recalled that, with less than one percent of global carbon emissions, Pakistan was among those least responsible for global warming.\nHowever, he said, it was among the top ten countries most severely impacted by climate change.\nThe two leaders also discussed Pakistan’s plans for the phase of rehabilitation of the flood affected population and reconstruction of areas devastated by floods.\nThe prime minister emphasized Pakistan’s resolve to build resilience against future climate shocks including through various projects on adaptation and mitigation with adequate support from the UN system and other international partners.\nRecalling his long association with Pakistan, the Secretary-General conveyed his enormous appreciation for the people of Pakistan.\nHe said he was witness to the resilience of the Pakistani people as well as their generosity in helping their compatriots and in hosting millions of Afghan refugees for decades.\nHe added that he was also deeply moved by devastation and the humanitarian consequences of the massive floods.\nHe assured full support and commitment to Pakistan including for mobilizing international assistance.\nThe Secretary-General emphasized that it was not merely about solidarity but a question of justice.\nHe said that apart from the massive support required for rehabilitation and reconstruction, the whole issue of climate change needed to be addressed with the kind of urgency, seriousness and responsibilities that it deserved.\nThe Secretary-General will also be travelling to areas most impacted by the floods as part of his visit.\nPrime Minister in a tweet said he had a very productive meeting with the UN Secretary General.\n“He has shown empathetic leadership to highlight sufferings of the flood victims. The international community should come forward to help Pakistan that is undergoing horrors of climate change,” the PM said.\nThe prime minister and the Secretary-General subsequently attended a briefing at the National Flood Response and Coordination Centre (NFRCC).\nSecretary-General Guterres is on a two-day solidarity visit to Pakistan in the wake of unprecedented rains and floods in the country.",
  "retrievedAt": "2025-08-11T15:33:05.071Z"
}
