{
  "title": "Digital inclusion, affordability,  battle against cash dominate Jazz leadership’s GSMA summit address",
  "link": "https://www.app.com.pk/national/digital-inclusion-affordability-battle-against-cash-dominate-jazz-leaderships-gsma-summit-address/",
  "date_published": "2025-08-10T15:18:01+05:00",
  "source": "APP",
  "content": "ISLAMABAD, Aug 08 (APP): From highlighting the need for affordable smartphones and universal internet to pushing for a cashless, inclusive economy, Jazz leadership laid out a compelling vision for Pakistan’s digital future at the GSMA Digital Nation Summit in Islamabad.\n\nCEO Jazz and Chairman Mobilink Bank, Aamir Ibrahim, and President Consumer Division at Jazz, Kazim Mujtaba, participated in high-impact discussions that emphasized regulatory reforms, digital trust, infrastructure investment, and targeted efforts to bridge the rural-urban and gender digital divide.\n\n*Powering Pakistan’s Digital Future: Inclusive Connectivity and Cross-Sector Reform*\n\nIn the session Building a Future-Ready Digital Pakistan, Aamir Ibrahim stressed the need for universal and affordable internet connectivity to support the country’s digital ambitions. Moderated by Julian Gorman, Head of Asia Pacific at GSMA, the panel featured industry leaders including Khurram Ashfaque, CEO Telenor Pakistan, and Sajjad Syed, Chairman PASHA.\n\nAamir emphasized telecom’s role as a cross-sectoral enabler and called for a favorable business environment for telecom operators. “We need a supportive regulatory environment to move at the speed the future demands,” he said, reiterating that the affordability of smartphones and universal accessibility of the internet are fundamental to Pakistan’s digitalization.\n\n“Access to the internet must be universal, regardless of location or gender,” he said, while also calling for reforms in spectrum allocation to enable stronger network expansion.\n\n*Collective Push Against Cash Key to Building a Trusted Digital Economy*\n\nIn the session Trust by Design – Building Confidence in the Digital Economy, Aamir argued that Pakistan’s biggest hurdle to a digital economy isn’t competition between fintechs, but the country’s overreliance on cash. “The real competition is not between fintechs—it’s a collective battle against cash,” he said.\n\nHe proposed mandatory digital payment options at retail outlets and highlighted the need for inclusion in the transition to digital. “Inclusion is everything. The digital economy must be accessible to every Pakistani, regardless of geography, income, or gender.”\n\nCiting JazzCash’s scale—processing millions of transactions daily—he acknowledged that trust remains a challenge due to fraud risks. “At JazzCash, trust is earned, not assumed,” Aamir noted, adding that direct customer feedback is central to product improvement.\n\n*Expanding the Conversation: Affordability, Literacy, and Women’s Inclusion*\n\nIn the session Connecting the Unconnected – What Works in Closing the Usage Gap, Kazim Mujtaba stressed that closing Pakistan’s usage gap requires a dual focus on affordability and literacy. “A smartphone is more than a device—it’s the passport to the digital economy, especially for women and underserved communities. Without it, entire segments of society remain invisible to opportunity.”\n\nHighlighting the sharp rural–urban divide in mobile internet usage, particularly among women, he shared how Jazz has deployed female staff to educate women in rural areas. “Connectivity is no longer a privilege; it’s a lifeline. When women are digitally literate, they uplift not just themselves but their families and communities.”\n\nKazim introduced ApnaClinic, Jazz’s upcoming AI-powered health platform offering teleconsultations, lab tests, surgeries, and diagnostic services through a network of 30,000 doctors in 150 cities. He also spoke about FikrFree, an insurtech product designed to make healthcare and accident insurance affordable and accessible for women and low-income users.\n\n“Pakistan’s insurance penetration among women is one of the lowest in the world. Through digital solutions like FikrFree, we’re making protection and peace of mind accessible to those who need it most.”\n\nCalling for collective action, he said, “The future will be shaped by those who are connected, skilled, and informed. We must invest in educating women and youth today to build a truly inclusive digital Pakistan.”",
  "retrievedAt": "2025-08-10T10:24:48.078Z"
}
