{
  "title": "FM chairs meeting over Covid posed economic challenges",
  "link": "https://www.app.com.pk/national/fm-chairs-meeting-over-covid-posed-economic-challenges/",
  "date_published": "2021-04-28T16:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD April 28 (APP): Foreign Minister Makhdoom Shah Mahmood Qureshi Wednesday chaired a high-level meeting to hold consultations over the economic challenges posed by Covid 19 pandemic, national security, regional situation and stability.\nDuring the meeting, the foreign minister said that coronavirus pandemic had impacted the powerful economies of the world. As a developing country, Pakistan was also facing the big challenge.\nConsidering this situation, the country was specially focusing upon its priorities of regional situation and economy, he added.\nThe meeting was attended by Minister for Food Security Syed Fakhar Imam, Minister for Human Rights Dr Shireen Mazari, Minister for Energy Hamad Azhar, PM’s advisor on Finance Shaukat Tarin, Minister for Economic Affairs Omar Ayub, PM’s advisor on Commerce Abdul Razak Dawood, PM’s special assistant on Overseas Pakistanis Syed Zulfiqar Abbas Bukhari, PM’s special assistant on National Security Moeed Yousaf, Advisor on Climate Change Malik Amin Aslam, PM’s special assistant on Power Tabish Gohar, Chairman Board of Investment Atif Bukhari, Foreign Secretary Sohail Mahmood and other civil and military high officials, a press release said.\nDuring the meeting, diplomatic efforts for projecting abroad the investment opportunities in the agriculture, information technology and other sectors of Pakistan were also discussed.\nForeign minister Qureshi said they were also focusing upon economic diplomacy to promote economic cooperation and regional linkages.\nHe said Pakistan would continue its sincere efforts for peace and stability in Afghanistan and the whole region.\nHe also welcomed a joint statement issued at the conclusion of a trilateral meeting held in Turkey over Afghanistan issue despite the covid pandemic.\nThe foreign minister reiterated Pakistan’s consistent stance of stressing upon holding of a comprehensive intra-Afghan dialogue under the Afghan leadership which was acceptable to all Afghans to achieve a durable peace in the worn-torn country.\nHe also called upon the international community to play its role in ending the gross human rights violations and redeeming the innocent Kashmiris from the unabated aggression and oppression unleashed by the Indian occupation forces in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).",
  "retrievedAt": "2025-08-11T20:40:06.939Z"
}
