{
  "title": "NRTC to present two prototypes of EVM to Prime Minister",
  "link": "https://www.app.com.pk/national/nrtc-to-present-two-prototypes-of-evm-to-prime-minister/",
  "date_published": "2021-04-28T12:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): National Radio and Telecommunication Corporation (NRTC) has prepared two prototypes of Electronic Voting Machine (EVM) which would be presented to the Prime Minister Imran Khan for inspection.\nOfficials during his visit to NRTC, Haripur on Wednesday informed Minister for Science and Technology, Shibli Faraz who visited the various sections of the NRTC and reviewed the ongoing work.\nHe was given a detailed briefing on the research and equipments being developed at the department.\nThe federal minister was further informed that the NRTC has acquired the full capability to manufacture world class ventilators and is awaiting FDA approval in this regard.\nThe minister was briefed that 109 faulty ventilators were made usable with the efforts of NRTC during the COVID-19 epidemic.\nSpeaking on the occasion, Shibli Faraz said that the future of Pakistan is linked to science and research and Pakistanis as a nation must move forward in this field so that the country can be brought at par with the developed countries.\nThe federal government highly appreciated the efforts of the NRTC in this regard.\nShibli Faraz said that transparent elections are indispensable for strengthening democracy in the country.\nThe use of technology in this regard is an important need of the hour.\nHe said that under the direction of Prime Minister Imran Khan, the Ministry of Science and Technology was fully committed to ensure the use of technology in elections.\nHe stressed the need to ensure transparency and comprehensibility in the manufacturing of EVMs as it would earn the trust of political parties, institutions and the people.\nHe added that the success of EVMs depend on ensuring that the votes are not stolen.\nThe federal minister said that acquiring capability to manufacture world class ventilators by NRTC is a welcoming sign.\nHe said that the NRTC significantly reduced the burden on the health-care system during the pandemic through making the faulty ventilators usable.",
  "retrievedAt": "2025-08-11T20:40:11.266Z"
}
