{
  "title": "Shahzad Akbar serves legal notice to Bashir Memon for defamatory statements",
  "link": "https://www.app.com.pk/national/shahzad-akbar-serves-legal-notice-to-bashir-memon-for-defamatory-statements/",
  "date_published": "2021-04-28T12:28:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 28 (APP): Adviser to the Prime Minister on Interior and Accountability Mirza Shahzad Akbar Wednesday said he had served over Rs500 million legal notice to Bashir Memon, a former Federal Investigation Agency (FIA) director general, for raising false, politically motivated and absurd imputations against him, prime minister, principal secretary to prime minister and law minister, in a television show.\nAccording to the notice dated April 28, Memon had appeared on a show called “Aaj Shahzaib Khanzada Kay Saath” aired on Geo Television on Tuesday night where he passed completely untrue and libelous defamatory statements accusing the premier’s adviser of pressurizing him (Memon) to file a case against a judge of the Supreme Court.\nThe notice said Shahzad, an honest and law abiding citizen appointed by the president on the basis of a distinguished professional career in law and human rights, never pressurized Memon to use FIA to harass or victimize him (judge)or any other individual.\n“You being a former police officer ought to have known that raising imputation without any evidence or factual basis, fabricating or twisting facts to narrate a completely untrue and misleading account is a criminal offence, the notice said adding that the defamatory statement is a part of hateful media campaign launched at the behest of those criminal and corrupt elements the incumbent government is trying to investigate and prosecute in a completely transparent, fair and neutral manner through a judicious forum.\nThe notice said the slanderous allegations have damaged the reputation of Shahzad Akbar, and Memon should pay Rs500 million for damaging reputation of the advisor and Rs2 million as legal fee.\n“You are liable to make good all losses caused to the advisor to the prime minister – in case you do not retract your false defamatory statement – issue an unconditional apology within the next 14 days through media – in case of failure legal proceedings will be initiated against you, the notice said.\nIn a tweet Akbar said he firmly believes in rule of law and he shall be answerable before a court of law for his slander.",
  "retrievedAt": "2025-08-11T20:40:10.171Z"
}
