{
  "title": "Cantonment Board Election Results",
  "link": "https://www.app.com.pk/national/cantonment-board-election-results/",
  "date_published": "2021-09-12T19:04:00.000Z",
  "source": "APP",
  "content": "The results of the Cantonment Board elections:\nSargodha : Pakistan Tehreek-e-Insaf (PTI) won 3 seats, independent candidates grabbed 5 seats while Pakistan Muslim League-Nawaz (PML-N) won 2 seats out of 10 seats in the Cantonment Board elections.\nAccording to unofficial results, Pakistan Tehreek-e-Insaf (PTI) candidate Awais Zahoor got 819 votes, while independent candidate Sheikh Farooq Wohra stood second by securing 813 votes in Ward No.1 of Cantonment Board elections. PakistanTehreek-e-Insaf (PTI) candidate Awais Zahoor had won the Cantonment Board elections in Ward No.1 with a margin of 7 votes.In Ward No. 2, independent candidate Muhammad Shahzad Anwar got 989 votes, while Pakistan Muslim League Nawaz (PML-N) candidate Muhammad Raheel Saddique stood second by securing 927 votes.\nIn Ward No. 3, Pakistan Muslim League Nawaz (PML-N) candidate Bilal Khalid Warriach bagged 763 votes, while Pakistan Tehreek-e-Insaf (PTI) candidate Arshad Warriach stood second by securing 551 votes.\nPakistan Muslim League Nawaz (PML-N) Sheikh Umer Arshad had won the Cantonment Board Elections in Ward No.3 with a margin of 212 votes.\nIn Ward No. 4, independent candidate Nasir Mehmood got 2570 votes, while another independent candidate stood second by securing 303 votes.\nIn Ward No.5, independent candidate Umar Farooq got 866 votes, while independent candidate Muhammad Ali Rauf stood second by securing 687 votes.\nIn Ward No.6, independent candidate Tauqeer Ashraf Gujjar got 1453 votes, while Pakistan Muslim League Nawaz (PML-N) candidate Sajid Iqbal stood second by securing 1060 votes.\nIn Ward No.7, Pakistan Muslim League Nawaz (PML-N) candidate Muhammad Zafar Khan got 696 votes, while independent candidate Rai Shahnawaz Kharal stood second by securing 585 votes.\nIn Ward No.8, independent candidate Khan Mehmood Ahmed Virk got 2115 votes, while Independent candidate Nadeem Akhter stood second by securing 1557 votes.\nIn Ward No.9, Pakistan Tehreek-e-Insaf (PTI) candidate Muhammad Asif Kahloon got 2193 votes, while independent candidate Shahzad Naeem Bajwa stood second by securing 2048 votes.\nIn Ward No.10, Pakistan Tehreek-e-Insaf (PTI) candidate Muhammad Arshad Tariq got 2164 votes, while Pakistan Muslim League Nawaz (PML-N) candidate Gul Sher stood second by securing 1737 votes.Pakistan Tehreek-e-Insaf (PTI) candidate Arshad Tariq had won the Cantonment Board elections in Ward No.1 with a margin of 427 votes.\nPakistan Tehreek-e-Insaf (PTI) won six seats, independent candidates won two seats while Pakistan Muslim League Nawaz (PML-N) won two seats out of 10 seats in the Cantonment Board Gujranwala (CBG) elections.\nAccording to unofficial results, Qamar Ali Cheema of Pakistan Tehreek-e-Insaf (PTI) from Ward No 1,Nasir Hussain of PTI from Ward No 2, Irfan Chand Butt independent candidate from Ward No 3,Gulam Mohiuddin of PTI from Ward No 4, Kashif Hafeez independent candidate from Ward No 5,Sajid Ikram of PTI from Ward No 6, Nisar Ahmed Baig of PTI from Ward No 7, Kamran Malik of PML-N from Ward No 8, Abdul Majeed of PML-N from Ward No 9 and Ghulam Mujtaba of PTI from Ward No 10 won the Cantonment Board Gujranwala elections, while no candidate of PPP won any seat.\nThe Muttahida Qaumi Movement-Pakistanhas emerged victorious in the local government elections of CantonmentBoard of Hyderabad (CBH) which were held on Sunday, according to theunconfirmed and unofficial results.\nThe triumphant party secured 7 out of 10 seats in as many wards of theCBH, adding one more ward to its total as compared to the party’s 2015CBH win in which they had won 6 seats.\nThe candidates of Pakistan Peoples Party were able to get the highestvotes in the remaining three wards.\nThe MQM-P grabbed the wards 2, 5, 6, 7, 8, 9 and 10 while the wards 1,3 and 4 went to the PPP.\nThe candidates of the ruling Pakistan Tehreek-e-Insaf (PTI) securedthird positions in 8 wards and second in one ward.The MQM-P’s MQM-P Abid Hussain won ward 2 with 927 votes defeatingPPP’s Azra Miandad and PTI’s Rashid Mehmood who received 372 and 528votes, respectively.\nThe winning party’s Tahir Pervaiz Shaikh polled 536 votes in ward 5where PPP’s Irteza Shaikh followed with 493 votes and PTI Afshan RaufShaikh with 91.\nIn ward 6 MQM-P’s Abdul Aziz received 565 votes, PPP’s Muhammad Bilal268 and PTI’s Muhammad Naseem 214.\nSimilarly, the ward 7 also went to the MQM-P where its candidate IrfanAli Khan bagged 934 votes while Tehreek-e-Labbaik Pakistan’s MuhammadFaisal received 263 votes and Pak Sarzameen Party’s Haroon Mehmood 178votes.\nThe wards 8, 9 and 10 were also secured by the MQM-P with itscandidates Mukhtiar Ahmed, Ghulam Ali Qureshi and Shah Hussain Bukharireceiving 783, 601 and 496 votes, respectively.\nThe PPP’s candidates Faqeer Mohammad, Abdul Rehman Pathan and QaziAshhad Abbasi were elected by the voters of wards 1, 3 and 4 obtaining662, 766 and 430 votes, respectively.\nTalking to the media at the party’s Zonal Office, MQM-P’s DeputyConvener Kunwar Navid Jamil congratulated the party’s supporters,workers and local leaders for the glorious win.\nHe said all the propaganda against his party had been watered down bythe people who reposed their trust in the party’s leadership.\nNine Independent candidates and a Pakistan Muslim League-N candidate won the Cantonment Board Multan (CBM) elections on Sunday.\nAccording to the unofficial results announced by Returning Officers, the independent candidate Rana Muhammad Ashraf won from Ward No 1 by securing 719 votes and Javed Anjum (Independent) got 608 votes and stand runner up. The independent candidate Ghulam Jilani Sheikh defeated his rival candidate by obtaining 158 votes while the PTI candidate Khalil Ahmed got 131 votes in Ward No-2. The PML-N candidate Akhtar Rasool Fareedi won from Warn No 3 by securing 321 votes while Muhammad Khalid Asad (independent) was runner up with 249 votes.\nAs per results from Ward No-4, Shiekh Abdul Waheed (independent) secured 929 votes while the PTI candidate Saeed Ahmed Moni was second with 316 votes. Malik Bilal (independent) got 1229 votes and declared winner from Ward No-5 while Humayun Akbar was runner up with 1115 votes. The independent candidate Sana Akbar won from Ward No-6 with 542 votes where Arif Raza (independent) was second with 254 votes.\nSimilarly, Shamshad Ali (independent) was declared winner from Ward No-7 by securing 397 votes and Nasir Ali remained runner up with 291 votes. The independent candidate Muhammad Yaqoob Nasir was winner from Ward No-8 with 64 votes against the PML (N) candidate Amjad Mujeed Sheikh who secured 60 votes. The election from Ward-9 was also won by an independent candidate Muhammad Sadiq Zaeem by getting 121 votes against his rival candidate Tahira Naseem (PML) who got 46 votes.\nThe independent candidate Khursheed Ahmed Khan won from Ward No-10 by securing 163 votes while his rival candidate Sarfraz Ramzan (Jamat-e-Islami) got 53 votes.The polling process was remained peaceful.\nAccording to Returning Officer (RO) Saleem Akhtar Khan, the total registered voters were 17,825 in the ten wards of the cantonment board where 16 polling stations were setup. However, the tight security arrangements were also made by the police and the City Police Officer (CPO) Munir Masood Marth was monitoring the security arrangements.",
  "retrievedAt": "2025-08-11T21:13:35.982Z"
}
