{
  "title": "Coronavirus claims 67 more lives during past 24 hours",
  "link": "https://www.app.com.pk/national/coronavirus-claims-67-more-lives-during-past-24-hours/",
  "date_published": "2021-09-13T09:27:00.000Z",
  "source": "APP",
  "content": "Sixty-seven corona patients have died during last 24 hours, 62 of whom were under treatment in the hospitals and five of them perished in their respective quarantines or homes, according to the latest update issued by the National Command and Operation Centre (NCOC).\nMost of the deaths occurred in Sindh followed by Khyber Pakhtunkhwa (KP).Out of the total 67 deaths occurred, 24 were on ventilators.\nThere were 5,066 Covid infected patients under treatment in critical condition in various Covid dedicated healthcare facilities of the country.\nThe National Covid positivity ratio during past 24 hours was recorded as 5.62 percent.\nThe Covid positivity ratio is the percentage of actual positive cases appearing in every 100 tests performed to identify infected individuals.\nThe maximum ventilators were occupied in four major cities including Sargodha 61 percent, Bahawalpur 47 percent, Lahore 59 percent and Multan 76 percent.\nThe maximum Oxygen beds (alternate oxygen providing facility other than ventilator administered as per medical requirement of COVID patient) was also occupied in four major cities of Sargodha 78 percent, Swabi 60 percent, Multan 66 percent, and Gujrat 63 percent.\nAround 558 ventilators were occupied elsewhere in the country while no COVID affected person was on ventilator in Balochistan and Gilgit Baltistan (GB).\nSome 53,158 tests were conducted across the country on Sunday, including 16,497 in Sindh, 19,038 in Punjab, 11,052 in Khyber Pakhtunkhwa (KP), 4,103 in Islamabad Capital Territory (ICT), 930 in Balochistan, 489 Gilgit Baltistan (GB) and 1,049 in AJK.\nAround 1,090,176 people have recovered from the disease so far across the country making it a significant count with over 90 percent recovery ratio of the affected patients.\nSince the pandemic broke out, a total of 1,207,508 cases were detected that also included the perished, recovered and under treatment COVID-19 patients so far, including AJK 33,379, Balochistan 32,591, GB 10,168, ICT 102,863, KP 168,748, Punjab 414,390 and Sindh 445,369.\nAbout 26,787 deaths were recorded in country since the eruption of the contagion.\nAround 7,159 people perished in Sindh, 23 of them died in the hospitals on and three of them out of the hospitals on Sunday.\n2,225 people died in Punjab died with 14 deaths occurred in past 24 hours. Some 12 individuals died in the hospitals and two out of the hospitals.\nAs many as 5,270 people expired in KP, 20 of them died in hospitals on Sunday, 889 individuals died in ICT, two of them expired in the hospitals on Sunday, 342 people died in Balochistan, 181 infected people perished in GB, two of them expired in the hospitals on Sunday and 721 people died in AJK, three of them succumbed to the deadly virus in the hospitals on Sunday.\nA total of 18,521,728 corona tests have been conducted so far, while 640 hospitals were equipped with COVID facilities across the country.\nSome 5,425 corona patients were admitted to hospitals.",
  "retrievedAt": "2025-08-11T21:13:33.985Z"
}
