{
  "title": "Telecom sector attracts $202.34mln FDI during 2020-21",
  "link": "https://www.app.com.pk/national/telecom-sector-attracts-202-34mln-fdi-during-2020-21/",
  "date_published": "2021-09-13T12:28:00.000Z",
  "source": "APP",
  "content": "Briefing the media persons about performance of the telecom sector here, Chairman Pakistan Telecommunication Authority (PTA) General (Retd.) Amir Azim Bajwa Monday said “The telecom sector has contributed over Rs 218.8 billion to the national exchequer during the last financial year.”\nHe said that teledensity (landline telephone connections per 100 people in a specified geographic area) till July was recorded at 87.5 percent while the number of active cellular mobile subscribers reached 185 million till July, 2021.\nThe chairman said the number of broadband subscribers reached 104.43 million in July while the broadband penetration was recorded at 47.68 percent during the same period.\nBajwa said that data usage reached to 6855 PB [PetaByte] in 2020-21.\nHe further said that Complaint Management System of PTA, launched in 2021 and upgraded in 2020, was used for facilitation of telecom consumers for lodging complaints, processing and redressal of consumers’ grievances.\nFrom November 2018 to September 2021, a total of 480,865 complaints were received and 238,656 resolved promptly, he added.\nHe said that the PTA launched an automated Lost and Stolen Device System (LSDS) for blocking of lost, stolen and snatched mobile phones in April 2021, under which it received around 9,963 blocking and unblocking requests so far.\nThe chairman said that PTA also launched an automated module of SMS in February 2021 for blocking of mobile handsets, issuing warning to fraudsters and black-listing of CNICs for repeated violation. A total of 85,472 IMEIs had been blocked, 22,225 warnings were issued and 206 CNICs blacklisted, he added.\nHe said since the implementation of Device Identification Registration and Blocking System (DIRBS), import of mobile devices via legal channels increased by 62 percent with revenue of Rs 46.27 billion.\nIn 2020, around 38.14 million devices were imported with revenue of Rs 54 billion and in 2021, so far around 20.91 million devices have been imported through legal channels.\nHe said the PTA had issued Mobile Device Manufacturing (MDM) authorization to 29 companies including foreign and local companies with brands like Samsung, Vivo, Oppo, Nokia, Alcatel, Techno and Infinix.\nBajwa said within seven months of MDM authorization issuance, around 12.48 million mobile devices had been manufactured locally which included over 5 million 4G smart phones. One company has also exported 5000 ‘Made in Pakistan’ Smart phones to United Arab Emirates.\nEstablishment of 26 manufacturing plants had been brought in an investment of over $126 million and created over 10,000 jobs in a short span of 7 months.\nTo a question, he said that PTA was working actively to block fake SIMs and due to the action taken by the authority, the number of fake SIM cards had significantly decreased. “We are committed to totally eliminate fake SIMs” he added.",
  "retrievedAt": "2025-08-11T21:13:30.112Z"
}
