{
  "title": "Govt working to improve agriculture: Syed Fakhar Imam",
  "link": "https://www.app.com.pk/national/govt-working-to-improve-agriculture-syed-fakhar-imam/",
  "date_published": "2021-09-13T16:56:00.000Z",
  "source": "APP",
  "content": "Addressing the oath-taking ceremony, the minister said that the government has increased the development budget of the Ministry of National Food Security and Research from Rs. 1 billion to Rs. 30 billion and important steps have been taken to make the country self-sufficient in agricultural commodities, said a press release.\nOther important measures to improve agriculture include the use of hybrid seed technology, genetic engineering, modern technology, protection of water reservoir , pastures and other agricultural resources, modern breeding of high milk and high meat producing animals, providing maximum national and international training opportunities to enhance the professionalism of agri. Scientists.\nIn addition, ensuring provision of funds for the improvement to the agricultural research institutes of the country is the top priority of the government.\nMinistry is trying to ensure provision of pension to PARC employees in SPS scale and that Technical allowance should also be given to the technical cadres along-with scientists.\nTalking to the participants of the PARSA oath taking and Scientists Award Distribution Ceremony, Dr. Muhammad Azeem Khan, Chairman, PARC said that owing to the hard-work of these scientists Pakistan is now self -sufficient in its major food items like wheat, rice, sugarcane, maize etc.\nChairman PARC also thanked dignitaries for sparing their valuable time for the ceremony.\nHe assured the worthy Federal Minister and Secretary that scientists are always ready to take any challenge faced by the agricultural sector in Pakistan. He reminded the respectable guests about the current budget deficit of PARC.\nThe newly elected President of PARSA, Azizullah Shah assured that the association will continue its efforts to promote the scientific research and disseminate knowledge at the doorstep of farmers.\nPARSA President demanded from the Federal Minister to get the approval of non-official members of PARC from the Cabinet, approval for permanent members of\nPARC Executive Committee and to ensure provision of PARC funds on regular basis.\nThe newly elected PARSA executive committee took oath at this occasion.",
  "retrievedAt": "2025-08-11T21:13:27.894Z"
}
