{
  "title": "Dhai Chaal’ movie to reveal unheard story of Balochistan’s sacrifices against terrorism",
  "link": "https://www.app.com.pk/national/dhai-chaal-movie-to-reveal-unheard-story-of-balochistans-sacrifices-against-terrorism/",
  "date_published": "2023-03-12T11:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP): Dhai Chaal, an upcoming Pakistani feature film by Faisal Productions, is going to reveal the unheard story of sacrifices and courage rendered by the valiant patriotic people of Balochistan in the war against terrorism for the past two decades.\nThe film has been directed by Taimour Sherazi and produced by Dr Irfan Ashraf.\nIn an interactive session with media persons, Dr Ashraf said the basic theme of the movie is to pay tribute to the sacrifices of locals of Balochistan, to promote the positive impact of the China-Pakistan Economic Corridor (CPEC), to expose the Indian-sponsored terrorism in Balochistan, to expose the Indian spy Kulbhushan Jadhav and his terrorist activities in Balochistan, and to show the reality of Pakistan to the world in a soft way.\nThere have been movies like ‘Khuda Ke Liye’, ‘WAAR’, ‘Yalghar’, and others but there was much need for a film project that could focus on digging up the hidden stories of successful and hard-earned achievements of the country’s people and its security forces against the inimical forces, he added.\nDhai Chaal (Knight’s Move), a well-conceived and aptly designed film project by Faisal Production is revolving around an Indian spy, Kulbhushan Jadhav, who was arrested by the law enforcement agencies of Pakistan on March 3, 2016. After World War II, this is a unique incident that a serving intelligence officer of a country (India) got arrested while spying in another country (Pakistan). The story is based on how Pakistani security forces arrested Kulbhushan Jadhav.\nDr Ashraf said no one in history made such a blunt film, which is the first thing that made this picture unique; secondly, the shooting of this film took place in Balochistan in unique and underrated locations that will attract tourism.\nHe said the movie’s basic theme is that it wanted to pay tribute to the people of Balochistan who stood with the country to fight against terrorism and rendered huge sacrifices in the cause as they lost their loved ones in target killings.\nDuring the filming of this project, the tourism potential of Balochistan has been highlighted that is untapped so far and easily accessible to common people, he added.\n“The film has amicably utilised the landscape for good cinematography and to create public awareness about Balochistan’s tourism potential.\nMoreover, after the launch of this film, it can also grab the attention of filmmakers by Balochistan’s picturesque scenery because it has the unique topography, landscape and natural beauty unmatched in the world, Dr Ashraf said.\nDhai Chaal, in its different scenes, tried to expose Indian-sponsored terrorism through Kulbhushan Jadhav-type hostile networks of Indian agencies involved to foil the CPEC and perpetrate terrorism in Balochistan which is still going on, he said.\nHe urged the youth and overseas Pakistanis that they should visit cinemas to watch this film after its release date is announced.\nIndia has recently launched many movies against Pakistan especially Codename Tiranga, Mission Majnu, Bard of Blood, Kashmir files and others.\n“Dhai Chaal highlights all these aspects of Balochistan from terrorism to tourism, insurgency to enduring peace and from bloodshed to development. It also highlights the legitimate freedom struggle of the Kashmiris in a very soft manner,” Dr Ashraf said.\nHe said it also underscores that how India is unleashing its unabated atrocities against innocent Kashmiris and how the resistance of Kashmiris in response has agitated them.\nThe movie with its developing narrative amid thrill, action, drama and sensation sheds light on very technical and serious issues in a subtle manner.\nIndia, he said, has started engaging Pakistan internally through insurgency and terrorism incidents across the country in order to crush the Kashmir freedom movement and curtail Pakistan’s diplomatic role by keeping it stuck in its own problems and barring it from raising its voice for the Kashmir issue at global forums.\nThe film cast included stars like Shamoon Abbasi, Ayesha Omer, Humayoun Ashraf, and Adnan Shah Tipu, Taqi, Areej Chaudhary and Faraz Marri, Irfan Motiwala and many other actors.\nAt the end, the journalists were presented with mementoes by Dr Irfan Ashraf.",
  "retrievedAt": "2025-08-11T06:21:12.916Z"
}
