{
  "title": "New moon of Ramazan would be announced with consensus, says Religious secretary",
  "link": "https://www.app.com.pk/national/new-moon-of-ramazan-would-be-announced-with-consensus-says-religious-secretary/",
  "date_published": "2023-03-12T16:52:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Mar 12 (APP): Religious Affairs Secretary Dr Aftab Akbar Durrani on Sunday expressed the hope that the new crescent of the holy month of Ramazan would be announced after forging consensus with all stakeholders.\nHe said there was a proper mechanism for moon sighting and the Central Ruet-e-Hilal Committee which had always taken provinces on board into the matter.\nSecretary Durrani said the committee had never been disrespectful to anyone and performed its job mandate professionally.\nAccording to the official sources, the committee was going to meet on Wednesday, March 22, in Peshawar to witness the crescent of the holy month of Ramazan.\nThe committee would be comprised of representatives of religious scholars, SPARCO, Pakistan Meteorological Department (PMD), Ministry of Science and Technology and Ministry of Religious Affairs and Interfaith Harmony, they added.\nThey said the final announcement regarding the moon sighting would be made public in the light of testimonies received from all over the country.\nMeanwhile, the PMD had forecast the possibility of Ramazan moon sighting on March 22, (29th Sha’ban 1444 AH).\nIt said the new moon of Ramazan 1444 AH was expected to be born on the crossing conjunction point at 22-23 PST on March 21. “It will be clear or partly cloudy in most parts of the country on March 22,” the PMD forecast the weather condition pertaining to the particular day across the country.\nIt may be separately mentioned, here, that after facing severe criticism from the public, the interim Khyber Pakhtunkhwa government had directed for immediate withdrawal of a tender notice issued by the Auqaf Department to arrange lavish dinner arrangements for the Ruet-e-Hilal Committee’s meeting scheduled to be held for Ramazan moon sighting on March 22 in the provincial capital.",
  "retrievedAt": "2025-08-11T06:21:05.923Z"
}
