{
  "title": "Behind the cameras on Shark Tank - Business - DAWN.COM",
  "author": null,
  "content": "In January 2024, Grenlit Studios (Grenlit) entered into a one-year format licensing agreement with Sony Pictures Television (Sony) to produce Shark Tank Pakistan, which finished airing in January 2025, in a major milestone for the country’s teething startup ecosystem which had experienced a 90 per cent decline in startup funding in the two years leading up to 2024.\n\nBut now, the Dragons’ Den Franchise has come under the shadow of various disputes, including a licensing tug-of-war. A major controversy is over the delivery of its most basic promise: investment. According to multiple founders who appeared on the show, the excitement of getting a “yes” on air often gave way to long silences and, eventually, no deals at all.\n\nOne founder, Abdul, who was offered a joint investment for his startup, Stufeez, from three judges, has gone on record to describe his experience post-show, since recently making his claims public via a well-circulated reel on Instagram. He noted that soon after the show, there had been multiple initial conversations in a group chat with all investors; however, his funding’s fate still remains up in the air.\n\nThis lack of follow-through, some founders argue, exposes a deeper flaw in the show’s model. While Shark Tank’s global format leaves deal execution to private agreements between founders and investors, Pakistan’s startup space lacks the legal infrastructure and capital maturity to support such informal arrangements.\n\nPakistan’s startup space lacks the legal infrastructure and capital maturity to support on-screen informal arrangements\n\nThe production team distanced itself from the execution of on-air deals, citing a global conversion rate of ’around 50pc“, while judge Junaid Iqbal, one of the full-time judges, added that only about “60pc of deals make it past the term sheet stage” in venture investing overall.\n\nMr Iqbal also said he had made commitments to 10 startups, of which only three reached the term sheet stage, one being a grant, with disbursement underway. Of the remaining two, one was rejected by the founder, while the other is still pending confirmation.\n\nRummana Dada, who committed to 17 startups, said many teams “failed their due diligence process despite quite a significant amount of support.” Without confirming any completed investments, she attributed this trend to the typical volatility of inaugural seasons, adding that “the maturity and coachability of many founders is insufficient”. She also said that “stats are low for emerging markets and for early Shark Tank seasons, usually less than 30pc”.\n\nAleena Nadeem, a part-time judge, said she committed to six deals on the show. None of them has materialised. She cited reasons ranging from rejections by founders to incomplete paperwork. One startup “passed initial due diligence, but there wasn’t an investor-founder fit”, she said. Meanwhile, fellow part-time judge Karim Teli claimed all his investments had been disbursed but declined to provide specifics.\n\nAs for season 2 of the show, whose market demand appears validated by the emergence of two other upcoming startup reality shows, it is understood from a source that the next season will feature enhanced due diligence processes for both startups and investors. According to the source, investor eligibility requires a declared net worth of at least $10 million and available risk capital of $300,000.\n\nWhile several judges have cited failed due diligence as the reason for dropped deals, the same source said most of the season one startups were recruited from the National Incubator Centre and were “not as unprepared as claimed.” They noted that Faisal Aftab, who is expected to return for season 2, had been able to fulfil his solo commitments.\n\nGrenlit, which has maintained it holds the right of first refusal for a second season, has not shared any immediate plans, saying its current focus is on the production of its MasterChef franchises and other projects.\n\nOf course, venture capital is not a right; it is a privilege earned. But neither should airtime be the make-or-break factor for investors to take a bet on startups as a high-risk asset class. After all, venture investing is not an obligation, but a mere choice.\n\nRabeel Warraich and Usman Bashir did not immediately respond for comment.\n\nThe writer is an independent business journalist\n\nPublished in Dawn, The Business and Finance Weekly, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T07:00:00.261Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928462/behind-the-cameras-on-shark-tank",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:09:10.000Z"
}
