{
  "title": "Trailer truck crashes in Karachi’s DHA, injuring 2: Rescue 1122 - Pakistan - DAWN.COM",
  "author": null,
  "content": "A high-speed trailer truck crashed in Karachi’s upscale Defence Housing Authority (DHA) on Monday morning, injuring two people, according to Rescue 1122.\n\nThe city has lately witnessed a rise in traffic accidents, especially involving heavy vehicles, including dumpers and water tankers, which killed nearly 500 people and injured 4,879 in 2024, according to hospital data.\n\nAccording to a spokesperson for Rescue 1122 Sindh, the trailer was travelling at a high speed when it crashed into a bungalow in DHA Phase 2.\n\nHe said that as soon as Rescue 1122’s Central Command and Control team received the information, the urban search and rescue team, along with two ambulances and one disaster response vehicle, rushed to the scene.\n\n“Two people trapped as a result of the collision were rescued safely,” he said, adding that they were transported to the hospital via ambulance with minor injuries. He added that both of the injured victims were trailer staff.\n\nDeputy Inspector General (DIG) South Syed Asad Raza confirmed that the two people trapped were the driver and cleaner of the trailer, who were rescued and taken to the hospital “after immediate medical assistance”.\n\n“The police of the bungalow have contacted the owners, who are currently in Islamabad,” the DIG said.\n\nHe added that according to initial investigations, the accident occurred as a result of slippery conditions on the road due to rain.\n\nAccidents frequently occur in the metropolis due to violations of traffic rules, with speeding and unsafe overtaking being major contributing factors. Speeding increases the risk of crashes and the severity of injuries, while unsafe overtaking often leads to head-on collisions.\n\nLast month, a 59-year-old man was killed when a dumper truck ran over his motorcycle in Karachi’s Saudabad. The incident angered area residents, who damaged the truck and beat the driver before police intervened.\n\nEarlier in the same week, at least four people lost their lives and another six were injured — all from the same family — after their speeding car crashed into a wall on Hawkesbay Road in the city’s Mauripur area, while a separate collision between a trailer and a truck left one dead and three injured near New Sabzi Mandi on the Super Highway.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/041147363605fc0.png",
  "retrievedAt": "2025-08-16T06:58:39.381Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928663/trailer-truck-crashes-in-karachis-dha-injuring-2-rescue-1122",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T07:02:44.000Z"
}
