{
  "title": "Funeral held in absentia for missing tourists in GB’s Babusar after 14 days of search efforts - Pakistan - DAWN.COM",
  "author": null,
  "content": "A search operation for tourists who went missing after rain-induced floods in Gilgit-Baltistan’s (GB) Babusar area concluded on Monday after 14 days, while their funeral prayers were held in absentia.\n\nPakistan has been grappling with severe flooding caused by cloudbursts, glacial lake outburst floods (Glofs) and intense monsoon rains since June. These extreme weather events have resulted in several deaths and injuries across the country, with the GB region among the hardest hit.\n\nAfter deadly floods swept across GB’s Babusar area on July 21, the deaths of seven people had been confirmed but 12 remained missing. Besides the missing, the region’s death toll stands at 10.\n\nIn a statement today, GB government spokesperson Faizullah Firaq said, “The funeral prayers of the missing persons were offered in absentia in Babusar.”\n\nHe said that the search operation on Babusar Highway, which had continued for 14 days, has now ended. “All vehicles have been removed from the debris, but no trace of the missing persons could be found,” he said.\n\n“[The] hopes of the missing persons being rescued in the flood-hit area have been dashed,” he added.\n\nLast week, the GB government had intensified the search operations on Babusar Highway.\n\nDiamer police, GB Scouts, Pakistan Army personnel, Rescue 1122 and local volunteers took part in the search efforts. Drone camps, modern equipment, sniffer dogs, technical mechanisms, heavy machinery and human resources were used for the operation.\n\nSeparately, five members of a family trapped because of a flood four days ago in GB’s Ghizer district have been rescued and taken to a safe place, Ghizer’s Rescue 1122 said today.\n\nAccording to Ghizer Rescue 1122’s media coordinator, Shakraiz, a lightning strike washed away the road connecting the flood-hit area on the evening of July 31, causing five members of a family to be stranded on the other side of a river in Gopus Khatam village.\n\n“Today, the team rescued all the members and moved them to a safe place by boat,” Shakraiz told Dawn.com.\n\n“Food was also delivered to other affected families during the operation. Sixty-two houses, water supply and electricity systems, along with health and education centres, were severely affected by the flood in the Ishkoman and Gopus valleys of Ghizer.”\n\nAccording to local political leader Zafar Muhammad Shadamkhel, lightning struck at eleven places simultaneously, causing severe damage to houses, buildings, schools, roads and power plants. He added that 600 people have been deprived of drinking water.\n\nOn Thursday, cloudburst-induced floods in Ghizer and Hunza districts caused significant damage to the irrigation channel in Ghalapan village in upper Hunza’s Gojal, which provides water for over 50,000 forest trees, according to residents.\n\nThe next day, a glacier burst in GB’s Bagrot Valley had resulted in the death of one person, while his father was injured, according to the regional government’s spokesperson.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/04165721d96b95e.png",
  "retrievedAt": "2025-08-16T06:58:40.162Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928659/funeral-held-in-absentia-for-missing-tourists-in-gbs-babusar-after-14-days-of-search-efforts",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T06:52:55.000Z"
}
