{
  "title": "Fake army colonel arrested in Daska - Pakistan - DAWN.COM",
  "author": null,
  "content": "GUJRANWALA: A man impersonating a Pakistan Army colonel was arrested after attempting to pressure Daska Assistant Commissioner (AC) Sadia Jaffer into intervening in a land dispute.\n\nThe suspect has been taken into custody and a case has been registered against him.\n\nAccording to official sources, the suspect first contacted the AC via a phone call, introducing himself as a serving colonel. He attempted to influence a case concerning land ownership. Following the call, he continued to send messages to the AC, further pressing for action.\n\nHowever, the AC grew suspicious after noting grammatical errors and inconsistencies in his language, suggesting that the caller was not a genuine army officer.\n\nThe impersonator said that his ‘representative’ would soon visit the AC’s office, prompting her to immediately alert the DSP City Daska and request a formal investigation.\n\nThe police traced the suspect’s number and location, leading to his arrest.\n\nA case has been registered against the suspect for impersonation, fraud, and attempt to interfere with official duties.\n\nSCHEMES: A meeting of the Divisional Development Working Party, chaired by Commissioner Gujranwala Syed Naveed Haider Shirazi, approved schemes for various districts including Gujranwala, Gujrat, Sialkot, Mandi Bahauddin and Hafizabad.\n\nThe approved projects will be executed by the Punjab Housing and Local Government Department.\n\nAccording to the new schemes, several development initiatives were sanctioned in Gujranwala, including the construction of streets in Kamoke, boundary wall construction at a graveyard in Nandwala.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/21001838e4614b1.jpg?r=001844",
  "retrievedAt": "2025-08-16T06:59:29.331Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928552/fake-army-colonel-arrested-in-daska",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:10:26.000Z"
}
