{
  "title": "COAS aims to build a more sustainable, multi-faceted relationship with America: report - Pakistan - DAWN.COM",
  "author": null,
  "content": "Chief of Army Staff (COAS) Field Marshal Asim Munir is aiming to build a sustainable and multi-faceted relationship with the United States, British magazine The Economist reported on Sunday.\n\nRelations between Washington and Islamabad have grown deeper since US President Donald Trump took office. On July 31, both nations struck a trade deal lowering US tariffs on Pakistan to 19 per cent, while also establishing an agreement to explore Pakistani oil reserves.\n\nIn June, the COAS made a five-day official visit to the US, where he met with Trump over luncheon, becoming the first serving army chief to have a face-to-face meeting with a sitting US president. During the trip, Field Marshal Munir stressed the “immense potential for a broader, multidimensional relationship built upon mutual respect” with Washington.\n\nThe COAS’ visit followed a four-day military confrontation with India in May, after New Delhi blamed Islamabad for the April 22 Pahalgam attack without evidence. A US-brokered ceasefire ended the war.\n\n“There he was, enjoying a private lunch with Donald Trump in the White House on June 18, just over a month after Pakistan’s brief conflict with India,” The Economist wrote about the June luncheon.\n\n“Then, at the end of July, came further snubs for India: branding it a ‘dead economy’, Mr Trump imposed tariffs of 25pc while hailing a new trade deal with Pakistan.”\n\nThe Economist wrote that the field marshal’s fortunes “reflect a shift in American policy that affects India, China and the Middle East”.\n\nSpeaking to the Director General of the Inter-Services Public Relations (ISPR), Lieutenant General Ahmed Sharif Chaudhry, The Economist quoted him as saying that Field Marshal Munir is “well versed” with The West, despite not having trained in the US or the UK.\n\n“To India’s dismay, America and Pakistan are now rebuilding ties with a focus on trade, counter-terrorism and consultation on Middle Eastern policy. America may even sell arms again to Pakistan,” the magazine noted.\n\nAdditionally, The Economist recognised that Pakistan recently earned Washington’s praise for killing and capturing leaders of a local offshoot of the Islamic State terrorist group.\n\nIn June, United States Central Command (Centcom) commander Army General Michael Kurilla hailed Pakistan as a “phenomenal partner” in the arena of counter-terrorism, citing their struggle against terrorism in Balochistan and against terrorist groups like the Islamic State.\n\n“He (Munir) has sparked interest from Trump associates in Pakistan’s crypto and mining sectors … and he has positioned Pakistan as a potential means to advance America’s interests with Iran and its efforts to get more Muslim countries to establish diplomatic ties with Israel,” the magazine wrote.\n\nAmerica, in turn, toned down its criticism of Pakistan’s programme to build longer-range ballistic missiles, which officials from former president Joe Biden’s administration considered a threat to the US, The Economist wrote.\n\n“It has resumed some aid programmes [and] it is also considering selling weaponry, including armoured vehicles and night-vision goggles, to help Pakistan combat local insurgents.\n\n“American officials are examining Pakistan’s evidence to support its claims that India backs those insurgencies, although they are unconvinced, so far.”\n\nIn January, prior to Trump’s inauguration as president, the US said Pakistan played a pivotal role in US counterterrorism efforts over the years, but it “has never been a formal ally bound by treaty obligations”, according to former White House official John Kirby.\n\nMeanwhile, Pam Bondi, who is currently serving as the US attorney general, emphasised during her confirmation hearing that global cooperation would be essential to counter the growing threat posed by Afghanistan-based terrorist groups like Islamic State-Khorasan Province.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/04184401477fa06.jpg",
  "retrievedAt": "2025-08-16T06:58:19.730Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928697/coas-aims-to-build-a-more-sustainable-multi-faceted-relationship-with-america-report",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T14:29:27.000Z"
}
