{
  "title": "Railways to spend Rs12bn on track rehabilitation this fiscal - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The Pakistan Railways (PR) is going to spend Rs12bn on repair/maintenance and rehabilitation of tracks and other infrastructure projects, including signaling and communication systems, during the ongoing fiscal year while another Rs10bn has been allocated for the repair/maintenance of the rolling stock and other schemes.\n\nOn the other hand, the railways has earned a record revenue of over Rs7.48bn in the first month (July) of the ongoing fiscal year 2025-26. The revenue is Rs1.46bn more than the July of the last fiscal, Dawn has learnt.\n\n“During the last couple of fiscal years, we did a lot of repair work at the railway track in Sukkur division—the most troubled area in terms of decaying railway track. Due to massive works, wherein we even replaced various decaying stretches of the track (ML-1) with new ones, the number of derailments declined. Now the track in Sukkur division has improved compared to the past,” PR Chief Executive Officer Amir Ali Baloch explained by phone when asked why the PR was not focusing on the track rehabilitation.\n\nSpeaking to Dawn on Sunday, he said that despite meager financial resources, the PR has improved its passenger and freight train operations and other revenue streams. Under the federal government’s Public Sector Development Programme (PSDP) for the FY 2025-26, Rs22bn has been given to the railways. Of these, Rs12bn would be spent only on the infrastructure-related projects including tracks’ rehabilitation and repair of signaling and communication systems.\n\nTargets Rs100bn revenue by the end of fiscal in June next year\n\nMr Baloch said the PR had succeeded in massively decreasing its dependency on the federal government as the department was meeting most of its expenses with its own financial resources.\n\n“We didn’t get even a single penny from the federal government for refurbishment of passengers coaches, turning Lahore and other major railway stations into modern ones having escalators, state of the art toilets, washrooms, waiting rooms, dining rooms, dining on wheels, provision of WiFi service in trains, vigilance, online booking, track tracking and several other developments,” Mr Baloch said, adding that the number of accidents caused by derailments were declining fast compared to the situation with previous years.\n\nTalking about income of the railways, the CEO said: “While July 2025-26 figure shows that revenue earned this month was Rs1.46bn more than the last year’s July,by end of the ongoing fiscal year on June 30 next year, the department is most likely to touch a figure of Rs100bn”.\n\nIt is pertinent to mention that in the last fiscal that ended on June 30, the railways had earned Rs93bn that included Rs47bn and Rs31bn from passenger and freight trains, respectively. Rs1.5bn were earned through military goods operation through rail, Rs3bn from other coaches’ operations and Rs9bn from other miscellaneous resources.\n\nIn the year 2023-24, the PR had earned Rs88bn revenue, Rs15bn more than the target. In 2018-19, the PR’s total income touched the figure of Rs45bn that increased to Rs48.5bn in 2020-21 and Rs63.5bn in 2022-23 fiscal years.\n\nIn 2024-25, the railways Karachi division remained on top in passenger revenue with Rs15bn, followed by Lahore with over Rs11bn. In the freight sector, the Karachi division topped with a record earning of Rs28bn, followed by Multan division that earned Rs1bn.\n\n“Though we are already doing our best to improve our operations and revenues, we aim to make our train operations safer and more comfortable for the passengers,” the railways CEO claimed.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:59:36.692Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928570/railways-to-spend-rs12bn-on-track-rehabilitation-this-fiscal",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:10:25.000Z"
}
