{
  "title": "V8 nations aim to boost oil output by 0.5m barrels - World - DAWN.COM",
  "author": null,
  "content": "LONDON: The Voluntary Eight (V8) — Saudi Arabia, the UAE, Oman, Kuwait, Iraq, Kazakhstan, Algeria and Russia — announced on Sunday they would increase oil production by 547,000 barrels a day in a move that analysts say aims to regain market share amid resilient crude prices.\n\nAs currently they produce about 41 to 42 million barrels a day, the increase would be about 1.5 per cent, though analysts believe with the Brent reference oil currently selling at about $70 a barrel, there is unlikely to be a major impact on prices.\n\n“The eight participating countries will implement a production adjustment of 547,000 barrels per day in September 2025 from August 2025 required production level,” said a statement released after a meeting where the hike was agreed upon.\n\nThe eight key producers, which started increasing production in April, affirmed their commitment to market stability on “current healthy oil market fundamentals”, an Opec statement read.\n\n1.5pc hike unlikely to have major impact on prices, analysts say\n\nOil prices have held up better than observers anticipated amid strong summer demand and a high geopolitical risk premium, notably owing to conflict between Iran and Israel.\n\n“Opec+ has passed the first test — unwinding 2.2 million barrels per day (since April) without crashing prices or compromising unity,” said Jorge Leon, analyst at Rystad Energy. But the next task would be even harder: deciding if and when to unwind the remaining 1.66 million barrels, all while navigating geopolitical tension and preserving cohesion, Leon said.\n\nLow oil inventories\n\nThe post-meeting statement said the decision came “in view of a steady global economic outlook and current healthy market fundamentals, as reflected in the low oil inventories.” The Opec+ countries agreed in December to start a gradual return from last April of the 2.2 million barrels per day of previous production cuts.\n\nThe latest move, a year ahead of an initial 18-month schedule, completes the unwinding and also provides for a 300,000 barrels per day tranche granted specifically to the United Arab Emirates.\n\nThe statement added that the phase-out of the additional voluntary production adjustments may be paused or reversed subject to evolving market conditions. The eight added that they will hold monthly meetings for a regular review of market conditions. For now, the return of other production cuts is to be discussed at the next Opec+ ministerial meeting at the end of November, with all 22 members.\n\nOpec said the V8 will first meet on September 7.\n\nIn a bid to boost prices, the wider Opec+ group — comprising the 12-nation Organisation of the Petroleum Exporting Countries (Opec) and its allies — in recent years had agreed to three different tranches of output cuts, amounting to almost six million bpd in total.\n\nMarket experts warn that forecasting is particularly challenging given the uncertainty emanating from US President Donald Trump’s tariffs policy and its effects on global trade, as well as his 10-day deadline for Russia to end the war in Ukraine.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/010929312cf9a49.jpg?r=092941",
  "retrievedAt": "2025-08-16T07:00:52.402Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928547/v8-nations-aim-to-boost-oil-output-by-05m-barrels",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:08:56.000Z"
}
