{
  "title": "76 dead, dozens missing after migrant boat sinks off Yemen - World - DAWN.COM",
  "author": null,
  "content": "At least 76 people have been killed and dozens are missing after a boat carrying mostly Ethiopian migrants sank off Yemen, in the latest tragedy on the perilous sea route, officials told AFP on Monday.\n\nYemeni security officials said 76 bodies had been recovered and 32 people rescued from the shipwreck in the Gulf of Aden. The UN’s migration agency said 157 people were on board.\n\nThe accident occurred off Abyan governorate in southern Yemen, a frequent destination for boats smuggling African migrants hoping to reach the wealthy Gulf states.\n\nSome of those rescued have been transferred to Yemen’s Aden, near Abyan, a security official said.\n\nUN agency the International Organisation for Migration earlier gave a toll of at least 68 dead.\n\nThe IOM’s country chief of mission, Abdusattor Esoev, told AFP that “the fate of the missing is still unknown.”\n\nDespite the civil war that has ravaged Yemen since 2014, the impoverished country has remained a key transit point for irregular migration, in particular from Ethiopia which itself has been roiled by ethnic conflict.\n\nEach year, thousands brave the so-called “Eastern Route” from Djibouti to Yemen across the Red Sea, in the hope of eventually reaching oil-rich Gulf countries such as Saudi Arabia and the United Arab Emirates.\n\nThe IOM recorded at least 558 deaths on the Red Sea route last year, with 462 from boat accidents.\n\nLast month, at least eight people died after smugglers forced migrants to disembark from a boat in the Red Sea, according to the UN’s migration agency.\n\nThe vessel that sank off Abyan was carrying mostly Ethiopian migrants, according to the province’s security directorate and an IOM source.\n\nYemeni security forces were conducting operations to recover a “significant” number of bodies, the Abyan directorate said on Sunday.\n\nOn their way to the Gulf, migrants cross the Bab al-Mandab Strait, the narrow waterway at the mouth of the Red Sea that is a major route for international trade, as well as for migration and human trafficking.\n\nOnce in war-torn Yemen, the Arabian Peninsula’s poorest country, migrants often face other threats to their safety.\n\nThe IOM says tens of thousands of migrants have become stranded in Yemen and suffer abuse and exploitation during their journeys.\n\nIn April, more than 60 people were killed in a strike blamed on the United States that hit a migrant detention centre in Yemen, according to the Houthi rebels that control much of the country.\n\nThe wealthy Gulf monarchies host significant populations of foreign workers from South Asia and Africa.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/04111541342bb32.jpg",
  "retrievedAt": "2025-08-16T06:58:46.984Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928661/76-dead-dozens-missing-after-migrant-boat-sinks-off-yemen",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T06:19:43.000Z"
}
