{
  "title": "Siraj stars as India beat England by six runs in fifth-Test thriller to draw series - Sport - DAWN.COM",
  "author": null,
  "content": "Mohammed Siraj was the hero as India beat England by just six runs in a thrilling fifth Test at the Oval on Monday to end the series level at 2-2.\n\nEngland, set 374 to win, were bowled out for 367, with fast bowler Siraj taking 5-104, including a sensational burst of 3-9 on Monday’s final morning.\n\nIt is India’s narrowest winning margin in a Test match.\n\n“To be honest, it is so amazing,” Siraj told Sky Sports. “From day one to here, everyone fought so hard, so we are very happy.\n\n“I just wanted to make sure I hit the right areas, the wickets would fall, and anything else would be a bonus.\n\n“When I woke up, I believed I could do it.”\n\nAfter resuming on 339-6, England lost four wickets for 28 runs on the final morning of a dramatic series.\n\nThe home side were soon 354-8 after Siraj, the leading bowler on either side this series, struck twice to remove Jamie Smith and Jamie Overton.\n\nWhen injured England last man Chris Woakes came in to bat with his left arm strapped up owing to an injured shoulder, England still needed 17 more runs for victory.\n\nGus Atkinson hit a six off Siraj before England got the target down to single figures.\n\nBut Siraj set the seal on a superb series by bowling Atkinson (17) as he knocked over the batsman’s off stump to spark delirious scenes among the India team and their supporters in south London.\n\nIndia were without Jasprit Bumrah at the Oval after deciding to stand by a decision to only play the world’s top-ranked Test bowler in three games of this five-match series.\n\nSiraj, who featured throughout, ended the series with 23 wickets at 32.43.\n\nSmith and Overton had struggled to get the ball off the square on their Surrey home ground on Sunday.\n\nAnd with play starting Monday beneath grey skies, conditions favoured India’s quicks.\n\nOverton pulled the first ball of the day, from Prasidh Krishna, for four – a shot greeted by huge cheers from England fans in an impressively large Oval crowd — and under-edged the second for another boundary\n\nSiraj took up the attack from the Pavilion End and promptly twice beat Smith on the outside edge.\n\nAnd with the third ball of his over Siraj had Smith caught behind, without the batsman adding to his score, to leave England 347-7.\n\nThe next delivery saw new batsman Atkinson edge the lion-hearted Siraj just short of the slip cordon.\n\nBut it was his Surrey county colleague Overton who fell next, lbw for nine to a Siraj ball angling into his pads. Overton reviewed but Kumar Dharmasena’s decision was upheld on umpire’s call.\n\nTailender Josh Tongue was then given out lbw to Krishna but the batsman’s review saw the decision overturned.\n\nEngland had been cruising to victory while Harry Brook (111) and Joe Root (105) were sharing a fourth-wicket partnership of 195 on Sunday.\n\nHowever, Brook’s exit sparked a mini-collapse, with England losing three wickets for 36 runs and Root also among those dismissed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/04172238a47c70c.jpg",
  "retrievedAt": "2025-08-16T06:58:26.184Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928692/siraj-stars-as-india-beat-england-by-six-runs-in-fifth-test-thriller-to-draw-series",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T12:33:09.000Z"
}
