{
  "title": "Russia urges caution in nuclear ‘rhetoric’ after Trump comments - World - DAWN.COM",
  "author": null,
  "content": "Russia urged caution on Monday after United States President Donald Trump said he would deploy two nuclear submarines following an online row with former Russian president Dmitry Medvedev.\n\nTrump said he had ordered the deployment in response to what he alleged were highly provocative comments by Medvedev, saying the submarines would be positioned in “appropriate regions”.\n\nTrump did not say whether he meant nuclear-powered or nuclear-armed submarines. He also did not elaborate on the locations, which are kept secret by the US military.\n\n“Russia is very attentive to the topic of nuclear non-proliferation. And we believe that everyone should be very, very cautious with nuclear rhetoric,” Kremlin spokesman Dmitry Peskov told reporters, including from AFP, on Monday.\n\nThe row between Medvedev and Trump erupted against the backdrop of the US leader’s ultimatum for Russia to end its military offensive in Ukraine or face fresh economic sanctions, including on its remaining trading partners.\n\nMedvedev — one of Russia’s most prominent anti-Western hawks — accused Trump of “playing the ultimatum game” and said that Trump “should remember” that Russia was a formidable force.\n\n“Each new ultimatum is a threat and a step towards war. Not between Russia and Ukraine, but with his own country,” he said.\n\nMedvedev, who has not posted on social media since the spat, is currently the deputy chairman of Russia’s Security Council. He served one term as president from 2008 to 2012, effectively acting as a placeholder for Putin, who was able to circumvent constitutional term limits and de facto remain in power.\n\nThe chief of staff to Ukrainian President Volodymyr Zelensky on Monday backed Trump’s actions.\n\n“The concept of peace through strength works,” Andriy Yermak wrote on social media.\n\n“The moment American nuclear submarines appeared, one Russian drunk — who had just been threatening nuclear war on X — suddenly went silent.”",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/04190101e1cb154.jpg",
  "retrievedAt": "2025-08-16T06:58:18.728Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928698/russia-urges-caution-in-nuclear-rhetoric-after-trump-comments",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T14:03:48.000Z"
}
