{
  "title": "1,300 surveillance cameras to improve traffic policing in Karachi: IGP - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Says traffic challans will be sent directly to citizens at their homes after implementation of Karachi Safe City Project\n• Sindh police organise walk to pay tribute to those who lost their lives in the line of duty\n\nKARACHI: Public complaints and misunderstandings involving traffic police will be resolved once 1,300 surveillance cameras under the Safe City Project become operational in Karachi, said Inspector General of Sindh Police Ghulam Nabi Memon on Sunday.\n\nHe was speaking to the participants of a five-kilometre race, titled Shuhda Run, held in memory of 2,500 police martyrs. Over 1,000 participants, including prominent personalities, women and children, took part in the run.\n\nHe said that the purpose of the walk was to raise awareness among citizens about physical health and traffic laws, and to ensure compliance with the law.\n\nThe IGP noted that citizens often faced inconvenience when being physically checked by the police, but with the implementation of the first phase of the Sindh government’s Safe City Project across the metropolis, they would be spared such checks.\n\nHe stated that the “issues” arising from physical checks between the police and the general public would also be eliminated, while tickets (challan) for traffic violations would be sent directly to citizens’ residences.\n\n“Definitely, it would put an end to complaints and criticism against the police,” he said, adding that it would ease the process of checking of vehicles and improve overall policing.\n\nHe added that the smart cameras would enable the police to monitor citizens and vehicles using modern technology, while fines for traffic violations would be delivered to violators at their homes.\n\nHe lamented that unnecessary criticism could dampen the morale of even the most dedicated officers.\n\nCommenting on the city’s complex demographics, he said Karachi, being a mega city, attracts people from across the country seeking employment — some of whom also bring with them personal disputes or enmities.\n\nHowever, he claimed that due to effective and results-oriented policing, the number of killings had been reduced by up to 500 per cent compared to previous years.\n\nHe highlighted that over 2,500 police personnel had been martyred in Sindh while fighting crime over the past some decades.\n\n“At the provincial level, every year on August 4, we remember and pay tribute to our martyrs. The purpose of organising such programmes is to ensure that we never forget them and their memories will always be an asset to us,” he said.\n\nKarachi police chief Additional IG Javed Odho, DIG Traffic Pir Moha­mmed Shah and other senior officers also participated in the run.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688fe7696834c.gif",
  "retrievedAt": "2025-08-16T06:59:41.716Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928592/1300-surveillance-cameras-to-improve-traffic-policing-in-karachi-igp",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:10:15.000Z"
}
