{
  "title": "Declaring buildings ‘hazardous’ without following due process termed injustice - Pakistan - DAWN.COM",
  "author": null,
  "content": "KARACHI: The Jamaat-i-Islami (JI) on Sunday demanded a comprehensive evaluation exercise before deciding the fate of the buildings which had been declared ‘hazardous’ and ‘dilapidated’ in the city, especially those located in Gulistan-i-Jauhar.\n\nSpeaking at a press conference in Gulistan-i-Jauhar alongside hundreds of residents of the buildings, which had been declared dangerous by Cantonment Board Faisal a couple of days ago, JI-Karachi chief Monem Zafar said that declaring buildings hazardous without following due procedure and necessary diligence was tantamount to injustice.\n\n“Faisal Cantonment issued a list of 62 residential units — bungalows and apartments — that were labelled as dangerous, without any engineering survey,” he claimed.\n\n“The move by the cantonment created a deep unrest among the affected people. It is the builders who should be held legally responsible for the maintenance of the apartments. Whereas cantonments need to ensure water, sewerage and road facilities to residential units within their remit.”\n\nJI leader alleges Faisal Cantonment labelled 62 residential structures in Gulistan-i-Jauhar as ‘dangerous’ without any engineering survey\n\nHe further said that residents of Gulistan-i-Jauhar and other areas of Faisal Cantonment should not be threatened or forced out of their houses.\n\nThey have the right to live peacefully, he said, adding that no injustice would be tolerated in this regard.\n\nOn the occasion, the JI leader announced that a help-desk had already been established by the JI to provide information and support to the affected residents.\n\nHe further said that the JI would also knock the door of the judiciary if need be.\n\nFurthermore, he said that the JI responded positively to the appeals of the affected residents and took up the issue and it had already constituted a committee and held a meeting with the chief executive officer of the Faisal Cantonment Board to share the concerns and suggestions in order to resolve the issue amicably.\n\nHighlighting the plight of Karachi, he said that both the province and the centre receive massive shares from the city but unfortunately neither of them takes ownership of the metropolis.\n\n“As a result, the economic hub of the country has been turned into an epicentre of challenges. Six cantonment boards along with KMC operate in Karachi whereas the lack of performance and coordination results in sufferings for Karachiites,” said the JI leader.\n\nMeanwhile, Dawn reached out to Faisal Cantonment officials for their version but to no avail.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:59:34.906Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928591/declaring-buildings-hazardous-without-following-due-process-termed-injustice",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:10:15.000Z"
}
