{
  "title": "Two varsities in Islamabad without permanent rectors as appointments stall - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The inordinate delay in appointing rectors for Comsats University Islamabad (CUI) and the International Islamic University Islamabad (IIUI) has raised serious questions about the efficiency of the respective supervising ministries.\n\nWhile Comsats currently has a temporary rector, the position at IIUI remains vacant. Dr Mukhtar Ahmed, who had been looking after the affairs of IIUI in his capacity as chairman of the Higher Education Commission (HEC), completed his term on July 29 and is no longer serving as the rector.\n\nThe Ministry of Science and Technology is the line ministry for Comsats, while the Ministry of Federal Education supervises IIUI.\n\nThe post of Comsats rector has been vacant since July 2023, following the resignation of Dr Mohammad T. Afzal. Subsequently, the university’s chancellor - the then president Dr Arif Alvi - assigned the look-after charge to Senior Dean Prof Dr Sajid Qamar, who continues to serve in that capacity on an ad-hoc basis. Several other key positions at Comsats, including the registrar’s office, are also being run on a temporary basis.\n\nPosts at public sector universities fell vacant in 2023 and since then permanent heads could not be appointed\n\nSimilar is the situation at the IIUI. The post became vacant in November 2023 after the Supreme Court removed then rector Dr Samina Malik and directed that the HEC chairman or a permanent HEC member nominated by him would oversee the rector’s responsibilities until a regular appointment was made.\n\nFollowing the directive, then HEC chairman Dr Mukhtar Ahmed assumed additional charge as the IIUI rector. However, with the completion of his term on July 29, the university is again without a rector. Although the prime minister assigned the secretary federal education the additional charge of HEC chairman for three months or until a regular appointment, no steps have been taken to fill the IIUI rector position.\n\n“As of today, there is no rector in our university,” said an IIUI official.\n\nA senior officer from the Ministry of Education claimed that the process was underway to assign the charge of the rector to someone soon. However, university officials have voiced concern over why the position has remained vacant since October last year despite the court’s directive.\n\nMeanwhile, the issue of Comsats’ rector has seen even longer delays. In September 2023, following a competitive selection process, a panel of three candidates was submitted to the President’s Office for final approval. After thorough consideration, President Asif Ali Zardari in his capacity as the Comsats Chancellor approved the appointment of Dr Shahid Munir with the Ministry of Science and Technology issuing a notification on September 23, 2024.\n\nHowever, Dr Munir did not take charge as Comsats rector as he was appointed Vice Chancellor of the University of Engineering and Technology (UET), Lahore, on the same day. Since then, the matter has remained unresolved.\n\nAccording to a Comsats official, the issue is likely to be resolved soon, as the university’s senate, its supreme decision-making body, was expected to meet in the third week of August to deliberate on the appointment.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2024/04/2210425548f37d4.jpg?r=104315",
  "retrievedAt": "2025-08-16T06:59:22.397Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928542/two-varsities-in-islamabad-without-permanent-rectors-as-appointments-stall",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:10:33.000Z"
}
