{
  "title": "Agriculture: Sesame seeds’ bubble bursts - Newspaper - DAWN.COM",
  "author": null,
  "content": "In Pakistan, sesame, once regarded as a low-input crop suited mainly to marginal and rain-fed lands, has undergone a remarkable transformation in recent years. Its cultivation expanded rapidly, spilling over into fertile, irrigated regions. The sown area surged from just 83,336 hectares in 2018 to 399,770 hectares by 2023, according to the Food and Agriculture Organisation.\n\nProduction followed suit, rising from 35,699 tonnes to 301,237 tonnes over the same period. Even more striking was the export boom: sesame shipments — mostly in raw form — soared from $39 million in 2020 to $417m in 2023 (Trade Map). With this, Pakistan emerged as the fifth-largest exporter of sesame seeds globally.\n\nAt its core, sesame’s appeal lies in its low production cost and short crop duration of 100 to 120 days. It needs only 1–2 kg of seed per acre, two irrigation rounds, and minimal fertiliser — about one-fourth the requirement of cotton, rice, or maize. These factors made it especially attractive to resource-poor farmers, already burdened by high prices of fertiliser, diesel, pesticides, and electricity.\n\nAnother key factor behind sesame’s rise was its strong export potential. Higher international prices, coupled with the sharp depreciation of the Pakistani rupee — from Rs105 per US dollar in 2017 to around Rs280 in 2023 — pushed local prices upward. In September 2023 (harvesting season), sesame fetched as much as Rs17,000 per maund (40 kg) in local markets.\n\nLow prices and heavy post-rain losses bring down the once seemingly unstoppable boom to a halt\n\nWith low production costs, reasonable yields, and sky-high market prices, the crop’s economics became too attractive to ignore. As a result, the cultivated area expanded further in 2024. In Punjab alone — which accounts for around 90 per cent of the country’s production — sesame was planted on 0.71 million hectares, as reported by the province’s Agriculture Department. Even in the Sahiwal division — highly fertile and well-irrigated lands — sesame covered over 107,500 hectares.\n\nYet this rapid growth also reflects a deeper policy vacuum. In the absence of a coherent crop zoning policy or long-term strategic direction from the government to prioritise crop acreage, farmers simply followed the money — a textbook bandwagon effect.\n\nUnfortunately, what once seemed like an unstoppable boom has come to a screeching halt. According to the provisional first estimate of the 2025 crop by the Crop Reporting Service, Agriculture Department, Punjab, the cultivated area in the province has dropped sharply to just 444,500 hectares this year.\n\nThis massive decline — around 37pc — stems from two major factors: First, sesame prices plummeted, falling from Rs17,000 per maund for the 2023 crop to around Rs11,000 for the 2024 crop in domestic markets.\n\nSecond, the August 2024 rains coincided with the harvesting window, leading to extensive harvest and post-harvest losses. These factors significantly eroded farmers’ profits, and as a result, many switched to alternative crops in 2025, hoping for better returns.\n\nThe situation has worsened further in 2025, dealing another blow to sesame farmers and likely leading to an even sharper decline in acreage next year. The heavy downpour over a short span created waterlogged conditions — not just in low-lying areas, but also on well-levelled and normally well-drained fields.\n\nSesame, being highly sensitive to such conditions, has suffered greatly from these rains. In multiple pockets of sesame-growing districts across Punjab — particularly in the Sahiwal division — a significant portion of the standing crop has been damaged, with plants wilting and dying.\n\nRecent rains have exposed serious flaws in the drainage of rainwater from agricultural lands in Central and South Punjab. Unplanned construction and illegal encroachments along rivers, streams, railway tracks, and natural waterways have severely disrupted the natural flow of water. As a result, farmers now face a new challenge: stagnant water lingering in fields long after heavy downpours, damaging crops.\n\nFortunately, the situation, though serious, is not without remedies. Groundwater recharge wells — boreholes accompanied by recharge chambers made from local materials like bricks and gravel — need to be promoted at the farm level across Punjab. These wells not only facilitate the drainage of excess rainwater from fields but also help replenish the rapidly depleting groundwater.\n\nThis cost-effective solution can be scaled up quickly through awareness campaigns and targeted subsidies for farmers. In addition, the intervention can be integrated into the Punjab government’s ongoing watercourse lining programme.\n\nTo promote sesame cultivation effectively, the government must invest in research to develop high-yielding seed varieties that are resistant to shattering and capable of withstanding emerging climatic stresses. These improved varieties should also be compatible with mechanised harvesting, reducing reliance on manual cutting and sun-drying — a process that remains highly vulnerable to weather disruptions and results in significant harvest and post-harvest losses.\n\nIn addition, agricultural extension services should promote raised-bed planting as a more efficient and climate-resilient alternative to traditional broadcasting methods for sesame. They should also advocate the use of potash fertiliser, which enhances plant immunity and strengthens overall crop resilience.\n\nIn conclusion, Pakistan’s agricultural landscape is undergoing rapid transformation, driven by climate change and declining global crop prices. At this critical juncture, it is essential for policymakers to formulate a forward-looking strategy that boosts overall agricultural productivity and improves farmers’ welfare. The sooner this is done, the better it will be for the future of Pakistan’s economy.\n\nMr Wattoo is a development professional and a farmer, and Dr Waqar Ahmad is a former associate professor at the University of Agriculture, Faisalabad.\n\nPublished in Dawn, The Business and Finance Weekly, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688e928e48066.jpg",
  "retrievedAt": "2025-08-16T06:58:43.826Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928406/agriculture-sesame-seeds-bubble-bursts",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:09:09.000Z"
}
