{
  "title": "Shifting sands - Newspaper - DAWN.COM",
  "author": null,
  "content": "President Trump’s long-anticipated tariff overhaul has arrived, bringing the highest US tariffs in over a century. While the final rates are somewhat milder than those signalled on April 2, 2025 (dubbed “Liberation Day” by Trump), the global trading system has clearly entered a new and uncertain phase.\n\nThe United States remains the top export destination for around 40 countries, including key South Asian economies where US exports account for roughly one-fifth of total outbound trade. With textiles and clothing at the heart of their export portfolios, even slight shifts in US tariff levels carry significant weight.\n\nUnder the new tariff regime, Pakistan faces a 19 per cent duty, Bangladesh and Sri Lanka 20pc, and India 25pc, placing India at a relative disadvantage. However, India is currently negotiating a bilateral free trade agreement, with hopes of finalising it later this month. The starkest change, though, is directed at China. Despite accounting for 26pc of US textile imports, nearly double the combined share of Bangladesh, India, and Pakistan, China now faces tariffs of 30pc on manmade textiles and 37.5pc on cotton goods.\n\nIf these rates hold, sourcing patterns may begin to shift in favour of South Asian exporters. Still, even countries like Vietnam, with a stable 20pc tariff and a 13pc US import share, face rising scrutiny under tougher Rules of Origin enforcement. The US has warned that transhipment of Chinese goods through Vietnam could lead to punitive 40pc tariffs. However, according to the International Monetary Fund, Vietnam’s rising domestic value addition may shield it from such penalties.\n\nIf Trump’s tariff rates hold, sourcing patterns may begin to shift in favour of South Asian exporters\n\nThere are already signs that supply chains are adjusting. Egypt, benefiting from a lower 10pc tariff, has attracted investor interest as a potential manufacturing hub. China has secured land for export-focused industrial zones near the Suez Canal under the Belt and Road Initiative. Meanwhile, Egypt is modernising its textile sector, which once made up 40pc of its exports but now accounts for less than 3pc. The aim is to turn premium cotton into high-value finished goods and re-enter global textile markets.\n\nBeyond tariffs, broader bilateral realignments are also underway. While many remain undisclosed, some early developments offer clues. Pakistan has welcomed the new US trade agreement and sees potential for expanded investment in infrastructure and energy. President Trump has publicly cited Pakistan’s “massive oil reserves,” which the US may help develop. According to the US Energy Information Administration, Pakistan may hold over 9 billion barrels of petroleum and 105 trillion cubic feet of natural gas, including shale.\n\nUntil these reserves are developed, however, Pakistan remains reliant on energy imports, meeting 80pc of its needs through Middle Eastern suppliers. As part of its evolving engagement with Washington, Pakistan is now exploring US crude oil imports. In a notable first, Pakistan’s largest refiner, Cnergyico, has arranged a test shipment of one million barrels of US crude, expected to arrive in Karachi in October 2025.\n\nThe global trade order is undergoing a profound transformation. This includes changes not only in tariff structures but also in supply chain flows and cross-border investment. While some countries may see short-term gains, long-term success will depend on how quickly and effectively they adapt. For developing economies, higher tariffs are not the only risk.\n\nThe greater challenge is to treat this disruption as a chance to move up the value chain, diversify exports, and strengthen industrial capacity.\n\nIf Pakistan remains committed to the tariff and trade policy reforms announced in its latest budget and continues improving its competitiveness, it can position itself to benefit meaningfully from this evolving global landscape. This is not just a tariff adjustment. It is a rewiring of global trade. Pakistan must not stand still.\n\nThe writer is a member of the Prime Minister’s Steering Committee on US Tariffs. He has previously served as Pakistan’s Ambassador to the World Trade Organisation and FAO’s representative to the United Nations at Geneva.\n\nPublished in Dawn, The Business and Finance Weekly, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:58:45.767Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928412/shifting-sands",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:09:09.000Z"
}
