{
  "title": "Lady doctor ‘murdered’ by brother ‘over refusing to serve food’ in Jhang - Pakistan - DAWN.COM",
  "author": null,
  "content": "TOBA TEK SINGH: A young lady doctor, who recently returned from Kyrgyzstan after passing MBBS, was allegedly murdered by her brother in Mouza Haveli Lal Gagrana, Jhang, on Sunday.\n\nComplainant Iftikhar Ahmad Saqib, the uncle of deceased Dr Ayesha Bibi (20), claimed in his FIR that she was teaching children in the courtyard of her house when her brother Muhammad Umair asked her to cook for him. He said that on her refusal, the two exchanged harsh words. He alleged that her brother shot and killed her.\n\nHowever, it is also being claimed that the victim was killed for ‘honour’ as she had secretly contracted marriage with her class fellow before returning to Pakistan.\n\nMeanwhile, the man being claimed to be her husband, Dr Husnain, of Bagh, had issued a statement contradicting the reports about his marriage to the deceased. He called the claim ‘propaganda’ to defame him and his family.\n\nThe Satellite Town police have been conducting raids to arrest the suspect who fled after the murder.\n\nIn another similar incident, a boy allegedly murdered his sister over delay in cooking food in Chak 564 GB, Jaranwala.\n\nThe Bachiana police said Muhammad Arbaz fired on his elder sister Aneela Bibi, who was critically wounded and died instantly.\n\nACID ATTACK: A first-year college student received serious burn injuries after two unidentified youngsters threw acid on her in Mouza Mehram Sial, Jhang on Sunday night.\n\nThe Masson police said victim Bushra Fatima (17) was asleep in the courtyard of her house when two unidentified assailants forced their entry, threw acid on her and fled. She received critical injuries and was shifted to the burns unit of the Jhang DHQ hospital.\n\nPolice have claimed to recover a bottle of hydrochloric acid and search is underway to trace the accused.\n\nPunjab Chief Minister Maryam Nawaz took notice of the incident and sought a report from the police. She also directed the DPO to ensure the arrest of the culprits at the earliest. The CM also directed the hospital’s MS to provide the best possible treatment to the victim.\n\nDIES: Another victim of the electric transformer incident in Jaranwala succumbed to his burn injuries on Saturday night at the Allied Hospital.\n\nThe man, identified as Muhammad Ramzan (50) of Chak 234 GB, was among the seven people who were seriously burnt after an electric transformer fell on them in Masjid Bazaar in Jaranwala three weeks ago.\n\nThe death toll of the incident has climbed to three. A few days ago, a child identified as Ammar (7) also succumbed to his burns at the Allied Hospital, while bank employee Tanweer Ahmad died in the same hospital a week ago. Four more injured were also undergoing treatment at the hospital.\n\nARRESTED: The Jhang Anti-Corruption Establishment (ACE) have arrested a police constable on Sunday for allegedly taking a bribe.\n\nACE circle officer Saeed Akhtar said Shahid Abbas had extorted Rs1.1 million as bribe from a citizen for getting his son a job in police.\n\nSUICIDE: A man died by suicide in Mohallah Shah Kabeer, Jhang, on Sunday.\n\nPolice said deceased Abid Ali (40) had a dispute with his in-laws and after failing to reconcile the matter, he hanged himself from the ceiling in his house.\n\nINJURED: A woman and her three minor children received serious burn injuries in a fire that erupted after a pressure cooker exploded in a house near Abdali Chowk located in Samanabad area of Faisalabad on Sunday.\n\nThe victims were identified as Sania Bibi (25), her daughter Muntsha Fatima (3) and two sons Abdul Rafey (2) and eight-month old Aoun Muhammad. They were shifted to the burns unit of Allied Hospital.\n\nMeanwhile, three factory workers received serious burn injuries at a powerloom factory in Rasoolpura locality of Faisalabad. The fire broke out due to an electric short circuit.\n\nThe injured, identified as Khurram (38), Maqbool (65) and Ashraf (62), were also shifted to the burns unit of Allied Hospital.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-16T06:59:21.498Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928550/lady-doctor-murdered-by-brother-over-refusing-to-serve-food-in-jhang",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:10:26.000Z"
}
