{
  "title": "Terror potpourri - Newspaper - DAWN.COM",
  "author": null,
  "content": "DESPITE persistent denials by the Afghan Taliban that terrorist groups are using their country as a safe haven, the global consensus — backed by evidence — is that Afghanistan indeed continues to be a base for militants and violent extremists.\n\nFor example, the latest edition of the relevant UN Security Council monitoring report on IS and Al Qaeda reveals that both the banned TTP and IS-K continue to operate in Afghanistan with relative freedom.\n\nIn fact, where the latter group is concerned, the report says that IS-K poses a major threat regionally and internationally. The UN document again validates what Pakistan has long been arguing — that the Afghan Taliban are not doing enough to address the presence of terrorist groups on their soil, and that these outfits pose a significant challenge to regional security.\n\nWith regard to the TTP, which has been carrying out terrorist attacks in Pakistan with regularity, the report states that the outfit has some 6,000 fighters, and that it “continued to receive … logistical and operational support” from the Afghan Taliban.\n\nThis is despite the fact that some within the Afghan Taliban were of the view that Afghanistan’s de facto rulers should distance themselves from the TTP. The document also observes that the TTP maintains ties with IS-K, Al Qaeda as well as Baloch militants.\n\nInterestingly, the TTP seems to be ‘diversifying’ its options, as it has links with both the Afghan Taliban and IS-K, which oppose one another. The UN report points out that IS-K “is the most serious threat” regionally and internationally. For this country, it should be a matter of great concern that this dangerous group is reportedly operating “close to the Pakistani” border, where it is training suicide bombers, who include minors.\n\nThese findings should prompt the Pakistani state, regional countries as well as the international community to address the problem of militancy in Afghanistan with alacrity. Though the Foreign Office has said there has been “better receptivity” to Pakistan’s concerns in Kabul, concrete action is needed from the Afghan Taliban regime to ensure that the potpourri of terrorist groups operating from Afghan soil do not transform into a global security nightmare.\n\nWhile Pakistan needs to secure its borders and ensure that TTP and IS-K terrorists are not able to enter the country and find a foothold here, on its part, Kabul must do much more to neutralise the militant threat in Afghanistan. The prospect of the TTP and IS-K joining forces is a frightening one, and this budding terrorist alliance must be nipped in the bud.\n\nThe TTP has spilt innocent blood for years in this country, while the world has witnessed the horrors that the IS is capable of inflicting in the Middle East. Therefore, urgent action is needed to address the problem of terrorist groups in Afghanistan.\n\nPublished in Dawn, August 4th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/02/150756276e19eb8.jpg?r=080249",
  "retrievedAt": "2025-08-16T06:58:52.771Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928640/terror-potpourri",
  "dateList": "2025-08-04",
  "date_published": "2025-08-04T00:13:38.000Z"
}
