{
  "title": "Passion, HR management, strengthened institutions vital for making a nation strong: President Alvi",
  "link": "https://www.app.com.pk/national/passion-hr-management-strengthened-institutions-vital-for-making-a-nation-strong-president-alvi/",
  "date_published": "2022-06-29T10:53:00.000Z",
  "source": "APP",
  "content": "KARACHI, Jun 29 (APP): President Dr. Arif Alvi here on Wednesday said that continuous reigniting passion for the country, availability of quality human resource in all sectors and strengthening of the institutions were essential ingredients for making a nation strong.\nThe president addressing 35th convocation and graduating ceremony of Air War Course at Air War College Institute said that quality leadership capable of taking timely and effective decisions , overcoming bias was two other vital prerequisites for achieving glory for a nation.\nPakistan was created on basis of two nation theory and passion and national self esteem served as foundations of the theory, President Alvi said adding that passion and love for a country needed to be reignited continuously and persistently to ensure security, solidarity and development of the homeland.\nHe said that it was the same passion that led Pakistan to develop nuclear deterrence within seven years despite having various challenges, limited human resource and financial constraints and now owing to its nuclear capability, the country possessed an impregnable and resilient position in comity of the nations with formidable deterrent to any foreign aggression.\n“This passion to be used as a resource to create national cohesion and uniformity of purpose to integrate the nation together for pursuing common aims and objectives,” he noted.\nPakistan was endowed with exceptional Human Resources which when provided with the right resources and leadership could do wonders, Dr. Arif Alvi said and stressed the need of putting the skilled human resource to right use, providing fast track skill and knowledge to unskilled and semi skilled sections of the population irrespective of gender or disability.\nHuman resource management was the core strategy behind progress of developed nations while world was now focused on artificial intelligence and cyber technology, he observed and suggested bringing automation, artificial intelligence and information and cyber technologies in use in agriculture, services and industrial sectors so that Pakistan could get cyber edge and ensure fast track progress and development of the nation.\nDr. Alvi said that Pakistan also provided right leadership, took timely decisions coupled with implementation with commitment which helped the country to defeat COVID-19 much better than any of our neighbouring countries and many countries of the world.\nHe said Pakistan always demonstrated great moral leadership and despite its meagre resources had been providing since four decades refute to 4 million refugees mostly out of its own resources.\nOn the other hand many countries of the west were spending three billion Euros to keep the refugees out of their geographical boundaries while many refugees lost their lives in sea and on land when they were not accepted by the receiving countries, he noted and said that the treatment and value accorded to Ukrainian refugees should also be extended to all other refugees without any discrimination and bias.\nReferring to Pakistan’s war on terror, President Alvi said that Pakistan successfully defeated the menace of terrorism which the entire world failed to curb and one of our neighbouring states got severely polarized due to terrorism.\nDr Arif Alvi felicitated graduating officers on successful completion of the course and advised them to keep the flame of knowledge seeking ignited for their entire life as tools of defence were constantly changing and technologies were continuously evolving.\nEarlier, President Air War College Institute, Air vice Marshal Hussain Ahmed Siddiqui, presented course report and highlighted salient features of the MS degree course of one and a half year duration.\nAs many as 70 officers completed the war course which included 35 officers of Pakistan Air Force, 7 officers of Pakistan Army and 10 Pakistan Navy Officers. 18 officers of 10 friendly countries including Saudi Arabia, Jordan, Sri Lanka, Bangladesh, Indonesia, Nigeria, Malaysia, Egypt, Yemen and Iraq also completed their graduation course from the Air War College Institute.\nEarlier in the convocation, President Dr. Arif Alvi awarded degrees to officer who successfully completed the graduation course of National Security and Strategic Studies at the Air War College Institute.",
  "retrievedAt": "2025-08-11T15:10:18.569Z"
}
