{
  "title": "Systematic, proactive disaster risk management crucial to manage ongoing climate disasters: Sherry",
  "link": "https://www.app.com.pk/national/systematic-proactive-disaster-risk-management-crucial-to-manage-ongoing-climate-disasters-sherry/",
  "date_published": "2022-06-29T15:05:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Federal Minister for Climate Change Senator Sherry Rehman on Wednesday said systematic and proactive disaster risk management was crucial to managing the ongoing climate calamities.\nThe minister was addressing as the chief guest at the concluding session of two-day multi-hazard based National Simulation Exercise (SIMEX) organised by the National Disaster Management Authority (NDMA) with support of Welt Hunger Hilfe (WHH) and UN in Pakistan here, said a news release.\nDuring SIMEX, the syndicates were subjected to simulated disaster situations entailing to a medium scale earthquake; and Glacial Lake Outburst Floods (GLOF), riverine/rain induced flooding/ Cloud burst leading to urban flooding.\nSubsequently, the syndicates were assessed/ evaluated on contingency and emergency response plans and humanitarian/relief actions.\nIn her keynote address, the minister appreciated the efforts of NDMA and the UN in Pakistan for spearheading such an exercise to evaluate preparedness level, disaster management and the way forward.\nShe said that Pakistan was on the frontlines of climate change with floods, landslides, torrential rains, GLOF events, and earthquakes.\nThe minister urged the stakeholders to enhance the capacities of local communities to deal with crises at the grass root level and replicate simulation exercises at provincial level.\nIn his concluding remarks, the Chairman NDMA lauded the level of participation and performance of relevant federal and provincial authorities & departments in simulation exercises.\nWhile underlining the importance of the exercise, he said that SIMEX had provided an opportunity to improve our national response mechanism and these kinds of exercises would be continued in the future.\nHe assured NDMA’s support and cooperation to all stakeholders to reduce the risk and impacts of disaster.\nAt the end, the minister distributed certificates among the participants of SIMEX.",
  "retrievedAt": "2025-08-11T15:10:13.650Z"
}
