{
  "title": "PM appeals nation to follow SOPs amid COVID-19 surge",
  "link": "https://www.app.com.pk/national/pm-appeals-nation-to-follow-sops-amid-covid-19-surge/",
  "date_published": "2022-06-29T09:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jun 29 (APP): Prime Minister Shehbaz Sharif Wednesday appealed the nation to follow the anti-COVID SOPs as a surge was being recorded in the coronavirus cases in the country.\nThe prime minister, who chaired a meeting to discuss the COVID situation, said that the frontline health workers and doctors had rendered numerous sacrifices to keep the countrymen safe from the disease,, and also paid tribute to them.\nTherefore, he urged the people not to squander the success achieved against the coronavirus.\nThe prime minister directed the chief secretaries of the provinces to ensure implementation of the SOPs at crowded places, besides enforcing full vaccination, booster doses, use of masks and sanitizers.\nHe also called for use of masks and sanitizers at the cattle markets set up ahead of Eidul Azha, weddings and other private gatherings.\nThe prime minister said the adherence to the SOPs was inevitable for the safety of one’s own as well as the dear ones.\nHe said the performance of all institutions particularly the National Command and Operation Center (NCOC) had been laudable during the COVID-19 pandemic.\nThe meeting was briefed in detail about the COVID-19 situation at local as well as the global level.\nIt was told that overall a downward trend was being observed in the number of cases across the world.\nThe participants were told that the new variant of the Omicron led to a recent surge in coronavirus cases in the country. On June 28, over 3% cases were reported in the country on June 28, though the ratio of hospitalization in this variant was lesser than that of the previous waves.\nThe health authorities told the meeting that 86% of above 12 years population had been fully vaccinated while 93 percent got at least single shot. Currently, the country’s capacity was to vaccinate around 200,000 people per day.\nIt was told that whole of Sindh population had been fully vaccinated while the vaccination process was underway in Punjab and other provinces.\nMoreover, the steps were being taken to strictly monitor the movement of people on border and Pass Track APP was also being improved to make it easier to use.\nThe prime minister also directed the authorities concerned not only to ensure the enforcement of the SOPs but also carry out a mass awareness drive on the subject.\nFederal minister Abdul Qadir Patel, Rana Sanaullah, Sherry Rehman, National Disaster Management Authority chairman, federal secretaries of information and national health services, and other senior officers attended the meeting.\nThe chief secretaries of the four provinces joined the meeting via video link.",
  "retrievedAt": "2025-08-11T15:10:19.395Z"
}
