{
  "article_id": "2025-01-20_35dd4b13572dee3dcb8511653fae77cd",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886464/displaced-gazans-head-home-through-rubble-as-truce-begins",
    "retrieved_at": "2025-08-26T07:49:39.398Z"
  },
  "metadata": {
    "title": "Displaced Gazans head home through rubble as truce begins - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-20T01:20:20.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678d9fa3616aa.gif",
    "categories": [],
    "word_count": 490,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "JERUSALEM: Thousands of displaced, war-weary Gazans set off across the devastated Palestinian territory to return to their homes on Sunday, after a long-awaited truce between Israel and Hamas went into effect following an initial delay. The ceasefire began nearly three hours later than scheduled, during which time Israel's military said it was continuing to operate in Gaza, with the territory's civil defence agency reporting 19 people killed and 25 wounded in bombardments. Thousands of Gazans carrying tents, clothes and their personal belongings were seen heading back to their homes, after more than 15 months of conflict that displaced the vast majority of the territory's population, in many cases more than once. In the northern area of Jabalia, hundreds of Gazans streamed down a sandy path, returning to an apocalyptic landscape dotted with piles of rubble and destroyed buildings. People return to an apocalyptic landscape dotted with piles of rubble and destroyed buildings And in the main southern city of Khan Yunis, people celebrated their pending homecoming. \"I'm very, very happy,\" said Wafa al-Habeel. \"I want to go back and kiss the ground and the soil of Gaza. I am longing for Gaza (City) and longing for our loved ones.\" The truce had been scheduled to begin at 0630 GMT (8:30 am) but a last-minute dispute over the list of hostages to be freed on the first day led to the holdup. The truce is intended to pave the way for a permanent end to the war, but a second phase has yet to be finalised. It follows a deal struck by mediators Qatar, the United States and Egypt after months of negotiations. 'Full of hope' In Gaza City, well before the ceasefire went into effect, people were already celebrating, waving Palestinian flags in the street. But when it became clear the truce had been delayed, the joy gave way to desperation for some. \"Enough playing with our emotions - we're exhausted,\" said Maha Abed, a 27-year-old displaced from Rafah. The Israeli army warned Gaza residents on Sunday not to approach its forces or Israeli territory. \"We urge you not to head towards the buffer zone or IDF forces for your safety,\" military spokesman Avichay Adraee said on Telegram, adding that \"moving from south to north via Gaza Valley puts you at risk\". In Israel, the ceasefire was met with guarded optimism. \"I don't trust our side or their side,\" said taxi driver David Gutterman. \"Always at the last moment something, a problem, can pop up, but all in all I'm really happy.\" Shai Zaik, an employee at Tel Aviv's art museum, said he had \"mixed feelings\", but was \"full of hope\" that the prisoners would return. \"We had so many disappointments in the last year,\" he said, \"so we won't believe it until it really happens, until we see them (the hostages) with our own eyes, and then we will be happy I hope.\" Published in Dawn, January 20th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}