{
  "article_id": "2025-01-20_2d0192645f37822286888a8a5888b18e",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886515/2-shot-dead-over-personal-dispute-in-karachis-site-area-police",
    "retrieved_at": "2025-10-12T00:55:37.748Z"
  },
  "metadata": {
    "title": "2 shot dead over ‘personal dispute’ in Karachi’s SITE area: police - Pakistan - DAWN.COM",
    "author": null,
    "date_published": "2025-01-20T07:22:39.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 241,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "Two people were shot dead and two others were injured in Karachi's SITE area on Monday, according to a police statement. Pak Colony Station House Officer (SHO) Malik Mumtaz said that the incident occurred due to a \"personal dispute\" adding that further investigation was underway. The people who were killed included 45-year-old Asad Ullah and 20-year-old Sami Ullah. Meanwhile, the injured were identified as Ameer Abdullah, 35 years old, and 44-year-old Ikram Ullah. The injured and deceased were shifted to the Jinnah Postgraduate Medical Centre (JPMC). Initial investigations revealed that the children of the deceased and injured had a fight with some boys passing through the neighbourhood a day prior, although the matter was resolved on the spot, according to the SHO. However, the families suspect that the shooters are the same individuals with whom there was a fight. The police have started questioning the injured and further investigations are underway to determine the motives behind the incident and the people involved, SHO Malik said. Earlier, an unidentified young woman was killed in an execution-style shooting in Orangi Town. Amid widespread backlash, police authorities last year decided to control growing street crime in the metropolis and set up special teams to collect and analyse data from the closed-circuit television camera footage using the latest technology. On Saturday, two muggers were sentenced to seven years in prison in a case pertaining to the snatching of mobile phones from citizens in Karachi's Malir.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}