{
  "article_id": "2025-01-20_573eaf7ddcea791f0884990325ba4ffa",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886570/england-beat-pakistan-by-6-wickets-in-icc-u19-womens-t20-world-cup",
    "retrieved_at": "2025-08-26T07:49:05.109Z"
  },
  "metadata": {
    "title": "England beat Pakistan by 6 wickets in ICC U19 Women’s T20 World Cup - Sport - DAWN.COM",
    "author": null,
    "date_published": "2025-01-20T14:55:48.000Z",
    "image_url": "https://i.dawn.com/medium/2024/09/66f8c1cb79465.jpg",
    "categories": [],
    "word_count": 213,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "England beat Pakistan by six wickets in their ICC U-19 Women's T20 World Cup match at the Johor Cricket Academy Oval in Johor, Malaysia on Monday, according to the Pakistan Cricket Board (PCB). The PCB said in a statement that England chased the 67-run target in 9.2 overs to seal their first win of the tournament. Pakistan, who were awarded one point for their washed-out opening game against the US, are now placed third in Group B with Ireland at fourth. After England invited Pakistan to bat first, the Komal Khan-led outfit lost wickets at regular intervals slipping to 35-5 in 9.2 overs and then 66 all out in 18.5 overs. Zoofishan Ayyaz top-scored with a 13-ball 15 with the help of two boundaries, while Komal contributed with 12 off 25 balls with the help of two fours. For England, Amuruthaa Surenkumar was the pick of the bowlers with figures of 3-17, while Tilly Corteen-Coleman and Olivia Brinsden picked up two wickets each. In turn, England were reduced to 33-4 before player of the match Katie Jones (20 not out, 16b, 1x4, 1x6) stitched an unbeaten 34-run fifth-wicket stand with skipper Abigale Norgrove (14 not out, 9b, 2x4s). Mahnoor Zeb picked up two wickets, while Fatima Khan and Quratulain dismissed one batter each.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}