{
  "article_id": "2025-01-20_cd6c14cf71b8c2de47a40d405034b1d1",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886485",
    "retrieved_at": "2025-08-26T07:49:11.252Z"
  },
  "metadata": {
    "title": "CORPORATE WINDOW: Stifling market growth - Newspaper - DAWN.COM",
    "author": null,
    "date_published": "2025-01-20T01:39:25.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678da930ac834.gif",
    "categories": [],
    "word_count": 1052,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "Several silent but formidable forces have been hindering market competition in Pakistan's economic landscape: monopolies, cartels, and the dominance of state-owned enterprises (SOEs). These anti-competitive practices distort the market, exacerbate the price hike phenomenon, degrade product quality, and prevent new businesses from flourishing. This remains a significant barrier to the country's economic progress and the welfare of consumers. At the same time, one of the key reasons for the limited performance of the Competition Commission of Pakistan (CCP), the regulatory body in this regard, is the significant number of cases pending in the courts. In one of the cases against a key sector of the economy, the Sindh High Court imposed a penalty of Rs50,000 on the CCP for requesting early hearings as the case was pending for almost 10 years. A senior official of the CCP added that while cases were pending for years in the courts, the entities have had a free hand to increase prices at will or get involved in illegal business practices, leaving consumers vulnerable to price hikes and poor-quality products. Cartels and collusions Cartels are categorised as a threat to market health across multiple sectors as they manipulate market dynamics, controlling prices, restricting supply, and blocking the entry of new players. Pakistani markets festering with private and state-owned cartelisation are undermining competition The data available at the Pakistan Bureau of Statistics (PBS) shows that the price of cement increased by 190 per cent from Rs490 per bag in December 2020 to Rs1,420 per bag in December 2024. Similarly, the price of sugar, another essential commodity, has surged from Rs92 per kg in 2020 to around Rs150 per kg in 2024, representing an increase of over 66pc. The CCP, in 2022, fined major sugar producers after finding that they manipulated prices by holding back stock during peak demand periods, leading to artificial price hikes. Unfortunately, the order was challenged in court, and sugar prices continue to surge, now selling at an average of Rs150 per kg. The report found that the cartel's coordinated activities resulted in the average price of cement being 15-20pc higher than the market equilibrium, benefiting large firms at the expense of consumers. Steel price has also climbed significantly, reaching Rs246,000 per tonne in December 2024, compared to Rs126,000 per tonne in 2020, reflecting an increase of almost 97pc. These price hikes have severely impacted both consumers and small businesses, as cartels manipulate prices to maximise profits, undermining competition and inflating the cost of living. In 2023, the CCP issued a report revealing that a cartel involving cement producers led to inflated prices and higher profits for the manufacturers, while consumers bore the brunt of the price increase. Misuse of dominance The entities are also involved in the misuse of dominant positions, and it was a critical issue in Pakistan's markets, where large corporations and even the SOEs often leveraged their market power to suppress competition and exploit consumers. For instance, the fertiliser sector has a few dominant companies controlling the production and distribution of urea. In 2020, the urea was fixed at Rs1,665 per 50kg bag, but by 2023, this price has skyrocketed to Rs4,300 per bag, making it unaffordable for many small farmers. The CCP launched an inquiry into the sector in 2024 and found that urea manufacturers, in collusion with the Fertiliser Manufacturers of Pakistan Advisory Council (FMPAC), were collectively fixing prices instead of independently submitting their respective prices to the government. This price-fixing cartel has artificially inflated urea prices, making it increasingly difficult for small farmers to access this essential input. These practices have severely impacted agricultural productivity and food security in the country due to rising prices of edible items, mainly for urban consumers. The unhealthy economy due to the lack of competition restricts the entry of new businesses into the markets and leads to limited growth in innovation and price reduction. The barriers to entry include high licensing fees, bureaucratic hurdles, and aggressive tactics by dominant players to suppress newcomers. In many cases, these giants wield their market power to prevent smaller retailers from gaining market share, creating an uneven playing field that ultimately harms consumers. SOE's stifling competition Almost all sectors of the economy in the country have been dominated by the SOEs, and their overwhelming influence has compounded market challenges. SOEs in the energy, telecommunications, and transportation sectors have long held monopolistic control, creating a stifling environment for competition. In 2023, the National Electric Power Regulatory Authority (Nepra) reported that Pakistan Electric Power Company (Pepco) alone accounts for a significant portion of the country's Rs2.2 trillion energy sector debt. Pepco is a state-owned entity that controls over 60pc of Pakistan's electricity distribution. Pakistan's electricity tariffs are among the highest in the region, with average rates at Rs24 per kWh, compared to Rs10-15 in neighbouring countries like India and Bangladesh. While, the CCP is the authority tasked with checking collusion practices, investigating cartelisation, and ensuring fair competition in the market, it faces a key challenge that many companies involved in anti-competitive practices have been successful in getting the CCP into prolonged legal battles restricting the Commission to hold inquires or issue decisions and even implement the orders. Responding to the query, Chairman CCP Dr Kabir Ahmed Sindhu said that due to the high number of court cases, the Commission restructured its legal team to address a backlog of 567 cases. These cases involved penalties of Rs74 billion. He added that since the restructuring 73 cases have successfully been decided, including 11 in the Supreme Court, 31 in the Competition Appellate Tribunal (CAT), four in the Islamabad High Court (IHC), seven in the Lahore High Court (LHC) and 20 in Sindh High Court (SHC). Meanwhile, 177 cases have been bundled relating to challenging the CCP's legal framework as ultra vires. However, the number of cases challenging the establishment of the CCP or its activities was high in various country courts. There are 200 cases against the CCP in the apex court, 179 in CAT, 46 in the SHC, 43 in LHC and six in the IHC. Almost all the industry associations wherein the CCP took notice have challenged the establishment of the CCP and the competence of parliament to enact a law on the subject of competition. Published in Dawn, The Business and Finance Weekly, January 20th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}