{
  "article_id": "2025-01-20_8307befcf83beea707211f9c3d8fcf63",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886387/myanmar-junta-air-strike-kills-28-at-detention-centre-ethnic-group-says",
    "retrieved_at": "2025-08-26T07:49:48.241Z"
  },
  "metadata": {
    "title": "Myanmar junta air strike kills 28 at detention centre, ethnic group says - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-20T01:19:44.000Z",
    "image_url": "https://i.dawn.com/primary/2025/01/678d8a3c16e99.jpg",
    "categories": [],
    "word_count": 495,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "BANGKOK: A Myanmar junta air strike killed 28 people, including children, and wounded 25 at a temporary detention area in western Rakhine state, an ethnic minority armed group said on Sunday. The Arakan Army (AA) is engaged in a fierce fight with the military for control of Rakhine, where it has seized swaths of territory in the past year, all but cutting off the state capital Sittwe. The Rakhine conflict is one element of the bloody chaos that has engulfed Myanmar since the military ousted Aung San Suu Kyi's civilian government in a 2021 coup, sparking a widespread armed uprising. The AA posted on its Telegram channel that a military jet bombed a detention area in Mrauk-U Township around 4.45pm on Saturday, where family members of junta soldiers were being held by the AA. ASEAN leaders want Myanmar junta to prioritise ceasefire over fresh polls \"Those who were killed and wounded were family members of soldiers in Myanmar's Army. We arrested them during fighting,\" the AA said in the post. \"As we were preparing a plan to release them, they were bombed,\" the AA claimed. Nine children were among those dead, including a two-year-old boy, it said. The others killed were women, according to a list of the dead posted by the AA. The military is struggling to fight opposition to its rule on multiple fronts around Myanmar and it has been regularly accused of using air and artillery strikes to hit civilian communities. It is unclear whether the strike in Mrauk-U Township was mistargeted or if the junta was unaware the area was being used as a detention site for soldiers' families as well as youth-led \"People's Defence Forces\" that emerged to oppose the coup. The military is also battling numerous long-established and well-armed ethnic minority armed groups. These groups, which include the AA, control large areas of territory along Myanmar's borders. The UNDP earlier warned that Rakhine was heading towards famine as fighting squeezed commerce and agricultural production. The United Nations said this month more than 3.5 million people have been displaced by the conflict in Myanmar, an increase of 1.5 million from last year. Junta told to prioritise ceasefire Meanwhile, Association of Southeast Asian (ASEAN) foreign ministers told Myanmar's junta to prioritise a ceasefire in its civil war over fresh elections during a meeting in Malaysia on Sunday. \"One thing that we know, they want to have an election. But we told them that election is not a priority at the moment,\" Malaysian Foreign Minister Mohamad Hasan told reporters after the meeting of Asean foreign ministers on the Malaysian island of Langkawi. \"The priority now is (for a) ceasefire and everybody to stand down. It's very simple,\" Mohamad said. Malaysia is this year's rotating chair of the 10-member ASEAN. Myanmar was represented on Sunday by Aung Kyaw Moe, a senior civil servant in the foreign ministry after the regional bloc barred junta members from its meetings. Published in Dawn, January 20th, 2025",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}