{
  "article_id": "2025-01-20_b8542019357a6677af706fcf34f06cf2",
  "source_info": {
    "source_name": "Dawn",
    "source_link": "https://www.dawn.com/news/1886529/uk-teen-pleads-guilty-to-southport-girls-murder-that-triggered-riots",
    "retrieved_at": "2025-08-26T07:49:07.345Z"
  },
  "metadata": {
    "title": "UK teen pleads guilty to Southport girls’ murder that triggered riots - World - DAWN.COM",
    "author": null,
    "date_published": "2025-01-20T08:39:08.000Z",
    "image_url": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
    "categories": [],
    "word_count": 560,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "A teenager on Monday pleaded guilty to killing three young girls in a stabbing spree last year that sparked the UK's most violent riots in a decade. On what was set to be the opening day of his trial, Axel Rudakubana, 18, admitted to murdering the three girls at a Taylor Swift-themed dance class last year in Southport, northwest England. The stabbings sent shock waves across the UK, triggering unrest and riots in more than a dozen English and Northern Irish towns and cities, including in Southport and Liverpool. Authorities blamed far-right agitators for fuelling violence, including by sharing misinformation claiming the alleged attacker was a Muslim asylum seeker. Bebe King, six, Elsie Dot Stancombe, seven, and Alice da Silva Aguiar, nine, were killed in the attack in the seaside resort near Liverpool on July 29, 2024. Ten others were wounded, including eight children, in one of the country's worst mass stabbings in years. Rudakubana admitted a total of 16 charges, including the three counts of murder, 10 counts of attempted murder and one count of possessing a blade. He also admitted production of a biological toxin, ricin, as well as possessing an Al-Qaeda training manual, although the attack has not been treated as a terror incident. Wearing a grey tracksuit and a surgical mask, the teenager refused to stand in court and did not speak except to say the word \"guilty\". The judge ruled that he would be sentenced on Thursday. In December, not guilty pleas had been entered on Rudakubana's behalf when he refused to speak in the court, and the case had been set for a four-week trial. The unrest linked to the killings lasted several days, and saw far-right rioters attack police, shops, hotels housing asylum seekers as well as mosques, with hundreds of participants subsequently arrested and charged. Rudakubana was born in Wales to parents of Rwandan origin, and lived in Banks, a village northeast of Southport. Despite being 17 years old at the time, restrictions on reporting Rudakubana's name were lifted in August due to concerns over the spread of misinformation. Taylor Swift, then in the middle of her Eras tour, wrote on Instagram that she \"was completely in shock\" after the attack on the dance class at the start of the school holidays. The pop star reportedly met two of the survivors of the attack during her August shows in London. The UK's head of state King Charles III also travelled to Southport in August to meet with survivors, inspecting a sea of floral tributes laid outside the city's town hall. Catherine, Princess of Wales, and Prince William visited Southport in October \"to show support to the local community,\" Kensington Palace said. It was their first joint public engagement since Kate ended a course of chemotherapy for cancer. The UK's interior minister Yvette Cooper said on Monday that the coming days \"will be a deeply traumatic and distressing time for the families\". But she said it was important for the legal process to be allowed to carry on so that \"justice can be done\". Police had warned against fuelling rumours on social media about the attack. \"We would strongly advise caution against anyone speculating as to motivation in this case,\" Chief Constable Serena Kennedy was quoted as saying. She urged people to be patient and \"don't believe everything you read on social media\".",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}