{
  "title": "NDRMF social performance audit: MoCC writes AGP for enhancing capacity, transparency",
  "link": "https://www.app.com.pk/national/ndrmf-social-performance-audit-mocc-writes-agp-for-enhancing-capacity-transparency/",
  "date_published": "2020-05-06T21:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 07 (APP):Ministry of Climate Change (MoCC) has written a letter to the auditor general of Pakistan (AGP) to hold special performance audit of the National Disaster Risk Management Fund (NDRMF) for enhancing its capacity and transparency.\nA ministry official Thursday told APP that MoCC Secretary Naheed Shah Durrani had written a letter to the AGP on the directives of the prime minister.\nAccording to the letter, a copy available with this official news agency, the NDRMF is a not-for-profit company incorporated with the Securities and Exchange Commission of Pakistan (SECP), under Section 42 of Companies Act 2017, working under the administrative control of the MoCC.\n“It is a government-owned, non-banking financial intermediary with a corporate structure which works for reducing the socioeconomic and fiscal vulnerability of the country and its population to natural hazards and climate change, through financing investments in disaster risk reduction and preparedness that have high economic impacts.”\nThe letter said the prime minister had directed for conducting a special performance audit of all the funds granted to the NDRMF since December 2016 till date, within two months, in order to improve efficiency and transparency of the fund.\nIt may be mentioned here that the NDRMF is the first government organization to respond to National Disaster Management Authority (NDMA) and it has provided over Rs8billion to the authority to contain COVID-19 risk in the country.\nThe fund has established its structure from the scratch and became functional in just 15 months. It has its independent board of governors and a very diligent team of experts serving in the NDRMF.\nThe NDRMF is collaborating with the ministry in its Ecosystem Restoration Fund and Ten Billion Tree Tsunami project and its 19 different projects were in the implementation process across the country.\nThe fund was financing projects for provincial governments and non-public sector partners through a 70 percent financial grant in the areas of flood protection infrastructure, early warning systems, retrofitting of public infrastructure, multi-hazard vulnerability risk assessments and community based disaster risk management.\nThe NDRMF has a very transparent process of issuing funds to different public and non-governmental organizations (NGOs) for executing various disaster management projects.",
  "retrievedAt": "2025-08-11T19:11:30.368Z"
}
