{
  "title": "Rs88.1673905 billion disbursed among 7,227,077 families under Ehsaas Emergency Cash Programme",
  "link": "https://www.app.com.pk/national/rs88-1673905-billion-disbursed-among-7227077-families-under-ehsaas-emergency-cash-programme/",
  "date_published": "2020-05-06T22:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, May 07 (APP):A total amount of Rs88.1673905 billion has been disbursed among 7,227,077 beneficiaries so far under different categories of Ehsaas Emergency Cash Programme.\nAccording to the details provided by Ehsaas Emergency Cash Programme, this amount has been disbursed among the daily wage, piece-rate workers and deserving ones till 10.00 a.m of May 7, since the beginning of the payment process under Ehsaas Emergency Cash Programme on April 9.\nTill today, an amount of Rs1.557937 billion has been disbursed among 124,755 beneficiaries in Azad Jammu and Kashmir, Rs4.088255 billion among 333,886 beneficiaries of Balochistan, Rs0.631137 billion among 49,306 beneficiaries in Gilgit-Baltistan and Rs0.3304855 billion among 27,172 beneficiaries of Islamabad Capital Territory.\nAn amount of Rs16.553901 billion has been disbursed among 1,337,660 beneficiaries of Khyber Pakhtunkhwa, Rs36.693369 billion among 3,011,975 beneficiaries in Punjab and Rs28.312306 billion among 2,342,303 beneficiaries in Sindh.\nThe total disbursed amount also included due payments of Rs1.44 billion to the Kafalat beneficiaries.\nNational Database and Registration Authority (NADRA) offices have been opened countrywide to facilitate beneficiaries of Ehsaas Emergency Cash Programme who were facing problems in withdrawing cash due to faulty biometric identification and registration of deaths eligible family members.\nThe beneficiaries will be able to resolve their issues regarding biometric verification and death registration within 24 hours. The fee of Rs50 charged for death registration has been waived off for the beneficiaries.\nThose applicants who have received SMS from 8171 that their data is being scrutinized will get the message regarding their eligibility by the current week.\nThe beneficiaries having expired Computerized National Identity Cards can receive their payments as per their eligibility from payment centre of Ehsaas by showing their old CNIC.\nThe citizens who are not registered through 8171 for government assistance are requested not to visit payment centres to avoid unnecessary crowding and enabling the deserving people to receive their payments easily.",
  "retrievedAt": "2025-08-11T19:11:30.017Z"
}
