{
  "title": "India planning false flag operation in Pakistan, AJK: Masood",
  "link": "https://www.app.com.pk/national/india-planning-false-flag-operation-in-pakistan-ajk-masood-2/",
  "date_published": "2020-05-07T01:59:00.000Z",
  "source": "APP",
  "content": "MIRPUR (AJK): , May 07 (APP):Azad Jammu Kashmir (AJK) President Sardar Masood Khan Thursday said Indian like bifurcation of Kashmir and its merger with the Indian Union, claim over Azad Kashmir and Gilgit-Baltistan, and grants of domicile of Kashmir to millions of Indian Hindus were far more dangerous than the action of August 5 and would lead to a horrible future of Kashmiri people.\n“Prepare for what the BJP-RSS regime plans to do in future. Its vile repertoire includes false flag operations, attack on Azad Kashmir, proxy wars. They can also try to drive a wedge between Arabs and Pakistan.”, Masood Khan while addressing a group of Kashmiri doctors from across the world, including Pakistan through a video link, according to the AJK Presidential Secretariat.\nHe said India was trying to manufacture a new political elite/class in the Indian Occupied Jammu and Kashmir (IOJK) so they could use them to brutalize Kashmir, who would, however, be rejected by Kashmiris like the previous puppets were. A new political party had been launched in the IOJK to get the Kashmiris killed by the Kashmiris to consolidate India’s illegitimate occupation of Kashmir, he added.\n“We are to inculcate unity in our rank and file, and fight India inside Kashmir as well as every forum and every capital in the world,” he said, adding India had waged a religious war, which would not remain confined to Kashmir and India, but it would be fought in Dubai, Kuwait, Qatar and Riyadh also.\nSardar Massod said there was no magic wand for winning freedom for Kashmir. President Khan said “it’s a game of political power, strategic leverage and economic prowess. Diplomacy will work but to an extent harking back to power dynamics. He urged to breach communication barriers to put across and broadcast Kashmir’s true story.”\nThe President said that the people of occupied Jammu and Kashmir are living a miserable life under the worst siege and lockdown for the last nine months, and now India had clamped another lockdown under the garb of coronavirus to cause more problems for them. He said that the Indian government had not adopted any strategy to save the lives of people in occupied Kashmir from coronavirus pandemic.\nThe AJK president said that the BJP-RSS regime had first declared a war against the Kashmiri people, and later took this war to the Muslims throughout India, and the Muslim world particularly the Arab nations has expressed sharp reaction over it. Now voices have started rising from Dubai, Qatar, Kuwait and other Muslim states in support of the Indian Muslims and Kashmiri people.\n“The Arab awakening against Hindutva now includes solidarity with the Kashmiri Muslims who are being killed like sacrificial animals by predatory Indian occupation forces.”\nWhile expressing thanks for the Pakistan Foreign Office for aggressively and effectively raising voice in support of the Kashmiri people amidst coronavirus, the AJK president said that our efforts on the global level should more intensify, and we must not let the UN Security Council to hold one or two informal sessions, and then to remain silent.\nSaying that bilateral process with India has never produced desired results, President called for the involvement of Kashmiris and inclusion of the UN in diplomacy, even in third party mediation. “If all stakeholders sit around a peace table, there could be conflict resolution and peace,” he added.\nSardar Massod said there was no magic wand for winning freedom for Kashmir. “It’s a game of political power, strategic leverage and economic prowess. Diplomacy will work but to an extent harking back to power dynamics.”\nHe urged to breach communication barriers to put across and broadcast Kashmir’s true story.\nThe president said the people of occupied Jammu and Kashmir were living a miserable life under the worst siege and lockdown for the last nine months, and now India had clamped another lockdown under the garb of coronavirus to cause more problems for them. The Indian government had not adopted any strategy to save the lives of people in occupied Kashmir from the coronavirus pandemic.\nHe said the BJP-RSS regime had first declared a war against the Kashmiri people, and later took the war to the Muslims throughout India, and the Muslim world, particularly the Arab nations, had\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T19:11:26.910Z"
}
