{
  "title": "PM policies to put country on path of progress: NA Speaker",
  "link": "https://www.app.com.pk/national/pm-policies-to-put-country-on-path-of-progress-na-speaker/",
  "date_published": "2020-02-19T23:56:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 20 (APP):National Assembly Speaker Assad Qaisar said that Prime Minister Imran Khan was working to address economic problems of the country that emanated from the wars being waged for interests of others in past.\nHe was addressing a Workers’ Convention in Marghuz, Swabi district. He said that so-called wars have destroyed “our social and cultural fabric besides negatively affecting business and economy of the country”.\nHe said that incessant efforts of Prime Minister and his result-oriented policies have put country on a course of development adding that the people have start enjoying the result of government’s initiatives to facilitate a common man.\nNA Speaker said that when PTI assume power all the public entities including PIA, WAPDA and Pakistan Steel Mills were in financial quagmire and the government was short of money to pay salaries. He said that prime minister restored the confidence of world on the country that invited foreign investment and support.\nAsad Qaisar said that government was reducing taxes on petroleum products aiming at reducing prices of petroleum products.\nHe said that for the first time in history mega development projects have been initiated in Khyber Pakhtunkhwa. He said that 220KV grid station would be constructed in Swabi that would address the problems of low voltage and power shutdown in the area.\nHe said that 1.2 billion rupees have been spend on gas projects and soon natural gas would be provided to each and every household in Swabi. He said that project of Pihur High Level Canal was underway that would help reclaiming barren land.\nNA Speaker said that shortage of doctors in hospitals of Swabi would be addressed by March, needed facilities would be provided to Baacha Khan Medical Complex and Technical College Gadoon and Girls Technical College would be upgraded.",
  "retrievedAt": "2025-08-11T18:50:02.350Z"
}
