{
  "title": "President seeks strong culture of voluntary blood donation in country",
  "link": "https://www.app.com.pk/national/president-seeks-strong-culture-of-voluntary-blood-donation-in-country/",
  "date_published": "2020-02-20T09:21:00.000Z",
  "source": "APP",
  "content": "KARACHI, Feb 20 (APP):President Arif Alvi Thursday stressed the need for a strong culture of voluntary blood donation in the country with equal attention towards cadaveric organ donation.\nTalking to the media during his visit to the LRBT Tertiary Teaching Hospital in Korangi, a locality largely inhabited by blue-collar workers, he said organ donation, be it cornea, kidney or liver, was a charity in itself.\n“It saves lives,” he emphasized reiterating that the relevance of blood donation also could not be ignored which ironically was rarely given due importance in the society.\n“We generally come forward only in a crisis situation while its importance cannot be overlooked at any cost.” Recalling his association with the LRBT Hospital, he said his visit to the facility was to see how it could be helped at current point of time.\n“It is definitely no mean feat that the LRBT through its chain of centres, scattered across the country, is catering a major chunk of the patients in need of eye care,” he said.\nPresident Alvi opined that such facilities and the people associated with them were role models, who must be duly projected so as to be a source of inspiration for the society in general.\nHe said it was a manifestation of philanthropic work and reputation the LRBT had earned for dedication to a cause related to the people with little or limited resources, which had helped it to get funds from different parts of the world as well by the locals.\n“It is heartening to see that these people, pertaining to different age groups are provided free of cost services and assistance,” President Alvi said referring to surgeries, treatment for eye-related injuries and other crucial support in terms of lens implantation, glasses and so forth.\nThe president also reiterated the need to raise public awareness about prevention of eye conditions and diseases that might also cause visual impairment.\nEarlier, he along with First Lady Samina Alvi took a round of the hospital and was briefed about its working coupled with efforts to further expand its satellite centres in remote and less privileged areas of the country.\nHe appreciated the state of art technology and the latest specialized equipment available for the treatment of the poor patients.\nOn the occasion, Najmus Saqib Hameed, Prof. Fawad Rizvi and Umer Ghafoor briefed him about the working of the trust. Member of the National Assembly Aftab Siddiqui and Member of the Sindh Assembly Shehzad Qureshi were also present on the occasion.\nPresident Alvi was informed that the LRBT had been operational since 1985 with the mission that “No man, woman or child should go blind”.\nWith the very objective it was said to run a network of 77 facilities countrywide, comprising 19 hospitals and 58 eye centres covering 78% of Pakistanis.\nThe LRBT is devoted to treat the poor patients in Pakistan suffering from any eye-related ailment – cataract, glaucoma, retina and corneal diseases among children, said of the staffers.\nIt was further claimed to have treated 44 million patients and conducted over 4.3 million sight restoration surgeries absolutely free of cost during the past 34 years.",
  "retrievedAt": "2025-08-11T18:49:54.179Z"
}
