{
  "title": "Chairman Kashmir Committee for pragmatic approach to promote agriculture, get autarky in food services",
  "link": "https://www.app.com.pk/national/chairman-kashmir-committee-for-pragmatic-approach-to-promote-agriculture-get-autarky-in-food-services/",
  "date_published": "2020-02-19T23:58:00.000Z",
  "source": "APP",
  "content": "PESHAWAR, Feb 20 (APP):Chairman, Parliamentary Committee on Kashmir, Syed Fakhar Imam here Thursday underlined the need for pragmatic approach of agriculture institutes and scientists to promote agriculture for economic prosperity and autarky in food in the country.\nHe was addressing the concluding-session of three-day national farmers convention and agriculture exhibition here at Pakistan Agriculture Academy for Rural Development (PARD).\nDirector General PARD, Farah Hamid Khan and Dr Gohar Saeed also addressed on the occasion. More than 150 farmers from across the country including Azad Kashmir participated in the 10th national farmers’ convention and agriculture exhibition at PARD.\nIn his key note address, Syed Fakhar Imam said Pakistan was basically an agricultural country with diversified climates and could achieve new heights of economic and agriculture prosperity through adaptation of modern science and technology besides research work in order to complete internationally.\nFakhar Imam said the country was facing problem of shortage of water and if this challenge was not addressed on priority basis, it would make negative effect on our agriculture production and food services in future.\nHe said water was lifeline for agriculture sector and priority should be given for construction of new dams in the country. He regretted that not a single big dam has been constructed after Turbela in Pakistan.\n“If we give top priority to agriculture and water sector than support of IMF’s would not be required in future,” he said.\nFakhar Imam said Kashmir was a long stand dispute and its resolution in accordance with wishes and aspirations of Kashmiris people was must for ensuring lasting peace in the region. He said over one lakh innocent Kashmiris were killed during last 30 years in Indian Occupied Kashmir.\nThe chairman Kashmir Committee appreciated the recent statements of United Nations Secretary General Antonio Guterres about Kashmir and violations of human rights in Indian occupied territory. He said UN Secretary General unbiased remarks over the Kashmir issue has endorsed Pakistan’s principles stand on Kashmir.\nHe said Pakistan has achieved great diplomatic victory after holding of unprecedented meeting of UN Security Council in August 2019 on Kashmir issue after Modi Government illegally abolished special status of Kashmir, saying role of China during UNSC’s rare meeting after 1965, was praised worthy.\nCPEC is an important project for Pakistan that would make the country forward on road to progress and development, he said adding Special Economic Zones (SEZ) would give upward boosting to industries and agriculture in our country besides bringing prosperity in lives of farmers.\nFakhar Imam said those nations that achieved heights of development and economic progress, was possible due to strong education system, quality research work and promotion of science and technology.\nHe said Pakistan has all the potential to join developed nations’ club by bolstering education, science and technology, adding role of agriculture universities in promotion of research work was paramount importance to increase per acre production.\nEarlier, he inspected different stalls setup by different organizations at PARD’s agriculture exhibition and appreciated the efforts of organizers for successful farmers convention and exhibition.\nEarlier, the farmers presented traditional Turban and Chadar to Syed Fakhar Imam besides a souvenir by DG PARD.",
  "retrievedAt": "2025-08-11T18:50:00.991Z"
}
