{
  "title": "Pakistan reminds India to penalize Samjhuta Express blast perpetrators",
  "link": "https://www.app.com.pk/national/pakistan-reminds-india-to-penalize-samjhuta-express-blast-perpetrators/",
  "date_published": "2020-02-20T09:17:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):Pakistan on Thursday reminded the Indian government of its responsibility to take serious and credible steps to bring the perpetrators of Samjhauta Express blasts to justice without further delay.\nForeign Office Spokesperson Aisha Farooqui, in her weekly press briefing, said the last year’s acquittal of the self-confessed mastermind of the blasts, Swami Aseemanand, and other accused only reconfirmed the culture of impunity that the perpetrators of terrorist attacks enjoyed under the Rashtriya Swayamsevak Sangh (RSS) / Bharatiya Janata Party (BJP)-led political dispensation in India.\nShe said as the current week reminded the painful tragedy of Samjhauta Express Train occurred 13 years ago, the families and the loved ones of the 68 victims of that terrorist attack, including 40 Pakistanis, still awaited justice.\n“The inordinate delay in justice for these victims, despite the availability of evidence, illustrates the unwillingness of the Indian government to hold the perpetrators to account for their barbaric action,” she commented.\nRegarding the human rights situation in Indian Occupied Jammu and Kashmir (IOJ&K), the spokesperson said on the 200th day of the lockdown on Thursday, the people in the IOJ&K continued to be deprived of their fundamental freedoms; their right to liberty, health, education and food as well as faced continued restrictions on their freedom of expression, freedom of assembly and freedom of religion.\nReferring to the visit and press briefing by Chairperson of the All Party Parliamentary Group on Kashmir in the British Parliament Debbie Abrahms MP on Wednesday, she said the UK parliamentarians had spoken up against the human rights violations in the IOJ&K.\nGving an overview of the three-day visit of United Nations Secretary-General (UNSG) Antonio Guterres to Pakistan, she said he had expressed “deep concern at the increase in tensions since last year” and stressed that the solution of the Jammu and Kashmir dispute lay in accordance with the Charter of the United Nations and the resolutions of the Security Council.\n“The unequivocal statement by UNSG serves to put to rest any confusion in any quarter, pertaining to the international status of the Jammu and Kashmir dispute and the need to resolve it in accordance with the UNSC resolutions and the aspirations of the Kashmiri people,” she remarked.\nThe UNSG appreciated Pakistan’s role in the Afghan peace process, extraordinary generosity and solidarity towards Afghan refugees and its contribution to peacekeeping missions.\nWhile visiting the Kartarpur Sahib Corridor, the UNSG called it “a welcome symbol of interfaith harmony, a unique experiment in cross-border ties, showing Pakistan’s commitment to peace.”\nTo a question, the spokesperson said Pakistan was keen to see the peace process move forward and lead towards an intra-Afghan dialogue.\nShe also rejected the impression being created by social media about any campaign by the Saudi government to detain and repatriate Pakistani nationals, saying every year, before the month of Ramazan, the Saudi authorities routinely carried out an exercise against the illegal expatriates and illegal workers especially in the Makkah region.\n“The assumption that it is a Pakistan-specific drive is completely incorrect. The campaign is not Pakistan-specific; Saudi authorities have arrested nationals of several countries as part of this drive,” she added.\nTo a question about the plight of Pakistani students living in the coronavirus-hit Wuhan city of China, she said a two-member team of Pakistan Embassy had visited the city to evaluate the situation and would remain deployed there until the quarantine was lifted.\n“Their mandate is to make sure that all needs of our students are addressed and provided to them. Their safety, well-being and health will be constantly monitored and ensured in close coordination/consultation with the respective university administration and Chinese authorities,” she remarked.\nAbout a letter written by four US Senators to Secretary of State Mick Pompeo expressing concerns about the Kashmir situation, she said Pakistan welcomed the latter that was yet another voice in that growing international call on the government of India to abide by international law, human rights conventions.\n“We hope that during the US president’s visit to India the issues being faced by the people of Indian Occupied Jammu & Kashmir will be raised with the Indian government and the offer of mediation expressed by the US president is taken forward through some concrete practical step,” she added.",
  "retrievedAt": "2025-08-11T18:49:54.132Z"
}
