{
  "title": "Capacity building of faculty is of high importance: Shafqat Mahmood",
  "link": "https://www.app.com.pk/national/capacity-building-of-faculty-is-of-high-importance-shafqat-mahmood/",
  "date_published": "2020-02-20T05:49:00.000Z",
  "source": "APP",
  "content": "Federal Minister for Education and Professional Training Shafqat Mahmood has said that\ncapacity building of faculty is very important besides bringing curriculum at par with\ninternational standards and requirements.\nHe said this while addressing the 83rd convocation of the Kinnard College for Women\nUniversity at the KCWU on Thursday. He said that revision of curriculum was essential so\nthat academia could ensure a real change to meet revolution in the education sector.\nHe said in present age quality and relevance of education were most important\nelements, adding that the role of teachers was very crucial as their guidance was\nof great importance for students.\nThe minister said that ‘Pakistan Research Day’ was observed for the first time on\nFebruary 19, adding that: “There is a need to make sure that research being\nconducted is aimed at resolving the problems facing the country.”\nThe minister said the Pakistan Tehreek-e-Insaf (PTI) government would not reduce\nfunds of the higher education, adding that Rs 5 billion had been allocated for\ngraduate scholarships.\nPotential students should not face any problem in acquiring education due to\nlimited resources, he said and added all graduate students were now entering\na new life so they must follow their goals with firm determination.\nHe also stressed students to pursue their goals for bringing about betterment in their\nlives besides making efforts to support others in different ways.\nHe said the constitution gave equal rights to all citizens, adding that problems could be removed through collective efforts.\nLater, the KCWU principal gave a souvenir to the minister.\nIt is pertinent to mention here that 653 students were awarded degrees while 14\nstudents received gold medals for their academic achievements.\nKCWU Principal Prof Dr Rukhsana David and others also spoke.",
  "retrievedAt": "2025-08-11T18:49:54.976Z"
}
