{
  "title": "Peace needs to be given a chance for regional growth, prosperity; says Sanjrani",
  "link": "https://www.app.com.pk/national/peace-needs-to-be-given-a-chance-for-regional-growth-prosperity-says-sanjrani/",
  "date_published": "2020-02-20T00:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Feb 20 (APP):Senate Chairman Muhammad Sadiq Sanjrani while leading delegation of senators spent a busy day in Bahrain and held separate meetings with Crown Prince of Bahrain besides Speaker of the Council of Representative Fowazia Binte Abdullah Zainal, Deputy Prime Minister of Bahrain Shaikh Muhammad Bin Mubarak Al-Khalifa and President of the National Guard of Bahrain, First Lt Gen Shaikh Muhammad Bin Isa Al-Khalifa.\nDuring his meeting with Crown Prince, the Senate chairman observed that Pakistan accords high importance to its relations with Bahrain and there is huge scope for further broadening bilateral cooperation in diverse sectors, said a press release.\nHe apprised the Crown Prince about his meetings with parliamentary leadership of Bahrain.\nThe Crown Prince while welcoming the delegation said the visit is taking place at an important time and it will go a long way in providing assistance to further broaden the multidimensional ties.\nThe Senate chairman, later on, led his delegation to meet with Speaker of Council of Representatives.\nThe meeting focused on strengthening bilateral institutional collaboration, enhance frequency of exchange of delegations and further increasing high level contacts.\nThe Senate chairman observed that there is need to explore new vistas of cooperation in trade and economic level as Pakistan offers a conducive environment for investment and government is taking all possible measures to provide friendly atmosphere to the investors.\nHe expressed his satisfaction that Pakistani diaspora in Bahrain is contributing to the socio-economic development and acting as a bridge between the two countries.\nHe also highlighted the issue of Kashmir and said that India is involved in blatant violation of international laws.\nHe said the Indian occupying forces have turned the valley into an open jail making the lives of innocent Kashmiris miserable.\nHe said the global community must take notice of these violations. He said Pakistan wants peace in the region as peace is the only panacea for growth and prosperity.\nDuring the meeting, Senate chairman apprised the Speaker of Bahrain about the functions and role of the Senate, Bahrani Speaker agreed with the views of Senate chairman and called for enhanced institutional contacts to benefit from each other experiences and expertise.\nThe Senate chairman was accompanied by senators Fida Muhammad, Mirza Muhammad Afridi, Sajjad Hussain Turi, Hafiz Abdul Karim, Manzoor Kakar, Abida Azeem and Keshoo Bai.\nThe Bahraini speaker later on hosted reception in honour of the delegation.\nThe delegation also held meeting with Deputy Prime Minister of Bahrain. The Senate chairman expressed his well wishes to the Deputy Prime Minister of Bahrain and said Pakistan values its bilateral relations with Bahrain and both sides have shown excellent cooperation in social, political and economic sectors.\nIn his meeting with President of the National Guard of Bahrain, the Senate chairman emphasised the need for more collaboration in defence and security.\nHe said the Middle East situation is concerning us all, however, he hoped that the regional countries would be able to adopt a mechanism to give peace a chance to flourish as war is not solution to issues and through dialogue and negotiations an amicable solution could be worked out.",
  "retrievedAt": "2025-08-11T18:50:02.146Z"
}
