{
  "title": "Fed Ombudsman directs authorities to resolve traffic issues",
  "link": "https://www.app.com.pk/national/fed-ombudsman-directs-authorities-to-resolve-traffic-issues/",
  "date_published": "2022-10-11T12:08:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): The Federal Ombudsman has directed the authorities concerned to formulate an effective action plan to address traffic issues in Islamabad which have grown more serious in recent years due to large scale migration from other provinces.\nHe called upon the ICT chief commissioner, the IG Police, the federal secretary communications, and the NTRC Chief in that regard.\nChairing a meeting in his office on Tuesday, he emphasized the need for better coordination and effective action by the authorities.\nIn the meeting, various constraints were highlighted by the agencies, such as acute shortage of manpower, meager fines, dearth of financial resources for construction of road infrastructure.\nVarious proposals and suggestions were discussed in the meeting to work out a feasible plan of action focusing short-term and long-term measures.\nMember Planning of Capital Development Authority (CDA) Waseem Bajwa said that some major roads were under construction but the CDA was working aggressively to complete the road infrastructure within the shortest possible time.\nHe further said that Metro buses had been started at different routes which would to some extent address the traffic issues in the city.\nDIG Operations Islamabad Police Sohail Zafar Chattha said that the new traffic system was initiated in ICT in 2006 with 656 traffic police officials. However, at present it was being run by only 606 officials, whereas population and number of vehicles had increased disproportionally in the ICT, he added.\nSSP Traffic Dr Syed Mustafa Tanveer said that under the Motor Vehicle Ordinance the fines on major violations were still as low as Rs 200, which needed to be enhanced considerably.\nNTRC Chief Hameed Akhtar said that most of the roads were designed for four-wheelers, whereas the number of two-wheelers and three-wheelers had increased by millions. Therefore, road traffic engineering needed due changes, he added.\nThe Federal Ombudsman asked the Islamabad traffic police to consider getting traffic volunteers from educational institutions for the time being to control traffic at different points in Islamabad.\nHe assured the Islamabad Traffic Police to take up the matters of shortage of manpower and increase in fine amount, especially for repeat violators of traffic rules, at the appropriate level.\nHe further said that road safety curriculum must be included in the text books from junior to college levels.\nHe also said that enforcement of law must be ensured and safe city infrastructure as well as public transport system/network should be improved in the ICT.\nThe Wafaqi Mohtasib Secretariat would coordinate the preparation of short-term and long-term plan to meet the challenges of traffic situation in Islamabad and would continue to monitor the progress in the coming weeks and months, he said.",
  "retrievedAt": "2025-08-11T15:42:43.304Z"
}
