{
  "title": "Mushaal strongly condemns Altaf’s custodial killing in Indian jail",
  "link": "https://www.app.com.pk/national/mushaal-strongly-condemns-altafs-custodial-killing-in-indian-jail/",
  "date_published": "2022-10-11T12:39:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):Peace and Culture Organisation Chairperson Mushaal Hussein Mullick on Tuesday strongly condemned the custodial killing of senior APHC leader Altaf Ahmad Shah in India’s notorious Tihar Jail.\nMushaal, who is wife of incarcerated senior Hurriyat leader Yasin Malik, said Altaf Ahmad Shah was suffering from kidney cancer, but denied of all the medical health facilities in the jail by the fascist Indian government.\nShe, in a news statement, lambasted the brutal occupied authorities for intensifying fascist tendencies to silence the dissenting voices in the Indian Illegally Occupied Jammu and Kashmir (IIOJK).\nShe said Altaf was kept in illegal detention in Delhi’s notorious Tihar Jail since 2017 for raising voice for the right to self-determination of Kashmiris.\nMushaal said that the notorious Narendra Modi-led Hindutva regime used all brutal tactics to muzzle his voice but they failed to get the desired results.\nShe vowed that the martyr was a great hero of Kashmiri people who preferred death but refused to bow down before the occupation forces.\nThe chairperson expressed her shock on the silence of international bodies over the custodial killing of Hurriyat leaders and young Kashmiris in Indian jails.\nMushaal went on to say that fascist Modi regime was hell bent on eliminating top Hurriyat leadership under a deep-rooted conspiracy as they were first being implicated in false and fabricated cases and then detained them in order to silence them forever.\nShe said that Altaf’s martyrdom was an irreparable loss for the freedom movement and vowed that the people of Kashmir would leave no stone unturned to turn the dream of breaking the shackles of Indian slavery a reality.\nMushaal said that several senior Hurriyat leaders including Yasin Malik were in notorious Tihar Jail and their lives were under great threat too.\nShe appealed to the UN Secretary General, human rights organizations and international community to build pressure on the notorious Modi led government to ensure immediate release of Kashmiri detainees and settlement of the decades-long Kashmir dispute as per the UN agreed formula and aspirations of Kashmiri people.",
  "retrievedAt": "2025-08-11T15:42:40.843Z"
}
