{
  "title": "Out-of-context portrayals create further division in already polarized atmosphere: President",
  "link": "https://www.app.com.pk/national/out-of-context-portrayals-create-further-division-in-already-polarized-atmosphere-president/",
  "date_published": "2022-10-11T10:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): President Dr Arif Alvi has taken serious notice of the news items published in various sections of the press wherein the President’s statement regarding the ‘cipher’ taken out of an interview with Aaj TV on Monday was “grossly misquoted and wrongly highlighted”.\n“In his interview, the President clearly said that he had suspicions about a conspiracy but of course, certainty could only be established after a thorough investigation was done,” a President House statement said issued here Tuesday.\nThe statement mentioned that “His position has not changed at all since he sent a letter to the Chief Justice of Pakistan wherein, he requested the Supreme Court for a thorough inquiry into the matter as he strongly believed that the issue must be investigated”.\n“He referred the matter to Supreme Court not because he had no suspicions about a conspiracy, but because he ‘had suspicions’ as the matter was raised by the ex-PM of the country and an impartial investigation was necessary including all the circumstantial evidence available,” as per the statement of the President House.\nThe statement mentioned that President Alvi in his interview had said that “We cannot ignore the fact that the national outfall of the ‘cipher’ and its repercussions led to political upheaval, therefore an impartial inquiry, beyond the demarche issued by the Govt of Pakistan, was requested”.\nThe President House termed it “unfortunate” that the words of the president were distorted on a very grave matter with serious implications.\nPresident Alvi has spoken many times on the issue of ‘out of context’ portrayals, including in the Parliament, that create more division in an already polarized atmosphere.",
  "retrievedAt": "2025-08-11T15:42:44.284Z"
}
