{
  "title": "Indian envoy summoned to convey strong protest over custodial death of Hurriyat leader Ahmed Shah",
  "link": "https://www.app.com.pk/national/indian-envoy-summoned-to-convey-strong-protest-over-custodial-death-of-hurriyat-leader-ahmed-shah/",
  "date_published": "2022-10-11T13:40:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):  The Indian Charge d’ Affaires (Cd’A) on Tuesday was summoned to the Ministry of Foreign Affairs to convey Government of Pakistan’s strong protest over the inhuman custodial death of Hurriyat leader Altaf Ahmed Shah, who had been imprisoned in the infamous Tihar Jail for the last five years.\nIt was deplored that despite Pakistan’s expression of serious concerns over Altaf Ahmed Shah’s sharply deteriorating health, as well as his daughter’s letter addressed to the Indian Prime Minister apprising him of Shah’s precarious health condition, the Indian government remained completely indifferent.\nIt was demanded of the Indian government to immediately investigate the custodial death of Altaf Ahmed Shah and hold to account all those responsible for the brutality, the Foreign Office Spokesperson said in a press release.\nPakistan has further demanded that the mortal remains of Altaf Ahmed Shah be promptly returned to his family so that a proper burial of the deceased in accordance with their wishes can be carried out.\nThe spokesperson further said that the government of India not only failed to provide satisfactory medical care to Altaf Ahmed Shah who was suffering from renal cancer but also created inordinate delays in his hospitalization and essential diagnostic tests.\nEven more heart-wrenching was the fact that the Indian authorities remained adamant in denying Shah’s family access to meet him while deliberately delaying the court hearing of his bail plea on humanitarian grounds.\nIt was evident that Altaf Ahmed Shah was victimized and punished because he was the son-in-law of revered Hurriyat leader Syed Ali Geelani and a true representative of the Kashmiri people.\n“His death is the consequence of the Indian government’s willful and deliberate negligence, utter disregard for human rights and its systematic campaign to suppress and brutalize the Hurriyat leaders,” it was added.\nRecalling the condemnable custodial death of Hurriyat leader Ashraf Sehrai last year, after his victimization and arrest under the draconian Public Safety Act (PSA), the Indian Cd’A was conveyed Pakistan’s grave apprehensions regarding the ruthless treatment meted out to Hurriyat leaders including Muhammad Yasin Malik, Massarat Aalam Bhat, Shabbir Ahmad Shah, Nayeem Ahmad Khan, Aasiya Andrabi and several others who have been facing illegal detentions in fabricated cases.\n“Equally concerning is the fact that many of these Hurriyat leaders including Muhammad Yasin Malik are suffering from chronic ailments and require urgent medical attention. It is also alarming that at least 4 Kashmiri political prisoners have died in Indian custody since 2019,” the spokesperson said.\n“The Government of India has also been called upon to desist from unlawfully keeping the indigenous Kashmiri leadership hostage and denying them their fundamental human rights, immediately halt its state-sponsored terrorism in the IIOJK, release all political prisoners incarcerated on trumped-up charges, stop human rights violations, lift the inhuman military siege and let the people of IIOJK exercise their right to self-determination as enshrined in the relevant UN Security Council resolutions and as per their wishes,” it was stressed.",
  "retrievedAt": "2025-08-11T15:42:39.800Z"
}
