{
  "title": "PM to participate in CICA summit in Kazakhstan",
  "link": "https://www.app.com.pk/national/pm-to-participate-in-cica-summit-in-kazakhstan/",
  "date_published": "2022-10-11T06:46:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP): Prime Minister Shehbaz Sharif will participate in the 6th Summit of the Conference on Interaction and Confidence Building Measures in Asia (CICA) being held in Astana, Kazakhstan, on 12-13 October.\nThe prime minister will be accompanied by members of the cabinet and senior officials, Foreign Office Spokesperson said in a press release on Tuesday.\nPrime Minister Shehbaz Sharif will address the plenary meeting of CICA on 13 October.\nHe will elaborate upon the significance of CICA as a unique forum for promoting interaction, understanding and collaboration amongst countries across Asia to address common challenges.\nHe will also highlight Pakistan’s perspective on regional and global issues.\nOn the sidelines of the summit, the prime minister will hold bilateral meetings with the leaders of various CICA Member States aimed at fostering greater cooperation, particularly in the fields of trade, investment and ”The Prime Minister’s participation in the CICA Summit attests to the importance attached by Pakistan to promoting connectivity and economic cooperation in Asia, in keeping with the objectives enshrined in the CICA Charter,” the spokesperson further added.\nCICA is an intergovernmental process comprising 27 countries from all across Asia.\nEstablished in 1992, it focuses on promoting peace, security and socio-economic development in the Asian continent. Pakistan is one of its founding members.\nCICA offers an invaluable platform for advancing the objectives of regional stability and prosperity through dialogue and win-win cooperation.\nIt promotes confidence building measures under five broad domains: economic dimension, environmental dimension, human dimension, new challenges and threats, and military-political cooperation.",
  "retrievedAt": "2025-08-11T15:42:46.918Z"
}
