{
  "title": "One more murder, APHC leader Altaf Ahmad Shah dies in Indian custody",
  "link": "https://www.app.com.pk/national/one-more-custodial-murder-aphc-leader-altaf-ahmed-shahs-dies-of-cancer-in-custody/",
  "date_published": "2022-10-11T08:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Oct 11 (APP):The incarcerated Senior All Parties Hurriyat Conference (APHC) leader, Altaf Ahmad Shah, 66, breathed his last on Monday night at New Delhi’s AIIMS Hospital, where he was shifted after diagnosed with last stage of renal cancer.\nShah, the son-in-law of iconic Kashmiri hurriyat leader late Syed Ali Gilani, had been languishing in infamous Tihar Jail since 2017.\nAccording to reports from Indian Illegally Occupied Jammu and Kashmir (IIOJK), the deceased leader was suffering from multiple ailments and was denied proper medical treatment by the Indian authorities that finally resulted in total deterioration of his health.\nSoon after the diagnosis of his renal cancer, his daughter Ruwa Shah, through a tweet had requested the Indian leadership to release the detainee on bail on health grounds so that he was treated properly, however she got no response.\nIt is pertinent to mention, Shah is not the first Kashmiri prisoner who had died in illegal detention. According to Kashmir Media Service (KMS), Earlier, Syed Ali Gilani, 92, embraced martyrdom at his residence on September 01, last year, while remaining under house arrest for over a decade.\nSenior APHC leader, Muhammad Ashraf Sehrai, 77, who was a close associate of Syed Ali Gilani, died on May 5 last year in a prison in Jammu. He was jailed under draconian law public Safety Act that allows the authorities to detain a person for up to two years without bail.\nAnother Hurriyat leader and former member of Jamaat-e-Islami in Indian illegally occupied Jammu and Kashmir, Ghulam Muhammad Butt, 65, embraced martyrdom in December 2019 in Naini jail in the Indian state of Uttar Pradesh.\nKashmiris from across the Line of Control including the APHC leadership, High Court Bar Association and civil society have strongly condemned the custodial murder.\nAPHC Vice Chairman Ghulam Ahmad Gulzar termed the death as case of target killing while APHC General Secretary Moulvi Bashir Ahmad Irfani described it as an irreparable loss to the freedom movement.\nThe IIOJK Bar Association in a statement expressed shock over Altaf Shah’s unattended death in Tihar Jail saying that it amounts to custodial death due failure of legal duty of the prison authorities and failure of the courts to protect the life of the under-trial prisoners.\nConvener APHC (AJK Chapter), Mehmood Ahmed Saghar termed it a custodial murder. “Fascist Modi regime is hell bent to eliminate leadership of Kashmiri freedom movement,” said Saghar.\nAnother Senior APHC leader, Altaf Hussain Wani has said denying Kashmiri prisoners the right to medical treatment was a killer-tactic Indian authorities have been deliberating using to punish and persecute Kashmiris who have refused to toe the Indian line.\nHe urged, world human rights organizations to take urgent attention towards the woeful plight of Kashmiri prisoners. He said, other Hurriyat leaders languishing in Tihar jail have also developed serious health issues due to non-provision of medical care and hygienic food.\nShah, the son-in-law of iconic Kashmiri hurriyat leader late Syed Ali Gilani, had been languishing in infamous Tihar Jail since 2017",
  "retrievedAt": "2025-08-11T15:42:49.015Z"
}
