{
  "article_id": "2025-04-10_217317039cef24cb9c984029d6014136",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/evacuation-of-illegal-foreign-residents-continues-857157-afghan-citizen-cards-holders-deported/",
    "retrieved_at": "2025-08-27T14:21:21.994Z"
  },
  "metadata": {
    "title": "Evacuation of illegal foreign residents continues; 857,157 Afghan Citizen Cards holders deported",
    "author": null,
    "date_published": "2025-04-10T18:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 491,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 10 (APP): Minister of State for Interior, Senator Talal Chaudhry, stated that the evacuation of illegally residing foreigners is ongoing and that there will be no extension in the deadline for their departure. So far, 857,157 illegal foreign residents and Afghan Citizen Card holders have been repatriated to their countries, he said. Talal Chaudhry mentioned that 815,247 holders of Afghan Citizen Cards are currently registered in Pakistan, and the PoR (Proof of Registration) program, which started in Pakistan in 2006, continued until 2023, during which 1,569,522 Afghan citizens were registered. He was addressing a press conference at the PTV Headquarters on Thursday. The Minister of State for Interior said that all foreign nationals are respected, but in light of the current terrorism situation, the decision for repatriation was made. He explained that the policy for the evacuation of illegal foreign nationals was prepared on October 30, 2023. In the first phase, foreigners without legal documents were sent back. In the second phase, on February 13, 2025, the Cabinet decided that Afghan Citizen Card holders would also be sent back, with a deadline set for March 31, 2025. In the third phase, Afghan Card holders are currently being repatriated. He emphasized that Afghans are our brothers and are highly respected, but the decision had to be made based on ground realities. He noted that many recent acts of terrorism in Pakistan are linked to Afghan citizens. Additionally, he stated that a large quantity of narcotics being smuggled into Pakistan originates from Afghanistan, and the funds from this trade are, in one way or another, linked to terrorism. Therefore, the decision to repatriate Afghan nationals has been made in Pakistan's national interest. Senator Talal Chaudhry pointed out that there have been attempts to create doubts and misconceptions regarding the repatriation of illegal foreigners. However, the Ministry of Interior has taken all provinces on board regarding this matter. He further said that a \"One Document Regime\" has been initiated, under which, just like citizens of any other country, Afghan nationals can enter Pakistan on a visa, do business, and reside legally. Those being sent back are encouraged to obtain visas and valid documents to return legally. He stressed that there is no longer any room for illegal residency in Pakistan. When the decision was made, transit points were established across provinces where Afghan nationals were provided with accommodation and food facilities. He said that the government's decision is to fully implement the One Document Regime for citizens of Afghanistan as well as any other country. Just as Pakistan's western border is regulated, the eastern border will also be regulated. He acknowledged the difficulty of regulating the 2,600 km long border, noting that terrorism often originates from there. He added that the Ministry of Foreign Affairs is in contact with the Afghan government on this matter, and there is a complete procedure for repatriation, including registration from both Pakistani authorities and Afghan authorities.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}