{
  "article_id": "2025-04-10_05d626d9d8aeea5bf20cc3634fdc8c9b",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pbm-hosts-special-lunch-for-cochlear-implant-recipients-reaffirms-commitment-to-hearing-impaired-children/",
    "retrieved_at": "2025-08-27T14:22:33.763Z"
  },
  "metadata": {
    "title": "PBM hosts special lunch for cochlear implant recipients, reaffirms commitment to hearing-impaired children",
    "author": null,
    "date_published": "2025-04-10T11:56:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 176,
    "reading_time_minutes": 1
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 10 (APP):Managing Director of Pakistan Bait-ul-Mal (PBM), Senator Captain Shaheen Khalid Butt, hosted a heartfelt lunch for the families of children who received cochlear implants, reaffirming PBMas commitment to supporting hearing-impaired youth. During the event, Senator Butt personally interacted with each child and their parents, inquiring about post-surgery care and expressing joy at the childrenas remarkable progress. aSeeing the renewed spark in these childrenas eyes is our greatest reward,a he remarked. The PBM Managing Director stressed the importance of post-implant speech therapy and called for enhanced rehabilitation services in partner hospitals. He assured parents of continued support, ensuring every child receives the necessary care to lead an independent and confident life. Senator Butt emphasized that restoring hearing to congenitally deaf children remains a key mission for PBM. aCochlear implants are not just medical devicesathey are gateways to opportunity, education, and a brighter future,a he stated. To date, PBMas medical assistance program has provided 1,738 cochlear implant surgeries,, investing Rs2,343 million to transform lives. This initiative underscores PBMas commitment to inclusive health-care and social empowerment.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}