{
  "article_id": "2025-04-10_fd44ed920c3a437f697cd915cffb4353",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/na-speaker-sadiq-reviews-budget-proposals-ahead-of-finalisation/",
    "retrieved_at": "2025-08-27T14:21:42.832Z"
  },
  "metadata": {
    "title": "NA Speaker Sadiq reviews budget proposals ahead of finalisation",
    "author": null,
    "date_published": "2025-04-10T18:55:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 202,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 10 (APP):National Assembly Speaker Sardar Ayaz Sadiq on Thursday chaired an important consultative meeting at the Speaker's House in Islamabad to deliberate on preparations for the 2025-26 federal budget. The objective was to devise a strategy to conduct the National Assembly's budget session in an effective and transparent manner. Federal Minister for Finance Muhammad Aurangzeb, Federal Minister for Law Azam Nazeer Tarar Former NA Speaker Raja Pervez Ashraf, MNA Syed Naveed Qamar, along with representatives from various parliamentary political parties attended the meeting. The meeting included detailed discussions on ensuring quorum during the budget session, managing the proceedings of the House in an amicable manner, and conducting constructive debates on the expected budget. Participants offered suggestions to facilitate the smooth conduct of the session, which were thoroughly reviewed. NA Speaker reiterated his commitment of conducting the upcoming budget session in an effective manner as per the parliamentary traditions. On this occasion, the participants of the meeting expressed profound sorrow over the passing of senior parliamentarian and prominent politician Senator Taj Haider. The participants prayed to Allah Almighty for the elevation of the rank of the Late Senator Taj Haider and also paid rich tribute to his services for the nation.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}