{
  "article_id": "2025-04-10_d74a0c899ed77bb7330e22ee30ce168a",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ptis-tenure-led-to-economic-ruin-democracy-erosion-minister-bilal/",
    "retrieved_at": "2025-08-27T14:23:00.493Z"
  },
  "metadata": {
    "title": "PTI’s tenure led to economic ruin, democracy erosion: Minister Bilal",
    "author": null,
    "date_published": "2025-04-10T10:39:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 236,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 10 (APP):State Minister for Railways Bilal Azhar Kiani on Thursday accused the previous PTI government of causing economic collapse and weakening democracy, as the country marks over three years since its removal from power. On the third anniversary of former Prime Minister Imran Khan's removal through a no-confidence vote (April 10, 2022), state minister took to social media platform X to accuse the deposed premier of subverting democratic norms while alleging foreign involvement in his government's collapse. He said the National Assembly was unlawfully dissolved by the PTI through deceit. The same elements that stole former prime minister Nawaz Sharif's electoral mandate in 2018 went on to plunder the nation's wealth, pushed the economy to the verge of collapse, and crushed citizens under unprecedented inflation, joblessness, and poverty. They isolated Pakistan internationally and allowed terrorism to resurge. Regrettably, he said, the architects of Pakistan's crises have neither reformed nor altered their harmful objectives. Their recent attempts to obstruct IMF assistance demonstrate the same destructive mindset. The May 9 incidents revealed their true nature, while their ongoing vilification of our martyrs and armed forces shows their continued disrespect for national institutions. While condemning those inciting chaos and unrest, minister Kiani honored PMLN chief Nawaz Sharif, Prime Minister Shehbaz Sharif, and Pakistan Democratic Movement (PDM) leadership for steering Pakistan back to constitutional governance, democratic stability, and sustainable development - while providing crucial relief to the public.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}