{
  "article_id": "2025-04-10_effe60d247dc2183d87236be336a9806",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/strengthening-inter-parliamentary-cooperation-pivotal-for-regional-development-ayaz/",
    "retrieved_at": "2025-08-27T14:22:31.811Z"
  },
  "metadata": {
    "title": "Strengthening inter-parliamentary cooperation pivotal for regional development: Ayaz",
    "author": null,
    "date_published": "2025-04-10T13:46:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 283,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Apr 10 (APP): Speaker National Assembly Sardar Ayaz Sadiq Thursday said that stronger cooperation among the parliaments in the region is crucial for sustainable peace and development. During meeting with Secretary General of Economic Cooperation Organisation (ECO) Dr Asad Majeed Khan here, he emphasized the importance of parliamentary diplomacy in fostering closer ties among ECO member states. Both the sides discussed ways to enhance inter-parliamentary cooperation among ECO member states and other matters of mutual interest. During the meeting, Ayaz Sadiq welcomed Dr Asad Majeed Khan on his appointment as the Secretary General of ECO. He congratulated him on assuming his new role and expressed confidence that his leadership would strengthen regional collaboration. Ayaz Sadiq further highlighted Pakistan's active role in the Parliamentary Assembly of Economic Cooperation Organization (PAECO), reaffirming the country's commitment to regional integration through legislative engagement. The Speaker expressed pride in the National Assembly of Pakistan's role in hosting the ECO Parliamentary Assembly twice. He also pointed out that the Interim Secretariat of Parliamentary Assembly of Economic Cooperation Organization (PAECO) is currently located within the National Assembly of Pakistan and encouraged Dr Khan to take a proactive approach toward transitioning it into a permanent secretariat. The Speaker also commended the role of Parliamentary Friendship Groups in strengthening ties between Pakistan and other ECO member countries. Secretary General Dr Asad Majeed Khan thanked Ayaz Sadiq for his warm welcome and praised his efforts in advancing regional parliamentary relations. He assured the NA Speaker of his full support for the establishment of a permanent secretariat for the PAECO in Islamabad. The meeting concluded with a shared commitment to deepening parliamentary engagement as a key component of regional peace, connectivity and progress.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}