{
  "title": "Dar hopes Pakistan’s foreign reserves to reach $14-15 by end of govt’s tenure",
  "link": "https://www.app.com.pk/national/dar-hopes-pakistans-foreign-reserves-to-reach-14-15-by-end-of-govts-tenure/",
  "date_published": "2023-06-30T17:41:00.000Z",
  "source": "APP",
  "content": "LAHORE, Jun 30 (APP): Federal Finance Minister Ishaq Dar has expressed hope that Pakistan’s foreign reserves will reach to $14-15 billion by the end of the government’s tenure.\nAddressing a press conference with Prime Minister Muhammad Shehbaz Sharif, Minister for Information and Broadcasting Marriyum Aurangzeb and Punjab Governor Muhammad Baligh-ur-Rehman here on Friday at the Governor’s House, he said that the government convinced the International Monetary Fund (IMF) that it would be very unfair if $ 2.5 billion balance amount of the concluding programme was not given to Pakistan.\nHe said that a standby agreement had been reached eventually and now the IMF would give $3 billion to Pakistan within a period of nine months, adding that the first tranche of the $1.1 billion amount would be released to Pakistan after the IMF board meeting in mid July.\nThe minister said that he was reluctant to impose taxes of Rs 215 billion in the recent budget to meet the IMF conditions but the prime minister assured him that if the programme was not finalized then he could reverse taxes.\nThe minister said that the letter of Intent, signed by Governor State bank of Pakistan Jameel Ahmad and him, would be given to the IMF country representative and its scanned copies would be sent to IMF headquarters in Washington, while appreciating the role of the Prime Minister in breakthrough with the IMF at Paris.\nHe said that it was the 23rd programme which had been signed with the IMF and except 2013-16 programme, Pakistan could not complete any of its IMF programmes. He said that under the leadership of prime minister Muhammad Nawaz Sharif in 2017, Pakistan witnessed the lowest inflation and more than 6 per cent GDP growth whereas stock market capitalization was more than 100 billion dollars.\nHe said that a political project was launched in 2018 and the nation paid a very high price for it.He said that when the PTI government left power, the total foreign loan and liabilities of the country had reached to $130 billion whereas total foreign loan of the country was $ 70 billion dollar in 2017. The stock market also lost its capitalization and it stood at just $ 22 billion when the PTI government left power, he added.\nIshaq Dar refuted claims of the country facing default and emphasized its status as an independent nation. “Pakistan possesses substantial assets amounting to $ 3000 billion”, he added,He said that our objective was to restore Pakistan’s economy and take it to the position held in 2017 and beyond. While acknowledging the importance of the IMF programme, the minister said that alternative plans were available to safeguard Pakistan’s interests in case the programme had not been materialized.\nHe said that a future roadmap had been designed for economic revival and special initiatives were being taken in agriculture, IT, mining and other sectors.Dar said that significant progress had already been made and Pakistan paid $5 billion in commercial bank loans, contributing to a reduction of $4 billion in external debt.\nThe minister expressed gratitude for China’s substantial assistance, which played a vital role in boosting Pakistan’s overall reserves to $10 billion. “Our target is to further increase reserves to $14-15 billion by end of the government’s term”, he added.",
  "retrievedAt": "2025-08-11T08:49:46.439Z"
}
