{
  "title": "India’s false flag Pahalgam drama exposed Worldwide",
  "author": null,
  "content": "ISLAMABAD, Apr 27 (APP): India’s false flag Pahalgam drama has been exposed to the entire world, as once again Pakistan was blamed for the attack without any evidence.\nSources said that the Pahalgam false flag operation is a continuation of India’s repetitive dramas. Even the international media gave no significant coverage to the Pahalgam incident, they added.\nThey said that European, American, and other international media outlets treated the incident merely as ordinary news.\nThe sources claimed that the international media’s indifference caused panic among Indian citizens and media representatives. “I am shocked by the inadequate coverage of the Pahalgam incident by the international media,” said Barkha Dutt.\nSources also said that evidence for past incidents—where Pakistan was blamed—has still not surfaced. They pointed out that after the Chattisinghpura massacre in 2000, the initial blame was placed on Lashkar-e-Taiba without any evidence.\nHowever, later, Indian Army General K.S. Gill revealed that his own troops were involved in the massacre. Following Afzal Guru’s execution, Indian courts also admitted that the evidence against him had been insufficient.\nIn 2001, after the attack on the Parliament, India blamed Pakistan, sacrificing around 800 soldiers, the sources claimed. No official report of the Parliament attack has been released so far.\nSimilarly, in 2007, during the Samjhauta Express attack, India again blamed Pakistan without any evidence. Later, it was revealed that the real culprits behind the Samjhauta Express attack had links with the RSS.\nIt has also been proven that Indian military officers and extremist organizations were involved in the Samjhauta Express bombings.\nMoreover, the sources said that in 2017, after the Pathankot attack, the lies of the Indian Defence Minister were exposed. Former NIA officer Satish Verma disclosed that the Pathankot attack was orchestrated to malign Pakistan.\nThe conspiratorial politics of the Modi government is no longer hidden, political analysts said.\nThey remarked that the Modi government has become a laughingstock around the world. Statements by U.S. President Donald Trump and the U.S. State Department serve as living proof of this, they said.\nThe world has now realized that Indian agencies themselves orchestrate acts of terrorism and then blame Pakistan, they added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:56:29.893Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/indias-false-flag-pahalgam-drama-exposed-worldwide/",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T10:00:00.000Z"
}
