{
  "title": "Saudi delegation arrives in Pakistan to review ‘Road to Makkah’ project arrangements",
  "author": null,
  "content": "ISLAMABAD, Apr 27 (APP): The Ministry of Religious Affairs and Interfaith Harmony on Sunday announced that a 45-member Saudi delegation has arrived in Pakistan to assess arrangements for the ‘Road to Makkah’ project in a bid to facilitate Pakistani pilgrims during the upcoming Hajj season.\nAccording to the ministry’s spokesperson Muhammad Umar Butt, officials from the ministry warmly received the delegation at the Islamabad International Airport (IIA).\nUnder the ‘Road to Makkah’ initiative, a total of 50,500 Pakistani pilgrims will travel to Saudi Arabia via designated flights, he said adding that of these, approximately 28,000 pilgrims will depart from IIA, while 22,500 will fly from Karachi’s Jinnah International Airport. He further informed that 100 flights will operate from Islamabad and 80 from Karachi under the project.\nUmar Butt said dedicated immigration counters for pilgrims will be established at both Islamabad and Karachi airports. Significantly, under the ‘Road to Makkah’ project, pilgrims’ immigration procedures will be completed in Pakistan, eliminating the need for clearance upon arrival in Saudi Arabia, he maintained.\nUmar Butt said the ministry has issued important guidelines for pilgrims. He said it is mandatory for all pilgrims to receive essential vaccinations before departure. Pilgrims are advised to visit the nearest Haji Camp to receive free vaccinations against meningitis, influenza, and polio, he said adding that after vaccination, obtaining the yellow vaccination card is compulsory, as entry into Saudi Arabia without a valid vaccination certificate is not permitted.\nUmar Butt said pilgrims above the age of 65 must carry their original COVID-19 vaccination card as in the absence of the card, senior pilgrims are instructed to get vaccinated at the nearest Haji Camp and obtain a new certificate.\nUmar Butt said the ministry also issued a strong warning against fraudulent Hajj permits. “Pilgrims must only travel with valid and approved Hajj permits,” he said adding that the ministry has cautioned that fraudulent companies and unauthorized advertisements could mislead pilgrims with fake permits, leading to severe consequences.\nHe further alerted that use of counterfeit permits can result in arrest, heavy fines, deportation, and denial of access to the holy sites in Mina, Arafat, and Muzdalifah. Furthermore, any payments made towards illegal or unverified Hajj packages will not be refunded, he added.\nUmar Butt said the ministry emphasized that respect for Saudi laws is essential for the acceptance of Hajj and for ensuring a blessed pilgrimage.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T14:56:09.168Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/saudi-delegation-arrives-in-pakistan-to-review-road-to-makkah-project-arrangements/",
  "dateList": "2025-04-27",
  "date_published": "2025-04-27T16:23:00.000Z"
}
