{
  "title": "Govt envisions ending poverty, achieving sustainable development goals,Dr. Nishtar",
  "link": "https://www.app.com.pk/national/govt-envisions-ending-poverty-achieving-sustainable-development-goalsdr-nishtar/",
  "date_published": "2020-07-01T00:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 01 (APP):Ending poverty and achieving the Sustainable Development Goals is at the heart of the government’s vision for Pakistan.\nThis was the key message delivered by Dr. Sania Nishtar to the United Nations yesterday in a speech to the General Assembly on behalf of the Government of Pakistan, said a news release.\nDr Nishtar, who is Special Assistant to the Prime Minister on Social Protection and Poverty Alleviation and head of the Ehsaas program, delivered the speech via video link as part of the virtual inauguration of the Alliance for Poverty Eradication, a new global body designed to address poverty from all possible angles, and serve as a forum for networking, information-sharing, and bridge-building.\nThe Alliance for Poverty Eradication is a flagship initiative of the President of the UN General Assembly, Tijjani Muhammad-Bande, who also spoke at the event alongside UN Secretary-General António Guterres and representatives including Heads of State from over 30 countries.\nDr Sania was one of the opening speakers along with Secretary General Gutteres, President Buhari of Nigeria, and President of ECOSOC.\nWarning of the damage that could be done by the current coronavirus pandemic, Dr Nishtar highlighted Pakistan’s ground-breaking Ehsaas Emergency Cash program, which was initiated within days of the lockdown in March and has delivered emergency cash to millions of families, supporting the livelihoods of 125 million people across the country.\n“In 10 weeks we have helped 11 million families, which represents the most extensive and the most transparent social protection operation ever undertaken in the history of the country and in the most difficult of circumstances,” said Dr Nishtar during the speech.\n“Our experience with Ehsaas has taught us that precision matters deeply in social protection, which is why we are using 21st century tools such as data analytics, precision payments and data driven accountability to help those in need” , she said.\nAt the conclusion of the speech, Dr. Nishtar emphasised the potential opportunities for social change that can stem from this crisis. She said, “We now have a once in a generation chance to build a fairer world that ends poverty, inequality and the climate crisis. I am hoping the Alliance can play a part in this transformation.”",
  "retrievedAt": "2025-08-11T19:25:42.092Z"
}
