{
  "title": "Minus one formula is brainchild of corrupt political mafia to destabilize govt: Faraz",
  "link": "https://www.app.com.pk/national/minus-one-formula-is-brainchild-of-corrupt-political-mafia-to-destabilize-govt-faraz/",
  "date_published": "2020-07-01T03:01:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 01 (APP):Federal Minister for Information and Broadcasting Syed Shibli Faraz Wednesday said minus one formula was the brainchild of corrupt political forces aiming to destabilize the government.\nHe, in a talk show on a private news channel, said they must know that all the cabinet members, parliamentarians and workers of Pakistan Tehreek-e-Insaf (PTI) were standing by the Prime Minister Imran Khan.\nThe minister said whatever our current political status and stature was, it was due to Imran Khan and people like him came into politics due to distinct and innovative ideology.\nEarlier, state institutions were deliberately collapsed by political mafia merely to protect their personal interests and wrongdoings of their leaderships, he added.\nAbout action against the sugar mafia, he said the government should be given credit of conducting a transparent and across the board investigation into the case following by making it public which was the first instance in the political history of the country.\nHe said action would be taken against the elements identified in the report after sensitizing the FBR, SECP, State Bank and other related institutions.\nTo a question about the briefing of aviation minister regarding the restructuring of Pakistan International Airlines (PIA), the minister said as media person, politician and minister, his statement needed to be carefully viewed in the context of ground realities.\nHe said irregularities were made at Civil Aviation Authority level as the sanctity of papers of the pilots was doubtful. Although, it would not be suitable to disclose the number of terminated pilots at this forum, however, five pilots were chargesheeted after completion of all codal formalities, he expressed.\nTo another question, he said the government had plan to invite European aviation agency for the investigation purposes and introducing reforms in the PIA to make it a splendid airline of an international standard.\nAbout the sale of PIA’s hotel in New York, Shibli Faraz said the government was following the policy of utilizing all national assets for educational and heath purposes. Each step, in that regard, would be taken in transparent manner, he added.\nReplying to the allegations levelled by Pakistan Peoples Party (PPP) chairman Bilawal Bhutto, the minister advised him to first make his track record excellent and impressive before making his comparison with our leadership.\nHe said Bilawal’s grand father Zulfiqar Ali Bhutto was a great leader and had respect for us as our family’s elders had rendered great services for his party during its early stage.\nIt was highly unjustified to make PTI government responsible for the institutional collapse and misappropriations started in PPP’s regime to facilitate and nourish corrupt mafia, he said and added the PPP leaders were always taking advantage of coronavirus whenever they were summoned by the National Accountibility Bureau.",
  "retrievedAt": "2025-08-11T19:25:39.440Z"
}
