{
  "title": "Egyptian investors to take benefit from Gwadar port: Sanjrani",
  "link": "https://www.app.com.pk/national/egyptian-investors-to-take-benefit-from-gwadar-port-sanjrani/",
  "date_published": "2020-07-01T00:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jul 01 (APP):Chairman Senate Muhammad Sadiq Sanjrani has said that Gwadar is future hub of world trade and investors from Egypt can benefit from this opportunity.\nHe further said Senate of Pakistan is ready to provide any support needed in coordination with provincial governments or relevant departments.\nHe made these remarks in a meeting with Egyptian Ambassador Tarek Dahroug who called on him here at the Parliament House on Wednesday, said a press release.\nThe Chairman Senate said Egyptian investors can invest in the areas of fisheries, livestock, minerals, services sector and others. He said that Egypt has been a centre of ancient civilization, culture and traditions and is a very important part of the global community due to its rich history.\nThe Chairman Senate said that Pakistan attaches huge importance to its ties with Egypt who are deeply rooted in history due to common religion as well as shared values and traditions.\nHe said that steps need to be taken to establish relations on level of masses as well as Parliaments by increased Parliamentary exchanges and diplomacy.\nThe Chairman Senate also told the ambassador about the initiative of International Parliamentarians’ Congress and extended an invitation to Egyptian Parliamentarians to become a part of this unique forum.\nHe also emphasized upon enhancing the collaboration between two countries in the field of education and called for more opportunities for students of both countries to study in the other as students can serve as the best cultural ambassadors for any state and this will also help in further cementing the relationship.\nThe Chairman Senate invited Chairman of Egyptian Majlis e Nawab to visit Pakistan along with Parliamentary and business delegations to explore avenues of cooperation.\nTalking about the platform of PIPS, Chairman Senate told the ambassador that both sides can learn from each other’s experiences in the areas of legislative process especially for those laws which pertain to Islamic Jurisprudence.\nThe Chairman Senate also observed that the pandemic has resulted in many difficulties in carrying out routine tasks but has also provided us the opportunity to think about more avenues where the global community can come together and work on mutual issues together.\nThe ambassador agreed with the Chairman and said that Pakistan and Egypt will both benefit by more frequent Parliamentary exchanges and business investments.",
  "retrievedAt": "2025-08-11T19:25:41.299Z"
}
