{
  "title": "Govt spending public money judiciously, says Farrukh Habib",
  "link": "https://www.app.com.pk/national/govt-spending-public-money-judiciously-says-farrukh-habib/",
  "date_published": "2021-09-18T17:54:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Sep 18 (APP): State Minister for Information & Broadcasting Farrukh Habib said that PTI government is the custodian of public money and would spend it on public welfare in a most judicious and transparent manner.\nInaugurating a park in new Nazim Abad here on Saturday, he said that the voters of this constituency had given him extra favor and he intends to return them back in the form of providing best civic amenities at their doorsteps.\nHe said that all parks had been rehabilitated while new parks would be developed in the neglected areas to provide healthy activities to the youth who were earlier indulging in negative activities.\nAbout Prime Minister Imran Khan’s vision of 10 billion tsunami tree plantation, he said that the international community had appreciated this unique endeavor and as a result, Pakistan was given a chance to host global environment day event.\nHe said that now it was not only our national but international obligation also to make Pakistan clean and green and in this connection maximum trees were being planted all over the country.\nAbout access road to new Nazim Abad, he said that it will be constructed very soon to improve the road communication. He said that during rain, the sewer line of this area overflowed which caused problems for the inhabitants.\nHence, Water & Sanitation Agency (WASA) had been directed to prepare a new scheme for Rehmania Road which will facilitate the residents of new Nazim Abad, Premier Colony and Rehmania Town.\nContinuing, the state minister said that health cards would be provided to every family of Punjab by the end of this year. The holder of this card will be entitled to get free medical facilities up to Rs.1 million from the doctor and hospital of their own choice.\nFarrukh Habib said that yet another priority area was provision of potable clean drinking water. In this connection, water filtration plants were being installed. In first phase, the redundant water filtration plants had been made functional while 15 new plants were being installed.\nHe said that he intends that at least one filtration plant should be installed in each union council while big union council may have 2-3 plants as per their needs.\nHe said that during the current year development budget at least 30 new water filtration plants would be installed to provide potable water at the door steps of the masses.\nThe government will be responsible to install the plants while its repair and maintenance will be the responsibility of local philanthropists, he added.\nLater, the state minister planted a sapling in the park while a large number of area notables were also present on the occasion.",
  "retrievedAt": "2025-08-11T21:16:22.685Z"
}
