{
  "title": "Govt to adopt a gender roadmap to achieve equality: Asad",
  "link": "https://www.app.com.pk/national/govt-to-adopt-a-gender-roadmap-to-achieve-equality-asad/",
  "date_published": "2021-09-18T15:07:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):Minister for Planning Development and Special Initiatives Asad Umar Saturday said the government would adopt a gender roadmap to achieve equality.\nHe was chairing a high-level meeting here.\nMember Social Sector & Devolution presented the draft gender roadmap which proposed gender integration across all national policies, programmes, offices and key management processes.\nThe roadmap is designed to close the gender gap in education and employment, simultaneously empowering the young women to yield a substantive SDG dividend, that can in return catalyze the economic growth of Pakistan.\nThe agenda of Gender Development and Equality has been taken up as a national priority by the government.\nThe final gender roadmap is a key product emerging from months’ long nation-wide iterative consultations engaging the National Youth Council, academicians, subject experts, national task forces, youth voices from across the globe, government officials and development partners.\nSeveral high impact interventions were discussed to mainstream gender across all key priorities. The packages of high impact strategic interventions were proposed keeping in view the confronting challenges to inform mindful investment in closing the gender gap and creating equitable opportunities for women and girls.\nThe Minister underscored the importance of gender-transformative workplaces. He desired that a policy framework be developed based on deliberations and rapid research, identifying the current barriers faced by female workers in public and private sector organizations.\nThe key recommendations outlined in the framework should not only guide development of a public sector programme but must also be supported by necessary legal instruments to make working environment conducive and progressive for women.\nDuring the meeting, the Minister Planning, Development and Special Initiatives expressed his concern over the rising proportion of out-of-school children following the pandemic globally as well as in Pakistan, sharing the Government’s intent in tackling this challenge as a national priority.\nThe Minister highlighted the need for exploiting the e-school experiences from the pandemic and using COVID19 as an opportunity for introducing innovative e-solutions, e-schools and accelerated learning programmes for reaching out of school children.\nWhile reviewing the proposed innovative employment generating and skill-building strategies, the Minister advised that the same be reviewed in tandem with the existing interventions under the Kamyab Jawan Programme to consolidate efforts and resources under one umbrella for an optimum impact.\nThe importance of dedicated transport facilities for young females was highlighted for both accessing educational and employment opportunities.\nThe Minister desired for a comprehensive proposal to be presented in this regard in the coming week.\nHe emphasized the national priority accorded to gender empowerment and the urgency to respond to the current situation.\nHe asked for the proposed two-year roadmap to be presented before sectoral experts, industry,y leaders, and policy think tanks, and their inputs sought while finalizing the same.",
  "retrievedAt": "2025-08-11T21:16:24.348Z"
}
