{
  "title": "Defying spoilers, Pakistan at forefront to achieve durable peace in Afghanistan",
  "link": "https://www.app.com.pk/national/defying-spoilers-pakistan-at-forefront-to-achieve-durable-peace-in-afghanistan-2/",
  "date_published": "2021-09-18T13:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Sep 18 (APP):From facilitating US-Taliban peace talks and evacuation efforts after Taliban takeover to formation of an inclusive government, Pakistan has been at forefront to achieve sole objective of durable peace in Afghanistan, defying all spoilers.\t Being a close neighbor with a 2,600 kilometer shared border, Pakistan always bored the brunt of instability in Afghanistan, be it was in form of terrorism, influx of refuges as well as massive economic loss.\t As acknowledged by the world, it was Pakistan which convinced Taliban to sit on dialogue table with the US, finally leading to the signing of peace agreement.\t Though some forces within Afghanistan and the region had been skeptical of Pakistan’s efforts and continued to undermine its role, Pakistan never gave up its constructive role, considering that it would be the second most victim of instability and similarly, the second most beneficiary of peace in Afghanistan.\t After the takeover of Taliban, Pakistan was the only country which voluntarily carried out evacuation operation transporting thousands of people from Kabul to Islamabad, arranged their accommodation and other facilities till their onward departure to their respective destinations.\t Having completed the evacuation mission, the Pakistan’s leadership was now fully focused to urge Taliban to fulfill their commitment for an inclusive government representing all communities.\t After a two-day visit to Tajikistan, Prime Minister Imran Khan revealed on Twitter that he had started a dialogue with Taliban to form an inclusive government representing all communities.\t “After meetings in Dushanbe with leaders of Afghanistan’s neighbours & especially a lengthy discussion with Tajikistan’s President Emomali Rahmon, I have initiated a dialogue with the Taliban for an inclusive Afghan govt to include Tajiks, Hazaras & Uzbeks,” the prime minister said.\t He said after 40 years of conflict, this inclusivity would ensure peace and a stable Afghanistan, which was in the interest of not only Afghanistan but the region as well.\t However, since the US-Taliban peace agreement, Pakistan had been cautioning the world about the role of spoilers who never desired peace in Afghanistan.\t Amidst all this scenario when all the regional powers, were yearning for Afghan peace, India was moving atypically as after the US withdrawal, its interests in Afghanistan had met a huge setback.\t India was the greatest beneficiary of the United States presence in Afghanistan and the Indian media had been censuring the US over withdrawal.\t With its media terming the US withdrawal as a failure, India was trying to instigate US against peaceful resolution of the conflict through projecting its withdrawal decision as a humiliating defeat.\t In fact, India had maintained large presence in Afghanistan and had been using Afghan soil against Pakistan since 2001 by investing over US $ three billion on infrastructure, training of Afghan forces and other projects to establish a network for its permanent foothold and to achieve its overt designs.\t Pakistan presented a detailed dossier containing proofs of Indian involvement in a systematic campaign to destabilize Pakistan through terrorist attacks, promotion of secession and subversion through Hybrid and 5th generation war.\t India always wanted the anti-Taliban forces in power in Afghanistan so that it could use Afghan soil to its own advantage. However, the Taliban’s return to power had caused a major diplomatic setback for India leaving it the region’s “most disadvantaged” players in Afghanistan.\t Happymon Jacob from New Delhi’s Jawaharlal Nehru University, believed that India seemed to be out of the game in Afghanistan. Now, India feared that Pakistani and Chinese influence in Afghanistan would grow.\t India had never been in favor of Afghan peace talks and US withdrawal rather misled entire world about the prospects of a peaceful solution to Afghan quagmire.\t The provocative terms like “fatal blow to prestige”, “failure of 20-year mission”, US credibility completely down” and “embarrassing exit” were being used in Indian media against the US decision.\t India painted a fake picture about abilities of Afghan Forces to the world but the fakery had left the world in disbelief when almost entire Afghanistan fell to Taliban without any major resistance.\t Despite all Indian tactics and propaganda, Pakistan was sincerely pursuing its mission of a peaceful Afghanistan and was repeatedly urging the world not to abandon the war-torn country.\t In his address at SCO Summit, Prime Minister Imran Khan said the world was left with two stark choice of a either engaging or abandoning Afghanistan. Abandoning Afghanistan would lead towards an unstable situation causing rise in terror cases, spillover impact on neighboring countries, drug trafficking and transnational organized crimes.\t The SCO stated consider that it was important to responsibility restore the legitimacy of state power in Afghanistan taking into account the interests of all social, political, ethnic and religious groups of the country to normalize the situation, restore peace, economic development and counter terrorism, extremism and drug crime.\t In the declaration issued after the xummit, the SCO countries agreed that political and diplomatic means sticking to widely recognized principles and norms in international law were the “only way” to settle regional conflicts.\t But contrarily, India, despite being a member, was violating SCO mandate and playing a role of peace spoiler not only in Afghanistan but also in the region. In 2020, India had not participated in SCO counter terror exercise Kavkaz in Russia that saw participation of Chinese and Pakistani forces.\t On the other hand, India was bent upon hurting Pakistan’s economic and security interests.\t There had been a growing relationship between India’s intelligence agencies and United Nation designated terrorist organizations, including the Jammat-ul Ahrar, Tehreek-e-Taliban Pakistan, the Baloch Liberation Army, Baluchistan Liberation Front and Baloch Republican Army.\t India had been funding these organizations to the tune of around Rs. 22 billion  (approximately US $91 million) over last three years. The country also allocated Rs. 80 billion (approximately US $ 695 million) to raise a militia of 700 people in Pakistan to disrupt China Pakistan Economic Corridor projects.\t Indian had been patronizing ISIS and running six training camps, one in Indian Illegally Occupies Jammu and Kashmir (IIOJK) (Gulmarg), four in Rajasthan (Raipur, Jodhpur, Anupgar and Bikaner) and one in Uttarakhad (Chakrata) pointing towards its un-ending and ever growing dirty kinetic war effects against Pakistan.\t Even former Afghan Prime Minister and Chief of Hezb-e-Islami Gulbadin Hikmatyar asked India to refrain from using Afghan soil against Pakistan to take revenge for Kashmiris’ struggle in IIOJ&K and instead focus on its international issues.\\9329/18/2021 6:33:24 PM\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T21:16:25.794Z"
}
