{
  "title": "People reject Nawaz, Maryam narratives: Usman Dar",
  "link": "https://www.app.com.pk/national/people-reject-nawaz-maryam-narratives-usman-dar/",
  "date_published": "2021-09-18T17:32:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Sep 18 (APP): Special Assistant to the Prime Minister on Youth Affairs Usman Dar said on Saturday that people had rejected the narratives of Nawaz Sharif and Maryam Safdar, saying that most of the Pakistan Muslim League Nawaz (PML-N) members in the national and provincial assemblies would leave them in next elections.\nAddressing a press conference here at Jinnah House, he said that Shahbaz Sharif’s address to PML-N workers’ convention in Sialkot was to mount pressure on Maryam Nawaz.\nHe said that Khawaja Asif had proved by holding a workers convention in the courtyard of his house that he was not popular among the people.\nUsman Dar said that vote bank of Pakistan Tehrik-e-Insaf (PTI) had increased in the city, saying that in 2016 Cantonment Board elections, PTI won one seat and now in 2021 Cantonment Board elections, the party won 2 seats.\nThe SAPM said that sewerage, water supply, solid waste management, traffic management and upgrading of parks projects worth Rs 17 billion were underway in the district.\nHe said that mega project of sewerage, water supply, solid waste management, traffic management and upgrading parks projects in the city would provide upgraded and advanced municipal facilities to the people of Sialkot.\nApart from, 61 projects worth Rs 22.50 billion were underway while 101 new ADP schemes had been added to the annual development programme this year at a cost of Rs 29 billion, he said.\nUsman Dar said the University of Applied Engineering and Emerging Technologies was going to be built at a cost of Rs 16 billion.\nHe said that a total of Rs 80 billion development projects would be completed before June 2023, which would directly benefit to the citizens and would be truly a game changer.\nHe said that Shahabpura flyover would be completed by the end of December.\nPunjab Chief Minister Sardar Usman Buzdar during his visit to Sialkot few days ago had directed to expedite the work on pending projects and government officials had been suspended for incompetence, he said.\nHe said that chairman National Accountability Bureau (NAB) was appointed by the previous government and the Bureau had recovered Rs 500 billion in last three years, adding the NAB was working independently.\n“I advise Khawaja Asif and other NAB-affected politicians to defend their cases in courts”, he said.\nThe SAPM said that opposition committed corruption through money laundering. He said due to agricultural reforms made by the Pakistan Tehrik-e-Insaf (PTI) government, the farmers were prosperous today.\nOn the occasion, Provincial Minister for Special Education Punjab Chaudhry Muhammad Akhlaq said that Prime Minister Imran Khan was a true leader and the new generation was looking towards him. He said that Pakistan Muslim League-Nawaz was a party ofpolitical slaves.",
  "retrievedAt": "2025-08-11T21:16:22.688Z"
}
