{
  "title": "Gill condemns Fazl statement, says anti-army narrative not acceptable",
  "link": "https://www.app.com.pk/national/gill-condemns-fazl-statement-says-anti-army-narrative-not-acceptable/",
  "date_published": "2021-09-04T15:36:00.000Z",
  "source": "APP",
  "content": "FAISALABAD, Sep 04 (APP): Special Assistant to the Prime Minister (SAPM) on Political Communication Dr Shehbaz Gill has said that any anti-army narrative is unacceptable for the patriotic people of Pakistan.\nTalking to the media during his visit here on Saturday, he said all political parties, excluding few disgruntled elements, acknowledge the unprecedented sacrifices, offered by the country’s valiant forces.\nHe condemned the recent statement of Maulana Fazlur Rehman against the Pak Army and said that during September, when everyone pays tribute to the gallantry of our forces, Fazlur Rehman criticised the Pak Army.\nHe said Maulana Fazl had been upset due to his successive defeats and was trying to get cheap popularity by criticising the army.\nHe said the Maulana committed corruption in the past and purchased flats in Dubai with the plundered money. He had a house on 5 acres in Dera Ismail Khan, one house in Shorkot, and flats and shops in Karachi and Quetta, as well as plots in Islamabad. Similarly, he purchased property worth Rs 3 billion in Chak Shehzad Islamabad.\nGill said that Maulana Fazlur Rehman had been involved in diesel scam during Benazir Bhutto government. Now, instead of apologising to the nation over his loot and plunder, he was criticising the army, which was defender of the country. He advised the Maulana to stay within his limits and avoid criticising the army.\nRejecting the allegation of army support to the Pakistan Tehreek-e-Insaf (PTI), he said if it was so, the party would not have needed support of any political allies.\nHe said that the statement of Maulana Fazlur Rehman was on record that during 2007 he met the US ambassador and assured him of his full support and cooperation if he was provided support to become prime minister of Pakistan. Similarly, in 2011, he wished to have a meeting with the American ambassador outside Pakistan.\nHe said that Fazlur Rehman was in the habit of political bargaining. He succeeded in getting ministries with only few seats in the past, but Prime Minister Imran Khan totally rejected him being an unreliable person.\nResponding to a question, he said that the PTI government had no link with Maulana Fazlur Rehman nor it offered any deal to him.\nResponding to yet another question that despite massive corruption, the government was not taking action against Fazl, he said the government stayed always within the limits of the law and the constitution, and it was a duty of the courts to proceed against him.\nAbout a meeting of Director General ISI with the Afghan government in Kabul, he said he was a representative of the prime minister and the ISPR would issue a statement about the real content of the meeting.\nAbout high rate of dollar despite record foreign exchange reserves, he said it was due to the corona pandemic which resulted in global inflation. He said that the PTI government did not want to contain the value of dollar artificially, but efforts had been expedited to control inflation.\nAbout difference of opinions between Shehbaz Sharif and Maryam Nawaz, he said that president of PML-N floated the proposal of national government, but his niece rejected it outright. In this scenario, Shehbaz Sharif should resign from the president-ship of PMLN.\nHe said that a spokesperson for Shehbaz Sharif, Malik Ahmad, had challenged the PTI government that it would be unable to start work on Sialkot-Kharian Motorway by September-November. He said that now work had been started and he should invite them for a feast.\nHe advised the PML-N leadership to return the plundered amount to save themselves from political and public criticism.",
  "retrievedAt": "2025-08-11T21:10:26.160Z"
}
