{
  "title": "PML-N’s narrative meant to protect plundered wealth: Gill",
  "link": "https://www.app.com.pk/national/pml-ns-narrative-meant-to-protect-plundered-wealth-gill/",
  "date_published": "2020-10-10T09:42:00.000Z",
  "source": "APP",
  "content": "LAHORE, Oct 10 (APP):Special Assistant to Prime Minister (SAPM) for Political Communication Dr Shahbaz Gill here on Saturday said the real narrative of Pakistan Muslim League-Nawaz (PML-N) was to protect plundered wealth and\nbefool people like it made in the past.\nAddressing a press conference, he said so-called leadership of PML-N had never been stick to its stance.\nHe said the PML-N, which was talking about respect of vote, could not absorb political differences by one of its own elected MPA Jalil Sharqpuri.\nHe said the estranged MPA was humiliated and abused by fellow members for expressing his differences over party leadership’s stance against the state institutions.\nGill said the immoral culture was the only way of politics of the PML-N and they had a history of it.\nThe opinion adopted by the Jalil Sharqpuri was however not illegal anyway, he opined and added that if the MPA was being meted out this treatment for meeting Chief Minister Usman Buzdar, it was also his right to approach the leader of the house to get his problem resolved.\nShahbaz Gill said the PML-N leadership was only wanted from its elected representatives to protect and defend looted wealth of the Sharif family.\nReferring to the past events, the SAPM pointed out that the PML-N had a history of humiliating the political opponents for their interests. He said Nawaz Sharif contested from four constituencies being caretaker chief minister and used public money in late 80s. When he failed to defeat Pakistan People Party in the elections, he joined hands with the then President Ishaq Khan to topple the elected government of Shaheed Benazir Bhutto.\nIn another incident, when Nawaz Sharif got a decision against him by Chief Justice Sajjad Ali Shah, he attacked the Supreme Court of Pakistan building, he mentioned.\nGill said that Model Town incident where the PML-N used police force and openly fired on pregnant women and elderly men of Pakistan Awami Tehreek, exposed real face the PML-N .\nWhile sitting in London, Nawaz Sharif was urging his party workers to be ready to go jail, he said and added that if he (Nawaz) wanted to become a leader like Nelson Mandela, then he should come to the country to face corruption cases and jails.\nHe questioned that Nawaz Sharif was uttering against national institutions but he never told details of his private meetings with Indian Prime Minister Modi at his Jati Umra residence and Indian entrepreneur Sajjan Jindal in Murree.\nTo a question on Pakistan Democratic Movement’s protest plan, he remarked that anyone can stage protest, public gathering or take out rally but in case of violation, law may take its course.\nHe said that sedation certificates were given by the PML-N in the past as the Pakistan Tehreek-e-Insaf did not believe in such politics, adding that the government had nothing to do with a FIR registered against the PML-N leadership by an individual at a Lahore Police station.\nTo another question regarding a ban imposed on social media application Tik Tok, he said that the step was taken on complaints of immoral content being uploaded there. However, he added that the Pakistan Telecommunication Authority was asked to make regulations over it to filter such content and once it was done, the application would be reopened.",
  "retrievedAt": "2025-08-11T19:53:13.025Z"
}
