{
  "title": "Opposition form alliance after failing to get favours in return for FATF legislation support: FM",
  "link": "https://www.app.com.pk/national/opposition-form-alliance-after-failing-to-get-favours-in-return-for-fatf-legislation-support-fm/",
  "date_published": "2020-10-10T15:16:00.000Z",
  "source": "APP",
  "content": "MULTAN, Oct 10 (APP):Foreign Minister Makhdoom Shah Mahmood Qureshi here on Saturday said that opposition parties formed alliance after they failed to get the process of accountability of their leaders stopped in return for their support to FATF-related legislation.\nPakistan Tehrik-e-Insaf (PTI) government did not believe in politics of ‘Muk Muka’ (deals), he said while inaugurating different road schemes in union council 38 of NA-156, old Shujabad road.\nMPA Waseem Khan Badozai, Makhdoom Shoaib Akmal Hashmi, Sajid Nawaz Khokhar and a large number of people of the area were present on the occasion.\nThe foreign minister said that opposition parties alliance was unnatural and did not seem to last longer.\nHe added that people of different thinking, varying ideologies and agendas had assembled in the alliance with the sole objective of stopping the process of accountability.\nHe said, the government was not afraid of All Parties Conference (APC), adding that opposition rallies and public meetings were a political process.\nQureshi said “The government will complete its constitutional term no matter what opposition does.”\nHe, however, added that PDM leaders should also keep in mind that their public meetings and rallies could cause harm to people in the face of apprehensions regarding novel coronavirus in the days to come.\nThe foreign minister said, sessions were held with opposition on 34 points to discuss FATF legislation. The opposition thought that they could extract favours for their support to FATF legislation, he added.\nHe said the opposition tried hard to achieve what they wanted but failed and resorted to form the alliance.\nQureshi criticized elements who were criticising the national institutions and said that it did not serve the purpose of protecting national interests.\nHe said that these elements were making anti-Pakistan forces happy through their unwise approach and statements.\nHe urged opposition to avoid attempts to bring about political instability pleading that it would benefit none.\nThe foreign minister said that national institutions were functioning within their domain for the welfare of the country, adding “We are proud of our institutions and their performance. We are proud of Pakistan armed forces.”\nHe said that government had invited the opposition to jointly thrash out proposals for free, fair and transparent elections in Gilgit Baltistan but they refused.\nQureshi said that government highlighted the Kashmir issue at international forums and successfully countered the Indian propaganda.\n“The world now know Kashmiris need their right to self determination be respected,” he added.\nHe held the past governments responsible for the price hike and added that opposition should stop shedding crocodile tears.\nThe foreign minister said that there was no shortage of wheat and sugar in the country.\nHe said that government was making all out efforts to provide relief to the people.\nQureshi said that United States was appreciating Pakistan’s role in securing peace in Afghanistan.\nHe urged United Nations to play role for peace between Armenia and Azerbaijan.\nEarlier, the foreign minister attended Qul ceremony of late Qaswar Sial at Mauza Chatha, offered Fateha for the late mother of Ashfaq Sindhu at Mauza Bodhia and mother of Goga Walen at Mauza Sipra wala.\nQureshi also expressed his heartfelt condolences to Punjab Energy Minister Dr. Akhtar Malik over the death of his brother in law and offered Fatehs at Mauza Seetal Mari.\nHe attended Chelum of maternal uncle of Malik Zafar Pappu Raan at Qadir Pur Raan.\nLater, FM Qureshi also attended oath taking ceremony of Anjuman Tajran old Shujabad road. A dinner was hosted in his honour by trade body leader Khawaja Suleman Siddiqui.",
  "retrievedAt": "2025-08-11T19:53:08.338Z"
}
