{
  "title": "Fawad inaugurates ISO certified Model Police Station",
  "link": "https://www.app.com.pk/national/fawad-inaugurates-iso-certified-model-police-station/",
  "date_published": "2020-10-10T16:56:00.000Z",
  "source": "APP",
  "content": "SIALKOT, Oct 10 (APP): Federal Minister for Science and Technology Fawad Hussain Chaudhary here on Saturday inaugurated the International Organization for Standardization (ISO) certified Model Police Station, Rangpura.\nOn this occasion, he said that government was making efforts to ensure the early, easy and smooth justice to the oppressed and needy people besides bringing direly needed changes in old police culture as well.\nHe said said that as many as four police stations had been made ISO certified in the Sialkot district.\nFawad said that special Urdu software would be developed for police personnel.\nThere was weakness in the response of the police, the police stations were trying to change the culture, he said and added that we will provide modern drones to the Punjab police.\nHe said that street crimes will be controlled with the help of drone cameras. He said that Ministry of Science and Technology will provide assistance to the police in this regard.\nOn this occasion while talking to media, Federal Minister for Science and Technology Fawad Chaudhry\nsaid that it was not easy to resign from assembly. He said that there was no moral or political justification for this movement, adding that according to the constitution, the opposition should wait for five years.\nMinister said that India was associated with terrorist organizations, fascism in India was because of Modi.\nHe said that in the Financial Action Task Force (FATF) meeting, Pakistan had drawn attention to Indian terrorism and the government will play its full role in this regard. He said whenever Pakistan begins to stand on its own feet, the enemy begins to work on its agenda.\nReplying to a question, he said that that political parties should suspend political activities for three months. He said due to the cold weather coronavirus had re-attacked in some countries.\nLater, addressing an important meeting of the Sialkot exporters held at Sialkot Chamber of Commerce and Industry (SCCI), Federal Ministers Fawad Hussain Chaudhary said that the effective and positive economic policies were now bringing betterment and strengthening the national economy.\nHe said that the government was fully aware of the perturbing problems being faced by the business community, saying that the government was making all out sincere efforts for the early amicable solution to these problems by taking the businessmen into confidence as well.\n“Government will support business community in every matter”, he pledged.\nThe minister hailed all the social welfare and human development-oriented projects already being run successfully by the Sialkot exporters on self-help basis in Sialkot under the supervision of SCCI.\nHe highly hailed the spirit of Sialkot exporters for establishing mega project of Sialkot international airport on self-help basis.\nHe asked the business community of Pakistan to adopt the unique export culture of Sialkot to boom up national exports.\nHe said Sialkot was an important economic hub and totally export-oriented city of the country.\nHe said that the surgical industry of Sialkot-Pakistan had enough potential to double the surgical exports.\nHe said that we need our own branding, adding that Sialkot’s craftsmen had no competition in the world.\n“We will facilitate them so that exports can be significantly increased,” he added.\nHe said that Pakistan had joined the ranks of those few countries which were producing their own masks and ventilators. He said that we were working to declare Sialkot a Special Economic Zone (SEZ).\nOn this occasion, President Sialkot Chamber of Commerce and Industry Qaisar Iqbal Baryar said that the Sialkot exporters were the backbone of the national economy, as the Sialkot exporters had been playing a pivotal role in strengthening the national economy by earning precious foreign exchange to the tune of US $ 2.5 billion annually.\nSpecial Assistant to the Prime Minister on Youth Affairs Usman Dar, President Chamber of Commerce and Industry Qaisar Iqbal Baryar, Provincial Minister for Special Education Punjab Ch. Muhammad Ikhlaq and business community were also present on this occasion.",
  "retrievedAt": "2025-08-11T19:53:08.351Z"
}
