{
  "title": "International Day of Person with Disabilities on Dec 3",
  "link": "https://www.app.com.pk/national/international-day-of-person-with-disabilities-on-dec-3/",
  "date_published": "2021-12-01T07:00:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP): International Day of Person with Disabilities will be observed on December 3 across the world including Pakistan to promote the rights and well-being of persons with disabilities in all aspects of society.\nThe United Nations Educational, Scientific, and Cultural Organization (UNESCO) is amplifying the observance with a week-long program from November 25 through December 3.\nTo raise the campaign’s visibility, UNESCO is using its social media platforms to highlight the stories of people living with disabilities through the coronavirus pandemic.\nThe theme for 2021 International Day of Persons with Disabilities is “ Leadership and Participation of Persons with Disabilities Toward an Inclusive, Accessible, and Sustainable post-COVID-19 World.”\nThe theme highlights the additional challenges faced by persons with disabilities during the coronavirus (COVID-19) pandemic and the aim, once the virus is under control, of ensuring that the future is inclusive, accessible, and sustainable for all.\nAccording to the UN, more than 1 billion people globally have some type of disability. This includes nearly 61 million US adults, according to the Centers for Disease Control.\nThat means about 26% of Americans may experience differences in how they manage daily tasks and requirements. Cyber and IT-oriented companies often play key roles in developing assistive technologies.\nThese technologies are any product or system that maintains, increases or improves the functional capability of people with disabilities.\nThe World Health Organization (WHO) recognizes disability as a global public health issue, a human rights issue, and a development priority. WHO recognizes ‘disability’ as “an umbrella term for impairments, activity limitations, and participation restrictions, denoting the negative aspects of the interaction between an individual (with a health condition) and that individual’s contextual (environmental and personal) factors.\nDisability is neither simply a biological nor a social phenomenon.” (WHO Global Disability Action Plan 2014–2021.) First proclaimed in 1992 by the United Nations General Assembly resolution 47/3, the day aims to promote an understanding of disability issues and mobilize support for the dignity, rights, and well-being of persons with disabilities.\nDisability inclusion is an essential condition to upholding human rights, sustainable development, and peace and security. It is also central to the promise of the 2030 Agenda for Sustainable Development to leave no one behind.",
  "retrievedAt": "2025-08-11T21:40:30.160Z"
}
