{
  "title": "Pak Covid response can be a global case study: Shafqat",
  "link": "https://www.app.com.pk/national/pak-covid-response-can-be-a-global-case-study-shafqat/",
  "date_published": "2021-12-01T13:30:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 01 (APP):Minister for Federal Education and Professional Training Shafqat Mehmood on Wednesday said that Pakistan’s Covid-19 response can be a global case study of effective response despite economic constraints.\nHe was addressing the FCDO-funded Sub-National Governance Programme, implemented by Oxford Policy Management. The programme kick started its two-day National Learning Workshop on Pakistan’s COVID Response- Lessons for Improving Governance in Islamabad on Wednesday.\nShafqat Mahmood chaired the opening session with Acting British High Commissioner, Iona Thomas and policy makers, sector experts, practitioners, and others.\nEducation Minister Shafqat Mahmood commented that while responding to the pandemic, no government had any precedence, and Pakistan was no exception.He said fundamental decisions were taken resulting in Pakistan’s COVID response that was appreciated globally. We were able to keep our economy running and the poor protected though various economic stimulus programmes and social protection initiatives.\n‘Through a national coordinated response beyond politics and narrow partisan lines, a countrywide response helped Pakistan get back on its feet quickly. While dealing with education emergency Pakistan introduced Teleschool just 15 days after the pandemic and then moving to online teaching. This also manifested the digital divide and now we are working on the Internet for all initiative which will ensure that everyone has access to internet and its associated benefits in education and otherwise’, the minister added.\nActing British High Commissioner Iona Thomas while talking about Pakistan’s COVID response said that ‘Pakistan has been extremely successful in returning to near normalcy (Pakistan ranks second in the Economist COVID normalcy index, after Egypt).\nThe fact that we are all here today, in person, is a proof of Pakistan’s success so far.”\nShe further added, “I am even more delighted we have made this journey together. Several of FCDO programmes worked closely with federal and provincial authorities during the pandemic.\nThe Subnational Governance Programme (SNG) in particular worked with center-of-government institutions to help forge a successful response to the pandemic.SNG has mobilized quickly with well-informed advice and supported creative and effective responses to the challenges brought about by the pandemic. This collaboration itself is a testimony of the strong UK-Pakistan partnership, of which we are very proud.”\nSession on Handling Public Finance in Crisis was chaired by Punjab Finance Minister, Hashim Jawan Bakht while session on Social Protection was chaired by Dr Sania Nishtar who talked about various social protection measures that supported the most vulnerable and disadvantaged across the country.\nIt is worth mentioning here that the FCDO-funded Sub-National Governance Programme is a four-year technical assistance programme administered by Oxford Policy Management (OPM) supporting provincial and district governments in Punjab and Khyber Pakhtunkhwa to improve planning, financial management and governance, and build sustainable capacities for improved service delivery.",
  "retrievedAt": "2025-08-11T21:40:27.046Z"
}
