{
  "title": "Music giant Nisar Bazmi was clamberer as composer",
  "link": "https://www.app.com.pk/national/nisar-bazmi-was-clamberer-as-composer/",
  "date_published": "2021-12-01T13:52:00.000Z",
  "source": "APP",
  "content": "By Jehangir Khan Tareen\nMULTAN, Dec 01 (APP): Acclaimed music maestro, Nisar Bazmi, was well versed with use of orchestra which resulted into superb and evergreen songs for Pakistan film industry.\nTalking to APP in connection with 97th birth anniversary of music maestro, known composer Ustad Sagheer Ahmad said that Nisar Bazmi was master of using orchestra.\n“Bazmi sahib knew which instrument would be used one another while creating music for a beautiful song”, he said adding that the great musician contributed amazing songs for the industry through films like ” Umrao Jaan Ada, Lakhon Main Aik, Naag Mani, Tehzeeb, Anjuman etc.\nUstad Sagheer, who has been associated with music industry for the last over 50 years, reminisced that Bazmi sahib composed songs keeping in view the situations of the story.\nNisar Bazmi was very melodious himself, he disclosed and added that he (Bazmi) had a command over ” Raags”.\n” Ub k Hum Bachray Tu Shaid” sung by Mehdi Hassan was composed in much difficult raag, he stated.\nHe was a musician par excellence ,the music teacher said.He was great command over “club songs, Ustad Sagheer said and added that use of villain and sitar was amazing in songs composed by Bazmi sahib.\n” Aisa Bhi Hota Ha’ was the film which became his identity, he maintained.He was a clamberer as a musician, Ustad Sagheer disclosed.Bhagun ” Mun mandir ke Devat Rakhyo Hamrai Laaj” in Lakhoin Main Aik’ sung by Melody Queen, Noor Jehan is simply outstanding.\nStation Director Radio Pakistan Multan, Asif Khan Khatraan stated that he was a matchless composer.\nHe said that the history of Pakistan film music would be incomplete without name of Nisar Bazmi adding that he composed for about 75 Pakistani films.Bazmi sahib composed both songs of joy and sorrow for films and PTV but ,element of happiness prevailed in his compositions, he informed.\nFamous Singer, Rahat Multanikr informed that Bazmi sahib was a cultured musician and civility was focus of his compositions.\nShe stated that songs composed by him are still alive in hearts of music lover specially his fans adding that he got Rona Lalla, Mehnaz Begaum and Naheed Akhtar sung superbly.\nMohabbat Mei Tere Sar Ki Qasam” Ho Tamanna Aur Kya Jaan-E-Tamanna Aap Hain””Chalo Achha Hua Tum Bhool Gaye, “Aisey Bhi Hain Meharban”, Ranjish Hi Sahi” Mohay Aaii Na Jag Say Laaj, Mein Itna Zor Say Naachi Aaj, Ke Ghunghroo Toot Gaey” Ik Husn Ki Devi Se Mujhe Pyar Hoa, Katay Na Kuttay Re Ratya Saiyan Intizar Me” are some of his heart touching songs, she informed.\nSarwar Shah, an old fan of Nisar Bazmi, said that he used to watch films eagerly whose music was composed by the great musician because of the tremendous songs composed by him.\nName of Bazmi sahib considered to be a guarantee for success of a film in golden era of Pakistan film industry, he said adding that he enjoyed himself the music composed by him even these days too.\nBzmi sahib introduced Alamgir, Tahir Syeda and Humaira Channa in the industry, he recalled.",
  "retrievedAt": "2025-08-11T21:40:27.038Z"
}
