{
  "title": "Advanced technology solutions need of hour to cope environmental degradation: Zartaj",
  "link": "https://www.app.com.pk/national/advanced-technology-solutions-need-of-hour-to-cope-environmental-degradation-zartaj/",
  "date_published": "2021-12-01T11:18:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 1 (APP):Minister of State for Climate Change Zartaj Gul on Wednesday said the academia and students should work on developing advanced technology solutions like GIS that was need of the hour to cope with the impending disaster of environmental degradation.\nAddressing a seminar on geographic information system (GIS) for Climate Change organised by Department of Meteorology COMSATS University here she said most of the public departments concerned lacked latest technology to predict and generate real-time data for environmental hazards whereas locally developed reliable gadgets would help increase resilience against recurring disasters.\nZartaj Gul said the Ministry of Climate Change and Prime Minister Imran Khan made the highest public awareness among the masses on climate change and environmental degradation.\nThere had been no massive initiative launched by previous regimes to conserve environment, she challenged her political rivals.\nThe Minister added that the academia possessed huge reserve of information and knowledge on environment and climate change. “More than 153 extreme weather events occurred but no one in the previous governments woke up to address the issue,” she regretted.\nThe country, she said, was suffering from a variety of natural calamities as Sindh’s Thar area and Balochistan were suffering from drought and on the contrary Lahore and Karachi were inundated by urban flooding. The heatwave phenomenon in Karachi killed 3,000 people whereas glacial melting in the North led to Attaabad Lake formation, she added.\nThe incumbent government under Prime Minister Imran Khan had Ten Billion Tree Tsunami Plantation (TBTTP) programme, Clean Green Pakistan, Plastic bags ban, and Recharge Pakistan.\n“Pakistan has pledged to convert its 30% automobiles over Electric Vehicles and 60% energy mix to renewable energy at the global climate change moot of COP26,” Zartaj informed.\nShe pointed out that the 20 biggest polluter countries needed to contribute more for assisting developing nations to cope with the challenge of environmental degradation.\nShe mentioned that the Prime Minister on her proposal approved the initiative to start an authentic channel for weather and climate forecast in collaboration with the Meteorological Department to provide farmers in time update.\nThe Minister of State said the new era of warfare belonged to media and narrative, where narrative building and Digital Pakistan was the future to take the country at the apex.\nPrime Minister Imran Khan, she underlined that had unveiled the dark face of fascist Modi who was butchering Muslims. The Prime Minister also under Kamyab Jawan Programme introduced a new concept of digital Pakistan to fight back 5th generation warfare as the the world required skilled workforce with digitization abilities, she added.\n“The government’s job is to give vision and not jobs where the young students must target sustainable goals and achievements that do are subject to any public opportunity rather explore untapped horizons in the market,” Zartaj said.\nShe added that the new generation used to question on misappropriations, as they were better than previous one but were under pressure of various negative things that they have to avoid. “This generation is much better and I compare this youth with the youngsters who stood with Quaid-e-Azam to create Pakistan,” she concluded.\nIn his welcome remarks, Head Office of Research, Innovation and Commercialization, COMSATS University Professor Dr Shahid A Khan said the climate change impacts were being faced all over the world due to anthropogenic activities and Pakistan was no exception.\nHe added that the global warming due to green house gases (GHGs) emissions was leading to natural calamities like drought, floods, and tornados etc.\nHe suggested that a policy document should be released after the seminar alongwith recommendations for the consumption of the government.\nThe Meteorology Department held competition in three categories of climate story, photography, map designing to highlight climate change impacts and solutions.Usama Ashraf and Ayesha Kanwal won in photography, Muhammad Umair, Zainab Imran, and Sidra tul Mintaha in Climate Story, Hajra Azeem and Rozina Naz Map Competition.",
  "retrievedAt": "2025-08-11T21:40:29.399Z"
}
