{
  "title": "Cop martyred in Bannu checkpoint attack as retaliatory fire kills 3 militants - Pakistan - DAWN.COM",
  "author": null,
  "content": "Funeral prayers were held Sunday morning for a police constable martyred in a terrorist attack on a checkpoint in Khyber Pakhtunkhwa’s Bannu district, where an exchange of fire also left three terrorists dead and three policemen injured.\n\nOver the past few months, multiple areas of KP — including Bannu, Peshawar, Karak, Lakki Marwat and Bajaur — have seen a series of attacks, particularly targeting police personnel in Bannu in July.\n\nBannu Regional Police Officer (RPO) Sajjad Khan said in a statement that three terrorists were killed and police constable Rooh Niaz Khan was martyred when 40 to 50 terrorists attacked the police check post in Fateh Khel, Bannu.\n\nThree terrorists were killed and as many policemen were injured in the exchange of fire, which lasted more than an hour, the statement added.\n\nSoon after receiving information about the attack on the post, RPO Khan and District Police Officer (DPO) Saleem Abbas Kulachi, along with the force, left for the site of the incident, Aamir Khan, spokesperson for the Bannu region police, told Dawn.com.\n\n“The terrorists had blocked the roads leading to the post, but the police officials reopened the roads and fought with the terrorists,” RPO Khan said. “Police personnel bravely fought the terrorists, who used heavy weapons.”\n\nHe noted that the search operation for the miscreants was still underway.\n\nAccording to a statement by the Bannu Police Office, funeral prayers for the martyred constable were offered on Sunday morning at Bannu Police Lines. In attendance were his relatives, RPO Khan, DPO Kulachi, and other police officers.\n\nWhile speaking on the occassion, DPO Kulachi said: “Martyred police officer Rooh Niaz Khan sacrificed his life while fighting against anti-national elements, proving that Bannu Police is steadfast on every front.”\n\n“We will never forget his sacrifice,” he said, adding that the bravery, sense of duty and sacrifice of the deceased are a beacon of light for everyone else.\n\nDPO Kulachi emphasised that Bannu Police were fully capable of confronting terrorists on every front.\n\nInterior Minister Mohsin Naqvi paid tribute to the martyred constable, saying he attained the highest level of martyrdom by sacrificing his life in line of duty.\n\n“The police bravely fought the Indian-sponsored terrorists who attacked at night,” he said. Naqvi also prayed for the speedy recovery of those injured.\n\nOn Thursday, at least six law enforcement personnel were injured in a quadcopter attack on Miryan police station in Bannu amid an ongoing operation against terrorists in the Nurar area, where KP police had foiled a terrorist attack bid earlier in the week.\n\nHowever, a police official identified as Constable Hayatullah was martyred last month when terrorists attacked him in Bannu.\n\nEarlier in July, three terrorists were killed in an intelligence-based operation in Bannu, while another died in an encounter with police in Malakand district.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/03133303fe14e6e.png",
  "retrievedAt": "2025-08-16T06:54:22.671Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928472/cop-martyred-in-bannu-checkpoint-attack-as-retaliatory-fire-kills-3-militants",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T08:48:20.000Z"
}
