{
  "title": "Turkiye starts supplying gas to boost Syria’s power output - World - DAWN.COM",
  "author": null,
  "content": "ISTANBUL: Turkiye on Saturday turned on a supply of natural gas from Azerbaijan to Syria, whose infrastructure was ravaged by civil war, with annual deliveries exp­ected to reach up to two billion cubic metres.\n\nSyria’s Islamist authorities, who toppled Bashar al-Assad in December, are seeking to rebuild the battered country where power cuts can last for more than 20 hours a day.\n\nSpeaking at a ceremony attended by Syria’s energy minister, Azerbaijan’s economy minister and the head of Qatar’s development fund, Turkish Energy Minister Alparslan Bayraktar said the initiative would help normalise Syria.\n\n“In the initial phase, up to two billion cubic metres of natural gas per year could be exported to Syria,” Bayraktar said at the ceremony in the southern province of Kilis near the Syrian border. Damascus has said the gas would be used to generate electricity.\n\n“The gas will help activate a power plant with a capacity of around 1,200 megawatts, meeting the electricity needs of approximately five million households,” Bayraktar said.\n\n“We will transport natural gas to Aleppo and from Aleppo to Homs. This will enable the power plants there to be put into operation in the near future,” he added.\n\nA first phase of the Qatari scheme to fund gas supplies for power generation in Syria rolled out in March via Jordan and provided 400 megawatts of electricity per day.\n\nTurkiye supported rebel forces in neighbouring Syria throughout the 13-year civil war that ended with the ousting of Bashar al-Assad in December and has become one of the new Syrian government’s main foreign allies.\n\nAnkara is now positioning itself to be a major player in Syria’s reconstruction.\n\nSOCAR Vice President Elshad Nasirov was speaking at a ceremony in the southern Turkish city of Kilis, close to the Syrian border, as Turkiye and Azerbaijan launched natural gas exports to Syria.\n\nAzerbaijan’s Economy Minister Mikayil Jabb­arov said the project followed agreements in April and July between Azerbaijan President Ilham Aliyev and Syria’s new President Ahmad al-Sharaa.\n\nGas will be transported through Turkish territory to Syria under a coordinated arrangement, Jabbarov said.\n\n“By launching gas exports to Syria, Azerbaijan has demonstrated that it is capable of exporting gas not only to the West, but also to the East and the South,” he said at the event.\n\nTurkish Energy Minister Alparslan Bayraktar said deliveries were expected to reach around 6 million cubic metres (mcm) per day. While the current delivery plan foresees exports of 1.2 bcm annually, Bayraktar said there was potential to supply up to 2 bcm per year in the first phase.\n\nThe gas will be used to restart power plants in Syria with a combined capacity of 1,200 megawatts, Bayraktar said.\n\nSyrian Energy Minister Mohammad al-Bashir said the gas supplies would support basic energy needs in areas affected by conflict.\n\nHe said that the gas would allow for an additional four hours of electricity per day in those areas by increasing generation by around 750MW.\n\nPublished in Dawn, August 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688e870fd19cb.jpg",
  "retrievedAt": "2025-08-16T06:55:15.013Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928376/turkiye-starts-supplying-gas-to-boost-syrias-power-output",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T02:13:58.000Z"
}
