{
  "title": "Senate panel concerned over allotment of ‘undisputed’ Pakistan Steel Mills land by Sindh govt - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Members of standing committee on industries and production told land allotted to local villages by the province\n• Express displeasure over frequent incidents of theft at Pakistan Steel Mills\n• Official briefs committee on govt’s plan to revive or liquidate PSM\n\nKARACHI: The Senate Standing Committee on Industries and Production has expressed serious concerns over allotment of what it called “undisputed land” of the Pakistan Steel Mills (PSM) by the Sindh government and observed that the matter should be referred to the Council of Common Interests (CCI).\n\nThe committee — headed by its chairman Senator Aon Abbas and comprising Senators Syed Masroor Ahsan, Khalida Ateeb and Husna Bano —visited the PSM and reviewed its existing challenges of debts, delayed payments and expenditure.\n\nThey were given a detailed briefing by the PSM management led by its chairman Asad Islam Mahni regarding key issues being faced by the organisation.\n\n“The committee was told about arbitrary allotment of PSM land by the government of Sindh in the past few years,” said a press release issued after the visit of the committee.\n\n“It expressed reservations on the allotment of PSM’s undisputed and entitled land to the goths [villages] by the Sindh government and desired that such allotment cases should be referred to the CCI,” the press release added.\n\n‘Govt considering two plans for PSM’\n\nThe PSM chairman Mahni briefed the committee that the mills had a cumulative loss of Rs600 billion till 2024 and it paid Rs20bn interest annually on the existing debt.\n\nHe also briefed the committee that PSM owed Rs89bn to the National Bank of Pakistan as most of the loan was being provided by the NBP for expenditure including salaries of its 934 existing employees.\n\nThe committee was informed by PSM officials that the government was considering two plans simultaneously regarding the organisation.\n\nThey said that the first plan was to seek revival of the PSM through the Russian Industrial Engineering LLC, which will use Arch Furnace and Blast Furnace to revive the mill.\n\nThe other option, they told the committee, was to seek liquidation of the PSM after hiring an evaluating firm.\n\nThe committee also suggested to speed up the process of liquidating moveable assets being no longer in working condition or have aged their life.\n\nThe members toured different plants of the PSM and suggested that the government should expedite the process to decide the fate of the organisation.\n\nBody formed to address employees’ concerns\n\nThe Senate standing committee also heard the concerns raised by employees’ unions.\n\nThe members met with the employee union representatives, who apprised the committee about the hardships of retrenched and current employees of the PSM.\n\nIt formed a subcommittee to review the reservations of the employees and held talks with the management to address their grievances.\n\nThe committee appreciated the efforts of the current management to reduce the expenditure of the PSM.\n\nHowever, the committee showed displeasure over frequent incidents of thefts in the PSM and directed the authorities to evaluate the losses due to theft.\n\nPublished in Dawn, August 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/1113140501c465c.jpg?r=131459",
  "retrievedAt": "2025-08-16T06:55:06.147Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928314/senate-panel-concerned-over-allotment-of-undisputed-pakistan-steel-mills-land-by-sindh-govt",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T02:14:04.000Z"
}
