{
  "title": "Indian jets walked into ambush due to ‘intel failure’ - Pakistan - DAWN.COM",
  "author": null,
  "content": "• Report says faulty intelligence about range of PL-15 missile gave Rafale pilots ‘false sense of security’\n• Pakistani officials say electronic assault on Indian communications systems reduced situational awareness\n\nISLAMABAD: India’s intelligence failure was central to the hour-long air battle between Pakistan and India in May, which led to the downing of Rafale aircraft by the Pakistan Air Force’s J-10 fighters using PL-15s missiles, according to a report.\n\nReuters interviews with two Indian officials and three of their Pakistani counterparts found that the performance of the Rafale wasn’t the key problem: central to its downing was an Indian intelligence failure concerning the range of the China-made PL-15 missile fired by the J-10 fighter. China and Pakistan are the only countries to operate both J-10s, known as Vigorous Dragons, and PL-15s.\n\nThe faulty intelligence gave the Rafale pilots a false sense of confidence that they were out of Pakistani firing distance, which they believed was only around 150km, the Indian officials said, referring to the widely cited range of PL-15’s export variant.\n\n“We ambushed them,” the PAF official said, adding that Islamabad conducted an electronic warfare assault on Delhi’s systems in an attempt to confuse Indian pilots. Indian officials dispute the effectiveness of those efforts.\n\n“The Indians were not expecting to be shot at,” said Justin Bronk, air warfare expert at London’s Royal United Services Institute (RUSI) think-tank. “And the PL-15 is clearly very capable at long range.” The PL-15 that hit the Rafale was fired from around 200km away, according to Pakistani officials, and even farther according to Indian officials. That would make it among the longest-range air-to-air strikes recorded.\n\nIndia’s defence and foreign ministries did not return requests for comment about the intelligence mistakes. Delhi hasn’t acknowledged a Rafale being shot down, but France’s air chief told reporters in June that he had seen evidence of the loss of that fighter and two other aircraft flown by India, including a Russian-made Sukhoi. A top Dassault executive also told French lawmakers that month that India had lost a Rafale in operations, though he didn’t have specific details.\n\nAccount of aerial battle\n\nReuters spoke to eight Pakistani and two Indian officials to piece together an account of the aerial battle, which marked the start of four days of fighting between the two nuclear-armed neighbours that caused alarm in Washington. The officials all spoke on condition of anonymity to discuss national security matters.\n\nNot only did Islamabad have the element of surprise with its missiles’ range, the Pakistani and Indian officials said, but it managed to more efficiently connect its military hardware to surveillance on the ground and in the air, providing it with a clearer picture of the battlefield. Such networks, known as “kill chains,” have become a crucial element of modern warfare.\n\nFour Pakistani officials said they created a “kill chain,” or a multi-domain operation, by linking air, land and space sensors. The network included a Pakistani-developed system, Data Link 17, which connected Chinese military hardware with other equipment, including a Swedish-made surveillance plane, two Pakistani officials said.\n\nThe system allowed the J-10s flying closer to India to obtain radar feeds from the surveillance plane cruising further away, meaning the Chinese-made fighters could turn their radars off and fly undetected, according to experts. Pakistan’s military did not respond to requests for comment on this point.\n\nDelhi is trying to set up a similar network, the Indian officials said, adding that their process was more complicated because the country sourced aircraft from a wide range of exporters.\n\nRetired UK air marsahl Greg Bagwell, now a fellow at RUSI, said the episode didnt conclusively prove the superiority of either Chinese or Western air assets but it showed the importance of having the right information and using it.\n\nThe winner in this was the side that had the best situational awareness, said Mr Bagwell.\n\nChange in tactics\n\nAfter India in the early hours of May 7 struck targets in Pakistan that it called terrorist infrastructure, the PAF chief ordered his squadrons to switch from defence to attack.\n\nFive PAF officials said India had deployed some 70 planes, which was more than they had expected and provided Islamabad’s PL-15s with a target-rich environment. India has not said how many planes were used.\n\nFive Pakistani officials said an electronic assault on Indian sensors and communications systems reduced the situational awareness of the Rafale’s pilots.\n\nThe two Indian officials said the Rafales were not blinded during the skirmishes and that Indian satellites were not jammed. But they acknowledged that Pakistan appeared to have disrupted the Sukhoi, whose systems Delhi is now upgrading.\n\nIn the aftermath of the episode, India’s deputy army chief Lt. Gen. Rahul Singh accused Pakistan of receiving live inputs from China during the battles, implying radar and satellite feeds.\n\nHe did not provide evidence and Islamabad denies the allegation.\n\nBeijing’s air chief Lt Gen Wang Gang, however, visited Pakistan in July to discuss how Islamabad had used Chinese equipment to put together the “kill chain for the Rafale, two PAF officials said.\n\nThe Pakistani military said in a statement in July that Wang had expressed “keen interest in learning from PAF’s battle-proven experience in Multi Domain Operations.”\n\nThe hour-long fight, which took place in darkness, involved some 110 aircraft, experts estimate, making it the world’s largest air battle in decades. The J-10 jets shot down at least one Rafale, Reuters reported in May, citing the US officials.\n\nIts downing surprised many in the military community and raised questions about the effectiveness of Western military hardware against untested Chinese alternatives. Shares of Dassault, which makes the Rafale, dipped after reports that the fighter had been shot down.\n\nPublished in Dawn, August 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/06/04122205a3ee596.jpg?r=122209",
  "retrievedAt": "2025-08-16T06:56:18.129Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928400/indian-jets-walked-into-ambush-due-to-intel-failure",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T02:13:22.000Z"
}
