{
  "title": "Ledecky reigns over McIntosh as record-breaking US hit back at critics - Sport - DAWN.COM",
  "author": null,
  "content": "SINGAPORE: Katie Ledecky beat Summer McIntosh to win a classic 800m freestyle final at the world championships on Saturday as the record-breaking United States hit back at their critics.\n\nOn a Super Saturday for the embattled Americans, who have been struggling with illness in Singapore, Ledecky won her seventh career world gold in the event she has made her own.\n\nBut the legendary American was pushed to the limit, touching the wall in a championship-record 8min 05.62sec, ahead of Australia’s Lani Pallister (8:05.98) and McIntosh (8:07.29).\n\nIt was Canadian sensation McIntosh’s first defeat of the championships and ended her bid to match Michael Phelps as the only swimmer ever to win five individual golds at a single world championships.\n\nThe 18-year-old has already won three golds this week in Singapore and will go for number four in the 400m medley on Sunday.\n\n“The feeling right now is something I never want to feel again,” a forlorn McIntosh said.\n\nLedecky, 28, had too much staying power for her younger rival, with Pallister also right in the mix until the final lunge for the line.\n\n“They pushed me all the way,” said Ledecky, a four-time Olympic champion in the event.\n\n“I’m just really happy I could put that together. I just kept telling myself to trust my legs.”\n\nThe United States team, under the cosh after criticism from Olympic greats Phelps and Ryan Lochte, won three golds on the penultimate day of competition.\n\nThey lead the medals table from Australia with eight golds following victories on Saturday for Ledecky, Gretchen Walsh and their mixed 4x100m freestyle relay team — the latter in a world-record time.\n\nWalsh completed a butterfly double, romping to victory in the 50m.\n\nThe American, who won the 100m butterfly earlier in the week, touched the wall in 24.83sec, beating Australia’s Alexandria Perkins (25.31) and Belgium’s Roos Vanotterdijk (25.43).\n\nWalsh said she felt “fragile” before her 100m win after coming down with a stomach bug that has swept through the American camp — and triggered questions from Phelps and Lochte about the management of the team.\n\nShe was back to full strength for the fast and furious 50m, which will become an Olympic event for the first time at the 2028 Los Angeles Games.\n\n“I’m very proud,” said the 22-year-old, calling it a “rocky” competition for her despite the double success.\n\nShe labelled the criticism from Phelps and Lochte “frustrating”.\n\nThere was more cheer for the United States as Jack Alexy, Patrick Sammon, Kate Douglass and Torri Huske combined to win the non-Olympic mixed 4x100 freestyle gold in a world record time of 3:18.83, shaving nearly half a second off Australia’s mark from the event two years ago in Fukuoka (3:18.83).\n\nAustralia won two golds on the night to add to their haul of seven overall.\n\nNew father Cam McEvoy powered to the men’s 50m freestyle gold to go with his Paris Olympics crown and Kaylee McKeown embellished her dominance in women’s backstroke.\n\nThe 31-year-old McEvoy — who is at his seventh world championships — reclaimed the title he won in 2023 after turning on the afterburners in the second half of the sprint to win in a sizzling 21.14sec.\n\nBritain’s Ben Proud took silver in 21.26, with Jack Alexy of the United States win bronze in 21.46.\n\nMcKeown added the 200m backstroke crown to her 100m title.\n\nMcKeown again got the better of Regan Smith, touching the wall in a championships-record 2:03.33 to beat her American arch-rival into second place in 2:04.29.\n\nMcKeown also won the 100-200 backstroke double at the Tokyo and Paris Olympics.\n\nFrance’s Maxime Grousset also sealed a Singapore individual double with a rampant victory in the men’s 100m butterfly, to complement his 50m gold.\n\nGrousset’s time of 49.62sec was the third-fastest ever.\n\nPublished in Dawn, August 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688e6821b4d63.gif",
  "retrievedAt": "2025-08-16T06:55:21.500Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928321/ledecky-reigns-over-mcintosh-as-record-breaking-us-hit-back-at-critics",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T02:13:52.000Z"
}
