{
  "title": "Trump stakes reputation as tariff dealmaker - World - DAWN.COM",
  "author": null,
  "content": "WASHINGTON: Donald Trump is staking his reputation as a tough negotiator and slick dealmaker — that has served him well throughout his life — with his ultra-muscular, protectionist tariffs policy.\n\nOn Friday, the White House released a picture of the US president seen with a smartphone pressed to his ear, with the caption: “Making calls. Making deals.\n\nMAKING AMERICA GREAT AGAIN!“ Every trade deal announced by the president, who is convinced that tariffs are both a tool and manifestation of America’s economic might, is celebrated by his supporters as a show of his negotiating prowess.\n\nThis week’s flurry of rate changes was no different.\n\nOn Thursday, with the stroke of a black marker, the former real estate developer slapped fresh tariffs on dozens of US trade partners. They will kick in on August 7 instead of August 1, which had previously been touted as a hard deadline.\n\nThe Republican leader’s backtracking, frequently setting trade deadlines only to rescind or extend them — he most recently granted Mexico a 90-day extension — has given rise to the mocking acronym “TACO” (“Trump always chickens out “). The jokes implying Trump is all talk and no action on trade have previously struck a nerve for the president.\n\n‘Not chicken’\n\nBut analysts believe there will be no going back this time.\n\nTrump has “not chickened out,” according to Josh Lipsky, an international economics expert at the Atlantic Council think tank.\n\nLipsky told AFP the president is “following through, if not exceeding” what he vowed during his campaign in respect to tariffs.\n\nMatthew Aks, a public policy analyst at Evercore ISI, said he did not anticipate a “massive shift” on the latest order, aside from some economies like Taiwan or India striking deals during the seven-day buffer.\n\nFollowing crunch negotiations leading up to the tariffs announcement, Trump struck a series of compromises, notably with the European Union, Japan, and South Korea, setting varying tax rates and touting high investments in the United States.\n\nThe details of these agreements remain vague and leave the door open to key questions: Are exemptions possible? What will become of key sectors like automobiles, pharmaceuticals, semiconductors? And what of China? The US president and leaders of other countries “have reasons to avoid going into detailed agreements” explained Aks, allowing all sides to present the deals in the most positive, or least negative, way possible to their public.\n\nThe ability to conclude deals — often with or without crucial detail — is, for the 79-year-old Republican, an integral part of his political signature.\n\nIn his book “The Art of the Deal,” the billionaire wrote: “Deals are my art form. Other people paint beautifully on canvas or write wonderful poetry. I like making deals, preferably big deals. That’s how I get my kicks.” Trump explained in his book that he always “protects” himself “by being flexible.” “I never get too attached to one deal or one approach.” But despite comments about his trade policy reversals, Trump has hardly budged from his trade strategy, and that could prove politically painful.\n\nPublished in Dawn, August 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/311237028f521a2.png?r=144855",
  "retrievedAt": "2025-08-16T06:55:33.194Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928368/trump-stakes-reputation-as-tariff-dealmaker",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T02:13:45.000Z"
}
