{
  "title": "Terrorists agree to leave civilian areas as jirga held in Bajaur - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: Terrorists in Bajaur district have conditionally agreed to vacate civilian areas, but would not leave the district completely, sources said on Saturday.\n\nThe second round of talks between Bajaur Aman (peace) Jirga members and local terrorist leaders aimed at convincing them to leave the region ended on Saturday, said the sources.\n\nThey told Dawn that talks between the 50-member peace jirga and terrorist leaders were held in the Lowi Mamund tehsil.\n\nThe terrorists had requested a day’s time at the Friday meeting to consult their leadership over the jirga’s two-point demands — either to return to Afghanistan or retreat to the mountains if they wanted to fight the security forces, as their presence posed a serious threat to locals.\n\nHowever, the sources said that no significant development took place in this crucial meeting, meant to convince the terrorist to leave the region peacefully.\n\nThe details of the meeting, which started at around 3pm and ended late on Saturday evening, have yet to be formally disclosed by the jirga’s head, to the media.\n\nThe sources said that the terrorist leaders also assured the jirga members that they would remain peaceful in the region.\n\nAccording to the sources, head of the Bajaur Aman Jirga Sahibzada Haroon Rashid, who along with several members met with high-ups to inform them about the meeting’s developments, was satisfied that people would hear positive news soon.\n\nHowever, Mr Rashid didn’t inform the media about the meeting’s developments till the filing of this report at 9:20pm, ‘as they were still in a meeting’.\n\nMeanwhile, several humanitarian organisations have established relief camps in anticipation of displacement of residents from 16 areas of Lowi Mamund tehsil amid an anti-terrorist operation, sources said on Saturday.\n\nThey told Dawn that the relief camps were mostly set up by local non-governmental organisations in different safe areas of Lowi Mamund and Khar tehsils.\n\nThe sources said Al-Khidmat Foundation, JUI-F, and the Pakistan Red Crescent Society were among the organisations that had set up relief camps to facilitate those displaced from the operation-affected areas of Lowi Mamund.\n\nThey added that some well-off individuals in the district had also set up relief camps, providing food and essential commodities.\n\nPublished in Dawn, August 3rd, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/688ecbaf4c1e9.jpg",
  "retrievedAt": "2025-08-16T06:54:45.338Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928424/terrorists-agree-to-leave-civilian-areas-as-jirga-held-in-bajaur",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T02:37:35.000Z"
}
