{
  "title": "Pakistan, Iran vow to further boost ties during President Pezeshkian’s visit - Pakistan - DAWN.COM",
  "author": null,
  "content": "President Asif Ali Zardari hosted Iranian President Dr Masoud Pezeshkian at the Presidency on Sunday, where they had a meeting during the latter’s two-day visit to Pakistan.\n\nPakistan and Iran share close ties and have signed multiple agreements across sectors such as energy and trade.\n\nAccording to a statement from the Presidency, both sides “reaffirmed their commitment to further broaden bilateral cooperation in diverse fields” and “emphasised the importance of enhancing bilateral ties in wide-ranging and mutually beneficial areas”.\n\nPresident Zardari was quoted as saying that Pakistan and Iran enjoy brotherly relations rooted in shared religion, culture and mutual respect.\n\n“The two leaders exchanged views on major regional and international developments and stressed the need for coordinated diplomatic efforts to prevent the escalation of conflicts and to promote peace, security, and stability in the region,” the statement added.\n\nThe president appreciated Iran’s positions on regional issues and acknowledged the Islamic republic’s consistent support for regional cooperation.\n\nHe expressed gratitude for Iran’s solidarity during critical moments, such as the war with India and reaffirmed Islamabad’s commitment to working closely with Tehran for a peaceful and prosperous future.\n\nPresident Zardari also thanked Iranian Supreme Leader Ayatollah Ali Khamenei for his consistent support for the people of Indian-occupied Kashmir.\n\n“President Zardari strongly condemned the unprovoked Israeli aggression against Iran and lauded the bravery and unity of the Iranian nation during the recent 12‑day war,” the statement added. “He expressed hope that President Dr Masoud Pezeshkian’s visit would further solidify the brotherly relations between the two countries.\n\n“President Pezeshkian thanked the leadership and people of Pakistan for their support during the 12‑day war and appreciated Pakistan’s constructive role in advocating de‑escalation, dialogue, and diplomacy for the peaceful resolution of disputes,” the statement concluded.\n\nEarlier, Prime Minister Shehbaz Sharif said that the Pakistani and Iranian leadership were eager to raise bilateral trade volume between the two countries to $10 billion at the earliest, according to a joint statement.\n\nThe announcement was made as the two countries signed 12 agreements and memoranda of understanding (MoUs) with PM Shehbaz and Iranian President Masoud Pezeshkian addressing a joint press briefing.\n\n“Both countries signed a number of documents to transform them into agreements and to realise the potential of $10bn trade target, adding that the respective delegations from the two sides would further hold detailed meetings to move forward in this regard,” according to the state-run Associated Press of Pakistan (APP).\n\nDuring the bilateral meeting, which took place before the joint press briefing, both sides discussed the broad aspects of their bilateral ties, brotherly relations, religious and cultural ties, and held comprehensive talks to further boost them.\n\nSpeaking during the joint press briefing, PM Sharif condemned how Israel, on June 13, attacked Iran’s nuclear sites. According to the Iranian government, 610 people were killed during the war, while rights groups put the figure at 974.\n\n“Israel, without any rhyme or reason, unleashed aggression against Iran, which was not only strongly condemned by the government of Pakistan but by the entire 240 million Pakistani people, as there was no reason for Israel to stoke war,” PM Shehbaz was quoted as saying.\n\nAccording to the report, the prime minister also expressed his condolences on the martyrdom of Iranian generals, scientists and civilians during the conflict and prayed for the departed souls and the injured for their early recovery.\n\nHe also lauded the Iranian leadership for showing bravery and wisdom during the Israeli aggression and said the Iranian forces and the people faced the aggression and exposed the Israeli defence system with volleys of retaliatory missile attacks.\n\nPM Shehbaz reiterated Pakistan’s principled stance over Iran’s right to a nuclear programme for peaceful purposes under the UN charter, saying that Pakistan would stand by its stance.\n\nIn the fight against terrorism, he said both sides shared views that it could not be tolerated at any cost. “If anyone in Iran was affected by terrorism, it was akin to a victim of terror in Pakistan,” he said.\n\nThe premier further said that the two brotherly countries would take effective measures to eliminate terrorism.\n\nThe prime minister, on behalf of the people and the government of Pakistan, welcomed the president on his maiden visit to Pakistan.\n\nIn his remarks, President Pezeshkian expressed gratitude for the position adopted by the parliament, government and the people of Pakistan for supporting Iran during the 10-day Israeli aggression.\n\nHe said the bonds of affinities and affection between the two countries and nations were deeply rooted in religion, culture and history, citing poetic verses of Allama Muhammad Iqbal, in which he stressed upon unity among the Muslim countries.\n\n“Advancing the neighbourhood policy is among the priorities of Iran’s foreign policy, as Pakistan is not only our neighbour but also a brotherly country,” he added.\n\nThe president expressed his satisfaction that, fortunately, serious and sincere efforts were being initiated by both sides for cooperation in diverse fields, and to take their current trade volume of $3bn to the projected target of $10bn.\n\nPresident Pezeshkian said that his government was determined to take steps to implement these agreements, while the development of land, sea and air routes would facilitate trade.\n\nThe two countries aslo convened a high-level business forum in Islamabad, attended by President Pezeshkian and other senior officials, aimed at bolstering bilateral trade ties and finalising a Free Trade Agreement (FTA), Iranian state-run IRNA reported.\n\nThe event, hosted by Deputy Prime Minister and Foreign Minister Ishaq Dar, brought together a large number of business leaders, chamber of commerce officials, and top investors from Pakistan.\n\nCommerce Jam Kamal Khan, delivering the opening remarks, welcomed the progress towards finalising the FTA, saying both countries are working on resolving tariff issues and enhancing border infrastructure to facilitate trade.\n\nSpeaking on the occasion, President Pezeshkian emphasised the necessity of unity and solidarity among Muslims worldwide.\n\n“We must rely on our own capabilities and resources to overcome challenges and achieve development and progress,” he added.\n\nAddressing the forum, Dar welcomed the positive momentum toward finalising the Pakistan-Iran FTA, according to the Foreign Office.\n\nHe emphasised that economic diplomacy is a cornerstone of Pakistan’s foreign policy.\n\n“The Pak-Iran FTA and platforms like the Business Forum are vital for strengthening bilateral trade and promoting collaboration across key sectors, including energy, agriculture, manufacturing, and technology,” he said.\n\nThe two countries exchanged 12 agreements and memoranda of understanding (MoUs) for the promotion of bilateral cooperation in diverse fields on Sunday, according to Radio Pakistan.\n\n“The agreements and MoUs included cooperation for plant protection and plant quarantine, joint use of Mirjaveh-Taftan border gate, collaboration in science, technology and innovation, cooperation in information and communications technology,” the report said.\n\nIt added that agreements and MoUs were also exchanged to promote culture, art, tourism, youth, mass media and exports, and cooperation in meteorology, climatology and related hazards.\n\n“MoUs on maritime safety and firefighting, judicial assistance in criminal matters, supplemental MoU to an MoU in 2013 related to air services agreement were also signed,” the report said.\n\nThe two sides also exchanged MoUs on recognition of product certification, inspection and testing, tourism cooperation for 2025-27 and a joint ministerial statement on the intent to finalise the Free Trade Agreement.\n\nEarlier, upon his arrival at the Prime Minister’s House, President Pezeshkian was presented with a guard of honour.\n\nPreviously in the day, Foreign Minister Ishaq Dar called on President Pezeshkian and conveyed Pakistan’s commitment to maintaining “brotherly ties” with Iran, according to a statement from the Foreign Office.\n\n“Welcoming the Iranian president, the deputy prime minister/foreign minister reaffirmed Pakistan’s deep commitment to its historic and brotherly ties with Iran, emphasising their strong foundations in shared history, common cultural heritage, faith, and mutual respect,” the statement said.\n\nPresident Pezeshkian appreciated Pakistan’s support and reaffirmed Iran’s resolve to improve bilateral collaboration in various areas of shared interest. He also looked forward to meaningful discussions with Pakistani leaders to further reinforce the political and economic ties between the two friendly nations, the FO said.\n\nSeparately, Commerce Minister Jam Kamal and the Iranian Minister for Industry, Mines and Trade, Mohammad Atabak, also had a high-level discussion on Sunday, where the two sides agreed to accelerate trade, remove border bottlenecks, and build trust-based partnerships across priority sectors, according to a statement from the commerce ministry.\n\nMinister Kamal suggested organising targeted trade delegations that include representatives from federal and provincial chambers of commerce, enabling focused discussions on market access and regulatory facilitation, according to the statement.\n\n“We’ve done this model successfully in Belarus and elsewhere,” he was quoted in the statement as saying. “Let’s do the same for Iran, starting with sectors that show the greatest potential for mutual benefit.”\n\nThe ministers also expressed a shared commitment to increasing the use of existing trade corridors and border facilities. Emphasis was placed on maximising the potential of neighbourhood trade, with Kamal highlighting how ASEAN countries have benefited enormously by trading within their region.\n\n“Geography is an advantage. Pakistan and Iran must utilise this discount of distance. If we don’t, we lose both time and cost benefits,” he stated.\n\nAtabak also highlighted ongoing discussions about increasing Pakistani exports to Iran and encouraged swift follow-up on newly signed agreements.\n\n“Traders and industrialists in both countries are ready. They trust each other. What they need now is a clear and consistent facilitation mechanism from our side,” he noted.\n\nKamal said that beyond bilateral gains, such connectivity could expand to Turkey, Central Asia, Russia, and even parts of the Middle East, creating an economic bloc of substantial power and resilience.\n\nAtabak supported the idea of holding a dedicated business-to-business (B2B) day during every high-level visit and offered to bring Iranian business groups to Pakistan for in-depth meetings, the statement said.\n\nThe two ministers acknowledged the historic depth of Pakistan-Iran relations, expressing that recent regional and global developments have pushed both nations closer together.\n\n“Without the rapid engagement and determination from you and your team, we wouldn’t have reached this stage. The momentum we’ve built must now be translated into structured trade outcomes,” Minister Atabak said while praising the Pakistani government’s proactive role in facilitating bilateral trade progress.\n\nKamal echoed similar sentiments, noting that both governments, as well as the private sector, had shown strong will and passion to work together.\n\n“There’s a moment in diplomacy when the iron is hot — and this is that moment. We must act swiftly. Delays only complicate things,” he said.\n\nHe emphasised that formalities follow passion and political will, and highlighted that Pakistan is ready to deepen its economic relationship with Iran through structured channels like the Joint Economic Commission (JEC), regular B2B exchanges, and sector-focused delegations.\n\nBoth ministers agreed on the importance of identifying specific sectors such as agriculture, livestock, services, energy, and cross-border logistics for future collaboration.\n\nReflecting on the human element of bilateral ties, both sides underscored the cultural and linguistic commonalities between the people of Pakistan and Iran.\n\nThe ministers agreed to fast-track the next session of the JEC, ensure participation from both public and private stakeholders, and prioritise border facilitation and trade logistics.\n\n“With high-level political alignment and mutual trust, Pakistan and Iran appear poised to enter a new phase of strategic economic partnership that could reshape regional trade dynamics,” the statement said.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/03131343996682b.jpg",
  "retrievedAt": "2025-08-16T06:54:32.405Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1928471/pakistan-iran-vow-to-further-boost-ties-during-president-pezeshkians-visit",
  "dateList": "2025-08-03",
  "date_published": "2025-08-03T07:30:07.000Z"
}
