{
  "title": "PM Shehbaz raises Indus Waters Treaty issue at SCO, calls for dialogue on all outstanding disputes - Pakistan - DAWN.COM",
  "author": null,
  "content": "Prime Minister Shehbaz Sharif on Monday raised the Indus Waters Treaty (IWT) issue at the Shanghai Cooperation Organisation’s (SCO) summit in China and called for a “structural” dialogue on all outstanding disputes.\n\nPM Shehbaz arrived in China on Saturday to attend the SCO Council of Heads of State (CHS) summit held from August 31 to September 1. Besides Pakistan, the SCO comprises China, India, Russia, Iran, Kazakhstan, Kyrgyzstan, Tajikistan, Uzbekistan and Belarus. Another 16 countries are affiliated as observers or “dialogue partners”.\n\n“We respect all international and bilateral treaties and expect similar principles to be followed by all SCO members,” PM Shehbaz said at the summit today, in an apparent reference to fellow SCO member India and its unilateral move to hold the IWT in abeyance in April.\n\n“Uninterrupted access to due share of water as per existing treaties among SCO members will strengthen the SCO working smoothly and will support the achievement of broader goals for which the SCO was established,” he stressed at the summit in China’s Tianjin.\n\nIndia held the IWT in abeyance following the April 22 attack in occupied Kashmir’s Pahalgam that killed 26 — an incident New Delhi blamed on Islamabad without evidence. Pakistan termed any attempt to suspend its water share an “act of war”.\n\nEarlier this month, the Permanent Court of Arbitration (PCA) in The Hague issued a “Supplemental Award of Competence” in the case, stating that India cannot unilaterally hold the treaty in abeyance.\n\nAt the SCO summit, PM Shehbaz called for a “comprehensive and structural dialogue to discuss all outstanding disputes”, adding: “I will request your consideration to lead this dialogue under your sagacious leadership so that they can have its dividends as early as possible.”\n\nThe prime minister reaffirmed that Pakistan sought a “normal and stable relationship with all its neighbours”. “It seeks dialogue and diplomacy over conflict and confrontation,” he highlighted.\n\nPM Shehbaz noted: “Pakistan has always believed in the power of multilateralism, dialogue and diplomacy, and shunning unilateralism. And yet, to our shock and deep disappointment, the region witnessed extremely disturbing developments during the last few months.\n\n“Pakistan supports and respects the sovereignty and integrity of all SCO members and its neighbours,” he added.\n\n“We will continue our efforts, along with all SCO members and the chairman of SCO, to promote progress and prosperity in the entire region and to ensure lasting peace in South Asia,” PM Shehbaz pledged.\n\n“Pakistan has always abided by the UN and SCO charters and will always respect the principles that will hold dear to all of us for our collective good. As a peace-loving nation, Pakistan has always advocated dialogue and diplomacy, consultation over confrontation,” he reiterated.\n\nDuring his address, the premier also highlighted the severe floods that Pakistan was once again facing.\n\n“My country is once again passing through unprecedented torrential rains, cloudbursts and massive devastation due to consequent flooding in three of our major rivers,” PM Shehbaz said, highlighting huge loss of lives and livestock, as well as severe damage to infrastructure and crops.\n\n“We deeply appreciate the international community’s, including China’s, solidarity, sympathy and support with us,” he said, hailing the rescue and rebuilding efforts of “my brave and resilient people”.\n\nAt the outset of his speech, the prime minister noted that the port city of Tianjin, where the summit is taking place, represented “China’s core values as a connector and bridge of cultures and civilisation”.\n\nHe thanked President Xi and his government for the warm hospitality and excellent arrangements for the SCO gathering. The premier also extended his felicitations to Uzbekistan and Kyrgyzstan on their national days today and yesterday, respectively.\n\nPM Shehbaz further said: “For us, the SCO is a platform that best represents Pakistan’s abiding commitment to regional cooperation and integration. China’s successful tenure as chair of the SCO is reflective of President Xi’s sagacious and visionary leadership.”\n\nHe stressed that China’s “global leadership” was exemplified not only through the bloc but also in landmark initiatives, such as the Belt and Road Initiative and the China-Pakistan Economic Corridor (CPEC).\n\nAt the SCO summit, PM Shehbaz also highlighted the issue of terrorism and said Pakistan had “irrefutable evidence of involvement of some foreign hands” in the Jaffar Express hijacking in March.\n\nThe train, travelling from Quetta to Peshawar and carrying 440 passengers, was hijacked near Balochistan’s Sibi area on March 11, resulting in the deaths of at least 26 passengers, including 18 security personnel. “All 33 terrorists” were neutralised during the two-day clearance operation, the military said.\n\n“We have irrefutable evidence of involvement of some foreign hands in the devastating Jaffar Express train hostage incident, as well as countless other terrorist attacks against us in Balochistan and KP provinces of Pakistan,” the premier said at the summit.\n\n“Those who have long used terrorism for advancing their political interests must know that the world no longer buys this fictitious narrative.”\n\nDays after the hijacking, the military spokesperson had said India was the main sponsor “in this terrorist incident in Balochistan and others before”. In April, the Pakistan Mission to the United Nations had also said the country had “credible evidence” proving that the attack was “externally sponsored by its regional adversaries”.\n\nAt the SCO summit, the prime minister noted: “The menace of terrorism, separatism, [and] extremism continues to pose a grave threat to Pakistan and endanger peace and security of the entire SCO region and the SCO family.\n\n“We condemn terrorism in all its forms and manifestations with the fullest force at our command, including state terrorism in clear and ambiguous terms,” he added.\n\nRecalling the country’s “great sacrifices in combating terrorism not only for its own self but for the region and far beyond”, PM Shehbaz reiterated that Pakistan had lost over 90,000 valuable lives and endured economic losses of over $152 billion.\n\n“A sacrifice which has no parallel in history,” the premier said, adding that there “cannot be a bigger manifestation of our unwavering commitment to defeat terrorism with the cooperation of all SCO members and global powers around the globe”.\n\nThe prime minister also voiced Pakistan’s desire for a “peaceful and stable” Afghanistan, noting that it was not only in Islamabad’s interest but that of the entire region.\n\n“While we remain engaged in building our ties with the Afghan leadership to leverage them as economic partners and good neighbours, we hope that this cooperation with Afghanistan and our trilateral meetings between China, Pakistan and Afghanistan will have positive results in times to come,” Shehbaz said.\n\n“As SCO leaders, we have reaffirmed year after year the significance of enhanced regional connectivity. This requires efficient land, air and rail transport corridors to ensure the reliability of supply chains,” he stressed.\n\nThe premier asserted that the expansion of CPEC could serve as a “practical demonstration of SCO’s vision for regional connectivity and economic integration”.\n\nDuring his address, PM Shehbaz also condemned Israel’s deadly attacks on Iran in June this year and its “heart-wrenching bloodshed in Gaza”.\n\n“Israel’s unjustified aggression against our fellow brotherly member country Iran, a fellow SCO state, is condemnable and therefore unacceptable,” the prime minister said.\n\n“The suffering and starvation unfolding in Gaza is a festering wound on our collective conscience. We reiterate our call for an immediate end to gruesome violence and heart-wrenching bloodshed in Gaza,” the premier said.\n\nHe underscored that Pakistan has consistently supported the UN-mandated two-state solution, which meant the creation of an independent state of Palestine with pre-1967 borders and Al-Quds Al-Sharif as its capital.\n\nPM Shehbaz also held meetings with fellow SCO leaders on the summit’s sidelines.\n\nIranian President Masoud Pezeshkian condoled the prime minister on the ongoing floods in Pakistan and expressed his country’s support.\n\nThe two also reviewed the state of cooperation across diverse sectors and expressed satisfaction with the positive momentum in bilateral relations.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/011511299ed72f9.webp",
  "retrievedAt": "2025-09-06T09:58:52.476Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938882/pm-shehbaz-raises-indus-waters-treaty-issue-at-sco-calls-for-dialogue-on-all-outstanding-disputes",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T06:31:21.000Z"
}
