{
  "title": "‘Vaccines don’t save lives. Vaccination does’: Health experts shed light on global immunisation trends - Pakistan - DAWN.COM",
  "author": null,
  "content": "With over one million children in Pakistan still missing routine vaccination, health experts on Monday gathered in Lahore for a week-long workshop focused on strengthening national immunisation efforts.\n\nWhen it comes to vaccination, Pakistan continues to face challenges of low uptake, public hesitancy and mistrust, operational bottlenecks, and the unfinished struggle against the poliovirus.\n\nThe National Vaccinology Workshop kicked off today at Lahore’s Pearl-Continental Hotel and will run through till Friday.\n\nThe first day brought together leading experts who spoke on topics ranging from the history of vaccines and the science of how they work to global immunisation trends, coverage challenges, and Gavi’s support. Gavi is a public-private partnership formed in the year 2000 that aims to improve vaccine access in the world’s poorest countries.\n\nSpeakers on the first day included Prof Asad Ali, Dr Junaid Iqbal, Prof Farah Qamar, Dr Chaudhri Irtaza Ahmad, and Dr Richard Omore.\n\n“What are the interventions modern medicine has done to save most lives?” Prof Ali began by asking the audience, before shortly answering himself: “Antibiotics and vaccines.”\n\nDespite being a public health breakthrough, he noted, vaccines are costly to develop and produce because the safety threshold for administering them is set far higher than for most medicines, since they are typically given to healthy individuals.\n\n“For years, access was largely limited to wealthy countries, until the launch of the Expanded Programme on Immunisation, through which international organisations pooled resources to support vaccine uptake worldwide,” he said.\n\nPakistan is currently Gavi’s largest recipient under its strategic phases 4.0 and 5.0, but experts warn that the country must begin preparing for life beyond donor support.\n\nSpeaking to Dawn.com, Dr Omore pointed to Kenya’s experience, where vaccine procurement faced transition challenges including critical vaccine stock shortages after the country crossed Gavi’s income threshold and lost support, forcing the government to quickly find its own funds.\n\nHe said Pakistan should use the current period of support to plan for a smooth transition so that immunisation programmes are not disrupted.\n\nDr Omore also stressed the importance of continued disease surveillance, noting that monitoring new strains and tracking vaccine impact, such as with human papillomavirus (HPV) or pneumococcal vaccines, is essential both for guiding health policy and for building public trust by showing evidence of reduced disease.\n\nEarlier today, a poliovirus case was reported in Khyber Pakhtunkhwa’s Tank district, taking the nationwide tally for this year to 24.\n\nLast month, the World Health Organisation announced that it is partnering with the Pakistan government to train workers for the country’s first HPV vaccine drive. Experts have also urged advocacy for the said drive to ensure success.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/01213416bf1cca9.webp",
  "retrievedAt": "2025-09-06T09:58:38.745Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938960/vaccines-dont-save-lives-vaccination-does-health-experts-shed-light-on-global-immunisation-trends",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T17:25:36.000Z"
}
