{
  "title": "Four children injured as mortar shell hits house in Bajaur - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR/SOUTH WAZIRISTAN: Four children were injured when a mortar fired from an unidentified direction hit a house in War Mamund tehsil of Bajaur district on Sunday.\n\nResidents and officials said the incident occurred at around 1pm in Badan Shah Kallay area when a mortar shell hit Lal Zamin’s house.\n\nAccording to residents, four children, including 12-year-old Abbas Khan, six-year-old Sajid Khan, eight-year-old Saniala Bibi and two-year-old Huma Bibi, were injured in the incident.\n\nThe locals immediately shifted the injured children to the District Headquarters Hospital for treatment. Official sources told Dawn that they had launched an investigation into the incident, which occurred after a mortar shell had hit a house in Gohati area of Lowi Mamund tehsil on Friday night, killing one person and injuring another.\n\nKhar assistance commissioner Dr Sadiq Ali and Nawagai additional assistant commissioner Irshadul Haq visited the hospital to enquire about the injured children.\n\nSeparately, two minor brothers got serious injuries in a suspected quadcopter strike in Spinkamar area of Makin tehsil of Upper South Waziristan district on Sunday evening.\n\nWitnesses said the victims, identified as Mohammad Khan and his elder brother, Yahya Khan, were returning home from a seminary along with their friends when they came under sudden attack.\n\nThe injured children were initially given first aid at a nearby healthcare facility before being shifted to District Headquarters Hospital, Dera Ismail Khan, for advanced treatment. Hospital sources confirmed that while Mohammad Khan remained under treatment, condition of his elder brother, Yahya Khan was stated to be critical and doctors had recommended immediate surgery.\n\nSpeaking to the media, the children’s uncle lamented that no government official had yet visited the family or extended assistance, except for routine contact by Makin police. He appealed to the Khyber Pakhtunkhwa chief minister to provide urgent financial support to the distressed family.\n\nMeanwhile, a senior police officer, speaking to Dawn on condition of anonymity, claimed that the attack was carried out by terrorists using a quadcopter. He added that investigations were underway to ascertain further details and collect evidence from the site.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:58:52.662Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938739/four-children-injured-as-mortar-shell-hits-house-in-bajaur",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:45.000Z"
}
