{
  "title": "Consortium alleges parliamentary interference in ADB-funded N-55 highway project - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: A consortium led by a Chinese firm has appealed to Senate Chairman Syed Yousaf Raza Gilani to intervene against what it described as the “misuse of the Senate platform” to obstruct the Asian Development Bank (ADB)-funded N-55 CAREC Tranche-III highway expansion project.\n\nIn a letter dated Aug 26, the NXCC–RA–DC Joint Venture, comprising Ningxia Communications Construction, Rustam Associates and Dynamic Constructors, alleged that sitting senators were attempting to derail the award of contracts for the dualisation of 326 kilometres of the N-55 highway between Rajanpur, D.G. Khan and D.I. Khan. The project, executed by the National Highway Authority (NHA), is seen as vital for regional connectivity and economic development.\n\nThe joint venture claimed it was lawfully declared the lowest evaluated bidder with a margin of Rs13.2 billion for all four construction lots after a transparent and ADB-approved process. However, the letter alleged that the losing bidders engaged Senator Saifullah Abro to pressure government officials into reopening the concluded bidding process.\n\nThe letter accused Senator Abro of adopting an “aggressive and dismissive” attitude in parliamentary forums, compelling officials to revisit the procurement despite the ADB’s issuance of a No-Objection Certificate (NOC) and the federal government’s sovereign commitment under its loan agreement with ADB to only engage a contractor acceptable to the lender.\n\nLetter seeks Senate chairman’s intervention; senator vows to blacklist firm over alleged non-compliance and misrepresentation\n\n“This misuse of parliamentary privilege and public office jeopardises a nationally significant project, unfairly maligns dedicated public servants, and risks Pakistan’s reputation with international financial partners,” the letter stated.\n\nThe consortium has urged the Senate chairman to protect the sanctity of the House from being used as a tool for “vested commercial interests” and to ensure the project moves forward without further obstruction.\n\nThe Rs146 billion N-55 project forms part of Pakistan’s commitments under the Central Asia Regional Economic Cooperation (CAREC) programme, co-financed by the ADB. Any delays, observers warn, could impact Pakistan’s credibility with international lenders and slow progress on critical infrastructure aimed at boosting trade and connectivity.\n\nEarlier this year, Mishal Pakistan, a partner institute of the World Economic Forum, also raised concerns over conflict of interest in parliamentary proceedings. In a letter to the Senate chairman, it cautioned that such practices would undermine the credibility of the Senate and create distrust among the public if not addressed transparently. When contacted by Dawn, Senator Saif Ullah Abro, however, said the letter was nothing but a “pressure tactic” to stop him from discussing a project worth Rs173 billion.\n\nMr Abro, who is also the chairman of the Senate Standing Committee on Economic Affairs, said he had called meetings of the committee to discuss the issue due to which some elements were not happy with him. He said the company may contact anyone but he was not scared of them.\n\n“Now things have reached to a point where companies have been dictating parliament. Fact is that it has been proved that the company has been using fake documents and even National Highway Authority (NHA) has informed the committee in writing that the company is not willing to share its documents related to experience and other abilities,” he claimed.\n\nSenator Abro said the matter was also handed over to a subcommittee headed by Senator Pervez Rasheed and it recommended cancelling the contract.\n\n“If company managed to get one contract in Pakistan, it will be used in future as a precedent and the company will get more contracts in future. Pakistan is not a piece of cake as everyone wants to get a share. We are working for a national cause and will not allow anyone to rob Pakistan,” he said.\n\nSenator Abro claimed that he will make all possible efforts to blacklist the company as it failed to provide documents.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:58:00.524Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938781/consortium-alleges-parliamentary-interference-in-adb-funded-n-55-highway-project",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:39.000Z"
}
