{
  "title": "‘Flood-prone’ housing schemes along Ravi rife with irregularities - Pakistan - DAWN.COM",
  "author": null,
  "content": "LAHORE: The area declared as “prone to floods” by the Punjab irrigation department is rife with violation of rules and regulations, absence of requisite infrastructure as well as weak enforcement led to the massive devastation in private housing schemes along a long stretch of River Ravi in Lahore.\n\nThe rules defined for the approval of private housing schemes by various authorities are either not being implemented or enforced when it comes to the area prone to floods.\n\nIn recent days, billions of rupees of residents have been lost in various housing schemes and katchi abadis after floodwater entered their houses and business premises. This area comes under the Ravi Riverfront Urban Development Project being executed along a 46km long stretch of Ravi by the Ravi Urban Development Authority (Ruda).\n\nThere is also a disparity in the approval mechanism between different authorities, especially Ruda. The Lahore Development Authority (LDA) follows the Private Housing Scheme Rules 2014 (updated), under which (rule-7) says the land proposed for any housing scheme or land subdivision cannot be approved if it doesn’t fulfill certain requirements. One of them is that the land must be out of the flood-prone area. The tehsil municipal administrations (TMAs) also follow the same rules in areas within their jurisdictions.\n\nDisparity muddies the water in different authorities’ approval mechanisms\n\nBut on the other hand, Ruda — an authority having territorial jurisdiction carved out in 2020 by the then PTI-led government covering a 46km stretch along the river with 132,000 acres and 960 sq-km land — interprets its Ruda Private Housing Scheme Rules 2021 differently. However, it has the same conditions for the approval of housing schemes as the LDA or TMAs.\n\n“It is very confusing that Ruda may accord approval to housing schemes in flood-prone zones without an NOC from the irrigation department. But the LDA and TMAs don’t approve schemes if its land exists in flood-prone regions identified by the irrigation department,” wonders an official source in the Punjab government.\n\nThe recent flooding in various housing schemes approved by Ruda shows that if its own rules were followed in true letter and spirit, the massive devastation seen in various approved and unapproved housing schemes could have been averted.\n\n“I think Ruda’s focus is on approving and regulating housing schemes instead of on one of its most important jobs i.e. building river training works, embankments, barrages, river channelisation among others. In my opinion, Ruda should have developed the aforementioned infrastructure first and then accorded approval to housing schemes,” deplores an officer, who requested not to be named.\n\n“I am really surprised as to how the housing schemes in Ruda, which already exist in the flood plains as per the irrigation department, can be developed,” he said. He also criticised LDA and TMA for keeping mum on the mushroom growth of housing schemes, mostly illegal, in the flood-prone areas near Ravi before the existence of Ruda. “Why had the LDA and TMAs failed to stop such malpractice?” he questioned.\n\nHowever, an LDA officer, on the condition of anonymity, claimed the authority had taken stern action against illegal housing schemes. “We took very serious action against various housing schemes in the past. These included declining approval for illegally extending portion of a housing scheme on the Multan Road. Similarly, we carried out several demolition operations in another illegal housing scheme near Chuhng on Multan Road,” he argued.\n\nA spokesperson of Ruda, when contacted, said, “Ruda, having land in Lahore and Sheikhupura, inherited as many as 103 illegal housing schemes and land subdivisions from LDA and the TMAs. Besides these there were some other schemes that already had approval for a phase or the initial piece of land measuring 100, 200, 300 kanals, but hadn’t obtained approval for their extensions. Such societies developed extensions unlawfully that showed weak enforcement by their then regulators”.\n\nWhen asked about development of housing schemes in the area prone to flooding, he claimed that the ongoing river training works and embankments would completely eliminate the risks of floods. He said the authority also bound developers to ensure construction of flood protection embankments on their before giving them the final approval.\n\nOn the question of giving approvals to housing schemes without the NOC from the irrigation department, the spokesman said, “There is no need for an NOC from the irrigation department as the authority gives approval as per its master plan that guarantees safeguards from floods.”\n\nThe spokesperson said that despite Ruda inheriting already existing housing schemes, its teams were doing their best to regulate all of them. Several illegally developed schemes have huge populations that could not be relocated due to various legal, administrative and livelihood issues.\n\nWhen asked why Ruda focused on according approvals instead of focusing on quickly completing river training works to mitigate floods, he said that the river training works had already been completed in a 7km area onward from Ravi Syphon. He claimed, “You can see that wherever we completed our works, the flood didn’t affect anyone”. The fees received from housing scheme developers were being spent on the ongoing development works in Ravi, he added.\n\nTo another question, he said enforcement teams had carried out several operations in the Ruda project area against illegal housing schemes. He claimed that when Ruda’s flood adaptation work was completed, the remaining area would be completely safe.\n\nMeanwhile, Federal Minister for Communications Aleem Khan, who has been under fire after his housing scheme — the ParkView Housing society — was flooded from Ravi, released a video on social media on the issue. He said that he acquired the housing scheme through a bank auction in 2010 along with all the NOCs and approvals from relevant government bodies, including LDA as Ruda was established later.\n\nHe also criticised Ruda for not completing the barrages, embankments and other protective structures in the area. He said that it was Ruda’s responsibility to safeguard the area from floods. He said the authority charged housing societies for building protective structures.\n\nHe claimed that despite collecting all the charges, Ruda had not made a single road, embankment, lake or barrage in the area.According to former LDA chief engineer Dr Habib ul Haq Randhawa, who also specialises in environmental sciences, river routes whether old or new should not be blocked through urban development, commercial regeneration or for any purpose whatsoever. During normal flow, he said, a river could be temporarily diverted with the help of embankments.\n\n“But extreme flooding will damage such structures, besides increasing the intensity of the flood. Therefore, we should refrain from all kind of developments in the river-influenced areas which are prone to flooding even only once a decade,” Dr Randhawa said while talking to Dawn.\n\n“In the river routes adjacent to cities, a delicate relationship exists between humans and the ecosystem. Government agencies should only allow sustainable town planning having the least impact on the river ecosystem and its flow,” he said.\n\nHe suggested to conduct a comprehensive report delineating each riverbed and flood influence. He said intensive plantation should be done in the vacant riverbeds as it curbed flash flooding from the rivers. “The riverbeds must have margins wide enough to grow and shrink without endangering the population. Native vegetation and classic riparian forests should be grown there. These steps help to reduce the waterflow and flooding,” Mr Randhawa said.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/0110420799f249f.webp",
  "retrievedAt": "2025-09-06T09:58:55.233Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938766/flood-prone-housing-schemes-along-ravi-rife-with-irregularities",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:33.000Z"
}
