{
  "title": "Floodwater inundates relief camps in Kot Momin - Pakistan - DAWN.COM",
  "author": null,
  "content": "SARGODHA: The relief camps set up by the administration in the flood-affected areas of Kot Momin tehil have also been filled with floodwater as the rescue and relief efforts entered the sixth day on Sunday.\n\nAs per details, thousands of people have been displaced by the floods along the River Chenab in Kot Momin tehil of Sargodha district. The administration claimed that more than 8,000 people had been rescued and shifted to safer areas.\n\nHowever, majority of the residents of the affected area were still living in their submerged homes along with their cattle. These people are at risk of snake and insect bites, particularly while trying to cut fodder from the inundated fields.\n\nAccording to the district administration, Deputy Commissioner Muhammad Waseem was present in the affected areas with his entire field formation. Assistant commissioners distributed breakfast to the flood-affected people in relief camps and homes. The administration said that food, clean drinking water, medicines and other necessary facilities had been ensured for the flood affectees.\n\nThe DC said that public health facilities were also being ensured in the affected areas under the leadership of Health Chief Executive Officer (CEO) Dr Sara Safdar. While, he said, agriculture director was ensuring uninterrupted supply of fodder for cattle. He said the Pakistan Army, Rescue 1122, police and other institutions engaged in the rescue and rehabilitation operation were the real heroes.\n\nDr Sara said that for the provision of free medical facilities, about 1,000 doctors and paramedical staff were working in three shifts at two field hospitals, 28 mobile clinics and nine campuses in the affected areas.\n\nMajority of residents still living in their submerged homes along with cattle\n\nThe Livestock department had also deployed three veterinary camps, seven mobile dispensaries and 17 veterinary doctors in the affected areas. Six deputy directors and an additional director had been deployed in the field to monitor the situation. So far, the administration claimed that 12,475 animals had been vaccinated.\n\nMeanwhile, a group of people, claiming to bring food for more than 1,000 people, had been stopped by the administration. When this correspondent contacted the administration, an official said the private citizens were stopped to ensure provision of safe and hygienic food for the flood affectees.\n\nMeanwhile, Pakistan People’s Party Central Information Secretary Nadeem Afzal Chan and PPP District Sargodha President Malik Hamid Nawaz Awan along with their team visited the flood-affected areas of Kot Momin.\n\nSpeaking to the media on this occasion, Mr Chan alleged the administration comes to the embankment, takes pictures and then goes back. The residents of the area are worried, their crops and houses have been destroyed and are currently waiting for help from the government, but the administration is limited to photo sessions only.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b4ca7635945.jpg",
  "retrievedAt": "2025-10-12T03:57:37.852Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938763/floodwater-inundates-relief-camps-in-kot-momin",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:33.000Z"
}
