{
  "title": "Analysis: How to interpret the shift in US policy on Kabul - Newspaper - DAWN.COM",
  "author": null,
  "content": "ALTHOUGH the Trump administration has taken a dim view of the Afghan Taliban in the past, recent overtures suggest the White House’s approach towards the regime in Kabul may not be as blunt as previously thought.\n\nThis subtle but obvious change is surprising, because as recently as February, the Republican chairman of the House Foreign Affairs Committee, Brian Mast, publicly criticised the State Department and USAID for wasting ‘hard-earned tax dollars’ — citing, among other things, a $15 million grant allegedly providing condoms to the Taliban.\n\nThe indication of the shift came from Sebastian Gorka, Deputy Assistant to President Donald Trump and Director for Counterterrorism, during his remarks at a Heritage Foundation event last month.\n\n“This sounds strange coming out of my mouth, but the Taliban have been moderately cooperative counterterrorism partners because there are certain threat groups in their country, Muslim threat groups that threaten them as well, and so we’re working together,” Mr Gorka told the audience.\n\nTrump aide hints at limited security cooperation, but experts say Taliban regime recognition is unlikely\n\n“We don’t have a complete overlap in threats, but not bad,” he observed, noting that it was this threat perception that at times forced “the Taliban … to align their actions with our security objectives”.\n\nMr Gorka also showered praise on Pakistan, saying that apprehending Sharifullah — the IS-Khorasan terrorist currently being tried in the US for orchestrating the Abbey Gate bombing of 2021 — would not have been possible without Islamabad’s cooperation.\n\nExperts argue that a direct US-Taliban channel could ease Pakistan’s operational burden as the primary conduit for aid and dialogue with Kabul, but it could also reduce Islamabad’s leverage with both Washington and the Taliban. At the same time, Afghanistan’s potential integration into regional trade and energy networks could benefit Pakistan economically.\n\nAccording to Shuja Nawaz, a distinguished fellow at the Atlantic Council, Afghanistan as a tributary to CPEC would be key to developing the tribal districts of Pakistan, while Kabul could stand to gain from being a conduit for energy from Uzbekistan, Kyrgyz Republic, and Tajikistan.\n\nHassan Abbas, professor of International Security Studies at Washington’s National Defence University, told Dawn that US-Taliban contacts have quietly continued since the hasty August 2021 withdrawal.\n\nThese have largely been driven by a shared concern over the threat posed by IS-Khorasan.\n\nAbbas, who has also written a book on the Taliban resurgence, noted: “While these channels do not amount to recognition, they reflect a practical convergence on counterterrorism. However, their internal divisions — between those advocating limited pragmatism and others clinging to rigid control — remain a major obstacle to meaningful outreach”.\n\nFor Prof Touqir Hussain of Georgetown University, the engagement with Kabul is likely a geopolitical power play, in that Washington does not want Afghanistan to slide back into the Chinese and Russian sphere of influence. He noted the US also needs Kabul’s cooperation to repatriate around 9,000 Afghans living in the US under temporary protected status, as well as the repatriation to the US of Afghans left behind, who had cooperated with the Americans, and the release of any US detainees.\n\n“But Washington does not want any deep or long-term engagement with the Taliban. The strong counterterrorism interest can perhaps be addressed with over-the-horizon arrangement with Pakistan or Central Asian countries,” Prof Hussain added.\n\nThe Taliban, he said, were not averse to direct counterterrorism arrangements with Washington either, “in the hope it might lead to recognition.”\n\nThe Trump administration “may agree to this cooperation but may not give much in return by way of the restoration of some aid programs,” he added.\n\nFor Daniel S. Markey, senior research professor at Johns Hopkins’ School of Advanced International Studies, this limited counterterrorism cooperation may not lead to a major thaw in US-Taliban relations.\n\n“Mainly because there are so many other priorities for the Trump administration. But I can’t rule it out either, since deal-making and flexibility are the president’s hallmarks,” Markey told Dawn.\n\nIn the words of Prof Nadeem Hussain of George Washington University, since relations between Kabul and Islamabad are strained at the moment, the Taliban’s willingness to collaborate with the US directly might irk the establishment in Islamabad, but it may actually be good for Pakistan overall.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:58:52.550Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938798",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:41:42.000Z"
}
