{
  "title": "Four cops injured in attack near Babusar Top - Pakistan - DAWN.COM",
  "author": null,
  "content": "GILGIT: At least four police personnel were injured when militants attacked a patrol van near Babusar Top, within the jurisdiction of Khyber Pakhtunkhwa, officials told Dawn on Sunday night.\n\nAccording to details, one of the injured personnel is said to be in critical condition.\n\nAccording to police, the attack occurred at around 9:30pm in the Gatidas area, which lies at the boundary between Diamer district of Gilgit-Baltistan and Khyber Pakhtunkhwa. A preliminary report from the Naraan Police Station in KP stated that their personnel were on patrol near Babusar Top when assailants opened fire on their van.\n\nDiamer SSP Abdul Hameed told Dawn that the incident took place within KP’s jurisdiction. He said that Diamer police personnel stationed at the Babusar Top checkpoint were the first to respond, informing KP authorities and rescuing the injured, who were later shifted to Naraan. One of the officers reportedly sustained head injuries and remains in critical condition.\n\nThis attack follows another deadly assault two days earlier, in which two GB Scouts personnel were martyred and another injured in a terrorist attack on a security checkpoint along the Karakoram Highway in Hudur, Chilas (Diamer district).\n\nAccording to GB Home Minister Shams Lone, the GB Scouts checkpoint had been established on December 2, 2023, in response to a previous firing incident on a passenger bus that left nine dead and 21 injured.\n\nThe banned Tehreek-i-Taliban Pakistan (TTP), which claimed responsibility for the earlier attack, also claimed the latest ambush on the KP police van.\n\nSSP Diamer Abdul Hameed confirmed that the TTP had officially claimed responsibility for the Chilas attack.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:57:34.451Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938831/four-cops-injured-in-attack-near-babusar-top",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:41:56.000Z"
}
