{
  "title": "KP urges Centre to engage partners for improving climate resilience - Pakistan - DAWN.COM",
  "author": null,
  "content": "PESHAWAR: The Khyber Pakhtunkhwa government has requested the federal government to engage development partners for improving the province’s climate resilience as it has remained prone to incidents like torrential rainfall, flashfloods and cloudburst, given its geographical locale.\n\nOn August 28, the provincial government wrote a letter and addressed federal secretaries of economic affairs division and planning, development and special initiatives.\n\nThe letter, a copy of which is available with Dawn, read that the number of adverse climatic events had surged and intensified. Such incidents could take place in future as well, that too at a wider scale, it added.\n\n“In this regard, we would request the ministry of planning, development and special initiatives and ministry of economic affairs to support the KP’s cause in seeking assistance from partners to enhance climate resilience, using cutting edge interventions,” said the letter.\n\nLetter says details of damage should not be considered final as monsoon spell continues\n\nThe provincial government sought investments in, but not limited to, advanced early warning systems, flood resilience, watershed management, climate resilient infrastructure and communication networks, climate smart agriculture and nature-based solutions.\n\nThe letter said that following the meeting on flood damage and relief activities held on August 19, a damage assessment survey was conducted to engage with development partners for refinancing of loans to rehabilitate the affected areas. It added that following torrential rainfall, flash floods and incidents of cloudburst in eight districts, the provincial government responded immediately and deployed all available resources.\n\nA comprehensive survey was initiated to assess the damage and special teams were deployed to verify it and compile report for perusal of competent authorities and relevant development partners.\n\nAccording to data, the catastrophe left 406 dead and 248 injured. Livestock damage was 5412, crops lost on 57,892 acres, 667 house were destroyed while 2,520 were partially damaged, 1,280 shops were destroyed, 513 kilometres of roads were damaged, 47 bridges were destroyed, 41 culverts, 691 schools, 60 health facilities, 477 irrigation schemes, and 367 public health engineering schemes were also destroyed.\n\nThe letter said that the details should not be considered final as the monsoon spell had extended and affected 14 districts. Apart from infrastructure, the federal government was informed that the KP government was providing compensation of Rs2 million for each life lost and Rs5 million for each injured person.\n\n“Interim assessments indicate restoration and rehabilitation cost of damage to government infrastructures including roads, bridges, culverts, irrigation, public health engineering, health and education structures to be around Rs20 billion,” the letter said.\n\nIt added that it was important to note that compensation being paid for damage to private structures was separate from the stated figure.\n\nIt said that the KP chief minister had approved compensation for damaged shops, previously not covered under Provincial Disaster Management Authority (PDMA) policy.\n\nThe letter said that the provincial government had so far released Rs6.5 billion for immediate relief efforts, including evacuations, rescue operations, provision of cooked food and non-food items, as well as compensation for the deceased, injured and private property damaged by the catastrophe. It added that the rehabilitation of damaged infrastructure should commence on emergency basis subsequent to the ongoing survey and technical formalities.\n\nThe provincial government extended its gratitude to the federal government for being cognisant of the damage and providing support to approach the development partners to engage them in rehabilitation works.\n\n“The provincial government effectively undertook relief and rescue operations through own sources. It has completed considerable restoration works and is well-equipped to undertake the rehabilitation of the damaged infrastructure,” it said.\n\nThe letter said that the government had commenced an exercise to identify existing internationally financed projects with unutilised components destined for de-scoping to be repurposed for financing rehabilitation, if required.\n\nThe provincial government said it looked forward to partners to enhance capacities of provincial departments and first line responders as per international best practices to effectively cope with such disasters besides proposed financing in enhancement of anticipatory resilience of vulnerable communities.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:58:52.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938741/kp-urges-centre-to-engage-partners-for-improving-climate-resilience",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:45.000Z"
}
