{
  "title": "PDMA releases Rs338m for militancy-hit districts - Pakistan - DAWN.COM",
  "author": null,
  "content": "BAJAUR: The Provincial Disaster Management Authority (PDMA) Khyber Pakhtunkhwa has released around Rs338 million under the Civilian Victims Support Fund (CVSF), providing crucial financial relief to the families affected by militancy and other tragedies across the merged districts.\n\nAccording to the statement issued here on Sunday, in a parallel relief initiative, the PDMA has released Rs1.945 billion for internally displaced persons (IDPs) in Bajaur due to the ongoing targeted military operation in the restive Mamund region.\n\nThe statement said that so far 21,810 families have been registered, totaling over 152,000 individuals, including men, women, and children. It said that each family was entitled to Rs50,000 one-time grant, Rs15,000 in ration stamps, and Rs25,000 on repatriation as a return cash grant (RCG) under the special directives of Chief Minister Ali Amin Gandapur.\n\nThe district-wise CVSF releases reflect the PDMA’s targeted approach, with Bajaur receiving Rs73.7 million, North Waziristan Rs28.5 million, South Waziristan Upper Rs16.4 million, South Waziristan Lower Rs7.6 million, Kurram Rs22.25 million, and Khyber Rs25 million.\n\n21,810 families registered as targeted military operation continues in Mamund\n\nThe statement said that pending cases have also been addressed, including Rs5.3 million for Bajaur, Rs24.5 million for North Waziristan, Rs26.2 million for South Waziristan Upper, Rs7.6 million for South Waziristan Lower, Rs2.2 million for Kurram, and Rs1.5 million for Khyber.\n\nSpecial releases included Rs10 million for Maulana Khan Zeb, Rs95 million under Khyber special compensation, and Rs16 million for victims of the Libya boat incident.\n\n“Our commitment is to ensure timely and transparent compensation to families who have suffered due to militancy and other tragedies,” the statement quoted Miss Sobia Hassam Toru, director complex emergencies wing (CEW) PDMA as saying.\n\nThese payments are meant to provide immediate relief and reaffirm the state’s support to its citizens in distress.” Alongside financial support, the PDMA continues relief operations for Bajaur’s IDPs, the statement added.\n\nThe main relief camp at Bajaur Sports Complex accommodates 488 families in 462 tents, 5,841 families are residing in schools and other government buildings while all other registered families are residing in host community with their relatives and rented houses, bringing the total registered population to 21,810 families having around 152,000 individuals.\n\nAccording to the statement Miss Sobia Hassam Toru told that camp services included cooked meals three times a day, dry ration, drinking water, washing facilities, electricity with backup generators, 24-hour medical care with six doctors and 14 health technicians, ambulance services, children’s educational activities, and community volunteer committees to resolve grievances.\n\nA madrassa has also been established for continuity of children’s education, it said, stating that three registration points have been set up at Qaddafi Utmankhel, Inayat Kalay, and Khar tehsil, providing Nadra verification, bank account facilities and cash disbursement.\n\nOn this occasion, DG PDMA Mr. Asfandyar Khattak said the PDMA was engaged on multiple fronts, including flood relief and rehabilitation, flash and urban flooding while giving Bajaur IDPs the same attention in accommodation, hygiene, WASH facilities, and cash assistance to support their daily necessities.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b4c6cc13d3e.jpg",
  "retrievedAt": "2025-10-12T03:57:40.484Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938734/pdma-releases-rs338m-for-militancy-hit-districts",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:45.000Z"
}
