{
  "title": "Aid flotilla leaves Spain to ‘break illegal Gaza siege’ - World - DAWN.COM",
  "author": null,
  "content": "BARCELONA: A flotilla, Spanish term for a fleet of ships or boats, carrying humanitarian aid and activists, including Swedish climate campaigner Greta Thunberg, prepared on Sunday to leave from Barcelona to try to “break the illegal siege of Gaza,” organisers said.\n\nThe vessels will set off from the Spanish port city to “open a humanitarian corridor and end the ongoing genocide of the Palestinian people,” said the Global Sumud Flotilla — sumud is the Arabic term for “resilience”.\n\nThe group’s website states it is an independent organisation with no affiliation to any government or political party.\n\nA fleet of boats was ready to depart with hundreds on board, including activists from various countries like Irish actor Liam Cunningham and Spain’s Eduard Fernandez, as well as European lawmakers, public figures and former Barcelona mayor Ada Colau.\n\nGreta Thunberg and other public figures sail to open a humanitarian corridor\n\nThe flotilla is expected to arrive at the war-ravaged coastal enclave in mid-September.\n\n“The question here today is not why we are sailing. This story is not at all about the mission that we are about to embark upon,” Ms Thunberg told reporters. She said the goal was to bring in aid and open a humanitarian corridor to break an “illegal” and “inhuman” blockade of Gaza.\n\n“The story here is about Palestine. The story here is how people are being deliberately deprived of the very basic means to survive. The story here is how the world can be silent,” she said.\n\nMr Cunningham said the presence of the flotilla signifies the world’s failure to uphold international and humanitarian laws, marking a disgraceful period in history.\n\nOrganisers say other vessels are expected to leave Tunisian and other Mediterranean ports on Sept 4 to join the aid mission. “This will be the largest solidarity mission in history, with more people and more boats than all previous attempts combined,” Brazilian activist Thiago Avila said.\n\nActivists will also stage simultaneous demonstrations and other protests in 44 countries “in solidarity with the Palestinian people”, Ms Thunberg wrote on Instagram.\n\n“We understand that this is a legal mission under international law,” Portu­guese lawmaker Mariana Mortagua, who will join the mission, told journalists.\n\nPrevious attempts\n\nPreviously, Israel blocked aid ships to Gaza in June and July. In one instance, the sailboat Madleen with 12 activists, including Thunberg, was intercepted 185 km from Gaza, and its passengers were detained and expelled.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/68b4ceb0a28c0.jpg",
  "retrievedAt": "2025-10-12T03:58:00.012Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938796/aid-flotilla-leaves-spain-to-break-illegal-gaza-siege",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:41:42.000Z"
}
