{
  "title": "This is Pakistan’s best T20 team, says Hasan Nawaz after UAE thrashing - Sport - DAWN.COM",
  "author": null,
  "content": "SHARJAH: Pakistan’s emerging batter Hasan Nawaz believes he is a part of the country’s “best T20 team” following back-to-back wins in the opening two matches of the ongoing tri-series in the United Arab Emirates.\n\nIn the tournament being played as warm-up ahead of the Asia Cup — which starts Sept. 9 — Pakistan have started with thrashings of Afghanistan and UAE thanks to a number of players chipping in with impactful contributions.\n\nAfter seasoned pacer Haris Rauf and skipper Salman Ali Agha led Pakistan to a 39-run win over Afghanistan in the opener, Saim Ayub and Hasan Nawaz himself scored half centuries each to see the side down UAE by 31 runs.\n\nThe UAE fixture saw Pakistan cross the 200-mark as Hasan Nawaz launched a late onslaught after opener Saim Ayub had set the stage. Experienced fast bowler Hasan Ali then wrapped up the proceedings with 3-47 as UAE’s Asif Khan’s blistering 77 off 35 went in vain.\n\nUnder white-ball head coach Mike Hesson, Pakistan are building up to next year’s T20 World Cup without now discarded senior pros Babar Azam and Mohammad Rizwan and Hasan Nawaz said the young team was prepared for the upcoming challenges.\n\n“You see the youngsters in front of you, all of them work very hard, even in the off-season,” he told reporters after the match on Saturday.\n\n“I honestly feel this is Pakistan’s best T20 team … the plan is to win the tri-series and then, god-willing, the Asia Cup as well.”\n\nHasan Nawaz, coming in at number six, smashed 56 off 26 – a knock studded with six sixes and two fours – to boost Pakistan to 207. For the Layyah-born right-hander, his freedom to go big came due to Saim’s knock for 69 off 38 (seven fours and four sixes).\n\n“In the beginning, Saim Ayub and Sahibzada Farhan had already set the tone,” he said.\n\n“So, my mindset was that we should now aim for a bigger target. There wasn’t much time to settle, so the plan was to cross 200. I just played according to that plan.”\n\nPakistan shuffled their bowling line-up to bring in Hasan Ali and Salman Mirza in place of Shaheen Shah Afridi and Haris — the latter duo having played against Afghanistan.\n\nHasan Nawaz said the changes pointed towards a changing culture, where no players are considered second choice.\n\n“I don’t see it as ‘bench strength’ because for me, all our players are equal,” noted the 23-year-old.\n\n“Hasan Ali, for example, is a senior player — you can’t call him ‘bench strength’.\n\nPakistan’s will face Afghanistan again in their third tri-series match on Thursday. The tournament’s final is set for Sept. 7.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/01101545a4b6c70.webp",
  "retrievedAt": "2025-10-12T03:57:55.858Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938800/this-is-pakistans-best-t20-team-says-hasan-nawaz-after-uae-thrashing",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:42:11.000Z"
}
