{
  "title": "President signs controversial Anti-Terrorism Bill into law - Newspaper - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: President Asif Ali Zardari on Sunday signed into law the controversial Anti-Terrorism (Amendment) Bill, 2025, which the government claims is aimed at strengthening counterterrorism efforts while ensuring legal oversight and safeguards.\n\nUnder the legislation, any person suspected of engaging in activities that threaten national security or public safety can be detained. Those involved in target killings, kidnappings for ransom or extortion may be held for up to three months.\n\nThe bill says it applies to any person “against whom sufficient grounds exist of his having been so concerned, for the purpose of inquiry”.\n\nIt also specifies that detention under Section 11EEEE, including periods beyond three months, will be subject to Article 10 of the Constitution, which provides safeguards relating to arrest and detention.\n\nConsensus reached on amendments to National Commission for Minorities Rights Bill\n\n“If a detention order is issued by the army or civil forces, the investigation will be conducted by a joint investigation team,” the bill states. “The inquiry will be conducted by no police officer below the rank of superintendent of police, intelligence agencies, civil armed forces, armed forces, and other law-enforcing agencies.”\n\nA statement of objects and reasons, presented in the houses during the passage of the bill, said that the current security situation in the country required a “robust response that goes beyond the existing legal framework”.\n\nPTI has opposed the bill, stressing that it could be used against it.\n\nThe amendments to the Anti-Terrorism Act (ATA), 1997, were passed by both the National Assembly and the Senate this month amid opposition uproar.\n\nThe Presidency said in a statement that the law included judicial oversight and safeguards to provide recourse against the misuse and abuse of power, unlike past arbitrary practices.\n\n“The amendment aims to improve counterterrorism efforts while ensuring legal oversight and safeguards,” it said. “This is an important step in addressing Pakistan’s ongoing security challenges.”\n\nIt added, “The government or, where the provisions of Section 4 have been invoked, the armed forces or civil armed forces, as the case may be, subject to the specific or general order of the government in this regard, for a period not exceeding three months and after recording reasons thereof, issue order for the preventative detention of any person.” This amendment was made to Sub-Section 1 of Section 11EEEE of the ATA.\n\n“The erstwhile amendment of Section 11EEEE of the Act ibid, are required to be re-inserted to empower the government, Armed Forces and Civil Armed Forces with the necessary authority to detain individuals who pose a significant threat to national security,” it added.\n\nMinorities Rights bill\n\nThe Presidency also announced on Sunday that a consensus had been reached on amendments to the National Commission for Minorities Rights Bill, 2025.\n\nIt added that the revised version had been finalised at a recent meeting at the Presidency and forwarded to parliament for reconsideration in a joint session.\n\nThe amendments were prepared following a message from the President under Article 75(1) of the Constitution.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:57:37.826Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938834",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:41:56.000Z"
}
