{
  "title": "How climate change-driven displacement is reshaping Pakistan’s cities - Pakistan - DAWN.COM",
  "author": null,
  "content": "“We left our village and came to Karachi when the floods destroyed everything. But here, surviving is a constant struggle,” lamented Abrar, 62, seated outside his house in Tent City, Hawkesbay.\n\nHis house and that of other flood victims are made of fabric, bamboo and other scraps that the migrants have assembled to create a semblance of shelter. The Tent City was established as part of the state’s response to manage and relocate displaced people across Karachi after catastrophic floods hit Sindh, first in 2010 and then in 2022, when 33 million people lost their homes to the deluge that submerged one-third of the country.\n\nInternal displacement has today become a predominant form of forced migration across the globe. Internally displaced people are particularly vulnerable, and this is contingent on the complex linkages between migration and gender, economic distress, conflict, violence, and climate crisis impacts.\n\nMost of the displaced people across the world are situated in hot regions, such as Pakistan, and, like Abrar, live in poor quality shelters with limited access to health services, which puts them at a high risk of exposure to extreme heat.\n\nPakistan is now one of the most vulnerable countries to climate change, according to the Climate Risk Index 2025. The intersection of climate change and internal displacement presents a complex array of challenges, both immediate and long-term term for cities and for the people who are forced to migrate to them.\n\nAt the same time, it also adds to the ongoing infrastructural, economic, and demographic challenges in cities like Karachi, already brimming with a population of over 25 million. These challenges are deeply interwoven across environmental, socio-economic, governance and infrastructure domains.\n\nAccording to the Internal Displacement Monitoring Centre (IDMC), there have been over 24.3 million internal displacements between 2009 and 2023, due to 107 disaster events — droughts, wildfires, wet mass movements and floods — in Pakistan. Floods alone have accounted for 24.1 million of such displacements.\n\nBoth the 2010 and 2022 floods triggered extensive displacements and migrations from rural to urban areas, Karachi being a major recipient here in Sindh. Even though there is no clear-cut data on displacement and the resulting migration induced by heatwaves, urban heat islands are, nevertheless, exacerbating the vulnerability of displaced people as they endeavour to adapt to new urban environments.\n\nIn Sindh, frequent and intense flooding, coupled with the deterioration of the Indus River Delta system, droughts and water scarcity, have triggered large-scale migrations of rural-agrarian populations into cities such as Karachi, Hyderabad, and Jacobabad, where basic services are already stretched.\n\nThere are several critical challenges that emerge from these dynamics and are particularly relevant to Sindh and Balochistan. The most fundamental challenge is the absence of robust climate information systems and the dearth of resilient infrastructures, both of which can easily compound displaced people’s vulnerability.\n\nFurthermore, given the weak coordination between national and local governments, the process for receiving, managing and reintegrating or resettling displaced people is often poorly managed or is ad hoc. The absence of a centralised registry, policy and planning framework further exacerbates these challenges.\n\nOne challenge that is often overlooked is the overcrowding of informal settlements, which largely takes place when displaced families end up living in informal or low-income settlements. In Karachi, these are typically situated along the coast, such as Ibrahim Hyderi, Rehri Goth and Lath Basti, or in peri-urban areas such as Sindhabad and Tent City Hawkesbay, where infrastructure services are largely absent.\n\nHence, there is increased strain on housing, water, sanitation, healthcare and transport. This can generate tensions between new migrants and the older communities that host them. Some of the migrants who arrived in Karachi after the 2022 floods perceived a difference in terms of how they were welcomed and accommodated.\n\n“I feel like the people of Karachi have not accepted us with an open heart this time; not the way they did many of those who arrived after the floods in 2010,” said a resident at the Tent City.\n\nThis issue is intensified by the ongoing challenge of tenure security, whereby displaced people risk being evicted when they — unknowingly or otherwise — squat on public land to build shelter. Consequently, they are forced to navigate risks at various scales.\n\nThe challenges do not end here. The difficulties mentioned above intersect with existing gaps in data on displaced people migrating to urban centres. Even though migrants are documented in various surveys by the Pakistan Bureau of Statistics (PBS), these documents often fail to capture the scale of migration that has grown due to the impacts of the climate crisis.\n\nFor instance, the Labour Force Survey lists the causes of migration as either economic (including job transfer, searching for a job or better agricultural land, business, etc); social (education, health, marriage, who they migrated with, change or residence, etc); security/law & order situation; natural disaster; and ‘other’. However, the climate change-related disaster category is not disaggregated into what types or for how long ago.\n\nSimilarly, the Pakistan Social & Living Standard Measurement Survey (PSLM) lists only the proportion of migrant vs non migrant populations across the country, but not the causes of migration. In fact, it defines a migrant as someone who is ‘born in one district and at the time of interview living [sic] in another district’.\n\nThe national Census 2023 is less clear: the reasons for migration include job/ business, education, marriage, with family, back to home, and others. Even though, as a census, it is meant to capture such information, there is no coverage given to climate-induced displacement and the resulting migration. Thus, data-wise, it is difficult to gauge the impact of climate change-induced migrations on demographics, labour, and urban indicators.\n\nThere are also gaps in the decentralisation of service provision whereby local governments in cities such as Karachi lack the authority, resources, or at times the legal mandate to manage post-disaster migration flows effectively.\n\nThis creates a vacuum that philanthropists, NGOs or charitable organisations often fill by deploying their own models of service delivery in certain neighbourhoods, rather than in districts as a whole, simply because they don’t possess the capacity that the state holds.\n\nIn the broader landscape of city and regional planning across Pakistan, urban planners hardly engage with the increasingly critical issue of integrating climate adaptation, displacement, and migration flows in terms of how these will shape development plans, especially the availability of shelter, jobs, health services and land.\n\nAcross Pakistan’s cities, economic marginalisation and livelihood insecurity feed into displaced people’s lives. They are often forced to rely on precarious, low-wage, undocumented jobs that offer no social protection. At most, they take up menial labour tasks, vending, or unskilled construction work.\n\n“Ghurbat bohot hai idhar (there is a lot of poverty here),” explained Abdul, who lives at the Tent City. “Many people beg on the roads; others work as labourers; some women sell bangles. We used to be respectable farmers, but we have been forced to become beggars.”\n\nAbdul’s story echoed through the weak walls of most of the houses at the settlement, showing how the loss of rural livelihoods — caused by climate change — is rarely offset by comparable opportunities in urban centres.\n\nMoreover, there are significant mental health and social stress-associated challenges that displacement often triggers. These manifest in different ways for men, women, children and the elderly. Even though displaced people who migrate to cities often adapt to their new urban environments, the process also generates adverse experiences, intergenerational trauma, and compounded vulnerabilities — children miss out on education, play spaces, and can be exposed to malnutrition.\n\nOn the other hand, displaced women might be more exposed to the effects of extreme heat that could impact nutrition due to the absence of safe and clean water that is essential for hydration, cooking and hygiene. This risk is even more pronounced if they are breastfeeding and responsible for household chores, with exposure to heat sources.\n\nThese conditions then give way to long-term health consequences such as chronic kidney diseases, gastrointestinal illnesses and adverse effects on the body’s thermoregulation abilities. Furthermore, floods and extreme heat amplify existing urban inequalities, with migrants being hit the hardest due to the inadequate provision of safe shelter, location in flood-prone or heat-intensified zones, and lack of health services, insurance, credit, or safety nets.\n\nEffective governance of displaced people requires, at the bare minimum, a recognition by the state of the complexities of climate-change-induced displacement, in addition to the problems encountered during phases of post-resettlement to a temporary or even a permanent site.\n\nThe aforementioned issues are on show in Sindhabad, an informal settlement located near the Karachi-Hyderabad Super Highway. It has served as a place of refuge for displaced people who migrated to Karachi during the 2010 and 2022 floods.\n\nTypically, people here live in makeshift shelters and with limited access to water, sanitation, electricity, primary healthcare and education. According to the residents, they convinced PBS representatives who were conducting census surveys around their neighbourhood in 2023 to include their settlement in the assessment.\n\nToday, Sindhabad has a population of 152,381, with an average family size of five persons per household. Given that, on average, families have three children, there are approximately 91,428 children out of school in the locality.\n\nThe problems of inaccessible infrastructure are pervasive, which often leads to violent outcomes as residents navigate a precarious route to access water. “Here, you have to sacrifice your life just to get water,” said Preeti, 45.\n\n“Two years ago, we lost our daughter because she was crossing the highway to get water. A speeding truck hit her and her friend … my daughter died on the spot, and her friend was disabled,“ the grief-stricken mother recalled.\n\nPreeti’s words reveal the brutal reality that displaced people must face at times, compelled to find water as they adapt in perilous environments where essential services are often absent or located far away.\n\nDespite these glaring ground realities, there is limited solid data available at the urban level on internal displacement and the ensuing migration driven by climate crisis impacts in Pakistan.\n\nLocal governments often rely on voluntary registrations, making targeted planning and relief provision difficult across cities. There is limited disaggregation by gender, age, ethnicity or vulnerability levels, and the absence of integrated data systems between agencies such as the National Database and Registration Authority (NADRA), the National Disaster Management Authority (NDMA) and urban planning departments.\n\nEven though a positive step has been taken at the national level in terms of establishing a Global Climate-Change Impact Studies Centre (GCISC) in Islamabad, which is dedicated to producing research on Pakistan, there is still an urgent need for clear-cut, cohesive interventions for policy action.\n\nHere are some necessary actions, at the bare minimum, to tackle the challenge of climate-change-induced internal displacement and migration for immediate as well as long-term planning for Pakistan’s cities.\n\nHeader image: A man wades through flood waters carrying his grand daughter on his back following rains and floods during the monsoon season in 2022. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/09/01142031fc11226.webp",
  "retrievedAt": "2025-09-06T09:58:41.591Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938893/how-climate-change-driven-displacement-is-reshaping-pakistans-cities",
  "dateList": "2025-09-01",
  "date_published": "2025-09-01T09:21:53.000Z"
}
