{
  "title": "Ministers warn of flooding in Balochistan areas close to Sindh - Pakistan - DAWN.COM",
  "author": null,
  "content": "QUETTA/DERA MURAD JAMALI: The Balochistan government has issued a high alert as heavy floodwaters move southwards, raising serious concerns for the districts close to Sindh province and linked to the Indus River canal system.\n\nIrrigation Minister Mir Sadiq Umrani and Adviser to the Chief Minister Dr Rubaba Buledi warned of an increasingly alarming flood situation. The provincial government was monitoring developments closely and coordinating with Sindh and Punjab to ensure a timely emergency response, they claimed.\n\nCitizens, especially those living near rivers and canals, have been urged to take precautionary measures and strictly follow local administration guidelines.\n\nProvincial Disaster Management Authority (PDMA) Director General Jahanzeb Khan, Nasirabad division commissioner Salahuddin Noorzai, and deputy commissioners of flood-prone districts visited vulnerable areas near the Sindh border. They reviewed the situation, assessed readiness, and coordinated with local administrations.\n\nNasir Majeed, chief engineer of canals, who inspected the Pat Feeder Canal from RD-418 to RD-505, was briefed by irrigation officials on the current flood risk and the capacity of the Indus River to carry nearly one million cusecs of water.\n\nMeanwhile, the health department reviewed the situation and ramped up medical and relief operations. Senior officials at a meeting, chaired by Health Minister Bakht Muhammad Kakar, decided to strengthen disease surveillance, ensure immediate availability of anti-venom, deploy mobile health units, and activate the 1129 control room for public support.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-09-06T09:59:12.771Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938794/ministers-warn-of-flooding-in-balochistan-areas-close-to-sindh",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:41:42.000Z"
}
