{
  "title": "Wheat plantation area declined by 6.5pc in Pakistan, says Food and Agri­culture Organisation - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Food and Agri­culture Organisation (FAO) of the United Nations says though the wheat production in Pakistan has officially been estimated at 29 million tonnes in 2025, reflecting about 5 per cent above the five-year average, the area planted has declined by 6.5pc compared to the previous year.\n\nThe reason for the decline in area of plantation is attributed to the removal of the minimal support price since May 2024, combined with low domestic wheat prices at the planting time that led some farmers to shift to more profitable vegetables and cash crops, including oilseeds, condiments and vegetables, says Global Information and Early Warning System on Food and Agriculture (GIEWS) on Pakistan in its latest issue.\n\nIn irrigated areas, yields are estimated to be above average, but dry weather conditions caused crop losses in rain-fed areas, which acco­unt for about 20pc of wheat plantings, and in some irrigated areas in northern parts due to shortage of irrigation water, the FAO report says.\n\nRemoval of minimal support price since May 2024 blamed for decline in plantation area\n\nPlanting of the 2025 paddy crop finalised in early August. In some areas, farmers undertook replanting operations following severe localised flooding between June and early August. The floods and landslides particularly affected northern and northwestern areas, Khyber Pakhtunkhwa province, as well as parts of Punjab, Sindh and Balochistan provinces, resulting in localised crop losses and disruption of agricultural livelihood.\n\nThe report says in the 2024-25 marketing year wheat imports were significantly below the five-year average after the introduction of an import ban on wheat grain in July 2024. This year the government also put a ban on exports of wheat flour, including flour made from imported wheat, wheat products, refined flour and semolina, which is still in place as of early August 2025.\n\nExports of rice, the country’s major exportable cereal, are preliminarily forecast at 5.5 million tonnes in calendar year 2025. Exports of maize in the 2025-26 marketing year are preliminarily forecast at an average level of 500,000 tonnes.\n\nDomestic prices of wheat flour, the country’s main staple food, declined by about 50pc between March 2024 and July 2025. The decline in prices reflects abundant market availability driven by consecutive good harvests and large imports in 2023-24, as well as by the government’s decision, since 2024, to cease wheat procurement from farmers at an MSP.\n\nThe abolition of the minimum support price was part of a broader package of economic reforms required by the International Monetary Fund (IMF) as a condition to secure a $7 billion bailout approved in 2024.\n\nPublished in Dawn, September 1st, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T03:58:01.474Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1938793/wheat-plantation-area-declined-by-65pc-in-pakistan-says-food-and-agriculture-organisation",
  "dateList": "2025-09-01",
  "date_published": "2025-08-31T23:41:42.000Z"
}
