{
  "title": "Security institutions fully prepared to root-out terrorism in the country: Rashid",
  "link": "https://www.app.com.pk/national/security-institutions-fully-prepared-to-root-out-terrorism-in-the-country-rashid/",
  "date_published": "2022-01-22T14:26:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 22 (APP): Interior Minister Sheikh Rashid Ahmed Saturday said the security institutions were fully prepared to root-out terrorism in the country.\nAddressing a news conference, he said the incidents like Lahore blast could not shatter government’s determination and morale, adding that investigation of the incident was underway and perpetrators of the incident would be brought to justice.\nHe said all the institutions have been issued alert by the interior ministry and directed to remain vigilant to avoid any untoward situation.\n“Deadlock over negotiations with TTP came due to their unacceptable conditions” he said adding that two terrorist of TTP were killed in Islamabad on January 18th and same action would be taken against anyone who would try to spoil the peace of the motherland.\nThe Minister said our nation paid heavy price for peace restoration in the country and no one would be allowed at any cost to spoil it. He said we have sacrificed more than 80,000 lives in war against terrorism and suffered an economic loss of around 150 billion dollars for the purpose.\nOn protest call by the opposition’s alliance towards Islamabad on March 23, Sheikh Rashid asked the opposition to review its decision to hold the march and change the date of the protest as some roads in the federal capital might be closed from March 21 in connection with the Parade rehearsal.\nRegarding speculations about Presidential system in the country, he said no such move has been discussed in the cabinet.\nSheikh Rashid expressed the hope that Prime Minister Imran Khan would complete his five-year tenure and the current opposition would not succeed in any undemocratic move.",
  "retrievedAt": "2025-08-11T14:10:08.797Z"
}
