{
  "title": "Sabalenka stands tall, Norrie survives to reach Wimbledon quarter-finals - Sport - DAWN.COM",
  "author": null,
  "content": "Women’s top seed Aryna Sabalenka and men’s defending champion Carlos Alcaraz both survived tough tests to reach the Wimbledon quarter-finals and Cameron Norrie kept alive British singles hopes after surviving a five-set thriller on Sunday.\n\nSabalenka ruined home favourite Emma Raducanu’s dream in the previous round but had the Centre Court crowd cheering her on as she beat Elise Mertens 6-4 7-6(4) in a high-quality duel.\n\nWimbledon’s new automated line-calling technology came under fire after an embarrassing malfunction robbed Anastasia Pavlyuchenkova of a point during her last-16 victory over Britain’s Sonay Kartal on Centre Court.\n\nSpaniard Alcaraz came through a ferocious firefight against Russian 14th seed Andrey Rublev 6-7(5) 6-3 6-4 6-4 to stay on course for a third successive title.\n\n“Andrey is one of the most powerful players we have on Tour and is so aggressive with the ball. He forces you to the limit on each point,” Alcaraz, bidding to become only the fourth man to win back-to-back French Open and Wimbledon titles multiple times, said on court.\n\nThe 22-year-old second seed extended his current winning streak to 22 matches and will take on Norrie for a place in the semi-finals after the unseeded Briton soaked up 46 aces from towering Chilean Nicolas Jarry to win a feisty Court One battle 6-3 7-6(4) 6-7(7) 6-7(5) 6-3.\n\nWhile Alcaraz seeks a Wimbledon hat-trick, Sabalenka is eyeing her first title on the London lawns after missing last year’s tournament with injury and the 2022 edition due to the ban on Russian and Belarusian players, and the 27-year-old made a fast start against Mertens.\n\nSabalenka, who claimed doubles titles at the US Open and Australian Open partnering Mertens, was then put through the wringer before raising her level to prevail.\n\nThe victory improved her win-loss record against Belgian Mertens to 11-2 and she said the growing adoration of the crowd made a big difference after fans were on the other side of the fence when she met Raducanu on Friday.\n\n“I definitely felt the support. It was so amazing playing and feeling the support. I didn’t have to pretend that they were cheering for me because they were really cheering for me,” said Sabalenka, who will face the 37-year-old German Laura Siegemund in the quarter-finals.\n\n“What can be better than that? I really enjoyed it. I hope it can stay the same all the way, and they help me energy-wise to stay strong and to face all of the challenges.”\n\nSiegemund, the second-oldest player to start in the women’s draw this year, swatted aside plucky Argentine lucky loser Solana Sierra with a 6-3 6-2 victory in a Court Two match interrupted by the heavy showers that prompted organisers to shut the roofs for the day’s play on Centre Court and Court One.\n\nWhile Sierra was the first lucky loser to reach the last 16 in the professional era, Siegemund created her own slice of history by becoming the oldest woman to reach her first Wimbledon quarter-final.\n\nExplaining her run, Siegemund said it was simple. “It’s like you have an opponent. Either you find good solutions and you execute well, you go forward, or you don’t, and you don’t go forward. So it’s very simple,” she said.\n\nSierra’s fellow South American, Jarry, fought back brilliantly against Norrie after saving a match point in the third-set tiebreak but fell short in a needle match.\n\nJarry seemed irritated at times during the heat of battle and the players exchanged words at the end.\n\n“Cameron played unbelievable. Not unbelievable, played great. He did his job. He plays like that,” said qualifier Jarry, whose total ace count reached a tournament-leading 111.\n\nAsked what happened, Norrie said there had been no problem.\n\n“I think he just said I was being a little bit too vocal,” he said. “Honestly, nothing but credit to Nico for his performance. I guess we both really wanted to win.”\n\nNorrie, a 2022 semi-finalist, is the last British hope after the unseeded Kartal’s run ended with a 7-6(3) 6-4 defeat by experienced Russian Pavlyuchenkova.\n\nThe big talking point in that match was the malfunction of the Electronic Line Calling system, which left the Russian former French Open runner-up seething after being robbed of a game point at 4-4 in the opening set when there was no ‘out’ call despite a Kartal shot landing over the baseline.\n\nUmpire Nico Helwerth sought advice from tournament organisers via telephone and then ruled that the point should be replayed, with Pavlyuchenkova going on to have her serve broken.\n\n“We were waiting for a decision as the system was down, but I was expecting to hear if they said the ball was in or out,” she said. “I expected a different decision. I just thought also the chair umpire could take the initiative.\n\n“That’s why he’s there sitting on the chair. He also saw it (was) out, he told me after the match. I thought he would do that, but he didn’t. I think it’s also difficult for him. He probably was scared to take such a big decision.”\n\nOrganisers said it had been caused by the system being ‘deactivated in error’.\n\nAmerican fifth seed Taylor Fritz marched on after his Australian opponent Jordan Thompson retired with a thigh injury at 6-1 3-0 down in their fourth-round meeting.\n\nUp next for Fritz is a meeting with Russian 17th seed Karen Khachanov who thumped Poland’s Kamil Majchrzak 6-4 6-2 6-3.\n\nFritz is not the only American to reach the quarter-finals, after 13th seed Amanda Anisimova beat Linda Noskova 6-2 5-7 6-4 in the day’s final action.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/0711061345b20d4.jpg",
  "retrievedAt": "2025-08-17T19:52:37.313Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922536/sabalenka-stands-tall-norrie-survives-to-reach-wimbledon-quarter-finals",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T06:27:33.000Z"
}
