{
  "title": "From Karachi to Gaza: Pakistani startup ships prosthetics to child war survivors - Pakistan - DAWN.COM",
  "author": null,
  "content": "As soon as eight-year-old Sidra Al Bordeeni returned from the clinic with her prosthetic arm, she jumped on a bicycle in the Jordanian refugee camp where she lives, riding for the first time since a missile strike in Gaza took her arm a year ago.\n\nSidra was injured while sheltering at Nuseirat School, one of several Gaza schools converted into makeshift refuges from Israeli strikes. Her mother, Sabreen Al Bordeeni, said Gaza’s collapsed health services and the family’s inability to leave at the time made it impossible to save her hand.\n\n“She’s out playing, and all her friends and siblings are fascinated by her arm,” Al Bordeeni said on the phone, repeatedly thanking God for this day. “I can’t express how grateful I am to see my daughter happy.”\n\nThe arm was built over 4,000 kilometres away in Karachi by Bioniks, a Pakistani company that uses a smartphone app to take pictures from different angles and create a 3D model for custom prosthetics.\n\nCEO Anas Niaz said the social enterprise startup had fit more than 1,000 custom-designed arms inside Pakistan since 2021 — funded through a mix of patient payments, corporate sponsorship, and donations — but this was its first time providing prosthetics to those impacted in conflict.\n\nSidra and three-year-old Habebat Allah, who lost both her arms and a leg in Gaza, went through days of remote consultations and virtual fittings. Then Niaz flew from Karachi to Amman to meet the girls and make his company’s first overseas delivery.\n\nSidra’s device was funded by Mafaz Clinic in Amman, while donations from Pakistanis paid for Habebat’s. Mafaz CEO Entesar Asaker said the clinic partnered with Bioniks for its low costs, remote solutions and ability to troubleshoot virtually.\n\nNiaz said each prosthetic arm costs about $2,500, significantly less than the $10,000 to $20,000 for alternatives made in the United States.\n\nWhile Bioniks’ arms are less sophisticated than US versions, they provide a high level of functionality for children and their remote process makes them more accessible than options from other countries such as Turkiye and South Korea.\n\n“We plan on providing limbs for people in other conflict zones too, like Ukraine, and become a global company,” Niaz said.\n\nGlobally, most advanced prosthetics are designed for adults and rarely reach children in war zones, who need lighter limbs and replacements every 12–18 months as they grow.\n\nNiaz said they were exploring funding options for Sidra and Habebat’s future replacements, adding the cost wouldn’t be too high.\n\n“Only a few components would need to be changed,” he said, “the rest can be reused to help another child.”\n\nBioniks occasionally incorporates popular fictional characters into its children’s prosthetics such as Marvel’s Iron Man or Disney’s Elsa, a feature Niaz said helps with emotional acceptance and daily use.\n\nContacted by Dawn.com, the Bioniks CEO said, “We will now be looking to speed up the process as this was just a test case.”\n\nHe said that they had collaborated with clinics working for the survivors and were hopeful that — after these initial cases — they would soon be able to provide limbs to a greater number of amputees.\n\nGaza now has around 4,500 new amputees, on top of 2,000 existing cases from before the conflict, many of them children, making it one of the highest child-amputation crises per capita in recent history, the UN humanitarian agency OCHA said in March.\n\nAn April study by the Palestinian Bureau of Statistics found at least 7,000 children have been injured since Israel’s war on Gaza began in October 2023. Local health authorities say more than 50,000 Palestinians have been killed, nearly one-third of them children.\n\nThe World Health Organisation has said Gaza’s health system is “on its knees” with Israel’s border closures drying up critical supplies, meaning the wounded cannot access specialised care, especially amid waves of wounded patients.\n\n“Where it’s nearly impossible for healthcare professionals and patients to meet, remote treatment bridges a critical gap, making assessments, fittings, and follow-up possible without travel or specialised centres,” said Asadullah Khan, Clinic Manager at ProActive Prosthetic in Leeds, UK, which provides artificial limbs and support for trauma patients.\n\nBioniks hopes to pioneer such solutions on a large scale but funding remains a roadblock and the company is still trying to form viable partnerships.\n\nSidra is still adjusting to her new hand on which she now wears a small bracelet. For much of the past year, when she wanted to make a heart, a simple gesture using both hands, she would ask someone else to complete it. This time, she formed the shape herself, snapped a photo, and sent it to her father, who is still trapped in Gaza.\n\n“What I’m looking forward to most is using both my arms to finally hug my father when I see him,” she said.\n\nHeader image : A technician checks a prosthetic limb at the Bioniks, in Karachi, April 29, 2024. — Reuters",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/07094809bc46b48.jpg",
  "retrievedAt": "2025-08-17T19:52:42.031Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922526/from-karachi-to-gaza-pakistani-startup-ships-prosthetics-to-child-war-survivors",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T05:24:25.000Z"
}
