{
  "title": "Trump to host Netanyahu, hopes for Israel-Hamas deal ‘this week’ - World - DAWN.COM",
  "author": null,
  "content": "Israeli Prime Minister Benjamin Netanyahu will meet on Monday with US President Donald Trump, who expressed hope for a “deal this week” between Israel and Hamas that sees hostages released from the Gaza Strip.\n\nIndirect negotiations between Israel and Hamas began on Sunday evening in Doha, aiming to broker a ceasefire and reach an agreement on the release of hostages in exchange for Palestinian prisoners.\n\nTrump said on Sunday that there was a “good chance” of reaching an agreement.\n\n“We’ve gotten a lot of the hostages out, but pertaining to the remaining hostages, quite a few of them will be coming out,” he told journalists.\n\nNetanyahu, speaking before boarding his flight to Washington on Sunday, said his meeting with Trump could “definitely help advance this” deal.\n\nNetanyahu said he dispatched the team to Doha with “clear instructions” to reach an agreement “under the conditions that we have agreed to”.\n\nHe previously said Hamas’ response to a draft US-backed ceasefire proposal, conveyed through Qatari and Egyptian mediators, contained “unacceptable” demands.\n\nTwo Palestinian sources close to the discussions told AFP the proposal included a 60-day truce, during which Hamas would release 10 living hostages and several bodies in exchange for Palestinians detained by Israel.\n\nHowever, they said, the group was also demanding certain conditions for Israel’s withdrawal, guarantees against a resumption of fighting during negotiations, and the return of the UN-led aid distribution system.\n\nNetanyahu has an “important mission” in Washington, “advancing a deal to bring all our hostages home”, said Israeli President Isaac Herzog after meeting him on Sunday.\n\nTrump is not scheduled to meet the Israeli premier until 6:30pm (3:30am PKT) on Monday, the White House said, without the usual presence of journalists.\n\nOf the 251 hostages taken by Hamas during the 2023 attack, 49 are still being held in Gaza, including 27, the Israeli military says, are dead.\n\nSince Hamas’s October 2023 attack sparked the massive Israeli offensive in Gaza, mediators have brokered two temporary halts in the fighting. They have seen hostages freed in exchange for some of the thousands of Palestinian prisoners in Israeli custody.\n\nRecent efforts to broker a new truce have repeatedly failed, with the primary point of contention being Israel’s rejection of Hamas’s demand for a lasting ceasefire.\n\nIsrael’s offensive has killed at least 57,418 people in Gaza, with the death toll feared to be much higher due to thousands missing under the rubble.\n\nIn Gaza, the territory’s civil defence agency reported 26 people killed by Israeli forces on Sunday, 10 of them in a strike in Gaza City’s Sheikh Radwan neighbourhood.\n\n“We are losing young people, families and children every day, and this must stop now,” Sheikh Radwan resident Osama al-Hanawi told AFP.\n\n“Enough blood has been shed.”\n\nContacted by AFP, the Israeli military said it could not comment on specific strikes without precise coordinates.\n\nThe offensive has created dire humanitarian conditions for the more than two million people in the Gaza Strip.\n\nA US- and Israel-backed group, the Gaza Humanitarian Foundation (GHF), took the lead in food distribution in the territory in late May, when Israel partially lifted a more than two-month blockade on aid deliveries.\n\nBut its operations have had a chaotic rollout, with repeated reports of aid seekers killed near its facilities while awaiting rations.\n\nUN agencies and major aid groups have refused to cooperate with the GHF over concerns that it was designed to cater to Israeli military objectives.\n\nThe UN human rights office said last week that more than 500 people have been killed waiting to access food from GHF distribution points.\n\nThe Gaza health ministry on Sunday placed the toll even higher, at 751 killed.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/07084358802f2d1.jpg",
  "retrievedAt": "2025-08-17T19:52:43.095Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922520/trump-to-host-netanyahu-hopes-for-israel-hamas-deal-this-week",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T03:48:14.000Z"
}
