{
  "title": "Musk-Trump feud escalates with ‘America Party’ announcement - World - DAWN.COM",
  "author": null,
  "content": "More than a month after their initial social media bluster, Elon Musk has announced the formation of a new US political party in response to US President Donald Trump signing his sweeping tax and spending bill into law.\n\nTrump criticised the new party announcement, calling it “ridiculous”, while Musk, once a close ally of the president, said the party would aim to unseat the Republican lawmakers in Congress who backed the bill, in next year’s midterm elections.\n\nInvestors in Musk’s Tesla were rattled by concerns that the billionaire’s deepening involvement in politics would shift his focus away from the automaker at a tumultuous time.\n\nHere’s how the spat between the world’s most powerful man and its richest has unfolded:\n\nJune 3: Musk attacks Trump’s top legislative priority — a sweeping tax cut and spending bill.\n\n“I’m sorry, but I just can’t stand it anymore. This massive, outrageous, pork-filled Congressional spending bill is a disgusting abomination. Shame on those who voted for it: you know you did wrong. You know it,” he wrote on his X platform.\n\nJune 5, around noon ET: Trump says he anticipates Musk criticising him personally.\n\n“Look, Elon and I had a great relationship. I don’t know if we will anymore,” Trump said in the Oval Office. “He said the most beautiful things about me, and he hasn’t said bad about me personally, but I’m sure that’ll be next. But I’m, I’m very disappointed in Elon. I’ve helped Elon a lot.”\n\nJune 5, 12.10 pm ET: Musk posts on X: “Slim Beautiful Bill for the win.”\n\nJune 5, 12.25 pm ET: Musk responds to a clip of Trump from the Oval Office saying Musk knew the inner workings of the bill.\n\n“False. This bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!” Musk wrote on X.\n\nJune 5, 1.57 pm ET: Musk launches a poll on X with the question: “Is it time to create a new political party in America that actually represents the 80 per cent in the middle?”\n\nJune 5, 2.37 pm ET: Trump hits back on his social media platform, Truth Social.\n\n“Elon was ‘wearing thin,’ I asked him to leave, I took away his EV Mandate that forced everyone to buy Electric Cars that nobody else wanted (that he knew for months I was going to do!), and he just went Crazy!” “The easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elons Governmental Subsidies and Contracts. I was always surprised that Biden didn’t do it!”\n\nJune 5, 4.06 pm ET: Trump defends the spending bill and takes a swipe at Musk: “I don’t mind Elon turning against me, but he should have done so months ago. This is one of the Greatest Bills ever presented to Congress,” Trump wrote on Truth Social.\n\nJune 5, 4.09 pm ET: Musk posts on X in response to Trump’s comments about government contracts: “In light of the President’s statement about cancellation of my government contracts, @SpaceX will begin decommissioning its Dragon spacecraft immediately.”\n\nJune 5, 4.11 pm ET: Musk writes “yes” on X in response to another user posting: “President vs Elon. Who wins? My money’s on Elon. Trump should be impeached and JD Vance should replace him.”\n\nJune 5, 4.26 pm ET: Musk writes: “The Trump tariffs will cause a recession in the second half of this year.”\n\nJune 5, 11:29 pm ET: Trump tells Politico, “Oh it’s okay,” and, “It’s going very well, never done better,” when asked about his public breakup with Musk, the news outlet reported.\n\nWhite House aides have scheduled a call on Friday with Musk to broker peace, Politico reported.\n\nJune 6, 08:12 am ET (5:12 pm PKT): Trump is not interested in talking to Musk, a White House source with knowledge of the matter says on Friday.\n\nJune 6, 6:23 pm ET: When asked whether he would consider cutting government contracts held by Musk, Trump says he will look at everything.\n\nJune 7, 12:37 pm ET Trump, in a telephone interview with NBC News, says his relationship with Musk is over and warned there would be “serious consequences” if Musk funds US Democrats.\n\n“No,” Trump tells NBC when asked if he had any desire to repair his relationship with Musk. “I have no intention of speaking to him,” Trump says.\n\nJune 9, 3:31 pm ET Trump says he has no plans to discontinue Starlink at the White House but might move his Tesla off-site.\n\nJune 11, 03:05 am ET Musk says he regrets some of the posts he made last week about Trump, in a post on X.\n\nJune 30, 3:08 pm ET Musk starts a series of posts on X criticising the new bill.\n\n“It is obvious with the insane spending of this bill, which increases the debt ceiling by a record five trillion dollars that we live in a one-party country the Porky Pig Party!!”\n\nJune 30, 4:02 pm ET Musk writes: “Every member of Congress who campaigned on reducing government spending and then immediately voted for the biggest debt increase in history should hang their head in shame!” “And they will lose their primary next year if it is the last thing I do on this Earth.”\n\nJuly 1, 12:44 am ET Trump posts on social media platform Truth Social, suggesting DOGE look into subsidies received by Musk’s companies to save money.\n\n“Elon Musk knew, long before he so strongly Endorsed me for President, that I was strongly against the EV Mandate. It is ridiculous, and was always a major part of my campaign. Electric cars are fine, but not everyone should be forced to own one. Elon may get more subsidy than any human being in history, by far, and without subsidies, Elon would probably have to close up shop and head back home to South Africa. No more Rocket launches, Satellites, or Electric Car Production, and our Country would save a Fortune. Perhaps we should have DOGE take a good, hard, look at this? Big Money To Be Saved!!!”\n\nJuly 1, 12:57 am ET Musk responds to Trump’s comments on X: “I am literally saying Cut It All. Now.”\n\nJuly 4, 8:57 am ET Musk creates a poll on X, asking people if they would want him to create the America Party.\n\n“Independence Day is the perfect time to ask if you want independence from the two-party (some would say uniparty) system!” The vote ends with 65.4% in favour of creating the party with 34.6pc against.\n\nJuly 5, 3:46 pm ET Musk announces the formation of the America Party on X.\n\n“By a factor of 2 to 1, you want a new political party and you shall have it! When it comes to bankrupting our country with waste & graft, we live in a one-party system, not a democracy.”\n\n“Today, the America Party is formed to give you back your freedom.”\n\nJuly 6, 6:20 pm ET Trump posts on Truth Social about Musk’s formation of a third political party.\n\n“I am saddened to watch Elon Musk go completely ‘off the rails,’ essentially becoming a Train Wreck over the past five weeks. He even wants to start a Third Political Party, despite the fact that they have never succeeded in the United States — The System seems not designed for them.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-17T19:52:05.887Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922582/musk-trump-feud-escalates-with-america-party-announcement",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T12:39:04.000Z"
}
