{
  "title": "Brics nations slam Trump tariffs, condemn strikes on Iran - World - DAWN.COM",
  "author": null,
  "content": "Brics leaders at a summit on Sunday took aim at US President Donald Trump’s “indiscriminate” import tariffs and recent Israeli-US strikes on Iran.\n\nThe 11 emerging nations — including Brazil, Russia, India, China and South Africa — account for about half the world’s population and 40 per cent of global economic output.\n\nThe bloc is divided about much, but found common cause when it comes to the mercurial US leader and his stop-start tariff wars — even if it avoided naming him directly.\n\nVoicing “serious concerns about the rise of unilateral tariff” measures, Brics members said the tariffs risked hurting the global economy, according to a summit joint statement.\n\nTrump fired back at the bloc directly on social media on Sunday night.\n\n“Any country aligning themselves with the Anti-American policies of Brics will be charged an additional 10 per cent Tariff. There will be no exceptions to this policy,” Trump wrote on his Truth Social platform.\n\nEarlier, Brics also offered symbolic backing to fellow member Iran, condemning a series of military strikes on nuclear and other targets carried out by Israel and the United States.\n\nIn April, Trump threatened allies and rivals alike with a slew of punitive duties, before offering a months-long reprieve in the face of a fierce market sell-off.\n\nTrump has warned he will impose unilateral levies on partners unless they reach “deals” by August 1.\n\nIn an apparent concession to US allies, such as Brazil, India, and Saudi Arabia, the summit declaration did not criticise the United States or its president by name at any point.\n\nConceived two decades ago as a forum for fast-growing economies, the BRICS have come to be seen as a Chinese-driven counterbalance to US and Western European power.\n\nBut as the group has expanded to include Iran, Saudi Arabia and others, it has struggled to reach meaningful consensus on issues from the Gaza onslaught to challenging US global dominance.\n\nBrics nations, for example, collectively called for a peaceful two-state solution to the Israel-Palestinian conflict — despite Tehran’s long-standing position that Israel should be destroyed.\n\nAn Iranian diplomatic source said his government’s “reservations” had been conveyed to Brazilian hosts. Still, Iran stopped short of rejecting the statement outright.\n\nIn perhaps a further sign of the diplomatic sensitivities, Saudi Arabia’s foreign minister skipped Sunday’s discussions entirely, according to a Brazilian government source.\n\nSaudi Arabia is among the world’s leading beneficiaries of high-tech US military exports and is a long-standing US partner.\n\nThe political punch of this year’s summit has been depleted by the absence of China’s Xi Jinping, who skipped the meeting for the first time in his 12 years as president.\n\nThe Chinese leader is not the only notable absentee. Russian President Vladimir Putin, charged with war crimes in Ukraine, also opted to stay away, participating via video link.\n\nHe told counterparts that Brics had become a key player in global governance.\n\nThe summit also called for regulation governing artificial intelligence and said the technology could not be the preserve of only rich nations.\n\nThe commercial AI sector is currently dominated by US tech giants, although China and other nations have rapidly developing capacity.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/07084103c50f0d9.jpg",
  "retrievedAt": "2025-08-17T19:52:51.071Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922519/brics-nations-slam-trump-tariffs-condemn-strikes-on-iran",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T03:41:48.000Z"
}
