{
  "title": "Iran president says Tehran open to nuclear dialogue with US, accuses Israel of assassination attempt - World - DAWN.COM",
  "author": null,
  "content": "Iranian President Masoud Pezeshkian said in an interview released on Monday that his country has “no problem” restarting nuclear talks with the United States, provided that trust can be reestablished between Washington and Tehran, and also accused Israel of attempting to assassinate him.\n\nThe remarks, made during an interview with US journalist and former Trump confidante Tucker Carlson, came less than a month after Israel launched an unprecedented bombing campaign on June 13 against Iran and the US struck the Islamic republic’s nuclear facilities.\n\nThe attacks took place days before Tehran and Washington were set to meet for a new round of nuclear talks, stalling negotiations that were aimed at reaching a deal over Iran’s atomic programme.\n\n“We see no problem in re-entering the negotiations,” the Iranian president said. “There is a condition … for restarting the talks. How are we going to trust the US again?\n\n“We re-entered the negotiations, then how can we know for sure that in the middle of the talks, the Israeli regime will not be given the permission again to attack us?”\n\nPezeshkian also said that Israel attempted to assassinate him after Tel Aviv’s strikes killed top military commanders and nuclear scientists.\n\n“They did try, yes. They acted accordingly, but they failed,” Pezeshkian told Carlson in response to a question on whether he believed Israel had tried to kill him.\n\n“It was not the US that was behind the attempt on my life. It was Israel. I was in a meeting … they tried to bombard the area in which we were holding that meeting,” he said, according to a translation of his remarks from Persian.\n\nMore than 900 people were killed in Iran during the conflict, according to the judiciary. The Israeli attacks drew waves of retaliatory drone and missile fire, killing 28 people in Israel, according to authorities.\n\nThe 12-day war between Iran and Israel saw it, along with the US, launching strikes on Iranian nuclear facilities at Fordow, Isfahan and Natanz. A ceasefire between Iran and Israel has held since June 24.\n\nOn June 16, Israeli Prime Minister Benjamin Netanyahu did not rule out plans to assassinate Iran’s supreme leader, Ayatollah Ali Khamenei, saying it would “end the conflict” after reports emerged at the time that US President Donald Trump had vetoed the move.\n\nDuring the interview with Carlson, Pezeshkian accused Netanyahu of pursuing his “own agenda” of “forever wars” in the Middle East and urged the US not to be dragged into it.\n\n“The US administration should refrain from getting involved in a war that is not America’s war, it is Netanyahu’s war,” he said.\n\n“I believe the US president can guide the region and the world to peace and tranquillity, or, on the other hand, to lead it to forever wars,” Pezeshkian said.\n\nWhen asked about giving up Iran’s nuclear programme, Pezeshkian reiterated that Tehran was not pursuing nuclear weapons, nor was it in the past.\n\n“Netanyahu, since 1984, has created this false mentality that Iran seeks a nuclear bomb … and it has put it in the minds of every US president since then,” the Iranian president said.\n\n“We have never been after developing a nuclear bomb … because this is wrong and in contrast to the religious decree which has been issued by his eminence, the supreme leader of the Islamic Republic of Iran. It is religiously forbidden for us to go after a nuclear bomb.”\n\nWhen asked if Americans should be afraid of Iran, Pezeshkian tried to dispel those fears and said it was “a very wrong impression” of Iranians.\n\n“Iran has never invaded another country in the last 200 years,” he explained. He added that when Iranians chanted, “Death to the United States”, they did not mean “death to the people or officials of the United States”.\n\n“They mean ‘death’ to crimes, atrocities, bullying, to the use of force and anyone who would become an accomplice in crimes perpetrated by others,” Pezeshkian stated.\n\nLater, Pezeshkian said on X: “I told Tucker Carlson: While we were negotiating in good faith at the request of the US, Netanyahu dropped bombs — literally — on diplomacy.\n\n“Israel torpedoed the talks and killed peace. The world should remember who derailed the process,” he wrote.\n\nThe Iranian president said that his country neither started the war nor wanted it to continue.\n\n“From day one, our policy has been clear: unity at home, peace with our neighbours, and stability in the region,” Pezeshkian wrote. He noted that the US must choose between reining in Netanyahu or following him “into another forever war”, adding that only US President Donald Trump can stop Netanyahu.\n\nPezeshkian quoted Supreme Leader Ayatollah Ali Khamenei as saying that American investors “are welcome in Iran”.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/07/07194018e61dcf7.jpg",
  "retrievedAt": "2025-08-17T19:51:42.241Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922600/iran-president-says-tehran-open-to-nuclear-dialogue-with-us-accuses-israel-of-assassination-attempt",
  "dateList": "2025-07-07",
  "date_published": "2025-07-07T15:03:28.000Z"
}
