{
  "title": "Saarc’s future - Newspaper - DAWN.COM",
  "author": null,
  "content": "FOR nearly a decade, Saarc has lain dormant, a victim of India’s stubborn refusal to engage with Pakistan. The platform became dysfunctional after New Delhi chose to boycott the Islamabad summit in 2016, and a few other countries followed suit.\n\nBut South Asia’s vast potential cannot be held hostage forever by India. This is perhaps why recent reports of Pakistan, China and Bangladesh possibly exploring a new regional bloc generated considerable excitement, including across our eastern border, with observers speculating that the three countries may be contemplating a grouping sans India.\n\nTempting as the possibility may have seemed to some, Islamabad has for now publicly reiterated its commitment to Saarc, signalling that it still believes in inclusive regionalism. Diplomatically, this puts the ball in India’s court: it is now up to New Delhi to recognise that reviving the forum, and not fragmenting the region with its rivalries, is the path to unlocking South Asia’s untapped potential. Saarc was a promising platform for economic and cultural integration, but it has decidedly failed to emulate Asean’s success, even though that is what it had originally aspired to do.\n\nThe platform’s charter makes it compulsory for all states to attend summits at the level of heads of government or state. India chose to exploit this when it led a boycott of the Islamabad summit in 2016. Pakistan, on the other hand, has consistently championed Saarc’s potential, even in strained times.\n\nPerhaps New Delhi needs a reminder that there was a time in the 1990s when Pakistan was tempted to do what it did in 2016 but chose prudence instead. In 1995, with tensions between India and Pakistan at a high, then prime minister Benazir Bhutto did not wish to attend the Eighth Saarc Summit in New Delhi. The then president Farooq Leghari was nonetheless dispatched in her stead, reflecting Islamabad’s commitment to the platform and the process.\n\nToday, Pakistan is reaffirming its dedication to Saarc. It is a vital mechanism to address shared challenges such as poverty, climate change and trade barriers. But if India continues to choose disengagement and obstruct progress, it should reconsider its stance without hesitation. With the global economy experiencing upheaval, and conflict over dwindling resources growing intense, there is strength to be found in numbers. With or without India, South Asia must forge ahead.\n\nPublished in Dawn, July 6th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/medium/2025/07/05104414af43083.jpg?r=104755",
  "retrievedAt": "2025-08-17T19:52:49.316Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1922427/saarcs-future",
  "dateList": "2025-07-07",
  "date_published": "2025-07-06T02:32:22.000Z"
}
