{
  "title": "ICT’s open door policy makes govt offices more accessible",
  "author": null,
  "content": "ISLAMABAD, Jun 13 (APP):The open-door policy introduced by the Islamabad district administration is showing results and residents of Islamabad are now finding it easier to reach out to district officials through this policy.\nAccording to the spokesman of ICT administration here, the open-door policy introduced by the Islamabad district administration is showing results. Citizens are meeting officials without prior appointments and getting their issues addressed in less time.\nAccording to Deputy Commissioner Irfan Nawaz Memon, all district offices are following this policy. He said the move is meant to improve coordination between the public and the administration and ensure that complaints are addressed without delay.\nUnder the new approach, officials are required to meet citizens daily and listen to their concerns. The Deputy Commissioner himself is monitoring the situation and has directed that immediate action should be taken on public complaints.\n“Citizens can visit any district office during working hours without an appointment. If they are not satisfied with the response from any department, they can contact the DC office directly,” said Irfan Nawaz Memon.\nTo support this effort, the administration has also made a 24/7 helpline available. Through this helpline, residents can register their complaints at any time and receive timely feedback.\nOfficials have been instructed to give proper attention to every visitor. The DC emphasized that listening to people and resolving their problems is now part of the daily duty of all officers.\nThe policy has already made a noticeable impact. People are getting more access to officials, and many minor issues are being solved on the spot. The process of waiting for appointments or making multiple visits to government offices has been reduced.\nIn addition, the district administration has said that it will continue to evaluate the policy to make further improvements. The DC noted that such steps are necessary to strengthen trust between the public and the administration.\nThe DC Office said that the open-door approach is one step toward meeting that demand and will help the administration stay connected with the needs of the people.\nBy removing barriers between citizens and officials, the Islamabad administration hopes to create a more effective system for handling complaints and improving services.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:06:41.784Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/icts-open-door-policy-makes-govt-offices-more-accessible/",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T16:18:00.000Z"
}
