{
  "title": "Irfan Siddiqui holds PTI responsible for pushing country towards economic collapse",
  "author": null,
  "content": "ISLAMABAD, Jun 13 (APP):Pakistan Muslim League Nawaz (PML-N) Parliamentary Leader in Senate Senator Irfan –ul-Siddiqui on Friday held the former Pakistan Tehreek-e-Insaf (PTI) government responsible for derailing the country’s thriving economy and damaging national institutions due to bad governance.\nIrfan Siddiqui who is also chairman of Senate Standing Committee on Foreign Affairs said the nation was dragged into a crisis due to the personal enmity of one man, who toppled a functioning system only to bring in another figurehead of his choice.\nHe said Pakistan’s downfall began when an elected prime minister was ousted, not due to constitutional reasons, but to satisfy personal agendas. “To push a fast developing country into chaos only because someone wanted to remove one leader and bring another, is not democracy but revenge politics,” he remarked.\nHe stated that the PML-N government had raised the GDP growth rate from 2% in 2013 to 6.1% by 2018. During the same period, per capita income increased by $322, rising from $1,446 to $1,768. He added that food inflation was brought down to 3.8%, compared to 7.1% when the party assumed office. “When we handed over the government, the economic indicators were stable,” he said. “However, the PTI reversed all the gains we had achieved.”\nHe said that under PTI’s rule, the stock market stagnated, and inflation soared. He criticized PTI for increasing the policy rate to 13% from 6.5 percent and for doubling the debt burden within four years.\nHe said PTI changed five finance ministers in less than four years and failed to appoint a capable economic team. “They mocked Deputy Prime Minister Senator Muhammad Ishaq Dar, yet couldn’t find a replacement even after multiple experiments,” he added.\nHe said when a no-confidence motion was announced, PTI panicked and recklessly slashed fuel prices, causing confusion in the financial sector and damaging International Monitory Fund (IMF) trust. “That move alone pushed Pakistan further into uncertainty,” he said.\nHe said PTI leaders even appealed to overseas Pakistanis not to send remittances, yet the Pakistani Diaspora continued to show loyalty and increased remittances to record highs.\nHe questioned PTI’s call to stop IMF from helping Pakistan. “What kind of patriotism is this? Who tells the world to let their own country default?” he asked.\nHe said that PTI not only violated the Constitution but also abused the judiciary, targeted judges, and launched vendettas against political opponents. “They dragged sisters and daughters into jails but pretend to respect women’s dignity,” he said.\nHe said unlike PTI’s broken promises like turning the PM House into a university, the PML-N actually delivered projects visible on the ground. “Where are the 500 colleges and universities PTI promised? Where is the economic revolution?” he questioned.\nSaddiqui said the current government must reform and strengthen institutions, not cripple them. “These academic and literary bodies represent our national identity and must be preserved,” he stressed.\nQuoting a couplet by Qayyum Tajooree, Irfan Siddiqui concluded, “Waqt karta hai parwarish barson, haadsa ek dum nahi hota”, implying that the PTI’s misgovernance did not begin or end in a day, but was a continuous process of erosion.\nSenator Irfan Siddiqui strongly condemned the Israeli aggression on Iran, saying it was not only a violation of international law but also an attack on the conscience of the global community.\nIrfan Siddiqui said that Israel’s deliberate attacks on Iranian military sites and the martyrdom of senior officials were highly deplorable and amounted to state terrorism.\nHe said, “This is terrorism at its peak. When one person is targeted somewhere, the world labels it terrorism and puts a bounty on his head worth millions. But when a state openly conducts aggression and murders senior officials of another sovereign country, the world chooses to remain silent.”\nHe said if the world remained quiet on such acts, it would signify the dominance of rogue states and terrorist regimes. “This is no longer just a political issue; it is a matter of global morality and justice,” he added.\nHe also praised Opposition Leader Shibli Faraz for delivering his remarks on the budget and current affairs in detail and said, “We listened to him with patience and tolerance, and I hope our views will be received the same way.”\nHe said, “In 2017, we had overcome load-shedding, inflation was down to 3–4%, and the stock market was at 55,000 points. We had bid farewell to the IMF. But due to a carefully designed project by certain powerful circles, the democratic process was derailed.”\nSenator Siddiqui urged the nation to differentiate between real and fabricated narratives and called for a return to political maturity and economic stability through dialogue, patience, and democratic values.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:07:29.321Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/irfan-siddiqui-holds-pti-responsible-for-pushing-country-towards-economic-collapse/",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T10:34:00.000Z"
}
