{
  "title": "PM stresses need for public awareness on regular blood donations",
  "author": null,
  "content": "ISLAMABAD, Jun 13 (APP): Prime Minister Shehbaz Sharif paying tribute to “voluntary heroes” for selflessly donating blood, stressed the need for increased public awareness about the critical need of regular blood donations for patients.\n“There is a need for increased public awareness about the critical need of regular blood donations for patients undergoing surgeries, childbirth and for those suffering from serious ailments like cancer and anemia,” the prime minister said in his message to the nation on World Blood Donor Day annually commemorated on June 14.\nHe said the Day was commemorated to pay a global tribute to voluntary heroes who selflessly donate blood to join a noble cause of giving a second chance to live to millions of human beings, besides underscoring the urgency to ensure continued blood donations.\nHe said that the theme for World Blood Donor Day 2025 “Give blood, Give hope: together we save lives” aptly emphasized on the need for regular blood donations to kindle hope of life in patients.\n“We extend our gratitude and deep appreciation to the blood donors: the silent saviors. Blood donation, besides being an act of compassion for humanity is a necessity for the health care system of any country,” the prime minister remarked.\nHe said that according to WHO, Pakistan was faced with a shortage of safe blood supply due to limited blood donations.\nPrime Minister Shehbaz said that the Government of Pakistan was fully sensitized to the situation and through National Blood Transfusion Program (NBTP), Blood donation awareness campaigns were aiming to address this challenge.\nHowever, he said that there was a need for robust collective efforts to meet this mounting challenge. In Pakistan only 10% of the blood donors are voluntary donors and the rest of blood donations come from the relatives and friends of the patients, he added.\nPrime Minister Shehbaz urged every healthy and compassionate citizen, especially youth to realize their civic duty and serve the humanitarian cause by donating blood.\nHe appreciated the number of private blood donor associations which were doing their part in this greater cause of making sufficient blood donation available for the patients in need.\n“Together we make safer, protected and healthier Pakistan,” he added.",
  "tags": [],
  "categories": [],
  "image": null,
  "retrievedAt": "2025-08-27T11:06:20.313Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pm-stresses-need-for-public-awareness-on-regular-blood-donations/",
  "dateList": "2025-06-13",
  "date_published": "2025-06-13T18:59:00.000Z"
}
