{
  "title": "Parliamentarians must take stand against foreign powers: Farrukh",
  "link": "https://www.app.com.pk/national/parliamentarians-must-take-stand-against-foreign-powers-farrukh/",
  "date_published": "2022-04-01T15:06:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 1 (APP): Minister of State for Information and Broadcasting Farrukh Habib on Friday said it was high time for all the parliamentarians to take a stand against the foreign powers, which were allegedly involved in hatching a conspiracy against the democratically elected government of Prime Minister Imran Khan.\n“As the foreign conspiracy becomes public knowledge, it will be difficult for all the public representatives to respond to this during a visit to their constituencies,” he said while talking to the media persons.\nNo doubt left after the issuance of the National Security Committee meeting’s communiqué and demarche by the Foreign Office over the matter, he said. It was ironic that some people had downplayed the “threat letter” and regime change plot of the foreign powers, he added.\nFarrukh said Pakistan Muslim League-Nawaz President Shehbaz Sharif had stated earlier that he would support the prime minister in the no-trust motion if there was any “threat” letter or document, but now he shied away from his own commitment.\nHe alleged that the opposition leaders were not ready to see the evidence of the conspiracy as they, themselves, were part of the plot.\n“They did not have the guts to oust the government and brought the no-trust motion against a democratically elected prime minister on the behest of foreign conspirators,” he added.\nThe opposition parties’ leaders like ‘Mir Jaffer’ and ‘Mir Sadiq’ might compromise on the national interests for their vested ones, he claimed.\nThe minister said Prime Minister Imran Khan was a brave leader and would never compromise on the national interests and the independent foreign policy pursued by his government for the country’s progress and prosperity.\nHe said the Pakistan Tehreek-e-Insaf (PTI) had outperformed all the opposition parties in the second phase of Khyber Pakhtunkhwa’s local bodies election.\nHe said the local bodies’ election results had proved once again that the people stood by the PTI’s manifesto and Prime Minister Imran Khan.",
  "retrievedAt": "2025-08-11T14:38:42.809Z"
}
