{
  "title": "TDAP, China’s Yiwu Govt held workshop to build China-Pakistan Trade Corridor",
  "link": "https://www.app.com.pk/national/tdap-chinas-yiwu-govt-held-workshop-to-build-china-pakistan-trade-corridor/",
  "date_published": "2022-04-01T16:13:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 1 (APP): The Trade Development Authority of Pakistan (TDAP) and Yiwu Municipal People’s Government held a consultative workshop to build China-Pakistan Trade Corridor by concerted efforts of both governments and business sectors.\nThe Yiwu-Karachi Workshop was held via video link and attended by Mr. Li Bijian, Consul General of China in Karachi, Mr.Ye Bangrui, Mayor of Yiwu City, Mr. Wang Wei, Deputy Mayor of Yiwu City, Mr. Arif Ahmed Khan, Chief Executive of TDAP, Mr. Hussain Haider, and Counsel General of Pakistan in Shanghai, Mr. Irfan Iqbal and other business and government representatives.\nDuring the workshop both sides discussed to promote key exchanges between Yiwu and Karachi, build a bridge for deepening cooperation between enterprises from both sides, facilitate trade exchanges between small, medium and micro market players, and help implement the results of the China-Pakistan Joint Statement, said a press release issued by Chinese Embassy Islamabad on Friday.\nTalking to the participants of the workshop, Arif Ahmed Khan, Chief Executive of TDAP said, Pakistan and China have great potential for cooperation.\nHe hoped that Pakistan would learn from China’s experience and make solid steps to build online digital platforms that will greatly improve the country’s digital connectivity so as to facilitate the export of standardized and high-quality Pakistani products to China.\nMr. Li Bijian, Consul General of China in Karachi, said that there are close economic ties and huge development potential between Yiwu and Karachi.\nHe hoped to further enhance mutual trade exchanges, promote trade balance, improve trade quality, and introduce more high-quality Pakistani products to enter China through Yiwu market. He said bilateral investment needs to be increased, and Chinese enterprises are welcome to make the best use of Pakistan’s favorable policies to invest in Pakistan and create more employment opportunities for the younger generation of Pakistan.\nHe also proposed that the trade representatives of the two sides would deepen policy communication, strengthen exchanges and cooperation, and jointly cope with the opportunities and challenges in the post-Covid era.\nMr. Hussain Haider, Consul General of Pakistan in Shanghai, said, Yiwu-Karachi Workshop is a manifestation of the commitment of the two countries, particularly the two cities, to shore up their bilateral trade and investment relations.\nHe was confident that the Karachi-based businesses would enter into mutually beneficial cooperative relations with their Yiwu counterparts to give a further momentum to the bilateral economic relations.\nHe also assured that Pakistan’s Consulate General in Shanghai would give full support and facilitation to these endeavors.\nMr.Ye Bangrui, Mayor of Yiwu City said, Pakistan is an important trading partner of Yiwu. In 2021, the trade volume between Yiwu and Pakistan reached nearly 600 million US dollars.\nThe import from Pakistan to Yiwu has tripled. He also mentioned, Karachi is Pakistan’s economic center, important port and largest city.\nYiwu looks forward to further enhancing exchanges and cooperation with Pakistan, especially with Karachi, to strengthening cooperation in export and import, e-commerce, exhibition and deepening cultural exchanges so as to achieve win-win development and contribute to the development of China-Pakistan economic and trade relations.\nMr. Irfan Iqbal, President of the Federation of Pakistan Chambers of Commerce & Industry (FPCCI), expressed the hope that Yiwu and Karachi should establish closer ties to enhance two-way cooperation and carry out frequent exchanges and cooperation in areas such as trade, culture, education, scientific and technological R&D.\nAt the meeting, Muhammad Idrees, President of Karachi Chamber of Commerce & Industry (KCCI) , gave a briefing about the Chamber and introduced many competitive products made in Pakistan. Yiwu Municipal Bureau of Commerce highlighted on the trade development of the city and cooperation opportunities with Pakistan.",
  "retrievedAt": "2025-08-11T14:38:38.249Z"
}
