{
  "title": "NSAs call for inclusive security, shared future for all",
  "link": "https://www.app.com.pk/national/nsas-call-for-inclusive-security-shared-future-for-all/",
  "date_published": "2022-04-01T15:51:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 01 (APP): The National Security Advisers (NSAs) of regional and middle eastern countries on Friday called for an inclusive security focusing on a shared future for all.\nSeven NSAs from China, Turkey, Uzbekistan, Kazakhstan, Kyrgyzstan, Qatar, and Kingdom of Saudi Arabia presented their suggestions during National Security Advisers Forum on Asian Security in Fluid World Order held under the two-day Islamabad Security Dialogue (ISD 2022) under the theme “Comprehensive Security: Reimagining International Cooperation” held here at Pak-China Friendship Center.\nThe forum was moderated by Joint Secretary National Security Division (NSD) Syed Maroof Ahmed and participated by the seven NSAs of China, Qatar, Kazakhstan, Kyrgyzstan, Turkey, KSA and Uzbekistan through video link.\nOpening the Forum, National Security Advisor Dr Moeed said the world was moving in a direction where Pakistan was looking at the world in cooperation not contestation.\nHe said the need of the ISD 2022 forum was to find the missing link between policy makers and intellectuals for informed decision and policy making.\n“The NSAs always thought there was room for out of the box solutions to move forward and we are working to make it such forum where NSAs can meet and share their ideas for joint and shared endeavours to achieve comprehensive cooperation”, the NSA said.\nHe added due to which Pakistan invited in the second edition of ISD 2022 the members of Asian countries.\nDr Moeed said Asia as a continent had emerged as a State for contestation where Asian and non-Asian countries involved in the contestation.\nHe underlined that therefore, the way forward was in multilateralism.\nHe also informed the forum that Pakistan had its first ever joint security commission with Uzbekistan that held regular meetings on various bilateral issues.\nAt the start of the forum, the Chinese NSA expressed his gratitude and congratulated Pakistan for successfully convening the session.\nHe added that the title of the forum “Asian security in a fluid world” was highly relevant in the prevailing situation.\nThe Ukraine crisis has brought turmoil in the world and impacted the regional security, he said, adding, “We have seen profound changes and no state alone can achieve all inclusive security”.\nThe Chinese NSA said President Xi Jinping had a great vision to promote sustainable security and under the prevailing circumstances Chinese side was ready to play role for comprehensive, sustainable and inclusive security for Asia region.\nHe said Asia was the greater attention of the emerging world and its affairs had to be run by the Asian countries.\n“Asia is open for all for mutual cooperation and security for all”, he added.\nHe also rolled out four proposals for a cooperation based security framework at the forum for regional partners.\nHe suggested to conceive common security and enjoy intertwined security and mututal beneficial cooperation, respect for multilateralism norms alongwith the Shanghai Cooperation Organisation (SCO) and other multilateral forums, acquaintance with comprehensive security, zero tolerance measures for curbing terrorism and extremism, measures for environmental, cyber, and biological security, follow the paths of security through common security, honesty and common respect necessary to understand countries’ problem for common security, adopt new ways of security through cooperation, need to safeguard sustainable security through long lasting development, and learn security governance through experience sharing.\n“China’s peaceful development relies and starts from Asia and benefits Asia. Strength is not of muscles rather solidarity and the Asian countries have to be united for a better and peaceful future”, he concluded.\nNSA of Qatar, Mohamed Bin Ahmed Al Mesned said many countries had capitalised in the structures of development leading to security where Asia had transformed with the rapidly changing world order.\n“The economic growth becomes the next major aspect of security where the future’s massive growth as projected will come from Asia that leads to the competition of world powers to achieve massive control of the region”, he said.\nThe Qatari NSA said the demand for natural gas would increase significantly post COVID-19 recovery. “The Asia and Middle East regions enjoy one of the oldest trade links on the earth where the Belt and Road Initiative will revive that history”, he added.\nHe informed that most of Qatar’s LNG volume goes to Asia whereas the most of its electric vehicles and food commodities were imported from Asia.\n“Asia and Qatar are important economic partners that cannot be ignored”, he added.Responding to queries of NSA Dr Moeed Yusuf, referring to Ukraine-Russia crisis leading to energy supply issues said energy should not be used as a weapon rather should help all nations in need.\n“The Ukraine Russia war will have huge impact on energy. Qatar is trying to make up the world needs but unfortunately it will not reach that level of demand”, he said.\nSecretary of the Security Council of Uzbekistan Lieutenant General Victor Makhmudov said the second edition of ISD was being held with the cooperation of highly respected countries interested in shared security and peace.\n“There are all signs of world lacking confidence with long term tensions being created due to tensions among global powers. Uzbekistan stands with regional security and peace at these critical times”, he said.\nHe mentioned that Afghanistan should be given opportunity to participate actively in regional process to avoid becoming an international hub of terrorism, extremism and drug production.\nThe NSA of Kazakhstan said the threats of extremism, terrorism and regional insecurity were evolving with the world trends.\nHe said that the urgency of reimagination of security farmwork was imperative and ISD as a forum was serving the purpose.\n“It is important to intensify the dialogue on food security as the international projections declare huge impact on food security in the short term. There is need to decide a joint food fund to address food security threats”, he suggested.\nEnsuring water security, he said was also linked to this issue and transboundary water issues would lead to territorial conflicts.\n“Economic diplomacy is a good option to lay foundations of security. We must understand to develop a joint mechanism to stop developing new hotspots for conflict in the region”, he said.\nNSA Krygzstan, Lieutenant General Marat Imankulov said the ISD forum would serve the purpose of mutual cooperation and strengthening of regional security.He highlighted that no country alone could fight the global challenges unless possessing a strong economy.\n“The Afghans are facing huge food security and malnutrition and world agencies are reporting it ISIS is trying to buildup its forces and try to deploy it near China whereas thousands of ISIS Khorasan militants are in Afghanistan and our countries cannot eliminate them that needs to be addressed on priority”, he added.\nReplying to queries, he said the SCO was founded to maintain the main aim to provide regional security and stability.\nIn the SCO the special mechanism help member countries to fight three evils of terrorism, extremism and separatism and it would help all member countries to coordinate and support.\nAmbassador of KSA Nawaf Bin Saeed Al-Malki read out statement of the Kingdom’s NSA.\nThe NSA of Turkey Dr. Ibrahim Kalin said there was need to have opportunity for multiple voices to discourse as the Asian countries were still in a US and Euro centric world.\nAfter the end of Ukrainian crisis there needed to have a new security framework that would have long-term consequences.\n“The new security architecture needs to be based on sense of belonging not exclusion.It should be free from ethnocentric and eurocentric prejudices”, he proposed.\n“Our human, economic and security interests are intertwined as no one is safe unless we all are safe. Issues of security, terrorism, poverty and equality are shared issues”, he ended.\nDuring the third session titled “Pakistan in a changing World Order” formers NSAs Lieutenant General (R) Nasser Khan Janjua, Lieutenant General (R) Khalid Naeem Lodhi and NSA Dr Moeed discussed the multifaceted issues and challenges faced by the country.\nFormer NSA Lieutenant General (R) Nasser Janjua lauded NSA Dr Moeed Yusuf’s efforts for successfully conducting ISD 2022.\nHe began with the question saying, “Why war has been dictating the world order and peace seeks a dictating point?”\n“This time peace takes dictating the world order whereas Pakistan is differently located and its challenges are different”, he added.\nStressing the changing or fluid world order, he emphasized that Pakistan had become a crucial and pivotal country and would face crucial challenges due to its position.\n“The leading trend of this global world order is containment of China and Indo-Pacific strategy is on the play where this change is our challenge”, he mentioned.\nHe underlined that the change was still far and it was not round the corner so that Pakistan could shift a side, adding, “till then Pakistan should stay at its own course and seek at least 20 years of peace and stability and charter its own course”.\nCommenting on the significance of NSA office and NSD, he said this office was very important and making its contribution in serving national interests.\n“This institution should and grow and continue to get mature. The National Security Policy is the step in right direction which was needed”, he said.\n“We are a versatile nation and the world is ever changing then we should always amend, correct and approve the National Security Policy (NSP) with transitioning world scenario”, he suggested.\nHe informed the forum that the work started on developing the NSP in 2010 at NDU and all members from the ministries and NDU faculty were on board for contributing in the process.\nHe mentioned that the concept of security needed to be revisited and revived.Former NSA Janjua said connectivity was the essence of the country’s economic prosperity in the coming days.\nWhile joining the panel discussion incumbent NSA Dr Moeed Yusuf said there could be no greater challenge in terms of policy making except thought process.\nThe work done by the preceding NSAs made it happen for his team to capitalise the National Security Policy, he added.\n“NSA has to be principle coordinator for the Chief Executive and hold national security dialogues with counterpart countries. We need to get the value of this office which has happened to a greater level in the current government”, the NSA explained.\nHe underlined that the National Security Committee (NSC) had become an irreplaceable model where civil-military leadership sit together.\n“Economic diplomacy is the key to future and without it no endeavour could succeed which have to be take seriously”, he said.\nFormer NSA Lieutenant General (R) Khalid Naeem Lodhi said it was necessary to have attention and motivation for implementation of decisions to make the NSA office more strong.\n“The best thing is that we have officially documented that the welfare and wellbeing of our people is the core national interest of Pakistan. Top of it is education, heath and justice. Nobody stops us to invest in them and build them up”.\n“Media is managing perception management that also leads to public security. Being an enemy we should not cut off our ties with the other party. Connectivity should be our priority. We must pay attention to communication, connectivity and justice, perception management, health and education”, he said.\nIn the fourth session on Navigating Disinformation and Discourse in the Information Age where keynote address was delivered by Former Senator and Information Minister Javed Jabbar.\nHe said the information explosion was unmanageable for humans as there was an erosion between the distinction of information and misinformation. “All information destablises but all misinformation damages and shatters,” he added.\nJabbar stressed the need for a public service media; one that is neither state controlled nor run through advertising.The session was moderated Mousharaf Zaidi.\nRussian Journalist Oksana Boyko from Russia Today, Liu Xin from CGTV, Shane Harris from Washington Post and Hussain Nadeem from IPRI spoke in the panel discussion.The speakers captivated the audience with their thought provoking and engaging discussion on the topic and it was a fruitful discourse and encouraging to see panelists presenting conflicting narratives coming together for an intellectual debate.",
  "retrievedAt": "2025-08-11T14:38:41.827Z"
}
