{
  "title": "Early election better option; cant even think of resignation: PM",
  "link": "https://www.app.com.pk/national/early-election-better-option-cant-even-think-of-resignation-pm/",
  "date_published": "2022-04-01T15:48:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Apr 1 (APP): Prime Minister Imran Khan Friday, while calling the early election a better option in the prevailing circumstances, said he could not even think of resigning and vowed to make a comeback with a heavy majority.\nThe prime minister, in an interview with a private television channel, said he was given three options of facing the vote of no-confidence, resignation, and an early election.\n“We said the early election is the best. I cannot even think of resignation. On voting day, I want the nation to see the faces of those who would sell their loyalties,” the prime minister remarked.\nHe said in the era of social media, the people particularly the youth would never forgive those shifting their loyalties for money and that they would be stamped forever.\nThe prime minister said he would go to the masses and seek a heavy majority to cleanse all the filth. A government lacking a heavy majority had to make compromises.\nHe said his government had faced immense difficulties during the last three and a half years for not having a heavy majority.\nImran Khan said his life was at risk because the adversaries knew that he would never stay silent.\n“They will implicate me in cases. They will launch a character assassination campaign. They already ran a campaign against my wife and her friend,” he remarked.\nReferring to the conspiracy for his ouster, the prime minister said the developing countries were controlled by the abettors calling them Mir Jafar and Mir Sadiq of the present day.\nIn such a case, the foreign powers did not need to conquer a country rather they achieved their objective by planting the people who compromise the national interests, he added.\nThe prime minister said he had been in the know of the conspiracy since August and had also warned his cabinet of a tough winter ahead.\nTo a question, he said Nawaz Sharif had been meeting people like Hussain Haqqani, who had asked the United States to protect Asif Zardari against the Pakistan Army.\nHaqqani also met Nawaz Sharif on March 3, four days before the government received the communication calling for his ouster, he added.\nThe prime minister said a strong army was inevitable for the country and exemplified Iraq, Syria, Somalia and Libya were destroyed by the foreign forces as they lacked a strong army. Even Pakistan would also have been disintegrated into three pieces if it did not have a strong army.\nImran Khan said no individual inflicted the loss to the country more than Nawaz Sharif as he was the mastermind of Yellow Journalism, Changa Manga politics and even buying the judges.\nHe said both Nawaz Sharif and Asif Zardari made corruption an acceptable evil in the society as no civilized society could imagine the trade of loyalties as had been done at the Sindh House.\nHe said after getting the first NRO (National Reconciliation Ordinance) from Pervez Musharraf, the opposition was yearning for the second NRO to regain power and abolish the National Accountability Bureau to do away with their corruption cases and pave way for revoking the disqualification of Nawaz Sharif.\n“They are trying to reinstate themselves by destroying the institutions,” he remarked.\nThe prime minister said the foreign powers were using the “thieves” to control the country, who could not speak up to conceal their riches abroad.\nHe said the corrupt leaders insulted Pakistan and put Pakistan’s Ideology on the back burner as they compromised the foreign policy just for the sake of aid to become billionaires.\nHe said the people of tribal areas as well as the expatriates suffered a lot after Pakistan joined the US-led war against terrorism just for the sake of aid and appeasing the superpower.\nReiterating his government’s policy of having cordial relations with all the states, he said Pakistan would become a partner in peace but not conflict.\nHe said after losing 80,000 lives, Pakistan achieved nothing from the US-led anti-terror war except the elite which got benefits.\nHe said contrary to the practice of joining one bloc after the other, his government’s foreign policy was aimed at keeping the people’s interest supreme.\nHe said Nawaz Sharif and Maulana Fazlur Rehman’s party had supported the conspiracy against Zulfikar Ali Bhutto, who was also targeted for towing an independent foreign policy.\nReferring to the conspiring communication, the prime minister said it only mentioned the ouster of Imran Khan. It said in case of his ouster, Pakistan’s all misgivings would be forgiven else the country would face difficulties.\n“This means there is a connection with them. Why the foreign embassy people are meeting them… I have all the reports who met whom and which politicians, anchors and journalists went to the foreign embassy,” he added.\nHe said the conspiracy was meant to isolate Imran Khan.\n“Such threatening communication in black and white is unprecedented… What could be a bigger threat to a nation than the regime change… I feel frightened as how we reached that stage that they dared to threaten us this way,” he remarked.\nHe said in order to target someone, they collaborate with and fund the media for character assassination. Three months ago, a TV anchor told him that news channels were being offered money to target the government.\n“Why Imran Khan turned into a villain all of a sudden. This did not happen for no reason. It involves money,” he commented.\n“My message is to the Pakistani nation that this is the crossroads. On one side these are traitors who are trying for the regime change through a foreign conspiracy. On other there, there is the Pakistani nation which does not want to opt this course. They want to see a nation with self-esteem.”\nHe said, “We will sail through the difficult time and face everyone. We will achieve self-dependence if no one gives us money. But we will never bow before anyone except Allah,” he remarked.\nTo a question, Imran Khan said Shahbaz Sharif did not turn up to check the conspiring communication just because he was a co-conspirator.\nMentioning his detailed consultation with the legal team hours ago, the prime minister said the government was also thinking to move the Supreme Court on the subject as it was a national security issue.\nTo another question, the prime minister said no past government had cooperative relation with the military than the incumbent one because he was not committing corruption.\nAsif Zardari and Nawaz Sharif used to speak against the army just to conceal their theft, he added.\nHe said the rumours of de-notifying the army chief was nothing but the PML-N’s disinformation campaign as he would never do anything to undermine the military.\nReferring to the adoption of a resolution by the United Nations to designate March 15 as International Day to Combat Islamophobia, he said Allah Almighty had bestowed him with the honour of spearheading the Muslim world on the issue.\nAsked about the prolonged corruption cases against the opposition leaders, the prime minister said it hurt him the most as they managed to disrupt the process on one or the other pretexts.\nCalling the inflation a global phenomenon, the prime minister said his government achieved record dollar inflow in form of exports and remittances, and record tax collection which also provided a cushion to reduce oil and power prices.\nHe said the PTI had swept the local government election in Khyber Pakhtunkhwa, which manifested the party’s popularity.\nCommenting on the opposition’s criticism, he questioned, “What they will do? How Shehbaz Sharif will reduce prices? What solution he has?”",
  "retrievedAt": "2025-08-11T14:38:42.831Z"
}
