{
  "title": "Kashmiris worldwide to observe Black Day to highlight HR violations in IIOJK",
  "author": null,
  "content": "ISLAMABAD, Oct 26 (APP): Across both sides of the Line of Control and in communities around the world, Kashmiris will observe October 27 as Black Day to denounce India’s continued control over Jammu and Kashmir and to draw international attention to what they describe as escalating human rights violations under prolonged military occupation.\n\nThe commemoration marks the day in 1947 when Indian forces entered Jammu and Kashmir, an event Kashmiris regard as the beginning of an unlawful occupation in violation of the Partition Plan of the subcontinent and the collective aspirations of the Kashmiri people.\n\nEach year, the day is observed as a somber reminder of what many in the region describe as decades of, repression, and unfulfilled promises of self-determination.\n\nAccording to data compiled by rights organisations and local monitors, the human cost in Indian-Illegally occupied Jammu and Kashmir has continued to rise since India revoked the region’s semi-autonomous status on August 5, 2019.\n\nReports estimate that 1,041 people have been killed, including 280 in custodial or alleged fake encounters.\n\nAnother 2,652 individuals have been tortured or critically injured, while 29,945 people have been arrested during military operations or public demonstrations.\n\nIncidents of arson targeting over 1,100 homes, shops, and public buildings have also been documented.\n\nThe figures further reveal that 82 women have been widowed, 230 children orphaned, and 137 women subjected to gang-rape or molestation.\n\nMeanwhile, 22,707 cordon-and-search operations (CASOs) have reportedly been conducted across various districts since 2019, creating an atmosphere of fear and uncertainty among civilians.\n\nHuman rights defenders describe the situation as one of the world’s most protracted and underreported crises.\n\nInternational organisations, including Amnesty International and Human Rights Watch, have raised concerns over the use of excessive force, arbitrary detentions, and communication blackouts by the Indian occupied forces that restrict freedom of expression and access to justice.\n\nAs preparations for Black Day observances continue, rallies, seminars, and solidarity events are planned in Pakistan, Azad Jammu and Kashmir, and among the global Kashmiri diaspora.\n\nParticipants are expected to renew calls for international intervention and urge the United Nations and human rights bodies to ensure accountability and uphold the right to self-determination promised to the Kashmiri people under UN Security Council resolutions.\n\nSeventy-eight years after Indian troops first landed in Srinagar, the conflict remains unresolved and continues to define relations between India and Pakistan — two nuclear-armed neighbours with deep political and emotional stakes in the region.\n\nFor millions of Kashmiris, October 27 is not merely a date in history, but a continuing symbol of loss, resistance, and the struggle for dignity under occupation.",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/546971_7655227_black-day_akhbar.jpg",
  "retrievedAt": "2025-10-26T11:30:21.780Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/kashmiris-worldwide-to-observe-black-day-to-highlight-hr-violations-in-iiojk/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T10:35:41.000Z"
}
