{
  "title": "78th Kashmir Black Day: Minister condemns brutalities by Indian forces in IIOJK, reaffirms Pakistan’s solidarity with Kashmiris",
  "author": null,
  "content": "ISLAMABAD, Oct 26 (APP):Federal Minister for Kashmir Affairs, Gilgit-Baltistan and SAFRON, Engr Amir Muqam, condemned the brutalities towards innocent Kashmiri people by Indian forces in Indian Illegally Occupied Jammu and Kashmir (IIOJK), reaffirming Pakistan’s unwavering support with the Kashmiri people in their struggle to achieve the right to self-determination according to the United Nations (UN) resolutions.\n\nIn his message on 27 October, the day which is being observed as Kashmir Black Day to mark the illegal occupation of Jammu and Kashmir by Indian forces, Amir Muqam said that our prayers always with our Kashmiri brothers and sisters who had faced decades of injustice and oppression at the hands of Indian forces.\n\n“Since then, the kashmiri people there have been denied their promised right to self-determination,” he said, adding, “For seventy-eight long years, the people of IIOJK have endured immense hardships at the hands of the Indian authorities. However, they have never allowed their resolve to be broken, and they remain steadfast in their demand for their right to self-determination. Their decades long resilience is a powerful reminder to the world that no force can erase the legitimate aspirations of a people.”\n\nThe United Nations Security Council resolutions on the Jammu and Kashmir dispute clearly recognized the right of the Kashmiri people to decide their own future through a free and impartial plebiscite under UN auspices, he emphasized, calling these resolutions remain binding and valid.\n\n“It is the responsibility of the international community to ensure that these commitments are honored and that the people of Jammu and Kashmir are allowed to exercise this right,” he said.\n\nSince 5 August 2019, India had made new attempts to tighten its grasp over IIOJK. From attempting to alter the demographic composition to silencing the true Kashmiri leadership, Indian authorities have sought to undermine the very existence of Kashmiri identity, he said.\n\nMoreover, the Indian authorities rely on draconian laws that give them unchecked powers to arrest, kill, and demolish property in IIOJK without accountability, he added.\n\nThis repressive framework was brought to light once again after the Pahalgam Attack of 22 April 2025 when Indian forces launched a sweeping crackdown across IIOJK. Thousands of Kashmiris were arrested or interrogated, and entire homes were reduced to rubble. The crackdown was not limited to IIOJK, as Kashmiri students studying in different parts of India became targets of intimidation and violence, he noted.\n\nOn this day, the Government of Pakistan and the people of Pakistan stand shoulder to shoulder with our Kashmiri brothers and sisters, he vowed.\n\n“Their pain is our pain, and their fight is our fight. We will continue to support them politically, morally, and diplomatically until their right to self-determination is fulfilled,” he said.\n\nPakistan hopes that one day peace and justice will prevail for the people of Kashmir and that South Asia will move towards stability through a fair resolution of this long-standing dispute, he added.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/09/amir-2-768x432-1.jpg",
  "retrievedAt": "2025-10-26T22:44:33.918Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/78th-kashmir-black-day-minister-condemns-brutalities-by-indian-forces-in-iiojk-reaffirms-pakistans-solidarity-with-kashmiris/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T18:59:29.000Z"
}
