{
  "title": "SZABMU launches first Bariatric MS Programme",
  "author": null,
  "content": "ISLAMABAD, Oct 25 (APP):Shaheed Zulfiqar Ali Bhutto Medical University (SZABMU) has announced Pakistan’s first-ever two-year Bariatric MS Programme.\n\nThe announcement was made by Vice Chancellor Prof Dr Tanveer Khaliq, during the event “Scalpels & Strength — Pakistani Women Redefining Surgery” Town Hall held at Pakistan Institute of Medical Sciences (PIMS).\n\nDr Tanveer said the new programme would help train surgeons in advanced metabolic and bariatric surgery.\n\nExecutive Director of PIMS, Prof Dr. Rana Imran Sikandar, also supported the initiative.\n\nThe event was organized by the Pakistan Society for Metabolic and Bariatric Surgery (PSMBS) in collaboration with the Treo Foundation (USA) to recognize the contributions and leadership of women surgeons in Pakistan.\n\nThe Town Hall was led by Dr. Saniea Majid (USA), President of the ASMBS Treo Foundation, who also chaired the session.\n\nShe was joined by a panel of senior women surgeons including Prof. Rakhshanda Rashid, Prof. Azra A. Ghani, Dr. Zahra Raza, Dr. Erum Najeeb, and Dr. Arifa Manzoor. Dr. Nazish Masood served as the moderator.\n\nThe speakers shared their personal experiences, challenges, and advice for young doctors, emphasizing hard work, mentorship, and dedication to patient care.\n\nDr. Saniea Majid said, “Every success story in surgery begins with courage — the courage to lead, to teach, and to innovate. Pakistani women surgeons are redefining what leadership in medicine looks like.”\n\nPSMBS representative Prof. Dr. Aatif Inam Shami praised the collaboration and called the new programme a major step forward for surgical education in Pakistan.\n\nThe event ended with a call to continue supporting mentorship, teamwork, and leadership opportunities for women in medicine.\n\n“Scalpels & Strength” honored the courage and achievements of women surgeons and inspired young doctors to serve with confidence and compassion.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2023/11/PIMS.jpg",
  "retrievedAt": "2025-10-25T22:54:17.631Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/szabmu-launches-first-bariatric-ms-programme/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-25T18:36:31.000Z"
}
