{
  "title": "PAEC calls for expansion of Lahore Science Mela model to other cities",
  "author": null,
  "content": "ISLAMABAD, Oct 26 (APP):The Lahore Science Mela (LSM) 2025 concluded on Sunday after drawing massive public participation and appreciation by the science enthusiasts.\n\nSpokesperson of the Pakistan Atomic Energy Commission (PAEC), Dr. Rashid Mahmood lauded the success of the event and urged that similar science festivals should be organized in other major cities, particularly in Islamabad.\n\n“In order to keep the spirit of curiosity alive in youth, we should launch such interactive and educational science festivals all over Pakistan,” Dr. Rashid remarked.\n\nHe emphasized that such events “ignite curiosity, promote love for scientific research, and quench the thirst of young minds to know more.”\n\nOver the two days of LSM-2025, the PAEC pavilion drew significant attention, showcasing the Commission’s contributions in minerals exploration, power production, agriculture, and healthcare.\n\nAmong the highlights were radiopharmaceutical kits for cancer diagnosis developed by the Pakistan Institute of Nuclear Science and Technology (PINSTECH), a model of a nuclear power plant, indigenously developed vaccines, and agricultural innovations.\n\nVisitors, especially students, were thrilled to meet the Champions of the International Nuclear Science Olympiad (INSO) 2025, who were trained and mentored by the Pakistan Institute of Engineering and Applied Sciences (PIEAS), a leading university of PAEC.\n\nThe Lahore Science Mela, organized by the Khwarizmi Science Society (KSS) at Crescent Model Higher Secondary School, attracted over 100,000 visitors.\n\nThe event featured a diverse range of scientific exhibits, a planetarium, laser demonstrations, the “Surpriseum,” engaging indoor games, workshops, and informative talks, making it an exciting and educational experience for families and youth alike.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/3a983985-3960-4535-bcc2-9cfced5dcd7c.jpeg",
  "retrievedAt": "2025-10-26T22:44:56.525Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/paec-calls-for-expansion-of-lahore-science-mela-model-to-other-cities/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T18:59:58.000Z"
}
