{
  "title": "Interior Minister Mohsin Naqvi Inaugurates Padel Tennis Court and Fitness Arena",
  "author": null,
  "content": "ISLAMABAD, Oct 25 (APP):Federal Minister for Interior Mohsin Naqvi inaugurated a newly established Padel Tennis Court and Fitness Arena in the Diplomatic Enclave, marking another step toward improving recreational facilities for members of the diplomatic community in the federal capital.\n\nThe inauguration ceremony was attended by Federal Minister for Overseas Pakistanis Chaudhry Salik Hussain, Senator Faisal Saleem, and Acting U.S. Ambassador Natalie Baker, along with several senior officials from the Capital Development Authority (CDA) and the Islamabad administration.\n\nFollowing the formal ribbon-cutting, Interior Minister Mohsin Naqvi joined Acting U.S. Ambassador Natalie Baker, Minister Chaudhry Salik Hussain, and CDA Chairman Muhammad Ali Randhawa in a friendly exhibition match of padel tennis, symbolizing the spirit of sportsmanship and cooperation.\n\nSpeaking at the occasion, Minister Naqvi said that the new sports and fitness facilities would provide diplomats with a modern space for recreation and physical activity. “Promoting sports and healthy lifestyles is among our top priorities,” he noted, adding that such initiatives contribute to strengthening community ties and promoting Pakistan’s image as a hospitable nation.\n\nThe Interior Minister further shared that renovation work in the Diplomatic Enclave was already underway and would be completed soon. “No effort will be spared in providing all necessary facilities to the diplomatic community,” he said. “Our goal is to ensure that their stay in Islamabad is both comfortable and secure.”\n\nReaffirming the government’s commitment to urban improvement, Naqvi emphasized, “We will make Islamabad a world-class capital. Sports and culture are vital in bringing people together, and hospitality and courtesy remain the hallmarks of the Pakistani nation.”\n\nThe event concluded with an interaction between the dignitaries and diplomats, reflecting the government’s continued efforts to foster goodwill and enhance Islamabad’s global stature as a safe, vibrant, and welcoming city.\n\nAlso present on the occasion were the Chairman CDA and the Deputy Commissioner Islamabad, along with other senior officials.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/Mohsin-Naqvi-copy-1.jpg",
  "retrievedAt": "2025-10-25T22:54:38.013Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/interior-minister-mohsin-naqvi-inaugurates-padel-tennis-court-and-fitness-arena/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-25T18:36:31.000Z"
}
