{
  "title": "SSP Usman Butt chairs key meeting on pending investigation cases",
  "author": null,
  "content": "ISLAMABAD, Oct 26 (APP):Islamabad Capital Territory (ICT) Police’s Senior Superintendent of Police (SSP) Investigation Muhammad Usman Tariq Butt chaired a high-level meeting with zonal SPs, DSPs, and investigation officers to review the progress of ongoing investigation cases and evaluate performance across all units.\n\nAn official told APP on Sunday that during the meeting, the SSP Usman Butt emphasized that all officers must ensure merit-based and transparent investigations while submitting case challans to competent courts at the earliest. He directed that strict legal action be taken against those involved in serious crimes and that efforts to curb criminal activities be intensified.\n\nHe instructed officers to further improve performance and enhance patrolling, case follow-up, and supervision to ensure justice for victims. He also issued special directives to strengthen the grip on criminal elements and eliminate crime from society.\n\nSSP Usman Butt stressed the importance of using modern technology and scientific methods in investigations to meet contemporary policing needs. He said the restructuring of the Investigation Wing aims to ensure timely and merit-based case resolution and effective prosecution to bring offenders to justice.\n\nHe reiterated that protecting the lives and property of citizens remains the top priority of Islamabad Police and that accountability, transparency, and professionalism must guide every stage of the investigation process.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/10/meeting-23.jpeg",
  "retrievedAt": "2025-10-26T10:27:46.408Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/ssp-usman-butt-chairs-key-meeting-on-pending-investigation-cases/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T10:18:03.000Z"
}
