{
  "title": "Pakistan Railways modernization efforts gaining momentum: Hanif Abbasi",
  "author": null,
  "content": "LAHORE, Oct 26 (APP):Minister for Railways Muhammad Hanif Abbasi has said that the process of modernizing Pakistan Railways and providing better facilities to passengers is continuing successfully.\n\nAddressing a press conference at the Railway Headquarters on Sunday, he announced several major projects and development initiatives aimed at transforming the railway system on modern lines.\n\nThe minister revealed that efforts are being made to restore the Islamabad–Tehran–Istanbul train service by December 31. He added that following an agreement with Uzbekistan, another accord is being finalized with Kazakhstan, under which freight will be brought up to Chaman. He said that since a railway line already exists from Chaman to Karachi, the agreement will help open new trade routes to Central Asia and Europe.\n\nAbbasi announced that a new 400-kilometer track will be constructed for the Reko Diq project, while work will be carried out on a total of 884 kilometers of the track.\n\nHe said that negotiations are underway with the Asian Development Bank for a Rs 2 billion agreement to upgrade the 500-kilometer track from Rohri to Karachi. Owing to the special interest of Prime Minister Muhammad Shehbaz Sharif, the groundbreaking of this project is expected by July 2026. The minister added that upgradation of the Rohri–Peshawar track and Main Line-2 is also under consideration.\n\nAbbasi said that the Karachi Railway Station has been redeveloped into a larger and more modern facility than Lahore Station, where cleaning and washing operations have been outsourced for improved management.\n\nHe said that Prime Minister Shehbaz Sharif has been requested to inaugurate the newly upgraded rake of Shalimar Express on November 7. He added that Awam Express, Rehman Baba Express, and Allama Iqbal Express are also being upgraded to include modern kitchens, dining cars, and quality meals similar to those of Shalimar Express.\n\nThe minister said that Pakistan Railways expects to earn Rs 3.5 billion more through Cargo Express. However, he regretted that the department had been using earnings from passenger trains to support freight operations, which is against global practices.\n\nHe announced that by March 23, 2026, 160 new locally manufactured wagons will be added to the system, and railway facilities will also be extended to the cement and automobile sectors.\n\nFor the Lahore–Rawalpindi railcars, the third rake will be completed by October 31, and the fourth by November 19, while four new rakes for the Lahore–Narowal section will be ready by December 31.\n\nAbbasi said that an open auction of 26 railway commercial plots in Badami Bagh will be conducted, and 48 warehouses will be outsourced. Renovation of 10 running rooms for drivers and guards will be completed by February 2026, and Rs 800 million will be spent on repairs of staff quarters’ roofs and the upgradation of Sukkur, Lodhran, and Rohri railway stations.\n\nHe added that 180 CCTV cameras will be installed at Rawalpindi Railway Station, and the Vigilance Department has been activated to curb corruption, diesel theft, bogus allotments, ghost employees, and ticketless travel.\n\nThe minister further said that 1,500 employees were recruited in the Railway Police on merit, and their passing-out ceremony will be held on November 4.\n\nResponding to a question, Abbasi said that all new projects will be completed under the supervision of the Prime Minister. Funds have been allocated to the PHA for developing a green belt from Shahdara to Raiwind, as well as for level crossings and eight branch routes.\n\nPaying tribute to train guards, staff, and police personnel martyred in Balochistan, Abbasi called them true soldiers of the nation. He said that ensuring quality food for passengers is among the ministry’s top priorities.\n\nHe concluded that all inquiry reports of railway accidents have been received by the ministry, and necessary actions are being taken accordingly.\n\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "tags": [],
  "categories": [
    "National"
  ],
  "image": "https://www.app.com.pk/wp-content/uploads/2025/09/Hanif-abbasi-2-e1753641205949.jpg",
  "retrievedAt": "2025-10-26T15:23:26.422Z",
  "source": "APP",
  "link": "https://www.app.com.pk/national/pakistan-railways-modernization-efforts-gaining-momentum-hanif-abbasi/",
  "dateList": "2025-10-26",
  "date_published": "2025-10-26T15:10:05.000Z"
}
