{
  "title": "Solangi underlines need of state media reforms at pat with modern standards",
  "link": "https://www.app.com.pk/national/solangi-underlines-need-of-state-media-reforms-at-pat-with-modern-standards/",
  "date_published": "2023-11-30T12:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): Caretaker Minister for Information and Broadcasting and Parliamentary Affairs Murtaza Solangi on Thursday urged the Senate’s Standing Committee to discuss and work out the plan for reforms in the state media institutions.\nAddressing the Senate Committee on Information and Broadcasting, the minister underlined the need to carry out reforms in the state broadcasters to bring them at par with modern standards.\nSenator Fawzia Arshad presided over the meeting which was attended by members of the committee including Senator Maula Bakhsh Chandio, Senator Irfan-ul-Haque Siddiqui and Senator Naseema Ehsan as well as Federal Secretary for Information and Broadcasting Shaheera Shahid, MD Pakistan Television (PTV), Director General Radio Pakistan, and Managing Director Associated Press of Pakistan (APP).\nDuring the session at Committee Room No. 1 of the Parliament House, the panel discussed the implementation of the recommendations, worked out in its meeting on October 9, 2023.\nThe committee also took up the recommendations related to the appointment of 53 daily-wage employees during the\nmeeting.\nThe information minister said the caretaker government could not make permanent appointments or decide about the closure of any institution.\nHe said services of different people were hired sometime back to mitigate the shortage of staff and run essential programmes, but hiring of daily wagers through advertisement, seemed to be a time-consuming process.\nMurtaza Solangi said the committee’s recommendations in this regard would be implemented in letter and spirit. The committee’s guidance on advertising for daily-wage recruitment or any kind of hiring would also be followed, accordingly.\nHe said the committee might also direct the ministry to conduct an investigation into any department for probing into the recruitment of daily-wage employees.\nHe emphasized the importance of clear guidance to avoid recurrence of such issue in the future.\nThe Information Minister highlighted the need for reforms in all state broadcasters, including PTV, and urged the committee to discuss a programme on reforms of the state media institutions.\nHe pointed out that 76 per cent of Radio Pakistan’s overall budget was currently allocated to salaries and pensions, and there were still pending dues for numerous employees.\nThe minister said that Radio Pakistan was the oldest institution of the state and emphasized the need for reforms in the institution that had more numbers of pensioners than the existing workforce.\nSolangi expressed gratitude to the committee members who showed confidence in him and said he would continue to seek their guidance in future as well.\nThe committee also discussed the issue of new recruitments, especially in PTV and Radio Pakistan, from August 9, 2023, until now. Both the federal minister and secretary briefed the committee on the issue.\nThe federal secretary explained that election cells were established in broadcasting institutions of the Ministry of Information, and the services of some individuals had been obtained for the purpose.\nSolangi informed the committee that those individuals, rendering the services, had extensive experience in broadcasting.\nHe assured that efforts were afoot to ensure that no anchor in any program showed bias towards any political party.\nThe committee expressed satisfaction over the briefing given by MD APP Muhammad Asim Khichi.",
  "retrievedAt": "2025-08-11T10:46:00.862Z"
}
