{
  "title": "President asks traders to adopt honesty, fairness to grab space in global economy",
  "link": "https://www.app.com.pk/national/president-asks-traders-to-adopt-honesty-fairness-to-grab-space-in-global-economy/",
  "date_published": "2023-11-30T09:27:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): President Dr Arif Alvi on Thursday urged the traders and businessmen in the country to strictly adhere to the principles of honesty and fairness to capture a space in the competitive global economy.\nAddressing the achievement recognition ceremony of the Islamabad Chamber of Small Traders and Small Industries (ICSTSI), the president said it was difficult to have a successful business if the customers did not trust a brand or considered it dishonest.\nPresident Alvi said in a competitive economy, businesses that fail to create an ethical reputation soon become extinct.\n“Sell your products with fairness by maintaining the same standards which you show to your target audience while marketing,” he told the gathering of traders, here at the Aiwan-e-Sadr.\nBesides adopting a profit-based approach, he said, it was equally important for companies to ensure an environment of empathy and compassion in society.\n“Honesty in public dealing and developing trust between supplier and consumers can lead to an accommodating atmosphere in the society,” he said.\nThe president emphasized inculcating the values of honesty in the society in line with the glorious teachings of Islam which called for maintaining integrity in public dealings.\nHe also noted that it was the responsibility of society to provide a harassment-free environment to women at workplaces to ensure their inclusion in all fields of life.\nDr Alvi said the promotion of small industries in the country could stimulate economic growth.\nThe president highlighted the need for skill development through vocational courses to help the population earn the dividends of a skill-based economy.\n“There is no dearth of talent and skills in the country, however, the situation needs provision of better opportunities to people,” he said.\nPresident Alvi said an effective implementation of tax culture could help the country overcome its financial and economic challenges.\n“The key to ensuring betterment of the society is through bringing improvement in the lives of the people,” he said.\nThe president said the world needed to enforce the ideals of morality and pointed out that the current Gaza situation demanded serious attention in this regard.\nHe regretted that the world pursued its vested interests while a large population of Palestinians faced ethnic cleansing.\n“Amid the ‘might is right’ scenario, a human life should be valued regardless of any religion, ethnicity or creed,” he said.\nThe president gave away shields to traders to honour their achievements in their respective fields.\nPresident ICSTSI Sajjad Sarwar said the Chamber was taking steps to encourage foreign companies to invest in Pakistan. He also mentioned the provision of a platform for women to promote their vocational skills.\nVice President ICSTSI Syeda Wajida Saleem said small enterprises play an important role in a country’s economy and stressed the need for long-term policies in this regard.  She lauded President Alvi for his continued support to women to actively participate in all fields of life with the objective of attaining financial empowerment.\nGroup Chairman ICSTSI Qazi Muhammad Ilyas said the trader community was positively contributing to the national economy by following the tax system.",
  "retrievedAt": "2025-08-11T10:46:04.653Z"
}
