{
  "title": "NHMP beware travelers of traffic disruptions at numerous highways & motorways",
  "link": "https://www.app.com.pk/national/nhmp-beware-travelers-of-traffic-disruptions-at-numerous-highways-motorways/",
  "date_published": "2023-11-30T18:24:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP):The motorists planning to travel along National Highway N-5 and Motorways Central and North Zones are advised to exercise caution and allow extra travel time due to numerous road closures and ongoing roadwork projects.\nThe situation is particularly challenging in the North and Central Zones, where multiple sections of the motorway are currently affected.\nIn the North Zone, motorists should be aware of the following closures: Sector M-1: Near Wali Interchange (upto 1500 meters) to Near Karnal Sher Interchange (both lanes) due to roadwork.\nSector North-II: T.Chowk to Sawan (due to roadwork) and Taj Hotel to Majid hotel (due to roadwork). Additionally, Sagri morr is closed due to a vehicle breakdown.\nThe motorists should also be prepared for rain from Swan to Gulyana mor in Sector North-II.\nMoving to the Central Zone, the following closures are in effect: Sector Central-I: Western bypass sahiwal (both lanes) and NFC Society (both lanes) due to roadwork.\nSector Central-II: Kehror chowk to ever Shaheen pump (southbound lane) due to roadwork. Additionally, traffic diversions are in place at Pull Bahsti and 872 Ada Shanal due to roadwork.\nThe motorists should also be aware of the following roadwork projects in Sector Central-II:\nNorthbound traffic: Diversions at Rajpur Nagar and 79/10R due to roadwork.\nSouthbound traffic: Diversions at Adda 5 Faiz and Alnoor Orchard to Alizm School due to roadwork.\nWith these numerous disruptions in place, travelers are urged to plan their journeys carefully and allow extra time to reach their destinations. It is also advisable to stay updated on the latest traffic conditions before setting out.\n(adsbygoogle=window.adsbygoogle||[]).push({});",
  "retrievedAt": "2025-08-11T10:46:34.466Z"
}
