{
  "title": "4th Round of Pakistan-China Maritime Cooperation held",
  "link": "https://www.app.com.pk/national/4th-round-of-pakistan-china-maritime-cooperation-held/",
  "date_published": "2023-11-30T17:41:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP):Pakistan and China on Thursday held the 4th round of maritime dialogue here to review the bilateral maritime cooperation.\nDuring the session, an in-depth exchange of views on the entire spectrum of bilateral maritime cooperation was held including naval exchanges, regional cooperation, development of maritime infrastructure, collaboration in fisheries, science and technology, search and rescue missions, maritime disaster management and combating maritime pollution, according to a press release issued by the Foreign Office Spokesperson.\nDirector General (China) of the Ministry of Foreign Affairs of Pakistan, Mohammad Aamir Khan, and Deputy Director General of the Department of Boundary and Ocean Affairs of Chinese MFA, Wang Jinfeng, co-chaired the consultations.\nDeputy Director General Wang Jinfeng later called on Imran Ahmed Siddiqui, Additional Secretary (Asia-Pacific) of the Ministry of Foreign Affairs.\nThe two sides expressed satisfaction at time-tested Pakistan-China friendship and All-weather Strategic Cooperative Partnership between the two countries while committing to further expanding bilateral maritime cooperation since the 3rd round.\nThe two sides also noted the evolving regional and global maritime changes and agreed that their mutual cooperation was in-line with their shared vision for a peaceful and prosperous Asia-Pacific region.\nEmphasizing the need to advance practical cooperation to jointly respond to emerging threats and challenges, the two sides agreed to maintain the momentum of bilateral exchanges and to promote ties between the navies of the two countries.\nThe Chinese side thanked Pakistan for extending hospitality and warm reception to the Chinese delegation.\nIt was agreed that the 5th round of Maritime Dialogue will be held in China next year.",
  "retrievedAt": "2025-08-11T10:46:14.024Z"
}
