{
  "title": "ILO, EFP award 150 National Skills Passports to aspiring migrant workers",
  "link": "https://www.app.com.pk/national/ilo-efp-award-150-national-skills-passports-to-aspiring-migrant-workers/",
  "date_published": "2023-11-30T13:04:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 30 (APP): Recognizing the indispensable value of skilled human resources in driving both national and international labor markets, the International Labour Organization (ILO) and the Employers’ Federation of Pakistan (EFP), in conjunction with the Ministry of Overseas Pakistanis and Human Resources Development (MOP&HRD), proudly announced the distribution of 150 National Skills Passports.\nThis esteemed recognition, achieved through a meticulous assessment process focusing on trades such as plumbing, electrician, and cooking, marks a significant stride towards providing aspiring migrant workers with pathways to decent work, said in an ILO press release.\nSupported by the Joint UN Programme “Governance of Labour Migration in South and Southeast Asia” (GOALS), the pilot project was funded by the Swiss Development Cooperation (SDC).\nAround 300 senior representatives from government departments, workers’ and employers’ organizations, UN Agencies, development partners, civil society organizations, and the Pakistan Overseas Employment Promoters Association (POEPA) attended the event.\nMohammad Younus Dagha, Minister for Revenue, Industries and Commerce, Government of Sindh attended as chief guest.\nMuhammad Younus Dagha, Minister for Revenue, Industries, and Commerce said that the NSP initiative holds high credibility and needs to be connected with the international labour market, adding that the NSP should be expanded to other provinces as well.\n“The issuance of the National Skills Passport is poised to unlock and enhance employability of a migrant worker in both domestic and international labour markets,” he added.\n“I firmly believe that the National Skills Passport has the potential to contribute to both fairer and safer labour migration in several ways. It allows transparency and recognition of skills and competencies gained while working, facilitates skills upskilling, and encourages sustainable reintegration of migrant workers,” said by Chihoko Asada-Miyakawa, Assistant Director General and Regional Director for ILO Asia and Pacific.\nShe further stated that the Skills Passport empowers individuals to navigate the evolving demands of the labour market.\n“I encourage the Government of Pakistan to roll out the National Skills Passport broadly across the country to allow all workers to certify their skills and qualifications,” she added.\nMalik Tahir Javaid, President of the Employers’ Federation of Pakistan, extended his appreciation to the awardees of the National Skills Passport for successfully navigating the rigorous assessment process.\nHe also thanked the Steering Committee NSP for guiding the Employers’ Federation of Pakistan in successfully implementing the NSP Pilot in Sindh.",
  "retrievedAt": "2025-08-11T10:45:55.811Z"
}
