{
  "title": "PM reiterates govt’s resolve to further strengthen HIV response",
  "link": "https://www.app.com.pk/national/pm-reiterates-govts-resolve-to-further-strengthen-hiv-response/",
  "date_published": "2023-11-30T18:59:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Dec 1 (APP):Caretaker Prime Minister Anwaar-ul-Haq Kakar on Thursday reiterated the government’s commitment to further strengthen the HIV response to ensure an AIDS-free Pakistan.\n“Let us synergize our efforts to achieve our shared goal of an AIDS-free Pakistan. Together, we can build a future where healthcare is a right for everyone, and no one is left behind,” the prime minister said in his message on the occasion of the World AIDS Day 2023.\nHe said HIV/AIDS was not only a health issue but had grave socio-economic implications. “Sadly, as we reflect on the prevailing HIV epidemic in Pakistan, we see a gloomy picture – wide gaps in HIV testing and treatment coverage. Let us ponder for a minute and reflect: are we reaching those who need to be reached, are we testing those who need to be tested and are we strategically looking in the right direction?”, he added.\nHe said years of collective efforts, resources and programming had been just not enough to halt the epidemic trajectory.\nThe prime minister said the critical barriers and challenges for impactful programming continued to persist.\n“This reality compels us to intensify our commitment and resolve to combat the HIV epidemic with innovative, impactful and sustainable programming. The Government is cognizant of the need for greater stewardship and dedicated to prioritizing both the political and financial aspects of HIV prevention.”\nHe said one of the primary objectives was to address the gaps within the service cascade, especially in preventing mother-to-child HIV transmission.\n“By redoubling our efforts in this area, we aim to create a society where every child is born free from the burden of HIV. As we embrace new prevention tools, we understand the importance of swift and widespread implementation,” he said adding “It is our duty to ensure that these services reach every corner of our nation, leaving no room for disparities in healthcare access, particularly those segments of the society that are at the increased risk of HIV”.\nThe prime minister called upon all the partners engaged in the HIV response to join forces with the Ministry of National Health Services, Regulations, and Coordination to take timely action in safeguarding the well-being of our future generations.\n“Let us unite and collaborate, allowing the communities to lead the way in this pivotal national endeavor,” he remarked.",
  "retrievedAt": "2025-08-11T10:46:10.731Z"
}
