{
  "article_id": "2025-10-09_d89c86118e03a9bb7e0e8233873017a5",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/tarar-calls-pti-gang-of-miscreants-facilitating-terrorism-in-pakistan/",
    "retrieved_at": "2025-10-12T00:00:38.592Z"
  },
  "metadata": {
    "title": "Tarar calls PTI ‘gang of miscreants’ facilitating terrorism in Pakistan",
    "author": null,
    "date_published": "2025-10-09T19:20:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 1011,
    "reading_time_minutes": 6
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP): Federal Minister for Information and Broadcasting, Attaullah Tarar on Thursday called the Pakistan Tehreek-e-Insaf (PTI) a \"gang of miscreants\" who are involved in disrupting the law and order in the country for petty political gains. Addressing a news conference alongside Prime Minister's Coordinator for Information and Khyber Pakhtunkhwa Affairs, Ikhtiar Wali Khan, the minister recalled the abolishment of the National Action Plan during the previous tenure of the PTI's government. \"We achieved successes through Operation Zarb-e-Azb and Operation Radd-ul-Fasaad and forced the terrorists to retreat which eventually restored peace in the country. But a person, who is sitting in jail, and his party, during their tenure, brought back and settled the very same terrorists, and continues to facilitate them to this day.\" He called the PTI a facilitator of terrorists, citing an old interview of its founder who said that \"these (terrorists) are very good people, we should talk to them, we should bring them back and settle them.\" On the other hand, these elements carried out bombings in markets, mosques, commercial centers, and above all the schools to spill the blood of innocent children. The minister said the State of Pakistan came into existence on the night of the 27th of Ramazan. \"This is the state which established in the name of the Kalma, and it will remain forever, God willing,\" he added. Tarar said the handful of terrorists receive facilitation from the person sitting in jail, who is the \"chief sponsor of terrorists\". He had previously brought back and settled terrorists in different areas during his government, providing them safe return and accommodation, and today, the entire politics of KPK revolve around this very thing. He said that Sohail Afridi has been nominated as the Chief Minister of Khyber Pakhtunkhwa as the founding chairman is angry with Ali Amin Gandapur who could not facilitate terrorists. \"He was told to facilitate terrorists and take measures to stop actions against them,\" the minister said, adding perhaps Ali Amin Gandapur could not complete this mission to that extent. \"Now, the founding chairman has brought forward a person who is a close associate of the proclaimed offender and fugitive Murad Saeed and has a soft corner for terrorists,\" the minister noted. He said Sohail Afridi has been brought in to fully support the facilitators of terrorism and give them a free hand. Tarar said that Pakistan's security policy is being formed in Islamabad, and will continue to be formed there. \"Tehreek-e-Insaf wants the security policy to be made in Kabul, which will absolutely not be allowed.\" \"They have caused great damage to the country by bringing back terrorists here and are continuing their facilitation even today,\" he said, adding the PTI has been in power in Khyber Pakhtunkhwa for the last 12 years, and terrorism there has been rampant. He said that the officers and soldiers of the Pakistan Army are standing as an iron wall between the terrorists and the public, and the eradication of terrorism is being carried out as a result of the sacrifices of the Pakistan Army. He said Field Marshal Syed Asim Munir attended the funerals of the martyrs. The sacrifices of Colonel Junaid and Major Tayyab, who were martyred in Orakzai, and Major Sibtain and his soldiers, martyred in Dera Ismail Khan, will be remembered throughout the history. He stated that they sacrificed their lives for the motherland, and their families are expressing pride, demonstrating that their children laid down their lives for the country, and they are proud that their children were martyred to protect Pakistan. The Federal Minister said no harm will come to the nation as long as our brave soldiers are willing to sacrifice their lives for the country. \"They are rendering sacrifices so that we can sleep peacefully in our homes and our families remain safe.\" The level of contentment I saw while meeting to the martyrs' families is unprecedented, he said, adding those families thanked to the Almighty for the martyrdom of their children while protecting the motherland. He mentioned that recently, Major Adnan sacrificed his live while saving his fellow colleagues. These are the stories that will live on till the Day of Judgment. On the other hand, he said, the founding chairman of PTI, who is sitting in jail, is the chief sponsor of terrorism, and the anarchic group is hell bent on damaging the country. He said that these anarchic people want to provide facilitation, shelter, and amenities to the terrorists through Sohail Afridi who has a criminal track record. \"We salute our martyrs; they are still not letting the terrorists succeed in their nefarious objectives and are writing this history with their blood. This is an eternal tale of sacrifice.\" He said a court in London had delivered a verdict against this \"gang of miscreants\" who faced worst humiliation. \"This is the victory of Pakistan's narrative and the State of Pakistan, and it has enhanced Pakistan's honor and prestige.\" He said that wherever the devotees and mischievous elements of Tehreek-e-Insaf are present, disgrace and humiliation are becoming their destiny. The agenda of Tehreek-e-Insaf has also been defeated in international courts, and they have faced severe humiliation, he added. He said the entire narrative of those who did mudslinging, give false statements, and level allegations against Pakistan's institutions, the army, and state institutions has been buried. He said that there is now no justification left for anyone sitting abroad to attack the State of Pakistan or speak against it. \"This is the defeat of the anarchic group, and God willing, they will be defeated in every field.\" He stated that they are losing the war of narratives. He added that they will also fail in facilitating terrorists and will have to face retreat. \"With what face will the anarchists sitting in different corners of the world now speak against the State of Pakistan or the army? They will have to suffer the consequences of their actions.\" Those who are fighting against Pakistan and want to harm Pakistan will have to face defeat, he remarked.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}