{
  "article_id": "2025-10-09_2bd87caf78e932b339bd0abe5d379cc4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/gilani-meets-uk-parliamentary-delegation/",
    "retrieved_at": "2025-10-12T00:01:49.602Z"
  },
  "metadata": {
    "title": "Gilani meets UK Parliamentary delegation",
    "author": null,
    "date_published": "2025-10-09T16:45:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 451,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP):Chairman Senate of Pakistan, Syed Yousaf Raza Gilani, on Thursday, met with the United Kingdom's parliamentary delegation on the sidelines of the 68th Commonwealth Parliamentary Conference (CPC) being held in Bridgetown, Barbados. The UK delegation was led by MP Kate Osamor, Chair of the Commonwealth Parliamentary Association (CPA) and Member of Parliament from the Labour Party, said a news release received here. The delegation also included Lord Syed Salah Kamall, Shadow Minister for Health (Conservative Party); MP David Mundell, Executive Member of the Commonwealth Parliamentary Association ( CPA) from the Conservative Party; and Baroness Lindsay Northover from the Liberal Democrats. From the Pakistan side, the meeting was attended by Senator Rubina Khalid, Senator Mohsin Aziz, and Speaker of the Sindh Assembly, Awais Qadir Shah. During the meeting, Gilani highlighted the longstanding and multifaceted relations between Pakistan and the United Kingdom and underscored the importance of enhanced inter-parliamentary cooperation within the framework of the CPA. He also presented Pakistan's principled position on key global issues, including the right to self-determination for the people of Indian illegally occupied Jammu & Kashmir, as envisioned in the UN Resolutions, as well as discussed the current situation of Palestine, the need for sustained international engagement on key issues related to peace and security, including Afghanistan, and the urgency of collective action on climate change. The Gilani further extended a formal invitation to the UK Parliament to participate in the Inter-Parliamentary Speakers' Conference, to be held in Islamabad on 11-12 November 2025, which will convene parliamentary leaders from across the world to deliberate on shared democratic values and contemporary governance challenges. The UK delegation appreciated Pakistan's constructive role within the CPA and commended its continued efforts to promote regional peace, stability, and cooperation. Both sides reaffirmed their commitment to advancing parliamentary dialogue and working together to uphold the Commonwealth's principles of democracy, equality, and inclusivity. Meanwhile, Pakistan's presence at the 68th Commonwealth Parliamentary Conference (CPC) in Bridgetown, Barbados, carried a unique distinction this year, as three members of the Gillani family represented all legislative houses of Pakistan at the prestigious international forum. Syed Yousaf Raza Gilani, Chairman Senate of Pakistan, represented the Upper House (Senate), Syed Abdul Qadir Gilani, Member of the National Assembly, represented the Lower House; and Syed Ali Haider Gilani, Member of the Provincial Assembly of Punjab, represented the Provincial Legislature. Their participation symbolized the continuity of democratic representation across Pakistan's federal structure and underscored the country's active engagement within the Commonwealth Parliamentary Association (CPA). The Gillani family's collective representation marked a historic moment for Pakistan's parliamentary diplomacy, showcasing a unified voice from the Senate, National Assembly, and Provincial Assembly of Punjab at one of the Commonwealth's most significant multilateral gatherings.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}