{
  "article_id": "2025-10-09_3ea6c0d331c50939b242b381aa39b9d0",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/dry-weather-to-prevail-across-most-parts-of-country-light-rain-likely-in-northern-areas/",
    "retrieved_at": "2025-10-12T00:00:10.841Z"
  },
  "metadata": {
    "title": "Dry weather to prevail across most parts of country; light rain likely in northern areas",
    "author": null,
    "date_published": "2025-10-09T22:22:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 226,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP):Pakistan Meteorological Department (PMD) has forecast mainly dry weather for most parts of the country on Friday with cold conditions expected in hilly areas during the night and morning hours. However, partly cloudy skies accompanied by light rain and thunderstorms may occur at isolated places in Kashmir and Gilgit-Baltistan. In the federal capital and its adjoining areas, dry weather is expected to continue throughout the day. Most plain districts of Khyber Pakhtunkhwa will also remain dry, though light rain or thunderstorms are anticipated in upper regions including Chitral, Swat, Malakand, and Dir, where temperatures are likely to drop during the night. In Punjab, the weather will stay mostly dry, with cooler conditions expected in Murree, Galiyat, and surrounding hilly regions during the night and early morning. Sindh is likely to experience hot and dry weather, while in Balochistan, dry conditions will dominate across most areas, with cold nights forecast for the northern districts. For Kashmir and Gilgit-Baltistan, the forecast suggests partly cloudy to cold weather with chances of light rain and isolated thunderstorms in some areas. During the past 24 hours, dry weather prevailed over most parts of the country, while upper hilly regions experienced cold conditions at night and early morning. The highest maximum temperature recorded on Thursday was 36 C in Dadu, Mirpur Khas, Mithi, Chhor, Tando Jam, and Shaheed Benazirabad.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}