{
  "article_id": "2025-10-09_abc1031e83fe0bed799dd448a91dad33",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/jazz-strengthens-esg-leadership-with-tree-plantation-drive-healthcare-recognition/",
    "retrieved_at": "2025-10-12T00:01:25.603Z"
  },
  "metadata": {
    "title": "Jazz strengthens ESG leadership with tree plantation drive, healthcare recognition",
    "author": null,
    "date_published": "2025-10-09T17:04:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 268,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP):Reinforcing its commitment to environmental sustainability and Net Zero goals, Jazz has undertaken a large-scale tree plantation under the Jazz Carbon Sink Project in collaboration with the Capital Development Authority (CDA). The initiative leverages nature-based solutions to offset the company's carbon footprint and contribute to urban ecosystem restoration. This year alone, Jazz planted 8,000 native trees, expanding its Carbon Sink to 45,760 trees that collectively sequester over 1,308 tonnes of CO2 annually, including 11.45 tonnes from the latest addition. Beyond carbon reduction, the project strengthens urban forestry by mitigating heat, restoring biodiversity, improving air quality, and protecting against soil erosion, groundwater depletion, and climate-related hazards, said a news release. In parallel with its environmental initiatives, Jazz has also recently been honored with the Shaukat Khanum Excellence Award on Corporate Social Responsibility for its sustained contributions to cancer treatment, research, and healthcare access in Pakistan. The accolade reaffirms Jazz's broader ESG agenda that extends beyond connectivity to healthcare, education, disaster relief, and community empowerment. Commenting on these milestones, Zaheer Mehdi, Group Chief Corporate & Regulatory Affairs Officer at Jazz, said: \"These recognitions reflect Jazz's holistic approach to ESG - where our responsibility is not only to the environment, but also to the communities we serve. From planting trees that will benefit future generations to enabling life-saving healthcare access today, we remain committed to creating lasting impact across Pakistan.\" Through efforts like the Jazz Carbon Sink Project and partnerships with institutions such as Shaukat Khanum Memorial Cancer Hospital and Research Centre, Jazz continues to pave the way for a more sustainable, healthier, and hopeful future for Pakistan.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}