{
  "article_id": "2025-10-09_2c85b11fedddecbd08219158b2579dc4",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/senator-sherry-rehman-urges-shift-to-renewables-for-pakistans-energy-sovereignty/",
    "retrieved_at": "2025-10-12T00:01:00.361Z"
  },
  "metadata": {
    "title": "Senator Sherry Rehman urges shift to renewables for Pakistanâs energy sovereignty",
    "author": null,
    "date_published": "2025-10-09T18:25:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 393,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP):Senator Sherry Rehman has called for a decisive shift towards renewable energy to ensure Pakistanas energy sovereignty, security, and affordability. Speaking as the chief guest at the Parliamentary Forum on Energy and Economy, themed aImplications of IGCEP 2025: Politics of Energy Generation in Pakistana, she stressed that electricity is a fundamental human right and must be accessible, sustainable, and affordable for all. aEnergy represents wealth for a country a it is the foundation of energy democracy, security, and sovereignty,a Senator Rehman said. aEvery industry, household, school and farm depends on low-cost, sustainable energy to power growth and development.a Highlighting global trends, she noted that renewable energy overtook coal as the leading source of electricity worldwide in the first half of 2025, with solar and wind growth meeting all of the increase in global demand. Pakistan, she said, is making notable progress: aIn 2024, 47% of Pakistanas electricity came from low-carbon sources, and the Ministry of Energy estimates this figure at 55% a well above the global average of 41%.a Pakistan now ranks as the sixth largest solar market globally, according to the World Economic Forum. Senator Rehman reaffirmed Pakistanas climate commitments under its Nationally Determined Contributions (NDCs): achieving 60% of power generation from renewables by 2030, net-zero emissions by 2050, a 30% transition to electric vehicles by 2030, and a ban on imported coal. She praised the Sindh governmentas early solar initiatives, including the Sindh Solar Energy Project (SSEP), which aims to provide affordable solar power to 500,000 low-consumption households, prioritising beneficiaries of the Benazir Income Support Programme. However, she criticised governmentas current energy planning as outdated, arguing that the Integrated Generation Capacity Expansion Plan (IGCEP) 2025 lacked proper provincial consultation and excluded significant renewable projects. aThis intervention requires parliamentary consensus and provincial consultation a not just box-ticking exercises,a she said. She also pointed to weaknesses in regulatory frameworks, citing NEPRAas failure to create a predictable environment for investors and concerns over the ongoing debate on privatising distribution companies. Despite a nominal energy surplus, Senator Rehman warned that unannounced power outages and high tariffs still leave millions without reliable access to affordable electricity. aNo Pakistani should be left outside the electricity tent,a she declared, urging policymakers to incentivise renewables and ensure reforms are communicated in a clear and understandable way. aWe donat need miracles, we just need systems that work.a",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}