{
  "article_id": "2025-10-09_1b169c3250cd3feba80701bd9dc5e852",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/cm-balochistan-to-inaugurate-3-day-tourism-festival-at-lok-virsa/",
    "retrieved_at": "2025-10-12T00:01:24.893Z"
  },
  "metadata": {
    "title": "CM Balochistan to inaugurate 3-day tourism festival at Lok Virsa",
    "author": null,
    "date_published": "2025-10-09T18:02:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 236,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 9 (APP): Chief Minister (CM) Balochistan, Mir Sarfaraz Bugti, is set to inaugurate a three-day Balochistan Grand Tourism Festival on Thursday at Lok Virsa, aimed at promoting and showcasing the rich culture of the province to the world. This was announced by the Parliamentary Secretary (PS) of the Ministry of Tourism, Nawabzada Mir Muhammad Zarin Khan Magsi, along with Secretary Tourism Balochistan Sohail-ur-Rehman and others, while holding a press conference at the National Press Club, said a press release. Zarin Khan Magsi said that for the first time in history, the three-day Balochistan Grand Tourism Festival is being organized in collaboration with the Ministry of Tourism and Culture, Pakistan Tourism Development Corporation (PTDC) at Lok Virsa. He highlighted that Balochistan is a land rich in cultural heritage, adding that folk artists will showcase their talent during the festival, while drama artists will depict the region's traditions through theatre performances. The festival will also feature art exhibitions from Balochistan and panel discussions with prominent personalities. Following Islamabad, similar festivals are planned in other cities, including Karachi, to offer people across the country a chance to experience Balochistan's vibrant culture. Zarin Magsi emphasized that the government's role was to develop policies and provide facilities, while their primary goal was to project the positive and progressive image of Balochistan globally. Secretary Tourism Balochistan, Sohail-ur-Rehman, noted that this event marks the 39th program organized within the allocated budget.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}