{
  "article_id": "2025-10-09_7c375d8d22da57047052d8bb502be636",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/ayesha-reaffirms-governments-resolve-to-eradicate-polio/",
    "retrieved_at": "2025-10-12T00:01:00.033Z"
  },
  "metadata": {
    "title": "Ayesha reaffirms government’s resolve to eradicate Polio",
    "author": null,
    "date_published": "2025-10-09T18:40:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 408,
    "reading_time_minutes": 3
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP):Prime Minister's Focal Person for Polio Eradication (PMFP), Ayesha Raza Farooq has reaffirmed the government's unwavering commitment to eradicating Polio from the country. Addressing a media briefing, she said that nationwide polio vaccination campaign will start on October 13 to vaccinate over 45 million children under the age of five across the country. She added Vitamin A will also be administered during the campaign to boost children's immunity and to protect them from other preventable diseases. She noted that the number of missed children has dropped from over 1.1 million in October 2024 to around 830,000 in May 2025, an improvement that reflects stronger planning, accountability, and community engagement. She highlighted that since September 2024, Pakistan has conducted six polio campaigns, including three nationwide drives in 2025, each reaching more than 45 million children. Expressing gratitude to the Prime Minister and officials of the Polio Eradication Initiative (PEI) for their steadfast leadership, she emphasized that sustained coordination, joint planning, and unified action are essential to closing immunity gaps. She said that these efforts are particularly critical in high-risk areas such as the South Khyber Pakhtunkhwa (KP) block and Karachi, where poliovirus continues to be detected in environmental samples. \"Ending polio is not just the responsibility of the government or the health programme, it is a shared responsibility of all Pakistanis,\" she said. \"The last mile is the hardest, yet within reach. Every parent, teacher, community elder, and religious leader has a vital role to play in ensuring that every child receives the vaccine.\" She said that for all parents and caregivers, our message is simple and heartfelt, \"When vaccinators come to your doorstep, please open your doors. Two drops of the polio vaccine can protect your child from lifelong disability.\" Ayesha Farooq also commended the relentless efforts of frontline health workers and security personnel, recognizing them as the true heroes of the mission. She called for intensified monitoring, sustained efforts to reduce missed children, and continued integration between the PEI and the Expanded Programme on Immunization (EPI). With over 400,000 frontline workers, including 225,000 female vaccinators, mobilized for the October campaign, the government has reiterated its full commitment to ensuring that every child receives the polio vaccine. Muhammad Anwar Ul Haq, National Coordinator of the National Emergency Operations Centre (NEOC), reaffirmed the government's full support to ensure the success of the campaign, stressing that sustained coordination and high-quality implementation are critical to closing immunity gaps.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}