{
  "article_id": "2025-10-09_047030371bf428544105f176bc422440",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/pakistan-saudi-arabia-sign-landmark-agreement-on-anti-corruption-asset-recovery/",
    "retrieved_at": "2025-10-12T00:00:10.221Z"
  },
  "metadata": {
    "title": "Pakistan, Saudi Arabia sign landmark agreement on anti-corruption, asset recovery",
    "author": null,
    "date_published": "2025-10-09T22:24:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 294,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 09 (APP):The Islamic Republic of Pakistan and the Kingdom of Saudi Arabia on Thursday signed a landmark agreement aimed at enhancing collaboration in combating corruption, preventing money laundering, and facilitating the recovery of stolen assets. The MoU was signed by President of the Oversight and Anti-Corruption Authority of the Kingdom of the Saudi Arabia (Nazaha) Mazin bin Ibrahim Al-Kahmous, and Chairman National accountability Bureau (NAB) Lt. General (Rtd) Nazir Ahmed. The MoU was signed during the inaugural session of Asset Recovery Interagency Network for MENA region being held at Jeddah KSA from 8-9 October, 2025. Under this MoU, both agencies have agreed to strengthen collaboration through the exchange of information related to corruption and money laundering. Asset tracing and recovery of proceeds of crime is also a common area of interest. Furthermore, the MoU envisions mutual cooperation in matters related to mutual legal assistance (MLA), and extending technical support for the preparation of MLA requests prior to their submission through diplomatic channels. Speaking on the occasion, Mazin bin Ibrahim Al-Kahmous lauded NAB efforts in global drive against corruption, especially the innovative reforms that have yielded unprecedented recoveries of 6.4 trillion Pakistani Rupees equivalent to 23 billion USD in a short span of time. He particularly praised Chairman NAB's address to the MENA ARIN forum that objectively covered the challenges faced by all states in curbing corruption. Lt General Nazir Ahmed, lauded Saudi leadership in taking successive anti-corruption initiatives that has rejuvenated regional anti-corruption efforts. He particularly praised the recent land mark defence agreement between the two countries that will further augment the brotherly ties between the two countries. Chairman NAB extended invitation to Mazin bin Ibrahim Al-Kahmous, the president of Nazaha to visit Pakistan to further cement bilateral cooperation and brotherly ties.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}