{
  "article_id": "2025-10-09_e89d5599630f1334c983c7ecc0ccb62f",
  "source_info": {
    "source_name": "APP",
    "source_link": "https://www.app.com.pk/national/baalkada-a-powerful-theatrical-reflection-on-forgotten-voices-coming-to-pnca/",
    "retrieved_at": "2025-10-12T00:02:38.674Z"
  },
  "metadata": {
    "title": "“Baalkada”-a powerful theatrical reflection on forgotten voices coming to PNCA",
    "author": null,
    "date_published": "2025-10-09T13:58:00.000Z",
    "image_url": null,
    "categories": [],
    "word_count": 385,
    "reading_time_minutes": 2
  },
  "content": {
    "article_body": "ISLAMABAD, Oct 9 (APP):A powerful theatrical performance titled \"Baalkada\" will be staged at the Pakistan National Council of the Arts (PNCA) on October 11 which would serve as a treat for the art lovers from across the twin cities of Islamabad and Rawalpindi. The play is written and directed by Arshad Minhas and presented by Dastaan Theatre in collaboration with the Pakistan National Council of the Arts, National Heritage and Culture Division. Baalkada takes on sensitive and deeply human themes, highlighting two of society's most pressing issues - child abduction and the struggles of the transgender community. Through emotional storytelling, the play captures the pain, fear, and resilience of individuals caught in these realities while also addressing the silence and indifference that often surround such subjects. It uses the power of performance to make the audience think, feel, and reflect on what lies beneath the surface of everyday life. The story of Baalkada unfolds with moments of heartbreak and tenderness, laughter and grief, woven together to portray the experiences of people whose lives are often overlooked or misunderstood. The characters bring to life the emotional conflicts of those who exist on the margins of society, compelling the audience to confront their own perceptions and prejudices. The play blends realism and expression, keeping the focus on human dignity and empathy. Director Arshad Minhas has been known for his thoughtful approach to theatre, and with Baalkada, he brings a narrative that speaks directly to the conscience. The production invites audiences not only to witness but to engage - to see theatre as more than performance, as a reflection of shared humanity. The collaboration between Dastaan Theatre and PNCA under the National Heritage and Culture Division is part of ongoing efforts to promote socially conscious art in the country. Events like Baalkada show how theatre continues to serve as a meaningful medium for awareness, dialogue, and creative expression in Pakistan. The play promises a memorable evening filled with emotions, messages, and artistic excellence, offering a rare chance for audiences to experience theatre that entertains as well as enlightens. The performance will take place at the PNCA Auditorium and entry is free for all. The people have been urged to attend this special presentation and be part of an artistic journey that seeks to touch hearts and awaken thought.",
    "summary": "",
    "keywords": []
  },
  "entities": {
    "people": [],
    "organizations": [],
    "locations": []
  }
}