{
  "title": "Suspects involved in PPP UC chairman’s killing in Orangi arrested: police - Pakistan - DAWN.COM",
  "author": null,
  "content": "Two suspects allegedly involved in the recent killing of the PPP UC chairman in Karachi’s Orangi Town have been arrested, police said on Tuesday.\n\nPPP Union Council Chairman, Amir Bhashani, was killed on April 17 by armed motorcyclists in a suspected targeted attack near Bismillah Chowk in Orangi Town. The case was registered under terror and murder charges by the Pakistan Bazaar police.\n\nIn response, the city council last week demanded that the provincial police and law enforcement agencies promptly arrest the killers of Bhashani and bring them to justice.\n\nAccording to a statement issued by Karachi District West Senior Superintendent of Police (SSP) Tariq Illahi Mastoi, “A police team led by SP Manghopir initiated an investigation on different aspects and conducted technical and human intelligence-based action, apprehending two suspects, namely and recovering two pistols.”\n\nDuring the initial probe, it was transpired that one of the suspects was directly involved in the killing, while another was an informer who had informed his accomplices about the presence of the UC chairman at his office, the statement said.\n\nThe planning to carry out the killing was done a week before the murder based on “land and financial matters”, the statement said.\n\nApart from the prime suspect, two other suspects were also found to be involved in the murder planning, it said.\n\nSo far, the investigation has revealed who the real mastermind of the murder is, it added.\n\nAccording to the statement, the suspects told the interrogators that the prime suspect, along with two accomplices, went to the camp UC chairman’s office in a car on the day of the murder.\n\nIt said that the accomplices stepped out of the vehicle and stayed at a nearby restaurant, waiting for two hired assassins while the prime suspect remained seated in the car.\n\nAfter the arrival of the assassins, the accomplices, with the help of the prime suspect, killed Bhashani, the statement said.\n\nLater on, the suspects left in their car while hired assassins fled on their motorcycle, it added.\n\nWhile the two suspects were under police custody, concerted efforts were underway to arrest the four remaining suspects in the case, SSP Mastoi said in the statement.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:41:42.879Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907383/suspects-involved-in-ppp-uc-chairmans-killing-in-orangi-arrested-police",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T18:10:51.000Z"
}
