{
  "title": "Occupied Kashmir CM Omar Abdullah asks Delhi not to ‘alienate’ Kashmiris - World - DAWN.COM",
  "author": null,
  "content": "SRINAGAR: India should not do anything to alienate Kashmiris in its hunt for people who killed 26 people in Pahalgam last week, especially as residents of the India-held state have staged protests against that attack, chief minister Omar Abdullah said on Monday.\n\nThe Indian authorities have demolished nine homes belonging to the families of suspected assailants as part of a crackdown after the April 22 killings of tourists.\n\n“We should not do anything to alienate the people after their spontaneous reaction (against the attack),” Omar Abdullah said at a session of the legislative assembly in Srinagar.\n\n“Guns can only control militancy, not finish it. It will only end when the people are with us. It seems people are now reaching that stage.”\n\nSome Kashmir residents have spoken out against the move by the authorities to destroy homes, like that of Rifat Sheikh.\n\nOn Monday, she stood next to her razed kitchen, assessing the damage caused by explosives used by police to demolish the house.\n\nPolice say her brother Asif is with the Lashkar-i-Taiba, which New Delhi blamed for the attack.\n\nRifat Sheikh said her family had not seen or spoken with Asif after he left home one morning in 2022 on the pretext of going to a market. “Why are they punishing us by destroying our house this way for what they say he has done?” she asked. “We don’t know where he is or what he is doing. This is provocation, but I pray that people remain calm.”\n\nTwo police officials say they were acting against homes that “retained connections with militants”.\n\nNazir Ahmad Wani’s house in Khasipora village was one of the nine homes destroyed so far. Police say his son, Amir Nazir, is a member of the Jaish-e-Mohammed outfit.\n\nBroken pieces of glass lay in the backyard of Wani’s home where he grew maize crops. The roof of the house came down due to impact of the explosives, his relatives said. Amir had left the home in April last year and didn’t return, they added.\n\n“I was kept at the police station all night. They didn’t tell me anything at the time. I only learned of the damage the next morning when I came to the house,” said Wani.\n\nPublished in Dawn, April 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/290839496205952.jpg",
  "retrievedAt": "2025-08-25T14:42:21.313Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907222/occupied-kashmir-cm-omar-abdullah-asks-delhi-not-to-alienate-kashmiris",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T01:19:12.000Z"
}
