{
  "title": "Power returns to most of Spain, Portugal after massive blackout - World - DAWN.COM",
  "author": null,
  "content": "Lights flickered back to life in Spain and Portugal on Tuesday after a massive blackout hit the Iberian peninsula stranding passengers in trains and hundreds of elevators while millions saw phone and internet coverage die.\n\nElectricity had been restored to more than 90 per cent of mainland Spain early on Tuesday, the REE power operator said. Lights came on again in Madrid and in Portugal’s capital.\n\nBarely a corner of the peninsula, which has a joint population of almost 60 million people, escaped the blackout. But no firm cause for the shutdown has yet emerged, though wild rumours spread on messaging networks about cyber attacks.\n\nPortuguese Prime Minister Luis Montenegro said the source of the outage was “probably in Spain”. Spain’s Prime Minister Pedro Sanchez said “all the potential causes” were being analysed and warned the public “not to speculate” because of the risk of “misinformation”.\n\nSanchez said about 15,000 megawatts of electricity, more than half of the power being consumed at the time, “suddenly disappeared” in about five seconds.\n\nHe was unable to say when power would be completely restored in Spain and warned that some workers would have to stay home on Tuesday. Montenegro said Portugal’s power would be back “within hours”.\n\nPower was restored overnight to around 6.2m households in Portugal out of 6.5m, according to the national electricity grid operator.\n\nThe outage rippled briefly into southwest France while Morocco saw disruption to some internet providers and airport check-in systems.\n\nPeople were “stunned”, according to Carlos Candori, a 19-year-old construction worker who had to exit the paralysed Madrid metro system. “This has never happened in Spain”.\n\n“There’s no (phone) coverage, I can’t call my family, my parents, nothing: I can’t even go to work,” he told AFP.\n\nIn Madrid and cities across Spain and Portugal, panicked customers rushed to withdraw cash from banks, and streets filled with crowds floundering for a phone signal. Long lines formed for taxis and buses.\n\nWith stop lights knocked out, police struggled to keep densely congested traffic moving and authorities urged motorists to stay home.\n\nIn Madrid alone 286 rescue operations were carried out to free people trapped in lifts, regional authorities said.\n\nTrains were halted across the country and on Tuesday morning, three trains were still stranded in Spain with passengers onboard, according to Transport Minister Oscar Puente.\n\nSeveral high-speed rail lines are expected to resume normal service, including between Madrid-Barcelona and Madrid-Valencia, but disruptions remain between Barcelona-Alicante and between Madrid-Galicia (northwest), Puente wrote on X.\n\nRailway stations in Madrid, Barcelona, Bilbao, Valencia, Seville and four other major cities were kept open all night so that stranded passengers could sleep there.\n\nSpain’s nuclear power plants automatically went offline as a safety precaution, with diesel generators maintaining them in a “safe condition”, the Spanish Nuclear Safety Council said.\n\nSanchez said the blackout, which hit just after midday, caused “serious disruption” for millions and “economic losses in businesses, in companies, in industries”.\n\nThe European Commission said it was in contact with Spain and Portugal over the crisis. European Council President Antonio Costa said on X: “There are no indications of any cyberattack”.\n\nThe huge power cut disrupted flights to and from Madrid, Barcelona and Lisbon, European air traffic organisation Eurocontrol said.\n\nTransport chaos also gripped Spain’s second city, Barcelona, where locals and tourists alike flooded the streets in an attempt to find out what had happened.\n\nStudent Laia Montserrat left school when the lights went out.\n\n“As the internet wasn’t coming back, they told us to go home… [but] there weren’t trains either,” she told AFP. “Now we don’t know what to do.”\n\nThe internet activity monitoring site Netblocks told AFP the blackout caused a “loss of much of the country’s digital infrastructure”. It said web connections plunged to just 17pc of normal usage.\n\nSpain’s El Pais newspaper reported that hospitals used back-up generators to keep critical wards going, but some units were left without power.\n\nMassive blackouts have affected other countries around the world in recent years.\n\nHuge outages struck Tunisia in September 2023, Sri Lanka in August 2020, and Argentina and Uruguay in June 2019. In July 2012, India experienced a vast blackout.\n\nIn Europe, in November 2006, 10m people were left without power for an hour in France, Germany, Belgium, the Netherlands, Italy and Spain. That was caused by a failure in Germany’s grid.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/2911254787a476c.jpg",
  "retrievedAt": "2025-08-25T14:41:48.574Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907325/power-returns-to-most-of-spain-portugal-after-massive-blackout",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T06:48:58.000Z"
}
