{
  "title": "Iran says fire contained at port after deadly blast - World - DAWN.COM",
  "author": null,
  "content": "Firefighters have brought under control a blaze at Iran’s main port, following a deadly explosion blamed on negligence, authorities in the Islamic republic said.\n\nThe explosion, heard dozens of kilometres away, hit a dock at the southern port of Shahid Rajaee on Saturday.\n\nAt least 70 people were killed and more than 1,000 others suffered injuries in the blast and ensuing the fire, which also caused extensive damage, state media reported.\n\nRed Crescent official Mokhtar Salahshour told the channel late on Monday that the fire had been “contained” and a clean-up was underway.\n\nState television aired live footage on Tuesday showing thick smoke rising from stacked containers.\n\nIran’s IRNA news agency quoted Hossein Zafari, spokesman for the country’s crisis management organisation, as saying the situation had improved significantly since Monday.\n\nHowever, “the operation and complete extinguishing process may take around 15 to 20 days”, Zafari added.\n\nIran’s customs authority said port operations had returned to normal, according to the IRNA news agency.\n\nThe port of Shahid Rajaee lies near the major coastal city of Bandar Abbas on the Strait of Hormuz, a waterway through which one-fifth of global oil output passes.\n\nHormozgan provincial governor Mohammad Ashouri ruled out sabotage.\n\n“The set of hypotheses and investigations carried out during the process indicated that the sabotage theory lacks basis or relevance,” he told state television late on Monday.\n\nThe port’s customs office said the blast may have started in a depot storing hazardous and chemical materials.\n\nInterior Minister Eskandar Momeni said there were “shortcomings, including noncompliance with safety precautions and negligence”.\n\nA committee assigned to investigate the blast cited similar factors as the likely cause.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:41:45.536Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907339/iran-says-fire-contained-at-port-after-deadly-blast",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T09:51:34.000Z"
}
