{
  "title": "Swat landowners threaten protest against housing scheme - Pakistan - DAWN.COM",
  "author": null,
  "content": "SWAT: Landowners from Abuha area of Swat on Monday rejected the proposed housing scheme initiated by provincial government in Malikadam valley of tehsil Barikot and urged authorities to cancel the project immediately.\n\nSpeaking at a press conference at Swat Press Club, elders from Abuha, led by Shaukat Ali, Attaullah Jan, Mohammad Rafiullah, Daud Ahmad Khan, Umar Daraz, Mohammad Nawab and Younas Mohammad, expressed concerns over the scheme.\n\nThey said that a decision had been taken to establish a housing project on 1,500-kanal and advertisements seeking consultants for master planning and designing had already been floated, causing unrest among landowners.\n\n“This land is entirely agricultural and is home to fruit orchards, which constitute our only source of livelihood,” said an elder.\n\nElders term the project a conspiracy to grab their agricultural land\n\nThe speakers alleged that a similar attempt had been made around seven or eight years ago, which failed due to strong opposition of locals. They claimed that once again, under an orchestrated plan allegedly backed by land grabbers and vested interests, efforts were under way to seize their fertile land.\n\n“We strongly reject this fake and unacceptable housing scheme,” the landowners said, demanding immediate cancellation of the project.\n\nThey called for an inquiry into preparation of relevant revenue files, alleging that the documents were prepared secretly with collusion of revenue department officials. They elders asserted that they would not sell or surrender their land under any circumstances.\n\nThey threatened to take to streets along with their children if their demands were not met.\n\nANP: The local chapter of Awami National Party (ANP) on Monday rejected Mines and Minerals Bill and announced to launch a protest movement against it.\n\nThe announcement was made at a seminar organised by Pakhtun Students Federation (PkSF) at Swat Press Club. The seminar was attended by ANP workers, members of Malgari Wakeelan and PkSF and students of various colleges.\n\nSpeaking on the occasion, ANP central secretary for religious affairs Maulana Khanzeb, ANP district president Sher Shah Khan, PkSF president Haris Bacha, and others said the bill was a conspiracy to bring Khyber Pakhtunkhwa’s mineral resources under federal control.\n\nThey demanded of provincial assembly to reject the bill. They threatened to launch a province-wide protest movement against the bill. They also announced to convene an all-party conference soon to formulate an effective strategy against the bill. They said awareness campaigns would be launched in universities and colleges to mobilise people against the bill.\n\nPublished in Dawn, April 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:41:53.649Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907178/swat-landowners-threaten-protest-against-housing-scheme",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T01:21:04.000Z"
}
