{
  "title": "‘Catastrophic’: experts sound alarm over possible Crimea deal - World - DAWN.COM",
  "author": null,
  "content": "PARIS: Recognising Russia’s ann­exation of the Ukrainian Black Sea peninsula of Crimea would undermine the international order and raise serious legal challenges, experts said as the Kremlin on Mon­day called the concession “imperative” to resolving the conflict.\n\nThe comments came as US President Donald Trump pushed Russia to accept a ceasefire, telling reporters on Sunday that he believed Volodymyr Zelensky might concede Crimea as part of a settlement — a suggestion the Ukrainian leader has repeatedly rejected. But as a possible deal looms, experts raised concerns over the legality of any agreement, which would mark a monumental shift in the post-World War II international order.\n\n“The message it sends is that it can pay off, for great powers at least, to violate that prohibition of the use of force,” said Lauri Malksoo, an international law professor at the University of Tartu in Estonia.\n\n‘Catastrophic consequences’\n\nAfter 1945, nations set rules to uphold international law — and made it clear that borders could not be changed by force. As a result, “there has been no case of a country expanding its size by militarily seizing the territory of another for 80 years,” said Phillips O’Brien, a professor of strategic studies at the University of St Andrews.\n\nThe Kremlin has repeatedly outlined its demands for a Ukraine settlement, comprising Crimea, which Moscow seized in a lightning operation in 2014, as well four regions it annexed after its full-scale invasion three years ago but does not fully control.\n\nKyiv has denounced the annexations as an illegal land grab and says it will never recognise them, while experts have warned that accepting Moscow’s demands sets a dangerous precedent that could lead to future Russian aggression.\n\nForcing Ukraine to recognise Russian sovereignty over Crimea would be “a return to the right of conquest”, said Elie Tenenbaum at the French Institute for International Relations (IFRI). And the repercussions could extend far beyond the conflict in Ukraine, said Michel Erpelding at the Max Planck Institute in Germany. Such a precedent could have “extremely destabilising, even catastrophic consequences for world peace”, he said.\n\n‘Under duress’\n\nThe United States has signalled its willingness to recognise Russia’s annexation of Crimea, but there is a debate whether any deal would be legally valid — even if Ukraine signs.\n\n“In principle, at least, treaties produced through coercion are void,” said Malksoo, warning that any agreement signed under pressure by Kyiv could spark a legal battle.\n\nBefore accepting Russian sovereignty over the peninsula, each country would assess whether Moscow coerced Kyiv into giving up Crimea. And Ukraine could “use this argument to challenge the validity of any agreement it may have been pressured into signing”, said Erpelding.\n\nWashington has not revealed details of its peace plan, but has suggested freezing the front line, effectively handing Russia the four regions it now occupies since launching its February 2022 invasion.\n\nPublished in Dawn, April 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:41:58.049Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907265/catastrophic-experts-sound-alarm-over-possible-crimea-deal",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T01:19:53.000Z"
}
