{
  "title": "World Bank okays $108m more financing for rural access, tourism projects in KP - Business - DAWN.COM",
  "author": null,
  "content": "The World Bank (WB) has recently approved additional financing for Pakistan, amounting to $108 million to execute two projects supporting access to social services, markets and jobs in Khyber Pakhtunkhwa (KP).\n\nThe international lender also greenlit $78m in additional financing to Khyber Pakhtunkhwa Rural Accessibility Project (KPRAP) along with $30m to Khyber Pakhtunkhwa Integrated Tourism Development Project (Kite), enabling both projects to achieve their objectives in improving access to health and education services, markets and jobs in a way that strengthened resilience to natural disasters in the province.\n\n“By rehabilitating critical rural road infrastructure and enhancing disaster preparedness, KPRAP and Kite projects are not only improving access to essential services like health and education, but also fostering climate, economic resilience and creating job opportunities for local communities,” WB Country Director for Pakistan Najy Benhassine said in a news release on Tuesday.\n\nHe said the $78m in additional financing for the KPRAP would focus on providing safe and climate resilient road infrastructure, by upgrading and rehabilitating rural roads, thereby improving access to services including schools, health facilities, and markets.\n\nThe project is also supporting safe and affordable transport to school for girls.\n\nOverall, around 1.76m people are expected to benefit from the project, he added.\n\nThis additional financing underscores the World Bank’s commitment to support the country and its provinces’ development goals, said the task team leader for the project, Muhammad Bilal Paracha.\n\n“The project is crucial for improving the lives of people in the province, particularly women and girls, by enhancing access to essential services and economic opportunities,” he said.\n\nThe $30m in additional financing for the Kite project would help improve the tourism sector by completing the rehabilitation of two roads that would help improve access to the province’s “pristine tourist spots in the vicinity”.\n\nIt would also support technical assistance and capacity building for the tourism industry and public sector stakeholders.\n\n“The additional financing will support better destination management, heritage conservation, and the integration of digital platforms in Khyber Pakhtunkhwa’s tourism industry,” the press release read.\n\n“The project will encourage responsible tourism in KP in collaboration with public and private sector stakeholders,” said task team leader for the project, Kiran Afzal.\n\nAfzal added this was meant to improve roads and tourist facilities, and prove more opportunities for local communities to benefit from the growth of the tourism economy.\n\nShe highlighted, “The project will create jobs, train local people, and preserve the country’s rich cultural heritage.”",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:41:47.817Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907336/world-bank-okays-108m-more-financing-for-rural-access-tourism-projects-in-kp",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T09:11:16.000Z"
}
