{
  "title": "IMF board to meet on May 9 to discuss Pakistan’s programmes - Business - DAWN.COM",
  "author": null,
  "content": "The International Monetary Fund (IMF) Executive Board will meet on May 9 to discuss the country’s staff-level agreement for a new $1.3 billion arrangement under a climate resilience loan programme, along with the first review of Pakistan’s ongoing $7bn bailout programme, the global lender said.\n\nAccording to the Fund’s website, this will be the first “review under the Extended Arrangement Under the Extended Fund Facility”, along with request for an arrangement under the Resilience and Sustainability Facility (RSF).\n\nPreviously, Finance Minister Muhammad Aurangzeb during his visit to Washington had said he also expected the IMF Executive Board to approve in early May.\n\nApproval from the board would trigger the disbursement of a $1bn tranche under the programme, which Pakistan secured in 2024. The IMF programme has played a critical role in stabilising Pakistan’s fragile economy, providing much-needed external financing and boosting market confidence.\n\nPakis­tan and the IMF had reached a three-year, $7bn aid package deal in July 2024, with the new programme set to allow the country to “cement macroeconomic stability and create conditions for stronger, more inclusive and resilient growth”.\n\nThe ongoing 37-month EFF programme consists of six reviews over the life of the bailout, and the release of the next tranche of approximately $1bn will be contingent on the success of the performance review.\n\nIn March, Pakistan and the IMF had concluded the first biannual review of the $7bn loan programme on a positive note, without imposing additional revenue measures.\n\nIn an end-of-mission statement, mission chief Nathan Porter said: “Programme implementation has been strong, and the discussions have made considerable progress in several areas, including the planned fiscal consolidation to durably reduce public debt, maintenance of sufficiently tight monetary policy to maintain low inflation, acceleration of cost-reducing reforms to improve energy sector viability.”\n\nA separate technical mission from the IMF also visited the country on Pakistan’s request for over $1bn in additional financing for climate resilience.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:47:29.391Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907317/imf-board-to-meet-on-may-9-to-discuss-pakistans-programmes",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T05:03:29.000Z"
}
