{
  "title": "PMDC caps fee of medical, dental colleges at Rs1.8m - Pakistan - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: The Pakistan Medical and Dental Council (PMDC) has capped the annual fee of medical and dental colleges at Rs1.8 million with a 5 per cent increase for the 2025 session.\n\nInstitutions, which have already charged fee from students in excess of the capped/fixed fee and ancillary matters, will have to refund or adjust the fee in subsequent sessions.\n\nThe secretary general of Pakistan Association of Private Medical and Dental Institutions (PAMI), Dr Riaz Janjua, said that the decision has been imposed by the committee headed by Deputy Prime Minister (DPM) Ishaq Dar and it did not give any option to the association but to implement it.\n\nAccording to a government notification issued on Monday, pursuant to the recommendation of the Committee on Medical Education Reforms constituted by Prime Minister Shehbaz Sharif and chaired by Deputy PM Ishaq Dar, the PMDC has decided to cap/fix the tuition fee with ancillary matter for MBBS and BDS programmes at Rs1.8 million for all sessions, with a 5 per cent increase for session 2025 and subsequent increases based on the Consumer Price Index (CPI) inflation rate from session 2026 onwards.\n\nInstitutions which have already charged excess fee will have to refund or adjust the amount in subsequent sessions\n\n“If an institution has already charged fee from students in excess of the capped/fixed fee and ancillary matters, that shall either be refunded or be adjusted in subsequent sessions. It has been further decided that institutions that believe their financial requirements necessitate a higher fee, up to a maximum of Rs2.5 million, they shall submit detailed financial justifications to the PMDC. Approval of the same shall be accorded by the PMDC after evaluation,” the notification said.\n\n“The evaluation criteria for such fee structure shall be issued, separately. All private medical and dental colleges are directed to comply with the capped/fixed tuition fee in true letter and spirit failing which the colleges shall be liable to penal consequences under the law,” it stated.\n\n“Any aggrieved party regarding the implementation of fixed fees, if such fees are not charged in accordance with this notification, may lodge a complaint through the PMDC complaint portal,” the notification signed by the registrar of PMDC said.\n\nDr Riaz Janjua, who attended the meetings, told Dawn that the decision taken by the committee, headed by DPM Ishaq Dar, has put the private colleges in trouble as it will not be viable for a number of colleges to survive.\n\n“It was also discussed that the fee will be increased as per CPI every year. So far the minutes of the meeting are not circulated but it is obvious that one medical college cannot be compared with another. Those which are located in peripheries and have been built on cheaper land or have fewer expenses and those which are in major urban areas have much more expenses. On the other hand, the quality of faculty also differs,” he said.\n\n“During the meeting, headed by DPM, I suggested that there should be representation of PAMI in the committee which will decide increasing the fee up to Rs2.5 million because otherwise it will open a Pandora’s box. So it has been suggested that there will also be representation of PAMI in the committee,” he said.\n\nPublished in Dawn, April 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/04/6810250175f2d.gif",
  "retrievedAt": "2025-08-25T14:42:20.924Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907282/pmdc-caps-fee-of-medical-dental-colleges-at-rs18m",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T01:19:29.000Z"
}
