{
  "title": "45 nations will be represented at digital FDI conference today - Business - DAWN.COM",
  "author": null,
  "content": "ISLAMABAD: Despite regional tensions following the Pahalgam attack, delegates from around 45 countries have arrived in Islamabad to participate in the Digital Foreign Direct Investment (DFDI) conference, which is set to begin on Tuesday (today).\n\nMinister for Information Technology Shaza Fatima Khawaja expressed confidence that despite threats from India, the event would be a success.\n\n“The participants include delegations from China, Russia, the United States, Indonesia, Malaysia, and even from South America,” she said. Over 75 foreign investors and CEOs of more than 50 global companies are expected to attend the landmark event, the minister added.\n\nShaza Fatima also revealed that websites of some ministries had come under cyberattacks from India, but all attempts were thwarted. “The cybersecurity systems in Pakistan are among the best in the world, comparable to even those in Britain and the United States,” she said.\n\nOver 100 Pakistani IT firms to showcase products\n\nHighlighting the country’s expanding digital economy, the minister said that over 100 Pakistani IT companies and a large number of startups would present their products and innovative ideas to international investors.\n\nThe conference, being organised under the aegis of the Digital Cooperation Organisation (DCO), marks the first-ever DFDI meeting held in Pakistan.\n\nThe minister said that agreements with several investors had already been signed, and the prime minister was expected to announce potential investment figures during the event.\n\nDeemah Al Yahya, the secretary general of DCO, will attend the conference as a special guest. Pakistan is also scheduled to assume the presidency of the organisation for the next year.\n\n“We are working with Saudi Arabia to expand the DCO and aim to bring advanced economies like China into its fold,” Shaza Fatima added.\n\nIn reply to a question, she said the government was implementing reforms in the Federal Board of Revenue (FBR) to address investors’ complaints about bureaucratic hurdles.\n\n“We are committed to creating a more business-friendly digital ecosystem, and reforms are being carried out in FBR, as well as in other government departments, to reduce red tape and improve the business environment,” she said.\n\nSpeaking about the Special Investment Facilitation Council (SIFC), the minister said the council represents a whole-of-government approach and acts as a platform through which the concerns of the IT ministry are easily forwarded to the FBR and other departments.\n\n“We are moving toward establishing a one-stop shop for business services,” she said, adding that the World Bank’s project was being implemented to streamline business processes through digitalisation.\n\n“Our ultimate goal through the National Digital Transformation is to create ease of doing business and attract significant investment into Pakistan’s tech sector,” Shaza Fatima concluded.\n\nPublished in Dawn, April 29th, 2025",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-10-12T02:47:05.239Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907277/45-nations-will-be-represented-at-digital-fdi-conference-today",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T01:19:29.000Z"
}
