{
  "title": "7 bullet-ridden bodies recovered from Balochistan’s Ziarat, says official - Pakistan - DAWN.COM",
  "author": null,
  "content": "Seven bullets-ridden bodies were found on Tuesday in Balochistan’s Ziarat district, officials said.\n\nZiarat Deputy Commissioner Ziarat Zakiullah told Dawn.com, “On Tuesday morning, the district administration received information about seven bodies being dumped at Gonja Tangi, ​​Ziarat, after which the assistant commissioner was sent to the scene along with ambulances.”\n\nHowever, at Chautir, near the site of the incident, residents had blocked the highway in protest.\n\n“They said that those who were killed neither belonged to Chautir or Ziarat, nor had they been seen in the area before, and that they were terrorists,” DC Zakiullah said.\n\nThe residents expressed their worry that based on this pretence, an operation would be launched in the area, DC Zakiullah said.\n\n“After successful negotiations with residents of the area, the district administration took custody of the bodies, which were later handed over to the District Headquarters Hospital (DHQ) Ziarat,” the DC said.\n\nHe added that the counterterrorism department (CTD) and local police in Ziarat had been contacted as well.\n\n“They said they were also unaware about the incident,” DC Zakiullah said.\n\nHe added that after being shifted to DHQ, the bodies could not be identified because all those killed appeared to be non-locals, who were shifted to Quetta for further necessary action.\n\nIn August last year, the bullet-riddled bodies of five people were found hanging from an electric pole in Dalbandin city, Balochistan.",
  "tags": [],
  "categories": [],
  "image": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAQAAAC1HAwCAAAAC0lEQVR42mN8Vw8AAmEBb87E6jIAAAAASUVORK5CYII=",
  "retrievedAt": "2025-08-25T14:41:42.821Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1907364/7-bullet-ridden-bodies-recovered-from-balochistans-ziarat-says-official",
  "dateList": "2025-04-29",
  "date_published": "2025-04-29T14:11:52.000Z"
}
