{
  "title": "Giant initiatives in 2020 to help achieve vision for welfare state: PM",
  "link": "https://www.app.com.pk/national/giant-initiatives-in-2020-to-help-achieve-vision-for-welfare-state-pm/",
  "date_published": "2020-01-01T11:32:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 1 (APP):Prime Minister Imran Khan Wednesday said giant initiatives would be taken in the year 2020 to put Pakistan on the path leading to realization of the true vision of being a welfare state based upon the principles of rule of law, meritocracy and social equality.\nAddressing as a chief guest at the ground-breaking ceremony of the Air University South Campus here, he said the humans were blessed to achieve their concepts, visions and dreams irrespective of all hurdles.\n“The great people and the institutions, who nurtured wider visions, always progressed,” he added.\nThe prime minister said his own vision to transform Pakistan on the pattern of State of Madina, which was ‘a tried and tested model’ in the human history based on the creation of a humanitarian system leading to the rise of a great nation. For the first time in history, a state had taken responsibility of its weaker segments, including widows, orphans and hapless.\nThe welfare State of Madina, he said, had three basic principles of social security, rule of law where no one was above the law, and the emphasis upon seeking of knowledge.\nHowever, no focus was made on maintaining standard of higher education and research in the past, he regretted.\nThe prime minister said during the 1960s, the degrees awarded by the Pakistani educational institutes were recognized internationally and students from abroad used to study here.\nImran Khan stressed on learning from the life of the Holy Prophet Hazrat Muhammad (Peace Be Upon Him), who had laid emphasis that seeking of knowledge was a sacred duty and referred to the famous events of the Battle of Badar.\nHe said the world today was moving at a fast pace in terms of achievements in the fields of science and technology, which were making progress by leaps and bounds.\nHe referred to the artificial intelligence (AI), which was bringing about a revolution and stressed that the country’s institutions should take benefit from the ‘watershed moment’.\nHe observed that there should be some out of the box strategy according high priority to the education sector as the nation had capabilities to excel despite limited financial resources.\nExpressing his optimism, he said soon the difficult times would be over as the nations, which underwent trials, always emerged successfully. The county was facing economic constraints but it had huge human resource potential like the overseas Pakistanis, he added.\nImran Khan said his government’s basic target was to introduce a system of meritocracy in all spheres of life.\nHe said in the year 2019, they succeeded in bringing about an economic turnaround and stability despite facing hard times in the middle of last year when the country’s foreign reserves had shrunk, with the rupee sliding down.\nThe people went through difficult times with high inflation and hike in the prices of petrol, power and edibles, though hoarding was also one of the reasons for price increase, he added.\nHe, howver, expressed his optimism, “InshaAllah, 2020 will be the year in which the country will witness progress and prosperity.”\nThe country, he said, had huge potential in every sector and gifted with mineral wealth. The food security could be achieved through research and technology, besides increasing the production in food grains and dairy.\nHe said the government was giving boost to the construction industry with the low cost housing initiative which would benefit about 40 allied industries with it.\nCurrently, a case was pending with the Lahore High Court over the foreclosure law, he added.\nEnumerating the steps for providing relief to the public, he said the poor segments and the salaried class would be provided with subsidized items at all the outlets of Utility Stores Corporation.\nHe said the government was also mulling to issue ration cards to the poor families as they had already been given the health insurance through the issuance of Sehat Insaf cards.\nThe Langar scheme, he added, was being introduced in the shanty settlements to cater to the needs of the downtrodden. Moreover, a network of Panahgahs (shelter homes) had been established in Lahore, Islamabad, Rawalpindi and KPK, for the free of charge lodging and dining facilities to the poor people, he added.\nThe prime minister said tourism also had immense potential as the tourists flow in the country had doubled during the last two years due to improved security situation. The world had recognized that as evident from the recent reports of Condé Nast Traveller and UK Backpacker, he added.\nMalaysia was earning $20 billion, Turkey $40 billion and Switzerland $80 billion annually from the tourism sector, he mentioned.\nImran Khan also lauded the establishment of university campus by the Pakistan Air Force authorities and credited them for maintaining standards. Focus should be given on job-oriented education system, he stressed, adding the Air University would follow the footsteps of Namal University where 90 percent of the students got employment after graduation.\nThe prime minister appreciated the space like model of the Air University South Campus which reflecting the vision for future requirements.\nEarlier, Air University Vice Chancellor Air Vice Marshal (Retd) Faaiz Amir, in his welcome address, said the university was determined to fulfill its commitment to the society by providing world class education to its students.\nThe new campus being built at a cost of Rs 1.575 billion would offer quality education to the students, he added. Referring to a quote of Imam Shafi (RA)” All humans are dead except those who are educated,” the vice chancellor said today was the era of advancement in technology and the nations, who import technology, could not compete with those who had technologies.\nEarlier, the prime minister performed the ground breaking of the Air University South Campus by unveiling the plaque.\nSenator Faisal Javed, Chief of Air Staff Air Chief Marshal Mujahid Anwar Khan, Higher Education Commission Chairman Dr Taiq Banori, and the university academicians and staff attended the ceremony.",
  "retrievedAt": "2025-08-11T18:33:24.869Z"
}
