{
  "title": "Budget for merged districts of KPK enhanced from Rs 58b to Rs 162b: NA told",
  "link": "https://www.app.com.pk/national/budget-for-merged-districts-of-kpk-enhanced-from-rs-58b-to-rs-162b-na-told/",
  "date_published": "2019-12-31T22:36:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 01 (APP):Minister of State for Narcotics Control Shehryar Afridi Wednesday informed the National Assembly that budget for the merged tribal districts of Khyber Pakhtunkhwa had been enhanced from Rs 58 billion to Rs 162 billion.\nResponding to a question during the Question Hour, he said that Rs 62 billion had been allocated to the government of Khyber Pakhtunkhwa for of the “recurrent and development budget” for erstwhile FATA.\nHe said that Rs 48 billion had further been earmarked by the federal government according to its share of the National Finance Commission Award and released to Khyber Pakhtunkhwa. The federal government also earmarked and released Rs 10 billion for the pervious Financial Year 2018-19 to the government of Khyber Pakhtunkhwa. He said that Rs 11 billion had been released for the temporarily dislocated persons of erstwhile FATA.\nHe said that the government of Khyber Pakhtunkhwa had also earmarked Rs 11 billion according to its calculated share in the NFC for the current financial year. He said that in addition to this, the federal government had approved Rs 1.1 billion of the federal budget for extending the Prime Minister’s National Health Program for poor families in erstwhile FATA.\nThe Minister said that Rs 1.63 billion has been provided to the government of Khyber Pakhtunkhwa in lieu of the stopped political expenditure in erstwhile FATA.\nWhile responding to a calling attention notice of MNA Muhammad Alamgir Khan, Shehryar Afridi said that the main aspect of the FATA reforms was the socio-economic development of the tribal region.\nHe said he would contact the provincial authorities for resolution of problems faced by the people of tribal areas.",
  "retrievedAt": "2025-08-11T18:33:34.286Z"
}
