{
  "title": "Mishal Malik terms 2019 most brutal, worst year for Kashmiris",
  "link": "https://www.app.com.pk/national/mishal-malik-terms-2019-most-brutal-worst-year-for-kashmiris/",
  "date_published": "2019-12-31T21:42:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 1 (APP):Mishal Malik, wife of Hurriyat leader Yasin Malik has termed 2019 the worst year for Kashmiris in the history where Kashmiris of Indian Occupied Kashmir were facing worst humanitarian crisis, strict countinues curfew along with all communication blackout and illegal arrests.\nIt is high time for the world powers to come forward and take appropriate measures to end Indian atrocities in occupied Kashmir, she said while talking to private news channel.\nAlmost all Hurriyat leaders including Syed Ali Gilani, Mirwaiz Umar Farooq, Muhammad Yasin Malik, Shabbir Ahmad Shah and Aasiya Andrabi remain in jails or under house arrest, she added.\nThe territory particularly the Kashmir valley and Muslim majority areas of Jammu region since then continue to remain under military siege and lockdown, which entered 151 days today.\nShe said New Delhi’s government was trying to change the demography of occupied Kashmir and added that India planned to build townships for hundreds of thousands of Hindus in the Muslim-majority territory.\nMishal Malik said Indian forces were committing grave human rights violations in the occupied valley, adding that all the Kashmiri leadership, including Yasin Malik, has been placed under house arrest.\nShe said Indian government kept Yasin Malik in death cell.\nShe added that the longest-ever curfew in the history of the world is continued in Indian occupied Jammu and Kashmir (IOJK) after illegal suspension of its special status by New Delhi authorities.\nShe said innocent people of occupied territory have no contact with the rest of the world as internet and phone lines are cut since then.\nPeople of Kashmir are eyeing upon world powers to take notice of Indian atrocities and pressurize India to reverse its decision of scraping special status of Jammu and Kashmir and make 2020 better for Kashmir, she added.\nShe said this harshest cold weather has also added to the difficulties of the besieged people as they couldn’t stock essential commodities for the winter season.",
  "retrievedAt": "2025-08-11T18:33:34.888Z"
}
