{
  "title": "Secretary Information highlights role of regional media",
  "link": "https://www.app.com.pk/national/secretary-information-highlights-role-of-regional-media/",
  "date_published": "2020-11-02T18:38:00.000Z",
  "source": "APP",
  "content": "LAHORE, Nov 02 (APP): Federal Secretary for Information and Broadcasting Akbar Hussain Durrani on Monday said that role of regional media was of paramount importance to highlight the regional and local issues.\nThe Ministry of Information and Broadcasting was putting efforts day and night to resolve the issues faced by the media, he said and added that newspaper could provide information to the people through factual and evidence based reporting.\nHe said that reform package was being introduced with the consultation of all stakeholders to resolve the longstanding issues of media.\nHe expressed these views during his visit to Press Information Department (PID) here regarding matters pertaining to regional media.\nThe Federal Secretary said the policies to bring digitalization were being adopted and implemented to further improve the performance of departments falling under Ministry of Information and Broadcasting, however, the private sector should also take such steps to improve their working.\nAkbar Hussain Durrani said that the measures taken by the Federal Information Department to bring reforms and betterment in its relevant bodies as per vision of Prime Minister Imran Khan and under the guidelines of Federal Minister for Information and Broadcasting Shibli Faraz were also being appreciated widely.\nThe Secretary said that successful implementation on print and electronic media policies had helped a lot in restoring the confidence of all other stakeholders.\nHe said that after December 2020, all the main offices of Federal Information Department would be converted to e-filing, adding that soon after the solution of issues faced by the media, the problems of media workers would also be redressed on priority.\nOn the occasion, PID Lahore Director General Saeed Ahmad Sheikh briefed the Federal Secretary about the issues/challenges faced by the media.\nThe Federal Secretary directed the officers to maintain strong working relations with print and electronic media representatives for resolving their issues with collaboration.",
  "retrievedAt": "2025-08-11T19:58:00.649Z"
}
