{
  "title": "Students welcome extension in closing date of Ehsaas Undergraduate Scholarship Program",
  "link": "https://www.app.com.pk/national/students-welcome-extension-in-closing-date-of-ehsaas-undergraduate-scholarship-program/",
  "date_published": "2020-11-02T11:34:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Nov 2 (APP): Students from across the country have welcomed the decision of the government of extending the last date for submitting applications under Ehsaas Undergraduate Scholarship for the year 2020-21 till November 30.\nThe previous last date announced for closing of applications was October 30 which was revised considering the COVID-19 fronted delays in the admission process at several public sector universities in the country.\nThe decision of date extension was taken to facilitate a maximum number of fresh undergraduate students, who were financially challenged, to apply for this scholarship opportunity.\nTalking to APP, Bilal Tariq, a student of COMSATS University Islamabad (CUI) said, “I wanted to complete my education in the field of Electrical Engineering but had to quit due to some financial issues.”\n“Extension in the closure of applications for this scholarship program has given me another opportunity to continue my education through availing this scholarship as earlier I was unable to apply due to the insufficient information”, he said.\nSuch initiatives serve as a ray of hope for the disadvantaged students who possess the talent and motivation but lack resources to move forward in their academic career, he said while urging the government to initiate such programs at all levels of education.\nIqra Aziz, a student of Quaid-i-Azam University (QAU) was of the view that she belonged to the far flung area of Balochistan and pursuing her education here in capital while her parents were hardly managing living expenses along with her educational expenditures.\nShe said this scholarship was not less than any blessing for me and my family. Extension in the last date of this program was direly needed and wished by a number of students who missed the chance to apply under the COVID-19 circumstances.\nIqra Aziz said that she has completed all her documents and will apply for the scholarship within few days.\nAccording to the official source, as many as 30,000 applications have been received in the system so far since the online application portal reopened on Sep 5, 2020.\nThe Ehsaas Undergraduate Scholarship is a flagship program of the present government with an objective to provide scholarships to financially challenged students for the duration of their studies.\nAround 125 public sector universities recognized by Higher Education Commission are part of this initiative.\nThe Ehsaas undergraduate Scholarships are targeted at students from low income families (less than Rs. 45,000 a month) and marginalized regions to assist them in their undergraduate studies. Eligible students can apply through an online portal:\nhttps://ehsaas.hec.gov.pk/.\nAs part of the program design, students of first and second semesters enrolled in 4-5 year undergraduate program of 125 public sector universities are eligible to submit applications for the academic year 2020-21 scholarships.\nHowever, scholarship recipients of other semesters who had secured Ehsaas scholarships in 2019-20 will continue receiving Ehsaas undergraduate scholarship throughout their undergraduate degree based on their satisfactory academic performance.\nFor the year 2019-20, scholarships worth Rs. 4.827 billion were awarded to 50,762 undergraduate students nationwide.\nUnder the program, every year, 50,000 students from low-income families will be awarded scholarships for 4 to 5-year undergraduate degree programs.\nOver four years, 200,000 undergraduate scholarships will be awarded the need and merit basis.\nThe geographical spread of the program spans across all four provinces, Azad Jammu and Kashmir and Gilgit Baltistan.\nThe Ehsaas scholarship aid covers the entire tuition fee along with a monthly stipend. All four to five-year undergraduate programs are covered under Ehsaas.\n50 percent of awardees are girls and 2 percent of awardees are differently-abled. The total budget over four years is Rs. 24 billion.",
  "retrievedAt": "2025-08-11T19:58:06.910Z"
}
