{
  "title": "200,000 applications received for online visas in one day: Interior Minister",
  "link": "https://www.app.com.pk/national/200000-applications-received-for-online-visas-in-one-day-interior-minister/",
  "date_published": "2021-01-02T09:34:00.000Z",
  "source": "APP",
  "content": "RAWALPINDI, Jan 02 (APP): Federal Minister for Interior, Sheikh Rashid Ahmed on Saturday said 200,000 online visa applications were received in one-day after the announcement of online visa facility for 192 countries amid Covid-19 pandemic.\nTalking to media persons at the National Database and Registration Authority (NADRA) office in Rawalpindi, he announced that strict action would be taken against those using derogatory remarks against state institutions and they would be prosecuted within 72 hours.\nThe case against Mufti Kifayatullah for anti-military remarks has been forwarded to Khyber-Pakhtunkhwa (K-P) government, he added.\nSheikh Rashid said Computerized National Identity Cards (CNIC) of 0.2 million illegal Afghan refugees have been blocked, while 1.5 million registered refugees were allowed to stay and 800,000 illegal Afghans were being considered.\nHe said 100,000 CNIC were being issued daily and those who applied for the first time would be issued in 15 days free of cost, adding that 50 NADRA centers were being providing services 24 hours a day.\nMoreover, Rashid informed that 300 NADRA mobile vans were visiting far-flung areas for issuing CNIC to facilitate masses at their door step.\nThe Minister said, “Eagle Squad, equipped with the latest technology, will soon be introduced for the security of Islamabad.”\nHe added that he has summoned a session of all Inspector Generals (IGs) of police on Monday to discuss strategy for better law and order situation.\nSheikh said the dream of opposition leaders to disturb routine life of federal capital would not come true.\nThe interior minister said Prime Minister Imran Khan would never allow National Reconciliation Ordinance to opposition, adding, no compromise on their corruption cases.\nReplying to a query, the Minister said that the resignations of party members of Pakistan Democratic Movement were in lockers now.\nThey would neither boycott by-elections nor Senate polls, however, they could organize a long march and government was working on the strategy to deal them, he said.\nFurthermore, he said passport of Nawaz Sharif would be expired on February 16, and it would not be renewed.",
  "retrievedAt": "2025-08-11T20:12:36.304Z"
}
