{
  "title": "National COVID positivity surges at 5.81 percent; 2,264 patients critical",
  "link": "https://www.app.com.pk/national/national-covid-positivity-surges-at-5-81-percent-2264-patients-critical/",
  "date_published": "2021-01-02T11:29:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 02 (APP): The National COVID Positivity Ratio on Saturday was recorded 5.81 percent where 2,264 Coronavirus patients were in critical condition across the country with the number of critical patients rising at a fast pace.\nThe positivity ratio was determined on the basis of positive cases appearing in 100 samples of COVID patients.\nThe highest positivity ratio was observed in Karachi which was 15.77 percent followed by Peshawar 15.54 percent and Mirpur 9.26 percent, according to the latest update issued by the National Command and Operation Center (NCOC).\nThe positivity ratio in various federating units was as in Azad Jammu and Kashmir (AJK) was 8.52 percent, Balochistan 3.82 percent, Gilgit Baltistan (GB) 1.41 percent, Islamabad Capital Territory (ICT) 3.39 percent, Khyber Pakhtunkhwa (KP) 5.38 percent, Punjab 4.7 percent and Sindh had 8.1 percent positivity ratio.\nIt also mentioned the Province wise COVID Positivity Ratio breakdown that indicated in Punjab, Lahore had maximum positivity ratio of 8.1 percent, Rawalpindi had 3.45 percent, Faisalabad 2.3 percent and Multan 0.96 percent and Gujranwala had 3.17.\nIn Sindh, Karachi had 15.77 percent, Hyderabad 7.54 percent, in KP, Peshawarhad 15.54 percent, Swat 2.84 and Abbotabad 7.72 percent, in Baluchistan, Quetta had 2.39 percent, in ICT 3.39 percent positivity ratio was prevailing. In AJK, Mirpur had 9.26 percent and Muzaffarabad had 7.69 positivity ratio.\nThe update also showed Mortality Analysis during the prevailing pandemic outbreak as a total of 10,258 deaths were recorded with prevailing Fatality Rate of 2.12 percent against the global death rate of 2.18 percent.\nIt added that as per the gender analysis of the deceased around 69 percent were males with 77.5 percent over the age of 50-year.\nAs many as 73 percent of the perished COVID-19 patients had chronic comorbidities (affected with another disease prior to contracting Coronavirus).\nOut of the total died COVID patients 91 percent of the deceased remained hospitalised, it added.",
  "retrievedAt": "2025-08-11T20:12:33.506Z"
}
