{
  "title": "791 parliamentarians submit assets’ statements so far: ECP",
  "link": "https://www.app.com.pk/national/791-parliamentarians-submit-assets-statements-so-far-ecp/",
  "date_published": "2021-01-02T10:45:00.000Z",
  "source": "APP",
  "content": "ISLAMABAD, Jan 2 (APP): The Election Commission of Pakistan (ECP) has said that so far 791 parliamentarians have submitted their yearly statements of assets and liabilities for financial year 2019-20.\nAccording to an official of ECP, as many as 394 parliamentarians could not submit their assets details out of total 1195 parliamentarians while 10 seats are still vacant.\nHe said that those who submitted their assets details included 89 senators, 228 members National Assembly, 225 members Punjab Assembly, 117 members Sindh Assembly, 94 members Khyber Pakhtunkhwa Assembly and 38 members Balochistan Assembly.\nHe added that those who failed to submit their assets details within due date included 14 senators, 112 members National Assembly, 144 members Punjab Assembly, 48 members Sindh Assembly, 50 members Khyber Pakhtunkhwa Assembly and 26 members Balochistan Assembly.\nUnder Section 137 of the Elections Act, 2017 every member of an assembly and Senate have to submit to the Commission, on or before December 31st each year, a copy of statement of assets and liabilities including assets and liabilities of his spouse and dependent children as on the preceding of June 30 on Form B.\nThe commission, on the first day of January each year through a press release, publishes the names of members who failed to submit the requisite statement of assets and liabilities within the period specified under sub-section (1).\nHe said that the Commission will, on the January 16, by an order suspend the membership of a member of an assembly and Senate who failed to submit the statement of assets and liabilities by the January 15, and such member would cease to function till he or she would file the statement of assets and liabilities.\nHe said if any member submitted the statement of assets and liabilities under this section which was found to be false in material particulars, he or she may within 120 days from the date of submission of the statement, be proceeded against for committing the offence of corrupt practice.",
  "retrievedAt": "2025-08-11T20:12:33.268Z"
}
