{
  "title": "ECC approves funding plan for smooth closure of Utility Stores Corporation - Pakistan - DAWN.COM",
  "author": null,
  "content": "The Economic Coordination Committee (ECC) of the cabinet approved a technical supplementary grant of Rs30.216 billion on Thursday to ensure the smooth closure of the Utility Stores Corporation (USC) of Pakistan.\n\nEstablished in 1971, USC was a state-owned enterprise tasked with supplying essential commodities at subsidised rates, primarily targeting low-income households, and operated over 4,000 retail outlets nationwide. It formally ceased operations at the end of July.\n\nA press release by the government’s finance division today said that the grant represented a “major step in responsibly addressing the longstanding financial burden of USC on the national exchequer”, adding that it also safeguarded the interests of employees affected by the closure.\n\n“By approving severance, compensation and payment of outstanding dues, the government is ensuring that workers receive their entitlements, thereby cushioning the social and economic impact of USC’s winding up,” the press release said.\n\nThe committee was chaired by the finance minister, Senator Muhammad Aurangzeb.\n\nAlso in attendance were Food Security Minister Rana Tanveer Hussain, Commerce Minister Jam Kamal Khan, Power Minister Sardar Awais Ahmad Khan Leghari in virtual attendance, and the special assistant to the Prime Minister for industries and production, Haroon Akhtar Khan, as well as federal secretaries and senior officials from concerned ministries, departments and regulatory institutions.\n\nAccording to the release, the ECC decided that the Ministry of Industries and Production would further rationalise the financial requirements for the closure of USC.\n\n“It was further decided that the assets of USC, including properties, shall be disposed of within the current financial year so that the costs of closure are partially met through sale proceeds,” it added.\n\nThe cabinet body also underlined the importance of carrying out the closure in an “orderly and transparent manner”, including partially meeting liabilities via the disposal of USC properties.\n\n“The approved financial package underscores the government’s commitment to protecting employees’ welfare while ensuring fiscal discipline in the winding down of USC’s operations,” it said.\n\nEarlier this week, the National Assembly Standing Committee on Privatisation was informed that the government would ensure the payment of Rs27 billion in dues to USC’s employees and vendors in two phases following its closure, which put 11,000 jobs on the line.\n\nLast week, the Public Accounts Committee urged the government to strengthen the management and controls of USC instead of shutting it down, warning that such a move would render thousands jobless.",
  "tags": [],
  "categories": [],
  "image": "https://i.dawn.com/primary/2025/08/28152724b10634a.webp",
  "retrievedAt": "2025-09-06T09:50:18.066Z",
  "source": "Dawn",
  "link": "https://www.dawn.com/news/1937900/ecc-approves-funding-plan-for-smooth-closure-of-utility-stores-corporation",
  "dateList": "2025-08-28",
  "date_published": "2025-08-28T12:39:45.000Z"
}
